[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvbWVnYXBob25lLXBhdHRlcm4tZ292ZXJucy10aGUtZXRoZXJldW1zLW9uZ29pbmctcHJpY2UtYWN0aW9uLWlzLTIwMDAtaW4tcmVhY2gv0gFvaHR0cHM6Ly9jb2luZ2FwZS5jb20vbWFya2V0cy9tZWdhcGhvbmUtcGF0dGVybi1nb3Zlcm5zLXRoZS1ldGhlcmV1bXMtb25nb2luZy1wcmljZS1hY3Rpb24taXMtMjAwMC1pbi1yZWFjaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Feb 2023 08:00:00 GMT",
        "title": "Megaphone Pattern Governs The Ethereum’s Ongoing Price Action; Is $2000 In Reach? - CoinGape",
        "content": "The formation of a megaphone pattern in the daily time frame chart shows the Ethereum price is in a state of high volatility and uncertainty among the market participants. Furthermore, the ETH price’s recent reversal from the rising trendline triggered a near-bear cycle /correction phase, which could tumble its price below the $1500 support. Here’s how you may trade this pattern.\n\nKey Points:\n\nA megaphone pattern prolongs a sideways trend in Ethereum price.\n\nUnder the influence of the Megaphone pattern, the Eth price could witness a 9-10 % downfall.\n\nThe intraday trading volume in Ether is $5.4 billion, indicating a 10% loss.\n\nSource- Tradingview\n\nadvertisement\n\nAmid the increasing bearishness in the crypto market, the Ethereum price lost 6.75% in six days and tumbled to the current price of $1605. This ongoing bear cycle within the megaphone pattern is likely to cause a downfall below the $1500 support to reach the lower support trendline.\n\nHowever, the lower price rejection candles showcased in the recent price drop indicate that buyers are trying to reclaim the trend control. Thus, if the selling pressure in the market persists, the coin price will rise slightly higher to retest the 20-day EMA or $1660 before continuing the ongoing correction phase.\n\nAlso Read: What Do You Need To Know About Top NFT Discord Servers?\n\nHowever, for the Ethereum price to escape a sideways trend, it must breach the trendlines of the megaphone pattern.\n\nAs the prior trend before the ongoing consolidation was bullish, the Ethereum price is more likely to break the overhead trendline and resume that rally.\n\nThis potential breakout may push the coin price to the $2000 mark.\n\nTechnical Indicator\n\nBollinger Band: The falling Ethereum price plunged below the indicator’s midline, reflecting an additional confirmation for potential downfall.\n\nMACD: a slow but gradual spread between the MACD(Blue) and the signal(orange) line indicates the increasing bearish momentum in the market.\n\nEthereum Coin Price Intraday Levels-\n\nSpot rate: $1600\n\nTrend: Slightly Bullish\n\nVolatility: High\n\nResistance level- $1680 and $1788\n\nSupport level- $1500 and $1420"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRkYW8tcy1tYW50bGUtY29yZS1wcm9wb3Nlcy0yMDBtLWZvci13ZWIzLWZ1bmTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Feb 2023 08:00:00 GMT",
        "title": "BitDAO's Mantle Core team proposes $200M for Web3 fund - Cointelegraph",
        "content": "A proposal seeking to create a $200 million fund dedicated to early-stage Web3 startups was submitted on Feb. 26 by Mantle Core team on BitDAO’s governance forum. The ecosystem fund aims to boost the adoption of Mantle’s network among developers and Dapps.\n\nMantle is an Ethereum layer-2 network developed by the BitDAO ecosystem. According to the proposal, a capital pool of $200 million would be deployed within the Mantle ecosystem over the next three years. BitDAO’s treasury would provide $100 million in USD Coin (USDC), while another $100 million would be supplied by external matching capital from “strategic venture partners.”\n\nFunds that have expressed interest in participating include Dragonfly Capital, Pantera, Folius Ventures, Play Ventures Future Fund, Spartan, Lemniscap, Selini Capital, Cadenza Ventures and QCP Capital, according to Mantle’s proposal.\n\n[DISCUSSION] Mantle EcoFund@0xMantle has posted a discussion proposing:\n\n\n\n✅ Authorization to establish Mantle EcoFund 1 of a capital pool of $200M (catalyzed with a target size of $100M from BitDAO).\n\n\n\n✅ Authorization of first capital call: $10M USDC from the #BitDAO Treasury. — BitDAO (@BitDAO_Official) February 26, 2023\n\nIf approved, the Mantle EcoFund and venture partners will participate in projects with 1:1 co-investment ratio. Web3 startups raising pre-seed, seed, and series A round will be targeted by the ecosystem fund.\n\nThe fund is proposed to have a three-year active investment period, plus two years of optional extension, a Mantle spokesperson told Cointelegraph by email. The initial fund operator is proposed to be Mirana Ventures, Bybit and BitDAO’s venture partner, with an investment committee comprising representatives from Mirana Ventures, Mantle, BitDAO and Bybit.\n\n“The fund targets to invest in more than 100 projects deployed on Mantle and have a multiple on invested capital (MOIC) of 1.5x of cumulative performance through the fund’s lifecycle,” Mantle’s spokesperson said.\n\nEcoFund proposal summary from Mantle Core. Source: BitDAO’s governance forum.\n\nManagement fees would be “industry standard,” with a 2% fee to support operational expenses of the EcoFund team, including sourcing, due diligence, legal, portfolio support and fund administration.\n\nAcross the crypto industry, similar initiatives aim to drive adoption and innovation. Last year, Ethereum scaling solution Polygon launched a $100 million fund aimed at improving access to decentralized finance, onboarding users and accelerating adoption."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYm9sZC5jb20vMzktb2YtZXRoZXJldW0tc3VwcGx5LWlzLWhlbGQtYnktd2hhbGVzLWNvbXBhcmVkLXRvLWJpdGNvaW5zLTExL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Feb 2023 08:00:00 GMT",
        "title": "39% of Ethereum supply is held by whales compared to Bitcoin's 11% - Finbold - Finance in Bold",
        "content": "In the world of cryptocurrency, Bitcoin (BTC) and Ethereum (ETH) remain the largest digital assets based on market capitalization and are known to dictate the trajectory of the entire market. However, the distribution of these cryptocurrencies is vastly different, with Ethereum having a significantly higher percentage of its supply held by whales compared to Bitcoin.\n\nIn particular, as of February 26, 2023, around 39% of the total supply of Ethereum is concentrated among large addresses, data by crypto market intelligence platform IntoTheBlock\n\nEthereum concentration by large holders. Source: IntoTheBlock\n\nThis is in stark contrast to Bitcoin, where large addresses hold only 11% of the total supply.\n\nBitcoin concentration by large holders. Source: IntoTheBlock\n\nIndeed, contraction by holders metric aggregates the share of circulating supply held by whale addresses, accounting for over 1% of the supply and investors or addresses holding between 0.1%-1%. The combination of the two metrics equates to the total concentration by large holders.\n\nEthereum’s onchain activity\n\nEthereum’s large address concentration coincides with the network’s increased development activity. The staking feature remains the main highlight for the decentralized finance ecosystem following the historical Merge upgrade.\n\nAfter months of testing, investors are set to start withdrawing their staked ETH in March after the Shanghai upgrade goes live.\n\nAlthough the high concentration of Ethereum whales has different implications, it could hint at the investors’ future price outlook for the asset. It is worth noting that as Ethereum undergoes significant developments, proponents still bet the asset might flip Bitcoin.\n\nAt the same time, it can be argued that Ethereum is relatively cheap compared to Bitcoin, making it affordable to amass in large amounts.\n\nImplication of whale addresses\n\nThe concentration of crypto wealth in the hands of a few large holders is a controversial topic in digital asset circles. Some argue that it is a natural outcome of the market and that wealthy individuals should be allowed to hold large amounts of digital assets.\n\nOthers, however, argue that this concentration of wealth goes against the decentralized ethos of cryptocurrency and could lead to market manipulation.\n\nRegardless of varied opinions on the matter, the fact remains that Ethereum’s supply is significantly more concentrated in the hands of a few large holders compared to Bitcoin. This could have important implications for the future of the Ethereum ecosystem and its price.\n\nBy press time, Ethereum was trading at $1,645 with daily gains of over 4%, while Bitcoin is trading at $23,657.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpZy1leWVzLWNvaW4tY291bGQtbWFrZS15b3UtYS1taWxsaW9uYWlyZS1qdXN0LWxpa2UtYml0Y29pbi1hbmQtZXRoZXJldW0tZGlkLXNvbWUteWVhcnMtYWdvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Feb 2023 08:00:00 GMT",
        "title": "Big Eyes Coin Could Make You A Millionaire, Just Like Bitcoin And Ethereum Did Some Years Ago - Analytics Insight",
        "content": "If you had invested in Bitcoin (BTC) when it launched in 2009, your returns could be in the millions or billions even though your initial capital was $0 because that was the cost of the coin at the time. If you got in a bit later, like when it was 10 cents in late 2010, and invested only $10, you would have been able to buy about 100 bitcoins.\n\nEven at its current low, those 100 bitcoins would be worth more than $2.4 million. Imagine if you had bought more back then.\n\nWe can do a similar calculation with Ethereum (ETH). When it launched in 2015, it first traded at $2.77 but quickly fell in value to $0.81 within 24 hours. Let’s play the “imagine” game again.\n\nSo, if you had spent a mere $100 on day one, you’d have about 36 ETH tokens, or if you bought on day two, you’d have about 123 tokens. At this moment, ETH is valued at $1664.8 per token. Do the math.\n\nWhile the possibility of repeating the success of Bitcoin millionaires is slim, it is not impossible if investors get in early with their investments. Hence, Big Eyes Coin is attracting a lot of interest from smart investors who see the potential for another millionaire-making move.\n\nBig Eyes is already worth over 390%\n\nWe have seen time and again that the earlier investors buy into a cryptocurrency, the greater the profit. For most coins, there is no earlier entry point than their presale journey.\n\nRight now, Big Eyes is making huge waves as a result of how successful its presale has been, which is an indicator of how well the coin can potentially perform when it is launched to the public.\n\nFor a cat-themed meme, BIG has managed to raise $30 million in its 12th stage of the presale and can be bought for a tiny amount of $0.00049. That is still a 390 percent increase from its price of $0.0001 at the first stage. This means that those who bought it at stage 1 will profit by more than 390% of those who buy at stage 12.\n\nThere is still time to take advantage of the opportunity that BIG presents, and getting in now will still be a huge advantage for investors seeing that the presale is typically the lowest amount any coin would be bought for.\n\nBitcoin – From Zero to thousands\n\nSince its launch in January 2009, the price of bitcoin has been on a roller coaster, but the long-term trajectory has been “up and to the right,” as they say. The advent of Bitcoin marked the beginning of the cryptocurrency era, but it took some time before the general public became aware of it.\n\nNonetheless, it appears that cryptocurrency, particularly Bitcoin, has emerged as the most intriguing trading opportunity in more than a decade.\n\nThe coin’s value has risen from $0 to $0.40, then to $1 after a few months, and then in 2011, it went to $8 before reaching $30 in the same year. At the time, this was exciting for investors, but even the most optimistic investor had no clue just how big things were going to get. Through a few ups and downs, in April 2013, the coin surpassed $100, and barely eight days later, it was trading at $230.\n\nOver the next few years, BTC flirted with different figures, and by December 2020, BTC was closing the year at $28,949. 2021 was probably the most successful year for Bitcoin investors as the coin rose to an all-time high of $68,789 before the great crash that saw the coin lose value and end at its current price.\n\nEthereum – another crypto fairytale\n\nAfter Bitcoin, Ethereum (ETH) is the second-largest cryptocurrency in the world. It was introduced in July 2015 and went on sale for $2.77 on August 7. The coin was worth $0.81 the following day. The price stayed below $1 until January 2016.\n\nRemember that the past few years have seen a tremendous increase in the price of digital currencies. In 2021, between January and April, the price of Ethereum increased by about 300%, and the coin surpassed $3000. Yet, even without that jump, you would still be doing well if you had purchased Ethereum at $2.77.\n\nBig Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpZy1leWVzLWNvaW4tY291bGQtbWFrZS15b3UtYS1taWxsaW9uYWlyZS1qdXN0LWxpa2UtYml0Y29pbi1hbmQtZXRoZXJldW0tZGlkLXNvbWUteWVhcnMtYWdvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Feb 2023 08:00:00 GMT",
        "title": "Big Eyes Coin Could Make You A Millionaire, Just Like Bitcoin And Ethereum Did Some Years Ago - Analytics Insight",
        "content": "If you had invested in Bitcoin (BTC) when it launched in 2009, your returns could be in the millions or billions even though your initial capital was $0 because that was the cost of the coin at the time. If you got in a bit later, like when it was 10 cents in late 2010, and invested only $10, you would have been able to buy about 100 bitcoins.\n\nEven at its current low, those 100 bitcoins would be worth more than $2.4 million. Imagine if you had bought more back then.\n\nWe can do a similar calculation with Ethereum (ETH). When it launched in 2015, it first traded at $2.77 but quickly fell in value to $0.81 within 24 hours. Let’s play the “imagine” game again.\n\nSo, if you had spent a mere $100 on day one, you’d have about 36 ETH tokens, or if you bought on day two, you’d have about 123 tokens. At this moment, ETH is valued at $1664.8 per token. Do the math.\n\nWhile the possibility of repeating the success of Bitcoin millionaires is slim, it is not impossible if investors get in early with their investments. Hence, Big Eyes Coin is attracting a lot of interest from smart investors who see the potential for another millionaire-making move.\n\nBig Eyes is already worth over 390%\n\nWe have seen time and again that the earlier investors buy into a cryptocurrency, the greater the profit. For most coins, there is no earlier entry point than their presale journey.\n\nRight now, Big Eyes is making huge waves as a result of how successful its presale has been, which is an indicator of how well the coin can potentially perform when it is launched to the public.\n\nFor a cat-themed meme, BIG has managed to raise $30 million in its 12th stage of the presale and can be bought for a tiny amount of $0.00049. That is still a 390 percent increase from its price of $0.0001 at the first stage. This means that those who bought it at stage 1 will profit by more than 390% of those who buy at stage 12.\n\nThere is still time to take advantage of the opportunity that BIG presents, and getting in now will still be a huge advantage for investors seeing that the presale is typically the lowest amount any coin would be bought for.\n\nBitcoin – From Zero to thousands\n\nSince its launch in January 2009, the price of bitcoin has been on a roller coaster, but the long-term trajectory has been “up and to the right,” as they say. The advent of Bitcoin marked the beginning of the cryptocurrency era, but it took some time before the general public became aware of it.\n\nNonetheless, it appears that cryptocurrency, particularly Bitcoin, has emerged as the most intriguing trading opportunity in more than a decade.\n\nThe coin’s value has risen from $0 to $0.40, then to $1 after a few months, and then in 2011, it went to $8 before reaching $30 in the same year. At the time, this was exciting for investors, but even the most optimistic investor had no clue just how big things were going to get. Through a few ups and downs, in April 2013, the coin surpassed $100, and barely eight days later, it was trading at $230.\n\nOver the next few years, BTC flirted with different figures, and by December 2020, BTC was closing the year at $28,949. 2021 was probably the most successful year for Bitcoin investors as the coin rose to an all-time high of $68,789 before the great crash that saw the coin lose value and end at its current price.\n\nEthereum – another crypto fairytale\n\nAfter Bitcoin, Ethereum (ETH) is the second-largest cryptocurrency in the world. It was introduced in July 2015 and went on sale for $2.77 on August 7. The coin was worth $0.81 the following day. The price stayed below $1 until January 2016.\n\nRemember that the past few years have seen a tremendous increase in the price of digital currencies. In 2021, between January and April, the price of Ethereum increased by about 300%, and the coin surpassed $3000. Yet, even without that jump, you would still be doing well if you had purchased Ethereum at $2.77.\n\nBig Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    }
]