[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMy8yOC91cy1jZnRjLWNoaWVmLWJlaG5hbS1yZWluZm9yY2VzLXZpZXctb2YtZXRoZXItYXMtY29tbW9kaXR5L9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMy8yOC91cy1jZnRjLWNoaWVmLWJlaG5hbS1yZWluZm9yY2VzLXZpZXctb2YtZXRoZXItYXMtY29tbW9kaXR5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "U.S. CFTC Chief Behnam Reinforces View of Ether as Commodity - CoinDesk",
        "content": "\"It should be absolutely a concern,” he said. “Europe has put in place a pretty comprehensive regime that's going to be implemented over the next couple of years,\" he said, adding that the U.S. needs to \"move the ball forward.\""
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMjgvZXRoZXJldW0tc3Rha2luZy1wcm92aWRlci1saWRvLXRvLWluY29ycG9yYXRlLW5mdHMtaW50by11bnN0YWtpbmctcHJvY2Vzcy_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAzLzI4L2V0aGVyZXVtLXN0YWtpbmctcHJvdmlkZXItbGlkby10by1pbmNvcnBvcmF0ZS1uZnRzLWludG8tdW5zdGFraW5nLXByb2Nlc3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Staking Provider Lido to Incorporate NFTs Into Unstaking Process - CoinDesk",
        "content": "Ether withdrawals on Lido, where users can unstake their stETH and receive ETH at a 1:1 ratio, will have two steps: request and claim, according to Mariya Muzyko, product manager at Lido, during the call Tuesday afternoon. Once a user requests a withdrawal, they will receive a Lido-issued NFT representing their withdrawal request. The user can then use the NFT to claim their ETH rewards. The NFT is burned after the user redeems and claims their ETH."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjgtbWFyY2gtMjAyMi9hcnRpY2xlc2hvdy85OTA1NzE0My5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTI4LW1hcmNoLTIwMjIvYW1wX2FydGljbGVzaG93Lzk5MDU3MTQzLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $27,000; BNB, Litecoin down 5% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading in the red on Tuesday. Bitcoin (BTC) fell 2.66% to $27,048, whereas Ethereum (ETH) was below the $1,750 level.BTC volume in the last 24 hours stood at approximately $18.55 billion, rising 26.88%.\"The crypto market is feeling the pressure of CFTC action against Binance as BTC price has slipped around the $27,000 level which is a drop of nearly 3% in the last 24 hours. We can expect the market to remain choppy in the coming weeks owing to the latest developments,\" Shivam Thakral, CEO of BuyUcoin, said.Other top crypto tokens were also trading lower. BNB declined over 5%. Dogecoin , Polygon and Litecoin were also trading with cuts. The global cryptocurrency market cap was trading lower around $1.13 trillion, falling 1.96% in the last 24 hours.However, Ripple (XRP) surged over 7%. \"The silver lining last week came from the Ripple v/s SEC case, where Ripple proponents are showing confidence that XRP will not be declared a security by the courts. This resulted in a ~21% rally in XRP prices over the week,\" Parth Chaturvedi, Crypto Ecosystem Lead at CoinSwitch, said.The total volume in DeFi is currently 3.82 billion, 8.80% of the total crypto market 24-hour volume. The volume of all stablecoins is now $39.06 billion, which is 90.05% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $523.24 billion. Bitcoin’s dominance stood at 46.10%, a fall of 0.32% over the day, according to CoinMarketCap.\"Bitcoin is currently trading at around $27,000 and there is a possibility that it could drop as low as $25,200. If this happens, there could be a further drop to $22,609, and if this level is broken, it could send Bitcoin back below $20,000. However, if the bulls remain strong, a move up to $30,000 is also expected,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.29 hours, IST on March 28, 2023)Bitcoin $27,048 -2.66%Ethereum $1,732 -1.26%Tether $0.9998 -0.04%BNB $310.74 -5.08%XRP $0.489 7.27%Cardano $0.3515 0.65%Polygon $1.05 -2.65%Dogecoin $0.0729 -0.75%Solana $20.03 -2.65%Polkadot $5.90 -1.19%Tron $0.06408 0.15%Shiba Inu $0.00001039 -1.17%Litcoin $87.52 -4.36%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tcGlubmVkLWJlbG93LTIwMDAtZGVzcGl0ZS1uZXR3b3JrLWJ1cm5pbmctb3Zlci0zLW1pbGxpb24tZXRoL9IBcGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vZXRoZXJldW0tcGlubmVkLWJlbG93LTIwMDAtZGVzcGl0ZS1uZXR3b3JrLWJ1cm5pbmctb3Zlci0zLW1pbGxpb24tZXRoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Pinned Below $2,000 Despite Network Burning Over 3 Million ETH - NewsBTC",
        "content": "Ethereum prices remain below $2,000 months after the network initiated EIP-1559, trackers on March 28 reveal.\n\nEthereum Prices Trending Below $2,000\n\nETH, the native currency of Ethereum, is currently trading at $1,717, stable on the last day and week but retracing from recent highs of around $1,850.\n\nThe network has burnt over 3 million ETH from gas fees since the activation of Ethereum Improvement Proposal (EIP) 1559 in August 2021, a move that gradually makes the coin deflationary. However, despite this, the coin has been unable to break above $2,000 since May 2022.\n\nEIP-1559 was an intervention by the developer community to reduce the supply of ETH and it was a new way for Ethereum to calculate process transaction fees, effectively adjusting the fee market and making gas more predictable. Earlier, Ethereum used an auction system where miners prioritized transactions tagged with high fees.\n\nIn EIP-1559, the team agreed to introduce a base fee and a “tip” for every gas fee paid in a transaction. The base fee is what everyone transacting on Ethereum must pay. Notably, this fee will be adjustable depending on network demand and would be burned.\n\nAt the same time, the transactor would give a “tip” to the block validator as an incentive to include their transaction in a block. This fee is optional, and only those who want their transactions to be included in blocks faster can pay.\n\nEthereum Price On March 28 | Source: ETHUSDT On Binance, TradingView\n\nOver 3 Million ETH Burned Since August 2021\n\nFrom August 2021, when Ethereum introduced EIP-1559, the network has burned over 3 million ETH. At the same time, over 69,450 ETH has been destroyed since the Merge, when Ethereum officially transited to a proof of stake system, switching off miners.\n\nConsidering the current pace of ETH burning, the coin has been deflationary by 0.1% annually. Proponents are bullish that ETH will never be inflationary again, a move that could push prices even higher in the months and years ahead.\n\nThe pace of ETH burning depends on network activity. Over the months, especially during the 2022 bear run, ETH and token prices crashed, as DeFi and NFT activities also fell. The total value locked (TVL) in DeFi remains less than half the peaks of 2021, while NFT trading is subdued even with the recovery of asset prices in Q1 2023.\n\nTrackers on March 28 indicate that ETH transfers contribute to the bulk of coins destroyed since EIP-1559. From August 2021, users transferring ETH between addresses have contributed to 266,217.50 ETH being destroyed.\n\nMeanwhile, because of NFTs, primarily through OpenSea, 230,050 ETH have been burned, with 152,369 ETH destroyed from Uniswap’s trading activities.\n\nFeature Image From Canva, Chart From TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmNjbi5jb20vZXRoZXJldW0tY28tZm91bmRlci1oYXMtYmlnZ2VzdC1zdGFrZS1pbi12ZWNoYWluLWFuZC1xdHVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Co-Founder Has 'Biggest Stake' in VeChain and Qtum - CCN.com",
        "content": "Anthony Di Iorio, the billionaire co-founder of $50 billion blockchain network Ethereum and cryptocurrency wallet Jaxx, said that Chinese blockchain projects such as Qtum and VeChain will succeed.\n\n“The biggest stake for me is in Qtum and VeChain right now, the two Chinese projects. There’s much more opportunity in newer ones if you can identify them,” Iorio said.\n\nChina’s Poor Cryptocurrency Trading Regulations Don’t Matter\n\nVeChain, the Ethereum-based Internet of Things blockchain protocol in China, has attracted well-respected developers, venture capital firms, and large-scale institutions throughout the past six months.\n\nMost recently, the VeChain team disclosed that PwC, one of the Big Four auditors, have acquired a stake in the project, and announced a partnership with multi-billion dollar logistics giant DB Schenker to use the blockchain in processing sensitive information.\n\n“By collaborating with third-party logistics providers in China, DB Schenker can offer extensive and seamless logistics solutions across China for any industry and trade. However, the immense potential of such a comprehensive logistics network is challenged by the complexity of measuring the performance and service quality of their business partners,” the VeChain foundation said.\n\nBuilding blockchain protocols in itself is difficult and technologically challenging, as blockchain building essentially is solving unprecedented cryptographic problems with dire consequences. A simple error in a smart contract could result in large-scale security breaches and loss of funds.\n\nBuilding a blockchain protocol and convincing conglomerates, institutions, and businesses to utilize it to secure data rather than more efficient database technologies is even more difficult, because developers need to convince businesses to overcome the trade-off between decentralization and flexibility to use blockchain technology in the right way.\n\nThe blockchain is not database technology; it cannot process an unlimited number of transactions and information, and in its current form, it can barely process hundreds of transactions per second. Ethereum creator Vitalik Buterin emphasized that it is possible to reach a million transactions per second on the Ethereum blockchain with Sharding and Plasma enabled, but the industry is still several years behind.\n\nAs such, for blockchain projects, it is of utmost importance to secure partners like VeChain’s partnership with PwC and DB Schenker to build, solve, and investigate together on various methods that could be utilized to commercialize the blockchain at a large scale.\n\nIorio said that investors should also look for emerging projects that are capable of leading wide adoption of the blockchain, similar to the works of Qtum and VeChain, both of which are based in China.\n\nIn September 2017, the Chinese authorities effectively banned cryptocurrency trading but has not banned cryptocurrency businesses and blockchain projects. In fact, the latest multi-billion dollar funding of blockchain startups by the Chinese government reaffirmed its support for blockchain technology.\n\nGood to Get Reaffirmation That Ethereum is Not a Security\n\nDuring an interview with Bloomberg, Iorio added that while the creators of Ethereum including himself, Buterin, and Charles Hoskinson were comfortable with the regulatory nature of Ethereum and its non-security characteristics, it was “great” to get reaffirmation from the US government that it is not a security.\n\nIf the US SEC had categorized Ethereum as a security, it would have had shut down the entire industry in the US in an instant, forcing companies to move out of the country. The SEC’s clear statement that Ethereum is not a security demonstrated the intent of the agency to see continuous development in the blockchain sector."
    }
]