[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vY29pbnBlZGlhLm9yZy9wcmljZS1hbmFseXNpcy9ldGhlcmV1bS1wcmljZS1hbmFseXNpcy13aXRoLWV0aC1wcmljZS1zdHJ1Z2dsaW5nLWFib3ZlLTE4MDAtd2hhdHMtbmV4dC0xNjAwLW9yLTIwMDAv0gF-aHR0cHM6Ly9jb2lucGVkaWEub3JnL3ByaWNlLWFuYWx5c2lzL2V0aGVyZXVtLXByaWNlLWFuYWx5c2lzLXdpdGgtZXRoLXByaWNlLXN0cnVnZ2xpbmctYWJvdmUtMTgwMC13aGF0cy1uZXh0LTE2MDAtb3ItMjAwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Price Analysis: With ETH Price Struggling Above $1800, What’s Next? $1600 or $2000? - Coinpedia Fintech News",
        "content": "Qadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nThe biggest altcoin, Ethereum, displayed a range-bound price action between $1849 and $1887 for almost a week. However, the recent 1.79% fall in Ethereum prices forms a bearish candle breaking the bottom support to exceed the $1849 mark.\n\nCurrently, the Ethereum price trades at $1833 below the 50-day EMA, with an intraday fall of 0.28%. The bearish range breakout intensifies the dark cloud over Ethereum prices, projecting a potential drop in market value to $1800.\n\nTrading View\n\nWith a closing price of $1820, Ethereum was at its lowest closing level in 36 days. This brings the biggest altcoin closer to a long-term support trendline forming since December 2022. The ascending support trendline has helped ETH prices bounce back five times since December 2022.\n\nThe RSI indicator projects a high possibility of a bullish divergence forming at the coming retracement to the trendline. Meanwhile, the 200-day EMA follows a sideways track and stays close to $1800, ready to provide a cushion.\n\nIn case of a bullish reversal, the Ethereum prices can reclaim the 50-day EMA and challenge the $2000 resistance level before reaching the $2150 mark.\n\nHowever, a prolonged downtrend can challenge the bullish dominance of the $1800 mark."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3dvcmxkLW1vYmlsZS1sYXVuY2hlcy1ldGhlcmV1bS1hbmQtYm5iLWNoYWluLWJyaWRnZXMtc3RyZW5ndGhlbmluZy1tdWx0aWNoYWluLXN0cmF0ZWd5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "World Mobile launches Ethereum and BNB Chain bridges, strengthening multichain strategy - CryptoSlate",
        "content": "World Mobile (WMT), a global mobile network based on blockchain, has launched dedicated cross-chain bridges for Ethereum (ETH) and BNB Chain networks.\n\nAccording to an Aug. 3 statement, the newly launched cross-chain bridges align with World Mobile’s multichain strategy of exposing the crypto community to its growing ecosystem, as the bridges would allow users to seamlessly move their WMT tokens between Cardano (ADA) and the other blockchain networks.\n\nSpeed and scalability\n\nWorld Mobile underscored the importance of the scalability and speed offered by both networks, which were key factors in their inclusion.\n\nBy incorporating these networks into its operations, World Mobile aims to realize its vision of connecting global communities and fostering a more inclusive mobile ecosystem.\n\nZachary Vann, the Head of Development at World Mobile Token, further highlighted the dominance and influence of the two blockchain networks within the crypto space. Vann added:\n\n“This is a significant step forward for our multichain strategy, as it will enable our token to access the rich and diverse ecosystems on both chains.”\n\nAdditionally, the Ethereum and BNB Chain cross-chain bridges will offer users of the two networks a chance to join the emerging WMT ecosystem. BNB Chain and Ethereum are two of the most used smart contract networks, with both networks having more than 200 million unique addresses, respectively.\n\nWMT eyes liquidity\n\nIn addition to its primary objective, the initiative is set to bolster WMT liquidity. Compared to its native Cardano network, Ethereum and BNB Chain currently demonstrate higher levels of liquidity.\n\nNotably, the World Mobile sidechain AyA will see seamless integration with these two prominent networks, further enhancing its potential and accessibility.\n\nWith the creation of the new bridges, WMT now has three cross-chain bridges connecting it to other networks. The third bridge connects World Mobile to Conflux (CFX) blockchain.\n\nDespite a slight drop of 0.93% in the last 24 hours, WMT’s price holds steady at $0.11489, as per the data from CryptoSlate.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvZXRoZXJldW0vb24tY2hhaW4tbWV0cmljLXN0YWduYXRpb24tZXRoZXJldW0tYnJlYWstMjAwMC_SAVlodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL29uLWNoYWluLW1ldHJpYy1zdGFnbmF0aW9uLWV0aGVyZXVtLWJyZWFrLTIwMDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Key On-Chain Metric Points to Stagnation, Will Ethereum Ever Break $2,000? - NewsBTC",
        "content": "According to Etherscan data, the number of active ERC-20 addresses has not changed much in 2023. It has stayed between 200,000 and 300,000 while Ethereum prices stagnate below July 2023 highs. As of August 2, there were about 275,000 active ERC-20 addresses, up from 156,000 on June 18. Although activity has been low overall, there was a significant increase on June 11, with over 446,000 active ERC-20 addresses.\n\nEthereum’s price trajectory has been tumultuous in tandem with this activity pattern, looking at the charts. For instance, Ethereum bulls have failed to breach the $2,100 liquidation level posted in the latter stages of H1 2023.\n\nEthereum Prices Volatile, Few Coins Burned\n\nAt the moment, ETH prices hover around the $1,800 range, teetering precariously and likely to drop, looking at candlestick arrangements in the daily chart. Although Ethereum has been bullish in the past two months, bulls have been tamed, and a drop below the $1,800 level may signal a shift from bullish to bearish in the medium term.\n\nWith ETH under pressure, the number of active ERC-20 addresses remains constant and relatively lower than the 2021 peaks. This means there is less demand for ETH, which is used to pay transaction fees. As a result, gas fees are lower because there is less competition for block space. Typically, this would encourage more people to participate and even deploy complex contracts in decentralized finance (DeFi).\n\nWith EIP-1559 in the equation, low activity means fewer coins are taken out of circulation. Despite low network activity, the protocol continues to issue 2 ETH after each validated block, watering down deflationary effects enforced by EIP-1559.\n\nDeFi Activities Falling\n\nFalling activity could be attributed to the waning interest in decentralized finance (DeFi) activities over recent months. As of August 2, the total value locked (TVL) remains below $50 billion, with a significant portion of assets tied in Ethereum. DeFi projects like LidoDAO, Curve, and Uniswap facilitate the trading of ERC-20 tokens.\n\nFurthermore, on-chain data highlights USDT as the most actively transacted token. Given its position as the third-largest coin by market cap, with substantial circulation in Ethereum and Tron networks, such a trend is expected.\n\nLooking back at ERC-20 transactions from June and July, it is evident that transfers stayed constant despite temporary price increases. Ethereum prices rose from $1,630 to $2,000 between mid-June and mid-July 2023, but ETH is now lower.\n\nOn-chain ERC-20 activity has remained stable despite price volatility. It’s unclear whether there will be a change in activity as prices continue to drop. However, lower prices may force token holders to wait and see, leading to less activity.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zZXZlbi1tYWpvci1hc3NldC1tYW5hZ2Vycy1maWxlLTE1MTY1MzQ1NS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 07:00:00 GMT",
        "title": "Seven Major Asset Managers File Ethereum ETF Applications - Yahoo Finance",
        "content": "Asset management firms are rushing to apply for Ethereum ETFs, with analysts inferring the U.S. Securities and Exchange Commission is softening its stance toward digital assets.\n\nThe SEC has now received seven applications for exchange-traded funds (ETFs) offering exposure to Ether futures from six issuers in the past few days. Volatility Shares, the firm that launched the first 2x leveraged Bitcoin ETF (BITX) in June, led the charge on Friday.\n\nNot to be left behind, Bitwise, Grayscale, VanEck, Roundhill, and Proshares quickly followed suit, with Proshares also applying for a second ETF that would let holders bet against Ether prices.\n\nSeven Major Asset Managers File Ethereum ETF Applications\n\nEric Balchunas, senior ETF analyst at Bloomberg, tweeted that he thinks the ETFs “have a very good chance of getting approved” following the recent launch of BITX.\n\nEther has rallied more than 50% since the beginning of the year.\n\nSeven Major Asset Managers File Ethereum ETF Applications\n\nPotential SEC Softening\n\nThe new filings come after the SEC appeared to discourage applicants as recently as May.\n\nGrayscale filed for an Ethereum ETF on May 9, prompting BitWise, Direxion, and Roundhill to follow suit. However, Grayscale withdrew its application just one week later, with its rivals doing the same shortly after. A similar scenario played out in August 2021 when VanEck and ProShares withdrew applications for Ethereum futures ETFs just a couple of days after filing them.\n\nETFs track the performance of an underlying asset, allowing investors to access exposure to an asset without having to hold it directly. Shares in ETFs are listed on exchanges, meaning retail traders can purchase the shares.\n\nWith ETFs offering a way for retail users to speculate on digital assets without navigating the technical complexities of crypto, analysts have long-tipped that ETFs could bolster the sector’s mainstream adoption. According to BlackRock, retail investors drove 15% of activity in US-listed ETFs during Q1 2023.\n\nBlackRock, the world’s largest asset manager, applied for a spot Bitcoin ETF in June, also suggesting that the SEC’s stance towards crypto may be shifting,\n\nStory continues\n\nAnalysts Unpack ETF Applications\n\nMarket observers are weighing in with speculation regarding the cause for the sudden flurry of ETF applications.\n\nJames Seyffart, an analyst at Bloomberg, suggested that the SEC could be softening its stance to avoid a potential challenge from hopeful Ethereum ETF issuers.\n\n“If any of these ETH futures ETF issuers want to… battle with SEC, SEC defenses would fail to hold up in court why BTC futures ETFs are allowed but ETH futures ETFs aren't,” Seyffart tweeted. “Wonder if SEC is now just trying to avoid losses?”\n\nJohn Deaton, managing partner at Deaton Law Firm, believes the filings reflect market sentiment that following BITX, the SEC is likely to approve a spot Bitcoin ETF, improving the chances of Ethereum ETFs alongside it.\n\nHowever, Lark Davis, a popular crypto influencer, disagrees that spot crypto ETFs could be around the corner and criticized the futures contracts underpinning the proposed ETFs.\n\n“More paper garbage s**t to allow Wall Street manipulation,” Davis tweeted. “ Meanwhile, spot ETF approvals are nowhere in sight.”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vdGhlZGVmaWFudC5pby9zZXZlbi1tYWpvci1hc3NldC1tYW5hZ2Vycy1maWxlLWV0aGVyZXVtLWV0Zi1hcHBsaWNhdGlvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 03 Aug 2023 15:30:51 GMT",
        "title": "Seven Major Asset Managers File Ethereum ETF Applications - The Defiant - DeFi News",
        "content": "Prospective Funds Would Provide Exposure To Ether Futures\n\nBy: Samuel Haig • Loading...\n\nCrypto News\n\nAsset management firms are rushing to apply for Ethereum ETFs, with analysts inferring the U.S. Securities and Exchange Commission is softening its stance toward digital assets.\n\nThe SEC has now received seven applications for exchange-traded funds (ETFs) offering exposure to Ether futures from six issuers in the past few days. Volatility Shares, the firm that launched the first 2x leveraged Bitcoin ETF (BITX) in June, led the charge on Friday.\n\nNot to be left behind, Bitwise, Grayscale, VanEck, Roundhill, and Proshares quickly followed suit, with Proshares also applying for a second ETF that would let holders bet against Ether prices.\n\nEric Balchunas, senior ETF analyst at Bloomberg, tweeted that he thinks the ETFs “have a very good chance of getting approved” following the recent launch of BITX.\n\nEther has rallied more than 50% since the beginning of the year.\n\nPotential SEC Softening\n\nThe new filings come after the SEC appeared to discourage applicants as recently as May.\n\nGrayscale filed for an Ethereum ETF on May 9, prompting BitWise, Direxion, and Roundhill to follow suit. However, Grayscale withdrew its application just one week later, with its rivals doing the same shortly after. A similar scenario played out in August 2021 when VanEck and ProShares withdrew applications for Ethereum futures ETFs just a couple of days after filing them.\n\nETFs track the performance of an underlying asset, allowing investors to access exposure to an asset without having to hold it directly. Shares in ETFs are listed on exchanges, meaning retail traders can purchase the shares.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nWith ETFs offering a way for retail users to speculate on digital assets without navigating the technical complexities of crypto, analysts have long-tipped that ETFs could bolster the sector’s mainstream adoption. According to BlackRock, retail investors drove 15% of activity in US-listed ETFs during Q1 2023.\n\nBlackRock, the world’s largest asset manager, applied for a spot Bitcoin ETF in June, also suggesting that the SEC’s stance towards crypto may be shifting,\n\nAnalysts Unpack ETF Applications\n\nMarket observers are weighing in with speculation regarding the cause for the sudden flurry of ETF applications.\n\nJames Seyffart, an analyst at Bloomberg, suggested that the SEC could be softening its stance to avoid a potential challenge from hopeful Ethereum ETF issuers.\n\n“If any of these ETH futures ETF issuers want to… battle with SEC, SEC defenses would fail to hold up in court why BTC futures ETFs are allowed but ETH futures ETFs aren't,” Seyffart tweeted. “Wonder if SEC is now just trying to avoid losses?”\n\nJohn Deaton, managing partner at Deaton Law Firm, believes the filings reflect market sentiment that following BITX, the SEC is likely to approve a spot Bitcoin ETF, improving the chances of Ethereum ETFs alongside it.\n\nHowever, Lark Davis, a popular crypto influencer, disagrees that spot crypto ETFs could be around the corner and criticized the futures contracts underpinning the proposed ETFs.\n\n“More paper garbage s**t to allow Wall Street manipulation,” Davis tweeted. “ Meanwhile, spot ETF approvals are nowhere in sight.”"
    }
]