[
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTEzL2V0aGVyLWV0aC10b2tlbi1nYWlucy1hcy1hbmFseXN0cy1jaGVlci1zaGFuZ2hhaS1zb2Z0d2FyZS11cGRhdGUtc3VjY2Vzc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Ether (ETH) Token Gains as Analysts Cheer Shanghai Software Update Success - Bloomberg",
        "content": "Ether rallied to the highest since August after analysts said fears of rapid outflows following a highly anticipated software upgrade proved, so far, to be overdone Thursday.\n\nThe so-called Shanghai, or Shapella, update enables investors to stand in a queue to withdraw Ether coins they had pledged to help operate the network in return for rewards, a process known as staking. And so far, 96% of withdrawal volume has been from users withdrawing their rewards instead of their entire stakes, according to researcher Flipside Crypto."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMTMvZXRoZXItcmlzZXMtYWZ0ZXItdGhlLXNoYW5naGFpLXVwZ3JhZGUtYnJpbmdpbmcteWVhci10by1kYXRlLWdhaW4tdG8tbW9yZS10aGFuLTY1cGVyY2VudC5odG1s0gGBAWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA0LzEzL2V0aGVyLXJpc2VzLWFmdGVyLXRoZS1zaGFuZ2hhaS11cGdyYWRlLWJyaW5naW5nLXllYXItdG8tZGF0ZS1nYWluLXRvLW1vcmUtdGhhbi02NXBlcmNlbnQuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Ether rises above $2,000 after the Shanghai upgrade, bringing year-to-date gain to more than 75% - CNBC",
        "content": "The price of ether rallied above $2,000 Thursday for the first time in eight months, after investors put uncertainty surrounding the long-awaited Shanghai upgrade behind them.\n\nEther advanced more than 10% to as high as $2,130.30, its highest level since May 2022. It's on pace for a 13% weekly gain. Bitcoin gained about 3% to reclaim the $30,000, rising as high as $30,928.16, its highest level since June. It's on track to finish the week up more than 9%.\n\nAfter a two-year lock up period, Ethereum staking withdrawals were enabled by the Shanghai upgrade around 6:30 p.m. ET on April 12.\n\nInvestors were optimistic but cautious in the weeks leading up to Shanghai, also known as \"Shapella.\" While many agree the upgrade is good for Ethereum in the long-term – because it allows more liquidity to ether investors and stakers which could also be a catalyst for a change in institutional participation – there was more uncertainty around how it would affect the price the week of.\n\nBoth cryptocurrencies jumped in the earlier hours of Thursday morning and got another push higher with the release of the March producer price index. It was the second report this week, following Wednesday's consumer price index, pointing to cooling inflation. They rallied higher Thursday evening.\n\nNoelle Acheson, an economist and author of the \"Crypto is Macro Now\" newsletter said she's skeptical the sudden move higher in ether isn't entirely Shanghai-driven.\n\n\"It seems to be a bet on the overall liquidity outlook, but relief that Shapella did not produce a sharp drop is driving ETH's outperformance this morning,\" she told CNBC."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1iYXNlZC1yaXBwbGVyZXVtLWNvaW4tYW5ub3VuY2VzLTA2MjE1Mzc4NS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Ethereum-based RIPPLEREUM Coin Announces Its Listing on the Uniswap Exchange on April 17 - Yahoo Finance",
        "content": "New York, NY - (NewMediaWire) - April 14, 2023 - Ethereum-based RIPPLEREUM Coin is proud to announce its listing on the Uniswap exchange on April 17. Uniswap is an Ethereum-based decentralized exchange that supports swaps between Ethereum and ERC-20 tokens. Unlike existing centralized exchanges, decentralized exchanges do not have an order book, and numerous liquidity providers deposit Ethereum or ERC-20 tokens in a 'liquidity pool' to provide transaction liquidity.\n\nGyeongmin Kim, CMO of RIPPLEREUM, said, \"On the RIPPLEREUM platform, users can register various types of cards they have on and off-line 'RIPPLEREM (RPRM) Smart Card', and with one RIPPLEREUM smart card, they can expand and use the app ecosystem.\"\n\nThe ultimate goal of the RIPPLEREUM project is to build a smart card that can be used more conveniently in real life by building a network that enables fast remittance through business modeling of Ripple.\n\nThe RPRM Card Wallet, which will be supported in the future, will be expanded and developed in a hybrid form to enable services such as payment, exchange, remittance, and withdrawal operated and managed under the principle of free market transaction of legal currency and cryptocurrency through the RPRM Payment Platform Gateway.\n\nIn addition, RPRM Payment will first apply closed blockchain-based operation and FIDO security to protect personal information and prevent forgery/falsification of data, and store and manage transaction contents without loss. Through technological advancement, RPRM Payment Platform for all members and consumer-oriented smart card system is established through smart cards based on a new payment platform called RPRM. In addition, we are trying to decentralize by converting to an open block chain, such as introducing a policy voting system, and preparing to issue a service-type card for transportation and living convenience and a multi-function card.\"\n\n\"We are very excited to announce the RIPPLEREUM token to users around the world through the Uniswap Exchange listing on April 17th,\" he said, adding that he is continuously pushing for listing on other cryptocurrency exchanges since the listing on the Uniswap exchange.\n\nStory continues\n\nSocial Links\n\nTwitter: https://twitter.com/Ripplereum_RPRM\n\nTelegram: https://t.me/ripplereum_rprm\n\nMedia Contact\n\nBrand: Ripplereum\n\nContact: Gyeongmin Kim\n\nE-Mail: rprm@ripplereum.io\n\nWebsite: http://ripplereum.io\n\nSOURCE: Ripplereum"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiuwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8tY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTEzLWFwcmlsLTIwMjMvYXJ0aWNsZXNob3cvOTk0NTc1OTAuY21z0gG_AWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5Ly1jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTMtYXByaWwtMjAyMy9hbXBfYXJ0aWNsZXNob3cvOTk0NTc1OTAuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin holds above $30k; Solana, Ethereum rise up to 5% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nMost of the cryptocurrencies were trading higher on Thursday amid better-than-expected US economic data. Bitcoin (BTC) rose 0.67% to $30,093, whereas Ethereum (ETH) was above the $1,900 level. BTC volume stood at approximately $18.62 billion, rising 6.42% in the last 24 hours.\"Most cryptocurrencies rose slightly in the past 24 hours after mildly encouraging inflation data on one side and Ethereum Shanghai upgrades on the other. Bitcoin was seen trading above the US$30,000 level, with its resistance set at US$30,500. This shows that the bulls currently have the upper hand in the market. However, the support of BTC lies at the US$29,900 level,\" Edul Patel, Co-founder and CEO at Mudrex, said.Other top crypto tokens were also trading higher. Solana surged over 5%. Meanwhile, Polkadot, Litecoin Dogecoin and Cardano also traded with gains. The global cryptocurrency market cap was trading higher around $1.23 trillion, rising 1.09% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $582 billion. Bitcoin’s dominance is currently 47.25%, a decrease of 0.25% over the day, according to CoinMarketCap.\"Bitcoin (BTC) continues to consolidate above $30,000, which indicates a rally towards $32,000 is possible until it encounters strong resistance. CPI cooling off may also signal the end of the rate hike season, which will bring new liquidity into the markets,\" Vikram Subburaj, CEO of Giottus Crypto Platform, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 69, with a neutral outlook. The Stochastic %K (14, 3, 3) indicates ‘sell’ at 86 and the Average Directional Index (14) indicates a Neutral outlook at 38.\"The MACD Level (12, 26), at 1027, indicates Buy. The Stochastic RSI Fast (3, 3, 14, 14) indicates Sell at 84 and William's Percentage is Neutral at −13,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.54 hours, IST on April 13, 2023)Bitcoin $30,107 0.66%Ethereum $1,918 2.92%Tether $1.00 -0.01% BNB $318 0.16%XRP $0.5072 -0.1%Cardano $0.407 3.67%Dogecoin $0.0833 1.82%Polygon $1.11 2.23%Solana $23.98 5.05%Polkadot $6.42 2.59%Shiba Inu $0.00001093 1.13%Litecoin $92.55 0.77%Tron $0.06496 1.97%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vZG9udC1yZWFsbHktY2hvb3NlLWJldHdlZW4tYml0Y29pbi0yMTQyMjM4NTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "'You don't have to really choose' between Bitcoin and Ethereum: Trader - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) has surged by over 80% in 2023. Ethereum (ETH-USD) is up by more than 65% over the same span after completing its Shanghai upgrade this week. But according to one trader, choosing where to invest shouldn't come down to picking one over the other.\n\n\"Wolf of All Streets\" podcast host Scott Melker describes Bitcoin as \"digital gold\" and Ethereum as more of a technological investment. \"I think you can love one, love both, and it's totally fine,\" Melker says. \"You don't have to really choose. I think they're separate asset classes and should be viewed as such.\"\n\nBe sure to watch Rachelle Akuffo's full interview with Melker here.\n\nKEY VIDEO MOMENTS:\n\n0:13 Melker's take on Ethereum's Shanghai upgrade.\n\n1:20 Melker breaks down the Bitcoin vs. Ethereum debate\n\nVideo Transcript\n\nRACHELLE AKUFFO: And I want to talk Ethereum as well, the Shanghai upgrade. Because obviously, we're seeing at least today, Ethereum off to the races here versus Bitcoin. I mean, up about almost 6% on the day. What are your takeaways from that? Obviously, a lot of excitement surrounding this.\n\nSCOTT MELKER: Yeah, there was a bit of a nonsensical narrative that everybody who had staked their Ethereum for the past few years was going to try to withdraw all at once, which you couldn't do anyways, and sell all their Ethereum. But you have to remember that anyone who staked their 30 to Ethereum, which by the way, for most people, was over $60,000. But anyone who staked that 30 to Ethereum had no guarantee they would even be able to withdraw.\n\nThese are the people who are the biggest believers, the maximalists of Ethereum, who really wanted to help secure the network. So now that they're getting the opportunity to withdraw, they're going to continue staking. I think there were more people. And I can speak to this anecdotally from fund managers that I speak to in institutions.\n\nThere are a lot more people who are actually waiting to deposit because they would then know that they would be able to withdraw at some point. So we're actually seeing net inflows over the past 24 hours. It's going back and forth. But there has not been a huge demand for people to withdraw. And there are just as many people putting their money into the contract. I think that this is a huge development for Ethereum. Yet another major step in the right direction for the protocol.\n\nRACHELLE AKUFFO: And do you think perhaps investors are more bullish on Ethereum given the use cases versus Bitcoin?\n\nSCOTT MELKER: I view them as completely separate assets. I think that the flipping narrative is completely irrelevant. I view Bitcoin as a digital gold, store of value, flight to safety. And we've obviously seen that, especially, with the banking collapses a few months ago, and Bitcoin rise a few weeks ago. With Bitcoin rising from roughly 19,000 to over $30,000, Ethereum is more of a technological investment. It's a internet of value. And I think that we're starting to see that separation in people's minds. So I think you can love one, love both, and it's totally fine. You don't have to really choose. I think that they're separate asset classes and should be viewed as such."
    }
]