[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9qb2UtbHViaW4tc2VjLXNwb2tlbi1ldGhlcmV1bS0wMjQ4NTQyMTEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Joe Lubin: “The SEC has spoken” on Ethereum's Status as a Security or Commodity - Yahoo Finance",
        "content": "Joe Lubin: “The SEC has spoken” on Ethereum’s Status as a Security or Commodity\n\nThe Commodities and Futures Trading Commission (CFTC), Lubin Said, viewed Ether as a Commodity\n\nEthereum co-founder and ConsenSys founder Joseph Lubin has said that the US Securities and Exchange Commission (SEC) has already spoken on whether Ether (ETH) should be treated as a security or commodity.\n\nIn an interview with CNBC, Lubin referred to former SEC commissioner Bill Hinman’s 2018 speech on crypto securities and Ethereum. However, new records show that Hinman was repeatedly forewarned by colleagues that the speech would confuse markets.\n\nThe Commodities and Futures Trading Commission (CFTC), Lubin said, viewed Ether as a commodity. The three most valuable assets, including Bitcoin, Ethereum and Tether, according to CFTC Chairman Rostin Benham, should be governed by his agency like commodities.\n\nGary Gensler, the current chairman of the SEC, has only publicly recognized Bitcoin as such and has refrained from declaring Ethereum to be either a security or a commodity. Legislation to clarify the situation is being drafted by Congressmen, including Cynthia Lummis and Kirsten Gillibrand, who have stated their agreement with the CFTC that Ether is a commodity alongside Bitcoin. According to Lubin, the regulatory decision that Ethereum is not a security is a \"forgone conclusion.\""
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9qb2UtbHViaW4tc2VjLXNwb2tlbi1ldGhlcmV1bS0wMjQ4NTQyMTEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Joe Lubin: “The SEC has spoken” on Ethereum's Status as a Security or Commodity - Yahoo Finance",
        "content": "Joe Lubin: “The SEC has spoken” on Ethereum’s Status as a Security or Commodity\n\nThe Commodities and Futures Trading Commission (CFTC), Lubin Said, viewed Ether as a Commodity\n\nEthereum co-founder and ConsenSys founder Joseph Lubin has said that the US Securities and Exchange Commission (SEC) has already spoken on whether Ether (ETH) should be treated as a security or commodity.\n\nIn an interview with CNBC, Lubin referred to former SEC commissioner Bill Hinman’s 2018 speech on crypto securities and Ethereum. However, new records show that Hinman was repeatedly forewarned by colleagues that the speech would confuse markets.\n\nThe Commodities and Futures Trading Commission (CFTC), Lubin said, viewed Ether as a commodity. The three most valuable assets, including Bitcoin, Ethereum and Tether, according to CFTC Chairman Rostin Benham, should be governed by his agency like commodities.\n\nGary Gensler, the current chairman of the SEC, has only publicly recognized Bitcoin as such and has refrained from declaring Ethereum to be either a security or a commodity. Legislation to clarify the situation is being drafted by Congressmen, including Cynthia Lummis and Kirsten Gillibrand, who have stated their agreement with the CFTC that Ether is a commodity alongside Bitcoin. According to Lubin, the regulatory decision that Ethereum is not a security is a \"forgone conclusion.\""
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9qb2UtbHViaW4tc2VjLXNwb2tlbi1ldGhlcmV1bS0wMjQ4NTQyMTEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Joe Lubin: “The SEC has spoken” on Ethereum's Status as a Security or Commodity - Yahoo Finance",
        "content": "Joe Lubin: “The SEC has spoken” on Ethereum’s Status as a Security or Commodity\n\nThe Commodities and Futures Trading Commission (CFTC), Lubin Said, viewed Ether as a Commodity\n\nEthereum co-founder and ConsenSys founder Joseph Lubin has said that the US Securities and Exchange Commission (SEC) has already spoken on whether Ether (ETH) should be treated as a security or commodity.\n\nIn an interview with CNBC, Lubin referred to former SEC commissioner Bill Hinman’s 2018 speech on crypto securities and Ethereum. However, new records show that Hinman was repeatedly forewarned by colleagues that the speech would confuse markets.\n\nThe Commodities and Futures Trading Commission (CFTC), Lubin said, viewed Ether as a commodity. The three most valuable assets, including Bitcoin, Ethereum and Tether, according to CFTC Chairman Rostin Benham, should be governed by his agency like commodities.\n\nGary Gensler, the current chairman of the SEC, has only publicly recognized Bitcoin as such and has refrained from declaring Ethereum to be either a security or a commodity. Legislation to clarify the situation is being drafted by Congressmen, including Cynthia Lummis and Kirsten Gillibrand, who have stated their agreement with the CFTC that Ether is a commodity alongside Bitcoin. According to Lubin, the regulatory decision that Ethereum is not a security is a \"forgone conclusion.\""
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8venljcnlwdG8uY29tL2NvbnNlbnN5cy1jaGllZi1qb2UtbHViaW4tY2xhaW1zLWl0cy1hLWZvcmVnb25lLWNvbmNsdXNpb24tdGhhdC1ldGhlcmV1bS1pcy1hLWNvbW1vZGl0eS1ub3Qtc2VjdXJpdHkv0gF-aHR0cHM6Ly96eWNyeXB0by5jb20vY29uc2Vuc3lzLWNoaWVmLWpvZS1sdWJpbi1jbGFpbXMtaXRzLWEtZm9yZWdvbmUtY29uY2x1c2lvbi10aGF0LWV0aGVyZXVtLWlzLWEtY29tbW9kaXR5LW5vdC1zZWN1cml0eS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "ConsenSys Chief Joe Lubin Claims It’s A ‘Foregone Conclusion’ That Ethereum Is A Commodity, Not Security - ZyCrypto",
        "content": "Advertisement\n\nJoe Lubin, Ethereum Co-Founder and the CEO of ConsenSys is not worried about ether (ETH) being classed as a security in the United States after the crypto’s transition to a proof-of-stake (PoS) consensus model.\n\nSpeaking during a June 28 interview with CNBC, Lubin noted that a regulatory decision on ether has already been made. “The CFTC has spoken very crisply a number of times that they consider Ether like a commodity,” he stated.\n\nNotably, the Commodity Futures and Trading Commission (CFTC) boss Rostin Benham has previously said that the top three cryptocurrencies, including Bitcoin (BTC), Ethereum, and Tether’s USDT, belong under his agency’s purview as commodities.\n\nBenham’s opinion, however, directly contradicts that of Securities and Exchange Commission boss Gary Gensler, who has on multiple occasions indicated that “everything other than Bitcoin” fits the definition of securities. Earlier this month, Gensler’s hammer struck twice as the SEC filed landmark lawsuits against Binance and Coinbase for purportedly offering cryptocurrencies that the regulator deems to be unregistered securities.\n\nThe commission’s chairman has also hinted that ether, the second-largest cryptocurrency by market cap, fell under this umbrella after the network’s monumental shift to a proof of stake consensus mechanism.\n\nAdvertisement\n\nBut Gensler wasn’t always so trenchant a detractor. Before becoming the chair of SEC, he taught courses on digital currency at the Massachusetts Institute of Technology and consulted with that school’s Digital Currency Initiative. During this time, he believed ether had graduated from being a security into a commodity by 2018.\n\n“The SEC has spoken,” Lubin opined, referencing former SEC director William Hinman’s 2018 speech Ethereum speech where he declared the asset a non-security. Recently unmasked documents revealed that Hinman dismissed warnings from other SEC staffers who believed his comments would cause immense market confusion.\n\nNotably, Gensler refused to say whether ether was a security during a five-hour-long hearing in April. “It’s really a forgone conclusion at this point,” Lubin observed. “There may be a regulator or two in the United States that can’t bring himself to utter the fact that Ether is not a security, but I don’t know why that’s the case.”\n\nMeanwhile, industry figures and billionaires like Mark Cuban are calling out the SEC for failing to provide crypto firms with a clear registration process to comply with."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vdS50b2RheS9oZXJlcy13aG8tY2F1c2VkLWV0aGVyZXVtLWV0aC10by1kcm9wLW1hc3NpdmVsedIBQ2h0dHBzOi8vdS50b2RheS9oZXJlcy13aG8tY2F1c2VkLWV0aGVyZXVtLWV0aC10by1kcm9wLW1hc3NpdmVseT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Here's Who Caused Ethereum (ETH) to Drop Massively - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nEthereum (ETH), the second-largest cryptocurrency by market capitalization, experienced a sharp price drop recently, moving from $1,940 to $1,847. While various factors play into the volatility of cryptocurrency prices, the substantial sell-off by a particular \"whale\" is believed to have significantly contributed to Ethereum's decline in this instance.\n\nAdvertisement\n\nA \"whale\" in the crypto universe refers to an individual or entity that holds a large amount of a particular cryptocurrency. When such a player makes substantial trades, it often triggers notable price movements. In this case, an Ethereum whale strategically deposited 25,000 ETH (valued at approximately $47.24 million) to Binance, the popular crypto exchange platform, and withdrew 15.9 million USDT 12 hours later.\n\nThe smart whale who deposited 25K $ETH ($47.24M) to #Binance yesterday withdrew 16M $USDT again 9 hrs ago.\n\n\n\nThe drop in $ETH price 11 hrs ago was most likely due to the sell-off of this whale.\n\n\n\nAnd the whale may have ~8K $ETH ($14.7M) left unsold.https://t.co/EucQrT7C4w pic.twitter.com/Aogfv9vOdO — Lookonchain (@lookonchain) June 29, 2023\n\nRenowned for buying low and selling high, this crypto whale has maintained a perfect win rate for Ethereum trading over the past couple of months. This successful strategy, while profitable for the whale, has recently resulted in downward pressure on ETH's price.\n\nJust nine hours after the initial transaction, the whale proceeded to withdraw another 16 million USDT, further contributing to Ethereum's downward spiral. Analysts believe the sudden drop in Ethereum's price was largely attributed to this whale's substantial sell-off.\n\nWith approximately 8,000 ETH (roughly $14.7 million) yet to be sold, this influential whale's future trading activities could potentially exert additional selling pressure on Ethereum's market value. However, it is also crucial to note that crypto markets can be affected by a myriad of factors, including global economic trends, regulatory news and changes in investor sentiment.\n\nThis recent event underscores the amount of power and influence whales have on the cryptocurrency market. Retail investors should always stay cautious and track large wallets to avoid unexpected sell-offs like this one."
    }
]