[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzAzL2V0aGVyZXVtLXdoYWxlLXdpdGhkcmF3cy1vdmVyLTkwMDAwMDAwLXdvcnRoLW9mLWV0aC1mcm9tLWJpbmFuY2UtaW4tb25lLW1vbnRoLW9uLWNoYWluLWRhdGEv0gGBAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzAzL2V0aGVyZXVtLXdoYWxlLXdpdGhkcmF3cy1vdmVyLTkwMDAwMDAwLXdvcnRoLW9mLWV0aC1mcm9tLWJpbmFuY2UtaW4tb25lLW1vbnRoLW9uLWNoYWluLWRhdGEvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Whale Withdraws Over $90,000,000 Worth of ETH From Binance in One Month: On-Chain Data - The Daily Hodl",
        "content": "An Ethereum (ETH) whale has been spotted withdrawing tens of millions of dollars worth of the leading altcoin from crypto exchange Binance over the last month.\n\nBlockchain tracking firm Lookonchain reports that an Ethereum whale has withdrawn 50,100 ETH worth over $91 million from Binance since June 8th.\n\n“This whale withdrew 8,500 ETH ($16.3 million) from Binance again…\n\nThe whale has withdrawn 50,100 ETH ($91.2 million) from Binance since June 8 and staked 34,560 ETH ($65 million).”\n\nLookonchain also spotted another whale buying large amounts of ETH. The deep-pocketed investor also accumulated the decentralized stablecoin lending project CurveDAO (CRV) and the Ethereum liquid staking service Lido (LDO)\n\n“A whale (probably czsamsunsb.eth) bought ETH and CRV today!\n\nHe borrowed 8 million USDC from Aave and spent 6 million USDC to buy 3,115 ETH at $1,926…\n\nAnd he withdrew 1.83 million CRV ($1.41 million) and 1,222 ETH ($2.35 million) from Binance…\n\nHe also withdrew 143,533 LDO ($326,000) from Binance and spent 800 ETH (1.42 million) to buy 737,921 LDO at $1.92 from June 7 to June 11.”\n\nLast week, Lookonchain tracked down a whale with a history of extremely clutch trades in the past, including selling Ethereum (ETH) at a local top, trading USDC for ETH before it lost its dollar peg and withdrawing all of its funds from the crypto exchange FTX right before the bankrupt centralized platform suspended user withdrawals.\n\n“A smart whale deposited 16 million USDC to Binance…\n\nThe smart whale:\n\nDumped 34,000 ETH ($65.4 million) when the price was $1,930.\n\nExchanged USDC for ETH during the USDC de-pegging.\n\nWithdrew all assets from FTX before FTX suspended withdrawals.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on Twitter, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/world01"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMy1qdWx5LTIwMjMvYXJ0aWNsZXNob3cvMTAxNDUwMjcwLmNtc9IBvQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMy1qdWx5LTIwMjMvYW1wX2FydGljbGVzaG93LzEwMTQ1MDI3MC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $30,600; Polkadot, Polygon rise over 3% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were majorly trading higher in Monday's trade. Bitcoin (BTC) rose 0.65% to $30,688, whereas Ethereum (ETH) was above the $1,900 level.BTC volume stood at approximately $10.92 billion, rising 26.43% in the last 24 hours.\"Bitcoin began the new week trading above the US$30,700 mark but struggled to surpass the US$31,000 level, indicating a lack of urgency among bulls to secure profits at this time,\" Edul Patel, Co-founder, and CEO at Mudrex, said.\"The price has remained relatively stagnant between US$31,431 and US$29,500 for a while now. If BTC manages to break through the US$31,000 threshold, there is potential for an upward trend; otherwise, support is currently situated at US$29,500,\" Edul added.Other top crypto tokens were also trading higher. Polkadot, Polygon, and Avalanche rose by over 3%. Meanwhile, BNB Dogecoin , and Litecoin also traded with gains. The global cryptocurrency market cap was trading higher, around $1.21 trillion, rising 1.10% in the last 24 hours.The total volume in DeFi is currently 2.55 billion, 8.46% of the total crypto market 24-hour volume. The volume of all stablecoins is now $26.98 billion, which is 89.53% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $595 billion. Bitcoin's dominance is currently 49.36%, a decrease of 0.22% over the day, according to CoinMarketCap.\"Bitcoin is currently at $30,770, showing no clear dominance by bulls or bears in the broader market. To gain control, buyers need to push the price back to the $31,200 level, which could potentially lead to a break above the $31,458 resistance level,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.\"Traders should keep a close eye on the recent candle high at $31,458 in the medium term. If the candle closes above this level without a long wick, it could indicate further upside and potentially test the next resistance at $32,376,\" Sathvik added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.27 hours, IST on July 03, 2023)Bitcoin $30,688 0.65%Ethereum $1,945 1.60%Tether $0.9999 -0.01%BNB $247 0.74%XRP $0.483 -0.24%Cardano $0.2936 1.29%Dogecoin $0.06817 1.46%Polygon $0.6892 2.94%Solana $19.4 2.55%Litecoin $112.4 2.1%Polkadot $5.51 4.32%Tron $0.07663 1.36%Shiba Inu $0.000007687 3.25%(Note: Price chage in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1oaWdoZXItb3Zlci0yMDAwL9IBSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1oaWdoZXItb3Zlci0yMDAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Looks Ready For Another Leg Higher Over $2,000 - NewsBTC",
        "content": "Ethereum price is gaining pace above $1,920 against the US Dollar. ETH could gain bullish momentum and might soon clear the $2,000 resistance.\n\nEthereum is attempting a fresh increase above the $1,920 zone.\n\nThe price is trading above $1,900 and the 100-hourly Simple Moving Average.\n\nThere was a break above a key bearish trend line with resistance near $1,925 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could rise steadily toward the $2,000 resistance in the near term.\n\nEthereum Price Aims Higher\n\nEthereum’s price remained well-bid above the $1,820 support zone. ETH formed a support base and started a fresh increase above the $1,880 level, outperforming Bitcoin.\n\nThere was a clear move above the $1,920 resistance zone. Besides, there was a break above a key bearish trend line with resistance near $1,925 on the hourly chart of ETH/USD. The price even traded to a new multi-day high at $1,960 and is currently consolidating gains.\n\nIt is now showing positive signs and might soon continue to rise toward the $2,000 resistance. Ether is now trading above $1,900 and the 100-hourly Simple Moving Average. It is also above the 23.6% Fib retracement level of the upward move from the $1,889 swing low to the $1,960 high.\n\nSource: ETHUSD on TradingView.com\n\nImmediate resistance is near the $1,960 level. The next major resistance is near the $2,000 level. A close above the $2,000 zone could start a fresh rally. The next resistance sits near $2,050, above which the price could rise toward the $2,120 level. Any more gains could send Ether toward the $2,220 resistance.\n\nAre Dips Limited in ETH?\n\nIf Ethereum fails to clear the $1,960 resistance or $1,980, it could start a downside correction. Initial support on the downside is near the $1,930 level.\n\nThe next major support is near the $1,920 level. It is close to the 61.8% Fib retracement level of the upward move from the $1,889 swing low to the $1,960 high. The first major support is near $1,900 and the 100-hourly Simple Moving Average. If there is a move below $1,900, the price could drop toward $1,880. Any more losses may perhaps send the price toward the $1,840 support.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,900\n\nMajor Resistance Level – $1,960\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLXByZWRpY3Rpb24tYXMtZXRoLXRha2VzLW9uLTIwMDAtaXMtdGhpcy10aGUtYnVsbGlzaC1lc2NhcGUtdG8tNTAwMC_SAWtodHRwczovL2NvaW5nYXBlLmNvbS9ldGhlcmV1bS1wcmljZS1wcmVkaWN0aW9uLWFzLWV0aC10YWtlcy1vbi0yMDAwLWlzLXRoaXMtdGhlLWJ1bGxpc2gtZXNjYXBlLXRvLTUwMDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Prediction As ETH Takes On $2,000 – Is This The Bullish Escape To $5,000? - CoinGape",
        "content": "Ethereum price is doubling down its bullish efforts after reclaiming support at $1,900 and extending the leg to $1,950. The second largest smart contracts token, powered by a proof-of-stake (PoS) consensus mechanism, is up 1.6% on the day and trading at $1,945 on Monday.\n\nBitcoin price is also slightly in the green with 0.5% in accrued gains over the last 24 hours and doddering at $30,660. As analyzed earlier, BTC is poised for a massive breakout to $35,000 and $38,000, but first, the resistance between $31,000 and $32,000 must come out of the way.\n\nadvertisement\n\nEthereum boasts approximately $8 billion in its 24-hour trading volume and a market cap of $234 billion. Its immediate downside is protected by the recently reclaimed ascending trendline support, but if declines intensify, it would be prudent for investors to anticipate a minor and brief retracement to stronger support at $1,800 and $1,650, respectively.\n\nHow Will Investors React To Ethereum Price Lifting Above $2,000?\n\nThe sudden interest in the crypto market by institutional investors like Blackrock, Fidelity Investments, and Cathie Wood was a substantial boost for the crypto market in June.\n\nBlackrock’s decision to apply for a spot Bitcoin ETF has, within a few weeks, encouraged other players like Cathie Wood and Fidelity to cast their nets with the hope of operating a similar product in the US.\n\nMarket participants believe Blackrock has a higher chance of getting the coveted approval, which the Securities and Exchange Commission (SEC) has managed to avoid for several years, citing market volatility and manipulation, among other bottlenecks.\n\nAs more institutional investors stream into the market, major digital assets like Bitcoin and Ethereum are bound to react positively. Retail investors also see this as a signal that the market is on an upward trajectory.\n\nEthereum’s sturdiness from support at $1,650 can mainly be attributed to the rise in interest from institutional and retail investors combined.\n\nIt is worth mentioning that with Ethereum holding above $1,900 and particularly on top of the dotted rising trendline, the path with the least resistance gradually turns to the upside. That said, the anticipated breakout above $2,000 is, at the time of writing, a matter of when and not if.\n\nEvaluating Ethereum Price Bullish Outlook\n\nTwo indicators affirm the bullish outlook for Ethereum price, starting with a buy signal from the Moving Average Convergence Divergence (MACD) indicator. This call to buy Ether triggered on June 20, has managed to keep investor interest intact, but resistance at $2,000 is the biggest stumbling block, at least for now.\n\nA second bullish signal emanates from the SuperTrend indicator, which like the MACD, flipped in support of an Ethereum uptrend on June 20. Like a moving average, this indicator overlays the chart, but it also integrates readings from the true average range (ATR) to gauge the volatility in the market.\n\nAs long as the SuperTrend is trailing Ethereum price, recovery to $2,000 will remain steady. Traders may want to confirm ETH closes the day above the dotted trendline and the buyer congestion at $1,900 to validate the expected breakout beyond the psychological resistance.\n\nThe fear of missing out (FOMO) could suddenly be the driving force for Ethereum price targeting the ultimate move to $3,000 and subsequently climbing to the all-time high of $4,878.\n\nRelated Articles"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGVjcnlwdC5jby8xNDcxMDAvc29sYW5hLWNvLWZvdW5kZXItc2F5cy1ldGhlcmV1bS1jb3VsZC1iZS1sYXllci0yLXNvbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Jul 2023 07:00:00 GMT",
        "title": "Solana Co-Founder Says Ethereum Could Be Layer-2 for SOL - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDespite certain limitations and potential risks, the idea of using Ethereum (ETH) as a layer-2 for the Solana (SOL) blockchain is not as farfetched as it may seem, according to Anatoly Yakovenko, the co-founder of Solana Labs.\n\nIn a series of tweets on Sunday, Yakovenko took a closer look at how such an integration could take shape, suggesting that the technical collaboration, is “probably more likely than you might think at first glance.”\n\nLayer-2 solutions aim to address scalability issues faced by blockchains like Ethereum, which have experienced congestion and high transaction fees during periods of increased activity. Solana, known for its high throughput and low transaction costs, promises a blockchain platform capable of efficiently accommodating various decentralized finance (DeFi) applications.\n\nAD\n\nAD\n\nPointing out that these scaling solutions “are bridge protocols that provide one-way security,” Yakovenko argues that Ethereum being a layer-2 for Solana would mean that holders of SOL assets on the Ethereum blockchain would have “finality guarantees” of being able to safely exit back to Solana even in cases of transaction double spends or an invalid state transition.\n\nWould it be possible for ethereum to be a @solana L2? Probably more likely than you might think at first glance. L2s are bridge protocols that provide one way security. In this setup, holders of solana assets on ethereum would have finality guarantees that they can exit back… https://t.co/XE5ETsxGIW — toly 🇺🇸 (@aeyakovenko) July 2, 2023\n\nMaking this setup work would first require submitting all the Ethereum transactions into Solana, according to Yakovenko, as well as submitting a Simplified Payment Verification (SPV) root for the resulting state—something that would serve as evidence that consensus has been reached among Ethereum validators regarding the state of the network.\n\nFinally, to identify and address possible faults within a bridge protocol, a bridge timeout mechanism will be necessary. Some examples of faults, per Yakovenko, include conflicting SPVs for the root, invalid root computation, and censorship.\n\nLimitations and risks of Solana's ETH-based L2\n\nThe Solana Labs co-founder also highlighted the limitations and potential risks associated with this integration, saying that while it would be safe to hold SOL assets on the Ethereum blockchain, it will not be safe “to lend them or maintain positions against them.”\n\nAD\n\nAD\n\nOne key risk is the possibility of an Ethereum fault or a contentious social consensus fork within the Ethereum network. In such a scenario, the representations of Solana assets held on Ethereum could become separated from the consensus fork, resulting in a situation where these assets become effectively worthless.\n\nIt would be safe to hold solana assets on ethereum, but not safe to lend them or maintain positions against them. This is because once there is an ethereum fault, ethereum state on solana becomes separated from ethereum the social consensus fork. Solana users can get their… — toly 🇺🇸 (@aeyakovenko) July 2, 2023\n\nLending Solana-based USDC, the dollar-pegged stablecoin from Circle, on Ethereum could lead to a situation where the borrower can withdraw the real USDC on the Solana network, while the lender on Ethereum receives a \"junk token.\"\n\nThis scenario, argues Yakovenko, is similar to the experience of holding USDC on Ethereum's Proof-of-Work (EthPow) chain, where certain tokens may lose value or functionality due to network issues or changes.\n\nAdditionally, the integration of Solana assets on Ethereum may have implications for various DeFi protocols. While central limit order books (CLOBs) would likely remain functional, automated market makers (AMMs), and non-flash loan borrowing and lending protocols could face limitations or challenges, potentially leading to inefficiencies or constraints in liquidity provision and trading.\n\nClobs are ok, AMMs and non flash loan borrow lending protocols are not. — toly 🇺🇸 (@aeyakovenko) July 2, 2023\n\nYakovenko’s proposal came hot on the heels of Ethereum co-founder Vitalik Buterin lamenting about how U.S. regulators are targeting various crypto projects, including Solana, which the U.S. Securities and Exchange Commission in its recent lawsuit against Binance labeled as unregistered securities.\n\n“They don’t deserve it, and if Ethereum ends up ‘winning’ through all other blockchains getting kicked off exchanges, that’s not an honorable way to win, and in the long term probably isn’t even a victory,” Buterin tweeted last week.\n\nAD\n\nAD"
    }
]