[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMjQvZXRoZXJldW0tc2hhbmdoYWktdXBncmFkZS1icmluZ3MtcmVjb3JkLWluZmxvdy1vZi01NzJrLWV0aC1zdGFrZWQtaW4tYS13ZWVrL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMjQvZXRoZXJldW0tc2hhbmdoYWktdXBncmFkZS1icmluZ3MtcmVjb3JkLWluZmxvdy1vZi01NzJrLWV0aC1zdGFrZWQtaW4tYS13ZWVrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Ethereum Shanghai Upgrade Brings Record Inflow of 572K ETH Staked in a Week - CoinDesk",
        "content": "The reason for differentiating reward withdrawals from full exits comes from how Ethereum’s staking system works. Individual stakers or staking services have to lock up exactly 32 ETH to open a node and earn rewards for securing the network. Keeping the accrued rewards in the validator node does not improve the node’s return. Acheson explained that it’s logical for stakers to withdraw rewards, bundle the tokens and establish new nodes to increase potential returns."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1pY28tcGFydGljaXBhbnQtd2FrZXMtdXAtdG8tNC00Mm0taW4tZXRoLWFmdGVyLW5lYXJseS1laWdodC15ZWFycy_SAWhodHRwczovL2NyeXB0b3BvdGF0by5jb20vZXRoZXJldW0taWNvLXBhcnRpY2lwYW50LXdha2VzLXVwLXRvLTQtNDJtLWluLWV0aC1hZnRlci1uZWFybHktZWlnaHQteWVhcnMvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Ethereum ICO Participant Wakes Up to $4.42M in ETH After 8 Years - CryptoPotato",
        "content": "A wallet that participated in Ethereum’s initial coin offering (ICO) in 2016, which remained dormant since then, has finally woken up after seven years and seven months.\n\nAccording to a tweet by on-chain analysis firm Lookonchain, the address transferred one ether (ETH) to a new address about 13 hours ago, marking its first transaction. The crypto community speculates that it is a test transaction. However, the ICO wallet has not made any other transactions since.\n\nAt the time of the ICO, the wallet received 2,365 ETH, valued at around $733.51, as the token sale price was $0.311. However, the assets are worth roughly $4.36 million at the current market price of ETH, signaling nearly 600,000% ROI.\n\nThe ICO participant has joined the list of previously inactive addresses that have suddenly come to life and started transferring their assets. In December, two Ethereum addresses that had been dormant since October 2018 made significant transfers of 22,982 ETH for the first time.\n\nsignificant transfers of 22,982 ETH for the first time. Aside from Ethereum, there have also been reports of dormant Bitcoin (BTC) addresses becoming active again.\n\nOne striking example is a wallet that received 6,071 BTC in 2013 and recently sent 2,071 BTC to a new address. At the time of the initial transaction, the value of one BTC was $663, and the total worth of the wallet was over $4 million.\n\n2,071 BTC to a new address. At the time of the initial transaction, the value of one BTC was $663, and the total worth of the wallet was over $4 million. However, by April 2023, when it was reactivated, the value of the stash had skyrocketed to $176 million, and $60 million worth of assets were transferred out.\n\nIn March 2022, another Bitcoin address was activated for the first time in 11 years. The address held 489 BTC worth merely $50 in 2010. By the activation date, the assets were worth over $20 million."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1sb3dlci1oaWdocy12cy1iaXRjb2luLWhpbnQtYXQtbW9yZS1kb3duc2lkZS1pbi1hcHJpbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Ethereum price lower highs vs. Bitcoin hint at more downside in April - Cointelegraph",
        "content": "The price of Ethereum’s Ether (ETH) token has retreated from its recovery trend versus Bitcoin (BTC) while making a series of lower highs in April.\n\nETH price risks more losses vs. Bitcoin\n\nAs of April 24, the ETH/BTC pair was down about 5.5% from its local high of 0.0709 BTC six days ago. The same period witnessed Ether declining nearly 15% and Bitcoin dropping 11.25% in United States dollar terms.\n\nETH/BTC daily price chart. Source: TradingView\n\nFor now, ETH holds above its 50-day exponential moving average (50-day EMA; the red wave) near 0.0672 BTC. But if the March 2023 fractal is any indication, Ethereum's price could drop sharply below the support wave.\n\nThe ETH/BTC pair saw a pullback trend in March after testing the 200-day EMA (the blue wave), breaking below its 50-day EMA in the process.\n\nIf the fractal plays out similarly in April, the downside target is 0.0627 BTC by the month’s end, about 7% lower than the current levels, a level that served as a major support in March and April.\n\nThis target also coincides with Ether’s long-term ascending trendline support — the “buy zone” in the chart below — that has been capping its bearish attempts since June 2022.\n\nETH/BTC three-day price chart. Source: TradingView\n\nWeekly Ethereum institutional flows beat BTC\n\nInterestingly, Ethereum’s underperformance versus Bitcoin was counter to institutional flows for the past week.\n\nEthereum funds attracted $17 million to their coffers in the week ending April 21 versus Bitcoin's $53.1 million outflow, according to CoinShares’ latest report.\n\nFund flow into crypto funds. Source: CoinShares\n\n“These inflows suggest there is increasing confidence amongst investors following the successful implementation of the Shapella upgrade,” James Butterfill, head of research at CoinShares, noted, adding that they “were solely from Europe.”\n\nRelated: Ethereum up 20% in April while Markets Pro sees 379% gain in one day\n\nAs for Bitcoin, the outflow began around April 14 when the coin reached $30,000, a psychological resistance level. Butterfill said the BTC's drop to below $27,500 resulted from profit-taking in the absence of macroeconomic triggers.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZGVjcnlwdC5jby8xMzc2OTkvYml0Y29pbnMtc2l4LXdlZWstaG90LXN0cmVhay1lbmRzLWFzLWluc3RpdHV0aW9ucy10dXJuLXRvLWV0aGVyZXVt0gFiaHR0cHM6Ly9kZWNyeXB0LmNvLzEzNzY5OS9iaXRjb2lucy1zaXgtd2Vlay1ob3Qtc3RyZWFrLWVuZHMtYXMtaW5zdGl0dXRpb25zLXR1cm4tdG8tZXRoZXJldW0_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Six-Week Hot Streak Ends as Institutions Turn to Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin outflows hit $53.1 million last week—meaning that, for the first time in six weeks, more funds flowed out of digital asset investment products than in.\n\nProfit-taking is largely to blame, especially considering there were few macroeconomic triggers that could influence BTC's price, says a new report from digital asset investment firm CoinShares.\n\nAnd that would suggest that meaningfully staying above the psychologically significant threshold of $30,000 could be a tough nut to crack for bulls. As of Monday morning, Bitcoin was sliding towards $27,000 and down 9% from the last week, according to CoinGecko.\n\nAD\n\nAD\n\nOverall, digital asset investment products saw total outflows of $30 million in the seven days through April 21—with CoinShares XBT, ProShares, and 3iQ the hardest-hit providers. The providers all manage exchange-traded products pegged to cryptocurrencies, an indirect way for institutional investors to get exposure to crypto markets without actually holding it.\n\nBut the devil's in the details. According to CoinShares head of research James Butterfill, there's one cryptocurrency that's bucking the trend in a big way.\n\nBasking in the glow of the successful \"Shapella\" upgrade, Ethereum actually enjoyed inflows of $17 million last week—putting it far ahead of major altcoins, like Solana, Cardano, XRP, and Litecoin, which were mostly flat.\n\nThis indicates investors are feeling confident now that validators on Ethereum's proof-of-stake network can withdraw staked ETH if they so wish.\n\nButterfill also revealed that inflows into ETH-based funds came solely from Europe, which is fresh from approving much-welcomed, landmark legislation on cryptocurrencies.\n\nAD\n\nAD\n\nAll of this comes as regulatory uncertainty in the U.S. casts a long shadow over American crypto firms—with the SEC's crackdown potentially prompting investors to sit on the sidelines.\n\nThere was also a clear continental divide when it came to Bitcoin.\n\n\"Regionally, the profit-taking was almost solely from North America, which saw outflows totaling $54 million,\" Butterfill wrote. \"This was offset by the continued optimistic sentiment in Germany which saw inflows totalling $29 million.\"\n\nThat optimism in Germany has undoubtedly been driven by the country's friendly tax regime, which states that cryptocurrency offloaded after 12 months isn't subject to capital gains."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdS50b2RheS9hbmNpZW50LWV0aGVyZXVtLWV0aC1hZGRyZXNzLWNvbWVzLXRvLWxpZmUtaGVyZS1hcmUtbGlrZWx5LXJlYXNvbnPSAVZodHRwczovL3UudG9kYXkvYW5jaWVudC1ldGhlcmV1bS1ldGgtYWRkcmVzcy1jb21lcy10by1saWZlLWhlcmUtYXJlLWxpa2VseS1yZWFzb25zP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Ancient Ethereum (ETH) Address Comes to Life, Here Are Likely Reasons - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAn ancient Ethereum (ETH) wallet address that participated in the 2015 Initial Coin Offering (ICO) of the protocol has suddenly come back to life after close to eight years of dormancy. Data from Etherscan as shared by Lookonchain shows that this wallet address reawakened with a massive amount of Ether tokens.\n\nAdvertisement\n\nAn Ethereum ICO participant woke up after 7.7 years of dormancy and transferred 1 $ETH to a new address.\n\n\n\nHe received 2,365 $ETH($4.42M currently) at Ethereum Genesis, the ETH ICO price is ~$0.31.https://t.co/hOfBSyml19 pic.twitter.com/yoMoB6vE9n — Lookonchain (@lookonchain) April 24, 2023\n\nTo revive the wallet, the ICO participant sent just one Ethereum token to a new address in what appears to be a functionality test. The ICO era wallet received a total of 2,365 during the public sale, which was priced at approximately $0.31 at the time.\n\nThis address has HODLed the tokens through the storm and, at present, the tokens are worth roughly $4.42 million. While it remains unclear what the reasons for the reawakening are, it can be inferred that the address is likely interested in staking the tokens now that Ethereum as a network now allows for such investment, as most institutional investors are currently doing.\n\nThe reasons could also be to liquidate the asset, but from antecedents, this owner has witnessed Ether hit its all-time high price above $4,000 and may not be so quick to offload the coin at this time.\n\nEthereum price growth as motivation\n\nReawakening the wallet may have different causes, but the trust in the potential of Ethereum to hit new milestones now that the Shapella upgrade is live remains good motivation.\n\nEthereum is currently changing hands at $1,846.50 as it is entering the week with a largely bearish stride. While the more than 11% slump over the trailing seven-day period can be tagged as a bad omen for the digital currency, it can spell an overselling move that can further attract more investors to accumulate the cryptocurrency.\n\nThe digital currency ecosystem is still very volatile, and Ethereum has what it takes to benefit from this industry feature."
    }
]