[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzIxL2V0aGVyZXVtLWJhc2VkLWNhcmJvbi10cmFja2VyLWNhcmJvbmFibGUtcmFpc2VzLTEybS10by10YWNrbGUtZ3JlZW53YXNoaW5nL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAzLzIxL2V0aGVyZXVtLWJhc2VkLWNhcmJvbi10cmFja2VyLWNhcmJvbmFibGUtcmFpc2VzLTEybS10by10YWNrbGUtZ3JlZW53YXNoaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Ethereum-Based Carbon Tracker Carbonable Raises $1.2M to Tackle Greenwashing - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjIxNDUzL292ZXItMS1iaWxsaW9uLW9mLWV0aGVyLWxvc3QtZm9yZXZlci1idWdzLWh1bWFuLWVycm9y0gFdaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjIxNDUzL292ZXItMS1iaWxsaW9uLW9mLWV0aGVyLWxvc3QtZm9yZXZlci1idWdzLWh1bWFuLWVycm9y?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Over $1 billion of ether has been lost forever due to bugs and human error - The Block",
        "content": "More than $1 billion of ether has been lost forever due to bugs and human error, according to research by Conor Grogan, director of product strategy and business operations at Coinbase.\n\n\"I've categorized thousands of instances of Ethereum typos, user errors and buggy contracts,\" Grogan said on Twitter on Monday. He noted that he'd cataloged 636,000 ETH ($1.15 billion) that is lost, representing 0.5% of the coin's circulating supply.\n\nThe majority — some 514,000 ETH — is due to a 2017 bug in the Parity crypto wallet. Defunct crypto exchange Quadriga lost 60,000 ETH to a contract fault and the Akutars NFT collection lost 11,500 ETH in a failed Mint. On top of those, Ethereum users have cumulatively sent 24,000 ETH to a burn address, where the coins can no longer be accessed.\n\nIn most of these cases, the ether wasn't worth anywhere as near as much in dollars at the time of the loss.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nGrogan added that his estimate, if anything, is an understatement. \"This $1.1B+ number significantly undershoots the actual lost/inaccessible ETH amount — It just covers instances where Ethereum is locked forever,\" he said.\n\nThis is because access to many wallets will have been lost but there's no way of knowing which ones by looking at blockchain data alone.\n\nUpdate: Fixed the amount lost in the Parity bug."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8yMS9ldGhlcmV1bS1ldGgtc3RpbGwtaGFzLXJvb20tdG8tcnVuLWhpZ2hlci1hY2NvcmRpbmctdG8tY3J5cHRvLWFuYWx5dGljcy1maXJtLXNhbnRpbWVudC1oZXJlcy13aHkv0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAzLzIxL2V0aGVyZXVtLWV0aC1zdGlsbC1oYXMtcm9vbS10by1ydW4taGlnaGVyLWFjY29yZGluZy10by1jcnlwdG8tYW5hbHl0aWNzLWZpcm0tc2FudGltZW50LWhlcmVzLXdoeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Still Has Room To Run Higher, According to Crypto Analytics Firm Santiment – Here’s Why - The Daily Hodl",
        "content": "The second-largest crypto asset by market cap, Ethereum (ETH), has more upside potential, according to analytics platform Santiment.\n\nThe crypto analytics firm says that Ethereum is likely to soar above the $2,000 price after hitting a high last reached seven months ago over the weekend.\n\n“Ethereum’s price hadn’t eclipsed $1,840 since August 18th. Despite this seven-month high, the network hasn’t appeared to heat up and create notable transaction barriers due to high demand. This is a good sign that ETH has a door open to $2,000 and beyond.”\n\nDespite the price jump, Santiment says that Ethereum’s transaction fees fell below $2 when ETH hit a seven-month high compared to rising above $8 earlier this month when the second-largest crypto fell to a two-month low.\n\nA Twitter survey conducted by Santiment over the weekend also indicated that there are more people who believe Ethereum will rise above $2,000 first than those who think it will drop below $1,600 first. Nearly 10% of the respondents said they see Ethereum soaring above $2,000 next while 5.2% said they see ETH falling under $1,600 next.\n\nOn Bitcoin (BTC), Santiment further says that March’s rally is legitimate. According to Santiment director of marketing Brian Quinlivan, Bitcoin’s rally has coincided with the banking sector’s meltdown.\n\n“With the calendar past the halfway mark in March, Bitcoin has gone on another tear, breaking above $27,800 for the first time since June, 2022.\n\nSo why did prices manage to soar? Well, there were a few different key events in the first half of March.\n\nThe most obvious appeared to be the collapse of one of the larger US banks, Silicon Valley Bank (SVB). And it appears this has caused massive ripple effects among the banking sector, in general.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2V0aGVyZXVtLWRlZmxhdGlvbmFyeS0yLW1vbnRoc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "Ethereum Now Deflationary for 2 Months Straight - Blockworks",
        "content": "Ethereum has been deflationary for two months straight due to a surge in on-chain activity on protocols such as Uniswap and Blur.\n\nThe network pushed an upgrade (EIP-1559) in August 2021 that meant transaction fees would be burned instead of directed to the network’s miners — a precursor to Ethereum’s switch to proof-of-stake last September.\n\nEIP-1559 at times inspired Ethereum to produce deflationary blocks (more ETH burned than distributed). But the asset has now been solidly deflationary every day since late January, per network tracker ultrasound.money.\n\nPrior to that, Ethereum had briefly entered deflationary status in November 2022, about two months after Ethereum’s Merge cut issuance by more than 90%, before slipping back to inflationary by December.\n\nUltrasound.money only maps Ethereum’s deflationary status since the Merge — making its recent streak the longest on record for this particular tracker.\n\nResearch analysts at Compass Point Research and Trading said in a research report earlier this month that the increase in burned ETH has largely been driven by increased Uniswap usage in response to centralized exchange uncertainty, as well as continued usage of the Blur NFT marketplace.\n\nUniswap tops the ETH burned leaderboard in the past 30 days, with roughly 8,766 ETH ($16 million) burned in that span. NFT marketplace and aggregator Blur has burned about 6,535 ETH ($11.9 million) over the last month.\n\n“The amount of ETH burned has seen a steady climb over the past two months due to an increase in on-chain activity, with the largest surge occurring on March 10 as fear surrounding USDC’s backing caused a depeg,” Blockworks Research Analyst Sam Martin said.\n\n“On-chain users scrambled to dump USDC for USDT, which led to the largest daily burn since the Merge’s implementation.”\n\nRead More: Blur Still Sees Record NFT Volumes Even After Crypto Airdrop\n\nThe depegging of USDC followed the collapse of Silicon Valley Bank (SVB). It plunged to as low as $0.87 before ultimately returning to its $1 peg.\n\nThe failures of financial institutions in recent weeks, including Silvergate, SVB and Signature Bank, have prompted crypto industry participants to advocate for decentralized financial infrastructure as a more secure and reliable alternative.\n\nCompass Point’s March 9 report predicted that the introduction of layer-2 blockchains can take market share away from so-called “ETH killers” and bring users back to the Ethereum network.\n\n“We continue to believe that L2 scaling and liquid staking growth have the potential to be significant catalysts for Ethereum this year, and help drive on-boarding of users, adoption and overall demand and activity of the network,” analysts wrote.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1pcy1hcmJpdHJ1bS1zcGVlZGluZy11cC1ldGhlcmV1bS11c2luZy1vcHRpbWlzdGljLXJvbGx1cHPSAWFodHRwczovL2RlY3J5cHQuY28vcmVzb3VyY2VzL3doYXQtaXMtYXJiaXRydW0tc3BlZWRpbmctdXAtZXRoZXJldW0tdXNpbmctb3B0aW1pc3RpYy1yb2xsdXBzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Mar 2023 07:00:00 GMT",
        "title": "What Is Arbitrum? Speeding Up Ethereum Using Optimistic Rollups - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Ethereum network has a lot going for it—it’s decentralized, reliable, supports smart contracts written in a programming language familiar to many crypto developers, and is home to a thriving decentralized finance (DeFi) industry.\n\nHowever, Ethereum is also slow and expensive to use, and will remain so unless users opt to move to another blockchain (like Solana, Fantom or Avalanche), or until planned Ethereum upgrades speed things up within the next couple of years.\n\nWhile the world waits, a third fix has arisen: scaling solutions. These are pieces of software that sit atop the base layer of a blockchain, in this case Ethereum, to speed things up. Arbitrum is one such scaling solution, and it’s become a popular venue for Ethereum users to complete their transactions.\n\nAD\n\nAD\n\nOn March 23, 2023, Arbitrum plans to airdrop its new ARB token, allowing holders to vote in decisions related to the protocol. In so doing, Arbitrum is enacting its long-awaited transition to a DAO (decentralized autonomous organization).\n\nArbitrum is cheap and quick to use, and relays all transaction information back to the main Ethereum blockchain. While Ethereum manages a mere 14 transactions per second, Arbitrum races ahead at 40,000 TPS. Transactions cost several dollars to complete on Ethereum, while they cost about two cents on Arbitrum.\n\nAnd Arbitrum also supports the Ethereum Virtual Machine (EVM), meaning that Ethereum DeFi developers can integrate their decentralized applications (dapps) with Arbitrum without having to make any modifications.\n\nArbitrum was created by Offchain Labs. The company raised $120 million in a Series B funding round in September 2021.\n\nHow does Arbitrum work?\n\nArbitrum’s development documentation says that this is the most important graph to understand:\n\nAD\n\nAD\n\nArbitrum workflow. Image: Arbitrum\n\nPut simply, people and smart contracts ask Arbitrum’s blockchain to do something by placing transactions into the chain's ‘inbox’. Then Arbitrum processes it and outputs a transaction receipt. How Arbitrum processes that transaction—what determines its ‘chain state’—is decided by the transactions in its inbox.\n\nRight now, Arbitrum processes Ethereum transactions through a method called an optimistic rollup, and settles these on a sidechain before reporting back to Ethereum. Let’s break that down.\n\nWhat is an optimistic rollup?\n\nA rollup is a type of data compression technique for blockchain transactions. It involves ‘rolling up’ batches of transactions into a single transaction.\n\nThe benefit of this is that a blockchain need only process a single transaction—the rolled-up transaction—instead of confirming each individual transaction contained within the rollup. This saves time—multiple transactions are confirmed at once, so you do not have to wait until the blockchain gets around to your transaction—and money, since the blockchain only has to confirm one transaction.\n\nAn ‘optimistic’ rollup is a specific technique for rolling up transactions. To speed things up, optimistic rollups assume that the transactions contained within the rollup are valid. It is possible to contest transactions through a dispute resolution mechanism if a validator suspects fraudulent behavior. (Optimistic rollups are separate from ‘zero knowledge’ rollups, which bypasses a dispute resolution mechanism by validating transactions before they are added to the rollup).\n\nOptimistic rollups are the present *and future* of Ethereum scaling. We explain why here:https://t.co/FG0OGC8TJB — Arbitrum (💙,🧡) (@arbitrum) December 17, 2021\n\nArbitrum’s optimistic rollups are settled on a proprietary sidechain. A sidechain is a blockchain that is connected to a main chain; in this case, Ethereum. Arbitrum collects batches of transactions, settles them on its sidechain, and then feeds the transaction data back to the Ethereum blockchain ledger.\n\nArbitrum says that any transactions confirmed through this process are rubber stamped with the “AnyTrust Guarantee”—when all the validators agree with the validity of transactions contained within a block. Validators stake ETH before they can confirm transactions; by putting money on the line, they are incentivized to act honestly.\n\nAD\n\nAD\n\nUnlike other rollup networks, like Boba or Loopring, Arbitrum does not have a token. Offchain Labs claims the network does not need one, since all transactions on the sidechain are settled with ETH, the native cryptocurrency of the Ethereum blockchain.\n\nArbitrum has been integrated into several decentralized finance protocols, such as SushiSwap, Curve and Abracadabra. Data from DeFi Llama show that $2 billion worth of cryptocurrency is locked up within Arbitrum’s smart contracts. Approximately 30% is from decentralized exchange (DEX) SushiSwap.\n\nThe project’s blockchain, Arbitrum One, is in mainnet “beta”, which allows Arbitrum’s developers “various levels of control over the system”, including “the ability to pause the system”. Offchain Labs plans to eliminate these controls once it is certain the project is robust.\n\nHow to use Arbitrum\n\nYou can use Arbitrum through a decentralized application, like Aave, 1inch or Gnosis Safe, or directly on Arbitrum’s token bridge. For the token bridge, you can deposit funds to the Arbitrum network after you’ve connected your Web3 wallet. It takes about 10 minutes for deposits to clear.\n\nYou’ll have to pay an Ethereum gas fee—at Ethereum’s rates. To deposit under a cent of ETH to Arbitrum, MetaMask wallet quoted us $5.41 in gas fees."
    }
]