[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlcmV1bS1tYWlubmV0LXJlY2xhaW1zLWRvbWluYW5jZS1sYXllci0xMTE1MDA2MjUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Ethereum Mainnet Reclaims Dominance From Layer 2s - Yahoo Finance",
        "content": "Ethereum is reclaiming dominance relative to its Layer 2 ecosystem, with the daily activity on L2s falling by one-third in the last six weeks.\n\nAccording to L2beat, combined Layer 2 throughput is down 32% since peaking at 64.2 transactions per second (TPS) on Sept. 14, currently sitting at 43.8TPS. For comparison, Ethereum averages 12.6 TPS, a 1.6% increase over the same period.\n\nEthereum posted a brief spike to 18.8 TPS on Sept. 13 — buoyed by users bridging assets over to Base — but has consistently trended near 12 TPS throughout 2023.\n\nEthereum Mainnet Reclaims Dominance From Layer 2s\n\nL2 hype dies down\n\nMuch of the Layer 2 drawdown can be attributed to freshly deployed networks experiencing a retraction in activity after an initial wave of hype and incentives.\n\nThe initial frenzy of activity on Base, Coinbase’s OP Stack-based L2, has well and truly died down following its August mainnet launch. Base is now processing just at 3 transactions per second, down from 21.3 TPS on Sept. 14.\n\nZkSync Era’s throughput has slumped 50% since peaking at 15.2 TPS on Aug 26, despite Era now leading the Layer 2 sector by activity. Starknet is also down 53% from its Sep. 9 high at 4.7 TPS.\n\nThe top L2s by total value locked, long-standing incumbents Arbitrum and Optimism, suffered similar retracements. Arbitrum closely follows ZkSync Era with 7.3 TPS, down from a record high of 31.6 TPS amid the airdrop for its ARB token in March.\n\nThe OP Mainnet currently sits at 2.5 TPS, down from 10.4 in late July. However, the OP Labs team has since shifted its focus to supporting other L2s, including Base, with its OP Stack.\n\nDespite the pull-back, Ethereum’s Layer 2 project is emerging has succeeded in its mission.\n\nLayer 2 networks are driving more than 4.6 times as much activity than Ethereum’s base layer, meaning Ethereum’s ecosystem is facilitating far greater throughput at a fraction of the cost compared to before its L2 sector took off.\n\nTo continue reading this as well as other DeFi and Web3 news, visit us at thedefiant.io"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvbnZkYS1hbWQtYm9vbWVkLXRoYW5rcy10by1jcnlwdG8tbWluaW5nLWJ1dC13aGF0LWhhcHBlbmVkLWFmdGVyLWV0aGVyZXVtcy1iaWctbW92ZS1mcm9t0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "NVDA, AMD Boomed Thanks To Crypto Mining, But What Happened After Ethereum's Big Move From Proof-Of-Work ... - Nasdaq",
        "content": "Semiconductor companies NVIDIA Corp (NASDAQ:NVDA) and Advanced Micro Devices Inc (NASDAQ:AMD), known for their graphics processing units (GPUs), saw their stock prices benefiting from the boom in cryptocurrencies.\n\nWhat Happened: These GPUs, originally designed for high-end video game graphics, have now become essential for computationally intensive applications such as data centers, artificial intelligence, and the creation of crypto assets.\n\nCryptography and blockchain creation require substantial computational power, making GPUs an ideal choice for these tasks. In 2018, as cryptocurrency prices soared, miners rushed to purchase GPUs, driving up the stock prices of Nvidia and AMD. GPUs played a vital role in the creation and management of crypto assets, to the extent that Nvidia even introduced a dedicated lineup of chips specifically for crypto mining in early 2021.\n\nThe Merge and Proof-of-Stake Approach\n\nThe Ethereum Foundation on September 15, 2022, completed “The Merge” process, which means Ethereum was switched from a Proof-of-Work (PoW) consensus mechanism to Proof-of-Stake (PoW).\n\nWith this development, the validation of new transaction blocks no longer relies on hardware mining, making the millions of high-end graphics cards previously used for this purpose redundant. Consequently, a large number of these GPUs were expected to flood the used card market.\n\nHowever, since 2023, the AI industry experienced a remarkable upswing. With machine learning at the forefront, AI applications penetrated diverse sectors, capturing investors’ attention and fueling the sector’s success.\n\nAccording to PwC, the potential economic impact of AI is substantial, with an anticipated contribution of $15.7 trillion to the global economy by 2030. This projection encompasses a $6.6 trillion boost in productivity and a staggering $9.1 trillion surge in consumption.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nSee More: A Stay At The Floating Palace From James Bond's ‘Octopussy\n\nExamining the performance of both AMD and NVDA in the aftermath of “The Merge,” we delve into which of these stocks emerged as the stronger contender.\n\nNVDA vs AMD: Price Performance Comparison\n\nPerformance-wise, both Nvidia (NVDA) and AMD have witnessed significant changes in their stock prices over the past year.\n\nAs of September 15, 2022, NVDA’s stock price increased by 215.61% ($129.21 to $407.8), while AMD’s stock price rose by 28.49% ($76.66 to $98.5).\n\nNVDA Or AMD: 1 Year Performance (Photo: Benzinga)\n\nNVDA vs AMD: Returns Comparison\n\nWhen it comes to returns, a $1000 investment in NVDA would have resulted in a final value of $3156.08, whereas the same investment in AMD would have yielded $1284.89.\n\nNVDA Or AMD: Which Offers Better Returns? (Photo: Benzinga)\n\nCo-Movement of NVDA and AMD\n\nHistorically, NVDA and AMD have shared a reasonably high correlation in their stock price movements. The coefficient of determination (R2) between the two stocks is calculated to be 0.8464, suggesting a strong relationship between their price fluctuations.\n\nDo NVDA And AMD Often Move Together? (Photo: Benzinga)\n\nPrice Action: At the time of writing, ETH was trading at $1,785.941 up 0.66% in the last 24 hours, according to Benzinga Pro. During Tuesday’s session, AMD closed at $98.50, showing a positive gain of $2.32 (2.41%), while Nvidia ended at $407.80, recording a slight decrease of $3.81 (0.93%).\n\nImage Source – Shutterstock\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvbnZkYS1hbWQtYm9vbWVkLXRoYW5rcy10by1jcnlwdG8tbWluaW5nLWJ1dC13aGF0LWhhcHBlbmVkLWFmdGVyLWV0aGVyZXVtcy1iaWctbW92ZS1mcm9t0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "NVDA, AMD Boomed Thanks To Crypto Mining, But What Happened After Ethereum's Big Move From Proof-Of-Work ... - Nasdaq",
        "content": "Semiconductor companies NVIDIA Corp (NASDAQ:NVDA) and Advanced Micro Devices Inc (NASDAQ:AMD), known for their graphics processing units (GPUs), saw their stock prices benefiting from the boom in cryptocurrencies.\n\nWhat Happened: These GPUs, originally designed for high-end video game graphics, have now become essential for computationally intensive applications such as data centers, artificial intelligence, and the creation of crypto assets.\n\nCryptography and blockchain creation require substantial computational power, making GPUs an ideal choice for these tasks. In 2018, as cryptocurrency prices soared, miners rushed to purchase GPUs, driving up the stock prices of Nvidia and AMD. GPUs played a vital role in the creation and management of crypto assets, to the extent that Nvidia even introduced a dedicated lineup of chips specifically for crypto mining in early 2021.\n\nThe Merge and Proof-of-Stake Approach\n\nThe Ethereum Foundation on September 15, 2022, completed “The Merge” process, which means Ethereum was switched from a Proof-of-Work (PoW) consensus mechanism to Proof-of-Stake (PoW).\n\nWith this development, the validation of new transaction blocks no longer relies on hardware mining, making the millions of high-end graphics cards previously used for this purpose redundant. Consequently, a large number of these GPUs were expected to flood the used card market.\n\nHowever, since 2023, the AI industry experienced a remarkable upswing. With machine learning at the forefront, AI applications penetrated diverse sectors, capturing investors’ attention and fueling the sector’s success.\n\nAccording to PwC, the potential economic impact of AI is substantial, with an anticipated contribution of $15.7 trillion to the global economy by 2030. This projection encompasses a $6.6 trillion boost in productivity and a staggering $9.1 trillion surge in consumption.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nSee More: A Stay At The Floating Palace From James Bond's ‘Octopussy\n\nExamining the performance of both AMD and NVDA in the aftermath of “The Merge,” we delve into which of these stocks emerged as the stronger contender.\n\nNVDA vs AMD: Price Performance Comparison\n\nPerformance-wise, both Nvidia (NVDA) and AMD have witnessed significant changes in their stock prices over the past year.\n\nAs of September 15, 2022, NVDA’s stock price increased by 215.61% ($129.21 to $407.8), while AMD’s stock price rose by 28.49% ($76.66 to $98.5).\n\nNVDA Or AMD: 1 Year Performance (Photo: Benzinga)\n\nNVDA vs AMD: Returns Comparison\n\nWhen it comes to returns, a $1000 investment in NVDA would have resulted in a final value of $3156.08, whereas the same investment in AMD would have yielded $1284.89.\n\nNVDA Or AMD: Which Offers Better Returns? (Photo: Benzinga)\n\nCo-Movement of NVDA and AMD\n\nHistorically, NVDA and AMD have shared a reasonably high correlation in their stock price movements. The coefficient of determination (R2) between the two stocks is calculated to be 0.8464, suggesting a strong relationship between their price fluctuations.\n\nDo NVDA And AMD Often Move Together? (Photo: Benzinga)\n\nPrice Action: At the time of writing, ETH was trading at $1,785.941 up 0.66% in the last 24 hours, according to Benzinga Pro. During Tuesday’s session, AMD closed at $98.50, showing a positive gain of $2.32 (2.41%), while Nvidia ended at $407.80, recording a slight decrease of $3.81 (0.93%).\n\nImage Source – Shutterstock\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9pbnRyb2R1Y2luZy1jaGltcHotdWx0aW1hdGUtc2FmZS1oYXZlbi0xNzAwMDAzNDguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Introducing $CHIMPZ: The Ultimate Safe Haven for Risk-Takers on Ethereum Blockchain - Yahoo Finance",
        "content": "Chimpz\n\nGeorge Town, Cayman Islands, Nov. 01, 2023 (GLOBE NEWSWIRE) -- In an exciting leap towards the moon, $CHIMPZ , the crypto community's newest sensation, is thrilled to announce its upcoming launch on the Ethereum Blockchain. This digital sanctuary for risk-takers worldwide is set to redefine the world of cryptocurrencies and propel its community into the next moon mission.\n\nInspired by the historic journey of Ham the Chimp, Chimpz is a cryptocurrency project dedicated to risk-takers and daredevils who are ready to join the ranks of the audacious. Just as Ham challenged the boundaries of space exploration, Chimpz challenges the conventional in the world of crypto. It's time for the primates to take over.\n\nSuccessful Presale and Anticipated Launch\n\n$CHIMPZ recently conducted a groundbreaking presale event on PinkSale, garnering significant interest and support from investors, enthusiasts, and risk-takers who are ready for the adventure of a lifetime.\n\nWith the presale completed, $CHIMPZ now gears up for the grand moment that the crypto world has been waiting for. $CHIMPS is scheduled to launch on Uniswap on November 01, 2023, 18:00 UTC. This exciting milestone is just around the corner, and the project thrilled to invite everyone to be part of the journey.\n\nChimpz - More Than Just a Token\n\nChimpz, with its symbol $CHIMPZ, is more than just a token; it's a ticket to an exclusive community. As a $CHIMPZ holder, users can gain access to a private Discord group where they can engage with peers, chart analysts, and the Chimpz team directly. This exclusive membership offers a gateway to future ICOs, NFT whitelists, early alpha releases, and risk management groups.\n\nIn a world where opportunities often seem reserved for the privileged few, Chimpz levels the playing field, allowing everyone to be a part of this exciting journey.\n\nUnwavering Security and Transparency\n\nChimpz takes financial safety seriously. The project has partnered with industry leaders such as InterFi, BlockSaFu, Coinscope, SolidProof, and Consult for contract security. With their backing, Chimpz is fortified against potential risks, ensuring a secure and reliable environment for its community.\n\nStory continues\n\nAdditionally, Chimpz has teamed up with Pinksale for its presale and KYC verification, adding an extra layer of security and trust. Ownership will be renounced post-launch, and liquidity will be locked for an entire year.\n\nTokenomics - A Win-Win for Everyone\n\nChimpz boasts a total supply of 1,000,000,000 tokens and an impressive array of features to safeguard its community. The contract comes equipped with Anti-Bot, Anti-Sandwich, Anti-Gas, and Safu Code, all developed by the renowned contract creator Trynos.\n\nThe tax structure at launch is designed to benefit all holders. There is a 3% fee for both purchases and sales, with 2% allocated for long-term marketing and development. The remaining 1% is distributed as reflections to holders, effectively putting the power in the hands of the Chimpz community.\n\nChimpz - A Community of Dreamers\n\nChimpz's mission revolves around three core pillars: Security, Transparency, and Inclusivity. This project isn't just about making money; it's about creating a supportive ecosystem where individuals from all backgrounds can come together and thrive.\n\n100x Potential in 2023?\n\nThe burning question on everyone's mind: Does Chimpz have the potential to soar to new heights in 2023? With a successful presale, and the official launch scheduled for November 1, 2023, 18:00 UTC, the Chimpz team is gearing up for an exciting ride.\n\nThe presale funds are allocated wisely, with 60% going into the liquidity pool, ensuring stability and sustainability, and 40% will be distributed in various ways to further propel Chimpz:\n\nMarketing/Partnerships (20%): A significant portion will be invested in marketing and forging strategic partnerships to boost the project's visibility and reach.\n\nDapp Development (10%): Innovation is at the heart of Chimpz. The funds allocated for Dapp development will ensure that the Chimpz ecosystem continues to evolve, providing exciting opportunities for its community.\n\nInitial CEX Funds (10%): To make Chimpz accessible to a broader audience, 10% of the funds will be allocated to initial Centralized Exchange listings.\n\nIn a world where cryptocurrencies have the potential to change lives, Chimpz emerges as a project that combines audacious dreams with solid fundamentals. The potential for 100x gains in 2023 is an exciting prospect, and the Chimpz team is dedicated to making this journey a reality for its community.\n\nDon't miss the opportunity to join the Chimpz community and become a part of a revolution in the world of crypto. Visit the Chimpz website at https://www.chimpzerc.com/ , and connect with them on Twitter ( https://twitter.com/ChimpzERC ) and Telegram ( https://t.me/ChimpzPortal ). The moon is waiting, and the Chimpz are ready to take you there. Apes together strong!\n\nAbout Chimpz\n\nChimpz is more than just a cryptocurrency; it's a daring mission inspired by the legendary journey of Ham the Chimp. It has created a vibrant, inclusive community for risk-takers and crypto enthusiasts who dare to dream big. Holding $CHIMPZ not only gives users a ticket to the exclusive Discord, where they can connect with peers and experts but also grants them priority access to exciting ICOs, NFT whitelists, and early alpha releases.\n\nCHIMPZ’s commitment to security, transparency, and inclusivity sets Chimpz apart, ensuring that the audacious dreams of our community members are within reach.\n\nWebsite | Twitter | Telegram | Discord\n\n\n\nhttps://www.chimpzerc.com/\n\n\n\nDisclaimer: This announcement is not directed at any investors or potential investors, and does not constitute an offer to sell — or a solicitation of an offer to buy — any securities or cryptocurrencies, and may not be used or relied upon in evaluating the merits of any investment. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in this release are subject to change without notice. The contents herein should not be construed as or relied upon in any manner as investment, legal, tax, or other advice.\n\nCONTACT: Macho Randy Chimpz contact(at)chimpzerc.com\n\n\n\n"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9pbnRyb2R1Y2luZy1jaGltcHotdWx0aW1hdGUtc2FmZS1oYXZlbi0xNzAwMDAzNDguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Introducing $CHIMPZ: The Ultimate Safe Haven for Risk-Takers on Ethereum Blockchain - Yahoo Finance",
        "content": "Chimpz\n\nGeorge Town, Cayman Islands, Nov. 01, 2023 (GLOBE NEWSWIRE) -- In an exciting leap towards the moon, $CHIMPZ , the crypto community's newest sensation, is thrilled to announce its upcoming launch on the Ethereum Blockchain. This digital sanctuary for risk-takers worldwide is set to redefine the world of cryptocurrencies and propel its community into the next moon mission.\n\nInspired by the historic journey of Ham the Chimp, Chimpz is a cryptocurrency project dedicated to risk-takers and daredevils who are ready to join the ranks of the audacious. Just as Ham challenged the boundaries of space exploration, Chimpz challenges the conventional in the world of crypto. It's time for the primates to take over.\n\nSuccessful Presale and Anticipated Launch\n\n$CHIMPZ recently conducted a groundbreaking presale event on PinkSale, garnering significant interest and support from investors, enthusiasts, and risk-takers who are ready for the adventure of a lifetime.\n\nWith the presale completed, $CHIMPZ now gears up for the grand moment that the crypto world has been waiting for. $CHIMPS is scheduled to launch on Uniswap on November 01, 2023, 18:00 UTC. This exciting milestone is just around the corner, and the project thrilled to invite everyone to be part of the journey.\n\nChimpz - More Than Just a Token\n\nChimpz, with its symbol $CHIMPZ, is more than just a token; it's a ticket to an exclusive community. As a $CHIMPZ holder, users can gain access to a private Discord group where they can engage with peers, chart analysts, and the Chimpz team directly. This exclusive membership offers a gateway to future ICOs, NFT whitelists, early alpha releases, and risk management groups.\n\nIn a world where opportunities often seem reserved for the privileged few, Chimpz levels the playing field, allowing everyone to be a part of this exciting journey.\n\nUnwavering Security and Transparency\n\nChimpz takes financial safety seriously. The project has partnered with industry leaders such as InterFi, BlockSaFu, Coinscope, SolidProof, and Consult for contract security. With their backing, Chimpz is fortified against potential risks, ensuring a secure and reliable environment for its community.\n\nStory continues\n\nAdditionally, Chimpz has teamed up with Pinksale for its presale and KYC verification, adding an extra layer of security and trust. Ownership will be renounced post-launch, and liquidity will be locked for an entire year.\n\nTokenomics - A Win-Win for Everyone\n\nChimpz boasts a total supply of 1,000,000,000 tokens and an impressive array of features to safeguard its community. The contract comes equipped with Anti-Bot, Anti-Sandwich, Anti-Gas, and Safu Code, all developed by the renowned contract creator Trynos.\n\nThe tax structure at launch is designed to benefit all holders. There is a 3% fee for both purchases and sales, with 2% allocated for long-term marketing and development. The remaining 1% is distributed as reflections to holders, effectively putting the power in the hands of the Chimpz community.\n\nChimpz - A Community of Dreamers\n\nChimpz's mission revolves around three core pillars: Security, Transparency, and Inclusivity. This project isn't just about making money; it's about creating a supportive ecosystem where individuals from all backgrounds can come together and thrive.\n\n100x Potential in 2023?\n\nThe burning question on everyone's mind: Does Chimpz have the potential to soar to new heights in 2023? With a successful presale, and the official launch scheduled for November 1, 2023, 18:00 UTC, the Chimpz team is gearing up for an exciting ride.\n\nThe presale funds are allocated wisely, with 60% going into the liquidity pool, ensuring stability and sustainability, and 40% will be distributed in various ways to further propel Chimpz:\n\nMarketing/Partnerships (20%): A significant portion will be invested in marketing and forging strategic partnerships to boost the project's visibility and reach.\n\nDapp Development (10%): Innovation is at the heart of Chimpz. The funds allocated for Dapp development will ensure that the Chimpz ecosystem continues to evolve, providing exciting opportunities for its community.\n\nInitial CEX Funds (10%): To make Chimpz accessible to a broader audience, 10% of the funds will be allocated to initial Centralized Exchange listings.\n\nIn a world where cryptocurrencies have the potential to change lives, Chimpz emerges as a project that combines audacious dreams with solid fundamentals. The potential for 100x gains in 2023 is an exciting prospect, and the Chimpz team is dedicated to making this journey a reality for its community.\n\nDon't miss the opportunity to join the Chimpz community and become a part of a revolution in the world of crypto. Visit the Chimpz website at https://www.chimpzerc.com/ , and connect with them on Twitter ( https://twitter.com/ChimpzERC ) and Telegram ( https://t.me/ChimpzPortal ). The moon is waiting, and the Chimpz are ready to take you there. Apes together strong!\n\nAbout Chimpz\n\nChimpz is more than just a cryptocurrency; it's a daring mission inspired by the legendary journey of Ham the Chimp. It has created a vibrant, inclusive community for risk-takers and crypto enthusiasts who dare to dream big. Holding $CHIMPZ not only gives users a ticket to the exclusive Discord, where they can connect with peers and experts but also grants them priority access to exciting ICOs, NFT whitelists, and early alpha releases.\n\nCHIMPZ’s commitment to security, transparency, and inclusivity sets Chimpz apart, ensuring that the audacious dreams of our community members are within reach.\n\nWebsite | Twitter | Telegram | Discord\n\n\n\nhttps://www.chimpzerc.com/\n\n\n\nDisclaimer: This announcement is not directed at any investors or potential investors, and does not constitute an offer to sell — or a solicitation of an offer to buy — any securities or cryptocurrencies, and may not be used or relied upon in evaluating the merits of any investment. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in this release are subject to change without notice. The contents herein should not be construed as or relied upon in any manner as investment, legal, tax, or other advice.\n\nCONTACT: Macho Randy Chimpz contact(at)chimpzerc.com\n\n\n\n"
    }
]