[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wOC8xMS92aXNhLWV5ZXMtbWFzcy1hZG9wdGlvbi1vZi1jcnlwdG8tYnktdGVzdGluZy1tZXRob2Qtb2YtcGF5aW5nLW9uLWNoYWluLWdhcy1mZWVzLXRocm91Z2gtZmlhdC_SAY4BaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDgvMTEvdmlzYS1leWVzLW1hc3MtYWRvcHRpb24tb2YtY3J5cHRvLWJ5LXRlc3RpbmctbWV0aG9kLW9mLXBheWluZy1vbi1jaGFpbi1nYXMtZmVlcy10aHJvdWdoLWZpYXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Visa Tests Way to Make Paying Ethereum Gas Fees Easier - CoinDesk",
        "content": "To bridge the gap, Visa suggests leveraging Ethereum’s ERC-4337, the current standard that enables smart contracts on the blockchain to serve as wallets via a process called \"account abstraction,\" and a paymaster contract — a smart-contract account that can sponsor gas fees on behalf of the user. The service would allow users to use a Visa card to pay directly for gas fees."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3Zpc2EtcGF5LWdhcy1mZWVzLWNhcmTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Ethereum gas fees? Charge it, please! Visa proposes to let you pay with card - Blockworks",
        "content": "Visa has wrapped up testing a way for users to pay on-chain gas fees directly in fiat with a credit or debit card, the payments giant said on Thursday.\n\nThe experiment, which was conducted on the Ethereum Goerli testnet, uses a paymaster contract to sponsor gas fees on behalf of users, according to a statement.\n\nIt means users can send blockchain transactions without having to worry about maintaining a balance of ether. Visa believes the contract could make transactions more accessible to a wider range of users.\n\n“Our experiment aims to offer a promising approach to substantially addressing the challenges of blockchain-based transactions,” Visa’s technical team wrote. “By leveraging the innovative concept of a paymaster, in conjunction with account abstraction and the ERC-4337 standard, we explored the potential for a process that could redefine blockchain-based transactions.”\n\nA paymaster contract is a specialized type of smart contract within the blockchain ecosystem, designed to manage the payment of gas fees.\n\nThe company said merchants or decentralized applications (dapps) could run their own paymaster solution, or existing wallet and paymaster service providers could offer a card-based gas fee payment choice alongside their other paymaster offerings.\n\nThe experiment is part of Visa’s ongoing development within the industry. The company has been working on ways to make blockchain payments more user-friendly and accessible.\n\nVisa reportedly began experimenting with converting digital assets into fiat payments on the Ethereum blockchain earlier this year. The aim is to parallel its current foreign currency exchange processes, as part of its broader push to build proficiency in global settlements involving both digital and traditional currencies.\n\nIn the context of transactions on blockchains like Ethereum, every operation conducted incurs a cost known as a “gas” fee, representing the computational effort required to execute the operation. Gas fees help keep the Ethereum network secure by making it costly for bad actors to spam the network.\n\nSince inception, network fees have been a fundamental part of ensuring security and encouraging adoption within first-generation blockchain systems. Though, following ten years of user growth, the hope is the trajectory of Web3 will move towards a “gasless” future.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMirgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vaW5kdXN0cnkvYmFua2luZy9maW5hbmNlL2FuYWx5c3RzLWJ1bGxpc2gtb24tZXRoZXJldW0tZXRmcy1idXQtaG93LWlzLWV0aC1wZXJmb3JtaW5nLXBvbWVyZG9nZS1wcmVkaWN0ZWQtdG8tMjAwMC1pbi0yMDIzL2FydGljbGVzaG93LzEwMjY1NDgxNS5jbXPSAbIBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL2luZHVzdHJ5L2JhbmtpbmcvZmluYW5jZS9hbmFseXN0cy1idWxsaXNoLW9uLWV0aGVyZXVtLWV0ZnMtYnV0LWhvdy1pcy1ldGgtcGVyZm9ybWluZy1wb21lcmRvZ2UtcHJlZGljdGVkLXRvLTIwMDAtaW4tMjAyMy9hbXBfYXJ0aWNsZXNob3cvMTAyNjU0ODE1LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Analysts Bullish on Ethereum ETFs, but How Is ETH Performing? Pomerdoge Predicted to 2,000% In 2023 - The Economic Times",
        "content": "The narratives shaping the crypto market are quite intriguing. There appears to be a glimmer of hope for Ethereum ETFs as analysts have predicted its bullishness. On the flip side, Ethereum (ETH) performance has come under intense scrutiny as a result of the crypto market volatility.\n\nAmid these uncertain times, Pomerdoge (POMD), a new project , has surfaced in the crypto space with promising gains that captivate the minds of investors.\n\nClick Here To Find Out More About The Pomerdoge (POMD)\n\nEthereum ETFs (ETF) Set to Stay Bullish by Analysts' Projection\n\nModeled after the success of Bitcoin ETFs, Ethereum has come up with another exciting investment option that allows investors to trade on the stock exchange. The Ethereum ETFs which came up as a result of the Volatility Shares filing in June have heightened the intense competition between Bitcoin and Ethereum.\n\nCrypto experts are predicting that Ethereum ETFs may likely remain on the upward trajectory due to these factors. First, ETFs can be traded on the stock exchange which seems easier and more convenient for investors.\n\nSecondly, ETFs are an investment option that is secure and regulated. It can serve as an entry point for investors and financial institutions who may not be in sync with traditional cryptocurrency exchanges. By leveraging the ETH price and attracting more investors, ETH is expected to remain bullish.\n\nHow Is Ethereum (ETH) Shaping Up in Terms of Performance\n\nAfter the early 2023 bull run in which many crypto tokens receive price boost, the reality of the current market is beginning to set in. Ethereum which had jumped the $2000 mark during the bull is now back to its pre-bull run price, with the current price trading at $1832.\n\nDespite this upheaval, experts are predicting a bullish run for Ethereum, with some analysts expecting it to outshine Bitcoin in the next bull run.\n\nWhile giving the reason for this perspective, the Chicago Mercantile Exchange (CME) Group stated that the Bitcoin halving which is expected to happen next April and the massive adoption of Ethereum by financial institutions is an obvious sign that Ethereum will bounce back to the $2000 threshold.\n\nPomerdoge (POMD) Set to Dethrone SHIB and DOGE\n\nAnalysts remain bullish on Pomerdoge, a new project bringing new ideas into the gaming industry. Pomerdoge is a newly built gaming platform that allows players to compete, interact and network globally. The platform will allow players through its Pomerplace marketplace to transact in-game assets like NFTs, cards and avatars.\n\nPomerdoge has also developed a utility token that will serve as a transaction token on the platform. Those who purchase the token at presale value will have access to the collection of 7,777 NFTs when they are launched.\n\nPOMD holders will also be able to acquire a certain percentage that is commensurate with their token worth from the platform game revenue. To vouchsafe investors' assets, Pomerdoge has undergone auditing by SolidProof and Cyberscope.\n\nAnalysts are predicting that POMD will skyrocket by 2,000% before the end of the year.\n\nFind out more about the Pomerdoge (POMD) Today\n\nWebsite: https://pomerdoge.com/\n\nTelegram Community: https://t.me/pomerdoge\n\nDisclaimer:\n\nThis is an advertorial. BCCL disclaims any and all warranties - expressed or implied - relating to the content and does not guarantee, vouch for, or endorse any of the content. The content does not promote, suggest or present Crypto products to be a way to solve financial difficulties / achieve financial security / act as an alternative to employment / income opportunity. Crypto products, crypto currencies, NFTs are unregulated and may be risky, with no legal recourse in case of monetary loss. Views expressed herein are independent opinions based on studies. You may act at your own risk while relying on the content of this advertorial. Should you make a decision to act, or omit to act, you should seek appropriate legal advice in the relevant jurisdiction.\n\nDisclaimer: Content Produced by IPD"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMirgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vaW5kdXN0cnkvYmFua2luZy9maW5hbmNlL2FuYWx5c3RzLWJ1bGxpc2gtb24tZXRoZXJldW0tZXRmcy1idXQtaG93LWlzLWV0aC1wZXJmb3JtaW5nLXBvbWVyZG9nZS1wcmVkaWN0ZWQtdG8tMjAwMC1pbi0yMDIzL2FydGljbGVzaG93LzEwMjY1NDgxNS5jbXPSAbIBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL2luZHVzdHJ5L2JhbmtpbmcvZmluYW5jZS9hbmFseXN0cy1idWxsaXNoLW9uLWV0aGVyZXVtLWV0ZnMtYnV0LWhvdy1pcy1ldGgtcGVyZm9ybWluZy1wb21lcmRvZ2UtcHJlZGljdGVkLXRvLTIwMDAtaW4tMjAyMy9hbXBfYXJ0aWNsZXNob3cvMTAyNjU0ODE1LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "Analysts Bullish on Ethereum ETFs, but How Is ETH Performing? Pomerdoge Predicted to 2,000% In 2023 - The Economic Times",
        "content": "The narratives shaping the crypto market are quite intriguing. There appears to be a glimmer of hope for Ethereum ETFs as analysts have predicted its bullishness. On the flip side, Ethereum (ETH) performance has come under intense scrutiny as a result of the crypto market volatility.\n\nAmid these uncertain times, Pomerdoge (POMD), a new project , has surfaced in the crypto space with promising gains that captivate the minds of investors.\n\nClick Here To Find Out More About The Pomerdoge (POMD)\n\nEthereum ETFs (ETF) Set to Stay Bullish by Analysts' Projection\n\nModeled after the success of Bitcoin ETFs, Ethereum has come up with another exciting investment option that allows investors to trade on the stock exchange. The Ethereum ETFs which came up as a result of the Volatility Shares filing in June have heightened the intense competition between Bitcoin and Ethereum.\n\nCrypto experts are predicting that Ethereum ETFs may likely remain on the upward trajectory due to these factors. First, ETFs can be traded on the stock exchange which seems easier and more convenient for investors.\n\nSecondly, ETFs are an investment option that is secure and regulated. It can serve as an entry point for investors and financial institutions who may not be in sync with traditional cryptocurrency exchanges. By leveraging the ETH price and attracting more investors, ETH is expected to remain bullish.\n\nHow Is Ethereum (ETH) Shaping Up in Terms of Performance\n\nAfter the early 2023 bull run in which many crypto tokens receive price boost, the reality of the current market is beginning to set in. Ethereum which had jumped the $2000 mark during the bull is now back to its pre-bull run price, with the current price trading at $1832.\n\nDespite this upheaval, experts are predicting a bullish run for Ethereum, with some analysts expecting it to outshine Bitcoin in the next bull run.\n\nWhile giving the reason for this perspective, the Chicago Mercantile Exchange (CME) Group stated that the Bitcoin halving which is expected to happen next April and the massive adoption of Ethereum by financial institutions is an obvious sign that Ethereum will bounce back to the $2000 threshold.\n\nPomerdoge (POMD) Set to Dethrone SHIB and DOGE\n\nAnalysts remain bullish on Pomerdoge, a new project bringing new ideas into the gaming industry. Pomerdoge is a newly built gaming platform that allows players to compete, interact and network globally. The platform will allow players through its Pomerplace marketplace to transact in-game assets like NFTs, cards and avatars.\n\nPomerdoge has also developed a utility token that will serve as a transaction token on the platform. Those who purchase the token at presale value will have access to the collection of 7,777 NFTs when they are launched.\n\nPOMD holders will also be able to acquire a certain percentage that is commensurate with their token worth from the platform game revenue. To vouchsafe investors' assets, Pomerdoge has undergone auditing by SolidProof and Cyberscope.\n\nAnalysts are predicting that POMD will skyrocket by 2,000% before the end of the year.\n\nFind out more about the Pomerdoge (POMD) Today\n\nWebsite: https://pomerdoge.com/\n\nTelegram Community: https://t.me/pomerdoge\n\nDisclaimer:\n\nThis is an advertorial. BCCL disclaims any and all warranties - expressed or implied - relating to the content and does not guarantee, vouch for, or endorse any of the content. The content does not promote, suggest or present Crypto products to be a way to solve financial difficulties / achieve financial security / act as an alternative to employment / income opportunity. Crypto products, crypto currencies, NFTs are unregulated and may be risky, with no legal recourse in case of monetary loss. Views expressed herein are independent opinions based on studies. You may act at your own risk while relying on the content of this advertorial. Should you make a decision to act, or omit to act, you should seek appropriate legal advice in the relevant jurisdiction.\n\nDisclaimer: Content Produced by IPD"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vaW5ub3ZhdGlvbi1jaXJjbGUvdGhlLW5leHQtYmlnLWxlYXAtZm9yLWV0aGVyZXVtLWxpcXVpZC1zdGFraW5nLXRoZS1zdGFraW5nLWxhbmRzY2FwZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "The next big leap for Ethereum liquid staking: The staking landscape - Cointelegraph",
        "content": "Imagine a world where everyone, regardless of their background, can easily access and participate in the revolutionary world of Ethereum. A world where decentralized applications empower individuals, and the potential for innovation knows no bounds. Against a highly equivocal and chaotic macroeconomic landscape, this is the world that the prophets of Ethereum dream of.\n\nBut little do they know this world is like an unrealized dream. Why? Let’s dig deeper.\n\nReflecting on the Ethereum liquid staking landscape\n\nCentralized liquid staking protocols are at the forefront of the liquid staking revolution on Ethereum, and it shouldn’t come as a surprise. Why? Because they are highly scalable — thanks to the centralized validator set that they have. The biggest liquid staking protocol on Ethereum currently has a limited node operator set of 29 operators. It must then be a no-brainer that they hold a hegemony over the network. Any protocol claiming to be decentralized but running its operations as a business is also able to offer much higher standards of composability. While this composability that is offered to users is a feature, it can be counter-productive as well — primarily because of the systemic risks this can cause.\n\nOn the flip side, decentralized protocols do exist, but they are highly unscalable. And thus, they have a fraction of ETH staked in them compared to what is often staked via the centralized ones.\n\nWhile decentralized protocols have attempted to reduce the minimum capital required to run a validator node from 32 to 8 ETH, that is still a sizeable amount for the wider ecosystem. Admittedly, this does open up opportunities for a wide number of stakers to start staking on the network, however, we contend that 8 ETH is still a sizeable amount. This reintroduces the problem of scalability, and thus a significant portion of ETH gets staked through a select group of professional node operators. This leads to the further concentration of staked ETH. The presence of these centralized node operators across different liquid staking protocols undermines the censorship resistance of the underlying network.\n\nThe inflow of ETH post-Shapella is a good indicator of users’ liquid staking preferences. One would hope that a lot of the incoming ETH would go to decentralized liquid staking; however, the figures state otherwise.\n\nMaking Ethereum liquid staking scalable\n\nOne of the biggest challenges for the existing liquid staking protocols today is that they are tuned for either scalability alone or decentralization alone. The ones that are tuned for scalability alone are not decentralized, and the ones that are tuned for decentralization are not scalable. There are several examples of this — from protocols having a concentrated node operator set to those having high minimum capital requirements to run validator nodes for Ethereum.\n\nWhile there have been attempts by these protocols to move towards either making their architectures scalable or decentralized, making that is quite difficult given the huge amounts of ETH that are already staked via them. Moreover, these protocol-level changes require a lot of internal deliberations (at-least for decentralized protocols) before they are rolled out.\n\nMoreover, a core objective of any business is to make sure that they hold the hegemony over the industry to persistently retain that. This is reflected by the feigned attempts at a willingness to decentralize — but then having them falling on their head. Perhaps, there is no reason why this would happen. A centralized liquid staking protocol often operates as a business whose core objective is to compromise decentralization to achieve profitability. While I do not condemn the latter, I do feel that it comes — almost always — at the cost of decentralization.\n\nWhat Ethereum needs\n\nEthereum prophets often call for the need to diversify staking across a multitude of protocols. And perhaps, it wouldn’t be remiss to credit those protocols that have emerged that are attempting to realize that vision. However, I must provide a caveat that any emerging protocols need strategic and critical analysis. No one would want shabby architecture being polished and presented as a resilient solution and risking the stability of Ethereum. I believe that there are two things that need immediate attention to drive growth to Ethereum liquid staking:\n\nReducing the minimum capital requirements to run a validator node: This is perhaps easier stated than executed. Reducing the minimum capital requirements incentivizes a wider spectrum of users to participate in network validation.\n\nThis is perhaps easier stated than executed. Reducing the minimum capital requirements incentivizes a wider spectrum of users to participate in network validation. Building censorship resistance: This is perhaps common knowledge, but it often gets overlooked. With the pace at which the macroeconomic landscape is evolving, it is a dire need for protocols to integrate solutions that build the censorship resilience of the protocol. This is akin to hedging against potential future slowdowns in validator architecture and building a high-performant architecture that keeps the network secure.\n\nAdmittedly, I find myself at crossroads while writing these solutions because, while I assert that being aware of the existing challenges as well as the solutions is of paramount importance, it is not enough to persistently echo them. It is essential that we engage in extensive research and relentlessly test and build solutions that help solve these challenges and build a resilient architecture.\n\nMohak is the founder of ClayStack. He is an entrepreneur, investor, and a leader in the staking and liquid staking space.\n\nMohak is the founder of ClayStack. He is an entrepreneur, investor, and a leader in the staking and liquid staking space."
    }
]