[
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzAxL2NyeXB0by1tYXJrZXQtZmVicnVhcnktcm91bmR1cC1iaXRjb2luLWxheWVyLTItcHJvdG9jb2wtc3RhY2tzLWV0aGVyZXVtLXN0YWtpbmctZGVyaXZhdGl2ZS10b2tlbnMtc3VyZ2Uv0gGYAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMDEvY3J5cHRvLW1hcmtldC1mZWJydWFyeS1yb3VuZHVwLWJpdGNvaW4tbGF5ZXItMi1wcm90b2NvbC1zdGFja3MtZXRoZXJldW0tc3Rha2luZy1kZXJpdmF0aXZlLXRva2Vucy1zdXJnZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Crypto Market February Roundup: Bitcoin Layer 2 Protocol Stacks, Ethereum Staking Derivative Tokens Surge - CoinDesk",
        "content": "“Altcoin cycles tend to be short-lived, but this is beyond the norm and has all the hallmarks of a bored market chasing opportunities, in addition to no new capital inflows,” he wrote, adding: “Poor liquidity facilitates this erratic pattern, and you do not want to be the one holding the bag when the music ends.”"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS10ZXN0bmV0LXN1Y2Nlc3NmdWxseS1mb3Jrcy1pbi1zaGFuZ2hhaS11cGdyYWRlLXJlaGVhcnNhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Ethereum testnet successfully forks in Shanghai upgrade rehearsal - Cointelegraph",
        "content": "The Ethereum blockchain’s Sepolia testnet has undergone a successful upgrade that simulates the upcoming Shanghai hard fork expected to take place on mainnet in March.\n\nThe “Shapella” upgrade, which combines the names of the upcoming Shanghai and Capella hard forks, was successfully implemented on the testnet on Feb. 28.\n\nSepolia testnet has successfully upgraded to Shapella!\n\n\n\nSome of the Prsym validators are offline due to the old geth version. They will come online in the next 10 mins!\n\n\n\nNext stop: Goerli pic.twitter.com/pb43Gq7w9C — terence.eth (@terencechain) February 28, 2023\n\nShanghai is the fork’s name on the execution layer client side and Capella is the upgrade name on the consensus layer client side. One of the major changes enables validators to withdraw their staked Ether from the Beacon Chain back to the execution layer.\n\nRelated: Lido Finance activates staking rate limit after more than 150,000 ETH staked\n\nValidators needed to stake 32 Ether (ETH) to validate on the Ethereum blockchain. They will now be able to withdraw rewards in excess of 32 ETH and be permitted to keep validating while those who wish to fully withdraw can take all 32 ETH plus rewards and cease validating.\n\nThe next step before the Shanghai fork goes live on the mainnet will be to release the upgrade on the Ethereum Goerli testnet, which is expected to commence in March."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLXRvZGF5LWV0aGVyZXVtLWRpcHMtYnktMC01MS1kZXNwaXRlLWFub3RoZXItc3RlcC1pbi1zaGFuZ2hhaS11cGdyYWRlL9IBbWh0dHBzOi8vY29pbmdhcGUuY29tL2V0aGVyZXVtLXByaWNlLXRvZGF5LWV0aGVyZXVtLWRpcHMtYnktMC01MS1kZXNwaXRlLWFub3RoZXItc3RlcC1pbi1zaGFuZ2hhaS11cGdyYWRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Ethereum Price Today: ETH Drops Despite Shanghai Upgrade Development - CoinGape",
        "content": "Ethereum Price Today: The market is trading in red today, as most of the significant coins see a decline. Investors are currently exercising caution when it comes to investing in riskier assets, primarily due to concerns surrounding mounting macroeconomic issues, which have been exacerbated by higher-than-anticipated inflation rates.\n\nThe global crypto market cap stands at 1.07 trillion USD, a decrease of 0.36% over the past day. The total crypto market volume in the last 24 hours increased by 28.36% and is currently at 45.38 billion USD.\n\nadvertisement\n\nEthereum (ETH) decreases by 0.51%\n\nThe second largest crypto, Ethereum price today dropped by 0.51% in the last 24 hours. The market cap for Ethereum is 199.31 billion USD. Moreover, trading volume increases by 14.87% over the previous 24 hours. Each ETH token is trading for 1,628 USD, holding on to the support level of 1600. Source: coinmarketcap\n\nA step further to Shanghai Upgrade\n\nThe Sepolia testnet, Ethereum’s second test network, has successfully replicated withdrawals of staked ether (ETH), marking a significant step towards the highly anticipated Shanghai Upgrade for the Ethereum blockchain. This upgrade, which was triggered at epoch 56832, allows validators to withdraw their stake from the Beacon Chain back to the execution layer and introduces new features to the execution and consensus layers.\n\nOnce implemented, the Shanghai Upgrade will signify Ethereum’s complete transition to a fully functional proof-of-stake network, enabling validators to withdraw rewards earned from adding or approving blocks to the blockchain. The announcement of the live and finalized Shapella network on the Sepolia testnet was shared by Ethereum developers and clients on Twitter. The next upgrade will occur on the Goerli testnet, followed by the mainnet, ultimately finalizing the Shanghai upgrade."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy92aXRhbGlrLWJ1dGVyaW4tc2F5cy1tb3JlLXN0aWxsLW5lZWRzLXRvLWJlLWRvbmUtb3Zlci1oaWdoLWV0aGVyZXVtLXR4bi1mZWVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Vitalik Buterin says 'more still needs to be done' over high Ethereum txn fees - Cointelegraph",
        "content": "In a new blog post published on Feb. 28, Ethereum co-founder Vitalik Buterin documented the continued need to improve the network to better facilitate Ether (ETH) as a means of payment.\n\nButerin shared how he tried to pay for tea for himself and friends at a coffee shop in Argentina in 2021 but had to pay 0.01 ETH (around $40 at the time), as that was the minimum deposit for the owner’s exchange account. “I did not mind the 3x overpayment and treated it as a tip,” the co-founder wrote.\n\nIn another instance, Buterin explained how he tried to pay for tea at another location in 2022, but two separate transactions failed due to requiring “extra gas to process the transfer” and a UI glitch in his mobile wallet. Buterin also raised the issue of unpredictable transaction times, writing:\n\n“Many times, there has been a surprisingly long time delay between my transaction getting accepted on-chain, and the service acknowledging the transaction, even as ‘unconfirmed.’ Some of those times, I definitely got worried that there was some glitch with the payment system on their side.”\n\nAccording to Buterin, outliers nevertheless remain on the Ethereum network despite recent improvements. “If you send a transaction at the same time as when many others are sending transactions and the base fee is spiking up, you risk the base fee going too high and your transaction not getting accepted,” he wrote. “Even worse, wallet UIs suck at showing this. There are no big red flashing alerts, and very little clear indication of what you’re supposed to do to solve this problem.” Buterin added that even experts could be confused about how to speed up transactions in such cases.\n\n“Good user experience is not about the average case, it is about the worst case. A UI that is clean and sleek, but does some weird and unexplainable thing 0.723% of the time that causes big problems, is worse than a UI that exposes more gritty details to the user but at least makes it easier to understand what’s going on and fix any problem that does arise.”\n\nAmong other issues, Buterin raised the problem of the internet being “not 100% reliable” and the need for possible offline proof that customers indeed transfered their transaction data directly to the merchant. Another issue raised was “losing a small amount of BTC and ETH” due to secret-sharing-based off-chain social recovery methods for wallets, which Buterin deemed as fragile.\n\nAccording to YCharts, Ethereum transaction fees have fallen to an average of $0.656 at the time of publication, which is much lower than the average of $20 witnessed during the peak of the crypto bull market in 2021.\n\n“Along with the all-important issue of high transaction fees due to scaling not yet being fully solved, user experience is a key reason why many Ethereum users, especially in the Global South, often opt for centralized solutions instead of on-chain decentralized alternatives that keep power in the hands of the user and their friends and family or local community.”"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vdGhlZGVmaWFudC5pby90cmFkZXJzLWlnbm9yZS1zaGlmdC10by1uZXctZXRoZXJldW0tdGVzdG5ldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 10:43:36 GMT",
        "title": "Traders Speculate on Goerli Even as Ethereum Devs Move On - The Defiant - DeFi News",
        "content": "Action Mounts on Goerli ETH Despite Switch to Holli Testnet\n\nBy: Samuel Haig • Loading...\n\nMarkets\n\nThe Goerli testnet may have given way to a new one, but that hasn’t stopped traders from speculating on the price of Goerli ETH.\n\nOn Sunday, Polygon’s Mudit Gupta flagged that GoETH were trading for $0.69 each. Hayden Adams, the founder of Uniswap, shared data showing that users traded $1.5M worth of GoETH over 24 hours.\n\nThis despite the fact that Ethereum’s devs are transitioning away from the Goerli network to a new testnet called Holli.\n\n“Testnet Ether is supposed to be free but is being marked up by speculators,” Gupta said. “Keyboard warriors will tell you that the developers are buying it but no, they are not. Maye 0.1% are buying for consumption.”\n\nExperiment With Code\n\nGoerli is a testnet used by developers to experiment with code before launching to the public on the Ethereum mainnet. GoETH is used to pay for transactions of the testnet.\n\nGoETH was initially freely distributed to users via “faucets,” websites that issue coins to users without charge. However, developers resorted to purchasing testnet coins amid a shortage last year. Without GoETH, devs cannot experiment on the test network, posing a threat to innovation on the Ethereum blockchain.\n\nGupta launched a faucet that distributed 6M GoETH for free. The coins he distributed would be worth $4M at current prices.\n\nDenali Marsh, a blockchain engineer for Kava Labs, said he bought 10 GoETH for testing last week.\n\n“I tried every faucet including yours, but swapping was the only way to get the amount I needed quickly,” Marsh tweeted. “Speculation on public utilities is gross but the market drives solutions.”\n\nGupta replied that monetizing testnet coins offers a short-term solution, but lamented that people have not invested the same resources into solving the underlying problem they’ve spent on devising methods to profit from it.\n\nThe GoETH speculation comes despite Ethereum’s devs making plans to abandon the test network. “Y’all know [Goerli is] deprecated and soon to be fully unsupported testnet right?” Adams tweeted.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nDifferent Strategies\n\nOn Feb 24, Tim Beiko of the Ethereum Foundation confirmed that a new testnet, Holli, will launch later this year to replace Goerli.\n\n“Over the years, application developers’ usage of testnets grew exponentially,” Beiko said. “The distribution methods for GoETH (informal allocations + easy-to-game faucets) became less and less reliable, leading to the current issues around acquiring GoETH.”\n\nBeiko said Ethereum’s devs are considering different strategies for issuing test tokens on Holli, urging community members to reach out with suggestions.\n\n“It’s really hard to fix live testnets, but fairly easy to set up the next ones with better starting conditions,” Beiko said. “If you have strong opinions about this, now’s a good time to make them heard.”"
    }
]