[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY5NTE3L3prc3luYy1vdXRwYWNlcy1ldGhlcmV1bS1pbi1tb250aGx5LXRyYW5zYWN0aW9uLXZvbHVtZS1wcm9wZWxsZWQtYnktaW5zY3JpcHRpb24tYWN0aXZpdHnSAYABaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjY5NTE3L3prc3luYy1vdXRwYWNlcy1ldGhlcmV1bS1pbi1tb250aGx5LXRyYW5zYWN0aW9uLXZvbHVtZS1wcm9wZWxsZWQtYnktaW5zY3JpcHRpb24tYWN0aXZpdHk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "zkSync outpaces Ethereum in monthly transaction volume, propelled by inscription activity - The Block",
        "content": "zkSync, a Layer 2 scaling solution for Ethereum, recorded more transactions than the Ethereum mainnet over a one-month period, processing 34.7 million transactions in the past 30 days.\n\nA total of 34.2 million transactions were recorded on Ethereum's mainnet during the same period, according to L2Beat data. Next in line was Arbitrum, which saw 31.4 million transactions over the past 30 days.\n\nThe recent rise in transaction volume on zkSync has been attributed to the spread of inscriptions — a feature originally created on Bitcoin — to EVM networks, including most Layer 2 chains.\n\nData from L2Beat highlights that zkSync experienced its biggest monthly transaction surge on Dec. 16. That's when sync inscription was rolled out on the network and constituted 4.6 million of the 5.3 million transactions that day alone, according to Dune data aggregated by Dragonfly analyst Hildobby.\n\nInscription-related transactions\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nzkSync operates as a Layer 2 network on the Ethereum mainnet. By bundling hundreds or thousands of transactions into a single cryptographic proof, it verifies transactions much faster and more cheaply than the mainnet.\n\nSince mid-December, inscription-related transactions have contributed to zkSync’s overall activity, helping it surpass both Ethereum and its Layer 2s.\n\nInscriptions are data embeds found in transaction call data, which, like Ordinals on Bitcoin, can be used to create alternate tokens and NFTs. Such tokens include Ethscriptions on Ethereum, Doginals on Dogecoin and Solana Inscriptions on Solana."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMivgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjgtZGVjZW1iZXItMjAyMy9hcnRpY2xlc2hvdy8xMDYzNDUxNDIuY21z0gHCAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZXMtdG9kYXktbGl2ZS1uZXdzLWJpdGNvaW4tZG9nZWNvaW4tZXRoZXJldW0tc2hpYmhhLWludS1jcnlwdG9jdXJyZW5jeS1sYXRlc3QtdXBkYXRlcy0yOC1kZWNlbWJlci0yMDIzL2FtcF9hcnRpY2xlc2hvdy8xMDYzNDUxNDIuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $43,000; Ethereum, Chainlink surge up to 13% - The Economic Times",
        "content": "The cryptocurrency markets were trading higher on Thursday as the US dollar and bond yields hit multi-month lows on mounting bets the Federal Reserve will start cutting interest rates as soon as next March.In Thursday's trade, the global cryptocurrency market cap surged 2.52% to around $1.69 trillion in the last 24 hours.At 12:46 p.m., BTC was trading 1.44% higher at $43,055, while Ethereum was up 6.9% at $2,379.BTC bounced back from the 20 EMA D and is holding above that, signalling a positive trend. Additionally, BTC dominance continues to decline, which is favourable for altcoins. BTC needs to clear the key resistance at $44,500 for further upward movement, said CoinDCX Research Team.Other popular altcoins, such as BNB, Cardano, and Chainlink gained 9-13%. On the other hand, Solana, Avalanche, Polkadot, Polygon, and Toncoin declined by up to 6%.The total volume in DeFi is currently $8.64 billion, 10.63% of the total crypto market 24-hour volume. The volume of all stablecoins is now $71.94 billion, which is 88.52% of the total crypto market 24-hour volume.Bitcoin's dominance is currently 49.93%, according to CoinMarketCap. BTC volume in the last 24 hours fell 6.53% to $25.89 billion.\"Optimism prevails among market participants, particularly with MicroStrategy's addition of more Bitcoin to its holdings on Wednesday. BTC faces immediate resistance at the US$43,700 level, while support is evident at the US$43,300 level,\" said Edul Patel, CEO of Mudrex.Bitcoin is at a pivotal point, currently trading around $42,992. It appears to be stabilizing after recent fluctuations, facing resistance at $43,990, $44,679, and $45,962, while finding support at $41,683, $40,649, and $39,378.Technical indicators like RSI (56) show moderate bullish sentiment, and MACD (0.006) slightly above its signal line hints at potential upward momentum. Notably, Bitcoin is above its 50-day EMA ($43,033), indicating a short-term bullish trend.The overall market trend looks cautiously optimistic above the $43,033 pivot point, suggesting a likelihood of testing higher resistance levels in the near term. Close monitoring of resistance levels is advised for market response.(You can now subscribe to our ETMarkets WhatsApp channel (Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of Economic Times)"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ncmF5c2NhbGUtY2VvLWZvcmVzZWVzLWJpdGNvaW4tcHJpY2UtMTUwMDAwNjQ3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Grayscale CEO Foresees Bitcoin Price Surging to $55k, Ethereum and Everlodge Poised for Substantial Growth - Yahoo Finance",
        "content": "News Direct NYC --News Direct-- Everlodge\n\nThe future for crypto still looks bright. Allied Market Research released a report that the cryptocurrency market value is about to triple by 2030, hitting a whopping $4.94 billion. What's fueling this crypto rocket? According to Allied, it's the focus of cryptocurrency on remittances and global payments taking the lead – put in one word, utility.\n\nFrom all indications, cryptocurrency is gearing up to be a big player in the future of global finance; but that's 7 years away from now according to the AMR. However, in the near term, investors are eager to know what lies ahead in 2024.\n\nNotably, Bitcoin (BTC), Ethereum (ETH), and the recently emerged presale utility-focused gem, Everlodge, have all demonstrated the potential for substantial returns. While the reasons behind their promising prospects are quite evident, let’s take a quick dive to see why these projects rank among the best crypto investments to consider ahead of 2024.\n\nGrayscale CEO Optimistic on Bitcoin While Crypto Wizard Target Remains $55,000 for Bitcoin in Q1 2024\n\nGrayscale CEO Michael Sonnenshein is seeing big potential for Bitcoin (BTC) once the U.S. Securities and Exchange Commission (SEC) gives the thumbs up to a spot market BTC exchange-traded fund (ETF).\n\nIn a recent CNBC interview, Sonnenshein, though not one to throw around price predictions, emphasizes the prevailing optimism in the market. According to him, a substantial number of investors are jumping on the Bitcoin bandwagon and integrating it into their portfolios. As we anticipate the potential approval of the ETF, he believes it will be a game-changer, unlocking opportunities for a significant portion of the investment community.\n\nAs per price predictions, analyst Crypto Wizard posted on X, talking about a potential dip in Bitcoin price below the $40k threshold in the weeks ahead. They note that in the event of any deviation from this prediction, a decisive break above $46k for Bitcoin would be the game-changer. Despite these short-term fluctuations, their overall target stands firm at $55k for Bitcoin price by the first quarter of 2024.\n\nStory continues\n\nEthereum Looks Bullish for 2024\n\nThe immense popularity of the Ethereum (ETH) network has positioned it among the leading altcoins in today's market. Its widespread appeal is not the only factor contributing to its positive sentiment; Ethereum also benefits from a history of resilience and market dominance.\n\nWith a current price of $2,230, Ethereum has experienced significant growth in the past month, reaching a peak of around $2,367 to mark the highest point of the year. While the overall bullish momentum in the cryptocurrency market may be waning, Ethereum price has managed to remain relatively stable, with a nearly 2% increase over the past week.\n\nHowever, considering the recent drop of over $100 from its peak, investors should be prepared for a potential further correction. Yet, given Ethereum's historical price resilience and strong market presence, it is reasonable to expect a more stable price trajectory leading up to the new year.\n\nEverlodge Has Lofty Plans To Take Charge in Q1 2024\n\nEverlodge (ELDG) emerged as a revolutionary force in the real estate realm, positioned to revolutionize the $280 trillion industry by tackling long-standing challenges. Traditionally, the prohibitively high entry costs, often reaching millions of dollars, combined with a lack of transparency and liquidity, have created barriers for numerous potential investors.\n\nEverlodge's DeFi property marketplace directly confronts these challenges within the travel property sector. Through the innovative approach of listing properties as NFTs on its platform, Everlodge introduces fractionalized ownership, allowing investors to purchase NFT fractions representing a percentage of a property. Imagine owning 25% of a property generating $6,000 monthly, resulting in a $1,500 passive income.\n\nIn essence, Everlodge not only breaks down barriers but also provides investors with the opportunity to access equity in some of the world's most luxurious travel properties and you can join in for only $0.027.\n\nFurthermore, industry experts predict a potential 10X surge in Everlodge's project valuation if the company successfully achieves crucial milestones. This projection highlights the anticipation surrounding Everlodge's transformative initiatives and underscores the potential for significant growth, positioning it as one of the best crypto investments leading up to 2024.\n\nLooking ahead, the probability of a positive upturn in cryptocurrency in 2024 is very much palpable and projects like Bitcoin, Ethereum, and Everlodge have everything to fight for to become the best coins to invest in 2024.\n\nFor more information about the ongoing Everlodge (ELDG) Presale, please visit their website.\n\nEverlodge provides you with a seamless approach to fractional investing in vacation rentals, eliminating the complexities associated with traditional real estate investment. Our innovative platform revolutionizes the way people invest in second homes.\n\nDigital currencies may be unregulated in your jurisdiction. The value of digital currencies may go down as well as up. Profits may be subject to capital gains or other taxes applicable in your jurisdiction.\n\nContact Details\n\nEverlodge group\n\nBrett Brown\n\nadmin@everlodge.io\n\nCompany Website\n\nhttps://everlodge.io/\n\nView source version on newsdirect.com: https://newsdirect.com/news/grayscale-ceo-foresees-bitcoin-price-surging-to-55k-ethereum-and-everlodge-poised-for-substantial-growth-871929946"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ncmF5c2NhbGUtY2VvLWZvcmVzZWVzLWJpdGNvaW4tcHJpY2UtMTUwMDAwNjQ3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Grayscale CEO Foresees Bitcoin Price Surging to $55k, Ethereum and Everlodge Poised for Substantial Growth - Yahoo Finance",
        "content": "News Direct NYC --News Direct-- Everlodge\n\nThe future for crypto still looks bright. Allied Market Research released a report that the cryptocurrency market value is about to triple by 2030, hitting a whopping $4.94 billion. What's fueling this crypto rocket? According to Allied, it's the focus of cryptocurrency on remittances and global payments taking the lead – put in one word, utility.\n\nFrom all indications, cryptocurrency is gearing up to be a big player in the future of global finance; but that's 7 years away from now according to the AMR. However, in the near term, investors are eager to know what lies ahead in 2024.\n\nNotably, Bitcoin (BTC), Ethereum (ETH), and the recently emerged presale utility-focused gem, Everlodge, have all demonstrated the potential for substantial returns. While the reasons behind their promising prospects are quite evident, let’s take a quick dive to see why these projects rank among the best crypto investments to consider ahead of 2024.\n\nGrayscale CEO Optimistic on Bitcoin While Crypto Wizard Target Remains $55,000 for Bitcoin in Q1 2024\n\nGrayscale CEO Michael Sonnenshein is seeing big potential for Bitcoin (BTC) once the U.S. Securities and Exchange Commission (SEC) gives the thumbs up to a spot market BTC exchange-traded fund (ETF).\n\nIn a recent CNBC interview, Sonnenshein, though not one to throw around price predictions, emphasizes the prevailing optimism in the market. According to him, a substantial number of investors are jumping on the Bitcoin bandwagon and integrating it into their portfolios. As we anticipate the potential approval of the ETF, he believes it will be a game-changer, unlocking opportunities for a significant portion of the investment community.\n\nAs per price predictions, analyst Crypto Wizard posted on X, talking about a potential dip in Bitcoin price below the $40k threshold in the weeks ahead. They note that in the event of any deviation from this prediction, a decisive break above $46k for Bitcoin would be the game-changer. Despite these short-term fluctuations, their overall target stands firm at $55k for Bitcoin price by the first quarter of 2024.\n\nStory continues\n\nEthereum Looks Bullish for 2024\n\nThe immense popularity of the Ethereum (ETH) network has positioned it among the leading altcoins in today's market. Its widespread appeal is not the only factor contributing to its positive sentiment; Ethereum also benefits from a history of resilience and market dominance.\n\nWith a current price of $2,230, Ethereum has experienced significant growth in the past month, reaching a peak of around $2,367 to mark the highest point of the year. While the overall bullish momentum in the cryptocurrency market may be waning, Ethereum price has managed to remain relatively stable, with a nearly 2% increase over the past week.\n\nHowever, considering the recent drop of over $100 from its peak, investors should be prepared for a potential further correction. Yet, given Ethereum's historical price resilience and strong market presence, it is reasonable to expect a more stable price trajectory leading up to the new year.\n\nEverlodge Has Lofty Plans To Take Charge in Q1 2024\n\nEverlodge (ELDG) emerged as a revolutionary force in the real estate realm, positioned to revolutionize the $280 trillion industry by tackling long-standing challenges. Traditionally, the prohibitively high entry costs, often reaching millions of dollars, combined with a lack of transparency and liquidity, have created barriers for numerous potential investors.\n\nEverlodge's DeFi property marketplace directly confronts these challenges within the travel property sector. Through the innovative approach of listing properties as NFTs on its platform, Everlodge introduces fractionalized ownership, allowing investors to purchase NFT fractions representing a percentage of a property. Imagine owning 25% of a property generating $6,000 monthly, resulting in a $1,500 passive income.\n\nIn essence, Everlodge not only breaks down barriers but also provides investors with the opportunity to access equity in some of the world's most luxurious travel properties and you can join in for only $0.027.\n\nFurthermore, industry experts predict a potential 10X surge in Everlodge's project valuation if the company successfully achieves crucial milestones. This projection highlights the anticipation surrounding Everlodge's transformative initiatives and underscores the potential for significant growth, positioning it as one of the best crypto investments leading up to 2024.\n\nLooking ahead, the probability of a positive upturn in cryptocurrency in 2024 is very much palpable and projects like Bitcoin, Ethereum, and Everlodge have everything to fight for to become the best coins to invest in 2024.\n\nFor more information about the ongoing Everlodge (ELDG) Presale, please visit their website.\n\nEverlodge provides you with a seamless approach to fractional investing in vacation rentals, eliminating the complexities associated with traditional real estate investment. Our innovative platform revolutionizes the way people invest in second homes.\n\nDigital currencies may be unregulated in your jurisdiction. The value of digital currencies may go down as well as up. Profits may be subject to capital gains or other taxes applicable in your jurisdiction.\n\nContact Details\n\nEverlodge group\n\nBrett Brown\n\nadmin@everlodge.io\n\nCompany Website\n\nhttps://everlodge.io/\n\nView source version on newsdirect.com: https://newsdirect.com/news/grayscale-ceo-foresees-bitcoin-price-surging-to-55k-ethereum-and-everlodge-poised-for-substantial-growth-871929946"
    },
    {
        "id": 97,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yZWQtaG90LWNyeXB0by1vdXRwZXJmb3JtLWJpdGNvaW4tMTEwMDAwMzY1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Can This Red-Hot Crypto Outperform Bitcoin Again in 2024? - Yahoo Finance",
        "content": "One of the standout performers in the crypto market this year has been Solana (CRYPTO: SOL), which is up almost 1,000% in 2023. On the strength of its recent performance, Solana has become the fifth-most valuable cryptocurrency in the world, and some analysts are even predicting that it could soon surpass Ethereum (CRYPTO: ETH) in terms of market cap.\n\nWhat's all the more remarkable is how Solana's performance this year compares to that of Bitcoin (CRYPTO: BTC), which has historically served as the benchmark for the overall crypto market. While Solana is up almost 1,000% for the year, Bitcoin is up \"just\" 160%. That's despite all the hoopla surrounding the possible new spot Bitcoin exchange-traded fund and the Bitcoin halving next year, which will slow the crypto's supply growth. So the obvious question becomes: Can Solana outperform Bitcoin again in 2024?\n\nReasons for Solana's outperformance\n\nTo answer that question, it's important to understand the key factors behind Solana's meteoric rise in 2023. In the early part of the year, investors embraced the narrative that Solana had finally distanced itself from the meltdown of the cryptocurrency exchange FTX (CRYPTO: FTT). The former chief executive officer of FTX, Sam Bankman-Fried, had been a major backer of Solana, and the risk of FTX contagion was seen as a real threat at the end of 2022.\n\nAs this perceived risk subsided, it was only natural that the price of Solana eventually retraced its way back from $10 to a level around $40, which is where it was trading before the FTX collapse.\n\nAround this time, institutional investors, not just retail investors, began to buy into the narrative around a Solana recovery. They increasingly began to see Solana as a viable alternative to Ethereum, and that apparently led to a new influx of institutional investor money into Solana. CoinShares, which tracks institutional flows into and out of various cryptocurrencies, has documented a consistent pattern of institutional money leaving Ethereum and moving into Solana.\n\nStory continues\n\nSo far, so good, right? Both retail and institutional investors seemed to be aligned on Solana as a viable competitor to Ethereum.\n\nImage source: Getty Images.\n\nBut over the past month, the narrative around Solana seems to have taken another, completely unexpected turn, and that's why I'm concerned that Solana might be overheating. This new, more speculative phase has corresponded with the rise of Solana meme coins. The obvious example is Bonk (CRYPTO: BONK), which has gone absolutely wild this year. It's now up almost 10,000% year to date.\n\nThe spectacular success of Bonk has led to the launch of even sillier meme coins, including ones that feature dogs, dragons, and, yes, melons. If this meme coin mania continues, it will only lead to more volatility for Solana, which is at risk of becoming the blockchain of choice for crypto speculators. As a result, all the hard work that has gone into making Solana a viable competitor to Ethereum could be undone by the get-rich-quick crypto crowd.\n\nQuestion marks for Solana\n\nThere are also several question marks surrounding Solana in areas where it has traditionally been very strong, such as non-fungible tokens (NFTs). At the beginning of 2023, a number of popular NFT collections left Solana for other blockchains, due to the perceived risk of FTX contagion. At the same time, NFTs known as Ordinals took off on Bitcoin, to the point where NFT sales volume on Bitcoin is now higher than on Solana. Before 2023, this would have been unthinkable.\n\nThere's also the matter of regulatory risk. In June, the Securities and Exchange Commission seemed to conclude that Solana was an \"unregistered security.\" When the SEC filed a lawsuit against cryptocurrency exchange Coinbase Global (NASDAQ: COIN), it specifically mentioned Solana as one of several unregistered securities trading on the Coinbase platform. This is a tricky issue to parse because the SEC did not bring any formal enforcement action against Solana. But still, this is exactly the sort of regulatory issue that could torpedo a Solana rally in 2024.\n\nCan Solana keep it up in 2024?\n\nCertainly, there's a lot to like about Solana. I've been banging the drum for Solana ever since the collapse of FTX. I've always viewed Solana as a viable alternative to Ethereum, and I've always thought the valuations of the two cryptos should be much narrower than they are today.\n\nBut the new speculative frenzy around Solana has me very concerned. Increasingly, it suggests that Solana's performance won't be sustainable in 2024. Solana has simply gone up too far, too fast. Yes, Solana may continue to outperform Ethereum next year. But it's looking increasingly unlikely that it will also outperform Bitcoin.\n\nShould you invest $1,000 in Solana right now?\n\nBefore you buy stock in Solana, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Solana wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of the S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of December 18, 2023\n\nDominic Basulto has positions in Bitcoin and Ethereum. The Motley Fool has positions in and recommends Bitcoin, Coinbase Global, Ethereum, and Solana. The Motley Fool has a disclosure policy.\n\nCan This Red-Hot Crypto Outperform Bitcoin Again in 2024? was originally published by The Motley Fool"
    }
]