[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMy8xOC9tb25zdGVyLWV0aGVyZXVtLWV0aC1yYWxseS1pbmNvbWluZy13aXRoLWFkZGl0aW9uYWwtYWx0Y29pbi1zZXQtdG8tb3V0cGVyZm9ybS1zYXlzLXRvcC1jcnlwdG8tYW5hbHlzdC_SAYsBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDMvMTgvbW9uc3Rlci1ldGhlcmV1bS1ldGgtcmFsbHktaW5jb21pbmctd2l0aC1hZGRpdGlvbmFsLWFsdGNvaW4tc2V0LXRvLW91dHBlcmZvcm0tc2F5cy10b3AtY3J5cHRvLWFuYWx5c3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "‘Monster’ Ethereum (ETH) Rally Incoming With Additional Altcoin Set To Outperform, Says Top Crypto Analyst - The Daily Hodl",
        "content": "A popular crypto analyst known for calling the 2018 Bitcoin (BTC) bottom is predicting a massive rally for Ethereum (ETH).\n\nThe pseudonymous analyst Smart Contracter tells his 221,400 Twitter followers that Ethereum appears to be at the end of a correction and ready to surge.\n\n“ETH/BTC just took out a six-month low, only 3% lower before my major buy zone.\n\nNot the circumstances I was expecting this to happen under (I thought ETH and BTC would be falling but ETH more so) but there’s no chance I’m missing the monster ETH rally that’s coming.”\n\nLooking at his chart, the analyst shows ETH/BTC in a downward correction and about to tap the crucial 0.618 Fibonacci retracement support, which traders see as a likely point for a bounce.\n\nSmart Contracter’s bullishness on ETH comes as crypto analytics platform Santiment says sharks have accumulated 3.61 million ETH coins in the past year, worth a whopping $6.13 billion.\n\nHowever, whales unloaded more than double that amount.\n\n“Ethereum’s large addresses have shifted their supply held substantially. Addresses holding 10-10,000 ETH have collectively added 3.61 million coins in the past year. Meanwhile, addresses with 10,000-10,000,000 ETH have collectively dumped 9.43 million in the same timeframe.”\n\nThe crypto analyst also says Optimism (OP) is also looking bullish.\n\n“Bullish expanded flat on daily for OP against USD, BTC and ETH pairs. Looks like one of the alts that will perform very well in my opinion.”\n\nUsing the Elliott Wave theory, an advanced technical analysis method that forecasts future price action based on crowd psychology manifesting in waves, Smart Contracter says Optimism is at the bottom of a correction and setting the stage to move to the upside.\n\nEthereum is worth $1,819 and Optimism trading at $2.57 at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kaXZlcnNpZmllZC1zZXQtb2YtZ3VhcmRpYW5zLXJlcXVpcmVkLWZvci1zYWZlLXNlbGYtY3VzdG9keS12aXRhbGlrLWJ1dGVyaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Diversified set of guardians required for safe self-custody: Vitalik Buterin - Cointelegraph",
        "content": "Ethereum co-founder Vitalik Buterin has emphasized the importance of having a varied set of “guardians” to maximize the safety of crypto asset self-custody via multisig and social recovery wallets.\n\nGiven the ever-growing rate of crypto scams and hacks over the past few years, and several major crypto firms going bust in 2022, self-custody and maintaining sufficient wallet safety procedures have never been more critical.\n\nIn a March 16 Reddit post on the r/ethereum community titled “How I think about choosing guardians for multisig and social recovery wallets,” Buterin gave a detailed run down of how he approaches wallet security.\n\nSelf-custody is important. And social recovery and multisig is a great way to do it.\n\n\n\nA quick reddit post on how I think about choosing guardians for social recovery and multisig wallets:https://t.co/FY1iyJ6BFC — vitalik.eth (@VitalikButerin) March 17, 2023\n\nWhile their structures differ, multisig and social recovery wallets rely on guardians, which serve as external sources to recover funds or approve transactions. Generally, guardians can be sets of external wallets belonging to the same individual or addresses controlled by other people or entities.\n\nAccording to Buterin, it’s important to decentralize wallet guardians, as owning more than one of your guardians provides a “tricky tradeoff: you get to trust other people less, but you’re also concentrating more power into yourself, which can create a risk if you get hacked, coerced, or incapacitated or die.”\n\n“My rule of thumb is that enough guardians should be controlled by other people that if you disappear there are enough other guardians left to recover your funds.”\n\nButerin went on to advise that someone’s set of guardians should not know of each other, as this “greatly reduces the risk that they collude” to attack their wallets and assets. However, they should still be able to find each other in case something happens to the wallet owner.\n\nComments on Buterin’s post. Source: Reddit\n\n“If something happens to you, they will still be able to find each other, because there are obvious standard protocols that naturally come to people’s minds in such a situation (e.g. contact your family),” he wrote.\n\nAdditionally, the Ethereum co-founder suggested that people should “instruct guardians to ask a security question” that only they and the guardian will know when confirming an operation — and only confirmed when the correct answer is given.\n\nRelated: DeFi sees its biggest hack in 2023 as Euler loses $197M: Finance Redefined\n\nFor degen traders or those not making long-term hodl plays, the Ethereum co-founder also stressed that they should use guardians that can respond quickly to suit their fast-moving needs.\n\n“If you’re doing degen stuff with on-chain contracts, you may need to act quickly: pull money out if a contract gets a vulnerability, move money around if you are close to being liquidated, etc. If your needs include this, then you want to find guardians who can act quickly on short notice.”\n\nFinally, Buterin recommended testing each guardian at least once a year, as this will confirm that they “haven’t forgotten or lost their accounts.”\n\nGiven the ever-growing rate of crypto scams and hacks over the past few years, and several crypto firms going bust last year, maintaining sufficient wallet safety procedures has never been more important."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2V0aGVyZXVtL3VzZS1tdWx0aS1zaWduYXR1cmUtYW5kLXNvY2lhbC1yZWNvdmVyeS13YWxsZXRzLXRvLWFjaGlldmUtc2VsZi1jdXN0b2R5LWV0aGVyZXVtLWNyZWF0b3Itc2F5cy_SAYgBaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9ldGhlcmV1bS91c2UtbXVsdGktc2lnbmF0dXJlLWFuZC1zb2NpYWwtcmVjb3Zlcnktd2FsbGV0cy10by1hY2hpZXZlLXNlbGYtY3VzdG9keS1ldGhlcmV1bS1jcmVhdG9yLXNheXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Use Multi-Signature And Social Recovery Wallets To Achieve Self-Custody, Ethereum Creator Says - NewsBTC",
        "content": "Ethereum co-founder Vitalik Buterin advised crypto investors to use social recovery and self-custody wallets. Buterin’s suggestion comes amid heightened expectations for the new Arbitrum token airdrop scheduled on March 23 and the upcoming Shanghai upgrade.\n\nThe recommendation makes sense given the increased cyber-related crimes in crypto, with hackers targeting a vulnerability in user wallets. The Ethereum co-founder suggested multi-signature and social recovery wallets so that users can hold self-custody of their funds.\n\nSelf-Custody Is Crucial In Crypto: Ethereum Creator\n\nSocial recovery wallets are smart-contract-powered wallets that allow users to recover access to their stolen funds even if they lose their private key. On the other hand, a multi-sig wallet requires two or more private keys to authorize a transaction or access funds.\n\nIn a tweet, Buterin noted that self-custody is crucial in the crypto ecosystem, especially with the last year’s event. The many hack exploitations in 2021 and 2022 with the FTX fiasco magnified the need for self-custody wallets.\n\nButerin suggests multi-sig wallets for long-term holdings and social recovery wallets for short-term day-to-day trading activities.\n\nFollowing his recommendation, Buterin made a Reddit post that detailed his opinion on how users should choose guardians for social recovery and multi-sig wallets. In his Reddit post, the founder recommended multi-sig wallets like Gnosis Safe, an easy and reliable wallet to store funds.\n\nButerin explained that centralized organizations are trustworthy but pose risks of regulatory pressure, including system and human errors. Therefore he advised users not to trust centralized entities.\n\nFurther, he stated that social recovery wallets are easier to use than multi-sig wallets. The ERC-4337 account abstraction and newly built smart contract wallets like Soul Wallet bolsters wallet security.\n\nChoice Of Wallets, Key Guardians Can Minimize Risks Of Assets Loss\n\nIn addition, Buterin suggested using social recovery for hot wallets that store smaller portions of funds and multi-sigs for cold wallets that store more funds. Also, he noted that selecting good guardians is crucial.\n\nGood guardians improve the security of crypto funds by reducing the chances of losing keys, funds theft, and risks of sharing private keys with others. In the post, Buterin detailed how to choose a secure guardian.\n\nOne of the comments to Buterin’s post talked about the importance of having guardians that can use hardware wallets. It also noted that using guardians for hardware wallets is better than storing keys in Metamask or Google Drive.\n\nWhile responding, Buterin said that hardware wallets are unnecessary due to issues that might arise with the issuing company. However, he agreed with the commenter that using Google Drive or Metamask to store keys are risky.\n\nButerin’s posts followed several wallet attacks that led to a loss of thousands of dollars. These include MyAlgo Wallet exploit, which saw massive amounts of money stolen from users’ accounts.\n\nThat is not Buterin’s first time recommending social recovery wallets. On January 11, 2021, Buterin posted a blog detailing the need for crypto investors to adopt recovery wallets. In the article, Buterin said multi-sig is his favorite of all wallet categories. He introduced recovery wallets as easy to use with high-level security.\n\nFeatured image from Pixabay and chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L21lbWUtY29pbi1zdGFyLWJpZy1leWVzLWNvaW4tc3VycGFzc2VzLWV0aGVyZXVtLWFuZC10aGV0YS1uZXR3b3JrLXByZXNhbGUtcmVjb3Jkcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Meme Coin Star, Big Eyes Coin, Surpasses Ethereum and Theta Network Presale Records - Analytics Insight",
        "content": "The cryptocurrency market has witnessed numerous presale events, but those of Ethereum and Theta will continue to stand out from the rest. Both presale events generated about $19 million, with Ethereum (ETH) setting the record in 2015 and Theta (THETA) matching it in 2017. Now Big Eyes Coin (BIG), the meme coin that rocked late 2022, has generated more than $25 million in its presale, surpassing mother blockchain Ethereum’s 2015 record. Read on to find out more about the alluring feline meme coin and join the presale while you can.\n\nEthereum (ETH)\n\nThe Ethereum (ETH) blockchain was developed in 2015 to provide a better relatable crypto platform for easier transactions, as Bitcoin was disappearing out of sight in terms of value. The Ethereum blockchain promised a more extensive, feature-packed protocol that gave users and developers opportunities to get the best out of their crypto journeys.\n\nEthereum (ETH) initially launched with a proof of work protocol similar to Bitcoin’s code. The code base allowed users to mine ETH tokens while they received rewards. As the protocol got more popular and DApps increased, the need for supplementary networks arose, and platforms like Polygon were used to improve the quality of blockchain services on Ethereum.\n\nThe desired move to a proof of stake occurred in 2022, as the developers moved the entire blockchain to a PoS code that promised faster transactions at lower gas fees. The move has also improved the platform’s security, as users can stake their ETH assets to better Ethereum’s security.\n\nEthereum (ETH) has delivered on every metric as it has profound involvement in key crypto sectors. Its NFT trade sector is the largest, with a capitalization of over $500 million and its blockchain is host to numerous Metaverse platforms and tokens, propagating Decentralized Finance all over the crypto space.\n\nEthereum (ETH) currently sells for about $1,671.84 on CoinMarketCap.\n\nTheta Network (THETA)\n\nTheta Network (THETA) is the only blockchain solution available that upgrades video quality for its users. The platform uses several DApps to increase the bandwidth available for video streaming. Edgecast, a notable Ethereum DApp, enables users to contribute their bandwidth to enhance video sharing and streaming.\n\nTheta initially existed on the Ethereum network, where its access to the many DApps caused its success before and after the presale. The platform moved to an independent blockchain, in 2019, where it runs on a Byzantine Fault Tolerance protocol, a variation of the conventional proof of stake protocol. The BFT protocol allows for faster transactions, as it uses a small unit of validators who work round the clock to validate transaction blocks.\n\nTheta Network (THETA) has two tokens used to run the platform. There is the non-tradable TFUEL token that runs the network’s economics by functioning as fuel, and THETA token that is used to vote on protocol changes and the platform’s future. The THETA is tradable and listed on various exchanges on the cryptocurrency market.\n\nTHETA is available on CoinMarketCap for about $1.17.\n\nBig Eyes Coin (BIG)\n\nBig Eyes Coin (BIG) is a cat-meme token that sought to dominate the meme coin sector in the crypto space. The coin started its presale in September, during the crypto collapse, and is edging closer to the launch date. Unlike many meme coin platforms, Big Eyes (BIG) boasts a value-packed protocol that ensures users within its meme community access some of the benefits of DeFi.\n\nBig Eyes’ most notable feature is the anticipated Sushi Crew project. Sushi Crew is an NFT marketplace where users will be able to create, mint, and trade their NFTs. The developers have decided to have NFT trades at no cost, thus relieving users of the enormous Ethereum gas fees, as the token will launch on the Ethereum blockchain. The NFTs will keep projects like a Metaverse within sight for future upgrades.\n\nBig Eyes (BIG) also plans to host a supportive community where every user contributes to the token’s plans and has a stake in its future. The developers also plan to help newbie users with tutorials to put them through the basics of DeFi and its principles. This will help make the community more close-knit, a common feature of successful crypto projects.\n\nThe final days are here, and we expect the launch date anytime. Click here to buy your BIG tokens and join the already-growing Big Eyes (BIG) community.\n\nBig Eyes Coin (BIG)\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAzLzE4L2JldHRlci1idXktY29pbmJhc2UtdnMtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Better Buy: Coinbase vs. Ethereum - The Motley Fool",
        "content": "The crypto winter has crushed valuations for tokens and companies that operate trading exchanges. Ethereum's (ETH 1.37%) price has fallen roughly 65% from it's record high set in November 2021. Meanwhile, leading exchange-services provider Coinbase Global (COIN 0.78%) has seen its valuation plummet 81% from its peak.\n\nWould investors be better off putting their money behind the leading Layer-1 blockchain services provider's ether token or buying Coinbase stock based on today's pricing levels? Read on to see why two Motley Fool contributors have differing takes on which looks like the better investment right now.\n\nEthereum is a category leader in blockchain services\n\nKeith Noonan: Launched in 2015, Ethereum has proved its staying power and has established itself as the clear leader in Layer-1 blockchain services. The company's network has become the go-to destination for those looking to build, deploy, and scale blockchain-based applications, and this foundation provides a key fundamental support for the value of the Ether token.\n\nIf Ethereum continues to attract new projects and facilitate their growth, that should create demand for the ether token and be a price catalyst.\n\nWhile Coinbase might appear to have lower risk based on the fact that its core business is providing trading and holding services for the broader crypto ecosystem, I actually see this as a source of greater risk.\n\nCoinbase's platform allows users to easily buy and sell an incredibly wide range of cryptocurrencies, but I think that most of these coins will probably trend toward zero on the valuation scale, and it seems almost inevitable that even some relatively high-profile projects will eventually blow up in big scandals.\n\nCoinbase has already had some scandals of its own -- including security breaches, insider trading, and allegations of insufficient safeguards against money laundering.\n\nThe crypto industry is still very much in its infancy, and the low barriers to launching and promoting a token mean that investors should take a highly selective approach to their investments in this sector.\n\nI view the vast majority of crypto projects to be of very low quality, so the prospect of investing in a business whose core services revolve around crypto trading and wallet services does not seem appealing. By comparison, Ethereum has already proved itself to be a much higher-quality project.\n\nIn general, I think that investors should only focus on crypto projects and related companies with proven track records. Ethereum fits the bill, has proved to be relatively scandal free, and can stand through the rise and fall of other projects and businesses in the crypto industry.\n\nCoinbase has demonstrated its potential\n\nParkev Tatevosian: Coinbase stock has been hammered in recent quarters due to the decrease in popularity of cryptocurrencies as an asset class. In the early stages of the pandemic, the total market capitalization of all cryptocurrencies reached $3 trillion. That figure has dropped to about $1 trillion.\n\nCoinbase, a platform that lets users buy, hold, and sell digital currencies, attracted millions of new customers during the crypto frenzy. Admittedly, many of those folks will leave if the popularity and prices of crypto assets don't recover. Still, Coinbase stock can be lucrative for investors as long as it can retain a meaningful portion of those early customers.\n\nThe explosive growth peaked in 2021, when Coinbase's revenue reached $7.8 billion and operating income hit $3 billion. That showed investors the magnitude of profits it could generate at scale. It will need to lower expenses to match a smaller scale if the industry doesn't rebound to pandemic highs.\n\nThere is a risk that Coinbase might not be profitable on a smaller scale. However, the stock is trading at a price-to-sales ratio of 4.5, which is significantly below the ratio of more than 18 at its peak. The stock might come with high risk, but it also has plenty of upside for investors with a high risk tolerance.\n\nSo which is the better buy?\n\nFor investors seeking broad-based exposure to the crypto space, investing in both Ethereum and Coinbase could be the right move. Otherwise, it makes sense to focus on their differing characteristics, strengths, and weaknesses and then determine which potential investment vehicle is better aligned with the direction you see the crypto space heading in.\n\nIf you're looking to take a narrower approach to investing in crypto and think that Ethereum will continue to be a top provider of network services, then it's probably the better buy. On the other hand, if you're positioning for an overall rebound in crypto valuations and are seeking investment vehicles that have a diversified exposure to the broader market, Coinbase stock is likely the better fit for your investment priorities."
    }
]