[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtZXllcy0yMDE5LXNjZW5hcmlvLXJlcGVhdC1oZXJlcy13aGF0cy1nb2luZy1vbtIBVWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGgtcHJpY2UtZXllcy0yMDE5LXNjZW5hcmlvLXJlcGVhdC1oZXJlcy13aGF0cy1nb2luZy1vbj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "Ethereum (ETH) Price Eyes 2019 Scenario Repeat: Here's What's Going On - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nIn a concerning turn of events, Ethereum (ETH), the cornerstone of the crypto market, is teetering on the edge of a scenario reminiscent of 2019, ringing alarm bells among the investor community. Diving deep into the charts, renowned crypto analyst Benjamin Cowen has surfaced with a noteworthy insight that raises concerns for the altcoin giant.\n\nAdvertisement\n\nThe crux of the matter lies in ETH's breach of the dynamic support line, signified by the Bull Market Support Band indicator. This echoes a pattern last witnessed over four years ago. Back then, Ethereum suffered a pivotal level loss, paving the way for a tumultuous six-month journey where its value plummeted by a staggering 48%, only finding reprieve by the close of December 2019.\n\nIn 2019, #ETH fell below its Bull Market Support Band in July/August, just as it has in 2023. pic.twitter.com/36v6BEDch1 — Benjamin Cowen (@intocryptoverse) August 22, 2023\n\nWith history appearing to echo itself, the stakes are high for ETH's journey through the remainder of this year and the advent of 2024. An unsettling projection arises from Cowen's analysis, spotlighting the potential for Ethereum to slide toward the $900 mark per token.\n\nConvergence of perspectives\n\nNotably, Cowen is not the sole voice predicting such an outcome. Just a day prior, crypto analyst Ali Martinez , renowned in his own right, also foresaw a comparable fate for Ethereum based on meticulous technical analysis. Martinez articulated that Ethereum's fall beneath the $1,600-$1,550 range could lay the groundwork for a substantial correction ranging from 37% to 45%, ultimately targeting the $1,000 mark.\n\nAs the situation continues to evolve, it is increasingly evident that dark clouds are amassing over Ethereum, casting a shadow of uncertainty not only on the altcoin itself but also on the broader crypto market."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1zZWxsaW5nLWludGVyZXN0LTE3MDAv0gFOaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLXNlbGxpbmctaW50ZXJlc3QtMTcwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "Ethereum Price Key Indicators Suggest Rising Selling Interest Below $1,700 - NewsBTC",
        "content": "Ethereum price is struggling to recover above the $1,700 resistance against the US Dollar. ETH could start a fresh decline if it stays below $1,700 and $1,720.\n\nEthereum is struggling to recover above the $1,700 and $1,720 levels.\n\nThe price is trading below $1,700 and the 100-hourly Simple Moving Average.\n\nThere is a key bearish trend line forming with resistance near $1,680 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could start another decline if it stays below the $1,700 level in the near term.\n\nEthereum Price Consolidates Below $1,700\n\nEthereum’s price started a recovery wave from the $1,520 zone. ETH managed to recover above the $1,550 and $1,580 levels, similar to Bitcoin.\n\nHowever, the price is struggling to recover above the $1,700 and $1,720 levels. It is now moving lower and trading below the 23.6% Fib retracement level of the recovery wave from the $1,517 swing low to the $1,716 high. There is also a key bearish trend line forming with resistance near $1,680 on the hourly chart of ETH/USD.\n\nEther is now trading below $1,700 and the 100-hourly Simple Moving Average. On the upside, the price might face resistance near the $1,680 level and the trend line.\n\nSource: ETHUSD on TradingView.com\n\nThe next resistance is near $1,690 or the 100-hourly Simple Moving Average. The first major resistance is forming near $1,700 and $1,720. A close above the $1,720 level could start a decent increase in the near term. The next major resistance is near the $1,750 level. Any more gains might send the price toward the $1,820 resistance or even $1,880 in the coming days.\n\nAnother Drop in ETH?\n\nIf Ethereum fails to clear the $1,700 resistance, it could start another decline. Initial support on the downside is near the $1,620 level or the 50% Fib retracement level of the recovery wave from the $1,517 swing low to the $1,716 high.\n\nThe first major support is near the $1,600 zone. If there is a downside break below $1,600, there could be more losses. The next major support is near the $1,565 support level. Any more losses might send the price toward the $1,520 level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now below the 50 level.\n\nMajor Support Level – $1,600\n\nMajor Resistance Level – $1,700\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1pcy1uZXR3b3JrLWFjdGl2aXR5LXRoZS1yZWFzb24tYmVoaW5kLWV0aHMtcHJpY2UtZHJvcC_SAcMBaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2V0aGVyZXVtLWlzLW5ldHdvcmstYWN0aXZpdHktdGhlLXJlYXNvbi1iZWhpbmQtZXRocy1wcmljZS1kcm9wLz91dG1fc291cmNlPXJzcyZ1dG1fbWVkaXVtPXJzcyZ1dG1fY2FtcGFpZ249ZXRoZXJldW0taXMtbmV0d29yay1hY3Rpdml0eS10aGUtcmVhc29uLWJlaGluZC1ldGhzLXByaWNlLWRyb3AmYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "Ethereum: Is network activity the reason behind ETH’s price drop? - AMBCrypto News",
        "content": "Ethereum’s number of wallets in loss reached a seven-month high\n\nMetrics and market indicators suggested that ETH’s price might decline further\n\nOver the last few months, Ethereum [ETH] witnessed a decline in its network activity. This was the case as the blockchain’s monthly average active addresses dropped.\n\nThe monthly average of active ETH addresses stood lower than the yearly average. This clearly indicated low activity, which could be taken as a bearish signal. While the blockchain’s network activity declined, its price also failed to shoot up.\n\nIs Ethereum’s reluctance to push its price up a consequence of less network activity?\n\nRead Ethereum’s [ETH] Price Prediction 2023-24\n\nThe reason for ETH’s price drop\n\nAccording to CoinMarketCap, ETH was down by more than 9% in the last seven days, reflecting its sluggish behavior. At the time of writing, it was trading at $1,670.05 with a market capitalization of over $200 billion.\n\nThe price drop had a major impact on investors’ portfolios. As per Glassnode Alerts’ tweet, the number of ETH addresses in loss reached a seven-month high of 42,602,870.333.\n\nHowever, upon taking a closer look, the reason behind the downtrend might not have been less network activity. This was because while ETH’s active addresses dropped, Layer-2s like Base, Optimism [OP], and rollups gained popularity.\n\nThe primary reason behind market participants shifting to L2s was that they offered more scalability. For reference, Coinbase’s L2 Base bridged $251 million, with ETH accounting for $155 million out of the total within days of launch.\n\nA closer look at Ethereum’s state\n\nA look at Ethereum’s on-chain performance gave a better understanding of what was going on in the ecosystem. Upon checking, it was revealed that investors in funds and trusts, including Grayscale, have relatively weak buying sentiment.\n\nAdditionally, as per CryptoQuant, ETH’s net deposit on exchanges was high compared to the seven-day average, suggesting high selling pressure. However, it was interesting to see that when ETH fell victim to the latest price correction, investors took it as an opportunity to increase accumulation.\n\nThis was evident from Glassnode Alerts’ tweet, which pointed out that Ethereum’s exchange outflow volume reached a one-month high during that period.\n\n? #Ethereum $ETH Exchange Outflow Volume (7d MA) just reached a 1-month high of 9,627.006 ETH Previous 1-month high of 9,608.990 ETH was observed on 20 August 2023 View metric:https://t.co/LzFffVHu6i pic.twitter.com/dhJIEP4CZO — glassnode alerts (@glassnodealerts) August 21, 2023\n\nHow much are 1,10,100 ETHs worth today\n\nNot only metrics, but a few market indicators were also bearish. For example, the Moving Average Convergence Divergence (MACD) displayed a bullish edge in the market.\n\nFurthermore, ETH’s Chaikin Money Flow (CMF) also registered a downtick, increasing the chances of a price decline. Nonetheless, the Money Flow Index (MFI) rebounded from the oversold zone, which can help the token increase its price."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wOC0yMi9ob3ctYnVzaW5lc3Nlcy1zaG91bGQtdXNlLWV0aGVyZXVtLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "How EY's Brody Thinks Businesses Should Use Ethereum - Bloomberg",
        "content": "00:00\n\nPaul, I want to first get your take on the FCC case, maybe not as as a judge, but just as someone who watches crypto. How important was it that Ripple won at least part of that case? So I think it was actually pretty important because any step forward towards clarity is a positive step. And I think if you look at the draft legislation that's coming from Congress, it's very, very reasonable. And so all of these things, I hope, are converging towards pressure towards we should have more clarity of rules. And I think what Meltem said in your introduction was fantastic. She's right on target. Clarity is good for business. And hopefully between the legal decisions and the pending legislation, we're getting there in one small step at a time. Okay. So as we talk about the pending decisions around what is and is not a security, also all waiting with bated breath each and every day to see if a spot ETF approval actually may come or grayscale may actually have its ruling come down in the D.C. Circuit Court. Didn't happen today. We'll see if it happens on Friday. So we'll all wait for that. In regard to futures, though, and that potential ETF, that one seems like it it maybe is more likely. What real difference would that make, Paul? So I think it would make an enormous difference because we're really starting and your prior guest was amazing on this topic. We're really starting to see the difference between Bitcoin, which is a kind of digital gold, and people want to see it as potentially an inflation hedge or a global asset versus Etherium, which is becoming a global computing infrastructure. And so by having ETF for the two separate ones and specifically having Etherium ETFs, you can start to sort of take a stake in the Etherium ecosystem in the cash flow of transactions, in the value of the overall asset infrastructure that's being built there. And for people to see these two properly as separate. I think it's really important for the development of the overall marketplace. Okay. So on the subject of Etherium, you are a somewhat expert on the subject. You actually just wrote a book that was released earlier this summer, Etherium for business. It's called A Plain English Guide to How to use cases that generate returns from asset as asset management to payments to supply chains. Paul How should businesses be thinking about using this technology? So we have a very simple thing at UI, which is that we believe blockchains are going to be the glue that tie business ecosystems together. And even though everyone tends to focus on finance and DEFI and SEC rulings, in fact, Etherium is an incredible infrastructure for tokenizing assets tracking supply chains. If we look at the kind of things that we talk, I talk about in the book and that we're doing it why they are tokenizing carbon offsets, tokenizing carbon traceability, tracking pharmaceuticals, managing procurement agreements. Right. There's a tremendous amount of operational business stuff, none of which is finance related, but is essential for how companies interact with each other. And Etherium provides a neutral, decentralized infrastructure in which enterprises can transact with each other on a level equal terms. On the subject of things being level, is this a zero sum game, Paul? Are we going to head into a world where one chain actually is dominant? Etherium Perhaps. So I do believe that. I think if you look historically at the world of computing infrastructure, we like standards, right? Basically, a single operating system represents 90% of all PCs. Two operating systems represent more than 95% of all phones. We like standard standard scale really well. So I think we are headed for a global infrastructure where Etherium is the global base layer standard for digital business transactions in the same way that TCP IP is a global network standard and that others over time will gradually wither away. Just like 20 or 30 years ago, we used to have an alphabet soup of different networking standards and now we just have TCP IP. That reminds me that I love the metric system. Paul And we're kind of nowhere there in the US. Are we going to face a similar disadvantage when it comes to the global blockchain? I mean, is the US regulating itself out of competition here or not regulating itself into competition? I worry that there is some risk of that happening. I just actually got back from four weeks in Asia and it's very clear Japan, Hong Kong, Singapore and additionally Europe and the Middle East. These are all places that are moving really forward. If we look at kind of our volume of work and deals, we're up in every sector and we're up in every geography. But the places that are growing the fastest by by far in terms of our blockchain and core crypto work are Europe in preparation for the MICA Assets law and Hong Kong, which is growing rapidly at us as China tries to reopen, and then obviously Dubai in the Middle East where the regulatory environment is maturing very quickly. So the US is growing again and that part is good. And I've been telling all the people in our team, you know, summer is coming, but we are definitely lagging compared to other regions."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wOC0yMi9ob3ctYnVzaW5lc3Nlcy1zaG91bGQtdXNlLWV0aGVyZXVtLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "How EY's Brody Thinks Businesses Should Use Ethereum - Bloomberg",
        "content": "00:00\n\nPaul, I want to first get your take on the FCC case, maybe not as as a judge, but just as someone who watches crypto. How important was it that Ripple won at least part of that case? So I think it was actually pretty important because any step forward towards clarity is a positive step. And I think if you look at the draft legislation that's coming from Congress, it's very, very reasonable. And so all of these things, I hope, are converging towards pressure towards we should have more clarity of rules. And I think what Meltem said in your introduction was fantastic. She's right on target. Clarity is good for business. And hopefully between the legal decisions and the pending legislation, we're getting there in one small step at a time. Okay. So as we talk about the pending decisions around what is and is not a security, also all waiting with bated breath each and every day to see if a spot ETF approval actually may come or grayscale may actually have its ruling come down in the D.C. Circuit Court. Didn't happen today. We'll see if it happens on Friday. So we'll all wait for that. In regard to futures, though, and that potential ETF, that one seems like it it maybe is more likely. What real difference would that make, Paul? So I think it would make an enormous difference because we're really starting and your prior guest was amazing on this topic. We're really starting to see the difference between Bitcoin, which is a kind of digital gold, and people want to see it as potentially an inflation hedge or a global asset versus Etherium, which is becoming a global computing infrastructure. And so by having ETF for the two separate ones and specifically having Etherium ETFs, you can start to sort of take a stake in the Etherium ecosystem in the cash flow of transactions, in the value of the overall asset infrastructure that's being built there. And for people to see these two properly as separate. I think it's really important for the development of the overall marketplace. Okay. So on the subject of Etherium, you are a somewhat expert on the subject. You actually just wrote a book that was released earlier this summer, Etherium for business. It's called A Plain English Guide to How to use cases that generate returns from asset as asset management to payments to supply chains. Paul How should businesses be thinking about using this technology? So we have a very simple thing at UI, which is that we believe blockchains are going to be the glue that tie business ecosystems together. And even though everyone tends to focus on finance and DEFI and SEC rulings, in fact, Etherium is an incredible infrastructure for tokenizing assets tracking supply chains. If we look at the kind of things that we talk, I talk about in the book and that we're doing it why they are tokenizing carbon offsets, tokenizing carbon traceability, tracking pharmaceuticals, managing procurement agreements. Right. There's a tremendous amount of operational business stuff, none of which is finance related, but is essential for how companies interact with each other. And Etherium provides a neutral, decentralized infrastructure in which enterprises can transact with each other on a level equal terms. On the subject of things being level, is this a zero sum game, Paul? Are we going to head into a world where one chain actually is dominant? Etherium Perhaps. So I do believe that. I think if you look historically at the world of computing infrastructure, we like standards, right? Basically, a single operating system represents 90% of all PCs. Two operating systems represent more than 95% of all phones. We like standard standard scale really well. So I think we are headed for a global infrastructure where Etherium is the global base layer standard for digital business transactions in the same way that TCP IP is a global network standard and that others over time will gradually wither away. Just like 20 or 30 years ago, we used to have an alphabet soup of different networking standards and now we just have TCP IP. That reminds me that I love the metric system. Paul And we're kind of nowhere there in the US. Are we going to face a similar disadvantage when it comes to the global blockchain? I mean, is the US regulating itself out of competition here or not regulating itself into competition? I worry that there is some risk of that happening. I just actually got back from four weeks in Asia and it's very clear Japan, Hong Kong, Singapore and additionally Europe and the Middle East. These are all places that are moving really forward. If we look at kind of our volume of work and deals, we're up in every sector and we're up in every geography. But the places that are growing the fastest by by far in terms of our blockchain and core crypto work are Europe in preparation for the MICA Assets law and Hong Kong, which is growing rapidly at us as China tries to reopen, and then obviously Dubai in the Middle East where the regulatory environment is maturing very quickly. So the US is growing again and that part is good. And I've been telling all the people in our team, you know, summer is coming, but we are definitely lagging compared to other regions."
    }
]