[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMDEvd2hhdC1pcy10aGUtZXRoZXJldW0tYmxvY2tjaGFpbnMtc2hhbmdoYWktaGFyZC1mb3JrLWFuZC13aHktZG9lcy1pdC1tYXR0ZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Feb 2023 08:00:00 GMT",
        "title": "What Is the Ethereum Blockchain's Shanghai Hard Fork, and Why Does It Matter? - CoinDesk",
        "content": "As for how soon you can access the ETH you want to unstake, “it depends on how many people will unstake at a time,” Marius Van Der Wijden, a developer at the Ethereum Foundation, told CoinDesk. Only 16 partial withdrawal requests can be put into a slot (which happens every 12 seconds), and there is a single queue for both full and partial withdrawals on the blockchain. But the likelihood of all validators choosing to exit the blockchain is slim, given that staking will enable a new chapter for Ethereum and those that trade on top of it."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2V0aGVyZXVtLXN0YWtpbmctd2l0aGRyYXdhbC10ZXN0bmV0LXpoZWppYW5nLXNldC10by1sYXVuY2gtd2VkbmVzZGF5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Feb 2023 08:00:00 GMT",
        "title": "Ethereum staking withdrawal testnet 'Zhejiang' set to launch Wednesday - CryptoSlate",
        "content": "A testnet that will demonstrate Ethereum staking withdrawals is set to go live on Wednesday, according to statements from developers on Jan. 30.\n\nEthereum Foundation members Parithosh Jayanthi and Barnabas Busa said the Zhejiang testnet will go live on Feb. 1 at 15:00 UTC. The Shanghai and Capella upgrade will be triggered on the testnet six days later (at epoch 1350 on the blockchain).\n\nOnce the process is complete, validators can try out staking withdrawals in a practice environment without real funds. Validators can convert between credentials, test partial and full withdrawals, and fully exit their validator node.\n\nEthereum currently supports most other staking-related features. Users can now stake 32 ETH ($55,200) to operate a validator node. That feature has been available since developers launched Ethereum’s beacon chain in December 2020. Users have also been able to earn staking rewards since September 2022’s Merge upgrade.\n\nDespite those capabilities, Ethereum does not allow validators to withdraw staked ETH. This limitation was introduced to ensure the strength of the staking network.\n\nThe absence of staking withdrawals is one reason liquid staking services, such as those offered by Lido and Coinbase, have become prominent. While users of these platforms may be prevented from withdrawing their staked ETH, they also issue a corresponding “liquid” token that can be invested freely elsewhere. Some liquid tokens have seen price movement due to the upcoming staking withdrawal upgrade.\n\nThe Zhejiang testnet is the next step toward introducing proper staking withdrawals on Ethereum. Recent developer calls suggest that the feature will be introduced on the mainnet in March. However, there is still no definite date for the upgrade.\n\nMentioned in this article"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vdGhlZGVmaWFudC5pby9ldGhlcmV1bS16aGVqaWFuZy10ZXN0bmV0LWxhdW5jaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Feb 2023 08:00:00 GMT",
        "title": "Ethereum Developers To Launch Testnet Supporting Staked ETH Withdrawals - The Defiant - DeFi News",
        "content": "Zhejiang Testnet Will Go Live On Feb. 1\n\nBy: Samuel Haig • Loading...\n\nDeFi News\n\nEthereum developers will launch a public testnet later today that supports Beacon Chain withdrawals, with a rehearsal of the network’s upcoming Shanghai and Capella upgrades scheduled to go live six days later.\n\nBarnabus Busa, a DevOps engineer at the Ethereum Foundation, tweeted on Jan. 31 that Ethereum’s core developers had agreed on a date for the public testnet’s deployment.\n\n“The Zhejiang public testnet is going live tomorrow (1st of Feb 15:00 UTC, 2023). Shanghai+Capella will be triggered 6 days later (at epoch 1350),” Busa said.\n\n“Once the upgrade has been triggered, you can test partial and full withdrawals as well as a few other EIPs that are included in the upgrade,” tweeted Parithosh Jayanthi, a DevOps engineer at the Ethereum Foundation.\n\nBusa added that a faucet for testnet ETH will be deployed shortly after its launch. Users can monitor for information and news relating to the testnet at zhejiang.ethpandaops.io.\n\nThe news comes as Ethereum developers aim to enable staked ETH withdrawals sometime in March or April.\n\nEthereum’s Beacon Chain consensus layer launched in December 2020, allowing ETH holders to stake their coins for the first time.\n\nBut despite the Beacon Chain merging with Ethereum’s execution layer in September 2022 to boot Proof-of-Work miners from the network in favor of Proof of Stake validators, stakers still cannot withdraw their ETH from the Beacon Chain.\n\nThe Merge Goes Live in Historic Upgrade for Ethereum After Years of Toil and Tests Ethereum Shifts to Proof of Stake and Sets Stage for Further Changes\n\nRoughly 16.3M ETH worth $28.5B is currently staked.\n\nDeFi Alpha Premium Content DeFi Daily | Weekdays\n\nDeFi Alpha Letter | Weekly\n\nDefiant Podcast Transcript | Weekly\n\nInbox Dump | Saturday\n\nWeekly Recap | Sunday Looking for Alpha? Become a premium member of The Defiant and join our DeFi Alpha community. Start for free\n\nIn January, Ethereum’s developers responded by announcing they will prioritize Beacon Chain withdrawals for the network’s next upgrades, the Shanghai and Capella forks — which will update the code for Ethereum’s execution and consensus layers, respectively. They followed up by launching a shadow fork supporting withdrawals on Jan. 23.\n\nThe recent progress towards enabling withdrawals has bolstered the performance of liquid staking derivative (LSD) providers. Many analysts expect Ethereum’s next upgrade to bolster LSD adoption and drive traders to eliminate much of the spread between ETH and LSD tokens.\n\nThe native tokens of top LSD providers Lido, Rocket Pool, and Stakewise have surged 126%, 93.5%, and 107% in January, according to Coingecko."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2xpcXVpZC1zdGFraW5nLWRlcml2YXRpdmVzLXNoYW5naGFpLXVwZ3JhZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Feb 2023 08:00:00 GMT",
        "title": "All Eyes on Liquid Staking Derivatives as Shanghai Upgrade Nears - Blockworks",
        "content": "The Ethereum Shanghai hard fork is less than two months away, and liquid staking derivatives (LSD) are gaining momentum in the cryptocurrency market.\n\nFollowing Shanghai, users can withdraw ether locked up on the Beacon chain — opening up an exit for long-time Ethereum stakers.\n\nBlockworks Research analysts note in a report that this upgrade is likely to encourage more ETH holders to lock up their assets over the long term, increasing pressure on stake rate — but it is possible that there could also be a dip in staking demands as withdrawals become available.\n\nAlluvial co-founder and Chief Operating Officer Mike Taormina told Blockworks that the rise in popularity of liquid staking derivatives on Ethereum should come as no surprise, as it’s about more than the debut of withdrawals.\n\n“Liquid staking also solves a real problem: When you lock tokens to participate in the security of the network, those tokens are illiquid,” he said.\n\nNot so, with ether receipt tokens.\n\nLiquid staking in proof-of-stake ecosystems\n\nThe ordinary staking process involves locking up cryptocurrency in a proof-of-stake network to support blockchain operations and enable transactions, while simultaneously allowing users to accrue staking rewards.\n\nIn the case of Ethereum, an individual user must deposit 32 ETH ($50,900) to the blockchain and activate the validator software to participate in staking.\n\nAs ETH holders often do not have enough funds or technical expertise to run their own validator node — now exceeding 510,000 worldwide — liquid staking protocols, including Lido, Rocket Pool and Frax, remove the barrier to entry by allowing ether holders to participate in staking without having to lock in any tokens.\n\nThis is often referred to as pooled staking, and users who participate are given ERC-20-compliant liquidity tokens that represent their staked ether, which they can hold in their wallets and use in other DeFi applications. But using decentralized exchanges, they can also sell back into normal unstaked ether at any time.\n\nOf course, liquid staking is not only limited to the Ethereum blockchain. The Solana network has been actively looking at ways to grow its total value locked (TVL) — particularly following events related to FTX, which hit Solana hard — and liquid staking derivatives may address some of these challenges.\n\nMarinade Finance, a non-custodial liquid staking protocol built on the Solana blockchain, is hoping to increase DeFi activity on its network by launching a program that will distribute its governance token MNDE to individuals and protocols in hopes of growing mSOL TVL.\n\n“There’s so much locked SOL that’s staking. It’s helping decentralization and validation, but it’s not helping liquidity, so what we want to see is some of that stake turn into liquidity — and help DeFi protocols — and liquid staking tokens is really the mechanism for that,” Brandon Tucker, a growth lead at the DAO, told Blockworks.\n\nSetting a new liquid staking standard\n\nFollowing the Shanghai upgrade, Taormina believes that liquid staking tokens may become even more popular — driving increased confidence in the Ethereum blockchain and welcoming a new cohort of mainstream adopters.\n\nEthereum has a much lower percentage of its token staked — less than 14% per Blockworks Research — compared to other blockchains, Taormina said.\n\n“There’s something holding Ethereum holders back from participating in staking, this is why the upgrade is so important,” he said. “The Shanghai upgrade will finally enable withdrawals and remove uncertainty…we think that more people will end up participating [in staking].”\n\nIn anticipation of a growth in staking participants, Taormina and his team at Alluvial are partnering with a handful of Web3 teams to design a new liquid staking standard.\n\nThis new standard, dubbed ‘Liquid Collective,’ will be an enterprise-grade liquid standard built to attract enterprise-grade users to Web3.\n\n“This is important because it helps onboard a cohort of users that are on the sidelines that would be interested in staking but need experience to meet some minimum thresholds that aren’t currently met today,” Taormina said.\n\nIf you want to read more about the current state of liquid staking derivatives on Ethereum and their yield market share, you can subscribe to Blockworks Research and read their latest report at no charge for the next 24 hours.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1zLXNoYW5naGFpLWZvcmstaXMtY29taW5nLWJ1dC1pdC1kb2Vzbi10LW1lYW4taW52ZXN0b3JzLXNob3VsZC1kdW1wLWV0aNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Feb 2023 08:00:00 GMT",
        "title": "Ethereum's Shanghai fork is coming, but it doesn't mean investors should dump ETH - Cointelegraph",
        "content": "Ethereum’s next big upgrade, Shanghai, is on the horizon for March. The Shanghai hard fork will implement further improvement proposals for the Ethereum network as well as enable Ether (ETH) stakers and validators to withdraw their assets from the Beacon Chain.\n\nAt the time of writing, staked ETH represents approximately 14% of the total supply, or 16 million coins. It equates to over $25 billion at ETH’s current price, a substantial sum that will gradually become liquid following the fork.\n\nSome ETH stakers have waited over three years to withdraw their rewards. Does that mean most of them will line up to withdraw and sell their ETH as quickly as possible? This scenario is improbable. There are numerous reasons why investors shouldn’t be concerned about the impending update, and even more why most Ethereum stakeholders will increase their investment into staking following Shanghai.\n\nEthereum will remain the leading PoS network\n\nAlthough ETH is the second-largest cryptocurrency by market cap, Ethereum is the leading proof-of-stake (PoS) network. At the time of writing, it accounts for approximately 65% of the total value locked in decentralized finance (DeFi) protocols, sitting at around $48.7 billion.\n\nTotal value locked on all blockchains. Source: DeFi Llama\n\nDespite the current market, the amount of ETH deposited over time has continued to increase at a steady, stable rate, reaching over 500,000 validators in January 2023.\n\nStaking yield remains strong\n\nThe staking yield remains stable and currently sits at about 5.45% annual percentage rate (APR). Therefore, new entrants should familiarize themselves with the overall yield compensation structure consisting of staking rewards, tips and maximal extractable value (MEV).\n\nWith MEV-Boost, stakers can increase their rewards 2x–3.5x over vanilla blocks. However, when demand for ETH is on the rise, it is tips and MEV that ultimately improve ETH staking yields. Since moving to proof-of-stake, MEV relayers have relayed approximately 85,000 ETH and facilitated an increase of 32,500 ETH in additional rewards.\n\nLiquidity attracts stakers\n\nAs with any market, liquidity is king. Most investors were originally reluctant to stake ETH when it became available because doing so required locking up their funds for an undetermined period of time. Staking ETH required a minimum of 32 ETH, meaning that when Eth2 launched in December 2020, the price of entry was around $19,000. At its peak in November 2021, the price was nearly $150,000.\n\nRelated: Post-Merge ETH has become obsolete\n\nThat cost to stake gave validators pause, and many held off on securing the network. The Shanghai update, however, will remove this uncertainty, and tokenholders will be allowed to withdraw their staked assets. The obvious reaction is to assume that people will simply withdraw their funds and “cash out,” but we are likely going to see the exact opposite. Because such a large percentage of investors were initially reluctant to stake ETH — remember, only 14% of the supply is currently staked — the percentage of ETH staked is likely going to rise with the risk of withdrawal uncertainty gone.\n\nAdditionally, many ETH stakers bought the token during the bull run when prices hit a top of $4,500. But with the current price hovering around $1,600, it is unlikely that current stakers will sell at a loss. With MEV-boosted rewards sitting close to 7% and a positive outlook on a market price increase due to deflationary tokenomics, we expect to see a significant inflow into ETH staking.\n\nThe rise of liquid staking\n\nStakers can stake ETH directly with Ethereum, which requires a hefty sum of 32 ETH, or via liquid staking protocols such as Lido and Rocket Pool. Liquid staking is a concept that democratizes Ethereum staking for investors who can stake as little as 0.01 ETH. Staking small amounts of Ether is possible when investors exchange their ETH for derivative tokens, which are backed one-to-one and represent the amount of Ether staked in the pool.\n\nThe capital efficiency of liquid staking is one of its main advantages for investors. Sometimes referred to as liquid staking derivatives (LSD), it gives you the freedom to enter and exit the market at will. Because it’s a derivative, it gives investors access to additional markets, and the LSD industry is just beginning to get off the ground.\n\nImprovement proposals and their impact\n\nThe upcoming Shanghai upgrade (EIP-4895) will focus on enabling withdrawals on the execution layer — Shanghai — and the consensus layer, referred to as the Capella upgrade. The Capella upgrade is especially beneficial for ETH stakers interested in understanding how withdrawals will work, as interactions are necessary to complete a full withdrawal on the consensus layer.\n\nRelated: Tax on income you never earned? It’s possible after Ethereum’s Merge\n\nEthereum’s roadmap has several updates coming after Shanghai — sometimes referred to as the “Surge,” “Verge,” “Purge” and “Splurge” — demonstrating the community’s dedication and long-term vision, which is essential for the protocol’s future evolution. In the immediate future, EIP-4844 (proto-danksharding) can scale Ethereum with new transaction roll-ups reducing gas fees, and EIP-3540 will aim to reduce the Ethereum Virtual Machine’s resource requirements.\n\nIn 2022, Ethereum saw a 178% increase in developer activity for programming libraries, reaching 1.5 million downloads. Despite the market being down, developers have ramped up real-world solutions and continue to build smart contracts on Ethereum at a blistering pace, hitting 4.6 million deployments for Q4 2022.\n\nEthereum mainnet smart contracts deployed per quarter. Source: Dune\n\nThe success of switching Ethereum from proof-of-work to proof-of-stake should not be understated as an incredible achievement. Now that this move has been a resounding success, upgrades will be released faster, thanks to a community that is unmatched in terms of creativity, values and long-term vision. The foundation of cryptocurrency and proof-of-stake has been built on Ethereum, and it has a highly promising future.\n\nInvestors and stakers would be wise to keep their ETH staked, allowing it to continue to secure and decentralize the network. And generating some additional passive income from staking rewards doesn’t hurt the decision to remain, either.\n\nKonstantin Boyko-Romanovsky is the CEO of Allnodes. He holds a master’s degree in architecture from Moscow Architectural Institute and spent more than a decade in the video game industry, with a focus on Russia and Eurasian markets.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    }
]