[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9ldGhlcmV1bS1hcy1ibHVlLWNoaXAtbmZ0cy1sZWF2ZS13aG8tdGFrZXMtdGhlLXNwb3RsaWdodC_SAVNodHRwczovL2FtYmNyeXB0by5jb20vZXRoZXJldW0tYXMtYmx1ZS1jaGlwLW5mdHMtbGVhdmUtd2hvLXRha2VzLXRoZS1zcG90bGlnaHQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "Ethereum: As blue chip NFTs leave, who takes the spotlight? - AMBCrypto News",
        "content": "The volume of blue chip collections, including BAYC, Otherdeed, and MAYC, all declined around the same period\n\nOther not-so-popular collections filled in for the decrease, but there were no substantial changes.\n\nEthereum [ETH] NFTs like Otherdeed, Moonbirds, and Bored Ape Yacht Club [BAYC] were almost always on the list of collections with the most daily gains. Historically, in cases where some do not fall into the fray, others still join those with the most sales volume and transactions.\n\nRead Ethereum’s [ETH] Price Prediction 2023-2024\n\nBut on 23 February, BAYC, Mutant Ape Yacht Club [MAYC], Otherdeed, and Azuki recorded massive declines as attention moved to other collections. According to CryptoSlam, MAYC still led the volume ranking, but it was only because of the NFT’s high floor prices.\n\nAt press time, the MAYC sales volume was $14.88 million — 8.41% down from the previous 24 hours. Transactions were also down to 564, with reduced involvement of buyers and sellers. In BAYC’s case, it went down to the fifth position. However, it suffered a more tremendous decline than its Yuga Labs’ counterpart.\n\nFrom the image above, BAYC dumped 52.31% in volume, with double-digit decreases in transactions, buyers, and sellers. So, which collection has outperformed the usual suspects?\n\nPenguins, Valhalla, and KILLABEARS NFTs\n\nIn a surprising move, the Pudgy Penguins collection broke into the top 10. Launched in 2021, Pudgy Penguins is an Ethereum-based collection comprising 8,888 penguin NFTs. The project was also an instant hit during the season when profile picture projects (PFP) were the center of attraction.\n\nAt press time, Pudgy Penguins’ sales volume was $2.43 million in the last 24 hours. This represented a 41% increase within the said timeframe. However, data from the NFT aggregator revealed that an incredible increase in buyer and seller participation was vital to the landmark. All in all, 297 transactions led to the rise.\n\nHowever, Pudgy Penguins was only one of many Ethereum NFTs with such a performance. KILLABEARS registered $1.128 million in sales despite being the 16th. However, the most notable surge out of the lots was the Valhalla collection.\n\nIs your portfolio green? Check out the Ethereum Profit Calculator\n\nThe collection, which is a crypto-native brand for gamers, increased 483%, thereby making its 24-hour sales volume $2.43 million.\n\nDespite the giant strides recorded by these collections, sales of the Ethereum NFT ecosystem were still down. At the time of writing, the overall sales volume was $82.12 million — a 28.53% decline. Nonetheless, the decline in the blue-chip collections volume might only last a while."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3BvbHlnb24tc3VyZ2VzLWFoZWFkLWNhbi1tYXRpYy1vdXRwYWNlLWV0aGVyZXVtL9IBT2h0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL3BvbHlnb24tc3VyZ2VzLWFoZWFkLWNhbi1tYXRpYy1vdXRwYWNlLWV0aGVyZXVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "Polygon Surges Ahead: Can MATIC Outpace Ethereum? - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nPolygon (MATIC) has become one of the most talked-about projects in the cryptocurrency world due to its explosive growth and numerous high-profile partnerships. The project has gained traction and made significant progress in the scaling and adoption of blockchain technology in recent years. Its success has led many to wonder if MATIC can outpace Ether as the go-to blockchain for corporations and the mainstream audience.\n\nBitboy Crypto, the popular YouTube channel run by Ben Armstrong, recently highlighted Polygon’s massive momentum and wind underneath its wings, leading to speculation that it could outpace Ethereum in the near future.\n\nExplosive Growth on the Horizon\n\nAccording to a recent announcement, Polygon has settled on March 27 as the launch date for its much-anticipated ZK EVM mainnet beta network. ZK EVM is a groundbreaking technology that aims to increase the speed of blockchain transactions and reduce their cost.\n\nIt generates cryptographic proofs to process transactions faster before those transactions are sent back to layer 1 networks, in this case, Ethereum. This technology is similar to that used by Polygon’s rivals, Solana and XRP, which have faster transaction speeds and unparalleled centralization. The adoption of ZK EVM by Polygon could help it to overtake Ethereum in the near future.\n\nPartnerships Galore\n\nPolygon has already signed partnerships with Dolce and Gabbana, Disney, and Stripe, among other major corporations. Instagram’s recent announcement that it would be using Polygon for its upcoming in-app NFT minting feature is another major endorsement.\n\nInstagram has over two billion monthly users, which means lots of potential traffic for the Polygon network. Nike has also joined the bandwagon, with its Web3 Studio kicking off with Polygon NFTs. DraftKings and the PGA Tour have also jumped on the Polygon train, with their NFT player cards being built on the platform.\n\nPolygon’s Stellar Performance\n\nPolygon has been performing exceptionally well, with its daily active addresses recently surpassing those of Ethereum. Daily active users on Polygon have surpassed those on Ethereum, with the blockchain coming in second behind BNB Chain, which is known for being set up for a bunch of rug pulls. Polygon’s NFT sales on Open Sea have also beaten Ethereum for the second straight month. These low-cost assets are popular with investors and traders alike.\n\nMATIC Price\n\nThe price of MATIC has risen dramatically over the previous two days, reaching the $1.25 threshold. Speed was gained, and MATIC is now clearly above the $1.30 resistance area. The price surged beyond the $1.50 barrier, an increase of roughly 25%.\n\nA peak was set close to $1.568, and a subsequent downward correction has begun, mirroring that of Bitcoin and Ethereum. There was a break from the $1.40 and $1.42 support levels, indicating more weakness in the market."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLXVuZGVyZG9nLWNyeXB0b3MtYnV5LXdpbi0yMjM0Mzk3MjIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "3 Underdog Cryptos to Buy to Win Big in 2023 - Yahoo Finance",
        "content": "To paraphrase a famous Mark Twain quote, reports of the death of cryptocurrencies have been greatly exaggerated. In fact, crypto has been on a red-hot run so far in 2023, outperforming most other asset classes, including stocks. In 2023, the price of Bitcoin (BTC-USD), the biggest cryptocurrency by market capitalization, is up 40%. At the start of December, following the spectacular $8 billion implosion of FTX, a crypto exchange, Bitcoin was trading under $16,000; now it’s changing hands for just over $23,000. Other digital coins and tokens have also had strong rallies since the start of January. While some market observers attempt to dismiss the current bull run, others say it is a clear sign that investors’ appetite for risk has returned and that cryptocurrencies aren’t going away anytime soon. In fact, many analysts see the rebound of digital coins and tokens as a clear sign of their resiliency in the wake of an industry shakeout during the second half of 2022. Whatever the reason, there’s no denying that cryptocurrencies are once again marching higher. Here are three underdog cryptos to buy to win big in 2023.\n\nETH Ethereum $1,617 ADA Cardano 35.9 cents TRX Tron 6.9 cents\n\nEthereum (ETH)\n\nA concept image of mining an Ethereum (ETH) token.\n\nSource: Shutterstock\n\nEthereum (ETH-USD) is typically thought of as the other cryptocurrency besides Bitcoin. The second-largest crypto by market cap, Ethereum often plays second fiddle to the larger BTC, which tends to serve as a bellwether for the entire market of digital coins and tokens. Yet many crypto bulls claim that Ethereum has a brighter future than Bitcoin and that it is ETH that will prove to be the long-term winner when it comes to the future of the sector.\n\nMany crypto purists favor Ethereum because, they say, it helps to facilitate decentralized financial (DeFi) transactions and has more utility than Bitcoin. They also point to the fact that ETH is now more environmentally friendly than BTC after it underwent a transformation last September to a more energy-efficient proof-of-stake protocol. Today mining for Ethereum takes a fraction of the energy consumed when mining for Bitcoin and other cryptos. This, say Ethereum fans, will make all the difference moving forward.\n\nStory continues\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nMore upgrades and enhancements to Ethereum are scheduled for this year. And those enhancements could serve as a catalyst for ETH. Over the past year, Ethereum’s price has declined 43%. However, the crypto has been on a run so far in 2023, rising over 30%.\n\nCardano (ADA)\n\nA concept token for Cardano with a trading chart in the background.\n\nSource: Shutterstock\n\nAnother crypto that has been ripping higher this year is Cardano (ADA-USD). Through almost two months of the year, ADA has gained 46%. While the current price is far below Cardano’s market peak of $2.85 reached in August 2021, its recovery so far this year has been cheered by investors and analysts, many of whom see Cardano as a dark horse in the race for crypto supremacy.\n\nCardano competes head-to-head against Ethereum in the realm of DeFi and smart contracts. Cardano’s underlying blockchain technology was given a boost in late 2021 when it completed the Alonzo hard fork. Fans say that the hard-fork upgrade puts Cardano on equal footing with Ethereum, though investors can purchase ADA for a fraction of the cost of a single ETH token. Proponents of Cardano recently cheered news that the crypto had surpassed 60 million blockchain transactions.\n\nTron (TRX)\n\nDigital data flow on road with motion blur to create vision of fast speed transfer. Concept of future digital transformation, disruptive innovation and agile business methodology. LTRX stock\n\nSource: Blue Planet Studio / Shutterstock.com\n\nThose looking for a cryptocurrency that continues to float largely under the radar should consider TRON (TRX-USD). Founded in 2014 by Justin Sun, a graduate of the University of Pennsylvania who was born in China, Tron contains many of the best attributes of both ETH and ADA.\n\nLike those cryptos, TRX has smart contract functionality and operates on an energy-efficient, proof-of-stake protocol. However, Tron also runs on a decentralized, open-source blockchain operating system.\n\nTron is viewed as a favorite among smaller, lesser-known cryptocurrencies. TRX has risen 25% in 2023. It’s also one of the few digital coins or tokens whose price is up over the past 12 months.\n\nIn the last year, Tron has gained 17%. Its steady, consistent gain is unusual among cryptocurrencies given the market volatility of the past few years, and it makes Tron a crypto to buy to win big in 2023.\n\nOn the date of publication, Joel Baglole did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia.\n\nMore From InvestorPlace\n\nThe post 3 Underdog Cryptos to Buy to Win Big in 2023 appeared first on InvestorPlace."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLXVuZGVyZG9nLWNyeXB0b3MtYnV5LXdpbi0yMjM0Mzk3MjIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "3 Underdog Cryptos to Buy to Win Big in 2023 - Yahoo Finance",
        "content": "To paraphrase a famous Mark Twain quote, reports of the death of cryptocurrencies have been greatly exaggerated. In fact, crypto has been on a red-hot run so far in 2023, outperforming most other asset classes, including stocks. In 2023, the price of Bitcoin (BTC-USD), the biggest cryptocurrency by market capitalization, is up 40%. At the start of December, following the spectacular $8 billion implosion of FTX, a crypto exchange, Bitcoin was trading under $16,000; now it’s changing hands for just over $23,000. Other digital coins and tokens have also had strong rallies since the start of January. While some market observers attempt to dismiss the current bull run, others say it is a clear sign that investors’ appetite for risk has returned and that cryptocurrencies aren’t going away anytime soon. In fact, many analysts see the rebound of digital coins and tokens as a clear sign of their resiliency in the wake of an industry shakeout during the second half of 2022. Whatever the reason, there’s no denying that cryptocurrencies are once again marching higher. Here are three underdog cryptos to buy to win big in 2023.\n\nETH Ethereum $1,617 ADA Cardano 35.9 cents TRX Tron 6.9 cents\n\nEthereum (ETH)\n\nA concept image of mining an Ethereum (ETH) token.\n\nSource: Shutterstock\n\nEthereum (ETH-USD) is typically thought of as the other cryptocurrency besides Bitcoin. The second-largest crypto by market cap, Ethereum often plays second fiddle to the larger BTC, which tends to serve as a bellwether for the entire market of digital coins and tokens. Yet many crypto bulls claim that Ethereum has a brighter future than Bitcoin and that it is ETH that will prove to be the long-term winner when it comes to the future of the sector.\n\nMany crypto purists favor Ethereum because, they say, it helps to facilitate decentralized financial (DeFi) transactions and has more utility than Bitcoin. They also point to the fact that ETH is now more environmentally friendly than BTC after it underwent a transformation last September to a more energy-efficient proof-of-stake protocol. Today mining for Ethereum takes a fraction of the energy consumed when mining for Bitcoin and other cryptos. This, say Ethereum fans, will make all the difference moving forward.\n\nStory continues\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nMore upgrades and enhancements to Ethereum are scheduled for this year. And those enhancements could serve as a catalyst for ETH. Over the past year, Ethereum’s price has declined 43%. However, the crypto has been on a run so far in 2023, rising over 30%.\n\nCardano (ADA)\n\nA concept token for Cardano with a trading chart in the background.\n\nSource: Shutterstock\n\nAnother crypto that has been ripping higher this year is Cardano (ADA-USD). Through almost two months of the year, ADA has gained 46%. While the current price is far below Cardano’s market peak of $2.85 reached in August 2021, its recovery so far this year has been cheered by investors and analysts, many of whom see Cardano as a dark horse in the race for crypto supremacy.\n\nCardano competes head-to-head against Ethereum in the realm of DeFi and smart contracts. Cardano’s underlying blockchain technology was given a boost in late 2021 when it completed the Alonzo hard fork. Fans say that the hard-fork upgrade puts Cardano on equal footing with Ethereum, though investors can purchase ADA for a fraction of the cost of a single ETH token. Proponents of Cardano recently cheered news that the crypto had surpassed 60 million blockchain transactions.\n\nTron (TRX)\n\nDigital data flow on road with motion blur to create vision of fast speed transfer. Concept of future digital transformation, disruptive innovation and agile business methodology. LTRX stock\n\nSource: Blue Planet Studio / Shutterstock.com\n\nThose looking for a cryptocurrency that continues to float largely under the radar should consider TRON (TRX-USD). Founded in 2014 by Justin Sun, a graduate of the University of Pennsylvania who was born in China, Tron contains many of the best attributes of both ETH and ADA.\n\nLike those cryptos, TRX has smart contract functionality and operates on an energy-efficient, proof-of-stake protocol. However, Tron also runs on a decentralized, open-source blockchain operating system.\n\nTron is viewed as a favorite among smaller, lesser-known cryptocurrencies. TRX has risen 25% in 2023. It’s also one of the few digital coins or tokens whose price is up over the past 12 months.\n\nIn the last year, Tron has gained 17%. Its steady, consistent gain is unusual among cryptocurrencies given the market volatility of the past few years, and it makes Tron a crypto to buy to win big in 2023.\n\nOn the date of publication, Joel Baglole did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia.\n\nMore From InvestorPlace\n\nThe post 3 Underdog Cryptos to Buy to Win Big in 2023 appeared first on InvestorPlace."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZGFpbHljb2luLmNvbS9hcmJpdHJ1bS1zY2FsaW5nLXNvbHV0aW9uLWV2ZXJ5dGhpbmctdG8ta25vdy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "Arbitrum Scaling Solution: Everything You Need to Know - DailyCoin",
        "content": "Arbitrum is a layer 2 (L2) chain built on Ethereum that helps solve the congestion problem on the Ethereum main net. The network was developed by a New-York based company called Offchain labs.\n\nThe Arbitrum chain is a scaling solution used to confirm transactions on the main Ethereum network. The chain does this by recording Ethereum transactions and then relaying them to the Ethereum main chain at a later point. By doing this, it solves the congestion problem on the main net.\n\nHistory of Arbitrum\n\nArbitrum was founded by Offchain Labs in 2018. Offchain Labs itself was founded in 2018 by Ed Felten, Harry Kalodner, and Steven Goldfeder.\n\nFelten was a Computer Science and Public Relations professor at Princeton before he started building Offchain Labs. He also served as the Deputy Chief Technology officer of the White House between 2015 and 2017. After leaving his position at the White House, Felten went on to found Offchain Labs.\n\nAccording to Felten, the idea behind Offchain Labs came to him while he was an academic at Princeton. He says that he’d started working on it back then, and only started doing it full-time after leaving his White House position.\n\nSince Felten started Offchain Labs, the company has received a lot of support. It has gotten investment from crypto juggernauts such as Coinbase Ventures, Panthera, and Blocknation since its inception.\n\nBut what is Arbitrium, and how does it work?\n\nHow Does Arbitrum Work?\n\nA big problem of the Ethereum blockchain is speed. The blockchain can only facilitate a certain number of transactions at a time, and when this number is exceeded, other transactions form a queue. This could lead to some inconvenient situations.\n\nFor example, some dApps, such as Farmers World require transactions to be completed in real-time. If these transactions aren’t completed in real-time (or a close approximation), they could render the dApp worthless. The congestion on Ethereum means that these transactions could be delayed by a considerable period of time.\n\nSuch dApps now have to endure that delay because of Ethereum’s popularity. There are more dApps on Ethereum now, and transaction delays have only grown. That means more transactions are being loaded into the chain, and it’s taking even more time for these transactions to be completed.\n\nThere are two proposed solutions for this congestion problem on the Ethereum chain. The first solution to this problem is to embrace sharding. That is, the Ethereum chain will be split into multiple shards, which should theoretically increase the capacity of the chain to complete transactions.\n\nHowever, sharding the Ethereum network is a long and complicated process. While it already exists right now, it’s not yet at a scale where it will necessarily impact transaction time. This means that dApps that want faster transaction time need to look for another immediate solution.\n\nThe second solution for this decongestion is off-chain data confirmation. This means relaying the smart contracts to an off-chain solution that confirms it and then adds it to the Ethereum chain at a later date.\n\nThis method of confirming transactions is called roll-up. According to Ethereum, rollup solutions perform transactions outside the Ethereum blockchain and then post the data to the chain where consensus is reached.\n\nThis means that certain transactions can be confirmed in real-time, while consensus over the transaction will be reached on the Ethereum main chain at a later point. Since the transaction data is included in the layer 1 blocks, the transactions retain an equal level of safety as directly confirmed transactions.\n\nThese rollups are performed by layer 2 chains, and Arbitrum is one such chain.\n\nThe Ethereum Merge and Gas Fees\n\nIn late 2022, Ethereum took a huge step towards sharding by completing the Ethereum merge. This merge was theoretically supposed to reduce congestion on the Ethereum chain and make it easier to confirm transactions through it. However, Ethereum’s congestion problem has remained despite the merge. This means that Arbitrum and layers like it will probably become even more popular.\n\nArbitrum doesn’t just solve the decongestion problem on Ethereum, it also solves the gas fees problem too. The bigger the congestion on the ETH network, the higher the gas fee one has to pay for quick transactions. However, Arbitrum solves that problem because contracts are now validated in batches.\n\nThe Optimistic Arbitrum\n\nThere are two types of transaction rollup chains, and they differ because of their security models.\n\nThe first is the zero-knowledge rollups. The zero-knowledge rollups perform the computation of transactions off-chain and then submit it to the layer 1 chain through a validity proof. The summary data submitted to the chain from the rollup only defines the changes that should be made to the Ethereum state and cryptographic proof that those changes are correct and valid.\n\nOptimistic rollups, on the other hand, submits the data assuming it is correct by default. Hence, the validity of the data is only double-checked if there’s someone challenges it. To ascertain the validity of the transaction, a fraud-proof is automatically run on the changed data.\n\nArbitrum is an optimistic rollup chain, which means that data is submitted with the assumption that it is valid by default. Because of Arbitrum’s optimistic data outlook, it has important advantages over zero-knowledge layer 2 chains.\n\nFor one, optimistic rollups are cheaper than zero-knowledge solutions. The gas fees are often lower per transaction batch, and the network also has lower off-chain computation costs.\n\nSecondly, optimistic rollups are directly compatible with the Ethereum Virtual Machine (EVM). This means that even layer 1 applications can easily connect to Arbitrum and enjoy faster confirmation times.\n\nThe Arbitrum Coin?\n\nLayer 2 solutions usually have native coins that are used to compensate validators. However, Arbitrum doesn’t have a native coin. According to Ed Felten, the co-founder of Offchain labs, there is no plan to launch a separate Arbitrum token.\n\nThis means there is no direct way to invest in Arbitrum. However, there’s been a few changes to the position of Offchain Labs when it comes to minting an Arbitrum Coin. In April 2022, a cofounder of Offchain labs, Steven Goldfeder, posted a tweet that insinuated that an “Arbi” coin is in the works. This tweet was most likely a response to Arbitrum’s competitor, Optimism, releasing an OP token.\n\nHowever, it may not be advisable for Arbitrum to drop a token right now. The bear market is still ravaging the crypto ecosystem despite Bitcoin’s recent recovery, and things are still a bit uncertain. While no one can say what Offchain Labs will do for sure, it’s likely that they hold off any potential token drop until the market recovers.\n\nOn the Flipside\n\nVitalik Buterin has argued that layer 2 chains may be the permanent solution to Ethereum’s congestion problems, rather than a stopgap.\n\nArbitrum doesn’t have a token. This means that it’s impossible for small retail investors to invest in it.\n\nWhy You Should Care\n\nLayer 2 chains like Arbitrum are one of the most exciting developments in crypto in recent times. This is because they could be the permanent solution to Ethereum’s congestion problem. Since Ethereum’s congestion problem is a big stumbling block to crypto adoption, solving it could be big news for the crypto ecosystem.\n\nFAQs"
    }
]