[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xNDg2NDgvY29pbmJhc2UtcmVzdHJpY3RzLWV0aGVyZXVtLXNvbGFuYS1zdGFraW5nLWluLWZvdXItdXMtc3RhdGVz0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzE0ODY0OC9jb2luYmFzZS1yZXN0cmljdHMtZXRoZXJldW0tc29sYW5hLXN0YWtpbmctaW4tZm91ci11cy1zdGF0ZXM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Coinbase Restricts Ethereum, Solana Staking in Four US States - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAmerica's largest crypto exchange Coinbase today said in a statement that it stands by staking and that it will fight the service in court—but would stop staking for new customers in California, New Jersey, South Carolina, and Wisconsin.\n\nIn a Friday statement, the San Francisco-based digital asset company that \"Americans in every state deserve access to the same technology and economic opportunities as people everywhere,\" and therefore it would push back against certain states requiring a staking ban.\n\n\n\nBut for now, customers in the four states will be unable to stake additional assets through Coinbase while these actions are pending.\n\nAD\n\nAD\n\n\"Due to the actions taken by state regulators in California, New Jersey, South Carolina, and Wisconsin, customers in those states will be unable to stake additional assets through Coinbase while these actions are pending,\" the company said, adding that customers' crypto that was staked before these orders were issued remains unaffected.\n\nThe news comes after U.S. Securities and Exchange Commission last month sued Coinbase for allegedly failing to register as an exchange, clearing house, and broker despite providing investors these services.\n\nWall Street's biggest regulator also alleged that Coinbase offered and sold unregistered securities via its staking service.\n\nShortly afterwards, a multi-state task force that includes California, Illinois, Kentucky, Maryland, New Jersey, South Carolina, Vermont, Washington, Wisconsin along with Alabama filed charges against the company for violating securities laws.\n\nStaking is the process of \"locking-up\" cryptocurrency to keep a blockchain’s network running. Those who hold proof-of-stake assets—such as Ethereum (ETH), the second largest cryptocurrency by market capitalization—pledge it to the network by sending it to a specific blockchain address and can receive rewards for doing so.\n\nAD\n\nAD\n\nBut it’s a controversial issue: The SEC in February hit American crypto exchange Kraken with a $30 million fine for allegedly failing to register the offer and sale of its crypto asset staking-as-a-service program.\n\n\n\nEditor's Note: This post was corrected reflect that 10 states are alleging Coinbase has violated securities laws."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1icmVha3MtMjAwMC_SAURodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9ldGgvZXRoZXJldW0tcHJpY2UtYnJlYWtzLTIwMDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Ethereum Price Breaks $2,000 As The Bulls Take Over Crypto Market - NewsBTC",
        "content": "Ethereum price is up over 7% and trading above $2,000 against the US Dollar. ETH gained pace after XRP jumped over 80% and cleared $0.90.\n\nEthereum is up over 7% from the $1,850 support zone.\n\nThe price is trading above $1,980 and the 100-hourly Simple Moving Average.\n\nThere was a break above a key contracting triangle with resistance near $1,885 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair could rise further toward the $2,050 and $2,120 resistance levels.\n\nEthereum Price Aims Higher\n\nEthereum’s price remained well-bid above the $1,850 zone. ETH started a decent increase after XRP surged over 50%. There was a move above the key $1,890 resistance zone. Many altcoins, including MATIC, SOL, BNB, and ADA gained handsomely in the past few hours.\n\nThere was also a break above a key contracting triangle with resistance near $1,885 on the hourly chart of ETH/USD. The pair gained over 7% and even surpassed the $2,000 resistance zone. A high is formed near $2,027 and the price is now consolidating gains.\n\nEther is trading above $1,980 and the 100-hourly Simple Moving Average. It is also well above the 23.6% Fib retracement level of the upward move from the $1,865 swing low to the $2,027 high.\n\nSource: ETHUSD on TradingView.com\n\nOn the upside, immediate resistance is near the $2,025 level. The first major resistance is near the $2,050 zone, above which the price could rise toward the $2,120 resistance zone. The next major resistance is near the $2,200 level. Any more gains could send Ether toward the $2,250 resistance or even $2,350.\n\nAre Dips Limited in ETH?\n\nIf Ethereum fails to clear the $2,025 resistance, it could start a downside correction. Initial support on the downside is near the $2,000 level.\n\nThe first major support is near the $1,980 level, below which the price might test the $1,945 level. It is close to the 50% Fib retracement level of the upward move from the $1,865 swing low to the $2,027 high. The next major support is near the $1,905 level. Any more losses could send Ether toward the $1,865 support level in the near term.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is gaining momentum in the bullish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $1,945\n\nMajor Resistance Level – $2,050\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG9wdW5rcy1ldGhlcmV1bS1uZnQtc2Vuc2F0aW9uLTEzNTEwMjAwMS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "What Are CryptoPunks? The Ethereum NFT Sensation's Wild Ride - Yahoo Finance",
        "content": "CryptoPunks have been back in the news of late. Seedphrase, a DJ who owns the rarest CryptoPunks NFT out there (CryptoPunk #8348), announced this month that he had signed to talent agency WME for a new record release. And in June, Yuga Labs—which acquired CryptoPunks in May 2022—announced that it intended to release a book on the popular NFTs. So what, exactly, is this oddly-named commodity with its pixellated avatars?\n\nYuga Labs Is Writing the Book on CryptoPunks—Literally\n\nThe market for crypto collectibles released as non-fungible tokens (NFTs) exploded in 2021, with $2.5 billion in transaction volume in the first six months as NFTs entered the mainstream.\n\nCryptoPunk DJ Seedphrase Signs to WME, Plans to Release Music\n\nThe boom also saw NFT enthusiasts rediscovering some of the earliest non-fungible tokens, propelling the value of these crypto collectibles to hitherto-unknown highs.\n\nOne of these early NFT projects was CryptoPunks: a set of randomly generated pixel-based avatars. Some of the rarest, most desirable CryptoPunks have sold for millions of dollars. Seriously! By mid-2022, the tokens had seen over $2 billion total sales volume.\n\nHere’s what you need to know about one of the most popular NFT collections around.\n\nWhat are CryptoPunks?\n\nCreated by development studio Larva Labs, CryptoPunks are a series of 10,000 images tokenized as NFTs on the Ethereum blockchain. An NFT is effectively a deed of ownership to a digital item, and in this case, holding a CryptoPunks NFT means that you are the sole owner of a one-of-a-kind pixel avatar. As mentioned above, ownership of CryptoPunks changed hands from Larva to Yuga Labs in May 2022. Yuga is the creator of the Bored Ape Yacht Club NFT.\n\nBeginner's Guide to NFTs: What Are Non-Fungible Tokens?\n\nEach CryptoPunk is randomly generated from a list of dozens of attributes, which means there’s an array of designs: people, zombies, apes, and even aliens. The aliens and zombies are among the most popular avatars that have commanded some of the highest sale prices to date.\n\nStory continues\n\nWhere did CryptoPunks come from?\n\nBelieve it or not, CryptoPunks were released for free back in 2017. Ethereum’s ERC-721 non-fungible token standard wasn’t even a thing at that point, and the two-person team at Larva Labs released them as an experiment. Ethereum wallet owners snatched up the 9,000 CryptoPunks that were released to the public, while Larva Labs held onto the rest.\n\nEthereum NFT CryptoPunks Hit $1 Billion in Total Sales\n\nNFT volume gradually rose over the next three years, but it wasn’t until late 2020 and especially early 2021 that demand skyrocketed for these provably scarce digital collectibles. The secondary market value for CryptoPunks shot through the roof, leading to multi-million-dollar NFT sales, auctions at Christie’s and Sotheby’s, and a wealth of CryptoPunks used as Twitter profile pictures.\n\nWhat’s so special about them?\n\nCryptoPunks have some high-profile owners, too, such as rapper Jay-Z, YouTube personality Logan Paul and tennis champion Serena Williams.\n\nOn top of that, there are clear differentiators that make certain CryptoPunks more desirable and valuable to collectors. Alien avatars are the rarest of the randomized images, and as such, alien CryptoPunks are among the most expensive NFTs sold to date. Ape and zombie designs are also in demand.\n\nMost of the CryptoPunks just look like humans with varying features and accessories, however, and the plainer-looking ones are close to the market floor in terms of asking price on NFT marketplaces.\n\nThe future\n\nWhat’s next for CryptoPunks? Well, they will likely continue to change hands on secondary markets, potentially generating huge returns for investors who bought in before the surge.\n\nThere’s no way to tell whether the current level of demand will continue, but the entry-level price for Punks continues to rise. As of July 14, 2023, the average CryptoPunk NFT goes for about 53 ETH (about $2000)\n\nThis story was originally published on January 10, 2022 and was updated on July 14, 2023."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG9wdW5rcy1ldGhlcmV1bS1uZnQtc2Vuc2F0aW9uLTEzNTEwMjAwMS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "What Are CryptoPunks? The Ethereum NFT Sensation's Wild Ride - Yahoo Finance",
        "content": "CryptoPunks have been back in the news of late. Seedphrase, a DJ who owns the rarest CryptoPunks NFT out there (CryptoPunk #8348), announced this month that he had signed to talent agency WME for a new record release. And in June, Yuga Labs—which acquired CryptoPunks in May 2022—announced that it intended to release a book on the popular NFTs. So what, exactly, is this oddly-named commodity with its pixellated avatars?\n\nYuga Labs Is Writing the Book on CryptoPunks—Literally\n\nThe market for crypto collectibles released as non-fungible tokens (NFTs) exploded in 2021, with $2.5 billion in transaction volume in the first six months as NFTs entered the mainstream.\n\nCryptoPunk DJ Seedphrase Signs to WME, Plans to Release Music\n\nThe boom also saw NFT enthusiasts rediscovering some of the earliest non-fungible tokens, propelling the value of these crypto collectibles to hitherto-unknown highs.\n\nOne of these early NFT projects was CryptoPunks: a set of randomly generated pixel-based avatars. Some of the rarest, most desirable CryptoPunks have sold for millions of dollars. Seriously! By mid-2022, the tokens had seen over $2 billion total sales volume.\n\nHere’s what you need to know about one of the most popular NFT collections around.\n\nWhat are CryptoPunks?\n\nCreated by development studio Larva Labs, CryptoPunks are a series of 10,000 images tokenized as NFTs on the Ethereum blockchain. An NFT is effectively a deed of ownership to a digital item, and in this case, holding a CryptoPunks NFT means that you are the sole owner of a one-of-a-kind pixel avatar. As mentioned above, ownership of CryptoPunks changed hands from Larva to Yuga Labs in May 2022. Yuga is the creator of the Bored Ape Yacht Club NFT.\n\nBeginner's Guide to NFTs: What Are Non-Fungible Tokens?\n\nEach CryptoPunk is randomly generated from a list of dozens of attributes, which means there’s an array of designs: people, zombies, apes, and even aliens. The aliens and zombies are among the most popular avatars that have commanded some of the highest sale prices to date.\n\nStory continues\n\nWhere did CryptoPunks come from?\n\nBelieve it or not, CryptoPunks were released for free back in 2017. Ethereum’s ERC-721 non-fungible token standard wasn’t even a thing at that point, and the two-person team at Larva Labs released them as an experiment. Ethereum wallet owners snatched up the 9,000 CryptoPunks that were released to the public, while Larva Labs held onto the rest.\n\nEthereum NFT CryptoPunks Hit $1 Billion in Total Sales\n\nNFT volume gradually rose over the next three years, but it wasn’t until late 2020 and especially early 2021 that demand skyrocketed for these provably scarce digital collectibles. The secondary market value for CryptoPunks shot through the roof, leading to multi-million-dollar NFT sales, auctions at Christie’s and Sotheby’s, and a wealth of CryptoPunks used as Twitter profile pictures.\n\nWhat’s so special about them?\n\nCryptoPunks have some high-profile owners, too, such as rapper Jay-Z, YouTube personality Logan Paul and tennis champion Serena Williams.\n\nOn top of that, there are clear differentiators that make certain CryptoPunks more desirable and valuable to collectors. Alien avatars are the rarest of the randomized images, and as such, alien CryptoPunks are among the most expensive NFTs sold to date. Ape and zombie designs are also in demand.\n\nMost of the CryptoPunks just look like humans with varying features and accessories, however, and the plainer-looking ones are close to the market floor in terms of asking price on NFT marketplaces.\n\nThe future\n\nWhat’s next for CryptoPunks? Well, they will likely continue to change hands on secondary markets, potentially generating huge returns for investors who bought in before the surge.\n\nThere’s no way to tell whether the current level of demand will continue, but the entry-level price for Punks continues to rise. As of July 14, 2023, the average CryptoPunk NFT goes for about 53 ETH (about $2000)\n\nThis story was originally published on January 10, 2022 and was updated on July 14, 2023."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1zY2FsaW5nLXByb3RvY29scy1kcml2ZS16ZXJvLWtub3dsZWRnZS1wcm9vZi11c2UtZmluYW5jZS1yZWRlZmluZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Ethereum scaling protocols drive zero-knowledge proof use: Finance Redefined - Cointelegraph",
        "content": "Welcome to Finance Redefined, your weekly dose of essential decentralized finance (DeFi) insights — a newsletter crafted to bring you the most significant developments from the past week.\n\nThis week, Finance Redefined looks at the growing popularity of zero-knowledge proof-based scalable solutions. Zero-knowledge rollups (ZK-rollups) technology has gained a lot of traction over the past year thanks to its increased use in the Ethereum ecosystem.\n\nBug bounties are seen as a great reward system for white hat hackers to weed out bugs in the DeFi ecosystem, which often fall prey to exploits. However, recent analysis suggests these programs have mixed results.\n\nAfter a series of exploits on the Multichain protocol over the past couple of weeks, the founder of Connext proposed a “Sovereign Bridged Token” standard to prevent future issues and exploits.\n\nAlgorand’s decentralized lending protocol is set to wind down by year-end as developers claimed building a borrowing and lending protocol is “no longer a viable path” for the protocol.\n\nThe top 100 DeFi tokens had another mixed week in terms of price action, followed by a late surge on July 13, aided by the partial verdict for Ripple in its fight against the United States Securities and Exchange Commission (SEC), leading to an 84% surge in the XRP (XRP) price.\n\nEthereum scaling protocols drive zero-knowledge proof use in 2023\n\nEthereum scaling protocols dominate the use of ZK-rollups, with major launches, new research and healthy competition among the key highlights in a sector report published by ZKValidator.\n\nThe node infrastructure operator’s “State of ZK Q2” report reflects on significant events across the ZK ecosystem, with notable launches of ZK-powered layer 2’s highlighting the use of the technology for scaling in comparison with other market segments.\n\nContinue reading\n\nAlgorand decentralized lending protocol Algofi to shut down by end of 2023\n\nAlgofi, the borrowing and lending protocol built on the decentralized finance blockchain Algorand, will soon shut down.\n\nAccording to a July 11 announcement, developers’ “belief in the strength of Algorand’s technology and novel consensus algorithm has not wavered,” however, the Algofi platform will wind down soon.\n\nContinue reading\n\nBug bounties can help secure blockchain networks, but have mixed results\n\nBug bounties are programs organizations offer to incentivize security researchers or ethical or white hat hackers to find and report vulnerabilities in their software, websites or systems. Bug bounties aim to improve overall security by identifying and fixing potential weaknesses before malicious actors can exploit them.\n\nOrganizations that implement bug bounty programs typically establish guidelines and rules outlining the scope of the program, eligible targets and the types of vulnerabilities they are interested in. Depending on the severity and impact of the discovered vulnerability, they may also define the rewards offered for valid bug submissions, ranging from small amounts of money to significant cash prizes.\n\nContinue reading\n\nArbitrum-based Rodeo Finance exploited for the second time, $1.5 million stolen\n\nArbitrum-based decentralized finance (DeFi) protocol Rodeo Finance was exploited for $1.53 million on July 11. The DeFi protocol was exploited using a code vulnerability in its Oracle, leading to a loss of over 810 Ether (ETH). Rodeo Finance was earlier exploited on July 5 for around $89,000 due to a vulnerability in its mintProtocolReserves function.\n\nAccording to data shared by blockchain analytic firm PeckShield, the exploiter later bridged the stolen funds from Arbitrum to Ethereum and swapped 285 ETH for unshETH. The exploiter then deposited the ETH on Eth2 staking. Finally, the exploiter routed the stolen ETH using the popular mixer service Tornado Cash, which exploiters often use as an exit route to obscure the transaction’s footprint.\n\nContinue reading\n\nConnext founder proposes ‘Sovereign Bridged Token’ standard after Multichain incident\n\nA July 7 Ethereum improvement proposal (EIP) seeks to standardize how tokens are bridged between networks. The “Sovereign Bridged Token” standard, or EIP-7281, allows token issuers to create canonical bridges across multiple networks.\n\nThe proposal was co-authored by Arjun Bhuptani, founder of the Connext bridging protocol. In a July 7 social media post, Bhuptani claimed the protocol would help prevent issues like the July 6 Multichain incident, which some experts have described as a hack.\n\nContinue reading\n\nDeFi market overview\n\nDeFi’s total market value saw a bullish surge after three bearish weeks. Data from Cointelegraph Markets Pro and TradingView shows that DeFi’s top 100 tokens by market capitalization had a bullish week, with most tokens trading in the green. The total value locked in DeFi protocols remained below $50 billion.\n\nThanks for reading our summary of this week’s most impactful DeFi developments. Join us next Friday for more stories, insights and education regarding this dynamically advancing space.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space."
    }
]