[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vdS50b2RheS9ldGhlcmV1bXMtdml0YWxpay1idXRlcmluLXJhaXNlcy1jb25jZXJucy1vdmVyLXByaXZhY3ktaW4tbW9kZXJuLWNhcnPSAVlodHRwczovL3UudG9kYXkvZXRoZXJldW1zLXZpdGFsaWstYnV0ZXJpbi1yYWlzZXMtY29uY2VybnMtb3Zlci1wcml2YWN5LWluLW1vZGVybi1jYXJzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's Vitalik Buterin Raises Concerns Over Privacy in Modern Cars - U.Today",
        "content": "Advertisement\n\nEthereum co-founder Vitalik Buterin has voiced concerns about the privacy implications of modern cars, drawing attention to the often overlooked aspects of automotive technology.\n\nButerin's comments follow a detailed report by researchers Jen Caltrider, Misha Rykov, and Zoë MacDonald, which showcases the significant privacy issues in today's vehicles.\n\nRising privacy concerns in networked vehicles\n\nThe report mentioned by Buterin states that all 25 car brands evaluated received a \"Privacy Not Included\" warning label, indicating serious privacy shortcomings.\n\nModern vehicles, often described as \"computers on wheels,\" collect an excessive amount of personal data, ranging from location to driving habits, and even inferring personal characteristics.\n\nThis data is not only used for vehicle operations but also for marketing and other business purposes. Furthermore, 84% of these brands are reported to share or sell this personal data, with 56% potentially sharing it with government agencies upon request.\n\nThis alarming level of data collection and sharing has raised significant privacy concerns among experts and consumers alike.\n\nTechnology and privacy\n\nButerin's post has sparked a discussion on social media about the balance between technological advancements and privacy.\n\nSome users express interest in retrofitting classic cars to avoid modern privacy issues while others accuse Buterin of being a technology denier.\n\nHowever, Buterin clarifies his stance, stating that he supports various modern technologies, including certain AI applications, but he maintains a critical view of specific technologies that pose privacy risks. \"There's a small-but-important subset of things I worry about!\" he stressed."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY3J5cHRvLm5ld3Mvc2VjLWRlbGF5cy1ncmF5c2NhbGUtc3BvdC1ldGhlcmV1bS1ldGYtdG8tbWF5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "SEC delays Grayscale spot Ethereum ETF to May - crypto.news",
        "content": "The U.S. Securities and Exchange Commission (SEC) has again delayed issuing a decision on Grayscale’s application to launch a spot Ethereum (ETH) ETF.\n\nAccording to a message on the regulator’s website, the Commission requested public comments on how the regulator should handle Grayscale’s application. The SEC is interested in whether the ETH algorithm – Proof-of-Stake (PoS) and the concentration of a large volume of Ethereum in the hands of several individuals could make the fund vulnerable to fraud and manipulation.\n\nThe next application deadline is in May. The company first applied to launch a spot Ethereum ETF in October 2023. The SEC published its first decision on the application on Dec. 5, 2023. The deadline was January 25, 2024.\n\nIn addition to the application for a spot Ethereum ETF from Grayscale, the Commission previously extended the consideration of applications from Fidelity and BlackRock. The new deadline for the other two applications will be in March.\n\nAt the same time, journalists predict the adoption of spot Ethereum-ETFs by the summer of 2024. This will be preceded by a decision by the CFTC and the SEC to recognize that the second-largest cryptocurrency by capitalization does not comply with a security status.\n\nReporting on the timeline for a potential $ETH ETF approval has turned up a plethora of different takes from ETF issuers, investment management firms and sources close to the @SECGov.\n\n\n\n✨One $BTC Spot ETF issuer with an ETH Spot ETF application says they’re confident the… — Eleanor Terrett (@EleanorTerrett) January 23, 2024\n\nJournalists suggested that such certainty could arise during the trial with Binance. They referred to the previous meeting, noting that DAO tokens can be considered securities.\n\nFollow Us on Google News"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2V0aC9ldGhlcmV1bS1wcmljZS1jb3VsZC1jb3JyZWN0aW9uLTIyNDAv0gFOaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vYW5hbHlzaXMvZXRoL2V0aGVyZXVtLXByaWNlLWNvdWxkLWNvcnJlY3Rpb24tMjI0MC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Price Could See Technical Correction But Upsides Might Be Limited - NewsBTC",
        "content": "Ethereum price is attempting a recovery wave above the $2,200 zone. ETH could start a decent increase if it settles above the $2,240 resistance.\n\nEthereum started an upside correction from the $2,165 zone.\n\nThe price is trading below $2,250 and the 100-hourly Simple Moving Average.\n\nThere is a short-term bearish trend line forming with resistance near $2,225 on the hourly chart of ETH/USD (data feed via Kraken).\n\nThe pair might start a decent increase if it clears the $2,240 resistance zone.\n\nEthereum Price Eyes Recovery\n\nEthereum price managed to form a support base above the $2,165 level. ETH seems to be consolidating losses near the $2,200 level and might aim for a recovery wave, like Bitcoin.\n\nThere was a minor upside correction above the $2,200 level, but the bears are still active near the $2,240 resistance zone. There is also a short-term bearish trend line forming with resistance near $2,225 on the hourly chart of ETH/USD.\n\nEthereum is now trading below $2,250 and the 100-hourly Simple Moving Average. On the upside, the first major resistance is near the $2,240 level. It is close to the 23.6% Fib retracement level of the key drop from the $2,480 swing high to the $2,165 low.\n\nThe next major resistance is near the $2,280 or the 100-hourly Simple Moving Average, above which the price might rise and test the 50% Fib retracement level of the key drop from the $2,480 swing high to the $2,165 low. If the bulls push the price above the $2,320 resistance, they could aim for $2,360.\n\nSource: ETHUSD on TradingView.com\n\nA clear move above the $2,360 level might start a decent increase. In the stated case, the price could rise toward the $2,420 level. Any more gains might send the price toward the $2,500 zone.\n\nAnother Failure in ETH?\n\nIf Ethereum fails to clear the $2,240 resistance, it could start another decline. Initial support on the downside is near the $2,200 level.\n\nThe next key support could be the $2,165 zone. A daily close below the $2,165 support might start another major decline. In the stated case, Ether could test the $2,080 support. Any more losses might send the price toward the $2,000 level.\n\nTechnical Indicators\n\nHourly MACD – The MACD for ETH/USD is losing momentum in the bearish zone.\n\nHourly RSI – The RSI for ETH/USD is now above the 50 level.\n\nMajor Support Level – $2,165\n\nMajor Resistance Level – $2,240\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLXdlYjMtY3J5cHRvcy1wb3RlbnRpYWwtbWFqb3ItMTc1ODQ0MzU1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "3 Web3 Cryptos With the Potential for Major Metaverse Moves - Yahoo Finance",
        "content": "The metaverse hype train veered sharply off the tracks in late-2021 as crypto markets soured. This left many virtual worlds feeling more like ghost towns. But while metaverse mania has cooled considerably, I believe the long-term growth narrative for Web3 and immersive digital environments remains intact. Cyclical downturns are par for the course in crypto, and today’s laggards can spearhead gains when the next bull run begins.\n\nSeveral catalysts on the horizon could re-ignite “meta mania” and crypto bullishness more broadly in 2024 and beyond. More Bitcoin (BTC-USD) ETF approvals, block reward halvings, and potential Fed rate cuts could all fuel digital assets. We’ll look at some top projects today instead of small-cap cryptos. Here are three to consider based on their ties to Web3 and the metaverse.\n\nEthereum (ETH-USD)\n\nA coin with the Ethreum logo on top of a financial document\n\nSource: shutterstock\n\nEthereum (ETH-USD) remains the go-to cryptocurrency for anyone seeking major exposure to the Web 3.0 ecosystem. Even if the recent metaverse and NFT frenzies have cooled, Ethereum still stands as the leading blockchain underpinning countless decentralized apps and services.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nEthereum’s key edge over Bitcoin relates to its support for smart contracts and advanced functionality beyond payments. As the dominant Web3 blockchain, most projects being built in areas like DeFi, NFTs, and the metaverse, increasingly rely on Ethereum’s global computing network. Users of these apps must pay gas fees in Ethereum, creating perpetual demand even during bear markets.\n\nThis wide utility and role as the “fuel” of Web3 is why Ethereum has massively outperformed Bitcoin in previous bull runs. And with the major Dencon upgrade slated to launch by mid-2024, I expect Ethereum’s advantage over Bitcoin to widen further in the next cycle. Dencon aims to slash Ethereum gas fees by up to 90% while accelerating layer-2 scaling solutions.\n\nSo, if we do get an influx of new crypto buyers and restore Web3 hype, I anticipate Ethereum providing major upside. We could see surging decentralized application usage, NFT sales volume growth, and higher gas consumption pushing Ethereum prices significantly higher, perhaps even to new highs. For broad exposure to a potential Web3 resurgence, Ethereum remains the leading crypto to consider.\n\nStory continues\n\nSolana (SOL-USD)\n\nAbstract 3d rendered coin solana (SOL-USD)\n\nSource: solvertv / Shutterstock.com\n\nEven if the upcoming Dencon cuts Ethereum fees and enhances layer-2 capabilities, transacting and building on Ethereum will likely remain pricier and more cumbersome than alternatives like Solana (SOL-USD).\n\nWith lightning-fast speeds and rock-bottom fees, Solana presents a compelling Web3 option for both developers and users. It has already successfully peeled off market share from Ethereum in NFT trading volume and other areas like DeFi.\n\nI expect the network effects and composability benefits of building on a high-activity chain like Solana to help it gain additional traction if we enter a fresh bull cycle, particularly if congestion and high gas fees resurface on Ethereum amid surging usage.\n\nOf course, Solana still has progress to make, notably in improving its network reliability and uptime. However, the Solana team has made big strides in optimizing stability and mitigating outages over the past year.\n\nGiven the immense room for adoption and growth, I think Solana’s price levels around $90 per token seem attractive. Despite its early-stage flaws, Solana remains one of my top altcoin picks for mega returns if the Web3 and metaverse themes catch fire again.\n\nRender Token (RNDR-USD)\n\nThe Render (RNDR) crypto logo displayed on a smartphone screen.\n\nSource: Maurice NORBERT / Shutterstock.com\n\nUnlike Ethereum and Solana, which are essentially generalized Web3 blockchains, Render Token (RNDR-USD) and the Render Network target a specific niche – GPU graphics processing power.\n\nRender operates a network that lets users easily buy and sell excess graphics and compute resources for rendering 3D visuals, animations, models, and more. This on-demand access allows smaller creators to tap into strong GPU performance without substantial up-front investment.\n\nAs metaverse and Web3 content creation pick back up, Render stands to see surging demand from various verticals like architectural and product visualization, special effects, advertisements, video game development, and VR/AR experiences.\n\nIn fact, Render’s native token RNDR has already rocketed higher in recent months – surging from around 40 cents to current levels approaching $4. I expect this momentum to continue over 2023 and 2024 if the overall environment improves for cryptos and its futuristic applications.\n\nOn the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nThe post 3 Web3 Cryptos With the Potential for Major Metaverse Moves appeared first on InvestorPlace."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLXdlYjMtY3J5cHRvcy1wb3RlbnRpYWwtbWFqb3ItMTc1ODQ0MzU1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "3 Web3 Cryptos With the Potential for Major Metaverse Moves - Yahoo Finance",
        "content": "The metaverse hype train veered sharply off the tracks in late-2021 as crypto markets soured. This left many virtual worlds feeling more like ghost towns. But while metaverse mania has cooled considerably, I believe the long-term growth narrative for Web3 and immersive digital environments remains intact. Cyclical downturns are par for the course in crypto, and today’s laggards can spearhead gains when the next bull run begins.\n\nSeveral catalysts on the horizon could re-ignite “meta mania” and crypto bullishness more broadly in 2024 and beyond. More Bitcoin (BTC-USD) ETF approvals, block reward halvings, and potential Fed rate cuts could all fuel digital assets. We’ll look at some top projects today instead of small-cap cryptos. Here are three to consider based on their ties to Web3 and the metaverse.\n\nEthereum (ETH-USD)\n\nA coin with the Ethreum logo on top of a financial document\n\nSource: shutterstock\n\nEthereum (ETH-USD) remains the go-to cryptocurrency for anyone seeking major exposure to the Web 3.0 ecosystem. Even if the recent metaverse and NFT frenzies have cooled, Ethereum still stands as the leading blockchain underpinning countless decentralized apps and services.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nEthereum’s key edge over Bitcoin relates to its support for smart contracts and advanced functionality beyond payments. As the dominant Web3 blockchain, most projects being built in areas like DeFi, NFTs, and the metaverse, increasingly rely on Ethereum’s global computing network. Users of these apps must pay gas fees in Ethereum, creating perpetual demand even during bear markets.\n\nThis wide utility and role as the “fuel” of Web3 is why Ethereum has massively outperformed Bitcoin in previous bull runs. And with the major Dencon upgrade slated to launch by mid-2024, I expect Ethereum’s advantage over Bitcoin to widen further in the next cycle. Dencon aims to slash Ethereum gas fees by up to 90% while accelerating layer-2 scaling solutions.\n\nSo, if we do get an influx of new crypto buyers and restore Web3 hype, I anticipate Ethereum providing major upside. We could see surging decentralized application usage, NFT sales volume growth, and higher gas consumption pushing Ethereum prices significantly higher, perhaps even to new highs. For broad exposure to a potential Web3 resurgence, Ethereum remains the leading crypto to consider.\n\nStory continues\n\nSolana (SOL-USD)\n\nAbstract 3d rendered coin solana (SOL-USD)\n\nSource: solvertv / Shutterstock.com\n\nEven if the upcoming Dencon cuts Ethereum fees and enhances layer-2 capabilities, transacting and building on Ethereum will likely remain pricier and more cumbersome than alternatives like Solana (SOL-USD).\n\nWith lightning-fast speeds and rock-bottom fees, Solana presents a compelling Web3 option for both developers and users. It has already successfully peeled off market share from Ethereum in NFT trading volume and other areas like DeFi.\n\nI expect the network effects and composability benefits of building on a high-activity chain like Solana to help it gain additional traction if we enter a fresh bull cycle, particularly if congestion and high gas fees resurface on Ethereum amid surging usage.\n\nOf course, Solana still has progress to make, notably in improving its network reliability and uptime. However, the Solana team has made big strides in optimizing stability and mitigating outages over the past year.\n\nGiven the immense room for adoption and growth, I think Solana’s price levels around $90 per token seem attractive. Despite its early-stage flaws, Solana remains one of my top altcoin picks for mega returns if the Web3 and metaverse themes catch fire again.\n\nRender Token (RNDR-USD)\n\nThe Render (RNDR) crypto logo displayed on a smartphone screen.\n\nSource: Maurice NORBERT / Shutterstock.com\n\nUnlike Ethereum and Solana, which are essentially generalized Web3 blockchains, Render Token (RNDR-USD) and the Render Network target a specific niche – GPU graphics processing power.\n\nRender operates a network that lets users easily buy and sell excess graphics and compute resources for rendering 3D visuals, animations, models, and more. This on-demand access allows smaller creators to tap into strong GPU performance without substantial up-front investment.\n\nAs metaverse and Web3 content creation pick back up, Render stands to see surging demand from various verticals like architectural and product visualization, special effects, advertisements, video game development, and VR/AR experiences.\n\nIn fact, Render’s native token RNDR has already rocketed higher in recent months – surging from around 40 cents to current levels approaching $4. I expect this momentum to continue over 2023 and 2024 if the overall environment improves for cryptos and its futuristic applications.\n\nOn the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nThe post 3 Web3 Cryptos With the Potential for Major Metaverse Moves appeared first on InvestorPlace."
    }
]