[
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2V0aGVyZXVtLWRlbmN1bi11cGdyYWRlLWNvdWxkLWdvLWxpdmUtb24tbWFpbm5ldC1hcy1lYXJseS1hcy1tYXJjaC0yMDI0LTIwMjQwMTIwMDYzONIBhwFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9ldGhlcmV1bS1kZW5jdW4tdXBncmFkZS1jb3VsZC1nby1saXZlLW9uLW1haW5uZXQtYXMtZWFybHktYXMtbWFyY2gtMjAyNC0yMDI0MDEyMDA2Mzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum Dencun upgrade could go live on mainnet as early as March 2024 - FXStreet",
        "content": "Share:\n\nEthereum developers discussed the Dencun upgrade’s activation on the Goerli testnet in their All Core Developers Execution Call.\n\nDevelopers confirmed the timeline for the Dencun upgrade’s rollout on Sepolia and Holesky testnets.\n\nEthereum Dencun upgrade is likely to see its mainnet release in March, despite a lack of Layer 2 readiness.\n\nEthereum core developers are committed to the Dencun upgrade’s testnet timelines. Despite the issues that arose on the Goerli testnet, the timeline has remained unchanged for Sepolia and Holesky testnet release of the upgrade.\n\nCore developers picked 30 January for Sepolia and 7 February for Holesky rollout of the Dencun upgrade.\n\nAlso read: Lido DAO Community Staking Module to make mainnet debut in the second half of 2024\n\nEthereum developers set fixed timelines for Dencun upgrade\n\nEthereum developers stayed committed to the Dencun testnet timeline, according to the All Core Developers Execution call number 179. The timeline for testing remains unchanged and Galaxy Digital’s Christine Kim believes the likelihood of mainnet activation for the upgrade by the end of March is now 60%.\n\nLayer 2 chains are not currently ready for the upgrade, however, developers are moving ahead with the testnet releases in the next three weeks. It is likely that Dencun goes live on mainnet as early as February if the upgrades on Sepolia and Holesky do not encounter issues.\n\nDevelopers are likely to run additional tests and Layer 2 chains may want to perform client releases on Sepolia and Holesky before the mainnet upgrade. If this occurs, then the likelihood of mainnet release in February is limited to 30%.\n\nThe implementation of EIP-4844 is expected to boost the features of Ethereum and drive adoption of the chain.\n\nExpected Impacts of EIP 4844. Source: Galaxy Research\n\nIf major bugs are discovered in either of the two testnets, Dencun’s arrival on the mainnet could be delayed from March to April.\n\nKey dates to watch out for are January 30 and February 7, dates for the Sepolia and Holesky forks."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vdS50b2RheS9ldGhlcmV1bS1ldGYtdG8tYnJpbmctbWF4LXBhaW4tZm9yLWJ0Yy1kb21pbmFuY2UtdHJhZGVyLXNheXPSAVBodHRwczovL3UudG9kYXkvZXRoZXJldW0tZXRmLXRvLWJyaW5nLW1heC1wYWluLWZvci1idGMtZG9taW5hbmNlLXRyYWRlci1zYXlzP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF to Bring Max Pain for BTC Dominance, Trader Says - U.Today",
        "content": "Top analyst and crypto commentator who goes by @hedge__x on X (formerly Twitter) is sure that Ethereum (ETH) has all chances to outshine Bitcoin (BTC) in the coming bull run.\n\nAdvertisement\n\n\"Max pain for Bitcoin Dominance\": Trader skeptical about Bitcoin (BTC)\n\nBitcoin (BTC), the largest cryptocurrency, is going to set a new all-time high in this cycle. However, even over $100,000 per BTC, it will be disappointing for many Bitcoiners, @hedge__x shared on Jan. 19 on his X.\n\nCorn is going higher this cycle but many will be disappointed at $100k peak.\n\n\n\nETH has much more upside potential w many more future catalyst including ETF.\n\n\n\nMax pain for BTC.D. Max gain for Total2. — Hedgex.eth (@hedge__x) January 19, 2024\n\nBy contrast, Ethereum (ETH) has way more impressive upside potential compared to the orange coin. Among other catalysts, Ethereum (ETH) has possible ETF approval ahead. This might be an amazing catalyst for the next ETH rally.\n\nIt should be noted that Ethereum (ETH) is getting closer to EIP-4844 or Proto-Danksharding upgrade activation. It is set to change the game in L2s and make them more resource-efficient.\n\nAs such, the analyst is positive about the potential of Total2, an indicator of cumulative cryptocurrency markets capitalization excluding Bitcoin (BTC).\n\nThe Bitcoin Dominance (BTC.D) indicator is due to go through \"maximum pain,\" the trader concluded.\n\nLegal status of Ether is crucial for ETH ETF approval\n\nIn January 2024, Bitcoin Dominance (BTC.D) is losing momentum. After registering a local high over 55% on Jan. 9, it lost 7.5% (4.6 points) in less than 10 days.\n\nEthereum ETF is one of the most anticipated events for the cryptocurrency segment in 2024. The community and experts are moderately optimistic about its potential approval.\n\nHowever, the court processes between the U.S. SEC and crypto exchanges over illegal securities offering might affect the timeline of the ETH ETF approval.\n\nTogether with other large-cap altcoins, Ether is one of the tokens the SEC claimed to be unregistered securities."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9zZWMtbWFrZXMtc3BvdC1ldGhlcmV1bS1ldGYtZGVjaXNpb24tYXMtZXRoLW91dGZsb3dzLWhhdmUtdGhlaXItc2F5L9IBXmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9zZWMtbWFrZXMtc3BvdC1ldGhlcmV1bS1ldGYtZGVjaXNpb24tYXMtZXRoLW91dGZsb3dzLWhhdmUtdGhlaXItc2F5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "SEC makes spot Ethereum ETF decision as ETH outflows have their say - AMBCrypto News",
        "content": "SEC extends spot ETH ETF decision by 45 days\n\nMore ETH flows out of exchanges as the wait begins\n\nThe U.S. Securities and Exchange Commission has taken its first concrete step of the year on the route to either approving or rejecting an Ethereum spot ETF. This action was conveyed through a response sent by the SEC to Fidelity.\n\nSEC responds to Fidelity’s spot Ethereum ETF application\n\nAs per a letter dated 18 January, the U.S. Securities and Exchange Commission (SEC) has decided to extend its decision-making process regarding the Fidelity spot Ethereum ETF application. The application, submitted on 17 November 2023 and opened for comments on 6 December, will now undergo an extended resolution period. This follows the SEC’s choice to extend the decision timeline by 45 days.\n\nConsequently, the resolution is anticipated to be around 5 March 2024. Also, Bloomberg analyst James Seyffart suggests that approval may be possible in May. Notably, BlackRock’s CEO Larry Fink is pretty confident of the value attached to a spot Ethereum ETF. He claimed so in an interview shortly after the approval of the spot Bitcoin ETF.\n\nEthereum remains in a downtrend\n\nUpon the approval of the spot Bitcoin ETF, there was no notable surge in price, with analysts attributing this to it being priced in before the announcement. Interestingly, for Ethereum, the news of the proposal submission and the subsequent decision announcement may significantly impact the price more than the actual approval.\n\nAt the time of writing, ETH was trading at around $2,400, experiencing a slight loss of less than 1% in 24 hours. Although it seems to be on a downtrend, ETH’s present value is higher than what its value was a year ago.\n\nAn analysis of the daily timeframe chart revealed that ETH did not reach the present price level over the previous year. Additionally, the ongoing bull trend continued while showing signs of weakening. Notably, the Relative Strength Index (RSI) remained above the neutral line, indicating a bullish trend at press time.\n\nObserving the exchange flow\n\nAMBCrypto’s examination of Ethereum’s exchange flow showed that the balance between inflow and outflow shifted around 14 January. Since then, there has been a consistent trend of more outflow than inflow. This suggested that a more significant amount of ETH is leaving exchanges, compared to the incoming volume.\n\nAlso, the trend implied that fewer Ethereum assets are being offered for sale recently.\n\nRead Ethereum (ETH) Price Prediction 2023-24\n\nAs of 18 January, the data highlighted that over 90,000 ETH have moved out of exchanges, further supporting the notion that market participants are withdrawing their assets from exchange platforms."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2NvbXBhbnkvZXRoZXJldW0tZXRoLW5leHQtaW4tbGluZS1hZnRlci1iaXRjb2luLWJ0Yy1ldGYtaW52ZXN0b3JzLWxvb2stZm9yLWVyYzIwLWdlbXMtbGlrZS1wdWxsaXgtcGx4L9IBhwFodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2NvbXBhbnkvZXRoZXJldW0tZXRoLW5leHQtaW4tbGluZS1hZnRlci1iaXRjb2luLWJ0Yy1ldGYtaW52ZXN0b3JzLWxvb2stZm9yLWVyYzIwLWdlbXMtbGlrZS1wdWxsaXgtcGx4L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Ethereum (ETH) Next In Line After Bitcoin (BTC) ETF, Investors Look For ERC20 Gems Like Pullix (PLX) - NewsBTC",
        "content": "The cryptocurrency market is currently awaiting the introduction of an Ethereum ETF after the approval of a Bitcoin ETF. Meanwhile, because of Pullix’s security, investors are becoming more interested in ERC20 tokens.\n\nWhat Has Happened To Bitcoin (BTC) Since Its ETF Approval?\n\nThe United States Securities Exchange Commission (SEC) recently approved 11 spot Bitcoin ETFs—the news of the approval spiraled across the crypto community.\n\nBefore the approval, analysts predicted a surge in Bitcoin price due to increased inflows from institutional investors. Standard Chartered analysts predicted fund inflows ranging from $50 billion to $100 billion in 2024.\n\nHowever, Bitcoin has yet to rally a few days after the Bitcoin ETF approval. According to CoinMarketCap, Bitcoin price has fluctuated between $41,753.68 and $48,494.62 in the past week.\n\nAt the moment, Bitcoin is facing huge selling pressure around the $48k level. Still, analysts remain bullish on the flagship cryptocurrency. All eyes are now on the Bitcoin halving to spark a bullish run. Analysts predict a surge to $50k and $100k in the long run.\n\nEthereum (ETH) ETF Approval Coming?\n\nSince the US SEC approved spot Bitcoin ETF, the crypto community has been betting on spot Ethereum ETFs. While some analysts believe spot Ethereum ETFs could be next in line, others have a different opinion. An example of such an analyst is JPMorgan’s Nikolaos Panigirtzoglou.\n\nAccording to the analyst, the regulator must classify Ethereum as a commodity before approving spot Ethereum ETFs. On the other hand, Bloomberg ETF expert Eric Balchunas forecasts a 70% possibility that an Ethereum ETF will be approved by May.\n\nSeveral big firms, including Fidelity and BlackRock, have filed for spot Ethereum ETFs. An approval of Ethereum ETF could push the price of Ethereum as high as $4500, per analysts.\n\nPullix (PLX) Native Token Catches Investors’ Interest\n\nPullix (PLX) ERC20 token, PLX, has been the main talk of investors since the beginning of its presale. The token is built on the Ethereum blockchain, meaning more security. Also, its price has increased 100% to $0.08 in less than a month. All these have gained attention among investors.\n\nThe upcoming launch of the Pullix exchange also adds to the increased interest from investors. This DeFi project is prepared to launch in Q1 2024 following its presale. It is a hybrid exchange platform, combining the strengths of both centralized and decentralized exchanges.\n\nUsers of the Pullix platform are able to trade in a range of markets such as stocks, commodities, forex indices and options. Daily turnover in the forex market is more than $6.6 trillion. Given the profit-making nature of PLX, analysts are positive about its growth in 2024. Pullix allows users to generate passive revenue by staking the PLX altcoin.\n\nStaking basically implies locking tokens in a smart contract to strengthen the platform’s liquidity. Based on the quantity and duration of staking, a reward is issued. As the period of investment increases, the profits increase, too. Pullix further presents the Market-Making Liquidity Contribution, which means that any user can act as a market maker and contribute liquidity to this platform.\n\nThe annual return paid to market makers on Pullix is between 8% and 18%. This strategy is likely to increase the number of users using Pullix, which will encourage its use. With its price now standing at $0.08 per token, Pullix is already regarded as one of the best DeFi projects to invest in 2024.\n\nFinal Thoughts\n\nWhile Bitcoin ETF approval has not given the expected price movement, investors are hoping Ethereum will perform differently. Meanwhile, analysts are predicting a 100x rise in Pullix’s altcoin value.\n\nVisit Pullix\n\nJoin The Pullix Communities\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vdS50b2RheS9zaGliYS1pbnUtc2hpYi1yYXBpZGx5LWJyZWFrcy1kb3duLWV0aGVyZXVtLWV0aC1sb3Nlcy10cmFjdGlvbi13aGlsZS1zb2xhbmEtc29sLXByZXNlbnRzLWhpZGRlbtIBc2h0dHBzOi8vdS50b2RheS9zaGliYS1pbnUtc2hpYi1yYXBpZGx5LWJyZWFrcy1kb3duLWV0aGVyZXVtLWV0aC1sb3Nlcy10cmFjdGlvbi13aGlsZS1zb2xhbmEtc29sLXByZXNlbnRzLWhpZGRlbj9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 20 Jan 2024 08:00:00 GMT",
        "title": "Shiba Inu (SHIB) Rapidly Breaks Down, Ethereum (ETH) Loses Traction, While Solana (SOL) Presents Hidden Opportunity - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nShiba Inu has experienced a significant breakdown from its recent consolidation phase. The chart depicts a clear downward trajectory as SHIB failed to maintain its position within the ascending triangle pattern it had formed over the past few months.\n\nThe breakdown was signaled as SHIB prices breached the key support level at $0.000009, which had previously acted as a reliable floor for the price during consolidation phases. Following this, SHIB prices tumbled further, slicing through subsequent support near $0.0000087. This price action marked a decisive shift in market sentiment from accumulation to distribution.\n\nThe next support level to watch is at $0.0000082, where SHIB may find a temporary reprieve from the selling pressure. If this level fails to hold, the next critical support lies at $0.0000076, which could serve as the last line of defense before a more significant drop.\n\nFor a reversal to occur and for SHIB to regain its upward momentum, it would need to reclaim previous support levels and transform them back into supports. This would require a substantial influx of buying pressure, potentially sparked by positive developments within the Shiba Inu ecosystem or broader cryptocurrency market rallies.\n\nThe first sign of a possible reversal would be a return above $0.0000087, followed by a sustained move above the $0.000009 price level. A breakout above these levels, accompanied by increasing volume, could indicate that the downtrend is losing steam and that bulls are regaining control.\n\nSolana paints reversal pattern\n\nSolana has been developing a subtle yet potentially pivotal chart pattern. The asset has been tracing a slow and steady ascending channel, a formation that suggests a controlled and consistent uptrend. This pattern, characterized by higher lows and higher highs contained within two parallel trendlines, speaks to potential for continued growth.\n\nThe significance of this pattern lies in the momentum it could provide for SOL. Should the price action remain strong within the upper half of the channel, and particularly if it challenges the upper trendline, we could see Solana break through and embark on a more aggressive rally.\n\nSuch a bullish scenario would likely be supported by increased trading volume and positive developments within the Solana ecosystem, such as new project launches or updates that enhance network performance.\n\nThe immediate local resistance stands at around $55, and a confident push beyond this could confirm bullish sentiment. Inversely, if Solana's price dips below the channel's lower boundary, around $48, it could indicate that a bearish narrative is taking hold.\n\nEthereum momentum decreasing\n\nEthereum is exhibiting signs of waning momentum, as observed in recent price movements. The asset, which has long been considered the backbone of the decentralized finance sector, is facing a pivotal moment that could determine its trajectory for the coming weeks.\n\nThe provided chart illustrates Ethereum's struggle to maintain its grasp on the market. The price has been on a downward trend, edging closer to the local 26-day Exponential Moving Average. This level, currently near $2,465, is critical; if Ethereum fails to hold this line, we might see it descend to test the more significant 50 EMA, which stands around the $2,300 mark.\n\nThe 26 EMA serves as a short-term sentiment gauge, and its breach could signal a lack of immediate bullish support. Should this level fail to act as a springboard for price recovery, Ethereum's next stop could indeed be the 50 EMA. A breach below this longer-term moving average could potentially open the gates for a test of lower support levels, highlighting the need for investors to brace for more volatility.\n\nMarket participants are now recalibrating their expectations, understanding that the road to sustainable gains is a long-term journey."
    }
]