[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjQvMDEvMzAvZXRoZXJldW1zLWRlbmN1bi11cGdyYWRlLWdvZXMtbGl2ZS1vbi1zZWNvbmQtdGVzdG5ldC13aXRoLWp1c3Qtb25lLXJlbWFpbmluZy_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDI0LzAxLzMwL2V0aGVyZXVtcy1kZW5jdW4tdXBncmFkZS1nb2VzLWxpdmUtb24tc2Vjb25kLXRlc3RuZXQtd2l0aC1qdXN0LW9uZS1yZW1haW5pbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum's 'Dencun' Upgrade Goes Live on Second Testnet, With Just One Remaining - CoinDesk",
        "content": "Proto-danksharding is designed to reduce the cost of transactions for layer-2 blockchains as well as make data availability cheaper, through the introduction of a new compartmentalized space for data known as \"blobs.\" The number of layer-2 chains atop Ethereum is expanding fast, so the upgrade is seen as an essential element of the ecosystem's roadmap for supporting the growth."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY3J5cHRvLm5ld3MvZXRoZXJldW0tZGV2ZWxvcGVycy1kZXBsb3ktZGVuY3VuLXVwZGF0ZS10by1zZXBvbGlhLXRlc3RuZXQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum developers deploy Dencun update to Sepolia testnet - crypto.news",
        "content": "Ethereum developers have successfully deployed the Dencun update to the Sepolia testnet.\n\nThe hard fork includes several tools that are designed to reduce fees on the Ethereum blockchain, while additionally providing new opportunities for bridges and stabilization funds.\n\nThis was not the first attempt to deploy the update to the test network, however, as developers did not provide launch details, but noted that Sepolia has been updated to Dencun.\n\nSepolia has finalized! 🎉\n\nSorry for an uneventful upgrade😄 https://t.co/86HXWRGO7a — terence.eth (@terencechain) January 30, 2024\n\nDencun is also implementing proposal EIP-4844, known as “proto-danksharding.” It is designed to scale the network by creating a new transaction type to store more data. The developers expect that the update will reduce transaction fees in second-level (L2) networks based on roll-up technology.\n\nYou might also like: Speed vs decentralization: could L2 solutions undermine cryptocurrency core ethos?\n\nTo further reduce fees and increase transparency, proposals EIP-1153 and EIP-4788 are provided, which are also included in the upcoming hard fork.\n\nHowever, the previous launch attempt was unsuccessful. On Jan. 17, ETH developers launched the Dencun hard fork on the Goerli testnet. However, the update could not be completed due to the synchronization of validators, with approximately one fifth of operators not having updated software.\n\nInitially, on Dec. 22, 2023 the Ethereum team announced that they were going to update Dencun on the Goerli testnet.\n\nThe update was initially launched on the Goerli test network, then deployed to Sepolia and Holesky within two weeks. If all stages are successful, Dencun will appear on the mainnet in February 2024.\n\nYou might also like: Ethereum’s Dencun upgrade: the next major step in scalability\n\nFollow Us on Google News"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvZXRoZXJldW0tZXRmLXRvLXB1c2gtZXRoLWJ5LTcwLXRvLTQwMDAtc3RhbmRhcmQtY2hhcnRlcmVk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ethereum ETF To Push ETH by 70% to $4000: Standard Chartered - Watcher Guru",
        "content": "In a recent report, the global financial institution Standard Chartered said that a spot Ethereum (ETH) ETF (Exchange Traded Fund) approval could push the asset’s price to $4000. Reaching $4000 from current levels would translate to a growth of around 70%.\n\nAccording to Standard Chartered analyst Geoff Kendrick, ETH will mirror Bitcoin’s (BTC) trajectory. The US SEC’s (Securities and Exchange Commission) recent approval of 11 spot BTC ETFs was a significant milestone for the cryptocurrency industry. Many anticipate a similar ruling for Ethereum (ETH).\n\nAlso Read: Ethereum: SEC May Approve ETH ETF in May, Says Bloomberg\n\nWhen will the SEC approve a spot Ethereum ETF?\n\nAccording to Standard Chartered’s report, the US SEC may approve a spot ETH ETF by May 2024. The report notes that the SEC may initially delay its decision but will eventually green-light the applications.\n\nAccording to Kendrick, ‘pending applications for ETH U.S. spot ETFs to be approved on May 23, the final deadline for the first of the ETFs under consideration — the equivalent date to Jan. 10 for BTC ETFs. If ETH prices perform similarly to BTC prices in the lead-up to BTC ETF approval, ETH could trade as high as $4,000 by then.‘\n\nKendrick noted there is no reason for the SEC to treat Ethereum (ETH) differently than Bitcoin (BTC).\n\nAlso Read: Ethereum: Standard Chartered Predicts ETH May Hit $35,000\n\nMoreover, Standard Chartered has previously expressed its bullish outlook for the second-largest crypto by market cap. In an earlier report, the bank said that ETH could reach a price of $8,000 by 2026. The price rise would translate to a growth of over 242% from current levels. However, Standard Chartered’s predictions don’t stop there. The bank anticipates ETH to hit a price of $35,000 in the long run. Hitting $35,000 would translate to a growth of almost 1400% from current price levels."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMzEvZXRoZXItdGFrZXMtY2VudGVyLXN0YWdlLWFzLWJpdGNvaW4tZmluZHMtZm9vdGluZy1oZWFkaW5nLWludG8tb25lLW9mLXN0cm9uZ2VzdC1tb250aHMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Ether takes center stage as bitcoin heads into one of strongest months - CNBC",
        "content": "Ether is ready to take the limelight in the month ahead after bitcoin and newly launched bitcoin exchange-traded funds dominated crypto investor attention in January. Both bitcoin and ether are on pace to finish the month higher by 0.01%, according to Coin Metrics. January saw sharp price swings driven first by hype before the launch of the first spot bitcoin ETFs in the U.S., and subsequent flows into and out of the funds after they began trading Jan. 11. By now, the outflows have tapered off and bitcoin's outlook for the year is still strong, boosted by the upcoming halving and the potential for rate cuts. As investors came to expect slow, steady flows into bitcoin through newly institutionalized ETFs in coming months, ether and altcoins have been ready for a breakout. \"Short-term flow has been dominated by GBTC [Grayscale Bitcoin] sales. … As that flow is easing, the market has found its footing and the reality of a world where large asset managers promote crypto actively is starting to hit home,\" said Darius Tabatabai, co-founder at decentralized exchange Vertex Protocol. \"ETH and the alts are acting as high beta plays on this trend and our expectation is that both will outperform as more focus starts to direct towards ETH rolling out upgrades to [the Ethereum network] … as well as a potential ETF approval.\" February is a historically strong month for both bitcoin and ether. Bitcoin has finished nine of the last 11 Februarys in the green and has had an average return of 13.12% for the month, according to CoinGlass. Ether has finished the month higher in six of the last seven since its inception, giving it an average February gain of 12.97%. Soon after the U.S. Securities and Exchange Commission approved spot bitcoin ETFs for trading, investors took profits and rotated into ether, pushing it to a 20-month high as they looked ahead to what might come next. The SEC is due to give decisions on spot ETH ETF applications beginning in May. BlackRock, Invesco, Ark and VanEck are among the firms in line for approval, as well as Grayscale, which is seeking to convert its existing Ethereum Trust (ETHE) into an ETF. Standard Chartered said in a note this week that ahead of the May decision, it expects ether to track or outperform bitcoin's pre-ETF uptrend in the comparable period. If it does, it could reach $4,000 by then, the bank added, which would equal a roughly 70% increase from current levels. \"Bitcoin remains the more popular macro asset with cross-over appeal to traditional finance, and Solana is gaining popularity as a faster and cheaper alternative to Ethereum,\" said Jeff Dorman, chief investment officer at crypto asset manager Arca. \"Nonetheless, Ethereum is not going away anytime soon, and it could even compete with Bitcoin if an ETF is approved, or if bitcoin investors realize they want exposure to areas of blockchain's growth that Bitcoin doesn't offer, such as stablecoins, NFTs, [decentralized finance], gaming [and] AI.\" Ethereum is continually improving and upgrading , Dorman added, which will help the network grow in line with cheaper and faster alternatives such as Solana. Its next big update, called \"Dencun,\" is expected to take place in February and is meant to make transactions on so-called Layer 2 solutions — networks that sit on top of a base network like Ethereum and exist to provide extra capacity and functionality to the network — less expensive. Ether is also poised to benefit from the popularity of altcoins , many of which run on top of the Ethereum blockchain, according to Jason Urban, the global head of trading at Galaxy Digital. \"We've seen an uptick in alt interest. … ETH is probably more poised to benefit from that\" than bitcoin, he said. \"There are going to be people that will manifest that play, especially more [traditional finance] people that might not have access or the ability to trade a bag of alts. You'll see that manifest in ETH.\" For January, ETH is heading to a less than 1% gain, while other alts are a mixed bag. Since Jan. 23, however, when bitcoin fell below $40,000 for the first time this year, they've rallied, while ETH has been stagnant. ETH is weaker during that period, while SOL has gained 14%, Polygon's MATIC rose 4% and the tokens tied to Chainlink and Cardano advanced 4% and 3%, respectively. \"If you believe in a bullish market trend like in 2020 and 2021, then it makes sense to invest in the 'fastest horse,' which are the smaller and cheaper blockchains and applications,\" Dorman said. — CNBC's Michael Bloom contributed reporting."
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9mb3JnZXQteHJwLWNyeXB0b2N1cnJlbmN5LXBvaXNlZC1pbmNyZWRpYmxlLTEzMTkwMDM4My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 31 Jan 2024 08:00:00 GMT",
        "title": "Forget XRP, This Cryptocurrency Is Poised for an Incredible Run - Yahoo Finance",
        "content": "Just a few years ago, XRP (CRYPTO: XRP) was a crypto market darling. Investors thought it was going to skyrocket in value, and it became one of the top cryptocurrencies by overall market cap. Today, however, XRP is trading for under $1 and is still mired in an ongoing lawsuit with the Securities and Exchange Commission (SEC).\n\nSo maybe it's time to forget about XRP and find a new cryptocurrency capable of soaring in value. That cryptocurrency could be Solana (CRYPTO: SOL). After an epic rally at year-end, it passed XRP's market cap in December and is now poised for an incredible run.\n\nIs Solana the next Ethereum?\n\nThe case for investing in Solana can be distilled down to a single thesis: Solana is the next Ethereum (CRYPTO: ETH). When Solana publicly launched as a smart contract blockchain platform in March 2020, it was immediately touted as a potential \"Ethereum killer\" due to its super-fast speeds and super-low transaction costs. That made Solana valuable for a wide range of uses, from blockchain gaming to decentralized finance (DeFi). In fact, at one time, people referred to Solana as a \"decentralized Nasdaq.\"\n\nNow, four years later, Solana is starting to fulfill some of its early promise. While Solana is still a long way from surpassing Ethereum, it is making inroads quickly. And institutional investors are starting to take notice. In November, Cathie Wood of Ark Invest appeared on CNBC, making the case for Solana as a faster, more cost-efficient version of Ethereum. If Solana keeps up its momentum, it could eventually topple Ethereum as the premier smart contract blockchain platform, and that would provide a huge boost to its overall valuation.\n\nHow high can Solana go?\n\nThe big question, of course, is how high Solana might eventually go. Back in October, investment firm VanEck modeled a number of scenarios for Solana's future growth. In a base-case scenario, VanEck saw Solana reaching a target price of $335 by the year 2030. At the time, Solana was trading around $30, so that price implied a 10x gain. But the bull-case scenario called for Solana to reach a target price of $3,211. At the time, that price implied a more than 10,000% gain.\n\nStory continues\n\nSo exactly how realistic is this super-bullish price forecast? According to VanEck, it will require Solana to continue to chip away at Ethereum's dominant market share in several key categories, including both decentralized finance and blockchain gaming.\n\nOh, and it also was premised on the idea that Solana would eventually find a \"killer app\" capable of onboarding 100 million users. To put that number into perspective, ChatGPT onboarded 100 million users in two months. The AI system doesn't rely on blockchain networks, but it's a useful reference in terms of sheer scale of Solana's most bullish price projections.\n\nThe 100 million user problem\n\nSo where is Solana going to find that mythical \"killer app\" capable of onboarding 100 million users? My assumption is that it may come from Solana's new mobile crypto strategy, which includes physical hardware products (i.e., a new phone called the Saga) as well as software tools (i.e., the Solana Mobile Stack) that mobile developers can use to create blockchain apps.\n\nThe big picture basically comes down to this: Entice developers to create new apps, put those apps in an app store, and then get consumers to download those apps to their phones. At some point, one of those apps is going to hit it big, right?\n\nImage source: Getty Images.\n\nAdmittedly, solving the 100 million user problem will not be easy. \"Killer apps\" like ChatGPT come along rarely. As a result, I'd be careful about using the top-end $3,211 price target for Solana. But even if you use the more conservative base price target of $335, that would still imply a more than 3x return from Solana's current price of $100 per token.\n\nSolana's trajectory in 2024\n\nWhile I'm long-term bullish on Solana, it is concerning that Solana has had so much difficulty gaining traction this year. After a remarkable 2023 when it soared by nearly 900%, Solana is down approximately 5% to start this year. To some extent, I'm chalking it up to the Bitcoin exchange-traded fund (ETF) hype. In all the enthusiasm around Bitcoin, investors seem to have lost interest in every other cryptocurrency.\n\nBut I'm expecting things to turn around soon for Solana. Unlike XRP, it doesn't have an SEC case hanging over its head. And, unlike XRP, it is gaining traction with institutional investors as a potential Ethereum challenger. If you're looking for a crypto poised for an incredible run, you should consider Solana.\n\nShould you invest $1,000 in Solana right now?\n\nBefore you buy stock in Solana, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Solana wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of January 22, 2024\n\nDominic Basulto has positions in Bitcoin and Ethereum. The Motley Fool has positions in and recommends Bitcoin, Ethereum, Solana, and XRP. The Motley Fool has a disclosure policy.\n\nForget XRP, This Cryptocurrency Is Poised for an Incredible Run was originally published by The Motley Fool"
    }
]