[
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3Lm1hcmtldHdhdGNoLmNvbS9kYXRhLW5ld3MvbGFyZ2UtY3J5cHRvY3VycmVuY2llcy1taXhlZC1hcy1ldGhlcmV1bS1yaXNlcy04M2I1NjQ3ZC1iY2QxYTMyYzM5OGHSAW5odHRwczovL3d3dy5tYXJrZXR3YXRjaC5jb20vYW1wL2RhdGEtbmV3cy9sYXJnZS1jcnlwdG9jdXJyZW5jaWVzLW1peGVkLWFzLWV0aGVyZXVtLXJpc2VzLTgzYjU2NDdkLWJjZDFhMzJjMzk4YQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Large cryptocurrencies mixed as Ethereum rises - MarketWatch",
        "content": "Large cryptocurrencies were mixed during morning trading on Thursday, with Solana SOLUSD, -0.21% seeing the biggest move, shedding 2.88% to $99.10.\n\nEthereum ETHUSD, +0.24% lead the increases with a 0.29% climb to $2,531.35."
    },
    {
        "id": 94,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yNC8wMS8zNjY3ODc3Mi9iaXRjb2luLWV0aGVyZXVtLWZhbGwtZm9sbG93aW5nLWpvYmxlc3MtY2xhaW1zLWRhdGEtdGhvcmNoYWluLWJlY29tZXMtdG9wLWxvc2Vy0gEtaHR0cHM6Ly93d3cuYmVuemluZ2EuY29tL2FtcC9jb250ZW50LzM2Njc4Nzcy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin, Ethereum Fall Following Jobless Claims Data; THORChain Becomes Top Loser - Benzinga",
        "content": "Bitcoin BTC/USD moved lower, but the cryptocurrency prices remained above the key $42,000 level on Thursday.\n\nEthereum ETH/USD also recorded losses, but traded above the key $2,500 mark this morning.\n\nSiacoin SC/USD was the top gainer over the prior 24 hours, while THORChain RUNE/USD turned out to be the biggest loser.\n\nU.S. initial jobless claims fell by 16,000 to 187,000 in the week ending January 18, compared to market estimates of 207,000.\n\nAt the time of writing, the global crypto market cap fell to $1.67 trillion, recording a 24-hour fall of 0.8%. BTC was trading lower by 0.6% at $$42,413 while ETH fell by around 1.3% to $2,512 on Thursday.\n\nHere are the top ten crypto gainers and losers over the past 24 hours:\n\nGainers\n\nSiacoin SC/USD\n\nPrice: $0.01178\n\n24-hour gain: 9.2%\n\nManta Network MANTA/USD\n\nPrice: $2.46\n\n24-hour gain: 8.6%\n\nFlare FLR/USD\n\nPrice: $0.02291\n\n24-hour gain: 8.4%\n\nBlur BLUR/USD\n\nPrice: $0.7071\n\n24-hour gain: 6.7%\n\ndYdX (ethDYDX) ETHDYDX/USD\n\nPrice: $3.08\n\n24-hour gain: 4.4%\n\nLosers\n\nTHORChain RUNE/USD\n\nPrice: $4.11\n\n24-hour drop: 12.3%\n\nBeam BEAM/USD\n\nPrice: $0.02001\n\n24-hour drop: 11.3%\n\nBonk BONK/USD\n\nPrice: $0.00001271\n\n24-hour drop: 8.4%\n\nWOO WOO/USD\n\nPrice: $0.4284\n\n24-hour drop: 8.4%\n\nInjective INJ/USD\n\nPrice: $38.06\n\n24-hour drop: 7.5%\n\nRead This Next: Beat Inflation With These 3 High-Yielding Dividend Stocks In Materials Sector From Wall Street's Most Accurate Analysts"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zcG90LWJpdGNvaW4tdnMtZXRoZXJldW0tZXRmcy0xNDAwMDA3MzAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Spot Bitcoin vs Ethereum ETFs: The Race Is On - Yahoo Finance",
        "content": "ETF Investing Tools\n\nThe bitcoin versus Ethereum ETF race is on for 2024.\n\nA 24% performance differential divides the popular crypto investments, as futures-based Ethereum ETFs are up nearly 15% and the new spot bitcoin ETFs are down 9% in their first three days of trading through Jan. 16.\n\nOver that brief period, $1.2 billion has flowed from the Grayscale Bitcoin Trust (GBTC), while $740 million has flowed into new spot ETFs like the iShares Bitcoin Trust (IBIT), meaning that almost $2billion has gone into the non-GBTC spot bitcoin ETFs this year. The heavy flows and trading volume partially explain the negative performance for spot bitcoin ETFs thus far.\n\nInvestors Eye SEC Approval of a Spot Ethereum ETF\n\nMeanwhile, Ethereum appears to be gaining a similar kind of investor enthusiasm as Bitcoin did in 2023, as multiple issuers, including the ETF behemoth BlackRock, Inc., have filed for a spot Ethereum ETF. The timetable for the Securities and Exchange Commission to approve a spot Ethereum ETF takes us to May 2024, which could lead to the bidding up of Ethereum prices in the coming months.\n\nAlthough the 2024 spot bitcoin versus Ethereum ETF race has only just begun, the story is setting up as the more established cryptocurrency versus the rising outsider.\n\nGBTC Outflows Impact Spot Bitcoin ETF Pricing\n\nDigging a bit deeper into spot bitcoin’s poor start, $1.2 billion flowing out of GBTC pumped significant liquidity into the bitcoin ecosystem. The higher supply offset the early demand; thus, the price did not leap higher as many expected. The SEC announcement also appeared to become a “sell the news” event.\n\nBTC’s price rose more than 21% from late November through Jan. 8, peaking near $47,000 according to crypto data aggregator CoinGecko data, as signs suggested increasingly that the SEC would approve at least a few of the filings (the agency approved all 11 applications). A primary reason for GBTC’s huge outflows is likely its expense ratio of 1.50%, which is more than 100 basis points higher than any of the other 10 spot bitcoin ETFs on the market. Another reason is that GBTC had previously been a closed-end bitcoin trust with $29 billion in assets, and the SEC allowed it to convert to a spot bitcoin ETF last week as the new spot ETFs launched.\n\nStory continues\n\nGBTC’s conversion enabled investors to sell shares. They had likely been waiting to exit the closed-end fund once they were longer locked in. Many investors bought GBTC at a discount in 2023, which was as low as 50%. and sold at par to capture gains after the conversion.\n\nClosed-end funds can be less liquid than ETFs, which are open-ended funds. The limited number of shares outstanding can result in wider bid-ask spreads and reduced liquidity for CEFs. If there aren't enough buyers, a closed-end fund can trade at a discount.\n\nWhat’s Next for the Spot Bitcoin vs Ethereum ETF Race?\n\nInvestors will likely be eyeing the bitcoin halving in April. The halving will cut the reward for bitcoin miners from the current 6.25 to 3.125 bitcoin, reducing the number of tokens entering the system. Observers of the digital asset space widely expect the event to boost BTC’s price and bring more assets into spot bitcoin funds.\n\nBitcoin miners are lynchpins of the blockchain, helping to ensure its integrity. A month later, the SEC will decide on multiple applications for Ethereum ETFs, which could increase the price of ether, the token of the Ethereum network.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zcG90LWJpdGNvaW4tdnMtZXRoZXJldW0tZXRmcy0xNDAwMDA3MzAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Spot Bitcoin vs Ethereum ETFs: The Race Is On - Yahoo Finance",
        "content": "ETF Investing Tools\n\nThe bitcoin versus Ethereum ETF race is on for 2024.\n\nA 24% performance differential divides the popular crypto investments, as futures-based Ethereum ETFs are up nearly 15% and the new spot bitcoin ETFs are down 9% in their first three days of trading through Jan. 16.\n\nOver that brief period, $1.2 billion has flowed from the Grayscale Bitcoin Trust (GBTC), while $740 million has flowed into new spot ETFs like the iShares Bitcoin Trust (IBIT), meaning that almost $2billion has gone into the non-GBTC spot bitcoin ETFs this year. The heavy flows and trading volume partially explain the negative performance for spot bitcoin ETFs thus far.\n\nInvestors Eye SEC Approval of a Spot Ethereum ETF\n\nMeanwhile, Ethereum appears to be gaining a similar kind of investor enthusiasm as Bitcoin did in 2023, as multiple issuers, including the ETF behemoth BlackRock, Inc., have filed for a spot Ethereum ETF. The timetable for the Securities and Exchange Commission to approve a spot Ethereum ETF takes us to May 2024, which could lead to the bidding up of Ethereum prices in the coming months.\n\nAlthough the 2024 spot bitcoin versus Ethereum ETF race has only just begun, the story is setting up as the more established cryptocurrency versus the rising outsider.\n\nGBTC Outflows Impact Spot Bitcoin ETF Pricing\n\nDigging a bit deeper into spot bitcoin’s poor start, $1.2 billion flowing out of GBTC pumped significant liquidity into the bitcoin ecosystem. The higher supply offset the early demand; thus, the price did not leap higher as many expected. The SEC announcement also appeared to become a “sell the news” event.\n\nBTC’s price rose more than 21% from late November through Jan. 8, peaking near $47,000 according to crypto data aggregator CoinGecko data, as signs suggested increasingly that the SEC would approve at least a few of the filings (the agency approved all 11 applications). A primary reason for GBTC’s huge outflows is likely its expense ratio of 1.50%, which is more than 100 basis points higher than any of the other 10 spot bitcoin ETFs on the market. Another reason is that GBTC had previously been a closed-end bitcoin trust with $29 billion in assets, and the SEC allowed it to convert to a spot bitcoin ETF last week as the new spot ETFs launched.\n\nStory continues\n\nGBTC’s conversion enabled investors to sell shares. They had likely been waiting to exit the closed-end fund once they were longer locked in. Many investors bought GBTC at a discount in 2023, which was as low as 50%. and sold at par to capture gains after the conversion.\n\nClosed-end funds can be less liquid than ETFs, which are open-ended funds. The limited number of shares outstanding can result in wider bid-ask spreads and reduced liquidity for CEFs. If there aren't enough buyers, a closed-end fund can trade at a discount.\n\nWhat’s Next for the Spot Bitcoin vs Ethereum ETF Race?\n\nInvestors will likely be eyeing the bitcoin halving in April. The halving will cut the reward for bitcoin miners from the current 6.25 to 3.125 bitcoin, reducing the number of tokens entering the system. Observers of the digital asset space widely expect the event to boost BTC’s price and bring more assets into spot bitcoin funds.\n\nBitcoin miners are lynchpins of the blockchain, helping to ensure its integrity. A month later, the SEC will decide on multiple applications for Ethereum ETFs, which could increase the price of ether, the token of the Ethereum network.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ldGhlci1jb3VsZC1zb2FyLTIwMjQtYmFjay0wNzE5MzI1NzguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Ether Could Soar in 2024 on the Back of Dencun Upgrade, ETF Narrative: Analysts - Yahoo Finance",
        "content": "Investors are likely to have a relook at ether as the spot ETF narrative gathers steam and Ethereum remains the dominant chain in the DeFi and NFT world, according to analysts.\n\nEther is qualified to be a core holding in a diversified crypto portfolio, one observer said.\n\nEther [ETH], the native token of Ethereum’s blockchain, underperformed bitcoin [BTC] in 2023, as the latter’s new-found smart contract, non-fungible tokens (NFT) narrative, and spot ETF optimism drew investor money.\n\nPer analysts, investors will likely have a relook at ether this year as Ethereum is still the world’s leading smart contract blockchain with key upgrades lined up, and ether is widely seen as the next likely candidate to get a spot-based ETF in the U.S.\n\n“ETH could be poised for a breakout year,” Nasdaq-listed crypto exchange Coinbase said in the weekly newsletter. “Last week’s bitcoin ETF news proved to be a boon for ethereum, which briefly spiked above $2,700 — reaching its highest price since May 2022. And there are reasons to be even more optimistic about ETH’s near-term future. For one, several of the firms behind the BTC ETFs — including BlackRock and VanEck — are also plotting ether-based spot ETFs.”\n\nA spot ETF invests in actual cryptocurrency, allowing investors to take exposure to the asset without having to own it, and is considered a better option than futures-based ETFs, which are vulnerable to roll costs. So, just as spot BTC ETFs, a potential launch of spot ETH ETFs is expected to open floodgates to institutional and retail money.\n\nNearly a dozen bitcoin spot ETFs began trading in the U.S. last Thursday and have registered a cumulative volume of over $10 billion, with BlackRock’s product amassing $1 billion in inflows.\n\nDencun upgrade and institutional demand\n\nIn addition, Ethereum’s upcoming Dencun upgrade, which aims to improve the mainnet’s scalability by introducing “data blobs,” could galvanize investor interest in the cryptocurrency, according to Coinbase. The upgrade went live on Ethereum’s Goerli testnet early this week.\n\nStory continues\n\nA blob is a temporary transaction data memory typically related to Layer 2 solutions that can be attached to Ethereum. Following the upgrade to the mainnet, the network will only need to confirm the correctness of the blob data attached to the block rather than verify each transaction, helping reduce congestion and network fees.\n\n“Ethereum’s Dencun upgrade began initial tests on Wednesday and in coming months is expected to implement EIP-4844 (“EIP” stands for “Ethereum improvement proposal”), which some ETH watchers predict could help reduce network fees by 90% or more,” Coinbase noted.\n\nInstitutional crypto firm ETC Group, in its annual report, discussed a bullish outlook for the ether-bitcoin ratio and explained that despite 2023's inscriptions-led boom in Bitcoin's network activity, Ethereum remains the dominant chain for building decentralized applications, NFTs, and tokenized assets.\n\nFor instance, data tracked by ETC Group show, the top 10 ERC-20 tokens have a cumulative market value of $21 billion – or 13 times bigger than the $1.6 billion market capitalization of the entire BRC-20 token universe of over 37,000 coins. ERC-20 is Ethereum’s token standard, while BRC-20 is a fungible digital asset created on the Bitcoin network.\n\nFurther, ether investors can generate extra returns on top of their holdings by staking or locking their coins in the network in return for rewards. The current annualized reward rate is around 3.84%, having averaged about 4% to 5% since Ethereum completed the Merge in September 2022.\n\nLastly, Ethereum's feature of burning a portion of transaction fees paid in ETH has a deflationary effect on the token's supply, positively affecting investors.\n\n\"The strong dominance of Ethereum in terms of smart contract platforms and the possibility to earn an additional source of yield imply that it should also be a core holding in a diversified cryptoasset portfolio as well,\" ETC Group said. \"We therefore think that it is quite likely for the relative performance of ETH/BTC to reverse itself in 2024. In fact, ETH/BTC’s 12-month relative performance has historically shown a strong tendency to mean revert,\" ETC Group added.\n\nEther has outperformed bitcoin so far this year, with the ether-bitcoin ratio (ETH/BTC) trading 10% higher. The ratio tanked over 25% last year.\n\n\n\n"
    }
]