[
    {
        "title": "Ethereum Layer-2 Projects Polygon, Immutable Lay Off Staff - Blockworks",
        "summary": "  Ethereum Layer-2 projects Polygon and Immutable have laid off staff, with Polygon letting go of 20% of its workers and Immutable cutting 11%. Both companies cited a need to redirect resources and focus on crypto and Web3 components. Polygon's native token MATIC saw a 6.5% drop following the announcement, while Immutable disputed reports of low cash reserves as the reason for the cuts. Other crypto companies, such as Genesis, Crypto.com, Blockchain.com, and ConsenSys, have also reduced their workforces in recent months."
    },
    {
        "title": "Ethereum Shapella upgrade gets new date, making way for un-staking ETH - Cointelegraph",
        "summary": "  Ethereum's Shapella upgrade has been rescheduled for February 28, making way for un-staking ETH. The upgrade includes changes to the execution and consensus layers, such as warm coinbase, Beacon Chain push withdrawals, and partial withdrawals for validators. The upgrade also brings new features and improvements to the network, including the ability for validators to withdraw their staked Ether (stETH) from the Beacon Chain to the execution layer. Stakers and non-stakers must upgrade their nodes to the latest Ethereum client versions to take advantage of the upgrade."
    },
    {
        "title": "550,000% ROI: How Alexis Ohanian Turned $15K into $82 Million With Ethereum - CryptoPotato",
        "summary": "  Alexis Ohanian, co-founder of Reddit, invested $15,000 in Ethereum during its presale in 2014 and now has a stash worth nearly $82 million, a 546,000% return. He is a proponent of decentralized currencies due to his ancestors' experiences of persecution and the seizure of their heirlooms. Ohanian has also invested in other crypto start-ups through his venture capital firm and purchased an NFT from the Bored Ape Yacht Club collection."
    },
    {
        "title": "Crypto miner Hive Blockchain posts wider losses, cites Ethereum Merge - Forkast News",
        "summary": "  Hive Blockchain, a Vancouver-based crypto mining firm, reported wider losses in Q4 due to Ethereum's Merge and lower Bitcoin prices. Net loss was US$90 million, compared to US$51.2 million in the same period last year. This is the first quarter Hive didn't mine Ether since the Merge upgrade. The company sold excess energy to the grid, repurposed GPUs for Bitcoin mining, and upgraded ASICs to improve efficiency. Shares closed down 9.5% on Nasdaq at US$3.05, a 67% drop from US$9.35 a year ago."
    },
    {
        "title": "Layer 2 Network Arbitrum Surpasses Ethereum in Daily Transactions - CoinDesk",
        "summary": "  Arbitrum, a layer 2 network, has surpassed Ethereum in daily transactions, with a 590% increase in less than two months. From 159,919 daily transactions on Jan. 1 to over 1,103,398 at the time of press."
    },
    {
        "title": "Ethereum Shanghai/Capella Upgrade Gets a Final Date From Developers - Watcher Guru",
        "summary": "  Sure, here is a summary of the financial news in less than 256 tokens:\n\nEthereum is set to upgrade on February 28, 2023, with the Shanghai/Capella upgrade scheduled to go live on the Sepolia network. The upgrade will allow validators to withdraw their stake from the Beacon Chain back to the execution layer and introduce new functionality to both the execution and consensus layer. The upgrade follows The Merge and is highly anticipated, with the Shanghai hard fork expected to allow users to withdraw staked ETH. The exact date of the upgrade is February 28, 2023, at 4:04:48 AM UTC."
    },
    {
        "title": "Uniswap Traders Can Now Buy NFTs With UNI, SHIB or Any Ethereum Token - Yahoo Finance",
        "summary": "  Uniswap, a decentralized exchange, has launched a new feature that allows traders to buy NFTs with any Ethereum-based token, including stablecoins and meme coins. This simplifies the NFT purchasing process for traders who need to swap one cryptocurrency for another before buying an NFT. Uniswap plans to support combined sums of multiple cryptocurrencies for a single NFT sale soon. The feature could help Uniswap attract more users to its NFT platform, but it faces competition from established marketplaces like Blur and OpenSea."
    },
    {
        "title": "Arbitrum Layer-2 Processes More Transactions Than Ethereum for the First Time - DailyCoin",
        "summary": "  Arbitrum, a Layer-2 scaling solution for Ethereum, processed over one million transactions on Tuesday, surpassing Ethereum mainnet for the first time. This achievement marks a significant milestone for the project and the broader Ethereum ecosystem, as Arbitrum continues to grow in popularity and adoption. With a record of 120,535 active addresses and over $2.83 billion in seven-day volume, Arbitrum is quickly becoming the second-largest blockchain in terms of seven-day volume. The project's success can be attributed to its optimistic rollup technology, which utilizes fraud proofs to increase transaction capacity and reduce fees. As the leading Ethereum Layer-2 scaling project, Arbitrum is poised to play a crucial role in the future of Ethereum and the broader blockchain ecosystem."
    },
    {
        "title": "Uniswap Traders Can Now Buy NFTs With UNI, SHIB or Any Ethereum Token - Decrypt",
        "summary": "  Uniswap, a popular decentralized exchange, has launched a new feature that allows traders to buy NFTs using any Ethereum-based token, including stablecoins and meme coins. This simplifies the NFT purchasing process and makes it easier for traders to swap one cryptocurrency for another before making a purchase. The feature also allows for combined sums of multiple cryptocurrencies to be used for a single NFT sale. While Uniswap's NFT platform is still small compared to rivals like Blur and OpenSea, the exchange remains committed to developing products that are \"built to last.\""
    },
    {
        "title": "Ethereum (ETH) Developers Confirm Shapella Upgrade Date: Details - U.Today",
        "summary": "  Ethereum (ETH) developers have confirmed the Shapella upgrade date on the Sepolia testnet. The upgrade will activate on February 28th at 4:04:48 AM UTC, following the Merge and enabling validators to withdraw their stake from the Beacon Chain back to the execution layer. The Shapella upgrade combines changes to the execution layer, consensus layer, and engine API. The Zhejiang testnet can be used to test Shapella functionality before the Sepolia upgrade. Ethereum price is down 1.66% at $1,647, with potential targets at $1,800 and $2,000."
    },
    {
        "title": "Reddit co-founder bought 50,000 Ether during presale for $15K - Cointelegraph",
        "summary": "  Reddit co-founder Alexis Ohanian invested $15,000 in Ethereum during its presale in 2014, buying 50,000 Ether (ETH) for just 30 cents per coin. At current prices, this investment is worth $82.5 million, representing a 549,589% increase. Ohanian's interest in Ethereum was fueled by his Armenian heritage and aversion to seizable property. He believes that crypto is a store of value that is not controlled by any single state, and he has invested in 29 crypto-related startups through his venture capital firm 776. Despite the volatility of the crypto market, Ohanian sees the current downturn as an opportunity to make long-term bets on the industry."
    },
    {
        "title": "LayerZero faces backlash over monetising 'no value' Ethereum sandbox tokens - DLNews",
        "summary": "  LayerZero, a protocol connecting blockchains, faced backlash from Ethereum developers over its new Goerli ETH market, which allows for the monetization of valueless Ethereum sandbox tokens. The market was launched to address a scarcity of tokens in the Goerli testnet, which has hindered Ethereum development. However, many developers are opposed to the idea of placing a monetary value on something that should be free, citing concerns that it may discourage new developers from building on Ethereum. Some have argued that the move could create a barrier to entry for new devs, while others have highlighted previous difficulties in obtaining sufficient Goerli ETH tokens for testing. The Goerli ETH token traded at $0.10 at the market's launch but has since fluctuated in value."
    },
    {
        "title": "Ethereum [ETH]: Whales swim away as selling pressure rises - AMBCrypto News",
        "summary": "  Ethereum whales are selling their ETH as the MVRV ratio reaches a one-month high, potentially due to high profitability for holders. However, retail investors and validators continue to support ETH, with increased activity on the network and high revenue generation for validators. Despite whales moving away, retail and staker interest remains strong."
    },
    {
        "title": "Coinbase will add Support for Euro Coin on the Ethereum Network - Crypto Times",
        "summary": "  Coinbase will list Euro Coin (EUROC), a euro-backed stablecoin, on the Ethereum network as an ERC-20 token. Inbound transfers are available on Coinbase and Coinbase Exchange in supported regions, but users are warned not to send EUROC to other networks as it could result in a loss of funds. Trading will begin on February 22nd in stages, with EUROC-USD and EUROC-EUR pairs available."
    },
    {
        "title": "War of Words Over zkEVMs Might Portend Long Struggle to Tech Maturity - CoinDesk",
        "summary": "  In the race to achieve tech maturity in the blockchain space, a \"war of words\" is brewing over the use of zero-knowledge (zk) proofs and other advanced technologies. While proponents argue that these innovations hold great promise, others are sounding the alarm over potential bugs and security risks. One key issue is the ability to upgrade code, with some keystone crypto protocols opting to be non-upgradable due to the potential for introducing new bugs or being exploited by malicious actors. The ongoing struggle to balance innovation with security may indicate a long and challenging road to maturity for the blockchain industry."
    },
    {
        "title": "Ethereum Name Service: What does it mean; Pros and Cons? - CoinGape",
        "summary": "  Ethereum Name Service (ENS) is an open naming system that translates machine-readable identifiers in blockchain and cryptocurrency into human-readable names. It provides users with a human-readable address and control over all subdomains after registering a domain. The advantages of ENS include easier accessibility, as users can give a human-readable address instead of a public address, and control over subdomains. However, there are also disadvantages, such as a yearly ETH fee and limited use of the token. ENS is not required to purchase and register domain names, which lowers the entry barrier. The ENS architecture is similar to DNS, but with significant architectural differences to incorporate Ethereum's capabilities and constraints. The ENS Manager app or other ENS-powered applications are good starting points for users who want to learn more about ENS functionalities."
    },
    {
        "title": "Crypto Price Today: Bitcoin, Ethereum fall over 3%, other tokens move lower - CNBCTV18",
        "summary": "  Sure, here's a summary of the financial news in less than 256 tokens:\n\nCrypto prices today: Bitcoin, Ethereum, Dogecoin, Shiba Inu, and Solana fell between 3-6%. Bitcoin dropped to $24,182.9, Ethereum to $1,643, and Dogecoin to $0.007. Market capitalization and trade volume also decreased."
    },
    {
        "title": "Cryptocurrency price in India 22 February 2023: Bitcoin & Ethereum fall, market remains in the red - India Today",
        "summary": "  Here is a summary of the financial news in less than 256 tokens:\n\nCryptocurrency prices in India on February 22nd:\n\n* Bitcoin down 2.89% to $24,209.54\n* Ethereum down 3.18% to $1,649.69\n* XRP down 1.30% to $0.24\n* Solana down 6.59% to $45.72\n* Cosmos down 3.69% to $10.43\n* Chainlink down 5.41% to $21.27\n* Litecoin down 1.17% to $58.95\n* Polkadot down 3.81% to $30.77\n\nGlobal crypto market cap down 2.74% to $1.10 trillion\n\nGainers and losers:\n\n* Top gainers: Ankr, Filecoin, 1inch Network, and UNUS SED LEO\n* Top losers"
    },
    {
        "title": "Arbitrum Transactions Soar by Over 590 Percent, Overtake Ethereum in Daily Transactions - Gadgets 360",
        "summary": "  Arbitrum, a layer-2 scaling solution built on Ethereum, has seen a significant surge in daily transactions, with a 590% increase between January 1 and February 20. This has caused Arbitrum to overtake Ethereum in daily transactions, with 1,103,398 transactions recorded on February 21, compared to Ethereum's 1,084,290. However, Ethereum still generates more network fees, with around $6.7 million per day, compared to Arbitrum's $154,000. The growth in Arbitrum is attributed to positive market speculations and the potential for an airdrop."
    },
    {
        "title": "The Top Five Hottest Crypto Currencies To Invest In Right Now: What Bitcoin, Ethereum, Binance Coin, Dogetti And ... - Outlook India",
        "summary": "  Here is a summary of the article in less than 256 tokens:\n\nTop 5 hottest crypto investments: Bitcoin, Ethereum, Binance Coin, Dogetti, and Polkadot.\n\nBinance Coin (BNB) stands out due to its potential for growth and development.\n\nBNB is the main currency of a popular cryptocurrency exchange and launches new projects.\n\nInvestors and developers love the coin and platform.\n\nBNB price increased by 313,558% by the end of January 2023."
    }
]