[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xNDM5NDYvcm9iaW5ob29kLW1vdmVzLWN1dC1zdXBwb3J0LWNhcmRhbm8tcG9seWdvbi1zb2xhbmHSAVJodHRwczovL2RlY3J5cHQuY28vMTQzOTQ2L3JvYmluaG9vZC1tb3Zlcy1jdXQtc3VwcG9ydC1jYXJkYW5vLXBvbHlnb24tc29sYW5hP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Robinhood Moves to Cut Support for Cardano, Polygon and Solana - Decrypt",
        "content": "We do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe popular trading app Robinhood is ending support for three cryptocurrencies in Cardano (ADA), Polygon (MATIC), and Solana (SOL) from June 27, 2023.\n\n\"We regularly review the crypto we offer on Robinhood,\" the firm shared in an update. \"Based on our latest review, we’ve decided to end support for Cardano (ADA), Polygon (MATIC), and Solana (SOL) on June 27th, 2023 at 6:59 PM ET.\"\n\nUsers have to withdraw or sell these assets for fiat or other eligible assets on Robinhood by the deadline.\n\nPost that, these assets will be sold at market prices with the sale proceeds going toward the users.\n\nAD\n\nAD\n\nPer data from CoinGecko, the price of all three assets has been mixed with ADA falling 2.7%, MATIC dropping 0.4%, and SOL rising 1.1% in the past 24 hours.\n\nThe decision comes days after the U.S. Securities and Exchange Commission sued Binance and Coinbase for a variety of allegations, with securities law violations being common between the two charges brought by the regulator.\n\nBoth the lawsuits alleged that ADA, MATIC, and SOL were unregistered securities.\n\n\"This introduced a cloud of uncertainty around these assets and, as a result, our team has decided to end support for them,\" a Robinhood spokesperson shared with Decrypt. A similar message was issued to some of Robinhood's user base this morning.\n\nAD\n\nAD\n\nDan Gallagher, Robinhood’s regulatory compliance head also testified before the House Agriculture Committee on Tuesday claiming that the firm was “actively reviewing” its crypto offerings.\n\nThe trading app added support for Solana and Polygon in April 2022 with Cardano’s listing coming in September 2022.\n\nRobinhood will support three fewer crypto tokens from its initial list of 18 which includes Bitcoin (BTC), Ethereum (ETH), meme coins Dogecoin (DOGE) and Shiba Inu (SHIB), layer-1 tokens like Avalanche (AVAX) and Tezos (XTZ), and DeFi tokens like Aave (AAVE), Compound (COMP), and Uniswap (UNI)."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wNi8zMjc5NTM3MS9jYXJkYW5vLWFuZC1zb2xhbmEtY291bnRlcmF0dGFjay1hZ2FpbnN0LXNlY3MtY2xhc3NpZmljYXRpb24tb2YtY3J5cHRvY3VycmVuY2llcy1hcy1zZWN1cmnSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzI3OTUzNzE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Cardano And Solana Counterattack Against SEC's Classification Of Cryptocurrencies As Securities - Benzinga",
        "content": "IOG, the company behind the development of Cardano ADA/USD, and the Solana Foundation SOL/USD, have rebutted claims by the U.S. Securities and Exchange Commission (SEC) suggesting that their native tokens could be classified as a security.\n\nThis comes in the wake of the SEC's legal action against prominent cryptocurrency exchanges Binance and Coinbase earlier this week, wherein ADA was named among other crypto tokens that the SEC considers as securities.\n\nIn a statement released on Friday, IOG stated, “Under no circumstances is ADA security under U.S. securities laws. It never has been.”\n\nThe company also emphasized the importance of understanding the mechanisms of decentralized blockchains as a crucial aspect of formulating judicious regulations.\n\nIOG further criticized the approach of regulating through enforcement actions, indicating that this method lacks the transparency and certainty necessary for both the blockchain ecosystem and its users.\n\nAlso Read: Crypto Can't Dodge The Law With Fancy Talk, Says SEC's Gary Gensler\n\nMeanwhile, the SEC’s allegations cast a shadow on the cryptocurrency market, with ADA witnessing a decline of 3% within 24 hours.\n\nThe market appears to be reacting to the heightened regulatory scrutiny.\n\nIn addition to ADA, the SEC has spotlighted tokens associated with Polygon MATIC/USD, Sandbox SAND/USD, Filecoin FIL/USD, Axie Infinity AXS/USD, Chiliz CHZ/USD, Flow FLOW/USD, Internet Computer ICP/USD, Near NEAR/USD, Voyager VGX/USD, Dash DASH/USD, and Nexo NEXO/USD as securities.\n\nIOG’s statement not only defended its own token, but also highlighted a shared concern among blockchain developers and enthusiasts for a more informed and constructive regulatory framework.\n\nMeanwhile, the Solana Foundation has disputed the classification of Sol being deemed as a security.\n\nIn a statement made to CoinDesk, the foundation stated, “SOL is not a security.”\n\nIt emphasized SOL’s integral role as the indigenous token of the Solana blockchain, which is an extensive, open-source initiative grounded in a decentralized network of users and developers, who collaboratively contribute to its growth and progression.\n\nRead Next: Cryptocurrency Fraud Mitigation In Australia: Monthly Limit On Payments To Exchanges\n\nPhoto: Shutterstock"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wNi8zMjc5NTM3MS9jYXJkYW5vLWFuZC1zb2xhbmEtY291bnRlcmF0dGFjay1hZ2FpbnN0LXNlY3MtY2xhc3NpZmljYXRpb24tb2YtY3J5cHRvY3VycmVuY2llcy1hcy1zZWN1cmnSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzI3OTUzNzE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Cardano And Solana Counterattack Against SEC's Classification Of Cryptocurrencies As Securities - Benzinga",
        "content": "IOG, the company behind the development of Cardano ADA/USD, and the Solana Foundation SOL/USD, have rebutted claims by the U.S. Securities and Exchange Commission (SEC) suggesting that their native tokens could be classified as a security.\n\nThis comes in the wake of the SEC's legal action against prominent cryptocurrency exchanges Binance and Coinbase earlier this week, wherein ADA was named among other crypto tokens that the SEC considers as securities.\n\nIn a statement released on Friday, IOG stated, “Under no circumstances is ADA security under U.S. securities laws. It never has been.”\n\nThe company also emphasized the importance of understanding the mechanisms of decentralized blockchains as a crucial aspect of formulating judicious regulations.\n\nIOG further criticized the approach of regulating through enforcement actions, indicating that this method lacks the transparency and certainty necessary for both the blockchain ecosystem and its users.\n\nAlso Read: Crypto Can't Dodge The Law With Fancy Talk, Says SEC's Gary Gensler\n\nMeanwhile, the SEC’s allegations cast a shadow on the cryptocurrency market, with ADA witnessing a decline of 3% within 24 hours.\n\nThe market appears to be reacting to the heightened regulatory scrutiny.\n\nIn addition to ADA, the SEC has spotlighted tokens associated with Polygon MATIC/USD, Sandbox SAND/USD, Filecoin FIL/USD, Axie Infinity AXS/USD, Chiliz CHZ/USD, Flow FLOW/USD, Internet Computer ICP/USD, Near NEAR/USD, Voyager VGX/USD, Dash DASH/USD, and Nexo NEXO/USD as securities.\n\nIOG’s statement not only defended its own token, but also highlighted a shared concern among blockchain developers and enthusiasts for a more informed and constructive regulatory framework.\n\nMeanwhile, the Solana Foundation has disputed the classification of Sol being deemed as a security.\n\nIn a statement made to CoinDesk, the foundation stated, “SOL is not a security.”\n\nIt emphasized SOL’s integral role as the indigenous token of the Solana blockchain, which is an extensive, open-source initiative grounded in a decentralized network of users and developers, who collaboratively contribute to its growth and progression.\n\nRead Next: Cryptocurrency Fraud Mitigation In Australia: Monthly Limit On Payments To Exchanges\n\nPhoto: Shutterstock"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vcm9iaW5ob29kLXRvLWRlbGlzdC1jYXJkYW5vLXBvbHlnb24tYW5kLXNvbGFuYS03NTEwMzMx0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Robinhood To Delist Cardano, Polygon, and Solana Tokens - Investopedia",
        "content": "Robinhood (HOOD) has decided to delist certain crypto assets from its trading platform after the Securities and Exchange Commission deemed them unregistered securities.\n\nCardano (ADA), Polygon (MATIC), and Solana (SOL) will be delisted after being named in SEC lawsuits filed this week against crypto exchanges Binance and Coinbase (COIN). The lawsuits are part of a broader SEC effort to regulate cryptocurrency.\n\nKey Takeaways Crypto assets ADA, MATIC, and SOL will be delisted from Robinhood on June 27.\n\nUsers who still have ADAM, MATIC, or SOL in their Robinhood accounts on June 27 will have those assets automatically sold on the market.\n\nThe move by Robinhood comes days after these three crypto assets were referred to as unregistered securities by the SEC in lawsuits against Binance and Coinbase.\n\nThe Solana Foundation and Cardano development firm IOG have disputed the characterizations of Solana and Cardano as securities.\n\nWhat Does This Mean For Your Investments?\n\nRobinhood will cease trading of ADA, MATIC, and SOL on June 27. Any customers who have those three crypto assets in their Robinhood accounts at the time of the removal will have them automatically sold on the market.\n\nThat said, users are able to simply withdraw their ADA, MATIC, and SOL prior to the delisting if they'd rather not have the assets sold. However, the ability to withdraw those crypto assets is not available in every state.\n\nAlthough not explicitly mentioned in the announcement, this move from Robinhood appears to be a direct response to the recent SEC lawsuits against Binance and Coinbase, as the three crypto assets targeted for removal from the platform were referred to as unregistered securities in those complaints.\n\nOn Thursday, the Solana Foundation dismissed the claim that SOL is a security, stating it is a community-driven project that relies on decentralized engagement from users and developers.\n\nCardano's development company IOG has similarly disputed the notion that ADA is a security. There have been no public comments from any entity associated with Polygon on the matter.\n\nOther crypto assets that were referred to as securities in the lawsuits against Binance and Coinbase include but aren't limited to BNB Chain (BNB), Binance USD (BUSD), Filecoin (FIL), Cosmos (ATOM), Algorand (ALGO), Internet Computer (ICP), and Dash (DASH).\n\nAdditionally, SEC enforcement actions have been taken against a number of crypto projects directly such as Augur (REP) and Tron (TRX).\n\n"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMDkvcm9iaW5ob29kLWRlbGlzdHMtc29sYW5hLXNvbC1jYXJkYW5vLWFkYS1wb2x5Z29uLW1hdGljLXNlYy1sYXdzdWl0cy1zZWN1cml0aWVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Robinhood to delist tokens for Solana, Cardano, and Polygon after SEC suits name them as securities - Fortune",
        "content": "Dan Gallagher, Robinhood’s chief legal officer, testified before the House Agriculture Committee on Tuesday that the stock trading app was “actively reviewing” tokens the Securities and Exchange Commission deemed were securities in lawsuits against Binance and Coinbase.\n\nOn Friday, Robinhood, which recently expanded into crypto, said in an update on its website that it will delist Solana’s SOL, Cardano’s ADA, and Polygon’s MATIC beginning June 27 at 6:59 p.m. ET. Users will be able to buy and sell the tokens up until the end of June. However, come then, any existing tokens in a user’s wallet “will be sold for market value.”\n\n“Earlier this week the SEC sued crypto companies Binance and Coinbase and alleged that a number of cryptocurrencies are unregistered securities. This includes Solana (SOL), Polygon (MATIC), and Cardano (ADA), which are currently supported on the Robinhood Crypto platform,” the company wrote in a message to its users. “This introduced a cloud of uncertainty around these assets, and as a result, our team has decided to end support for them.”\n\nA spokesperson for Polygon Labs did not immediately return a request for comment. Neither did the Solana or Cardano foundations, but in a statement issued to Fortune yesterday, a spokesperson for Solana said it “strongly believes that SOL is not a security.”\n\nPrices of those tokens didn’t move significantly after Robinhood notified its users on Friday morning. However, since the SEC singled out Solana, Polygon, and Cardano earlier this week, their prices have plummeted. SOL was down approximately 12% from Monday to Thursday afternoon. MATIC was also down about 12%, and ADA dropped 5%. The three tokens are in the top 10 in total market capitalization among all cryptocurrencies, according to CoinMarketCap.\n\nThe sudden pivot in the fortunes of Solana, Polygon, and Cardano follow the SEC’s two blockbuster lawsuits on Monday and Tuesday. In its suit against Binance, SEC Chair Gary Gensler said: “Through 13 charges, we allege that [CEO Changpeng] Zhao and Binance entities engaged in an extensive web of deception, conflicts of interest, lack of disclosure, and calculated evasion of the law.”\n\nIn less aggressive language, Gensler also said that Coinbase did not comply with U.S. securities law. “Coinbase’s alleged failures deprive investors of critical protections, including rulebooks that prevent fraud and manipulation, proper disclosure, safeguards against conflicts of interest, and routine inspection by the SEC,” he said in a statement.\n\nCentral to both lawsuits are the agency’s allegations that 13 tokens, which include SOL, ADA, and MATIC, are securities. Others singled out were SAND, AXS, CHZ, FLOW, ICP, NEAR, VGX, DASH, and NEXO."
    }
]