[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5kZWxtYXJ0aW1lcy5uZXQvbGlmZXN0eWxlL3NvY2lldHkvc3RvcnkvMjAyMy0wMS0zMS9zb2xhbmEtYmVhY2gtc2Nob29sLWRpc3RyaWN0LXByZXNlbnRzLXNoYXJpbmctb3VyLWdpZnRzLXN0dWRlbnQtYXJ0aXN0LWV4aGliaXRpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Solana Beach School District presents 'Sharing Our Gifts', student artist exhibition. - Del Mar Times",
        "content": "The Solana Beach School District held a student artist exhibition titled “Sharing Our Gifts,” on Jan. 19 at the Solana Vista School Theater. The event showcased kindergarten-6th grade student art work that illustrated the District’s six Student Promotion Profile Descriptors: Acting Resourcefully, Practicing Civic Mindedness, Thinking Interdependently, Living Adventurously, Learning Endlessly and Leading Boldly. The Student Promotion Profile Descriptors emerged following the work to reimagine the District’s mission and vision. Utilizing student focus groups to gather student voice, all district staff aims to prepare students with skills for college, career, and life.\n\nPhotos by Jon Clark"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5kZWxtYXJ0aW1lcy5uZXQvbGlmZXN0eWxlL3NvY2lldHkvc3RvcnkvMjAyMy0wMS0zMS9zb2xhbmEtYmVhY2gtc2Nob29sLWRpc3RyaWN0LXByZXNlbnRzLXNoYXJpbmctb3VyLWdpZnRzLXN0dWRlbnQtYXJ0aXN0LWV4aGliaXRpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Solana Beach School District presents 'Sharing Our Gifts', student artist exhibition. - Del Mar Times",
        "content": "The Solana Beach School District held a student artist exhibition titled “Sharing Our Gifts,” on Jan. 19 at the Solana Vista School Theater. The event showcased kindergarten-6th grade student art work that illustrated the District’s six Student Promotion Profile Descriptors: Acting Resourcefully, Practicing Civic Mindedness, Thinking Interdependently, Living Adventurously, Learning Endlessly and Leading Boldly. The Student Promotion Profile Descriptors emerged following the work to reimagine the District’s mission and vision. Utilizing student focus groups to gather student voice, all district staff aims to prepare students with skills for college, career, and life.\n\nPhotos by Jon Clark"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9uZXdzL3N0b3J5LzIwMjMtMDEtMzEvY2Vh0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "CEA sets rates at 8% discount for Del Mar, Solana Beach, Carlsbad compared to SDG&E - Del Mar Times",
        "content": "The Clean Energy Alliance procures energy generation for the cites of Carlsbad, Del Mar and Solana Beach. Later this year, Escondido and San Marcos will join the group, bringing its customer base to about 120,000 accounts.\n\nClean Energy Alliance customers in Del Mar, Solana Beach and Carlsbad will pay about 8% less this year compared to the bills they would receive from San Diego Gas & Electric, following a CEA meeting Jan. 26 where board members approved a rate adjustment.\n\nThe rate adjustment was based on changes in the energy market that drove up expenses for the CEA, which is one of the newest Community Choice Aggregation programs in the state. CCAs allow local governments to band together and offer more renewable energy than traditional utilities.\n\nCustomers in San Marcos and Escondido will have a rate decrease of less than 1% compared to what they would be paying with SDG&E, since those cities joined the CEA more recently and for now have to pay a higher exit fee to SDG&E.\n\nThe relative discount is based on the CEA’s default plan compared to a comparable SDG&E plan.\n\nCustomers in Del Mar and Carlsbad will have an average monthly bill of $210.12, which represents an estimated $20 savings from SDG&E. For Solana Beach, the average bill is $212.23, which is about $18 less than SDG&E. Those calculations are based on customers who are enrolled in the Clean Impact Plus Premium Plan.\n\n“We want to remain competitive with San Diego Gas & Electric,” said Barbara Boswell, the CEO of the Clean Energy Alliance. “Our customers do have the option to opt out and return to service with SDG&E. Even though they are automatically enrolled and so we want to be competitive, we want to offer rates that are, if possible, lower than what is charged by SDG&E for electric generation.”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vc3VwZXJjYXJibG9uZGllLmNvbS9ub3RoaW5nLXBob25lLXNvbGFuYS1zYWdhLXNtYXJ0cGhvbmVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Nothing Phone and Solana Saga - crypto smartphones are here - Supercar Blondie",
        "content": "Two upcoming Android devices are ready to shake the smartphone market globally: the long-awaited Nothing Phone and the newly announced Solana Saga.\n\nBoth will soon be available in the US and both are considered hot tickets at the moment.\n\nDemand is already crazy.\n\nImage: Nothing\n\nREAD MORE: What the heck is the ‘Nothing Phone’ and why is everyone talking about it?\n\nNothing Phone spec and pricing\n\nThe new Nothing Phone 1 will initially be available in the US in Beta.\n\nIt runs on Nothing OS 1.5, an Android-based software, and it supports Android 13 features and apps.\n\nIt also has a self-repair software that automatically fixes bugs, improving loading times when compared to other Android devices.\n\nCHECK THIS OUT!\n\nThe Nothing Phone is manufactured by Qualcomm, the same corporation that makes chips for Asus, HP, Lenovo and even Apple.\n\nIt’s designed to be a Web 3.0-friendly device, and that means we can expect crypto wallet integration and gaming-friendly features.\n\nImage: Nothing\n\nNumerous reports suggested a retail price of around $500.\n\nHowever, as it turns out, Nothing decided to slash pricing for the US market, and the phone will only cost $299.\n\nThis means it’s a lot cheaper than both the iPhone 14 ($799) and the Samsung Galaxy S22 ($614).\n\nSolana Saga spec and pricing\n\nImage: Solana Labs\n\nThe other smartphone tech geeks and ‘crypto bros’ are obsessing over is the upcoming Solana Saga.\n\nCreated by Solana Labs, the Saga is a ‘Web3-first’ phone. It integrates Solana wallets, a store for decentralized apps and NFT marketplaces.\n\nIt runs on Android 13 and is equipped with three cameras.\n\nIn addition to the 50MP + 12MP main cameras, you also have a 16MP selfie camera.\n\nImage: Solana Labs\n\nThe Saga is made from stainless steel and titanium but it won’t come cheap: it costs $1,000.\n\nYou can preorder one with a fully refundable $100 deposit (payable in USDC crypto), with deliveries scheduled for Q2 2023."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJhbmtsZXNzdGltZXMuY29tL25ld3MvMjAyMi8xMi8yNi9zb2xhbmEtcHJpY2UtcHJlZGljdGlvbi1mb3ItMjAyMy13aWxsLXNvbC1nZXQtaXRzLWdyb292ZS1iYWNrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Jan 2023 08:00:00 GMT",
        "title": "Solana Price Prediction for 2023: Will SOL Get its Groove Back? - Bankless Times",
        "content": "Solana price had a terrible performance in 2022 as cryptocurrencies plunged and concerns of its exposure to FTX rose. After being a bright shining star in 2021, SOL price plunged by more than 91% in 2022. It plunged from an all-time high of $260 to $10.\n\nThe rise and fall of Solana\n\nSolana is one of the several blockchain networks that sought to become a better alternative to Ethereum. Unlike Ethereum, it was built on a proof-of-stake (PoS) technology, which is faster and climate-friendlier. Further, Solana is able to process thousands of transactions per second while Ethereum handles less than 20.\n\nAs a result, investors piled into Solana. The developers raised more than $314 million from investors in 2021. Most importantly, developers rushed into its ecosystem. Some of the top companies that embraced the technology are Stripe, Step’N, Meta Platforms, Circle, Google, and Discord, among others.\n\nSolana became one of the best platforms for the transition from Web2 to Web3. Most importantly, the technologies it powered had a real use-case. For example, Audius is disrupting the music streaming industry while Brave is disrupting the browser sector.\n\nSolana became a major player in Decentralized Finance (DeFi), one of the top industries in the blockchain sector. At its peak, the total value locked (TVL) in DeFi jumped to more than $12 billion. This growth was helped mostly by Serum, which was one of the biggest platforms in the industry. Today, there are just $372 million worth of assets in its ecosystem.\n\nSolana’s fall came at the intersection of two main factors. First, it coincided with the collapse of cryptocurrencies. Second, the collapse of Serum and its affiliation with FTX and Alameda Research played a major role. The two firms were among the biggest holders of the SOL token.\n\nWill Solana price recover in 2023?\n\nA common question is whether SOL price will recover in 2022. This recovery will depend on numerous factors. First, it will depend on the overall performance of the cryptocurrency sector. Since cryptos have a close correlation, there is a likelihood that their recovery will drag Solana higher as well.\n\nSecond, it will also depend on the performance of Solana’s ecosystem. A recovery of top applications like Marinade Finance, Orca, Raydium, and Credix will be a bullish factor the coin.\n\nFinally, its recovery will depend on how the developers chart a new path for the ecosystem. Some activities have started to happen. For example, Chainlink enabled its oracle tools on Solana, making it the first instance for a non-EVM platform. They have also launched Solana Pay and inked partnerships with leading players like Google."
    }
]