[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9lY2xpcHNlLWxhdW5jaGVzLWV0aGVyZXVtLWxheWVyLTItMTExMDI5NjcwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "Eclipse Launches Ethereum Layer-2 Running on the Solana Virtual Machine - Yahoo Finance",
        "content": "Eclipse Launches Ethereum Layer-2 Running on the Solana Virtual Machine\n\nEclipse has announced the mainnet launch of its new general-purpose layer 2 scaling solution powered by the Solana Virtual Machine (SVM).\n\nEclipse Mainnet will leverage the “best-in-class execution environment” that Solana Virtual Machine offers for parallel transaction execution. This enables it to scale throughput linearly with hardware. It will also use Solana's localized fee markets to prevent fee spikes from congesting the whole chain.\n\nEclipse will use Celestia for data availability, which is expected to support much higher throughput than Ethereum.\n\nIn addition, Neon EVM is a smart contract which brings Ethereum Virtual Machine (EVM) compatibility to the layer-2 chain.\n\nMeanwhile, Ethereum will be used for settlement, utilizing its security properties. Eclipse will use ETH as its gas token, recognizing it as the “best decentralized money that most users clearly prefer.”\n\nEclipse also stated that they have “no plans for Eclipse Mainnet to have its own token at this time.”\n\nUsers can access Eclipse Mainnet through the recently launched MetaMask Snaps, which allows open-source contributors to build on MetaMask, or Solana native wallets."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9lY2xpcHNlLWxhdW5jaGVzLWV0aGVyZXVtLWxheWVyLTItMTExMDI5NjcwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "Eclipse Launches Ethereum Layer-2 Running on the Solana Virtual Machine - Yahoo Finance",
        "content": "Eclipse Launches Ethereum Layer-2 Running on the Solana Virtual Machine\n\nEclipse has announced the mainnet launch of its new general-purpose layer 2 scaling solution powered by the Solana Virtual Machine (SVM).\n\nEclipse Mainnet will leverage the “best-in-class execution environment” that Solana Virtual Machine offers for parallel transaction execution. This enables it to scale throughput linearly with hardware. It will also use Solana's localized fee markets to prevent fee spikes from congesting the whole chain.\n\nEclipse will use Celestia for data availability, which is expected to support much higher throughput than Ethereum.\n\nIn addition, Neon EVM is a smart contract which brings Ethereum Virtual Machine (EVM) compatibility to the layer-2 chain.\n\nMeanwhile, Ethereum will be used for settlement, utilizing its security properties. Eclipse will use ETH as its gas token, recognizing it as the “best decentralized money that most users clearly prefer.”\n\nEclipse also stated that they have “no plans for Eclipse Mainnet to have its own token at this time.”\n\nUsers can access Eclipse Mainnet through the recently launched MetaMask Snaps, which allows open-source contributors to build on MetaMask, or Solana native wallets."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yaXNlcy1hYm92ZS0yNzAwMC1haGVhZC1vZi1mZWQtZGVjaXNpb24tb24tcmF0ZXMvYXJ0aWNsZXNob3cvMTAzODA1MzQwLmNtc9IBnAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yaXNlcy1hYm92ZS0yNzAwMC1haGVhZC1vZi1mZWQtZGVjaXNpb24tb24tcmF0ZXMvYW1wX2FydGljbGVzaG93LzEwMzgwNTM0MC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $27,000 ahead of Fed decision on rates - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe crypto tokens were trading mixed in Wednesday's trade ahead of the US Federal Reserve's interest rate decision. Bitcoin, XRP, Toncoin, Solana and Polygon were trading with gains, while BNB Dogecoin , and Litecoin were trading with cuts.Bitcoin (BTC) rose 0.92% to $27,044, whereas Ethereum (ETH) was above the 1,600 level. Meanwhile, the global cryptocurrency market cap was trading higher, around $1.07 trillion, rising 0.62% in the last 24 hours.\"Bitcoin's price has surged beyond the $27,000 threshold, and this upward trajectory could likely be attributed to Nomura, one of Japan's leading investment banks, unveiling a Bitcoin-based fund designed for institutional investors,\" said Edul Patel, CEO & Co-founder of Mudrex.Market sentiment currently varies from neutral to bullish as market participants await the Federal Reserve's FOMC decision regarding interest rates, set to be announced later today, Edul said.The total volume in DeFi is currently $2.23 billion, 7.94% of the total crypto market 24-hour volume. The volume of all stablecoins is now $25.78 billion, which is 91.89% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $527 billion. Bitcoin's dominance is currently 49.16%, according to CoinMarketCap.Meanwhile, BTC volume stood at approximately $14.5 billion, falling 3.86% in the last 24 hours.Bitcoin recently broke the long-term resistance at $26,800, attributed to the “double top” pattern seen in the 4-hour period. This breach also marked a successful breakout of the previous downtrend line, signaling the potential for a continued bullish trend.A dominant bullish candle on the 4-hour chart suggests strong bullish momentum with an immediate resistance or target around $27,500 and the possibility of testing $27,900 if the momentum holds. A sustained upside run could push Bitcoin to the $28,800 level and beyond.Critical support now lies at $26,800, once a resistance level, with potential secondary support at $26,300. Vigilance at $26,800 is essential; staying above is bullish, while falling below may require caution and consideration of short positions.: Quick Glance (Source: coinmarketcap.com, data as of 11.50 hours, IST on September 20, 2023)Bitcoin $27,044 0.94%Ethereum $1,634 -0.02%Tether $1 0.01%BNB $216 -0.08%XRP $0.5188 2.05%Cardano $0.2536 -0.02%Dogecoin $0.06233 0.13%Toncoin $2.52 3.68%Solana $19.92 0.56%Polygon $0.5399 2.22%Litecoin $66.53 -0.82%Polkadot $4.12 0.21%Tron $0.08438 0.10%Shiba Inu $0.00000738 1.40%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yaXNlcy1hYm92ZS0yNzAwMC1haGVhZC1vZi1mZWQtZGVjaXNpb24tb24tcmF0ZXMvYXJ0aWNsZXNob3cvMTAzODA1MzQwLmNtc9IBnAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yaXNlcy1hYm92ZS0yNzAwMC1haGVhZC1vZi1mZWQtZGVjaXNpb24tb24tcmF0ZXMvYW1wX2FydGljbGVzaG93LzEwMzgwNTM0MC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $27,000 ahead of Fed decision on rates - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe crypto tokens were trading mixed in Wednesday's trade ahead of the US Federal Reserve's interest rate decision. Bitcoin, XRP, Toncoin, Solana and Polygon were trading with gains, while BNB Dogecoin , and Litecoin were trading with cuts.Bitcoin (BTC) rose 0.92% to $27,044, whereas Ethereum (ETH) was above the 1,600 level. Meanwhile, the global cryptocurrency market cap was trading higher, around $1.07 trillion, rising 0.62% in the last 24 hours.\"Bitcoin's price has surged beyond the $27,000 threshold, and this upward trajectory could likely be attributed to Nomura, one of Japan's leading investment banks, unveiling a Bitcoin-based fund designed for institutional investors,\" said Edul Patel, CEO & Co-founder of Mudrex.Market sentiment currently varies from neutral to bullish as market participants await the Federal Reserve's FOMC decision regarding interest rates, set to be announced later today, Edul said.The total volume in DeFi is currently $2.23 billion, 7.94% of the total crypto market 24-hour volume. The volume of all stablecoins is now $25.78 billion, which is 91.89% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $527 billion. Bitcoin's dominance is currently 49.16%, according to CoinMarketCap.Meanwhile, BTC volume stood at approximately $14.5 billion, falling 3.86% in the last 24 hours.Bitcoin recently broke the long-term resistance at $26,800, attributed to the “double top” pattern seen in the 4-hour period. This breach also marked a successful breakout of the previous downtrend line, signaling the potential for a continued bullish trend.A dominant bullish candle on the 4-hour chart suggests strong bullish momentum with an immediate resistance or target around $27,500 and the possibility of testing $27,900 if the momentum holds. A sustained upside run could push Bitcoin to the $28,800 level and beyond.Critical support now lies at $26,800, once a resistance level, with potential secondary support at $26,300. Vigilance at $26,800 is essential; staying above is bullish, while falling below may require caution and consideration of short positions.: Quick Glance (Source: coinmarketcap.com, data as of 11.50 hours, IST on September 20, 2023)Bitcoin $27,044 0.94%Ethereum $1,634 -0.02%Tether $1 0.01%BNB $216 -0.08%XRP $0.5188 2.05%Cardano $0.2536 -0.02%Dogecoin $0.06233 0.13%Toncoin $2.52 3.68%Solana $19.92 0.56%Polygon $0.5399 2.22%Litecoin $66.53 -0.82%Polkadot $4.12 0.21%Tron $0.08438 0.10%Shiba Inu $0.00000738 1.40%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2pvdXJuYWxzdGFyLmNvbS9saWZlLWVudGVydGFpbm1lbnQvc29sYW5hcy1yaXNlLXNwZWVkLXNjYWxhYmlsaXR5LWFuZC1zdWNjZXNzL2FydGljbGVfZmFjZmNiNTMtOThmNi01OTk3LTlmNDctYmQ5ZDk5ZDg3NzMyLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "Solana's rise: Speed, scalability, and success - Lincoln Journal Star",
        "content": "Solana is an innovative blockchain-based platform wowing with incredible world-class speed. With its exceptionally speedy features becoming a major standout in the blockchain ecosystem, Solana has seen rapid growth with continued success. Showcasing momentous traction among developers and investors, Solana’s scalability, high-speed transactions, and grade-A technology are unparalleled.\n\nAlong with an inspired roadmap, Solana’s extensive and quality attributes include hardware acceleration, sharding techniques, and distinct consensus mechanisms. Developed in 2017 and officially launched in 2020, Solana’s growth has been exponential, evolving into a main blockchain for a range of project developments and providing revolutionary advancements. The platform’s enticing use cases revolve around social media, gaming, Internet of Things, and decentralized finance.\n\nSolana’s foundation is rooted in its ability to far exceed other blockchains’ transaction speeds and execute smart contracts for the secure creation of DeFi, NFT projects, and wide-ranging decentralized applications. Commissions to the network are also notably lower than that of blockchain systems like Ethereum and Bitcoin, thanks to Solana’s high performance for decentralized applications. Moving at lightning speed, Solana is designed deliberately with speed, security, and scalability in mind, processing up to 65,000 transactions per second.\n\nSolana’s lower fees, speedy processing, and a superior capacity to handle transactions in abundance are coupled with its unique Proof of History. Standing out among the competition, Solana’s innovative PoH creates historical records of every transaction by adding a timestamp each time, which results in Solana’s quicker approach to efficiently validating transactions and is more time-saving and cost-effective for users.\n\nImplementing the powerful and revolutionary Tower Byzantine Fault Tolerance technology, Solana produces distinctly low latency and high throughput for speed and reliability. Solana’s platform performance is enhanced due to Tower BFT’s ability to elevate BFT’s integrity and consistency capabilities by combining it with additional advanced technology. Tower BFT offers increased security, confidence, and protection within the decentralized ecosystem through its resilient capacity to tolerate Byzantine faults.\n\nSolana’s popularity derives from its practical solutions, speed, security, and notable scalability. With thoughtfully designed architecture, Solana is able to provide maximum scalability while keeping security and decentralization uncompromised. Mixing the consensus tools of a PoH mechanism with a Tower BFT algorithm, along with a decentralized clock, Solana authorizes parallel transaction processing for quicker confirmation times and remarkably higher throughput.\n\nSolana’s developer-friendly platform has contributed to its success and rapid growth in the crypto space, providing solutions that are as practical as they are innovative. Solana’s variety of resources and tools are dedicated to creating a simplified user experience and an easy process for building and deploying decentralized applications, which has captured the attention of investors and developers and impacted Solana’s price today. Solana has grown into a premier choice for users looking for decentralized finance protocols and high-frequency applications, as the platform is dependably speedy and accurate when processing transactions.\n\nAn inventive contributor to the cryptocurrency landscape, Solana’s unique and game-changing tech and combination of functions continue to blaze a visionary path. Solana’s standard-setting speed and scalability reflect the immense potential for more massive growth and a transformational impact on the future of blockchain technology.\n\nThis content is for informational purposes only and should not be construed as financial advice.\n\nLee Enterprises newsroom and editorial were not involved in the creation of this content."
    }
]