[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb2xhbmEtc2FnYS1waG9uZS1zYWxlcy1zdXJnZXMtMDYzOTU5MDU3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Solana's Saga Phone Sales Surges Thanks to BONK Memecoin - Yahoo Finance",
        "content": "Solana’s Saga Phone Sales Surges Thanks to BONK Memecoin\n\nThe Saga phone, once facing lackluster sales, is now witnessing a surge in demand due to the memecoin BONK. Arbitrage traders are eagerly pursuing a 30 million BONK token airdrop, currently available to all Saga phone owners, causing Saga sales to skyrocket in the past 48 hours.\n\nSolana co-founder Raj Gokal tweeted on Thursday that Saga sales have multiplied by over ten times and are now on track to sell out before the new year. Solana Labs co-founder Anatoly Yakovenko suggested raising the phone's price.\n\nAlso Read: A Deep Dive Into Bonk— The Solana-Based Memecoin\n\nSaga faced a bleak outlook with disappointing sales figures since launch, leading to a price cut from $1000 to $599. Saga is a blockchain-enabled smartphone designed to securely store cryptocurrencies on its hardware.\n\nThe Saga Discord server witnessed a surge in activity as newcomers announced their purchases of the phone. According to posts on the Discord server, the BONK airdrop can be accessed by downloading the BONK app from Saga's crypto-centric custom app store.\n\nA user claiming to be an employee of Solana Mobile explained that once users physically possess the phone, they can mint the \"Genesis token\" through the dApp store, which makes them eligible to claim the BONK airdrop. However, the promotion is not indefinite and that the bonk team would eventually decide when to close it.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb2xhbmEtc2FnYS1waG9uZS1zYWxlcy1zdXJnZXMtMDYzOTU5MDU3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Solana's Saga Phone Sales Surges Thanks to BONK Memecoin - Yahoo Finance",
        "content": "Solana’s Saga Phone Sales Surges Thanks to BONK Memecoin\n\nThe Saga phone, once facing lackluster sales, is now witnessing a surge in demand due to the memecoin BONK. Arbitrage traders are eagerly pursuing a 30 million BONK token airdrop, currently available to all Saga phone owners, causing Saga sales to skyrocket in the past 48 hours.\n\nSolana co-founder Raj Gokal tweeted on Thursday that Saga sales have multiplied by over ten times and are now on track to sell out before the new year. Solana Labs co-founder Anatoly Yakovenko suggested raising the phone's price.\n\nAlso Read: A Deep Dive Into Bonk— The Solana-Based Memecoin\n\nSaga faced a bleak outlook with disappointing sales figures since launch, leading to a price cut from $1000 to $599. Saga is a blockchain-enabled smartphone designed to securely store cryptocurrencies on its hardware.\n\nThe Saga Discord server witnessed a surge in activity as newcomers announced their purchases of the phone. According to posts on the Discord server, the BONK airdrop can be accessed by downloading the BONK app from Saga's crypto-centric custom app store.\n\nA user claiming to be an employee of Solana Mobile explained that once users physically possess the phone, they can mint the \"Genesis token\" through the dApp store, which makes them eligible to claim the BONK airdrop. However, the promotion is not indefinite and that the bonk team would eventually decide when to close it.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb2xhbmEtc2FnYS1waG9uZS1zYWxlcy1zdXJnZXMtMDYzOTU5MDU3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Solana's Saga Phone Sales Surges Thanks to BONK Memecoin - Yahoo Finance",
        "content": "Solana’s Saga Phone Sales Surges Thanks to BONK Memecoin\n\nThe Saga phone, once facing lackluster sales, is now witnessing a surge in demand due to the memecoin BONK. Arbitrage traders are eagerly pursuing a 30 million BONK token airdrop, currently available to all Saga phone owners, causing Saga sales to skyrocket in the past 48 hours.\n\nSolana co-founder Raj Gokal tweeted on Thursday that Saga sales have multiplied by over ten times and are now on track to sell out before the new year. Solana Labs co-founder Anatoly Yakovenko suggested raising the phone's price.\n\nAlso Read: A Deep Dive Into Bonk— The Solana-Based Memecoin\n\nSaga faced a bleak outlook with disappointing sales figures since launch, leading to a price cut from $1000 to $599. Saga is a blockchain-enabled smartphone designed to securely store cryptocurrencies on its hardware.\n\nThe Saga Discord server witnessed a surge in activity as newcomers announced their purchases of the phone. According to posts on the Discord server, the BONK airdrop can be accessed by downloading the BONK app from Saga's crypto-centric custom app store.\n\nA user claiming to be an employee of Solana Mobile explained that once users physically possess the phone, they can mint the \"Genesis token\" through the dApp store, which makes them eligible to claim the BONK airdrop. However, the promotion is not indefinite and that the bonk team would eventually decide when to close it.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2hhY2tlci1wbGVhZHMtZ3VpbHR5LXRvLTEybS1zb2xhbmEtZGVmaS1oYWNrcy1pbi1maXJzdC1zbWFydC1jb250cmFjdC1mcmF1ZC1jb252aWN0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Hacker pleads guilty to $12M Solana DeFi hacks in first smart contract fraud conviction - CryptoSlate",
        "content": "Shakeeb Ahmed, a security engineer who exploited two Solana DeFi apps, has pleaded guilty, according to statements from authorities on Dec. 14.\n\nDamian Williams, United States Attorney for the Southern District of New York (SDNY), announced a guilty plea from the perpetrator. He stated:\n\n“Five months ago, my Office announced the first ever arrest involving an attack on a smart contract. Today … Shakeeb Ahmed pled guilty and agreed to return all of the stolen crypto to his victims … Today’s conviction shows that no matter how sophisticated the methods used, fraud is fraud, and we will swiftly catch and convict you.”\n\nAhmed launched the first of two attacks starting on July 2, 2022, when he targeted an unnamed decentralized exchange to generate $9 million through inflated fees. Ahmed agreed to return all but $1.5 million of the stolen funds if the exchange refrained from reporting the attack to law enforcement. However, SDNY authorities ultimately arrested and charged Ahmed in July 2023.\n\nLater proceedings revealed that Ahmed had carried out a second attack on Nirvana Finance, a Solana-based decentralized finance platform, around July 28, 2022. In that attack, Ahmed manipulated flash loans to purchase Nirvana’s ANA token at a low price, then resold those tokens at a higher price to obtain $3.6 million. After a failed bounty negotiation with Nirvana, Ahmed refused to return the stolen funds, and Nirvana shut down due to a nearly complete loss of funds.\n\nThough the hack against Nirvana Finance was reported as it occurred, Ahmed’s involvement in the attack was not known until today.\n\nOver $12M stolen\n\nThe announcement states that Ahmed stole over $12 million from the two platforms and attempted to hide the theft through several actions.\n\nNotably, Ahmed swapped his ill-gotten gains for Monero (XMR), moved funds through crypto mixers such as Samourai Whirlpool, used a blockchain-hopping strategy, transferred funds to the Ethereum blockchain, and transacted on international crypto exchanges. He also searched for information related to legal defenses and the possibility of fleeing the United States.\n\nAuthorities said that Ahmed has pleaded guilty to one count of computer fraud for a maximum sentence of five years in prison. His sentence will be determined in March 2024. Ahmed has agreed to pay restitution of $5 million to his victims.\n\nMentioned in this article"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9iaXRjb2luLWJ0Yy1yb2xsZXJjb2FzdGVyLXJpcHBsZS14cnAtcHJpY2UtcHJlZGljdGlvbnMtc29sYW5hLXNvbC1kZXZlbG9wbWVudHMtYml0cy1yZWNhcC1kZWMtMTQv0gF-aHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2JpdGNvaW4tYnRjLXJvbGxlcmNvYXN0ZXItcmlwcGxlLXhycC1wcmljZS1wcmVkaWN0aW9ucy1zb2xhbmEtc29sLWRldmVsb3BtZW50cy1iaXRzLXJlY2FwLWRlYy0xNC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 14 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Rollercoaster, Ripple (XRP) Price Predictions, Solana (SOL) Developments: Bits Recap Dec 14 - CryptoPotato",
        "content": "TL;DR\n\nBitcoin (BTC) reached over $44,000, a 20-month high, before falling below $41,000, but recently surged again to $43,000, influenced by the Federal Reserve’s decision to keep interest rates unchanged and hint at future rate cuts.\n\nRipple (XRP) also saw significant fluctuations, moving from around $60 to almost $70, then back to $60, with recent bullish trends suggesting potential further increases.\n\nSolana (SOL) made news with its price surge and NFT sales volume, outperforming Ethereum in weekly NFT sales with a recent 53% increase to nearly $68 million, while Ethereum saw a 5% drop.\n\nBitcoin (BTC) Flashes Green Again\n\nThe largest cryptocurrency by market capitalization – Bitcoin (BTC) – has experienced enhanced volatility in the past few weeks. Its price stood at around $38,000 at the start of December, but in the following days, it took the offensive, reaching a 20-month high of over $44,000. However, the asset could not keep up with the momentum, dropping below $41,000 earlier this week.\n\nAnd while bears started envisioning a more severe plunge in the near future, BTC launched another uptrend a few hours ago, soaring to $43,000 (per CoinGecko’s data). The latest surge could be attributed to the FOMC meeting held on December 13.\n\nRecall that the Federal Reserve kept interest rates unchanged, hinting about three rate cuts next year. Such a pivot has been touted as a bullish factor for the cryptocurrency industry, particularly Bitcoin, as it would make borrowing money cheaper and thus allow more investors to deal with risk-on assets.\n\nThose willing to see what other factors could trigger a BTC rally in the near future could take a look at our latest dedicated video below:\n\nIs Ripple (XRP) Ready for a Final 2023 Sprint?\n\nRipple’s native token – XRP – is another digital asset that experienced severe price swings since the beginning of the month. Its valuation was hovering around $60 on December 1, while approximately a week later, it spiked to almost $70. However, the subsequent market correction suppressed its price back to $60.\n\nXRP headed north once again today (December 14), following the bullish trend in the entire sector. Numerous analysts, including the X (Twitter) users EGRAG CRYPTO and JD, believe the token’s price might climb even higher in the short term. The former claimed XRP could surpass $1.20 by New Year’s Eve, whereas the latter envisioned substantial gains should the coin bounce off on weekly close.\n\nThose curious to check how Ripple’s token might perform in the remaining weeks of the ongoing year could take a look at our video below:\n\nHow is Solana (SOL) Doing?\n\nLast but not least, we will focus on Solana and the recent developments surrounding the blockchain protocol. Apart from making the headlines with SOL’s massive price surge in the past several months, many other advancements are worth noting.\n\nAs CryptoPotato reported, Solana’s non-fungible token (NFT) sales volume has marked a bigger increase on a weekly basis than Ethereum. The figure with the former has reached almost $68 million, 53% higher than the observed data a week before, while the latter recorded a 5% drop.\n\nSolana’s NFT sales volume for the last 24 hours currently stands at over $10 million (a 27% increase on a daily basis), while Ethereum has comprised around $14 million."
    }
]