[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3NvbGFuYS1jb250aW51ZXMtdG8tc2VlLWluZmxvd3MtZnJvbS10aGUtZXRoZXJldW0tY2hhaW4tc29sLXByaWNlLXN1c3RhaW5zLWFib3ZlLTcyLTIwMjMxMjEwMDgyNtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Oct 2023 07:00:00 GMT",
        "title": "Solana continues to see inflows from the Ethereum chain, SOL price sustains above $72 - FXStreet",
        "content": "Ethereum alternative Solana has noted consistent inflows from the ETH chain.\n\nSolana recently flipped Ethereum for NFT sales according to Cryptoslam data.\n\nSolana price sustained above the $72 mark, yielding nearly 14% weekly gains for holders.\n\nSolana has captivated market participants' attention and attracted capital inflows from the Ethereum chain. SOL is making headlines for airdrops in the Solana ecosystem and the token has yielded double-digit gains for holders in the past week.\n\nAlso read: Ethereum derivatives data points at bullish start for ETH in 2024\n\nSolana competes with Ethereum\n\nThe Total Value of assets Locked (TVL) of the Solana chain is nearly 3% of Ethereum, based on DeFiLlama data. Solana’s TVL is $912.62 million, at the time of writing. The rise in Solana’s TVL in the past six months can be attributed to new DeFi projects on the chain and the airdrops by projects in the SOL ecosystem.\n\nSolana analyst and researcher behind the X handle @0xGumshoe notes that the SOL chain is more capital efficient than Ethereum. The analyst believes that despite Ethereum’s TVL being relatively high when compared to other chains, Solana is doing 70% of Ethereum's Decentralized Exchange (DEX) volume.\n\nThe last days have proven that TVL being a pivotal metric is a fake narrative made by Ethereum to assert dominance and hinder other protocols\n\n\n\nSolana is doing 70% of Ethereum's DEX volume with only ~3% of the TVL\n\n\n\nCapital efficiency is what matters.\n\n\n\nh/t @CraigBurel pic.twitter.com/ZMZQr1Al7N — Gumshoe (@0xGumshoe) December 9, 2023\n\nCrypto expert Jacob Canfield identified inflows from Ethereum to Solana and threw his weight behind the Ethereum alternative.\n\nInflows from #Ethereum -> #Solana continue.\n\n\n\nReminds me of the California / New York -> Texas/Florida inflows\n\n\n\nPeople naturally moving to better and more affordable places.\n\n\n\nAre the $SOL devs back @0xMert_? pic.twitter.com/qTE5EPV5La — Jacob Canfield (@JacobCanfield) December 9, 2023\n\nAccording to data from Cryptoslam.io, Solana’s NFT sales exceeded those of Ethereum on December 9.\n\nAt the time of writing, Solana price is $72.41 and the altcoin has yielded nearly 14% weekly gains and nearly 60% gains in the past month. SOL price has sustained above $72 for the past three days."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsZWVwaW5nY29tcHV0ZXIuY29tL25ld3Mvc2VjdXJpdHkvbWFsaWNpb3VzLXNvbGFuYS1rdWNvaW4tcGFja2FnZXMtaW5mZWN0LW51Z2V0LWRldnMtd2l0aC1zZXJveGVuLXJhdC_SAXdodHRwczovL3d3dy5ibGVlcGluZ2NvbXB1dGVyLmNvbS9uZXdzL3NlY3VyaXR5L21hbGljaW91cy1zb2xhbmEta3Vjb2luLXBhY2thZ2VzLWluZmVjdC1udWdldC1kZXZzLXdpdGgtc2Vyb3hlbi1yYXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Oct 2023 07:00:00 GMT",
        "title": "Malicious Solana, Kucoin packages infect NuGet devs with SeroXen RAT - BleepingComputer",
        "content": "Malicious NuGet packages appearing to have over 2 million downloads impersonate crypto wallets, crypto exchange, and Discord libraries to infect developers with the SeroXen remote access trojan.\n\nNuGet is an open-source package manager and software distribution system that operates package hosting servers to enable users to download and use them for their development projects.\n\nThe malicious packages uploaded on NuGet by a user named 'Disti' were discovered by Phylum researchers, who published a report today to warn about the threat.\n\nInflated authenticity\n\nAll six packages in Disti's repository contain the same XML file that downloads 'x.bin,' an obfuscated Windows batch file that carries out malicious activities on the compromised system.\n\nThe packages mimic popular cryptocurrency projects, exchanges, and platforms, even featuring the official logos to trick users.\n\nThe six packages uploaded by Disti on NuGet, and which are still available at the time of writing, are:\n\nKraken.Exchange – 635k downloads\n\nKucoinExchange.Net – 635k downloads\n\nSolanaWallet – 600k downloads\n\nModern.Winform.UI – 100k downloads\n\nMonero – 100k downloads\n\nDiscordsRpc – 75k downloads\n\nThe download numbers are believed to be inflated and may not be representative of the reach of these packages in the NuGet community.\n\nStill, these download counts effectively enhance the perceived credibility of the packages, making them seem like genuine versions of the apps or platforms implied by their names.\n\nDisti's repository on NuGet\n\nDisti might have inflated the download figures using automated scripts, botnets, virtual machines, or cloud containers that download a package many times.\n\nThe SeroXen RAT\n\nThe packages incorporate two PowerShell scripts that execute CMD and Batch files during installation on the victim's computer.\n\nThe script downloads a file from an external URL, saves it as \".cmd\" on a temp directory, and executes it without displaying anything on the screen.\n\nThis script fetches another file named 'x.bin,' which, despite its name, is an obfuscated batch script with over 12,000 lines, and its purpose is to construct and execute yet another PowerShell script.\n\nEventually, that final script reads portions from the cmd file to decrypt and decompress an encoded payload from within itself, which Phylum says is SeroXen RAT.\n\nPowerShell script loading SeroXen RAT (Phylum)\n\nThis feature-rich remote access trojan is marketed as a legitimate program and sold for $15/month or a single \"lifetime\" purchase of $60.\n\nIn May, AT&T reported that SeroXen RAT is gaining popularity among cybercriminals who value its low detection rates and powerful capabilities."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8xMi9jcnlwdG8tdmVudHVyZS1maXJtLXBsYWNlaG9sZGVyLWNhcGl0YWwtc2F5cy1ldGhlcmV1bS1hbmQtc29sYW5hLWFyZS1saWtlLWFuZHJvaWQtYW5kLWlvcy1oZXJlcy13aHkv0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzEyL2NyeXB0by12ZW50dXJlLWZpcm0tcGxhY2Vob2xkZXItY2FwaXRhbC1zYXlzLWV0aGVyZXVtLWFuZC1zb2xhbmEtYXJlLWxpa2UtYW5kcm9pZC1hbmQtaW9zLWhlcmVzLXdoeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Oct 2023 07:00:00 GMT",
        "title": "Crypto Venture Firm Placeholder Capital Says Ethereum and Solana Are Like Android and iOS – Here’s Why - The Daily Hodl",
        "content": "A prominent crypto venture capital firm is comparing Ethereum (ETH) to the mobile operating system Android and Solana (SOL) to iOS.\n\nIn a new blog post, Placeholder Capital makes a case for why Ethereum and Solana are comparable to the two different operating systems.\n\n“Ethereum and Solana are like Android and iOS. Android values modularity: it runs on many different types of devices made by hundreds of manufacturers worldwide; Google only makes 1-2% of them. This approach made it the world’s most popular mobile operating system, with an estimated 60-75% market share.\n\nAndroid’s flexibility has been a boon for hardware companies making anything from smartphones to televisions, as they can bring new products to market without investing billions into building bespoke operating systems. However, such diversity also makes it more difficult to develop apps that seamlessly work across many devices with different specs, screen sizes, and the various versions of Android these devices run.”\n\nThe venture capital firm says that iOS has significant qualities that Android lacks, including a more consistent user experience.\n\n“By contrast, because Apple makes all iOS devices, it can provide users and developers with a more integrated and consistent experience. The time saved by not having to optimize across different devices can go into delivering better apps that users are willing to pay a premium for, and it’s not uncommon for companies to launch on iOS first as a result.\n\nSo, while Apple has just about a third of the market in terms of distribution, it does a much better job at capturing the value of its ecosystem with a whopping ~60% of all mobile spend, plus all the hardware revenue.”\n\nAccording to Placeholder Capital, Ethereum’s likeness to Android is helping to boost its layer-2 ecosystem.\n\n“Ethereum is similar to Android in that it’s quickly becoming more of a platform for third-party networks than the place where most end-users and developers operate.”\n\nSolana offers developers certain benefits over Ethereum, including speed and cost, according to the firm.\n\n“Solana is similar to iOS in how it values tightly integrated components in the name of throughput and performance. There’s much more to it – different consensus mechanisms and design principles – but ultimately, Solana as a single, unified network is much faster and cheaper than Ethereum and many other EVM (Ethereum Virtual Machine) networks.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzEyL2JldHRlci1idXktZXRoZXJldW0tb3Itc29sYW5hL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Oct 2023 07:00:00 GMT",
        "title": "Better Buy: Ethereum or Solana? - The Motley Fool",
        "content": "Solana could finally be fulfilling its early promise as a potential \"Ethereum killer.\" Investors are taking notice.\n\nAfter carrying out The Merge last year, Ethereum (ETH 1.54%) has been one of the top-performing cryptos in 2023. It is up more than 30% over the first nine months of the year.\n\nHowever, a number of other cryptos with large market caps have turned in an even more impressive performance. For example, Solana (SOL 0.67%), an Ethereum rival, is up a stunning 128% year to date. So, should you be buying Solana instead?\n\nInstitutional asset flows\n\nTo help answer that question, consider what's happening with institutional asset flows in the crypto market right now. According to CoinShares, a digital-asset investment firm that tracks the weekly inflows and outflows of digital assets, Solana has become the altcoin of choice for institutional investors. Based on an analysis of digital asset flows, institutional investors appear to be moving their money out of Ethereum and into Solana.\n\nThe latest weekly numbers from CoinShares are stunning, to say the least. Out of the $78 million in net inflows, Solana received more than $24 million of the total. By way of comparison, Ethereum received $10.2 million and Bitcoin (BTC 1.13%) received $43 million. So, the net inflow of institutional investor funds into Solana was more than twice the amount that went into Ethereum.\n\nBy just about any back-of-the-envelope calculation, this shouldn't be happening. Given that Ethereum accounts for nearly 20% of the total capitalization of the crypto market, and Solana accounts for less than 1%, there's no reason to expect institutional investors to allocate so much of their portfolios to Solana. Still, here we are.\n\nAnd this is not a fluke, either. For the first 32 weeks of the year, Solana has seen net inflows in 28 of them, according to CoinShares. Moreover, net inflows into Solana are at their highest levels since March 2022. All of this suggests that momentum is continuing to build around Solana. At the same time, Ethereum continues to see net outflows and is losing momentum.\n\nSolana's long-term growth prospects\n\nThere are several factors that might explain new investor inflows into Solana. Perhaps institutional investors are behaving just like retail investors and are simply chasing performance. With Solana up 122% for the year, this is a distinct possibility.\n\nMoreover, investors might be seeking out altcoins that provide superior diversification benefits. Ethereum still tends to track Bitcoin's performance, while Solana is less correlated with Bitcoin.\n\nHowever, I think there's a much bigger factor at play here: Investors are finally waking up to the fact that Solana is superior to Ethereum as a blockchain in terms of rapid processing speed, low transaction fees, and massive throughput potential. Even after The Merge, Ethereum can still process only 15 to 20 transactions per second; Solana can theoretically process 65,000 transactions per second. That tremendous gap in speeds might help to explain why Visa recently partnered with Solana (and not Ethereum) on a new stablecoin payment project.\n\nTaking a big-picture view, Solana could finally be fulfilling its potential as a so-called \"Ethereum killer.\" Ethereum is the past, and Solana is the future. There's something to be said for the fact that, even after The Merge, Ethereum is nowhere close to Solana's level of performance.\n\nIs Solana really the next Ethereum?\n\nSuppose you consider institutional investors to be the smart money. In that case, it's highly significant that they have been voting with their portfolios and moving money out of Ethereum and into Solana throughout 2023. Do they know something that we don't?\n\nWhile Ethereum has had a remarkable run since its launch in 2015, just about nobody is expecting it to replicate that type of performance. Since 2015, Ethereum is up 44,576.12%. Institutional investors might be looking for the next Ethereum to generate those types of otherworldly crypto gains, and have determined that Solana might fit the bill.\n\nI'm increasingly bullish on Solana as a long-term investment. If it continues to line up big-ticket partners like Visa, then it has a legitimate chance to turn in some impressive long-term returns."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vdGhlY3VycmVuY3lhbmFseXRpY3MuY29tL2Jsb2NrY2hhaW4vc29sYW5hcy1nYW1lLWNoYW5naW5nLXVwZGF0ZS1lbXBvd2Vycy1wcml2YWN5LWRyaXZlbi10cmFuc2FjdGlvbnMtNzUwODLSAXdodHRwczovL3RoZWN1cnJlbmN5YW5hbHl0aWNzLmNvbS9ibG9ja2NoYWluL3NvbGFuYXMtZ2FtZS1jaGFuZ2luZy11cGRhdGUtZW1wb3dlcnMtcHJpdmFjeS1kcml2ZW4tdHJhbnNhY3Rpb25zLTc1MDgyL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Oct 2023 07:00:00 GMT",
        "title": "Solana’s Game-Changing Update Empowers Privacy-Driven Transactions - The Currency Analytics",
        "content": "In a groundbreaking development for Solana (SOL), a prominent Ethereum (ETH) competitor, the network has unveiled a pivotal upgrade – the Solana v1.16 update. After nearly a year of rigorous development and testing, Solana’s network validators have overwhelmingly endorsed this transformational update. This major advancement heralds the introduction of confidential transfers for SPL tokens, the backbone of Solana’s token ecosystem, akin to Ethereum’s ERC-20 tokens.\n\nThe world of blockchain technology has just taken a giant leap toward enhancing user privacy and security. Solana’s latest innovation leverages zero-knowledge (ZK) proofs to encrypt not only the balances but also transaction amounts associated with SPL tokens. This move positions Solana as a pioneer in the realm of privacy-driven blockchain solutions, ensuring that user data remains confidential and secure.\n\nA Leap Towards Privacy and Security\n\nSolana, often touted as Ethereum’s formidable competitor, has marked a significant milestone in the evolution of blockchain technology. The unveiling of the Solana v1.16 update showcases the platform’s commitment to enhancing user privacy and security, bringing a new era of confidentiality to the realm of blockchain transactions.\n\nThis remarkable transformation introduces confidential transfers for SPL tokens, Solana’s equivalent to Ethereum’s widely known ERC-20 tokens. What makes this update particularly innovative is the integration of zero-knowledge proofs (ZK proofs) to protect user data. Notably, this encryption extends to SPL token balances and transaction amounts, effectively rendering it nearly impossible for third parties to intercept or decipher sensitive information.\n\nWith this upgrade, Solana cements its status as a pioneer in the field of privacy-driven blockchain solutions, prioritizing the protection of user data and fostering a secure environment for transactions.\n\nThe Solana Network: A Swift and Scalable Contender\n\nSolana is renowned for its impressive transaction speeds and scalability, making it a strong contender in the blockchain space. With the introduction of confidential transfers, the network is taking a giant leap forward in empowering user privacy. This development aligns with Solana’s core principles of delivering an efficient and secure blockchain ecosystem.\n\nThe utilization of zero-knowledge proofs is at the heart of this transformative upgrade. Zero-knowledge proofs, often abbreviated as ZK proofs, are advanced cryptographic techniques that enable data to be proven without revealing the actual data. In the context of Solana, this technology is leveraged to safeguard SPL token balances and transaction amounts, rendering them impervious to external surveillance and interference.\n\nThe adoption of ZK proofs, combined with Solana’s speed and scalability, opens new doors for blockchain users. This trifecta of traits, speed, scalability, and privacy, ensures that Solana stands at the forefront of blockchain innovation, promising a secure and efficient platform for decentralized transactions.\n\nThe Significance of Confidential Transfers\n\nConfidential transfers are a game-changer in the blockchain industry. They address one of the most pressing concerns for users – the privacy and security of their transactions. While blockchain is celebrated for its transparency and security, it can fall short when it comes to keeping sensitive user data confidential.\n\nSolana’s decision to introduce confidential transfers for SPL tokens is a significant step in the right direction. This update not only enhances the privacy of transactions but also ensures that the transaction amounts and token balances remain confidential. The significance of this development cannot be overstated, as it provides users with a level of data security that was previously difficult to attain within the blockchain ecosystem.\n\nThis move positions Solana as a trailblazer in the privacy-driven blockchain space, creating ripples throughout the industry and setting new standards for user data protection.\n\nZero-Knowledge Proofs: The Guardians of Privacy\n\nAt the heart of Solana’s groundbreaking upgrade are zero-knowledge proofs (ZK proofs), a cryptographic marvel that allows data to be verified without revealing the actual data itself. ZK proofs are the linchpin of this innovative approach to enhancing blockchain privacy, enabling the network to shield user data from prying eyes.\n\nZero-knowledge proofs work by allowing a party, known as the prover, to demonstrate that they possess certain knowledge without revealing the knowledge itself. In the case of Solana, this means that transaction amounts and SPL token balances can be verified as accurate without exposing the precise details of these transactions.\n\nThis level of privacy protection is a game-changer for blockchain users. It means that transactions on the Solana network are not only fast and efficient but also highly secure and confidential. The use of ZK proofs ensures that user data is safeguarded, making Solana a pioneering platform in the blockchain landscape.\n\nSolana’s Commitment to User Privacy\n\nSolana’s commitment to user privacy is clearly evident in the introduction of confidential transfers and zero-knowledge proofs. This commitment goes hand in hand with the platform’s reputation for providing fast and scalable blockchain solutions.\n\nThe need for user privacy within the blockchain space has grown significantly over the years. As blockchain technology becomes more mainstream, it is essential to offer users a secure and confidential environment for their transactions. Solana understands this need and has taken proactive steps to address it with the v1.16 update.\n\nIn a world where data privacy is a growing concern, Solana’s innovative approach not only addresses these concerns but also sets a new standard for the industry. With confidential transfers and the use of zero-knowledge proofs, Solana empowers its users to have confidence in the security and privacy of their blockchain transactions.\n\nConclusion\n\nThe introduction of Solana v1.16 marks a significant milestone in the evolution of blockchain technology. With the unveiling of confidential transfers for SPL tokens and the integration of zero-knowledge proofs, Solana has taken a giant leap toward enhancing user privacy and security. This upgrade positions Solana as a pioneer in the realm of privacy-driven blockchain solutions, ensuring that user data remains confidential and secure.\n\nSolana’s commitment to privacy, coupled with its exceptional transaction speeds and scalability, solidifies its position as a formidable competitor to Ethereum. The adoption of zero-knowledge proofs sets a new standard for user data protection within the blockchain industry, offering a secure and efficient platform for decentralized transactions.\n\nAs the blockchain landscape continues to evolve, Solana’s innovative approach to privacy and security is sure to set the benchmark for others in the industry to follow. This groundbreaking upgrade demonstrates Solana’s dedication to advancing the blockchain ecosystem, with a strong focus on safeguarding user data and providing a seamless, secure, and private experience for its users."
    }
]