[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbmdhcGUuY29tL3dlYi1zdG9yaWVzL3NvbmFsYS1zZWVzLXN1ZGVuLTE0LXNwaWtlLXdpbGwtaXQtY29udGludWUtdG8tcmFsbHkv0gFWaHR0cHM6Ly9jb2luZ2FwZS5jb20vd2ViLXN0b3JpZXMvc29uYWxhLXNlZXMtc3VkZW4tMTQtc3Bpa2Utd2lsbC1pdC1jb250aW51ZS10by1yYWxseS8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 02 Jan 2023 08:00:00 GMT",
        "title": "Solana Sees Sudden 14% Spike, Will It Continue To Rally? - CoinGape",
        "content": "In the last 7 days, the cryptocurrency had not only fallen out of the top-20, but it has depreciated by 17% too."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiuwFodHRwczovL3d3dy5jb3JvbmFkb25ld3NjYS5jb20vbmV3cy9jb3JvbmFkb19zcG9ydHMvY29yb25hZG8teW91dGgtc29jY2VyLWxlYWd1ZS1jeXNsLWdpcmxzLXUxMC13aW4tbGEtam9sbGEtMjAyMi1yZWMtYWxsLXN0YXItdG91cm5hbWVudC9hcnRpY2xlXzA0Yjc2MDNhLThjOTItMTFlZC1iMzg0LWEzZWQ2NWZjM2Y4Yi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 02 Jan 2023 08:00:00 GMT",
        "title": "Coronado Youth Soccer League (CYSL) Girls U10 Win La Jolla 2022 Rec All Star Tournament - Coronado Eagle and Journal",
        "content": "Nado’s recreational GU10 team participated in the La Jolla All Star Tournament on December 3-4. The team finished unbeaten allowing only two goals through four games. They defeated the Cardiff Sockers (6-1), Solana Beach (3-0), Pacific Beach (4-0), and finally San Diego Force (5-1)."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vdS50b2RheS9zb2wtdXAtMTMtYXMtaHlwZS1hcm91bmQtc29sYW5hcy1tZW1lLWNvaW4tYnJlYWtzLW91dNIBSWh0dHBzOi8vdS50b2RheS9zb2wtdXAtMTMtYXMtaHlwZS1hcm91bmQtc29sYW5hcy1tZW1lLWNvaW4tYnJlYWtzLW91dD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 02 Jan 2023 08:00:00 GMT",
        "title": "SOL Up 13% as Hype Around Solana's Meme Coin Breaks Out - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nThe price of SOL increased by more than 13% during the day, which at first seemed to happen for no apparent reason. However, it turned out that the reason for the growth of token quotations, which a couple of days ago broke through another bottom, was a new meme coin, which suddenly blew up the media around Solana.\n\nAnother one\n\nOf course, this token, called BONK, again has an avatar in the form of a dog, those are the rules of the game. The name of the token refers to a famous meme, and it is probably the first meme coin on Solana to make such a splash. BONK volumes in the last 24 hours have grown by more than 6,500%, and its price by almost 120%.\n\nAlways love me some dog money — Austin Federa (@Austin_Federa) January 1, 2023\n\nAt the same time, the token is starting to be accepted by various marketplaces on Solana as payment, and Solana Foundation's Head of Strategy and Communications Austin Federa admits that he has always loved some dog money.\n\nFriendly reminder\n\nDespite the hype and double- and triple-digit metrics growth, something already forgotten during the last year of harsh crypto winter, it is worth being careful with investment decisions regarding such crypto assets. The hype will pass, but the risk of being left with nothing in the portfolio balance or worse, getting into some honeypot scam is always there."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZGVjcnlwdC5jby8xMTgyMzUvc29sYW5hLWp1bXBzLWRvdWJsZS1kaWdpdHMtdG8tcmVjbGFpbS0xMdIBSGh0dHBzOi8vZGVjcnlwdC5jby8xMTgyMzUvc29sYW5hLWp1bXBzLWRvdWJsZS1kaWdpdHMtdG8tcmVjbGFpbS0xMT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 02 Jan 2023 08:00:00 GMT",
        "title": "Solana Jumps Double Digits to Reclaim $11 - Decrypt",
        "content": "We do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe price of embattled cryptocurrency Solana (SOL) has shot up by over 11% over the past 24 hours, per CoinGecko. The New Year price bump has seen the cryptocurrency reclaim $11 after several days trading below double-digits.\n\nThe news follows a show of support from Ethereum founder Vitalik Buterin, who tweeted last week that “smart people” have told him there is an “earnest smart developer community in Solana,” and that the chain has “a bright future” now that “the awful opportunistic money people have been washed out.” Buterin added that he hopes the Solana community “gets its fair chance to thrive.”\n\nHowever, Solana’s New Year pump hasn’t canceled out the battering the would-be “Ethereum killer” has taken over recent months.\n\nSome smart people tell me there is an earnest smart developer community in Solana, and now that the awful opportunistic money people have been washed out, the chain has a bright future. Hard for me to tell from outside, but I hope the community gets its fair chance to thrive🦾🦾 — vitalik.eth (@VitalikButerin) December 29, 2022\n\nAD\n\nAD\n\nThe cryptocurrency is down nearly 20% in the past month and has lost over 95% of its value since reaching an all-time high of nearly $260 in November 2021.\n\nSOL slid from fifth place on the list of largest cryptocurrencies by market cap in November 2022 to 19th at the time of writing; earlier this month it briefly slipped out of the top 20.\n\nSolana’s slump\n\nContagion from the collapse of crypto exchange FTX likely accounts for a large part of Solana’s recent price woes; in November the Solana Foundation shared details of its financial entanglement with the now-bankrupt exchange and its sister firm Alameda Research.\n\nFTX’s sister hedge fund Alameda Research was invested in 17 total Solana projects, worth about $3.26 billion in total, per data from DeFi Llama.\n\nAD\n\nAD\n\nIn addition, several large-scale projects have announced plans to abandon the Solana ecosystem in recent months.\n\nDeGods, a popular NFTs collection that utilizes the Solana network, is set to migrate to the Ethereum ecosystem in the first quarter of this year.\n\nIn addition, another popular NFT project, yOOts, is set to move to Polygon, an Ethereum-based Layer-1 network."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vY3J5cHRvY3VycmVuY3kvYXMtc29sYW5hLWNvbnRpbnVlcy10by1kaXAtaGVyZS1hcmUtc29tZS1zaWducy10aGF0LWl0LWNvdWxkLXBvc3QtYS1yZXZpdmFsLWluLTIwMjMtMTU1NjIwNjEuaHRt0gGMAWh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS9hcy1zb2xhbmEtY29udGludWVzLXRvLWRpcC1oZXJlLWFyZS1zb21lLXNpZ25zLXRoYXQtaXQtY291bGQtcG9zdC1hLXJldml2YWwtaW4tMjAyMy0xNTU2MjA2MS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 02 Jan 2023 08:00:00 GMT",
        "title": "As Solana continues to dip, here are some signs that it could post a revival in 2023 - CNBCTV18",
        "content": "Back in November 2021, Solana (SOL) was trading at $267.50 and ranked among the top coins in the market. However, a year later, things aren’t looking too good. As 2022 came to an end, Solana was among the worst-performing tokens in the market. The coin experienced a 97 percent decline and was even being compared to the likes of FTT and LUNA, both of which collapsed last year.\n\nHowever, it’s not all doom, gloom and despair for the Ethereum killer. There are some signs and developments that could support a revival for SOL in 2023. Here’s a look at some of these indicators and what they mean for the future of the embattled blockchain network.\n\nOn December 21, Solana took to social media to announce its objectives for the coming year. As per its announcement, the network will launch its blockchain smartphone, the Saga, in the first quarter of 2023. The device will run on the Android operating system, but it will also offer blockchain software as a native component. This will create the perfect environment for the Solana-based dApps (that come preloaded onto the phone) to thrive.\n\nIn June last year, just the unveiling of the phone caused the price of SOL to spike. The coin jumped from $36.18 on June 22, a day before the reveal, to $42.20 a couple of days later. Based on this information, traders and investor believe that the launch of the Saga could trigger a substantial rally for the stuttering blockchain network.\n\nSolana can process over 60,000 transactions per second (TPS), with an average confirmation time of roughly five minutes. While this is quite impressive, competitors like Cardano can scale up to a million TPS. Plus, over the last couple of years, the Solana network has been plagued by network outages that dent investor confidence. Therefore, to boost its throughput and solve the issue of outages, Solana has signed up JumpCrypto to improve the efficiency of the network.\n\nJump Crypto is an organisation that provides infrastructure solutions that catalyse the growth of a blockchain ecosystem. Among the many things that Jump Crypto is working on with Solana, Fire Dancer is perhaps the most exciting. It is a second and new validator client that will operate in parallel with the one built by Solana Labs.\n\nThis parallel consensus node will improve the throughput and the reliability of the Solana network. It is expected to boost the blockchain’s raw processing speed to 1.2 million TPS. A second validator node will also make the network more secure, ensuring that bugs do not cause network outages. As such, the upgrade could affect a potential turnaround for Solana.\n\nSolana’s technical indicators also point to a short-term revival in 2023. For instance, on December 29, Solana posted a Doji candlestick pattern. This pattern is formed when an asset opens and closes around or at the same level on a given day. It indicates that bears and bulls are at a stalemate and it is usually considered a sign of a reversal. Another technical indicator that supports the notion of a revival is Solana’s Relative Strength Index (RSI). On December 31, Solana’s RSI stood at 28 percent, indicating that SOL was undervalued or oversold. Such an RSI hints at a short-term revival.\n\nThese indicators seem to be correct as SOL has closed higher than it opened every day since posting a Doji candlestick pattern on December 29. Moreover, at the time of writing, Solana was trading at $11.15, up nearly 15 percent over the last 24 hours.\n\nFinder, a reputable asset comparison platform, recently put together a panel of experts to ascertain Solana’s current and future position. According to the panel, SOL is expected to reach $116 by 2025 before catapulting to $236 by the end of 2030. The panel concluded that Solana, a potent competitor to Ethereum, has a host of services to offer and solid institutional backing, both of which should work in its favour. Changelly, a crypto exchange, also points towards a bullish future for Solana. In a recent blog post, the exchange predicted that SOL would touch the $213 mark by 2025.\n\nSolana is known for its innovation and was once considered a top performer in the crypto world. Therefore, while 2022 has been one of the worst years for the overall digital asset industry, there is no reason to question Solana’s competence.\n\nThe platform is active and ambitious as they have been announcing the launch of their new projects under such bearish conditions. However, it remains to be seen how the new developments turn out for Solana and whether it can regain its lost stature in the digital assets industry."
    }
]