[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL2NyeXB0b2N1cnJlbmN5L3N0b3J5L2NyeXB0by1wcmljZXMtdG9kYXktYml0Y29pbi1hYm92ZS0xODAwMC1ldGhlcmV1bS1zb2xhbmEtbWVtZS1jb2lucy1pbi10aGUtZ3JlZW4tMjMyMDUyMi0yMDIzLTAxLTEy0gGVAWh0dHBzOi8vd3d3LmluZGlhdG9kYXkuaW4vYW1wL2NyeXB0b2N1cnJlbmN5L3N0b3J5L2NyeXB0by1wcmljZXMtdG9kYXktYml0Y29pbi1hYm92ZS0xODAwMC1ldGhlcmV1bS1zb2xhbmEtbWVtZS1jb2lucy1pbi10aGUtZ3JlZW4tMjMyMDUyMi0yMDIzLTAxLTEy?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Jan 2023 08:00:00 GMT",
        "title": "Crypto prices today: Bitcoin above $18,000, Ethereum, Solana & meme coins in the green - India Today",
        "content": "The top cryptocurrencies on 12 January traded in the green. The value of Bitcoin was up by 4.57 percent to trade at $18,219.93, above the $16,000 mark after a continuous fall. The total crypto market volume witnessed an increase of 31.49 percent to $45.73B over the last 24 hours. Moreover, the global crypto market cap also gained by 3.87 percent to $889.89B.\n\nadvertisement\n\nAs of (1030 IST), Ethereum's value rose by 5.22 percent to $1,402.27, in comparison to yesterday's value of $1,333.08. At the time of writing this article, the value of Polygon advanced by 4.39 percent to $0.892222, XRP grew by 4 percent to $0.377934, and Avalanche was up by 27.71 percent to $15.92. Furthermore, Cardano rose by 4.14 percent to $0.327855, and Solana gained by 2.29 percent to $16.35.\n\nThe value of Dash also registered gains of 3.04 percent to $48.58, along with Monero's growth at 4.80 percent to $168.93.\n\nAmid the rising market, the top gainers recorded on Thursday were Avalanche, Near Protocol, Flow, and Fantom. On the contrary, Neutrino USD, Bitcoin SV, XDC Network, and Ethereum POW, were the top losers, as per CoinMarketCap.\n\nMeme coins increase in value\n\nThe value of Meme coins grew in the last 24 hours. Dogecoin stood at $0.079707, with a 3.71 percent higher value from yesterday. Shiba Inu also advanced by 3.72 percent to $0.000009.\n\nMetaverse tokens witness growth\n\nTop metaverse tokens remained profitable with gains recorded in the value of Decentraland at 3.53 percent to $0.406393. The Sandbox rose by 5.35 percent to $0.529047. Axie Infinity marked gains of 8.32 percent to $7.90."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LnB5bW50cy5jb20vY3BpLXBvc3RzL2Rvai1pbnZlc3RpZ2F0aW5nLXNhYmVyLXN0YWJsZWNvaW4tZXhjaGFuZ2UtZm91bmRlcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Jan 2023 08:00:00 GMT",
        "title": "DOJ Investigating Saber Stablecoin Exchange Founders - PYMNTS.com",
        "content": "The Department of Justice is reportedly investigating the founders of Solana stablecoin exchange Saber Labs.\n\nThe investigation targets brothers Ian and Dylan Macalinao, CoinDesk reported Wednesday (Jan. 11), citing people familiar with the matter.\n\nAccording to the CoinDesk report, the probe comes in the wake of a story by the news outlet in August that alleged the Macalinao brothers used a web of 11 pseudonyms to create a network of interconnected financial products that double- and triple-counted cryptocurrency deposits by passing tokens between themselves.\n\nRead more: FTX, Congress, Stablecoins: What 2023 May Bring For Crypto Regulations\n\nThis boosted a crucial growth metric for Solana by billions of dollars during the peak of 2021’s cryptocurrency bull market and drove up the price of SOL, the Solana network’s native token, CoinDesk said.\n\nThe news comes amid a rash of bad news from the world of cryptocurrency. These stories range from a wave of layoffs to federal investigations into the multi-billion dollar downfall of crypto exchange FTX that revealed what prosecutors say was a “massive, years-long fraud.”\n\nWednesday saw reports that the Securities and Exchange Commission was investigating the extent of the diligence policies and procedures the blue-chip financial firms and other investors had in place before giving capital to FTX.\n\nPYMNTS noted last month that the Solana network tried to distance itself from another crypto-world figure under federal investigation: FTX founder Sam Bankman-Fried.\n\nLast month, a report from Bloomberg News said the firm’s leaders are taking steps to separate their brand from Bankman-Fried, who had appeared with founder Anatoly Yakovenko at conferences to promote the blockchain.\n\nThat was before FTX collapsed and declared bankruptcy and Bankman-Fried was indicted on several federal charges.\n\n“I’m still trying to square what I perceive him to be and like what actually happened,” Yakovenko told Bloomberg. “It just feels really, really jarring.”\n\nYakovenko added that only about 4% of teams building projects on Solana now were acutely impacted by FTX’s downfall, while 80% had zero exposure to the crypto exchange.\n\n“There’s definitely more to Solana than FTX,” Yakovenko said."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9kb2otcHJvYmVzLW1hY2FsaW5hby1icm90aGVycy1jcnlwdG8tbWFya2V0LXNvbGFuYS1zb2wtc2FiZXItbGFicy0yMDIzLTHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Jan 2023 08:00:00 GMT",
        "title": "DOJ Probes Whether Two Brothers Used 11 Fake Identities to Build De-Fi Ecosystem - Markets Insider",
        "content": "The DOJ is investigating two brothers behind a solana stablecoin exchange over alleged fraud, CoinDesk reported.\n\nThe Macalinao brothers reportedly crafted 11 fake identities to triple-count crypto deposits to create a fake De-Fi ecosystem.\n\nThe crypto industry is under heavy scrutiny following the collapse of Sam Bankman-Fried's FTX exchange.\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time by visiting our Preferences page or by clicking \"unsubscribe\" at the bottom of the email.\n\nAdvertisement\n\nThe US Department of Justice is probing two brothers behind a solana stablecoin exchange that reportedly used 11 fake identities to triple-count deposits, according to CoinDesk.\n\nThe investigation follows CoinDesk's earlier exposé in August which revealed the Macalinao brothers crafted a fake decentralized finance ecosystem by passing the triple-counted deposits between themselves. The allegedly fraudulent scheme was meant to increase a key metric for cryptocurrency Solana in 2021.\n\nUS authorities are looking into a web of crypto projects circulating Saber, per CoinDesk, including a De-Fi yield-farming app Sunny Aggregator and a stablecoin project Cashio that lost millions of dollars in a hack last March.\n\nThe DOJ and Saber Labs did not immediately respond to Insider's request for comment.\n\nAdvertisement\n\n\"The metric to optimize for in Summer 2021 was [total value locked (TVL)]\" Ian Macalinao wrote in an unpublished blog discovered by CoinDesk.\n\n\"TVL can only count if protocols are built separately, so I devised a scheme to maximize Solana's TVL: I would build protocols that stack on top of each other, such that a dollar could be counted several times,\" he added.\n\nMeanwhile, Saber is still maintaining operations. According to its website, it's processed $4.3 million in trading volume in the last 24 hours.\n\nThe crypto industry is facing turmoil and scrutiny following the collapse in November of Sam Bankman-Fried's FTX, which has since led to a slew of money laundering and conspiracy charges."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LnRyb253ZWVrbHkuY29tL2JvbmstZXhwcmVzcy1oaWdobGlnaHRpbmctc29sYW5hLWNvbXBvc2FiaWxpdHkv0gFOaHR0cHM6Ly93d3cudHJvbndlZWtseS5jb20vYm9uay1leHByZXNzLWhpZ2hsaWdodGluZy1zb2xhbmEtY29tcG9zYWJpbGl0eS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Jan 2023 08:00:00 GMT",
        "title": "Bonk Expresses Disappointment In Hope Of Highlighting Solana Composability - TronWeekly",
        "content": "After all 15,000 collectibles were sold, the price of Bonkz NFTs increased by ten times and attracted over $900,000 in trading volume.\n\nData from Solana marketplace Magic Eden reveals that at the time of writing, over 6,165 different wallets contain these treasures. The memorabilia is based on the well-known Shiba Inu-themed Solana project Bonk Inu, which was not directly involved in the production of Bonkz.\n\nThe NFTs, which are digital tokens that signify ownership of a real-world or digital asset, could increase the use of BONK on the Solana network. The previous week has seen a huge increase in the meme token’s transaction volume and buzz.\n\nAccording to the BONK collectibles’ developers, there are no immediate plans for any practical applications of the tokens. Pricing was $25 worth of the new meme token for the mint, which is the initial release of any NFT. Secondary trading will be conducted using Solana (SOL) tokens.\n\nWhen this article was written, one NFT sold for more than $280 in Solana. All of the tokens used to purchase these NFTs were torched, which is a phrase for when tokens are permanently withdrawn from the supply. As a result, on Tuesday, over $250,000 worth of bonk’s token supply was taken out of circulation.\n\nAs a result, a particular aspect of the NFT drew criticism from locals.\n\nFor the mint, Magic Eden claimed to have used its Open Creator Protocol (OCP), which imposes royalties on all collections that embrace it and gives creators the option of banning marketplaces that do not do the same for their collection.\n\nA note regarding the Solana based NFT’s listing on Magic Eden stated,\n\n“We utilized OCP for this mint, so any transfers between wallets should be done on Magic Eden in “My Items” versus directly in wallet.”\n\nIn essence, this implies the NFT won’t be available in markets that don’t pay authors royalties.\n\nBonk’s Hope Of Accentuating Composability Of Solana\n\nThe Bonk Inu community, including its developers, criticized such a decision. “BONK is intended to be open source so that anybody can build upon it. In a tweet on Wednesday, developers stated that they were “disappointed to see an exchange limit trade using OCP” and that they were “working on a solution to address the apparent centralized approach.”\n\nThe makers of the Solana based NFT recognized the apparent error and said they were “actively working with all stakeholders.”\n\nIn the meantime, values for BONK tokens haven’t changed in the last day and are down around 70% from all-time highs."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vdGVjaG5leHQyNC5jb20vMjAyMy8wMS8xMi91cy1kb2otcHJvYmUtc2FiZXItbGFicy1zb2xhbmEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 12 Jan 2023 08:00:00 GMT",
        "title": "U.S government launches probe of Saber Labs over Solana - Technext",
        "content": "The U.S. Department of Justice has begun investigating two brothers behind Solana stablecoin exchange Saber Labs Ian and Dylan Macalinao, as reported by Coindesk. The investigation centres around the brothers’ incorporation of diverse false identities to carry out erroneous crypto gain.\n\nIn an extensive cover of the allegation saddled on Saber Labs founders, the brothers had created roughly 11 different identities across the internet in their pursuit to “build an ecosystem of interlocking financial products that double and triple-counted crypto deposits by passing tokens between themselves.”\n\nNonetheless, Solana did enjoy a massive increase in key growth metrics as it raked in billions of dollars in 2021 and, according to Ian, juiced the price of SOL, the native token of the Solana network.\n\n“The metric to optimize for in Summer 2021 was [total value locked (TVL)],” Ian wrote in a never-published blog post obtained by CoinDesk. “TVL can only count if protocols are built separately, so I devised a scheme to maximize Solana’s TVL: I would build protocols that stack on top of each other, such that a dollar could be counted several times.”\n\nMore details about Saber Labs discrepancies on the Solana project\n\nOne of the sources stated that investigators are looking for information on the web of crypto projects that orbited Saber. Sunny Aggregator, a decentralized finance (DeFi) yield-farming tool, and Cashio, a stablecoin startup that suffered a March hack and lost millions of dollars, are examples of this. Ian used fictitious identities to write the code for both projects in secrecy.\n\nRead Also: Crypto payments platform Wyre set to shut down\n\nLast year, one of the most significant financial crimes in history happened in the crypto sector. FTX fraud occurred when many least expected; it was a fallow period, the bearish pull had flustered traders, and there was no asylum to run to for coverage from the anguishing losses. That case lingered for as long as possible. It led to the collapse of several promising crypto tech startups.\n\nThere is another, and the American authorities have decided not to let this run off their hook. The authorities are investigating another possible financial crime that might affect the market condition.\n\nIan and Dylan would reportedly create unreal, virtual identities that would “double and triple’ count crypto deposits by “passing tokens between themselves.” Coindesk also successfully accessed an unpublished blog by Ian Macalinao indicating, “The metric to optimize for in Summer 2021 was total [total value locked (TVL)],” according to the report.\n\nRead Also: Coinbase to lay off 950 members of its workforce\n\nOn the other hand, investigators look into Sabers’ different crypto initiatives. These include the Defi app Sunny Aggregator and the stablecoin project Cashio, which was hacked in March and lost millions of dollars.\n\nIan allegedly used similar fictitious identities to write both codes. “An ecosystem does not look as authentic if a small number of individuals entirely constructs it,” he said. Instead of releasing 20+ disparate apps as a single individual, I wanted to make it appear like many people were building on our protocol, the author continued.\n\nAs we advance, many investors and traders will hope the investigation does not damage the recovering crypto sector so much. The trauma from witnessing the FTX saga and Bankman’s selfish decoy might kill every sort of optimism in some users’ minds. The year is as new as spring tucked into a fresh morning sunset. The prayer of many crypto investors coming into the year is that the market stays free from all sorts of terrible and disheartening allegations."
    }
]