[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5jYnM4LmNvbS92aWRlby9uZXdzL2xvY2FsL3NvbGFuYS1iZWFjaC13b21hbi10by1iZS1zZW50ZW5jZWQtbW9uZGF5LWZvci1tdXJkZXJpbmctc3RlcGZhdGhlci81MDktYjNmOWNlZGItOTcwNS00NTAwLWI4ZGYtNTU0NmZkNWI1MmEw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Mar 2023 08:00:00 GMT",
        "title": "Solana Beach woman to be sentenced Monday for murdering stepfather - CBS News 8",
        "content": "Next up in 5\n\nExample video title will go here for this video"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LnRlc3RpbmdjYXRhbG9nLmNvbS9nZXQteW91ci1mcmVlLXNvbGFuYS1uZnQtZnJvbS1zb2xhbmEtc29hcC1hcy1hbi1lYXJseS10ZXN0ZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Mar 2023 08:00:00 GMT",
        "title": "Get your free Solana NFT from Solana SOAP as an early tester - TestingCatalog",
        "content": "While trying to explore a bit more of Solana's projects, I got my first asset from SOAP. It is a new proof of attendance token distribution platform. You can get a free \"Testooor Soap\" NFT as an early bird to your Solana Wallet, like Phantom or others.\n\n📲 Claim a free Testooor NFT\n\nSOAPs are typically free NFTs that you may collect by attending or participating in certain activities like conferences or alpha testing rounds."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMizAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG9jdXJyZW5jeS1hbmFseXRpY3MtaW5zaWdodC90cm9ucy10cngtdHBzLXN1cnBhc3Nlcy1ldGhlcmV1bS1iaXRjb2luLWFuZC1yaXBwbGUtc29sYW5hLXNvbC1nZXRzLWludG8tY3Jpc2lzLW1hbmFnZW1lbnQtbW9kZS10bXMtbmV0d29yay10bXNuLWJlY29tZXMtYS1tdXN0LWhhdmUtdG9rZW7SAdYBaHR0cHM6Ly93d3cuYW5hbHl0aWNzaW5zaWdodC5uZXQvYW1wL3N0b3J5L2NyeXB0b2N1cnJlbmN5LWFuYWx5dGljcy1pbnNpZ2h0L3Ryb25zLXRyeC10cHMtc3VycGFzc2VzLWV0aGVyZXVtLWJpdGNvaW4tYW5kLXJpcHBsZS1zb2xhbmEtc29sLWdldHMtaW50by1jcmlzaXMtbWFuYWdlbWVudC1tb2RlLXRtcy1uZXR3b3JrLXRtc24tYmVjb21lcy1hLW11c3QtaGF2ZS10b2tlbg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Mar 2023 08:00:00 GMT",
        "title": "TRON’s (TRX) TPS Surpasses Ethereum, Bitcoin, and Ripple; Solana (SOL) Gets Into Crisis Management Mode; TMS Network (TMSN) Becomes a Must Have Token - Analytics Insight",
        "content": "A recent tweet by the TRON community claimed that the TPS (transactions per second) of TRON (TRX) is more than that of Ethereum, Bitcoin, and Ripple. As per the tweet, the TPS of TRON (TRX) is 88.20, while it is just 11.96 for Ethereum and 3.43 for Bitcoin. This has also caused a spike in the number of transactions on the TRON (TRX) network. Analysts believe that if the activities continue to increase, the number of activated addresses on the TRON (TRX) network can surpass 2 million. Meanwhile, TRON's (TRX) value has declined by 5% in the last seven days. However, the price of TRON (TRX) has increased by 3.44% on the monthly chart. Currently, TRON (TRX) trades at $0.0667, which is 78% below its all-time high of $0.30."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5jYnM4LmNvbS9hcnRpY2xlL25ld3MvbG9jYWwvc29sYW5hLWJlYWNoLXdvbWFuLXRvLWJlLXNlbnRlbmNlZC1mb3ItbXVyZGVyaW5nLXN0ZXBmYXRoZXIvNTA5LTkwYjViMjZkLWM3ODYtNDIwZC04NWU0LTY4NjkxOGRlZTFiMdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Mar 2023 08:00:00 GMT",
        "title": "Jade Janks sentenced to 25 years to life in prison for murder of stepfather - CBS News 8",
        "content": "Jade Janks was sentenced to 25 years to life after a jury found her guilty of killing her stepfather after finding hundreds of nude photos of herself on his computer\n\nExample video title will go here for this video\n\nExample video title will go here for this video\n\nSAN DIEGO — Jade Janks, the 39-year-old Solana Beach woman convicted of murdering her stepfather, was sentenced to 25 years to life in prison on Monday.\n\nThe judge says Janks will be eligible for parole in 25 years.\n\nIn December, a jury found Janks guilty of killing her stepfather, Tom Merriman, after she found hundreds of nude photos of herself on his computer.\n\n\"Tom came into my life when I was just a little girl and exerted influence during that early stage of development when I was still figuring things out,\" said Janks during her statement to the court Monday.\n\n\"Unfortunately, that influence manifested itself into inappropriate touch, coercion, reckless behavior and complete violation of what I now realize was years of psychological manipulation. All of this came crashing down on me when I found hundreds of naked photos of myself on his computer. I felt shattered,\" she said.\n\n\"I'm sorry I didn't act the way I was supposed to that day,\" she added. \"I think about it every day since. And to Tom's family, I understand you hate me for what you believe I did to Tom, however, there's a lot more than you'll ever understand,\" she said.\n\nThe judge also heard from five of Merriman's loved ones.\n\nPatrick Merriman, Tom's brother, grew emotional as he spoke. \"I think about Tom every day,\" he said. \"And wonder how and why this heinous crime was committed. Everyone I knew loved Tom.\"\n\nOutside the courtroom, Janks' defense attorney Marc Carlos was asked why Janks never brought up the alleged abuse during the trial.\n\n\"It's because Jade has asserted she did nothing to cause the death of Mr. Merriman. Had she actually caused the death of him, that's something that goes toward a manslaughter [charge]. That's provocation,\" he said.\n\nCarlos said he will be filing an appeal on Janks' behalf.\n\nDuring her week-long trial, Janks said the nude photos were taken when she was between 16 and 26 years old.\n\nAfter finding them, prosecutors say she drugged Merriman and strangled him on December 31, 2020.\n\nHer defense argued he overdosed on sleeping pills in her car, and Janks hid the body under a pile of garbage next to his home because she didn't want to be blamed for his death.\n\nWATCH RELATED: Judge sentences Jade Janks to 25 years to life in jail for the murder of her stepdad\n\n\"What made the prosecutor's case was all the texts about kicking him in the car, he's waking up. I'm gonna bonk him over the head. Come help me take care of him,\" Von Helms said.\n\nShe said prosecutors used those texts to show Janks intended to kill him.\n\n\"His defense was the gentlemen, her stepfather, had taken pills before when he was in the car that night and had an accidental overdose because he died from that pill that he put in his mouth,\" she said.\n\nMerriman was a prominent North County businessman who co-founded Butterfly Farms in Encinitas.\n\nAfter over a day of deliberations, the jury ultimately found Janks guilty.\n\nOn the last day Merriman was seen alive, Janks picked him up from a medical facility and by this point, prosecutors allege she already had a plan in motion to kill Merriman with the assistance of a man prosecutors identified as a \"fixer.\"\n\nJanks testified during the trial that she understood that the fixer worked in security and she wanted his protection while she confronted Merriman about the naked pictures.\n\nAfter picking up Merriman on Dec. 31, Janks was accused of texting the fixer, \"I just dosed the hell out of him\" before stopping at a shopping center to buy items prosecutors allege were used in the killing.\n\nWhen the fixer was unable to come out to Solana Beach that day to assist in the murder, prosecutors alleged he sent a friend of his instead.\n\nWhen that friend arrived, Janks was accused of telling the man, \"I want you to strangle him and then bring him into the house. I'll take care of the rest.\" The man did not want to get involved and left, Deputy District Attorney Jorge Del Portillo told jurors.\n\nProsecutors allege Janks next contacted a friend of hers. After he arrived, Janks allegedly told him that she had killed Merriman and wanted help moving the body. Prosecutors say he also left, then called police the next day.\n\nDel Portillo said Monday that Janks then used either a grocery bag or a pillowcase to suffocate a dosed-up Merriman. When that didn't kill him fast enough, she used her bare hands to strangle him, the prosecutor said.\n\nJanks testified during the trial that Merriman was heavily intoxicated following his discharge from the medical facility and she had reached out to others for help moving him into her home. When she was unable to move him on her own, she left him in her vehicle to sleep it off.\n\nOn the morning of Jan. 1, she said she moved the car to Merriman's house, then realized he was dead after he was cold to the touch.\n\nWhen asked why she didn't call 911 at that point, Janks testified that she was scared that she would be blamed for killing Merriman. In a panic, she tried to move him into a wheelchair to take him inside but his body fell onto the driveway, she testified.\n\nNot wanting a neighbor to see, she said she piled empty boxes and other debris on top of Merriman to keep him concealed until she could figure out what to do.\n\nJanks was pulled over by a police officer later that day and texted the fixer, \"Lose my number. I'm getting pulled over.\" Janks testified she wrote that text because she did not want the man to be unfairly suspected by the police.\n\nOn Monday, Carlos said there was \"some conduct\" that occurred between Janks and Merriman during her teenage years, which the attorney said affected her reaction to the prospect of Merriman returning home from the medical facility and realizing she had discovered the pictures on his computer.\n\nCarlos said there were family members and friends she could have relied upon for help, but she \"panicked.\"\n\nJanks told Superior Court Judge Robert Kearney on Monday that Merriman \"exerted influence\" upon her after coming into her life at an early age. She alleged that influence eventually \"manifested\" into coercion and psychological manipulation.\n\nRegarding the days surrounding Merriman's death, Janks said, \"I'm sorry I didn't act the way I was supposed to that day. I think about it every day since.\""
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LnRyYXZlbGFuZGxlaXN1cmUuY29tL3RyaXAtaWRlYXMvYmVhY2gtdmFjYXRpb25zL2JlYWNoZXMtaW4tc2FuLWRpZWdv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Mar 2023 08:00:00 GMT",
        "title": "The 15 Best Beaches in San Diego - Travel + Leisure",
        "content": "Surfers and sun worshippers alike flock to San Diego for its breathtaking SoCal vibes and miles of coastline, making it a popular destination for a beach getaway.\n\nSan Diego has no shortage of incredible beaches — which can make it nearly impossible to pick just one or two to see during a trip to this West Coast city. But the top beaches in San Diego stand out because they're so much more than attractive shorelines.\n\nWe looked at beach destinations that had fun things to do like boardwalks with shops and restaurants; excellent kayaking, surfing, or paddleboarding; or other unique diversions. We scoured the entirety of San Diego County, from surf haven Encinitas to the southernmost beach in the state, to find the very best stretches of coast for you to lay our towel on.\n\nIf you thought California couldn't live up to its hype, just check out one of these 15 incredible beaches in San Diego.\n\nSolana Beach\n\nThomas De Wever/Getty Images\n\nBeach bums beware: Solana Beach, located in San Diego's North County, is made for walking. With seemingly endless miles of scenic trails, waterfront parks, and the Cedros Design District full of antique and vintage shops, you’ll get your steps in at this popular beach town. Surfers head straight toward Seaside or Fletcher Cove — the former has a popular outer reef, and the latter has an exposed beach break. Start the day with a Norwegian smoked salmon bagel from Claire’s on Cedros and after a few hours of exploring natural tide pools and traversing the wide shoreline, pop over to Sindi’s Snack Shack across from Fletcher’s Cove for a kimchi quesadilla and bubble tea.\n\nCardiff State Beach\n\nAdrian Rudd/Travel + Leisure\n\nThis sugar-sand beach gently slopes into warm Pacific waters with swells so good, you’ll find pro surfers like Rob Machado riding the waves near Cardiff Reef. The surf competition venue is also home to the six-foot bronze surfer sculpture, the Cardiff Kook — a perfect photo op for your Instagram story. Non-surfers can explore the tide pools full of starfish, sea snails, and other sea creatures, or spend the day snorkeling, diving, spear fishing, paddle boarding, or swimming (just beware of rip currents). Comb the wide, palm-dotted beach for shells and enjoy the classic California views at this little slice of paradise.\n\nLa Jolla Beach\n\nAshok Sinha/Getty Images\n\nThe jewel in the crown of San Diego’s gorgeous coast, La Jolla is a collage of sea cliffs, reefs, hidden coves, and sand the color of brown sugar. The coastline curves into La Jolla Cove where kayakers can explore sea caves and the calm waters are perfect for swimming and snorkeling in the fish-rich bay. Walk over to the Children’s Pool where the cove is ringed by a concrete breakwater wall and has become a gathering spot for local seals and sea lions. Take the stairs from La Jolla Cove up to Scripps Park to find bathrooms, picnic tables, and gazebos for appreciating the picture-perfect Pacific views.\n\nMission Beach\n\nArt Wager/Getty Images\n\nThe shriek of a roller coaster, rollerblades clacking down the boardwalk, and the ding of arcade games create the backdrop for your day at Mission Beach. The lively coastal spot is home to Belmont Park where visitors can get the most of their unlimited ride wristband on the 1925 Giant Dipper wooden rollercoaster, slide behind the wheel of a bumper car, or play a round of mini golf. Surf, sunbathe, or join a game of volleyball on the wide, white shore; cast a line off of the Mission Bay jetty; or, rent a sailboat to get out on the sparkling sea. Grab a hot dog or a pineapple soft serve from a street vendor, or snag a cabana at Beach House for street tacos and margaritas. The party continues into the night when the beach bars and live venues are crawling with revelers.\n\nPacific Beach\n\nKelly Griffin/Travel + Leisure\n\nA crescent of sand fringed by a lively boardwalk and bisected by Crystal Pier, Pacific Beach is a SoCal wonderland just south of La Jolla. P.B.’s sand is thick, soft, and the color of a cloud; the sea is as calm and clear as a lagoon; and the beach is alive with locals and tourists as far as the eye can see. Sunbathe by the pier, surf the gentle waves at Tourmaline Surfing Park, or grab an icy pina colada from one of the trendy beach bars. Tuck into an egg burrito at Kono's Cafe at the pier before the day is through, when the glow from both bonfires and neon signs light up the night as bar hoppers descend for the area’s famous nightlife.\n\nSunset Cliffs\n\nWirestock/Getty Images\n\nGlimpse Pacific blues through the arch over the swimming hole at the appropriately named Sunset Cliffs. With rugged bluffs and sweeping views, this park on the Point Loma peninsula is a great place to explore California's natural landscape. The golden shore, cut from the steep, sun-tanned incline, is bookended by massive salt-sprayed rocks and overseen by wide ledges. Explore the sea life of the intertidal area, watch the sky change into a watercolor painting as the sun melts into the horizon, and walk along the dramatic cliffs and caves.\n\nOcean Beach\n\nSeoulArtist/Getty Images\n\nNorth of Point Loma, this San Diego town of surf shops and taco stands is fronted by its namesake beach, popular with sunbathers and surfers. Experience classic SoCal from the skaters on the pier to the burgers and shakes at Hodad's on Newport Avenue. Cool off in the surf and catch some sun on the soft shore the color of a perfect piece of toast.\n\n\n\nTorrey Pines State Beach\n\nLauren Breedlove/Travel + Leisure\n\nTake the 101 north from La Jolla to get to this popular beach that’s enhanced by a natural reserve park and a famous golf course. From the high path, you’ll walk along the park’s trails through pine forests, over cliffs hanging into the sea (perfect for whale watching), and past sandstone canyons. Meanwhile, the low road takes you to the Torrey Pines State Beach, resplendent in sandy shores, lagoons, surf breaks, and even a nudist or two on the south end.\n\nCoronado Beach\n\nTobiasjo / Getty Images\n\nMany California beaches are silver screen stars in themselves, but there’s something especially cinematic about Coronado, home to the rust-roofed Hotel del Coronado, featured in the Marilyn Monroe film “Some Like it Hot.” The Queen-Anne-style resort watches over the shore where the sand itself sparkles with mineral mica. Wade into the gentle waters full of swimmers, paddle boarders, and surfers, or, when you're not exploring the beach’s salty tide pools, join a seaside volleyball game. Stretch your legs by popping into the Orange Avenue shops, or grab a chair on the hotel’s Sun Deck for a Some Like it Blonde ale alongside your ocean view.\n\nMoonlight State Beach\n\nSherry Smith/Getty Images\n\nLocals used to come to this Encinitas beach for moonlit, midnight picnics, but modern-day visitors will find just as much to enjoy at midday. The beach gradually shelves into the bright blue water, full of swimmers and fishermen. Float in the saltwater offshore, watch surfers ride the waves, or walk along the wide, soft beach. The blunt sounds of volleyball games and the crash of Pacific waves breaking against the shore soundtrack your sunny afternoon. When you need to cool off, visit the snack bar for a cold drink, and watch as bonfires pop up along the coast once the sun disappears into the western sky.\n\nGrandview Beach\n\nDOUGBERRY/Getty Images\n\nThis narrow spit backed by high bluffs is one of the northernmost beaches in Encinitas. Best known as a surf beach, the shore all but disappears at high tide, but the views and swells are well worth the trip for those so inclined. (During low tide, however, the long stretch makes a picturesque walk along the Pacific.) Take a sandy set of stairs down to the uncrowded shore where you’ll find glassy waters and rugged cliffs overgrown with iceplants and palms and topped by coastal condos. Known for its friendly, easy-going surf crowd, Grandview is accessible to surfers of all levels with mellow waves that arrive nonstop from any swell direction. Waves break over the beach and the outer reefs and because of the slower swells, longboards are recommended.\n\nBeacon's Beach\n\nArt Wager/Getty Images\n\nSouth of Grandview, along the same long stretch of shore, sits Beacon’s Beach, or Leucadia State Beach. Descend a skinny, cliffside trail with three switchbacks down to this small strip of sand. The trek means that once you get there, you’ll have plenty of room to yourself on the popular but sparsely-populated beach. The spot is a good place for picnicking, sunbathing, and swimming. As with its northern counterpart, Beacon’s Beach attracts surfers looking to ride its gentle swells. When you get hungry, follow the surfers to Pannikin Coffee and Tea, an institution serving fresh pastries and hot coffee since 1968.\n\nDel Mar North Beach\n\nGetty Images\n\nThis Del Mar beach — also known as \"Dog Beach\" — needs to be on every dog owner’s radar. North Beach, just south of Solana Beach, allows your furry friend to run off-leash from Labor Day to mid-June. (Note that dogs must be under voice control and wear a license on their collars.) Take your dog on an exploration of the white, sandy shore and sandbars, or a walk along the trail up to an overlook at James Scripps Bluff Preserve. The shallow waters of the San Dieguito River Lagoon are a refreshing place to cool off, or you can watch surfers ride the swells north of the river’s mouth.\n\nSan Onofre State Beach\n\nHeather Broccard-Bell/Getty Images\n\nThree miles south of San Clemente lies the amber line of San Onofre. The 3,000-acre state park welcomes almost 2.5 million surfers, swimmers, and sunbathers a year. The beach is backed by the craggy San Onofre bluffs, anchored by the San Mateo Campground, and fed by a world-renowned surf beach. Bring binoculars and a camera for the birds, whales, dolphins, and sea lions that frequent this coastal paradise. The area was once the site of the indigenous village of “Panhe” inhabited by the Acjachemen people as far back as 8,000 years ago. Today, the Acjachemen tribe conducts educational and ceremonial events in a small designated area within the San Mateo campground, about four miles from the beach.\n\nImperial Beach\n\nJon Bilous/Getty Images\n\nVisit the southernmost beach in California — we’re talking a mere five miles from the Mexican border — to surf, swim, and sunbathe the day away. With palm trees, a wide, flat beach, and whitecaps, this is classic California. Horseback riders gallop past volleyball games and fishers on the pier, where you’ll find waterfront restaurants and grassy parks. The Tijuana River’s freshwater mixes with the salt water of the Pacific at the Tijuana River National Estuary where you can explore the largest saltwater marsh in SoCal as rare birds fly overhead. Over by the pier, the Outdoor Surf Museum’s art installations feature local surfing history. When one beach isn’t enough, take the bike path seven miles along the San Diego bay, past the salt flats, to Coronado."
    }
]