[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmJvbG5ld3MuY29tL2J1c2luZXNzLzIwMjMvMDkvc29sYW5hLXByaWNlLXByZWRpY3Rpb24tY2FuLXNvbC1yZWFjaC0xMDAwLXdpdGgtdmlzYS1wYXJ0bmVyc2hpcC_SAW5odHRwczovL3d3dy5ib2xuZXdzLmNvbS9idXNpbmVzcy8yMDIzLzA5L3NvbGFuYS1wcmljZS1wcmVkaWN0aW9uLWNhbi1zb2wtcmVhY2gtMTAwMC13aXRoLXZpc2EtcGFydG5lcnNoaXAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Sep 2023 07:00:00 GMT",
        "title": "Solana Price Prediction: Can SOL Reach $1,000 With Visa Partnership? - BOL News",
        "content": "Solana (SOL) has climbed 1% in the last 24 hours to $19.77 after Visa stated that it would expand its stablecoin pilot to include the Solana blockchain.\n\nDespite this excellent news, SOL is down 8% in a week and 14% in the previous 30 days, despite the fact that the altcoin is up 98% since the beginning of the year.\n\nAnd the Visa news paves the path for additional gains in the coming days and weeks, with SOL’s oversold position indicating that it is due for a significant comeback very soon.\n\nSolana Price Prediction as Excitement Around VISA Partnership Grows!\n\nSolana’s positive Visa-related news comes at an opportune time for SOL’s chart, with its signs indicating that a sustained rebound is on the way.\n\nAdvertisement\n\nSOL’s relative strength index (purple) has been hovering just below 40 for the past few weeks, indicating that the coin has been oversold and is currently discounted relative to previous months’ levels.\n\nFurthermore, the coin’s 30-day moving average (yellow) is about to fall below its 200-day moving average, a move that typically indicates that a recent slide has bottomed out and that a certain asset is about to rise again.\n\nThis viewpoint is confirmed by the fact that SOL’s support level (green) has risen in recent days, signalling that the coin is unlikely to fall lower in the near future.\n\nIndeed, the Visa news has acted as a catalyst for SOL’s apparent rebound, with the card and payments giant saying yesterday that it will include the Solana blockchain in its stablecoin pilot, as well as collaborating with Worldpay and Nuvei as part of Solana’s participation in the pilot.\n\nTo stay informed about current events, please like our Facebook page https://www.facebook.com/BOLUrduNews/.\n\nAdvertisement\n\nFollow us on Twitter https://twitter.com/bolnewsurdu01 and stay updated with the latest news.\n\nSubscribe to our YouTube channel https://bit.ly/3Tv8a3P to watch news from Pakistan and around the world.\n\nAlso Read Doge Price Prediction: Today’s Dogecoin Price, 7th Sept 2023 Doge price prediction – Here’s the latest Doge price prediction and Doge TO USD converted..."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMirwFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vdG9uY29pbnMtbWV0ZW9yaWMtcmlzZS1kcml2ZW4tYnktdGFsaS1haS10b251cC1vcHR1cy1kZXgtYWdncmVnYXRvci1hbmQtZ2F0dG8tY2FuLXRvbi1wcmljZS1yZWFjaC0yLWFuZC1zdXJnZS1iZXlvbmQtdHJvbi10cngtYW5kLXNvbGFuYS1zb2wv0gG1AWh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS90b25jb2lucy1tZXRlb3JpYy1yaXNlLWRyaXZlbi1ieS10YWxpLWFpLXRvbnVwLW9wdHVzLWRleC1hZ2dyZWdhdG9yLWFuZC1nYXR0by1jYW4tdG9uLXByaWNlLXJlYWNoLTItYW5kLXN1cmdlLWJleW9uZC10cm9uLXRyeC1hbmQtc29sYW5hLXNvbC8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Sep 2023 07:00:00 GMT",
        "title": "Toncoin’s Meteoric Rise Driven by Tali AI, TonUp, Optus DEX Aggregator, and Gatto – Can TON Price Reach $2 and Surge Beyond TRON (TRX) and Solana (SOL)? - Crypto News Flash",
        "content": "A handful of projects have been approved by the TON network as it seeks to improve upon its existing structure.\n\nThe five projects chosen by Ton will go on to integrate innovative solutions into the ecosystem.\n\nThe Ton network has revealed that a handful of projects have been selected to help strengthen the Ton network. These grants make up the first round of projects approved for the third quarter of 2023, approved by the TON Foundation.\n\nThese projects, five in total, are considered to be the most promising products as they collectively open the door to a more sustainable and efficient structure for TON. These projects are poised to bring innovative solutions and add significant value to the entire TON community. These projects, as listed on the official announcement blog post, include Tali AI, the Ledger app for TON, TonUp, Optus DEX Aggregator, and Gatto.\n\nTali AI is an intelligent, AI-driven model. The tool is designed to strengthen developer relations, support, and community management. Tali is designed to quickly answer developers’ queries and questions by analyzing developer documents, Slack conversations, and YouTube videos. The tool also scans chat messages for seamless knowledge integration and insight delivery.\n\nThe implementation of this bot can change the game for the TON network and its users in the long term. Most notably, integrating the bot into the TON network would result in a significant improvement, in the onboarding process for new builders, entering the TON ecosystem, as well as technical support initiatives.\n\nTonUp, Optus DEX, and Gatto are promising additions to the TON network\n\nThe Ledger app for TON is another promising project that seeks to integrate the latest Ledger Sfax device. This will in turn enhance compatibility and security. The app also supports NFTs and Jetton transfers, which will provide users with more functionality. Improving the TON Connect support will make it possible for secure interactions to be carried out with third-party services.\n\nOn the other hand, TonUp is a permissionless launchpad running on the TON ecosystem. It seeks to provide instruments that will provide support through the entire project launch journey.\n\n“By offering these critical functions, the team aims to nurture and drive the growth of projects built on the TON network, ultimately generating broader recognition and adoption for the entire ecosystem.” The blog post asserted.\n\nAdditionally, the Optus DEX Aggregator is another powerful tool designed to enhance decentralized trading on the TON and Blockchain network. The tool also can consolidate liquidity from multiple DEXs as it optimizes trade execution while reducing price impact.\n\nLastly, Gatto, which holds the position as the first P2E game on the VK Mini Apps platform, utilizes the TON blockchain to create NFT pets and pays out tokens/TONs to users who actively play and develop their Gattomons.\n\nRecommended for you:"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2xpZ2h0c3BlZWQtdmlzYS1iYW5raW5nLXNvbGFuYS1zdGFibGVjb2luLXNldHRsZW1lbnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Sep 2023 07:00:00 GMT",
        "title": "Solana offers solutions to banking's 'bizarre inefficiencies,' says Mumtaz - Blockworks",
        "content": "Talking to the average person on the street about “still” being in crypto, Garrett Harper says he mostly hears expressions of sympathy for his predicament.\n\n“I feel sorry you’re still there.”\n\nBut Harper insists plenty of positives are still to be found in the space, including the recent news that Visa — the largest payments processing network in the world — is expanding their stablecoin settlement tech to the Solana network.\n\n“It’s not just good for Solana,” Mert Mumtaz, co-founder of RCP company Helius, says. “It’s good for crypto.”\n\nOn the Lightspeed podcast (Spotify/Apple), the co-hosts talk about how Visa’s expansion of stablecoin settlement capabilities to Solana is a “no-brainer.”\n\nA few months ago, Mumtaz says he learned of Visa piloting a number of use cases for the Ethereum blockchain. On X, formerly Twitter, Mumtaz posed the question, “Why aren’t they using Solana for this?”\n\n“I’ve worked in all kinds of different stacks of the payments infrastructure and engineering,” he says, and Solana seemed like an obvious choice to him.\n\nReplies promptly followed, one in particular suggesting Mumtaz was delusional to imagine Solana was even a viable option for Visa to consider. As soon as Mumtaz saw Visa’s announcement post on X, he says, “I went back to that tweet and then I replied with it. So that was fun.”\n\nBizarre inefficiencies in the banking system\n\nIn the legacy banking system, sending money internationally requires multiple “hops,” Mumtaz says, with each step encountering fees and varying regulatory barriers. “There are pretty bizarre inefficiencies with that system,” he says. “If you use Solana for something like this, you basically pay no fee.”\n\n“Solana’s average fee is 0.00025 dollars,” Mumtaz says, “and the blocks finalize in 400 milliseconds. It’s open 24/7 (‘hopefully,’ he adds).”\n\n“Not only is it better for the merchants who can now get paid instantly instead of having the money wait in their acquirer account,” he says, “but it’s actually good for Visa because now they can save money.”\n\nMumtaz’s favorite part of the story, however, is seeing Solana receive validation from the leading payments provider in the world after being “through the ringer” following the FTX fiasco.\n\n“We always knew [the technology] would work with things like this and would enable those cases,” Mumtaz says. But Solana needed “pioneers in the field to get the stamp of approval.”\n\n“And that’s essentially what Visa has done here.”\n\nThe move acts as a “social signal,” Harper says, giving other companies the “thumbs-up” to go ahead with their potential projects. He notes that most applications will likely be at the business-to-business (B2B) level, at least initially, before reaching the retail level.\n\n“At some point,” he says, “you want to get where normal people like me and you are holding onto USDC and having a reason to spend actually at the point of sale level. That would be like if I go buy, I don’t know, a t-shirt, I’m actually using USDC.”\n\nThis sort of transaction would happen “behind the scenes,” Harper says, where Visa facilitates stablecoin payments to merchants if they decide to opt in for advantages such as lower fees and faster settlement speeds.\n\n“This is [the] backend that’s setting everything up.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNyeXB0b2dsb2JlLmNvbS9sYXRlc3QvMjAyMy8wOS90b3AtdGVjaC1yZXZpZXdlci1ta2JoZC1vbi1zb2xhbmEtbW9iaWxlcy1zYWdhLWNyeXB0by1waG9uZS1kb250LWJ1eS1pdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Sep 2023 07:00:00 GMT",
        "title": "MKBHD's Hard-Hitting Review of Solana Mobile's Saga - CryptoGlobe",
        "content": "Background\n\nSolana Mobile, a subsidiary of Solana Labs, entered the smartphone market with its crypto phone, the “Saga,” in April 2023.\n\nA crypto phone is a specialized smartphone designed with enhanced security features to facilitate secure communications and transactions in the world of cryptocurrencies and blockchain technology. Initially priced at $1,000, the Saga’s price was reduced in August 2023 to “bring more people into the ecosystem.”\n\nNow is the perfect time to switch to Saga.\n\n\n\nOrder Saga here: https://t.co/4ZIEs6Z0D7 — Solana Mobile 🌱 (@solanamobile) August 9, 2023\n\nDeveloped in collaboration with OSOM, a company experienced in Android development for tech giants like Google, Apple, and Intel, the Saga aims to simplify and secure Web3 transactions and digital asset management, including cryptocurrencies and NFTs.\n\nThe device features a 6.67-inch OLED display, 12 GB RAM, 512 GB storage, and runs on the flagship Snapdragon® 8+ Gen 1 Mobile Platform. Unique to Saga is the Solana Mobile Stack (SMS), a suite of custom add-ons that integrate crypto functionality into the phone’s hardware and software. The phone’s secure element, known as the “seed vault,” stores private keys separately from other data, enhancing security.\n\nAdditionally, Saga offers a custom “dapp” store with a curated list of crypto applications. Solana has committed to not imposing “extractive fees” on dapp store apps, contrasting the 30% fee charged by Apple and Google.\n\nWhen first introducing the phone, Anatoly Yakovenko, co-founder of Solana Labs, stated that Saga aims to set a new standard for the Web3 experience on mobile devices.\n\nMKBHD’s Review\n\nHistorical Context and Build Quality\n\nMarques Brownlee, widely known as MKBHD, begins his review by tracing the Saga’s lineage back to the Essential Phone, a promising but ultimately unsuccessful venture launched in 2017. The Essential Phone’s team later formed OSOM, which collaborated with Solana to create the Saga. Brownlee lauds the phone’s build quality, mentioning its matte stainless steel frame, colored titanium buttons, and ceramic back. However, he also notes that the device is heavy, weighing around 250 grams.\n\nSpecs and Performance\n\nMKBHD pointed out that despite its premium build the Saga’s specs are average. He said that it features a 6.67-inch flat 1080p 120Hz display, a 4,100 milliamp-hour battery, and mediocre cameras. The device runs on last year’s Snapdragon 8+ Gen 1, with 12 GB of RAM and 512 GB of storage. Brownlee suggests that these specs do not justify the phone’s initial $1,000 price tag, which likely contributed to its price reduction.\n\nCrypto Features\n\nMKBHD then focused on the Saga’s crypto-centric features, highlighting three main aspects: the Solana Mobile Stack (SMS), the Seed Vault, and the Dapp store. According to MKBHD, the SMS serves as an SDK that allows apps to connect exclusively to the Solana blockchain. This feature limits the phone’s utility for users interested in other blockchains like Bitcoin or Ethereum. He also mentioned the Seed Vault, which provides a secure environment separate from the Android OS for storing a 24-phrase seed. Lastly, MKBHD pointed out that while the Dapp store is unique, it is not exclusive to the Saga and will be available on other devices.\n\nFinal Thoughts\n\nBrownlee concluded by questioning the Saga’s value proposition, especially given its price drop and niche crypto features. He argued that even at the reduced price, there are better options available in the market. Brownlee’s final verdict resonated with his video title, advising most people to steer clear of the Saga, as it offers limited appeal beyond its niche crypto functionalities.\n\nCompanies like HTC with their Exodus phone, Sirin Labs with the Finney, and Samsung with blockchain features in some of their Galaxy models have ventured into creating crypto phones. These phones aim to provide a secure and convenient way for users to manage their digital assets and engage with blockchain technology. However, they often come at a premium price compared to regular smartphones."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3Lmdpem1vdGltZXMuY29tL2Jsb2NrY2hhaW4vY3J5cHRvY3VycmVuY3kvbWFycXVlcy1icm93bmxlZS1jcnlwdG8tcGhvbmUtdmlkZW8tcmVhY3QvNDYxNjHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 08 Sep 2023 07:00:00 GMT",
        "title": "I dissect the \"Marques Brownlee Crypto Phone (Solana Saga)\" video - Here's what I feel - Gizmo Times",
        "content": "Okay, I’ve been into the smartphone industry testing smartphones, talking about the ins and outs, the pros and cons, and have attended almost all of the world’s largest events to get exclusive early access to the products that are going to launch throughout the year. I’ve attended CES for years, MWC for years, and have run a YouTube channel making videos about smartphones and tech for over a decade.\n\nWatch the video if you missed it.\n\nSo, what I am gonna dissect here from the video that Marques Brownlee made is going to be easy because I belong to both the industries – Tech, and Crypto. Okay, so firstly, I am a fan of MKBHD (for those who don’t know, he was MKBHD before changing it to his actual name on the channel) and have met him once at one of the CES events, and I love the work he does in terms of the video quality. But, the Solana Saga phone video is something where I wouldn’t agree with a few thoughts of his.\n\nAt the beginning of the video, Marques says “I have been notably skeptical on Crypto, Web3, Blockchain, and Metaverse.” So, he’s biased. It’s clear and he agrees to it. So, take a few points of his with a pinch of salt. Because you know the bias makes you say things you wouldn’t have said otherwise if you were completely unbiased.\n\nNext, the phone launched at $1000, yep, but the current price is at $599 and it isn’t a temporary price drop too. It’s now the actual price so you have to mention that because otherwise, the assumption would be of this still being priced at $1000. Also, the ones who had got the phone at $1000 got the Clayno Saga NFT minted for themselves and it was easily around 20 SOL at the floor, which converts to about $400, so the price was never $1000 if you just went on to a marketplace and sold your NFT. I mean, this was to be mentioned but wasn’t. Apart from this, there were a few other rewards for the buyers, including Free BONK for Saga users, Saga-only sticker pack on Dialect, One month of free access to Helium Mobile (for users in the U.S.), Audius Exclusive music for Saga users, 50 HXD and automatic Beemium upgrade on Honeyland, and Genopets Early access and free toy for Saga users.\n\nI liked the fact that Marques explains the entire backstory of how the Solana Saga phone came into existence. From the Essential Phone to OSOM to the phone, he’s talking about in the video.\n\n“So okay, outside of those things, this OV1 or Solana phone is a very average Android phone”. Honestly, despite this having last year’s flagship Qualcomm chipset, it isn’t an average Android phone. It has 12 gigs of RAM, 512 GB storage, a 6.67-inch 120Hz Full HD display, 4100 mAh battery with wireless charging support. I mean, bring in a few competitors in the current pricing and you’d see these specs being quite good because even with the RAM and ROM, the other phones would have their top models with higher prices offering those. I agree with the camera part because I trust Marques with his camera samples and the sensors alone can’t do the job, and I am sure it isn’t the Pixel-grade software optimizing the pictures over here.\n\nHe mentions “$1000” several times, before finally at 6:00, he talks about the price plummeting down to $600. For the attention span of people who are into these kinds of stuff, the initial impression already makes people leave the video assuming that the price is still $1000 and they’d never bother to check the current pricing.\n\nOkay, here’s where I agree with Marques.\n\nThe crypto features. I mean, except for the seed phrase storage (which I could actually write down and keep it safe otherwise anyway), the dApp store, and Solana Mobile Stack SDK are not something that makes people go run and buy this device. I mean, the dApp store is just another store allowing you to download the apps that are available on the Play Store too.\n\nThe USB cable is a cool one. The one that lets you choose whether to transfer only power or also send and receive data. That’s a well-thought-out feature inclusion inside of the cable. Marques mentions that the cable is available for $30 on Amazon so isn’t that special, I’d argue here that it’s only the Solana Saga phone that is giving this cable inside the box so that the users stay safe or understand the importance of it.\n\n“At best, ahead of its time, but at worst, completely useless to most everyday people”. Umm, it’s not both. Not ahead of its time, but with a bit more feature additions to it, it’d be called right on time. It isn’t completely useless because even if we cannot really count the number of Solana users who trade NFTs in their ecosystem each day, the ones who do would see this at 30 SOL given the current price and get a piece of hardware that makes it easy for them to catch up on things while they are traveling when they don’t access their PCs, and I agree that it’s a niche product, but it does have its set of use cases. In crypto, market conditions decide a lot on what users would want to ape into, or not. That’s the case with Solana Saga, entering the market when the conditions aren’t favorable, I feel.\n\nThe only thing I’d be skeptical about here is how the software updates and feature additions would play out. For the current set of features, at some point, the user who is using this phone as a secondary one would question themselves on the need for it, but if there are regular additions of new and useful apps, and better usage of the SDK to bring in more integrations, maybe this is a perfect device for the Solana users.\n\nSo, why Marques making this video is still a good thing for Solana?\n\nI’d say, it isn’t only good for Solana but for Crypto as a whole. He has the title “This is a Crypto Phone” and doesn’t mention Solana, but whatever the pros and cons he mentions, it reaches people who have ignored crypto as a whole for a long time. A video from one of the most influential voices in the tech world would be what we call “bullish” for the crypto space, not the other way around, even if he asks you not to buy the phone.\n\nAlso, who knows, maybe there might be a refresh or a next-gen device in the future (I am not expecting it based on the story of Essential Phone), and Marques might have to revisit and feel a bit more positive if the refresh brings in features that makes one actually want to use it more. Just a hope, but as I said, people from the non-crypto space who have a big voice talking about Crypto hardware are bullish, irrespective of how they feel about it.\n\nI’m glad that Solana Saga was mentioned at all, and a whole video is an even bigger cause to be glad!\n\nSource for featured image: Marques Brownlee"
    }
]