[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzI1L3NvbGFuYS1saXF1aWQtc3Rha2luZy10b29sLW1hcmluYWRlLWxvb2tzLXRvLWJvbHN0ZXItaXRzLXRva2VuLXZhbHVlLXdpdGgtc3Rha2VkLXNvbC1jYXB0dXJlL9IBjQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzI1L3NvbGFuYS1saXF1aWQtc3Rha2luZy10b29sLW1hcmluYWRlLWxvb2tzLXRvLWJvbHN0ZXItaXRzLXRva2VuLXZhbHVlLXdpdGgtc3Rha2VkLXNvbC1jYXB0dXJlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Jan 2023 08:00:00 GMT",
        "title": "Solana Liquid-Staking Tool Marinade Looks to Bolster Its Token Value With Staked SOL Capture - CoinDesk",
        "content": "“Marinade can push it to a point, but in the end, we both want other ecosystem actors to have MNDE and sit at the governance table, and we want them to integrate tightly with mSOL and have as many use cases as possible, to be a credible alternative to SOL.”"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzI1L3NvbGFuYS1saXF1aWQtc3Rha2luZy10b29sLW1hcmluYWRlLWxvb2tzLXRvLWJvbHN0ZXItaXRzLXRva2VuLXZhbHVlLXdpdGgtc3Rha2VkLXNvbC1jYXB0dXJlL9IBjQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzI1L3NvbGFuYS1saXF1aWQtc3Rha2luZy10b29sLW1hcmluYWRlLWxvb2tzLXRvLWJvbHN0ZXItaXRzLXRva2VuLXZhbHVlLXdpdGgtc3Rha2VkLXNvbC1jYXB0dXJlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Jan 2023 08:00:00 GMT",
        "title": "Solana Liquid-Staking Tool Marinade Looks to Bolster Its Token Value With Staked SOL Capture - CoinDesk",
        "content": "“Marinade can push it to a point, but in the end, we both want other ecosystem actors to have MNDE and sit at the governance table, and we want them to integrate tightly with mSOL and have as many use cases as possible, to be a credible alternative to SOL.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vZ2hhbmFmdW8uY29tL3doeS1kb2VzLXN6YS1jYWxsLWhlcnNlbGYtc3phL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Jan 2023 08:00:00 GMT",
        "title": "Why does SZA call herself SZA? - Ghanafuo.com",
        "content": "Despite sharing a similar name, however, SZA was never actually affiliated with RZA nor GZA. “Sza is not related to RZA or the wutang clan. She’s not part of the all woman reboot either,” one fan sarcastically tweeted.\n\nStill, the R&B singer seems to share a friendly relationship with RZA. In 2017, the Wu Tang Clan member assisted SZA by announcing her debut album, “CTRL,” via an official promo video.\n\nWhy does SZA call herself SZA?\n\nAlthough SZA’s stage name was partly inspired by the Wu-Tang Clan members, it actually comes from her first name.\n\nAs she told Genius in 2017, her stage name is short for Solana. “It just kinda like stumbled on me, cause my name is Solana,” SZA explained. “People called me Sos for short, which comes from Sosa.”\n\nApparently, the singer took inspiration from the Supreme Alphabet, popular among the Five-Percent Nation, as did RZA. “Like, The RZA is Rulers, Zig-zag, Allah,” she told “The Breakfast Club” that same year. “You have rulers like sovereignty over one’s self and the world around you.”\n\nShe continued, “S is the supreme alphabet stands for ‘savior,’ but that didn’t sit right with me, so I switched it to either ‘sovereign’ or ‘savior,’ however you feel.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiKGh0dHBzOi8vd3d3LmFzaWFjcnlwdG90b2RheS5jb20vYWJjLW5mdC_SAShodHRwczovL3d3dy5hc2lhY3J5cHRvdG9kYXkuY29tL2FiYy1uZnQv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Jan 2023 08:00:00 GMT",
        "title": "What is ABC NFT? - Asia Crypto Today",
        "content": "The world of non-fungible tokens (NFTs) is constantly evolving and expanding, and one of the latest projects to make a splash in the community is ABC. In this article, we will explore what ABC is and what makes it unique in the web3 space.\n\nBackground\n\nThe concept of immutable art is not a new one. CryptoPunks on Ethereum was one of the first examples of this type of art living on the blockchain, and they have become an iconic and influential collection in the world of NFTs. However, there is one key difference between CryptoPunks and ABC: whereas CryptoPunks was created by a team, ABC is completely owned by the community.\n\nABC V3NTURES is a special group within the community of ABC NFT collectors. To gain access to this group, one must hold 30 or more ABC NFTs. The group represents the “whales” of the ABC community, meaning that they hold a significant portion of the total supply of ABC NFTs. The purpose of the group is to invest in initiatives and projects that bring the child-like creativity of the ABC collection to the market.\n\nThe group was founded with the vision of creating the best community of builders and art lovers in the NFT space. Since its inception, ABC V3NTURES has become one of the largest whale groups on Solana, supporting the ecosystem where possible. The group is dedicated to fostering the growth and development of the ABC collection and the Solana blockchain as a whole. The group is a powerful force within the community, and its members play a crucial role in shaping the future of the ABC collection and the NFT space.\n\nWhat is ABC NFT?\n\nABC is a collection of immutable art that lives on the Solana blockchain. This collection was listed on the secondary market for 1.23 $SOL, giving collectors the opportunity to choose the pieces of art they wanted to add to their collection. Unlike many other NFT collections, there is no official rarity to the ABC collection and there are also no royalties associated with it.\n\nThe vision of the original creators behind ABC was to create the most decentralized and immutable art collection on the Solana blockchain.\n\nABC is a CC0 Collection\n\nThe ABC collection is also CC0, which means that it is “No Rights Reserved”. This allows creators, scientists and owners of already copyrighted materials to waive any rights to the IP itself and place it into the public domain. This means that others can use the IP for any purpose they see fit without the restrictions of copyright law. This makes ABC permissionless to use and tie into another project.\n\nCommunity and Incentives\n\nSince ABC is completely owned by the community, every holder of ABC is equally empowered and incentivized to contribute to the ecosystem. Holders can do whatever they want with their ABC, whether it be adding it to their art collection, using it in another project, or even burning it.\n\nOne example of this is Asset Dash, which partnered with ABC to tap into its community by offering holder incentives. Other projects like Hadeswap, created by an ABC community member, are also aiming to offer benefits to collectors of ABC.\n\nHadeswap\n\nIn addition to the ABC NFT collection, users of the Solana blockchain have access to a new decentralized marketplace called Hadeswap. Hadeswap offers a way for users to trade NFTs on the Solana blockchain without the use of order books on a centralized exchange. This is similar to how Uniswap operates on Ethereum, providing an alternative to centralized exchanges like Magic Eden.\n\nHadeswap operates as an Automated Market Maker (AMM) which means that the protocol automatically adjusts the price of NFTs based on the most recent trade that has been completed. This allows for users to create liquidity pools and earn trading fees paid in SOL without having to lock up or stake any assets.\n\nUsers have the option of purchasing NFTs on Hadeswap in the traditional way, by browsing the available listings for a particular collection and selecting the NFT of their choice. Another option available is the creation of a “buy” pool. This allows users to dollar cost average (DCA) into a collection by setting a “spot” and “delta” price and depositing the amount of SOL needed to cover the buy orders that the pool represents. Every time the pool purchases an NFT from a seller, the price offered will decrease based on the “delta” set by the user.\n\nHadeswap also allows for the selling of NFTs, with users having the option of instantly selling for the best offer available from the pools for each collection or setting up a one-sided “sell” pool. This allows users to DCA out of a collection and receive more for each NFT that their pool sells. The user sets a “spot” and “delta” price and deposits the amount of NFTs they want their pool to offer for sale. Every time the pool sells an NFT, the price of the remaining NFTs in the pool will increase.\n\nConclusion\n\nIn conclusion, ABC is a unique and exciting project in the world of NFTs. Its decentralized and community-owned nature, as well as its CC0 status, sets it apart from other NFT collections. While it may not be the best choice for those looking for an investment opportunity, it offers incredible opportunities for art lovers and creators to build and contribute to the ecosystem in ways that are truly unique."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdGhlZW52b3l3ZWIuY29tL2V4cGxhaW5lcnMvdHJpcHR5Y2gtZW5kaW5nLWV4cGxhaW5lZC1hbGVpZGEtYWxpdmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Jan 2023 08:00:00 GMT",
        "title": "Triptych ending explained: Is Aleida dead or alive? - The Envoy Web",
        "content": "Triptych follows Becca, a forensics expert, who embarks on a journey full of perils and shocking revelations after discovering that she’s one of three identical triplets.\n\nWarning: This article contains heavy spoilers\n\nPlot summary\n\nRebecca Fuentes is a forensics agent whose life gets turned upside down when she finds that a dying woman knows her name and looks exactly like her. What follows this surreal turn of events changes the course of her life.\n\nSuspecting that woman to be her twin, Becca sneakily gets the DNA reports on her and the woman, and it’s a match. She pops the question to her mom who after some reluctance and dismissal, finally reveals some crucial details of her adoption process.\n\nMeanwhile, Becca investigates Aleida’s husband and breaks into his home, finding some photographs that reignite her befuddlement and her usual case of visions gets severe.\n\nRebecca’s life gets more surreal when her investigations lead to another woman who looks exactly like her. Tamara is a stripper and the third triplet, and she knows about Aleida and then some.\n\nMeanwhile, Captain Humberto Solana, who has been having an affair with Becca, continues to help her while his marriage with his pregnant wife gets progressively worse. He’s ultimately kicked out of home and begins staying with Becca, promising her to help with her case.\n\nTamara is enlisted by Eugenio to impersonate his late wife, in order to save their company from a hostile takeover. Becca continues searching for Tamara and eventually finds out what she’s up to. Meanwhile, Dr. Bátiz, who used to be Alieda’s shrink, volunteers to help Becca and Tamara out.\n\nBecca finds some disturbing evidence that links her origins to some Nazi experiments. Later on, the social worker who handed her over to her adoptive parents gets murdered.\n\nBecca becomes extremely cautious and entrusts Dr. Bátiz with the safety of her mother, while also looking for Tamara, who finally comes back from Eugenio’s captivity. Together with Humberto, the two sisters go to the safe house only to come across the biggest twist thus far.\n\nThe Triptych finale concludes with the villain going mask-off with their intentions, the triplets reuniting and defeating the antagonistic forces.\n\nTriptych ending explained in detail:\n\nWhat is Julia Bátiz’s experiment for?\n\nJulia Bátiz worked alongside Dr. Meyer in the 60s. He was a renowned doctor who experimented exhaustively on twins and triplets. However, when the media got to what he was doing, he shut up shop and ceased all his experiments, burying years of work in the process.\n\nJulia Bátiz didn’t want to stop so she moved to Mexico and eventually got put in charge of the psychiatric department at the Humanis Vita hospital by Dr. Bernardo Sáenz, who’d become her mentor later on.\n\nWith the resources and opportunities at her disposal, she’d go on to begin her experiments and her most crucial test subjects will end up being the triplets Aleida, Rebecca, and Tamara.\n\nThe three sisters are separated after a couple of months of living together after their birth. They were later adopted by families from three different socio-economic conditions.\n\nGrowing up, Bátiz would keep tabs on them continuously, even influencing their lives to the point that they all dated a psychologist one time during their lives. Meanwhile, she’d hire monitors who’d observe the sisters and influence them.\n\nHumberto was one of these monitors, and according to Bátiz, her most effective one. Bátiz would also go to extreme lengths to keep the broader family dynamics the same for all the girls.\n\nShe’d go on to have Tamara’s mother and Rebecca’s father killed after having Federico Trujano, Aleida’s father, killed for catching on to the experiment so that all three would be deprived of one of their parents.\n\nWhat was the purpose of the experiment?\n\nDr. Julia Bátiz is fascinated with the creator vs creation, the myths that deal with the concept. From Prometheus stealing fire from the gods to modern myths like Dr. Frankenstein’s Monster, Bátiz intends to answer a question.\n\nWhat really matters in the confirmation of personality — nature or nurture? That’s the question she wishes to answer through her experiment, which is why she sends the triplets, three genetically identical people, to families with different socio-economic conditions.\n\nAleida ends up with upper-class adoptive parents, Rebecca with middle-class ones, and Tamara with poor parents. Growing up, Julia tracks their development and keeps a record of them.\n\nAs to how the nature part influences the girls to have a metaphysical connection with one another, it’s left as an ambiguous, inexplicable phenomenon that stands opposite of the tried and tested experiments of Dr. Julia Bátiz.\n\nWho is the triplets’ biological mother?\n\nIt comes as quite a shock to Tamar and Rebecca during their captivity at the end of Triptych, when Dr. Julia Bátiz finally sheds the skin of her malicious person. She drops a couple of shockers on the siblings, from their origins to the purpose they were brought into existence.\n\nJulia Bátiz wanted to experiment on them and required a set of extremely identical test subjects. That’s why she came up with triplets, who were all grown, as she reveals, in a petri dish.\n\nThe surrogate mother used to give birth to these engineered triplets in the experiment was none other than Dr. Julia Bátiz herself. This means that Aleida, Rebecca, and Tamara’s biological mother have been Dr. Julia Bátiz herself.\n\nWhat happens to Aleida?\n\nLike her father, Aleida would catch on to Dr. Julia Bátiz and her experiment. She then becomes aware of her sisters and begins investigating them. However, Dr. Julia Bátiz’s solution to Aleida is to trigger her psychosis and prove her mentally unwell.\n\nShe even succeeds to a great degree, but when Eugenio takes Aleida out of Julia’s care at his wife’s request, Aleida takes no time to take revenge as she goes to kill her.\n\nHowever, Julia Bátiz manages to prolong her death, while having Aleida’s body swapped with another, a very similar body of a dead girl, even managing to fool Eugenio into thinking about his wife’s death when she was only in an induced catatonic state.\n\nAt the end of Triptych, Tamara, and Rebecca are shocked to learn that Aleida is still alive. Moments later, Aleida manages to escape her captivity and helps her sisters break out of their cells and fight the villains as well.\n\nTriptych ends with the triplets fleeing their captivity, Aleida reuniting with Eugenio and her mother, and getting proper medical care.\n\nWhat happens to Bátiz and Humberto?\n\nBátiz holds Aleida at gunpoint and there’s a brief standoff between her and the two other siblings. However, Triptych episode 8 shortly cuts to the triplets escaping the experiment facility.\n\nAleida meets Eugenio, and the sisters reunite with the mothers. Before the credits roll, it’s revealed that the sisters have trapped Dr. Julia Bátiz inside the basement of her facility. At the same time, the authorities fail to track her down.\n\nMeanwhile, the show also reveals what happened to Humberto Solana. On their way to the facility where the triplets are to be experimented on — a location that Eugenio had gotten traced — Humberto takes the car off course.\n\nEugenio catches on to the suspicious change in course and when Solana’s pregnant wife calls him while in labor, Eugenio takes advantage of the distraction, and the ensuing struggle between the two men results in the car crashing violently.\n\nWhile Eugenio survives the crash and goes to save the sisters, Humberto Solana is confirmed to have succumbed to the crash and died.\n\nAlso Read: 50 best Netflix thriller shows – Ranked (February 2023)"
    }
]