[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vZm9ya2FzdC5uZXdzL2RlZ29kcy1iZWdpbnMtbWlncmF0aW9uLXRvLWV0aGVyZXVtL9IBPWh0dHBzOi8vZm9ya2FzdC5uZXdzL2RlZ29kcy1iZWdpbnMtbWlncmF0aW9uLXRvLWV0aGVyZXVtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "DeGods begins migration to Ethereum - Forkast News",
        "content": "DeGods, the largest Solana-based non-fungible token (NFT) collection by all-time sales volume, started its migration to the Ethereum blockchain on Saturday morning in Hong Kong.\n\nSee related article: Solana NFT sales surge as traders farm for Tensor rewards\n\nFast facts\n\nDespite the migration, activity on the Solana network has been increasing, with the Forkast Solana Composite, a measure of the Solana NFT market, rising by 2.9% over the past 24 hours.\n\nOn Wednesday, DeGods’ sister project y00ts began its move to Polygon. Around 80% of y00ts had already completed the move, according to data from Dune Analytics.\n\nDeGods owners completed over US$2.19 million in sales on Friday alone, marking the highest amount since the NFTs were initially minted in October 2021, according to CryptoSlam, the data arm of Forkast Labs.\n\nThe rising activity may indicate traders anticipating DeGods’ price to rise on Ethereum, just as it has with y00ts, whose floor price is up by more than 50% since the NFTs began to land on Polygon, CoinGecko data shows.\n\nThe deflationary collection, which began with a 10,000 NFT mint, had a floor price of 939 SOL (US$19,940), experiencing a 29.6% surge in the 24 hours leading up to 1 p.m in Hong Kong, according to CoinGecko data. DeGods on Ethereum had a floor price of 10.4 ETH (US$19,000).\n\nDeLabs, the Los Angeles-based NFT firm behind DeGods and y00ts, announced the projects’ moves to their designated blockchains in December 2021, which was the same month that Solana’s native coin, SOL, dipped below US$10 for the first time since early 2021. The startup received a US$3 million grant from Polygon to migrate blockchains.\n\nThe migration of DeGods from Solana is expected to drain around US$200 million, the estimated market capitalization of the NFT collection, from the blockchain.\n\nSee related article: Top Solana NFT projects find new homes on Ethereum, Polygon"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LnNwb3J0aW5nbmV3cy5jb20vaW4vZm9vdGJhbGwvbmV3cy93aG8tYXJlLWludGVyY2l0eS1vcmlvbC1zb2xkZXZpbGEtaGF0LXRyaWNrLWJhcmNlbG9uYS9udnhiZHZiZXMxOTNvOGNodXhkOHNpcGjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "Who are Intercity and their hat-trick hero Oriol Soldevila? The small Spanish team that nearly shocked Barcelona - Sporting News",
        "content": "Barcelona were given an almighty fright in the 2022/23 Copa del Rey Round of 32 by third-division side Intercity.\n\nDespite Xavi's side opening the scoring after just four minutes and taking the lead on three different occasions in regulation, Intercity equalised three times through young winger Oriol Soldevila to force the match to extra time.\n\nWhile Barca would eventually claim a 4-3 win after 120 minutes, Intercity and their young hat-trick hero certainly made the most of their time in the spotlight.\n\nThe Sporting News brings you everything you need to know about the unique club and the player who came back to haunt Barcelona.\n\nMORE: Latest Barcelona transfer news\n\nWho are Intercity?\n\nIntercity are a club based in Alicante, Valencia and currently compete in Spain's third division. The side currently play at the Estadio Antonio Solana which has a capacity of just 2500.\n\nThey were only founded in 2017 and have secured four promotions since their establishment. Former Atletico Madrid defender Juanfran is a vice president of Intercity and one of their major shareholders.\n\nIntercity are coached by Argentine Gustavo Siviero, who previously played in Spain for Mallorca and Albacete.\n\nThe young club made history in 2021 when they became the first Spanish team to be listed on the stock exchange.\n\nIntercity's long-term ambition is to secure promotion to La Liga and they showed against Barcelona their ability to compete against the best.\n\nCF Intercity are in the third tier of Spanish football.\n\n\n\nBarcelona are fielding a side featuring Depay, Dembélé, Busquets, Alba, Raphinha, Gavi, Ansu Fati and Koundé.\n\n\n\nAfter 90 minutes, with a hat-trick from 21-year-old Oriol Soldevila, they've drawn 3-3 in the Copa del Rey. — bet365 (@bet365) January 4, 2023\n\nWho is Oriol Soldevila?\n\nIntercity's stunning showing against Barcelona was inspired by their young attacker Oriol Soldevila — or Solde as the back of his shirt reads.\n\nThe 21-year-old was in fact once a part of Barcelona's youth team and also spent time recently in England playing for Birmingham City's junior sides.\n\n\"I've been culé since I can remember, I'm a member too. With the 1st I was happy, with the 2nd and 3rd, I couldn't believe it.\"\n\n\n\n\"The shirt I'll ask for is Arnau Tenas, the third keeper there. He is my best friend in football, that's the one I want.\" - Soldevila. pic.twitter.com/GAm8YNzxQx — Ruairidh Barlow (@RuriBarlow) January 4, 2023\n\nSoldevila signed for Intercity in June 2022, and prior to his hat-trick against Barcelona, had only scored two goals all season for the club.\n\nThe youngster has previously made appearances for Spain's Under-16 and Under-18 teams and will no doubt now have even more eyes on him after his rare feat against Barca."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vd3d3LnNhbmRpZWdvLmNvbS9ibG9nL3Bvc3QvZG9nLXN1cmZpbmctc2FuLWRpZWdvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "Guide to Dog Surfing San Diego - SanDiego.com",
        "content": "Guide to Dog Surfing San Diego\n\nSan Diego is home to the very first dog beach in the United States, aptly titled ‘Dog Beach’ located in the Ocean Beach neighborhood. So, then, it’s not a big surprise that many southern California dogs like to catch waves with their owners occasionally.\n\nDog surfing is a popular activity for dog owners and their pets. Dogs are properly trained to surf on different kinds of boards so they can get out with their humans and ride some waves. From individual activities to huge surf dog competitions, this is a popular pastime in San Diego.\n\nWant to learn more about having a surf dog here in SoCal? Great! Stick with us for a few while we give you a quick overview.\n\nWhat Is Dog Surfing?\n\nEssentially, if you love to surf, have dogs, and want to go make friends with other parents of pups, dog surfing is the right activity for you!\n\nThis is a popular sport among practicing surfers who love to get outdoors almost daily but can’t bring themselves to leave their dogs at home for hours on end.\n\nThe solution they came up with allows pets to stick with their parents, surfers to keep doing what they love, and spectators to watch an adorably cute exchange as dogs are taught to surf.\n\nYou can teach your dog to surf at Ocean Beach Dog Beach, Del Mar Dog Beach, or Huntington Beach closer to LA.\n\nDel Mar Dog Beach\n\nWhile Ocean Beach Dog Beach was historically one of the first off-leash dog beaches in the country and is nationally famous, the opportunity to surf with your dog is better in the waves of Del Mar Dog Beach.\n\nHead to this beautiful stretch of sand and sea, sandwiched in between the neighborhoods of La Jolla and Solana Beach as you teach your pup to surf alongside you.\n\nIn fact, the Del Mar Dog Beach may also be more notable for its popular, annual dog surf-a-thon that raises funds for charity.\n\nIt is worth a visit, regardless of whether you want to catch an event, surf, or just run around the sand with your furry best friend.\n\nDel Mar Dog Surfing Competition\n\nThe Del Mar Dog Surf Competition is held at Del Mar Dog Beach and takes place annually in September.\n\nThe upcoming 2023 Dog Surfing Competition is the 18th annual surf dog surf-a-thon, set up as a surfur expo. This event will take place from 8 am to 2 pm on Sunday, September 10th.\n\nDogs are split up by weight class at this fun world-class event, showcasing individual and tandem rides.\n\nThis is a family-friendly event that goes to support the Helen Woodward Animal Center to raise money for orphaned pets that are under their care. What a fun way to raise money, and all for a great cause! Generally, who doesn’t love a good dog surf-a-thon, right?\n\nWe love to watch the pups participate in a fun event that raises funds for other dogs. One of the best events in San Diego County, this surf dog competition is like no other in California!\n\nYou can also head down to the Imperial Beach Pier to see another dog surf event in south SD or Huntington Beach to see dogs surf closer to Los Angeles.\n\nSurf’s Up San Diego!\n\nOkay, it’s time for us to go. See you soon, but in the meantime, we hope that you are making the most of the surf-related opportunities that sunny San Diego holds… with and without your precious pup.\n\nWhether you are supporting the Helen Woodward Animal Center by attending dog surf-a-thon events at Del Mar Dog beach, or just like to go out to surf with your own pooch, know that there is plenty to do surrounding the area's surf dogs.\n\nHave a dog that you like to surf with? What’s your favorite spot?"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3Qvc3BhY2VjYXRjaC1nYW1lLWhlcmFsZHMtdGhlLXN0YXJ0LW9mLWEtbmV3LWdhbWluZy1lcmEtY2VvLXN0YW5pc2xhdi1sZXBrYdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 14:56:18 GMT",
        "title": "SpaceCatch Game Heralds the Start of a New Gaming Era - CEO Stanislav Lepka - BSC NEWS",
        "content": "BNB\n\nThe SpaceCatch game allows players to experience an open gaming economy where they can monetize their in-game items and earn real money.\n\n‍Video Game Industry\n\nAccording to estimates from the analytical platform Statista, the value of the entire video game industry will exceed $365 billion in 2023. The gaming sector is rapidly expanding and is expected to continue growing each year. Data suggests that by the end of 2027, the gaming industry could surpass the $480 billion mark.\n\nCurrently, the vast majority of the gaming segment consists of mobile games, whose value and profits are growing sharply every year. The current share of mobile games in the gaming segment represents approximately 85%, which is a huge number.\n\nHowever, this creates a plethora of great investment opportunities.\n\nWeb 3.0 Potential in the Gaming Industry\n\nThe vast majority of mobile games currently operate as Web 2.0. This means that these games have a strict and closed gaming economy, which puts game creators in a monopoly position. This also means that players, in the vast majority of cases, do not own the in-game items they possess, and as such, any attempts to sell or monetize them are strictly prohibited. Violating these gaming terms can lead to the freezing or complete blocking of the accounts of offending players.\n\nHowever, Web 3.0 completely disrupts this strict policy and opens up the gaming economy to all players. This means that the player is the exclusive owner of the in-game items they have acquired in the game. Therefore, they can freely sell or monetize them. All of this is possible thanks to blockchain and NFT technologies, which create a favorable and user-friendly environment for such transactions.\n\nHowever, there are still very few Web3.0 games on the market, creating an even better opportunity for large investments and great returns in the gaming industry. Several analysts predict that the market for games based on blockchain and NFT technologies alone will be worth several tens of billions of dollars in just a few years.\n\n\n\nSpaceCatch Game\n\nSpaceCatch game is the first game that combines the concept of a classic mobile game with modern technologies such as augmented reality, blockchain, and NFT. This combination not only allows players to discover and experience a completely new gaming experience but also opens the doors to the world of Web 3.0.\n\nSpaceCatch game has an open gaming economy, in which the player is the exclusive owner of their items, which they can freely monetize or use otherwise. The game also implements the concepts of Play-to-Earn and Move-to-Earn, which means that the player can earn real money by playing the game without the need for an initial investment.\n\nThe CEO of SpaceCatch – Stanislav Lepka has also expressed his views on the game and the huge potential of Web 3.0, saying, \"We are on the edge of a new gaming era.\" The game will also have its own token called CATCH, which will represent a premium currency and also function as a store of value. All of this will be possible thanks to careful tokenomics.\n\nStay updated with SpaceCatch and its developments via the following links:\n\nWebsite | Twitter | Telegram | Instagram | Discord ‍\n\nDisclaimer: This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $320. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\n\n\n"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzAxL2JldHRlci1idXktc29sYW5hLW9yLWF2YWxhbmNoZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "Better Buy: Solana or Avalanche? - The Motley Fool",
        "content": "Solana might be outperforming Avalanche thus far in 2023, but the long-term outlook for Avalanche appears to be brighter.\n\nThe top two Ethereum (ETH 0.85%) challengers -- Solana (SOL 0.06%) and Avalanche (AVAX -0.68%) -- have made surprising comebacks thus far in 2023. After both lost more than 90% of their value during the 2022 crypto market meltdown, both have turned in remarkable performances this year. Solana is up almost 110%, while Avalanche is up about 62%.\n\nSo which blockchain network is the better buy right now? While Solana has outperformed Avalanche in 2023, there are a number of factors that make this comparison closer than you might think. As can be seen below, the two cryptos actually have very similar charts for the first quarter of the year.\n\nData by Trading View\n\nSolana\n\nRight now, Solana is losing momentum in the non-fungible token (NFT) market, which was the one place it looked like it could challenge Ethereum. As a result of concerns about Solana's well-publicized relationship with Sam Bankman-Fried and his failed cryptocurrency exchange FTX, several high-profile NFT collections have migrated away from Solana to other blockchains.\n\nWhile Solana initially put on a brave face about these departures, it's starting to show up in the numbers. For example, if you check out the latest NFT trading volume, it looks like trading in top Solana NFT collections has fallen off a cliff this quarter. Over the most recent 24-hour period, the top Solana NFT sold for just $814.59, and many of its top NFT collections recorded zero trades.\n\nMeanwhile, Ethereum still has the top two NFT collections -- the Bored Ape Yacht Club and CryptoPunks -- and shows no signs of ceding its dominance in this area. By way of comparison, the top Ethereum NFT sale during that same period was a Bored Ape that sold for approximately $435,000.\n\nAnother big concern at Solana is the still-present issue of network outages. This was a problem that plagued it throughout 2022, and was supposed to have been worked out at the end of last year, when it had time to refocus on the fundamentals.\n\nBut then, on Feb. 25, Solana experienced a 20-hour network outage. This is causing some developers and users to lose patience with it.\n\nThe one factor, though, that could turn sentiment back in Solana's favor is the pending launch of its new $1,000 Saga crypto phone. This launch, now scheduled for April 13, is supposed to bring Web3, blockchain, and crypto to the masses. Solana initially released details about the Saga phone in June 2022, and it's now finally ready for public release after being available for orders this winter.\n\nAvalanche\n\nAvalanche has also worked through its share of issues during the crypto winter, and is finally regaining some of its former momentum. While Solana seems to be going after the retail crypto market, Avalanche appears to have its sights set on the institutional crypto market.\n\nThus, while Solana is promising NFT collections and mobile phones, Avalanche is focusing on blockchain developments that corporate America and Wall Street care about.\n\nCase in point: Big financial institutions including BlackRock and Citigroup have been talking up the enormous advantages of asset tokenization, which is the process of converting assets such as stocks and bonds into digital tokens that can be stored, accessed, and traded on a blockchain. And asset tokenization is something that Avalanche has made a priority. In 2022, it made headlines with the tokenization of a $4 billion private equity fund.\n\nMoreover, in January, Avalanche lined up a big partnership with the cloud computing unit of Amazon in an effort to bring blockchain services to corporations, big institutions, and governments. This could be huge for Avalanche, since it would gain access to the big institutions using Amazon Web Services.\n\nIn short, all the same corporations and institutions that embraced cloud computing might now be tempted to experiment with blockchain offerings from Avalanche, such as its custom blockchain networks known as \"subnets.\"\n\nAnd the winner is...\n\nWhile Solana has clearly outperformed Avalanche this year in terms of price, I'm particularly concerned about Solana's slowing growth in key areas such as NFTs.\n\nIn contrast, Avalanche seems to be growing behind the scenes in ways that perhaps are not yet making headlines. For example, as Citigroup recently pointed out, asset tokenization could be the next \"killer use case\" for crypto, and Avalanche is one blockchain that has embraced this paradigm shift in the financial world.\n\nWhile I am bullish on both cryptos, right now Avalanche looks like the better long-term buy."
    }
]