[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzI3L3NhbS1iYW5rbWFuLWZyaWVkLXN0YXJ0ZWQtYnV5aW5nLXNvbGFuYXMtc29sLWF0LTIwLWNlbnRzLXVzaW5nLWFsYW1lZGEtcHJvZml0cy1oZS1zYXlzLWF0LWhpcy10cmlhbC_SAZQBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMC8yNy9zYW0tYmFua21hbi1mcmllZC1zdGFydGVkLWJ1eWluZy1zb2xhbmFzLXNvbC1hdC0yMC1jZW50cy11c2luZy1hbGFtZWRhLXByb2ZpdHMtaGUtc2F5cy1hdC1oaXMtdHJpYWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Sam Bankman-Fried Started Buying Solana's SOL at 20 Cents Using 'Alameda Profits,' He Says at His Trial - CoinDesk",
        "content": "Sam Bankman-Fried Started Buying Solana's SOL at 20 Cents Using 'Alameda Profits,' He Says at His Trial\n\n\"I believed the funds came from Alameda’s operating profits\" as well as third-party lenders, he testified Friday at his fraud and conspiracy trial."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vdS50b2RheS9zb2xhbmFzLXNvbC1tZXRlb3JpYy1yaXNlLWluLTIwMjEtYWJvdXQtdG8tcmVwZWF0LWluZmxvd3Mtc2t5cm9ja2V0LXBhc3QtMTAwLW1pbGxpb27SAWhodHRwczovL3UudG9kYXkvc29sYW5hcy1zb2wtbWV0ZW9yaWMtcmlzZS1pbi0yMDIxLWFib3V0LXRvLXJlcGVhdC1pbmZsb3dzLXNreXJvY2tldC1wYXN0LTEwMC1taWxsaW9uP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Solana's (SOL) Meteoric Rise in 2021 About to Repeat: Inflows Skyrocket Past $100 Million - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nOver the past few days, there has been a significant uptick in capital movement within the realm of cryptocurrency-focused products. Remarkably, weekly inflows have now soared past the $100 million mark, highlighting increasingly bullish sentiment in the market.\n\nAdvertisement\n\nA standout performer in this influx of capital is the 21Shares Solana Staking ETP (ASOL), which has clinched the second spot in terms of net monthly flows. Such a momentous surge brings back memories of the astronomical growth witnessed by SOL in the latter half of 2021.\n\nTurning our attention to the daily price chart provided for Solana, a few key patterns and trends emerge. The sharp upward trajectory displayed in the recent bars clearly signals that Solana has been gaining momentum. This robust ascent, mirrored by a notable increase in trading volume, underscores growing investor interest.\n\nMoreover, the convergence of moving averages and the recent bullish crossover suggests a positive trend. This can be considered a sign of potential further upside for Solana, echoing the sentiment of the latter part of 2021. With the price hovering near the $32 mark, it is worth noting that any significant break above current resistance levels could propel SOL to newer highs, much like the previous year.\n\nHowever, while technical indicators are promising, it is essential to exercise caution and conduct due diligence, as the cryptocurrency market is known for its volatility. That said, the signs do point toward a possible rally continuation, which could be indicative of Solana's inherent strengths and potential.\n\nBeyond mere price speculations, Solana has positioned itself as a potent contender in the blockchain space. Known for its high throughput and low transaction costs, it provides an efficient platform for decentralized applications and crypto projects."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8yNy9zb2xhbmEtb24tY3VzcC1vZi1icmVha291dC1zYXlzLWFuYWx5c3Qtd2hvLWFjY3VyYXRlbHktY2FsbGVkLTIwMjItYml0Y29pbi1ib3R0b20tYnV0LXRoZXJlcy1hLWNhdGNoL9IBigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8yNy9zb2xhbmEtb24tY3VzcC1vZi1icmVha291dC1zYXlzLWFuYWx5c3Qtd2hvLWFjY3VyYXRlbHktY2FsbGVkLTIwMjItYml0Y29pbi1ib3R0b20tYnV0LXRoZXJlcy1hLWNhdGNoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Solana on Cusp of Breakout, Says Analyst Who Accurately Called 2022 Bitcoin Bottom – But There’s a Catch - The Daily Hodl",
        "content": "A top crypto trader says that Ethereum (ETH) competitor Solana (SOL) is setting the stage for a breakout after an initial rally.\n\nPseudonymous analyst DonAlt tells his 53,900 YouTube subscribers that SOL appears likely to break through a key resistance level.\n\nHowever, he says SOL’s move to the upside is likely contingent on Bitcoin (BTC) holding support levels after the king crypto’s massive move to the upside.\n\n“Solana/USD knocking on heaven’s door here [at $32.98], again. I think that should break, same as what Chainlink (LINK) did, as long as Bitcoin can keep holding up. So, Solana looking good on the USD pair. It keeps on making higher lows.”\n\nThe trader’s weekly chart shows Solana hitting recent higher price lows, the most recent being about $18.\n\nThe trader also says Solana is showing bullish momentum on the monthly chart.\n\n“If you look at the monthly timeframe that is quite nice. You have an impulse. Then you have a bunch of sideways and now you have a second one. I like this chart. If I had to buy an altcoin, still, even at this point, it would be Solana and it would be LINK.”\n\nNext up, the trader says Bitcoin could mirror a price pattern in 2018 and soar to a range high of $60,000.\n\n“Target-wise, if we break this level [at $35,028] I just think $60,000 is next. I think if you come and reclaim range, it’s moon time. If you compare it to 2018, we had a consolidation. We had a breakdown. This was a little bit longer of a breakdown, but same, and then people were trying to short the retest and that very much didn’t go to plan. It completely went to the range high, which I have outlined here.\n\nSo if it plays out the exact same way you would basically be at a range high in two months, which I think is not necessarily super likely, but it’s possible. If we get good ETF (exchange-traded fund) news, I think that could be possible. But also we have high timeframe resistance right now.”\n\nBitcoin is trading for $34,253 at time of writing.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALL-E 3"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NyZWF0b3ItY2VudHJpYy1wbGF0Zm9ybS1hY2Nlc3MtbGFicy1yYWlzZXMtMS0ybS10by1leHBhbmQtc29sYW5hLWJhc2VkLW1vbmV0aXphdGlvbi1lY29zeXN0ZW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Creator-centric platform Access Labs raises $1.2M to expand Solana-based monetization ecosystem - CryptoSlate",
        "content": "Creator and media monetization protocol Access Labs has procured $1.2 million in Seed funding from prominent investors such as Sora Ventures, DV Ventures, CMS Holdings, and DoublePeak, paving the way for an innovative monetization method within the crypto space.\n\nThe Access Labs model enables users to lock the native ACS token in a creator’s pool in exchange for a product or service. As a result, a novel and engaging ecosystem is being fostered for creators of varying sizes and expertise, including CryptoSlate Alpha.\n\nMika Honkasalo, Access Protocol founder, emphasizes the company’s mission, stating,\n\n“We’re in the early stages of building a monetization ecosystem for creators of all shapes and sizes. We are set to build products and tools creators are used to in web2, super-powered only by what can be built on Web3 rails.”\n\nThis expansion comes following Access Protocol’s day-one listing of an SPL Token on Coinbase on Feb. 15. Since its launch, Access Protocol has accrued over 220,000 unique subscribers across its content offerings. Notably, existing publications and service providers such as CoinGecko, The Block, CryptoSlate, DeSpread (South Korea), and Crypto-Times (Japan) are leveraging Access for web3 monetization.\n\nIn addition to its fundraising success, Access Labs has also unveiled a beta of its independent publishing platform, Access Scribe. This platform offers a robust alternative to Substack or Mirror and has built-in web3 monetization capabilities.\n\nPlatforms such as Taiwan-based media outlet WuBlockchain and South Korean research and consulting firm DeSpread have been among the first to utilize this innovative resource.\n\nFrom a broader perspective, Andreas Nicolos, Access Labs Head of Ecosystem Growth, contends that non-fungible tokens (NFTs) are the next focus area for their product suite. He states,\n\n“Barriers to entry into Web3 are too high for traditional media firms. We’ve seen incumbent media companies allocate massive amounts of resources to web3 strategies that lack depth and business continuity. The industry needs a no code, one-stop shop platform where any creator can grow and develop a foundation of user relationships on chain.”\n\nUnderlining the significance of this development for the broader Web3 space, DV Ventures, the venture arm of Chicago-based DV Trading, emphasized its excitement to further its involvement in Web3, stating,\n\n“New monetization models are fundamental to the promise of the crypto industry, and Access stands to emerge at the forefront in the digital content space.”\n\nThe fundraising achievement and subsequent developments signal Access Labs’ commitment to fostering an innovative ecosystem for creators. As the crypto industry continues to evolve, Access Labs’ advancements could serve as a catalyst for unprecedented growth within the web3 content and digital content spaces.\n\nDisclaimer: CryptoSlate, a media partner of Access Protocol, received a grant.\n\nDisclosure: Sora Ventures is an investor in CryptoSlate.\n\nMentioned in this article"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vdG9kYXkudXNjLmVkdS91c2MtZmFsbC10cmFuc2Zlci1zdHVkZW50cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "USC fall transfer students fulfill dream of becoming Trojan - University of Southern California",
        "content": "Solana Marquez, one of 1,335 newly enrolled transfer students who began classes at USC this fall, says she feels deeply happy and proud to finally be a Trojan.\n\n“USC had been my dream,” the junior from the USC Viterbi School of Engineering said. “When I was unable to attend coming out of high school, it was really hard.”\n\nAs a Latina, Marquez is also part of the 27% of new transfer students who are from ethnic groups that have been historically underrepresented in American higher education: 17% Latino, 7% Black, and 6% who identify with two or more ethnic groups, some of which are underrepresented. In addition, Native American and Native Hawaiian students make up 0.3% of the transfers.\n\nBased on national data from the federal government, USC leads all private research universities when it comes to enrolling transfer students.\n\nUSC’s Office of Admission reports that the transfer class comes from approximately 300 different colleges and universities, with 52% transferring from a community college in California and 8% coming from schools within the Los Angeles Community College District.\n\n“Even though we are a private institution, we are working for the public good and taking care of students in our own backyard,” USC Dean of Admission Timothy Brunold said. “We are continuing to prioritize transfer students and they have long been important to USC.”\n\nSanta Monica College sent the largest number of new students (107) to USC, followed by Pasadena City College (67), Glendale Community College (43), El Camino College (34) and Los Angeles Pierce College (27).\n\n“We are continuing to prioritize transfer students and they have long been important to USC.” — Timothy Brunold, USC dean of admission\n\nMeanwhile, 13% of new transfer students came from a University of California or California State University school, with most students coming from the University of California, Santa Barbara; the University of California, Irvine; and the University of California, Riverside.\n\n“Each year, we have enrollment goals to meet, and we always hold room for transfer students, which is a little different than at some colleges,” Brunold said. “We are proactive, and transfers are a permanent part of our enrollment mix.”\n\nThe road to USC for transfer students\n\nMarquez applied to USC while in high school, dreaming of attending her father’s alma mater. But she also applied to the University of San Francisco just in case — and was accepted to both schools. In a difficult decision based on finances, she agreed to go to school in San Francisco.\n\nAfter her freshman year, Marquez decided that she wanted her bachelor’s degree in computer science to be from USC and that she would take whatever steps necessary to make that happen. She moved back home and enrolled at Rio Hondo College in Whittier. She took the classes she needed, earned a merit-based scholarship and was able to move into Troy Hall and begin her junior year at USC this fall.\n\n“I’m so glad I’m here,” she said. “They have a great computer science program, and it has the collaborative environment I was looking for.”\n\nIn addition to her classwork, Marquez has been attending career fairs and Trojan Talks, both hosted by the Career Center. She has also found it invaluable to be paired with a mentor through the USC Viterbi Center for Engineering Diversity, which assists in the recruitment, retention, and graduation of people from minoritized backgrounds pursuing engineering degrees.\n\n“There are not a lot of women, especially Hispanic women, in my major, and I’m really proud that I have been able to get to this point,” she said, mentioning that USC has many resources for minorities in STEM that she’s been able to take advantage of.\n\n“A big goal of mine is to inspire others like me to be able to do what I’m doing here.”\n\nUSC transfer students: Being first-generation\n\nAntonio Espinoza-Espino, a sophomore in the USC Dornsife College of Letters, Arts and Sciences, transferred to USC after spending his freshman year at the College of the Sequoias in Visalia, Calif. He is among the 28% of fall transfers who are first-generation college students. USC defines first-generation college students as those whose parents do not have four-year degrees.\n\n“I was really wanting to come here,” Espinoza-Espino said last week after attending a late afternoon meditation session for transfer students at the First Generation Plus Success Center. “My parents were overjoyed for me when I got accepted because I didn’t have the grades for a school like USC out of high school.”\n\nEspinoza-Espino grew up in a rural area of Central California and said that after some initial “culture shock,” he has been able to embrace life as a Trojan.\n\n“The school spirit here is amazing,” he said. “I’ve never experienced anything like it. I’ve been going to the football games, and the energy is just contagious.”\n\nAttending the same meditation session was USC Dornsife junior Keri Carter, a first-generation student who attended Harold Washington College in Chicago for two years before transferring to USC.\n\n“I appreciate that there was an orientation specifically for transfer students,” Carter said. “It made me feel like they care about us. I also liked [New Student] Convocation. It was really fun, and the speeches were thoughtful.”\n\nThe meditation session is one of several events the Transfer Student Assembly has held this fall as they work to bridge the gap between transfer students and the greater USC community.\n\n“There are definitely unique things that transfer students face,” said Alejandra Delacruz Hong, director of Student Equity and Inclusion Programs’ Trojan Success Initiatives. “We want them to know that they have not lost out. There’s plenty of time for them to get internships and for them to build their skill set and their professional network while they’re with us.”\n\nPersistence can pay off\n\nUSC Dornsife sophomore Lina Urquiza is among USC’s newest transfer students who were able to enroll after having previously been denied admission.\n\nUrquiza spent her freshman year at UC Irvine, after she wasn’t accepted to USC. She studied hard and got an on-campus job, but she remained determined to be a Trojan.\n\n“At first, I was just disappointed in myself,” Urquiza said about her initial rejection. “But then I was like, ‘Well, I really want to end up there!’ So, I spent the entire year proving that I deserve to be here academically.”\n\nShe has spent the past two months happily navigating Trojan life with her three roommates, who are also transfer students.\n\n“I’m appreciating my time here even more because I have less time here,” Urquiza said.\n\nThe average college grade point average of USC’s fall transfer students was 3.80, with 90% having a GPA higher than 3.50 and 28% having a 4.00 in college. Brunold said this is particularly impressive because making the academic transition from high school to college can be challenging.\n\n“Clearly, these new students already know what it takes to earn an A grade in a college class,” Brunold said. “This leaves me optimistic for the future prospects of this group.”"
    }
]