[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2FsdGNvaW5zL3doYXQtaXMtYm9uay1pbnUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Bonk Inu (BONK): The First Dog-Themed Meme Coin on Solana - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDEvMTEvc29sYW5hLWJhc2VkLWJvbmstaW51LW5mdHMtc3VyZ2UtdGVuZm9sZC1hZnRlci1taW50LWJ1dC1saXN0aW5nLWF0dHJhY3RzLWNyaXRpY2lzbS_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3dlYjMvMjAyMy8wMS8xMS9zb2xhbmEtYmFzZWQtYm9uay1pbnUtbmZ0cy1zdXJnZS10ZW5mb2xkLWFmdGVyLW1pbnQtYnV0LWxpc3RpbmctYXR0cmFjdHMtY3JpdGljaXNtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Solana-Based Bonk Inu NFTs Surge Tenfold After Mint but Listing Attracts Criticism - CoinDesk",
        "content": "“We utilized OCP for this mint, so any transfers between wallets should be done on Magic Eden in \"My Items\" versus directly in wallet,” a note on Bonkz listing on Magic Eden said. This effectively means Bonkz will not be listed on marketplaces that don’t kick back royalties to the creators."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzExL2Rvai1zYWlkLXRvLXByb2JlLXNhYmVyLWxhYnMtZm91bmRlcnMtb3Zlci1zb2xhbmEtYmFzZWQtZGVmaS1zdGFibGVjb2luLXByb2plY3RzL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMS8xMS9kb2otc2FpZC10by1wcm9iZS1zYWJlci1sYWJzLWZvdW5kZXJzLW92ZXItc29sYW5hLWJhc2VkLWRlZmktc3RhYmxlY29pbi1wcm9qZWN0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "Justice Department Probing Saber Labs Founders Over Solana-Based Projects: Sources - CoinDesk",
        "content": "The investigation follows CoinDesk’s August report that the Macalinao brothers used a web of 11 pseudonymous identities to build an ecosystem of interlocking financial products that double- and triple-counted crypto deposits by passing tokens between themselves. Their effort boosted a key growth metric for Solana by billions of dollars during the height of crypto’s 2021 bull market, and, according to Ian, juiced the price of SOL, the native token of the Solana network."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMS8xMS9jZnRjLWNoYXJnZXMtbWFuLWJlaGluZC0xMDAwMDAwMDAtYXR0YWNrLW9uLXNvbGFuYS1iYXNlZC10cmFkaW5nLXBsYXRmb3JtLXdpdGgtbWFya2V0LW1hbmlwdWxhdGlvbi_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDEvMTEvY2Z0Yy1jaGFyZ2VzLW1hbi1iZWhpbmQtMTAwMDAwMDAwLWF0dGFjay1vbi1zb2xhbmEtYmFzZWQtdHJhZGluZy1wbGF0Zm9ybS13aXRoLW1hcmtldC1tYW5pcHVsYXRpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "CFTC Charges Man Behind $100,000,000 Attack on Solana-Based Trading Platform With Market Manipulation - The Daily Hodl",
        "content": "The U.S. Commodity Futures Trading Commission (CFTC) has filed market manipulation charges against the man behind the $100 million exploit of Mango Markets, a Solana (SOL)-based decentralized finance (DeFi) trading platform.\n\nIn a complaint filed on Monday, the CFTC argues that Avraham Eisenberg “engaged in a manipulative and deceptive scheme to artificially inflate the price of swaps offered by Mango Markets.”\n\nEisenberg was also arrested by the Department of Justice in Puerto Rico in late December on charges of commodities fraud and manipulation.\n\nMango Markets claimed in October that an attacker manipulated the price of its utility token, Mango (MNGO), upwards within minutes before borrowing and withdrawing crypto assets worth approximately $100 million.\n\nEisenberg, who runs a trading firm and describes himself as a “digital art dealer,” went public the following week, claiming he was the brains behind what he described as a “legal” exploit of Mango.\n\nThe trader argued he “was involved with a team that operated a highly profitable trading strategy.” The scheme left the decentralized exchange insolvent and users unable to access their funds.\n\nThe CFTC seeks civil monetary penalties against Eisenberg, as well as “remedial ancillary relief, including, but not limited to, trading bans, restitution, disgorgement, rescission, pre-and post-judgment interest and such other relief as the Court may deem necessary and appropriate.”\n\nThe regulator says Eisenberg’s possible violations include “use of a manipulative or deceptive device” and “manipulation and attempted manipulation of a swap.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvdS1zLWRlcGFydG1lbnQtb2YtanVzdGljZS10by1pbnZlc3RpZ2F0ZS1zYWJlci1sYWJzLWZvdW5kZXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Jan 2023 08:00:00 GMT",
        "title": "U.S. Department of Justice to Investigate Saber Labs Founders - Watcher Guru",
        "content": "Coindesk reported that the U.S. Department of Justice has launched an investigation into Saber Labs founders Ian and Dylan Macalinao. The probe is reportedly surrounding how the brothers utilized various pseudonymous identities to orchestrate inaccurate crypto gain metrics.\n\nThe brothers reportedly crafted over 11 various identities across the web to “build an ecosystem of interlocking financial products that double and triple-counted crypto deposits by passing tokens between themselves.” Moreover, the scheme reportedly “boosted a key growth metric for Solana by billions of dollars,” in 2021.\n\nJUST IN: 🇺🇸 US DOJ launches investigation into the founders of #Solana stablecoin exchange Saber Labs. January 11, 2023\n\nSaber Labs Founders Probed for Fraudulent Activity\n\n2022 had seen one of the largest financial crimes in history occur in the crypto sector, with the fraud of FTX. Now, it appears as though American authorities are probing another potential financial crime in the crypto sphere to start the new year.\n\nCoindesk has reported the U.S. Department of Justice is launching an investigation into Saber Labs Founders Ian and Dylan Macaliano. The brothers are the founders of the Solana Stablecoin Exchange and orchestrated a web of pseudonymous identities to increase a key metric for Solana in 2021.\n\nThe duo would reportedly craft a plethora of fake online identities that would “double and triple” count crypto deposits by “passing tokens between themselves.” Coindesk also gained access to an unpublished blog by Ian Macalinao noting, “The metric to optimize for in Summer 2021 was [total value locked (TVL)]” according to the report.\n\nSource – Solana.com\n\nAdding, “TVL can only count if protocols are built separately, so I devised a scheme to maximize Solana’s TVL: I would build protocols that stack on top of each other, such that a dollar could be counted several times.” Conversely, investigators are probing for information regarding sabers’ various crypto projects. These include Defi app Sunny Aggregator, and Cashio, a stablecoin project that was the victim of a hack that lost millions in March.\n\nConclusively, Ian wrote the code for both using similar fake identities. “If an ecosystem is all built by a few people, it does not look as authentic,” he stated. Adding “I wanted to make it look like a lot of people were building on our protocol rather than ship 20+ disjoin [sic] programs as one person.”"
    }
]