[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jYnM4LmNvbS92aWRlby9uZXdzL2xvY2FsLzQ4LWhvdXJzLXRha2VzLWEtZGVlcC1kaXZlLWludG8tdGhlLWphZGUtamFua3MtbXVyZGVyLWNhc2UvNTA5LWJlNjJjOTI3LTZlOTUtNGU3Yi05MTQxLWRhY2I1NDFlMjkwNtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "48 Hours takes a deep dive into the Jade Janks murder case - CBS News 8",
        "content": "Next up in 5\n\nExample video title will go here for this video"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9zb2xhbmEtZm91bmRhdGlvbi1vZmZlcnMtNDAwMDAwLWJvdW50eS10by10dXJuLW9mZi1zb2xhbmEv0gFXaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL3NvbGFuYS1mb3VuZGF0aW9uLW9mZmVycy00MDAwMDAtYm91bnR5LXRvLXR1cm4tb2ZmLXNvbGFuYS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Solana Foundation Offers $400,000 Bounty to ‘Turn Off Solana’ - CryptoPotato",
        "content": "The Solana Foundation is offering a reward of $400,000 for anyone who can discover the code that could potentially “turn off Solana.”\n\nThis development comes while SOL’s price has dipped by 8.4% in the past week following several mentions in Sam-Bankman Friend’s trial.\n\nJacob Creech Announces $400,000 Bounty\n\nJacob Creech, the Head of Developer Relations for the foundation, recently took to X to announce a $400,000 bounty for anyone who can discover the code that could turn Solana off.\n\nFyi there’s a $400k reward for anyone that can find code that can turn off Solana Please go ahead and find ithttps://t.co/2oxcB0EEyx — Jacob Creech (@jacobvcreech) October 12, 2023\n\nThis offer is a part of the Solana Foundation’s broader security bug bounty program, which actively encourages white hat hackers to scrutinize the blockchain for vulnerabilities, with various rewards up for grabs.\n\nAmong these bounties is $2 million in locked SOL tokens, set aside for a 12-month lockup period, awaiting those who can uncover vulnerabilities such as theft of funds without user signatures, unauthorized fund transfers, or vote program exploits that drain delegated stakes.\n\nOne standout bounty worth $1 million is reserved for those who can expose the Solana network’s consensus violations or safety issues. This includes the recently publicized $400,000 reward, which incentivizes hackers to identify vulnerabilities that could lead to remote attacks capable of partitioning the Solana network.\n\nAs a blockchain hailed as an “Ethereum killer,” Solana acknowledges that no network is immune to vulnerabilities and is determined to address these issues proactively.\n\nSOL’s Decline Tied to Bankman-Fried Trial Mentions\n\nMeanwhile, Bankman-Fried’s criminal trial has caused a negative impact on SOL, which is the eighth-largest cryptocurrency. SOL’s performance has been poor recently, with its current price at $21.36, down by 8.4% in the past week, according to CoinGecko data.\n\nThis decline may be linked to its frequent mentions in Bankman-Fried’s trial, in which his lawyer, Mark S. Cohen, discussed his interest in this cryptocurrency during the trial.\n\nSOL serves as the currency for transactions on the Solana blockchain, which developers use to create decentralized apps like DeFi lending platforms. Additionally, it was favored by FTX, with its former CEO Bankman-Fried supporting Solana, launching a Solana NFT marketplace, and investing in various native projects."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vYml0Y29pbmlzdC5jb20vc29sYW5hLWlzLXNldC10by1yZXBlYXQtaXRzLTIwMjEtcmFsbHktYm9ycm9lZmluYW5jZS1hbmQtYXZhbGFuY2hlLWF0dHJhY3QtYnV5ZXJzL9IBbWh0dHBzOi8vYml0Y29pbmlzdC5jb20vc29sYW5hLWlzLXNldC10by1yZXBlYXQtaXRzLTIwMjEtcmFsbHktYm9ycm9lZmluYW5jZS1hbmQtYXZhbGFuY2hlLWF0dHJhY3QtYnV5ZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Solana Is Set to Repeat Its 2021 Rally, BorroeFinance and Avalanche Attract Buyers | Bitcoinist.com - Bitcoinist",
        "content": "Solana ($SOL) hit its all-time high on November 6, 2021. After the token recorded a massive price surge recently, savvy investors say the token is ready to repeat its 2021 price movement. Similarly, Avalanche ($AVAX) and BorroeFinance ($ROE) are attracting investors, and they picked these tokens as the best crypto investments for massive ROI in 2024. Keep reading to discover expert opinions and forecasts on these three tokens.\n\n>>BUY $ROE TOKENS NOW<<\n\n$SOL Records Double-digit Price Surge in Q4 2023\n\nRecently, institutional investors like VanEck backed Solana ($SOL) to record a massive price surge this decade. According to VanEck, Solana ($SOL) may rise to $3,211 by 2030. In retrospect, Solana traded for $260 at its all-time high on November 6, 2021.\n\nTwo years later, Solana has maintained its position as one of the best altcoins in the crypto industry thanks to innovations like the Solana Labs Incubator Program. For context, this program bolsters new DeFi projects hosted on Solana’s blockchain.\n\nRight now, investors are happy thanks to Solana’s ($SOL) 60.68% surge. On October 13, $SOL traded at $20.49. By October 30, $SOL surged and traded for $32.76. Moreover, analysts believe $SOL is ready for another pump, similar to the November 2021 rally. If this happens, $SOL may trade for as high as $90 by the end of 2023.\n\nCrypto Investors Back $ROE to Deliver Massive ROI in 2024\n\nBorroeFinance ($ROE) is the world’s first web3 blockchain invoice discounting NFT marketplace. This decentralized fundraising platform allows web3 participants to raise instant cash by selling future digital earnings to supportive communities.\n\nWith BorroeFinance ($ROE), you enjoy a simple fee structure, full cost transparency, instant funding, and much more!\n\nRight now, BorroeFinance ($ROE) is in its second presale stage, and the token is selling for $0.015. When $ROE finally hits the mainstream crypto market, the token will surge 167% and trade for $0.040.\n\nAccording to experts, early BorroeFinance investors may get a greater ROI if BorroeFinance ($ROE) records speedy market adoption and crosses $0.100 resistance by June 2024.\n\n>>BUY $ROE TOKENS NOW<<\n\nAva Labs Founder Reveals 2024 Roadmap for $AVAX\n\nRecently, CNBC interviewed the founder and CEO of Ava Labs, John Wu, and the executive shared his plans for Avalanche ($AVAX) moving forward. John Wu spoke on the rise of SocialFi apps on the Avalanche blockchain.\n\nAdditionally, the CEO said that Avalanche ($AVAX) is ready to integrate real-world assets into the platform and revolutionize tokenization. Experts are anticipating a busy 2024 for the Avalanche ($AVAX) ecosystem.\n\nAvalanche ($AVAX) is doing well in the crypto market, and the token surged 23.93% in October. On October 20, Avalanche ($AVAX) traded at $9.14. Ten days later, Avalanche ($AVAX) surged and sold for $11.32. Analysts are closely monitoring $AVAX, and they predict that the token may likely hit $25 by April next year.\n\nLearn more about BorroeFinance ($ROE) here:\n\nVisit BorroeFinance Presale | Join The Telegram Group | Follow BorroeFinance on Twitter\n\nDisclaimer: This is a paid release. The statements, views and opinions expressed in this column are solely those of the content provider and do not necessarily represent those of Bitcoinist. Bitcoinist does not guarantee the accuracy or timeliness of information available in such content. Do your research and invest at your own risk."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvd2ViMy9zb2xhbmEtc3RpbGwtaGF1bnRlZC1ieS1wYXN0LWZ0eC10aWVzLWFzLXNiZi10cmlhbC1yYWdlcy1vbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Solana still haunted by past FTX ties as SBF trial rages on - DLNews",
        "content": "A fake post claimed that Alameda Research could turn Solana “on and off” to liquidate longs.\n\nSolana Foundation head of developer relations Jacob Creech said there was a $400,000 bounty for “anyone that can find code that can turn off Solana.”\n\nThe explosive testimony of Alameda Research CEO Caroline Ellison this past week did more than make things extremely difficult for the defence of her ex-boyfriend Sam Bankman-Fried.\n\nIt also gave rise to numerous memes, including a fake Ellison quote claiming Alameda could turn Solana “on and off” to affect long positions — bullish bets on the direction of Solana’s native currency, SOL. The fake post was shared over X, formerly Twitter, and spread like wildfire.\n\n“Geesh, as the leader of the Solana Soldiers, this hurts my heart,” disgraced crypto influencer Ben Armstrong tweeted, asking if the quotes were legitimate.\n\n“Imagine building on top of this garbage,” Bitcoin maximalist Samson Mow added, reposting the fake post.\n\nIf the fake post was able to gain traction, it’s because of the close relationship Solana and Bankman-Fried used to have.\n\nFTX overhang\n\nAt its peak, “Sam’s [SOL] stash was worth maybe $12 billion,” writes Michael Lewis in his new book, “Going Infinite: The Rise and Fall of a New Tycoon.”\n\nIn fact, Lewis writes that Bankman-Fried owned anywhere between 10% and 15% of the entire SOL supply through Alameda and FTX. Solana ecosystem tokens became casually known as “Sam coins” in the crypto space.\n\nThat’s one of the reasons crypto investors panicked when in September the FTX bankruptcy team obtained court approval to liquidate $3.4 billion worth of crypto assets — including over $1 billion in SOL tokens.\n\nJoin the community to get our latest stories and updates\n\nBut Bankman-Fried’s downfall didn’t spell the end for Solana development.\n\n“None of the builders I know viewed FTX as an existential catastrophe,” Rooter, the pseudonymous co-founder of lending protocol Solend, told DL News in August. “All of the fundamentals that brought us here — cheap fees, fast transactions, a strong ecosystem — were still there.\n\n“Just lost a very good exchange with Solana support, but there were others,” they said.\n\n$400,000 bug bounty\n\nThe fake Ellison post also referenced an issue that has recurrently plagued Solana — system shutdowns. It also suggested a potential vulnerability within the network, a claim that could have serious implications if true.\n\n“There’s a $400,000 reward for anyone that can find code that can turn off Solana,” wrote Solana Foundation head of developer relations Jacob Creech on Thursday in response to the fake Ellison post. “Please go ahead and find it.”\n\nThe reward was launched last month — alongside bounties for potential consensus violations or potential loss of funds — to encourage hackers to report network vulnerabilities to the Solana development team.\n\nThe bug bounty would be awarded for demonstrations of instances where the consensus comes to a halt and requires human intervention, according to the description. Additionally, vulnerabilities pertaining to eclipse attacks and remote attacks that result in network partitioning are also eligible for the reward.\n\nThe bounty fee would be paid in Solana’s native token SOL and would be locked for a year.\n\nSolana hasn’t experienced any outages since February — its longest period of uninterrupted uptime since March 2021.\n\nThe company behind Solana has attributed the improved performance to a series of upgrades meant to address its outage problem, including Ethereum-like fee markets that allow users to pay higher transaction fees in exchange for priority in the transaction queue.\n\nEkin Genç is the managing editor of DL News. You can reach him at ekin@dlnews.com. Tom Carreras is DL News’ Markets Correspondent. He is based in Costa Rica. For any tips, you can reach him at tcarreras@dlnews.com."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiqgFodHRwczovL3d3dy5kZWxtYXJ0aW1lcy5uZXQvYnVzaW5lc3Mtc3BvdGxpZ2h0L3N0b3J5LzIwMjMtMTAtMTMvYXJlbmRzZW4tYnJhZGRvY2staW4tc29sYW5hLWJlYWNoLXNwZWNpYWxpemVzLWluLXBlcnNvbmFsLWluanVyeS1lc3BlY2lhbGx5LXdpdGgtcmlzZS1pbi1lLWJpa2UtY29sbGlzaW9uc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Arendsen Braddock in Solana Beach specializes in personal injury, especially with rise in e-bike collisions - Del Mar Times",
        "content": "The Arendsen Braddock personal injury law firm, which launched in 2016, has been making inroads in the community since moving into its new building on the 101 in Solana Beach – now the firm’s main headquarters.\n\nJoshua Braddock, a founding partner of Arendsen Braddock\n\n(Hannah Claire Photography(@hannah_claire_photography)\n\nThe firm specializes in handling cases involving bicycle and e-bike collisions along the north coastal corridor, which passes right by the front of their 101 offices.\n\n“We’ve always handled bicycle accidents, but recently there has been a higher occurrence of them since e-bikes have come onto the scene,” said Joshua Braddock, an Encinitas resident and founding partner of the law firm who has focused on personal injury throughout his career.\n\nTraffic safety has been a top priority for local leaders in San Diego’s north coastal communities, spurred by the rise in e-bike usage over the past several years. The cities of Carlsbad and Encinitas declared local emergencies over the last year after they each experienced a tragic collision that resulted in the death of an e-biker.\n\nThe Solana Beach City Council has also been discussing the parameters of a citywide ordinance aimed at improving safety for riders on bicycles and e-bikes, as well as other road users.\n\nThe San Diego County Sheriff has also made e-bike enforcement a focal point, especially for the safety of children riding e-bikes to and from school.\n\n“We feel really drawn to this part of the community,” said Braddock, who lives in Encinitas with his wife Hannah and their two daughters Maggie, 4, and Hazel, 2. “We feel like this is a part of our community where we, ourselves being cyclists and e-bike commuters, can really provide perspective and value right now.”\n\nThe team at Arendsen Braddock Personal Injury provides clients with a thorough handling of their cases from injury to resolution. They not only deal with the complicated insurance claims process helping to maximize available resources to provide care and support to the injured party, but can also help their clients find care when there is no insurance available or resources to pay for expensive doctor’s appointments and medical procedures.\n\n“Bicycle accidents, especially e-bike accidents, can be somewhat nuanced, and there are sometimes just questions of wrong and right that aren’t easy to answer. We’re able to come in and help answer those questions, and we do so by maintaining a team of experienced attorneys, investigators and accident reconstruction experts that we bring whenever we come onto a case.”\n\nWith two daughters ages 4 and 2, Braddock also said it’s important to advocate for safety measures. “At the end of the day, I think every parent’s purpose in life is to be doing everything we can to make sure our kids come home safe at the end of each day.”\n\nA new state law led to the recent creation of an e-bike safety program. Another proposed law that could be approved next year, AB 530, would create a licensing system that requires e-bike riders to take an online written test and have a state-issued identification. It would also ban children under age 12 from riding e-bikes.\n\n“Children don’t know all the dangers they need to be aware of, it’s just entirely a matter of exposure and experience,” Braddock said. “In the early stages of riding, they don’t have enough situational experience to know what dangers to be on the lookout for and can oftentimes think that someone else is going to be looking out for them – so it is important to supplement this lack of experience with as much training as possible.”\n\nArendsen Braddock Personal Injury is located at 535 N. Highway 101, Suite A, in Solana Beach.\n\nFor more information about Arendsen Braddock Personal Injury, or to ask any questions related to bicycle safety or any other aspects of the work the firm does on personal injury, visit arendsenbraddock.com or call 760-222-7777.\n\n— Business Spotlight features enterprises that support this publication."
    }
]