[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDMyMzAwNTA0My9lbi9DZWdhLWZ1bmRyYWlzaW5nLXRvcHMtOS4zTS1pbi10b3RhbC10by1hY2NlbGVyYXRlLURlRmktZXhvdGljLXN0cnVjdHVyZWQtcHJvZHVjdHMtb24tY2hhaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Cega fundraising tops $9.3M in total to accelerate DeFi exotic structured products on-chain - Business Wire",
        "content": "SINGAPORE--(BUSINESS WIRE)--Cega Finance (“Cega”) is pleased to announce that it closed a $5 million funding round led by Dragonfly Capital with continued participation from Pantera Capital and Robot Ventures (Tarun Chitra and Robert Leshner). This brings the startup’s total seed funding raised to $9.3 million.\n\nCega is the first protocol to create exotic options structured products on-chain and has been a leading provider of DeFi crypto structured products since its launch in June 2022. Cega’s volumes and TVL have been #1 in Solana and #4 across all chains, with the protocol kickstarting the market for exotic options with crypto underlyings. Cega has been lauded for its strong operations and risk management during the FTX crisis back in November, and has also established itself as a market leader in counterparty management. This recent fundraising was conducted to accelerate the expansion of Cega’s product catalog, develop new DeFi innovative primitives, and create a trading team for exotic derivative specialists.\n\n“ The team is excited to create never before seen products in DeFi that are high performing and offer users strong risk-adjusted yield. We are also excited to offer the best execution in the market through a competitive in-house liquidity maker and tap into the multi-trillion dollar exotic derivatives market,” said Arisa Toyosaki, co-founder and CEO of Cega.\n\nCega built a decentralized application that combines basic options (e.g. call/put) with advanced options characteristics to create packaged “structured” offerings for DeFi users. Its first exotic options structured product is the fixed coupon note, which is a basket of puts with knock-in barriers. This exotic structured product benefits retail investors by offering superior yield, built-in downside protection, and compounded returns. It also benefits market makers by providing a discounted hedge for their portfolio as well as allowing proprietary gains through hedging trades.\n\n“ Cega has created an entirely new DeFi primitive through their innovation in exotic option smart contracts that was a 0-to-1 product with strong organic traction,” said Tom Schmidt, General Partner at Dragonfly Capital Partners. “ The protocol has weathered the numerous blow-ups from last year without losing any funds, a testament to the team’s experience and diligence. In this same time, they’ve grown to be the #1 options protocol on Solana and one of the top derivatives protocols in the DeFi space overall. We at Dragonfly are thrilled to continue backing their vision of being the #1 DeFi derivatives protocol, and for them to bring never-before-seen products into this space.”\n\nCega is continuing to revolutionize the DeFi space by offering brand new capabilities to the DeFi ecosystem. With strong experience and a strong team, Cega will continue to push the boundaries of DeFi derivatives.\n\nAbout Cega:\n\nCega is a decentralized finance application. Cega creates exotic derivative contracts as well as consumer-facing staking products for the retail audience. Cega brings together a talented team of former derivative traders, developers, and founders, as well as a community of experts in the field. This expertise will allow for the development of exotic structured products that generate high yields with built-in downside protection for investors. Cega is building the leading platform for decentralized financial products.\n\nTo learn more, please visit: https://cega.fi/\n\nTwitter: twitter.com/cega_fi\n\nDiscord: discord.gg/cega"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDMyMzAwNTA0My9lbi9DZWdhLWZ1bmRyYWlzaW5nLXRvcHMtOS4zTS1pbi10b3RhbC10by1hY2NlbGVyYXRlLURlRmktZXhvdGljLXN0cnVjdHVyZWQtcHJvZHVjdHMtb24tY2hhaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Cega fundraising tops $9.3M in total to accelerate DeFi exotic structured products on-chain - Business Wire",
        "content": "SINGAPORE--(BUSINESS WIRE)--Cega Finance (“Cega”) is pleased to announce that it closed a $5 million funding round led by Dragonfly Capital with continued participation from Pantera Capital and Robot Ventures (Tarun Chitra and Robert Leshner). This brings the startup’s total seed funding raised to $9.3 million.\n\nCega is the first protocol to create exotic options structured products on-chain and has been a leading provider of DeFi crypto structured products since its launch in June 2022. Cega’s volumes and TVL have been #1 in Solana and #4 across all chains, with the protocol kickstarting the market for exotic options with crypto underlyings. Cega has been lauded for its strong operations and risk management during the FTX crisis back in November, and has also established itself as a market leader in counterparty management. This recent fundraising was conducted to accelerate the expansion of Cega’s product catalog, develop new DeFi innovative primitives, and create a trading team for exotic derivative specialists.\n\n“ The team is excited to create never before seen products in DeFi that are high performing and offer users strong risk-adjusted yield. We are also excited to offer the best execution in the market through a competitive in-house liquidity maker and tap into the multi-trillion dollar exotic derivatives market,” said Arisa Toyosaki, co-founder and CEO of Cega.\n\nCega built a decentralized application that combines basic options (e.g. call/put) with advanced options characteristics to create packaged “structured” offerings for DeFi users. Its first exotic options structured product is the fixed coupon note, which is a basket of puts with knock-in barriers. This exotic structured product benefits retail investors by offering superior yield, built-in downside protection, and compounded returns. It also benefits market makers by providing a discounted hedge for their portfolio as well as allowing proprietary gains through hedging trades.\n\n“ Cega has created an entirely new DeFi primitive through their innovation in exotic option smart contracts that was a 0-to-1 product with strong organic traction,” said Tom Schmidt, General Partner at Dragonfly Capital Partners. “ The protocol has weathered the numerous blow-ups from last year without losing any funds, a testament to the team’s experience and diligence. In this same time, they’ve grown to be the #1 options protocol on Solana and one of the top derivatives protocols in the DeFi space overall. We at Dragonfly are thrilled to continue backing their vision of being the #1 DeFi derivatives protocol, and for them to bring never-before-seen products into this space.”\n\nCega is continuing to revolutionize the DeFi space by offering brand new capabilities to the DeFi ecosystem. With strong experience and a strong team, Cega will continue to push the boundaries of DeFi derivatives.\n\nAbout Cega:\n\nCega is a decentralized finance application. Cega creates exotic derivative contracts as well as consumer-facing staking products for the retail audience. Cega brings together a talented team of former derivative traders, developers, and founders, as well as a community of experts in the field. This expertise will allow for the development of exotic structured products that generate high yields with built-in downside protection for investors. Cega is building the leading platform for decentralized financial products.\n\nTo learn more, please visit: https://cega.fi/\n\nTwitter: twitter.com/cega_fi\n\nDiscord: discord.gg/cega"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmJ1c3RsZS5jb20vZW50ZXJ0YWlubWVudC9zdWNjZXNzaW9uLXNlYXNvbi00LWZpbG1pbmctbG9jYXRpb25z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "'Succession' Season 4 Filming Locations: New York Penthouses, Estates, & More - Bustle",
        "content": "Succession might be a drama about the Shakespearean power struggle between adult nepo babies (and their iconic in-laws) — but it’s also a luxury travel show. From real New York restaurants you can definitely visit, to enormous yachts you can probably only imagine, the Emmy darling series has been filmed in countless aspirational locales since its debut in 2018. Now that the show is ending, here’s a look at some of the most notable Succession Season 4 filming locations so far.\n\nTom & Shiv’s House: 120 Broadway\n\nTom and Shiv aren’t a very happy couple on Succession, so it’s no surprise that their luxury New York apartment gets so little screentime. They’re rarely there together! But their residence does end up playing a pretty important role during the Season 4 premiere, where Shiv could be seen walking into 120 Broadway to have a pivotal relationship talk with Tom.\n\nThe skyscraper, known as the Equitable Building, also made an appearance in 2013’s The Wolf of Wall Street, Untapped New York points out. Of course, between its historic charm and glitzy features like gold leaf accents, it’s only natural that the building has played host to some of the buzziest depictions of wealth in film and TV.\n\nSibling Brainstorming: The San Onofre Estate\n\nAnother Succession Season 4 filming location can be found on the opposite coast — over in Pacific Palisades, California, to be exact. According to Architectural Digest, it’s in the San Onofre Estate that Shiv, Kendall, and Roman brainstorm ideas for a media company they hope will rival their dad’s and GoJo.\n\nIt makes sense they would choose such a spot because the property has a tech connection IRL: It reportedly belongs to a young tech CEO, Dirt.com points out. Before he bought it for $83 million in 2021, Williams & Williams advertised the property as a rental for the casual price of $350,000 per month. The steep price would be worth it to the Roys, of course; it boasts “total privacy and seclusion” with features like a Nobu-designed chef’s kitchen, infinity pool, and even a ballistic safe room, per the real estate group.\n\nNan Pierce’s House: Villa Solana\n\nThe siblings paid a visit to the Pierces for business negotiations during the Season 4 premiere — and as Twitter user @Kristytipsy pointed out, the beautiful property seems to be the Peabody Estate, aka Villa Solana, in Santa Barbara, California.\n\nAccording to the Wall Street Journal, this mansion has tech ties, too, and was reportedly sold to former Google CEO Eric Schmidt for nearly $31 million in 2020.\n\nLogan’s House: The American Irish Historical Society\n\nAccording to Architectural Digest, the exterior of patriarch Logan Roy’s abode is a tower on Billionaires Row, lining the Southern end of Central Park. Most of the interiors are a soundstage, but Untapped New York reports that the townhouse lobby is actually that of the American Irish Historical Society on Fifth Avenue.\n\nNeilson Barnard/Getty Images Entertainment/Getty Images\n\nLogan’s Diner Of Choice: Nectar\n\nDuring the Season 4 premiere, Logan takes a break from family business drama to have dinner at Nectar on the Upper East Side. (You can even spot the diner’s name on his menu.) So if you want to live the Succession lifestyle for a day, this is definitely your most affordable way in.\n\nKendall’s New Penthouse: 180 East 88th Street\n\nIn the opening shots of the fourth episode, eagle-eyed fans might have noticed that Kendall has some new digs. He’s got a penchant for gratuitous homes, and the penthouse of 180 East 88th Street in Manhattan’s Upper East Side is no exception. The building’s largest apartment is on the market for a cool $29 million and boasts five bedrooms, private terraces, and floor-to-ceiling windows with unobstructed views of the city.\n\nGet Even More From Bustle — Sign Up For The Newsletter From hair trends to relationship advice, our daily newsletter has everything you need to sound like a person who’s on TikTok, even if you aren’t. Bustle Daily Up Next Submit By subscribing to this BDG newsletter, you agree to our Terms of Service and Privacy Policy Subscribe to our newsletter > More like this"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS8xNS1tb250aHMtbGF0ZXItd2hhdC1jaGFuZ2VkLXNpbmNlLW5vdmVtYmVyLTIwMjEtaW50ZXJ2aWV3LXdpdGgtcGhhbnRvbS13YWxsZXQtY2VvL9IBcGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS8xNS1tb250aHMtbGF0ZXItd2hhdC1jaGFuZ2VkLXNpbmNlLW5vdmVtYmVyLTIwMjEtaW50ZXJ2aWV3LXdpdGgtcGhhbnRvbS13YWxsZXQtY2VvLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "15 Months Later, What Changed Since November 2021? Interview With Phantom Wallet CEO - CryptoPotato",
        "content": "A lot can happen in a year and a half.\n\nThe cryptocurrency market has been through a literal rollercoaster in terms of price, regulations, and overall development.\n\nExchanges imploded, multi-billion dollar ecosystems collapsed, regulators are stepping in now more than ever, banks are shutting down, and whatnot. And it almost seems as if time is flying.\n\nIn 2021, CryptoPotato attended Solana’s Breakpoint in Lisbon and had the chance to talk to Brandon Millman – the CEO of the largest self-custody wallet on Solana – Phantom. Fast forward some 15 months later, and we spoke to him again – this time during ETH Denver in 2023.\n\nWhy is a Solana-native wallet at ETH Denver? Phantom is currently in its multichain beta, adding both Ethereum and Polygon chains to its wallet experience. Brandon and his team, previous 0x engineers, are returned to the Ethereum community to debut Phantoms wallet.\n\nLet’s dive in.\n\nA Vortex of Ups and Downs: From 2021 to 2023\n\nQ: So, the last time we talked was during Breakpoint in Lisbon in 2021. It’s safe to say that the industry is nowhere near where it was back then. Let’s dive right into it – what has changed for you guys since then?\n\nA: November 2021 saw the crypto market cap hit an all-time high. It was an amazing year for all of crypto. One thing that was very interesting was the NFT market on Solana really taking off in 2022. I think it started going in August 2021 and then switched to full gear in 2022.\n\nUp until August or September 2022, there was a lot of NFT activity on Solana (pre-FTX scandal) — much of it by Magic Eden. Together with Phantom, this delivered an unrivaled NFT experience and helped contribute to substantial growth.\n\nWhat we noticed was that Solana attracted a really different demographic than Ethereum. There was not much overlap – Solana had a much younger crowd, which was a perfect match for new NFT projects that were more affordable and attainable. Not to mention, this group of collectors was predominantly US-based.\n\nObviously, toward the end of the year, there was the FTX debacle. Due to FTX’s proximity to the Solana ecosystem, some projects were caught in the blast radius. At the same time, FTX caused a massive flight from centralized exchanges to non-custodial products. It was an interesting dichotomy where on one hand, Solana wasn’t doing so great, but we were getting a large influx of people fleeing from not only FTX but also other centralized exchanges – everyone was scared.\n\nQ: Where did the FTX collapse catch you?\n\nA: I was in Lisbon for Breakpoint 2022. It was such an amazing conference – so many developers and builders, and it was really packed with awesome stuff. The news broke when I was on the plane back.\n\nAt first, I didn’t understand it – there was a tweet from SBF about the strategic buyout from Binance, and I didn’t understand what I was reading – I thought, “oh, that’s crazy, Binance is buying FTX?” But then more news came out, and I started to worry about the entire industry. FTX was such a prominent public figure in mainstream crypto.\n\nIn general, I was glad that the US didn’t take a completely knee-jerk reaction in terms of regulation. I thought the government would try to start shutting all of our industry down immediately.\n\nSolana’s Collapse and its Unexpected Surprises\n\nQ: From one of the quickest-growing ecosystems, Solana crashed and burned in 2022 following the scandal with FTX. How has the community changed since then? What’s the biggest difference you’ve noticed?\n\nA: The Solana community has been really resilient. There’s a very strong, genuine core that’s very loyal and has stuck around. Developer activity continued to grow.\n\nBut in general, people remain loyal to Solana. There were a lot of competing layer-ones coming out, and some people left, but the majority of people stayed.\n\nVenturing to Ethereum and Polygon: New Avenues for Phantom Wallet\n\nQ: Have you considered adding support for other networks in the aftermath of the bear market?\n\nA: Phantom currently has a multi-chain wallet extension and mobile app in beta with support for Solana, Ethereum, and Polygon – all under one app. It’s being used by 70K beta testers at the moment, and we are moving toward the goal of launching it publicly within the next month.\n\nOnce that’s out, Phantom will become the MetaMask replacement for Ethereum and Polygon. That’s the configuration we will be in when we launch, and we are always evaluating the other ecosystems and chains.\n\nQ: What would be your advantage against MetaMask?\n\nA: I would say we have three different core advantages.\n\nBeing a multichain-first wallet, users will be able to utilize Solana, Ethereum, and Polygon all at the same time without having to switch networks. They are connected to all of them at the same time and can see an aggregated view of all assets.\n\nPhantom also excels at safety features. We spend a lot of time building features such as transaction simulation before you sign something, automated NFT spam filtering – like how email spam filters work, and many others.\n\nLastly, we make sure that our wallet has the best NFT features possible – the above security features and also selling NFTs directly from within the app, rich metadata about floor price, purchase price, and so forth.\n\nWhen Phantom Wallet Token and What’s the Next Big Trend?\n\nQ: How has the broader market decline impacted registrations altogether?\n\nA: During these more bear market periods, the userbase does become quite zero-sum – it’s not a lot of new users, but it’s a lot of the same users from across ecosystems. We will be mainly focused on catering to existing users.\n\nQ: We asked you this back in Lisbon, but I can’t not ask it again – when Phantom token?\n\nA: We want to create longevity, and it’s not clear how a token fits into that.I think there’s more risk than reward with the token at the moment, so it’s not currently on our roadmap.\n\nQ: Where will the big next trend come from?\n\nA: One thing that’s been interesting is that a lot of trends almost always come out from nowhere. There are these very crypto-native ideas that get very popular. People are excited about Web3 gaming. I’m still waiting to see what’s going to happen there.\n\nI could see more niche crypto games, maybe something with a token – that becomes very popular – something more experimental. That would be my guess."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS8xNS1tb250aHMtbGF0ZXItd2hhdC1jaGFuZ2VkLXNpbmNlLW5vdmVtYmVyLTIwMjEtaW50ZXJ2aWV3LXdpdGgtcGhhbnRvbS13YWxsZXQtY2VvL9IBcGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS8xNS1tb250aHMtbGF0ZXItd2hhdC1jaGFuZ2VkLXNpbmNlLW5vdmVtYmVyLTIwMjEtaW50ZXJ2aWV3LXdpdGgtcGhhbnRvbS13YWxsZXQtY2VvLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "15 Months Later, What Changed Since November 2021? Interview With Phantom Wallet CEO - CryptoPotato",
        "content": "A lot can happen in a year and a half.\n\nThe cryptocurrency market has been through a literal rollercoaster in terms of price, regulations, and overall development.\n\nExchanges imploded, multi-billion dollar ecosystems collapsed, regulators are stepping in now more than ever, banks are shutting down, and whatnot. And it almost seems as if time is flying.\n\nIn 2021, CryptoPotato attended Solana’s Breakpoint in Lisbon and had the chance to talk to Brandon Millman – the CEO of the largest self-custody wallet on Solana – Phantom. Fast forward some 15 months later, and we spoke to him again – this time during ETH Denver in 2023.\n\nWhy is a Solana-native wallet at ETH Denver? Phantom is currently in its multichain beta, adding both Ethereum and Polygon chains to its wallet experience. Brandon and his team, previous 0x engineers, are returned to the Ethereum community to debut Phantoms wallet.\n\nLet’s dive in.\n\nA Vortex of Ups and Downs: From 2021 to 2023\n\nQ: So, the last time we talked was during Breakpoint in Lisbon in 2021. It’s safe to say that the industry is nowhere near where it was back then. Let’s dive right into it – what has changed for you guys since then?\n\nA: November 2021 saw the crypto market cap hit an all-time high. It was an amazing year for all of crypto. One thing that was very interesting was the NFT market on Solana really taking off in 2022. I think it started going in August 2021 and then switched to full gear in 2022.\n\nUp until August or September 2022, there was a lot of NFT activity on Solana (pre-FTX scandal) — much of it by Magic Eden. Together with Phantom, this delivered an unrivaled NFT experience and helped contribute to substantial growth.\n\nWhat we noticed was that Solana attracted a really different demographic than Ethereum. There was not much overlap – Solana had a much younger crowd, which was a perfect match for new NFT projects that were more affordable and attainable. Not to mention, this group of collectors was predominantly US-based.\n\nObviously, toward the end of the year, there was the FTX debacle. Due to FTX’s proximity to the Solana ecosystem, some projects were caught in the blast radius. At the same time, FTX caused a massive flight from centralized exchanges to non-custodial products. It was an interesting dichotomy where on one hand, Solana wasn’t doing so great, but we were getting a large influx of people fleeing from not only FTX but also other centralized exchanges – everyone was scared.\n\nQ: Where did the FTX collapse catch you?\n\nA: I was in Lisbon for Breakpoint 2022. It was such an amazing conference – so many developers and builders, and it was really packed with awesome stuff. The news broke when I was on the plane back.\n\nAt first, I didn’t understand it – there was a tweet from SBF about the strategic buyout from Binance, and I didn’t understand what I was reading – I thought, “oh, that’s crazy, Binance is buying FTX?” But then more news came out, and I started to worry about the entire industry. FTX was such a prominent public figure in mainstream crypto.\n\nIn general, I was glad that the US didn’t take a completely knee-jerk reaction in terms of regulation. I thought the government would try to start shutting all of our industry down immediately.\n\nSolana’s Collapse and its Unexpected Surprises\n\nQ: From one of the quickest-growing ecosystems, Solana crashed and burned in 2022 following the scandal with FTX. How has the community changed since then? What’s the biggest difference you’ve noticed?\n\nA: The Solana community has been really resilient. There’s a very strong, genuine core that’s very loyal and has stuck around. Developer activity continued to grow.\n\nBut in general, people remain loyal to Solana. There were a lot of competing layer-ones coming out, and some people left, but the majority of people stayed.\n\nVenturing to Ethereum and Polygon: New Avenues for Phantom Wallet\n\nQ: Have you considered adding support for other networks in the aftermath of the bear market?\n\nA: Phantom currently has a multi-chain wallet extension and mobile app in beta with support for Solana, Ethereum, and Polygon – all under one app. It’s being used by 70K beta testers at the moment, and we are moving toward the goal of launching it publicly within the next month.\n\nOnce that’s out, Phantom will become the MetaMask replacement for Ethereum and Polygon. That’s the configuration we will be in when we launch, and we are always evaluating the other ecosystems and chains.\n\nQ: What would be your advantage against MetaMask?\n\nA: I would say we have three different core advantages.\n\nBeing a multichain-first wallet, users will be able to utilize Solana, Ethereum, and Polygon all at the same time without having to switch networks. They are connected to all of them at the same time and can see an aggregated view of all assets.\n\nPhantom also excels at safety features. We spend a lot of time building features such as transaction simulation before you sign something, automated NFT spam filtering – like how email spam filters work, and many others.\n\nLastly, we make sure that our wallet has the best NFT features possible – the above security features and also selling NFTs directly from within the app, rich metadata about floor price, purchase price, and so forth.\n\nWhen Phantom Wallet Token and What’s the Next Big Trend?\n\nQ: How has the broader market decline impacted registrations altogether?\n\nA: During these more bear market periods, the userbase does become quite zero-sum – it’s not a lot of new users, but it’s a lot of the same users from across ecosystems. We will be mainly focused on catering to existing users.\n\nQ: We asked you this back in Lisbon, but I can’t not ask it again – when Phantom token?\n\nA: We want to create longevity, and it’s not clear how a token fits into that.I think there’s more risk than reward with the token at the moment, so it’s not currently on our roadmap.\n\nQ: Where will the big next trend come from?\n\nA: One thing that’s been interesting is that a lot of trends almost always come out from nowhere. There are these very crypto-native ideas that get very popular. People are excited about Web3 gaming. I’m still waiting to see what’s going to happen there.\n\nI could see more niche crypto games, maybe something with a token – that becomes very popular – something more experimental. That would be my guess."
    }
]