[
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8xMi8zNjA4NDM4My90aGlzLXNvbGFuYS1iYXNlZC1tZW1lLWNvaW4tanVzdC1yZWFjaGVkLWFsbC10aW1lLWhpZ2hzLWxlYXZpbmctZG9nZWNvaW4tc2hpYmEtaW51LWluLXRoZS3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "This Solana-Based Meme Coin Just Reached All-Time Highs, Leaving Dogecoin, Shiba Inu In The Dust - Benzinga",
        "content": "BONK BONK/USD, the dog-themed meme coin on the Solana SOL/USD network, reached a new all-time high of $0.0000066 on Monday.\n\nWhat Happened: At the time of writing, BONK was trading an impressive $0.0000061, representing a 24-hour increase of 12%. Meanwhile, Dogecoin DOGE/USD, Shiba Inu SHIB/USD were up 2-4% each.\n\nIn the last 30 days, BONK witnessed a 750% increase. This growth can be attributed to the heightened investor interest in Solana, the blockchain platform underpinning BONK’s operations.\n\nThe surge also comes as KuCoin, a crypto exchange, also listed BONK via the BONK/USDT trading pair. In the last 24 hours, BONK's trading volume has jumped over 270% reaching $182 million.\n\nParallel to BONK’s success, Solana has ascended to become the sixth-largest cryptocurrency by market capitalization. SOL is still recovering from its fall from an all-time high of nearly $260 recorded in late 2021—a peak period for cryptocurrencies, including frontrunners Bitcoin BTC/USD and Ethereum ETH/USD. Even with its tumble to a low near $8 in late 2022, SOL has since made a comeback.\n\nSee More: Dogecoin HODLERs Are Beating Shiba Inu With 57% Landing In Profits, IntoTheBlock Data Reveals\n\nWhy It Matters: Meme coins are typically born from internet memes or humorous concepts. However, certain meme coins, such as Dogecoin and its competitor Shiba Inu, have secured their spots as the 10th and 19th largest cryptocurrencies by market capitalization, respectively.\n\nImage Via Shutterstock\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93ZWVrLWRlZmktc29sYW5hLWFpcmRyb3Atc2Vhc29uLTA3MTI1NzUyNi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Week in DeFi: Solana Airdrop Season in Full Swing - Yahoo Finance",
        "content": "Week in DeFi: Solana Airdrop Season in Full Swing\n\nThe Kyber Network exploiter releases a long list of extreme demands to the team, including full control over the protocol, Chainlink unveils Chainlink staking v0.2 and finally, Solana airdrop season is on, with Jito announcing their upcoming airdrop and Jupiter Exchange dropping their airdrop checker for users.\n\nMassive week in the world of DeFi! Let’s dive deeper into what went down in DeFi this past week.\n\nOverview\n\nTotal value locked (TVL) across all chains continue their climb for the third week in a row as cryptocurrency majors push towards new yearly highs. Notable outperformers include BitDAO-backed L2, Mantle, and ConsenSys-backed zero-knowledge Ethereum Virtual Machine (zkEVM) chain, Linea, which saw increases of 35% and 25% in TVL respectively.\n\nSource: https://coinmarketcap.com/chain-ranking/\n\nWelcome to Alpha Central\n\n0xShual covers how he looks at on-chain trading, using two examples.\n\nTL;DR:\n\nCheck the behaviors of top holders and top liquidity providers: are they buying, selling, holding etc.\n\nObserve the behavior of recent buyers and sellers in terms of size, reason, frequency\n\nLook into how much liquidity there is in the liquidity pool, on V2 and V3 pools, how long liquidity providers have been in the pool and what they are trying to achieve, among other factors\n\nStacy dives deep into the growing decentralized Physical Infrastructure sector, or DePIN for short.\n\nTL;DR:\n\nCovers industries such as cloud services, telecommunications, sensor analytics and energy networks\n\nCrypto presents an interesting use case for uniting decentralized infrastructure together for a common cause using the token model to create a positive flywheel between network usage and token price\n\nEthereum: Kyber Network Exploiter Demands Full Control\n\nOracle protocol, Chainlink, officially deploys Chainlink Staking v0.2 on the Ethereum mainnet. Access to staking will open up in three phases, starting with existing v0.1 stakers to migrate their positions, Early Access users and then finally, General Access.\n\nETH liquid staking protocol, Stakewise, unveils Stakewise V3 on the Ethereum mainnet. V3 introduces the ETH staking marketplace, allowing users to choose their favorite node operators based on APYs, fees, insurance and more. V3 also introduces osETH, Stakewise’s own liquid staking derivative (LSD) token.\n\nOther Product Launches and Updates\n\nStory continues\n\nL2s: Velodrome Hit With Two Frontend Exploit\n\nOptimism liquidity hub, Velodrome, and sister protocol on Base, Aerodrome, have suffered a frontend exploit. Although they initially quickly regained control, the frontend provider suffered a second exploit later in the week, rendering the frontends unsafe to use again.\n\nOther Product Launches and Updates\n\nCosmos: Jae Kwon Forks Cosmos Hub\n\nCosmos co-founder Jae Kwon proposes the forking of the Cosmos Hub, after the passing of the recent Cosmos Hub proposal to curb emissions. The new chain will be named AtomOne with the corresponding token, ATOM1.\n\nDYdX chain finally goes live with trading and trading rewards. Traders can now earn from a pool of 50,000 DYDX tokens daily for successful trades based on the trading fees incurred. Additionally, a pool of $20 million in incentives will be provided for the next six months to incentivise trading on the chain.\n\nCosmos-based L1, Sei, announces Sei V2, seeking to bring parallelization to the Ethereum Virtual Machine (EVM). The move would enable any EVM-based application to deploy on Sei V2 to leverage its high throughput and low cost. The upgrade is expected to launch in Q2 2024.\n\nAnother Week, Another Airdrop\n\nDominant Solana liquid staking protocol, Jito, announces their upcoming token, JTO, and retrospective airdrop. 10% of the total supply, or 100 million tokens, will be used for the airdrop. The snapshot for Jito points has been taken on Nov. 25 2023 and points will no longer be updated.\n\nSolana DEX aggregator, Jupiter Exchange, releases their airdrop checker for the first wave of their retrospective airdrop to users of the platform.\n\nTweet of the Week\n\nCollapsed crypto hedge fund Three Arrows Capital founder, Su Zhu, announces his return, after being arrested in late September earlier this year.\n\nStay updated on your favorite projects and stay tuned for next week’s edition, and keep supporting your favorite projects, degens!"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93ZWVrLWRlZmktc29sYW5hLWFpcmRyb3Atc2Vhc29uLTA3MTI1NzUyNi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Week in DeFi: Solana Airdrop Season in Full Swing - Yahoo Finance",
        "content": "Week in DeFi: Solana Airdrop Season in Full Swing\n\nThe Kyber Network exploiter releases a long list of extreme demands to the team, including full control over the protocol, Chainlink unveils Chainlink staking v0.2 and finally, Solana airdrop season is on, with Jito announcing their upcoming airdrop and Jupiter Exchange dropping their airdrop checker for users.\n\nMassive week in the world of DeFi! Let’s dive deeper into what went down in DeFi this past week.\n\nOverview\n\nTotal value locked (TVL) across all chains continue their climb for the third week in a row as cryptocurrency majors push towards new yearly highs. Notable outperformers include BitDAO-backed L2, Mantle, and ConsenSys-backed zero-knowledge Ethereum Virtual Machine (zkEVM) chain, Linea, which saw increases of 35% and 25% in TVL respectively.\n\nSource: https://coinmarketcap.com/chain-ranking/\n\nWelcome to Alpha Central\n\n0xShual covers how he looks at on-chain trading, using two examples.\n\nTL;DR:\n\nCheck the behaviors of top holders and top liquidity providers: are they buying, selling, holding etc.\n\nObserve the behavior of recent buyers and sellers in terms of size, reason, frequency\n\nLook into how much liquidity there is in the liquidity pool, on V2 and V3 pools, how long liquidity providers have been in the pool and what they are trying to achieve, among other factors\n\nStacy dives deep into the growing decentralized Physical Infrastructure sector, or DePIN for short.\n\nTL;DR:\n\nCovers industries such as cloud services, telecommunications, sensor analytics and energy networks\n\nCrypto presents an interesting use case for uniting decentralized infrastructure together for a common cause using the token model to create a positive flywheel between network usage and token price\n\nEthereum: Kyber Network Exploiter Demands Full Control\n\nOracle protocol, Chainlink, officially deploys Chainlink Staking v0.2 on the Ethereum mainnet. Access to staking will open up in three phases, starting with existing v0.1 stakers to migrate their positions, Early Access users and then finally, General Access.\n\nETH liquid staking protocol, Stakewise, unveils Stakewise V3 on the Ethereum mainnet. V3 introduces the ETH staking marketplace, allowing users to choose their favorite node operators based on APYs, fees, insurance and more. V3 also introduces osETH, Stakewise’s own liquid staking derivative (LSD) token.\n\nOther Product Launches and Updates\n\nStory continues\n\nL2s: Velodrome Hit With Two Frontend Exploit\n\nOptimism liquidity hub, Velodrome, and sister protocol on Base, Aerodrome, have suffered a frontend exploit. Although they initially quickly regained control, the frontend provider suffered a second exploit later in the week, rendering the frontends unsafe to use again.\n\nOther Product Launches and Updates\n\nCosmos: Jae Kwon Forks Cosmos Hub\n\nCosmos co-founder Jae Kwon proposes the forking of the Cosmos Hub, after the passing of the recent Cosmos Hub proposal to curb emissions. The new chain will be named AtomOne with the corresponding token, ATOM1.\n\nDYdX chain finally goes live with trading and trading rewards. Traders can now earn from a pool of 50,000 DYDX tokens daily for successful trades based on the trading fees incurred. Additionally, a pool of $20 million in incentives will be provided for the next six months to incentivise trading on the chain.\n\nCosmos-based L1, Sei, announces Sei V2, seeking to bring parallelization to the Ethereum Virtual Machine (EVM). The move would enable any EVM-based application to deploy on Sei V2 to leverage its high throughput and low cost. The upgrade is expected to launch in Q2 2024.\n\nAnother Week, Another Airdrop\n\nDominant Solana liquid staking protocol, Jito, announces their upcoming token, JTO, and retrospective airdrop. 10% of the total supply, or 100 million tokens, will be used for the airdrop. The snapshot for Jito points has been taken on Nov. 25 2023 and points will no longer be updated.\n\nSolana DEX aggregator, Jupiter Exchange, releases their airdrop checker for the first wave of their retrospective airdrop to users of the platform.\n\nTweet of the Week\n\nCollapsed crypto hedge fund Three Arrows Capital founder, Su Zhu, announces his return, after being arrested in late September earlier this year.\n\nStay updated on your favorite projects and stay tuned for next week’s edition, and keep supporting your favorite projects, degens!"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2E3ZTYwZDQyLTU4ZDQtNDkzMS05MjNhLWFlYTIxNzBhMWJjNdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Buying frenzy puts some Grayscale crypto funds at 'absurd' premiums - Financial Times",
        "content": "Print this page\n\nThe stories that matter on money and politics in the race for the White House\n\nLatest news on ETFs Visit our ETF Hub to find out more and to explore our in-depth data and comparison tools\n\nSome cryptocurrency funds run by the world’s largest crypto manager are trading at as much as eight times their underlying value amid an unprecedented buying frenzy.\n\nThe sharp price gains are the latest sign of the passing of the “crypto winter”. The price of bitcoin has jumped to a 20-month high of $42,000 amid expectation of the imminent launch of US exchange traded funds directly tracking the world’s largest digital token.\n\nThe mania has spread to a host of private trusts operated by Grayscale. The company’s Filecoin Trust is trading at $34.25, 721 per cent above its net asset value of $4.17, having hit a premium of more than 1,000 per cent in November.\n\nIts trust tracking solana, the third-largest cryptocurrency after bitcoin and ether, is at a premium of 302 per cent, while those investing in chainlink, livepeer, lumens and Decentraland’s mana token are priced at between twice and four times their NAV.\n\n“It’s absurd. I feel the investor doesn’t really understand what they are getting into,” said Bradley Duke, chief strategist of ETC Group, which runs more than $1bn in European-listed crypto exchange traded products.\n\n“I wouldn’t know what [investors] could be thinking buying at these prices,” said Bryan Armour, director of passive strategies research, North America, at Morningstar. “A lack of understanding can easily be part of it.”\n\nThe funds can only be traded via OTC Markets Group, formerly known as the “pink sheets” market, where over-the-counter secondary trading in pre-existing shares takes place. Shares cannot be redeemed, while new shares can only be created if Grayscale carries out a private placement exercise, meaning there is no arbitrage mechanism to bring prices back in line with the underlying holdings.\n\nHowever, most of the premiums only emerged, or widened sharply, in November, coinciding with a rally in the price of many cryptocurrencies.\n\n“There is a very strong appetite for crypto products at the moment as the crypto winter has melted. Investors are allocating to crypto in larger allocations and also diversifying from bitcoin and ethereum,” said Michael Sonnenshein, chief executive of Grayscale.\n\nHe believed some investors may be willing to pay well over the odds for Grayscale’s trusts in order to access cryptocurrencies “through a product wrapper that is known to them, is familiar and gives them added protections that they are used to seeing when they invest in any other asset”. The alternative is to trade via an unregulated crypto exchange.\n\nFor many of these tokens, Grayscale’s funds are the only regulated products available to US retail investors.\n\n“Because there are so few regulated products out there, the investors who don’t want to, or can’t, invest directly in these assets have little choice,” said Duke. “As a result, these products end up trading at these huge premiums. It’s a function of the structure of the products.”\n\n“I guess it’s down to accessibility,” said Armour, although he added that cryptocurrencies “have such high volatility it might be [that investors] don’t even care” at what price they are buying.\n\nAnother contributory factor may be limited liquidity, given the small size of some of the trusts. The Filecoin Trust has assets of just $464,000 and the solana vehicle, the largest currently trading at a significant premium, at $10.8mn.\n\n“These are fairly illiquid products and, as solana spot has seen, these illiquid products are seen as proxies by those who can’t buy solana directly in their funds or prefer not to,” said Gautam Chhugani, senior analyst, global digital assets at AB Bernstein.\n\nDuke argued that the large departures from net asset value showed the benefit of the European model. According to this, in contrast, scores of exchange traded products that invest directly in a rich array of cryptocurrencies — including those operated by ETC Group — “track the underlying almost perfectly”.\n\nThey are analogous to ETFs in the US but need to call themselves ETPs because they fail to meet European Ucits regulations on portfolio diversification.\n\nThe Securities and Exchange Commission has so far not permitted any such “spot” cryptocurrency ETFs in the US. Instead it only allows ETFs that invest in the futures market. Expectation is widespread that BlackRock and rival operators will be given the green light early next year.\n\n“Without regulated products these kinds of [price] anomalies are likely to exist,” Duke said. “I think we are very lucky in Europe . . . the ETP wrapper is far more efficient with the ETPs trading at or very close to NAV.”\n\nIn contrast, the US private trust structure “is problematic. And Grayscale recognise it’s problematic,” he added.\n\nLatest news on ETFs Visit the ETF Hub to find out more and to explore our in-depth data and comparison tools helping you to understand everything from performance to ESG ratings\n\nGrayscale has fought a long battle with the SEC to allow it to convert its flagship Bitcoin Trust (GBTC), at $24.1bn the world’s largest bitcoin fund, into an ETF. In August, a federal appeals court in Washington DC ruled that the SEC was wrong to reject Grayscale’s application to convert GBTC.\n\nAlthough this trust still trades at a discount to NAV, this discount has narrowed to a 28-month low of 8.7 per cent — from a nadir of almost 50 per cent in December 2022 — in anticipation of the likelihood of Grayscale being given the go-ahead to convert it into an ETF.\n\nThe company has also filed with the SEC to transform its $6.2bn Ethereum Trust (ETHE), again the largest such vehicle in the world, into an ETF. This trades at a discount of 14.6 per cent, a far cry from the near-60 per cent level seen at the turn of the year.\n\nSonnenshein said that, in the fullness of time, he would like to see the rest of Grayscale’s 17-strong product suite follow suit. “The goal would be to uplift all these products to ETFs,” he said."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2E3ZTYwZDQyLTU4ZDQtNDkzMS05MjNhLWFlYTIxNzBhMWJjNdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Dec 2023 08:00:00 GMT",
        "title": "Buying frenzy puts some Grayscale crypto funds at 'absurd' premiums - Financial Times",
        "content": "Print this page\n\nThe stories that matter on money and politics in the race for the White House\n\nLatest news on ETFs Visit our ETF Hub to find out more and to explore our in-depth data and comparison tools\n\nSome cryptocurrency funds run by the world’s largest crypto manager are trading at as much as eight times their underlying value amid an unprecedented buying frenzy.\n\nThe sharp price gains are the latest sign of the passing of the “crypto winter”. The price of bitcoin has jumped to a 20-month high of $42,000 amid expectation of the imminent launch of US exchange traded funds directly tracking the world’s largest digital token.\n\nThe mania has spread to a host of private trusts operated by Grayscale. The company’s Filecoin Trust is trading at $34.25, 721 per cent above its net asset value of $4.17, having hit a premium of more than 1,000 per cent in November.\n\nIts trust tracking solana, the third-largest cryptocurrency after bitcoin and ether, is at a premium of 302 per cent, while those investing in chainlink, livepeer, lumens and Decentraland’s mana token are priced at between twice and four times their NAV.\n\n“It’s absurd. I feel the investor doesn’t really understand what they are getting into,” said Bradley Duke, chief strategist of ETC Group, which runs more than $1bn in European-listed crypto exchange traded products.\n\n“I wouldn’t know what [investors] could be thinking buying at these prices,” said Bryan Armour, director of passive strategies research, North America, at Morningstar. “A lack of understanding can easily be part of it.”\n\nThe funds can only be traded via OTC Markets Group, formerly known as the “pink sheets” market, where over-the-counter secondary trading in pre-existing shares takes place. Shares cannot be redeemed, while new shares can only be created if Grayscale carries out a private placement exercise, meaning there is no arbitrage mechanism to bring prices back in line with the underlying holdings.\n\nHowever, most of the premiums only emerged, or widened sharply, in November, coinciding with a rally in the price of many cryptocurrencies.\n\n“There is a very strong appetite for crypto products at the moment as the crypto winter has melted. Investors are allocating to crypto in larger allocations and also diversifying from bitcoin and ethereum,” said Michael Sonnenshein, chief executive of Grayscale.\n\nHe believed some investors may be willing to pay well over the odds for Grayscale’s trusts in order to access cryptocurrencies “through a product wrapper that is known to them, is familiar and gives them added protections that they are used to seeing when they invest in any other asset”. The alternative is to trade via an unregulated crypto exchange.\n\nFor many of these tokens, Grayscale’s funds are the only regulated products available to US retail investors.\n\n“Because there are so few regulated products out there, the investors who don’t want to, or can’t, invest directly in these assets have little choice,” said Duke. “As a result, these products end up trading at these huge premiums. It’s a function of the structure of the products.”\n\n“I guess it’s down to accessibility,” said Armour, although he added that cryptocurrencies “have such high volatility it might be [that investors] don’t even care” at what price they are buying.\n\nAnother contributory factor may be limited liquidity, given the small size of some of the trusts. The Filecoin Trust has assets of just $464,000 and the solana vehicle, the largest currently trading at a significant premium, at $10.8mn.\n\n“These are fairly illiquid products and, as solana spot has seen, these illiquid products are seen as proxies by those who can’t buy solana directly in their funds or prefer not to,” said Gautam Chhugani, senior analyst, global digital assets at AB Bernstein.\n\nDuke argued that the large departures from net asset value showed the benefit of the European model. According to this, in contrast, scores of exchange traded products that invest directly in a rich array of cryptocurrencies — including those operated by ETC Group — “track the underlying almost perfectly”.\n\nThey are analogous to ETFs in the US but need to call themselves ETPs because they fail to meet European Ucits regulations on portfolio diversification.\n\nThe Securities and Exchange Commission has so far not permitted any such “spot” cryptocurrency ETFs in the US. Instead it only allows ETFs that invest in the futures market. Expectation is widespread that BlackRock and rival operators will be given the green light early next year.\n\n“Without regulated products these kinds of [price] anomalies are likely to exist,” Duke said. “I think we are very lucky in Europe . . . the ETP wrapper is far more efficient with the ETPs trading at or very close to NAV.”\n\nIn contrast, the US private trust structure “is problematic. And Grayscale recognise it’s problematic,” he added.\n\nLatest news on ETFs Visit the ETF Hub to find out more and to explore our in-depth data and comparison tools helping you to understand everything from performance to ESG ratings\n\nGrayscale has fought a long battle with the SEC to allow it to convert its flagship Bitcoin Trust (GBTC), at $24.1bn the world’s largest bitcoin fund, into an ETF. In August, a federal appeals court in Washington DC ruled that the SEC was wrong to reject Grayscale’s application to convert GBTC.\n\nAlthough this trust still trades at a discount to NAV, this discount has narrowed to a 28-month low of 8.7 per cent — from a nadir of almost 50 per cent in December 2022 — in anticipation of the likelihood of Grayscale being given the go-ahead to convert it into an ETF.\n\nThe company has also filed with the SEC to transform its $6.2bn Ethereum Trust (ETHE), again the largest such vehicle in the world, into an ETF. This trades at a discount of 14.6 per cent, a far cry from the near-60 per cent level seen at the turn of the year.\n\nSonnenshein said that, in the fullness of time, he would like to see the rest of Grayscale’s 17-strong product suite follow suit. “The goal would be to uplift all these products to ETFs,” he said."
    }
]