[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8yMS93aGFsZXMtbW92ZS1vdmVyLTY0MDAwMDAwMC1pbi1iaXRjb2luLWV0aGVyZXVtLXNvbGFuYS1zaGliYS1pbnUtYW5kLWNoYWlubGluay1oZXJlcy10aGUtZGVzdGluYXRpb24v0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzIxL3doYWxlcy1tb3ZlLW92ZXItNjQwMDAwMDAwLWluLWJpdGNvaW4tZXRoZXJldW0tc29sYW5hLXNoaWJhLWludS1hbmQtY2hhaW5saW5rLWhlcmVzLXRoZS1kZXN0aW5hdGlvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Whales Move Over $640,000,000 in Bitcoin, Ethereum, Solana, Shiba Inu and Chainlink – Here’s the Destination - The Daily Hodl",
        "content": "Deep-pocketed crypto investors are abruptly shifting hundreds of millions of dollars worth of digital assets, including the king crypto and the top altcoin.\n\nNew data from whale-surveying platform Whale Alert reveals that one high-net-worth trader suddenly moved 14,159 Bitcoin (BTC) worth a staggering $421.7 million from one unknown wallet to another.\n\nFurther activity centered around the top crypto asset by market cap saw another whale transfer 1,881 BTC worth $55.9 million from an unknown wallet to Coinbase, the leading US-based crypto exchange platform.\n\nThe next largest transactions involve smart contract platforms Ethereum (ETH) and Solana (SOL), which saw $51.6 million and $53.9 million respectively.\n\nAccording to Whale Alert, one whale repositioned 27,366 ETH from Binance.US, the US branch of the world’s largest crypto exchange platform by volume, to an unknown wallet while another wealthy trader shuffled 2,000,000 SOL from Binance to an unknown wallet.\n\nAnother crypto whale moved 409,823 SOL worth $10.3 million from an unknown wallet to Binance.\n\nOther notable transfers on the whale-watching platform’s radar include transfers of popular dog-themed meme asset Shiba Inu (SHIB) and decentralized oracle network Chainlink (LINK).\n\nOne transaction saw 2,416,836,656,676 SHIB worth $18.7 million transferred from Binance.US to an unknown wallet while the other saw 3,743,238 LINK worth $29.9 million moved from one unknown wallet to another.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/abstractmanx"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9zb2xhbmEtbmV0d29yay1oYXNudC1nb25lLWRvd24taW4tNS1tb250aHMtcmVwb3J0L9IBT2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9zb2xhbmEtbmV0d29yay1oYXNudC1nb25lLWRvd24taW4tNS1tb250aHMtcmVwb3J0Lz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Solana Network Hasn’t Gone Down in 5 Months: Report - CryptoPotato",
        "content": "The Solana network has not suffered any outages in the last five months and has been 100% uptime since February. The enhanced network performance marks a striking transformation from the previous year when layer-1 network outages caused severe disruptions.\n\nA new report released by Solana Foundation stated that the subsequent upgrades, including the rollout of QUIC TPU, Stake weighted QoS, and localized fee markets, have helped the network to handle high traffic and demand.\n\nSolana Completes One Whole Quarter Without Outage\n\nThe foundation mentioned that Solana – run by a group of independent validators around the world – has demonstrated improvements across various performance metrics.\n\nThis includes enhancements in ratios of non-voting-to-voting transactions. A voting transaction happens when a validator votes to confirm one or more proposed blocks of information. On the other hand, non-voting transactions are the ones triggered by user behavior on the blockchain.\n\nIn the latest report, Solana Foundation said that it expects “to see the ratio of voting to non-voting transactions go down because the overall percentage of voting transactions should drop as the network gets more efficient.”\n\nThe block production time – which measures how quickly the network adds more “blocks” to the blockchain – has followed a consistent trajectory besides a spike during the February outage.\n\nMoreover, the average transactions per second on the Solana network remained relatively similar since December 2022. Some volatility was observed, which correlated with high network demand, the foundation’s statement read. The maximum daily transactions per second have been on a steady rise since January. Data from Dune Analytics suggests that the network currently recorded 3,781 TPS as of July 20.\n\nNetwork Upgrades\n\nThe improvements across the metrics were achieved after core developers rolled out upgrades that enabled the network to perform well in times of high stress.\n\nThe Solana devs have doubled down on testing while developing other network upgrades and initiatives, including increasing maximum transaction sizes (currently limited to 1232 bytes). Simplifying the voting logic, which reduces the overall amount of data needed to be transmitted and stored, is yet another aspect that the devs are working on.\n\nAccording to the Solana Foundation, the advancements have helped solidify its position in the layer-1 space after its credibility was severely dented by a series of outages last year."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzMwNDgxL3NvbGFuYS1sYXVuY2hlcy1nYW1lc2hpZnQtYXBpLWZvci13ZWIzLWdhbWUtZGV2ZWxvcG1lbnQv0gFfaHR0cDovL2FtcC5jb2luY29kZXguY29tL2FydGljbGUvMzA0ODEvc29sYW5hLWxhdW5jaGVzLWdhbWVzaGlmdC1hcGktZm9yLXdlYjMtZ2FtZS1kZXZlbG9wbWVudC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Solana Launches GameShift API For Web3 Game Development - CoinCodex",
        "content": "Key Highlights:\n\nSolana launches GameShift API to simplify and facilitate the process of building games for developers.\n\nSolana-based API will provide developers easy access to custody solutions, marketplaces, inventory management, NFT minting, and credit card on-ramps and off-ramps.\n\nIn a bid to facilitate the development of web3 games on Solana, the renowned tech firm behind the blockchain, Solana Labs has announced the launch of GameShift. The firm made the thrilling announcement during the PlayGG event, a community-centric celebration of games on Solana in San Diego.\n\nOwing to the core challenges faced by the web3 gaming industry, GameShift, a unified web3 game development API designed to simplify and accelerate web3 game production steps in not only to make the industry thrilling for gamers but majorly easier for developers.\n\nTal Tchwella, head of product at Solana Labs, emphasized the importance of innovative technology for web3 game developers, aiming to streamline and elevate the game-building process. According to Tal, GameShift is the solution to this pressing need, as it focuses on creating the ownership layer for games. This innovative platform will serve as a comprehensive one-stop shop for developers on Solana, empowering them to build their games with greater speed and confidence.\n\nSolana-based API Provides Extensive Game Development Toolkits in One Interface\n\nFollowing concerns to curtail gaming complexities, Solana Labs understands the heavy need to integrate different technologies from multiple providers. As such, with its newly introduced API, developers will be provided with access to all the required tools combined in one interface, thereby simplifying and accelerating the game-building process.\n\nAccording to the announcement, the innovative API is capable of providing developers with tools to build high-quality web3 game experiences, including custody solutions, efficient marketplaces, inventory management, NFT minting, and credit card on-ramps and off-ramps. This suggests a new era of exciting opportunities for developers and gamers alike.\n\nWhile GameShift is expected to officially launch later this year, interested users can begin to sign up for early access via Solana. Nonetheless, its integration on the Solana blockchain appears to be garnering the interest of developers in the gaming space as they begin to anticipate an era of exclusive opportunities where they can access a full stack of trusted third-party web3 components on Solana via a unified API.\n\nFurthermore, Solana Labs had also revealed significant development which showcased over 40 games available for play on the Solana platform. However, the impact of the developments is yet to reflect on the price performance of its token SOL. As of the time of writing, the token is trading at $25.26, down -7.46% in the last 24 hours and about -11% in the past week."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS93aHktYXJlLXRyb24tdHJ4LWFuZC1zb2xhbmEtc29sLWludmVzdG9ycy1qdW1waW5nLXNoaXBzLXRvLXRyYWRlY3VydmUv0gFuaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL3doeS1hcmUtdHJvbi10cngtYW5kLXNvbGFuYS1zb2wtaW52ZXN0b3JzLWp1bXBpbmctc2hpcHMtdG8tdHJhZGVjdXJ2ZS8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Why Are TRON (TRX) And Solana (SOL) Investors Jumping Ships To Tradecurve - Crypto News Flash",
        "content": "The crypto market requires investors to be on their toes, as it can take a drastic turn all of a sudden. Therefore, investors prefer projects that are less vulnerable to market fluctuations.\n\nTradecurve (TCRV), a new crypto project, has become the hottest investment asset because of its stability and profitability. On the other hand, the future of TRON (TRX) and Solana (SOL) looks gloomy.\n\n>>Register For The Tradecurve Presale<<\n\nTRON (TRX) Sees Drop In Development Activity\n\nTRON (TRX) has posted mixed performance in the past few weeks, with its fair share of ups and downs. The data from Nansen has revealed that TRON registered more active addresses than Ethereum and Solana in June.\n\nAccording to the data, TRON’s active address count increased by 42%. This increase in the number of active addresses indicates more user engagement on the TRON network. However, not all seems green for the TRON network, as it has witnessed a fall in development activity.\n\nThe data from Santiment has revealed that the development activity count of TRON has witnessed a drop of more than 50% in the past week. Therefore, experts are not confident about the future growth of TRON, which is currently trading at $0.0817.\n\n>>Register For The Tradecurve Presale<<\n\nSolana’s (SOL) Performance Worsens\n\nConditions have become difficult for Solana (SOL), as the network has stumbled in several growth metrics. As per the data from DefiLlama, the total value locked of Solana has declined by 97% since November 2021 when the network’s TVL had peaked at $10 billion.\n\nAt the time of writing, the TVL of Solana is $286.86 million. Moreover, the number of daily active addresses on Solana has plummeted by 53% since May. Besides, the transaction count has plunged by 37% in the past fortnight. Amid these bearish developments, the revenue of Solana has fallen by 66% in the past year. At present, Solana is changing hands at $21.58.\n\n>>Register For The Tradecurve Presale<<\n\nTradecurve Presale Attracts A Large Number Of Whales\n\nAfter the market crash of 2022, the daily trading volume of cryptocurrencies is picking pace again. As per the latest data from Coinmarketcap, the daily trading volume of cryptocurrencies is more than $65 billion. Thus, the demand for new crypto exchanges has also surged, and Tradecurve (TCRV) has emerged as the best option in the industry.\n\nIt is a new blockchain crypto exchange that offers institutional-level liquidity, and high privacy standards. It is an all-inclusive platform that enables users to trade multiple assets, like cryptocurrency, Forex, futures, OTC derivatives, and more, on a single user interface.\n\nOn this platform, traders can create an account by using an email id. Next, users can connect their digital wallets to their trading accounts, and use any cryptocurrency as collateral. Moreover, KYC requirements are eliminated from the platform. This, in turn, helps people to execute trades privately and anonymously, as opposed to other platforms like KuCoin and Coinbase.\n\nThe platform also offers slippage-free trading, low latency, and non-custodial storage. It has completed the first three stages of its presale, and stage 4 is 75% sold out. So far, the market value of TCRV tokens has surged by 80%.\n\nAt present, the price of a TCRV token is $0.018, and will become $0.025 in the next stage. It can soar to $0.50 during the presale round. If users book TCRV tokens early, they may get 100x profit over the coming six months.\n\nFor more information about the TCRV presale:\n\nWebsite: https://tradecurve.io/\n\nBuy presale: https://app.tradecurve.io/sign-up\n\nTwitter: https://twitter.com/Tradecurveapp\n\nTelegram: https://t.me/tradecurve_official"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItbWF0aWMtc29sYW5hLWNyeXB0by1tYXJrZXQv0gFCaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1ldGhlci1tYXRpYy1zb2xhbmEtY3J5cHRvLW1hcmtldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin price falls; Ether flat, Matic leads gainers, Solana the losers - Forkast News",
        "content": "Bitcoin fell on Friday morning in Asia as other top 10 non-stablecoin cryptocurrencies traded mixed. Bitcoin again slipped below support at US$30,000 after a week that saw buyers retreat. Developments in applications for Bitcoin exchange-traded funds (ETFs) failed to generate fresh investment, though some commentators say the pent up demand is there. Ether traded flat and is also a loser for the week. Matic led the early gainers on Friday, but is also in the red for the week.\n\nBitcoin backs off\n\nBitcoin fell 0.18% to US$29,824.09 as of 6:40 a.m. in Hong Kong, according to data from CoinMarketCap. The world’s largest cryptocurrency has lost 4.53% in the past seven days.\n\nThe drop came amid further developments in Bitcoin exchange-traded fund (ETF) applications by U.S. asset managers.\n\nSpot Bitcoin ETF applications from BlackRock, Fidelity, Invesco Galaxy, VanEck, and WisdomTree on July 19 were published in the Federal Register, which means the Securities and Exchange Commission (SEC) now has up to 240 days to accept or request the applications, according to Bloomberg.\n\nBloomberg research analyst James Seyffart wrote on Twitter that while this sets the clock ticking, the SEC may still reject all the applications.\n\nBlackRock, the world’s largest asset manager, filed its spot Bitcoin ETF application on June 15, sparking a round of buying of cryptocurrencies on expectations more institutional funds will start investing in the asset class.\n\nWhile that enthusiasm has faded, Alex Kuptsikevich, senior market analyst at London-based brokerage firm FxPro said latent demand for cryptocurrencies remains, although “the momentum is far from euphoric.” Kuptsikevich added that Bitcoin continued to find support this week on dips below $30,000. “A move to the upper boundary at $31,300 is most likely in this environment,” he said.\n\nAsia Pacific institutional investors “remain constructive across the digital asset complex following last week’s positive news on [ETFs],” said Matt Long, the APAC general manager of California-based international crypto brokerage FalconX. “They are well positioned for further appreciation in markets,” said Long in an emailed statement to Forkast.\n\nU.S.-based digital asset manager Grayscale Investments said in a Friday report that about half of Bitcoin’s 80% increase from December to mid-July relates to macro developments, while the rest is due to Bitcoin-specific positives.\n\n“Crypto no longer behaves as its own ecosystem: Bitcoin and other digital assets are now more correlated with other market indicators,” according to the report.\n\n“Since January 2023, Bitcoin has appreciated more than can be explained by the rally in tech stocks and fall in the US Dollar. We think this reflects idiosyncratic positives, including optimism about eventual spot Bitcoin ETF approval, as well as Bitcoin’s surge in March following stress in regional banks,” Grayscale said.\n\n“Valuations are now more closely tied to broader macro trends, and more Fed tightening could be a headwind for higher risk assets, including both equities and cryptocurrencies,” the report said.\n\nBack in Asia Friday morning trading, Ether edged up 0.31% to US$1,895.14, while falling 4.70% in the last week.\n\nOther top 10 non-stablecoin cryptocurrencies were mixed — Polygon’s Matic led gainers, rising 3.42% to US$0.7711. However, it posted a weekly loss of 8.46%.\n\nPolygon Labs is currently working on developing Polygon 2.0, a series of updates to the blockchain that the company says aim to make network governance more open and inclusive.\n\nSolana was the biggest loser among the top 10, declining 3.53% to US$25.49, amid a 0.72% weekly loss.\n\nThe total crypto market capitalization edged down 0.15% in the past 24 hours to US$1.2 trillion, while trading volume jumped 19.19% to US$37.15 billion.\n\nNFTs fall; OpenSea launches swap feature\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index fell 0.56% in the past 24 hours to 2,696.41 as of 08:30 a.m. in Hong Kong. The index gained a flat 0.01% in the last seven days.\n\nTotal NFT trading volume rose 1.62% to US$18.69 million in the past 24 hours, according to data from CryptoSlam. Forkast NFT market indexes measuring performance on the Ethereum, Polygon and Solana blockchains all dropped, while the Cardano index rose.\n\nOn Thursday, NFT marketplace OpenSea announced that it is launching “Deals,” a new peer-to-peer NFT swap function. The company said in a tweet that this will help users avoid falling victim to “sketchy DMs & websites” as OpenSea will provide the platform for users to directly engage with each other.\n\nYehudah Petscher, NFT Strategist at Forkast Labs, says this feature is “more significant than people may realize.”\n\n“One of the primary ways people are scammed in the NFT space is through fake trades. Often, legitimate trade sites are spoofed, and then trades offered through there,” said Petscher. “Now collectors will be able to trade using a platform they’re already familiar with and trust, and the best part is there are no fees involved other than gas.”\n\nCurrently, OpenSea allows only ERC-721 NFTs on Ethereum from verified collections to be traded on Deals. To make a “deal,” a user can offer one or more NFTs in return for another user’s NFTs, where one can also choose to add wrapped Ether (WETF) as part of the offer. The user accepting the deal will have to pay gas fees, according to OpenSea.\n\n“Easy to use, and hopefully will have a major impact on lowering scams. This was long overdue.” Petscher said.\n\nElsewhere, Yuga Labs’ Bored Ape Yacht Club topped CryptoSlam’s NFT collection ranking by trading volume, rising 3.80% in the last day to US$1.4 million.\n\nEthereum was the top performing blockchain network by NFT trade volume, gaining 5.63% to US$13.73 million. Solana placed second, up 4.41% to US$1 million.\n\nU.S. equity futures gain after mixed session\n\nU.S. Federal Reserve Board Chairman Jerome Powell | Image: Getty Images\n\nThe three major U.S. stock futures indexes gained as of 11:10 a.m. in Hong Kong on Friday, after equities had a mixed regular trading session on Thursday.\n\nThe Dow Jones gained on top of strong Q2 earnings reports from Johnson & Johnson and Goldman Sachs. The S&P 500 and Nasdaq 100 slipped as Tesla tumbled on weak second-quarter gross margins and Netflix reported less-than-expected revenue.\n\nIn Asia, China’s Shanghai Composite Index gained, partially recovering from disappointing economic growth data for Q2. Investors are betting on Beijing to step up its economic stimulus measures, according to Trading Economics. Hong Kong’s Hang Seng Index also rose on China news of authorities possibly easing home buying limits in big cities.\n\nJapan’s Nikkei 225 dipped after its inflation rate rose slightly in June. South Korea’s Kospi also slipped.\n\nOn macro events, the next U.S. Federal Open Market Committee meeting is next week on July 26 when the central bank will make its next move on U.S. interest rates. The CME FedWatch Tool predicts a 99.8% chance that the Fed will announce a further 25 basis points raise that will take rates to the 5.25%-5.50% range, which will be the highest since January 2001.\n\n(Updates to add equity section)"
    }
]