[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8yMi9zb2xhbmEtdGhlbWVkLXN0b3JlZnJvbnRzLWNsb3NlLXNob3AtZW5kaW5nLWV4cGVyaW1lbnQtaW4taXJsLWJsb2NrY2hhaW4tZXZhbmdlbGlzbS_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMjIvc29sYW5hLXRoZW1lZC1zdG9yZWZyb250cy1jbG9zZS1zaG9wLWVuZGluZy1leHBlcmltZW50LWluLWlybC1ibG9ja2NoYWluLWV2YW5nZWxpc20vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Solana-Themed Storefronts Close Shop, Ending Experiment in IRL Blockchain Evangelism - CoinDesk",
        "content": "The closure comes seven months after Norby opened Solana Spaces’ first location in a glitzy mall in New York City’s Hudson Yards. Its staffers guided visitors through interactive stations that taught them how to get going on Solana, from setting up a crypto wallet to swapping tokens on a decentralized exchange. Norby later set up a second shop in Miami."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2hlbGl1bS1hbm5vdW5jZXMtbWlncmF0aW9uLWRhdGUtdG8tc29sYW5hLTFtLWhvdHNwb3RzLXdvcmxkd2lkZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Helium announces migration date to Solana, 1M hotspots worldwide - CryptoSlate",
        "content": "Solana (SOL) experienced a surge in price following an announcement that Helium (HNT) would be migrating towards the platform beginning Mar. 27.\n\nIn a blog post from Feb., Helium announced the move.\n\n“The Network migration to the Solana blockchain and deployment of Oracles represents the most significant upgrade to Helium Network scalability and reliability.”\n\nHelium’s decentralized network of hotspots totals almost one million as of Feb. 2023.\n\nNews of the migration date sent the price of both tokens up last week. Following the news, Solana’s value has seen an over 21% surge — to a high of $27.11 on Feb. 17, from $22.34 on Feb. 16.\n\nCurrently, SOL is worth $26.15 and Helium is trading for $3.15 at the time of writing.\n\nHelium is a network that focuses on creating an internet of things (IoT) powered by physical hotspots, with HNT tokens used to reward participants for validating coverage and providing wireless hotspots.\n\nThe migration of Helium from its current layer-1 (L1) solution to the Solana platform was recently announced by the Solana network — with the transition set to take place at the end of March.\n\nWith nearly one million hotspots worldwide across long range and 5G networks, the move is expected to help Helium’s community to focus on expanding decentralized wireless networks.\n\nIn a recent blog post, Helium encouraged its users to prepare for the transition, stating that the migration to the Solana ecosystem will allow its community to focus on building wireless protocols and enabling utility on these networks.\n\nOnce completed, HNT will become natively compatible with other platforms within Solana’s ecosystem, adding utility for HNT, MOBILE, and IoT token holders."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3RoZXZyc29sZGllci5jb20vc29sYW5hLXByaWNlLWFuYWx5c2lzLXByZWRpY3Rpb24tZmViLTIxc3Qtc29sLXJlbWFpbnMtYnVsbGlzaC1idXQtdHJhcHBlZC1pbi1hLW5pbmUtbW9udGgtY2hhbm5lbC11cC1ieS13ZWVrbHktOS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Solana Price Analysis & Prediction (Feb 21st) – SOL Remains Bullish but Trapped in a Nine-Month Channel, Up by ... - The VR Soldier",
        "content": "Solana saw a bounce off $20 a week ago and added a $4 gain to its price. Half of this gain has been washed away in the past hours due to a bearish reaction. More losses are expected if the bulls fail to regroup.\n\nAs expected, Solana retested the $24.2 level following a 7-day recovery. This price level saw rejection yesterday with a bearish candle, which brought the price to a close of $22.3 – last week’s breakdown level.\n\nThe asset has increased by a few cents today with a trading price of $22.5. The buyers are trying to push the price off that solid level. Even though they successfully advance the price, they could encounter hurdles around the channel’s resistance at $26.7 – marked as a two-month high.\n\nA significant surge above the 9-month channel will take SOL completely out of the bear box and launch it into a bull run.\n\nIn the opposite direction, a continuous drop from the current trading level will trap the price more in the box. Such a scenario could make the price fall to as low as $11.\n\nSolana will continue to remain bearish in the long-term perspective as long as it continues to respect this descending channel. The price is still down by 80% in a year.\n\nSolana’s Key Level To Watch Out For\n\nThe market structure reveals that SOL is still bullish on the daily chart. Retaking yesterday’s rejection level, SOL will still need to flip the two-month high – a clear breakout of the channel – to validate a continuation of the bullish trend. The $30 and $33.5 resistance levels are key targets in case of a breakout.\n\nOn the downward range, last week’s rebound level – $20 – remains a crucial support for a breakdown. Below it lies hidden support at $18.9 and $17.7 before slipping to $15.1.\n\nKey Resistance Levels: $26.7, $30, $33.5\n\nKey Support Levels: $20, $17.7, $15.1\n\nSpot Price: $22.6\n\nTrend: Bullish\n\nVolatility: Moderate\n\nDisclosure: This is not trading or investment advice. Always do your research before buying any cryptocurrency or investing in any projects.\n\nImage Source: valedol/123RF // Image Effects by Colorcinch"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGVjcnlwdC5jby8xMjE4NjMvc29sYW5hLXNwYWNlcy1jbG9zaW5nLXN0b3Jlcy1pbi1ueWMtYW5kLW1pYW1p0gFNaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMTg2My9zb2xhbmEtc3BhY2VzLWNsb3Npbmctc3RvcmVzLWluLW55Yy1hbmQtbWlhbWk_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Solana Spaces Closing Stores in NYC and Miami - Decrypt",
        "content": "We do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana Spaces—Solana-themed retail storefronts—announced the closure of its company-owned and operated stores on Tuesday, another ambitious initiative frozen by the prolonged crypto winter.\n\n“We’ve made the difficult decision to sunset our stores in NYC and Miami by the end of February, and to pivot our Solana onboarding efforts into digital products like DRiP, our free NFT product with more than 100k sign-ups,” according to the Solana Spaces Twitter account.\n\nThe following is a note from our founder, @vibhu. Dear @solanaspaces community, We’ve made the difficult decision to sunset our stores in NYC and Miami by the end of February, and to pivot our Solana onboarding efforts into digital products like DRiP, our free NFT product with… https://t.co/kjNu9Ay4Gk — Solana Spaces (@solanaspaces) February 21, 2023\n\nAD\n\nAD\n\nLast summer, Solana Spaces launched its first physical store in New York’s Hudson Yards. The store aimed to act as a Web3 onboarding space for newcomers, where Solana faithful could buy their favorite Solana branded merch.\n\nAnother store opened in August of that year in Miami’s Wynwood district, an area that is known for being a creative and cultural hub.\n\nThe Solana stores joined a growing list of IRL projects like Bored & Hungry, a Bored Ape Yacht Club-themed fast food restaurant based in Los Angeles.\n\n“Realistically, we were a startup that was chasing a path,” Solana Spaces founder Vibhu Norby told Decrypt in an interview. “Obviously, like many founders had to make difficult decisions sometimes, and this was one of them.”\n\nEchoing his statement on Twitter, Norby said the team found more efficient ways to onboard people from both a product and financial standpoint.\n\nAD\n\nAD\n\n“I think the reality is that we could have kept them running, but it didn’t make as much sense as it did in the past to do that, and so we didn’t,” Norby said.\n\nNorby says the focus now is on the DRiP, an online platform that the company says saw the same amount of traffic as the physical stores.\n\nDRiP is a website where collectors can receive free Solana NFTs, airdropped weekly.\n\n“While our stores onboard between 500 and 1,000 people per week, DRiP onboards that same quantity every day,” he said.\n\nNorby says the interest in DRiP surprised the team, with sign-ups for DRiP surpassing 50,000 as of this week, with another 175,000 on a waitlist to join.\n\n“As a founder who has a background working in software products and things like MySpace and other social things back in the day—I really thought it [would make] little sense not to pursue that aggressively,” Norby said. “So a team from spaces and myself are taking that and running with it.”\n\nBut while the New York and Miami stores are closing, Norby says this isn’t the end of Solana Spaces.\n\n“We open-sourced our stores in November,” he said. “We were excited to franchise the Spaces globally.”\n\nAD\n\nAD\n\nOne of these franchises, Norby says, is set to open in India in the coming weeks. Solana Spaces will continue to have a smaller presence in Miami within other apparel stores in the area.\n\nNorby says the Solana Spaces stores will close on February 28th, adding that the New York and Miami stores would offer giveaways and discounts on merch leading up to the last day.\n\n“I’ve instructed our retail team to be ultra generous,” Norby wrote on Twitter. “So come by and grab some free high-quality Solana gear, while supplies last and with some limitations,” he said, asking the Solana community who come by the stores to share pictures on Twitter.\n\n“So we can all together enjoy the final week of Solana Spaces,” he said."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGVjcnlwdC5jby8xMjE4NjMvc29sYW5hLXNwYWNlcy1jbG9zaW5nLXN0b3Jlcy1pbi1ueWMtYW5kLW1pYW1p0gFNaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMTg2My9zb2xhbmEtc3BhY2VzLWNsb3Npbmctc3RvcmVzLWluLW55Yy1hbmQtbWlhbWk_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Feb 2023 08:00:00 GMT",
        "title": "Solana Spaces Closing Stores in NYC and Miami - Decrypt",
        "content": "We do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana Spaces—Solana-themed retail storefronts—announced the closure of its company-owned and operated stores on Tuesday, another ambitious initiative frozen by the prolonged crypto winter.\n\n“We’ve made the difficult decision to sunset our stores in NYC and Miami by the end of February, and to pivot our Solana onboarding efforts into digital products like DRiP, our free NFT product with more than 100k sign-ups,” according to the Solana Spaces Twitter account.\n\nThe following is a note from our founder, @vibhu. Dear @solanaspaces community, We’ve made the difficult decision to sunset our stores in NYC and Miami by the end of February, and to pivot our Solana onboarding efforts into digital products like DRiP, our free NFT product with… https://t.co/kjNu9Ay4Gk — Solana Spaces (@solanaspaces) February 21, 2023\n\nAD\n\nAD\n\nLast summer, Solana Spaces launched its first physical store in New York’s Hudson Yards. The store aimed to act as a Web3 onboarding space for newcomers, where Solana faithful could buy their favorite Solana branded merch.\n\nAnother store opened in August of that year in Miami’s Wynwood district, an area that is known for being a creative and cultural hub.\n\nThe Solana stores joined a growing list of IRL projects like Bored & Hungry, a Bored Ape Yacht Club-themed fast food restaurant based in Los Angeles.\n\n“Realistically, we were a startup that was chasing a path,” Solana Spaces founder Vibhu Norby told Decrypt in an interview. “Obviously, like many founders had to make difficult decisions sometimes, and this was one of them.”\n\nEchoing his statement on Twitter, Norby said the team found more efficient ways to onboard people from both a product and financial standpoint.\n\nAD\n\nAD\n\n“I think the reality is that we could have kept them running, but it didn’t make as much sense as it did in the past to do that, and so we didn’t,” Norby said.\n\nNorby says the focus now is on the DRiP, an online platform that the company says saw the same amount of traffic as the physical stores.\n\nDRiP is a website where collectors can receive free Solana NFTs, airdropped weekly.\n\n“While our stores onboard between 500 and 1,000 people per week, DRiP onboards that same quantity every day,” he said.\n\nNorby says the interest in DRiP surprised the team, with sign-ups for DRiP surpassing 50,000 as of this week, with another 175,000 on a waitlist to join.\n\n“As a founder who has a background working in software products and things like MySpace and other social things back in the day—I really thought it [would make] little sense not to pursue that aggressively,” Norby said. “So a team from spaces and myself are taking that and running with it.”\n\nBut while the New York and Miami stores are closing, Norby says this isn’t the end of Solana Spaces.\n\n“We open-sourced our stores in November,” he said. “We were excited to franchise the Spaces globally.”\n\nAD\n\nAD\n\nOne of these franchises, Norby says, is set to open in India in the coming weeks. Solana Spaces will continue to have a smaller presence in Miami within other apparel stores in the area.\n\nNorby says the Solana Spaces stores will close on February 28th, adding that the New York and Miami stores would offer giveaways and discounts on merch leading up to the last day.\n\n“I’ve instructed our retail team to be ultra generous,” Norby wrote on Twitter. “So come by and grab some free high-quality Solana gear, while supplies last and with some limitations,” he said, asking the Solana community who come by the stores to share pictures on Twitter.\n\n“So we can all together enjoy the final week of Solana Spaces,” he said."
    }
]