[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMivAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG9jdXJyZW5jeS1hbmFseXRpY3MtaW5zaWdodC9uZXctY3J5cHRvLWNvaW4tZ3VpZGUtdGhlLWJlc3QtbmV3LWNvaW5zLW9mLTIwMjMtaW5jbHVkaW5nLWV0aGVyZXVtLWFwZW1heC1jYXJkYW5vLXNvbGFuYS1taW5hLXByb3RvY29sLXdvcmxkY29pbi1hbmQtbW9yZdIBxgFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9hbXAvc3RvcnkvY3J5cHRvY3VycmVuY3ktYW5hbHl0aWNzLWluc2lnaHQvbmV3LWNyeXB0by1jb2luLWd1aWRlLXRoZS1iZXN0LW5ldy1jb2lucy1vZi0yMDIzLWluY2x1ZGluZy1ldGhlcmV1bS1hcGVtYXgtY2FyZGFuby1zb2xhbmEtbWluYS1wcm90b2NvbC13b3JsZGNvaW4tYW5kLW1vcmU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 02 Aug 2023 07:00:00 GMT",
        "title": "New Crypto Coin Guide | The Best New Coins of 2023 including Ethereum, ApeMax, Cardano, Solana, Mina Protocol, Worldcoin, and More - Analytics Insight",
        "content": "Embark with us on an informative expedition into the exhilarating world of new cryptocurrencies. Our comprehensive guide assembles the latest analysis of the most interesting new coins of 2023, encompassing Ethereum, ApeMax, Cardano, Solana, Mina Protocol, and Worldcoin among others. Drawing from a wealth of reliable sources and constructed with care, this article showcases some of the top new cryptocurrencies in 2023. By deciphering the complexities of these new coins, we hope to uncover interesting insights on the top new crypto coins."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9saWZlc3R5bGUvc3RvcnkvMjAyMy0wOC0wMi9zb2xhbmEtYmVhY2gtY29tbXVuaXR5LWNvbm5lY3Rpb25zLWF3YXJkZWQtY29tbXVuaXR5LWdyYW500gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 02 Aug 2023 07:00:00 GMT",
        "title": "Solana Beach Community Connections awarded Community Grant - Del Mar Times",
        "content": "The Solana Beach City Council has awarded Solana Beach Community Connections a $6,000 2023-2024 Community Grant, according to a news release.\n\n(Courtesy of Solana Beach Community Connections)\n\nThe grant will allow Solana Beach Community Connections (SBCC) to help senior citizens who live in Solana Beach with “shallow” housing subsidies.\n\nHousing costs have risen substantially due to inflation, significantly affecting seniors on fixed incomes. The grant from the City of Solana Beach, along with $6,000 in private matching donations from SBCC, will be used to help seniors bridge the challenge of rising costs without rising incomes. SBCC will work with the Community Resource Center in Encinitas to administer the program.\n\nSolana Beach Community Connections is a volunteer-driven, nonprofit organization providing information, services and resources to Solana Beach seniors assisting them to age independently in place. For more information about the Shallow Rental Subsidy Program or to support the initiative, contact Marilyn Barnett at info@sbcc.org.\n\nChecks to support this program should be made out to Solana Beach Community Connections/Rental Subsidy, P.O. Box 1723, Solana Beach, CA 92075.\n\nAlso, visit the SBCC website at www.solanabeachcc.org, where you can donate to the organization online by clicking on the “Donate” button, add your name and contact information to get updates about SBCC’s activities, and find information about a variety of services for older adults in San Diego County."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9saWZlc3R5bGUvc3RvcnkvMjAyMy0wOC0wMi9zb2xhbmEtYmVhY2gtY29tbXVuaXR5LWNvbm5lY3Rpb25zLWF3YXJkZWQtY29tbXVuaXR5LWdyYW500gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 02 Aug 2023 07:00:00 GMT",
        "title": "Solana Beach Community Connections awarded Community Grant - Del Mar Times",
        "content": "The Solana Beach City Council has awarded Solana Beach Community Connections a $6,000 2023-2024 Community Grant, according to a news release.\n\n(Courtesy of Solana Beach Community Connections)\n\nThe grant will allow Solana Beach Community Connections (SBCC) to help senior citizens who live in Solana Beach with “shallow” housing subsidies.\n\nHousing costs have risen substantially due to inflation, significantly affecting seniors on fixed incomes. The grant from the City of Solana Beach, along with $6,000 in private matching donations from SBCC, will be used to help seniors bridge the challenge of rising costs without rising incomes. SBCC will work with the Community Resource Center in Encinitas to administer the program.\n\nSolana Beach Community Connections is a volunteer-driven, nonprofit organization providing information, services and resources to Solana Beach seniors assisting them to age independently in place. For more information about the Shallow Rental Subsidy Program or to support the initiative, contact Marilyn Barnett at info@sbcc.org.\n\nChecks to support this program should be made out to Solana Beach Community Connections/Rental Subsidy, P.O. Box 1723, Solana Beach, CA 92075.\n\nAlso, visit the SBCC website at www.solanabeachcc.org, where you can donate to the organization online by clicking on the “Donate” button, add your name and contact information to get updates about SBCC’s activities, and find information about a variety of services for older adults in San Diego County."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvc29sYW5hLXByaWNlLWFuYWx5c2lzLWhlcmVzLXdoeS1zb2wtcHJpY2UtdG8tc3VycGFzcy0zMC_SAVlodHRwczovL2NvaW5nYXBlLmNvbS9tYXJrZXRzL3NvbGFuYS1wcmljZS1hbmFseXNpcy1oZXJlcy13aHktc29sLXByaWNlLXRvLXN1cnBhc3MtMzAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 02 Aug 2023 07:00:00 GMT",
        "title": "Solana Price Analysis: Here’s Why $SOL Price Hold the Potential to Surpass $30 - CoinGape",
        "content": "Solana Price Analysis: The recent correction phase in Solana price found suitable support at $22.7. This horizontal level combined with the 50% Fibonacci replacement level, creates a strong demand zone for market participants. On July 26th, the coin price tried to bounce back from the aforementioned support with the morning star candle, but the buyers’ failure to give a suitable follow-up indicates insufficient bullish momentum to resume price recovery.\n\nAlso Read: Solana Price Analysis: Here’s How $22.7 Support Sets $SOL for 25% Rally\n\nadvertisement\n\nSolana Price Daily Chart\n\nThe accumulation of several technical levels at $22.7 creates a high area of interest for market participants.\n\nThe Solana price trading above 100-and-200-day EMA reflects the overall trend that remains bullish.\n\nThe 24-hour trading volume on the Solana coin is $418.5 Million, indicating a 3.6% gain.\n\nSource-Tradingview\n\nBy the press time, the Solana price traded at $23.72 and showed a long rejection candle at $22.7 support. These two reversals from the same support within a fortnight indicate the presence of strong demand pressure.\n\nA potential reversal would lead to the formation of a bullish reversal pattern called the double bottom. This pattern is a sign of active accumulation from traders and the possibility of a sustained rally.\n\nIf the coin price gives a bullish breakout from the $25.75 resistance, the buyers would get a solid springboard to jump higher. The post-breakout rally could surge the prices 12.5% higher to hit $29, followed by $32.\n\nSolana Price Breakdown to $20?\n\nIn case the Solana price continues to waver above the $22.7 support without a sustained rebound, the strength of buyers to continue a recovery rally would be under question. A breakdown below $22.4 would accelerate the selling pressure and push the coin price to $20.\n\nExponential moving average: The 50-and-100- day EMA nearing a bullish crossover near $22.5 increasing the support strength of this level.\n\nRelative Strength Index : Despite the falling RSI slope , the coin price maintains a higher low formation indicating a reverse bullish divergence which favors the uptrend continuation"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NvbGFuYS1kZWZpLWZyZWVzLWRldmVsb3BlcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 02 Aug 2023 18:20:36 GMT",
        "title": "Low cost of Solana DeFi frees developers from constraints: Ellipsis co-founder - Blockworks",
        "content": "The 2020 vision for DeFi, according to Eugene Chen, was for a fully on-chain, transparent composable trading experience. “We still believe in this vision,” he says. “A lot of others in crypto have kind of given up on it.”\n\nThe co-founder of Ellipsis Labs says that “coming over to the Solana side” has been a “breath of fresh air.”\n\n“All of a sudden, all these super heavy constraints that are on you as a protocol developer are just gone. They’re replaced with a different set of constraints, of course,” he admits.\n\nChen talks to Blockworks on the 0XResearch podcast (Spotify/Apple) about how the vision for fully on-chain DeFi remains a strong possibility.\n\n“We are still quite early on the infrastructure side,” Chen says, “but as a DeFi protocol designer, there’s just so much more you can do when you don’t have to deal with 10 or 20 [transactions per second].”\n\nThe high throughput and low fees that are characteristic of Solana’s ecosystem allow “active participation in the market,” he says. Chen mentions Ellipsis Labs-developed Phoenix, a fully on-chain, non-custodial decentralized limit-order book, as an example. New limit-orders, cancellations and trades take place 5 to 10 times per second on the platform as of now.\n\n“We’re still in the very early stages here. So we expect that number to go up pretty significantly as the markets become more competitive and as more users come on.”\n\n“This is just not possible on a chain that does 10 or 20 [transactions per second],” he says. “You are not going to have 10 [transactions per second] going through a single DEX, or if you are, the cost is going to be prohibitive.”\n\nMarket makers on Phoenix update orders every second or faster, Chen says, paying around $20 per day in costs — “which is like the cost of one ‘add liquidity’ or ‘remove liquidity’ on Uniswap V3.”\n\nPrice discovery happens off-chain\n\nChen explains that DeFi automated market makers (AMMs) were born out of speed and cost constraints. “You don’t need your market makers to be updating their quotes super frequently. You set it and forget it. And I think that really was quite innovative.”\n\nBut the liquidity provided by AMMs is not competitive with off-chain limit-order books, according to Chen. This is why, he says, price discovery takes place off-chain on centralized exchanges.\n\n“The price discovery is happening on these venues that don’t have 12 second block times, where market makers can put the liquidity exactly where they want to,” he says.\n\nChen admits that on-chain DeFi has a long way to go. “There are a ton of concerns with MEV and discrete block times in the same way that these are pretty big challenges for AMMs to overcome.”\n\nChen notes that the “vanilla limit-order book” implemented on Phoenix is not yet good enough to be the “final form of DeFi liquidity,” but is a “much better starting point than the AMM.”\n\nThe AMM design space is “fairly restricted,” according to Chen. “Especially when you’re on Ethereum mainnet.”\n\n“I do expect to see a lot more innovation in DEX design as more and more DeFi activity on the Ethereum side moves to [layer-2s], and I’m pretty excited to see that.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]