[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2RlZmkvd2hhdC1pcy1qaXRvLWp0by_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Jito (JTO): Driving Solana's Growth With MEV Technology - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5kZWxtYXJ0aW1lcy5uZXQvc3BvcnRzL3N0b3J5LzIwMjMtMTItMTMvc29sYW5hLWJlYWNoLXNvY2Nlci1jbHViLWJveXMtdTEyLXRlYW0tdG9wcy1pbi1kaXZpc2lvbi1hdC1sYS1qb2xsYS1hbGwtc3Rhci10b3VybmFtZW500gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Solana Beach Soccer Club Boys U12 team tops in division at La Jolla All Star tournament - Del Mar Times",
        "content": "Solana Beach Soccer Club Boys U12 team members: Back row (l-r): Coaches Grant Bostrom and Dave Grimes; Front row (names in alphabetical order): Players Chris, Jake, Jay, Kellan, Lachlan, Lincoln, Lucas, Niko, Rahdean, Sean, Tim, Tristan and William\n\nThe Solana Beach Soccer Club Boys U12 team won its division at the 14th Annual La Jolla All Star tournament the weekend of Dec. 3-4.\n\nThe team was undefeated in the round robin phase, winning two games and tying a third game. The team won a hard fought 3-1 championship game against a team from Oceanside.\n\n"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb2xhbmEtYmFzZWQtbWVtZWNvaW4tYm9uay1zdXJnZXMtMDU0NDM4NTA2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Solana-based Memecoin BONK Surges After Coinbase Listing - Yahoo Finance",
        "content": "Solana-based Memecoin BONK Surges After Coinbase Listing\n\nBONK, the popular Solana (SOL) memecoin that has rallied significantly in recent weeks, saw another spike following Coinbase's announcement of its listing on Thursday. Earlier on Dec. 13, Coinbase revealed its intention to list BONK, without specifying the exact timing.\n\nBONK initially experienced a brief surge, followed by a substantial decline. By Wednesday morning, the coin had dipped by 11% over the previous 24-hour period.\n\nHowever, this afternoon, Coinbase tweeted that BONK would be listed on Thursday, potentially as early as 12pm ET, provided that liquidity conditions were met. BONK will be labeled as an \"experimental\" asset on Coinbase but can be bought and sold like any other cryptocurrency on the exchange.\n\nFollowing the announcement, the Solana meme coin surged to a new all-time high price of $0.00001474, according to CoinMarketCap data. BONK has experienced remarkable gains, gaining 613% over the past month. It has surpassed the Ethereum-based FLOKI to become the third-largest dog-themed memecoin by market capitalization, trailing behind Dogecoin (DOGE) and Shiba Inu (SHIB).\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb2xhbmEtYmFzZWQtbWVtZWNvaW4tYm9uay1zdXJnZXMtMDU0NDM4NTA2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Solana-based Memecoin BONK Surges After Coinbase Listing - Yahoo Finance",
        "content": "Solana-based Memecoin BONK Surges After Coinbase Listing\n\nBONK, the popular Solana (SOL) memecoin that has rallied significantly in recent weeks, saw another spike following Coinbase's announcement of its listing on Thursday. Earlier on Dec. 13, Coinbase revealed its intention to list BONK, without specifying the exact timing.\n\nBONK initially experienced a brief surge, followed by a substantial decline. By Wednesday morning, the coin had dipped by 11% over the previous 24-hour period.\n\nHowever, this afternoon, Coinbase tweeted that BONK would be listed on Thursday, potentially as early as 12pm ET, provided that liquidity conditions were met. BONK will be labeled as an \"experimental\" asset on Coinbase but can be bought and sold like any other cryptocurrency on the exchange.\n\nFollowing the announcement, the Solana meme coin surged to a new all-time high price of $0.00001474, according to CoinMarketCap data. BONK has experienced remarkable gains, gaining 613% over the past month. It has surpassed the Ethereum-based FLOKI to become the third-largest dog-themed memecoin by market capitalization, trailing behind Dogecoin (DOGE) and Shiba Inu (SHIB).\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vY29pbmZvbWFuaWEuY29tL3NvbGFuYS1iYXNlZC1qZXQtcHJvdG9jb2wtc2h1dHMtZG93bi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 13 Dec 2023 08:00:00 GMT",
        "title": "Solana DeFi Protocol Which Previously Had Nearly $40M in TVL Shuts Down - Coinfomania",
        "content": "Jet protocol, a Solana-based decentralized finance (DeFi) project, announced on Tuesday that it is shutting down operations. Users are urged to withdraw their funds from the project before its wind-down occurs on February 1st, 2024.\n\nWhat is Jet Protocol?\n\nJet protocol is a DeFi project that offers lending and borrowing for cryptocurrencies. It also enables token swaps and a margin system. Launched in May 2021, the project is developed by U.S.-based company Jet Protocol Holdings, LLC. It has also garnered attention from investors.\n\nFollowing the project’s launch on-chain, it garnered over $38 million in total value locked (TVL) in November 2021, as revealed by the blockchain analytics platform, DeFiLlama. Since then, the protocol’s TVL has gradually diminished.\n\nCurrent data shows that the TVL has plunged to as low as $325,000, accompanied by a market capitalization of around $636,000.\n\nSource: DeFiLlama\n\nWhy is Jet Protocol Shutting Down?\n\nIn a community update shared by the project’s co-founder James Moreau, Jet protocol is shutting down due to a lack of funds to continue its business. Other entities tied to the project will shut down too. For example, Jet protocol’s decentralized autonomous organization (DAO) and its development company Jet Protocol Holdings, LLC, will close down as well.\n\nIn August, Jet protocol had already begun to downsize its workforce due to a lack of ability to pay workers. Since then, the remaining funds are being used to “operate the front end and back end hosting services, RPC services and other operating expenses.”\n\nFollowing the wind down, the project’s codes will be open-sourced, allowing other developers to build and enhance Jet protocol’s suite of products. Moreau urged users to “fork the code.”\n\nWhile users are urged to pull their funds from the project, the co-founder noted that assets still in the protocol after February 1st will be left there."
    }
]