[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGVjcnlwdC5jby8yMDE3NTIvc29sYW5hLWJ1Zy1ib3VudHktZnR4LXNhbS1iYW5rbWFuLWZyaWVkLWtpbGwtc3dpdGNoLXJ1bW9yc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "Correction: There Is No Solana Kill Switch, Bug Bounty Program Is Two Years Old - Decrypt",
        "content": "We do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEditor's note: Decrypt has retracted the original story, which took a hoax tweet about fake testimony by Caroline Ellison at Sam Bankman-Fried's criminal trial as fact. Further, although the Solana security bug bounty program was brought up in light of the hoax, the program has existed for two years. Decrypt regrets the error.\n\nAD\n\nAD"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5kZWxtYXJ0aW1lcy5uZXQvbGlmZXN0eWxlL3NvY2lldHkvc3RvcnkvMjAyMy0xMC0xNS9kZWwtbWFyLXNvbGFuYS1iZWFjaC1yb3RhcnktcHJlc2VudHMtM3JkLWFubnVhbC1iYWphLXN0eWxlLWxvYnN0ZXJmZXN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "Del Mar-Solana Beach Rotary presents '3rd Annual Baja Style LobsterFest' - Del Mar Times",
        "content": "Community members gathered Oct. 14 for the Del Mar-Solana Beach Rotary’s “3rd Annual Baja Style LobsterFest” held in the beautiful courtyard of the Del Mar Hilton. The event featured live music, auction items, local craft beer from Viewpoint Brewing Company, and a tequila tasting for VIP sponsors from the Solento Tequila company.\n\nThe highlight of the evening was the Baja-style lobster dinner created by Hilton Chef Ricardo Gutierrez, a Baja native.\n\nThe event is DMSB Rotary’s major fundraiser where all proceeds go to help the club’s major beneficiaries Just in Time for Foster Youth and Casa de Amistad, as well as other worthwhile organizations. They have raised over $850,000 since their formation in 1992 supporting underserved youth, the military, anti-human trafficking programs, and other community and international humanitarian projects. Visit www.dmsbrotary.com.\n\nPhotos by Robert McKenzie\n\n"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8xNS80NjEtc29sYW5hLXNvbC1wcmljZS10YXJnZXQtb24tdGhlLXRhYmxlLWlmLWV0aGVyZXVtLWV0aC1kb2VzLXRoaXMtbmV4dC1idWxsLWN5Y2xlLWludmVzdGFuc3dlcnMv0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzE1LzQ2MS1zb2xhbmEtc29sLXByaWNlLXRhcmdldC1vbi10aGUtdGFibGUtaWYtZXRoZXJldW0tZXRoLWRvZXMtdGhpcy1uZXh0LWJ1bGwtY3ljbGUtaW52ZXN0YW5zd2Vycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "$461 Solana (SOL) Price Target on the Table if Ethereum (ETH) Does This Next Bull Cycle: InvestAnswers - The Daily Hodl",
        "content": "A closely followed crypto analyst says that traders may be underestimating Solana’s (SOL) potential in the next bull market.\n\nIn a new strategy session, the host of InvestAnswers says that his base-case thesis for SOL is that it should reach 10% of Ethereum’s (ETH) market cap during the next market expansion.\n\nUnder the presumption that Ethereum tops out at $8,000 in the next bull market, the analyst theorizes that if Solana were to reach 10% of ETH’s market cap, which it already hit in the past, it would imply a $231 price target for SOL.\n\nHowever, InvestAnswers says that SOL reaching 20% of ETH’s market cap isn’t completely out of the realm of possibility.\n\n“If – which has always been part of my thesis – if Solana goes to 20% of the ETH market cap, that would take us to a $192 billion [market cap], and, given today’s prices and the number of tokens, that would take the price to $461, and that would be an ROI (return on investment) of 2,038%, and that would only be 5%, approximately of the crypto market cap. So, it’s not beyond the realm of possibilities at all.\n\nBut what’s even more strange is we got above the 10% threshold already in the past.\n\nThis is the SOL upside chart… You can see here the yellow line is the 10% of ETH market cap, and the Solana price in blue breached that back in October 2021.”\n\nAt time of writing, SOL is trading for $21.99.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Midjourney"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9zb2xhbmEtZGFyZXMtYW55b25lLXRvLXR1cm4tdGhlLW5ldHdvcmstb2ZmLWZvbGxvd2luZy1yZWNlbnQtY2xhaW1zL9IBXmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9zb2xhbmEtZGFyZXMtYW55b25lLXRvLXR1cm4tdGhlLW5ldHdvcmstb2ZmLWZvbGxvd2luZy1yZWNlbnQtY2xhaW1zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "Solana dares anyone to turn the network off following recent claims - AMBCrypto News",
        "content": "Following rumors that SBF was involved in previous outages, the foundation has brought on a new challenge.\n\nSOL’s price increased and sentiment stayed positive.\n\nIn a bid to either quench the rumor that anyone can switch off the Solana [SOL] network or find solutions to possible vulnerabilities, the Solana Foundation is offering $400,000 to any party that can find the codes that turn the network off.\n\nRealistic or not, here’s SOL’s market cap in ETH terms\n\nA bounty to prove right or wrong\n\nThe details for this reward were shared by Jacob Creech, head of developer relations at the foundations. The offer is also part of Solana’s security bug bounty program.\n\nFyi there's a $400k reward for anyone that can find code that can turn off Solana Please go ahead and find ithttps://t.co/2oxcB0EEyx — Jacob Creech (@jacobvcreech) October 12, 2023\n\nHowever, the need to put it out publicly could be linked to the recent claims in the Sam Bankman-Fried (SBF) trial.\n\nNeedless to say, SBF, during his time as FTX’s CEO never hid his love for the Solana project. But an unconfirmed testimony in the case by Alameda Research CEO Caroline Ellison has spread around the crypto community.\n\nAccording to the report, Ellison claimed that FTX randomly turned off the Solana network at intervals during his reign. The report also stated that the action was done to favor Alameda’s trades.\n\nThe result of the FTX downfall is still evident in Solana’s Total Value Locked (TVL) to date. At the height of the bull market in 2021, Solana’s TVL reached and surpassed $9 billion, The increase, at that time, meant that market participants could count on the blockchain. Therefore, it was almost a no-brainer to lock assets in the protocol.\n\nBut at press time, Solana’s TVL was down to $312.73 million, meaning all that trust the project once had, has really gone down.\n\nSolana gets the trust anyway\n\nAlthough many have confirmed the attestation to be fake, Solana’s numerous off-seasons between 2021 and 2022 still seem to be haunting the project. These incidents brought doubts about Solana’s claim to be the “Ethereum killer.” Besides that, there were still some players in the market who believed the report that Ellison said those words in court.\n\nRegardless of the “believe it or not” circumstance the speculation brought, Solana’s Weighted Sentiment remained positive. The Weighted Sentiment measures the positive or negative thoughts put out by members of the crypto community.\n\nAccording to Solana’s weighted sentiment was 0.036. This means that there were more optimistic utterances about the blockchain than gloom-ridden ones. One reason the sentiment around the project has remained positive could be the SOL price as shown below.\n\nRead Solana’s [SOL] Price Prediction 2023-2024\n\nIn the last 30 days, SOL’s value has gained 17.48%. This increase was much more than what Bitcoin [BTC] or most altcoins recorded within the same period.\n\nHowever, it might be too soon to assume that Solana was on a recovery journey. Nonetheless, one may have to give the project credit for remaining relevant despite its several challenges."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vY29pbmdhcGUuY29tL2Jsb2cvaXMtc29sYW5hLWEtZ29vZC1pbnZlc3RtZW50L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "Is Solana (SOL) a Good Investment In 2024? Detailed Analysis - CoinGape",
        "content": "Recently, the price of Solana (SOL) increased by 7.56% within 24 hours, surpassing Binance Coin Price (BNB) in market cap briefly. At that time, SOL’s market cap was $49.36 billion, slightly larger than BNB’s $48.5 billion, securing the third position according to CoinMarketCap data. However, as of the current moment, BNB has regained its position, now surpassing SOL by 2.25%. Over the past day, Solana has consistently traded above the $100 mark.\n\nBeyond its market fluctuations, Solana boasts various real-world applications including Web3 gaming, NFTs, DeFi, and opportunities for crypto-earning. This article will explore whether investing in Solana in 2024 is a wise decision\n\nadvertisement\n\nOverview of Solana\n\nSolana is one of the supposed “Ethereum Killer” blockchain projects improving upon the limitations like high gas fees and slower transactions.\n\nUnlike other existing blockchain networks, Solana runs based on Proof-of-History (PoH) consensus mechanism. This enabled the network to achieve a high throughput of 50,000 transactions per second (TPS), while still maintaining the security and scalability of the network.\n\nThe ultra-fast transactions combined with the low fees are the reasons why Solana is considered an Ethereum killer. It is one of the few blockchains that partnered with Visa for USDC settlements in September 2023.\n\nMoreover, Solana is the only blockchain that released a Web3 smartphone and remained at the forefront of blockchain innovation. Since its launch, many blockchain applications such as NFTs, dApps, DeFi lending protocols, Web3 games, and applications are being developed on the Solana network.\n\nPrice History of Solana (SOL) Coins\n\nThe Solana coin, SOL, was launched in March 2020 with a starting price of $0.98 per coin. It traded sideways for a long time and then reached its first all-time high value of $56 in May 2021.\n\nAs the blockchain’s popularity and adoption grew with the introduction of new applications like blockchain gaming, its price continued to increase. Its unique features like ultra high TPS and low transaction fees combined with new use cases and institutional investments caused sharp price spikes in the following months.\n\nAs a result, SOL price increased by a whopping 12,000% in 2021 and reached $175 in September 2021. Adding to that, the total-value locked (TVL) on Solana also hit an all-time high of $5.73 billion.\n\nThe price rally continued and the Solana price went to as high as $260 in November 2021. However, the unfavorable market conditions combined with multiple network outages adversely affected SOL price in 2022.\n\nMajor crypto incidents such as the FTX crash and the prolonged crypto bear market also played a part in Solana reaching a bottom of $8.9 by the end of 2022. However, Solana price got back up and recorded a significant price surge by the end of 2023. It is only a matter of time before Solana gets back on its winning streak in the market in 2024.\n\nMarket performance of Solana\n\nAs of today, the price of Solana stands at $115.93, marking a decrease of 17.29% in its 24-hour trading volume, which currently sits at $2.2 billion. Despite this recent decline, Solana has experienced a notable increase of 14.05% within the last 24 hours. However, it is important to note that Solana is still trading at a significant 55.33% below its all-time high of $260.06, which was reached on November 7, 2021.\n\nIn terms of market ranking, Solana currently holds the 5th position on CoinMarketCap, boasting a live market capitalization of $50.5 billion. With a circulating supply of 437.4 billion SOL coins, Solana has demonstrated impressive price movements, with a maximum increase of 13.53% over the past 7 days and a staggering 414.50% increase over the course of the past year.\n\nThe reason for SOL’s upward trend is attributed to airdrops, the network’s capacity to offer a cheaper and more user-friendly option compared to its rivals, and a high momentum rally in Bitcoin. Adding to this positive movement, Solana Mobile announced on its official X platform page that their new Solana smartphone received 100,000 preorders in less than a month, reflecting growing interest and confidence in blockchain technology.\n\n100,000 preorders in less than 30 days 🔥 We’re floored by the demand and truly grateful for the overwhelming support💪 Now that we’ve hit this milestone, the Founder Window & preorder price of $450 will close in 48 hours. Your chance to join is now! 👉 https://t.co/nYR9apGGIT pic.twitter.com/9L224igXcL — Solana Mobile 2️⃣ (@solanamobile) February 12, 2024\n\nSolana (SOL) Price Prediction\n\nSolana has been rallying alongside Bitcoin and other altcoins, managing to overcome resistance levels, particularly highlighted by the 61.8% Fibonacci level. As of Wednesday during US business hours, Solana was trading at $117. However, key obstacles lie ahead, with resistances noted at $120 and the recent peak of $125. Surpassing these hurdles would significantly increase the likelihood of Solana closing February above $140.\n\nTechnical indicators, such as the Moving Average Convergence Divergence (MACD), are supporting this positive trend, with a buy signal indicating an intact uptrend. Nevertheless, if Solana fails to break the resistance at $125 in the near term, traders may anticipate a minor reversal.\n\nThis could prompt investors to take profits, particularly considering Solana’s impressive performance since its support at $80 in January. The $100 region remains crucial for Solana and could potentially serve as support again if market dynamics shift and prices decline, presenting opportunities for dollar-cost averaging (DCA) given Solana’s history of rewarding such dips.\n\nCrypto expert Koroush Khaneghah has expressed optimism about Solana (SOL), suggesting a strong possibility of the token reaching $140. SOL could potentially follow suit with a surge of over 30% to reach this target. It seems poised to sustain its upward momentum, aiming for levels near $150 by mid-2024. Notably, the surge in open interest, surpassing $1.75 billion, further demonstrating SOL’s bullish trajectory.\n\nConclusion: Is Solana a Good Investment?\n\nConsidering the recent performance and ongoing developments, Solana (SOL) appears to present a compelling investment opportunity. With its recent surge, SOL briefly surpassed BNB in market cap, showcasing its potential for growth.\n\nBeyond market fluctuations, Solana stands out with its innovative approach, offering solutions to the limitations faced by other blockchain networks. Its unique features like high throughput and low fees, along with partnerships like Visa for USDC settlements, underline its utility and potential for widespread adoption.\n\nAlthough SOL has experienced significant price fluctuations, including a recent dip below its all-time high, its current trajectory suggests a promising outlook. Technical indicators and expert predictions hint at the potential for SOL to surpass key resistance levels and reach new highs, with targets as high as $140 and beyond.\n\nFurthermore, the growing interest in blockchain technology and the surge in open interest further boosting SOL’s bullish trajectory, making it an attractive investment option for those looking to capitalize on the potential growth of the cryptocurrency market.\n\nHowever, investors should remain vigilant and informed to navigate the dynamic landscape of cryptocurrency investments effectively.\n\nFAQs\n\nDoes Solana have a future?\n\nSolana has advanced features such as lightning fast transactions at low fees. It also has several blockchain applications like NFT trading, Web3 gaming, DeFi earning opportunities, and more. So, yes. Solana does have a future considering its blockchain innovation and adoption.\n\nCan Solana reach $1,000?\n\nIf Solana reaches $1,000, its total market capitalization will be more than $550 billion. Considering the fact that the total market capitalization of the crypto market itself is slightly above $1 trillion in February 2024, Solana reaching $1,000 is unlikely in this year.\n\nIs Solana a better investment than Ethereum?"
    }
]