[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAxLzIyL3RvcC1jcnlwdG8tYW5hbHlzdC1wcmVkaWN0cy1idWxsaXNoLWNvbnRpbnVhdGlvbnMtZm9yLXNvbGFuYS1hbmQtdHdvLXVuZGVyLXRoZS1yYWRhci1hbHRjb2lucy_SAYMBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDEvMjIvdG9wLWNyeXB0by1hbmFseXN0LXByZWRpY3RzLWJ1bGxpc2gtY29udGludWF0aW9ucy1mb3Itc29sYW5hLWFuZC10d28tdW5kZXItdGhlLXJhZGFyLWFsdGNvaW5zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Jan 2023 08:00:00 GMT",
        "title": "Top Crypto Analyst Predicts Bullish Continuations for Solana and Two Under-the-Radar Altcoins - The Daily Hodl",
        "content": "A widely followed trader says he sees more upside potential for smart contract platform Solana (SOL) and two tokens flying under the radar.\n\nPseudonymous Cantering Clark tells his 158,900 Twitter followers that traders who continue to bet against the Ethereum rival will likely be blown out of their positions by a short squeeze.\n\n“This weekend is probably going to be nuts for alts.\n\nSOL is going +$30 before this is all over.\n\nMajor squeeze through this level seems obvious.”\n\nA short squeeze happens when traders who borrow an asset at a certain price in hopes of selling it for lower to pocket the difference are forced to buy back the assets they borrowed as momentum moves against them, triggering further rallies.\n\nAt time of writing, Solana is switching hands for $25.\n\nNext up is move-to-earn token STEPN (GMT), which he predicts will likely rally toward his target at $6.63.\n\n“They are still active on socials and I expect that they start making announcements and trying to raise prices again to take advantage of this rally. Reclaim and retest setup that has been seen broadly across all alts is on the table as well. Send.”\n\nAt time of writing, GMT is trading at $0.49.\n\nThe last coin on the trader’s radar is Optimism (OP), a layer-2 scaling solution for Ethereum (ETH). According to Cantering Clark, he expects OP to print fresh all-time highs.\n\n“OP is about to enter price discovery. This means anyone who sold before was wrong, and new highs usually bring inflows from all types of traders.\n\nNew all-time high after a prolonged period of time is +expected value buy.\n\nSend.”\n\nAt time of writing, OP is swapping hands for $2.24, slightly above the trader’s resistance area of $2.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Vink Fan/Natalia Siiatovskaia"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNyeXB0b2dsb2JlLmNvbS9sYXRlc3QvMjAyMy8wMS9zb2wtdG90YWwtbnVtYmVyLW9mLWRldmVsb3BlcnMtb24tc29sYW5hLWdyZXctODMtcGVyLWVsZWN0cmljLWNhcGl0YWwtcmVwb3J0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Jan 2023 08:00:00 GMT",
        "title": "$SOL: Total Number of Developers on Solana Grew 83%, per Electric Capital Report - CryptoGlobe",
        "content": "A recent research report on blockchain/crypto developers says that in 2022, among blockchain ecosystems with 1000+ total number of developers, Solana had the highest rate of growth (83%) of ecosystem developer count.\n\nHere is how Coinbase described Solana in a blog post published on 29 June 2022:\n\n“Solana is a decentralized computing platform that uses SOL to pay for transactions. Solana aims to improve blockchain scalability by using a combination of proof of stake consensus and so-called proof of history. As a result, Solana claims to be able to support 50,000 transactions per second without sacrificing decentralization, and is one of the largest proof of stake blockchains by market cap.\n\n“Solana aims to enable smart contracts to allow developers to build a wide range of decentralized finance (DeFi) apps, new crypto tokens, games, and more. When users stake their crypto, they make the underlying blockchain of that asset more secure and more efficient. And in exchange, they are rewarded with additional assets from the network, which are paid out as rewards.“\n\nOn 17 January 2023, crypto and FinTech-focused venture capital firm Electric Capital released the 2022 edition of its “Developer Report“.\n\nThe Solana team said that this report shows that “the total number of developers on Solana has grown more than 10x since 2018, more than any other blockchain.”\n\n2/ The total number of developers on Solana grew 83% from December 2022 to a year earlier, the fastest rate of growth from any major chain.\n\n\n\nThe total number of developers on Solana has grown more than 10x since 2018, more than any other blockchain. https://t.co/cdUoIObAL4 pic.twitter.com/ptcjq2CnQF — Solana (@solana) January 17, 2023\n\nAccording to data by TradingView, since 29 December 2022, the $SOL price has gone from $8.29 to $24.98, which is a gain of 201.32% vs USD.\n\nCiti (C), in a research study published on 12 January 2023, stated that despite the fact that an estimated 50 million Solana (SOL) coins are stuck in the Chapter 11 proceedings of cryptocurrency exchange FTX, there is still a significant amount of activity on the Solana blockchain.\n\nAccording to CoinDesk’s report about Citi’s research note, this has significantly decreased the amount of the cryptocurrency that is now in circulation and has exacerbated the level of uncertainty over the future of blockchain technology.\n\nAnalysts led by Joseph Ayoub stated:\n\n“However, numerous critical measures like as active addresses and daily non-fungible-token (NFT) traffic have recovered to pre-FTX-collapse levels.This might potentially indicate comfort from some users on the chain.“\n\nCiti says developers have continued to be active on the blockchain, as seen by the recent airdrop of the new project Bonk Inu ($BONK) to holders of Solana.\n\nCiti’s note pointed out that Solana’s largest NFT collection, DeGods, had just departed the network, citing uncertainties about its future. Citi also mentioned that Solana’s primary task is to encourage users and developers to remain loyal to the platform.\n\nImage Credit\n\nFeatured Image via Pixabay"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNyeXB0b2dsb2JlLmNvbS9sYXRlc3QvMjAyMy8wMS9zb2wtdG90YWwtbnVtYmVyLW9mLWRldmVsb3BlcnMtb24tc29sYW5hLWdyZXctODMtcGVyLWVsZWN0cmljLWNhcGl0YWwtcmVwb3J0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Jan 2023 08:00:00 GMT",
        "title": "$SOL: Total Number of Developers on Solana Grew 83%, per Electric Capital Report - CryptoGlobe",
        "content": "A recent research report on blockchain/crypto developers says that in 2022, among blockchain ecosystems with 1000+ total number of developers, Solana had the highest rate of growth (83%) of ecosystem developer count.\n\nHere is how Coinbase described Solana in a blog post published on 29 June 2022:\n\n“Solana is a decentralized computing platform that uses SOL to pay for transactions. Solana aims to improve blockchain scalability by using a combination of proof of stake consensus and so-called proof of history. As a result, Solana claims to be able to support 50,000 transactions per second without sacrificing decentralization, and is one of the largest proof of stake blockchains by market cap.\n\n“Solana aims to enable smart contracts to allow developers to build a wide range of decentralized finance (DeFi) apps, new crypto tokens, games, and more. When users stake their crypto, they make the underlying blockchain of that asset more secure and more efficient. And in exchange, they are rewarded with additional assets from the network, which are paid out as rewards.“\n\nOn 17 January 2023, crypto and FinTech-focused venture capital firm Electric Capital released the 2022 edition of its “Developer Report“.\n\nThe Solana team said that this report shows that “the total number of developers on Solana has grown more than 10x since 2018, more than any other blockchain.”\n\n2/ The total number of developers on Solana grew 83% from December 2022 to a year earlier, the fastest rate of growth from any major chain.\n\n\n\nThe total number of developers on Solana has grown more than 10x since 2018, more than any other blockchain. https://t.co/cdUoIObAL4 pic.twitter.com/ptcjq2CnQF — Solana (@solana) January 17, 2023\n\nAccording to data by TradingView, since 29 December 2022, the $SOL price has gone from $8.29 to $24.98, which is a gain of 201.32% vs USD.\n\nCiti (C), in a research study published on 12 January 2023, stated that despite the fact that an estimated 50 million Solana (SOL) coins are stuck in the Chapter 11 proceedings of cryptocurrency exchange FTX, there is still a significant amount of activity on the Solana blockchain.\n\nAccording to CoinDesk’s report about Citi’s research note, this has significantly decreased the amount of the cryptocurrency that is now in circulation and has exacerbated the level of uncertainty over the future of blockchain technology.\n\nAnalysts led by Joseph Ayoub stated:\n\n“However, numerous critical measures like as active addresses and daily non-fungible-token (NFT) traffic have recovered to pre-FTX-collapse levels.This might potentially indicate comfort from some users on the chain.“\n\nCiti says developers have continued to be active on the blockchain, as seen by the recent airdrop of the new project Bonk Inu ($BONK) to holders of Solana.\n\nCiti’s note pointed out that Solana’s largest NFT collection, DeGods, had just departed the network, citing uncertainties about its future. Citi also mentioned that Solana’s primary task is to encourage users and developers to remain loyal to the platform.\n\nImage Credit\n\nFeatured Image via Pixabay"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LnRla2VkaWEuY29tL3RocmVlLWNyeXB0b2N1cnJlbmNpZXMtdG8tbW9vbi1zb2xhbmEtdW5pc3dhcC1hbmQtYmlnLWV5ZXMtY29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Jan 2023 08:00:00 GMT",
        "title": "Three Cryptocurrencies To Moon: Solana, Uniswap, And Big Eyes Coin - Tekedia",
        "content": "Since its inception in 2009, crypto has changed the financial world and lined the pockets of many early investors. Today, if you mention the term Bitcoin (BTC), most people will know what you’re referring to as digital currency.\n\nHowever, many people feel like they missed their opportunity with Bitcoin, as it went from the value of less than a dollar, to reaching a peak of over 48,000 dollars! Although Bitcoin is a great long-term investment option, many people are unaware of an entire world of altcoins to choose from, which could see their value skyrocket.\n\nIn this article, we will be looking at three of our altcoin picks: Solana (SOL), Uniswap (UNI), and Big Eyes Coin (BIG).\n\nBig Eyes Coin (BIG): The New Dog Killer\n\nA trailblazing kitty has started with a bang by making over $16.2 million dollars in pre-sale! Now that’s apaws-able.\n\nBig Eyes Coin (BIG) is a meme community token, which aims to shift wealth into decentralised finance (DeFi), but is also committed to saving the oceans, with over 5% of its tokens placed in a visible charity wallet!\n\nUnlike its competitors in the meme coin market, such as Dogecoin (DOGE) and Shiba Inu (SHIB), which rely on the overly saturated dog mascot, Big Eyes Coin (BIG), uniquely uses an irresistibly cute cat as the face of the project.\n\nBig Eyes is proud of being a community token, as it can be seen on the Twitter page they are consistently launching competitions and are finding ways to get their awesome loyal community members involved.\n\nWith definitive goals, solid community backing and their new NFT launch, Big Eyes Coin seems to be headed to the moon! And with its 200% bonus code LAUNCHBIGEYES200 now live, which gives any investment an extra 200%! Additionally, the Big Eyes Coin website’s new calculator tool makes it so much easier to figure out any potential earnings, allowing you to see how you could go to the moon with Big Eyes Coin.\n\nUniswap (UNI): The Unicorn that could Grant Your Wishes\n\nUniswap (UNI) is one of the largest and considered most secure decentralized exchanges for swapping tokens, allowing users to quickly and simply trade Ethereum-based ERC20 tokens. Uniswap was first launched in November 2018 as a platform created to remove the barriers of entry and make token swaps available to anyone. It uses automated market makers (AMM) which allows users to buy and sell digital assets without the need for a central counterparty.\n\nThe special feature of the Uniswap token (UNI) is that it gives users access to a staggeringly wide variety of digital assets, allowing investors to diversify their holdings across a wide variety of tokens. Furthermore, by offering a totally decentralised platform—all transactions are completed peer-to-peer, directly between traders, with no middleman – Uniswap eliminates counterparty risk. Additionally, traders that use Uniswap benefit from minimal trading fees because there is no middleman in the transaction.\n\nIf you’re looking for an alternative way to invest in cryptocurrencies that could help you diversify your portfolio and potentially get higher returns – then investing in Uniswap may be right for you!\n\nSolana (SOL): The Ethereum Killer\n\nSolana (SOL) is an open-source network which has been titled the “Ethereum Killer” through its ability to conduct transactions at a rapid speed!\n\nIt is impressively capable of facilitating over 50,000 transactions per second, which is 1000 times faster than Bitcoin and more than 3,000 times faster than Ethereum! The fact Solana is able to work more quickly than Bitcoin and Ethereum makes it more scalable and suitable for investors who are looking to double their digits.\n\nAccording to the data on CoinMarketCap, in the last thirty days, Solana has surged by a whopping 72.92% at the time of writing! This is an incredible score considering that it’s a bear market. With this in mind, you may want to consider scooping up some Solana!\n\nFinal Thoughts:\n\nWith cryptocurrency and Bitcoin steadily on the rise again, it’s a great time to consider buying some coins! Of course, you could stock up on Bitcoin, which should be here for the long run – but, if you want to see more significant gains, then look towards altcoins as many of which have yet to take off to the moon!\n\nBig Eyes Coin (BIG):\n\nPre-sale: https://buy.bigeyes.space\n\nWebsite: https://bigeyes.space\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzIzMzcxL3NvbGFuYS1wcmVkaWN0aW9uLWphbnVhcnktMjItMjAyMy_SAUlodHRwOi8vYW1wLmNvaW5jb2RleC5jb20vYXJ0aWNsZS8yMzM3MS9zb2xhbmEtcHJlZGljdGlvbi1qYW51YXJ5LTIyLTIwMjMv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 22 Jan 2023 08:00:00 GMT",
        "title": "Solana Price Prediction – SOL Price Estimated to Drop to $ 20.60 By Jan 27, 2023 - CoinCodex",
        "content": "Disclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision.\n\nSolana is down -3.40% today against the US Dollar\n\nSolana is currently trading 19.95% above our prediction on Jan 27, 2023\n\nSolana gained 108.51% in the last month and is down -73.02% since 1 year ago\n\nSolana price $ 24.70 Solana prediction $ 20.60 (-16.63%) Sentiment Neutral Fear & Greed index 53 (Neutral) Key support levels $ 24.07, $ 23.48, $ 22.36 Key resistance levels $ 25.79, $ 26.91, $ 27.50\n\nSOL price is expected to drop by -16.63% in the next 5 days according to our Solana price prediction\n\nis trading at $ 24.70 after losing -3.40% in the last 24 hours. The coin underperformed the cryptocurrency market, as the total crypto market cap decreased by -2.15% in the same time period. SOL performed poorly against BTC today and recorded a -0.91% loss against the world’s largest cryptocurrency.\n\nAccording to our Solana price prediction, SOL is expected to reach a price of $ 20.60 by Jan 27, 2023. This would represent a -16.63% price decrease for SOL in the next 5 days.\n\nSOL Price Prediction Chart\n\nBuy/Sell Solana\n\nWhat has been going on with Solana in the last 30 days\n\nSolana has been displaying a positive trend recently, as the coin gained 108.51% in the last 30-days. The medium-term trend for Solana has been bearish, with SOL dropping by -12.73% in the last 3 months. The long-term picture for Solana has been negative, as SOL is currently displaying a -73.02% 1-year price change. On this day last year, SOL was trading at $ 91.57.\n\nSolana reached its all-time high price on Nov 06, 2021, when the price of SOL peaked at $ 259.52. The current SOL cycle high is $ 26.33, while the cycle low is at $ 8.09. SOL has been displaying high volatility recently – the 1-month volatility of the coin is at 32.66. Solana recorded 16 green days in the last 30 days.\n\nSolana technical analysis for today - Jan 22, 2023\n\nThe sentiment in the Solana markets is currently Neutral, and the Fear & Greed index is reading Neutral. The most important support levels to watch are $ 24.07, $ 23.48 and $ 22.36, while $ 25.79, $ 26.91 and $ 27.50 are the key resistance levels.\n\nNeutral sentiment for Solana\n\n21 indicators are currently signaling a bullish prediction for Solana, while 9 indicators are showing a bearish forecast. With 70% of indicators favoring a positive prediction. This results in an overall Neutral sentiment for Solana.\n\nCrypto market is currently experiencing Neutral\n\nCurrently, the Fear & Greed index is at 53 (Neutral), which signals that investors have a neutral outlook on the market. The Fear & Greed index is a measure of sentiment among cryptocurrency investors. A “Greed” reading suggests that investors are currently optimistic about the cryptocurrency market, but can also be an indication that the market is overvalued. A “Fear” reading, on the other hand, signals that investors are currently hesitant about the cryptocurrency market, which potentially represents a buying opportunity.\n\nSolana moving averages & oscillators\n\nLet’s take a look at what some of the most important technical indicators are signaling. We’ll be going through key moving averages and oscillators that will allow us to get a better idea of how Solana is positioned in the market right now.\n\nPeriod Daily Simple Daily Exponential Weekly Simple Weekly Exponential MA3 $ 23.87 (BUY) $ 24.66 (BUY) - - MA5 $ 23.08 (BUY) $ 24.12 (BUY) - - MA10 $ 22.11 (BUY) $ 22.49 (BUY) - - MA21 $ 17.71 (BUY) $ 19.40 (BUY) $ 23.33 (BUY) $ 23.27 (BUY) MA50 $ 14.63 (BUY) $ 17.01 (BUY) $ 47.76 (SELL) $ 43.43 (SELL) MA100 $ 18.59 (BUY) $ 19.55 (BUY) $ 72.60 (SELL) $ 54.93 (SELL) MA200 $ 27.41 (SELL) $ 30.09 (SELL) - -\n\nPeriod Value Action RSI (14) 70.62 SELL Stoch RSI (14) 27.06 NEUTRAL Stochastic Fast (14) 87.54 SELL Commodity Channel Index (20) 66.67 NEUTRAL Average Directional Index (14) 42.72 BUY Awesome Oscillator (5, 34) 8.11 NEUTRAL Momentum (10) 8.31 NEUTRAL MACD (12, 26) 0.69 NEUTRAL Williams Percent Range (14) -12.46 SELL Ultimate Oscillator (7, 14, 28) 54.42 NEUTRAL VWMA (10) 22.68 BUY Hull Moving Average (9) 22.99 BUY Ichimoku Cloud B/L (9, 26, 52, 26) 17.22 NEUTRAL\n\nThe Relative Strength Index (RSI 14) is a widely used indicator that helps inform investors whether an asset is currently overbought or oversold. The RSI 14 for Solana is at 70.62, suggesting that SOL is currently overbought.\n\nThe 50-day Simple Moving Average (SMA 50) takes into account the closing price of Solana over the last 50 days. Currently, Solana is trading below the SMA 50 trendline, which is a bearish signal.\n\nMeanwhile, the 200-day Simple Moving Average (SMA 200) is a long-term trendline that’s calculated by taking an average of the SOL closing price for the last 200 days. SOL is now trading above the SMA 200, signaling that the market is currently bullish.\n\nThe bottom line about this Solana prediction\n\nAfter considering the above factors, we can conclude that the current forecast for Solana price prediction is Neutral. SOL would have to decrease by -16.63% to hit our $ 20.60 target within the next five days. Moving forward, it will be important to monitor the SOL market sentiment, the key support and resistance levels, and other metrics. However, we have to keep in mind that the cryptocurrency markets are unpredictable, and even the largest crypto assets display a lot of price volatility. For long-term Solana price predictions click here.\n\nDisclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision."
    }
]