[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTAvMTcvbGlkby1maW5hbmNlLXN1bnNldHMtc29sYW5hLXN0YWtpbmctcHJvZHVjdC1hZnRlci1kYW8tdm90ZS_SAWhodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzEwLzE3L2xpZG8tZmluYW5jZS1zdW5zZXRzLXNvbGFuYS1zdGFraW5nLXByb2R1Y3QtYWZ0ZXItZGFvLXZvdGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Lido Finance Sunsets Solana Staking Product After DAO Vote - CoinDesk",
        "content": "A proposal floated by P2P Validator, the developers who built the product on Lido in early September, revealed that they took losses of over $480,000 in the past year against the $700,000 spent to build the product. It shared concerns about being unable to achieve objectives in the next year, citing difficult market conditions."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzE3L2hlcmUtYXJlLXRoZS1tYWpvci10YWlsd2luZHMtZm9yLWV0aGVyZXVtLXJpdmFsLXNvbGFuYS1hY2NvcmRpbmctdG8tY3J5cHRvLWFuYWx5c3Qv0gF4aHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTAvMTcvaGVyZS1hcmUtdGhlLW1ham9yLXRhaWx3aW5kcy1mb3ItZXRoZXJldW0tcml2YWwtc29sYW5hLWFjY29yZGluZy10by1jcnlwdG8tYW5hbHlzdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Here Are the Major Tailwinds for Ethereum Rival Solana, According to Crypto Analyst - The Daily Hodl",
        "content": "A widely followed crypto analyst is naming a number of potential bullish catalysts for Ethereum (ETH) competitor Solana (SOL).\n\nIn a new video, the anonymous host of InvestAnswers tells his 447,000 YouTube subscribers that Solana is receiving more mainstream attention amid key program developments.\n\n“I see a number of different tailwinds for Solana. It is still riskier than ETH. ETH is the 800-pound gorilla. Nearly everything runs on Ethereum. And it’s very hard to knock that rider off the horse. But let me talk to you about some of the tailwinds…\n\nThe world is waking up to it now, all the narratives, [the] mainstream media. You got Fidelity talking about ETH and SOL alongside each other. You have that other report coming out from Standard Chartered Bank. They said ETH is going to $8,000 and they also referenced Solana in their research paper that Solana could eat a lot of ETH market share, especially around things like tokenization, which was huge.”\n\nThe analyst lists a number of tailwinds for Solana, including Solana Pay, which recently integrated with Shopify, and the project’s crypto-friendly smartphone Saga.\n\n“But the tailwinds are Solana Pay, Saga phone, the decentralized app store. They’ve got EVMs (Ethereum virtual machine) and SVMs (Solana virtual machine) built on Solana so now SOL-to-ETH bridging is very capable.\n\nFiredancer and one million transactions per second, that’s coming. They hope to come out of beta at the end of this year and launch sometime in 2024. But that will bring resilience, efficiency, decentralization and security. This whole thing is built on C++, whereas Ethereum is built on Rust… And if they have both up and running, there is no risk of ever any downtime again.\n\nAlso, cost-efficiency and scalability, the Visa partnership, great tokenomics, gaming, tokenization of the world.”\n\nSolana is trading for $24.18 at time of writing, up 9.27% in the last 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3Mvc29sYW5hLWZvdW5kYXRpb24tb2ZmZXJzLTQwMGstYm91bnR5LWZvci1jcml0aWNhbC1jb2RlLWRpc2NvdmVyedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Solana Foundation Offers $400k Bounty for Critical Code Discovery - Blockchain.News",
        "content": "The Solana Foundation is offering a monetary reward of $400,000 to anyone who can identify a code that could potentially halt the Solana network, as revealed by Jacob Creech, Head of Developer Relations at Solana. The announcement came through Creech's Twitter post on 13th October 2023. The bounty is part of Solana's bug bounty program aimed at discovering and rectifying critical vulnerabilities to ensure the network's robustness and security.\n\nBounty for Liveness Loss\n\nThe specific bounty of $400,000 is categorized under \"Liveness / Loss of Availability\" in Solana's Security Bug Bounties program, which covers incidents where consensus halts and requires human intervention including eclipse attacks, remote attacks partitioning the network. The reward is paid in locked SOL tokens with a lockup period of 12 months.\n\nReporting and Response Process\n\nSolana has a well-defined process for reporting, reviewing, and addressing security issues. Individuals discovering a potential vulnerability are instructed to report it through a designated \"Report a Vulnerability\" link rather than creating a GitHub issue. The Solana Labs team typically responds within 72 hours, following which a triage and fix preparation process ensues. Once a fix is ready, it's communicated to the network validators using the \"Solana Red Alert\" notification system, ensuring a coordinated effort to address the vulnerability.\n\nBesides the aforementioned category, Solana's bug bounty program includes other categories like \"Loss of Funds,\" \"Consensus/Safety Violations,\" and \"DoS Attacks,\" with rewards ranging from $100,000 to $2,000,000. These bounties reflect Solana's commitment to maintaining a secure and reliable blockchain network by incentivizing the discovery and reporting of potential security threats.\n\nEligibility and Payment\n\nTo be eligible for the bounty, submissions must include an exploit proof-of-concept. The Solana Foundation has outlined a clear process, including KYC (Know Your Customer) procedures and a participation agreement that needs to be adhered to by the participants. The bounties are awarded on a rolling or weekly basis, and are paid out within 30 days upon receipt of an invoice, with the SOL/USD conversion rate being determined by the market price of SOL at the end of the day the invoice is submitted.\n\nIn summary, the Solana Foundation's proactive stance towards identifying and rectifying potential security threats through substantial bounties reflects its continuous effort to uphold network integrity and ensure a secure blockchain environment for its users and developers.\n\nImage source: Shutterstock\n\n. . .\n\nTags"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9saWRvLWRhby12b3Rlcy10by1zdW5zZXQtdGhlLWxpZG8tb24tc29sYW5hLXByb2plY3Qv0gFRaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2xpZG8tZGFvLXZvdGVzLXRvLXN1bnNldC10aGUtbGlkby1vbi1zb2xhbmEtcHJvamVjdC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Lido DAO Votes to Sunset the Lido on Solana Project - CryptoPotato",
        "content": "The Lido on Solana project will wind down following the inability of the P2P team to sustain the project due to financial constraints.\n\nAccording to the team, the sunsetting of the project will happen over the coming months, with stSOL token holders given until February 2024 to unstake through the Lido on the Solana frontend.\n\nLido Discontinues Liquid Staking on Solana\n\nThe decision for Lido to cease its liquid staking solution on the Solana blockchain comes after an “extensive DAO discussion and community vote,” according to an announcement on Monday, Oct. 16, 2023.\n\nBased on results from a snapshot, over 92% of Lido token holders voted in support of sunsetting the Lido on Solana protocol, while just over 7% voted to provide funding to the project.\n\nP2P validator, the team behind the development of Lido on Solana, previously proposed two scenarios to community members – fund the project with $1.5 million to sustain operations or exit the Solana blockchain.\n\nYuri Mediakov of P2P, who put forth the proposals, listed project and business developments, along with profit and losses. Mediakov said the team invested about $700,000 into development and support but got a revenue of $220,000, thereby making a loss of $484,000.\n\nThe proposal, meanwhile, stated at the time that if the community voted for the sunsetting option, the team would need $20,000 monthly in support from the Lido DAO for technical maintenance for five months, beginning from Sept. 4, 2023.\n\nAn excerpt from the latest announcement reads:\n\n“After much discussion and a vote by Lido DAO members, it was decided that the best course of action would be to wind down Lido on Solana. Whilst this decision was difficult in the face of numerous strong relationships across the Solana ecosystem, it was deemed a necessity for the continued success of the broader Lido protocol ecosystem.”\n\nSOL Staking Stops With Immediate Effect\n\nThe sunsetting process will happen in phases, with staking on Solana discontinued with immediate effect, while node operators can begin voluntary off-boarding from Nov. 17, 2023.\n\nAlso, stSOL token holders will continue to receive rewards throughout the winding down process, but unstaking via the Lido on the Solana frontend will stop by Feb. 4, 2024. Holders who miss the deadline will have to unstake through the Command Line Interface (CLI).\n\n“The journey with Lido on Solana protocol has been momentous, filled with challenges overcome and milestones celebrated. While this marks the end of this particular chapter, the optimism of Lido contributors for the future of Solana remains undiminished.”\n\nIn addition to its exit from the Solana blockchain, Lido also previously wound down liquid staking operations on Kusama and Polkadot."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3NvbGFuYS1sb3Nlcy0xMDAtbWlsbGlvbi1pbi10dmwtb3Zlci0yNC1ob3Vycy1hZnRlci1saWRvLWJpZHMtZmFyZXdlbGwtMjAyMzEwMTcwNTUz0gGGAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3NvbGFuYS1sb3Nlcy0xMDAtbWlsbGlvbi1pbi10dmwtb3Zlci0yNC1ob3Vycy1hZnRlci1saWRvLWJpZHMtZmFyZXdlbGwtMjAyMzEwMTcwNTUz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Solana loses $100 million in TVL over 24 hours after Lido bids farewell - FXStreet",
        "content": "Solana's Total Value Locked (TVL) experienced a drop of $100 million in a single day on Tuesday.\n\nLido Finance, a liquid staking provider, announced its intention to discontinue on Solana.\n\nSolana's TVL decreased from $313 million to $210 million despite positive price action.\n\nSolana's Total Value Locked (TVL) took a substantial hit on Tuesday, plummeting by $100 million in just one day. The steep decline follows liquidity staking platform Lido Finance's announcement that it will discontinue its services on the Solana blockchain.\n\nAlso Read: LDO sees lowest cumulative volume in ten months as Lido DAO price struggles to breach key barrier\n\nSolana bids adieu to Lido\n\nLido Finance, a liquid-staking provider, made an announcement on Monday that confirmed their intent to discontinue services on the Solana network over the coming months.\n\nLido is the third largest among Solana protocols and has a presence on five chains, including Ethereum.\n\nThe decentralized application (dApp) noted that the decision was reached following discussions within the Decentralized Autonomous Organization (DAO) forum and a community vote. The statement said, \"The sunsetting of the Lido on Solana protocol was approved by Lido token holders and the process will begin shortly.\"\n\nThe decision stemmed from a P2P Validator proposal that outlined Lido's challenges and future prospects on Solana.\n\nThe DAO discussed if they can continue Lido on Solana with the treasury's backing or discontinue it.\n\nFollowing the discussion, users of Lido's staking services on Solana (stSOL holders) will reportedly receive network rewards throughout the discontinuation. stSOL holders can also unstake with Lido having shut down new stakes on Monday. It will begin node off-boarding on November 17 with the front-end support ceasing on February 4, 2024.\n\nSolana TVL loses $100 million\n\nData from defiLlama reveals that Solana, which boasted a TVL of $313 million on October 16, saw that figure drop to $210 million on October 17.\n\nThe interesting bit is that Lido witnessed a positive TVL change in one day. The liquidity-staking dApp dominates around $56.4 million of Solana's entire TVL, but it has seen a positive 7% addition in the last 24 hours.\n\nSolana TVL\n\nSolana's TVL decline coincided with Lido Finance's decision to sever ties with the platform. This comes despite Solana experiencing a positive price movement over the last 24 hours.\n\nLido’s TVL change\n\nAs of the time of writing, Solana (SOL) is trading close to $24, fluctuating within the $22 to $24 daily range. CoinGecko reports a 24-hour trading volume of $900 million, signifying a 9% price increase in the past day and a similar increase over the past week. With a circulating supply of 420 million SOL, Solana boasts a market cap of $9.9 billion.\n\nThe substantial loss of TVL on Solana has to be monitored as there are no other apparent factors to account for at the moment. This is especially true as Solana recorded a TVL increase over the last week despite a sluggish altcoin market. Its strong price action is a positive for the chain in the short term."
    }
]