[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vYmxvY2tzdGVyLmNvbS9zb2xhbmEtam9pbnMtZm9yY2VzLXdpdGgtZ29vZ2xlLWNsb3Vkcy1iaWdxdWVyeS1mb3ItZGF0YS1hbmFseXRpY3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Solana Joins Forces with Google Cloud's BigQuery for Data Analytics - Blockster",
        "content": "As the Founder, Editor-In-Chief, and Creative Director of Blockster, I lead the creation of captivating stories, collaborate with top Web3 brands, and drive our innovative product strategy."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8zMS9leC1nb2xkbWFuLXNhY2hzLWV4ZWN1dGl2ZS1zZWVzLXJvY2tldC1zaGlwLXNvbGFuYS1zb2wtY2hhcnQtaW4tdGhlLXdvcmtzLWFoZWFkLW9mLW9uZS1idWxsaXNoLWNhdGFseXN0L9IBjQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8zMS9leC1nb2xkbWFuLXNhY2hzLWV4ZWN1dGl2ZS1zZWVzLXJvY2tldC1zaGlwLXNvbGFuYS1zb2wtY2hhcnQtaW4tdGhlLXdvcmtzLWFoZWFkLW9mLW9uZS1idWxsaXNoLWNhdGFseXN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Ex-Goldman Sachs Executive Sees ‘Rocket Ship’ Solana (SOL) Chart in the Works Ahead of One Bullish Catalyst - The Daily Hodl",
        "content": "Former Goldman Sachs executive Raoul Pal says Solana (SOL) is starting to look like a rocket ship on the charts as it gears up for big developments.\n\nIn a new interview with Scott Melker, Pal touches on Firedancer, a new validator client for the Solana chain which is being developed by trading giant Jump Crypto.\n\nFiredancer aims to vastly improve Solana’s scalability, and push its transactions-per-second (TPS) capabilities potentially above one million TPS.\n\nSays Pal,\n\n“I was thinking at the time maybe it’s some sort of layer-2 blah blah blah compromise, so I went back home, I was looking at the charts, which I have been for a long time of Solana versus ETH (SOL/ETH) and Solana versus Bitcoin (SOL/BTC) and I’m like ‘this looks like a… rocket ship! What is going on here?’\n\nI started looking in and watching the interviews with the Jump trading team who built Firedancer and realized it was a separate validator for Solana that increases the security of the entire chain itself and that yes, these speeds were right because it was being built by people who were trying to build lightspeed for high-frequency trading…\n\nI’m like, okay, this is huge.”\n\nAt time of writing, there is no set launch date for Firedancer as of yet.\n\nPal has previously called for Solana to potentially repeat Ethereum’s (ETH) bull market cycle of 2021 and reiterates his stance that SOL may still be on track to do just that in an upcoming market expansion.\n\n“To me, I’m looking at risk/rewards here, and I’m just thinking, ‘Could this be the ETH of this cycle?’ That’s not taking away from ETH, that’s not taking away from Bitocin. What we’re trying to do, if we’re in this ugly economic world, you want to try to make as many chips as possible when you can. That’s the game.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JhbmtydXB0LWZ0eC1tb3Zlcy0xNTZtLXdvcnRoLW9mLWFzc2V0cy1pbmNsdWRpbmctZXRoZXJldW0tYW5kLXNvbGFuYS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bankrupt FTX moves $156M worth of assets including Ethereum and Solana - CryptoSlate",
        "content": "Blockchain analytics firm Nansen reported that wallets connected to bankrupt FTX have moved up to $156 million worth of digital assets, including Ethereum (ETH) and Solana (SOL), in several transactions over the past week.\n\nUnstakes Solana\n\nIn an Oct. 31 post on X (formerly Twitter), Nansen reported that FTX began unstaking 1.6 mill SOL tokens, worth approximately $57.6 million, on Oct. 30.\n\nWhile the unstaked assets are currently held in the staking wallet, FTX’s fund movement will increase the total SOL transferred to nearly $90 million.\n\nEarlier in the month, FTX liquidators staked approximately $120 million in Solana tokens through Figment, an institutional staking service provider. This move is anticipated to yield up to 7% return in staking rewards and is expected to help the bankrupt firm maximize its assets.\n\n$156M transferred\n\nNansen, while adding FTX’s recently unstaked Solana assets to the stream of transactions from the insolvent company to crypto exchanges like Binance and Coinbase, estimated a movement of approximately $156 million worth of digital assets.\n\nAccording to Nansen’s analysis, the new wave of transactions included 1,100 ETH valued at $2 million, 10.5 million USDC, and 7.6 million Render tokens worth $500,000.\n\nFTX also transferred 833,000 Kyber Network Crystal (KNC) tokens, equivalent to $616,000, and 108 million TRUE tokens worth $420,000. Further assets included 138,000 Band Protocol tokens valued at $221,000, 2.5 million The Graph tokens equivalent to $273,000, 845 Maker tokens valued at $1.17 million, and 9.5 million REN tokens worth $500,000.\n\nAdditionally, there were 695,000 Perpetual Protocol Tokens valued at $423,000, 767,000 Biconomy Tokens worth $182,000, and 23,000 Polygon tokens worth $15,000.\n\nFTX claims value rise\n\nPrices for FTX claims increased following reports of a $2 billion investment by Google in the artificial intelligence startup Anthropic.\n\nIkigai hedge fund manager Travis Kling posited that the investment had driven “FTX bankruptcy pretty close to a full recovery.”\n\nIn an interview with CryptoSlate, Thomas Braziel, an expert on FTX claims at 117 Partners, urged creditors to remain cautious. This was reiterated in a post on X (formerly Twitter), where he highlighted that there was no valuation mentioned in the Google-Anthropic investment, adding that:\n\n“Great to see this news tonight but the bankruptcy still have a big road ahead of it.”\n\nData from Cherokee Acquisition shows that the claim’s value has risen to between 50 and 53 cents on the dollar as of press time.\n\nMentioned in this article"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NvbGFuYS1sYWJzLWdhbWVzaGlmdC1kZWxpdmVycy10aGUtbmV4dC1nZW5lcmF0aW9uLW9mLWdhbWUtZGV2ZWxvcG1lbnQtd2l0aC1iZXRhLWxhdW5jaC0zMDE5NzI3MDQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Solana Labs' Gameshift Delivers the Next Generation of Game Development with Beta Launch - PR Newswire",
        "content": "Powered by industry partners like Crossmint, Coinflow, and Metakeep, GameShift offers seamless Web3 integration under the hood\n\nSAN FRANCISCO, Oct. 31, 2023 /PRNewswire/ -- Solana Labs, which builds products and tools on the Solana blockchain, today announced the beta launch of GameShift , the simplest and fastest way to enable a Web3 experience in games on Solana. GameShift, initially announced as a Solana Labs initiative in July 2023 , is now available for developers to begin building a Web3-powered gaming experience with a single, easy-to-use API built on Solana, without the need for blockchain coding or knowledge.\n\nHistorically, game development on-chain has been riddled with obstacles and pain points, including the tremendous knowledge requirements needed to successfully build applications on-chain. These hurdles require developers to expend time, energy, and money into the backend game development, often at the cost of game quality. Solana Labs' GameShift eliminates the need for extensive blockchain knowledge through a unified Web2-friendly API. This familiar architecture allows developers to focus on what matters most: game creation.\n\n\"Integrating GameShift's API to handle blockchain complexity under the hood allows developers to dedicate more resources directly to game development,\" said Davis Hart, Product Lead for GameShift. \"Even more importantly, developers can provide a Web2-friendly experience to gamers, easing the common Web3 frictions that can deter user acquisition and engagement.\"\n\nGameShift lessens the complexity of working with blockchains, including content storage, gas fees, and smart contract implementation. With GameShift, in-game assets can be listed, purchased and traded in a seamless, branded in-game marketplace, without ever holding crypto. Transactions can be made in USD through credit card payments. GameShift is powered by Solana Labs with support from ecosystem partners including Crossmint, Coinflow, and Metakeep.\n\nGameShift represents yet another innovation on the Solana network that emphasizes developer and user experiences by leveraging the network's unique advantages to pursue mass adoption. Solana offers ultra-fast speeds and true scalability, as well as ultra-low cost for game asset minting, transfer, and trading, making the network the premier choice for the next generation of gaming.\n\nGameShift's beta launch was announced during the Solana Foundation's premier annual event, Breakpoint, which celebrates the achievements and innovations of the entire Solana community. Breakpoint 2023, hosted in Amsterdam, features key notes, panels, demos, and more from industry and Solana community leaders.\n\nFor more information on GameShift, visit Gameshift.SolanaLabs.com .\n\nAbout Solana Labs\n\nSolana Labs is a technology company, a developer of web3 projects, a creator of open-source software, and the author and publisher of a Solana validator client. Solana Labs is based in San Francisco. For more information, please visit https://solanalabs.com.\n\nMedia Contact\n\npress@solana.com\n\nSOURCE Solana Labs"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3Mvc29sYW5hL3NvbGFuYS1zb2wtYnJlYWtzLW11bHRpLW1vbnRoLXRyZW5kLWZpcmVkYW5jZXItdGVzdG5ldC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Solana (SOL) Breaks Multi-Month Trend As Firedancer Hits Testnet - NewsBTC",
        "content": "The Solana price is currently experiencing a breathtaking rally. Since marking a bottom below $8 on December 29, the SOL price has risen more than 395%. And news from the Solana Breakpoint conference, which is currently being held in Amsterdam from October 30 to November 3, 2023, further fueled the price yesterday. In the last 24 hours, the price has risen 7.5%, and a whopping 23% in the last seven days.\n\nFiredancer Launched On Solana Testnet\n\nCentral to the current excitement is the launch of Firedancer on Solana’s testnet. This new validator client, designed for the Solana blockchain, promises to significantly improve the scalability of the network, diminish latency times, and overall enhance network performance.\n\nThe brain behind Firedancer Solana is Jump Crypto, a division of the Jump Trading Group, dedicated to pioneering solutions in the blockchain space. Their vision for Firedancer is comprehensive. It is designed to refine the Solana network across all tiers, starting from its foundational consensus mechanism to its broadest performance metrics. Ultimately, Firedancer aims to scale Solana to one million transactions per second (TPS).\n\nRelated Reading\n\nSolana Flying, Bulls Reverse Post-FTX Collapse Losses But SOL Analysts Cautious 6 months ago\n\nHighlighting the criticality of Firedancer to the future roadmap of Solana, Dan Albert, Executive Director of the Solana Foundation, proclaimed during his live stage appearance at the conference, “These guys have been hustling hard. Really did a lot of work, working around the clock in the last couple of weeks and I am really excited to announce that right now the first version of Firedancer is live on testnet.”\n\nValidating this enthusiasm, Raoul Pal, CEO and co-founder of Real Vision Group and former Goldman Sachs executive, expressed his bullish outlook, stating:\n\nFiredancer is a VERY big deal, not just for Solana but for blockchain technology overall. It is a quantum leap in speed (10x faster than the fastest blockchain today) whilst increasing security and robustness of the Solana Virtual Machine [SVM]. We’re eagerly awaiting its migration to Mainnet in the summer of 2024.\n\nPal further encapsulated the potential of Solana and Firedancer in a recent conversation with Scott Melker. He opined, “I’ve been observing the charts, particularly Solana versus ETH (SOL/ETH) and Solana versus Bitcoin (SOL/BTC), and it unmistakably resembles a rocket ship in its ascent. It’s truly astonishing.”\n\nRelated Reading\n\nSOL Price Breaks Multi-Month Trend\n\nHowever, in the midst of this euphoria, some analysts urge caution. With SOL’s price surging to touch a 1-year high of $39.88 yesterday, analyst Pentoshi offered a sobering perspective, noting, “SOL takes out these equal highs at the top of the range and in the next couple weeks likely a chance to refuel at the mid-range at $32.xx.”\n\nIn addition, the 1-day chart shows that SOL broke out of an ascending trend channel (black) in a very bullish manner. SOL rose yesterday above the late October high of $38.78, which the price marked just before it plummeted in the wake of FTX’s collapse, losing more than 68% in four days.\n\nThe next few days will be all about closing above $38.78 for the SOL bulls. If this succeeds, the Fibonacci extension level of 1.618 at $57.85 could be the next major target. Otherwise, a correction toward the 0.786 Fibonacci retracement level at $32.18 could be in the cards.\n\nFeatured image from Shutterstock, chart from TradingView.com"
    }
]