[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA5LzIxL2JpdGNvaW4tc2xpZGVzLXRvLTI2NWstYW1pZC1zdXJnaW5nLXVzLWRvbGxhci1yZWNvcmQtaGlnaC1yYXRlcy1hcmUtbmlnaHRtYXJlLWZvci1jcnlwdG8tZmlybXMv0gGPAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDkvMjEvYml0Y29pbi1zbGlkZXMtdG8tMjY1ay1hbWlkLXN1cmdpbmctdXMtZG9sbGFyLXJlY29yZC1oaWdoLXJhdGVzLWFyZS1uaWdodG1hcmUtZm9yLWNyeXB0by1maXJtcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Slides to $26.5K Amid Surging U.S. Dollar; Record-High Rates Are ‘Nightmare’ for Crypto Firms - CoinDesk",
        "content": "“U.S. equity and rates markets have broken some very key levels on the back of this, and reflexivity can take over with the bearish thesis from here,” the QCP wrote in a Telegram market update. “This macro move could seep into crypto markets and take BTC lower with it, albeit with a lower beta as compared to other very stretched macro markets like the Nasdaq.”"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5kZWxtYXJ0aW1lcy5uZXQvbmV3cy9zdG9yeS8yMDIzLTA5LTIxL2JvcmRlci1wYXRyb2wtaW52ZXN0aWdhdGluZy1hYmFuZG9uZGVkLXZlc3NlbC1pbi1zb2xhbmEtYmVhY2gtdXNlZC1pbi1zdXNwZWN0ZWQtaHVtYW4tc211Z2dsaW5nLWF0dGVtcHTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Border Patrol investigating abandoned vessel in Solana Beach used in 'suspected human smuggling attempt' - Del Mar Times",
        "content": "Local lifeguards responded to an abandoned vessel that they say had been used for migrant smuggling early Wednesday morning.\n\nA suspected migrant-smuggling vessel was discovered in Solana Beach early Wednesday morning, Sept. 20, with no one on board, according to officials and photos shared with the Solana Beach Sun.\n\n“No arrests have been made in connection with this suspected human smuggling attempt,” said Michael J. Scappechio, a U.S. Customs and Border Patrol spokesperson. “An investigation into the incident is ongoing.”\n\nPhotos shared with the Solana Beach Sun by Teresa Lorscheider Vale, a local resident who was taking pictures of surfers that morning, show lifeguards towing the vessel from the beach near the Del Mar Shores stairway, located off Del Mar Shores Terrace.\n\nLifeguards notified Border Patrol and the U.S. Coast Guard after discovering the vessel at 6:43 a.m., Solana Beach Marine Safety Capt. Jason Shook said in an interview. There had been six passengers and an operator aboard the vessel, based on the number of life vests that were inside, Shook added.\n\nThere was no search and rescue conducted by local lifeguards, but Border Patrol’s Air and Marine Operations responded and found 11 fuel containers inside the vessel, in addition to the seven life vests. They also seized the vessel."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYWxleGFibG9ja2NoYWluLmNvbS9xdWl2ci1kaWdpdGFsLWlkZW50aXR5LWJhZGdlcy1uZnRzL9IBRWh0dHBzOi8vYWxleGFibG9ja2NoYWluLmNvbS9xdWl2ci1kaWdpdGFsLWlkZW50aXR5LWJhZGdlcy1uZnRzLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Quivr Launches Digital Identity Badges as NFTs on Solana - AlexaBlockchain",
        "content": "Quivr, an innovative blockchain and AI-enabled data verification app, has revealed its foray into the world of Non-Fungible Tokens (NFTs). Partnering with Solana, a leading blockchain platform known for its compression NFT technology, Quivr is embarking on a new era of authenticity, personal expression, and cost efficiency.\n\nThe intersection of blockchain and AI technology forms the core of Quivr’s approach, making data verification and authentication accessible and reliable. The introduction of NFTs on Solana’s blockchain is a strategic step that aligns with Quivr’s mission to offer a cost-effective, swift, and dependable blockchain solution for users, without compromising on the exclusive benefits and rewards they provide.\n\nA Digital Showcase of Passions and Skills\n\nLed by CEO & Co-Founder, Ray Lee, Quivr allows users to showcase and own their passions, credentials, skills and more, via unique digital trading cards known as “badges” which will now come in the form of NFTs.\n\nFrom a Dog Lover badge to a Country Music Fan badge, Quivr offers an array of proprietary NFTs that reflect individual interests and identities.\n\nThe upcoming minting of these badges in October will mark a significant moment for Quivr users. Each NFT will serve as a “proof of passion,” empowering users to enhance their digital identities in a creative and personalized manner.\n\nThe Power of Solana’s Compression NFT Technology\n\nBy partnering with Solana, Quivr has harnessed the power of compression NFT technology, a hallmark feature of the Solana blockchain. This decision allows Quivr to scale its offerings on a reliable and cost-effective blockchain, demonstrating a commitment to keeping expenses manageable for its user base.\n\nThe cost analysis of minting 100,000 Solana NFTs using Solana’s Compression technology speaks volumes about the economic advantage. At approximately $103 for this massive minting endeavor, the financial contrast with Ethereum and Polygon is stark. Minting the same quantity on Ethereum would amount to a staggering $700,000, and on Polygon, it would cost around $1,800.\n\nQuivr’s move to embrace Solana’s compression NFT technology underscores a dedication to providing a seamless and affordable experience for users, ultimately democratizing access to NFTs and enhancing digital identities.\n\nThe announcement today represents a significant stride forward in the realms of blockchain technology and digital identity expression.\n\nThe future of digital identity and personal expression has found a new home in the blockchain, with Quivr at the forefront of this transformative journey.\n\nRead Also: NFTFN Unveils New Brand Identity, Ushers in a New Era for NFT Finance"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3R1Y3Nvbi5jb20vbGlmZS1lbnRlcnRhaW5tZW50L3NvbGFuYS10aGUtbmV3LWZyb250aWVyLW9mLWFub255bW91cy10cmFuc2FjdGlvbnMvYXJ0aWNsZV9mM2RkOWM2ZC0zMzkzLTVlZDUtOTNhMS1hN2M3MzJkYjlkZWUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Solana: The new frontier of anonymous transactions - Arizona Daily Star",
        "content": "This article is diving into the world of Solana, a hotshot blockchain that's been making waves in the crypto space. Besides being super fast and scalable, Solana has got something up its sleeve that's got everyone talking: anonymous transactions! Yep, you heard that right. So, let's strap in and explore how Solana is rocking the anonymity game.\n\nWhat's the Buzz About Solana?\n\nOkay, first things first, let's get to know this crypto and the Solana price appeal a little better. It's a blockchain platform that promises lightning-fast transactions and low fees. But what really sets it apart is its unique consensus mechanism, Proof-of-History (PoH), combined with the more familiar Proof-of-Stake (PoS) approach. This baby can process up to 65,000 transactions per second! Say goodbye to those pesky congestion issues.\n\nPrivacy on the Blockchain?\n\nYou might be thinking, \"Hey, I thought all crypto transactions were transparent, like an open book!\" Well, you're not wrong. Most blockchain networks, like Bitcoin and Ethereum, are pseudo-anonymous. That means all the transactions are recorded on the blockchain for everyone to see. You might not know who's behind each address, but you can trace the flow of funds.\n\nBut hold on to your hats, because Solana's here to throw a curveball! It offers optional privacy features that allow users to transact incognito. Yep, you heard me right: anonymous transactions on a public blockchain.\n\nHow Does Solana's Anonymity Work?\n\nLet's dive into the nitty-gritty of how Solana pulls off this magic trick. To enable anonymity, Solana has incorporated a technology called \"Sealed Messages.\" These messages are like those secret notes you used to pass in class, but way cooler and way more secure.\n\nWhen you initiate a sealed message transaction, all the juicy details, like sender, receiver, and the transaction amount, are securely encrypted. It's like wrapping your transaction in a secret code! This encrypted info is only visible to the sender, receiver, and anyone they choose to share the secret with. No prying eyes, no nosy hackers!\n\nThe Key to Unlocking Secrets: SPL Tokens\n\nNow, you might be wondering, \"How do I send these hush-hush sealed messages, and what can I use them for?\" Well, the answer lies in SPL tokens. SPL stands for \"Solana Program Library,\" which includes a set of pre-built smart contract templates. One of these templates is for enabling privacy features and sealed messages.\n\nTo send an anonymous transaction, you need to create a new SPL token with the privacy feature enabled. It's like getting your secret decoder ring! Once you've got that shiny new token, you can now send transactions in complete privacy, away from the prying eyes of blockchain voyeurs.\n\nAnonymity and the Battle Against Misuse\n\nNow, before you start dreaming about becoming the ultimate secret agent of the crypto world, there's a catch. Solana's anonymous transactions come with a certain responsibility. While they offer users enhanced privacy, they can also be misused for illicit activities.\n\nTo ensure that the system remains secure and doesn't become a haven for bad actors, Solana implements a few safeguards. Firstly, transactions made with sealed messages can only be executed within the SPL token's ecosystem. So, no sneaking around with other non-SPL tokens.\n\nAdditionally, just like any good superhero needs a sidekick, every sealed message transaction must include a matching unsealed instruction. This unsealed instruction is like the flip side of the coin, revealing some basic info about the transaction to everyone on the blockchain. It's like leaving a trail of breadcrumbs, but only a few.\n\nPrivacy in the Wild West of Crypto Trading\n\nSolana is undoubtedly a trailblazer in the crypto world, offering an incredible combination of speed, scalability, and now, optional anonymity. The ability to transact incognito opens up a whole new world of possibilities, from enhanced financial privacy to facilitating secure business transactions.\n\nBut remember, with great power comes great responsibility. Anonymity is a double-edged sword, and it's essential to use it wisely and ethically. Solana's privacy features empower users, but they also call for a heightened sense of accountability to keep the system safe for everyone. So, if you're eager to explore the world of crypto, saddle up your digital horse and give Solana a try.\n\nLee Enterprises newsroom and editorial were not involved in the creation of this content."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vd3d3LmJhbmtsZXNzLmNvbS9zb2xhbmEtcGFzdC1wcmVzZW50LWFuZC1mdXR1cmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Sep 2023 07:00:00 GMT",
        "title": "Solana's Past, Present and Future - Bankless",
        "content": "Where is Solana now... and where is it headed?\n\nDear Bankless Nation,\n\nSolana is in an interesting spot. The community has taken a beating this bear, but they've kept the fight going. What does the future hold?\n\nToday, in his first post on Bankless, our new research head James Trautman digs into the question: Where is Solana now... and where is it headed?\n\n\n\n-Bankless team\n\nThe crypto landscape experienced a tumultuous journey in the past 21 months. The onset of a bear market in early 2022 left its mark on almost every project, especially Solana.\n\nThroughout 2022, Solana contended with challenges such as network outages and the downfall of FTX. The market capitalization of SOL plummeted by ~93% during that year, accompanied by a 96% reduction in the network's TVL. As the year drew to a close, the outlook for Solana entering 2023 was far from optimistic, and speculations about an impending death spiral were widespread.\n\nDespite facing numerous challenges in the past, Solana's future appears bright.\n\nThe narrative surrounding network performance and outages has shifted for the better. Solutions like local fee markets have helped improve network uptime while also contributing to the value accrual of Solana's native token SOL. Advancements like state compression and compressed NFTs are ushering in new use cases while catalysts for growth, including grant initiatives and the emergence of Solang, Neon EVM, and AI, are on the horizon.\n\nBelow, let's dig deeper into the health and prospects of Solana.\n\nThe Present\n\nNetwork Status\n\nThrough 2023, the prevailing narrative surrounding \"outages\" has shifted. Apart from a momentary network interruption caused by an abnormal consensus bug in February, Solana has maintained 100% uptime year-to-date, and there has been a consistent upward trajectory in total daily transactions.\n\nThe improved network performance is the result of the remedies introduced to tackle the issue of network spamming that originated from Gulfstream, Solana's alternative to the mempool for managing pending transactions. The network upgrades included QUIC , Stake-Weighted Quality of Service (QOS) , and local fee markets (priority fees).\n\nPriority fees have raised the barrier to entry for spamming the network. The integration of these fees has proven instrumental in eradicating Solana's historical downtime problems, primarily attributable to suboptimal transaction handling.\n\nThrough 2023, approximately 42% of daily fees have been contributed by users who choose to prioritize their transactions. This average is poised to escalate as more wallets and applications incorporate priority fees, mirroring platforms such as Jupiter , Solflare Wallet , and Phantom .\n\nFurthermore, priority fees have only partially played a role in eradicating downtimes. They have also exerted a driving force behind revenue generation, resulting in enhanced value accrual. The revenue directed to the protocol (in SOL) has increased ~42% compared to the previous year.\n\nGiven that Solana burns 50% of all transaction fees, priority fees also serve as an additional positive force for value accrual. Following a sharp decline of 92% throughout 2022, the market capitalization of SOL has demonstrated a resurgence of ~111% year-to-date despite the downward pressure stemming from the SEC's recent allegations characterizing SOL as a security.\n\nEcosystem Highlights\n\nWhat about the state of the Solana DeFi ecosystem following its setback during the FTX collapse in late 2022?\n\nTVL expressed in USD has experienced a resurgence year-to-date, marking growth of 41%. However, when denominated in SOL, TVL has declined by ~26%, indicating that the rise in TVL has predominantly come from asset price appreciation in USD.\n\nNevertheless, it's worth noting that liquid staking derivatives (LSDs) have played a substantial role in bolstering Solana and its DeFi landscape throughout 2023. While they have been omitted from the TVL statistics above to prevent double counting , platforms such as Marinade Finance , Lido , and Jito have all achieved remarkable triple-digit increases in their TVL. As a result, they now secure positions within the top 10 in terms of TVL.\n\nWhile the expansion of DeFi continues to be a central objective for the Solana ecosystem, a discernible transition in user engagement has been observed, with a shift from DeFi towards a broader array of applications. This encompasses domains such as NFTs, gaming, and various consumer-oriented sectors.\n\nThe drivers?\n\nIn April, the Solana Foundation unveiled state compression , an economical approach for onchain data storage. The implementation of state compression was first observed in the NFT space, developed through a collaborative effort involving Metaplex, Solana Labs, and other key ecosystem contributors. Compressed NFTs come at a reduced expense compared to their uncompressed counterparts.\n\nFollowing this development, Dialect , a messaging platform, and Access , an application designed for content creator monetization, adopted state compression for compressed NFTs. These applications quickly garnered user interest, leading to a combined average monthly transaction count in the range of several hundred thousand.\n\nFurthermore, Tensor unveiled its compressed NFT marketplace, furnishing users with the capability to trade, list, and place bids on compressed NFTs. The marketplace has captured a substantial portion of transaction volume, accounting for approximately 40% of market share year-to-date.\n\nIn the aftermath of the FTX upheaval, Twitter became a breeding ground for speculations suggesting that the momentum behind Solana's development was dead and an exodus of core Solana developers was imminent.\n\nHowever, despite experiencing a more marked decline in August, available data indicates that the count of GitHub developer repositories has largely persisted year-over-year, and the preconceived rumors of a mass exodus heading into 2023 were exaggerated.\n\nThe Future\n\nSo, what factors are poised to sustain the positive trajectory of the Solana network and its encompassing ecosystem? Several considerations are on the horizon, including:\n\nNeon EVM : Solana's Neon EVM went live in July. This development enables Ethereum-based applications to operate on Solana without changes to their existing codebase.\n\n: Solana's Neon EVM went live in July. This development enables Ethereum-based applications to operate on Solana without changes to their existing codebase. Solang - In July, Solana Labs unveiled Hyperledger Solang. This new compiler enables developers to build projects on the Solana network using Solidity, thereby bridging the divide between EVM developers and the Solana ecosystem.\n\n- In July, Solana Labs unveiled Hyperledger Solang. This new compiler enables developers to build projects on the Solana network using Solidity, thereby bridging the divide between EVM developers and the Solana ecosystem. Eclipse - Eclipse aims to combine the Ethereum ecosystem and Solana's execution environment.\n\nWith the above as potential gateways, there could be room for growth in Solana development and user activity through network effects.\n\nMove : Although still in its preliminary stages, the introduction of Move as a smart contract language on Solana has the potential to stimulate additional developer engagement within the Solana ecosystem.\n\nThe Solana ecosystem is also set to receive capital injections from recently launched growth initiatives, including:\n\nConvertible Grants : The Solana Foundation recently introduced convertible grants to bolster projects within the Solana ecosystem. This mechanism transforms into investments should projects meet specific milestones and growth targets.\n\n: The Solana Foundation recently introduced convertible grants to bolster projects within the Solana ecosystem. This mechanism transforms into investments should projects meet specific milestones and growth targets. AI : The Solana Foundation recently launched a $10 million AI grant fund, and the expansion of the ecosystem into the realm of AI may be on the horizon.\n\nFinally, details have recently emerged regarding the assets held on FTX's balance sheet:\n\nFTX - Recent court rulings concerning FTX token sales will safeguard against a flood of market sales of SOL since liquidations will be subject to volume limits.\n\nConclusion\n\nThe network's consistent 100% uptime, bolstered by priority fees that fuel value accrual, combined with an evolving ecosystem marked by technical breakthroughs like state compression, relegates the network's past performance issues and the FTX crisis to the background. Upcoming catalysts, including grant initiatives, Solang, Neon EVM, and the emergence of AI, hold promise on the horizon.\n\nAction steps"
    }
]