[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9uZXdzL3N0b3J5LzIwMjMtMDYtMTUvc29sYW5hLWJlYWNoLXRlZW4tcGlja2VkLWFzLXNhbi1kaWVnby1jb3VudHkteW91dGgtb2YtdGhlLXllYXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Solana Beach teen picked as San Diego County Youth of the Year - Del Mar Times",
        "content": "Solana Beach teen Kyra Dominguez was picked as San Diego County Youth of the Year from nine finalists who stood out from all the teens attending the Boys & Girls Clubs in the San Diego area.\n\nKyra, 17, a junior at Torrey Pines High School, was recognized for her leadership, kindness, academic and athletic accomplishments and service to the community.\n\nThe Boys & Girls Clubs of San Dieguito nominates one exemplary teen member annually from each of its programs, including After School, Athletics, Aquatics, Youth Arts Academy and Bulldogs Basketball. Kyra was outstanding in the After School Program.\n\nAfter winning the title of 2022 Youth of the Year at the San Dieguito Boys & Girls Clubs for her exemplary character, leadership and community service, Kyra was nominated by a panel of judges to represent San Diego County at the statewide Boys & Girls Club competition in Sacramento in March.\n\n“Kyra is a very kind, sweet, self-driven, goal oriented, young individual. When I first got to know Kyra, I was amazed how mature and focused she was on all aspects of life. Kyra will always finish and reach any goal she sets her mind to. Kyra is a natural leader by example,” said Bosque Leanio, manager of the Boys & Girls Clubs of San Dieguito’s Harper Teen Center, in his nomination letter.\n\n“My staff and I always know we can count on Kyra to be there for her peers, for our organization and for her community wherever and whenever needed,” Leanio said.\n\nAcademically, Kyra is a high achiever and plans to attend college to study to be a clinical psychologist. She credits her parents for encouraging her to get a good education.\n\n“My parents have instilled in me that the most important thing is my education. I am working hard every day to repay them for everything they have given me. I know the only way to accomplish this goal is through education,” Kyra wrote in her nomination essay.\n\nAlong with pursuing her studies, Kyra competes on the Torrey Pines women’s rugby team and loves to draw.\n\n“Ever since I can remember, I have always been drawing things I admired or blatantly for fun. That was my initial passion, to make art that could make people smile or bring a sense of comfort to them,” Kyra said.\n\nKyra will pass the torch to the seven 2023 nominees for Youth of the Year at the Boys & Girls Clubs of San Dieguito’s Youth of the Year Celebration in July. The event, held during the Greatest Show on Turf at the Del Mar Racetrack, includes entertainment, dinner, music and dancing along with auctions. Registration for the event is at bgcsandieguito.org."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9uZXdzL3N0b3J5LzIwMjMtMDYtMTUvYWxleC1tb3JnYW4tdGFsa3Mtd29ybGQtY3VwLWhlci1uZXctYnVzaW5lc3MtdmVudHVyZS1hbmQtdGhlLXdhdmVzLWNoYW5jZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Alex Morgan talks World Cup, her new business venture and the future of women's soccer - Del Mar Times",
        "content": "When word got out he was opening a soccer store in Solana Beach, Brian Enge heard from a local soccer enthusiast who said she’d liked to invest in the business.\n\nHer name? Alex Morgan.\n\nKind of like Taylor Swift calling up a local garage band and asking if they needed a singer.\n\nTalk about an easy decision for Enge, who on Wednesday afternoon saw the Alex Morgan effect up close when some 25 lottery-winning girls from five local soccer clubs lined up outside the Soccer Post store, eager to meet the Wave and U.S. national team star whose Instagram account numbers 10 million followers. In tow were a few local TV camera folks and newspaper reporters from San Diego and Los Angeles.\n\nIt didn’t hurt Enge that his daughter Sierra is a rookie midfielder on the Wave, or that Morgan had a prior affiliation with the soccer-store chain.\n\nBut Morgan long ago was keen on inspiring girls, saying she aspires to build upon the opportunities her parents and many others created for her as she grew up in Diamond Bar east of Los Angeles.\n\n“I just loving seeing the next generation come here today and just feel a little more inspired,” said Morgan, whose San Diego foundation will get some of the store’s proceeds during the upcoming World Cup.\n\nThe 33-year-old striker’s nurturing skills extend as well to the youthful Wave, who are atop the National Women’s Soccer League at the season’s midway point and will face rival Angel City on Saturday at Snapdragon Stadium. And more so than ever, she’ll want to fast-track U.S. teammates this summer — both before and during the World Cup that opens July 20 in Australia and New Zealand.\n\nIf the Americans are to win a third consecutive World Cup, they’ll probably need several first-time Cup participants to perform well and that will entail learning from Morgan. As you’d expect, the veteran spoke highly of the young playmakers, having teamed up with many of them in U.S. exhibitions dating to July.\n\n“You look at Sophia Smith, Naomi Girma, Trinity Rodman, Ashley Sanchez — that’s just to name a few,” Morgan said of four NWSL players who are, in order, 22 years old, 23, 21 and 24. “These players have come in and dominated both at the club and the international level. That is an important piece to us performing well at the World Cup and us having a complete picture.”\n\nElaborating as she often does when discussing women’s soccer, Morgan hit on bigger realities and trends that ultimately shape the outcomes on the soccer field.\n\n“We’ve always been trended as an older team because of the more opportunities in the U.S. to keep playing soccer in comparison to other countries,” she said of the U.S. program. “Other countries have leagues where women are able to compete past 25, 26, 27. They’re making a good living. We need to make sure that we’re looking at everything we can do to be the best. And these young players are going to play a huge part in that.”\n\nAlex Morgan smiles during Wednesday’s announcement. (Soccer Post)\n\nSo when asked why she believes that the competition in this summer’s Cup, her third, will prove tougher than what she has experienced with the U.S. club, Morgan spoke of the economic growth of the women’s game in other countries. She hit on the underlying forces. Economics. Opportunities for girls and women.\n\nMorgan praised the growth of leagues in Europe and also Mexico, though Mexico won’t be one of the 32 countries participating this summer. She noted that in March, England’s top women’s league signed a broadcast rights deal with the BBC and Sky Sports. According to the Guardian newspaper, the payoff of about $10 million per year made it the biggest broadcasting deal for any women’s soccer league.\n\n“There’s a lot of different things I can point to, to say why this is the most competitive World Cup ever,” Morgan said. “Fact of the matter is, female soccer players are being valued, embraced, appreciated in the way that we’ve always fought for. So, I think it’s just going to be a great showing.”\n\nMorgan isn’t the only soccer star with a long reach in the United States. According to Soccer Post’s Blake Sonnek-Schmelz, the 40-store chain sold some 1,000 Lionel Messi jerseys on the recent day the Argentine star signed with Inter Miami of Major League Soccer. Price of the jersey: $90.\n\nIn San Diego, where the soccer ball keeps bouncing higher and higher, Messi could be an opponent come 2025, when an MLS expansion club is to open its first season in the same Mission Valley Stadium where the Wave play."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzI4NTA3L3NvbGFuYS1wcmVkaWN0aW9uLWp1bmUtMTUtMjAyMy_SAUZodHRwOi8vYW1wLmNvaW5jb2RleC5jb20vYXJ0aWNsZS8yODUwNy9zb2xhbmEtcHJlZGljdGlvbi1qdW5lLTE1LTIwMjMv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Solana Price Prediction – SOL Price Estimated to Drop to $ 13.12 By Jun 20, 2023 - CoinCodex",
        "content": "Disclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision.\n\nSolana is down -3.90% today against the US Dollar\n\nSolana is currently trading 10.27% above our prediction on Jun 20, 2023\n\nSolana dropped -32.65% in the last month and is down -49.11% since 1 year ago\n\nSolana price $ 14.47 Solana prediction $ 13.12 (-9.31%) Sentiment Bearish Fear & Greed index 41 (Fear) Key support levels $ 14.30, $ 13.84, $ 13.18 Key resistance levels $ 15.43, $ 16.09, $ 16.55\n\nSOL price is expected to drop by -9.31% in the next 5 days according to our Solana price prediction\n\nis trading at $ 14.47 after losing -3.90% in the last 24 hours. The coin underperformed the cryptocurrency market, as the total crypto market cap decreased by -4.89% in the same time period. SOL performed poorly against BTC today and recorded a -0.64% loss against the world’s largest cryptocurrency.\n\nAccording to our Solana price prediction, SOL is expected to reach a price of $ 13.12 by Jun 20, 2023. This would represent a -9.31% price decrease for SOL in the next 5 days.\n\nSOL Price Prediction Chart\n\nBuy/Sell Solana\n\nWhat has been going on with Solana in the last 30 days\n\nSolana has been displaying a negative trend recently, as the coin lost -32.65% in the last 30-days. The medium-term trend for Solana has been bearish, with SOL dropping by -27.07% in the last 3 months. The long-term picture for Solana has been negative, as SOL is currently displaying a -49.11% 1-year price change. On this day last year, SOL was trading at $ 28.43.\n\nSolana reached its all-time high price on Nov 06, 2021, when the price of SOL peaked at $ 259.52. The current SOL cycle high is $ 27.16, while the cycle low is at $ 8.12. SOL has been displaying high volatility recently – the 1-month volatility of the coin is at 10.37. Solana recorded 18 green days in the last 30 days.\n\nSolana technical analysis for today - Jun 15, 2023\n\nThe sentiment in the Solana markets is currently Bearish, and the Fear & Greed index is reading Fear. The most important support levels to watch are $ 14.30, $ 13.84 and $ 13.18, while $ 15.43, $ 16.09 and $ 16.55 are the key resistance levels.\n\nBearish sentiment for Solana\n\n6 indicators are currently signaling a bullish prediction for Solana, while 25 indicators are showing a bearish forecast. With 81% of indicators favoring a negative prediction. This results in an overall Bearish sentiment for Solana.\n\nCrypto market is currently experiencing Fear\n\nCurrently, the Fear & Greed index is at 41 (Fear), which signals that investors have a negative outlook on the market. The Fear & Greed index is a measure of sentiment among cryptocurrency investors. A “Greed” reading suggests that investors are currently optimistic about the cryptocurrency market, but can also be an indication that the market is overvalued. A “Fear” reading, on the other hand, signals that investors are currently hesitant about the cryptocurrency market, which potentially represents a buying opportunity.\n\nSolana moving averages & oscillators\n\nLet’s take a look at what some of the most important technical indicators are signaling. We’ll be going through key moving averages and oscillators that will allow us to get a better idea of how Solana is positioned in the market right now.\n\nPeriod Daily Simple Daily Exponential Weekly Simple Weekly Exponential MA3 $ 15.14 (SELL) $ 14.77 (SELL) - - MA5 $ 15.38 (SELL) $ 15.18 (SELL) - - MA10 $ 17.37 (SELL) $ 16.53 (SELL) - - MA21 $ 19.35 (SELL) $ 18.33 (SELL) $ 21.69 (SELL) $ 20.82 (SELL) MA50 $ 20.65 (SELL) $ 19.96 (SELL) $ 24.79 (SELL) $ 30.39 (SELL) MA100 $ 21.10 (SELL) $ 20.76 (SELL) $ 70.42 (SELL) $ 43.22 (SELL) MA200 $ 19.76 (SELL) $ 23.36 (SELL) - -\n\nPeriod Value Action RSI (14) 41.85 BUY Stoch RSI (14) 0.00 BUY Stochastic Fast (14) 17.33 BUY Commodity Channel Index (20) -66.67 NEUTRAL Average Directional Index (14) 28.96 BUY Awesome Oscillator (5, 34) -3.84 NEUTRAL Momentum (10) -6.61 NEUTRAL MACD (12, 26) -0.61 NEUTRAL Williams Percent Range (14) -82.67 BUY Ultimate Oscillator (7, 14, 28) 43.81 NEUTRAL VWMA (10) 17.38 SELL Hull Moving Average (9) 14.46 BUY Ichimoku Cloud B/L (9, 26, 52, 26) 18.17 NEUTRAL\n\nThe Relative Strength Index (RSI 14) is a widely used indicator that helps inform investors whether an asset is currently overbought or oversold. The RSI 14 for Solana is at 41.85, suggesting that SOL is currently neutral.\n\nThe 50-day Simple Moving Average (SMA 50) takes into account the closing price of Solana over the last 50 days. Currently, Solana is trading above the SMA 50 trendline, which is a bullish signal.\n\nMeanwhile, the 200-day Simple Moving Average (SMA 200) is a long-term trendline that’s calculated by taking an average of the SOL closing price for the last 200 days. SOL is now trading above the SMA 200, signaling that the market is currently bullish.\n\nThe bottom line about this Solana prediction\n\nAfter considering the above factors, we can conclude that the current forecast for Solana price prediction is Bearish. SOL would have to decrease by -9.31% to hit our $ 13.12 target within the next five days. Moving forward, it will be important to monitor the SOL market sentiment, the key support and resistance levels, and other metrics. However, we have to keep in mind that the cryptocurrency markets are unpredictable, and even the largest crypto assets display a lot of price volatility. For long-term Solana price predictions click here.\n\nDisclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzI4NTA3L3NvbGFuYS1wcmVkaWN0aW9uLWp1bmUtMTUtMjAyMy_SAUZodHRwOi8vYW1wLmNvaW5jb2RleC5jb20vYXJ0aWNsZS8yODUwNy9zb2xhbmEtcHJlZGljdGlvbi1qdW5lLTE1LTIwMjMv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Solana Price Prediction – SOL Price Estimated to Drop to $ 13.12 By Jun 20, 2023 - CoinCodex",
        "content": "Disclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision.\n\nSolana is down -3.90% today against the US Dollar\n\nSolana is currently trading 10.27% above our prediction on Jun 20, 2023\n\nSolana dropped -32.65% in the last month and is down -49.11% since 1 year ago\n\nSolana price $ 14.47 Solana prediction $ 13.12 (-9.31%) Sentiment Bearish Fear & Greed index 41 (Fear) Key support levels $ 14.30, $ 13.84, $ 13.18 Key resistance levels $ 15.43, $ 16.09, $ 16.55\n\nSOL price is expected to drop by -9.31% in the next 5 days according to our Solana price prediction\n\nis trading at $ 14.47 after losing -3.90% in the last 24 hours. The coin underperformed the cryptocurrency market, as the total crypto market cap decreased by -4.89% in the same time period. SOL performed poorly against BTC today and recorded a -0.64% loss against the world’s largest cryptocurrency.\n\nAccording to our Solana price prediction, SOL is expected to reach a price of $ 13.12 by Jun 20, 2023. This would represent a -9.31% price decrease for SOL in the next 5 days.\n\nSOL Price Prediction Chart\n\nBuy/Sell Solana\n\nWhat has been going on with Solana in the last 30 days\n\nSolana has been displaying a negative trend recently, as the coin lost -32.65% in the last 30-days. The medium-term trend for Solana has been bearish, with SOL dropping by -27.07% in the last 3 months. The long-term picture for Solana has been negative, as SOL is currently displaying a -49.11% 1-year price change. On this day last year, SOL was trading at $ 28.43.\n\nSolana reached its all-time high price on Nov 06, 2021, when the price of SOL peaked at $ 259.52. The current SOL cycle high is $ 27.16, while the cycle low is at $ 8.12. SOL has been displaying high volatility recently – the 1-month volatility of the coin is at 10.37. Solana recorded 18 green days in the last 30 days.\n\nSolana technical analysis for today - Jun 15, 2023\n\nThe sentiment in the Solana markets is currently Bearish, and the Fear & Greed index is reading Fear. The most important support levels to watch are $ 14.30, $ 13.84 and $ 13.18, while $ 15.43, $ 16.09 and $ 16.55 are the key resistance levels.\n\nBearish sentiment for Solana\n\n6 indicators are currently signaling a bullish prediction for Solana, while 25 indicators are showing a bearish forecast. With 81% of indicators favoring a negative prediction. This results in an overall Bearish sentiment for Solana.\n\nCrypto market is currently experiencing Fear\n\nCurrently, the Fear & Greed index is at 41 (Fear), which signals that investors have a negative outlook on the market. The Fear & Greed index is a measure of sentiment among cryptocurrency investors. A “Greed” reading suggests that investors are currently optimistic about the cryptocurrency market, but can also be an indication that the market is overvalued. A “Fear” reading, on the other hand, signals that investors are currently hesitant about the cryptocurrency market, which potentially represents a buying opportunity.\n\nSolana moving averages & oscillators\n\nLet’s take a look at what some of the most important technical indicators are signaling. We’ll be going through key moving averages and oscillators that will allow us to get a better idea of how Solana is positioned in the market right now.\n\nPeriod Daily Simple Daily Exponential Weekly Simple Weekly Exponential MA3 $ 15.14 (SELL) $ 14.77 (SELL) - - MA5 $ 15.38 (SELL) $ 15.18 (SELL) - - MA10 $ 17.37 (SELL) $ 16.53 (SELL) - - MA21 $ 19.35 (SELL) $ 18.33 (SELL) $ 21.69 (SELL) $ 20.82 (SELL) MA50 $ 20.65 (SELL) $ 19.96 (SELL) $ 24.79 (SELL) $ 30.39 (SELL) MA100 $ 21.10 (SELL) $ 20.76 (SELL) $ 70.42 (SELL) $ 43.22 (SELL) MA200 $ 19.76 (SELL) $ 23.36 (SELL) - -\n\nPeriod Value Action RSI (14) 41.85 BUY Stoch RSI (14) 0.00 BUY Stochastic Fast (14) 17.33 BUY Commodity Channel Index (20) -66.67 NEUTRAL Average Directional Index (14) 28.96 BUY Awesome Oscillator (5, 34) -3.84 NEUTRAL Momentum (10) -6.61 NEUTRAL MACD (12, 26) -0.61 NEUTRAL Williams Percent Range (14) -82.67 BUY Ultimate Oscillator (7, 14, 28) 43.81 NEUTRAL VWMA (10) 17.38 SELL Hull Moving Average (9) 14.46 BUY Ichimoku Cloud B/L (9, 26, 52, 26) 18.17 NEUTRAL\n\nThe Relative Strength Index (RSI 14) is a widely used indicator that helps inform investors whether an asset is currently overbought or oversold. The RSI 14 for Solana is at 41.85, suggesting that SOL is currently neutral.\n\nThe 50-day Simple Moving Average (SMA 50) takes into account the closing price of Solana over the last 50 days. Currently, Solana is trading above the SMA 50 trendline, which is a bullish signal.\n\nMeanwhile, the 200-day Simple Moving Average (SMA 200) is a long-term trendline that’s calculated by taking an average of the SOL closing price for the last 200 days. SOL is now trading above the SMA 200, signaling that the market is currently bullish.\n\nThe bottom line about this Solana prediction\n\nAfter considering the above factors, we can conclude that the current forecast for Solana price prediction is Bearish. SOL would have to decrease by -9.31% to hit our $ 13.12 target within the next five days. Moving forward, it will be important to monitor the SOL market sentiment, the key support and resistance levels, and other metrics. However, we have to keep in mind that the cryptocurrency markets are unpredictable, and even the largest crypto assets display a lot of price volatility. For long-term Solana price predictions click here.\n\nDisclaimer: This is not investment advice. The information provided is for general purposes only. No information, materials, services and other content provided on this page constitute a solicitation, recommendation, endorsement, or any financial, investment, or other advice. Seek independent professional consultation in the form of legal, financial, and fiscal advice before making any investment decision."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItY3J5cHRvLXhycC1yaXBwbGUtc29sYW5hLWNhcmRhbm8tZmVkL9IBTGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItY3J5cHRvLXhycC1yaXBwbGUtc29sYW5hLWNhcmRhbm8tZmVkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 15 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether, top 10 crypto in red, Fed warning of more rate hikes - Forkast News",
        "content": "Bitcoin fell in Thursday morning trading in Asia, dropping below US$25,000 at one stage for the first time since mid-March. Ether also retreated with other top 10 non-stablecoin cryptocurrencies as trading volumes dipped and the U.S. Fed left interest rates unchanged as expected, but warned of more hikes this year to tackle inflation. Ripple’s XRP token fell despite the release of documents this week that were expected to help the company’s defense in an SEC lawsuit.\n\nCrypto in red\n\nBitcoin fell 2.94% over the last 24 hours to US$25,062.60 at 6:30 a.m. in Hong Kong, losing 4.69% in the last week, according to CoinMarketCap data. The world’s largest cryptocurrency, with a market capitalization of about US$490 billion, dipped below the US$25,000 support line to as low as US$24,902 earlier in the morning.\n\nEther fell 4.74% to US$1,652.25, posting a 9.70% loss for the week. All other top 10 non-stablecoin cryptocurrencies fell, according to CoinMarketCap.\n\nCardano dropped 4.10% to US$0.2624, losing 18.57% of its value in the past seven days. Solana fell 3.18% to US$14.44 and posted a weekly loss of 22.52%.\n\nThe two tokens have been on a downtrend since being named in the SEC’s lawsuit filed last week against the Binance.US and Coinbase exchanges, where the federal agency categorized the two — along with many other altcoins — as financial securities.\n\nBenjamin Stani, the director of business development and sales at crypto trading platform Matrixport, said the declines are mostly the overhang from the SEC suing Binance and Coinbase.\n\n“It’s been predominantly the altcoins that have been dropping,” said Stani. “BTC and, to some extent, ETH as well have been holding up better and that I think is mostly attributable to the fact that the SEC named a lot of [altcoins] as securities and that has this chilling effect.”\n\nThe U.S. Federal Reserve left interest rates unchanged as expected on Wednesday at 5% to 5.25% after ten consecutive hikes to curb inflation.\n\nBut in another negative for investors, Fed chair Jerome Powell said it may take years to get inflation under control, dousing expectations for rate cuts later this year and raising the likelihood of higher interest rates ahead. Stocks ended mixed.\n\nRipple’s XRP token led the losers in the crypto top 10 by market capitalization, falling 7.48% to US$0.4793 on the day for a weekly loss of 7.19%.\n\nThe declines came despite the release of the so-called “Hinman documents,” this week, a collection of previously sealed emails and pages from former U.S. Securities and Exchange Commission director William Hinman. The notes indicate that Ether should not be categorized as a financial security.\n\nRipple Labs Inc. was sued by the SEC in December 2020 on allegations XRP was sold as an illegal unregistered security. Ripple wanted the Hinman documents made public, arguing they show the SEC itself was sending mixed and confused signals over whether cryptocurrencies were securities and failing to offer clear guidance to the industry, which is part of Ripple’s fair notice defense in the case.\n\nHowever, XRP’s price hasn’t benefited from the release of the documents. Gabriel Shapiro, a U.S.-based attorney and the general counsel at blockchain firm Delphi Labs, wrote on Twitter Tuesday — “​​Hinman emails are a nothingburger though great for Ether. No idea why Ripple thinks these emails help Ripple’s case.”\n\nShapiro added that the documents were not the bombshell compared to the “huge hype” given to them.\n\nThe total cryptocurrency market cap lost 2.76% to US$1.02 trillion in the last 24 hours, and the daily crypto trading volume fell 5.37% to US$31.89 billion, according to CoinMarketCap data.\n\nNFT on downtrend\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index lost 0.86% to 2,912.74 in the 24 hours to 7:30 a.m. in Hong Kong. The index is down 10.64% for the week.\n\nTotal NFT transactions rose 0.13% to US$23.7 million, while sales on Ethereum, the leading blockchain by volume, fell 4.78% over the last 24 hours to US$13.52 million, according to CryptoSlam data.\n\nThe Bitcoin network was the second largest NFT network in terms of transactions, rising 6.95% to US$4.1 million in the last 24 hours.\n\nThe recent buzz in the NFT community is around ERC-6551, according to Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News. ERC-6551 is the latest NFT standard for the Ethereum network that went into effect on May 7 this year.\n\n“ERC-6551 is introducing a standard for NFTs by unlocking their ability to be a smart wallet that can interact with different decentralized apps in the Ethereum ecosystem,” Petscher explained. “With ERC-6551, when you transfer an NFT, the wallet and the tokens that the NFT holds also goes with it. Basically wallets within wallets.”\n\nAbout 196 million of Blur tokens worth around US$62 million, 40% of the circulating supply, are being unlocked and distributed to investors and contributors on Wednesday, U.S. time. Blur is the native utility and governance tokens of the Blur NFT marketplace.\n\n“[This] will almost definitely cause a crash in price, which will impact NFT prices,” Petscher said. “Basically, if the token is devalued, will people still want to farm for it via trading NFTs?”\n\nTransactions of Uncategorized Ordinals — unique digital assets on the Bitcoin network that are not identified as part of one established collection — topped sales by collection, selling US$3.14 million in the last 24 hours.\n\nEthereum-based BoringPunks marked second with US$1.63 million in sales, with over 20,000 transactions in the past day.\n\nU.S. equity futures edge down\n\nImage: Envato Elements\n\nU.S. stock futures edged down as of 11:00 a.m. in Hong Kong after a mixed regular trading day on Wednesday. Dow Jones Industrial Average futures fell 0.09%, S&P 500 futures edged 0.06% lower and Nasdaq Futures lost 0.09%.\n\nThe U.S. central bank left interest rates unchanged at 5% to 5.25% after its meeting on Wednesday. The rate is at its highest since 2006 after ten consecutive hikes that started in March 2022 to slow the pace of inflation that surged to 40-year highs at one stage last year.\n\nHowever, post-meeting comments from Powell hinted at two more rate hikes by the end of this year, while stating that rate cuts will not happen unless inflation is under control. That didn’t go down well with some business leaders.\n\n“The battle against inflation is being won. This is now the time for the Fed to stop – not pause – interest rate hikes,” said Nigel Green, founder and chief executive officer of financial management group deVere, in an email statement.\n\n“The time lag for monetary policies is notoriously long — it typically takes about 18 months to two years for the full effect of rate hikes to filter fully into the economy,” Green said, adding that excessive rate hikes could lead to a recession in the U.S.\n\nThe next Federal Open Market Committee meeting is scheduled for July 25 to 26.\n\nThe CME FedWatch Tool predicts a 30.6% chance the Fed will leave rates as is at July’s meeting, while 69.4% says the Fed will raise interest rates by 25 basis points.\n\n(Updates with equities section)"
    }
]