[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8xMS8zNTg1NDc0Ni9yYWxseS1hbGVydC1zb2xhbmEtZG9nLXRva2VuLWJvbmstbGVhZHMtZG9nLWNvaW5zLXN1cmdlLXdpbGwtdGhlLXJhbGx5LXBlYWstZnVydGhlctIBLWh0dHBzOi8vd3d3LmJlbnppbmdhLmNvbS9hbXAvY29udGVudC8zNTg1NDc0Ng?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Rally Alert: Solana Dog Token BONK Leads Dog Coins Surge — Will The Rally Peak Further? - Benzinga",
        "content": "Dog-themed cryptocurrencies, or dog coins, are currently outperforming the broader crypto market. The list includes Dogecoin DOGE/USD, Floki FLOKI/USD, Solana-native dog coin Bonk BONKI/USD and Shiba Inu SHIB/USD.\n\nWhat Happened: A quick snapshot of the dog coins, market caps and the past month's gains (below) also highlighted the past 24-hour trading volumes. Bonki had seen a significant 1,441% rally which was ahead of all the top 25 cryptocurrencies by market cap, which on average have gained 40%, as reported by Blockworks.\n\nA possible reason for BONK to surge could be Solana’s SOL/USD outperformance in the recent bullish run of the crypto market.\n\nLast Christmas, BONK launched when creators airdropped half of its supply to certain Solana users. BONK was on the constant run to find growth by securing the maximum integrations possible across DeFi, gambling apps and wallets.\n\nWhy It Matters: Dogecoin millionaire Glauber Contessoto announced last week that he planned to make conviction plays on 10 additional altcoin projects for the next crypto bull run. With full belief in Dogecoin's potential, he included meme coin projects such as Pepe Coin PEPE/USD.\n\nHarryPotterObamaSonic10Inu, LUKSO LUKSO/USD, KASPA KAS/USD and Avalanche AVAX/USD are also a part of the list.\n\nNotably, Floki announced on its official blog it had a strategic marketing partnership with two legendary Indian cricket teams. This step will lead the token into the mainstream in India and South Asia, thereby touching the global space.\n\nShiba Inu announced a partnership with boxing star and politician Manny Pacquiao wherein the token will be used to optimize fundraising, distribution and other operations.\n\nWhale Movement: On Nov.16, 2023, a Dogecoin whale transferred more than 103 million Dogecoin from the trading platform Robinhood. Also, a significant transfer of 690 million Dogecoin was seen between unknown wallets.\n\nRecent news about sending physical Dogecoin tokens to the moon in December generated significant interest among Dogecoin enthusiasts and investors. It is a project by space payload transporter Astrobotic.\n\nPhotos: Shutterstock, Bonk site"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NvbGFuYS1zYWdhLXBob25lLXZ1bG5lcmFiaWxpdHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Solana denies 'security threat' to Saga phones following CertiK video - Blockworks",
        "content": "CertiK, on Wednesday, claimed that it found a vulnerability with the Solana Saga phone.\n\nSaga is an Android device — the first being offered by Solana.\n\nThe auditor said in a post on X that the phone has a bootloader vulnerability. Essentially, a backdoor can supposedly be installed on the phone allowing the initial software responsible for the starting of the device to be compromised.\n\n“The boot loader is unlocked and software integrity cannot be guaranteed. Any data stored on the device may be available to attackers, Do not store any sensitive data on the device,” a screengrab from CertiK’s accompanying video shows the Solana phone’s screen following the backdoor install.\n\nThe message is an indication that the phone has been hacked, CertiK said. However, it’s not clear if the vulnerability is unique to Saga or if it could impact other Android devices. CertiK did not immediately respond to a request for comment.\n\nLoading Tweet..\n\nIn an email to Blockworks, Steven Laver, lead software engineer of mobile at Solana Labs said that “the CertiK video does not reveal any known vulnerability or security threat to Saga holders. The video shows the user unlocking the bootloader, which is something that can be done on many Android devices.”\n\nAndroid’s own documentation from its Open Source Project outlines the ability to lock and unlock the bootloader.\n\n“Unlocking the bootloader is an advanced feature of Saga, and is disabled by default. We believe in allowing users the choice of how they use their phone, however, unlocking the bootloader is not a security vulnerability – a user must explicitly allow such changes to be made to their device, and those changes can only be made by an authorized user of the phone,” Laver continued.\n\nHowever, if a user or attacker proceeds to unlock the bootloader, then they not only go through multiple warnings, but their device is wiped — along with their private keys.\n\n“So it’s not a process that can take place without users’ active participation or awareness,” Laver said.\n\nCertiK, however, said that only being able to unlock the bootloader with user participation “does not eliminate all potential threats.”\n\n“Malicious actors can purchase Saga phones and install backdoors through such ‘feature,’ and deliver devices to unconscious users. If users did not understand the warnings, they would be tricked and lose funds to attackers,” CertiK said in an email to Blockworks.\n\n“In addition, given the fact that a considerable portion of traditional phone users have taken the initiative to jailbreak or unlock their devices in the past, it is also likely that some Saga phone users will also explore this “feature” but without enough security awareness. That’s why we warn users about such situations in our video.”\n\nThe video then proceeds to show how an attacker could drain bitcoin from the wallet attached to the phone. It did not show Seed Vault being used in the video, which protects both supported digital assets and seeds.\n\nSeed Vault was announced in June 2022, and “accesses the highest privileged security environment available on a device, from secure operating modes of the processor to dedicated Secure Elements, which enables a secure transaction signing experience through UI components built into Android.”\n\nSaga was released in April, having been designed to pair Web3 with smartphones. Alongside traditional app stores, Solana offers a separate app store.\n\nThe phone is designed to allow users to have “self-custody of their assets” to make them “feel comfortable bringing those assets with them on the go,” Laver told Blockworks when the phone was released.\n\nMonths after the launch, the price of Saga was reduced to $599 from $1,000 — a 40% cut.\n\nAt the time, Emmett Hollyer, head of business operations for Solana Mobile, told Blockworks that the price reduction is “common practice in the consumer electronics business, particularly with smartphones.”\n\nAccording to CoinMarketCap, the vulnerability has not impacted SOL — Solana’s native crypto — at the time of publishing. In fact, it’s up more than 13% over the past day.\n\nUpdated Friday, Nov. 17 at 12:15 pm ET: Added comment from CertiK.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL3N0b2Nrcy9wdWxsYmFjay1wcmVkaWN0ZWQtZm9yLXNvbGFuYS1zb2wtdGhpcy1yaXNpbmctYWktY3J5cHRvLWJlY29tZXMtdGhlLW5ldy1nby10by1mb3ItcmV0YWlsLWludmVzdG9ycy0xMDMyODMwNTY30gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Pullback Predicted for Solana (SOL); This Rising AI Crypto Becomes The New Go-To for Retail Investors - Markets Insider",
        "content": "Investors are quickly discouraged when a cryptocurrency on the decentralized cryptocurrency list loses its trajectory, as has happened with Solana (SOL).\n\n—\n\nThe project has maintained a bullish trend for the past month but is now experiencing a negative turn. FTX Derivatives Exchange declared bankruptcy late last year and has begun selling off its Solana holdings. Many investors wonder whether the token will pull back and turn downward.\n\nTo remain safe, retail investors have turned to InQubeta (QUBE), a rising AI cryptocurrency with the potential to transform their portfolios with immense returns. The project propels the growth of the AI industry by making provisions for fractionated investments in AI tech startups set up on the blockchain. These investments are minted into trending NFTs (non-fungible tokens) and traded on the platform’s NFT marketplace. This article explores InQubeta’s rise as the go-to investment option for retail investors while delving into Solana’s path to discover the possibilities of a pullback.\n\nInQubeta (QUBE): Crowdfunding On The Blockchain\n\nInQubeta has been on an upward trend since it first launched its presale, attracting investors with its low entry price and impressive features. The blockchain ICO has recorded the sale of over 495 million QUBE tokens, raising over $4.8 million. Retail investors are currently acquiring tokens in its fifth stage, aiming to earn substantial returns when the tokens are listed. With a DeFi coin price of $0.0161, QUBE has the potential to rise by almost 100% when it lists at a proposed price of $0.0308.\n\nThe current stage of the presale has nearly sold out, with only about 20% left to be purchased. Upon completion, the project would enter the sixth stage and sell at a DeFi coin price of $0.01925 apiece. Holders can further stake their tokens in a protocol that rewards them with a percentage of pooled buy-and-sell tax funds. InQubeta adds more functionality to its platform, making it user-centric by giving holders governance rights. They can vote on projects and decisions to propel the token to greater heights on the decentralized cryptocurrency list.\n\nThis blockchain ICO stands out with features that showcase the power of decentralized finance. Holders can invest regardless of their budgets because investment options are minted into fractionated smart contracts. This revolutionary approach also favors the AI industry, allowing startups to grow and realize their missions through crowdfunding. Investors get rewarded with added utility as these startups begin to grow and turn a profit. The trending NFTs can be traded in the marketplace, allowing investors to shift their focus to other startups as they please.\n\nVisit InQubeta Presale\n\nSolana (SOL): Rising Amid Liquidation\n\nSolana is one of the fastest-growing crypto coins, with a market capitalization of over $22 billion, putting it in seventh place on the decentralized cryptocurrency list. Over the past month, this open-source DeFi project has witnessed an impressive growth trajectory, rising by over 170%, according to on-chain analysis. This incredible path has ground to a halt with a predicted pullback as the bankrupt FTX Exchange sells off its SOL holdings.\n\nThe exchange transferred 250,000 Solana tokens worth nearly $14 million to Kraken. This sudden move caused a dip in the token’s market value, causing it to fall by about 8%. Investors are skeptical about the possibility of a significant downturn in the token’s bullish trend, and there is still hope that it will recover. According to on-chain analysis from Lookonchain, FTX’s Solana liquidity has stopped, with about 3,408 SOL left, worth only around $185,000.\n\nConclusion\n\nVolatility is not news in the crypto industry, and investors are wisely making decisions around this factor. Retail investors are flocking to InQubeta’s presale as they recognize this blockchain ICO as the go-to for diversifying their portfolios and claiming a significant return on investment (ROI). SOL holders also expect a more favorable analysis as FTX sell-offs round up. These top crypto coins represent the ever-changing dynamics of the crypto market. Investors who purchase QUBE quickly before the fifth stage runs out will improve their ROI potential upon launch.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\n\n\nContact Info:\n\nName: Lee Freemans\n\nEmail: Send Email\n\nOrganization: InQubeta\n\nWebsite: https://inqubeta.ai/\n\n\n\nRelease ID: 89113515\n\nIn the event of any inaccuracies, problems, or queries arising from the content shared in this press release, we encourage you to notify us immediately at error@releasecontact.com. Our diligent team will be readily available to respond and take swift action within 8 hours to rectify any identified issues or assist with removal requests. Ensuring the provision of high-quality and precise information is paramount to us."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmJpdGNvaW5tYXJrZXRqb3VybmFsLmNvbS9pcy1zb2xhbmEtZ29vZC1pbnZlc3RtZW50L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Is Solana (SOL) Worth the Hype? - Bitcoin Market Journal",
        "content": "Crypto investors are buzzing about Solana again, and with good reason: the value of SOL is up over 350% since a year ago:\n\nIt has many of the hallmarks of a good investment: it’s a real project (a leading Layer 1), with real users (about 100K/day), generating real revenue (about $50K/day in fees).\n\nBut is it a good long-term investment?\n\nAt Bitcoin Market Journal, we’re in this for the long haul. And personally, I think Solana is a long shot in the long term. Here’s why.\n\nThere Can Be Only One (or Two)\n\nOur first investing thesis is that while lots of experiments happen in the early stages of a new technology, ultimately only one (or sometimes two) big platforms survive in the long run. (Think PCs and Macs, Androids and iPhones, etc.)\n\nIn the traditional tech world, this is because big players get bigger, mostly through network effects: the bigger you get, the easier for new customers to join you. The smaller companies either get acquired, or driven out of business.\n\nThis is how we end up with Google gobbling up all the search business, OpenAI overtaking AI, and Salesforce forcing out other CRMs.\n\nIn the emergent world of blockchain technology, we are only just starting to understand what the categories even are. But one category is definitely smart contract platforms (a.k.a. Layer 1s), the operating system for crypto.\n\nEthereum (ETH) is, by all measures, the 800-pound gorilla in this space. They have the most users, the most revenue, the most developers. So for a competing Layer-1 like Solana, Ethereum is the one to beat.\n\nFor all the hype, let’s look at how Solana stacks up:\n\nEthereum Solana Daily Active Users 300,000 100,000 Daily Fees $5,000,000 $50,000 Active Developers 200 75\n\nSource: Token Terminal (rounded for readability)\n\nThis is not to say that Solana must beat Ethereum in order to survive. Niche search engines like DuckDuckGo or WolframAlpha (I’m still waiting for WolframBeta) have survived against Google. But their market share is tiny by comparison.\n\nAs long-term investors, we don’t want to pick the projects that will survive; we want to pick the projects that will thrive. The numbers above show you that Solana has traction, but it still has a way to go.\n\nIt’s Not the Technology, It’s the Users\n\nBlockchain nerds get really excited about Solana’s faster throughput (due to its Proof of History consensus algorithm vs. Ethereum’s Proof of Stake), and its developer friendliness (they can use languages like Rust and C, vs. having to learn Ethereum’s Solidity).\n\nThe tech crowd gets really excited about the tech, but no one else does. This is because the market does not really care about technology, the market cares about the users.\n\nIf a company is building a new blockchain application, where would they want to build it?\n\nThe one with a better consensus algorithm, or the one where more users are going to be able to use it?\n\nThe one with an easier programming language, or the one that’s going to generate more revenue and fees?\n\nThe underdog, or the existing leader?\n\nCompanies will generally go with bigger tech platforms, because they’re a safer bet. There’s safety in numbers.\n\nBut what about investors? My experience is that investors also do not really care about the technology, they care about whether they can make money. The technology is only relevant if it’s going to lead to a higher price multiple in the end.\n\nVHS vs. Betamax, MP3 vs. FLAC, QWERTY vs. any other keyboard layout: often the inferior technology wins. In blockchain, especially, the tech is only relevant if it leads to more users.\n\nMore users = more network effects = more value.\n\nYou want to find winning long-term investments? Look for blockchain projects with userbases that are large and growing. (Remember that before this recent price rally, the crypto outlets were bemoaning Solana’s drop in daily users.)\n\nWhere are the Killer Apps?\n\nLayer 1s are like operating systems: to grab those critical users, you’ve got to have some killer apps. For example, VisiCalc put the Apple II on the map, AOL introduced the Internet to the masses, and Siri made the iPhone indispensable.\n\n(In blockchain, we call them decentralized apps or “dapps,” but c’mon, they’re just apps.)\n\nOn Solana, you’ve got the usual assortment of dapps: a DEX (Serum), an AMM (Raydium), wallets (Phantom), borrowing/lending (Solend), NFT marketplaces (Magic Eden). I think of these as copycats of bigger, more popular dapps on Ethereum.\n\nHowever, there are a few dapps that take advantage of Solana tech:\n\nThe decentralized music platform Audius lets artists publish directly to listeners and cut out the middleman, using Solana’s higher throughput and lower transaction fees to handle a large volume of microtransactions.\n\nThe MMO game Star Atlas runs a complex game economy with real-time transactions—all those tiny transactions are easier and faster to process on Solana than Ethereum.\n\nMango Markets offers decentralized spot trading and perpetual futures, which is nothing new, but Solana’s speed and efficiency can allow for higher-frequency trading with lower latency.\n\nSo it’s possible that Solana can carve out a niche around dapps that require high-speed microtransactions. If that’s the case, we’d want to see a lot more of these specific dapps launching over the next year: dapps that you simply couldn’t build on Ethereum.\n\nInvestor Takeaway: So Long, Solana\n\nThe recent price gains are likely due to excitement over Solana’s Breakpoint community conference, and bullish sentiment from influencers like Cathie Wood.\n\nBut it’s unlikely that Solana will unseat Ethereum anytime soon. I don’t see any reason to jump on this bandwagon, especially when prices are triple what they were just a month ago.\n\nBut technology is full of surprises, and the early leaders aren’t always the later leaders. Ethereum may not be the Layer 1 for the long term, and Solana may carve out a profitable niche. But at the moment, ETH is still the one to beat.\n\nSo for now, it’s so long, Solana. But we’ll keep an eye on you.\n\nFor more tips on building wealth with bitcoin and crypto, subscribe to our daily Bitcoin Market Journal newsletter."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vYmxvY2tjaGFpbm1hZ2F6aW5lLm5ldC9ldmVyeXRoaW5nLXlvdS1uZWVkLXRvLWtub3ctYWJvdXQtaW52ZXN0aW5nLWluLXNvbGFuYS1pbi0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Everything You Need To Know About Investing In Solana In 2023 - Blockchain Magazine",
        "content": "Investing in Solana refers to purchasing and holding the cryptocurrency Solana (SOL) with the expectation that its value will increase over time. Solana is both a blockchain platform and a native cryptocurrency that aims to provide fast, scalable, and secure decentralized applications (dApps) and smart contracts. Here are some key points to understand about investing\n\nInvesting in Solana refers to purchasing and holding the cryptocurrency Solana (SOL) with the expectation that its value will increase over time. Solana is both a blockchain platform and a native cryptocurrency that aims to provide fast, scalable, and secure decentralized applications (dApps) and smart contracts.\n\nHere are some key points to understand about investing in Solana:\n\nCryptocurrency Potential: Solana is considered a promising project within the cryptocurrency space due to its innovative technology and potential to address scalability issues faced by other blockchain platforms like Ethereum. Many investors are attracted to Solana’s high throughput and low transaction fees, which make it an appealing platform for developers and users. Growth and Adoption: Solana has gained significant attention and adoption since its launch in 2020. It has attracted numerous developers and projects, resulting in a growing ecosystem of decentralized applications built on the Solana blockchain. Increased usage and adoption can potentially drive up the value of SOL tokens. Market Performance: The value of SOL tokens can fluctuate widely due to market dynamics, investor sentiment, and external factors affecting the cryptocurrency market as a whole. It’s important to note that investing in cryptocurrencies can be highly volatile, and prices can experience rapid and substantial changes. Research and Due Diligence: Before investing in Solana or any cryptocurrency, it is essential to conduct thorough research and due diligence. Understand Solana’s technology, its competitive advantages, the team behind the project, and its roadmap for future development. Additionally, consider factors like market trends, regulatory landscape, and risk tolerance. Diversification: Cryptocurrency investments should typically be part of a well-diversified investment portfolio. Diversification helps to mitigate risks by spreading investments across different asset classes, reducing the impact of potential losses from a single investment. Risk Considerations: Investing in cryptocurrencies, including Solana, involves inherent risks. These risks include market volatility, regulatory uncertainties, technological vulnerabilities, and the potential for fraud or hacking. It’s crucial to assess your risk tolerance and only invest what you can afford to lose.\n\nWhy not? We’re directly investing in the growth of Solana and creating value for our holders at the same time. What more could you possibly want? — Noto | Turtles 🔼🐢 (@notonft) May 27, 2023\n\nBenifits of investing in Solana\n\nHere are some potential benefits of investing in Solana:\n\nScalability and Speed: Solana is designed to offer high scalability and transaction speeds. Its unique consensus mechanism, called Proof of History (PoH), along with other innovative technologies, enables Solana to handle a large number of transactions per second (TPS) at low costs. This scalability potential may attract developers and users to the Solana ecosystem, leading to increased adoption and potential value appreciation. Robust Infrastructure: Solana has a strong infrastructure that supports decentralized applications (dApps) and decentralized finance (DeFi) platforms. It provides developers with a flexible and powerful toolkit to build and deploy smart contracts, making it an attractive platform for developers and entrepreneurs looking to create blockchain-based applications. Growing Ecosystem: Solana has seen significant growth in its ecosystem, with a wide range of projects, dApps, and protocols being built on its blockchain. The expanding ecosystem indicates a growing developer and user community, which can contribute to the long-term value of the network. Developer-Friendly Environment: Solana offers a developer-friendly environment with easy-to-use tools, developer grants, and comprehensive documentation. This supportive ecosystem can attract developers and foster innovation, leading to the creation of new projects and applications that could potentially increase the value of Solana over time. Partnerships and Integrations: Solana has formed partnerships with various companies, including exchanges, wallets, and other blockchain projects. These partnerships and integrations can enhance Solana’s visibility and accessibility, potentially attracting more users and investors to the platform. Strong Team and Backing: Solana was developed by a team with experience in blockchain technology, cryptography, and distributed systems. The project has gained support from prominent investors and venture capital firms, which can provide stability and credibility to the network.\n\nAlso, read – What Were The Pros And Cons Of Investing In Solana In 2022\n\nRisks of investing in Solana\n\nWhile Solana has gained significant popularity and attention in the cryptocurrency market, like any investment, it’s important to consider the potential risks and downsides. Here are some cons or potential drawbacks of investing in Solana:\n\nVolatility: Solana, like other cryptocurrencies, is highly volatile. Its price can experience substantial fluctuations over short periods. This volatility can lead to significant gains, but it also exposes investors to the risk of substantial losses. Regulatory Uncertainty: The regulatory landscape surrounding cryptocurrencies is still evolving in many jurisdictions. Governments and regulatory bodies may introduce new rules or restrictions that could impact Solana’s operations or its value. Regulatory uncertainty can create instability and negatively affect investment outcomes. Market Dependency: The success of Solana’s ecosystem and its token value are reliant on the broader market sentiment and adoption of blockchain technologies. Factors like market trends, investor sentiment, and competition from other blockchain platforms can influence Solana’s performance. Network Scalability: While Solana claims to have high scalability, there is always a risk that increased adoption could strain the network’s capacity and affect its performance. Network congestion, slower transaction speeds, or higher fees can impact user experience and potentially discourage adoption. Centralization Concerns: Solana’s consensus mechanism, Proof of History (PoH), has faced criticism for potential centralization risks. Some argue that Solana’s network relies on a limited number of validators, which could compromise decentralization and create vulnerabilities in the system. Technical Challenges: As with any complex technology, Solana is not immune to technical challenges and vulnerabilities. Bugs, security breaches, or other technical issues could pose risks to the network’s stability and the value of the SOL token. Competition: The blockchain industry is highly competitive, with numerous platforms vying for adoption and market share. Solana faces competition from other well-established projects like Ethereum, as well as emerging platforms that offer similar functionalities and scalability solutions. Dependency on Team and Development: Solana’s success relies on the capabilities and ongoing development efforts of its core team. Any significant changes or issues within the development team could impact the project’s trajectory and potentially the value of the SOL token.\n\nTop 10 tips for investing in Solana\n\nSure, here are 10 tips for investing in Solana:"
    }
]