[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMjAvc29sYW5hLXJhbGxpZXMtMjYtaW4tYS13ZWVrLWRlc3BpdGUtZnR4LXNhbGUtZmVhcnMtd2hhdHMtYmVoaW5kLXRoZS1tb3ZlL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMjAvc29sYW5hLXJhbGxpZXMtMjYtaW4tYS13ZWVrLWRlc3BpdGUtZnR4LXNhbGUtZmVhcnMtd2hhdHMtYmVoaW5kLXRoZS1tb3ZlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Solana Rallies 26% in a Week Despite FTX Sale Fears; What's Behind the Move? - CoinDesk",
        "content": "Friday's gain adds to SOL's remarkable comeback as one of the best-performing digital assets this year with a 170% year-to-date rise. This after Solana’s future was in doubt at the end of 2022 following the spectacular fall of Sam Bankman-Fried – one of the ecosystem’s top supporters and investors."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vY3J5cHRvLm5ld3Mvd2h5LXNvbGFuYS1pcy1hLWJhZC1kZWFsLXRyYWRlci1leHBsYWlucy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Why Solana is a bad deal: trader explains - crypto.news",
        "content": "Jonah — a popular Twitter account of a pseudonymous crypto trader — made waves this week with a scathing Twitter thread explaining why he believes Solana’s future prospects look grim.\n\nIn his Oct. 18 tweet, Jonah kicked off the thread by claiming Solana has a “structural oversupply of blockspace” and its speed advantage won’t matter for years. He went on to criticize Solana’s ties to FTX, Jump Trading, and Multicoin Capital, suggesting their plan to “watch your transactions and systematically frontrun them” is a major red flag.\n\nFurther, Jonah argued decentralization is critical in crypto and centralized entities like FTX cannot be trusted, especially after recent events. He predicted developers will avoid building on Solana while FTX dumps tokens, stifling innovation.\n\nYou might also like: Lido Finance to stop Solana support while Cardano prices fall, new project unveils staking program\n\nTechnologically, Jonah believes Solana’s approach is “fundamentally ill-suited to the problem it is trying to solve.” He pointed out it still struggles with basic applications like StepN, showing vertical scaling doesn’t work for crypto like horizontal scaling does.\n\nFinally, Jonah claimed leadership at Jump Trading is now “quasi-criminal” and can no longer pretend to support Solana infrastructure, for which there is little end user demand anyway.\n\nThe thread struck a chord with many crypto users who agree Solana faces structural challenges. With its monopoly on speed now being a distant memory and key backers facing trust issues, Solana may struggle to attract developers and users long-term if it doesn’t adapt its strategy."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8yMC9ldGhlcmV1bS1yaXZhbC1zb2xhbmEtd2lsbC11c2hlci1pbi1jcnlwdG8tc3VtbWVyLWluLTIwMjQtc2F5cy1tYWNyby1ndXJ1LXJhb3VsLXBhbC1oZXJlcy1oaXMtb3V0bG9vay_SAYsBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTAvMjAvZXRoZXJldW0tcml2YWwtc29sYW5hLXdpbGwtdXNoZXItaW4tY3J5cHRvLXN1bW1lci1pbi0yMDI0LXNheXMtbWFjcm8tZ3VydS1yYW91bC1wYWwtaGVyZXMtaGlzLW91dGxvb2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Ethereum Rival Solana Will Usher In ‘Crypto Summer’ in 2024, Says Macro Guru Raoul Pal – Here’s His Outlook - The Daily Hodl",
        "content": "Former Goldman Sachs executive Raoul Pal believes Ethereum (ETH) competitor Solana (SOL) will usher in a “crypto summer” next year.\n\nThe macroeconomic expert tells his 996,800 followers on the social media platform X that Solana is forming a classic bullish pattern that could eventually lead to a more than 86% increase from its current value.\n\n“Let’s see, but it feels like SOL is going to lead us from ‘crypto spring’ eventually into ‘crypto summer’ in 2024.”\n\nA “crypto summer” generally means increased prices, higher trading volume, bullish market sentiment, more network development and wider adoption.\n\nThe trader says SOL appears to be completing an inverse head-and-shoulders pattern, a bullish indicator that could send SOL to the $30 level before a move to $50.\n\n“SOL: I’ve been extremely bullish all year. It’s up 171% this year and we are about to test the big inverse head and shoulders at $30. Next major resistance would likely be $50, once confirmed.”\n\nLooking at his chart, the trader is looking for SOL to break out of the $26.79 level, flipping it into support, to maintain the possible bullish reversal.\n\nThe trader also says that Solana is showing strength against Ethereum.\n\n“It has broken out versus ETH.”\n\nThe SOL/ETH pair is trading for 0.0167 ETH ($26.84) at time of writing.\n\nSolana is making gains against against Bitcoin (BTC) as well. The SOL/BTC pair is worth 0.000911 BTC at time of writing.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vdS50b2RheS90b3AtY3J5cHRvLWFuYWx5c3QtY2FsbHMtc29sYW5hLW5ldy1ldGhlcmV1bdIBQGh0dHBzOi8vdS50b2RheS90b3AtY3J5cHRvLWFuYWx5c3QtY2FsbHMtc29sYW5hLW5ldy1ldGhlcmV1bT9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "Top Crypto Analyst Calls Solana New Ethereum - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nThe world of cryptocurrencies is vast, with a plethora of assets vying for the spotlight. For a long time, Ethereum (ETH) has held a revered position, initially beginning as a nonconsensus asset back in 2018 and 2019. Fast forward to today, and Ethereum has garnered consensus, solidifying its position as a leading player in the decentralized finance (DeFi) space.\n\nAdvertisement\n\nHowever, the tides of the crypto world are ever-changing, and a new contender is making waves — Solana (SOL). Prominent crypto analysts now claim that Solana is the \"strongest non-consensus asset\" of the current bear market. Such bold claims are not made lightly, and the recent performance of Solana provides substantial backing to these assertions.\n\nSource: TradingView\n\nExamining the daily chart of Solana reveals an explosive trajectory. After a series of oscillations, SOL has demonstrated a robust upward trend, capturing the attention of investors and enthusiasts alike. Peaks and troughs aside, the general momentum of Solana portrays bullish sentiment.\n\nBut what sets Solana apart in the crowded crypto domain? One key event solidifying its credibility was its resilience during the FTX crash. FTX, a prominent crypto exchange, was one of the major holders of Solana. Despite potential concerns of market manipulation or undue influence, Solana showcased stability and growth even after the FTX crash. This event not only fortified investor confidence but also indicated Solana's intrinsic value and potential for longevity in the crypto arena.\n\nNow, Solana stands in an advantageous position. The so-called shackles of major centralized holders are behind, and the ecosystem of Solana is burgeoning. Developers, start-ups and enterprises are increasingly turning to Solana's blockchain for its speed, security and scalability."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZGVjcnlwdC5jby8yMDI1NTQvd2Vlay1pbi1jb2lucy1zb2xhbmEtYml0Y29pbi14cnAtcmlwcGxl0gFHaHR0cHM6Ly9kZWNyeXB0LmNvLzIwMjU1NC93ZWVrLWluLWNvaW5zLXNvbGFuYS1iaXRjb2luLXhycC1yaXBwbGU_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 20 Oct 2023 07:00:00 GMT",
        "title": "This Week in Coins: Solana Explodes 25%, Bitcoin Reclaims $30K on ETF Hopes and Ripple Wins - Decrypt",
        "content": "We do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt was a good week for holders of virtually all leading cryptocurrencies, including Bitcoin, Solana, and XRP.\n\nAfter many weeks of inertia and slow movement, Bitcoin (BTC) finally rebounded with some bullish price action, adding 10% over the last seven days to change hands at $29,523 as of this writing. The rest of the market rebounded with it.\n\nBitcoin’s rally began on Monday, following last Friday’s news that the U.S. Securities and Exchange Commission would not be appealing a court verdict that labeled the regulator’s rejection of crypto asset manager Grayscale’s ETF application “arbitrary and capricious.”\n\nAD\n\nAD\n\nThe world’s favorite cryptocurrency also received another boost—of around 10%—on Monday when Cointelegraph tweeted fake news that Wall Street titan Blackrock had been approved to launch a U.S. Bitcoin spot ETF.\n\nBlackRock CEO Larry Fink responded to the price pump that day, saying during an appearance on FOX Business: “It’s just an example of the pent-up interest in crypto. I think the rally today is about a flight to quality.” A marked change of tune from 2017 when Fink called Bitcoin an “index of money laundering.”\n\nLater in the week, BlackRock submitted an amended prospectus for its ETF application. Changes to its filing include acknowledgment of competition in the race for ETF approval and detailed explanations on the product’s pricing and reporting mechanisms. On a related note, a report released by JP Morgan that day (Wednesday) called it “most likely” that a spot Bitcoin ETF could get approved before January 10.\n\nBy Friday, the news had pushed Bitcoin’s price to briefly reclaim $30k, a level not seen since summer, according to CoinGecko.\n\nThe wider market: Solana, Ethereum, and Bitcoin Cash\n\nWhile Bitcoin generally acts as the industry’s pace-setter (typically when BTC rises, other coins and tokens rise with it), this week, the market leader’s gains were far outpaced by some of its rivals.\n\nAD\n\nAD\n\nClosest contender Ethereum (ETH) didn’t manage to catch up with it this week. Ethereum rose 3.4% to enter the weekend trading at $1.602.\n\nRipple’s XRP blew up this week, but not quite as much as Bitcoin. XRP grew 6.7% to $0.515669 off the back of news that the SEC had voluntarily dismissed charges against Ripple execs, CEO Brad Garlinghouse and Executive Chairman Chris Larsen. The SEC sued them alongside the company in December 2020 for allegedly violating securities laws with sales of XRP.\n\nThe biggest rallies this week came from two altcoins: Solana (SOL) and Bitcoin Cash (BCH). Bitcoin Cash blew up 11.6% and currently trades at $239.40, while Solana mushroomed a staggering 25% to hit $26.89 at the time of writing.\n\nSOL’s impressive rally appears to have been spurred by news that the FTX estate has decided to stake roughly $122 million in Solana held in the bankrupt exchange's crypto wallets rather than liquidate it.\n\nFinally, there were no significant losses among the top thirty cryptocurrencies by market capitalization. The only red candle this week was from Cosmos Hub’s ATOM, which fell 3.8% to $6.36.\n\nEdited by Stacy Elliott."
    }
]