[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9wZXBlLWJ1dC1vbi1zb2xhbmEtYW5kLW90aGVyLXdlYi0zLTAtZnJvZ3MtZ290LWEtYnVtcC1vbi1wZXBlLWNvaW4tbWFuaWEv0gFmaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL3BlcGUtYnV0LW9uLXNvbGFuYS1hbmQtb3RoZXItd2ViLTMtMC1mcm9ncy1nb3QtYS1idW1wLW9uLXBlcGUtY29pbi1tYW5pYS8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "PEPE but on Solana and Other Web 3.0 Frogs Got A Bump on Pepe Coin Mania - CryptoPotato",
        "content": "The dramatically popular debut of Pepe coin this year has put frog meme cryptos in the spotlight. While the new Ethereum ERC-20 token launched on April 15th, Pepe coin went parabolic starting May 1st, and that would soon blow out sales of Pepe (SOL) as well.\n\nThe price madness was a bullish portent for Ethereum and DeFi crypto blockchains.\n\nMoreover, it was so popular on crypto exchanges that supporters compared it to DOGE and SHIB. That was during the beginning of May amidst the flash rally.\n\nPepe Coin Surge Shifts Attention Elsewhere\n\nAfter the Pepe coin price settled from its all-time high, it got legs and rallied again Friday, May 12th. As a result, markets have more evidence that PEPE is a project with long-term horizons, not a rug pull. That might be giving confidence crypto investors taking another look at Pepe (SOL).\n\nBut Pepe Coin isn’t the only one out there. Before it, there was PepeSol. Additionally, it’s not the only frog meme coin, either.\n\nJust as a group of geese is a flock and a group of bees is a swarm, a group of frogs is called an army. Well, there’s a small army of frog meme coins out there on the blockchains.\n\nHere are just a couple examples of frog cryptos that are getting a bump out of Pepe coin’s rise:\n\nPepe (SOL) Blew up on Pepe Coin (ERC-20)’s Coattails.\n\nPepeSol (also listed as PEPE token) is a meme coin on Solana. The fast and low-fee smart contract blockchain has seen significant growth recently.\n\nWhile it was launched earlier this year in February, Pepe SOL didn’t get to hopping the way Pepe Coin did a couple of months later.\n\nWhen Pepe Coin went viral in crypto markets, however, Pepe (SOL) jumped from $0.000078 on Apr 29th to $0.00153 on May 2nd. That was a 1,860% increase in its price in three days.\n\nCrypto investors holding Pepe Sol only had until May 3 to sell at that massive ROI for the flash rally. It crashed to around $0.00023 by May 7th.\n\nThere’s also a Pepe coin on Arbitrum, a layer-2 scaling solution for Ethereum."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvLWNvbW11bml0eS1zZXRzLXNvbGFuYS1wcmljZS1mb3ItbWF5LTMxLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Crypto community sets Solana price for May 31, 2023 - Finbold - Finance in Bold",
        "content": "Disclaimer: The CoinMarketCap cryptocurrency community price estimate is based only on the votes of its users. Estimates do not guarantee end-of-month prices.\n\nAs the majority of assets in the cryptocurrency market continue to trade in the choppy trend, Solana (SOL) has been mimicking, slowing down the gains after more than doubling its price since the year’s turn, but the crypto community has remained bullish.\n\nIndeed, according to the votes of 993 members of the cryptocurrency monitoring platform CoinMarketCap, the projected average price of Solana on May 31, 2023, amounts to $21.65, as per the latest data retrieved by Finbold on May 16.\n\nSpecifically, should the community’s optimistic price estimates for Solana materialize by the end of the fifth month, they would represent a +$0.8732 or +4.20% increase to its price at press time.\n\nSOL end-of-May price estimation. Source: CoinMarketCap\n\nSolana price analysis\n\nAs things stand, Solana was at press time trading at the price of $20.77, down 222% in the last 24 hours, as well as 0.09% during the previous seven days. At the same time, it has accumulated losses of 13.90% across the past month, as the latest charts indicate.\n\nSolana 7-day price chart. Source: Finbold\n\nDespite the CoinMarketCap community’s optimism, the one-day technical analysis (TA) gauges from the finance and crypto tracking website TradingView paint a slightly more bearish view of Solana. Indeed, the summary of the gauges suggests a ‘sell’ at 14, which is the result of oscillators in the ‘neutral’ zone at 9, and moving averages (MA) looking at a ‘strong sell’ at 13, as the most recent data shows.\n\nSolana 1-day sentiment gauges. Source: TradingView\n\nWhichever side prevails in Solana’s case will largely depend on further developments surrounding its ecosystem, such as ranking as the best performer in terms of risk-adjusted returns among top crypto assets by market cap, demonstrating the Sharpe ratio of above 2.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8xNi9zb2xhbmEtc29sLWNyZWF0b3ItYW5hdG9seS15YWtvdmVua28tc2F5cy10aGlzLWtpbGxlci1hcHAtY291bGQtc3BhcmstbmV4dC1ib29tLWluLWNyeXB0by1hZG9wdGlvbi_SAYgBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDUvMTYvc29sYW5hLXNvbC1jcmVhdG9yLWFuYXRvbHkteWFrb3ZlbmtvLXNheXMtdGhpcy1raWxsZXItYXBwLWNvdWxkLXNwYXJrLW5leHQtYm9vbS1pbi1jcnlwdG8tYWRvcHRpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Solana (SOL) Creator Anatoly Yakovenko Says This ‘Killer App’ Could Spark Next Boom in Crypto Adoption - The Daily Hodl",
        "content": "Solana (SOL) co-founder Anatoly Yakovenko says one crucial development in the crypto space could trigger a boom in digital asset adoption.\n\nYakovenko says in a new interview with Scott Melker that stablecoin legislation in the US could blow the doors wide open in terms of onboarding new users to the sector.\n\n“My big hope/dream is that this year Congress passes stablecoin legislation and we see a thousand stablecoins bloom that are competing globally and getting every human in the world access to a digital dollar.\n\nAnd that means that we effectively start onboarding most of the world to the digital dollar on Solana, because it’s the best place to do it. But effectively at a fast, low-cost blockchain.\n\nAnd once you have enough users with wallets and self-custody that are all doing this, I think then you really have a big enough market [and] you can start testing all the other business models. But we’ll see what happens, right? I think that’s one of the pieces that could cause a massive boom in crypto adoption.”\n\nYakovenko also says that he agrees with the unpopular sentiment that stablecoins are the “killer app” that will likely attract users around the globe, especially those who reside in countries with collapsing currencies as they have a serious need to access digital dollars.\n\nLast month, the U.S. House Committee on Financial Services published a draft stablecoin bill that proposes qualifications and requirements to be a payment stablecoin issuer and details the criminal penalties for violators.\n\nThe bill would also request the research and exploration of a central bank digital currency (CBDC).\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2Fubm91bmNpbmctc29sYW5hLWJyZWFrcG9pbnQtMjAyMy1wcmVzYWxlLXRpY2tldGluZy1hbmQtaW5pdGlhbC1zZXQtb2Ytc3BlYWtlcnMtMzAxODI1OTI3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Announcing Solana Breakpoint 2023 Presale Ticketing and Initial Set of Speakers - PR Newswire",
        "content": "The Solana Foundation announces Amsterdam for the flagship conference of the Solana Ecosystem, October 30 - November 3\n\nNEW YORK, May 16, 2023 /PRNewswire/ -- The Solana Foundation, a non-profit foundation dedicated to the decentralization, adoption, and security of the Solana network, today announced the initial speakers list and general admission ticket availability for Solana Breakpoint 2023. In addition, applications developer, creator and student tickets and the first-ever open call for artists in the Solana community.\n\nThe third annual Breakpoint conference will take place in Amsterdam from October 30 through November 3 at the Solana Campus, a pop-up gathering ground located at TAETs Art and Event Park approximately 15 minutes from central Amsterdam. The Solana Campus will feature three stages for keynote speakers, educational developer sessions, and creator success stories. In addition, the campus will feature activations and events from Solana ecosystem teams such as art installations, project showcases, and beyond.\n\n\"Breakpoint 2022 was a seminal moment for the Solana community and we're excited to host the most advanced and innovative blockchain developers this year. It's been invigorating to collaborate and communicate with the Solana community since last year's Breakpoint,\" shared Dan Albert, Executive Director, Solana Foundation. \"We are extremely excited for the community to come together, this time in Amsterdam, to engage in discussions, educate one another and join forces to bring the world of blockchain technology forward. It's time to build the future.\"\n\nLast year, Breakpoint saw builders, enthusiasts, and dreamers descend upon Lisbon, where the event hosted over 3,600 attendees and 250 speakers across 125 sessions. This year's edition will be even bigger, with the world's most innovative minds collaborating throughout the Solana Campus across five days of presentations, workshops and community events. Breakpoint 2023 initial group of speakers will include:\n\nSandra Persing , Vice President, Developer & Ecosystem Marketing, Circle\n\n, Armani Ferrante , CEO and Founder, Coral\n\nPeter Moore , formerly of Electronic Arts\n\n, James Tromans , Engineering Director, Web3, Engineering, and Strategy, Google\n\nAmir Haleem , Founder, Helium\n\n, Kanav Kiraya, President, Jump Crypto\n\nKevin Bowers , Chief Science Officer and Head of Research and Development, Jump Trading\n\n, Pascal Gauthier , Chairman and CEO, Ledger\n\n, Nuseir Yassin , Founder and Chief Executive Officer, Nas Company\n\nThomas Lambertz , CEO, Neodyme\n\n, Ori Kwan , Co-Founder, Orca\n\nJules Urbach , CEO and Founder, OTOY\n\nFor speaking opportunities please visit here . Projects looking to inquire about sponsorship of Solana Breakpoint 2023, can visit here .\n\nMore information on tickets, travel, visas, flights, or hotels, can be found on the Breakpoint website here .\n\nAbout Solana Foundation\n\nThe Solana Foundation is a non-profit foundation based in Zug, Switzerland, dedicated to the decentralization, adoption, and security of the Solana network. For more information, please visit https://solana.org/ .\n\nAbout Solana\n\nSolana is a global state machine, and the world's most performant blockchain. It gives developers the confidence to build for the long term by delivering predictable scaling without compromising security or composability. Solana's performance is driven by a single global state, which is capable of processing tens of thousands of smart contracts at once, and by Proof of History, a distributed clock that unlocks low-latency, sub-second finality across the global state. To learn more, please visit https://solana.com/ .\n\nMedia Contact: Arielle Pennington, Solana Foundation Head of Communications, [email protected]\n\nSOURCE Solana Foundation"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy83LWNyeXB0b3MtMS0wMDAtdXBzaWRlLTE4NTQyMDY4NS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "7 Cryptos With 1,000% Upside Potential - Yahoo Finance",
        "content": "Cryptos are one of the most volatile and unpredictable asset classes in the world. They can soar to new heights or crash to new lows in a matter of days or even hours. But for some investors, that’s exactly what makes them so attractive. The potential for massive gains in a short period of time is hard to resist, especially when you see stories of people who turned a few thousand dollars into millions by investing in the right coins at the right time.\n\nBut chasing such high upside potential is not without risks. Cryptos are subject to rampant scamming, rug pulls and false promises about the underlying technology, all of which can cause you to lose most of your investments.\n\nThat being said, I believe that there are some cryptocurrencies that have the potential to deliver 1000% returns or more in the next few years. With the Federal Reserve’s rate cuts and the Bitcoin (BTC-USD) halving next year, I believe many promising projects are well-positioned to rise more than 1000% in a two-year timeframe.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nHere they are:\n\nRender Token (RNDR)\n\nVarious cryptocurrency coins. Cryptos. Cryptocurrencies representing 3AC Crypto., ARBK Stock. cheap cryptos to buy on the rebound\n\nSource: Wit Olszewski / Shutterstock\n\nAlthough it’s a relatively big project compared to the other ones here, I believe a 1000% gain for Render Token (RNDR-USD) is certainly within the realm of possibility. If you aren’t familiar with the project, it is similar to Filecoin (FIL-USD), but with GPU computing power. It rents GPU power from thousands of users worldwide in exchange for the token and resells it at bulk through the blockchain.\n\nI previously suggested buying this token in late March at the $1.7 range before changing that suggestion to a sell at the $2.4 range (where it peaked). However, it’s back trading near $1.95 and I believe now is a good time to start buying again.\n\nOf course, the broader market dictates the price action of almost every project that has a substantial trading volume. Thus, I’d be prepared for more short-term losses if BTC slides more.\n\nAleph Zero (AZERO)\n\nAn aerial shot of a group of popular cryptocurrency tokens; cryptos\n\nSource: Shutterstock\n\nAleph Zero (AZERO-USD) could very well be the next Solana (SOL-USD) if the market rallies again. It has all the necessary ingredients to drive up buzz.\n\nThe peer-reviewed blockchain claims to process over 100,000 transactions per second with near-instant finality. But what makes it better than many of the better-known Ethereum (ETH-USD) “killers” is that it supports private smart contracts, IPFS cloud storage, substrate integration and an Oracle bridge to import real-world information.\n\nBut again, even though it’s peer-reviewed, I would caution that blockchains with excessive TPS counts often have low decentralization. Indeed, it only has 121 validators, which means it’s not nearly as decentralized as Ethereum or Solana.\n\nStory continues\n\nRegardless, if you’re more worried about the upside than decentralization, AZERO is a worthy investment.\n\nTABOO Token (TABOO)\n\nWooden blocks display the word \"taboo\".\n\nSource: BabLab / Shutterstock.com\n\nTABOO (TABOO-USD) piqued my interest as it raised $10 million in funding last week, led by a private family office headed by a former JP Morgan senior executive. This deal values TABOO at $250 million, and the token has been up substantially so far this year.\n\nTABOO is not just a content creation platform. It’s also a marketplace where users can buy and sell exclusive, high-quality NFTs and merchandise.\n\nAt the time of writing, TABOO token is trading at $0.0032 with a market cap of $30.9 million, That’s far below the $250 million valuation. Thus, I believe that there is still a lot of room for growth for this project, especially when NFTs start being hot again.\n\nTradecurve (TCRV)\n\nCryptocurrency: Pile of cryptos and altcoins represented as physical coins\n\nSource: Shutterstock\n\nIf you’re interested in more upside potential, getting into pre-sales and initial coin offerings (ICOs) is a great way to gain exposure to up-and-coming projects. Tradecurve (TCRV-USD) is one such project that caught my eye. It is currently at the second stage of its ICO, as of writing, with each token going for $0.012. The launch price of the token is $0.088, so it’s definitely a lucrative play right now.\n\nIt’s a new hybrid exchange that lets users make accounts with just an email address and essentially get all the features on bigger platforms. With regulators getting tougher on KYC requirements, I believe there will likely be an outflow of users from bigger exchanges into smaller ones like Tradecurve. Thus, the risk here is worth it, in my opinion, considering the upside potential at launch.\n\nr/Cryptocurrency Moons (MOON)\n\nReddit Layoffs. Phone showing Reddit logo on screen in front of blurred background with reddit logo. Reddit IPO.\n\nSource: Ink Drop / Shutterstock\n\nr/Cryptocurrency Moons (MOON-USD) are the community tokens of the main cryptocurrency subreddit. Reddit is arguably the biggest platform through which retail crypto investors communicate and share their thoughts on various cryptos. Thus, MOON is among the most well-known cryptocurrencies despite its small market capitalization.\n\nThe current market cap is very small compared to the potential and influence of the r/Cryptocurrency subreddit. But one of the main catalysts that could boost the value of MOON in the near future is the listing on major exchanges. Many exchanges and their staff are active on the subreddit, and the community could persuade them to support the token during the next crypto bull market. This would increase the liquidity and exposure of MOON and will likely boost the market cap by a significant margin.\n\nIt is still a speculative and risky investment. But I believe it will offer significant returns either once the crypto market recovers or once Reddit goes public.\n\nSolana (SOL)\n\nSolana Coin (SOL-USD) in front of the Solana logo. Solana price predictions.\n\nSource: Rcc_Btn / Shutterstock.com\n\nSolana is currently the most popular alternative blockchain to Ethereum. It has blistering TPS counts, but as I’ve previously noted, blockchains that boast high TPS are less decentralized. Likewise, Solana suffers stability issues and has frequent “outages,” something that is unheard of in every other blockchain ecosystem. That’s the reason I’ve mostly been bearish on Solana throughout 2022, but now may be the time to change the sentiment.\n\nWhy? I believe it is currently trading at a very compelling range considering the success it has had so far in capturing Ethereum’s Web 3.0 market share. Moreover, the developers have finally acknowledged that they will be working on its stability issues, making it the main focus in 2023. Thus, a buy at the current range could easily provide multibagger returns if Solana performs well in the next rally.\n\nXRP (XRP)\n\nA concept token for XRP with stacks of tokens in the background. XRP price predictions.\n\nSource: Shutterstock\n\nXRP (XRP-USD) has been an underwhelming cryptocurrency so far, and I definitely understand the bearish sentiment here. It has been bleeding red ink in the long run, primarily due to the Securities and Exchange Commission’s case against Ripple. It has underperformed most of the major cryptos in recent rallies and is a very risky bet right now.\n\nThe company’s case with the SEC has no end in sight, and it may be months or even years before there is a settlement, which will have a substantial impact on the entire cryptocurrency market on whether or not certain cryptos are considered securities. If the SEC fails to get a judgment on cryptos being securities, XRP will likely be a multibagger overnight. However, investors should be prepared to lose most of their investment if things don’t go Ripple’s way with the lawsuit.\n\nRegardless, the utility here is excellent due to Ripple’s partnership with many of the top banks.\n\nOn Low-Capitalization and Low-Volume Cryptocurrencies: InvestorPlace does not regularly publish commentary about cryptocurrencies that have a market capitalization of less than $100 million or trade with a volume less than $100,000 each day. That’s because these “penny cryptos” are frequently the playground for scam artists and market manipulators. When we do publish commentary on low-volume crypto that may be affected by our commentary, we ask that InvestorPlace.com’s writers disclose this fact and warn readers of the risks.\n\nRead More: How to Avoid Popular Cryptocurrency Scams\n\nOn the date of publication, Omor Ibne Ehsan did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nThe post 7 Cryptos With 1,000% Upside Potential appeared first on InvestorPlace."
    }
]