[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3JlbmRlci10b2tlbi1yaXNlcy04LWFzLWNvbW11bml0eS12b3Rlcy1vbi1wcm9wb3NlZC1zb2xhbmEtbWlncmF0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Render token rises 8% as community votes on proposed Solana migration - CryptoSlate",
        "content": "Render Network’s RNDR is up 8% in the last 24 hours after the community started voting on a proposed migration to Solana (SOL).\n\nThe token is trading at $1.37 as of press time and has increased by 15.8% in the last seven days, according to CryptoSlate’s data.\n\nRender eyes Solana migration\n\nThe Polygon-based protocol is eyeing a migration to layer 1 blockchain network Solana, according to its RNP-002 Layer 1 Network Expansion proposal.\n\nAccording to the proposal, the Solana migration was necessary because of “future network growth.” The project noted that:\n\n“[Render needs] a high throughput, low latency blockchain for network settlement and node operation.”\n\nIt added that the key advantage of the switch is that it would help it scale the network to meet the demand of its technical needs and implement the burn-and-mint equilibrium (BME).\n\nAccording to the proposal, the migration will support the implementation of the BME model by improving transaction times, giving programmers more flexibility, and reducing the cost of transactions.\n\nBesides that, several Render users have complained about their experience on Polygon, citing its re-org tendency, centralization, and transaction fees as why the protocol should migrate.\n\nMeanwhile, the vote is keenly contested — 54.27% of the Render Community voted against the migration, while 45.73% supported the plan, according to the Snapshot data.\n\nVoting is scheduled to end by 8:00 PM on April 6.\n\nSolana enjoys growth despite issues\n\nSolana has recorded growth this year despite the issues plaguing the network.\n\nRender is another crypto project planning to migrate to the blockchain following projects like Helium (HNT). Helium said its migration would allow it to tap into SOL’s rich ecosystem and network speed.\n\nMeanwhile, Solana’s price has recovered from the lows of 2022, growing by more than 100% to erase the losses recorded post-FTX. At the time, SOL traded for under $10 but has since recovered to $21.23 as of press time, according to CryptoSlate’s data.\n\nBesides that, Solana’s on-chain activity has continued to grow, with the total value of assets locked on the protocol at $285.89 million — a high for the year, according to DeFillama data.\n\nMentioned in this article"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3JlbmRlci10b2tlbi1yaXNlcy04LWFzLWNvbW11bml0eS12b3Rlcy1vbi1wcm9wb3NlZC1zb2xhbmEtbWlncmF0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Render token rises 8% as community votes on proposed Solana migration - CryptoSlate",
        "content": "Render Network’s RNDR is up 8% in the last 24 hours after the community started voting on a proposed migration to Solana (SOL).\n\nThe token is trading at $1.37 as of press time and has increased by 15.8% in the last seven days, according to CryptoSlate’s data.\n\nRender eyes Solana migration\n\nThe Polygon-based protocol is eyeing a migration to layer 1 blockchain network Solana, according to its RNP-002 Layer 1 Network Expansion proposal.\n\nAccording to the proposal, the Solana migration was necessary because of “future network growth.” The project noted that:\n\n“[Render needs] a high throughput, low latency blockchain for network settlement and node operation.”\n\nIt added that the key advantage of the switch is that it would help it scale the network to meet the demand of its technical needs and implement the burn-and-mint equilibrium (BME).\n\nAccording to the proposal, the migration will support the implementation of the BME model by improving transaction times, giving programmers more flexibility, and reducing the cost of transactions.\n\nBesides that, several Render users have complained about their experience on Polygon, citing its re-org tendency, centralization, and transaction fees as why the protocol should migrate.\n\nMeanwhile, the vote is keenly contested — 54.27% of the Render Community voted against the migration, while 45.73% supported the plan, according to the Snapshot data.\n\nVoting is scheduled to end by 8:00 PM on April 6.\n\nSolana enjoys growth despite issues\n\nSolana has recorded growth this year despite the issues plaguing the network.\n\nRender is another crypto project planning to migrate to the blockchain following projects like Helium (HNT). Helium said its migration would allow it to tap into SOL’s rich ecosystem and network speed.\n\nMeanwhile, Solana’s price has recovered from the lows of 2022, growing by more than 100% to erase the losses recorded post-FTX. At the time, SOL traded for under $10 but has since recovered to $21.23 as of press time, according to CryptoSlate’s data.\n\nBesides that, Solana’s on-chain activity has continued to grow, with the total value of assets locked on the protocol at $285.89 million — a high for the year, according to DeFillama data.\n\nMentioned in this article"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiJmh0dHBzOi8vbmZ0cGxhemFzLmNvbS9uZnQtdGl0bGUtZGVlZHMv0gEqaHR0cHM6Ly9uZnRwbGF6YXMuY29tL25mdC10aXRsZS1kZWVkcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "NFT Title Deeds Come to the Solana Network - NFT Plazas",
        "content": "NFT Title Deeds Come to the Solana Network\n\nProperty deed tokenization using NFTs remains one of the most viable uses of the technology. With time, the trend is picking up despite a few regulatory hurdles when it comes to acquiring a license to sell security tokens. That said, Homebase, a crypto startup that was formed last year, has managed to tokenize its first NFT title deeds for a single-family home located in south Texas.\n\nThe home was valued at $235,000. However, within two weeks, Homebase was able to raise $246,800 for the property by tokenizing it on Solana using a smart contract that was tied to an NFT. Interestingly, the startup raised an extra $11,800, which was set aside to aid with “maintenance and other issues.”\n\nReal estate tokenization offers a few perks for both home owners and investors. First, it helps property owners raise liquidly from these properties, and second, it provides anyone the chance to invest in and profit from real estate. Owning property is a dream for many individuals, however, given the astronomical figures involved, it remains out of reach for many people.\n\n🚨Homebase Sells Out 1st Tokenized Home on @solana 🚨 We’re excited to share that our first tokenized rental property sold out in < 2 weeks Investors will begin to receive rent directly to their crypto wallet via USDC 😎 Learn how you too can become a property owner ⬇️ — Homebase🏠 (@HomebaseDAO) March 28, 2023\n\nHomebase is Just Getting Started\n\nOne hurdle with real estate tokenization is getting cleared by regulators. In the Homebase case, the company spent seven months just to get the legal and compliance details ready for this property. As Domingo Valadez, cofounder and CEO of Homebase, notes, the overall effort took a year. That included filing with the SEC to be allowed to market security tokens to both retail and accredited investors.\n\nAll in all, 38 investors got in on the action, with the minimum investment of $500, according to the SEC filing, 30 of which were non-accredited.\n\nValadez notes they chose Solana due to its ease of use and cheap gas prices. As a result, 15 out of the 38 participants were able to create their first Solana wallets and buy fractions of the property as NFTs. Now, these participants are expected to hold on to these NFTs for at least one year before they can sell them freely. The NFTs represent their stake and accrued interest in the property.\n\nAfter the success of this sale, Homebase says it is working on tokenizing its second property. The startup allows users to buy tokenized slices of property “in one click” using USDC.\n\nWant more? Connect with NFT Plazas\n\nJoin the Weekly Newsletter\n\nJoin our Discord\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiJmh0dHBzOi8vbmZ0cGxhemFzLmNvbS9uZnQtdGl0bGUtZGVlZHMv0gEqaHR0cHM6Ly9uZnRwbGF6YXMuY29tL25mdC10aXRsZS1kZWVkcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "NFT Title Deeds Come to the Solana Network - NFT Plazas",
        "content": "NFT Title Deeds Come to the Solana Network\n\nProperty deed tokenization using NFTs remains one of the most viable uses of the technology. With time, the trend is picking up despite a few regulatory hurdles when it comes to acquiring a license to sell security tokens. That said, Homebase, a crypto startup that was formed last year, has managed to tokenize its first NFT title deeds for a single-family home located in south Texas.\n\nThe home was valued at $235,000. However, within two weeks, Homebase was able to raise $246,800 for the property by tokenizing it on Solana using a smart contract that was tied to an NFT. Interestingly, the startup raised an extra $11,800, which was set aside to aid with “maintenance and other issues.”\n\nReal estate tokenization offers a few perks for both home owners and investors. First, it helps property owners raise liquidly from these properties, and second, it provides anyone the chance to invest in and profit from real estate. Owning property is a dream for many individuals, however, given the astronomical figures involved, it remains out of reach for many people.\n\n🚨Homebase Sells Out 1st Tokenized Home on @solana 🚨 We’re excited to share that our first tokenized rental property sold out in < 2 weeks Investors will begin to receive rent directly to their crypto wallet via USDC 😎 Learn how you too can become a property owner ⬇️ — Homebase🏠 (@HomebaseDAO) March 28, 2023\n\nHomebase is Just Getting Started\n\nOne hurdle with real estate tokenization is getting cleared by regulators. In the Homebase case, the company spent seven months just to get the legal and compliance details ready for this property. As Domingo Valadez, cofounder and CEO of Homebase, notes, the overall effort took a year. That included filing with the SEC to be allowed to market security tokens to both retail and accredited investors.\n\nAll in all, 38 investors got in on the action, with the minimum investment of $500, according to the SEC filing, 30 of which were non-accredited.\n\nValadez notes they chose Solana due to its ease of use and cheap gas prices. As a result, 15 out of the 38 participants were able to create their first Solana wallets and buy fractions of the property as NFTs. Now, these participants are expected to hold on to these NFTs for at least one year before they can sell them freely. The NFTs represent their stake and accrued interest in the property.\n\nAfter the success of this sale, Homebase says it is working on tokenizing its second property. The startup allows users to buy tokenized slices of property “in one click” using USDC.\n\nWant more? Connect with NFT Plazas\n\nJoin the Weekly Newsletter\n\nJoin our Discord\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzA1L3doaWNoLWNvaW5zLXdpbGwtYmVuZWZpdC1mcm9tLXdhbGwtc3RyZWV0cy01LXRyaWxsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Which Coins Will Benefit From Wall Street's $5 Trillion Crypto Prediction? - The Motley Fool",
        "content": "A new \"killer use case\" for crypto could boost the prospects of blockchains such as Solana and Avalanche.\n\nIf you thought Web3 or the metaverse were going to spark the next big crypto rally, think again. According to Citigroup (C 0.89%), the next major wave of crypto market adoption will be led by asset tokenization, which is the process of transforming real-world assets into digital assets that can be stored, accessed, and traded via the blockchain.\n\nCitigroup predicts that asset tokenization could become a $5 trillion market opportunity by 2030. As Wall Street gets behind this trend, says Citigroup, the popularity of asset tokenization will explode in areas from real estate to private equity and venture capital. Because asset tokenization relies on blockchain-based technology to work, it's only natural to ask: Which coins or tokens could benefit from what Citigroup is calling a \"killer use case\" for crypto?\n\nIt won't be Bitcoin\n\nAlthough Bitcoin is the one cryptocurrency that is most often associated with Wall Street and financial markets, it will likely play little or no role in asset tokenization. There are several reasons for this, with the most obvious one being that Bitcoin was not designed to support smart contracts. These smart contracts are small pieces of executable computer code, and they are the reason why some people refer to cryptos with these capabilities as \"programmable money.\"\n\nTo tokenize an asset and put it on a blockchain, you need smart contracts. These contracts can be written in such a way as to define ownership rights, as well as the rules of how assets are transferred between different owners. Given this complexity, you likely wouldn't even be able to include all the terms of a financial instrument within a block on the Bitcoin blockchain, which is optimized for holding basic transaction data only. Thus, the real beneficiaries of any asset tokenization trend will be blockchains that support smart contracts.\n\nIt won't be Ethereum\n\nThis brings us to Ethereum, the blockchain that is credited with launching the concept of the smart contract back in 2015. And, indeed, a number of Wall Street giants have experimented with the Ethereum blockchain for pilot projects. In November 2022, JPMorgan Chase (JPM 1.93%) made headlines with the trade of tokenized cash deposits using Polygon, a Layer 2 scaling solution for Ethereum.\n\nBut Ethereum is simply too slow and expensive to use for the scale and scope of asset tokenization that Citigroup has in mind. Even after The Merge, Ethereum can only process 15 to 30 transactions per second, and its transaction fees are still too high to be practical for asset tokenization. What Wall Street needs and wants is a super-fast, near-zero-fee blockchain capable of instantaneous settlement of transactions.\n\nSolana and Avalanche\n\nAnd that leads me to think either Solana or Avalanche could emerge as beneficiaries of the asset tokenization trend. Both are high-throughput, extremely fast blockchains with near-zero fees. And both have extensive experience with decentralized finance (DeFi), including the creation of decentralized exchanges capable of trading tokenized assets.\n\nCitigroup specifically mentions real estate and private equity as two of the most promising areas for asset tokenization, and these are two areas where Solana and Avalanche have real-world use cases. For example, in 2022, Avalanche helped to tokenize a $4 billion healthcare fund from private equity giant KKR (KKR 2.36%). Tokenized stocks have existed on Solana since 2021. And, last month, Solana announced that one of the projects within its ecosystem had successfully tokenized a single-family home in Texas.\n\nHow big is this market opportunity?\n\nOf course, there are a number of issues that will have to be addressed first if asset tokenization is going to take off. As Citigroup mentions in its report, there are legal and regulatory issues to consider. There is also the question of interoperability. It could get really messy, really fast, if every Wall Street bank is using its own proprietary blockchain infrastructure. That's why I think using a \"public\" blockchain like Solana or Avalanche makes the most sense.\n\nIt's impossible not to hear about a potential $5 trillion market opportunity and not be impressed. There are even some who think the market opportunity could be much larger. For example, Boston Consulting Group has suggested the size of the asset tokenization market might be $16 trillion by 2030.\n\nRight now, the size of the total crypto market is $1.2 trillion, so Citigroup's \"killer use case\" could lead to a huge increase in the valuation of any crypto that gets ahead of the asset tokenization trend. While the rest of the crypto world is focused on NFTs and the metaverse, I'm going to be taking a much closer look at which cryptos could skyrocket in value as a result of asset tokenization. For now, my best picks are Solana and Avalanche."
    }
]