[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY3J5cHRvYnJpZWZpbmcuY29tL3NvbGFuYS1lY29zeXN0ZW0tY29sbGFwc2UtY2xvY2t3b3JrLW5leHQtcHJvamVjdC10by1zaHV0LWRvd24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 29 Aug 2023 07:00:00 GMT",
        "title": "Solana Ecosystem Collapse? Clockwork Next Project to Shut Down - Crypto Briefing",
        "content": "Share this article URL Copied\n\nJoining other Solana-based projects that have recently shut down, Clockwork, an automation network for smart contracts, has announced it will cease development. The reasons cited for the decision include “opportunity costs” and “limited commercial upside”.\n\nHi all, bittersweet news today. The team and I behind @clockwork_xyz have decided to step away from active development of the protocol. 1/ — Nick (@time_composer) August 27, 2023\n\nNick Garfield, the founder of Clockwork, said that the team had decided to stop developing the protocol. Clockwork will be switching off their nodes on both devnet and mainnet, effective October 31.\n\nClockwork automates smart contract transactions based on conditions, events, or schedules predefined by users.\n\nThe decision to stop development comes after a $4 million seed funding round last year. The round was led by Multicoin Capital and Asymmetric.\n\n“We still have a meaningful portion of our seed funding. Fully shutting down is an option, but I need to take a minute to reset myself before deciding one way or the other,” Garfield said in a Twitter thread.\n\nClockwork follows in the footsteps of several Solana-based platforms that have shut down in recent months. Friktion, a DeFi yield farming platform, halted operations in January. Everlend, a DeFi lender, followed suit in February. The NFT marketplace, Formfunction, shut down in March. And just last month, Cardinal, which develops tools for Solana NFTs, put an end to its development.\n\nThis wave of shutdowns comes after the migration of some top Solana projects to other chains last year. In 2022, Solana’s two top projects by transaction volume, y00ts, and DeGods, moved from Solana to Polygon and Ethereum, respectively. Likewise, gaming platform Fractal, co-founded by the creator of Twitch, also made the switch from Solana to Polygon.\n\nThe Solana ecosystem appears to feel the ripple effects of FTX’s downfall, as a significant portion of its support came from customer deposits funneled into Solana projects by Alameda Research and FTX Ventures."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vY29pbm5vdW5jZS5jb20vc29sYW5hLWJhc2VkLWNsb2Nrd29yay1jZWFzZS1vcGVyYXRpb25zL9IBQ2h0dHBzOi8vY29pbm5vdW5jZS5jb20vc29sYW5hLWJhc2VkLWNsb2Nrd29yay1jZWFzZS1vcGVyYXRpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 29 Aug 2023 07:00:00 GMT",
        "title": "Solana-Based Clockwork to Cease Operations: 'Limited Commercial Upside' Cited - Coinnounce",
        "content": "Clockwork, a Solana-based smart contract automation project, is set to halt its operations by the end of October due to what the team describes as \"limited commercial upside.\"\n\nStrategic Decision Amidst Limited Prospects\n\nClockwork's Closure Decision\n\nClockwork, a project built on Solana's blockchain, is preparing to shut down its key infrastructure in October. The project's founder, Nick Garfield, took to Twitter on August 27 to announce the cessation of active development for the protocol. The nodes on both devnet and mainnet will be turned off on October 31.\n\nOpportunity Cost and Diverse Interests\n\nReasoning Behind the Decision\n\nGarfield attributed the decision to a \"simple opportunity cost,\" suggesting that the team found limited commercial viability in continuing the development of Clockwork. He acknowledged that the team had an increasing interest in exploring alternative opportunities beyond the project.\n\nClockwork's Functionality and Open-Source Code\n\nClockwork's Role and Openness\n\nClockwork served as a protocol that enabled users to schedule transactions on the Solana network and create smart contracts that could automate applications triggered by specific events. Despite the project's closure, Garfield emphasized that the code would remain open-source and accessible online. He encouraged others to fork and continue working on the protocol if they wished.\n\nFunding and Future Considerations\n\nSeed Funding and Outcome\n\nLast August, Clockwork successfully raised $4 million in a seed funding round, co-led by venture firms Multicoin Capital and Asymmetric, with participation from Solana Ventures. Addressing inquiries about the fate of the seed money, Garfield indicated that a significant portion of the funds still remains, but he would take time before making a decision about returning the funds to investors.\n\nIn-Line with Recent Trends\n\nSolana Protocol Closures\n\nClockwork's closure follows a pattern seen in other Solana protocols. Earlier this year, decentralized finance (DeFi) platform Friktion and Everlend Finance shut down. More recently, Solana-based nonfungible token protocol Cardinal also announced winding down due to economic conditions."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8yOS90b3AtdHJhZGVyLXNheXMtaGVzLW9ubHktYnVsbGlzaC1vbi1zb2xhbmEtYW5kLXR3by1vdGhlci1jcnlwdG8tYXNzZXRzLWJlc2lkZXMtYml0Y29pbi1hbmQtZXRoZXJldW0v0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzI5L3RvcC10cmFkZXItc2F5cy1oZXMtb25seS1idWxsaXNoLW9uLXNvbGFuYS1hbmQtdHdvLW90aGVyLWNyeXB0by1hc3NldHMtYmVzaWRlcy1iaXRjb2luLWFuZC1ldGhlcmV1bS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 29 Aug 2023 07:00:00 GMT",
        "title": "Top Trader Says He’s Only Bullish on Solana and Two Other Crypto Assets Besides Bitcoin and Ethereum - The Daily Hodl",
        "content": "A closely followed crypto strategist says that besides Bitcoin (BTC) and Ethereum (ETH), there are only three other projects he’s bullish on.\n\nThe pseudonymous analyst known as The Flow Horse, also known as Cantering Clark, tells his 181,700 followers on the social media platform X that ETH-rival Solana (SOL) has big upside potential.\n\nHe thinks SOL could be repeating the early days of Ethereum before ETH soared to four figures.\n\n“But yea, I think it is going through the same early cycle rounds as ETH.”\n\nLast month, The Flow Horse also compared Solana’s price action to ETH’s early days, suggesting that SOL could smash all-time highs perhaps sometime in late 2024.\n\n“In a private group (can’t dox Excel chart of picks or people), my pick for the best-performing coin of the bounce this year was SOL. The idea [is] that a darling of the last cycle would do very well. I shared this chart of the beginnings of ETH vs. SOL, and I still think SOL probably does more or less the same. The cheering got pretty loud for this one.”\n\nSolana is trading for $21.28 at time of writing, up 3.6% in the last 24 hours.\n\nThe analyst is also bullish on Phemex’s yet-to-be-launched utility token for the crypto derivatives exchange platform. He points to the strong performances of other exchange tokens to support his thesis on the upcoming altcoin.\n\n“There is actually one token I am bullish on that is not even out yet but can be mined. Phemex has a token coming out this quarter and my thesis is simple: look at other exchange tokens.”\n\nLastly, the analyst says he is bullish on crypto gambling platform Rollbit’s native token RLB.\n\n“Yep, getting a lot of flack for my negative posts but [the] only things I am bullish on long term are Bitcoin and ETH, and the new projects yet to come to market.\n\nRollbit token is an exception.”\n\nRollbit is trading for $0.19 at time of writing, up 7.8% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL25ld3Mvd29ybGQvYW1lcmljYXMvc3BpZGVyLXRhcmFudHVsYS1hbmltYWwtY29sb21iaWEtYjI0MDExMjYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 29 Aug 2023 07:00:00 GMT",
        "title": "Four new spider species found in Colombia's biodiversity hotspot - The Independent",
        "content": "The latest headlines from our reporters across the US sent straight to your inbox each weekday Your briefing on the latest headlines from across the US Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy policy Thanks for signing up to the\n\nEvening Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nA group of researchers discovered four new tarantula species in a largely uncharted “biodiversity hotspot” in the Colombian Pacific region.\n\nThe discovered spiders are called Ummidia solana, Melloina pacifica, Euthycaelus cunampia and Neischnocolus mecana.\n\nAccording to the World Rainforest Movement, the Chocó Biogeographical Region comprises an area of some 75,000 square kilometres on the Pacific Coast of Colombia, spreading from Panamá to Ecuador.\n\n“Due to a combination of evolutionary, ecological, climatic and geologic factors, this region presents the highest biodiversity concentration per area in the world,” it added.\n\nAs the area has remained largely unexplored, particularly when it comes to spider diversity, researchers wanted to change that and decided to embark on an expedition at the Jardín Botánico del Pacífico (JBP) in Bahía Solano to study a group of spiders known as Mygalomorphae.\n\nThis includes the likes of tarantulas, trapdoor spiders, funnel-web spiders, millimeter-sized spiders with little use of the silk, and bald-legged spiders with the ability to attach the substrate to their bodies.\n\nThese spiders are predatory, mostly terrestrial, and very often have restricted geographic distributions and high levels of endemism.\n\nDuring the research process, scientists discovered and documented four species, and noted that these “taxonomic breakthroughs represent the first recorded instances of their respective genera in the region, expanding their geographical distribution.\n\n“Each species was meticulously illustrated, described, and scientifically discussed, offering valuable insights into their morphological characteristics, taxonomy, and biogeography,” researchers said.\n\nAs for the results of the study, this serves as a “significant contribution to our understanding of the region’s biological diversity, known for its exceptional species richness and endemism,” they added.\n\nGoing deeper into their finding, researchers unveiled these four spiders:\n\nUmmidia Solana is named after Bahía Solano and marks the first record of the Ummidia genus within the Chocó Biogeographic Region.\n\nA male Ummidia solana ( CREDIT: Echeverri et al. )\n\nThe next spider, the Melloina pacifica is named after the Colombian Pacific region it inhabits. Melloina is known to thrive in diverse ecosystems, including caves.\n\nA male Melloina pacifica ( CREDIT: Echeverri et al. )\n\nEuthycaelus cunampia pays tribute to two Emberá indigenous community members, Don José and Don Antonio, who shifted from hunting traditions to guiding tourists and scholars at the JBP. This discovery marks the first instance of the Euthycaelus genus and the subfamily Schismatothelinae outside specific Colombian regions.\n\nA male Euthycaelus cunampia ( CREDIT: Echeverri et al. )\n\nNeischnocolus mecana is the fourth species and is named after a township in Bahía Solano.\n\nA female Neischnocolus mecana ( CREDIT: Echeverri et al. )\n\nResearchers concluded that the study “serves as a testament to the potential existence of undiscovered species and the need for comprehensive taxonomic research.”\n\nThe study was published in the journal ZooKeys."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vaW5zaWRlYml0Y29pbnMuY29tL25ld3Mvc29sYW5hLXByaWNlLXByZWRpY3Rpb24tc29sLXJhbGxpZXMtdG8tMjAtNzAtdGhlLW5ldy1raW5nLW9mLWRlZmnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 29 Aug 2023 07:00:00 GMT",
        "title": "Solana Price Prediction: SOL Rallies to $20.70 – The New King of DeFi? - Inside Bitcoins",
        "content": "Don’t invest unless prepared to lose all the money you invest. This is a high-risk investment, you shouldn’t expect to be protected if something goes wrong.\n\nJoin Our Telegram channel to stay up to date on breaking news coverage\n\nSolana (SOL) shows signs of recovery as the broader crypto market has recorded slightly bullish momentum. This change follows after some days of downtrend in the prices of most crypto assets.\n\nAs of 05:26 EST on August 29, Solana trades at $20.32, reflecting a slight increase over the past 24 hours. Earlier today, SOL surged to $20.73 due to the increasing bullish momentum.\n\nThough some altcoins are still red today, Solana has defiled the trend, creating a new direction. Could SOL be the new king of DeFi, and can it sustain the bullish wave?\n\nSOL Could Record Twist in Performance\n\nThe chart shows that SOL trades below the 50-day and 200-day Simple Moving Averages (SMAs), indicating a bearish trend. Also, the Moving Average Convergence Divergence MACD trades below the signal line with red histogram bars signifying bearish activities in the market.\n\nThe Relative Strength Index of 37 suggests that the SOL price is approaching the oversold zone, and a possible trend reversal could follow suit if the price reaches this level.\n\nThe combination of the above indicators points towards a short-term bearish price movement for SOL and an overall long-term market outlook for the asset.\n\nHowever, investors should explore other tools before making a trade decision, as the crypto market is always prone to high price volatility and market fluctuations.\n\nSOL’s Support and Resistance Levels\n\nThe chart above reveals that the SOL/USD pair is under the influence of the bears. So, any further increment in selling pressure could drop SOL’s market value to the $19.21 support.\n\nHowever, if the bulls take control of the SOL/USD market today, they might hold the buying pressure for the next few days, taking the coin’s price to the resistance level of $23.37.\n\nIf the action of the bull forces SOL’s market value above this resistance zone, traders could get excited and accumulate more quantities of the asset. This positive market status may increase the coin’s worth, making SOL hit the next resistance level of $25.54 in the next couple of weeks.\n\nSolana’s Outstanding Partnerships and Developments Could Trigger SOL’s Rally\n\nCollaboration With Shopify\n\nSolana and most protocols built on the Solana blockchain have recently sealed several partnerships with prominent and giant entities. One of the great collaborations for Solana is with Shopify. The partnership brought about the integration of Shopify with Solana Pay.\n\n1/ 🛍️Shopify 🤝Solana Pay Today, Solana Pay integrates with @Shopify, empowering the millions of entrepreneurs and merchants on Shopify to accept fast, web3 native payments with no transaction fees through the end of 2023. https://t.co/q63KeBllXB Learn more 👇 pic.twitter.com/QEb1LzqS51 — Solana (@solana) August 23, 2023\n\nShopify is one of the giant companies in the US that constitute up to 10% of all the e-commerce activities in the country. Usually, its credit card fee ranges from 1.5% to 3.5%.\n\nBut with the collaboration with Solana Pay, Shopify users will enjoy fast and Web3-based payments at no transaction fees till the end of 2023.\n\nBoth customers and merchants will benefit immensely from Web3 and NFT-based shopping, cross-border payments, token-centered offers, and more.\n\nAlso, the collaboration opens up the use of SOL as the essential token for transactions, increasing its demand and potential for explosive price rallies.\n\nPartnership With Maple Finance\n\n🔑 Key Features of Cash Management on Solana: 💰 Accepts USDC-spl\n\n🎯 Targets a net APY of the 1M US Tbill rate less fees\n\n⚡️ Interest accrues immediately\n\n🔁Daily liquidity\n\n📈Fees of 0.5% annualized, no fees to deposit or withdraw pic.twitter.com/cQhtmulJ5n — Maple (@maplefinance) August 23, 2023\n\nSolana is also partnering with a treasury management solution, Maple Finance, that focuses on investment backed by US Treasury Bills. The collaboration is a Cash Management Solution on Solana for Web3 treasuries and DAOs operating on the Solana blockchain.\n\nMaple offers conservative returns on idle funds, and the deal will see interest paid with SOL. This move could further drive the price of SOL to the north.\n\nThe launch date for the solution will be in early September 2023.\n\nDevelopments On Solana Blockchain\n\nSolana is one of the prominent and fast-growing blockchains in the crypto industry. Its popularity could be linked to high scalability, speedy execution of transactions, and innovative developments on the blockchain.\n\nThe Only-Possible-On-Solana campaign points out the distinguishing attributes of Solana from other blockchains. These include the network’s lightning-fast consensus, scalable technology, parallel transactions, compressed NFTs, etc.\n\nSolana has more than 21.9 million minted NFTs and 11.5 million active accounts. Also, it claims to execute 4,566 transactions per second at an average cost of $0.00025 per transaction, which is much cheaper compared to most networks in the industry.\n\nSolana’s growing developments and innovative applications add to the utility of SOL and increase its potential for a rally in the market.\n\nCould SOL Lead in DeFi Space?\n\nDespite the hazy appearance of Solana’s short-term price trend, the token could significantly boost the long-term outlook.\n\nAccording to data from DeFi Llama, Solana’s total value locked (TVL) is $310.58 million. The deal represents the USD value of all digital assets locked within the blockchain’s smart contracts.\n\nSolana’s market cap sits at $8.27 billion. It’s possible to witness a bullish market run that could trigger a solid rally for SOL and push its market cap higher than the current level.\n\nBut while investors await a price rally for SOL, they could cash out quickly with a ground-breaking memecoin Wall Street Memes offering an affordable entry point for early investors.\n\nSolana (SOL) Alternative for Investors – Wall Street Memes (WSM)\n\nWith the increasing frenzy in the adoption and use of memes, most investors in the crypto space are turning to meme coins.\n\nWall Street Memes (WSM) is an excellent Solana alternative for meme coin investors. The token offers an engaging platform leveraging low-cost presale offers to boost investors’ returns.\n\nSurprisingly, the token’s emergence brought a revolution within the meme sector as it witnessed significant progress in its performance.\n\nWSM’s Tokenomics, Staking Program for Users\n\nThe team before WSM projected a distinctive tokenomics that would facilitate its growth and increase its adoption. Wall Street Memes has a total supply of 2 billion WSM coins. One billion tokens, representing 50% of the pool, are set aside for marketing.\n\n30% is allocated to community rewards, and 10% each is reserved for CEX and DEX, respectively. Further, the project offers a staking program that allows WSM holders to engage and secure yields of high value. Users could earn passive income up to 100% APY\n\nby staking the coins.\n\nThe WSM staking pool already has approximately 150 million tokens locked up, indicating its adoption and impressive feat within a short period. Also, the team plans to list WSM on tier-1 exchanges following the end of its presale final stage. The move will ensure the sustainability and relevance of the meme coin on a long-term basis.\n\nSome prominent crypto experts, analysts, and YouTubers see WSM as a meme coin with colossal potential to rally in the future.\n\nWall Street Memes Presale Reaches Final Stage\n\nWSM has been running its presale, which is currently at its final stage. The project generated over $25 million through its presale, reflecting its uniqueness and attractive investment benefits.\n\nAlso, its exciting community indicates unparalleled support that triggers its scaling capacities and attraction to meme coin enthusiasts.\n\nThe presale is now at the final stage at a low price of $0.0337. The project has made a last call for potential investors to buy WSM coins before its official exchange listing.\n\nAccording to WSM’s official website, the presale has less than one month to end. Investors should rush to the platform to purchase the token using ETH, USDT, or a bank’s credit/debit card.\n\nRelated Articles:\n\nSmog (SMOG) - Meme Coin With Rewards Rating Airdrop Season One Live Now\n\nEarn XP To Qualify For A Share Of $1 Million\n\nFeatured On Cointelegraph\n\nStaking Rewards - 42% APY\n\n10% OTC Discount - smogtoken.com Visit Site"
    }
]