[
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMipAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG9jdXJyZW5jeS1hbmFseXRpY3MtaW5zaWdodC9zb2xhbmEtc2Vlcy1hbi04MC1pbmNyZWFzZS1pbi1hLW1vbnRoLXdpdGgtdGhlLWZpcmVkYW5jZXItdGVzdG5ldC1sYXVuY2gtdmMtc3BlY3RyYS1qdW1wcy1ieS01ODctNdIBrgFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9hbXAvc3RvcnkvY3J5cHRvY3VycmVuY3ktYW5hbHl0aWNzLWluc2lnaHQvc29sYW5hLXNlZXMtYW4tODAtaW5jcmVhc2UtaW4tYS1tb250aC13aXRoLXRoZS1maXJlZGFuY2VyLXRlc3RuZXQtbGF1bmNoLXZjLXNwZWN0cmEtanVtcHMtYnktNTg3LTU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Solana Sees an 80% Increase in a Month With the Firedancer Testnet Launch; VC Spectra Jumps by 587.5% - Analytics Insight",
        "content": "Solana (SOL) has surged by 80% in a month, thanks to the launch of its Firedancer testnet, signaling a bullish trend despite being off its all-time high. VC Spectra (SPCT) jumped by 587.5% during its presale, reflecting investor confidence and promising potential in blockchain and tech ventures. Let's explore which are the best DeFi projects to invest in."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8wNS9oZXJlcy1hLXJlYXNvbmFibGUtc29sYW5hLXNvbC1wcmljZS10YXJnZXQtZm9yLW5leHQtYnVsbC1ydW4tYWNjb3JkaW5nLXRvLWV4LWdvbGRtYW4tc2FjaHMtZXhlY3V0aXZlLXJhb3VsLXBhbC_SAZQBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTEvMDUvaGVyZXMtYS1yZWFzb25hYmxlLXNvbGFuYS1zb2wtcHJpY2UtdGFyZ2V0LWZvci1uZXh0LWJ1bGwtcnVuLWFjY29yZGluZy10by1leC1nb2xkbWFuLXNhY2hzLWV4ZWN1dGl2ZS1yYW91bC1wYWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Here’s a Reasonable Solana (SOL) Price Target for Next Bull Run, According to Ex-Goldman Sachs Executive Raoul Pal - The Daily Hodl",
        "content": "Macro guru Raoul Pal is laying out what he thinks is a reasonable price point for Ethereum (ETH) rival Solana (SOL) for the next bull run.\n\nIn a new interview on the Crypto Banter YouTube channel, the former Goldman Sachs executive says that the smart contract platform could eventually find itself skyrocketing between 1,097% and 2,294% from current levels in the next market expansion.\n\n“The numbers have changed dramatically because when I started looking at this, it was trading at $20. We’ve already gone up a lot since then, so these numbers keep halving every time you keep going up a lot. My idea is somewhere between $500 and $1,000, just depending [on] what that market feels like.”\n\nSolana is trading for $41.76 at time of writing, a 7.3% increase during the last 24 hours and a staggering gain of over 300% since the start of 2023.\n\nPal goes on to agree with host Ran Nuener on his assessment that the next crypto bull cycle will end with Bitcoin (BTC) on top followed by the smart contract platform ETH in second and Solana in third.\n\nHowever, Pal adds that he might be “blindsided” by the rise of another digital asset, though he says he’s not sure which.\n\n“I actually do [have that same order] too, which obviously means we’re going to be blindsided by something else that’s interesting that we didn’t think of. The Solana of this cycle – what is that going to be? I’m not good enough to pick those…\n\nWith a macro bet like [Solana], it’s just so much easier because it’s so obvious. It survived a crisis. It launched. The tech is massively improving. The community is good. The only on Solana narrative is good.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/eliahinsomnia/WhiteBarbie"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8wNS90cmFkZXItd2hvLW5haWxlZC0yMDE4LWJpdGNvaW4tYm90dG9tLXByZWRpY3RzLWV0aGVyZXVtLWFuZC1zb2xhbmEtcmFsbGllcy1zYXlzLWl0cy10aW1lLWZvci1yaXNrLW9uLWFzc2V0cy_SAZEBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTEvMDUvdHJhZGVyLXdoby1uYWlsZWQtMjAxOC1iaXRjb2luLWJvdHRvbS1wcmVkaWN0cy1ldGhlcmV1bS1hbmQtc29sYW5hLXJhbGxpZXMtc2F5cy1pdHMtdGltZS1mb3Itcmlzay1vbi1hc3NldHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Trader Who Nailed 2018 Bitcoin Bottom Predicts Ethereum and Solana Rallies, Says It’s Time for Risk-On Assets - The Daily Hodl",
        "content": "An analyst who accurately called the 2018 floor price for Bitcoin (BTC) thinks rallies are in sight for Ethereum (ETH) and its rival Solana (SOL).\n\nLooking at Ethereum first, pseudonymous trader Bluntz tells his 226,200 followers on the social media platform X that ETH appears to have completed a corrective move on the lower time frame chart.\n\nAccording to the analyst, ETH also flashed a bullish divergence on the 30-minute chart, indicating that momentum is building up for the leading smart contract platform.\n\n“Even though ETH has been the bane of my existence because ETH/BTC has been a perpetual bag of sh*t, I still think there’s a nice flat setup here on the USD pair with five-wave down now done and a nice low time frame divergence to confirm it.\n\nI think ‘the dip’ is done and we at least go for one more high above $1,880 from here.”\n\nBluntz practices the Elliott Wave theory, a method of technical analysis that attempts to predict future price action by identifying crowd psychology which tends to manifest in waves. Looking at the trader’s chart, he appears to predict that ETH will rally above $1,900 in the short term.\n\nAt time of writing, Ethereum is worth $1,850.\n\nNext up is Solana, which the trader thinks has more gas left in the tank even though it’s already up about 338% this year.\n\n“18% three-wave pullback in a monster uptrend, yes, please. This is going straight to $50+.”\n\nAt time of writing, SOL is worth $42.\n\nBluntz is also watching the performance of the US dollar index (DXY), which keeps track of the USD’s value compared to a basket of foreign currencies. According to the analyst, risk-on assets like crypto may see upside moves as he believes the DXY is set for a significant correction.\n\n“DXY now well and truly back in the high time frame range.\n\nRisk on b***hes, lets go!”\n\nBased on the trader’s chart, he seems to predict that the DXY could fall below the key support level of 100 points.\n\nAt time of writing, the DXY is trading at 105.069 points.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aGF0LXJlbmRlcnMtbGF0ZXN0LXVwZGF0ZS1hbmQtc29sYW5hcy1taWdyYXRpb24tbWVhbi1mb3Itcm5kci1ob2xkZXJzL9IBYWh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aGF0LXJlbmRlcnMtbGF0ZXN0LXVwZGF0ZS1hbmQtc29sYW5hcy1taWdyYXRpb24tbWVhbi1mb3Itcm5kci1ob2xkZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "What Render’s latest update and Solana’s migration mean for RNDR holders - AMBCrypto News",
        "content": "Node Operators on the Render network would get the first set of tokens by 31 December.\n\nWith Solana involved, RNDR may now have another bullish backing for the long term.\n\nRender Foundation, the team behind the distributed GPU rendering network Render [RNDR] has announced 1.4 million in RNDR tokens as incentives for its node operators. A node operator is either a miner or validator on a network.\n\nRead Render’s [RNDR] Price Prediction 2024-2025\n\nOperators over airdrop hunters\n\nWhether validator or miner, node operators are responsible for managing and monitoring information stored on the blockchain. Render’s announcement comes days after it disclosed that it was collaborating with compute clients on Solana [SOL].\n\nNice launch @ionet_official ! Welcome to @solana Render Foundation Announces Compute Client Incentives of 1.14M RNDR Render Foundation Announces 1.14 Million RNDR Incentive Program for Node Operators on https://t.co/S8Zu3iZfhH and Other Compute Clients, Node Waitlist Open… — The Render Network (@rendernetwork) November 3, 2023\n\nFor context, a compute client is used to connect a node on a particular blockchain with another node on another network. Hence, Render’s integration with Solana means that it is dedicated to preventing transaction failure.\n\nFurthermore, Render Foundation’s decision to reward node operators means the project holds the group in high esteem. Some time ago, the project informed the crypto community that it did not plan on airdropping tokens like others may have done.\n\nDespite that, AMBCrypto reported how great the project had done in terms of adoption. Also, RNDR’s price action has not been left out of the party. Between 13 October and 2 November, Render’s network growth climbed from 136 to 503.\n\nNetwork growth tracks the number of new addresses interacting on a network. The metric is used to gauge tracking on a project. Therefore, the hike suggests an increase in advocacy for the Render.\n\nDecreasing demand for RNDR is not the end\n\nAs shown above, the metric had plunged, indicating a decline in traction. This decrease in demand for RNDR could also be linked to the cryptocurrency’s 2.94% fall in the last seven days.\n\nBut with the Solana partnership, RNDR could be back with an upward movement. The reason for this is that Solana has become one of the best performers of the past few months. In addition, projects linked to it have followed the same path.\n\nOn 31 October, Render’s social dominance reached a height of 12.45%. This meant that the crypto community had eyes on the token especially as the value surged to almost 100% at that time. Gaining insights into other promising AI crypto projects can complement your understanding of Render’s growth trajectory.\n\nHowever, its social dominance has dropped at press time, indicating a recent oversight. But traders might need to watch out for RNDR in the coming weeks. Should the token build on its 6.95% 24-hour growth, then it may be time to expect a rally again.\n\nRealistic or not, here’s RNDR’s market cap in SOL terms\n\nRender’s market cap is also one metric market participants may want to watch out for. Based on CoinMarketCap’s data, the project was ranked 52 with a market cap of $866.10 million.\n\nIn the next few months, this value could increase depending on RNDR’s circulation, the narrative around its fundamentals, and certain developments."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vdGhlY3J5cHRvYmFzaWMuY29tLzIwMjMvMTEvMDUvYmV5b25kLXNvbGFuYS1zb2wtYW5kLXRob3JjaGFpbi1ydW5lLXRoZS1jb250ZW5kZXItZm9yLWNyeXB0by1kb21pbmFuY2UtaW4tMjAyNC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Beyond Solana (SOL) And THORChain (RUNE): The Contender For Crypto Dominance In 2024 - The Crypto Basic",
        "content": "In 2024, the crypto market is poised for intense competition, with VC Spectra (SPCT) emerging as a strong contender against established players like Solana (SOL) and THORChain (RUNE). While Solana is testing Firedancer and THORChain in burning more tokens, VC Spectra distinguishes itself with its successful presale. Let’s explore these top DeFi coins.\n\nBUY SPCT TOKENS NOW\n\nSummary\n\nSolana (SOL) could surpass $45 and approach $50.\n\nRecord burning of 125 thousand THORChain (RUNE) tokens on October 29 boosts its price.\n\nVC Spectra (SPCT) stands out for its focus on sustainable and ethical investments.\n\nSolana (SOL) Is Testing New Validator Client\n\nAccording to Solana news, Solana (SOL) is testing Firedancer, a new validator client designed to enhance network speed and reliability, with a mainnet launch targeted for early 2024. This development addresses past network outages by implementing multiple, independent code sets to run the chain, significantly reducing the risk of simultaneous bugs and improving overall network stability.\n\n- Advertisement -\n\nFurthermore, the SOL crypto price jumped significantly in the last week of October, partly due to FTX unstaking $67 million worth of tokens and growing investor confidence as one of the best DeFi projects. SOL crypto price rose 32% in a week, breaking the resistance level of $25 and then surpassing $40, reaching a 14-month high.\n\nAt the start of November, Solana (SOL) was trading around $42 and might soon test this level. The MACD shows strong positive momentum, suggesting continued price growth. If Solana (SOL) maintains this trajectory, SOL crypto price could quickly surpass $45 and reach $50. However, a bearish shift could see the Solana (SOL) could fall to a support level of $35. Crypto experts believe Solana (SOL) will trade around an average of $70 in 2024.\n\nTHORChain (RUNE) Witnesses Huge Price Surge\n\nTHORChain (RUNE), one of the top altcoins, has seen huge growth attributed to solid on-chain fundamentals. A significant factor is the record-high burning of THORChain (RUNE) tokens, with a notable 125 thousand RUNE burned on October 29. This burning, driven by increased lending and platform usage, creates upward price pressure.\n\nTHORChain (RUNE) price prediction for November 2023 is strongly bullish, following a 34% rise in the past 30 days. At the start of November, THORChain (RUNE) was trading around $2.90. The RUNE price broke the $2.75 resistance and maintained a sustained uptrend above key EMAs.\n\n- Advertisement -\n\nWhile a short-term retracement is possible, the rally appears robust. If THORChain (RUNE) surpasses resistance at $3.10, more upside potential is expected. The bullish trend is supported by technical indicators, suggesting a move towards the $3.50 at the start of 2024. The long-term outlook of THORChain (RUNE) remains positive, with significant support at $2.80.\n\nVC Spectra (SPCT) Is Set to Shine in 2024\n\nAs a rising star in the crypto world, VC Spectra (SPCT) is making waves with its innovative approach. Having raised $2.4 million in its seed and private sale, VC Spectra’s public presale shows promising growth, with the SPCT token price already up by 587.5%. Surpassing its initial target of $0.080, the SPCT token is poised for greater heights as it prepares to hit significant exchanges post-presale.\n\nVC Spectra (SPCT) stands out with its decentralized trading platform and asset management protocol, designed on a secure, transparent blockchain infrastructure. This platform allows investors to trade and manage assets peer-to-peer without needing intermediaries. It’s a game-changer in how blockchain technology is utilized, offering a more accessible and controlled investment environment.\n\nWhat sets VC Spectra (SPCT) apart is its commitment to sustainable and ethical investments. The platform only supports new ICOs that adhere to these values, ensuring a positive impact on society and the environment. This ethical approach is about good business and shaping a better future through responsible investing.\n\nVC Spectra (SPCT) caters to a diverse range of investors, from individuals to institutional clients, who seek high-return investments aligned with sustainability and ethical principles. As the crypto landscape evolves, VC Spectra’s (SPCT) blend of innovation, security, and ethical investment practices positions it as a potential leader in the industry for 2024 and beyond.\n\nLearn more about the VC Spectra presale here:\n\nPresale\n\nWebsite\n\nTelegram\n\nTwitter"
    }
]