[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvc29sLXByaWNlLWFuYWx5c2lzLXNvbGFuYS1wb2lzZWQtZm9yLTEyLWRyb3AtYXMtYnV5ZXJzLWxvc3QtY3J1Y2lhbC1zdXBwb3J0L9IBbWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvc29sLXByaWNlLWFuYWx5c2lzLXNvbGFuYS1wb2lzZWQtZm9yLTEyLWRyb3AtYXMtYnV5ZXJzLWxvc3QtY3J1Y2lhbC1zdXBwb3J0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "SOL Price Analysis: Solana Poised for 12% Drop As Buyers Lost Crucial Support - CoinGape",
        "content": "During the first half of August, the Solana buyers tried to hold above the combined support of $22.4 and 50% Fibonacci retracement. However, from the latter half, this SOL Price witnessed aggressive selling pressure leading to a breakdown of the aforementioned support. This crackdown signals the continuation of the ongoing correction phase. Should you sell on this?\n\nAlso Read: Solana (SOL) And Polkadot (DOT) Continue Falling, Can They Rebound? Pomerdoge (POMD) On An Upward Trajectory\n\nadvertisement\n\nSOL Price Chart: Key Points\n\nThe Solana price has been experiencing losses for four consecutive days.\n\nA breakdown below the $22.38 support triggers a 12% drop\n\nThe 24-hour trading volume on the Solana coin is $486.5.5 Million, indicating a 10% gain.\n\nSource-Tradingview\n\nThe Solana coin has been in a correction phase for the past five weeks. From the top of $32.13, the prices tumbled 33.4% to reach the current trading price of $21.39. This downfall obtained a significant boost on August 15th, the crypto market witnessed an intense sell-off in response to the Bitcoin price dip.\n\nThe SOL price breakdown from $22.38 support, offers sellers an additional resistance to pressurize the buyers. With sustained selling, the price could plummet another 12% to reach the $18.8 mark.\n\nHowever, in the daily chart, the candle pattern shows lower price rejection, indicating the buyer’s attempt to counterattack. This buying pressure could trigger a minor pullback and retest the $22.38 as a valid resistance to short sell.\n\nWill Solana Buyers Reverse Current Trend?\n\nA downsloping trendline in the daily time frame chart is carrying the current correction phase. The sellers may use this dynamic resistance to sell at bullish bounces. Therefore, until this trendline is intact the downward correction may extend and the potential buyers must for a breakout above this barrier for trend change.\n\nBollinger band: An downtick in the lower band of the Bollinger Band indicator reflects high momentum selling in the market.\n\nVortex Indicator: A bearish crossover state between the V+(blue) and VI-(orange) indicate increasing sustained bearish momentum in the market"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvc29sLXByaWNlLWFuYWx5c2lzLXNvbGFuYS1wb2lzZWQtZm9yLTEyLWRyb3AtYXMtYnV5ZXJzLWxvc3QtY3J1Y2lhbC1zdXBwb3J0L9IBbWh0dHBzOi8vY29pbmdhcGUuY29tL21hcmtldHMvc29sLXByaWNlLWFuYWx5c2lzLXNvbGFuYS1wb2lzZWQtZm9yLTEyLWRyb3AtYXMtYnV5ZXJzLWxvc3QtY3J1Y2lhbC1zdXBwb3J0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "SOL Price Analysis: Solana Poised for 12% Drop As Buyers Lost Crucial Support - CoinGape",
        "content": "During the first half of August, the Solana buyers tried to hold above the combined support of $22.4 and 50% Fibonacci retracement. However, from the latter half, this SOL Price witnessed aggressive selling pressure leading to a breakdown of the aforementioned support. This crackdown signals the continuation of the ongoing correction phase. Should you sell on this?\n\nAlso Read: Solana (SOL) And Polkadot (DOT) Continue Falling, Can They Rebound? Pomerdoge (POMD) On An Upward Trajectory\n\nadvertisement\n\nSOL Price Chart: Key Points\n\nThe Solana price has been experiencing losses for four consecutive days.\n\nA breakdown below the $22.38 support triggers a 12% drop\n\nThe 24-hour trading volume on the Solana coin is $486.5.5 Million, indicating a 10% gain.\n\nSource-Tradingview\n\nThe Solana coin has been in a correction phase for the past five weeks. From the top of $32.13, the prices tumbled 33.4% to reach the current trading price of $21.39. This downfall obtained a significant boost on August 15th, the crypto market witnessed an intense sell-off in response to the Bitcoin price dip.\n\nThe SOL price breakdown from $22.38 support, offers sellers an additional resistance to pressurize the buyers. With sustained selling, the price could plummet another 12% to reach the $18.8 mark.\n\nHowever, in the daily chart, the candle pattern shows lower price rejection, indicating the buyer’s attempt to counterattack. This buying pressure could trigger a minor pullback and retest the $22.38 as a valid resistance to short sell.\n\nWill Solana Buyers Reverse Current Trend?\n\nA downsloping trendline in the daily time frame chart is carrying the current correction phase. The sellers may use this dynamic resistance to sell at bullish bounces. Therefore, until this trendline is intact the downward correction may extend and the potential buyers must for a breakout above this barrier for trend change.\n\nBollinger band: An downtick in the lower band of the Bollinger Band indicator reflects high momentum selling in the market.\n\nVortex Indicator: A bearish crossover state between the V+(blue) and VI-(orange) indicate increasing sustained bearish momentum in the market"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vdS50b2RheS9vcGVuc2VhLWNlYXNlcy1zdXBwb3J0aW5nLWJuYi1zbWFydC1jaGFpbi1oZXJlcy13aHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "OpenSea Ceases Supporting BNB Smart Chain, Here's Why - U.Today",
        "content": "Advertisement\n\nOpenSea, the first mainstream marketplace for non-fungible tokens, is losing its share of the market. A series of strategic decisions in August 2023 might improve its positions. So far, the marketplace shortened the list of supported blockchains and radically adjusted its royalties policy.\n\nOpenSea stops accepting BSC-based NFTs: Statement\n\nStarting from Aug. 18, 2023, users of OpenSea will no longer be able to create new listings for or make new offers on non-fungible tokens issued on top of BNB Smart Chain, a programmable blockchain by the largest CEX Binance (BNB). This decision was announced by the OpenSea team on its official Twitter account.\n\nAt the same time, OpenSea is not leaving BNB Smart Chain completely. Users will still be able to view, discover and transfer BSC NFTs on OpenSea. Regarding the reasons for such a radical step, the OpenSea team admitted that continued support of BSC would not be resource-efficient in the long run:\n\nLast year we added several chains, including BNB Smart Chain (BSC), after seeing excitement from the wider NFT ecosystem. But as our space evolves, we need to align resources with the most promising efforts. We've decided the cost to continue supporting BSC outweighs the impact\n\nHowever, the OpenSea team stressed its commitment to building multi-chain systems. Recently, it added support for Base, a novel Coinbase L2 platform on Ethereum (ETH), and Zora, an NFT-focused blockchain. Both Base and Zora are developed on OP Stack, an Optimism open source framework.\n\nOpenSea was one of the first multi-blockchain marketplaces in Web3 history. It works on Optimism, Polygon, BNB Smart Chain, Arbitrum, Base, Ethereum, Solana, Avalanche and Klaytn, according to the DappRadar tracker.\n\nAs covered by U.Today previously, in 2023, the Blur marketplace dethroned OpenSea from its leading position in the NFT trading platforms race.\n\nOpenSea's royalties policy upgrade faces backlash\n\nAmid the painful drop in NFT trading volume that stole over 90% of its turnover, Blur remains the only platform that sees all its metrics rocketing.\n\nBesides removing BSC support, OpenSea also adjusted its royalties policy. Starting from Aug. 31, 2023, the platform will remove the Operator Filter and make royalties optional for all newly-created collections.\n\nThis reform was met with adamant criticism from some of the industry heavyweights. For instance, OpenSea investor Marc Cuban called the update \"a huge mistake.\"\n\nNot collecting and paying royalties on NFT sales is a HUGE mistake by @opensea. It diminished trust in the platform and hurts the industry. And I say this as an @opensea investor @DevinFinzer — Mark Cuban (@mcuban) August 18, 2023\n\nSome NFT development studios shared plans to sunset their collections on OpenSea due to the new fees policy."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vc29sYW5hLXBvd2VyZWQtaGVsaXVtLWhudC1pbnRyb2R1Y2VzLWdhbWUtY2hhbmdpbmctbW9iaWxlLXBob25lLXBsYW4tZGlzcnVwdGluZy10ZWxlY29tLXdpdGgtYmxvY2tjaGFpbi_SAZABaHR0cHM6Ly93d3cuY3J5cHRvLW5ld3MtZmxhc2guY29tL3NvbGFuYS1wb3dlcmVkLWhlbGl1bS1obnQtaW50cm9kdWNlcy1nYW1lLWNoYW5naW5nLW1vYmlsZS1waG9uZS1wbGFuLWRpc3J1cHRpbmctdGVsZWNvbS13aXRoLWJsb2NrY2hhaW4vP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Solana-Powered Helium (HNT) Introduces Game-Changing Mobile Phone Plan: Disrupting Telecom with Blockchain - Crypto News Flash",
        "content": "Helium Mobile, which operates on the Helium Network, is offering unlimited text, talk, and data without a contract for $5 a month.\n\nHelium Mobile operates using a hybrid coverage model, which allows users to seamlessly roam onto the T-Mobile network when its signal is weak or unavailable.\n\nThe Solana (SOL) network made a historical milestone after the official launch of its mobile dubbed Saga smartphone in June last year. The flagship Saga smartphone was unveiled with several unique capabilities to enable a seamless adoption of Web3 opportunities for all.\n\nThe Solana network went ahead to make a strategic partnership with Helium (HNT) earlier this year to enable fast development of Web3 products. Notably, the Helium network has a subsidiary dubbed the Helium Mobile, a crypto carrier that taps on the 5G network prowess to connect the participants.\n\nWith Helium mobile, the Solana ecosystem is guaranteed to ensure decentralized communication amid mainstream blockchain and cryptocurrency adoption.\n\nHelium Mobile Unveils $5 Monthly Unlimited Plan\n\nHelium Mobile announced the launch of its unique mobile connectivity starting with residents of Miami-Dade County, whereby users will part with only $5 per month for unlimited text, talk, and data. The company noted that the monthly cost is about 95 percent lower than most people pay for their monthly connectivity. The Helium Mobile network is backed by the 5G connectivity offered through a strategic partnership with T-Mobile telecommunication company.\n\nWe’re excited to announce the launch of Helium Mobile’s $5 Unlimited Plan! 🖐️ $5 for REAL? That’s right. Available TODAY. Exclusively in Miami 🌴 #hi5 How’s this even possible? Read all about it here: https://t.co/SdeHI7PA6a pic.twitter.com/kTd90pYHcS — Helium Mobile (@helium_mobile) August 15, 2023\n\nNotably, Helium Mobile operates using a hybrid coverage model, which allows users to seamlessly roam onto the T-Mobile network when Helium Mobile’s signal is weak or unavailable. Moreover, the Helium Mobile network is operating with just 6,600 radios dispersed across the United States, which is estimated to cover less than 1 percent of the nation’s land area.\n\nThe company highlighted that subscribers have the option to earn crypto rewards by opting into sharing location data. This provides extra incentive to switch and helps Helium\n\nMobile identify where additional radios will enhance network coverage. Furthermore, the company has plans to scale its services across the United States and other global markets as 5G is slowly rolled out. The company noted that it will automatically upgrade all the Beta users who helped during the testing period to the $5 monthly unlimited plan.\n\n“Coming out of Beta, we’re rolling out Helium Mobile in one city to ensure we provide the best service for our subscribers and can expand people-built coverage locally. It also gives us the ability to organically grow subscribers by fostering a community built by word-of-mouth and bringing down customer acquisition costs altogether,” Helium Network noted in the announcement.\n\nMarket Outlook\n\nThe official launch of the $5 monthly unlimited plan for the Helium network coincided with the August Bitcoin meltdown that took down with it the entire altcoin industry. According to our latest crypto market data, Helium (HNT) price traded around $1.8 on Friday, up approximately 14 percent in the past 4 weeks. Solana (SOL) price on the other hand was down approximately 17 percent in the past four weeks to trade at about $22 on Friday.\n\nRecommended for you:"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2V1cm93ZWVrbHluZXdzLmNvbS8yMDIzLzA4LzE5L2NoYXRncHQtcGxhY2VzLXNoaWJhLWludS1zaGliLXNvbGFuYS1zb2wtYW5kLXBvbWVyZG9nZS1wb21kLWFzLXRvcC10b2tlbnMtd2l0aC1oaWdoLWdyb3d0aC1wb3RlbnRpYWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 19 Aug 2023 07:00:00 GMT",
        "title": "Shiba Inu (SHIB), Solana (SOL), and Pomerdoge (POMD): Top Cryptocurrencies with High-Growth Potential, as per ... - Euro Weekly News",
        "content": "By Guest Writer • Published: 19 Aug 2023 • 17:38\n\nImage: Pomerdoge\n\nAccording to ChatGPT, the AI chatbot, three tokens have captured the attention of both seasoned traders and newcomers: Shiba Inu (SHIB), Solana (SOL), and Pomerdoge (POMD). With innovative features, strong communities, and promising developments, these tokens are worth keeping a close eye on.\n\nSummary\n\nShiba Inu and its journey becoming a full-fledged ecosystem\n\nSolana outpaces both XRP and Dogecoin in liquidity on Coinbase\n\nPomerdoge to dominate the blockchain gaming industry\n\nShiba Inu (SHIB): An Outstanding Meme-Coin\n\nShiba Inu (SHIB) made waves as a “meme coin” that garnered significant attention due to its resemblance to Dogecoin. However, Shiba Inu has evolved beyond its meme status with a rapidly growing ecosystem. Moreover, the recent launch of Shibarium, a layer-2 blockchain network, is a testament to the project’s ambition, as per ChatGPT.\n\nDespite some technical challenges, the potential of Shibarium to transform Shiba Inu into an ecosystem has caught trader interest. The Shiba Inu price currently sits at $0.000008594 with a market cap of $5B.\n\nAs the project continues to develop, Shiba Inu’s ability to rebound and surge in value remains a possibility. Thus, experts remain bullish for the Shiba Inu coin. As a result, market experts forecast a surge to $0.00001078 for Shiba Inu by the end of 2023.\n\nSolana (SOL): The Scalability Star\n\nChatGPT says Solana (SOL) has positioned itself as a leading player in blockchain scalability and speed. Its ability to handle a high volume of transactions quickly and cost-effectively has drawn the attention of developers and users alike.\n\nIn recent Solana news, it has surged to become one of the most liquid altcoins on Coinbase, as per Kaiko. As a matter of fact, the Solana crypto outpaced XRP (XRP) and Dogecoin (DOGE) on this metric.\n\nCurrently, Solana is trading hands at $23.23 with a market cap of $9.4B, up 0.24% overnight. Moreover, most of its moving averages are green. Therefore, prominent analysts predict a $29.22 price point for Solana by December 2023.\n\nPomerdoge (POMD): Gaming and Cryptocurrency Mix\n\nThe blockchain gaming industry has grown by 2,000% since Q1 2022, and Pomerdoge (POMD) has taken note. At its core, Pomerdoge and its Play-to-Earn (P2E) crypto game Pomergame empower users to enjoy immersive gameplay and earn rewards in the form of cryptocurrency.\n\nAs per ChatGPT, the Pomerdoge ecosystem has many components bound to excite countless gamers. Firstly, the Pomerplace marketplace can be accessed once users’ characters reach the gold level. In this marketplace, you can purchase or sell valuable items collected during gameplay.\n\nSecondly, the Pomerplace arena provides thrilling battles where users can battle other gamers. And finally, the exclusive 7,777 Pomerdgoe NFT collection will only be available to POMD token holders. While we do not know the benefits of holding these NFTs, excitement is high as buyers are now flocking to the POMD presale.\n\nIt makes sense, as POMD is now worth just $0.008 since it is in Phase One of its presale. But, ChatGPT pointed out that as the presale advances, so will the price. Also, some experts even predict a 17x surge in its price before the presale ends. Those who purchase it now will make excellent gains while participating in giveaways totalling $150,000.\n\nFind out more about the Pomerdoge (POMD) Presale Today\n\nWebsite: https://pomerdoge.com/\n\nTelegram Community: https://t.me/pomerdoge\n\nSponsored\n\nWARNING: The investment in crypto assets is not regulated, it may not be suitable for retail investors and the total amount invested could be lost\n\nAVISO IMPORTANTE: La inversión en criptoactivos no está regulada, puede no ser adecuada para inversores minoristas y perderse la totalidad del importe invertido"
    }
]