[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NvbGFuYS1kZWZpLWFjaGlldmVzLTIwNC15dGQtZ3Jvd3RoLWFtaWQtMTAtc29sLXByaWNlLXJhbGx5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Solana DeFi achieves 204% YTD growth amid 10% SOL price rally - CryptoSlate",
        "content": "Decentralized finance (DeFi) activities on the Solana blockchain touched a significant milestone as the total value of assets locked (TVL) reached a new yearly peak, coinciding with a reversal in the asset’s price trend.\n\nData from CryptoSlate shows that SOL price rallied by more than 10% during the last 24 hours to reclaim the $60 level. The digital asset was trading for $61.07 as of press time.\n\nTVL growth\n\nThe price increase pushed Solana’s TVL to more than $640 million, signifying a growth of around $40 million or a 5.27% increase in the past 24 hours, according to DeFillama data. This ascent has propelled Solana to the 8th spot among the top 10 performing DeFi chains, accompanied by an 8% growth over the past week.\n\nThe growth reflects a year-long positive trajectory for Solana’s DeFi ecosystem, whose TVL had grown by 204% on the year-to-date metrics, from the $210.47 million recorded on Jan. 1 to its current position.\n\nHowever, despite this growth, the TVL remains substantially lower than its all-time high of over $10 billion recorded in 2021.\n\nHigh network activity\n\nDeFillama data shows that decentralized exchange (DEX) trading volume activity on Solana has been at its highest level for the first time since November last year, when the network began to suffer from exposure to the collapsed FTX exchange.\n\nData from Artemis further shows that the increasing DEX volume also coincides with Solana hitting a three-month high in daily transactions. On Nov. 24, the blockchain network’s daily transactions volume surged to 51.36 million.\n\nThese rising metrics corroborate a recent CryptoSlate Research report, which pointed out that the network saw a solid influx of new users and high network activity.\n\nAdditionally, the increased network activity denotes a rising influx of investors and a heightened interest in the Solana DeFi ecosystem. During the past year, the blockchain scored notable partnerships with traditional finance entities such as Visa, Shopify, and others, further bolstering its use and adoption.\n\nMentioned in this article"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90b3Atc29sYW5hLXNvbC1wcmljZS1wcmVkaWN0aW9ucy13aGF0LXRvLWxvb2stZm9yLWluLXRoZS1jb21pbmctbW9udGhzL9IBZGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90b3Atc29sYW5hLXNvbC1wcmljZS1wcmVkaWN0aW9ucy13aGF0LXRvLWxvb2stZm9yLWluLXRoZS1jb21pbmctbW9udGhzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Top Solana (SOL) Price Predictions: What to Look For in the Coming Months? - CryptoPotato",
        "content": "TL;DR\n\nSolana (SOL) has seen a recent surge, trading above $60 with significant gains in the last month, nearing its yearly high.\n\nAnalysts predict a bright future for SOL, with targets ranging from $63 in the short term to as high as $1,000, as suggested by Crypto King and Jacob Canfield.\n\nThere’s speculation about SOL potentially surpassing Ripple (XRP) in market capitalization, with factors like community sentiment and regulatory developments influencing this possibility.\n\nHow High Can SOL Spike?\n\nSolana’s native token – SOL – is once again among the top performers in the cryptocurrency market, with its price recently surging above $60 (per CoinGecko’s data). The coin’s valuation has jumped 9% in the past 24 hours and 75% in the last 30 days.\n\nDespite still being slightly below its yearly high of approximately $67 (reached in mid-November), some analysts have forecasted that the asset is on the verge of climbing fresh peaks. One individual who shares that thesis is the X (Twitter) user Crypto King.\n\nExpecting the token to rise to $63 in the short term, the analyst also thinks the asset is poised for a surge toward a new all-time high of as high as $300 in the long run.\n\nThe crypto trader Jacob Canfield has also previously outlined an optimistic future for SOL, envisioning its price to explode to a whopping $1,000. He also counseled people to diversify and invest in both Ethereum and Solana:\n\n“No reason not to have allocations to both. It’s like trying to bet on Microsoft or Google. Tesla or Ford. Just buy both.”\n\nCan SOL Flip XRP?\n\nSolana (SOL) is currently the sixth-largest cryptocurrency by market capitalization, while Ripple (XRP) is in the fifth spot. The rapid price increase of the former might have prompted some crypto participants to speculate whether it could surpass its rival next year.\n\nAccording to ChatGPT, such a flippening is not entirely out of the cards and depends on multiple crucial factors such as the overall sentiment across the community, investor sentiment, partnerships, and others.\n\nThe AI-powered language model estimated that potential regulatory developments could also play a major role. For example, Ripple’s possible decisive win against the US Securities and Exchange Commission (SEC) might fuel a price rally for XRP, decreasing SOL’s chances to step into the fifth position."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LmJhbmtsZXNzLmNvbS9zb2xhbmEtYWlyZHJvcC1zZWFzb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Is Solana Airdrop Season Here? - Bankless",
        "content": "Solana stimmy szn has arrived!\n\nOracle network Pyth and DEX aggregator Jupiter unveiled airdrop programs at the start of the month and Solana’s largest tokenless protocol, liquid staking platform Jito, announced its token on Monday.\n\n6. Finally, 10% of the total $JTO supply will be retrospectively airdropped to Jito community members as a recognition of their contribution to bootstrapping the network and to ensure they can participate in governance from day one. — Jito (@jito_sol) November 27, 2023\n\nWith three major projects committed to airdropping tokens to users, is a flood of wealth to ecosystem participants going to be enough to rehydrate Solana's DeFi ecosystem, whose TVL is drier than the Sahara?\n\nToday, we're discussing the implications of these airdrops and asking whether this is only the beginning of airdrop mania on Solana 👀\n\n🧐 Underperforming TVL\n\nMarket participants have been eager to scoop up SOL throughout 2023, yet their insatiable appetite to bid the token up has not developed into a desire to participate in Solana's DeFi ecosystem.\n\nWhile SOL has rallied 500% year-to-date, price growth has vastly outpaced TVL growth.\n\nThe 200% rally in Solana's USD-denominated TVL may appear impressive, but it remains below the pre-FTX collapse low watermark of $1B and is a band-aid on SOL-denominated TVL, which is down 45% on the year!\n\n📖 Solana's Next Chapter\n\nTop Solana protocols are set to distribute tokens to their most active onchain users via airdrop. As newly acquired tokens are injected across Solana, the resulting TVL infusion will help increase the valuation of the entire Solana ecosystem.\n\nThe arrival of airdrops on Solana may not allow TVL to outperform price, as the two are positively correlated metrics, but it should place upward pressure on both numbers and could be the force that actually allows SOL-denominated TVL to grow in 2024!\n\nDemonstrating the ability of airdrops to attract TVL is the abrupt rise of Blast, an L2 offering \"points\" to those who deposit funds into a multi-sig prior to the project's February mainnet launch. Despite launching last week and not having a product, Blast's TVL managed to briefly surpass that of Solana.\n\nBlast now has more TVL in a week than the most hyped VC chain in history after 4 years https://t.co/4Tr8YWhyp0 pic.twitter.com/ySyoLdEF7a — Evan Van Ness 🧉 (@evan_van_ness) November 28, 2023\n\nThe arrival of airdrops is a key component in kicking off a potential Solana supercycle and is one of the easiest ways to onboard users to the chain!\n\nUsers of EVM chains are eligible for the Pyth airdrop. To claim it, however, they had to download a Solana native wallet to receive their Solana native asset, which could then be used within Solana native DeFi protocols. EVM recipients of the PYTH airdrop may represent net new users for Solana!\n\nAirdropping tokens also helps get eyes on projects, and coverage of Solana airdrops alerts users and developers that cool applications exist on the chain. This goes a long way in representing Solana as a viable ecosystem and alternative to Ethereum.\n\n⏭️ Takeaways\n\nThe arrival of \"Solana Stimmy Szn\" may herald the rebirth of Solana's DeFi ecosystem, but this outcome is far from assured, and while top-tier projects may be gearing up for large airdrops, the number of successful and innovative Solana protocols that can airdrop tokens is few and far between.\n\nLiquidity remains on Ethereum, referenced by the ability of protocols like Blast to attract hundreds of millions in TVL with little more than a vague promise of an airdrop and questionable innovation, incentivizing developers to build there. As a result, Solana will be fighting an uphill battle for protocols, liquidity, and users.\n\nThanks to its low-fee environment, global state machine, and ability to provide consensus at the speed of light, Solana promises to unlock a new frontier of applications not possible on Ethereum; hopefully, they will come soon!\n\nWhile the hype cycle of airdrops and their resulting wealth effect will likely be enough to attract new ecosystem participants to Solana and bolster key stats, to realize success from airdrops, Solana must nurture its own DeFi ecosystem and have a wide array of protocols ready to airdrop tokens.\n\nPerhaps airdrops will be the fuel to incept another wave of Solana protocols; however, tragically, the current depth of tokenless protocols on the network of size is less than impressive, greatly diminishing the benefit that airdrops could have on the Solana ecosystem."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvZGVzcGl0ZS1tYXNzaXZlLWdhaW5zLXNvbGFuYS1zb2wtY291bGQtanVzdC1iZS1nZXR0aW5nLXN0YXJ0ZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Despite Massive Gains, Solana (SOL) Could Just be Getting Started - Nasdaq",
        "content": "Top cryptocurrencies like Bitcoin (BTC-USD) and Ethereum (ETH-USD) have bounced back in a big way in 2023, with year-to-date gains of 123% and 69%, respectively. Beyond the two largest cryptos, other assets like Solana (SOL-USD) have done even better. Solana is up 387% so far in 2023, but the party could just be getting started.\n\nI’m bullish on Solana’s long-term potential based on its impressive performance metrics, the explosive growth of usage and activity on the Solana blockchain, and its relatively low market cap versus its peer, Ethereum.\n\nStellar Metrics\n\nSolana is a proof-of-stake layer-1 blockchain, like Ethereum. To be fully transparent, I own both Solana and Ethereum, and I am bullish on both, so the following comparison between the two networks is simply meant to illustrate the potential value of Solana.\n\nEthereum is the second-largest cryptocurrency by market cap, but Solana features several notable advantages from a user perspective. While Ethereum is averaging a throughput of under 30 transactions per second (TPS), Solana features an exponentially higher throughput of 65,000 transactions per second.\n\nThis high throughput leads to faster transaction times. Transactions on Solana are often completed in a matter of seconds, whereas transactions on Ethereum can take five minutes or more to process at times (the average is between 15 seconds to five minutes).\n\nMeanwhile, high transaction costs, or \"gas fees,\" have been one of the main gripes Ethereum users have had about the network for a long time. At writing, Ethereum's gas fees have hit their highest levels in six months and are averaging over $30 per transaction, making it cumbersome and expensive to use the network for routine transactions.\n\nIn contrast, transactions on Solana cost less than a penny. This makes Solana an appealing option for users who want to make low-cost transactions. If you want to buy a nonfungible token (NFT) for $40 or send a friend $20, paying $30 in gas on Ethereum isn't practical, whereas a transaction fee of under a penny on Solana is hardly noticeable. These low costs could help Solana appeal to more users as cryptocurrency reaches wider adoption.\n\nThis massive throughput, low cost, and fast transaction time led Bank of America (NYSE:BAC) analysts to declare that Solana could be \"the Visa (NYSE:V) of the digital asset ecosystem\" earlier this year.\n\nWhile the Solana blockchain’s performance is impressive, it could get even better. Solana users are awaiting the launch of Firedancer, a new validator in development that will reportedly increase Solana’s throughput to a mind-blowing one million transactions per second.\n\nUsage Explodes\n\nThis positive user experience has led to an explosion in usage for Solana. Crypto publication The Defiant recently reported that “Solana is having its best month ever” in terms of trading volume and total value locked.\n\nVolume on decentralized exchanges (DEXs) on Solana hit an all-time high of $5.1 billion in November, smashing the previous record of $2.8 billion last November.\n\nSolana’s total value locked (TVL) -- essentially a measure of how much value users have committed to or locked up in the network -- has jumped from $427 million at the start of November to $610 million currently, indicating growing confidence in the Solana network by crypto users.\n\nOn November 11th, the number of daily active users (DAUs) on Solana even surpassed those of the much larger Ethereum, with 356,300 users for the day versus 330,000 for Ethereum.\n\nIncreasing Collaborations and Partnerships\n\nAdditionally, Solana has made significant headway in terms of corporate partnerships and tie-ups with other crypto projects.\n\nIn August, Shopify (NYSE:SHOP) announced an integration with Solana Pay, which would make using Solana a new payment option on the platform. Then, as if that wasn’t enough, in September, Visa announced that it would use Solana to facilitate USDC (USDC-USD) stablecoin transactions.\n\nFurthermore, some interesting crypto projects, like Helium and Render (RNDR-USD), are migrating to Solana. Render, which seeks to provide decentralized GPU computing power for 3D content creation, migrated from Ethereum to Solana earlier in November. Render founder Jules Urbach said that Render made the move because of Solana’s “incredible transaction speeds, low costs, and commitment to web-scale architecture.”\n\nMeanwhile, Helium, which is focused on providing decentralized WiFi, made the move from its own layer-1 blockchain to Solana to free up its developers from having to focus on maintaining their own blockchain and leverage Solana's fast transaction times.\n\nLooking Ahead\n\nSolana’s enormous throughput, fast transaction times, and minuscule transaction fees have attracted more users to the network. As a result, activity on the Solana blockchain is experiencing a Cambrian explosion, as seen in the significant increase in DEX volume, total value locked, and daily active users.\n\nNone of this is to say that Solana will displace or disrupt Ethereum (and again, I am bullish on both). It should be noted that Ethereum is working on upgrades that could improve its throughput and lower gas fees. Still, these impressive stats are even more notable when considering that Solana has a market cap of just $23 billion versus Ethereum’s considerably higher market cap of $239 billion.\n\nWith performance metrics that are ahead of Ethereum’s and user numbers that are rapidly growing, Solana looks like it offers considerable value with a market cap that is just one-tenth the size of Ethereum’s.\n\nCryptocurrencies are a high-risk investment and can be extremely volatile. But for risk-tolerant investors who are interested in cryptocurrency and investing in the likes of Bitcoin and Ethereum, it could make sense to add exposure to Solana while it has just one-tenth of Ethereum's market value.\n\nDisclosure\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvZGVzcGl0ZS1tYXNzaXZlLWdhaW5zLXNvbGFuYS1zb2wtY291bGQtanVzdC1iZS1nZXR0aW5nLXN0YXJ0ZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Despite Massive Gains, Solana (SOL) Could Just be Getting Started - Nasdaq",
        "content": "Top cryptocurrencies like Bitcoin (BTC-USD) and Ethereum (ETH-USD) have bounced back in a big way in 2023, with year-to-date gains of 123% and 69%, respectively. Beyond the two largest cryptos, other assets like Solana (SOL-USD) have done even better. Solana is up 387% so far in 2023, but the party could just be getting started.\n\nI’m bullish on Solana’s long-term potential based on its impressive performance metrics, the explosive growth of usage and activity on the Solana blockchain, and its relatively low market cap versus its peer, Ethereum.\n\nStellar Metrics\n\nSolana is a proof-of-stake layer-1 blockchain, like Ethereum. To be fully transparent, I own both Solana and Ethereum, and I am bullish on both, so the following comparison between the two networks is simply meant to illustrate the potential value of Solana.\n\nEthereum is the second-largest cryptocurrency by market cap, but Solana features several notable advantages from a user perspective. While Ethereum is averaging a throughput of under 30 transactions per second (TPS), Solana features an exponentially higher throughput of 65,000 transactions per second.\n\nThis high throughput leads to faster transaction times. Transactions on Solana are often completed in a matter of seconds, whereas transactions on Ethereum can take five minutes or more to process at times (the average is between 15 seconds to five minutes).\n\nMeanwhile, high transaction costs, or \"gas fees,\" have been one of the main gripes Ethereum users have had about the network for a long time. At writing, Ethereum's gas fees have hit their highest levels in six months and are averaging over $30 per transaction, making it cumbersome and expensive to use the network for routine transactions.\n\nIn contrast, transactions on Solana cost less than a penny. This makes Solana an appealing option for users who want to make low-cost transactions. If you want to buy a nonfungible token (NFT) for $40 or send a friend $20, paying $30 in gas on Ethereum isn't practical, whereas a transaction fee of under a penny on Solana is hardly noticeable. These low costs could help Solana appeal to more users as cryptocurrency reaches wider adoption.\n\nThis massive throughput, low cost, and fast transaction time led Bank of America (NYSE:BAC) analysts to declare that Solana could be \"the Visa (NYSE:V) of the digital asset ecosystem\" earlier this year.\n\nWhile the Solana blockchain’s performance is impressive, it could get even better. Solana users are awaiting the launch of Firedancer, a new validator in development that will reportedly increase Solana’s throughput to a mind-blowing one million transactions per second.\n\nUsage Explodes\n\nThis positive user experience has led to an explosion in usage for Solana. Crypto publication The Defiant recently reported that “Solana is having its best month ever” in terms of trading volume and total value locked.\n\nVolume on decentralized exchanges (DEXs) on Solana hit an all-time high of $5.1 billion in November, smashing the previous record of $2.8 billion last November.\n\nSolana’s total value locked (TVL) -- essentially a measure of how much value users have committed to or locked up in the network -- has jumped from $427 million at the start of November to $610 million currently, indicating growing confidence in the Solana network by crypto users.\n\nOn November 11th, the number of daily active users (DAUs) on Solana even surpassed those of the much larger Ethereum, with 356,300 users for the day versus 330,000 for Ethereum.\n\nIncreasing Collaborations and Partnerships\n\nAdditionally, Solana has made significant headway in terms of corporate partnerships and tie-ups with other crypto projects.\n\nIn August, Shopify (NYSE:SHOP) announced an integration with Solana Pay, which would make using Solana a new payment option on the platform. Then, as if that wasn’t enough, in September, Visa announced that it would use Solana to facilitate USDC (USDC-USD) stablecoin transactions.\n\nFurthermore, some interesting crypto projects, like Helium and Render (RNDR-USD), are migrating to Solana. Render, which seeks to provide decentralized GPU computing power for 3D content creation, migrated from Ethereum to Solana earlier in November. Render founder Jules Urbach said that Render made the move because of Solana’s “incredible transaction speeds, low costs, and commitment to web-scale architecture.”\n\nMeanwhile, Helium, which is focused on providing decentralized WiFi, made the move from its own layer-1 blockchain to Solana to free up its developers from having to focus on maintaining their own blockchain and leverage Solana's fast transaction times.\n\nLooking Ahead\n\nSolana’s enormous throughput, fast transaction times, and minuscule transaction fees have attracted more users to the network. As a result, activity on the Solana blockchain is experiencing a Cambrian explosion, as seen in the significant increase in DEX volume, total value locked, and daily active users.\n\nNone of this is to say that Solana will displace or disrupt Ethereum (and again, I am bullish on both). It should be noted that Ethereum is working on upgrades that could improve its throughput and lower gas fees. Still, these impressive stats are even more notable when considering that Solana has a market cap of just $23 billion versus Ethereum’s considerably higher market cap of $239 billion.\n\nWith performance metrics that are ahead of Ethereum’s and user numbers that are rapidly growing, Solana looks like it offers considerable value with a market cap that is just one-tenth the size of Ethereum’s.\n\nCryptocurrencies are a high-risk investment and can be extremely volatile. But for risk-tolerant investors who are interested in cryptocurrency and investing in the likes of Bitcoin and Ethereum, it could make sense to add exposure to Solana while it has just one-tenth of Ethereum's market value.\n\nDisclosure\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]