[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9uZXdzL3N0b3J5LzIwMjMtMDUtMDEvc29sYW5hLXJhbmNoLXN0dWRlbnQtZXhjZWwtYXQtbmF0aW9uYWwtaGlzdG9yeS1kYXktY29tcGV0aXRpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "Solana Ranch students excel at National History Day competition - Del Mar Times",
        "content": "Students from Solana Ranch Elementary School had great success in this year’s National History Day competition held at the San Diego County Office of Education.\n\nSix separate research teams from Solana Ranch won their category at the San Diego County level and earned the opportunity to compete in Sacramento at the California State Championship on April 15-16. Fifth grader Chloe Cameron became the California State Champion for her research project titled “New Frontiers in Equality: The American with Disabilities Act.”\n\nState champion Chloe Cameron. (Jordan Einbinder)\n\nNational History Day is an academic competition where students across the entire United States conduct an historical research project on a common theme. The 2022-23 theme was “Frontiers in History”. Over a three-month period, students carried out in-depth research, exploring primary sources while accessing specialized archives and library special collections, and interviewing expert academics in their particular field of study. Teachers Jordan Einbinder and Natalie Stomsvik served as coaches.\n\nSan Diego County winners from Solana Ranch included Arjun Jain and Samarth Sharma for their podcast “Dadasaheb Phalke and the Invention of Bollywood: Crossing Frontiers of Filmography in India.”\n\nElena Zhu and Karissa Luo were winners in the elementary group poster division for “Frontiers in Wildlife Protection: The Migratory Bird Treaty 1918”.\n\nLucas Chen, Nathaniel Wang, and Minwoo Tak\n\n(Jordan Einbinder\n\n)\n\nDarius Tabarsi, Evan Hong and Ian Shin won the junior website category for their project called “Smallpox Vaccine: New Frontiers in Public Health.”\n\nLucas Chen, Minwoo Tak and Nathaniel Wang won the elementary group poster division for ” The Invention of the Model T: Frontiers in Production”.\n\nAllison Zhang, Charles Wu and Sophia Hua were also county winners in the poster division for their project “Frontiers in Environmental Preservation: Endangered Species Act.”"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9waGFudG9tLXNvbGFuYS13YWxsZXQtYWRkcy1ldGhlcmV1bS0yMjE1MTYwNjYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "Phantom Solana Wallet Adds Ethereum and Polygon Support - Yahoo Finance",
        "content": "Self-custodial wallet Phantom announced today that simultaneous support for Ethereum and Polygon networks is live on its mobile app and browser wallets, widening users' access to dApps across the Web3 landscape, including Magic Eden, Uniswap, Aave, blur, and OpenSea.\n\nThe popular Solana wallet first announced support for rival blockchains Ethereum and Polygon in November, with the aim of providing the ability to interact with the three largest blockchains for digital collectibles in one place.\n\n\"We are dedicated to leveraging our expertise from the Solana ecosystem to drive innovation in the wallet space... in order to deliver the most versatile and user-friendly experience across all platforms,\" Phantom CEO Brandon Millman tells Decrypt, especially \"the three most prominent ecosystems: Ethereum, Polygon, and Solana.\"\n\nThe company says the new features will simplify managing multiple accounts and assets across blockchains, removing the requirement to switch between wallets and adding the ability to import existing MetaMask, Solana, and EVM wallets.\n\n\"As crypto continues to go multichain, our wallet stands out as the premier choice for users,\" Millman said.\n\nInitially launched in March 2021, Phantom launched its iOS wallet in January 2022 after raising $109 million in funding. This was followed by the launch of an Android version of the Phantom wallet in April of last year.\n\nPhantom Solana Wallet Adds Support for Ethereum and Polygon\n\n1/ Phantom multichain is rolling out today! 🥳 Now you can use @ethereum, @0xPolygon, and @solana without switching wallets. With support for multiple secret recovery phrases, it’s easy to import all of your wallets in seconds. Compatible everywhere with a MetaMask button. pic.twitter.com/wbvwmZ1ZlJ — Phantom (@phantom) May 1, 2023\n\nThe Phantom wallet has onboarded over 100,000 users since its Ethereum and Polygon support beta last fall, the company says.\n\nAside from broadening its user base with these additions, Phantom has also stepped up its security measures in light of a rise in phishing and scam attacks on NFT holders, including Kevin Rose and Seth Green. In January, Phantom said it had scanned over 85 million transactions and blocked over 18,000 wallet-draining transactions.\n\nStory continues\n\nFuture plans, Phantom said, are the introduction of instant NFT sales and the development of a bridge to enable the transfer of assets between the Solana and Ethereum networks.\n\n“We believe that the future of digital asset management lies in cross-chain interoperability,” Brandon Millman, co-founder, and CEO of Phantom, said in a statement. “We’re committed to providing our users with the tools and resources they need to easily navigate and transact across various blockchain networks.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9waGFudG9tLXNvbGFuYS13YWxsZXQtYWRkcy1ldGhlcmV1bS0yMjE1MTYwNjYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "Phantom Solana Wallet Adds Ethereum and Polygon Support - Yahoo Finance",
        "content": "Self-custodial wallet Phantom announced today that simultaneous support for Ethereum and Polygon networks is live on its mobile app and browser wallets, widening users' access to dApps across the Web3 landscape, including Magic Eden, Uniswap, Aave, blur, and OpenSea.\n\nThe popular Solana wallet first announced support for rival blockchains Ethereum and Polygon in November, with the aim of providing the ability to interact with the three largest blockchains for digital collectibles in one place.\n\n\"We are dedicated to leveraging our expertise from the Solana ecosystem to drive innovation in the wallet space... in order to deliver the most versatile and user-friendly experience across all platforms,\" Phantom CEO Brandon Millman tells Decrypt, especially \"the three most prominent ecosystems: Ethereum, Polygon, and Solana.\"\n\nThe company says the new features will simplify managing multiple accounts and assets across blockchains, removing the requirement to switch between wallets and adding the ability to import existing MetaMask, Solana, and EVM wallets.\n\n\"As crypto continues to go multichain, our wallet stands out as the premier choice for users,\" Millman said.\n\nInitially launched in March 2021, Phantom launched its iOS wallet in January 2022 after raising $109 million in funding. This was followed by the launch of an Android version of the Phantom wallet in April of last year.\n\nPhantom Solana Wallet Adds Support for Ethereum and Polygon\n\n1/ Phantom multichain is rolling out today! 🥳 Now you can use @ethereum, @0xPolygon, and @solana without switching wallets. With support for multiple secret recovery phrases, it’s easy to import all of your wallets in seconds. Compatible everywhere with a MetaMask button. pic.twitter.com/wbvwmZ1ZlJ — Phantom (@phantom) May 1, 2023\n\nThe Phantom wallet has onboarded over 100,000 users since its Ethereum and Polygon support beta last fall, the company says.\n\nAside from broadening its user base with these additions, Phantom has also stepped up its security measures in light of a rise in phishing and scam attacks on NFT holders, including Kevin Rose and Seth Green. In January, Phantom said it had scanned over 85 million transactions and blocked over 18,000 wallet-draining transactions.\n\nStory continues\n\nFuture plans, Phantom said, are the introduction of instant NFT sales and the development of a bridge to enable the transfer of assets between the Solana and Ethereum networks.\n\n“We believe that the future of digital asset management lies in cross-chain interoperability,” Brandon Millman, co-founder, and CEO of Phantom, said in a statement. “We’re committed to providing our users with the tools and resources they need to easily navigate and transact across various blockchain networks.”"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLWNyeXB0b2N1cnJlbmNpZXMtY291bGQtZGlzcnVwdC1maW5hbmNpYWwtMTgzNTExMDcwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "3 Cryptocurrencies That Could Disrupt the Financial Industry - Yahoo Finance",
        "content": "Cryptocurrencies were created with the express purpose of providing people with an alternative to traditional banks. The Bitcoin (BTC-USD) white paper came out after the 2008 financial crisis, and talks of the need to disrupt traditional finance with a digital system that can facilitate borrowing and lending ,but also offer benefits such as anonymity, security, and decentralization. From this idea sprung a blockchain-based alternative to traditional finance, now known as decentralized finance (DeFi).\n\nWhile still being refined, the development of DeFi has continued unabated, despite turmoil in the broader cryptocurrency sector. And some cryptos have emerged as leaders in the DeFi space. Cryptocurrencies that lead the way forward in decentralized finance are expected to have bright futures.\n\nWith that said, here are three cryptocurrencies that could disrupt the financial industry.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nETH-USD Ethereum $1,967 SOL-USD Solana $22.64 RENQ-USD RenQ Finance $0.045\n\nEthereum (ETH-USD)\n\nA coin with the Ethreum logo on top of a financial document\n\nSource: shutterstock\n\nA growing number of lending platforms, such as Aave (AAVE-USD), Maker (MKR-USD), and Curve (CRV-USD), are cropping up, each providing a blockchain-based alternative to traditional banking known as decentralized finance (DeFi). These DeFi platforms operate on the Ethereum (ETH-USD) blockchain network. Today, Ethereum is regarded as the most advanced, stable, and reliable cryptocurrency for DeFi. With Ethereum, users can hold a balance of funds like in a traditional bank account, make payments, and set interest rates and loan terms.\n\nEthereum’s usefulness in DeFi and disrupting the traditional financial industry has been boosted recently after the completion of the Shanghai hard fork, also known as the Shapella upgrade. The enhancement allows users to easily access ETH, potentially unlocking more than $30 billion of liquidity. The Shanghai hard fork has further boosted Ethereum’s price, which is up nearly 75% in 2023. Ethereum remains the blockchain of choice for investors intrigued by the growth in DeFi.\n\nSolana (SOL-USD)\n\nSolana logo on phone screen stock image. Solana price predictions.\n\nSource: sdx15 / Shutterstock.com\n\nSolana (SOL-USD) is another cryptocurrency whose blockchain can be used to facilitate decentralized finance (DeFi) transactions. Accordingly, Solana shares many similarities with Ethereum.\n\nThe one area where Solana has an advantage over ETH is when it comes to speed. Solana can validate financial transactions on its network at lightning speed. Currently, Solana can process 50,000 transactions per second, which is extremely fast compared to Ethereum’s 13 transactions per second.\n\nStory continues\n\nThe speed at which Solana can process thousands of financial transactions gives it an edge over Ethereum and traditional banks and credit card companies such as Visa (NYSE:V) and Mastercard (NYSE:MA). Developers behind Solana have launched Solana Pay, which provides a direct transaction connection between merchants and consumers. Solana Pay can be used without an intermediary such as a bank or credit union and charges no fees. This platform attracted more than 600 merchants within two months of its launch. Accordingly, it should be no surprise to investors that on a year-to-date basis, Solana’s price has increased approximately 125%.\n\nRenQ Finance (RENQ-USD)\n\nfuturistic image of a hand with the words block chain floating above it. representing riot blockchain stocks\n\nSource: Shutterstock\n\nA newer cryptocurrency on the block when it comes to DeFi is RenQ Finance (RENQ-USD). This crypto is built on a cutting-edge decentralized exchange that makes DeFi transactions simple and intuitive for users via its RenQ wallet app.\n\nLike most DeFi platforms, RENQ removes the need for intermediaries such as banks. However, it is also remarkably user-friendly, with an easy-to-use interface and efficient liquidity. Its simplicity is attracting a growing number of converts to RenQ Finance.\n\nRENQ is a newer cryptocurrenc,y and currently trades for only a few cents. It can also be volatile in its trading patterns. That said, RenQ Finance has gained more than 50% so far this year. Looking ahead, this is a crypto to watch, primarily when disrupting the traditional financial industry. Some analysts say that they expect RENQ to eventually challenge the likes of Ethereum and Solana in the decentralized finance space.\n\nSmall, low-volume cryptos\n\nOn Low-Capitalization and Low-Volume Cryptocurrencies: InvestorPlace does not regularly publish commentary about cryptocurrencies that have a market capitalization less than $100 million or trade with volume less than $100,000 each day. That’s because these “penny cryptos” are frequently the playground for scam artists and market manipulators. When we do publish commentary on a low-volume crypto that may be affected by our commentary, we ask that InvestorPlace.com’s writers disclose this fact and warn readers of the risks.\n\nRead More: How to Avoid Popular Cryptocurrency Scams\n\nOn the date of publication, Joel Baglole held a long position in V. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia.\n\nMore From InvestorPlace\n\nThe post 3 Cryptocurrencies That Could Disrupt the Financial Industry appeared first on InvestorPlace."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLWNyeXB0b2N1cnJlbmNpZXMtY291bGQtZGlzcnVwdC1maW5hbmNpYWwtMTgzNTExMDcwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "3 Cryptocurrencies That Could Disrupt the Financial Industry - Yahoo Finance",
        "content": "Cryptocurrencies were created with the express purpose of providing people with an alternative to traditional banks. The Bitcoin (BTC-USD) white paper came out after the 2008 financial crisis, and talks of the need to disrupt traditional finance with a digital system that can facilitate borrowing and lending ,but also offer benefits such as anonymity, security, and decentralization. From this idea sprung a blockchain-based alternative to traditional finance, now known as decentralized finance (DeFi).\n\nWhile still being refined, the development of DeFi has continued unabated, despite turmoil in the broader cryptocurrency sector. And some cryptos have emerged as leaders in the DeFi space. Cryptocurrencies that lead the way forward in decentralized finance are expected to have bright futures.\n\nWith that said, here are three cryptocurrencies that could disrupt the financial industry.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nETH-USD Ethereum $1,967 SOL-USD Solana $22.64 RENQ-USD RenQ Finance $0.045\n\nEthereum (ETH-USD)\n\nA coin with the Ethreum logo on top of a financial document\n\nSource: shutterstock\n\nA growing number of lending platforms, such as Aave (AAVE-USD), Maker (MKR-USD), and Curve (CRV-USD), are cropping up, each providing a blockchain-based alternative to traditional banking known as decentralized finance (DeFi). These DeFi platforms operate on the Ethereum (ETH-USD) blockchain network. Today, Ethereum is regarded as the most advanced, stable, and reliable cryptocurrency for DeFi. With Ethereum, users can hold a balance of funds like in a traditional bank account, make payments, and set interest rates and loan terms.\n\nEthereum’s usefulness in DeFi and disrupting the traditional financial industry has been boosted recently after the completion of the Shanghai hard fork, also known as the Shapella upgrade. The enhancement allows users to easily access ETH, potentially unlocking more than $30 billion of liquidity. The Shanghai hard fork has further boosted Ethereum’s price, which is up nearly 75% in 2023. Ethereum remains the blockchain of choice for investors intrigued by the growth in DeFi.\n\nSolana (SOL-USD)\n\nSolana logo on phone screen stock image. Solana price predictions.\n\nSource: sdx15 / Shutterstock.com\n\nSolana (SOL-USD) is another cryptocurrency whose blockchain can be used to facilitate decentralized finance (DeFi) transactions. Accordingly, Solana shares many similarities with Ethereum.\n\nThe one area where Solana has an advantage over ETH is when it comes to speed. Solana can validate financial transactions on its network at lightning speed. Currently, Solana can process 50,000 transactions per second, which is extremely fast compared to Ethereum’s 13 transactions per second.\n\nStory continues\n\nThe speed at which Solana can process thousands of financial transactions gives it an edge over Ethereum and traditional banks and credit card companies such as Visa (NYSE:V) and Mastercard (NYSE:MA). Developers behind Solana have launched Solana Pay, which provides a direct transaction connection between merchants and consumers. Solana Pay can be used without an intermediary such as a bank or credit union and charges no fees. This platform attracted more than 600 merchants within two months of its launch. Accordingly, it should be no surprise to investors that on a year-to-date basis, Solana’s price has increased approximately 125%.\n\nRenQ Finance (RENQ-USD)\n\nfuturistic image of a hand with the words block chain floating above it. representing riot blockchain stocks\n\nSource: Shutterstock\n\nA newer cryptocurrency on the block when it comes to DeFi is RenQ Finance (RENQ-USD). This crypto is built on a cutting-edge decentralized exchange that makes DeFi transactions simple and intuitive for users via its RenQ wallet app.\n\nLike most DeFi platforms, RENQ removes the need for intermediaries such as banks. However, it is also remarkably user-friendly, with an easy-to-use interface and efficient liquidity. Its simplicity is attracting a growing number of converts to RenQ Finance.\n\nRENQ is a newer cryptocurrenc,y and currently trades for only a few cents. It can also be volatile in its trading patterns. That said, RenQ Finance has gained more than 50% so far this year. Looking ahead, this is a crypto to watch, primarily when disrupting the traditional financial industry. Some analysts say that they expect RENQ to eventually challenge the likes of Ethereum and Solana in the decentralized finance space.\n\nSmall, low-volume cryptos\n\nOn Low-Capitalization and Low-Volume Cryptocurrencies: InvestorPlace does not regularly publish commentary about cryptocurrencies that have a market capitalization less than $100 million or trade with volume less than $100,000 each day. That’s because these “penny cryptos” are frequently the playground for scam artists and market manipulators. When we do publish commentary on a low-volume crypto that may be affected by our commentary, we ask that InvestorPlace.com’s writers disclose this fact and warn readers of the risks.\n\nRead More: How to Avoid Popular Cryptocurrency Scams\n\nOn the date of publication, Joel Baglole held a long position in V. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia.\n\nMore From InvestorPlace\n\nThe post 3 Cryptocurrencies That Could Disrupt the Financial Industry appeared first on InvestorPlace."
    }
]