[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTAyL3NvbGFuYS1zb2wtb25jZS1iYWNrZWQtYnktYmFua21hbi1mcmllZC1pcy1ub3cteWVhci1zLWJlc3QtcGVyZm9ybWVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Solana (SOL), Once Backed by SBF, Is Now Year’s Best Performing Large Token - Bloomberg",
        "content": "Almost a year after the demise of Sam Bankman-Fried’s crypto empire, one of the blockchain projects most associated with the now disgraced entrepreneur is emerging from under the cloud his downfall cast over the digital-asset world.\n\nSolana’s SOL token has surged about 340% to $41 in 2023, outdoing the 114% rally in market bellwether Bitcoin and becoming the best performing token among the largest cryptocurrencies tracked by Bloomberg. That follows a 94% drop last year as Bankman-Fried’s FTX and Alameda Research — two major backers of the project - collapsed into bankruptcy."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTAyL3NvbGFuYS1zb2wtb25jZS1iYWNrZWQtYnktYmFua21hbi1mcmllZC1pcy1ub3cteWVhci1zLWJlc3QtcGVyZm9ybWVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Solana (SOL), Once Backed by SBF, Is Now Year’s Best Performing Large Token - Bloomberg",
        "content": "Almost a year after the demise of Sam Bankman-Fried’s crypto empire, one of the blockchain projects most associated with the now disgraced entrepreneur is emerging from under the cloud his downfall cast over the digital-asset world.\n\nSolana’s SOL token has surged about 340% to $41 in 2023, outdoing the 114% rally in market bellwether Bitcoin and becoming the best performing token among the largest cryptocurrencies tracked by Bloomberg. That follows a 94% drop last year as Bankman-Fried’s FTX and Alameda Research — two major backers of the project - collapsed into bankruptcy."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LjEwbmV3cy5jb20vbmV3cy9sb2NhbC1uZXdzL3NvbGFuYS1iZWFjaC1kYW5jZS10cm91cGVzLWN1c3RvbS1tYWRlLWNvc3R1bWVzLXZhbmlzaC1kdXJpbmctcGVyZm9ybWFuY2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Solana Beach dance troupe's custom-made costumes vanish during performance - ABC 10 News San Diego KGTV",
        "content": "SOLANA BEACH, Calif. (KGTV) - Heartbreak for young dancers at a Dia de los Muertos event in Solana Beach, as a dance troupe's custom-made costumes disappeared while they performed.\n\nPhotos taken from that day of dancing two Sundays ago at a Solana Beach park show smiling faces and colorful costumes.\n\nBut when the music stopped, there was a wrenching discovery.\n\n“I was looking at everything, and of course, I start crying,” said Elba Montes.\n\nMontes, who founded Grupo Jalisciense Folklórico three decades ago, says her dancers had performed for about 10 minutes, when they headed back to their canopy area. Her young dancers were the first to notice.\n\nAll the students that want to perform said, ‘My clothes are not here,’” said Montes. “So, I’m looking right away for the suitcase. Nothing. All this disappeared.”\n\nA backpack and a suitcase were gone. Inside, some 20 necklaces, personal clothes, and five authentic Mexican dresses, custom-made and embroidered in a town in western Mexico. The total loss was more than $2,000.\n\nMontes had to break the news to five kids that they wouldn't be dancing.\n\n\"I say, ‘Sorry, you can’t perform, because they steal the costumes,’” said Montes.\n\nMontes' dance troupe is 25 dancers strong, with ages ranging from 3 to 59.\n\nBut most of her dancers are low-income youth, many of them with disabilities.\n\n\"When you see them performing, you feeling happy, because you make a difference in their lives,” said Montes.\n\nMontes filed a report with with deputies, but so far, there has been no sign of the costumes. For now, some of her kids won't be dancing.\n\n“At least five have to wait in the corner,” said Montes.\n\nMontes is now making a direct plea to the thief or thieves.\n\n“Please return it, because we need it … I want a miracle, a miracle,” said Montes.\n\nAnyone with information on the case can call Crime Stoppers at 888-580-8477,\n\nA Gofundme campaign has been set up to help cover the cost of new costumes.\n\n"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NvbGFuYS1qdXBpdGVyLXRva2VuLWFpcmRyb3DSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 16:33:08 GMT",
        "title": "Solana's Jupiter Exchange set for token launch - Blockworks",
        "content": "The Solana-based swap aggregator Jupiter Exchange is releasing a native token.\n\nAnnounced during the Solana Breakpoint conference, the news came with a pledge that a majority of the forthcoming JUP token will be released to the public via community airdrop and a token sale.\n\nJupiter is a swap aggregator, a platform used to gather liquidity for traders seeking the best possible prices with minimal slippage.\n\nThe protocol’s internal tracker reports $103 million in volume over the past 24 hours. Jupiter’s swap aggregation service has likely been buoyed by a recent uptick in Solana DeFi activity.\n\nRead more: Solana ‘roast’ reveals painful truths\n\n“Jupiter has been the leading DEX on Solana for quite some time. After the death of Serum due to the FTX collapse, JUP stands to fill that hole and offer a new opportunity for Solana DeFi,” Spencer Hughes, a Blockworks Research analyst, said.\n\n40% of the forthcoming JUP tokens will be airdropped to the Jupiter Exchange community, and around 955,000 users are eligible, according to the team’s slide deck from the event announcement. Twenty percent of the tokens will be distributed in a token sale, with the remaining 40% set to be distributed to insiders and a “strategic reserve.”\n\nJupiter will spend the next two weeks consulting with the community before setting a firm launch timeline, Jupiter’s pseudonymous cofounder Meow said in a Telegram message, adding that JUP will function as a governance token.\n\nJupiter’s token allocation announcement follows a similar move by Celestia, a data availability-focused blockchain. Around 53% of Celestia’s TIA tokens will go to early investors and core contributors, while 20% is allocated to the public.\n\nThe TIA community allocation will be fully available at the token’s launch, while the investors and core contributor allocations will be subject to gradual unlocks.\n\nJupiter Exchange also announced Thursday that it will integrate with Circle’s cross-chain transfer protocol.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vY3J5cHRvLm5ld3Mvd2h5LWV2ZXJ5b25lLWlzLXRhbGtpbmctYWJvdXQtc29sYW5hLWluLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Nov 2023 07:00:00 GMT",
        "title": "Why everyone is talking about Solana in 2023 - crypto.news",
        "content": "Solana surges in 2023, joining top blockchains with its unique tech, large user base, and promising price forecasts, challenging Ethereum’s dominance.\n\nAs of 2023, Solana (SOL) has earned its place among the top 3 layer-1 blockchains, sharing the spotlight with giants like Ethereum (ETH) and Binance Chain (BNB).\n\nWhat’s particularly intriguing is that while Solana’s market capitalization sits at about 7.5% of Ethereum’s at nearly $16.5 billion, its daily active user base stands at 66% of Ethereum’s, signaling an engaged and growing community.\n\nOver the last 30 days, SOL’s price experienced a remarkable increase of nearly 90%, with a substantial 30% growth occurring in just the previous week. This aligns with the debut of Firedancer, its highly awaited scaling solution, on the testnet.\n\nMoreover, this year has been kind to Solana, showcasing a marked improvement in metrics such as uptime and transactions per second. Coinbase, a prominent US crypto exchange, acknowledges Solana as a formidable contender to Ethereum in the layer-1 blockchain space.\n\nLet’s uncover the elements fueling Solana’s growth, understand what it is, dissect its technological advancements, and take a closer look at its expanding community and ecosystem.\n\nWhat is Solana, and how does it work?\n\nSolana, often abbreviated as SOL, is a high-performance layer-1 blockchain designed to support decentralized applications (dApps) and crypto projects at large scales.\n\nFor instance, a real-world application on Solana might be a decentralized exchange (DEX) where thousands of trades happen every second. The architecture of Solana facilitates the processing of these trades, aiming for efficiency, security, and accuracy.\n\nSolana introduces a mechanism known as proof of history (PoH), setting it apart from some traditional consensus methods. PoH is designed to generate a historical record to verify the occurrence of an event at a specific time.\n\nThis is achieved by encoding the passage of time in the data before it becomes a part of the ledger. The intention is to streamline the consensus-reaching process across nodes, as they have a shared, trusted notion of time.\n\nThis emphasis on time-saving is further realized in Solana’s Tower BFT, a byzantine fault-tolerant derivative of the Practical Byzantine Fault Tolerance (PBFT) consensus.\n\nTower BFT utilizes the synchronized clock provided by PoH to reduce messaging overhead and latency. This allows for faster confirmations of transactions without compromising on security.\n\nSolana also features the Gulf Stream protocol, which attempts to optimize transaction handling by pre-processing and sending them to validators prior to the completion of the previous transaction set. This approach is intended to reduce confirmation times and improve network efficiency.\n\nWhen considering all these mechanisms together, Solana aims to support a high volume of transactions per second, positioning itself as a competitive entity in the blockchain space.\n\nSolana’s tokenomics: understanding SOL’s role and distribution\n\nSolana’s financial structure is centered around its native token, SOL. This token has multiple functions within the network. The primary use of SOL is for transactions and for users to interact with dApps on the Solana platform.\n\nSimply put, if a user wants to carry out an operation or use a dApp on Solana, they need SOL.\n\nYou might also like: Solana close to 1-year high amid declining open interest\n\nStaking is another important function of SOL. Users can help secure the network by staking their SOL tokens. They can do this by either becoming validators themselves or by assigning their tokens to existing validators.\n\nThose who stake their tokens are rewarded, and the annual percentage yield (APY) for this is typically between 7-8%. However, it’s important to mention that this rate can change based on several factors.\n\nValidators play a crucial role in the network’s security. They receive new SOL tokens as rewards, as well as a share of transaction fees. This approach encourages active participation in the network and aims to ensure its stability.\n\nRegarding the distribution of SOL, recent data shows that out of a total supply of 561 million tokens, about 420 million are in circulation. This implies that approximately 141 million SOL tokens have been burned over time.\n\nSolana use cases\n\nSolana’s blockchain technology has nurtured a variety of use cases due to its high scalability and low transaction fees. Here are some notable use cases:\n\nDecentralized finance (defi)\n\nSolana’s high throughput and low transaction fees make it a fertile ground for defi applications like DEXs, lending protocols, and digital wallets. Examples include Solana-based DEXs like Orca and Serum, and lending platforms like Apricot Finance and Solend​.\n\nNon-fungible tokens (NFTs)\n\nSolana facilitates the creation of NFT platforms and marketplaces where users can mint, buy, and sell NFTs. Notable platforms include Metaplex and Solanart, which allow users to interact with digital artwork and other unique assets​.\n\nGaming\n\nSolana hosts games with play-to-earn (P2E) systems, enabling players to earn cryptocurrencies and NFTs through gameplay. Examples include online metaverses like Chainers and Aurory, and survival-puzzle games like Naga Kingdom​.\n\nWeb3 applications\n\nSolana supports the development of web3 apps that leverage modern internet technologies. Examples include Audius, a decentralized audio streaming app, Squads, a treasury fund management application, and Alchemy, a platform for building dApps quickly​.\n\nCross-chain functionality\n\nSolana has also been leveraged for cross-chain transactions, as seen with the integration of USDC-SPL in Trust Wallet, enabling users to send and receive USDC with minimal fees and swift transaction times.\n\nSolana’s hurdles in 2023\n\nIn 2023, Solana navigated a rough path marked by several network outages, casting a shadow on its robustness.\n\nThe most notable was a slowdown in block production on Feb. 25, following an upgrade attempt from validator software version 1.13 to 1.14, which led to considerable disruptions. Efforts to revert to version 1.13 were insufficient, ultimately necessitating a network restart.\n\nhttps://twitter.com/SolanaCompass/status/1629469599774261251?s=20\n\nThe February incident wasn’t singular; Solana contended with multiple outages in the past, spotlighting stability as a critical area for improvement. These technical difficulties attracted criticism from the broader blockchain community and competitors, stirring a debate about Solana’s reliability as a Layer 1 solution.\n\nComplicating matters, the root causes of certain outages remained elusive, even to Solana’s developers, leaving some issues unresolved over extended periods. This ambiguity and the recurring downtimes prompted concerns regarding Solana’s reliability, particularly given the fierce competition in the blockchain space.\n\nSolana long-term trend and price prediction\n\nThe Solana price has attracted attention recently, with many keeping a close eye on insights into its potential trajectory amid bullish market sentiment.\n\nAccording to DigitalCoinPrice, the Solana crypto price is set to reach around $83.44 by the end of 2023. The Solana price prediction for 2024 is approximately $94.60. By 2025, it’s anticipated to climb to $141.53 and $389.83 by 2030.\n\nDespite the potential shown by Solana in various domains, it’s essential to consider the rocky patches it navigated through in 2023, which have led some crypto analysts to project a lower price trajectory for SOL.\n\nReflecting on the slowdown in block production and recurring outages this year, some analysts have exercised caution in their forecasts, predicting an average SOL rate of around $23.89 in January 2024, which could potentially dip to a minimum of $23.34, with a maximum cap at $24.43.\n\nYou might also like: Solana gaining momentum according to Nansen report\n\nYet, those interested in the Solana crypto price should be wary of banking solely on forecasts. The volatile nature of the crypto market, combined with ever-evolving Solana news, suggests that price predictions shouldn’t be the sole basis for investment decisions.\n\nInvestors must exercise caution and adhere to the cardinal rule of investing: never invest more than you can afford to lose. It’s advisable to conduct thorough research, understand the inherent risks, and consider seeking advice from financial advisors before making any investment decisions."
    }
]