[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMTkvY29kZS13YWxsZXQtYWltcy1mb3ItZnJlc2gtc3RhcnQtb24tc29sYW5hLWFmdGVyLW1lc3N5LXRhbGUtb2Yta2lrLWFuZC1raW4v0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNy8xOS9jb2RlLXdhbGxldC1haW1zLWZvci1mcmVzaC1zdGFydC1vbi1zb2xhbmEtYWZ0ZXItbWVzc3ktdGFsZS1vZi1raWstYW5kLWtpbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jul 2023 07:00:00 GMT",
        "title": "Code Wallet Aims for Fresh Start on Solana After Messy Tale of Kik and KIN - CoinDesk",
        "content": "In an interview with CoinDesk, Livington spun KIN’s regulatory baggage as a positive: \"KIN is the only token that's on Solana that has no inflation that's been through the SEC gauntlet.\" The idea is that it has been given a green-light for trading in the U.S., and is, in Livingston’s view, better suited for adoption as a payment method than similar virtual currencies that have yet to get regulatory clearance. (The SEC’s case against KIN wasn’t all that dissimilar from the one currently underway with Ripple, albeit at a much smaller scale.)"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTE5L2NyeXB0by1hbHRjb2lucy1yZXN1bWUtdGhlaXItcmlzZS1iaXRjb2luLWhvdmVycy1hcm91bmQtMzAtMDAw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jul 2023 07:00:00 GMT",
        "title": "Crypto Altcoins XRP, Solana, Cardano Rise; Bitcoin Hovers Around $30,000 - Bloomberg",
        "content": "Smaller, lesser-known digital tokens such as Solana and Cardano resumed the rally that began last week following a court ruling that was seen as favorable for the digital-asset industry.\n\nXRP, which almost doubled last Thursday after a federal judge said that the token wasn’t a security when offered to the public on exchanges, led the gains again. The token rose a much as 12% to 85 cents on Wednesday amid speculation that Ripple Labs could reach a settlement over its long-running dispute about XRP with the US Securities and Exchange Commission."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTE5L2NyeXB0by1hbHRjb2lucy1yZXN1bWUtdGhlaXItcmlzZS1iaXRjb2luLWhvdmVycy1hcm91bmQtMzAtMDAw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jul 2023 07:00:00 GMT",
        "title": "Crypto Altcoins XRP, Solana, Cardano Rise; Bitcoin Hovers Around $30,000 - Bloomberg",
        "content": "Smaller, lesser-known digital tokens such as Solana and Cardano resumed the rally that began last week following a court ruling that was seen as favorable for the digital-asset industry.\n\nXRP, which almost doubled last Thursday after a federal judge said that the token wasn’t a security when offered to the public on exchanges, led the gains again. The token rose a much as 12% to 85 cents on Wednesday amid speculation that Ripple Labs could reach a settlement over its long-running dispute about XRP with the US Securities and Exchange Commission."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTE5L2NyeXB0by1hbHRjb2lucy1yZXN1bWUtdGhlaXItcmlzZS1iaXRjb2luLWhvdmVycy1hcm91bmQtMzAtMDAw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jul 2023 07:00:00 GMT",
        "title": "Crypto Altcoins XRP, Solana, Cardano Rise; Bitcoin Hovers Around $30,000 - Bloomberg",
        "content": "Smaller, lesser-known digital tokens such as Solana and Cardano resumed the rally that began last week following a court ruling that was seen as favorable for the digital-asset industry.\n\nXRP, which almost doubled last Thursday after a federal judge said that the token wasn’t a security when offered to the public on exchanges, led the gains again. The token rose a much as 12% to 85 cents on Wednesday amid speculation that Ripple Labs could reach a settlement over its long-running dispute about XRP with the US Securities and Exchange Commission."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvc29sYW5hLWxhYnMtaW50cm9kdWNlcy1nYW1lc2hpZnQtdG8tc2ltcGxpZnktd2ViMy1nYW1lLXByb2R1Y3Rpb24tMzAxODgwMDY2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 19 Jul 2023 07:00:00 GMT",
        "title": "Solana Labs Introduces GameShift to Simplify Web3 Game Production - PR Newswire",
        "content": "GameShift will accelerate the development of web3 games by building the ownership layer for games\n\nSAN DIEGO , July 19, 2023 /PRNewswire/ -- Solana Labs, which builds technology for the high-performance and carbon-neutral Solana blockchain, today unveiled GameShift, a unified web3 game development API aimed at alleviating major pain points games publishers experience when developing or porting games into web3.\n\n\"Developers for web3 games need innovative technology to simplify and accelerate the game building process, which GameShift will accomplish,\" said Tal Tchwella, head of product at Solana Labs. \"GameShift is building the ownership layer for games, and will provide a one-stop shop for developers on Solana helping them build faster and more confidently.\"\n\nWith Solana Labs' GameShift, developers will soon be able to access a full stack of trusted third-party web3 components on Solana through a single API.\n\nGameShift will provide everything developers need to unlock a complete, trusted, high quality web3 in-game experience, covering custody solutions, marketplaces, inventory management, NFT minting, credit card on-ramps and off-ramps, and more.\n\nThe GameShift tech stack will simplify the asset ownership journey for both developers and gamers. Similar to developing experiences in web2, GameShift will package new and existing third-party tooling for game developers on Solana to easily integrate into web3 and combine their technological needs into a single interface.\n\nGameShift was announced at PlayGG , a community-first celebration of games on Solana happening this week in San Diego, where more than 40 games on Solana are available to play.\n\n\"Developers see the potential of web3 games but they need help navigating the fragmented landscape of web3 tools and solutions,\" Tchwella said. \"GameShift will make it easy for developers to focus more on building their games instead of wrestling with the complexities of integrating web3 into their games.\"\n\nGameShift is expected to be available later this year. Interested developers can sign-up for early access here .\n\nAbout Solana Labs\n\nSolana Labs is a technology company that builds products, tools, and reference implementations to further expand the Solana ecosystem.\n\nAbout Solana\n\nSolana is a blockchain built for mass adoption. It's a high performance network that is utilized for a range of use cases, including finance, NFTs, payments, and gaming. Solana operates as a single global state machine, and is open, interoperable and decentralized. For more information, please visit https://solana.com .\n\nMedia Contact\n\npress@solana.org\n\nSOURCE Solana Labs"
    }
]