[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8wOC9hbmFseXN0LXByZWRpY3RzLWRlZXAtY29ycmVjdGlvbi1mb3Itc2FtLWFsdG1hbnMtd29ybGRjb2luLXVwZGF0ZXMtb3V0bG9vay1vbi1zb2xhbmEtYW5kLXR3by1vdGhlci1hbHRjb2lucy_SAZEBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDgvMDgvYW5hbHlzdC1wcmVkaWN0cy1kZWVwLWNvcnJlY3Rpb24tZm9yLXNhbS1hbHRtYW5zLXdvcmxkY29pbi11cGRhdGVzLW91dGxvb2stb24tc29sYW5hLWFuZC10d28tb3RoZXItYWx0Y29pbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Analyst Predicts Deep Correction for Sam Altman’s Worldcoin, Updates Outlook on Solana and Two Other Altcoins - The Daily Hodl",
        "content": "A closely followed analyst believes that the native token of the crypto project co-created by ChatGPT founder Sam Altman looks poised for a severe correction.\n\nPseudonymous analyst Altcoin Sherpa tells his 196,400 X followers that he’s bearish on Worldcoin (WLD), an artificial intelligence-based crypto project that uses iris-scanning technology.\n\nAccording to the trader, WLD is likely to witness a nearly 40% devaluation from current prices at the very least after losing the 0.618 Fibonacci level.\n\n“WLD: don’t buy this thing until low $1s and even then, it’s just a buy for a quick bounce, nothing else. THIS IS NOT A LONG-TERM INVESTMENT.”\n\nAt time of writing, WLD is worth $2.03.\n\nThe crypto strategist is also keeping an eye on the smart contract platform Solana (SOL). Altcoin Sherpa says SOL is currently in an area of interest as it hovers close to its 200-day exponential moving average (EMA).\n\n“SOL: It’s too hard to tell which areas are important to the left, so you can use 200-day EMA as confluence to your levels. This is probably an area of interest right now, and I think that Solana will do well in the bull market. Not a bad idea to just buy some and accumulate.”\n\nAt time of writing, SOL is trading for $23.07 with the 200-day EMA sitting at $22.62.\n\nNext up is Maker (MKR), a token that supports the stablecoin Dai (DAI). Altcoin Sherpa says that he’s looking to accumulate the token just above the 0.50 Fibonacci retracement level.\n\n“MKR: My favorite setup, the Fib .50 retrace. Looking for around $1000; psychological and should be close to these key levels. To be determined if this is over or not, but I think it’ll be a good buy.”\n\nAt time of writing, MKR is worth $1,209.\n\nThe last altcoin on the trader’s radar is Rollbit Coin (RLB), the native asset of the crypto casino and exchange platform Rollbit. According to Altcoin Sherpa, RLB looks primed to rally all the way up to its immediate resistance at $0.126.\n\n“RLB: Taking 50% off here, will take profit more higher and also leave a runner on this. Despite all the FUD (fear, uncertainty and doubt), I still think it’s a $ printer.”\n\nAt time of writing, RLB is trading for $0.118.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vc29sYW5hcy1jeXBoZXItcHJvdG9jb2wtc21hcnQtY29udHJhY3QtZnJlZXplLXRyaWdnZXJzLW91dGJ1cnN0LWFtaWQtMS1taWxsaW9uLWV4cGxvaXQtaXMtc29sLWF0LXJpc2sv0gGOAWh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9zb2xhbmFzLWN5cGhlci1wcm90b2NvbC1zbWFydC1jb250cmFjdC1mcmVlemUtdHJpZ2dlcnMtb3V0YnVyc3QtYW1pZC0xLW1pbGxpb24tZXhwbG9pdC1pcy1zb2wtYXQtcmlzay8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Solana’s Cypher Protocol Smart Contract Freeze Triggers Outburst Amid $1 Million Exploit – Is SOL at Risk? - Crypto News Flash",
        "content": "Solana’s Cypher Protocol has been exploited for $1 million, leading to a freeze in the smart contract and a community outburst.\n\nCypher, one of Solana’s fastest-growing protocols, is negotiating for the return of funds, raising concerns about Solana’s reputation and potential risks.\n\nCypher, the Solana (SOL) blockchain’s Cypher Protocol made headlines on August 7 after an exploit that led to up to $1 million in losses. The incident has prompted the network to take actions towards recovery.\n\nCypher Protocol’s Exploit and Reaction\n\nSolana blockchain found itself at the center of attention on Crypto X when Cypher, one of its protocols, was exploited for $1 million. The network immediately froze its smart contract to pave the way for interventions, aiming to recover the stolen funds. The Cypher Protocol appealed to the exploiter for negotiations, outlining “potential next steps.”\n\nCypher has has experienced an exploit/security incident. The smart contract has been frozen. The team is currently working with individuals and investigating To the hacker: We are writing to see whether you would be open to speaking with us about any potential next steps. — cypher ©️ (@cypher_protocol) August 7, 2023\n\nCrypto researcher Messari confirmed the news, reflecting on Solana blockchain’s recent accomplishments, including its total value locked (TVL) growth of 15% in July to $310 million. This achievement stood out in comparison to declines recorded by major blockchains like Ethereum, Binance Smart Chain, and others.\n\nDetails and Community Backlash\n\nUnconfirmed reports suggest that the exploiter may have used Binance exchange both for funding their wallet and cashing out, leading to appeals for assistance from Binance’s CEO, Changpeng Zhao.\n\nCypher’s position as one of the most advanced Solana-based protocols, offering incentives to traders and depositors, made the incident even more significant. The protocol’s freezing has triggered criticism from the Solana community, casting a shadow on the network’s previously good standing with users.\n\nLiquid Staking Criticism and Possible Resolutions\n\nThis exploit has attracted attention towards liquid staking on the Solana blockchain, with some victims holding out hope for recovery. Negotiations are ongoing, with objectives such as getting the bad actor to refund 90% of the loot for a 10% cut of the exploit. Such a deal would mirror what happened in the Curve DAO case, with the protocol potentially offering not to pursue prosecution or even proposing a bounty for information about the exploiter.\n\nFastest-Growing Protocol, A Bigger Picture\n\nCypher’s growth as one of the fastest-growing protocols on Solana’s blockchain can be attributed partly to its loyalty program, rewarding depositors and traders with points expected to lead to an airdrop. However, this exploit during Cypher’s biannual hacker house mtnDAO, hosted in Salt Lake City, has raised serious concerns and queries about the future of Solana’s blockchain and the potential risks involved.\n\nUpdate\n\nThe smart contract remains frozen as the Cypher team, together with individuals, continues to investigate, seeking dialogue with the hacker about any possible next steps.\n\nRecommended for you:"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3dlYjMtYW5zZW0tYXR0cmFjdGluZy1uZXctcGVvcGxl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 15:16:38 GMT",
        "title": "Crypto applications need to focus on attracting new people, says trader Ansem - Blockworks",
        "content": "Podcast host Garrett Harper jokes that his guest, crypto trader Ansem, has probably used 10,000 different blockchains by now. But something is still missing in the industry, according to Ansem: people.\n\n“The biggest thing that I think Solana and other crypto applications need,” he says, “is a focus on people who aren’t in crypto.”\n\nThe trader holds a substantial following on the app formerly known as Twitter, built up over years of sharing his ups and downs in the crypto industry. Speaking on the Lightspeed podcast (Spotify/Apple), he says his focus over the next few months is to “bridge the gap” between people “who have absolutely no understanding of crypto at all,” and somehow bring them into the scene.\n\nIn the past, many blockchain users dove down the crypto rabbit hole for socio-economic or speculative reasons. But now, according to Ansem, it seems that more casual interactions, like social apps involving NFTs and Web3 gaming, are the most effective avenues for adoption.\n\nAnsem notes that he might give friends ether (ETH) or bitcoin (BTC) to get them over the initial adoption hump, but to get them engaged in communities, NFTs provide a much stronger draw. “If I give one of my friends an NFT, it’s like, ‘Oh, I have an NFT — I’m a part of this community. We share this with all these different people.’ It’s a more communal thing.”\n\nOnboarding with freebies\n\nAnsem says he likes what Drip Haus is doing to attract new users. The Solana-based platform provides free NFTs from popular creators to subscribers, recently described to Blockworks.\n\n“Instead of doing mints, they do free drops for people every week. They give out all this art to people who subscribe to different artists on their platform. And then you can tip the artist if you really like their work and then share it with other people.”\n\nAnsem notes that the platform has sent out NFTs to “something crazy, like 700K, 800K wallets.” Approximately 250,000 of those new wallets, he says, have proceeded to use other Solana apps. “So they’ve done a pretty good job of onboarding completely new people.”\n\n“You don’t need any Solana in your wallet to get the NFT completely free,” he says. “Now you’re happy, and you’re like, ‘Oh, now what else can I do in the ecosystem?’”\n\n“They’re doing a really good job of onboarding people.”\n\nAnsem also says he is “big on gaming,” noting that nobody seems to have “hit it hard yet” in the industry. “It doesn’t really have to be all that complicated,” he says.\n\nHe harkens back to the simplistic but virally successful mobile game, Flappy Bird, that “did a really good job of getting people’s attention” years ago. Crypto has “a really great lane” to execute a similar strategy in mobile gaming, Ansem says, especially with low-cost ecosystems like Solana, focusing on mobile apps with innovations like xNFTS and the Backpack wallet.\n\nAnsem says that for any crypto project to reach a new audience, it must build a presence on Twitter, the platform where he established his brand. “If you don’t have a big presence on Twitter, you could be building the greatest technical-whatever-protocol to exist,” but if people don’t know about it, he says, “nobody’s going to use it.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vdGhlY3VycmVuY3lhbmFseXRpY3MuY29tL2RlZmkvc29sYW5hcy1tZXRlb3JpYy1yaXNlLWRlZmktZG9taW5hbmNlLWFuZC1uZnQtc3VyZ2UtYW1pZC1yZXNpbGllbmNlLTYyODgz0gFyaHR0cHM6Ly90aGVjdXJyZW5jeWFuYWx5dGljcy5jb20vZGVmaS9zb2xhbmFzLW1ldGVvcmljLXJpc2UtZGVmaS1kb21pbmFuY2UtYW5kLW5mdC1zdXJnZS1hbWlkLXJlc2lsaWVuY2UtNjI4ODMvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Solana’s Meteoric Rise: DeFi Dominance and NFT Surge Amid Resilience - The Currency Analytics",
        "content": "In a mere month, Solana’s blockchain ecosystem has undergone a remarkable transformation, witnessing substantial growth in both its decentralized finance (DeFi) and non-fungible token (NFT) sectors. This period has not only showcased Solana’s prowess in propelling its DeFi ecosystem forward but has also seen an impressive surge in NFT sales volume. As Solana navigates challenges, its resilience shines through, reaffirming its position as a formidable player in the blockchain space.\n\nSolana’s DeFi Dynamo\n\nThe past month has illuminated Solana’s burgeoning DeFi landscape, primarily manifested through a significant uptick in Total Value Locked (TVL). DeFiLlama’s data paints a picture of consistent growth, with SOL’s TVL surging to a substantial $1.12 billion. Notably, the standout dApps that led this growth include Sharky, Parrot, and Saber Labs, as highlighted in a tweet by Solana Daily. These platforms have not only fueled TVL expansion but have also underscored Solana’s potential to become a DeFi powerhouse.\n\nWhile the DeFi ecosystem flourished, SOL token holders experienced some challenges, facing losses during this period. This dual dynamic of growth in TVL and investment challenges reveals the complexity of the market and the volatility that can come with it.\n\nNFT Renaissance on Solana\n\nBeyond the realm of DeFi, Solana’s NFT ecosystem has witnessed an impressive surge in activity. Sales volume for Solana-based NFTs surged by over 5% within a mere 30 days, signifying a growing interest in the platform’s NFT offerings. This surge in volume was accompanied by a 14% increase in buyers, an 18% rise in sellers, and a 5% uptick in transactions, all indicating a flourishing NFT ecosystem on Solana.\n\nResilience Amid Challenges\n\nOne of the standout features of Solana’s journey over the past month has been its resilience. Despite the collapse of FTX, a significant backer of Solana, the blockchain maintained its strength. Solana’s price weathered a substantial drop, from $250 to approximately $10, reflecting a daunting 96% decrease. This decline raised concerns about the platform’s stability, yet Solana displayed remarkable resilience. Throughout 2023, its daily active addresses remained consistent at around 300,000, aligning it with engagement levels observed on Ethereum and Polygon.\n\nMoreover, Solana’s transaction volumes rebounded, revisiting levels seen prior to the FTX collapse. Currently ranked as the fourth-highest generator of daily fees, Solana’s revival led to an impressive 150% price surge since the beginning of 2023. This resurgence not only reinstated Solana’s position among the top 10 cryptocurrencies but also emphasized its capacity to endure challenges.\n\nPower of the Developer Community\n\nSolana’s thriving developer community is an integral pillar of its success story. Ranked fourth globally for full-time developers across all blockchains, it has surpassed major contenders such as Cardano, Avalanche, and even Bitcoin in developer engagement. A standout addition to this landscape is Solang, a new compiler simplifying the process of creating dApps for Ethereum developers. This advancement could potentially pave the way for the migration of Ethereum-based dApps to the Solana platform.\n\nAs Solana continues to prove its mettle and adaptability, it cements its place as a transformative force within the blockchain realm. Its prowess in DeFi expansion, NFT resurgence, resilience in the face of adversity, and vibrant developer community collectively shape a narrative of growth and potential that is capturing the attention of the crypto community."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMingFodHRwczovL3d3dy5jYnM4LmNvbS9hcnRpY2xlL25ld3MvbG9jYWwvb3V0cmVhY2gvZWFydGg4L2JhdHRlcnktc3RvcmFnZS1icmluZ3MtY2xlYW4tZW5lcmd5LXRvLWNodWxhLXZpc3RhLXBvd2VyLWdyaWQvNTA5LWYyYzYxNDVkLWEwNTAtNDQ3YS1iOTg5LWI3MzFiMTQwN2UwNtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 08 Aug 2023 07:00:00 GMT",
        "title": "Earth 8 | Chula Vista boosts its power grid | cbs8.com - CBS News 8",
        "content": "The Solana Beach-based tech company, EnerSmart, will help to store energy that can be sold and used on the grid when needed, making it more resilient to blackouts.\n\nCHULA VISTA, Calif. — San Diego continues to pave the way for more clean energy on our power grid with the arrival of EnerSmart’s new battery storage project that hopes to stabilize the power grid and increase renewable energy usage in Chula Vista.\n\nAs solar and wind power continue to grow as sources of energy for our power grid, so does the need to store that energy. It’s been a race to the finish to develop the most reliable and best-performing battery and now the latest company launching their product in the South Bay is EnerSmart – based out of Solana Beach.\n\n“We're really excited to be part of the solution,\" said James Beach, the Co-Founder of EnerSmart. \"It’s a fantastic job, we love what we’re doing, and really excited to be in San Diego.”\n\nThe state of California is now on its way to meeting the most ambitious clean energy goals in the nation – setting a benchmark of 90 percent clean electricity by 2035, and 100 percent clean electricity by 2045.\n\n\"Across the country, we’re really gonna be far down the line in transitioning away from an economy that’s so dependent on oil and gas to an economy that has so many other sources that we can rely on to provide cheaper energy, cleaner energy, more reliable energy over time,\" United States Representative Scott Peters (CA-50) told CBS 8. \"One thing I'm working on as well is really making sure that we turn these investments around more quickly. We have so much delay in our permitting process that I think the environmental community needs to realize that speed is what we’re after. We’re in a race against climate change.\"\n\nIn order to meet those goals, battery storage needs to hold clean energy when it’s produced, to be used on the grid during peak hours, or in the case of solar panels, when the sun isn’t shining.\n\n\"One of the reasons we're here is that San Diego has the most expensive power in the country so it was one of the best places for battery storage projects,\" added Beach. \"But over time, that will change. I think in 20 years power prices will be levelized. It’ll be clean, it will be reliable and very efficient, and it’s just gonna take some time to get there. But these are the first steps to help that happen.\"\n\nThese six energy storage containers in Chula Vista can store enough energy to power 3,000 homes in the area. Enersmart says more energy storage means less strain on our energy grid and less likelihood of electricity blackouts.\n\n\"Basically the way it works is you have large power generation facilities transmit the power to the local area into a substation and then distribute it around,\" Beach told CBS 8. \"Now, you’ve got a source of power right here so it can come in and put energy on the system quickly and absolutely help with brownouts.\"\n\nThe company now has 11 additional projects in development in the county with other competitors also stepping up and developing more clean energy as well as ways to store it in off-hours.\n\n\"The development of battery storage projects like these are critical to ensure that we not only meet our renewable energy demands but also support our grid that is reliable and secure,\" said Jason Anderson, the President of Clean Tech San Diego. \"Innovators like EnerSmart are filling a critical gap by allowing the increased use of renewable energy at all times of day and in any condition.\"\n\nThe project was financed by North American Development Bank, a company that supports environmental infrastructure projects mainly along the U.S. - Mexico Border."
    }
]