[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3Lm5ld3N3aXJlLmNvbS9uZXdzL3NvbGFuYS10by1ob3N0LWxhcmdlc3QtY29tbXVuaXR5LWNvbmZlcmVuY2UtaW4tMjAyNC0yMjE5NTYxM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Dec 2023 08:00:00 GMT",
        "title": "Solana to Host Largest Community Conference in 2024 - Newswire",
        "content": "Press Release •\n\nSolana, one of the world's fastest-growing blockchains, is set to host its second annual Solana Crossroads community conference in Turkey. The 3,000-attendee conference will be the largest community conference to date and will bring together the Solana community and companies across the Solana ecosystem, such as Star Atlas, Marinade, Superteam, MarginFi, Zeta Markets, and more.\n\nThe two-day international event will take place from May 10 to May 11, 2024, in Istanbul and will be hosted by Step Finance, the front page of Solana. Featured speakers include Coingecko co-founder Bobby Ong, Solana project founders such as Michael Wagner of Star Atlas, Superteam co-founder Kash Dhanda, as well as Solana Foundation leaders who are yet to be announced.\n\n\"Solana is experiencing a significant surge in growth, and there's no place more suited than Istanbul to gather the global Solana community. We aim to lead in fostering Solana's progress, and Solana Crossroads is a vital part of this effort,\" says George Harrap, Co-founder of Step Finance.\n\nSolana Crossroads will feature exclusive Turkish-style parties for VIPs, VIP networking lunches, and extensive exhibitions and speaker sessions showcasing leading Solana projects. The event is set to take place at the Hilton Bosphorus in Istanbul, notable for being the first Hilton establishment in Europe.\n\nEarly bird tickets are now available for a limited time. More information can be found on the Solana Crossroads Official Website.\n\nSource: Step Finance"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8xMi9jcnlwdG8tYW5hbHlzdC1pc3N1ZXMtc29sYW5hLXdhcm5pbmctc2F5cy1zb2wtcHJpbnRpbmctc2FtZS10ZWNobmljYWwtcGF0dGVybi1hcy0yMDIxLW1hcmtldC10b3Av0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzEyL2NyeXB0by1hbmFseXN0LWlzc3Vlcy1zb2xhbmEtd2FybmluZy1zYXlzLXNvbC1wcmludGluZy1zYW1lLXRlY2huaWNhbC1wYXR0ZXJuLWFzLTIwMjEtbWFya2V0LXRvcC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Dec 2023 08:00:00 GMT",
        "title": "Crypto Analyst Issues Solana Warning, Says SOL Printing Same Technical Pattern As 2021 Market Top - The Daily Hodl",
        "content": "Crypto analyst Jason Pizzino thinks traders should be wary of Ethereum (ETH) rival Solana (SOL) as it displays a technical pattern reminiscent of its last cycle’s top.\n\nIn a new YouTube video, Pizzino tells his 300,000 subscribers that Solana is currently printing a similar pattern to what it showed when it peaked at around $260 in 2021.\n\nThe analyst noted that back in late November, when SOL was trading in the $55-$60 range, he predicted that the SOL rally would probably come to an end. He noted that SOL’s price surged from there, then pulled back, then made another attempt upwards before pulling back again.\n\n“Doesn’t mean it’s the end, but it looks scarily similar to what happened at the peak here, just on a shorter-term time frame. You can see this massive pump up to about $220, the pullback, and then the market attempted to go higher, couldn’t do it, came underneath, got rejected, and then of course the macro bear market started from that point.”\n\nPizzino notes that Solana’s current resistance level is hovering around $75-$76, and he cautions that SOL’s top is “not even confirmed yet.” The analyst, however, says SOL’s potential moves to the upside at this point look “quite limited” compared to the asset’s potential crashes to the downside.\n\nSOL is trading at $71.49 at time of writing.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3NvbC10cmFkZXJzLWxvc2UtbmVhcmx5LTIwLW1pbGxpb24taW4tbG9uZy1saXF1aWRhdGlvbnMtYXMtc29sYW5hLXByaWNlLWNyYXNoZXMtYnktYWxtb3N0LTEzLTIwMjMxMjEyMDE0M9IBnAFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9zb2wtdHJhZGVycy1sb3NlLW5lYXJseS0yMC1taWxsaW9uLWluLWxvbmctbGlxdWlkYXRpb25zLWFzLXNvbGFuYS1wcmljZS1jcmFzaGVzLWJ5LWFsbW9zdC0xMy0yMDIzMTIxMjAxNDM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Dec 2023 08:00:00 GMT",
        "title": "SOL traders lose nearly $20 million in long liquidations as Solana price crashes by almost 13% - FXStreet",
        "content": "Solana price fell to $65 during the intra-day trading lows before recovering to $71 at the time of writing.\n\nSOL witnessed the liquidation of $20 million worth of long contracts, marking the highest single-day liquidation of Q3.\n\nThe altcoin is exhibiting the potential of a quick recovery, which could wipe the losses, given SOL’s demand.\n\nSolana price did not escape the bearish impact of Bitcoin whales selling as the altcoin noted a crash on Monday. Unprecedented, the sudden drop in price took a toll on the traders who were pining for further increases after SOL became one of the best-performing assets of 2023.\n\nSolana traders in peril\n\nTraders looking to make money on Solana price rise experienced significant losses on Monday after nearly $20 million worth of long contracts liquidated. The almost 13% crash of the altcoin to $65 led to the biggest liquidation observed in the last three months.\n\nSolana long liquidations\n\nThis crash was the biggest blow to SOL traders as the cryptocurrency emerged as one of the best-performing assets of 2023. Up until Monday, the consistent increase in price led to Solana rising by almost 600% since the beginning of the year. This was one of the biggest driving factors for the bulls, who were expecting the digital asset to tag $80 before the end of the year.\n\nWhile there is no certainty of the same happening, there is a chance that Solana price could resume rallying again given the quick recovery noted on the charts.\n\nSolana price might recover its losses soon\n\nSolana price at the time of writing could be seen hovering at $71 on the 4-hour chart, recovering from $68 in the last few trading sessions. The altcoin is presently testing $71 as a resistance, and flipping it into support would provide it with the necessary boost to continue recovering the losses witnessed in the past 24 hours.\n\nBoth the Relative Strength Index (RSI) and Moving Average Convergence Divergence (MACD) indicators are exhibiting bullish signals in the short-term timeframe. RSI is already above the neutral line marked at 50.0.\n\nThis is likely going to imbue confidence in SOL investors that Solana price might not be too far away from climbing back to testing $78 as a resistance level. Breaching the same would mark fresh year-to-date highs for the altcoin.\n\nSOL/USD 1-day chart\n\nOn the other hand, failing to reclaim $71 might lead to Solana price falling to test the support line at $66. Falling through this line would invalidate the bullish thesis, leaving SOL vulnerable to a decline to $61."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYm9sZC5jb20vc29sYW5hLWpvaW5zLWRlZmlzLXRvcC01LXdpdGgtMS1iaWxsaW9uLXRvdGFsLXZhbHVlLWxvY2tlZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Dec 2023 08:00:00 GMT",
        "title": "Solana joins DeFi's top 5 with $1 billion total value locked - Finbold - Finance in Bold",
        "content": "Solana (SOL) reached a $30 billion market cap and close to $1 billion of Total Value Locked (TVL) in DeFi on December 12.\n\nThe best performer, “Ethereum-killer” of 2023, has consistently earned cryptocurrency investors’ attention and money this year.\n\nNotably, Solana’s decentralized finance ecosystem now features among the top five chains in TVL. SOL conquered this position after an impressive 43.91% TVL surge in a week to $945.87 million invested tokens worth of dollars.\n\nTop 5 DeFi chains by total value locked. Source: DefiLlama\n\nFinbold retrieved this data from DefiLlama, which provides valuable indicators for the ever-growing DeFi ecosystem. For example, the close to $1 billion TVL on Solana is spread among 244.919 crypto wallet addresses and 117 Solana-based protocols.\n\nInterestingly, SOL only loses to Ethereum (ETH), with $28.17 billion total value locked; Tron (TRX), with $7.92 billion; BNB Chain (BNB) or Binance Smart Chain (BSC), with $3.13 billion; and Arbitrum (ARB), an Ethereum’s second layer, with $2.30 billion TVL.\n\nMost valuable DeFi protocols on Solana\n\nTherefore, the importance of Ethereum for both DeFi and Web3 is unquestionable. Nevertheless, Solana steadily grows in relevancy as valuable protocols are built using its framework. SOL thrives in this competitive environment by offering faster and cheaper transactions than the market leader.\n\nMarinade Finance (MNDE) leads the pack of DeFi protocols on Solana with a total value locked (TVL) of $759.26 million. Jito (JTO) follows with $447.57 million in TVL. Marginfi (MFI) holds $235.16 million, while Solend (SLND) and Orca (ORCA) secure $145.6 million and $120.08 million, respectively.\n\nTop 5 DeFi protocols by total value locked on Solana. Source: DefiLlama\n\nOn that, marginfi and Orca have shown the highest weekly and monthly surges. MarginFi grew by 66% and 135%, while Orca surged by 48% and 87%, respectively in both the last week and month.\n\nConsidering everything, a layer-1 blockchain like Solana has its native token’s value pegged to its DeFi ecosystem. A richer ecosystem might increase the demand for SOL as its base asset, rewarding Solana’s stakeholders in the long term.\n\nHowever, it’s important to consider that part of the measured total value locked comes from liquid staking and lending. This creates a leveraged ecosystem, as Solana’s stakers are using IOU tokens for their previously illiquid investment. The more leveraged a financial ecosystem is, the higher the risks are for every entity involved in it.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdS50b2RheS9hdmFsYW5jaGUtYXZheC1taWdodC1yZXBlYXQtc29sYW5hcy1zb2wtbWluZC1ibG93aW5nLXJhbGx50gFOaHR0cHM6Ly91LnRvZGF5L2F2YWxhbmNoZS1hdmF4LW1pZ2h0LXJlcGVhdC1zb2xhbmFzLXNvbC1taW5kLWJsb3dpbmctcmFsbHk_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 12 Dec 2023 08:00:00 GMT",
        "title": "Avalanche (AVAX) Might Repeat Solana's (SOL) Mind-Blowing Rally - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAvalanche is charting a course that could mirror the explosive growth of Solana in its early days. With transaction volume swelling to nearly a thousand transactions exceeding $100,000 last week, AVAX is signaling robust momentum - however, not yet at the levels seen during the zenith of the last bull market. This uptick in transactional activity indicates growing bullish sentiment among investors and the growth of the ecosystem.\n\nAdvertisement\n\nThe ecosystem’s tendency to grow is further evidenced by the impressive fee capture of Trader Joe’s DEX which, on Dec. 11, recorded $1.23 million, surging to its second-highest point this year. Revenue also saw a significant uptick, hitting $145K. Those metrics underscore the platform’s increasing use case.\n\nThe number of large $AVAX transactions is on the rise, peaking at nearly 1000 transactions bigger than $100k last week. While this is still not close to levels of the last bull market, it is a positive sign for the bulls. pic.twitter.com/PRGpsewWg2 — IntoTheBlock (@intotheblock) December 11, 2023\n\nThis blossoming activity coincided with a more than 20% price increase for AVAX, propelling it over the $40 mark and vaulting it into the top 10 cryptocurrencies by market capitalization, marking a peak not seen since May 2022. Trader Joe's governance token, JOE, similarly enjoyed a more than 9% price increase, adding further credence to the synergistic growth within the Avalanche ecosystem.\n\nWhile the metrics are promising, the shadows of previous rallies cast both hope and caution. The rise in large transactions is a positive sign for bulls but also a reminder of the volatility inherent on cryptocurrency markets. The question of whether AVAX can sustain its rally and perhaps even replicate SOL’s historic 3x rise remains open.\n\nFor investors and enthusiasts, the narrative unfolding around Avalanche is one of opportunity tempered with the wisdom of past cycles. The next few weeks will be critical in determining whether AVAX can cement its position as a leading cryptocurrency and if its ecosystem can continue to thrive amid the fluctuating tides of the market. The trajectory is set; whether it will soar as SOL did is a tale only time will tell."
    }
]