[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMjkvbmV3LWRlYnJpZGdlLWZlYXR1cmUtbGV0cy1zb2xhbmEtdXNlcnMtZWFzaWx5LWFjY2Vzcy1hbnktZXRoZXJldW0tYmFzZWQtYmxvY2tjaGFpbi_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNi8yOS9uZXctZGVicmlkZ2UtZmVhdHVyZS1sZXRzLXNvbGFuYS11c2Vycy1lYXNpbHktYWNjZXNzLWFueS1ldGhlcmV1bS1iYXNlZC1ibG9ja2NoYWluL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "New deBridge Feature Lets Solana Users Easily Access Any Ethereum-Based Blockchain - CoinDesk",
        "content": "This is possible thanks to a link-up with the DLN Trade, a cross-chain exchange product by deBridge that uses a decentralized order book to allow any asset on one chain to be traded directly to any asset on another without the bottlenecks and risks of liquidity pools."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA2LzI5L2xpcXVpZC1zdGFraW5nLWZyZW56eS1zcHJlYWRzLXRvLXNvbGFuYS1hcy1kcmlmdHMtc3VwZXItc3Rha2Utb2ZmZXJzLW9uZS1jbGljay1sZXZlcmFnZS_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNi8yOS9saXF1aWQtc3Rha2luZy1mcmVuenktc3ByZWFkcy10by1zb2xhbmEtYXMtZHJpZnRzLXN1cGVyLXN0YWtlLW9mZmVycy1vbmUtY2xpY2stbGV2ZXJhZ2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Liquid Staking Frenzy Spreads to Solana as Drift's 'Super Stake' Offers One-Click Leverage - CoinDesk",
        "content": "Their rather obtuse process involves staking SOL tokens for a proxy receipt token called mSOL and then using those mSOL as collateral to borrow SOL – and then swapping that SOL for mSOL again – is reminiscent of the sort of leverage-on-steroids approach long witnessed in other corners of the digital-asset markets."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbmpvdXJuYWwubmV0L25ld3Mvc29sYW5hLXByaWNlLXNwaWtlcy1hZnRlci10aGUtZGVicmlkZ2UtbGF1bmNoLWJld2FyZS1vZi1sb3ctdm9sdW1lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Solana price spikes after the deBridge launch: Beware of low volume - CoinJournal",
        "content": "Solana price went vertical after the launch of deBridge.\n\nThis feature will make it possible for Solana to communicate with EVM.\n\nSolana price staged a strong comeback on Thursday as investors cheered a new bridge in the ecosystem. SOL jumped to a high of $18.21, which was much higher than this month’s low of $13.56. It was among the best-performing cryptocurrencies on Thursday.\n\nSolana and Ethereum bridge\n\nSolana is a leading blockchain platform that was once the biggest players in industries like decentralized finance and non-fungible tokens. At its peak, its DeFi ecosystem had billions of total value locked (TVL). All this came tumbling down following the collapse of FTX and Alameda Research. The two companies were among the biggest contributors to its ecosystem.\n\nThe main reason why Solana price jumped is the launch of deBridge feature that allows Solana to communicate with Ethereum. This is the first time that the two ecosystems can communicate with each other.\n\nThey can also communicate with other Ethereum Virtual Machines (EVM) like Arbitrum and Optimism. Without this bridge, the alternative communication process is using wrapped and other derivative tokens. In a note, the founder of deBridge said that:\n\n“Users and projects that needed to transfer liquidity to Solana have always faced limitations due to the lack of liquidity in Wormhole pools and high slippage during the exchange of the wrapped assets, which often made developers have to deal with non-liquid Wormhole assets.”\n\nSolana price also jumped as signs emerged that the new management will relaunch FTX. As we have written before , the management is speaking with counterparties as it works to relaunch the exchange. It is not clear what this relaunch will mean for Solana and other companies that FTX had invested in like Near Protocol and Serum.\n\nSolana price prediction\n\nThe daily chart shows that the SOL price has been under pressure in the past few months. This trend saw it drop to the January low of $13.35 this month. It has made a modest recovery and is now attempting to move above the 50-day moving average. It has also jumped above the resistance at $16.05.\n\nThe red flag I have with Solana is that this jump has not been accompanied by higher relative volume. Therefore, I suspect that it will be short-lived, which will see it drop to the support at $16. The only caveat for the bearish view is if Bitcoin stages a comeback above its year-to-date high of $31,400.\n\nHow to buy Solana"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYm9sZC5jb20vc29sYW5hLXByaWNlLXByZWRpY3Rpb24tYXMtc29sLWNsaW1icy0xMC1pbi1hLWRheS1pcy0zMC1uZXh0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Solana price prediction as SOL climbs 10% in a day – Is $30 next? - Finbold - Finance in Bold",
        "content": "Solana (SOL) witnessed an unprecedented surge in its price on June 29, with the DeFi asset exhibiting remarkable growth and entering double-digit territory over the last 24 hours.\n\nConsequently, Solana has now positioned itself at the forefront of the cryptocurrency market, surpassing all other assets in the top 100 by market cap in terms of gains, as it steadily advances towards the significant milestone of $20, a level that carries considerable psychological significance.\n\nSOL is changing hands at $17.96, up 10.93% and 6.18% across the week, with a total market worth of $7.1 billion. Over the past 30 days, SOL has enjoyed 19 green days, accounting for approximately 63% of the period.\n\nSOL 1-day price chart. Source: Finbold\n\nSolana exhibits notable support and resistance levels, with $15.09 acting as support and $17.87 serving as resistance. Presently, SOL is positioned above the resistance level, and if it can maintain support beyond this threshold following its breakthrough, it could indicate a potential trajectory toward reclaiming the $20 mark.\n\nSolana is currently trading below the 200-day simple moving average (SMA) and below the 50-day SMA, and this indicator has been signaling SELL for the last 24 days since June 05, 2023.\n\nSolana price prediction\n\n1-month from now, Solana is predicted to trade at $26.71, so although it is over a 60% price increase from its current price, it is not projected to hit over $30 at least within the next six months, according to CoinCodex’s, technical indicators.\n\nSOL 1-month price prediction. Source: CoinCodex\n\nAs things stand, the current Solana sentiment is Bearish, while the Fear & Greed Index is showing 54 (Neutral). Meanwhile, Solana recorded 19/30 (63%) green days with 13.25% price volatility over the last 30 days.\n\nSOL daily active addresses\n\nElsewhere, this week in 48 hours, Solana witnessed a remarkable surge in its daily active addresses, with an impressive jump of 100,000. This surge in active addresses signifies a substantial increase in user engagement and interest in the platform.\n\nNotably, Solana has surpassed Ethereum in this aspect and is steadily approaching Polygon’s popularity and usage levels.\n\nNew: Solana Daily Active Addresses jump 100K in 48 hours, as it surpasses Ethereum and approaches Polygon. pic.twitter.com/gd5V1LW32p — Step Data Insights (@StepDataInsight) June 27, 2023\n\nFinally, on June 29, the high-performance cross-chain trading between Solana and Ethereum Virtual Machine chains went live. A Solana user can access EVM-based blockchains for the first time without relying on derivative tokens or wrapped tokens.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm9jcmVnaXN0ZXIuY29tLzIwMjMvMDYvMjkvbHlsZS1sb3ZldHQtZGlzY3Vzc2VzLWZhdGhlcmhvb2QtbmV3LW11c2ljLWFoZWFkLW9mLXNvdXRoZXJuLWNhbGlmb3JuaWEtc2hvd3Mv0gF4aHR0cHM6Ly93d3cub2NyZWdpc3Rlci5jb20vMjAyMy8wNi8yOS9seWxlLWxvdmV0dC1kaXNjdXNzZXMtZmF0aGVyaG9vZC1uZXctbXVzaWMtYWhlYWQtb2Ytc291dGhlcm4tY2FsaWZvcm5pYS1zaG93cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Lyle Lovett discusses fatherhood, new music ahead of Southern California shows - OCRegister",
        "content": "It’s been a year since singer, songwriter and producer Lyle Lovett put out his most recent album, “12th of June.”\n\nThe effort is his first album in a decade and the follow up to 2012’s “Release Me.” In yet another example of the pandemic getting in the way of the best laid plans, Lovett had things all lined up for a much earlier arrival of his latest batch of music. But he’s back out on the road now and looking forward to sharing the songs and messages on tour with his Large Band this summer.\n\nThe crew hits the Belly Up Tavern in Solana Beach Monday, July 3 and Tuesday, July 4 before heading to The Coach House in San Juan Capistrano on Wednesday, July 5 and the Saban Theatre in Beverly Hills on Thursday, July 6.\n\n“We’ll play material from across my catalog, but we will definitely feature material from this (new) album,” the 65-year-old Texas native said during a recent phone interview. “It’s always fun to have a new record out and it’s always fun to have a reason to play those newly recorded songs.”\n\nCountry singer-songwriter Lyle Lovett will bring His Large Band to Belly Up Tavern in Solana Beach on July 3-4; The Coach House in San Juan Capistrano on July 5; and Saban Theatre in Beverly Hills on July 6. (Photo by Ethan Miller, Getty Images)\n\nCountry singer-songwriter Lyle Lovett (pictured at Willie Nelson’s 90th birthday show at the Hollywood Bowl in Los Angeles in April 2023) will bring His Large Band to Belly Up Tavern in Solana Beach on July 3-4; The Coach House in San Juan Capistrano on July 5; and Saban Theatre in Beverly Hills on July 6. (Photo by Emma McIntyre, Getty Images)\n\nCountry singer-songwriter Lyle Lovett (pictured right with singer Chris Isaak during a Nashville, Tenn. performance in 2022) will bring His Large Band to Belly Up Tavern in Solana Beach on July 3-4; The Coach House in San Juan Capistrano on July 5; and Saban Theatre in Beverly Hills on July 6. (Photo by Erika Goldring, Getty Images for Americana Music Association)\n\nCountry singer-songwriter Lyle Lovett will bring His Large Band to Belly Up Tavern in Solana Beach on July 3-4; The Coach House in San Juan Capistrano on July 5; and Saban Theatre in Beverly Hills on July 6. (Photo by Suzanne Cordeiro, AFP via Getty Images)\n\nThe album was recorded in November 2019, with the idea of finishing by March of 2020, Lovett shared.\n\n“I did an acoustic group tour that started in January and ended up on the 7th of March that year,” he continued. “I was going to spend the rest of the month working on the record and finishing it for a 2020 release. And of course, that did not happen.”\n\nWhile Lovett did at least get to join his Large Band in the studio and record the basic tracks for “12th of June,” the pandemic had a huge effect on the work required from that point forward to finish the album.\n\n“My recording process is such that I’m usually in the room for every playback and every change,” he said. “Part of making a record is getting to be in the room and getting to work (in person) with your producer and recording engineer — and with the musicians, of course, which I got to do on this one. But the post-production is a very important part of the record and a very important part of enjoying making a record. So I hope we don’t ever have to make a record in isolation again.”\n\nSo better late than never, fans of Lovett finally have new music to enjoy. And while Lovett, one of music’s finest and most literate songwriters, has done his share of excellent albums that lean toward country and feature a good bit of acoustic instrumentation (like his second album, 1987’s “Pontiac,” 1992’s “Joshua Judges Ruth” or even “Release Me”), “12th of June” is his third studio album to be billed with his Large Band.\n\nWith this 14-member ensemble of talented musicians, Lovett is able to greatly expand his musical reach. That’s obvious right from the start of the Chuck Ainlay-produced “12th of June,” which opens with a version of jazz great Horace Silver’s “Cookin’ at the Continental,” a lively instrumental that lets the Large Band showcase their considerable chops. Three duets with Lovett’s long-time vocal counterpart, Francine Reed, further cement the jazz credentials of all involved as they tackle two songs associated with Nat King Cole, the peppy “Straighten Up & Fly Right,” the bluesy ballad “Gee Baby, Ain’t I Good To You,” as well as the David Frishberg-panned standard “Peel Me A Grape.”\n\nLovett’s more country-leaning sound emerges on the ballads “Her Loving Man,” “The Mocking Ones” and the title track, while “Pig Meat Man” puts a bit of soul and blues into the mix and “Are We Dancing” adds a string-laden ballad that is rooted in the pre-rock and roll era.\n\nThe long gap between “12th of June” and Lovett’s previous album was largely the product of being between record deals and needing time to figure out how he wanted to release his next collection of songs, coupled with a major development in Lovett’s personal life – his marriage to long-time girlfriend April Kimble in 2017, followed by the birth of the couple’s twins, Will and Ella. Along with touring commitments – Lovett tends to play around 100 concerts during normal years – these factors absorbed a lot of time over the past decade.\n\nAs someone who always wanted to have kids, Lovett is relishing his life as a husband and father.\n\n“I always imagined having children. Then I got to a point I thought I guess I probably won’t have children,” Lovett said. “I always thought I wanted (kids), but I had no idea, I just had no idea how much I’d enjoy it. It really has been a miraculous experience. I know other people have had children before. I’m not the only one. But it does sort of feel that way when you’re going through it yourself. It’s just something that you have to experience to be able to understand what it’s like.”\n\nMarriage and fatherhood figure prominently into the lyrics of the original songs on “12th of June.” “Her Loving Man” is a sweet tribute to Kimble and her intelligence, wisdom and warmth. The title song is a touching tune that imagines a father carrying his love for his wife and children into the next life and also the twins’ birthday. Lovett applies his trademark wry humor to “Pants is Overrated,” which was inspired one day when his children were resisting the idea of getting dressed, and to “Pig Meat Man,” an ode to pork.\n\n“I did focus on these particular songs and wanted it really to represent this part of my life because it really is the main thing going on for me,” he said. “I thought, of (the) subjects I can authentically represent, that (fatherhood) really is the best one right now. And it’s important to me. I hope one day when my children are old enough to understand those songs and understand what they’re about that they will take from that, that their dad loved them. That’s all I really care about.”\n\nLyle Lovett and His Large Band\n\nWhen: 8 p.m. Wednesday, July 5\n\nWhere: The Coach House, 33157 Camino Capistrano Suite C, San Juan Capistrano\n\nTickets: Sold-out; All-ages. Call 949-496-8930 to check for additional tickets or to be put on the waitlist.\n\nAlso: 8 p.m. Monday, July 3-Tuesday, July 4 at Belly Up Tavern, 143 S. Cedros Ave., Solana Beach. 21-and-older only. Tickets are $155 at Ticketweb.com. 8 p.m. Thursday, July 6 at Saban Theatre, 8440 Wilshire Blvd., Beverly Hills 18-and-older only unless accompanied by an adult. Tickets start at $68 at AXS.com."
    }
]