[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMixwFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG9jdXJyZW5jeS1hbmFseXRpY3MtaW5zaWdodC9zb2xhbmEtc29sLXByaWNlLXByZWRpY3Rpb24tZXhwZXJ0LWFuYWx5c2lzLXVsdGltYXRlLXNvbGFuYS1ndWlkZS11bnJhdmVsaW5nLXRoZS1mdXR1cmUtb2Ytc29sYW5hLWFuZC10aGUtcmlzaW5nLXByb21pbmVuY2Utb2YtYXBlbWF40gHRAWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2FtcC9zdG9yeS9jcnlwdG9jdXJyZW5jeS1hbmFseXRpY3MtaW5zaWdodC9zb2xhbmEtc29sLXByaWNlLXByZWRpY3Rpb24tZXhwZXJ0LWFuYWx5c2lzLXVsdGltYXRlLXNvbGFuYS1ndWlkZS11bnJhdmVsaW5nLXRoZS1mdXR1cmUtb2Ytc29sYW5hLWFuZC10aGUtcmlzaW5nLXByb21pbmVuY2Utb2YtYXBlbWF4?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Solana SOL Price Prediction Expert Analysis | Ultimate Solana Guide: Unraveling the Future of Solana and the Rising Prominence of ApeMax - Analytics Insight",
        "content": "The buzz around Solana's trajectory is palpable. Concurrently, the ApeMax Presale is creating ripples of its own. This golden opportunity allows early participants to lay their hands on ApeMax coins at discounted prices. Here's the twist: the presale price increases daily. By acting swiftly, one might secure up to 50% discounts with the Early Bird Loot Boxes. As discussions about Solana (SOL) intensify, ApeMax resonates as a new project with mounting momentum."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8xMy9zb2xhbmEtc29sLWxvb2tzLWxpa2UtZXRoZXJldW0taW4tMjAxOC13aXRoLXBvdGVudGlhbC10by1kby13ZWxsLXNheXMtZXgtZ29sZG1hbi1zYWNocy1leGVjdXRpdmUv0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzEzL3NvbGFuYS1zb2wtbG9va3MtbGlrZS1ldGhlcmV1bS1pbi0yMDE4LXdpdGgtcG90ZW50aWFsLXRvLWRvLXdlbGwtc2F5cy1leC1nb2xkbWFuLXNhY2hzLWV4ZWN1dGl2ZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Solana (SOL) Looks Like Ethereum in 2018 With Potential To Do Well, Says Ex-Goldman Sachs Executive - The Daily Hodl",
        "content": "Former Goldman Sachs executive Raoul Pal says that Solana (SOL) looks reminiscent of Ethereum (ETH) during its bear market of 2018 and 2019.\n\nIn a new interview, the Real Vision founder says that SOL, which is his second biggest crypto portfolio allocation, is most likely about to repeat Ethereum’s dramatic recovery from a bear market to new highs just years ago.\n\n“It’s still my second largest holding. I really like it. It reminds me of ETH in 2018-2019. I think there’s a huge amount of activity. I think [Solana founder Anatoly Yakovenko] has proven himself to be one of the better leaders and thinkers in this space, kind of in the Vitalik [Buterin] mode. I think the developer activity is great. I think on-chain activity is great. The Innovation is great. So, there is a probabilistic outcome that it does well.\n\nIt doesn’t mean I’m right or wrong, but yes, I’m still very interested in Solana.”\n\nAccording to Pal, crypto is part of the biggest macro setup in history as he believes the asset class will directly benefit from the rapid evolution of technology and the debasement of fiat currencies.\n\n“I’ve seen what I think is the biggest macro setup of all time, which is the exponential age meets crypto meets quantitative easing. Those are so explosive and I think it repeats over the next few years, but I want to have all of my excess savings in that. Because it’s a once-in-a-lifetime opportunity to me.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Quardia"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8xMy9zb2xhbmEtc29sLWxvb2tzLWxpa2UtZXRoZXJldW0taW4tMjAxOC13aXRoLXBvdGVudGlhbC10by1kby13ZWxsLXNheXMtZXgtZ29sZG1hbi1zYWNocy1leGVjdXRpdmUv0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzEzL3NvbGFuYS1zb2wtbG9va3MtbGlrZS1ldGhlcmV1bS1pbi0yMDE4LXdpdGgtcG90ZW50aWFsLXRvLWRvLXdlbGwtc2F5cy1leC1nb2xkbWFuLXNhY2hzLWV4ZWN1dGl2ZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Solana (SOL) Looks Like Ethereum in 2018 With Potential To Do Well, Says Ex-Goldman Sachs Executive - The Daily Hodl",
        "content": "Former Goldman Sachs executive Raoul Pal says that Solana (SOL) looks reminiscent of Ethereum (ETH) during its bear market of 2018 and 2019.\n\nIn a new interview, the Real Vision founder says that SOL, which is his second biggest crypto portfolio allocation, is most likely about to repeat Ethereum’s dramatic recovery from a bear market to new highs just years ago.\n\n“It’s still my second largest holding. I really like it. It reminds me of ETH in 2018-2019. I think there’s a huge amount of activity. I think [Solana founder Anatoly Yakovenko] has proven himself to be one of the better leaders and thinkers in this space, kind of in the Vitalik [Buterin] mode. I think the developer activity is great. I think on-chain activity is great. The Innovation is great. So, there is a probabilistic outcome that it does well.\n\nIt doesn’t mean I’m right or wrong, but yes, I’m still very interested in Solana.”\n\nAccording to Pal, crypto is part of the biggest macro setup in history as he believes the asset class will directly benefit from the rapid evolution of technology and the debasement of fiat currencies.\n\n“I’ve seen what I think is the biggest macro setup of all time, which is the exponential age meets crypto meets quantitative easing. Those are so explosive and I think it repeats over the next few years, but I want to have all of my excess savings in that. Because it’s a once-in-a-lifetime opportunity to me.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Quardia"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LnRoZWNvaW5yZXB1YmxpYy5jb20vMjAyMy8wOC8xMy9zb2xhbmEtc2FnYS10aGUtd2ViMy1zbWFydHBob25lLXRvLWJ1eS1hbmQtc2VsbC1jcnlwdG9jdXJyZW5jeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Solana SAGA: The Web3 Smartphone to Buy and Sell Cryptocurrency - The Coin Republic",
        "content": "The vision of Anatoly Yakovenko turned into reality with the launching of Solana Saga, a Web3 smartphone for crypto trading. Anatoly Yakovenko, the cofounder of Solana, imagined developing a handheld computer with the expectation for crypto to go mobile. Saga, a Web3 phone was launched in April 2023 and is finally available for the local public. Let’s take a look at the features and functionality of a newly launched smartphone.\n\nWhat is Solana SAGA?\n\nSolana Saga is an android smartphone introduced by Solana Blockchain company in 2023 with the purpose to make crypto-related functions easier and more efficient. The overall functioning of the smartphone is usual as other Android phones and involves a decentralized application (DApp) store offering a seamless experience with the DApps and Crypto wallets.\n\nFocusing on the technical specifications, the phone comes up with 512 gigabytes of memory, a Snapdragon 8+ Gen1 processor, and 12 gigabytes of RAM. The smartphone ensures a high level of security, offering a secure way to save master passwords or storing of seed phrases.\n\nHow Can the Web3 Smartphone be Used to Buy and Sell Cryptos?\n\nSolana SAGA can be a bit confusing for newcomers, but probably worthwhile for individuals investing tens of thousands of dollars in Crypto. The main feature that makes the smartphone unique compared to usual smartphones is its dApp store holding around 21 dApps for download. The setup of the phone is easy and involves the creation of a Solana wallet and a seed vault where the phase is stored and can be unlocked using sign transactions and wallets. The dApp store plays a vital role in accessing applications and networks including games, social categories, and DeFi. Access to several dApps and offers rewards or tokens when starting with Saga. The phone made it for the users to Swap USD coins into Solana using the fingerprint sensor using the Phantom Wallet.\n\nAnother main feature of Solana SAGA is the easy minting of NFTs which makes NFT purchasing cost-efficient. The minting will be approved instantly which is another major benefit of the web3 phone to the crypto users. Apart from this, other applications will work normally as the phone relies on the Android ecosystem and supports the applications. Solana Saga phone is available in the Android version and is expected to launch its iPhone in the upcoming years. The current retail price of the Web3 smartphone is around $1000 apiece and has the potential to beat Android and iPhone in the near future.\n\nConclusion\n\nTo make the buying and selling of digital assets more easy and efficient, Solana blockchain company came up with a new idea. The company launched Solana SAGA, a web3 smartphone embedded with the dApp store. The phone offers usually functioning of the Android applications and included dApp stores offering several applications, DeFi, and websites supporting cryptocurrency. The phone is emerging as one of the safest and most efficient platforms for individuals trading digital assets for tens of thousands of dollars."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zaGliYS1pbnUtc3VyZ2VzLWRlZ29kcy1zZWFzb24tMDExNjA3ODg2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Shiba Inu surges; DeGods Season 3 unveiled; risk sentiment improves for US stocks - Yahoo Finance",
        "content": "Bitcoin dipped slightly Monday morning in Asia, having hovered around the $29,380 level throughout the weekend. Ether and most other top 10 non-stablecoin cryptocurrencies by market capitalization were little changed. The exceptions were Dogecoin, which saw a significant dip, and Shiba Inu. The dog-themed memecoin surged ahead of its upcoming layer-2 network launch. Elsewhere, the Forkast 500 NFT index dropped after a week of green ink, while risk sentiment in U.S. equities improved as traders assess the latest inflation data. Investors now await a raft of earnings reports throughout the week.\n\nShiba Inu cracks top 10 non-stablecoin crypto list\n\nBitcoin dipped 0.10% in the last 24 hours to US$29,375.75 as of 5:45 a.m. in Hong Kong but added 0.96% for the week, according to CoinMarketCap data. The world’s largest cryptocurrency hovered around the same price level throughout the weekend.\n\nEther was up 0.11% to US$1,849.50 for a weekly gain of 1.00%.\n\nAnalysts continue to predict a market upswing ahead of various U.S. application rulings for spot Bitcoin exchange traded funds (ETFs).\n\nIn June 2023, BlackRock and a number of major U.S. financial institutions filed applications with the U.S. Securities and Exchange Commission (SEC) to create spot Bitcoin ETFs. The SEC has previously rejected several spot Bitcoin ETF applications, citing concerns about market manipulation and volatility. However, the recent burst of applications has raised hopes that investors may soon see a spot Bitcoin ETF.\n\nThe SEC was expected to announce its decision on Ark Investment’s Spot Bitcoin ETF application on Aug. 13. However, the regulator said in a Friday filing that it will solicit public comment on the ETF proposal, effectively pushing back the deadline.\n\n“Although the chances of imminent ETF-related news are slim, any announcement would likely have a more pronounced effect on BTC than on ETH,” said Luuk Strijers, chief commercial officer of Panama-based crypto derivatives exchange Deribit.\n\n“We are observing a slight uptick in BTC, especially visible versus ETH. A potential catalyst for this could be the looming ETF news on the shorter term and the halvening impact on the longer run,” Strijers added.\n\nBitcoin’s next halving event is expected to take place in April 2024. The halving event will see the amount of new Bitcoin issued cut in half, increasing its scarcity. This is widely anticipated to produce a surge in the token’s price.\n\nOther top 10 non-stablecoin cryptocurrencies were largely static Monday morning, with the exception of memecoins Dogecoin and Shiba Inu.\n\nStory continues\n\nWhile Dogecoin dropped 2.11% to US$0.07524, slipping 0.25% in the last seven days, the Shiba Inu memecoin briefly cracked CoinMarketCap’s top 10 cryptocurrency list over the weekend. It pushed Polkadot’s DOT down to eleventh in terms of market capitalization. The meme token then fell 3.01% to US$0.00001042 over the past 24 hours, but still recorded an 11% gain for the week.\n\nThe developers behind Shiba Inu are expected to launch its layer-2 network, Shibarium, at an unspecified date in the near future. The update aims to provide self-sovereign identity (SSI) protocols for improved user security, according to a Shiba Inu blog post uploaded on Aug. 6.\n\nThe total crypto market capitalization grew 0.09% in the past 24 hours to US$1.17 trillion, while trading volume also increased 7.08% to US$17.82 billion.\n\nDeGods unveil Season 3 artwork\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe main Forkast 500 NFT index fell 0.52% in the past 24 hours to 2,480.44 as of 06:45 a.m. in Hong Kong. However, it recorded a 0.95% gain for the week. Meanwhile, Forkast’s Ethereum NFT Index logged gains, while the indexes measuring the Polygon, Cardano and Solana NFTs showed losses.\n\nTotal NFT trading volume dropped 5.35% in the past 24 hours to over US$13.92 million, according to data from CryptoSlam.\n\nSales volume on Ethereum, the largest NFT network, dipped 1.75% to US$8.63 million. Solana and Polygon, which placed second and third on Cryptoslam’s NFT blockchain ranking respectively, also logged losses.\n\nIn terms of NFT collections, trade volume of Ethereum-based DeGods surged 133.20% to US$1 million. That followed the launch of its “Season 3” digital art collection Sunday. The update features a more simplistic, pop-art inspired style.\n\n1. We thought DeGods needed to be \"serious\".\n\n\n\nThat was our mistake. After digesting the community feedback, we realized that we were wrong.\n\n\n\nDeGods are fun. So, we made them fun. pic.twitter.com/1OGILwWs5c — DeGods (@DeGodsNFT) August 13, 2023\n\n“I’m expecting [the trade volume] to ramp up quite a bit, honestly, I think the reception for the artwork has been rather great,” said Yehudah Petscher, NFT strategist for Forkast Labs, adding that the collection release had postponed scheduled updates for female avatars.\n\n“Let’s watch over the next couple of days, see how the community, the NFT collectors, take to this artwork and how they take to the delays,” he said.\n\nNFT staple Bored Ape Yacht Club added 2.90% to US$903,726, placing second on CryptoSlam’s collection ranking.\n\nMeanwhile, the FC Barcelona soccer club announced last Friday that it has secured around US$132 million from global investment holding company Libero Football Finance AG and European investment company Nipa Capital B.V. The investment will be used to expand the club’s NFT and metaverse initiatives, the announcement confirmed.\n\nChina woes affecting global markets\n\nBeijing, China at the Zhengyangmen Gatehouse in Tiananmen Square | Image: Envato Elements\n\nU.S. stock futures fell as of 11:00 a.m. in Hong Kong on Monday morning after the three main indexes closed mixed on Friday. The main Asian equity indexes — ​​China’s Shanghai Composite, Hong Kong’s Hang Seng, Japan’s Nikkei and South Korea’s Kospi — all posted losses during Monday morning trading.\n\nGlobal markets continue to process China’s release last week of downward trending economic data. Consumer prices for July were down on the year before, while July’s year-on-year export data also fell more sharply than expected. Investors now await China’s national retail sales and industrial output data — set for release Tuesday — for further indicators of potential deflation.\n\nAt a fundraiser in Utah Thursday, U.S. President Joe Biden appeared to fan the flames of Sino-U.S. tension by referring to China’s reported economic woes. The Chinese economy, he said, “is a ticking time bomb” and “in trouble.”\n\nIn the U.S, Friday’s release of the latest producer price index (PPI) data — a key inflation indicator that monitors selling prices received by domestic producers of goods and services — recorded a rise for July. The 0.3% rise is slightly higher than the 0.2% forecast by analysts.\n\nDespite that rise, the overall expectation is for the U.S. Federal Reserve to pause its cycle of interest rate hikes when it next meets in September. However, some market analysts continue to sound a note of caution, warning that hikes could continue until inflation slows to the Fed’s 2% target.\n\n“Unfortunately, I don’t think the picture on any of this will be clear for at least two quarters, though the fact that inflation has come down has bought the Fed some time, for now,” Jonathan Millar, a senior economist at London-based financial group Barclays Capital Inc., told Bloomberg.\n\n“The Fed seems to be well ahead of markets in recognizing that the path to a soft landing is far from assured,” Miller added.\n\nThe Fed meets on Sep. 19 to make its next move on interest rates, which are now between 5.25% to 5.50%, the highest level in the past 22 years. Analysts at the CME FedWatch Tool predict a 88.5% chance there will be no interest rate hike in September, down from 89.0% last Friday.\n\nInvestors now await more earnings reports expected later this week, including quarterly results from U.S. retail leaders including Walmart, Home Depot and Target.\n\n(Updates to add equities section)"
    }
]