[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMjMvbmV4dC1ldm9sdXRpb24tb2YtYmxvY2tjaGFpbi1zb2Z0d2FyZS1oYXMtb25seS1qdXN0LXN0YXJ0ZWQtYmFuay1vZi1hbWVyaWNhL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMjMvbmV4dC1ldm9sdXRpb24tb2YtYmxvY2tjaGFpbi1zb2Z0d2FyZS1oYXMtb25seS1qdXN0LXN0YXJ0ZWQtYmFuay1vZi1hbWVyaWNhL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Next Evolution of Blockchain Software Has Only Just Begun: Bank of America - CoinDesk",
        "content": "Next Evolution of Blockchain Software Has Only Just Begun: Bank of America\n\nPlatforms like Near, Polkadot and Cardano are using new approaches to improve the trade-off between scalability, decentralization and security, a report from the bank said.\n\nBy Will Canny Mar 23, 2023 at 11:02 a.m. UTC"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NvaW5iYXNlLW1vdmVzLXRvLW9uLWNoYWluLXN0YWtpbmctZm9yLXRlem9zLWNvc21vcy1zb2xhbmEtYW5kLWNhcmRhbm8v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Coinbase moves to on-chain staking for Tezos, Cosmos, Solana, and Cardano - CryptoSlate",
        "content": "Coinbase has begun its transition to on-chain staking for four cryptocurrency assets, according to an announcement on March 23.\n\nFour assets affected, one discontinued\n\nCoinbase’s announcement and an attached help page say that customers will “earn rewards from the protocol, not Coinbase” under the new approach. Th firm says that its only role will be to connect customers to validators on the relevant blockchain.\n\nCoinbase will pause staking and unstaking beginning on March 24 and will resume those capabilities on March 29. Users will continue to earn funds during that time.\n\nThe policy applies to four of the five assets that can be staked through Coinbase: Tezos (XTZ), Cosmos (ATOM), Solana (SOL), and Cardano (ADA).\n\nThe policy does not apply to Ethereum (ETH) staking, which is also supported by Coinbase. This is likely due to the fact that Ethereum does not yet support stake withdrawals and has high technical and deposit requirements for on-chain staking.\n\nCoinbase also said that Algorand (ALGO) staking will be discontinued on March 29. The company will nevertheless pay out remaining ALGO staking rewards to users and will continue to support ALGO trading on its main exchange.\n\nDid regulations lead to the change?\n\nIt is unclear whether the actions are related to the Wells notice that Coinbase has received from securities regulators. Statements from Coinbase today suggest that the changes were scheduled as early as March 10 — prior to its receipt of that notice.\n\nIt is possible that the changes were influenced by Coinbase’s February warning that the U.S. Securities and Exchange Commission (SEC) intends to take action against retail staking products. The SEC later took action against Kraken, which may have motivated Coinbase to introduce a staking service in which it only plays a minimal role.\n\nAlgorand Foundation CEO Staci Warden said that Coinbase told her that it is reexamining its services following regulatory scrutiny. Warden was seemingly unaware of Coinbase’s Wells Notice until a commenter in that Twitter thread informed her of the development.\n\nElsewhere, Coinbase said in a statement to Cointelegraph that it halted Algorand staking for customer experience reasons. It has not commented on reasons for the other changes.\n\nMentioned in this article"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NvaW5iYXNlLW1vdmVzLXRvLW9uLWNoYWluLXN0YWtpbmctZm9yLXRlem9zLWNvc21vcy1zb2xhbmEtYW5kLWNhcmRhbm8v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Coinbase moves to on-chain staking for Tezos, Cosmos, Solana, and Cardano - CryptoSlate",
        "content": "Coinbase has begun its transition to on-chain staking for four cryptocurrency assets, according to an announcement on March 23.\n\nFour assets affected, one discontinued\n\nCoinbase’s announcement and an attached help page say that customers will “earn rewards from the protocol, not Coinbase” under the new approach. Th firm says that its only role will be to connect customers to validators on the relevant blockchain.\n\nCoinbase will pause staking and unstaking beginning on March 24 and will resume those capabilities on March 29. Users will continue to earn funds during that time.\n\nThe policy applies to four of the five assets that can be staked through Coinbase: Tezos (XTZ), Cosmos (ATOM), Solana (SOL), and Cardano (ADA).\n\nThe policy does not apply to Ethereum (ETH) staking, which is also supported by Coinbase. This is likely due to the fact that Ethereum does not yet support stake withdrawals and has high technical and deposit requirements for on-chain staking.\n\nCoinbase also said that Algorand (ALGO) staking will be discontinued on March 29. The company will nevertheless pay out remaining ALGO staking rewards to users and will continue to support ALGO trading on its main exchange.\n\nDid regulations lead to the change?\n\nIt is unclear whether the actions are related to the Wells notice that Coinbase has received from securities regulators. Statements from Coinbase today suggest that the changes were scheduled as early as March 10 — prior to its receipt of that notice.\n\nIt is possible that the changes were influenced by Coinbase’s February warning that the U.S. Securities and Exchange Commission (SEC) intends to take action against retail staking products. The SEC later took action against Kraken, which may have motivated Coinbase to introduce a staking service in which it only plays a minimal role.\n\nAlgorand Foundation CEO Staci Warden said that Coinbase told her that it is reexamining its services following regulatory scrutiny. Warden was seemingly unaware of Coinbase’s Wells Notice until a commenter in that Twitter thread informed her of the development.\n\nElsewhere, Coinbase said in a statement to Cointelegraph that it halted Algorand staking for customer experience reasons. It has not commented on reasons for the other changes.\n\nMentioned in this article"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3Mvc29sYW5hL3NvbGFuYS1wcmljZS1tYXktZmFsbC10by0yMS1iZWZvcmUtaXQtc3RhZ2VzLWFub3RoZXItcmVjb3Zlcnkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 19:34:43 GMT",
        "title": "Solana Price May Fall To $21 Before It Stages Another Recovery - NewsBTC",
        "content": "Over the last week, the price of Solana has risen. During the same time frame, SOL surged close to 17%. Although the bulls were in the market, SOL was not entirely out of the woods. The price was dragged to the $21 mark recently after the bears attempted to drag the price down.\n\nRelated Reading\n\nNew Proposal Wants To Burn All Coins In LUNC Oracle Pool, Will This Help The Price? 1 year ago\n\nThe technical outlook of Solana depicted that the bulls were present on the one-day chart. Buying strength registered an increase as demand also moved up. With demand going north, accumulation also noted a positive change.\n\nThe asset’s price must remain above the $21 support level; otherwise, a fall through that price mark will bring the bears back in full force. As Bitcoin tries to break past the $28,500 level, other altcoins also attempt to target their immediate price ceiling.\n\nThe movement of the king coin will determine the price direction of other altcoins. The volatility of the SOL price will start declining once the demand for the altcoin stabilizes over the upcoming trading sessions.\n\nSolana Price Analysis: One-Day Chart\n\nSOL was trading at $22.50 at the time of writing. Over the past trading sessions, however, the bears dragged the price to the crucial support line of $21.50. The local support level for the coin was $21.\n\nThe $21 price level has acted as a propelling point for the altcoin, so another dip to this level might shoot the price to $23 or above. The inability to sustain a price above $21 will bring SOL to $20.\n\nOn the other hand, overhead resistance for SOL was at $23.40; breaching past that will push the price to $24. This level may act as strict resistance for the altcoin.\n\nTechnical Analysis\n\nSOL has depicted a recovery in buying strength over the last trading session. The Relative Strength Index noted an uptick and moved near the 60-mark, meaning the buyers were in charge of the market. Similarly, with increased demand, SOL moved above the 20-Simple Moving Average (SMA) line.\n\nThis indicated that buyers were driving the price momentum in the market. SOL price is standing at a crucial point because a slight push from buyers will take the altcoin above the 50-SMA and 200-SMA lines, respectively. That would be a sign of increased bullishness.\n\nThe Moving Average Convergence Divergence depicts the price momentum, which turned positive. The green histograms were related to buy signals for the altcoin. Buyers’ interest also grew as SOL remained bullish in the past few days.\n\nRelated Reading\n\nCardano Has To Trade Above This Level To Breach The $0.40 Mark 1 year ago\n\nThis usually means that there could be an upward increase in price over the next trading session. The Chaikin Money Flow reads the capital inflows and outflows at a given time. The indicator noted a small uptick pushing the capital inflows into the positive zone.\n\nFeatured Image From UnSplash, Charts From TradingView.com"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMizAFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLW1hcmNoLTIzLWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLXJpcHBsZS14cnAtbHRjLXVzLWZlZC1yYXRlLWhpa2UtZ2FpbmVyLWxvc2VyLTE1OTAzMzDSAdABaHR0cHM6Ly9uZXdzLmFicGxpdmUuY29tL2J1c2luZXNzL2NyeXB0by9jcnlwdG9jdXJyZW5jeS1wcmljZS10b2RheS1pbi1pbmRpYS1tYXJjaC0yMy1jaGVjay1nbG9iYWwtbWFya2V0LWNhcC1iaXRjb2luLWJ0Yy1ldGhlcmV1bS1kb2dlLXNvbGFuYS1saXRlY29pbi1yaXBwbGUteHJwLWx0Yy11cy1mZWQtcmF0ZS1oaWtlLWdhaW5lci1sb3Nlci0xNTkwMzMwL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 23 Mar 2023 07:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin, Ethereum Lose Steam Litecoin Becomes Top Gainer - ABP Live",
        "content": "Bitcoin (BTC) and Ethereum (ETH), two of the most popular crypto coins in the world, snapped their streaks early Thursday morning following an increase in interest rates by the US Federal Reserve. Other popular altcoins — including the likes of Dogecoin (DOGE), Solana (SOL), and Ripple (XRP) — landed in the reds across the board. Litecoin (LTC), on the other hand, emerged to be the biggest gainer of the lot, with a 24-hour jump of over 7 percent.\n\nThe global crypto market cap stood at $1.15 trillion at the time of writing, registering a 24-hour loss of 3.03 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $27,448.87, registering a 24-hour loss of 2.73 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 24.25 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,740.93, marking a 24-hour dip of 3.49 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.53 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour loss of 3.20 percent, as per CoinMarketCap data, currently priced at $0.07394. As per WazirX, Dogecoin price in India stood at Rs 6.49.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour jump of 7.13 percent. At the time of writing, it was trading at $87.70. LTC price in India stood at Rs 7,527.51.\n\nRipple (XRP) price today\n\nXRP price stood at $0.4207, seeing a 24-hour loss of 8.73 percent. As per WazirX, Ripple price stood at Rs 36.99.\n\nSolana (SOL) price today\n\nSolana price stood at $21.35, marking a 24-hour dip of 4.50 percent. As per WazirX, SOL price in India stood at Rs 1,963.\n\nTop crypto gainers today (March 23)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nLitecoin (LTC)\n\nPrice: $87.99\n\n24-hour gain: 7.34 percent\n\nAptos (APT)\n\nPrice: $12.63\n\n24-hour gain: 4.13 percent\n\nStacks (STX)\n\nPrice: $1.14\n\n24-hour gain: 3.43 percent\n\nFlare (FLR)\n\nPrice: $0.0316\n\n24-hour gain: 3.42 percent\n\nSingularityNET (AGIX)\n\nPrice: $0.04847\n\n24-hour gain: 2.66 percent\n\nTop crypto losers today (March 23)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nHuobi Token (HT)\n\nPrice: $3.62\n\n24-hour loss: 10.14 percent\n\nTRON (TRX)\n\nPrice: $0.06102\n\n24-hour loss: 9.11 percent\n\nKava (KAVA)\n\nPrice: $0.8654\n\n24-hour loss: 8.55 percent\n\nRipple (XRP)\n\nPrice: $0.423\n\n24-hour loss: 8.40 percent\n\nMAGIC (MAGIC)\n\nPrice: $1.73\n\n24-hour loss: 7.71 percent\n\nWhat crypto exchanges are saying about the current market scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “Following the announcement of a 25 basis point-increase in interest rates by the US Federal Reserve and their emphasis on prioritising inflation despite the recent banking crisis, most cryptocurrencies experienced a decline. Bitcoin's value dropped below $27,000 after the decision but has since risen to $27,300. On Wednesday, BTC's price surged to $28,700, its highest point since June, as some investors hoped that the Fed would cease its hawkish interest rate hikes in light of recent bank failures.”\n\nKunji founder Anurag Dixit offered his take, “The price of Bitcoin experienced a significant pullback following the release of a statement from the US Federal Reserve regarding interest rates. The Fed announced that while they are committed to supporting the economic recovery, they believe that raising interest rates aggressively may not be appropriate at this time. This caused some uncertainty and volatility in the market, leading to Bitcoin's price briefly dropping by over 7 percent to now stabilizing in the $27,300 range.\"\n\nWazirX Vice President Rajagopal Menon said, “Bitcoin and most major cryptos saw a price decline after the Federal Reserve raised interest rates by 25 basis points, prioritising inflation over recent banking crises. Investors hoped for a more dovish approach from the Fed after the banking crisis, but the central bank chose to raise interest rates, causing Bitcoin to dip below $27,000 and Ether to fall to $1,737.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin said, “The US Federal Reserve announced a quarter percentage point hike in key interest rates at its latest meeting on Wednesday. The federal funds rate is now 4.75 percent - 5 percent. However, in light of the recent turmoil in the financial sector following the collapse of two banks, the Fed has signalled that it will hold off on further rate hikes. As a result, the market saw prices drop, with BTC falling from $28,900 to $27,300, ETH to $1,740, ADA down 20 cents to around $0.35, and BNB trading at $320.”\n\nShivam Thakral, the CEO of BuyUCoin, said, “The Bitcoin rally was interrupted by the interest rate hike of 25 basis points announced by the Fed in the latest FOMC meeting. BTC and ETH dropped by 2.48 percent and 3.11 percent, respectively, while other digital assets followed a similar trend. The evolving banking situation in the US is making investors jittery and markets are expected to remain choppy in the coming weeks.”\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    }
]