[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzA4LzMxL3dvbWFuLWJlaGluZC1pbmZhbW91cy1hY3JvYmF0aWMtaG9yc2Utc2hvdy1maWFzY28tYXJyZXN0ZWQtaGlyaW5nLWhpdG1hbi10by1tdXJkZXItaHVzYmFuZC_SAX1odHRwczovL255cG9zdC5jb20vMjAyMy8wOC8zMS93b21hbi1iZWhpbmQtaW5mYW1vdXMtYWNyb2JhdGljLWhvcnNlLXNob3ctZmlhc2NvLWFycmVzdGVkLWhpcmluZy1oaXRtYW4tdG8tbXVyZGVyLWh1c2JhbmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 31 Aug 2023 07:00:00 GMT",
        "title": "Woman behind infamous acrobatic horse show fiasco arrested for hiring hitman to murder husband for $2M - New York Post",
        "content": "A California woman known for her involvement in a failed multi-million dollar horse show that made headlines a decade ago has been charged with trying to hire somebody to kill her husband.\n\nTatyana Remley, 42, was arrested in a sting operation at a Solana Beach Starbucks earlier in August, about a month after her husband Mark Remley discovered she’d offered a mutual friend $2 million to kill him.\n\nMr. Remley went to the police himself after he learned of the plot from the same friend his estranged wife bribed to kill him.\n\nAfter the arrest, he also told cops she burned his house to the ground days before trying to arrange the hit, the Coast News reported.\n\nMs. Remley also faces charges for possession of a loaded firearm not registered to her.\n\nShe faces up to nine years in prison for the murder plot, plus another year for the weapons charges.\n\n4 Tatyana Remley, 42, was arrested in early August for the plot Facebook/Tatyana Remley\n\n4 Tatyana Remley on horseback with her husband Mark Remley Facebook/Tatyana Remley\n\nThe incident was just the latest in the couple’s tumultuous 12-year marriage.\n\nMarried in 2011, the Remleys made headlines a year later after they organized an elaborate multi-million dollar 45-show equestrian acrobatics show called Valitar.\n\nThe extravaganza was canceled after just a few performances, however, and its crew and performers were left empty-handed.\n\nOver the years the couple has filed for divorce and rekindled the marriage numerous times, and each has accused the other of committing violence against the other.\n\nIn their most recent divorce filing in May, Ms. Remley accused her husband of putting a gun to her head in one incident, chasing her around their house with a knife in another, and firing a gun in their home during an argument in a third.\n\nMs. Remley also alleged she was sexually assaulted at gunpoint by a friend while her husband was present.\n\n4 Tatyana Remley and her husband lived a high-flying life together Facebook/Tatyana Remley\n\n4 Remley and her husband have filed for divorce numerous times Facebook/Tatyana Remley\n\nDespite their troubles, the pair maintained a lavish lifestyle together, which involved numerous homes, sports cars, boats, travel, exotic pets, and considerable monthly expenses, according to documents from their latest divorce filing.\n\n“Wife is experiencing extreme financial strain. She is unable to maintain her realistic monthly expenses of just $12,000, much less [than] what she was accustomed to at $50,000,” a petition seeking spousal support read.\n\n“She has no income and does not have the same access to funds and assets that Respondent does.”\n\nIn addition to the monthly stipend, Ms. Remley demanded access to one of their homes, two of their trucks, an ATV, and their pet parrot.\n\nMr. Remley has denied his wife’s allegations.\n\nShe remains behind bars and is due in court in October."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5kZWxtYXJ0aW1lcy5uZXQvbmV3cy9zdG9yeS8yMDIzLTA4LTMxL2NhbGlmb3JuaWEtaGlnaHdheS1wYXRyb2wtcmVsZWFzZXMtZS1iaWtlLXNhZmV0eS1wcm9ncmFtLWFzLXJlcXVpcmVkLWJ5LXRhc2hhLWJvZXJuZXJzLWFiLTE5NDbSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 31 Aug 2023 07:00:00 GMT",
        "title": "California Highway Patrol releases e-bike safety program as required by Tasha Boerner's AB 1946 - Del Mar Times",
        "content": "Solana Beach City Council recently approved an ordinance to help improve safety for bicyclists. Encinitas and Carlsbad have already adopted similar traffic safety regulations with diversion programs for bicycles.\n\nThe California Highway Patrol released an online e-bike safety program , as required by a state law that the governor signed last year.\n\nThe law, AB 1946, authored by Assemblymember Tasha Boerner, D-Encinitas, was signed by the governor last fall. It gave CHP a September 2023 deadline to release an e-bike program in response to the rise in e-bikes on California roads, which has led to a rise in traffic collisions involving e-bikes .\n\n“I am excited to see the release of the California Highway Patrol’s e-bike training program,” Boerner said in a statement. “I’m especially grateful for their time and effort spent collaborating with a diverse group of relevant stakeholders. I hope every e-bike rider takes the time to review e-bike safety, emergency maneuver skills, rules of the road, and other laws related to e-bikes.”\n\nThe online course has 11 sections that cover topics such as proper equipment and gear, rules of the road and bicycle laws, avoiding hazards and best practices.\n\nAB 1946 was approved last year by the state Assembly 73-0, with seven members not voting, and 37-0 in the Senate, with three not voting, before being signed into law by Gov. Gavin Newsom.\n\nLocal cities have also been taking steps to improve bicycle safety. Encinitas and Carlsbad have adopted diversion programs, which allow first-time violators to take an approved online safety course when they receive citations on their bicycles or e-bikes. The Solana Beach City Council also recently approved an ordinance , which is pending a second reading next month, that would include a diversion program.\n\nAnother bill by Boerner, AB 530, would require e-bike riders to pass an online test and get a state-issued identification card if they don’t have drivers licenses. The bill, which isn’t headed for the governor’s desk this year, would also ban children 12 and under from riding e-bikes. It has been met with some opposition from e-bike enthusiasts who agree that new riders, especially children, should take to the roads on e-bikes with more education, but also think the requirements in the bill would be overly burdensome.\n\n“Having photo IDs, getting the DMV involved, I don’t know if it will kill the movement,” Solana Beach resident Karl Rudnick, an instructor with the League of American Bicyclists who teaches e-bike safety classes, said in a recent interview. “Not sure it would change it. I don’t even know how you’d enforce it. Kids don’t run around with ID. It sounds like a nightmare.”\n\nSolana Beach Deputy Mayor David Zito echoed that sentiment during a recent council meeting: “If we’re going to send all these kids to the DMV, that will kill the movement,” referring to local children who ride their e-bikes to school.\n\nBoerner said in a statement last month that AB 530 is at the start of a “long process” that will continue with meetings this fall.\n\n“As a mother and a legislator, I believe that we must act to prevent our youth from injuries and educate parents on the promise and responsibility of e-bikes, and AB 530 is another step to increase their safety while sharing the road,” she said in the statement. “Not every parent is a bike rider that can ensure our youth receive proper training.”"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMivQFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3RoZS1zb2xhbmEtZm91bmRhdGlvbi1pbnRyb2R1Y2VzLW5ldy1zcGVha2Vycy1mb3ItYnJlYWtwb2ludC0yMDIzLWluY2x1ZGluZy1jaW5keS1sZW93LXNoYWhhci1tYWRhci10YXJ1bi1jaGl0cmEtcnlhbi1zZWxraXMtYW5kLW1vcmUtMzAxOTE0OTM4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 31 Aug 2023 07:00:00 GMT",
        "title": "The Solana Foundation Introduces New Speakers for Breakpoint 2023, including Cindy Leow, Shahar Madar, Tarun ... - PR Newswire",
        "content": "Breakpoint will take place at the Solana Campus in Amsterdam from October 30 – November 3 2023\n\nNEW YORK, Aug. 31, 2023 /PRNewswire/ -- The Solana Foundation , a non-profit foundation dedicated to the decentralization, adoption, and security of the Solana network, has announced further details of the speaker lineup for Solana Breakpoint 2023 , with a list including industry leaders such as Cindy Leow, Co-founder, Drift; Peter Robert Moore COO, EA Games; Shahar Madar, Head of Security, Fireblocks; Tarun Chitra, CEO, Gauntlet Network; Joshua Archer, Senior Climate Campaigner, Greenpeace; Ryan Selkis, CEO, Messari; and Jules Urbach, CEO and Founder, The Render Network.\n\nSolana Breakpoint 2023 Solana Breakpoint 2023\n\nThe Breakpoint conference will take place from October 30 – November 3, 2023 at the Solana Campus in Amsterdam, located approximately 15 minutes from the city center. Over the five-day event, keynotes, group panel discussions, workshops, art installations, and project showcases will address the most pressing issues in the crypto economy.\n\nThis year's conference has garnered an extraordinary reaction from both the community and broader blockchain space. This latest addition to the speaker lineup includes impressive speakers from leading projects, large enterprises, and public bodies, serving as evidence of the momentum of this event. Taking place in Amsterdam, a city with deep roots in tech and a strong culture of innovation, Breakpoint will bring together many of the most notable names in Web3 to discuss trends, challenges, and untapped opportunities for the maturing industry.\n\nPreviously announced speakers at Breakpoint 2023 include Armani Ferrante, CEO & Cofounder, Backpack; Sandra Persing, Vice President, Developer & Ecosystem Marketing, Circle; James Tromans, Director Web3 Product & Engineering, Google Cloud; Kanav Kariya, President, Jump Crypto; Pascal Gauthier, CEO, Ledger; Amir Haleem, CEO, Nova Labs; and many more.\n\nNow in its third year, the event attracts developers, artists, content creators, government agencies, large enterprises, and institutions, all of whom come together from around the world to learn about and discuss the impact of cutting-edge distributed technology across sectors.\n\nAlso featured at Breakpoint will be a range of side events ideal for networking and facilitating connections with key groups in the industry. These include MEV Camp, a user-generated unconference targeted at Solana developers, quantitative traders and infrastructure operators; Block Zero - Validator Mini-Conference, a community-run event to discuss the evolution of the network and reinforce the social layer; and 'The DRiP Haus' hosted by Drip, the NFT drop platform, a single day summit focused on collectibles and monetization for artists and creatives on Solana.\n\nNotable Breakpoint sponsors include Circle, Drip, Meural, Neodyme, Neon Labs, Phantom, Pyth, and Texture Finance.\n\nTo attend Breakpoint, tickets can be purchased here ; tickets include full access to the Solana campus, talks, official events, and more.\n\nThe full list of Breakpoint 2023 speakers can be found here .\n\nProjects looking to inquire about sponsorship of Breakpoint 2023, can visit here .\n\nComplete this form to request consideration for Breakpoint 2023 press credentials.\n\nAbout Solana Foundation\n\nThe Solana Foundation is a non-profit foundation based in Zug, Switzerland, dedicated to the decentralization, adoption, and security of the Solana network. For more information, please visit https://solana.org/ .\n\nAbout Solana\n\nSolana is a blockchain built for mass adoption. It's a high performance network that is utilized for a range of use cases, including finance, NFTs, payments, and gaming. Solana operates as a single global state machine, and is open, interoperable and decentralized. For more information, please visit https://solana.com .\n\nMedia Contact\n\nArielle Pennington, Solana Foundation, Head of Communications\n\npress@solana.org\n\nSOURCE Solana Foundation"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vYnJhbmQtc3Rvcmllcy9zb2xhbmEtc29sLXBvbGthZG90LWRvdC1hbmQtcG9tZXJkb2dlLXBvbWQtdGhyZWUtY3J5cHRvY3VycmVuY3ktY29pbnMtdG8tbG9vay1vdXQtZm9yLTEwMTY5Mjg3OTY2NzUwNy5odG1s0gGbAWh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS9icmFuZC1zdG9yaWVzL3NvbGFuYS1zb2wtcG9sa2Fkb3QtZG90LWFuZC1wb21lcmRvZ2UtcG9tZC10aHJlZS1jcnlwdG9jdXJyZW5jeS1jb2lucy10by1sb29rLW91dC1mb3ItMTAxNjkyODc5NjY3NTA3LWFtcC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 31 Aug 2023 07:00:00 GMT",
        "title": "Solana (SOL), Polkadot (DOT) and Pomerdoge (POMD): Three Cryptocurrency Coins to Look Out For - Hindustan Times",
        "content": "As the crypto market volatility bites harder, analysts have sought answers from ChatGPT which highlighted Pomerdoge (POMD), Solana (SOL), and Polkadot (DOT) as tokens investors must invest in for gains.\n\nAs an investor looking for the best possible tokens that'll boost your portfolio and generate massive ROI, you may want to consider these listed tokens from ChatGPT. These tokens, include Solana (SOL) Polkadot (DOT) and Pomerdoge (POMD), and have been shortlisted by the AI due to their massive potential and growth trajectories.\n\nUnlock exclusive access to the latest news on India's general elections, only on the HT App. Download Now! Download Now!\n\nSolana (SOL) Continues Its Bull Run\n\nThe latest price analysis of the Solana (SOL) token has only confirmed ChatGPT's prediction of good things to come for the token. The 24-hour market activity shows that SOL gained a significant 6.43% of its price value. This sees the price of SOL trade at $24.76 at the time of this writing.\n\nThe trading volume of Solana has also experienced a significant 58% increase in market activity within the last 24 hours to see a return of $563.99M.\n\nIt is worth noting that Solana has been on an extended bullish run, as the Solana token has gained over 19% in price value within the last 30 days. These positive stats could add to the reasons ChatGPT is listing Solana as a must-have token.\n\nPolkadot (DOT) Rallies As Imminent Surge Expected\n\nPolkadot (DOT) has had a significant rally in price in the last 24 hours, which may suggest a boost in price within the coming days. Polkadot gained 1.3% in value within the last day to trade at $5.08 currently. The token has also had a trading volume of over 100M within that same time frame.\n\nThis recent rally of Polkadot is coming at the back of an extended downward slip in price value. This is evident in the 7 days stats, which show a 1.7% loss in value for DOT.\n\nAlso, Polkadot lost 2.0% in the last 14 days. However, analysts expect that the recent upturn in price will be the beginning of an extended surge in price value. With ChatGPT listing Polkadot as a coin worth investing in, we anticipate the coin entering a bull run soon.\n\nMoon-Bound Pomerdoge (POMD) Gears at Becoming the King of Memecoins\n\nPomerdoge is making its presence known in the crypto industry as the project receives massive attention in its first presale phase. Pomerdoge is a new P2E gaming platform that connects players around the globe while serving as a platform of digital networking and friendly competition.\n\nAs the Pomerdoge presale heats up, a collection of 7,777 NFTs will be minted and made available only to presale investors of the POMD token. Another benefit that presale buyers will enjoy is a share of the revenue generated from the Pomerdoge platform while positioning themselves for explosive ROI.\n\nYou can also become a presale investor when you buy the Pomerdoge token at the price of only $0.007.The Pomerdoge project has been audited by SolidProof and Cyberscope and will have its liquidity locked for life to prevent a threat to investors' portfolios.\n\nIt is important to invest early in the Pomerdoge project as early investors stand more chance of making significant gains.\n\nFind out more about the Pomerdoge (POMD) Presale Today\n\nDisclaimer: This article is a paid publication and does not have journalistic/ editorial involvement of Hindustan Times. Hindustan Times does not endorse/ subscribe to the contents of the article/advertisement and/or views expressed herein.\n\nThe reader is further advised that Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions.\n\nHindustan Times shall not in any manner, be responsible and/or liable in any manner whatsoever for all that is stated in the article and/or also with regard to the views, opinions, announcements, declarations, affirmations etc., stated/featured in same. The decision to read hereinafter is purely a matter of choice and shall be construed as an express undertaking/guarantee in favour of Hindustan Times of being absolved from any/ all potential legal action, or enforceable claims. The content may be for information and awareness purposes and does not constitute a financial advice."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm9rYXlwbGF5ZXIuY29tL3RoZS13b3JsZC1vZi1ibGFjay1jb3NwbGF5LWlzLWxlYXZpbmctb3V0LWZhdC1wZW9wbGXSAV5odHRwczovL3d3dy5va2F5cGxheWVyLmNvbS9hbXAvdGhlLXdvcmxkLW9mLWJsYWNrLWNvc3BsYXktaXMtbGVhdmluZy1vdXQtZmF0LXBlb3BsZS0yNjY0NzEwMzIx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 31 Aug 2023 18:37:27 GMT",
        "title": "The World of Black Cosplay is Leaving Out Fat People - Okayplayer",
        "content": "Surrounded by a wall with clippings and fanart of the beloved Japanese manga Naruto, Lady Hoekage (yes, her name is a play on Naruto’s Tsunade, better known as “Lady Hokage”) is dressed as one of the series’ most iconic characters — Kakashi. Wearing a green and blue sensei ensemble paired with gray hair, a Konoha headband, and a kunai knife, the content creator and entrepreneur embodies the effortless cool of the shinobi. Like many other people across the world, Hoekage is particularly intrigued by and immersed in the world of cosplay, or the art of dressing up as various characters from shows, cartoons, anime, and other fandoms. She has always been a fan of anime and had a great interest in using it as inspiration for her craft, which ultimately led her to explore cosplaying as another form of content creation. However, she initially had some apprehension about publicly participating in the activity due to her size.\n\n“[Before now], cosplay was always something I wanted to do, but I always thought, ‘I'll do it when I tone up, or I'll do it when I lose some weight. Or, you know, when my skin gets clear,’ she said during a Zoom call. “I finally came to a realization in 2020, and I told myself, ‘Bitch, you're not waiting to do any of these things. You're just afraid of being talked about or people pointing these things out.’ I really had to tell myself, ‘Girl, get over it.’”\n\nLady Hoekage’s concerns don’t exist in a vacuum. They stem from the deeply rooted social ill of fatphobia — the covert and overt oppression of fat people — and it greatly impedes on the success of fat cosplayers in a multitude of ways. Desirability politics, lack of proper and accessible clothing and sizing, the constant exposure to fat shaming, fat fetishism, and inappropriate parasocial behaviors not only negatively impact their safety, but make it a challenge to participate in something they really want to.\n\n“It’s already hard being noticed as a larger-bodied content creator in general, but I’m also Black, so that’s two strikes against me already which [keeps me from being pushed in front of a larger audience],” she said. “What is the point of doing this all if I’m not being seen?”\n\nContent creator Lady Hoekage dressed in anime cosplay as Naruto’s Kakashi. Image courtesy of Lady Hoekage.\n\n\n\n\n\nThe depictions of fat characters in pop culture\n\n\n\nFatphobia’s sphere of influence traces back beyond the digital age and to the time of the Transatlantic Slave Trade, where Black fat bodies were postured as lesser than in comparison to white ones in order to perpetuate and justify their enslavement. As a result, fatness and Blackness have been — and still are — seen as unworthy and unrealistic beauty standards equated to ugliness. Coupled with anti-blackness (or the systemic oppression of Black people), we are now seeing how fatphobia intentionally creates barriers for cosplayers who share these identities.\n\nThe depictions of fat characters in anime, cartoons, and other fandoms are minimal in both number and range. When they are present, their storylines are usually crafted and coded as villains, comic relief, supportive best friends, weight loss totems, or a combination of the aforementioned tropes. From Spiderman’s best friend Ned, who’s the film’s stereotypical POC and fat best friend, to the Star Wars franchise’s Jabba the Hutt, an infamous galactic gangster who serves as a representation of greed. There’s even Usopp from One Piece, who gained weight from eating during the plot’s time skip, and loses it in order to level up. Despite being iconic, these characters — and moreover their fat bodies — are presented as an amalgamation of poor choices that should be punished by ridicule, subjugation, and being negatively regarded, which is directly connected to how everyday fat people are being viewed and treated.\n\nSolana Dreams, a content creator whose cosplay niche mostly involves portraying fantasy characters, pointed out how fatphobia not only plays a critical role in how fat, Black cosplayers navigate their experience, but also limits the characters they’re able to portray as well.\n\n“As a cosplayer, it’s all about your ability to wear something and to either look like a specific character or as close to them as possible,” Solana said. “I feel like more scrutiny is on us as fat Black cosplayers because we’re not canon.”\n\nContent creator Solana Dreams often portrays fantasy characters in their cosplay. Image courtesy of Solana Dreams.\n\n\n\n\n\nUnderstanding fat tax and lack of clothing accessibility\n\nFatphobic propaganda is stitched in the fabric of the quotidian, including the very fiber of the clothes on our backs. With women’s plus size (U.S. sizes 18 and up) clothing only occupying 19 percent of the fashion industry, there’s a large gap of resources and clothing accessibility between those who wear straight sizes, and those who wear above a size 18. Because of this, fat cosplayers have to find innovative and creative ways to approach their craft. For Solana Dreams, they often have to make their own pieces.\n\n“As a person who wears a size 4x-5x, I can’t always buy something off the internet because it’s very hard to find clothing. I usually have to make my own stuff. It makes the cosplaying process even longer because I have to put things together and find or create pieces that fit my body,” they said during a Zoom call. “I feel so bad because I want to produce as quickly as some of my cosplaying counterparts, but that’s not my reality.”\n\nIn the rare instances that actual cosplay attire is available in larger sizes, there are still some alterations that need to be made. Lady Hoekage shared how she ordered a bodysuit from Amazon for a Mirko cosplay that sort of fit her, but she had to cut the belt and add an elastic band in order to dress up as the fan-favorite My Hero Academia character.\n\nThe issue with size-inclusive clothing doesn’t stop at size. Price is also a limiting factor in making cosplay more accessible to those in fat bodies due to the Fat Tax, which makes plus-size clothing more expensive than straight-size options. The insidiousness of things like cost and clothing inaccessibility make it harder for cosplay enthusiasts to consistently participate in the activity. On the other hand, some clothing, despite being marketed as “plus size and inexpensive,” fit poorly due to being constructed in different countries where sizing is not equivalent to that of the U.S. All of these limitations can deter someone from cosplaying more than they’d like to.\n\nLauryn Craine, a Public Services Assistant who has a deep love of anime and cosplay, recalled how her friends recommended Aliexpress to her in high school, because that’s where they bought all their cosplay stuff while being on a budget. After checking the differences between Asian and American sizing, she decided on a Love Live! (a Japanese multimedia franchise encompassing anime TV series, manga, and video games) outfit in a size 3x.\n\n“The skirt fit fine but the top was absolutely too small. I then triple-checked all the measurements and realized that it was actually equivalent to a size larger or XL,” Craine said. “After that, I never cosplayed again because it felt like nothing would fit, and I didn’t want to go through the trouble of feeling like that again.”\n\nGrad student and educator TC Monreaux in Velma cosplay. mage courtesy of TC Monreaux.\n\n\n\n\n\nPerceptions of fat, Black cosplayers and their representation online and IRL\n\n\n\nWhat’s even more ostracizing about the fat, Black cosplayer experience is the fact that fatphobia leads to skewed perceptions of this community, and their ability to be recognized and taken seriously as cosplayers. Grad student and educator TC Monreaux, whose foray into cosplay began while as an undergraduate student, shared how many people did not recognize their Velma cosplay, despite being dressed in the Scooby-Doo character’s easily recognizable colors.\n\n“People seem to have a hard time identifying a character on a fat body. Although I didn’t go full-fledged feminine with the skirt and a kitten heel, I still had on glasses, an orange top, and burgundy bottoms. I had to say ‘Jinkies’ in order for people to get it, and they still told me that wasn’t what they got from my cosplay,” Monreaux said.\n\nNegative public attitudes toward the intersections of fatness and Blackness also manifest on digital platforms, where algorithms heavily censor those in larger and darker bodies while prioritizing those who are smaller, lighter, or are closer to whiteness and benefit from desirability.\n\nGenerally, Black people, regardless of their other intersections, are not featured on platforms that cater to white and non-Black audiences. But what’s even worse is that Black-run platforms also perpetuate desirability politics, often excluding fat, Black people from their feeds.\n\nAs highlighted in a tweet by Lady Hoekage, there’s an unspoken expectation of fat, Black cosplayers to be exceptional and often hypersexualized, in order to be pushed by the algorithm and receive public recognition.\n\n“The main issue is that I follow a bunch of different creators but I never see them. If people are seeing their favorite creators, they need to be sharing us to their stories, double-tapping, etc. It’s not that hard. It’s about us getting out there, and there’s only so much we can do on our own,” she said.\n\nThe fat, Black cosplay community being rendered invisible is even more recognizable during convention season. Monreaux has noticed that there’s a stark difference between seeing fat, Black folk at conventions, and what is actually being shown in photos, videos, and other forms of event coverage.\n\n“I went to Coco Con in Atlanta where Black cosplayers came together, and I saw a lot who were also fat there as well. However, I didn’t really see many of them in the videos that I ended up seeing,” they said. “I don’t think that’s alway intentional, but I do think that there can be a more intentional effort to make sure that everyone — including fat, Black folk — who show up to these events receive attention.”\n\nSpecial education teacher and content creator Sailor Xtasy. Image courtesy of Sailor Xtasy.\n\n\n\n\n\nChanging the tide for fat, Black Content Creators\n\nSince external support is in limited supply, this community of cosplayers have had to create their own avenues of opportunity in order to better their circumstances. Because of a lack of inclusion in fashion, Lady Hoekage started DokiDoki Threads, an exclusively plus-size anime wear company that also caters to cosplayer needs. All of her pieces, which range from sizes 1x-5x, are designed to be used as both regular clothing and cosplay items.\n\nThere’s also those who hope to bring more awareness to this issue simply by participating in it, and encouraging other potential plus-size cosplayers to do the same.\n\n“As a plus sized cosplayer, I hope to uplift the community by showing how you can still be beautiful and plus-size,” special education teacher and content creator Sailor Xtasy said. “I wear the same popular cosplays as everyone else and still look amazing. I want people to know that cosplaying is about having fun and the joy it brings oneself. I will proudly show off my curves and rolls if it means that I'm happy.”\n\nBut in order for things to truly change, there must be safe spaces made for fat, Black content creators.\n\n“What’s helpful and encouraging is having interconnectivity among fat, Black cosplayers, and those who are in more privileged bodies need to check their biases when it comes to those of us in marginalized bodies,” Solana Dreams said. “More spaces that include us need to be created so that we can find harmony and compassion with each other.”\n\n—\n\nCheyenne M. Davis (they/them/theirs) is a writer, adjunct professor at New York University, digital content creator, and aspiring screenwriter. Topics that they often explore in their work include media representation, nerd fandoms, sex, kink, fat liberation, LGBTQIA, misogynoir, Black pleasure, and how all these things intersect. Aside from their creative pursuits, Davis is a cat mom and a video game and anime aficionado."
    }
]