[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8va3ZpYS5jb20vbmV3cy8yMDIzLzA3LzEwL3N1bmxhbmQtcGFyay1tYWxsLXNvbGQtcmVuYW1lZC10aGUtc2hvcHMtYXQtc29sYW5hL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Sunland Park Mall sold, renamed The Shoppes at Solana - KVIA",
        "content": "EL PASO, Texas (KVIA) -- The president of Starr Western Wear has purchased Sunland Park Mall in El Paso's west side.\n\nEnoch Kimmelman told ABC-7 the deal was finalized last week. The new name of the mall is The Shoppes at Solana.\n\nHe said he envisions restoring the decades-old mall and revitalizing the space for the next generations.\n\nKimmelman said the previous owners had run into some financial difficulties and couldn't fully invest in the property.\n\nHe was prompted to invest in the mall after seeing how successful his store inside Sunland Park Mall had been.\n\n\"Being here every day and seeing all the people who do come to our store, it's pretty clear that there are going to be a lot of people coming to the mall. Once we fix it up a little bit and invest some money. The previous owners weren't able really to do that because they were having financial difficulties. So we're going to invest in the inside and the outside and that's going to make a very big difference.”\n\nKimmelman said they are working on bringing different retailers and restaurants. He also said architects have already started working. They hope construction will be completed next year.\n\n“The vision for the mall is to have a mixed-use entertainment, shopping, eating, and other activities in the mall that people can come and spend time with their families and enjoy their families, enjoy their afternoons here in the in the mall and enjoy the space,\" he said.\n\nThe owner said he grew up in El Paso and wants to make the mall the crown jewel of West El Paso again.\n\n“It's important for me to see El Paso grow and it's important for my store here at Sunland Park Mall to continue to grow. And so I think it's it's good for the community and it's good for business. And I think everybody wins all the way around,\" the owner said.\n\nKimmelman wasn't able to disclose how much he purchased the property for but said he is planning on investing a substantial amount to revamp the space."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8xMC9tYWNyby1ndXJ1LXJhb3VsLXBhbC1vdXRsaW5lcy1kcmVhbS1zY2VuYXJpby1mb3Itc29sYW5hLXVudmVpbHMtbWFzc2l2ZS1wcmljZS10YXJnZXQtZm9yLWV0aGVyZXVtLXJpdmFsL9IBjQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8xMC9tYWNyby1ndXJ1LXJhb3VsLXBhbC1vdXRsaW5lcy1kcmVhbS1zY2VuYXJpby1mb3Itc29sYW5hLXVudmVpbHMtbWFzc2l2ZS1wcmljZS10YXJnZXQtZm9yLWV0aGVyZXVtLXJpdmFsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Macro Guru Raoul Pal Outlines Dream Scenario for Solana, Unveils Massive Price Target for Ethereum Rival - The Daily Hodl",
        "content": "Real Vision CEO Raoul Pal is outlining the best-case scenario for Ethereum (ETH) rival Solana (SOL), saying that the smart contract platform could see a massive price increase.\n\nIn a new interview with the host of InvestAnswers, the macro guru says that Solana could follow in the footsteps of the leading altcoin when it skyrocketed after hitting a low in 2018.\n\nAt the time, Ethereum saw about a 47x increase. However, Pal says that he anticipates Solana seeing at least a 20x increase from current prices.\n\n“There’s a potential, a possibility [of] a dream scenario that Solana does what ETH did from the 2018 low, which was a 47x. And so [the] Solana low was $9, so you could do the math, the numbers are potentially very interesting – that it’ll be 20-something X from here for Solana.”\n\nSolana is trading for $21.84 at time of writing, a 1.48% increase during the last 24 hours. If Pal’s prediction comes to light, SOL could be worth about $436.\n\nPal goes on to say that he believes Bitcoin (BTC) could double or triple up from its all-time high, adding that such a rise would be modest and the worst bull run in the crypto king’s history.\n\n“It’s very difficult to predict where it actually goes, but what we can say is it’s reasonable that Bitcoin, from all-time highs, doubles or triples. That’s not asking a lot. That will be the worst bull market in Bitcoin’s history…\n\nIt probably triples from the all-time high and currently it’s at $30,000 so that’s a 6x from here. That’s pretty good. And the upside is maybe I’m totally wrong and it gets complete panic to the upside…\n\nWe don’t know what’s going to be happening in the economy in 2025, what could be driving prices, so I think you [can] get the upside for free.”\n\nBitcoin is trading for $30,321 at time of writing, a fractional increase during the last 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Kiran 360 Degree"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiqQFodHRwczovL2NiczRsb2NhbC5jb20vbmV3cy9sb2NhbC9zdW5sYW5kLXBhcmstbWFsbC10by1iZS1yZW5hbWVkLXRoZS1zaG9wcGVzLWF0LXNvbGFuYS1hZnRlci1zb2xkLXRvLXN0YXJyLXdlc3Rlcm4td2Vhci1vd25lci1lbC1wYXNvLXRleGFzLWVub2NoLWtpbW1sZW1hbi1lbC1wYXNvLXRleGFz0gGtAWh0dHBzOi8vY2JzNGxvY2FsLmNvbS9hbXAvbmV3cy9sb2NhbC9zdW5sYW5kLXBhcmstbWFsbC10by1iZS1yZW5hbWVkLXRoZS1zaG9wcGVzLWF0LXNvbGFuYS1hZnRlci1zb2xkLXRvLXN0YXJyLXdlc3Rlcm4td2Vhci1vd25lci1lbC1wYXNvLXRleGFzLWVub2NoLWtpbW1sZW1hbi1lbC1wYXNvLXRleGFz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Sunland Park Mall to be renamed 'The Shoppes at Solana' after sold to Starr Western Wear owner - cbs4local.com",
        "content": "Sunland Park Mall was bought by the president and owner of Starr Western Wear.\n\nThe new owner is Enoch Kimmelman.\n\nKimmelman said he will rename the mall as \"The Shoppes at Solana.\"\n\n“We have an innovative and creative vision for the mall. Our vision is to convert the mall and make it a place for entertainment, and food, and shopping. And bring back life to the crown jewel of the westside,\" said Kimmelman.\n\nKimmelman said he plans on revitalizing the mall.\n\nPart of the revitalizing plan includes upscale retailers, entertainment and experience-based venues, dining and culinary options, wellness, fitness centers, technology gadgets, and family-friendly attractions.\n\n\n\nRELATED:\n\n“I watched the mall kind go down over the years and unfortunately the previous owners ran into financial problems, so they couldn’t invest back into the mall,\" said Kimmelman. \"Our plans are to change the entryway and do a bunch of upgrades on the inside of the mall.\"\n\nKimmelman explained why he is changing the name to \"The Solana.\"\n\n\"A Solana is kinda like a solarium and someone who has been to the mall will notice we have a lot of skylines and a lot of natural light coming in,\" he said.\n\nKimmelman said some tenants will stay but will bring other businesses as well.\n\n\"We enjoy the tenants that are here. And we plan to bring some new tenants,\" he said.\n\nKimmelman said the name change will take effect in the next months and said construction will also begin in the next months.\n\n\n\nBelow is a PowerPoint on the overview of \"The Shoppes at Solana.\"\n\nThe mall will remain open during construction and we will be doing all construction in phases so as not to disrupt any business.\n\n\n\nSome folks CBS4 spoke to believe the mall is outdated and are looking forward to the new vision.\n\n\"I feel like they're trying to remodel it to make it look more appealing but it’s just not... you know. It’s giving outdated,\" said Shane Strong. \"I feel like 2016 was its prime time... when Chick-Fil-A closed, honestly, that’s when it went downhill.\"\n\nThe mall also brings back memories for one El Paso couple who lived next door for decades.\n\n\"We’ve always loved it because we lived here so many years in El Paso on Balboa Street which is close by,\" said Blanca Vazquez.\n\n\"The Sunland Park Mall used to be very fantastic and had good restaurants, good stores, and then they all started disappearing,\" Piti Vazquez added. \"I think it will be a booming place real soon.\"\n\nReporter Lianna Golden will have more information in her full report tonight on CBS4 News at 10 p.m.\n\n\n\nRECOMMENDED:\n\nto receive the top interesting stories from in and around our community once daily in your inbox."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbmpvdXJuYWwubmV0L25ld3MvcmFvdWwtcGFsLXNoYXJlcy1tYXNzaXZlLXByaWNlLXByZWRpY3Rpb24tZm9yLXNvbGFuYS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Raoul Pal says Solana (SOL) could skyrocket to above $400 - CoinJournal",
        "content": "Raoul Pal, CEO of Real Vision is super bullish on Solana (SOL).\n\nAccording to Pal, SOL could rally 20x from current levels if it mirrors Ethereum’s 47x move from its 2018 low.\n\nHe also says Bitcoin price could triple from its all-time high level amid a supply crunch in 2023.\n\nRaoul Pal, the founder & CEO of Real Vision suggests Solana (SOL) could embark on a massive price move. If the “dream scenario” for the world’s 10th largest cryptocurrency by market cap occurs, SOL could outperform both Bitcoin (BTC) and Ethereum (ETH).\n\nPal shared his massively bullish outlook for Solana during a recent interview in which he shared views on varied topics. These include AI and its impact on jobs, BlackRock’s ETF filing and CEO Larry Fink’s remarks about BTC.\n\nHe also aired his thoughts on the Ethereum/Bitcoin flippening debate, central bank digital currencies (CBCDs), global economy and government money printing before briefly offering his price prediction Solana . The macro guru also shared predictions for Bitcoin and Ethereum.\n\nSolana price prediction\n\nOn what he thought of the price performance of BTC, ETH and SOL in the next bull cycle, Pal shared a highly bullish projection for Ethereum’s “competitor.”\n\nCurrently, Solana trades around $21, about 1.4% down in the past 24 hours.\n\nHowever, the cryptocurrency is more than 10% in the green over the past seven days and 43% in the past 30 days. While it’s also down 43% from its value a year ago, Pal noted that the bottom might have come when prices fell to around $9 in December 2022.\n\nWith this outlook, Pal suggests SOL could do what ETH achieved after bottoming in 2018 – roaring to its all-time high above $4,800 during the last bull market. The macro guru says that if Solana takes on this projection, the potential gains could be staggering.\n\nHe compared the 47x that ETH saw after the 2018 low to what Solana could do. He opined:\n\n“Look… there’s a possibility – a dream scenario – that Solana does what ETH did from the 2018 low which was a 47x. The Solana low was nine bucks, so you could do the maths [and] the numbers are potentially very interesting.”\n\nWhile Solana’s price might not do the 47x or so that Ethereum price managed since its bottom in 2018, Pal predicts a “20 something x” move. According to him, this is a reasonable outlook for a protocol that’s battle-tested and is seeing a huge spike in network and ecosystem activity.\n\nShould Pal’s bullish outlook for SOL price hold, it would mean an eventual burst to prices above $400 for the cryptocurrency. In the last bull market, Solana rose to the all-time high at $260.\n\nBitcoin and Ethereum price predictions\n\nFor BTC and ETH, Pal agreed with projections of a 3x and 5x respectively – suggesting Bitcoin could more than triple its value during the next bull cycle. However, that is from the all-time highs that was $69,000 in November 2021.\n\nTrippling from that ATH would mean a 6x from current prices, he opined. But that would depend on severa factors that could dictate market direction.\n\n“It’s very difficult to predict where it actually goes, but what we can say is [that] it’s reasonable that Bitcoin from all-time highs doubles or triples. That’s not asking a lot. That will be the worst bull market in Bitcoin’s history.”\n\nAccording to him, a potential supply crunch in 2023 is what could squeeze Bitcoin to a new all-time high."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMipQFodHRwczovL3d3dy5lbHBhc290aW1lcy5jb20vc3RvcnkvbW9uZXkvYnVzaW5lc3MvMjAyMy8wNy8xMS9lbC1wYXNvLXN1bmxhbmQtcGFyay1tYWxsLWdldHMtbmV3LW93bmVyLWVub2NoLWtpbW1lbG1hbi13aXRoLXBsYW5zLWZvci1uYW1lLWNoYW5nZS11cGdyYWRlcy83MDQwMDU4MTAwNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Sunland Park Mall gets new owner with plans for name change, upgrades - El Paso Times",
        "content": "Forget Sunland Park Mall.\n\nEl Paso’s second largest shopping center, which has lost most of its national retail tenants in recent years, will be renamed The Shoppes at Solana by its new owner – Enoch Kimmelman, owner of Starr Western Wear stores in El Paso.\n\nHe plans to update the mall’s main entrance and interior spaces, as well as recruit new stores, restaurants and entertainment-related tenants, he said.\n\nSolana, solarium in Spanish, was picked because the mall’s large skylights convey a sense of a solarium, Kimmelman said.\n\nHe completed the purchase last week of most of the mall from Ohio-based Washington Prime Group. The 35-year-old, 918,476-square-foot mall is located at Interstate 10 and Sunland Park Drive in West El Paso.\n\nThe purchase does not include the mall’s seven anchor tenant spaces, including two vacant ones where a Forever 21 and second Dillard’s were located. Dillard’s now has only one store in the mall.\n\nNo financial details were released, and Washington Prime officials declined to comment on the sale.\n\nKimmelman declined to say how much he’ll spend on upgrading the mall, which still looks good with its marble floors and huge skylights.\n\n“It’s pretty clear to me that the mall was being underutilized,” Kimmelman said. “And with the right amount of attention and a little bit of refurbishment, I think we can restore the mall to its glory days.”\n\nThe plan is to create a \"Main Street feel\" inside the mall with outdoorlike cafes and tenants that provide an experience, as well as retail shopping, he said.\n\nKimmelman owns and operates Starr Western Wear, which his parents started 60 years ago in Downtown El Paso, where it continues to operate a store.\n\nHe moved to Los Angeles 20 years ago, but regularly commutes to El Paso to oversee his business.\n\nIn 2018, Kimmelman bought the closed Macy’s Department Store building at Sunland Park Mall to open his third store, which has been performing well, he said.\n\nMore: Café Piro builds healthy menu on foundation of love, community, respect for ancestors\n\nThe mall has struggled in recent years to build a new tenant mix as its bread-and-butter, national retail tenants left.\n\nIt’s now anchored by Dillard's, Starr Western Wear, Conn's Home Plus, TruFit Athletic Clubs and Monkey Rock entertainment center.\n\nMonkey Rock, which opened in 2022, and a Jungle Reef aquarium, to be opened next year by Monkey Rock's owners, fit into Kimmelman's vision for more entertainment-tied tenants, he said.\n\nEven with its struggles, the mall still has lots of traffic during evenings and weekends, Kimmelman said.\n\nVictor Navarro, owner of The Shoe Doctor, a shoe repair and custom bootmaker that’s operated in the mall almost 30 years, said he hopes Kimmelman can pump new life into the shopping center.\n\n“It’s not like 15 to 20 years ago. There’s too many empty spaces,” Navarro said. “I hope he brings more business.”\n\nNavarro’s shop is tucked into a hidden corner of the mall, next to a now-shuttered entrance for the former Forever 21 store.\n\nWest Side resident Norma Garcia was at the mostly empty but cool mall on a scorching hot Monday afternoon. She goes there about twice a month, mostly to buy her 10-month-old grandson an ice cream and sometimes let him romp in a play area near the food court, which no longer has national food outlets.\n\n“It’s a really pretty mall,” Garcia said. “It used to be bursting with people, but now it’s a ghost town. Dillard’s is the only place I can shop now.”\n\nThe mall needs more stores, more restaurants, and more places for family activities, she said.\n\nA lot of spaces were taken in recent years by untraditional mall tenants, including a large barber college near the mall’s main entrance, and by local businesses.\n\nAbout 70 tenants are in the mall. However, the mall's directory has not been updated.\n\nThe previous owner, Washington Prime Group, filed for Chapter 11 reorganization bankruptcy in 2021, and didn’t have money for capital improvements, Kimmelman said. And that’s part of the reason the mall lost national retailers and other tenants, he believes. Many national retailers also have been struggling for a variety of reasons, including effects of the pandemic shutdowns, inflation and a slower economy.\n\n\"I think that now that there'll be some capital improvements made to the mall, it will be a lot easier\" to get the empty spaces leased, Kimmelman said.\n\nMore: Bitwise tech training company files for bankruptcy as workers seek unpaid wages\n\nPeter de Wetter, a partner at RJL Real Estate Consultants, an El Paso commercial real estate firm, said in an email that Kimmelman is a “sophisticated real estate investor and retail operator,” and logical buyer for the mall since he already owned his store's building there.\n\n“Having assisted Enoch with the sale and leasing of retail projects regionally over several years, we can attest to his ability to successfully lease and manage major projects,” de Wetter said. “We’re optimistic that Enoch’s long-term commitment to the project will be a benefit to the community and (mall) tenants.”\n\nVic Kolenc may be reached at 915-546-6421, vkolenc@elpasotimes.com and @vickolenc on Twitter."
    }
]