[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldC1iaXRjb2luLWV0aGVyLWNyeXB0by1zb2xhbmEtYmluYW5jZS_SAURodHRwczovL2Zvcmthc3QubmV3cy9tYXJrZXQtYml0Y29pbi1ldGhlci1jcnlwdG8tc29sYW5hLWJpbmFuY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Markets: Bitcoin, Ether rise with most of crypto market, Solana posts best start to the year for major - Forkast News",
        "content": "Bitcoin and Ether gained in Tuesday morning trading in Asia along with most other top 10 non-stablecoin cryptocurrencies, helped by signs inflation pressure is easing in the U.S. Solana posted the biggest gains and broke back into the top 10 list by market capitalization. BNB was the only token on the list to fall on a report the U.S. Justice Department is stepping up its probe into the token’s issuer and the world’s largest crypto exchange, Binance Global.\n\nSee related article: U.S. subpoenas hedge funds in Binance probe: report\n\nFast facts\n\nBitcoin was up 0.6% to US$17,193 in the 24 hours to 8 a.m. in Hong Kong, a 3% increase over the past calendar week. Ether gained 2.6% to US$1,321, an 8.8% weekly rise, according to CoinMarketCap.\n\nSolana rose 13.7% to trade at US$16.29, a gain of 44.5% for the week and the best start to the year for any major token. The gains follow the release of a new Solana-based, Dogecoin-themed token, called Bonk. Released late last year, Bonk is now trading around US$0.000001628, an increase of almost 1400%.\n\nBNB fell 0.7% to US$272.64, but is still up 11% for the past calendar week. Federal prosecutors have reportedly issued subpoenas to several U.S. hedge funds, requesting records of communications with Binance as part of its probe into possible money laundering violations.\n\nCardano’s ADA token gained 7.4% to US$0.32, bringing its weekly gains to 24.9%. The run started after ADA in 2022 made it into the top 10 most used cryptocurrencies for payments for the first time, according to a Jan. 4 report by Lithuanian cryptocurrency payments processor CoinGate.\n\nThe total crypto market capitalization rose 1.6% to US$848.3 billion, while trading volume jumped 112.2% to US$46.9 billion.\n\nU.S. equities had a mixed day of trading on Monday. The Dow Jones Industrial Average fell 0.3%, the S&P 500 Index lost 0.1%, while the Nasdaq Composite Index rose 0.6%.\n\nThe US Federal Reserve cranked up interest rates last year to curb inflation which helped drive stock indices lower and raised worries about a recession. The December U.S. Consumer Price Index, a key measure of inflation, is released this week on Jan. 12 and should provide further pointers on future Fed policy.\n\nIn other items to watch today, Fed Chair Jerome Powell is speaking at a central bank meeting in Sweden, while Japan announces its CPI report for December.\n\nSee related article: Hong Kong pushes ahead with crypto hub plans as tech firms, startups show interest: financial secretary"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ib25rLW5mdHMtYm9vbS1zb2xhbmEtYmFzZWQtMjE0NDM5MDYwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "BONK NFTs Boom—But Solana-Based Meme Token Is Down 69% Since Peak - Yahoo Finance",
        "content": "BONK fever is still raging in the Solana community, as an NFT collection inspired by the dog-themed meme token launched, quickly sold out, and now is trading for 10 times the original sale price. However, the actual Solana-based BONK token is still shedding value after last week’s surge, now down 69% from the peak price.\n\nBONKz, a Solana NFT collection co-created by the contributors behind the BONK token, debuted this morning on the Magic Eden marketplace and sold through all 15,000 of the tokenized profile pictures (PFPs) in a matter of hours.\n\nThe NFTs sold for 16.25 million BONK apiece—just $26 worth—but they’re commanding a significant premium on the secondary market. Currently, the floor price (or price of cheapest listed NFT) on Magic Eden is 17 SOL, or about $280. Already, the project has yielded about $913,000 worth of trading as measured in SOL.\n\nWe have just BURNED 100% of the raised $BONK This ended up being 165 Billion $BONK or $255,000 USD$BONK pic.twitter.com/oMipHK6B2y — OMNI (@OMNIcreative_) January 10, 2023\n\nThe BONKz project artwork includes contributions from Solana creative studio OMNI (The Fracture) and artists such as John Lê and Degen Poet. All of the BONK that was spent on today’s mint—some 165 billion BONK, or about $255,000 worth—was burned, meaning permanently destroyed, by the creators in an effort to reduce the overall token supply.\n\nDespite the buzz around the NFT project launch and its post sell-out surge, the BONK token itself is actually down almost 4% on the day after a couple of earlier up-and-down swings over the past 24 hours, according to data from CoinGecko, landing at a current price of $0.00000151.\n\nThe token, which is similar to Dogecoin and the Ethereum-based Shiba Inu (SHIB), has now fallen 69% since peaking at $0.00000487 less than a week ago, on January 5. Even so, the token’s price is up 86% over the last week, with those opposing double-digit figures suggesting just how volatile its market swings have been.\n\nBONK launched in December as trillions of the token were airdropped to members of the Solana community, including decentralized app builders, NFT project creators and artists, and even holders of various NFT collections starting on December 25.\n\nStory continues\n\nSolana’s Doge-Themed BONK Drops 54% After Bonkers 3,300% Gains\n\nThe token then began its rapid ascent; at one point last week, BONK was up 3,300% on the week despite having just fallen 54% in price in less than 12 hours. Meme coins like BONK, SHIB, and DOGE are heavily impacted by social media sentiment, as seen with the long history of Dogecoin price swings attributed to Elon Musk tweets.\n\nBONK has been up and down the last few weeks, but it has apparently inspired renewed buzz around the Solana space. Amid trading momentum and growing adoption of the token from apps and services, the price of SOL has doubled since crashing to a nearly two-year low just above $8 before the end of 2022. Currently, SOL sits at $16.50, per CoinGecko."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ib25rLW5mdHMtYm9vbS1zb2xhbmEtYmFzZWQtMjE0NDM5MDYwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "BONK NFTs Boom—But Solana-Based Meme Token Is Down 69% Since Peak - Yahoo Finance",
        "content": "BONK fever is still raging in the Solana community, as an NFT collection inspired by the dog-themed meme token launched, quickly sold out, and now is trading for 10 times the original sale price. However, the actual Solana-based BONK token is still shedding value after last week’s surge, now down 69% from the peak price.\n\nBONKz, a Solana NFT collection co-created by the contributors behind the BONK token, debuted this morning on the Magic Eden marketplace and sold through all 15,000 of the tokenized profile pictures (PFPs) in a matter of hours.\n\nThe NFTs sold for 16.25 million BONK apiece—just $26 worth—but they’re commanding a significant premium on the secondary market. Currently, the floor price (or price of cheapest listed NFT) on Magic Eden is 17 SOL, or about $280. Already, the project has yielded about $913,000 worth of trading as measured in SOL.\n\nWe have just BURNED 100% of the raised $BONK This ended up being 165 Billion $BONK or $255,000 USD$BONK pic.twitter.com/oMipHK6B2y — OMNI (@OMNIcreative_) January 10, 2023\n\nThe BONKz project artwork includes contributions from Solana creative studio OMNI (The Fracture) and artists such as John Lê and Degen Poet. All of the BONK that was spent on today’s mint—some 165 billion BONK, or about $255,000 worth—was burned, meaning permanently destroyed, by the creators in an effort to reduce the overall token supply.\n\nDespite the buzz around the NFT project launch and its post sell-out surge, the BONK token itself is actually down almost 4% on the day after a couple of earlier up-and-down swings over the past 24 hours, according to data from CoinGecko, landing at a current price of $0.00000151.\n\nThe token, which is similar to Dogecoin and the Ethereum-based Shiba Inu (SHIB), has now fallen 69% since peaking at $0.00000487 less than a week ago, on January 5. Even so, the token’s price is up 86% over the last week, with those opposing double-digit figures suggesting just how volatile its market swings have been.\n\nBONK launched in December as trillions of the token were airdropped to members of the Solana community, including decentralized app builders, NFT project creators and artists, and even holders of various NFT collections starting on December 25.\n\nStory continues\n\nSolana’s Doge-Themed BONK Drops 54% After Bonkers 3,300% Gains\n\nThe token then began its rapid ascent; at one point last week, BONK was up 3,300% on the week despite having just fallen 54% in price in less than 12 hours. Meme coins like BONK, SHIB, and DOGE are heavily impacted by social media sentiment, as seen with the long history of Dogecoin price swings attributed to Elon Musk tweets.\n\nBONK has been up and down the last few weeks, but it has apparently inspired renewed buzz around the Solana space. Amid trading momentum and growing adoption of the token from apps and services, the price of SOL has doubled since crashing to a nearly two-year low just above $8 before the end of 2022. Currently, SOL sits at $16.50, per CoinGecko."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ib25rLW5mdHMtYm9vbS1zb2xhbmEtYmFzZWQtMjE0NDM5MDYwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "BONK NFTs Boom—But Solana-Based Meme Token Is Down 69% Since Peak - Yahoo Finance",
        "content": "BONK fever is still raging in the Solana community, as an NFT collection inspired by the dog-themed meme token launched, quickly sold out, and now is trading for 10 times the original sale price. However, the actual Solana-based BONK token is still shedding value after last week’s surge, now down 69% from the peak price.\n\nBONKz, a Solana NFT collection co-created by the contributors behind the BONK token, debuted this morning on the Magic Eden marketplace and sold through all 15,000 of the tokenized profile pictures (PFPs) in a matter of hours.\n\nThe NFTs sold for 16.25 million BONK apiece—just $26 worth—but they’re commanding a significant premium on the secondary market. Currently, the floor price (or price of cheapest listed NFT) on Magic Eden is 17 SOL, or about $280. Already, the project has yielded about $913,000 worth of trading as measured in SOL.\n\nWe have just BURNED 100% of the raised $BONK This ended up being 165 Billion $BONK or $255,000 USD$BONK pic.twitter.com/oMipHK6B2y — OMNI (@OMNIcreative_) January 10, 2023\n\nThe BONKz project artwork includes contributions from Solana creative studio OMNI (The Fracture) and artists such as John Lê and Degen Poet. All of the BONK that was spent on today’s mint—some 165 billion BONK, or about $255,000 worth—was burned, meaning permanently destroyed, by the creators in an effort to reduce the overall token supply.\n\nDespite the buzz around the NFT project launch and its post sell-out surge, the BONK token itself is actually down almost 4% on the day after a couple of earlier up-and-down swings over the past 24 hours, according to data from CoinGecko, landing at a current price of $0.00000151.\n\nThe token, which is similar to Dogecoin and the Ethereum-based Shiba Inu (SHIB), has now fallen 69% since peaking at $0.00000487 less than a week ago, on January 5. Even so, the token’s price is up 86% over the last week, with those opposing double-digit figures suggesting just how volatile its market swings have been.\n\nBONK launched in December as trillions of the token were airdropped to members of the Solana community, including decentralized app builders, NFT project creators and artists, and even holders of various NFT collections starting on December 25.\n\nStory continues\n\nSolana’s Doge-Themed BONK Drops 54% After Bonkers 3,300% Gains\n\nThe token then began its rapid ascent; at one point last week, BONK was up 3,300% on the week despite having just fallen 54% in price in less than 12 hours. Meme coins like BONK, SHIB, and DOGE are heavily impacted by social media sentiment, as seen with the long history of Dogecoin price swings attributed to Elon Musk tweets.\n\nBONK has been up and down the last few weeks, but it has apparently inspired renewed buzz around the Solana space. Amid trading momentum and growing adoption of the token from apps and services, the price of SOL has doubled since crashing to a nearly two-year low just above $8 before the end of 2022. Currently, SOL sits at $16.50, per CoinGecko."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAxLzEwL2NvdWxkLXRoaXMtbmV3LWRvZy10aGVtZWQtc29sYW5hLW1lbWUtY29pbi1yZWFsbHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 10 Jan 2023 08:00:00 GMT",
        "title": "Could This New Dog-Themed Solana Meme Coin Really Be the Next Shiba Inu? - The Motley Fool",
        "content": "In early 2023, Bonk already has investors barking about a big meme coin rally.\n\nJust when you thought meme coins were over, along comes Bonk (BONK), the new dog-themed meme coin that started trading at the very end of 2022. Bonk has had two price spikes in the first week of trading in 2023, and some people are already calling it the next Shiba Inu (SHIB 0.90%).\n\nAlthough there are certainly similarities between Bonk and Shiba Inu, there is reason to be skeptical about any meme coin, especially one as new as Bonk. Here's what you need to know about Bonk.\n\nSimilarities to Shiba Inu\n\nLet's start with the obvious similarity -- the Bonk mascot is a lovable Shiba Inu dog. As such, Bonk is the latest in a long line of dog-themed meme coins that started with Dogecoin.\n\nAnother big similarity is that Bonk has a huge supply of 100 trillion coins, of which about 50 trillion are currently circulating after an initial airdrop to the Solana (SOL -0.18%) community. By way of comparison, Shiba Inu has a circulating supply of 549 trillion. These gigantic coin circulations lead to huge market capitalizations and attract attention quickly. Quite simply, any number multiplied by 100 trillion is going to be big. Right now, Shiba Inu has a market capitalization of $4.5 billion, while Bonk has a market cap of almost $100 million.\n\nAnother important similarity to Shiba Inu is that both coins are meant to be entertaining They aren't meant to provide serious utility, and they are primarily intended for retail investors who enjoy trading crypto. The Bonk white paper specifically mentioned the need for a new \"fun\" coin in the wake of all the negativity around failed crypto exchange FTX and its related hedge fund Alameda, not to mention the broader crypto winter. Bonk claims that is the first dog coin \"for the people, by the people.\" Apparently, this is not a coin for the serious, buttoned-down folks on Wall Street.\n\nThe Solana meme coin angle\n\nAlthough Shiba Inu is a crypto token minted on the Ethereum blockchain, Bonk is a crypto token minted on the Solana blockchain. That's why many people are describing this as a \"Solana meme coin.\" In addition, Bonk was specifically created for members of the Solana community. On Dec. 24, the coin was only airdropped to people active in the Solana community, such as creators of new Solana non-fungible token (NFT) collections and Solana developers. Thus, when trading started soon thereafter, the only people who could trade Bonk had a relationship of some kind with Solana.\n\nThe easiest way to buy Bonk is via decentralized exchanges built on top of the Solana blockchain. If you go to CoinMarketCap, you can see a list of exchanges that now offer trading in Bonk, some of which have deep relationships with Solana. This helps to explain why Solana has also had a mini-surge the past few days. Bonk mania is getting people talking about Solana again.\n\nWill the Bonk rally last?\n\nBonk was up 5,000% at one point, so some people who lost a lot on Solana last year are probably already dreaming of a future in which they make up all their losses with a quick meme coin surge. Others are probably hopeful that Solana can finally remove itself from all the unwanted negative attention stemming from its previous relationship with disgraced FTX chief Sam Bankman-Fried, who helped to fund and promote the crypto.\n\nHowever, across social media, some people are already saying the Bonk rally is over. Plenty of dog-themed meme coins have tried to become \"the next Dogecoin\" or \"the next Shiba Inu\" and failed. In 2022, for example, Tamadoge briefly stirred up investor excitement as the next Dogecoin. So I find it very unlikely that Bonk is going to do what other coins have not.\n\nI cannot recommend Bonk, which seems too speculative for most retail investors. Until Bonk builds out more utility and provides a real long-term plan that is more than just a marketing event, I'm deeply skeptical. That said, Bonk could still help to bring attention to all the exciting projects, creators, and developers within the Solana community, and that could help to boost the fortunes of Solana. I'm excited to see what Solana has planned for 2023 as a way of restoring trust with investors who got burned last year."
    }
]