[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzE2L2NyYXp5LTIwMjUtY3J5cHRvLXJhbGx5LWFwcHJvYWNoaW5nLXNheXMtaW52ZXN0b3Itd2hvLWNhbGxlZC0yMDIyLW1hcmtldC1ib3R0b20v0gF1aHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDcvMTYvY3JhenktMjAyNS1jcnlwdG8tcmFsbHktYXBwcm9hY2hpbmctc2F5cy1pbnZlc3Rvci13aG8tY2FsbGVkLTIwMjItbWFya2V0LWJvdHRvbS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "‘Crazy’ 2025 Crypto Rally Approaching, Says Investor Who Called 2022 Market Bottom - The Daily Hodl",
        "content": "Venture capital investor Chris Burniske says that a new crypto bull market is coming in the next couple of years which will make previous cycles look modest.\n\nBurniske, a current partner at Placeholder Capital and former analyst at ARK Invest, says that a new bull cycle is brewing, backed by a slew of new projects and catalysts.\n\n“We thought ‘13 was crazy, until we saw ‘17\n\nWe thought ‘17 was crazy, until we saw ‘21\n\nWe thought ‘21 was crazy, until we saw ‘25.\n\nRegulatory currents are changing, new products are shipping, IFS (internet financial system) is maturing, NFTs (non-fungible tokens) are mainstreaming, [BlackRock CEO Larry] Fink is bullish, and once again, rates will drop, repricing time and all risk assets – pack your bags and buckle up, it’s gonna get silly.”\n\nThe investor is predicting that eventually, most crypto projects will consolidate into a small number of layer-1s that thousands of blockchains tap into for security.\n\n“In the future, everything becomes a rollup, tapping into the security of a handful of multi-trillion-dollar base layers – simple as that.\n\nConsolidation of one layer (infrastructure) leads to cementing winners and value accrual there while demolishing the value of the long tail of infrastructure.\n\nThose playing the VC (venture capital)-infrastructure game for too long will get rightfully burned.\n\nThrough this consolidation, the cost of blockspace-service-provisioning collapses, leading to expansion and increased experimentation at the app layer.\n\nMay take a cycle to become obvious.”\n\nEarlier this year, Burniske named Solana (SOL) as one of the biggest opportunities for the next bull market cycle.\n\n“I think if I had to pick an ecosystem that’s contentious and that you should pay attention to, and in its contentiousness is undervalued, it would be Solana. Placeholder, each bear market, tends to pick an ecosystem or two and build an aircraft carrier strategy around that ecosystem. And so the last bear [market], it was ETH and Bitcoin, because those were really the only things at scale and liquid enough to justify.\n\nAnd what I mean by aircraft carrier – if you take Ethereum, buy a bunch of the core ETH asset, but then venture invest around it and really get to know that ecosystem and who all the people are that are working on say, at that point in time, lending or DEXs [decentralized exchanges] or asset management or whatever. And then you can pick the best teams of the teams that most speak to you from a venture perspective. We’re doing that exact same aircraft carrier strategy around Cosmos and Solana right now.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzE2L2NyYXp5LTIwMjUtY3J5cHRvLXJhbGx5LWFwcHJvYWNoaW5nLXNheXMtaW52ZXN0b3Itd2hvLWNhbGxlZC0yMDIyLW1hcmtldC1ib3R0b20v0gF1aHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDcvMTYvY3JhenktMjAyNS1jcnlwdG8tcmFsbHktYXBwcm9hY2hpbmctc2F5cy1pbnZlc3Rvci13aG8tY2FsbGVkLTIwMjItbWFya2V0LWJvdHRvbS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "‘Crazy’ 2025 Crypto Rally Approaching, Says Investor Who Called 2022 Market Bottom - The Daily Hodl",
        "content": "Venture capital investor Chris Burniske says that a new crypto bull market is coming in the next couple of years which will make previous cycles look modest.\n\nBurniske, a current partner at Placeholder Capital and former analyst at ARK Invest, says that a new bull cycle is brewing, backed by a slew of new projects and catalysts.\n\n“We thought ‘13 was crazy, until we saw ‘17\n\nWe thought ‘17 was crazy, until we saw ‘21\n\nWe thought ‘21 was crazy, until we saw ‘25.\n\nRegulatory currents are changing, new products are shipping, IFS (internet financial system) is maturing, NFTs (non-fungible tokens) are mainstreaming, [BlackRock CEO Larry] Fink is bullish, and once again, rates will drop, repricing time and all risk assets – pack your bags and buckle up, it’s gonna get silly.”\n\nThe investor is predicting that eventually, most crypto projects will consolidate into a small number of layer-1s that thousands of blockchains tap into for security.\n\n“In the future, everything becomes a rollup, tapping into the security of a handful of multi-trillion-dollar base layers – simple as that.\n\nConsolidation of one layer (infrastructure) leads to cementing winners and value accrual there while demolishing the value of the long tail of infrastructure.\n\nThose playing the VC (venture capital)-infrastructure game for too long will get rightfully burned.\n\nThrough this consolidation, the cost of blockspace-service-provisioning collapses, leading to expansion and increased experimentation at the app layer.\n\nMay take a cycle to become obvious.”\n\nEarlier this year, Burniske named Solana (SOL) as one of the biggest opportunities for the next bull market cycle.\n\n“I think if I had to pick an ecosystem that’s contentious and that you should pay attention to, and in its contentiousness is undervalued, it would be Solana. Placeholder, each bear market, tends to pick an ecosystem or two and build an aircraft carrier strategy around that ecosystem. And so the last bear [market], it was ETH and Bitcoin, because those were really the only things at scale and liquid enough to justify.\n\nAnd what I mean by aircraft carrier – if you take Ethereum, buy a bunch of the core ETH asset, but then venture invest around it and really get to know that ecosystem and who all the people are that are working on say, at that point in time, lending or DEXs [decentralized exchanges] or asset management or whatever. And then you can pick the best teams of the teams that most speak to you from a venture perspective. We’re doing that exact same aircraft carrier strategy around Cosmos and Solana right now.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy8xMC1tZW1lLWNvaW4tcHJpY2UtcHJlZGljdGlvbnMtZm9yLTIwMjMuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "10 Meme Coin Price Predictions for 2023 - Cryptonews",
        "content": "10 Meme Coin Price Predictions for 2023\n\nMeme coin logos / Source: Adobe\n\n2023 has been a blockbuster year for blue-chip cryptocurrencies.\n\nBitcoin (BTC) is up a staggering 80% year-to-date.\n\nEther (ETH) is up 58% over the same time period.\n\nBut the picture has been more mixed for meme coins.\n\nSome have done very well, but others have struggled, suggesting risk appetite remains cautious and animal spirits are yet to fully return to the crypto space, despite the strong performance of the major coins.\n\nLet’s have a look at the outlook for some of the top tokens with 10 meme coin price predictions for 2023.\n\nWall Street Memes (WSM)\n\nWall Street Memes, one of the internet’s hottest retail investing communities, rose to prominence in the meme stock craze of 2021 and has recently been expanding its relevance in the cryptocurrency space with the presale of its new $WSM token.\n\nThe success of the $WSM presale, which has raised $14.5 million in just over one month, isn’t surprising given the size of Wall Street Memes’ community.\n\nNot only are there 523k hyper-engaged community members on its wallstbets Instagram account, there are another 214k on Twitter and more than 100k across its two other Instagram channels, wallstgonewild and wallstbullsnft.\n\nAll told, Wall Street Memes has a 1 million-strong social community of degens, which analysts think all but guarantees that the $WSM token will be listed on tier 1 crypto exchanges like Binance.\n\nWith 30% of the token supply being held back for community rewards, it can reasonably be expected that airdrops to holders will be a big part of the ecosystem.\n\nIndeed, the first $WSM airdrop is open now.\n\nAnalysts are already predicting big things for Wall Street Memes when it lists on exchanges and you can be a part of it.\n\nVisit Wall Street Memes Here\n\nThug Life Token (THUG)\n\nUpdate – The $THUG presale has now sold out, with its listing set to take place on July 17.\n\nDespite only launching just over a week ago, brand new meme coin project Thug Life Token has already been able to raise more than $1.58 million via the presale of its $THUG token.\n\nVarious industry observers have tipped $THUG to be a major success given the refreshing take it brings to the meme coin space.\n\n$THUG is not based around out-of-fashion dog memes or short-term social media fads, like meme coins created in response to Elon Musk or Andrew Tate tweets.\n\nRather, $THUG is themed around the timeless Thug Life movement that was first popularized by hip hop stars such as Snoop Dogg back in the 80s.\n\nAs the word of $THUG spreads, more degens are expected to pile cash into the project.\n\nThat’s because Thug Life Token has all of the makings of the next 100x meme coin.\n\nAt the presale price of $0.0007 and total maximum supply of 4.2 billion, the Thug Life Token presale only values the coin at a very conservative $2.94 million fully diluted market cap.\n\nThat’s much smaller than most other comparable presale projects and the low presale market cap leaves plenty of room for explosive upside.\n\nMeme coin degens have no time to lose when it comes to getting involved in the project early.\n\nThat’s because the $THUG presale will end once the $2.058 million mark is hit, or when the 3-day countdown runs out (whichever comes first).\n\nAfter that, the only way to secure $THUG tokens will be via the project’s airdrop and community rewards campaign or at a potentially elevated price on major decentralized exchanges (DEXs).\n\nVisit Thug Life Token Here\n\nDogecoin (DOGE)\n\nDespite the fact that blue chip cryptocurrencies like bitcoin have recently been probing for fresh yearly highs, the outlook for the crypto market’s biggest meme coin remains bearish.\n\nDogecoin has remained stuck below most of its major moving averages and below a downtrend from the 2021 record highs.\n\nHype that Elon Musk might integrate Dogecoin somehow into a future Twitter payments system has pretty much petered out.\n\nDogecoin faces significant resistance in the $0.075 area and could fall back to yearly lows around $0.05 before the end of 2023.\n\nShiba Inu (SHIB)\n\nShiba Inu (SHIB), the second largest meme coin by market cap and a copycat version of Dogecoin, has a slightly better near-term technical outlook.\n\nIt recently broke above a medium-term downtrend and if it can hold above its 21 and 50-Day Moving Averages, a pushback above $0.0000084 resistance and back towards $0.000010 is on the cards before the end of 2023.\n\nPepe (PEPE)\n\nPepe Coin is 2023’s biggest meme coin success.\n\nThe meme coin, which is based on the timeless Pepe the Frog internet meme, exploded onto the scene in April.\n\nPEPE saw its market cap top out around $1.8 billion in May, but has since been able to hold onto a market cap of around $600 million.\n\nImpressive stuff.\n\nPepe has proven its power, even with the broader crypto market isn’t exactly in a super exciting bull market.\n\nWhen blue-chip cryptos like bitcoin and ether really get going, Pepe could fly back to all-time highs in 2023.\n\nFloki (FLOKI)\n\nFloki (FLOKI), another copycat Shiba Inu-themed dog meme coin that was named after Elon Musk’s dog, pumped earlier this year, but the bullish momentum has waned.\n\nDegens seem to be moving on from dog coins that lack utility, like Floki, which doesn’t bode well for its future.\n\nFLOKI could soon fall back to 2022 lows in the $0.000005 area and then lower before the end of 2023.\n\nTamadoge (TAMA)\n\nTAMA, the token that powers up-and-coming web3 gaming platform Tamadoge, is currently trading close to record lows in the $0.011 area, valuing the token at a very conservative $15.6 million.\n\nThat could be an absolute bargain price, considering Tamadoge is attracting a growing user base to its play-to-earn Tamadoge Arcade gaming suite, which was recently launched as a mobile app on the Google and Apple app stores.\n\nAs Tamadoge continues to deliver on its roadmap, low market-cap crypto gem hunters are likely to start piling in.\n\nTAMA could easily return to its all-time high near $0.17, more than 10x up from current levels before the end of 2023.\n\nMr Hankey Coin (HANKEY)\n\nMr Hankey Coin, which is based on the famous South Park character of the same name and proudly markets itself as the meme coin world’s top shitcoin, is currently up over 200% since its launch on Uniswap earlier in the day.\n\nWhile it certainly isn’t the next bitcoin, Mr Hankey Coin certainly has all the makings of the next 10 or even 100x meme coin.\n\nThat’s thanks to its massive liquidity lock, still super low market cap, fast-growing social media community and already trending status on DEXTools.com, which is every meme coin degens favorite shitcoin trading tool.\n\nWhile Mr Hankey Coin is far from a sure bet, its potential to pump is high.\n\nMr Hankey Coin can be purchased on Uniswap Here.\n\nVisit Mr Hankey Coin Here\n\nSnek (SNEK)\n\nMeme coins aren’t just for the Ethereum ecosystem.\n\nThe Cardano community got in on the act earlier this year with the launch of a new snake-themed meme coin called SNEK ($SNEK), which is, of course, a play on the spelling of the word Snake.\n\nAccording to the SNEK website, the aim is to create a “sustainable and inclusive community-driven token on the Cardano blockchain, providing a rewarding experience for our token holders”.\n\n$SNEK reached a market cap of more than $100 million in late May when its price topped out at around $0.0014.\n\nBut it has since dropped to a market cap of around $30 million as meme coin degens look for more exciting, newer projects.\n\n$SNEK will probably keep falling and could hit new all-time lows before the end of 2023.\n\nBonk! (BONK)\n\nMeme coins also exist on Solana, with Bonk the current top dog.\n\nMany Solana community members have feelings of fondness towards Bonk.\n\nThe meme coin was launched at a time when the Solana ecosystem was in a real crisis, with a collapsing SOL price and rapid DeFi ecosystem outflows amid Solana being tagged a “Sam coin” in wake of the collapse of Sam Bankman-Fried’s fraudulent cryptocurrency exchange FTX.\n\nIts success helped breathe life into the struggling ecosystem when it was launched around Christmas time 2022, and to bring back some optimism.\n\nThat being said, Bonk’s time in the limelight is over and at current levels around $0.00000037, it is over 90% down from its all-time highs above $0.000004.\n\nAt-loss traders will probably continue unloading their bag to recover at least some of their initial investment and Bonk will probably keep falling into the end of 2023.\n\nDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnBlZGlhLm9yZy9iZWdpbm5lcnMtZ3VpZGUvd2hhdC1hcmUtd3JhcHBlZC1hbmQtcGVnZ2VkLXRva2Vucy_SAU1odHRwczovL2NvaW5wZWRpYS5vcmcvYmVnaW5uZXJzLWd1aWRlL3doYXQtYXJlLXdyYXBwZWQtYW5kLXBlZ2dlZC10b2tlbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Back to Basics: Learn About Wrapped and Pegged Tokens - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nQadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nWhat if you could use your Bitcoin on the Ethereum blockchain, or your Ethereum on the Solana blockchain? That’s where wrapped tokens come in. They’re like undercover agents, disguised as tokens from one blockchain but actually representing tokens from another. This allows you to use your favorite tokens on any blockchain that supports them! Perfect, right?\n\nPegged tokens, on the other hand, are like anchors in the stormy seas of cryptocurrency. They’re designed to maintain a stable value, typically by being pegged to a fiat currency like the US dollar. This makes them a good option for those who are looking for a more stable investment.\n\nTogether, wrapped and pegged tokens make the crypto world a more interconnected and user-friendly place. They allow you to move your assets between different blockchains and to invest in tokens that are less volatile than others.\n\nSo, if you’re looking to get the most out of the crypto world, be sure to familiarize yourself with wrapped and pegged tokens. And for that, this article is all you need!\n\nKey Takeaways Wrapped tokens address the issues of interoperability, cross-chain transactions and wider acceptance of the DeFi system.Pegged tokens ensure price stability in the highly volatile crypto market.Wrapped BTC is the 23rd largest cryptocurrency in the crypto sphere.In the latest news, Tether lost 1:1 to USD amid heightened sell pressure in Curve’s 3Pool. Read here to know more about USDC Vs. USDT ongoing updates.\n\n1.1. The Journey of Token Evolution\n\nThe evolution of tokens is an intriguing story in the world of cryptocurrency. It all began with the inception of Bitcoin, the pioneer of digital currencies. However, as technology advanced, the need for more sophisticated token types emerged.\n\nWrapped Tokens: The introduction of wrapped tokens marked a significant milestone. These tokens were designed to bridge the gap between different blockchains. Initially, most decentralized projects operated on the Ethereum blockchain, creating complexities when dealing with tokens like Bitcoin, which had its blockchain. Wrapped tokens resolved this by allowing token holders to seamlessly interact with various token ecosystems. This innovation gave birth to a new era of token systems.\n\nPegged Tokens: Another pivotal development was the creation of pegged tokens, which addressed a prominent issue in the cryptocurrency realm – price volatility. The crypto market’s wild price swings posed challenges for stable transactions. In response, stablecoins were introduced. These coins are tethered to relatively stable assets like the US Dollar, providing a dependable value. Wrapped and pegged tokens are the cornerstones of crypto innovation, enhancing the adaptability and versatility of digital currencies.\n\n1.2. Interoperability and Stability in Tokens?\n\nInteroperability and stability are fundamental concepts in the world of wrapped and pegged tokens. Let’s delve into what these terms mean:\n\nInteroperability is the ability of different blockchains and related tokens to work with each other without any obstacle. We know that blockchain networks have their own protocols and regulations. However, if we wish to tap the most out of this technology, blockchains shall not limit to their own ecosystems by allowing them to work with other networks too. Interoperable tokens make this situation possible! They can “operate” with varied blockchains. It is very vital for adopting blockchain technology for a wider and more efficient use. Therefore, “interoperability” is a key role player in deriving the most out of the vast blockchain ecosystems.\n\nStability refers to the value of the tokens. Known for the extremely volatile space, the cryptocurrency world was in dire need of stable tokens which could maintain a constant value over a period of time. Stablecoins have majorly helped in this sector! They are pegged to stable assets’ values to minimize price volatility.\n\nThis is why interoperability and stability are salient features of the new crypto world!\n\n1. What are Wrapped Tokens?\n\nWe would like to take you through an example here! Suppose you have a box which can only hold specific coloured balls, that is, black. This box is like a blockchain which can only handle a specific kind of token such as an Ethereum-based token. You wish to put white coloured balls in the box but it cannot hold it due to its specification. Then, you need to wrap the balls with black paper in order to fit in! This wrapped ball is like a wrapped token. It represents the original white ball transformed into black to get inside the box. Similarly, tokens are wrapped to serve the purpose of fitting into different blockchain networks.\n\nWrapped tokens serve as a bridge, allowing you to use diverse tokens with different blockchains. For instance, you can employ wrapped Bitcoin within the Ethereum blockchain by wrapping the original Bitcoin in an Ethereum-compatible version. You can always unwrap the ball, or the token, to revert it to its original form. This wrapping and unwrapping process facilitates cross-blockchain operations.\n\n2.1. Why are Wrapped Tokens Used?\n\nThe adoption of wrapped tokens is driven by several compelling reasons:\n\nInteroperability: Wrapped tokens are the linchpin for cross-blockchain operations, enabling the seamless exchange of assets between different blockchain networks.\n\nWrapped tokens are the linchpin for cross-blockchain operations, enabling the seamless exchange of assets between different blockchain networks. Liquidity: They expand the realm of possibilities for users by providing access to a broader range of trading pairs and lending options. This, in turn, bolsters liquidity within decentralized exchanges (DEXs).\n\nThey expand the realm of possibilities for users by providing access to a broader range of trading pairs and lending options. This, in turn, bolsters liquidity within decentralized exchanges (DEXs). DeFi: Wrapped tokens play a vital role in the DeFi (Decentralized Finance) ecosystem, simplifying lending, borrowing, and yield farming processes.\n\nWrapped tokens play a vital role in the DeFi (Decentralized Finance) ecosystem, simplifying lending, borrowing, and yield farming processes. Compatibility: They make tokens compatible with various ecosystems and blockchain networks, promoting greater flexibility in asset utilization.\n\n2.2. Are Wrapped Tokens Safe?\n\nWhile wrapped tokens offer significant advantages, it’s crucial to be aware of associated risks:\n\nSmart Contract Vulnerabilities: Wrapped tokens are typically built on smart contracts, which can be vulnerable to bugs or code issues. A poorly audited smart contract could lead to potential financial losses.\n\nWrapped tokens are typically built on smart contracts, which can be vulnerable to bugs or code issues. A poorly audited smart contract could lead to potential financial losses. Regulatory Compliance: Wrapped tokens not complying with regulatory standards could face substantial challenges, potentially leading to legal issues.\n\nWrapped tokens not complying with regulatory standards could face substantial challenges, potentially leading to legal issues. Third-Party Dependence: Utilizing these tokens often involves reliance on third parties, such as custodians, for asset backing and facilitating token swaps. This reliance introduces an element of trust and dependency.\n\nTo mitigate these risks, it’s imperative for users to conduct thorough research, exercise caution, and choose well-audited and compliant wrapped tokens.\n\n2. Understanding Pegged Tokens and Their Role\n\nLet’s draw an analogy from our everyday experiences. Think of a food court where you exchange real money for tokens. Imagine these tokens are pegged to the value of $1 each. You decide to exchange $10 for 10 of these tokens, which you use to purchase your meals. After your meal, you have 2 tokens left. Here’s the beauty of it – you can effortlessly exchange these 2 tokens back for $2 USD because each token is pegged at $1.\n\nHence, the tokens are stabilised at the value of $1 USD each. Such is the role of pegged tokens in the crypto world.\n\n2.1. Definition: What is Pegging?\n\nPegging involves linking the value of one asset to another. In the context of crypto, pegged tokens are engineered to ensure stability by pegging their value to that of another asset.\n\n2.2. Purpose\n\nThe strong purposes of pegged tokens could be:\n\nStability : To ensure that there is trust in the value of tokens and it won’t change with the market fluctuations!\n\nReduced Volatility: To avoid the rapid fluctuations in the cryptocurrency world , pegged tokens are used to prevent breakdowns.\n\nUser-friendly nature: to make sure that the usage is easier for people to get accustomed to the crypto world as the token value remains familiar and constant.\n\nHedging: To be used as a “hedge” against the volatility of other currencies. During times of uncertainty, traders often move the funds to pegged tokens.\n\n2.3. Types of Pegged Tokens\n\nPegged tokens come in different forms:\n\nFiat-Collateralized: These tokens are backed by traditional fiat currency reserves like the USD. An example is USDT (Tether).\n\nCrypto-Collateralized: Pegged tokens backed by other cryptocurrencies, with a specific amount of currency locked up as collateral. DAI is an example.\n\nCommodity-Collateralized: These tokens are backed by physical assets like precious metals or commodities.\n\n2.4. Benefits of Pegged Tokens\n\nPegged tokens bring stability, reliability and versatility to the crypto world:\n\nPrice stability is there due to a constant value allotted to the asset.\n\nReduced volatility as extreme price fluctuations could be avoided\n\nCross-border transactions provide a reliable channel for conducting cross-border transfers.\n\nPegged tokens can make crypto easy for people who are hesitant to participate due to extreme price volatility.\n\nThese are globally accessible to all!\n\n3. Real-World Use of Wrapped Tokens\n\nThe tokens exist in the real world as they provide compatibility among different blockchains!\n\n3.1. WBTC Vs. WETH\n\nLet’s explore two notable examples:\n\nWBTC (Wrapped Bitcoin): WBTC represents Bitcoin on the Ethereum blockchain, effectively bringing the value of BTC into the ETH ecosystem. It permits BTC holders to utilize their tokens within the Ethereum network with ease. WBTC is backed 1:1 by actual BTC held in reserve by custodians.\n\nWBTC represents Bitcoin on the Ethereum blockchain, effectively bringing the value of BTC into the ETH ecosystem. It permits BTC holders to utilize their tokens within the Ethereum network with ease. WBTC is backed 1:1 by actual BTC held in reserve by custodians. WETH (Wrapped Ethereum): WETH represents Ether (ETH) and operates within the Ethereum blockchain itself. It creates standardized ERC-20 tokens, making Ether more versatile and tradeable on decentralized exchanges (DEXs). Unlike WBTC, WETH is not backed by external assets like BTC; it has an equivalent amount of Ether in reserve on the Ethereum blockchain.\n\nThese real-world examples illustrate how wrapped tokens enhance the utility and interconnectivity of different blockchain networks.\n\n4. Pegged Tokens and Their Real-World Utility\n\nPegged tokens have found real-world applications that effectively address challenges associated with cryptocurrency volatility. Here’s how these tokens are making a difference:\n\nInternational Trade: Pegged tokens are facilitating international trade by enabling businesses to transact without the risk of currency fluctuations and uncertainties. This reliability streamlines global commerce.\n\nMicrofinance: In regions with unstable local currencies, pegged tokens are playing a crucial role in microfinance loans and transactions. They provide a stable and dependable medium of exchange in areas where local currencies may experience significant volatility.\n\nCentral Bank Digital Currencies (CBDCs): Some central banks are exploring the concept of pegged tokens as digital representations of their national currencies. This move combines the benefits of cryptocurrencies with the stability of traditional currencies. A prominent example is Tether (USDT), a pegged token that maintains a 1:1 ratio with the USD.\n\n5. Emerging Trends in Wrapped and Pegged Tokens\n\nThe wrapped and pegged tokens have made some progress in the past few years, enabling trends like:\n\nIncreased DeFi adoption due to the demand for stable and cross-chain compatible assets.\n\nCross-chain solutions have been possible due to these tokens! They enable seamless movement of assets across a variety of blockchains.\n\nFacilitating DEXs and their functionality due to the greater adaptation to different ecosystems.\n\nAs the usage of these tokens increases, regulations in the crypto landscape have also been considered necessary. This is highly important for the safety of investors and businesses.\n\n6. End Note\n\nWrapped and Pegged tokens contribute to the broader adaptation of blockchain technology by providing solutions to the older ways of crypto trading. They have efficiently addressed the issues related to interoperability, stability and accessibility across different sets of blockchains.\n\nAs the crypto world continues to grow and mature, the importance of these tokens will only increase. And now, you have the knowledge to thrive!\n\n7. FAQs\n\nQ1. Are wrapped tokens safe to use? They are safe when used with the right information and backed by the renowned custodians or secure smart contracts. Good research is the key! Q2. What is an example of a Wrapped token? Wrapped Bitcoin (WBTC) is the one representing Bitcoin on Ethereum blockchain! Q3. What is an example of a Pegged token? Tether (USDT) is a pegged token pegged to the USD, aiming to maintain a 1:1 ratio.\n\nWell Done! You have now completed the Lesson. Complete the Quiz and Get Certified! All The Best! Enroll Quiz\n\nDisclaimer and Risk Warning The information provided in this content by Coinpedia Academy is for general knowledge and educational purpose only. It is not financial, professional or legal advice, and does not endorse any specific product or service. The organization is not responsible for any losses you may experience. And, Creators own the copyright for images and videos used. If you find any of the contents published inappropriate, please feel free to inform us."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnBlZGlhLm9yZy9iZWdpbm5lcnMtZ3VpZGUvd2hhdC1hcmUtd3JhcHBlZC1hbmQtcGVnZ2VkLXRva2Vucy_SAU1odHRwczovL2NvaW5wZWRpYS5vcmcvYmVnaW5uZXJzLWd1aWRlL3doYXQtYXJlLXdyYXBwZWQtYW5kLXBlZ2dlZC10b2tlbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Back to Basics: Learn About Wrapped and Pegged Tokens - Coinpedia Fintech News",
        "content": "Mustafa has been writing about Blockchain and crypto since many years. He has previous trading experience and has been working in the Fintech industry since 2017.\n\nQadir Ak is the founder of Coinpedia. He has over a decade of experience writing about technology and has been covering the blockchain and cryptocurrency space since 2010. He has also interviewed a few prominent experts within the cryptocurrency space.\n\nWhat if you could use your Bitcoin on the Ethereum blockchain, or your Ethereum on the Solana blockchain? That’s where wrapped tokens come in. They’re like undercover agents, disguised as tokens from one blockchain but actually representing tokens from another. This allows you to use your favorite tokens on any blockchain that supports them! Perfect, right?\n\nPegged tokens, on the other hand, are like anchors in the stormy seas of cryptocurrency. They’re designed to maintain a stable value, typically by being pegged to a fiat currency like the US dollar. This makes them a good option for those who are looking for a more stable investment.\n\nTogether, wrapped and pegged tokens make the crypto world a more interconnected and user-friendly place. They allow you to move your assets between different blockchains and to invest in tokens that are less volatile than others.\n\nSo, if you’re looking to get the most out of the crypto world, be sure to familiarize yourself with wrapped and pegged tokens. And for that, this article is all you need!\n\nKey Takeaways Wrapped tokens address the issues of interoperability, cross-chain transactions and wider acceptance of the DeFi system.Pegged tokens ensure price stability in the highly volatile crypto market.Wrapped BTC is the 23rd largest cryptocurrency in the crypto sphere.In the latest news, Tether lost 1:1 to USD amid heightened sell pressure in Curve’s 3Pool. Read here to know more about USDC Vs. USDT ongoing updates.\n\n1.1. The Journey of Token Evolution\n\nThe evolution of tokens is an intriguing story in the world of cryptocurrency. It all began with the inception of Bitcoin, the pioneer of digital currencies. However, as technology advanced, the need for more sophisticated token types emerged.\n\nWrapped Tokens: The introduction of wrapped tokens marked a significant milestone. These tokens were designed to bridge the gap between different blockchains. Initially, most decentralized projects operated on the Ethereum blockchain, creating complexities when dealing with tokens like Bitcoin, which had its blockchain. Wrapped tokens resolved this by allowing token holders to seamlessly interact with various token ecosystems. This innovation gave birth to a new era of token systems.\n\nPegged Tokens: Another pivotal development was the creation of pegged tokens, which addressed a prominent issue in the cryptocurrency realm – price volatility. The crypto market’s wild price swings posed challenges for stable transactions. In response, stablecoins were introduced. These coins are tethered to relatively stable assets like the US Dollar, providing a dependable value. Wrapped and pegged tokens are the cornerstones of crypto innovation, enhancing the adaptability and versatility of digital currencies.\n\n1.2. Interoperability and Stability in Tokens?\n\nInteroperability and stability are fundamental concepts in the world of wrapped and pegged tokens. Let’s delve into what these terms mean:\n\nInteroperability is the ability of different blockchains and related tokens to work with each other without any obstacle. We know that blockchain networks have their own protocols and regulations. However, if we wish to tap the most out of this technology, blockchains shall not limit to their own ecosystems by allowing them to work with other networks too. Interoperable tokens make this situation possible! They can “operate” with varied blockchains. It is very vital for adopting blockchain technology for a wider and more efficient use. Therefore, “interoperability” is a key role player in deriving the most out of the vast blockchain ecosystems.\n\nStability refers to the value of the tokens. Known for the extremely volatile space, the cryptocurrency world was in dire need of stable tokens which could maintain a constant value over a period of time. Stablecoins have majorly helped in this sector! They are pegged to stable assets’ values to minimize price volatility.\n\nThis is why interoperability and stability are salient features of the new crypto world!\n\n1. What are Wrapped Tokens?\n\nWe would like to take you through an example here! Suppose you have a box which can only hold specific coloured balls, that is, black. This box is like a blockchain which can only handle a specific kind of token such as an Ethereum-based token. You wish to put white coloured balls in the box but it cannot hold it due to its specification. Then, you need to wrap the balls with black paper in order to fit in! This wrapped ball is like a wrapped token. It represents the original white ball transformed into black to get inside the box. Similarly, tokens are wrapped to serve the purpose of fitting into different blockchain networks.\n\nWrapped tokens serve as a bridge, allowing you to use diverse tokens with different blockchains. For instance, you can employ wrapped Bitcoin within the Ethereum blockchain by wrapping the original Bitcoin in an Ethereum-compatible version. You can always unwrap the ball, or the token, to revert it to its original form. This wrapping and unwrapping process facilitates cross-blockchain operations.\n\n2.1. Why are Wrapped Tokens Used?\n\nThe adoption of wrapped tokens is driven by several compelling reasons:\n\nInteroperability: Wrapped tokens are the linchpin for cross-blockchain operations, enabling the seamless exchange of assets between different blockchain networks.\n\nWrapped tokens are the linchpin for cross-blockchain operations, enabling the seamless exchange of assets between different blockchain networks. Liquidity: They expand the realm of possibilities for users by providing access to a broader range of trading pairs and lending options. This, in turn, bolsters liquidity within decentralized exchanges (DEXs).\n\nThey expand the realm of possibilities for users by providing access to a broader range of trading pairs and lending options. This, in turn, bolsters liquidity within decentralized exchanges (DEXs). DeFi: Wrapped tokens play a vital role in the DeFi (Decentralized Finance) ecosystem, simplifying lending, borrowing, and yield farming processes.\n\nWrapped tokens play a vital role in the DeFi (Decentralized Finance) ecosystem, simplifying lending, borrowing, and yield farming processes. Compatibility: They make tokens compatible with various ecosystems and blockchain networks, promoting greater flexibility in asset utilization.\n\n2.2. Are Wrapped Tokens Safe?\n\nWhile wrapped tokens offer significant advantages, it’s crucial to be aware of associated risks:\n\nSmart Contract Vulnerabilities: Wrapped tokens are typically built on smart contracts, which can be vulnerable to bugs or code issues. A poorly audited smart contract could lead to potential financial losses.\n\nWrapped tokens are typically built on smart contracts, which can be vulnerable to bugs or code issues. A poorly audited smart contract could lead to potential financial losses. Regulatory Compliance: Wrapped tokens not complying with regulatory standards could face substantial challenges, potentially leading to legal issues.\n\nWrapped tokens not complying with regulatory standards could face substantial challenges, potentially leading to legal issues. Third-Party Dependence: Utilizing these tokens often involves reliance on third parties, such as custodians, for asset backing and facilitating token swaps. This reliance introduces an element of trust and dependency.\n\nTo mitigate these risks, it’s imperative for users to conduct thorough research, exercise caution, and choose well-audited and compliant wrapped tokens.\n\n2. Understanding Pegged Tokens and Their Role\n\nLet’s draw an analogy from our everyday experiences. Think of a food court where you exchange real money for tokens. Imagine these tokens are pegged to the value of $1 each. You decide to exchange $10 for 10 of these tokens, which you use to purchase your meals. After your meal, you have 2 tokens left. Here’s the beauty of it – you can effortlessly exchange these 2 tokens back for $2 USD because each token is pegged at $1.\n\nHence, the tokens are stabilised at the value of $1 USD each. Such is the role of pegged tokens in the crypto world.\n\n2.1. Definition: What is Pegging?\n\nPegging involves linking the value of one asset to another. In the context of crypto, pegged tokens are engineered to ensure stability by pegging their value to that of another asset.\n\n2.2. Purpose\n\nThe strong purposes of pegged tokens could be:\n\nStability : To ensure that there is trust in the value of tokens and it won’t change with the market fluctuations!\n\nReduced Volatility: To avoid the rapid fluctuations in the cryptocurrency world , pegged tokens are used to prevent breakdowns.\n\nUser-friendly nature: to make sure that the usage is easier for people to get accustomed to the crypto world as the token value remains familiar and constant.\n\nHedging: To be used as a “hedge” against the volatility of other currencies. During times of uncertainty, traders often move the funds to pegged tokens.\n\n2.3. Types of Pegged Tokens\n\nPegged tokens come in different forms:\n\nFiat-Collateralized: These tokens are backed by traditional fiat currency reserves like the USD. An example is USDT (Tether).\n\nCrypto-Collateralized: Pegged tokens backed by other cryptocurrencies, with a specific amount of currency locked up as collateral. DAI is an example.\n\nCommodity-Collateralized: These tokens are backed by physical assets like precious metals or commodities.\n\n2.4. Benefits of Pegged Tokens\n\nPegged tokens bring stability, reliability and versatility to the crypto world:\n\nPrice stability is there due to a constant value allotted to the asset.\n\nReduced volatility as extreme price fluctuations could be avoided\n\nCross-border transactions provide a reliable channel for conducting cross-border transfers.\n\nPegged tokens can make crypto easy for people who are hesitant to participate due to extreme price volatility.\n\nThese are globally accessible to all!\n\n3. Real-World Use of Wrapped Tokens\n\nThe tokens exist in the real world as they provide compatibility among different blockchains!\n\n3.1. WBTC Vs. WETH\n\nLet’s explore two notable examples:\n\nWBTC (Wrapped Bitcoin): WBTC represents Bitcoin on the Ethereum blockchain, effectively bringing the value of BTC into the ETH ecosystem. It permits BTC holders to utilize their tokens within the Ethereum network with ease. WBTC is backed 1:1 by actual BTC held in reserve by custodians.\n\nWBTC represents Bitcoin on the Ethereum blockchain, effectively bringing the value of BTC into the ETH ecosystem. It permits BTC holders to utilize their tokens within the Ethereum network with ease. WBTC is backed 1:1 by actual BTC held in reserve by custodians. WETH (Wrapped Ethereum): WETH represents Ether (ETH) and operates within the Ethereum blockchain itself. It creates standardized ERC-20 tokens, making Ether more versatile and tradeable on decentralized exchanges (DEXs). Unlike WBTC, WETH is not backed by external assets like BTC; it has an equivalent amount of Ether in reserve on the Ethereum blockchain.\n\nThese real-world examples illustrate how wrapped tokens enhance the utility and interconnectivity of different blockchain networks.\n\n4. Pegged Tokens and Their Real-World Utility\n\nPegged tokens have found real-world applications that effectively address challenges associated with cryptocurrency volatility. Here’s how these tokens are making a difference:\n\nInternational Trade: Pegged tokens are facilitating international trade by enabling businesses to transact without the risk of currency fluctuations and uncertainties. This reliability streamlines global commerce.\n\nMicrofinance: In regions with unstable local currencies, pegged tokens are playing a crucial role in microfinance loans and transactions. They provide a stable and dependable medium of exchange in areas where local currencies may experience significant volatility.\n\nCentral Bank Digital Currencies (CBDCs): Some central banks are exploring the concept of pegged tokens as digital representations of their national currencies. This move combines the benefits of cryptocurrencies with the stability of traditional currencies. A prominent example is Tether (USDT), a pegged token that maintains a 1:1 ratio with the USD.\n\n5. Emerging Trends in Wrapped and Pegged Tokens\n\nThe wrapped and pegged tokens have made some progress in the past few years, enabling trends like:\n\nIncreased DeFi adoption due to the demand for stable and cross-chain compatible assets.\n\nCross-chain solutions have been possible due to these tokens! They enable seamless movement of assets across a variety of blockchains.\n\nFacilitating DEXs and their functionality due to the greater adaptation to different ecosystems.\n\nAs the usage of these tokens increases, regulations in the crypto landscape have also been considered necessary. This is highly important for the safety of investors and businesses.\n\n6. End Note\n\nWrapped and Pegged tokens contribute to the broader adaptation of blockchain technology by providing solutions to the older ways of crypto trading. They have efficiently addressed the issues related to interoperability, stability and accessibility across different sets of blockchains.\n\nAs the crypto world continues to grow and mature, the importance of these tokens will only increase. And now, you have the knowledge to thrive!\n\n7. FAQs\n\nQ1. Are wrapped tokens safe to use? They are safe when used with the right information and backed by the renowned custodians or secure smart contracts. Good research is the key! Q2. What is an example of a Wrapped token? Wrapped Bitcoin (WBTC) is the one representing Bitcoin on Ethereum blockchain! Q3. What is an example of a Pegged token? Tether (USDT) is a pegged token pegged to the USD, aiming to maintain a 1:1 ratio.\n\nWell Done! You have now completed the Lesson. Complete the Quiz and Get Certified! All The Best! Enroll Quiz\n\nDisclaimer and Risk Warning The information provided in this content by Coinpedia Academy is for general knowledge and educational purpose only. It is not financial, professional or legal advice, and does not endorse any specific product or service. The organization is not responsible for any losses you may experience. And, Creators own the copyright for images and videos used. If you find any of the contents published inappropriate, please feel free to inform us."
    }
]