[
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDkvMDUvc29sYW5hLXJpc2VzLXZpc2EtbmV0d29yay1leHBhbmQtdXNkYy1zZXR0bGVtZW50cy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Sep 2023 07:00:00 GMT",
        "title": "Solana rises after Visa taps network to expand USDC stablecoin settlements - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nSolana rises after Visa taps network to expand USDC stablecoin settlements: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Greg Moritz, co-founder and COO at crypto hedge fund AltTab Capital, weighs in on the implications of Grayscale winning its court battle against the SEC and price movement following the decision."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDkvMDUvc29sYW5hLXJpc2VzLXZpc2EtbmV0d29yay1leHBhbmQtdXNkYy1zZXR0bGVtZW50cy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Sep 2023 07:00:00 GMT",
        "title": "Solana rises after Visa taps network to expand USDC stablecoin settlements - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nSolana rises after Visa taps network to expand USDC stablecoin settlements: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Greg Moritz, co-founder and COO at crypto hedge fund AltTab Capital, weighs in on the implications of Grayscale winning its court battle against the SEC and price movement following the decision."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jbmJjLmNvbS8yMDIzLzA5LzA1L3NvbGFuYS1qdW1wcy1vbi12aXNhLXN0YWJsZWNvaW4tYW5ub3VuY2VtZW50LWFzLWJpdGNvaW4tYW5kLW90aGVyLWNyeXB0b2N1cnJlbmNpZXMtcmVtYWluLWZsYXQuaHRtbNIBhwFodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wOS8wNS9zb2xhbmEtanVtcHMtb24tdmlzYS1zdGFibGVjb2luLWFubm91bmNlbWVudC1hcy1iaXRjb2luLWFuZC1vdGhlci1jcnlwdG9jdXJyZW5jaWVzLXJlbWFpbi1mbGF0Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Sep 2023 07:00:00 GMT",
        "title": "Solana jumps on Visa stablecoin announcement as bitcoin and other cryptocurrencies remain flat - CNBC",
        "content": "The Solana logo on a phone screen and representation of cryptocurrencies are seen in this photo taken in Krakow, Poland, Aug. 21, 2021.\n\nThe native token of the Solana blockchain jumped Tuesday after Visa announced it will expand its stablecoin capabilities to the Ethereum alternative.\n\nSolana's sol token was last higher by 4.39% at $20.25, according to Coin Metrics. At one point it rose as much as 6%. Other cryptocurrencies were little changed, with bitcoin hovering below the flat line at $25,803.25 and ether up slightly at $1,640.06.\n\nThe move came after Visa announced it will introduce settlement of the USDC stablecoin over the Solana network. The payments giant said in a statement that the development could help \"improve the speed of cross-border settlement and providing a modern option for our clients to easily send or receive funds from Visa's treasury.\"\n\nSolana is one of several networks aiming to rival Ethereum. It's loved among developers, who may choose to build applications on it instead of Ethereum because of its speed and cost effectiveness. It's year-to-date gain is one of the biggest in the crypto market at 101%.\n\nThe announcement follows the launch of PayPal's company-branded stablecoin, PayPal USD. The company said the function of PayPal USD is to reduce friction for in-experience payments in virtual settings and allow direct flows to developers.\n\nVisa has been experimenting with USDC, the second-largest stablecoin in the market, since 2021, exploring how it could be used inside its treasury operations to make currency conversion in cross-border payments shorter and cheaper.\n\nBernstein has called stablecoins the \"monster killer app\" for crypto, identifying them as a nearly $3 trillion market over the next five years.\n\n\"We expect major global financial and consumer platforms to issue co-branded stablecoins to power value exchange on their platforms,\" Bernstein said. \"Going forward, we expect tokenized stablecoins to be a $2.8 trillion market, led by regulated, onshore stablecoins.\""
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jbmJjLmNvbS8yMDIzLzA5LzA1L3NvbGFuYS1qdW1wcy1vbi12aXNhLXN0YWJsZWNvaW4tYW5ub3VuY2VtZW50LWFzLWJpdGNvaW4tYW5kLW90aGVyLWNyeXB0b2N1cnJlbmNpZXMtcmVtYWluLWZsYXQuaHRtbNIBhwFodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wOS8wNS9zb2xhbmEtanVtcHMtb24tdmlzYS1zdGFibGVjb2luLWFubm91bmNlbWVudC1hcy1iaXRjb2luLWFuZC1vdGhlci1jcnlwdG9jdXJyZW5jaWVzLXJlbWFpbi1mbGF0Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Sep 2023 07:00:00 GMT",
        "title": "Solana jumps on Visa stablecoin announcement as bitcoin and other cryptocurrencies remain flat - CNBC",
        "content": "The Solana logo on a phone screen and representation of cryptocurrencies are seen in this photo taken in Krakow, Poland, Aug. 21, 2021.\n\nThe native token of the Solana blockchain jumped Tuesday after Visa announced it will expand its stablecoin capabilities to the Ethereum alternative.\n\nSolana's sol token was last higher by 4.39% at $20.25, according to Coin Metrics. At one point it rose as much as 6%. Other cryptocurrencies were little changed, with bitcoin hovering below the flat line at $25,803.25 and ether up slightly at $1,640.06.\n\nThe move came after Visa announced it will introduce settlement of the USDC stablecoin over the Solana network. The payments giant said in a statement that the development could help \"improve the speed of cross-border settlement and providing a modern option for our clients to easily send or receive funds from Visa's treasury.\"\n\nSolana is one of several networks aiming to rival Ethereum. It's loved among developers, who may choose to build applications on it instead of Ethereum because of its speed and cost effectiveness. It's year-to-date gain is one of the biggest in the crypto market at 101%.\n\nThe announcement follows the launch of PayPal's company-branded stablecoin, PayPal USD. The company said the function of PayPal USD is to reduce friction for in-experience payments in virtual settings and allow direct flows to developers.\n\nVisa has been experimenting with USDC, the second-largest stablecoin in the market, since 2021, exploring how it could be used inside its treasury operations to make currency conversion in cross-border payments shorter and cheaper.\n\nBernstein has called stablecoins the \"monster killer app\" for crypto, identifying them as a nearly $3 trillion market over the next five years.\n\n\"We expect major global financial and consumer platforms to issue co-branded stablecoins to power value exchange on their platforms,\" Bernstein said. \"Going forward, we expect tokenized stablecoins to be a $2.8 trillion market, led by regulated, onshore stablecoins.\""
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3Zpc2EtdXNkYy1zb2xhbmEtc3RhYmxlY29pbi1leHBhbnNpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Sep 2023 07:00:00 GMT",
        "title": "Visa's crypto stablecoin settlement expands to Solana - Blockworks",
        "content": "Visa is now allowing its partners to send or receive USDC settlement payments via the Solana blockchain as it has begun working with new merchant banks, the company revealed Tuesday.\n\nAs part of the stablecoin settlement expansion, the payments giant can now send USDC-denominated payouts to Worldpay and Nuvei through Visa’s Circle Account. Worldpay and Nuvei can then route these payments in USDC to their end merchants.\n\nVisa enables the clearing, settlement and movement of billions of dollars a day, Visa Crypto Head Cuy Sheffield said in a post on X (formerly Twitter). The company must make sure the preferred currency is received in the correct amount from the issuer and sent to the merchant’s bank.\n\nThis process occurs across about 25 currencies between roughly 15,000 financial institutions, according to Visa.\n\nVisa began testing how it could use USD Coin (USDC) within its treasury operations in 2021. It did a pilot with Crypto.com, an exchange that now uses USDC to fulfill its settlement obligations on the Visa card in Australia.\n\n“This enables a modern and convenient option for crypto native issuers to more easily manage their card programs helping reduce the time and complexity of managing multiple bank accounts and international wire transfers,” Sheffield said in the X thread.\n\nBy now testing the use of Visa’s Circle account to conduct settlement payments on Solana to Worldpay and Nuvei, the company can now speed up settlement times for their merchants, it said.\n\n“Worldpay and Nuvei enable card acceptance for a diverse set of merchants across the world including a growing number of merchants interacting with the blockchain and crypto economy who may prefer to use USDC within their corporate treasuries over traditional fiat banking,” Sheffield added.\n\nThe new pilots come a few months after Visa had sought out crypto developers to advance adoption of public blockchain networks and stablecoin payments.\n\nA company spokesperson had told Blockworks in February that failures in the crypto industry would not change its strategy of being a bridge between traditional finance customers and the cryptocurrency ecosystem.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]