[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiKmh0dHBzOi8vbmZ0cGxhemFzLmNvbS9zb2xhbmEtbmZ0LXN0YW5kYXJkL9IBLmh0dHBzOi8vbmZ0cGxhemFzLmNvbS9zb2xhbmEtbmZ0LXN0YW5kYXJkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Feb 2023 08:00:00 GMT",
        "title": "Solana NFT Standard Lines Up a Major Overhaul - NFT Plazas",
        "content": "Solana NFT Standard Lines Up a Major Overhaul\n\nSome big changes are reportedly coming to Solana. As revealed by SharkyFi, a new NFT standard will soon arrive within the Solana ecosystem. More specifically, Solana will adopt programable NFTs that will allow for more control over assets, especially when it comes to royalties.\n\nThe Big Solana Switch\n\nIn a Twitter thread from January 25, 2023, SharkyFi explained that this new NFT standard comes from the formidable Metaplex development team.\n\n2/ @metaplex introduced a new standard of NFTs to help creators get their royalties back. The new asset class is called “programmable NFTs” which will exist alongside “normal NFTs”. (We will refer to them from this point onwards as MIP or pNFTs). — Sharky 🦈 NFT-backed loans (@SharkyFi) January 25, 2023\n\nIt also added that this sort of NFT protocol is on its way to becoming an industry standard, as many marketplaces, staking and lending protocols have added support for it. The standard allows creators to determine what protocols their NFTs can or cannot interact with and given the current debate regarding royalties, will likely be used quite a bit.\n\nSharkyFi predicts that over the next 30 to 60 days, a majority of NFTs based on the Solana blockchain will migrate to this standard and advised that creators begin making plans to migrate their assets on time. The issue of royalties was certainly a big topic last year and given this development, will likely remain so.\n\nWant more? Connect with NFT Plazas\n\nJoin the Weekly Newsletter\n\nJoin our Discord\n\nFollow us on Twitter\n\nLike us on Facebook\n\nFollow us on Instagram\n\n*All investment/financial opinions expressed by NFT Plazas are from the personal research and experience of our site moderators and are intended as educational material only. Individuals are required to fully research any product prior to making any kind of investment."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbmdhcGUuY29tL2Jsb2cvdG9wLW1ldGF2ZXJzZS12aXJ0dWFsLXdvcmxkcy13aXRoLWxhbmQtbmZ0cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Feb 2023 08:00:00 GMT",
        "title": "Top 5 Metaverse Virtual Worlds With Land NFTs - CoinGape",
        "content": "What is a Metaverse Virtual World?\n\nThe metaverse’s virtual worlds frequently appear overly complicated at first. But understanding a crypto or metaverse world only requires familiarity with a few fundamental ideas. Decentralization is the first.\n\nDecentralization refers to a metaverse world that uses blockchain technology in some parts. Control over standard systems is exercised by a single entity or person. However, the blockchain is a system that operates independently of all governing bodies. The blockchain is essentially owned in part by everyone who uses it. The same holds true for blockchain-based virtual worlds called the metaverse. Metaverse virtual worlds are frequently user-governed, which is another reason why the blockchain is used. Decentralized autonomous organizations (DAOs) are used in crypto universes like Decentraland to maintain user control over a larger system. It will also have verifiable provenance in the metaverse.\n\nadvertisement\n\nHere are the top 5 Metaverse Virtual Worlds with Land NFTs\n\nThe Sandbox NFT Worlds Cryptovoxels Decentraland Somnium Space\n\n1. The Sandbox\n\nThe Sandbox is a virtual world on the Ethereum and Polygon blockchains where players can create, own, and monetize their gaming experiences. The SAND token, which is native to the ecosystem, is used to acquire assets and reward users. Users can create their own game assets using VoxEdit, and then import those assets into GameMaker to create games, experiences, or events. The official Sandbox Marketplace also allows users to sell their creations to other players.\n\n2. NFT Worlds\n\nNFT Worlds is a collection of 10,000 virtual worlds on the Ethereum blockchain that exist as NFTs. Every world is an infinite universe that can be built into anything the user can conjure. Every land plot, which is a mini-metaverse built on top of Minecraft, is customizable by users, allowing them to craft, shape, and create their own worlds. Visitors are free to explore the distinctive qualities of each one. With NFT owners’ ability to completely alter their surroundings, the possibilities seem limitless. They are even able to design new game modes.\n\nAlso Read: Explain Splinterlands: Is Splinterlands An NFT game?\n\n3. Cryptovoxels\n\nCryptovoxels is one of the simplest blockchain virtual worlds to start using and developing. If the user wants to explore, all they need to do is click on a URL; no special software or equipment is necessary. In addition, it’s not necessary to own land to visit and take pleasure in Cryptovoxels. Each land parcel is an NFT, which means it is distinct and cannot be recreated or duplicated, just like actual physical land in real life, so buyers should be aware of this before making a purchase.\n\n4. Decentraland\n\nDecentraland describes itself as an Ethereum-powered virtual reality platform that enables users to produce, consume, and make money from content and applications. On the Decentraland stage, MANA serves as the native token for all transactions. Users buy plots of land in this virtual world that they can later explore, develop, and monetize. Users have developed a wide range of experiences on their LAND parcels since it opened to the public in February 2020.\n\n5. Somnium Space\n\nSomnium Space is a blockchain-powered open-source social virtual reality world that is entirely shaped by its users. However, it allows them to purchase virtual land on which they can erect residences and other structures in virtual reality. Early in 2020, Somnium 2.0 was released, bringing the endeavor one step closer to a genuine Ready Player One virtual experience. Somnium 2.0 hosts all of its players in a single enormous world, in contrast to the majority of multiplayer VR games. However, which divides players into sub-servers and mirrored instanced rooms. Players can buy virtual land and then proceed to build whatever they want on it.\n\nAlso Read: What Is Star Atlas? How Much Does It Cost To Play Star Atlas?"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbmdhcGUuY29tL2Jsb2cvdG9wLW1ldGF2ZXJzZS12aXJ0dWFsLXdvcmxkcy13aXRoLWxhbmQtbmZ0cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 04 Feb 2023 08:00:00 GMT",
        "title": "Top 5 Metaverse Virtual Worlds With Land NFTs - CoinGape",
        "content": "What is a Metaverse Virtual World?\n\nThe metaverse’s virtual worlds frequently appear overly complicated at first. But understanding a crypto or metaverse world only requires familiarity with a few fundamental ideas. Decentralization is the first.\n\nDecentralization refers to a metaverse world that uses blockchain technology in some parts. Control over standard systems is exercised by a single entity or person. However, the blockchain is a system that operates independently of all governing bodies. The blockchain is essentially owned in part by everyone who uses it. The same holds true for blockchain-based virtual worlds called the metaverse. Metaverse virtual worlds are frequently user-governed, which is another reason why the blockchain is used. Decentralized autonomous organizations (DAOs) are used in crypto universes like Decentraland to maintain user control over a larger system. It will also have verifiable provenance in the metaverse.\n\nadvertisement\n\nHere are the top 5 Metaverse Virtual Worlds with Land NFTs\n\nThe Sandbox NFT Worlds Cryptovoxels Decentraland Somnium Space\n\n1. The Sandbox\n\nThe Sandbox is a virtual world on the Ethereum and Polygon blockchains where players can create, own, and monetize their gaming experiences. The SAND token, which is native to the ecosystem, is used to acquire assets and reward users. Users can create their own game assets using VoxEdit, and then import those assets into GameMaker to create games, experiences, or events. The official Sandbox Marketplace also allows users to sell their creations to other players.\n\n2. NFT Worlds\n\nNFT Worlds is a collection of 10,000 virtual worlds on the Ethereum blockchain that exist as NFTs. Every world is an infinite universe that can be built into anything the user can conjure. Every land plot, which is a mini-metaverse built on top of Minecraft, is customizable by users, allowing them to craft, shape, and create their own worlds. Visitors are free to explore the distinctive qualities of each one. With NFT owners’ ability to completely alter their surroundings, the possibilities seem limitless. They are even able to design new game modes.\n\nAlso Read: Explain Splinterlands: Is Splinterlands An NFT game?\n\n3. Cryptovoxels\n\nCryptovoxels is one of the simplest blockchain virtual worlds to start using and developing. If the user wants to explore, all they need to do is click on a URL; no special software or equipment is necessary. In addition, it’s not necessary to own land to visit and take pleasure in Cryptovoxels. Each land parcel is an NFT, which means it is distinct and cannot be recreated or duplicated, just like actual physical land in real life, so buyers should be aware of this before making a purchase.\n\n4. Decentraland\n\nDecentraland describes itself as an Ethereum-powered virtual reality platform that enables users to produce, consume, and make money from content and applications. On the Decentraland stage, MANA serves as the native token for all transactions. Users buy plots of land in this virtual world that they can later explore, develop, and monetize. Users have developed a wide range of experiences on their LAND parcels since it opened to the public in February 2020.\n\n5. Somnium Space\n\nSomnium Space is a blockchain-powered open-source social virtual reality world that is entirely shaped by its users. However, it allows them to purchase virtual land on which they can erect residences and other structures in virtual reality. Early in 2020, Somnium 2.0 was released, bringing the endeavor one step closer to a genuine Ready Player One virtual experience. Somnium 2.0 hosts all of its players in a single enormous world, in contrast to the majority of multiplayer VR games. However, which divides players into sub-servers and mirrored instanced rooms. Players can buy virtual land and then proceed to build whatever they want on it.\n\nAlso Read: What Is Star Atlas? How Much Does It Cost To Play Star Atlas?"
    }
]