[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiJ2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9zcGVha2VyL3Jhai1nb2thbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 12:42:00 GMT",
        "title": "Blockworks - Blockworks",
        "content": "Raj Gokal is the co-founder of Solana and COO of Solana Labs. He previously was director of product at Omada Health; an entrepreneur-in-residence at Rock Health; the co-founder of Sano, a minimally invasive glucose sensor company; and an investor at General Catalyst Partners. Raj has a Bachelor of Science in Economics from the Wharton School of the University of Pennsylvania."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZmluYm9sZC5jb20vaW52ZXN0b3JzLXRha2Utbm90ZS1zb2xhbmEtYW5kLWNhcmRhbm8tc2hvdy1sb3ctcmlzay1oaWdoLXJld2FyZC1wb3RlbnRpYWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 07:00:00 GMT",
        "title": "Investors take note: Solana and Cardano show low risk, high reward potential - Finbold - Finance in Bold",
        "content": "Although the cryptocurrency sector has been going through a rough patch, its collective market capitalization threatening to drop below $1 trillion, some of its assets, particularly Solana (SOL) and Cardano (ADA), have performed better than others in terms of risk-adjusted returns.\n\nSpecifically, among the top altcoins by market cap, Solana and Cardano, have recorded the highest year-to-date risk-adjusted returns for the period through May 3, as measured using the Sharpe ratio, according to the data published by crypto market analysis platform Kaiko on May 9.\n\nLargest altcoins by market cap’s risk-adjusted returns. Source: Kaiko\n\nWhat does this mean?\n\nAs the platform’s analysts explained, “the Sharpe ratio measures the excess return of an asset per unit of volatility, with a ratio of 1 or above generally considered good.” Indeed, both Cardano and Solana had a Sharpe ratio of above 2, which means their investors are taking on lower risk compared to the reward.\n\nFollowing the two top performers are BNB (BNB) – the native token of the crypto trading platform Binance, XRP (XRP) – the native cryptocurrency of the blockchain company Ripple, as well as the cross-chain protocol Polkadot (DOT), scaling solution Polygon (MATIC), and peer-to-peer cryptocurrency Litecoin (LTC), all with a Sharpe ratio of above 1.\n\nMeme coins are more risky?\n\nMeanwhile, meme-inspired digital assets Shiba Inu (SHIB) and Dogecoin (DOGE) both have a Sharpe ratio of below 1, making them the poorest performers on the list of top altcoins by market cap in the sense of risk-adjusted returns. According to the Kaiko analysis:\n\n“In contrast, meme tokens like Dogecoin and Shiba Inu have been the worst performers, with a ratio below 1. This implies that meme coin investors are taking on more risk relative to the compensation received.”\n\nThat said, Solana and Cardano have had similar price trends in the past week as Dogecoin and Shiba Inu, as they all suffered losses. In fact, SOL declined 7.75%, ADA 7.97%, DOGE 7.51%, and SHIB 11.41% during that time.\n\nSolana 7-day price chart. Source: Finbold\n\nHowever, interestingly, both DOGE and SHIB have witnessed slight increases over the previous 24 hours, climbing 0.52% and 0.88%, respectively, during which time SOL and ADA saw the opposite – the former dropped 0.27% and the latter 0.73% on the day.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vdS50b2RheS90bXMtbmV0d29ya3MtdG1zbi1pY28td2VsY29tZXMtYWxsLWludmVzdG9ycy13aGlsZS1wb2x5Z29uLW1hdGljLWFuZC1zb2xhbmEtc29sLW5ldHdvcmstYWN0aXZpdHnSAXRodHRwczovL3UudG9kYXkvdG1zLW5ldHdvcmtzLXRtc24taWNvLXdlbGNvbWVzLWFsbC1pbnZlc3RvcnMtd2hpbGUtcG9seWdvbi1tYXRpYy1hbmQtc29sYW5hLXNvbC1uZXR3b3JrLWFjdGl2aXR5P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 07:00:00 GMT",
        "title": "TMS Network's (TMSN) ICO Welcomes All Investors while Polygon (MATIC) and Solana (SOL) Network Activity Spikes - U.Today",
        "content": "Advertisement\n\nCrypto investing is unforgiving. Savvy investors identify cryptos with huge growth potential and hold them. That's because established cryptos with huge market caps do not offer much growth potential. Sometimes, they crash too, making them unsuitable for high-growth investment strategies.\n\nTMS Network's (TMSN) pre-sale Stage Three kicks off\n\nTMS Network (TMSN) is in stage 3 of its token presale. For a limited time only, TMS Network (TMSN) is being offered to presale buyers at a discounted price of $0.08.\n\nFor those who've come across TMS Network (TMSN) for the first time, it's an upcoming decentralized exchange with a twist. Unlike other DEXs that offer only crypto trading services on their platform, TMS Network (TMSN) also offers CFDs, forex, and stocks for trading. That's a first for a DEX. In effect, TMS Network (TMSN) bridges the gulf between fiat asset trading and crypto asset trading in one swell swoop.\n\nWith TMS Network (TMSN) bringing the benefits of decentralization to investors – both fiat and crypto investors – worldwide, the platform is revolutionizing the DeFi space.\n\nPolygon (MATIC) evolves into largest EVM blockchain\n\nPolygon (MATIC) is one of the most ambitious layer-2 scaling solutions for Ethereum (ETH) platform. Unlike other L2 blockchains, Polygon (MATIC) does not merely emphasize improvements in speed, scalability, and security of the blockchain. Polygon (MATIC) turns Ethereum (ETH) into a full-fledged multichain ecosystem. Polygon (MATIC) achieves this by allowing developers to create Ethereum-compatible blockchains. Using Polygon (MATIC), developers can build a variety of blockchains, including ZK rollups, optimistic rollups, etc.\n\nPolygon (MATIC) enjoys the backing of heavyweights like Coinbase and Binance. So, Polygon (MATIC) is here to stay. Nevertheless, Polygon (MATIC) continues to operate in an increasingly crowded space. There are dozens of layer-2 scaling solutions for Ethereum (ETH), with each of them offering unique advantages over the other.\n\nSolana (SOL) growth is getting slower\n\nVery few tokens have tasted success rivaling that of Solana (SOL) in recent years. Launched in 2020, it took Solana (SOL) less than a year to attain a market capitalization of $1 billion. Solana's (SOL) meteoric rise was fueled by its superior blockchain and utility-driven features. Solana (SOL) promised drastically higher speed, scalability, and low transaction fees compared to other smart contract platforms. In theory, Solana (SOL) is a huge improvement over incumbents like Ethereum (ETH) for dApps developers. In practice too, Solana (SOL) managed to deliver on its promises. However, Solana (SOL) lacks one crucial aspect: reliability.\n\nIn 2022 alone, Solana (SOL) suffered from several outages that lasted several hours. These outages affect the performance of dApps on its platform, not to mention the uncertainty it fosters among investors. Also, the recent collapse of FTX, a major backer of Solana (SOL), has left the latter in a state of crisis too.\n\nPresale: https://presale.tmsnetwork.io\n\nWebsite: https://tmsnetwork.io\n\nTelegram: https://t.me/TMSNetworkIO"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vc29sYW5hLWxhdW5jaGVzLXNhZ2EtcGhvbmUtcGFja2VkLXdpdGgtaW5ub3ZhdGl2ZS1mZWF0dXJlcy10by10YWtlLW9uLWJpbGxpb24tZG9sbGFyLWRlZmktbWFya2V0L9IBiQFodHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vc29sYW5hLWxhdW5jaGVzLXNhZ2EtcGhvbmUtcGFja2VkLXdpdGgtaW5ub3ZhdGl2ZS1mZWF0dXJlcy10by10YWtlLW9uLWJpbGxpb24tZG9sbGFyLWRlZmktbWFya2V0Lz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 07:00:00 GMT",
        "title": "Solana Launches Saga Phone, Packed with Innovative Features, to Take on Billion-Dollar DeFi Market - Crypto News Flash",
        "content": "Inside the Saga mobile box, the Solana team has put a seed phrase card to help users store their digital assets securely.\n\nAs for security, the Saga mobile phone has the latest Android 13 enhanced with a rear fingerprint sensor.\n\nThe Solana (SOL) network has recorded a sharp uptick in active users, clocking above 200 million in May. The hype over its Saga smartphone has significantly helped the Solana ecosystem attract more DeFi developers. Moreover, the Solana ecosystem takes pride in more than $263 million in total value locked (TVL). Additionally, the Saga smartphone that uses the Android operating system has an inbuilt vault to help users secure their digital assets safely.\n\nAs a result, the Solana network is well-positioned to revolutionize the development of decentralized applications (Dapps) through its hybrid consensus model, consisting of proof-of-history (PoH) and proof-of-stake (PoS).\n\nSolana Announces Public Orders for Saga Smartphone\n\nAfter months of meticulous work, the Solana team announced its smartphone flagship product is available for general public orders with shipping ready for the United States, Canada, the European market, the United Kingdom, Switzerland, Australia, and New Zealand.\n\nThe Solana’s Saga android phone has been marketed as a Web3 simplified ecosystem. Moreover, Saga mobile users can enjoy a simplified web3 experience with Seed Vault, a secure self-custody solution that protects key phrases through biometric authentication and encryption. Additionally, Saga mobile users can tap on the Solana Dapp Store to access a wide range of decentralized financial protocols.\n\nJUST DROPPED Saga public orders are now open for 🇺🇸🇨🇦🇬🇧🇪🇺🇨🇭🇦🇺🇳🇿 Order yours at: https://t.co/4ZIEs6ZysF pic.twitter.com/bmAhBFWToR — Solana Mobile 🌱 (@solanamobile) May 8, 2023\n\nNotably, the Solana Saga mobile early buyers are expected to get an NFT pass that is, however, non-transferable.\n\n“Saga owners can claim a Saga Genesis token when setting up their device. This unique device-bound non-transferable NFT serves as your key to Saga Rewards, unlocking exclusive content and offers from Solana Mobile and dApps listed on the Solana dApp Store,” Solana noted in the announcement.\n\nKey Saga Features\n\nThe Saga phone has been compared to the Tesla Roadster, which was unveiled as the concept electric car. As a result, the Solana team expects to launch more models in the near future with updated features and capabilities. Nevertheless, the new Saga mobile is packed with premium hardware destined to make Web3 navigation seamless.\n\nFor instance, Solana’s Saga mobile has a dual rear camera with 12 megapixels. On the front side, the Saga mobile has a 16 MP camera. Interestingly, the Saga mobile phone comes with wireless charging for its 4110 mAh battery. As a result, users can enjoy the 6.67-inch screen size that uses AMOLED technology and 120 Hz with minimal interruptions.\n\nAs for security, the Saga mobile phone has the latest Android 13 enhanced with a rear fingerprint sensor.\n\nSOL Price Action\n\nThe Solana price is expected to gain more value as the underlying blockchain anticipates increased on-chain activity from the Saga mobile users. Currently, the SOL price is trading around $20, up more than 100 percent YTD, with an FDV of about $11 billion.\n\nRecommended for you:"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDUvMTAvcmVucS1maW5hbmNlLWZpbmFsLXByZXNhbGUtc3RhZ2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 May 2023 07:00:00 GMT",
        "title": "RenQ Finance: final Presale stage - The Cryptonomist",
        "content": "SPONSORED POST*\n\nSolana (SOL) is a decentralized blockchain platform that aims to enable scalable, user-friendly apps worldwide. The project has raised over $315 million in funding from various investors and has a market cap of over $8 billion as of May 2023. However, only some things are rosy for Solana (SOL) and its investors. The platform has faced several technical issues and delays that have frustrated its users and eroded their confidence. Many Solana (SOL) investors are tired of waiting for the project to deliver its promises and looking for alternatives in the crypto space.\n\nOne such alternative is RenQ Finance, a unified DeFi platform offering various services and products across multiple blockchains. RenQ Finance (RENQ) has been gaining traction and popularity among crypto enthusiasts and has recently entered the last stage of its presale. In this article, we will compare and contrast Solana (SOL) and RenQ Finance (RENQ) and see why many investors switch from the former to the latter.\n\nSolana (SOL): A Promising but Problematic Platform\n\nSolana (SOL) claims that its blockchain is the fastest worldwide. This is backed by a 400-millisecond average block time and a potential throughput of 50,000 transactions per second (TPS). The platform employs Proof of History (PoH), an innovative consensus mechanism. These timestamp transactions enable the simultaneous execution of smart contracts. Solana (SOL) supports a wide range of programming languages and frameworks.\n\nHowever, Solana (SOL) has also faced several challenges and setbacks that have tarnished its reputation and performance. In September 2021, Solana (SOL) experienced a network outage that lasted for over 17 hours due to a denial-of-service attack that overwhelmed the network with transaction requests. The incident exposed the vulnerability of Solana (SOL)’s network and required a manual restart by validators. In October 2021, Solana (SOL) suffered another network disruption that lasted about two hours due to a bug in the validator software that caused some nodes to crash. The issue was resolved by upgrading the software version and restarting the nodes. In January 2022, Solana (SOL) faced another network slowdown that affected some DApps and transactions due to high congestion and low fees. The problem was attributed to spam transactions that flooded the network and consumed resources.\n\nThese incidents have raised doubts about Solana’s (SOL) reliability, security, and scalability among its users and investors. Many have expressed dissatisfaction and frustration with Solana’s (SOL) frequent technical glitches and lack of communication. Some have even decided to sell their SOL tokens and look for other platforms offering better service and stability.\n\nRenQ Finance: A Unified DeFi Platform\n\nRenQ Finance (RENQ) is a community-driven organization that aims to provide a one-stop solution for all traders under one platform in the DeFi world. The project offers a multi-chain decentralized exchange (DEX) that connects all isolated blockchains and enables cross-chain asset exchange. RenQ Finance (RENQ) also provides various features and products, such as perpetual futures trading, yield optimization, lending protocol, DeFi & NFT launchpad, and DAO governance. RenQ Finance (RENQ) aims to empower its users with a comprehensive solution by providing a platform with the benefits of a centralized exchange.\n\nRenQ Finance (RENQ) has been making waves in the crypto community lately and for a good reason. The project’s presale has hit $17 million, described by experts as a significant milestone for the platform. The presale was divided into eight stages, with the price of RENQ tokens increasing after each stage’s hard cap has been reached. The presale is now in the final stage and is expected to start listing on major exchanges as soon as all allocated tokens are sold.\n\nMarket analysts have praised RenQ Finance (RENQ) as one of the most promising cryptos to hold in 2023 and in the upcoming 2024-25 bull run. The token is set for 20x to 100x returns between 2023 and 2025. In addition to experts’ endorsement, RenQ Finance (RENQ) has also received positive feedback and support from various media outlets, influencers, partners, and investors. While Solana (SOL) continues to sink and upset holders, RenQ Finance (RENQ) could be a strong hedge.\n\nClick Here to Buy RenQ Finance (RENQ) Tokens.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\n*This article was paid for Cryptonomist did not write the article or test the platform."
    }
]