[
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJlbnppbmdhLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5LzIzLzEyLzM2MzgwMDQ1L3NvbGFuYXMtbmV0d29yay1hY3Rpdml0eS1zb2Fycy1hcy1pdC1icmVha3MtMTAwLW1hcmvSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzYzODAwNDU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Solana's Network Activity Soars As It Breaks $100 Mark - Emeren Group (NYSE:SOL) - Benzinga",
        "content": "The cryptocurrency Solana SOL/USD established fresh records for monthly new and active addresses.\n\nWhat Happened: As reported by The Block, the price upswing of Solana has been paralleled by a substantial increase in network activity.\n\nThe count of active Solana addresses has seen an approximate 50% growth over the figures recorded in November, surpassing the 15.6 million mark. This is a leap from the previous record of 15.2 million, set in January.\n\nFurthermore, The Block’s data indicates that the tally of new Solana addresses has also set a new record this December, at 6.8 million, outdoing the former record of 6.6 million established in May 2023.\n\nSee Also: ‘Dogecoin Killer’ Burning Spree Skyrockets 161,500% — 8B SHIB Permanently Removed From Circulation In Sin\n\nHowever, the count of non-voting transactions, a crucial metric indicating genuine user activity and network validation, has not set a new record and remains below their November figures. These transactions are essential as they validate the network besides facilitating money transfers or activating smart contracts on the Solana network.\n\nWhy It Matters: The price and network activity of Solana has seen a significant surge following its rebound from a major price plunge to below $10, triggered by the FTX collapse over a year ago.\n\nPrice Action: At the time of writing, SOL was trading at $123.31, up 8.31% in the last 24 hours, according to Benzinga Pro.\n\nRead Next: Michael Saylor Predicts ‘Demand Shock’ As Bitcoin’s Market Cap Skyrockets 160% In 2023, Gaining $530B On\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJlbnppbmdhLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5LzIzLzEyLzM2MzgwMDQ1L3NvbGFuYXMtbmV0d29yay1hY3Rpdml0eS1zb2Fycy1hcy1pdC1icmVha3MtMTAwLW1hcmvSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzYzODAwNDU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Solana's Network Activity Soars As It Breaks $100 Mark - Emeren Group (NYSE:SOL) - Benzinga",
        "content": "The cryptocurrency Solana SOL/USD established fresh records for monthly new and active addresses.\n\nWhat Happened: As reported by The Block, the price upswing of Solana has been paralleled by a substantial increase in network activity.\n\nThe count of active Solana addresses has seen an approximate 50% growth over the figures recorded in November, surpassing the 15.6 million mark. This is a leap from the previous record of 15.2 million, set in January.\n\nFurthermore, The Block’s data indicates that the tally of new Solana addresses has also set a new record this December, at 6.8 million, outdoing the former record of 6.6 million established in May 2023.\n\nSee Also: ‘Dogecoin Killer’ Burning Spree Skyrockets 161,500% — 8B SHIB Permanently Removed From Circulation In Sin\n\nHowever, the count of non-voting transactions, a crucial metric indicating genuine user activity and network validation, has not set a new record and remains below their November figures. These transactions are essential as they validate the network besides facilitating money transfers or activating smart contracts on the Solana network.\n\nWhy It Matters: The price and network activity of Solana has seen a significant surge following its rebound from a major price plunge to below $10, triggered by the FTX collapse over a year ago.\n\nPrice Action: At the time of writing, SOL was trading at $123.31, up 8.31% in the last 24 hours, according to Benzinga Pro.\n\nRead Next: Michael Saylor Predicts ‘Demand Shock’ As Bitcoin’s Market Cap Skyrockets 160% In 2023, Gaining $530B On\n\nDisclaimer: This content was partially produced with the help of Benzinga Neuro and was reviewed and published by Benzinga editors."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8yNS9hYnNvbHV0ZWx5LWZlYXNpYmxlLWZvci1zb2xhbmEtdG8tZXhwbG9kZS1ieS1vdmVyLTIyMC1nb2luZy1mb3J3YXJkLXNheXMtaW52ZXN0YW5zd2Vycy1oZXJlcy10aGUtdGltZWxpbmUv0gGPAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzI1L2Fic29sdXRlbHktZmVhc2libGUtZm9yLXNvbGFuYS10by1leHBsb2RlLWJ5LW92ZXItMjIwLWdvaW5nLWZvcndhcmQtc2F5cy1pbnZlc3RhbnN3ZXJzLWhlcmVzLXRoZS10aW1lbGluZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "‘Absolutely Feasible’ for Solana To Explode by Over 220% Going Forward, Says InvestAnswers - The Daily Hodl",
        "content": "A widely followed crypto analyst says that another rise of over 3x is in the cards for one red-hot altcoin that has already skyrocketed about 1,000% since the start of the year.\n\nIn a new video update, the anonymous host of InvestAnswers tells his 461,000 YouTube subscribers that the smart contract platform Solana (SOL) could still see a significant price rise going forward.\n\nAccording to the strategist, he sees Solana’s dominance rising to 3% and the total market cap of crypto ascending to $5 trillion. SOL dominance is a metric that tracks how much of the total crypto market cap belongs to the Ethereum (ETH) rival.\n\nThe analyst notes that Solana’s growing dominance combined with the rising total crypto market cap could mean that SOL may hit a price tag well above $300.\n\n“SOL dominance it’s already at like 2.4%, 2.5%. Could it hit 3%? Yes – if that’s the case, 3% of 5 trillion is $150 billion, which takes the price of Solana to $363.\n\nWell, I’m going to back that number with another metric as well. If you asked me a year ago when SOL was at $8 [if] would it hit $363, [I’d have] said you’re crazy. Now, it’s absolutely feasible.”\n\nLooking at another metric, the analyst says that if SOL’s share of Ethereum’s market cap rises to just 20%, it would translate to a price target of $366 for Solana.\n\n“$366 is very similar to $363 which is based on 3% of crypto market dominance at a $5 trillion total valuation. So it’s interesting how those two are almost bang on. That’s why it’s always been there in my calculations since 2021 as an easy hurdle to achieve.”\n\nSolana is trading for $110.40, a decrease of more than 2.60% in the last 24 hours. A move toward the analyst’s price target suggests an upside potential of more than 228% for SOL.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Vadim Sadovski/solvertv"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vaW52ZXN0aW5naGF2ZW4uY29tL2NyeXB0by1ibG9ja2NoYWluL3dpbGwtc29sYW5hLWtlZXAtZ29pbmctdXAtc29sLXNob3dpbmctdHJlbmRzLXRvLTI1MC_SAWVodHRwczovL2ludmVzdGluZ2hhdmVuLmNvbS9jcnlwdG8tYmxvY2tjaGFpbi93aWxsLXNvbGFuYS1rZWVwLWdvaW5nLXVwLXNvbC1zaG93aW5nLXRyZW5kcy10by0yNTAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "Will Solana Keep Going Up? SOL Showing Trends to $250 - Investing Haven",
        "content": "Every crypto trader is asking the same question: will Solana keep going up?\n\nWell without a crystal ball handy, let’s look at some technical analysis and sentiment for Solana.\n\nSolana is working on massive gains after climbing more than 109% over the past 30 days.\n\nJust how long will this run go for?\n\n\n\n\n\n\n\nSOL/USD – SWING BUY OPPORTUNITY on TradingView.com\n\nAccording to some trade ideas on TradingView, it looks like there’s still some buying opportunity in the short term to accumulate more SOL.\n\nWhile it’s hard to advocate for opening a big position after such gains, it still looks like SOL has some room to run.\n\nZooming out a bit — a critical level for SOL to reach was $113 — which it had no problem smashing through.\n\nThe rapid rise in price has caused some crypto traders to lock in profits, which is never a bad idea.\n\nIn your opinion, what’s this cycle’s $AVAX, $LUNA, or $SOL? In other words, a token that has huge upside potential. And yes, $SOL could still do a 10x from here…but I’m thinking about something more undiscovered. — Route 2 FI (@Route2FI) December 25, 2023\n\nOne counter point to the tweet above is that for long-term investors, holding the bag may be more fruitful than aggressively searching for the next token to rise.\n\nWill Solana reach $250 in 2024?\n\nOur current Solana analysis forecast shows marks $143 as the key resistance area.\n\nTraders can expect some sell offs along the way. Especially around areas of price resistance.\n\nBesides, if we’ve learned anything from the latest crypto winter, it’s that pullbacks are to be expected.\n\n$250 seems like more of a realistic number to hit in 2025 or 2026 (conservatively).\n\nWill Solana crash soon?\n\nFirst, let’s define ‘crash’ in crypto terms.\n\nTraders and investors alike are used to drawdowns across the crypto landscape.\n\nBut a full-blown crash seems unlikely here. If you’re looking for another buying opportunity, levels around the $100 mark could be appealing.\n\n\n\n\n\n\n\nSOLANA RESISTANCE AND SUPPORT by laganicapobeda99 on TradingView.com\n\nAnother trading idea from the TradingView community presents a short-term bear case with support around the $60-70 range.\n\nWhile it would be surprising to see $SOL hitting that level any time soon, it’s always smart to DYOR (do your own research) and understand the risks involved with crypto.\n\nWill the Bitcoin Spot ETF affect SOL?\n\nArguably the biggest storyline in crypto right now is the anticipation of BlackRock’s BTC spot ETF.\n\nRecent reports suggest that the BTC spot ETF will be funded with $10,000,000 on Jan. 3, 2024.\n\nThe $10M figure is significant because it’s a large bump up from the initial seeding of $100,000 in Oct. ’23.\n\nPending approval, this could mark the sign of true institutional adoption within the crypto space.\n\nThis, by in large, should prompt good tailwinds for a crypto bull run in 2024.\n\nNow, what does this have to do with Solana?\n\nIf institutions are seeing the value in crypto — it could benefit the landscape as a whole, which includes Solana as a prominent name.\n\n\n\n\n\n\n\nSOL – Trading in nice Executed Head and Shoulders End Pattern ! by TiDu1981 on TradingView.com\n\nSummary\n\nWe’d expect a minor drawdown when the hype of the BTC spot ETF wears off, but we have 2024 forecasted for a big year in crypto.\n\nSolana remains one of the most intriguing names in blockchain, and if they continue to execute on their project, we expect investor sentiment to remain high throughout 2024.\n\n$250 is certainly in sight for Solana, but we wouldn’t expect this price target to be hit until 2025.\n\nFor more detailed follow ups, but also for top crypto tips, we recommend to follow our premium crypto charting alerts in which we share much more details across 35 tokens, with timely insights combined with perfectly timed buy alerts.\n\nDisclaimer: this is not financial advice. InvestingHaven uses technical and fundamental analysis to attempt to forecast market trends. Please consult with a licensed financial advisor prior to making any investment choices.\n\nReceive our crypto FREE newsletter alerts Download 50 crypto investing tips"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5jcnlwdG9nbG9iZS5jb20vbGF0ZXN0LzIwMjMvMTIvdGVjaC1yZXZpZXdlci1ta2JoZC1jcm93bnMtc29sYW5hLXNhZ2EtYXMtYnVzdC1vZi10aGUteWVhci1kZXNwaXRlLXNlbGwtb3V0LWFuZC1zb2FyaW5nLWViYXktcHJpY2VzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 25 Dec 2023 08:00:00 GMT",
        "title": "MKBHD's \"Bust of the Year\" Award Goes to Solana Mobile's Sold-Out Saga Phone - CryptoGlobe",
        "content": "Saga, a smartphone developed by Solana Mobile for the crypto community, has been named the “Bust of the Year” by Marques Brownlee (MKBHD), a prominent tech reviewer.\n\nSolana Mobile, a branch of Solana Labs, ventured into the smartphone industry with the launch of the Saga in April 2023.\n\nPriced initially at $1,000, the phone saw a price reduction in August to broaden its user base.\n\nNow is the perfect time to switch to Saga.\n\n\n\nOrder Saga here: https://t.co/4ZIEs6Z0D7 — Solana Mobile 🌱 (@solanamobile) August 9, 2023\n\nThe Saga, developed with OSOM’s expertise, aims to revolutionize Web3 interactions on mobile devices, focusing on secure cryptocurrency and NFT transactions.\n\nThe Saga boasts a 6.67-inch OLED screen, 12 GB RAM, and 512 GB storage, powered by the Snapdragon® 8+ Gen 1 Mobile Platform. Its standout feature is the Solana Mobile Stack (SMS), integrating crypto functionalities into the phone’s hardware and software. The “seed vault” securely stores private keys, and the phone offers a unique dapp store, free from the high fees typical of Apple and Google’s app stores.\n\nAnatoly Yakovenko, co-founder of Solana Labs, envisioned the Saga as a benchmark for mobile Web3 experiences. However, MKBHD’s review in September painted a different picture. He traced the Saga’s origins to the Essential Phone team, now part of OSOM. While praising its build quality, including a matte stainless steel frame and ceramic back, he noted its hefty weight and average specifications, such as a 1080p display and mediocre cameras. These factors, coupled with its initial high price, contributed to its later price reduction.\n\nMarques Brownlee, also known as MKBHD, is a well-known American YouTuber, best recognized for his technology-focused content. He produces in-depth reviews, discussions, and analyses of various consumer electronics, including smartphones, computers, and other gadgets. Brownlee is highly regarded in the tech community for his insightful and detailed approach to tech reviews, offering viewers a comprehensive understanding of the latest technological advancements and products. His channel has garnered widespread popularity for its quality content and Brownlee’s expertise in the tech field.\n\nBack in September, MKBHD reviewed the Saga, highlighting its crypto-centric features: the SMS, Seed Vault, and Dapp store. However, he critiqued the SMS for its exclusive focus on the Solana blockchain, limiting its appeal. The Seed Vault, while secure, and the Dapp store, though unique, did not fully justify the phone’s price, even after the reduction.\n\nDespite these criticisms, the Saga saw a sales surge in mid-December 2023, driven by the crypto community’s enthusiasm. Each Saga owner was entitled to an airdrop of 30 million Bonk (BONK) tokens, potentially equating to a $1,000 return on a $599 investment. This led to the phone selling out, as announced by Solana Mobile on social media platform X.\n\nThe Saga is SOLD OUT!\n\n\n\nWords cannot describe how much we appreciate your support. We are nothing without this amazing community 🫂\n\n\n\nWhile these past few days will be cemented in our history, we’re excited for the future 🫡\n\n\n\nStay tuned ✨ pic.twitter.com/KJje8lBDLL — Solana Mobile 🌱 (@solanamobile) December 16, 2023\n\nHowever, following the sell-out, Solana Mobile faced challenges. An inventory management issue with their third-party distributor led to an overestimation of available devices, resulting in unfulfillable orders and subsequent cancellations for suspicious activities. Affected customers were promised refunds, but this did little to alleviate the disappointment and confusion in the community.\n\nLast week, we saw an overwhelming demand for Saga, with sellouts in both the US & EU on our limited inventory of 20,000 devices produced globally.\n\n\n\nIn working to fulfill orders, we learned of an inventory management issue with our third-party distributor that resulted in an… — Solana Mobile 🌱 (@solanamobile) December 22, 2023\n\nMKBHD’s recent thread on X about the MKBHD Smartphone Awards 2023 further solidified the Saga’s controversial status. He labeled the Saga as the “Bust of the Year,” criticizing its underwhelming camera, display, and battery. He argued that its appeal is limited to Solana enthusiasts, overshadowing its high-quality build.\n\nIn contrast, other smartphones received more favorable recognition. The Samsung Galaxy S23 Ultra was named the “Best Big Phone,” while the Asus Zenfone 10 took the title of “Best Compact Phone.” The iPhone 15 Pro won for the best camera, and the Samsung Galaxy A54 was celebrated for its value. The iPhone 15 Plus received the Battery Award, the Honor Magic V2 was lauded for its design, and the OnePlus Open was recognized as the best foldable. The “Most Improved” award went to the Nothing Phone 2, and the “Phone of the Year” award went to the Google Pixel 8.\n\nFeatured Image via MKBHD’s YouTube Channel"
    }
]