[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMjMvc29sYW5hLXNvbC1yYWxsaWVzLXBhc3QtMTAwLWNvbnRpbnVpbmctdG9ycmlkLW1vbnRoL9IBZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMjMvc29sYW5hLXNvbC1yYWxsaWVzLXBhc3QtMTAwLWNvbnRpbnVpbmctdG9ycmlkLW1vbnRoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Solana’s SOL Rallies Past $100, Continuing Torrid Month - CoinDesk",
        "content": "Much of that energy is being driven by rampant speculation. Some of the most popular crypto assets being traded on Solana right now are dog-themed meme coins. But airdrops, too, are prompting droves of traders to test out Solana-based lenders, bridges and other infrastructure."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZGVjcnlwdC5jby8yMTA2Njgvc29sYW5hLXNtYXNoZXMtcGFzdC0xMDAtZmlyc3QtdGltZS1zaW5jZS1hcHJpbC0yMDIy0gFTaHR0cHM6Ly9kZWNyeXB0LmNvLzIxMDY2OC9zb2xhbmEtc21hc2hlcy1wYXN0LTEwMC1maXJzdC10aW1lLXNpbmNlLWFwcmlsLTIwMjI_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Solana Smashes Past $100 for First Time Since April 2022 - Decrypt",
        "content": "We do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSolana surged past $100 on Saturday afternoon for the first time in 20 months, since April 2022, continuing an upswing that has catapulted SOL to a 770% gain over this time last year.\n\nSOL is up 6% on the day, per data from CoinGecko, jumping to a current price of nearly $103 after hovering below the $100 mark the last couple days. The cryptocurrency flipped XRP on Wednesday to become the fifth-largest coin by market cap, and then flipped Binance Coin (BNB) late Thursday to land in the #4 slot.\n\nAs of this writing, Solana has a $44 billion market cap. This past week, weekly transaction volume for decentralized exchanges (DEXs) on the Solana blockchain eclipsed that of exchanges on rival Ethereum for the first time, propelled in part by a rise in popular meme coins like BONK and Dogwifhat (WIF) on Solana.\n\nOther Solana-based tokens have seen substantial gains in recent weeks, even if they're down in recent days. BONK, for example, surged to an all-time high of $0.00003416 on December 15. It's down nearly 45% since then, showcasing the famous volatility of meme coins, yet remains up 347% over the past month.\n\nAD\n\nAD\n\nWIF, meanwhile, is up 294% this week alone, even though it has plunged almost 28% from Friday's all-time high price. Crypto-powered wireless network Helium's HNT token has marked a 217% gain over the past 30 days, while the network's MOBILE token is up 1,316% this month following the Helium Mobile service's nationwide expansion.\n\nSolana is the biggest gainer over the past 24 hours in the top 10 cryptocurrencies by market cap, and its 37% rise over the past days makes it a standout within the top 100 as well. Other hot coins this week include Ethereum scaling network Optimism's OP token (up 49%) and Near Protocol's NEAR token (up 47%).\n\nBy comparison, the two largest cryptocurrencies by market cap—Bitcoin and Ethereum—have each posted a roughly 3% gain in the past seven days.\n\nEdited by Andrew Hayward\n\nAD\n\nAD"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbmdhcGUuY29tL2lzLXNvbGFuYXMtc29sLW1hcmtldC1wZXJmb3JtYW5jZS10aWVkLXRvLWZ0eC1hbGFtZWRhLWxpcXVpZGF0aW9ucy_SAVxodHRwczovL2NvaW5nYXBlLmNvbS9pcy1zb2xhbmFzLXNvbC1tYXJrZXQtcGVyZm9ybWFuY2UtdGllZC10by1mdHgtYWxhbWVkYS1saXF1aWRhdGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Is Solana’s (SOL) Market Performance Tied to FTX, Alameda Liquidations? - CoinGape",
        "content": "Solana (SOL) has recorded gains in the past week, but two substantial holders of SOL can potentially influence the market. On-chain analytics firm Spot On Chain reported on Friday that Solana has seen a significant rise in price in 24 hours. At press time, Solana’s surge in the 24-hour frame is close to 6% based on CoinGecko data.\n\nSpot On Chain pointed out that the surge propelled SOL ahead of Binance Coin (BNB) in terms of market capitalization.\n\nadvertisement\n\nAlso Read: Solana (SOL) Price Shoots to $100 Flipping Binance Coin for Fourth Spot\n\nFTX’s SOL sales this quarter\n\nThe firm’s analysis of key on-chain data also revealed that FTX and Alameda transferred approximately 13.22 million SOL, valued at around $666 million, to various exchanges from October 24 to December 14, 2023. The firm traced the transactions from two public SOL addresses and another FTX-related address to exchanges and likely Coinbase. This leaves an estimated 2.08 million SOL available for immediate trade, as per the report.\n\nIt is also reported that only 27% of FTX’s total SOL holdings, approximately 15.3 million SOL, have been unlocked. Therefore, they reportedly possess about 2 million SOL, worth approximately $192 million, at their disposal for liquidation. This is a significant amount to influence the price of SOL.\n\nImpact of potential sell-off\n\nSpot On Chain noted that 40.5 million SOL, or 73% of the holding valued at nearly $4 billion, is set to be gradually released on schedule.\n\nRoughly 609,000 SOL are unlocked each month, and significant amounts are set for release in early 2025. Based on this schedule, Spot on Chain finds that it is unlikely that FTX and Alameda’s potential future sell-offs of SOL will significantly impact the market in the near term.\n\nThe price of SOL has experienced around a 30% increase over the past week. However, the analytics firm underlined that the role of FTX and Alameda as major holders of SOL remains a focal point.\n\nAt the time of FTX’s bankruptcy, CoinGecko estimated FTX and Alameda’s SOL holdings at 55.8 million, worth $1.16 billion at the time. SOL topped the holding followed by Bitcoin (BTC) and Ethereum (ETH).\n\nAlso Read: Solana Price Prediction: Is $SOL Ready to Reclaim $100 Before New Year?"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEyLzIzL3BheG9zLWJlY29tZXMtbXVsdGktY2hhaW4tc3RhYmxlY29pbi1pc3N1ZXItZXhwYW5kcy10by1zb2xhbmEtc29sLWJsb2NrY2hhaW4v0gFyaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMTIvMjMvcGF4b3MtYmVjb21lcy1tdWx0aS1jaGFpbi1zdGFibGVjb2luLWlzc3Vlci1leHBhbmRzLXRvLXNvbGFuYS1zb2wtYmxvY2tjaGFpbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Paxos Becomes Multi-Chain Stablecoin Issuer, Expands to Solana (SOL) Blockchain - The Daily Hodl",
        "content": "Stablecoin issuer Paxos is expanding into the Solana (SOL) network, becoming the first multi-chain platform to be regulated across multiple jurisdictions.\n\nIn a new press release, the New York-based crypto firm says that after exclusively working with top smart contract platform Ethereum (ETH), it will now be releasing its dollar-pegged crypto asset, Pax Dollar (USDP), over the Solana blockchain.\n\n“Paxos, the leading regulated blockchain and tokenization infrastructure platform, is pleased to announce a strategic expansion of its stablecoin issuance to the Solana blockchain platform.\n\nPreviously exclusive to Ethereum, this initiative represents a significant milestone for the innovation and evolution of Paxos’s enterprise and consumer-facing businesses.”\n\nPax Dollar will be available over the Solana blockchain starting January 17th, 2024, according to The Solana Foundation.\n\n“Paxos’ expansion to the Solana blockchain broadens the growing payments ecosystem on Solana and their USDP stablecoin is planned to be available for public use starting Jan. 17th, 2024.”\n\nAs stated by Raj Gokal, co-founder of Solana, in the press release,\n\n“Paxos’s decision to bring stablecoin issuance to the Solana blockchain will showcase how Solana’s high-performance network and low transaction fees can support regulated financial products and provide leaders like Paxos new ways to scale and innovate.\n\nThe Solana network will enable Paxos to further its vision for a more open and financially empowering future.”\n\nSolana is trading for $96.62 at time of writing, a 4.05% increase during the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jcnlwdG9nbG9iZS5jb20vbGF0ZXN0LzIwMjMvMTIvZm9ybWVyLWdvbGRtYW4tc2FjaHMtZXhlYy1wcmVkaWN0cy1ldGhlcmV1bS1hbmQtc29sYW5hcy1kb21pbmFuY2UtaW4tMjAyNHMtY3J5cHRvLW1hcmtldC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Ethereum & Solana to Outshine Bitcoin in 2024, Predicts Raoul Pal - CryptoGlobe",
        "content": "Raoul Pal, a former Goldman Sachs executive and CEO of Real Vision, has made a bold prediction about the performance of Ethereum (ETH) and Solana (SOL) in 2024. Addressing his one million followers on a social media platform on December 21, Pal suggested that Ethereum might replicate its 2021 bull market pattern against Bitcoin (ETH/BTC) in the coming year.\n\nPal’s analysis is rooted in historical data. He recalled that in February 2021, when Bitcoin first reached $44,000, Ethereum was priced at $1,400. Nine months later, Ethereum had surged by 245%, while Bitcoin had only risen by 45%. Based on this, Pal believes that Ethereum outperforming Bitcoin could be a major trend in 2024. His firm, Exponential Age Asset Management (EXPAAM), supports this view.\n\nThe analyst also anticipates more favorable macroeconomic conditions for risk assets like Ethereum, which could lead to a similar surge as seen two years ago. He emphasized the importance of liquidity and the business cycle in driving these trends, suggesting that narratives often follow these underlying factors.\n\nIt's all about liquidity and the business cycle leading the risk curve. Narrative follows. — Raoul Pal (@RaoulGMI) December 21, 2023\n\nIn a surprising twist, Pal also believes that Solana will outperform Ethereum in 2024. Responding to a query on social media, he simply stated, “No,” when asked if Ethereum could outperform Solana.\n\nNo. — Raoul Pal (@RaoulGMI) December 21, 2023\n\nPal’s interest in Solana is partly influenced by the development of Firedancer, a new validator client for the Solana blockchain. Developed by Jump Crypto, a division of Jump Trading Group, Firedancer aims to enhance network performance within existing hardware constraints. This development is significant as Solana’s network currently relies on a single validator client developed by Solana Labs. Firedancer, expected to launch on the mainnet in Summer 2024, promises to optimize network performance and add security by reducing software-induced outages.\n\nMessari, a market intelligence firm, has highlighted scalability as a critical challenge in the crypto sector. Solana’s commitment to a monolithic architecture, as opposed to modular solutions adopted by other networks, is a key focus of Firedancer. Initial tests of Firedancer have shown promising results, achieving a transaction speed of one million transactions per second (TPS) with just four CPU cores, surpassing Solana’s recommended 12-core setup.\n\nIf successfully implemented, Firedancer could offer several benefits, including reducing latency in the DeFi sector and enabling high-throughput Web2 applications to function on-chain. It could also enhance Solana’s network resilience by introducing client diversity, mitigating risks related to software bugs.\n\n1/ Scalability is a key factor in the crypto space, with the modular approach gaining popularity. However, @Solana has taken a contrarian stance.@kelxyz_ explains how @jump_firedancer, a validator client developed by @jump_ aims to enhance Solana's monolithic approach.🧵 pic.twitter.com/zRc3Q5wSeT — Messari (@MessariCrypto) June 6, 2023\n\nPal’s optimism about Solana is further bolstered by performance charts against Ethereum and Bitcoin. He likened Solana’s upward trend in these charts to a rocket ship, indicating a promising future. His enthusiasm grew after interviews with the Jump Crypto team responsible for Firedancer, learning that the new validator client would not only boost Solana’s transaction speed but also fortify the security of the entire blockchain. The team behind Firedancer is focused on achieving high-frequency trading speeds, which Pal believes could be a game-changer for Solana.\n\nAlthough the exact launch date for Firedancer is unclear, Pal remains bullish on Solana’s prospects. He has previously suggested that Solana could emulate Ethereum’s bullish market cycle from 2021. He maintains this view, speculating that Solana could be the Ethereum of the current market cycle without diminishing the value of Ethereum or Bitcoin.\n\nPal concluded by stating that in the current economic landscape, the goal is to maximize gains whenever possible, and he sees Solana as a strong candidate for achieving this objective."
    }
]