[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LnBzeWNob2xvZ3l0b2RheS5jb20vdXMvcHN5Y2hpYXRyaXN0cy9yaXotYWhtYWQtc2FuLWRpZWdvLWNhLzExMTE1NTTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Riz Ahmad, Psychiatrist, San Diego, CA, 92101 - Psychology Today",
        "content": "We know asking for help is not an easy thing to do. We also know that finding a provider you trust to help you navigate mental health care can be a challenge. That's why we're here, and we're doing things differently. As a patient at Bonmente, you enjoy comprehensive treatments customized specifically for your unique circumstances, convenient telemedicine appointments that allow you to see your provider from the comfort of home, an online patient portal that lets you communicate directly with your provider, and a highly trained support team that makes becoming a patient as simple as it should be. Now welcoming new patients!\n\nView 7 Photos"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LnBzeWNob2xvZ3l0b2RheS5jb20vdXMvcHN5Y2hpYXRyaXN0cy9yaXotYWhtYWQtc2FuLWRpZWdvLWNhLzExMTE1NTTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Riz Ahmad, Psychiatrist, San Diego, CA, 92101 - Psychology Today",
        "content": "We know asking for help is not an easy thing to do. We also know that finding a provider you trust to help you navigate mental health care can be a challenge. That's why we're here, and we're doing things differently. As a patient at Bonmente, you enjoy comprehensive treatments customized specifically for your unique circumstances, convenient telemedicine appointments that allow you to see your provider from the comfort of home, an online patient portal that lets you communicate directly with your provider, and a highly trained support team that makes becoming a patient as simple as it should be. Now welcoming new patients!\n\nView 7 Photos"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvbS8yMDIzLzA0LzA5L29uLWN1bHR1cmUtc3VjY2Vzc2lvbi1pbi10aGUtaG9vZC1zcGlyaXRzLWluLXRoZS1haXItYW5kLW9uY2Utb24tdGhlLXN0YWdlL9IBeGh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvbS8yMDIzLzA0LzA5L29uLWN1bHR1cmUtc3VjY2Vzc2lvbi1pbi10aGUtaG9vZC1zcGlyaXRzLWluLXRoZS1haXItYW5kLW9uY2Utb24tdGhlLXN0YWdlLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "ON Culture | ‘Succession’ in the Hood, Spirits in the Air, and ‘Once’ on the Stage - Santa Barbara Independent",
        "content": "This edition of ON Culture was originally emailed to subscribers on January 27, 2023. To receive Leslie Dinaberg’s arts newsletter in your inbox on Fridays, sign up at independent.com/newsletters.\n\nON the (Small) Screen\n\nHey, Succession fans: If you thought that stunning estate in the premiere episode of season four looked familiar, you were right! The property owned by Nan Pierce, the fictional matriarch of Pierce Global Media, is actually the Peabody Estate, a k a Villa Solana in Montecito. As reported in both Robb Report and Architectural Digest, this palatial hilltop home was constructed in 1914 and designed by politician and architect Francis Townsend Underhill for local businessman Frederick Forrest Peabody. The 11-acre property is now owned by former Google CEO Eric Schmidt, who bought it for $30.8 million in 2020.\n\nCheck out this tour from Luxury Homes:\n\nUnstable, the new Netflix show from S.B. father and son Rob and John Owen Lowe has a very funny premise: Rob plays a renowned and eccentric scientific genius, recently widowed, who sings, dances, and “lets the beauty of the world move him in a profound way,” while John Owen is a sweet guy (also a scientist) who tries his best to ground his wacky pop. Rob Lowe is certainly staying busy. He recently announced that his one-man show, Stories I Only Tell My Friends, will return to the Venetian Resort in Vegas June 9-10.\n\nJohn Owen Lowe and Rob Lowe star in Unstable | Credit: Netflix\n\nON the Page\n\nGeorge Yatchisin contemplates spirits in the air. | Credit: Courtesy\n\nCocktails and poetry come together in a loving embrace at the ninth annual “Spirits in the Air: Potent Potable Poetry” reading on April 19. Hosted by Indy writer (among other things) George Yatchisin, this always-entertaining event will bring a boozy shot of verse to The Good Lion (1212 State St.) at 5:30 p.m. that evening.\n\nON the Walls\n\nWaterhouse Gallery in Montecito | Credit: Diane Waterhouse, via Facebook\n\nWaterhouse Gallery opened a new location in Montecito this week. Owned by Diane and Ralph Waterhouse, the La Arcada Plaza spot is now in its 39th year in Downtown Santa Barbara as the new gallery at 1187 Coast Village Road in Montecito joins the family biz!\n\nThis edition of ON Culture was originally emailed to subscribers on April 26, 2024. To receive Leslie Dinaberg’s arts newsletter in your inbox on Fridays, sign up at independent.com/newsletters.\n\nON the Podium\n\nDanny Trejo comes to UCSB’s Campbell Hall on April 12. | Credit: Courtesy\n\nActor, activist and all-around interesting guy Danny Trejo is coming to UCSB’s Campbell Hall on April 12. Ryan P. Cruz has an excellent interview with Trejo here. And here’s my story about all of the great lectures recently added by A&L.\n\nON the Stage\n\nSam Kulchin and Micah Basilici star in Once. | Credit: Courtesy\n\nThere’s lots of great theater coming our way right now. I’m particularly looking forward to Out of the Box Theatre Company’s production of Once at Center Stage Theater (see my interview with director Samantha Eve), Ensemble Theater Company’s The Children, and the Theater Group at SBCC’s George and Emily Get Married. Last week, I had the pleasure of seeing the Rubicon Theatre Company’s premiere of the developmental musical Dark of the Moon, which was so much fun. Stay tuned for my story about what it’s like to create and develop a brand-new musical work of art.\n\nON the Catwalk\n\nKathy Ireland models her new swimwear line of suits and coverups. | Credit: Jon Carrasco\n\nEntrepreneur Kathy Ireland is turning her former Sports Illustrated bathing-suit-issue cover-girl cred into a new line of swimwear and coverups for HSN.\n\nON the Calendar\n\nThe 2022 Spirit of Fiesta, Tata Mata | Credit: Fritz Olenberger\n\nIt’s the final dance for 2022 Spirit of Fiesta Tata Mata and Junior Spirit Layla Gocong, when auditions for Spirit and Junior Spirit of Fiesta take place on April 15 at the Lobero (here’s the event). A group of 22 finalists will compete for the coveted spots.\n\n\n\nFor a complete calendar of events this week and beyond, visit independent.com/events."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvbS8yMDIzLzA0LzA5L29uLWN1bHR1cmUtc3VjY2Vzc2lvbi1pbi10aGUtaG9vZC1zcGlyaXRzLWluLXRoZS1haXItYW5kLW9uY2Utb24tdGhlLXN0YWdlL9IBeGh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvbS8yMDIzLzA0LzA5L29uLWN1bHR1cmUtc3VjY2Vzc2lvbi1pbi10aGUtaG9vZC1zcGlyaXRzLWluLXRoZS1haXItYW5kLW9uY2Utb24tdGhlLXN0YWdlLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "ON Culture | ‘Succession’ in the Hood, Spirits in the Air, and ‘Once’ on the Stage - Santa Barbara Independent",
        "content": "This edition of ON Culture was originally emailed to subscribers on January 27, 2023. To receive Leslie Dinaberg’s arts newsletter in your inbox on Fridays, sign up at independent.com/newsletters.\n\nON the (Small) Screen\n\nHey, Succession fans: If you thought that stunning estate in the premiere episode of season four looked familiar, you were right! The property owned by Nan Pierce, the fictional matriarch of Pierce Global Media, is actually the Peabody Estate, a k a Villa Solana in Montecito. As reported in both Robb Report and Architectural Digest, this palatial hilltop home was constructed in 1914 and designed by politician and architect Francis Townsend Underhill for local businessman Frederick Forrest Peabody. The 11-acre property is now owned by former Google CEO Eric Schmidt, who bought it for $30.8 million in 2020.\n\nCheck out this tour from Luxury Homes:\n\nUnstable, the new Netflix show from S.B. father and son Rob and John Owen Lowe has a very funny premise: Rob plays a renowned and eccentric scientific genius, recently widowed, who sings, dances, and “lets the beauty of the world move him in a profound way,” while John Owen is a sweet guy (also a scientist) who tries his best to ground his wacky pop. Rob Lowe is certainly staying busy. He recently announced that his one-man show, Stories I Only Tell My Friends, will return to the Venetian Resort in Vegas June 9-10.\n\nJohn Owen Lowe and Rob Lowe star in Unstable | Credit: Netflix\n\nON the Page\n\nGeorge Yatchisin contemplates spirits in the air. | Credit: Courtesy\n\nCocktails and poetry come together in a loving embrace at the ninth annual “Spirits in the Air: Potent Potable Poetry” reading on April 19. Hosted by Indy writer (among other things) George Yatchisin, this always-entertaining event will bring a boozy shot of verse to The Good Lion (1212 State St.) at 5:30 p.m. that evening.\n\nON the Walls\n\nWaterhouse Gallery in Montecito | Credit: Diane Waterhouse, via Facebook\n\nWaterhouse Gallery opened a new location in Montecito this week. Owned by Diane and Ralph Waterhouse, the La Arcada Plaza spot is now in its 39th year in Downtown Santa Barbara as the new gallery at 1187 Coast Village Road in Montecito joins the family biz!\n\nThis edition of ON Culture was originally emailed to subscribers on April 26, 2024. To receive Leslie Dinaberg’s arts newsletter in your inbox on Fridays, sign up at independent.com/newsletters.\n\nON the Podium\n\nDanny Trejo comes to UCSB’s Campbell Hall on April 12. | Credit: Courtesy\n\nActor, activist and all-around interesting guy Danny Trejo is coming to UCSB’s Campbell Hall on April 12. Ryan P. Cruz has an excellent interview with Trejo here. And here’s my story about all of the great lectures recently added by A&L.\n\nON the Stage\n\nSam Kulchin and Micah Basilici star in Once. | Credit: Courtesy\n\nThere’s lots of great theater coming our way right now. I’m particularly looking forward to Out of the Box Theatre Company’s production of Once at Center Stage Theater (see my interview with director Samantha Eve), Ensemble Theater Company’s The Children, and the Theater Group at SBCC’s George and Emily Get Married. Last week, I had the pleasure of seeing the Rubicon Theatre Company’s premiere of the developmental musical Dark of the Moon, which was so much fun. Stay tuned for my story about what it’s like to create and develop a brand-new musical work of art.\n\nON the Catwalk\n\nKathy Ireland models her new swimwear line of suits and coverups. | Credit: Jon Carrasco\n\nEntrepreneur Kathy Ireland is turning her former Sports Illustrated bathing-suit-issue cover-girl cred into a new line of swimwear and coverups for HSN.\n\nON the Calendar\n\nThe 2022 Spirit of Fiesta, Tata Mata | Credit: Fritz Olenberger\n\nIt’s the final dance for 2022 Spirit of Fiesta Tata Mata and Junior Spirit Layla Gocong, when auditions for Spirit and Junior Spirit of Fiesta take place on April 15 at the Lobero (here’s the event). A group of 22 finalists will compete for the coveted spots.\n\n\n\nFor a complete calendar of events this week and beyond, visit independent.com/events."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5sYWpvbGxhbGlnaHQuY29tL3BlcnNvbmFsaXRpZXMvc3RvcnkvMjAyMy0wNC0wOS90ZXRoZXItbmV3LXNob3ctZmVhdHVyZXMtbGEtam9sbGEtYXJ0aXN0cy1leHBsb3JhdGlvbi1vZi1iZWluZy1ib3VuZC1ieS1ib2R5LWFuZC1idXJkZW5z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "'Tether:' New show features La Jolla artist's exploration of being bound by body and burdens - La Jolla Light",
        "content": "La Jollan Christiana Updegraff’s artworks are on exhibit in Solana Beach through Friday, May 5.\n\nFinding freedom in highlighting the nature of gender expectations, La Jolla artist Christiana Updegraff is showcasing a collection of three-dimensional works at an exhibit in Solana Beach.\n\nThe show, called “Tether,” also features works by Rancho Peñasquitos artist Alexandra Carter. It opened April 8 at Oolong Gallery and continues through Friday, May 5.\n\nNewsletter Get the La Jolla Light weekly in your inbox News, features and sports about La Jolla, every Thursday for free Enter email address Sign Me Up You may occasionally receive promotional content from the La Jolla Light.\n\nThe exhibit focuses on the ways in which the artists — both of them mothers — feel bound to their children, partners and others’ expectations.\n\nTo flesh out the theme, Updegraff employs many materials in her projects, using industrial supplies such as cement or wood and “a lot of domestic objects that are deconstructed [and] items that have a certain gender affiliation or expectation,” she said.\n\nChristiana Updegraff’s “Dangle, Tangle, Drop” is one of the works in the exhibit “Tether.” (Christiana Updegraff)\n\nUpdegraff’s works include string, textiles and fabrics designed to bring focus to the body and elicit “a visceral response in the viewer,” she said.\n\nHer creations in the exhibit explore the isolation and unmooring Updegraff felt after she and her husband, video editor and La Jolla native Tucker Bass, moved to La Jolla from Los Angeles in August 2020 with their newborn and 2-year-old.\n\nThe family moved to be closer to Bass’ parents, and while that has been a boon, the restrictions early in the COVID-19 pandemic meant isolation for Updegraff.\n\nBut she was able to create in her art studio in the garage in close proximity to her children, all the while probing the concepts of loss and caretaking.\n\n“The minutiae of caretaking is ever-present in my work,” Updegraff said, “particularly during this time of staying at home and having to provide for these two little people and their needs all day and then not being able to leave and come back. … It’s literally like dishes and cleaning and giving of myself to these other two people.”\n\n“There’s such a loss of community for parents in general,” she said, but the pandemic quarantines compounded her feelings. “The loss of myself ... was really difficult for me because there was no other community. There was nothing to turn to.”\n\nUpdegraff, who earned a master’s degree in fine arts from San Diego State University in 2011 and creates art while teaching full time at Long Beach City College and SDSU, also explores “gender constructs and how society places expectations on men or women … and how those differences shape our experience in the world.”\n\nChristiana Updegraff’s “1005” is another of her creations on view at Oolong Gallery in Solana Beach through May 5. (Christiana Updegraff)\n\nAs a mother, Updegraff said she sometimes feels pulled to conform to expectations of gender that compel her to be a caretaker while also pursuing her career.\n\nUpdegraff was raised in Kentucky and says she was confronted by Southern society’s differing expectations for her and her brother.\n\n“I felt that very acutely growing up, so I’ve really tried my hardest to dispel those notions of gender constructs and fight against those,” she said.\n\nUpdegraff also references fertility in her works, as well as “how people present themselves to the exterior world,” she said.\n\nThe idea that one must maintain “an air of perfection … is particularly pervasive in today’s culture when dealing with women,” Updegraff said. “You can [try to] check all the boxes that you’re supposed to check. I think we all bravely try to fulfill [that], but it’s unattainable.”\n\nThat notion is exemplified in many of the works in “Tether,” she said.\n\n“It’s amplifying that not everything has to be OK,” she said. “Some of us are coming unglued and pushing against the idea of being perfect.”\n\nOolong Gallery is at 349 N. Hwy. 101, Solana Beach. For more information, visit oolongallery.com. ◆"
    }
]