[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2V0Zi9ncmF5c2NhbGUtcy1nc29sLXRoZS1mdXR1cmUtb2Ytc29sYW5hLWludmVzdG1lbnQtb3ItYS1idWJibGUtd2FpdGluZy10by1idXJzdC0xMDMyMjM3NTcx0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Grayscale's GSOL: The Future Of Solana Investment Or A Bubble Waiting To Burst? - Markets Insider",
        "content": "Grayscale has announced the public trading of its Solana Trust under the ticker symbol GSOL (OTC:GSOL), making it the latest addition to the 15 other cryptocurrency investment products the company offers on OTC Markets.\n\nWith 304,427 outstanding shares as of Friday, investors with access to U.S. securities can \"buy and sell freely-tradable GSOL shares through their investment accounts,\" said Grayscale.\n\nThe objective of GSOL is to be linked to Solana (CRYPTO: SOL) to allow investors to gain exposure to the digital asset without owning them directly.\n\nThis strategy is similar to Grayscale's Bitcoin (CRYPTO: BTC) and Ether (CRYPTO: ETH) trusts, (OTC:GBTC) and (OTC:ETHE) respectively, where accredited investors with Bitcoin and Ether give crypto to Grayscale in exchange for shares in the trusts, while retail investors can acquire stock through public markets.\n\nGSOL had been open to private placement since November 2021, and its website disclosures reveal that the Solana trust has $2.9 million in SOL.\n\nAlso Read: Crypto Lender Amber Group Shifts Focus Towards Institutional Business, May Shut Down Retail Operations\n\nMeanwhile, GBTC manages $19 billion BTC, and ETHE manages $6.3 billion ETH.\n\nHowever, GBTC and ETHE are trading far below the digital assets themselves, upsetting some investors.\n\nGBTC is trading at a 37% discount to Bitcoin held in Grayscale's trust, after its long-running premium flipped negative in February 2021.\n\nETHE is trading at a markdown of minus 46%.\n\nThe launch of GSOL comes as Grayscale is still in a legal battle with the SEC over the rejection of its Bitcoin spot ETFs. A Grayscale victory over the SEC does not guarantee the approval of such investment products, according to Blockworks.\n\nRead Next: The Real Reason Why Shaquille O'Neal Is In Hot Water Along With FTX Co-Founder"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2dyYXlzY2FsZS1zb2xhbmEtdHJ1c3QtcHVibGlj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Retail Investors Can Now Trade Grayscale Solana Trust - Blockworks",
        "content": "Grayscale’s Solana Trust has begun trading publicly under ticker symbol GSOL, joining the 15 other crypto investment products the asset management giant has to offer on OTC Markets.\n\nAll investors with access to US securities can “buy and sell freely-tradable GSOL Shares through their investment accounts,” Grayscale said. GSOL had 304,427 outstanding shares as of Friday, according to the press release.\n\nGrayscale’s objective is to have GSOL pegged to solana (SOL), so investors can gain exposure to the digital asset without owning it directly. SOL is up around 150% year to date but still 75% below its $100 price point one year ago.\n\nThis echoes the strategy Grayscale has used with its bitcoin and ether trusts — GBTC and ETHE, respectively. Accredited investors with bitcoin (BTC) and ether (ETH) give crypto to Grayscale in return for shares in the trusts, while retail investors can acquire the stock through public markets.\n\nGSOL had been open to private placement since Nov. 2021. Per its website disclosures:\n\nThe Solana trust has $2.9 million in SOL.\n\nGBTC manages $19 billion BTC.\n\nETHE boasts $6.3 billion ETH.\n\nYet GBTC and ETHE, Grayscale’s two largest funds by far, are both trading far below the digital assets themselves, angering some investors.\n\nYou can pick up GBTC for a nearly 37% discount relative to the bitcoin held inside Grayscale’s trust, after its long-running premium flipped negative in Feb. 2021. ETHE is trading at an even harsher markdown at minus 46%.\n\nThe launch of the Solana trust so alcomes as Grayscale continues to battle the SEC in court over its rejection of bitcoin spot ETFs. Blockworks previously reported that a Grayscale victory over the SEC doesn’t guarantee the approval of such investment products.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9saWZlc3R5bGUvc3RvcnkvMjAyMy0wNC0xNy9zdW5ueXNpZGUtc29sYW5hLW9wZW5zLWluLXNvbGFuYS1iZWFjaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Sunnyside Solana opens in Solana Beach - Del Mar Times",
        "content": "Offering everything from coffee and classic breakfast dishes to several Italian entrees, Sunnyside Solana recently opened on Highway 101 in Solana Beach.\n\nThe restaurant is open every day, serving breakfast and brunch, as well as lunch, from 7 a.m. to 3 p.m. Owner Edoardo Ciulli and his business partner, both Italian, already have plans to go even bigger.\n\n“Over the next couple months we will be offering dinner also,” he said. “And it will be an Italian dinner-slash-California fusion. That’s the exciting part.”\n\nFor nine years, Ciulli and his team owned the Solana Beach eatery Crush, which served Italian dishes and brick-oven pizza, located at the current site of California Pizza Kitchen. He added that they want Sunnyside Solana to help liven the area for locals and visitors who peruse the parks, beach and shops along Solana Beach’s stretch of the 101.\n\n“There are not a lot of options,” said Ciulli, who lives in Del Mar. “We are excited to eventually be able to serve dinner there.”\n\nSunnyside Solana is located at the former Swami’s Cafe, and Ciulli said they have plans to take over other Swami’s locations.\n\n“We stepped in, we’ve done a nice renovation,” Ciulli said. “We are doing pretty good considering the economy and so on.”\n\nCiulli, who owns other restaurants throughout San Diego, said patrons have been “very excited” so far about Sunnyside Solana as the bustling commercial area of Solana Beach comes back to life after years of Covid-19 restrictions.\n\n“We have a great menu,” he added. “Feedback has been outstanding. We already have almost five stars on all the apps and websites, so we are happy about that.”\n\nMany Yelp reviewers have expressed their excitement about a new spot for breakfast and brunch.\n\nThe menu has “Sunnyside Favorites,” which include a chorizo burrito, short rib mac and cheese, and lox and bagel platter; salads, including a Caesar, salmon and mandarin chicken; burgers, clubs and other sandwiches; and an entrees section that has rigatoni martini, chicken marsala and a couple other Italian dishes.\n\nCiulli and his team also opened Il Giardino di Lilli, or Lilli’s Garden, on Girard Avenue in La Jolla at the former site of Pannikin, a popular cafe that had its lease terminated last year.\n\nSunnyside Solana is located at 159 S. Highway 101 in Solana Beach. For reservations, gift certificates and more information, visit sunnysidesolana.com or sunnysidesolana on Instagram."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vY3J5cHRvY3VycmVuY2llcy10by13YXRjaC13ZWVrLW9mLWFwcmlsLTE3LTc0ODEzNzHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Cryptocurrencies To Watch: Week of April 17 - Investopedia",
        "content": "Keep an Eye on These Coins\n\nNothing is certain in the cryptocurrency market, but the prices of most major assets have been maintaining their positions above important support levels in recent weeks. Next, traders will watch whether these tokens can break above their resistance levels, which seems possible for some.\n\nThis week, we examine WOO Network (WOO), Render Token (RNDR), Arbitrum (ARB), Rocket Pool (RPL), and Solana (SOL). In selecting these assets, we have considered several factors, including positive technical developments, significant news events, and noticeable changes in price.\n\n\n\nKey Takeaways WOO Network (WOO)'s price increased by 53%, possibly because of the shift toward decentralized exchanges (DEXs), like the one it offers, after the collapse of FTX in late 2022.\n\nRender Token (RNDR) jumped by 47%, perhaps because of the project's migration to the Solana network.\n\nproject's migration to the Solana network. Ethereum scaling solution Arbitrum (ARB) posted a 38% increase in price, amid accumulation by big holders, or \"whales,\" and a gain in market share taken from scaling solution Optimism.\n\nRocket Pool (RPL) went up by about 32%, likely because of Ethereum’s successful Shapella upgrade.\n\nSolana (SOL) gained more than 25% after the announcement of the launch date of the Solana Android mobile phone.\n\n\n\nWOO Network (WOO)\n\nWOO Network (WOO) was this week’s biggest gainer, rallying by 53%. This was likely due to two major trends: traders generally moving toward DEXs like the one offered by WOO Network following the collapse of FTX, which was a centralized exchange, and an increase in the use of WOO Network's protocol. Its team last week reported a substantial increase in the number of active users.\n\nWOO Network is a crypto trading platform that offers both centralized and decentralized trading options. It also provides deep liquidity and tools and analytics dashboards for traders. WOO is trading at around 31 cents and was priced at about 21 cents last week (see chart below).\n\n\n\nWOO Price: TradingView\n\nRender Token (RNDR)\n\nRender Token (RNDR) was the next biggest gainer for the week, increasing by 47%, most likely because of a migration to the Solana network. Render Token experienced significant developments during 2022, and the Solana migration adds to an ongoing increase at the start of the second quarter of 2023.\n\nRender Token provides a decentralized GPU rendering system that allows broader access to complex rendering processes. The project has utility in such industries as media, gaming, virtual reality, and medicine. RNDR is currently priced at around $1.92 and was $1.30 last week (see chart below).\n\n\n\nRNDR Price: TradingView\n\nArbitrum (ARB)\n\nEthereum scaling solution Arbitrum (ARB) also recorded a substantial increase in price, going up by 38%, possibly because of accumulation by Arbitrum whales and increased market share. Whales—an industry term for large holders of tokens—bought large amounts of ARB over the latest week. Arbitrum also experienced better performance across the board than Optimism, another scaling solution, and gained some of Optimism's market share, according to crypto research firm Messari.\n\nArbitrum is a Layer-2 scaling solution for Ethereum that provides better performance for users. Layer-2 networks sit on top of the first network, leading to cheaper and faster transactions. Arbitrum is changing hands at around $1.63 and was trading at $1.18 last week (see chart below).\n\n\n\nARB Price: TradingView\n\nRocket Pool (RPL)\n\nEthereum staking solution Rocket Pool (RPL)'s token price advanced by more than 32%, possibly because of the success of Ethereum's Shapella upgrade. This upgrade to the Ethereum network The Shapella upgrade combines changes to its execution layer (via the Shanghai upgrade), consensus layer (Capella), and the Engine API. The changes allow users to unstake their ETH from the network.\n\nRocket Pool is a staking solution for Ethereum and has grown in popularity over the past year. It provides easier access to Ethereum staking, as it circumvents the need to hold 32 ETH to participate in the staking process. RPL is priced at around $58.50, rising from about $45.40 last week (see chart below).\n\n\n\nRPL Price: TradingView\n\nSolana (SOL)\n\nSolana (SOL) rose by more than 25% after its team disclosed the launch date for the Solana Android mobile phone. The phones have been highly anticipated since being announced in the middle of 2022.\n\nThe phones will sell for about $1,000, and new-order registrations will begin on May 8. Pre-orders will begin shipping on April 20. SOL is trading at around $25.20; it was priced at around $20.30 last week (see chart below).\n\n\n\nSOL Price: TradingView\n\nAs of the date this article was written, the author does not own any of the assets discussed here.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3Lmdsb2JlbmV3c3dpcmUuY29tL2VuL25ld3MtcmVsZWFzZS8yMDIzLzA0LzE3LzI2NDc5MzMvMC9lbi9HcmF5c2NhbGUtU29sYW5hLVRydXN0LU5vdy1UcmFkaW5nLW9uLU9UQy1NYXJrZXRzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Grayscale® Solana Trust Now Trading on OTC Markets - GlobeNewswire",
        "content": "STAMFORD, Conn., April 17, 2023 (GLOBE NEWSWIRE) -- Grayscale Investments® , the world’s largest digital currency asset manager, today announced that Grayscale® Solana Trust (the “Trust”) has begun trading on OTC Markets under the symbol: GSOL. Grayscale now offers 16 digital currency investment products quoted on OTC Markets.\n\n\n\nSolana (SOL) is the native token of the Solana Network, a smart contract platform first conceived in a 2017 whitepaper. The Solana Network was designed to allow users to write and implement smart contracts which are executed on the Solana blockchain in exchange for payment of SOL. Like the Ethereum network, the Solana Network is one of a number of projects intended to expand blockchain use beyond just a peer-to-peer money system. The Solana protocol introduced the Proof-of-History timestamping mechanism, which is intended to provide a transaction processing speed and capacity advantage over other blockchain networks. The Trust is an investment vehicle that aims to allow investors to gain exposure to the price movement of Solana, so investors can avoid the challenges of buying, storing, and safekeeping the asset directly.\n\nSECONDARY MARKET FOR THE PRIVATE PLACEMENT\n\nThe Trust has offered a private placement to accredited investors since November 2021. As of April 14, 2023, there were 304,427 Shares outstanding of GSOL. Shares created through the Trust’s private placement become eligible to sell into the public market after a statutory one-year holding period pursuant to Rule 144 of the Securities Act of 1933.*\n\nAll investors with access to U.S. securities will be able to buy and sell freely-tradable GSOL Shares through their investment accounts, in the same manner as other securities.\n\nINVESTMENT OBJECTIVE\n\nThe investment objective of the Trust is for the value of the Shares (based on Solana per Share) to reflect the value of Solana held by the Trust, determined by reference to the CoinDesk Solana Price Index (SLX) at 4:00 p.m. New York time, less the Trust’s expenses and other liabilities.\n\nThe Trust is designed to track the CoinDesk SLX Index. The Trust will not generate any income, and regularly distributes SOL to pay for its ongoing expenses. Therefore, the amount of SOL represented by each respective Share gradually decreases over time. GSOL is not registered with the Securities and Exchange Commission and is not subject to disclosure and certain other requirements mandated by the Securities Exchange Act of 1934, but is subject to the OTC Markets’ Alternative Reporting Standards.\n\nGRAYSCALE PRODUCT FAMILY\n\nGrayscale's investment products are available to institutional and individual accredited investors through their respective periodic and ongoing private placements. In addition to GSOL, Grayscale is also the Sponsor of single-asset investment products which provide exposure to Basic Attention Token (BAT), Bitcoin (BTC), Bitcoin Cash (BCH), Chainlink (LINK), Decentraland (MANA), Ethereum (ETH), Ethereum Classic (ETC), Filecoin (FIL), Horizen (ZEN), Litecoin (LTC), Livepeer (LPT), Stellar Lumens (XLM), and Zcash (ZEC).\n\nGrayscale’s diversified products include Grayscale DeFi Fund, which provides exposure to a diversified basket of DeFi digital assets designed to track the CoinDesk DeFi Select Index (DFX); Grayscale Digital Large Cap Fund, which provides exposure to the largest and most liquid digital assets through a market cap-weighted portfolio designed to track the CoinDesk Large Cap Select Index (DLCS); and Grayscale Smart Contract Platform Ex-Ethereum Fund, which provides exposure to a selection of industry-leading Smart Contract Platforms through a market cap-weighted portfolio designed to track the CoinDesk Smart Contract Platform Select Ex ETH Index (SCPXX).\n\nThis newly-trading product means that Grayscale now offers investors a total of 16 products with public quotations. Grayscale® Basic Attention Token Trust ( OTCQB: GBAT ), Grayscale® Bitcoin Trust ( OTCQX: GBTC ), Grayscale® Bitcoin Cash Trust ( OTCQX: BCHG ), Grayscale® Chainlink Trust ( OTCQB: GLNK ), Grayscale® Decentraland Trust ( OTCQX: MANA ), Grayscale® Ethereum Trust ( OTCQX: ETHE ), Grayscale® Ethereum Classic Trust ( OTCQX: ETCG ), Grayscale® Filecoin Trust ( OTCQB: FILG ), Grayscale® Horizen Trust ( OTCQX: HZEN ), Grayscale® Litecoin Trust ( OTCQX: LTCN ), Grayscale® Livepeer Trust ( OTCQB: GLIV ), Grayscale® Stellar Lumens Trust ( OTCQX: GXLM ), Grayscale® Zcash Trust ( OTCQX: ZCSH ), Grayscale® Digital Large Cap Fund ( OTCQX: GDLC ) and Grayscale® DeFi Fund ( OTCQB: DEFG ) are also publicly-quoted and available to all investors with access to U.S. securities. Investors will be able to find current financial disclosure and Real-Time Level 2 quotes for Shares on www.otcmarkets.com/stock/ gsol/ disclosure once trading for GSOL commences.\n\n*The Trust offers a private placement to accredited investors. Because the Trust does not currently operate a redemption program, there can be no assurance that the value of the Shares will approximate the value of Solana held by the Trust, less the Trust’s expenses and other liabilities, and the Shares may trade at a substantial premium over, or a substantial discount to, such value and the Trust may be unable to meet its investment objective.\n\nThis press release is not an offer to sell or the solicitation of an offer to buy any security in any jurisdiction where such an offer or solicitation would be illegal, nor shall there be any sale of any security in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of that jurisdiction.\n\nAbout Grayscale Investments®\n\nGrayscale enables investors to access the digital economy through a family of secure, regulated, and future-forward investment products. Founded in 2013, Grayscale has a proven track record and deep expertise as the world’s largest digital currency asset manager. Investors, advisors, and allocators turn to Grayscale for single asset, diversified, and thematic exposure. Grayscale products are distributed by Grayscale Securities, LLC (Member FINRA/SIPC). For more information, please follow @Grayscale or visit grayscale.com ."
    }
]