[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMirwFodHRwczovL2NvbW11bml0eWltcGFjdC5jb20vZGFsbGFzLWZvcnQtd29ydGgvZ3JhcGV2aW5lLWNvbGxleXZpbGxlLXNvdXRobGFrZS9kZXZlbG9wbWVudC8yMDIzLzA5LzI2L21hcnJpb3R0LWhvdGVsLWluLXdlc3RsYWtlLWV4cGVjdGVkLXRvLXVuZGVyZ28tcmVub3ZhdGlvbnMtYWZ0ZXItcHVyY2hhc2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Marriott hotel in Westlake expected to undergo renovations after purchase - Community Impact",
        "content": "What to know about Texas’ power grid ..."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDkvMjYvc29sYW5hLWZyaWVuZC10ZWNoLWNsb25lLW5lYXJzLTFtLXZvbHVtZS13aXRoaW4tYS13ZWVrLW9mLWxhdW5jaC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Solana Friend.Tech Clone Nears $1M Volume Within A Week Of Launch - Crypto Times",
        "content": "Friendzy, a Friend.tech like application on Solana, has reached nearly $1 million in volume within just a week of its public launch on September 19.\n\nThe activity on the Friend.tech clone has swelled, with it claiming to have generated over $920,000 in cumulative volume since its launch last week.\n\nFriendzy’s website displays that a number of keys are being bought and sold by users within a minute. The decentralized social platform offers 4% royalty on each transaction, which goes to creators.\n\nFriendzy – Platform Activity\n\nFriendzy users can link their Twitter account to create their key on the platform, which is later bought by other users in order to interact. These keys could be sent to any other wallet.\n\nThe recently boomed decentralized social application Friend.tech has opened up a new primitive in DeFi with several similar applications launched on different chains. Alpha, the Friend.tech on Bitcoin, which has also gained significant traction in a short span of time since its launch.\n\nSolana’s DeFi ecosystem has diminished significantlycantly following the collapse of FTX exchange which had major investment and backing for the “so called ETH-killer” layer 1 network. Solana TVL topped to over $12 billion in November, 2021 which is currently at $995 million, according to data from DeFiLlama."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8yNi9iaXRjb2luLWJ0Yy1ldGhlcmV1bS1ldGgtYW5kLXNvbGFuYS1zb2wtY291bGQtYmUtb24tdGhlLWVkZ2Utb2YtZHJhbWF0aWMtY2FwaXR1bGF0aW9ucy13YXJucy10cmFkZXIv0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzI2L2JpdGNvaW4tYnRjLWV0aGVyZXVtLWV0aC1hbmQtc29sYW5hLXNvbC1jb3VsZC1iZS1vbi10aGUtZWRnZS1vZi1kcmFtYXRpYy1jYXBpdHVsYXRpb25zLXdhcm5zLXRyYWRlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC), Ethereum (ETH) and Solana (SOL) Could Be on the Edge of Dramatic Capitulations, Warns Trader - The Daily Hodl",
        "content": "A closely followed crypto strategist is warning that Bitcoin (BTC) and two other altcoins could collapse in price amid ongoing bearish market structures.\n\nPseudonymous analyst Kaleo tells his 596,500 followers on the social media platform X that he’s expecting Bitcoin to potentially decline by more than 20% from its current value.\n\n“Still wouldn’t be surprised to see something like this play out.”\n\nLooking at his chart, the trader believes that Bitcoin could decline to the $20,800 level before taking off on a surprise rally next month to around $36,000.\n\nBitcoin is trading for $26,160 at time of writing, down 0.7% in the last 24 hours.\n\nNext, the trader says the smart contract platform Ethereum (ETH) is on the verge of a dip after repeatedly testing a vulnerable support level.\n\n“ETH for example is hanging on the ledge of a cliff. I think a break lower before running it back turbo and seeing $2,000+ again is still likely.”\n\nEthereum is trading for $1,585 at time of writing, down 0.5% in the last 24 hours.\n\nLastly, the trader says ETH rival Solana (SOL) could collapse by more than 27% from its current value if it fails to hold a key support level at $18.\n\n“From a USD perspective, would expect the real capitulation to start beneath $18.”\n\nLooking at his chart, the trader thinks that SOL is flashing a failed breakout setup that could send the Ethereum rival below $14.\n\nSolana is trading for $19.24 at time of writing, down 2% in the past day.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Sol Invictus/IvaFoto"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3Lm5ld3NieXRlc2FwcC5jb20vbmV3cy9idXNpbmVzcy9jcnlwdG9jdXJyZW5jeS1wcmljZXMtMjYtMDktMjAyMy1yYXRlcy1vZi1iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLXRldGhlci1ibmIvc3RvcnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Today's cryptocurrency prices: Check rates of Bitcoin, Ethereum, Solana, XRP - NewsBytes",
        "content": "Next Article\n\nSolana is down 2.19% since last week\n\nToday's cryptocurrency prices: Check rates of Bitcoin, Ethereum, Solana, XRP\n\nBy Sanjana Shankar 10:53 am Sep 26, 202310:53 am\n\nWhat's the story Bitcoin has risen 0.78% over the last 24 hours to trade at $26,340.18. It is down 1.90% from last week. The second most popular token, Ethereum, has risen 0.85% from yesterday to trade at $1,591.14. It has fallen 2.80% from last week. Bitcoin and Ethereum have market capitalizations of $513.44 billion and $191.28 billion, respectively.\n\nAltcoins\n\nHow are the prices of other popular cryptocurrencies today?\n\nBNB is trading at $211.21, up 1.08% from yesterday and 2.53% from last week. The current price of XRP is $0.55, up 0.55% in the last 24 hours. It is 0.68% lower compared to last week. Cardano and Dogecoin are trading at $0.22 (up 0.49%) and $0.066 (up 0.19%), respectively.\n\nOther tokens\n\nSolana's price has decreased by 2.19% since last week\n\nSolana, Polka Dot, Shiba Inu, and Polygon are currently trading at $19.45 (down 0.11%), $4.05 (up 1.25%), $0.0000077 (down 0.88%), and $0.55 (up 1.36%), respectively. Based on the weekly chart, Solana is down 2.19% while Polka Dot has fallen 1.35%. Shiba Inu has gained 0.11% of its value in the last seven days whereas Polygon has declined 1.39%.\n\nData\n\nHere are the top gainers of the day\n\nFrax Share, Maker, Chainlink, GMX, and 1inch Network are the top five gainers on a 24-hour basis. They are trading at $5.75 (up 4.58%), $1,339.87 (up 4.53%), $7.49 (up 4.07%), $34.97 (up 3.86%), and $0.22 (up 3.55%), respectively.\n\nStable tokens\n\nWhere do the popular stablecoins stand today?\n\nA stablecoin is a cryptocurrency that has very little volatility. Its value is linked to a real-world asset such as fiat currency or gold. Some of the popular tokens, Tether, USD Coin, and Binance, are trading at $0.99 (down 0.01%), $1 (up 0.01%), and $208.2000 (down 2.24%), respectively.\n\nData\n\nTake a look at the top losers of the day\n\nThe biggest losers of the day are Compound, Render, Algorand, XDC Network, and Mina. They are trading at $39.35 (down 3.49%), $1.50 (down 3.37%), $0.099 (down 3.02%), $0.044 (down 1.44%), and $0.33 (down 1.22%), respectively.\n\nDeFi\n\nCheck out the leading DeFi tokens today\n\nDeFi or decentralized finance refers to global, peer-to-peer financial services on public blockchains. Some of the popular DeFi tokens are Dai, Wrapped Bitcoin, Chainlink, Avalanche, and Uniswap. They are trading at $1 (up 0.03%), $26,328.92 (up 0.57%), $7.49 (up 4.06%), $9 (up 2.27%), and $4.30 (up 1.19%), respectively.\n\nNFT\n\nThese are the top 5 NFT tokens today\n\nNon-fungible tokens (NFTs) are cryptocurrencies that do not possess the property of fungibility, meaning they cannot be exchanged for one another like other tokens. Some of the popular NFT tokens are Internet Computer, Immutable, Stacks, Axie Infinity, and Theta Network. They are currently trading at $2.98 (up 1.33%), $0.55 (down 0.94%), $0.44 (down 0.68%), $4.63 (up 1.35%), and $0.66 (down 0.87%), respectively.\n\nMarket outlook\n\nTotal cryptocurrency market capitalization\n\nThe current global crypto market cap is $1.05 trillion, a 0.33% increase over the last day. The total crypto market volume over the last 24 hours is $24.69 billion, which marks a 37.2% increase. Last month, the global crypto market valuation was $1.05 trillion, while the total capitalization stood at $1.19 trillion three months ago."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wOS8yNi93aHktc29sYW5hLXBvbHlnb24tYW5kLWFwdG9zLWV4cGVjdC10aGUtZW50ZXJwcmlzZS10by1kcml2ZS1tYXNzLWFkb3B0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Why Solana, Polygon and Aptos expect the enterprise to drive mass adoption - TechCrunch",
        "content": "There are a number of blockchains out there competing for market share. Some chains are generalists with a focus on growing the greater ecosystem, while others focus on scaling or changing the financial landscape.\n\nEven as a handful of the big ones compete for the top slot, some think that working together toward a multichain world could be the answer to the bigger problems in the space.\n\n“A multichain world makes it much easier for us to start moving the technology forward,” Grace Torrellas, VP of product and product lead at Polygon zkEVM, said during a panel at TechCrunch Disrupt 2023. Polygon is a layer-2 blockchain, which means it’s focused on scaling, in this case, the layer-1 blockchain Ethereum. “We are building an ecosystem of multichains that will be interoperable.”\n\nMo Shaikh, co-founder and CEO of layer-1 blockchain Aptos Labs, agreed. “I do think it’s a multichain world for sure. I think we’re starting to see the deep work that all of us have done really come to fruition.”\n\nWhile that may be a view some blockchains have, others don’t feel the same.\n\n“To keep things spicy, I’ll say there’s going to be a single chain,” said Anatoly Yakovenko, co-founder and CEO of layer-1 blockchain Solana, explaining that there’s going to be a single execution environment, so it won’t really matter how many other settlement environments there are. “It doesn’t matter which bank USDC actually settles in, but what matters is where all the peer-to-peer or merchant-to-consumer transactions occur.”\n\nStressing that he’s not saying so only to be a contrarian, Yakovenko added it’s a real possibility because the main purpose for blockchains today is to move all crypto transactions, and a large portion of financial transactions, into one “single unified layer-1” chain.\n\n“Within 20 years, we are going to see 1,000x improvement in hardware, so we’re gonna see 1,000x more capacity on a layer-1 that’s a single giant atomics state machine,” Yakovenko added. “So you can imagine that you can fit everything into one place, and usually, things are cheaper and faster and kind of more composable when they’re in one place.”\n\nWhile having everything in one place sounds nice, I think it could be a bit too . . . unified. Let’s take Google as an example: Sure, we use Google’s search engine, email, cloud storage and other services, but I don’t want it to be my banking app, too. We look to Google for a number of things and use other companies’ products for others . . . and that’s okay.\n\nIt’s important to make sure that each chain offers a use case that is well prepared for that particular chain, Torrellas said. “I feel like that’s where the users will have better possibilities to interact in a blockchain space or in web3 space. Not just thinking about how I can bridge assets to this network versus another network, but just going there and having a seamless continuity within the network. We call it an unlimited blockspace.”\n\nAn example of such a focused blockchain is Sei, a layer-1 blockchain that’s focused on trading and not built as a general-purpose network that developers can build on top of. The team at Sei comprises former employees from Goldman Sachs, Databricks, Robinhood, Google and Nvidia, which is fairly fitting given the chain’s focus.\n\nEnterprise growth\n\nWhether or not one believes blockchains should be focused on a multichain world, we’re seeing multichain integrations happening at both crypto-focused companies and mainstream big name brands.\n\n“I do think that distribution from large enterprises has been interesting; they’ve all dipped their toes, they’ve all experimented in previous protocols, but they just don’t feel comfortable with the infrastructure being where it needs to be,” Shaikh said. “We’ve seen hints of product-market fit in some applications, but nothing has actually been sustainable for the long term.”\n\nThis is where leaning into enterprises makes a lot of sense, he added.\n\nIn the payments space, MasterCard has teamed up with a number of blockchain-focused foundations like Aptos, Polygon and Solana to bring the set of standards to developers in each ecosystem. Aptos has integrated its technology with companies like Microsoft, NBCUniversal and Coinbase Pay to grow its ecosystem and improve technologies for those businesses. And last month, Solana integrated its plug-in with Shopify to offer USDC payments.\n\n“I think the industry has gotten a lot better with its attempts to build credible things that get to market, to consumers,” Yakovenko said.\n\nPolygon is no stranger to big brand adoption either. It has partnered with brands like Disney, Reddit and Starbucks, to name a few, which expands the blockchain’s exposure to a bigger demographic while also potentially making the technology more accessible. “Enterprise partnerships are big at Polygon, and this is something that has made us really just go over that sort of chasm,” Torrellas said.\n\nAs more large enterprises enter the crypto space, there’s potential for “not only millions of users, but billions of users using web3 without having to even realize it,” Shaikh said.\n\nThe next wave\n\nLooking to the future, some companies are wondering whether the next big killer use case and mass adoption will come from a crypto-native company or through a big brand adopting the technology.\n\nThe general sentiment from the panelists was that it would be the former.\n\n“I generally focus on crypto-native companies to be the disruptors,” Yakovenko said.\n\nTorrellas echoed that comment: “I think the next wave of disruption is definitely going to be within crypto. There isn’t an appetite for traditional companies or web2 companies to change their business models too much.”\n\nIndeed, that’s where it seems likely for blockchain technology to come in. Why would a company like Disney craft its own blockchain infrastructure when it can easily use a network developed by professionals within the industry?\n\nThat’s not to say enterprises aren’t thinking about it, though.\n\n“We do feel there is interest in enterprises bubbling up in a very aggressive way in the background,” Shaikh said. “It may not appear that way today, but there are companies that are building some very interesting products that I’d love to talk about in the future.”\n\nThe companies, whether in the crypto space or not, that will take the lead will be the ones that disrupt themselves, Shaikh said. “Think about Netflix. They used to mail DVDs to your house and they realized this doesn’t work.” The company could have flatlined or collapsed, but instead it changed its model and now has a market cap of $170 billion.\n\n“Large enterprises are absolutely willing to disrupt themselves,” Shaikh added."
    }
]