[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMipwFodHRwczovL3d3dy5kZWxtYXJ0aW1lcy5uZXQvbGlmZXN0eWxlL2V2ZW50cy9zdG9yeS8yMDIzLTA1LTE5L2NpdHktb2Ytc29sYW5hLWJlYWNoLWFuZC1zb2xhbmEtYmVhY2gtdmV0ZXJhbnMtb2YtZm9yZWlnbi13YXJzLXBvc3QtNTQzMS10by1jby1ob3N0LW1lbW9yaWFsLWRheS1jZXJlbW9uedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "City of Solana Beach and Solana Beach Veterans of Foreign Wars Post 5431 to co-host Memorial Day ceremony - Del Mar Times",
        "content": "Presentaion of the Colors by Camp Pendleton Young Marines at the Solana Beach Memorial Day ceremony last year.\n\nThe City of Solana Beach and Solana Beach Veterans of Foreign Wars (VFW) Post 5431 will co-host a Memorial Day ceremony from 11 a.m. to noon on Monday, May 29, at the La Colonia Park Veterans Honor Courtyard, 715 Valley Avenue, Solana Beach.\n\nCamp Pendleton Young Marines will be the honor guard. Mira Mesa High School student Collin Farrar will be the guest speaker, as well as Solana Beach Mayor Lesa Heebner and Julian Gonzales, Post Commander for VFW Post 5431. The Santa Fe Christian Schools Band will perform patriotic songs. A special “Feathers from Heaven” dove release will be provided by Joe and Leslie Irwin. The Veterans Memorial wall, which honors the service of all Solana Beach Veterans of Foreign Wars, will be available for viewing. Docents from the Solana Beach Civic and Historical Society will be on hand to conduct tours of the Historical Museum.\n\nLight refreshments will be served. The event is free of charge and open to the public.\n\nFor more information, call 858-720-2453."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvL2NyYXNoLWNvdXJzZS9zb2xhbmEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 14:41:06 GMT",
        "title": "Solana - Fortune",
        "content": "Solana is a popular blockchain that supports decentralized applications and tokens. Launched in 2020, the network is frequently pitched as a leading alternative to the high fees and slow transaction times that have sometimes plagued market leader Ethereum. Solana claims to be capable of processing transactions 4,000 times faster than Ethereum.\n\nThose pitches are often made by venture capitalists, who flooded the project, helmed by former Qualcomm employee Anatoly Yakovenko, with over $300 million in 2021. The cash jolt helped Solana’s native currency, SOL, rise to highs of $78 billion in June of that year.\n\nSolana has since its inception relied on the environmentally-friendly proof-of-stake technique to verify transactions on its blockchain and, like Ethereum, users pay transaction fees in its native currency.\n\nSolana is not compatible with popular Ethereum wallets like MetaMask, and instead relies on its own network of wallet makers. Popular choices include Solflare and Phantom. It also has a lively NFT scene, hosting projects like Solana Monkey Business and the Degenerate Ape Academy.\n\nSolana’s market cap lags behind Ethereum by several hundred billion dollars, and its price is far more volatile. Most of the venture capitalists and investors that boosted the coin in the bull run of 2021 went quiet while its market cap fell from $78 billion in June of that year to $13 billion a year later.\n\nThe blockchain also suffered several crashes and outages that shut down the blockchain for hours at a time. A bug in June 2022 brought down the blockchain for four hours, and in September 2021 a popular DeFi protocol switched off the network for almost 18 hours.\n\nSolana took a bigger hit than most other cryptocurrencies following the November 2022 collapse of FTX because many people regarded the project as intertwined with the exchange’s disgraced founder, Sam Bankman-Fried. Since then, Solana’s founders have stated repeatedly that the blockchain can flourish on its own. By mid-2023, Solana appears to have largely recovered from the scandal, and its token price has climbed.\n\n\n\nGo deeper:\n\nSolana white paper—Anatoly Yakovenko\n\n\n\nSee also:\n\nWhat is DeFi?\n\nWhat is Ethereum?\n\nWhat is cryptocurrency?\n\n\n\nTry it:\n\nSolscan—Solana’s blockchain explorer\n\nPhantom—A popular Solana wallet"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vdGltZXNvZnNhbmRpZWdvLmNvbS9hcnRzLzIwMjMvMDUvMTkvc2FuLWRpZWdvLXdlZWtlbmQtZ3VpZGUtbWF5LTE5LTIxLXNpZ25zLW9mLXN1bW1lci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "San Diego Weekend Guide: May 19-21 – Signs of Summer - Times of San Diego",
        "content": "Kids of all ages can enjoy the kites, big and small, at the OB Kite Festival. Photo by Chris Stone\n\nDo you feel the anticipation? If May Grey tells us anything, it’s that summer is right around the corner. Unofficial summer, of course, starts with Memorial Day. So, let’s enjoy this San Diego weekend while also counting down to the long weekend JUST ahead.\n\nThere’s one more chance to catch the GI Film Festival San Diego – check out three slates of short films Friday evening at the Museum of Photographic Arts in Balboa Park. Screenings cost $10 with discounts for service members and vets. The fest concludes Saturday with the sold-out Awards Celebration.\n\nThe 11th annual San Diego Fringe Festival continues with a promise to bring “the beautiful, the bizarre and the unexpected” to fans. Segments include “Family Fringe” and “Street Theatre.” Performances include comedy, musicals, physical theater and more. The fest, mostly at Balboa Park, runs through May 28. Passes start at $27 for three shows, with 10-show passes available.\n\nFiesta del Sol, Solana Beach’s free music festival, opens Saturday at Fletcher Cove. The English Beat, The Fabba Show and Betamaxx lead the slate on day one, with Iya Terra and Ginger Roots and the Protectors the headliners on Sunday. The music starts at 9 a.m. both days, and for a family friendly show, start with Hullabaloo at 10:30 a.m. each day.\n\nGo fly a kite! Really, go to Ocean Beach and do it, at the free OB Kite Festival, where you can make a kite, fly a kite and compete in a kite contest or two. It’s all the kite things, in one place, at Robb Field, beginning at 10 a.m. Stroll around the fair too, with artisans, food trucks and more.\n\nThe Island Vibe Music Festival, at 1 p.m. Saturday at Del Mar’s Surf Cup Sports Park, features performers from across the Pacific Islands including Polynesia, Micronesia and Melanesia. The event also features dancers, a vendor village showcasing Islander-inspired merchandise, art and food. General admission is $45.\n\nSaturday is World Bee Day and the Japanese Friendship Garden will do its part to remind people about the importance of bees in our ecosystem (they aren’t just little buggers that sting you, for instance). Various Balboa Park venues and volunteer groups will showcase bees through exhibits, music, interactive demonstrations and hands-on activities at the Upper Garden starting at 10 a.m. Garden general admission costs $14.\n\nViva la Música concludes Sunday at SeaWorld San Diego with Elvis Crespo, the Grammy-winning Puerto Rican singer and songwriter. Entry to the Bayside Amphitheater show comes with park admission, which costs $95. Reserved seating is available as well."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMinwFodHRwczovL3d3dy5wb3VnaGtlZXBzaWVqb3VybmFsLmNvbS9waWN0dXJlLWdhbGxlcnkvc3BvcnRzLzIwMjMvMDUvMjAvd2FwcGluZ2Vycy1naXJscy1sYWNyb3NzZS1rbm9ja3Mtb3V0LW9zc2luaW5nLXNlY3Rpb24tMS1jbGFzcy1hLXF1YXJ0ZXJmaW5hbC8xMTkxMjUwMjAwMi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 07:00:00 GMT",
        "title": "Wappingers girls lacrosse knocks out Ossining to advance to Section 1 Class A semifinal - Poughkeepsie Journal",
        "content": "Wappingers girls lacrosse knocks out Ossining to advance to Section 1 Class A semifinal\n\nPatrick Oehler Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nWappingers' Brooke Cameron carries the ball away from Ossining's Solana Strippoli during Friday's game in Wiccopee on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nWappingers' Kaylee Reaves and Ossining's Isabella Flores battle for the ball during Friday's game in Wiccopee on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nWappingers' Alexa Cazzorla draws away from Ossining's Ella Nee during a Section 1 girls lacrosse Class A quarterfinal on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nWappingers' Haley Washall gets the ball under control as Ossining's defense closes in on her during a Section 1 Class A girls lacrosse quarterfinal on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nWappingers' Nicolette Diedrich shoots to score on Ossining's Alexa Klainbard during Friday's game in Wiccopee on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nWappingers' Taylor Ferrucci drives to the crease ahead of Ossining's Abigail Sabillon during Friday's game in Wiccopee on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nWappingers' Nicolette Diedrich cradles the ball and looks to make a move against Ossining during a Section 1 Class A girls lacrosse quarterfinal on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nWappingers' Mackenzie Velsmid drives up field after securing a draw against Ossining during a Section 1 Class A girls lacrosse quarterfinal on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nWappingers' Kaylee Reaves drives on Ossining defender Solana Strippoli during a Section 1 Class A quarterfinal on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal\n\nAction from Friday's Section 1 Class A quarterfinal between Ossining and Wappingers on May 19, 2023. Patrick Oehler/Poughkeepsie Journal"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LnRpcHJhbmtzLmNvbS9uZXdzL2FydGljbGUvY2FuLXNvbGFuYS1zb2wtdXNkLWdvLW9uLWFub3RoZXItYnVsbC1ydW4td2l0aG91dC1mdHjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 19 May 2023 17:01:38 GMT",
        "title": "Can Solana (SOL-USD) Go on Another Bull Run Without FTX? - TipRanks.com - TipRanks",
        "content": "The Solana ecosystem and its star token SOL (SOL-USD) has seen its bull run hit particularly hard by one of the largest frauds in the cryptocurrency space — the November 2022 collapse of the FTX exchange, caused by extreme mismanagement of customer funds.\n\nThis is because FTX was among the largest sponsors of the Solana ecosystem, with the exchange and its infamous hedge fund arm Alameda Research being involved in funding the ecosystem, supporting liquidity, and even backing many of the bridged assets on Solana (tokens from other blockchains “wrapped” so that they could be used on Solana).\n\nJust to list a few concrete examples, FTX was the primary “bridge” to bring assets such as USD Coin (USDC-USD), Bitcoin (BTC-USD), and Ethereum (ETH-USD). Thankfully, the former eventually gained enough traction to have a native Solana version issued by USDC’s creator, Circle, which helped reduce the magnitude of the eventual impact.\n\nSerum, a decentralized exchange backed by FTX, was shut down in the wake of the FTX collapse. The platform was the backbone of Solana during its heyday, with many other decentralized finance (DeFi) exchanges drawing liquidity from it as well.\n\nOverall, the impact of the FTX collapse was immense. From $1 billion in total value locked (TVL), a measure of the value of the assets placed in Solana apps, the ecosystem crashed to just over $200 million. What’s more worrying, even amid a broader market recovery since the lows of 2022, TVL remained largely flat on Solana.\n\nTechnical Woes Add Fuel to the Uncertainty\n\nA further issue that’s haunted Solana since before the FTX debacle is the frequent chain halting. Normally, blockchains are supposed to be impossible to stop; at worst, fees will skyrocket to levels where only the most determined users will still be interested in using the chain.\n\nSolana initially didn’t quite have a fee market like other blockchains, so when demand for transactions outstripped supply, the network simply stopped. When that was changed in mid-2022, other bugs caused halting. The last chain halt was in February 2023, and since then, no more episodes have been reported, according to the Solana uptime page.\n\nHowever, the reputational damage is done. The chain has stopped 10 times in its history, often for many hours at a time — an unacceptable record in the blockchain space. Reliable uptime is one of the pillars of a healthy DeFi ecosystem, and Solana arguably lost a lot of trust from developers and users alike in the past 12 months. It’ll be some time before the community forgets about these episodes, which hopefully will not be happening again from now on.\n\nIf these issues are solved, then Solana remains an excellent alternative for deploying decentralized apps. With extremely low fees and high throughput, thanks to a number of optimizations to the underlying transaction processing, the Solana blockchain is a valid contender in the race for blockchain adoption.\n\nThe question now is, where will this next wave be coming from, and how is Solana positioning itself to take advantage of it?\n\nDespite Everything, Solana is Still Keeping Up\n\nThe overall market slowdown in 2022 has impacted the entire space. Old narratives, such as the NFT mania, quieted down, and precious few new alternatives have emerged since. Thankfully, Solana has been keeping up with the new up-and-coming trends in blockchain.\n\nOne of these trends is so-called LSDs or Liquid Staking Derivatives. These are token wrappers representing an underlying amount of staked assets, or SOL in this case. They are useful because holders can gain access to nearly the full value of their assets just by selling LSDs or using them in DeFi, while still receiving a staking yield at all times.\n\nLSD protocols like Marinade Finance and Lido have quickly gained market share and are now the top protocols by TVL, keeping the ecosystem visible in the overall charts.\n\nEven meme coins like BONK had a good run on Solana, arguably starting the meme coin “trend” (however long it may last). There are also solid upticks in DeFi and NFT activity, with key partnerships such as the Chicago Board Options Exchange (CBOE) delivering on their promise, according to Messari.\n\nIt’s impossible not to mention the Solana Saga, the platform’s own Android flagship device, which has recently shipped. Though the idea is certainly out of the ordinary, reviewers seem to be praising the phone as well-made and tastefully integrated with Web3 features.\n\nFinally, there’s a very good sign on the development front: activity hasn’t slowed down significantly in numbers, despite the chain issues from the past.\n\nThis is a great sign for things to come: the next killer app of blockchain is still out there, and as it stands, it looks like Solana is in a position to be there when it comes. If that happens, SOL should easily follow along, thanks to the LSDs and the new fee model.\n\nSo despite the massive crash and tough challenges, rumors of Solana’s demise may be greatly exaggerated. The chain has managed to retain a core set of loyal developers and users, which are keeping it relevant, even if still far away from previous heights. The future may still be quite bright for the ecosystem, even if it will likely need more time to recover.\n\nDisclosure"
    }
]