[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9uZXdzL3N0b3J5LzIwMjMtMDItMTcvc29sYW5hLWJlYWNoLXNjaG9vbC1kaXN0cmljdC1jbGFzc2lmaWVkLXN0YWZmLXJlY2VpdmVzLXNhbGFyeS1pbmNyZWFzZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Solana Beach School District classified staff receives salary increase - Del Mar Times",
        "content": "The Solana Beach School District board ratified a tentative agreement between the Solana Beach Association of Support Professionals and the district, modifying the 2020-23 collective bargaining agreement. The agreement approved at the board’s Feb. 15 meeting includes a 5% salary increase for classified staff, retroactive to July 1, 2022.\n\nClassified employees include positions such as school para-educators, office staff, custodians and child nutrition staff. SBSD board President Debra Schade said she was excited that negotiations were completed and resulted in a positive outcome: “We really value our support professionals,” she said.\n\nLast month, the board approved a 4.25% on-schedule salary increase for unrepresented employee groups, which includes administration, management, confidential and supervisory employees. Negotiations began in January with the Solana Beach Teachers Association on certificated teacher contracts for the 2022-23 school year.\n\n"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5kZWxtYXJ0aW1lcy5uZXQvbGlmZXN0eWxlL2V2ZW50cy9zdG9yeS8yMDIzLTAyLTE3L3NwZWFrZXJzLXRvLWhlbHAtYnJlYWstZG93bi10aGUtbXlzdGVyaWVzLW9mLWhvc3BpY2UtY2FyZS1hdC11cGNvbWluZy1wcmVzZW50YXRpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "Speakers to help break down the mysteries of hospice care at upcoming presentation - Del Mar Times",
        "content": "Dispel the mysteries of hospice care. “Hospice: It Isn’t So Scary” will be presented by Sharon and Gin Lao, both M.Div. at 6 p.m. on Tuesday, Feb. 21 at the Solana Beach Library. Discover how hospice care restores hope to grieving family members feeling lost and alone.\n\nGin and Sharon Lao\n\n(Gin Lao, 2023 Encinitas)\n\nThe Laos will discuss how The Elizabeth Hospice, a nonprofit organization, provides medical, emotional and spiritual support to children and adults facing the challenges associated with a life-limiting illness. All your questions will be answered as you learn what to expect from a hospice team, how patients qualify, who pays for hospice, when and where hospice care can be delivered.\n\nSharon and Gin Lao have 23 years of combined hospice experience. They use religious and non-religious spiritual care to support clients searching for hope, meaning and inner peace. They provide education, guidance, music and life review along with a dash of humor to grieving families.\n\nElizabeth Hospice, established in 1978, has provided palliative care and grief support services which have touched the lives of more than 115,000 people in the San Diego and Southwest Riverside Counties.\n\nThis is the second in a series of senior age-related presentations co-sponsored by the Friends of the Solana Beach Library and Solana Beach Community Connections (www.SolanaBeachcc.org).\n\nThe library is located at 157 Stevens Avenue, Solana Beach, 92075. This event is free and open to the public. Free parking is also available."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYm9sZC5jb20vd2UtYXNrZWQtY2hhdGdwdC13aGF0LXdpbGwtYmUtc29sYW5hLXByaWNlLWluLTIwMzAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "We asked ChatGPT what will be Solana price in 2030 - Finbold - Finance in Bold",
        "content": "OpenAI’s text-based artificial intelligence (AI) platform ChatGPT has already gained worldwide recognition and popularity over its usability in multiple areas, including the cryptocurrency market, and providing insight into the future price of digital assets like Solana (SOL).\n\nTaking this into account, Finbold asked the AI chatbot to provide the possible price range for Solana by 2030 based on the network’s development so far, its unique features, community strength, current market conditions, past performance, aggregated online information, and other factors.\n\nAfter admitting it was challenging to provide a definitive answer on the future price of Solana or any other cryptocurrency with certainty, ChatGPT did provide reasons for the possible rally, including the “fast transaction speeds and low fees, which could make it an attractive option for developers and users alike.”\n\nChatGPT says: $50 – $1,000\n\nIn terms of specific numbers, the AI tool provided possible Solana price ranges for both a bullish and a bearish scenario, with the most optimistic case projecting SOL at $1,000 or more by 2030:\n\n“Bullish scenario: Some analysts believe that SOL has a strong potential for growth in the coming years due to its unique features, including its high speed, low fees, and strong development team. They predict that SOL could reach as high as $1,000 or more by 2030 if it continues to gain adoption and improves its technology.”\n\nOn the other hand, if bears are proven to be correct, ChatGPT stated that Solana could expect only a modest increase (but an increase nonetheless) of around $50 to $100 in the next seven years, citing market circumstances and competition:\n\n“Bearish scenario: Others believe that the current market conditions and increased competition in the crypto space could limit SOL’s growth potential. In this scenario, SOL could trade within a range of $50 to $100 by 2030, based on historical price movements and market trends.”\n\nSolana price analysis\n\nAs things stand, Solana is currently trading at the price of $22.57, which represents a decline of 5.06% on its daily chart, as the digital asset is still holding on to its 10.42% gain over the previous seven days and tries to offset the 1.37% drop across the last month, as per data retrieved on February 17.\n\nSolana price chart. Source: Finbold\n\nMeanwhile, the realization of either of the two possible scenarios offered by ChatGPT would depend on the wider crypto and macroeconomic atmosphere, as well as the developments surrounding its ecosystem, such as the launch of a new tool to prevent scams on the Solana-supported Phantom wallet.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LnJhbmNob3NhbnRhZmVyZXZpZXcuY29tL25ld3Mvc3RvcnkvMjAyMy0wMi0xNy9uZXctc29taWNoLWRlc2lnbi1ib3V0aXF1ZS1vcGVucy1pbi10aGUtdmlsbGFnZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "New Somich Design Boutique opens in the Rancho Santa Fe village - Rancho Santa Fe Review",
        "content": "Tami Somich celebrated the grand opening of the new Rancho Santa Fe village business Somich Design Boutique on Feb. 8. The new interior design studio and gift shop on Paseo Delicias is all about giving everyone a beautiful space to live and filling a niche for a local gift shop with a little bit of everything, from adorable baby and kids finds to stylish kitchen goods.\n\nSomich Design specializes in residential and commercial interior design, staging and remodeling. She started her interior design business two and half years ago, three years after losing her husband Nicholas to cancer at just 41 years old.\n\n“I wanted to do something for myself,” said Somich, who had been a stay-at-home mom to children Alex and Izzy. “I wanted the kids to be proud of me and show them that I could do something rather than just being at home and sad.”\n\nAt the time, Somich was renovating her Fairbanks Ranch home and she kept getting a inquiries about who was behind the design. She started taking on design clients one at a time, beautifying homes in the Covenant, La Jolla and Encinitas. “It really kind of exploded,” Somich said. “ I just pinch myself every day that people want to work with me.”\n\nSomich Design Boutique displays. (Robert McKenzie)\n\nFor about a year Somich was working on the process of opening a storefront in Solana Beach’s Solana Center on Lomas Santa Fe Drive, a design shop with a retail element space where people could look at the furniture and touch the materials. While she worked on opening that store, she was approached by realtors Khaki Wennstrom and Delorine Jackson, who partnered together to create D&K, a new fashion and lifestyle boutique in the heart of the Rancho Santa Fe village. Jackson had a space available to rent and wondered if Somich would be interested in taking it on as they hoped to create more retail opportunities downtown, rather than just banks and real estate offices.\n\n“I thought it was a good idea…it had so much potential,” Somich said. “I was interested in taking that risk and trying it out.”\n\nShe converted a former real estate office into her boutique, bringing in her inventory of furniture and home decor, adding pendant lights and fancy fixtures— everything on display in the shop has a price tag and is for sale. As she set up shop, she saw the need to bring in more gift items—now in addition to her design services, people can stop in to find a little bit of everything, a gift for any occasion.\n\nLauren Mishurda checks out the beautiful children’s selection with Somich Design Boutique junior designer/retail buyer Mia Monahogios.\n\n(Robert McKenzie)\n\nWennstrom and Jackson’s vision has taken shape with Plantology, a shop that offers landscape design and succulents, and Mitchell’s Floor Coverings with custom rugs and hardwood, rounding out the building space near D&K and Somich Design.\n\n“A lot has happened in the last few months…we’re trying to get something started,” Somich said, adding that the more retail that opens will hopefully help fill more village storefronts with boutiques and shops.\n\nThe Somich Design logo is a butterfly, a loving nod to her husband Nicholas. Butterflies were released at his memorial and she associates the symbol of remembrance and hope with his memory. She and Nick used to love doing renovations together, purchasing houses and investing in properties and working together to create a home. “I feel like he’s along with me,” she said. “This is something he would’ve loved to do together.”\n\nSomich has since sold her home in Fairbanks Ranch and is renting in Cardiff while looking for her next project. Store number two in Solana Beach is still in the works, going through the city permitting process and she hopes to open her doors this spring.\n\nShe is loving what she is doing now and what it means to her kids.\n\n“I want them to see how much I love it, to see what happens when you put a lot of work into something,” Somich said. “It’s made us closer. I think that they are really proud of me and I love that I can create this lifestyle for my family.\n\n“It’s been really special.”\n\nThe new store is located at 6024B Paseo Delicias. Learn more at https://somichdesign.com/\n\n"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDIvMTcvb3JkaW5hbHMtYml0Y29pbi0yNWstc2F0b3NoaS1leHBsYW5hdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Feb 2023 08:00:00 GMT",
        "title": "How ordinals are helping push Bitcoin beyond $25K - Fortune",
        "content": "Despite the Securities and Exchange Commission’s recent crackdown on crypto, Bitcoin is up, and up big: From Tuesday to Thursday, the price rose almost 14%, peaking just above $25,000, according to CoinMarketCap.\n\nPinpointing exactly why the price of the world’s first cryptocurrency rises and falls isn’t an exact science, but reports of a recent short squeeze—investors who’d bet the price of Bitcoin would decrease sold holdings—is one explanation for Bitcoin’s sudden rally.\n\nAlso driving up Bitcoin’s value are ordinals, according to a report from blockchain data company Glassnode. But what are they, and how are they contributing to Bitcoin’s latest price surge?\n\nOrdinals’ origins\n\nAn ordinal is essentially a non-fungible token, a digital asset most famously used to prove that only one person owns, for example, a $69 million piece of digital art sold in March 2021.\n\nNFTs are most famously used on blockchains like Ethereum and Solana. The computing capabilities of these digital ledgers extend far beyond Bitcoin’s, whose blockchain is primarily designed to record transactions between owners of the digital currency.\n\nHowever, in December, Casey Rodarmor, a Bitcoin engineer, designed a method to allow NFTs to exist on Bitcoin’s blockchain, as opposed to earlier efforts to add NFTs to Bitcoin’s ledger that were hosted “off-chain,” or not in the same database that records daily transactions. Rodarmor called these “digital artifacts” ordinals.\n\nCumulative fees spent minting Ordinals approaching $1M and looking exponential.\n\n\n\n🔗 https://t.co/kD6KnYFd8f pic.twitter.com/BjvotTwnpc — Ben DiFrancesco (@BenDiFrancesco) February 16, 2023\n\nHow do ordinals work?\n\nFirst, Rodarmor invented an algorithm to create a serial number for each and every satoshi, the name for the smallest subdivision of a Bitcoin (there are 100 million satoshis per Bitcoin), based on when the satoshi was first generated.\n\nThen, he created a method for “inscribing” data on a satoshi, exploiting recent updates to Bitcoin’s code in 2017 and 2021, which expanded the capacity for the blockchain to store data beyond transaction records.\n\n“Imagine the one-cent piece you have in your pocket, and I can put a piece of data on it,” Daniel Peter, cofounder and CEO of CapsuleNFT, a blockchain infrastructure company that recently announced its work with ordinals, told Fortune. “Instead of that being a cent, now I’ve attached a picture of Benjamin Franklin to that cent.”\n\nLike NFTs on other blockchains, ordinals are “non-fungible.” In other words, there is a unique record on Bitcoin’s ledger that says that the slight sliver of Bitcoin with, say, Benjamin Franklin’s image on it belongs to one owner and one owner only.\n\nBut, as opposed to the NFTs on blockchains like Ethereum and Solana, the data piggybacking on top of a satoshi is not a link to where the actual file resides (often on decentralized file storage systems). The data is stored, or “inscribed,” on the ordinal itself.\n\nIt’s worth noting that Ethereum and Solana also allow users to store large data files on an NFT; however, pushing this data “on chain,” or having it reside on the blockchain itself, is more computationally intensive and therefore expensive, Jon Wong, technical lead on the NFT team at the Solana Foundation, told Fortune.\n\n“It’s decidedly an anti-scale model,” Austin Federa, head of strategy and communications at the Solana Foundation, said of ordinals. He added: “Here’s a version of something that sort of, if you squint, resembles fine art, in terms of its ability to create value through scarcity.” However, he noted, its uses are otherwise limited.\n\nStaying power?\n\nSince ordinals became hot in early February, the number of “mints,” or creations, of Bitcoin NFTs have soared, according to data from Dune Analytics. The majority of data “inscribed” or stored on ordinals are images, including reprints of Bored Apes illustrations and a space turtle GIF. But people have also attached other media, including a clip of amateur Spanish rap. Almost 130,000 ordinals have been minted so far, per Dune.\n\nAs ordinal mints have increased, the minters have been willing to pay the miners, the computers that run and secure Bitcoin’s blockchain, more and more in transaction fees. The increased frenzy is one of the reasons behind Bitcoin’s recent price increase, says Wong of the Solana Foundation.\n\nIt remains to be seen whether ordinals, which are only about two months old, have staying power. But, in the meantime, Bitcoiners are cheering on the rally."
    }
]