[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbmZvbWFuaWEuY29tL3NvbGFuYS1jZW8teWFrb3ZlbmtvLW9uLWxlc3MtZGVjZW50cmFsaXplZC1jb21wZXRpdG9ycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Sep 2023 07:00:00 GMT",
        "title": "Solana's CEO Yakovenko: Not Worried by \"Less Decentralized\" Competitors - Coinfomania",
        "content": "Solana CEO and co-founder Anatoly Yakovenko is not worried about an increasingly competitive landscape for smart contract-focused blockchains. In a recent CNBC interview, Yakovenko noted that Solana has a significant edge over its competitors, especially in terms of decentralization.\n\nThe Solana co-founder referred to the famous blockchain trilemma, which argues that it is difficult for a public blockchain to be cheap, fast, and decentralized at the same time. Yakovenko argued that most new entrants into the space [have] sacrificed some of those aspects and still trail Solana by a significant mile.\n\nHe said in the interview, “Solana is the second-largest network by full-node count behind Ethereum out of those smart contract platforms. So far, all the new networks that have launched are somewhere between 100 and 200 nodes which is much lower in the decentralization spectrum.”\n\nStill speaking on how Solana compares with other smart contract blockchains, Yakovenko suggested that a smaller version of the Solana network would easily compete with others in terms of performance differences.\n\nSolana Eyes More Financial Institutions Building On Its Network\n\nThe Solana co-founder also weighed in on recent news that global payments giant Visa would now tap the layer-1 blockchain to settle USDC payments for merchants. Yakovenko expressed delight at Visa’s latest move and hopes it moves other financial institutions to “consider the [Solana] network as well.\n\nHe added, “I think right now is probably the best time to start experimenting with using programmable money because it is still a very early technology that hasn’t been established yet. I’m hoping to see more financial institutions start building on Solana.”\n\nYakovenko also expressed conviction that Visa’s move and greater involvement by established financial institutions would help bring blockchain’s immense benefits to consumers. “I’d love to see every major financial institution launch their own pilot payments program, launch their own stablecoins, and push this innovation to the consumers,” Yakovenko concluded."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vYml0Y29pbmtlLmlvLzIwMjMvMDkvdmlzYS10by11c2UtdXNkYy1vbi1zb2xhbmEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Sep 2023 07:00:00 GMT",
        "title": "STABLECOINS | Visa Doubles Down on Cross-Border Settlements Using USDC Stablecoin on Solana - bitcoinke.io",
        "content": "Visa, a key player in the payments industry, has announced its further expansion into the realm of cryptocurrencies, with a particular focus on utilizing the stablecoin USD Coin on the Solana blockchain for its initiatives.\n\nThe company announced its collaboration with two merchant payment companies to facilitate the transfer of millions of dollars in USDC, the sixth largest digital asset with a market capitalization of $26 billion.\n\nAccording to Visa, it is one of the first major payments companies at scale to directly utilize Solana for live settlement payments between its clients.\n\n“The Solana blockchain sees 400 millisecond block times, averages 400 transactions per second (TPS) and typically surges to more than 2K TPS1 across a variety of use cases during periods of peak demand.”\n\nVisa disclosed that it is partnering with merchant acquirers Worldpay and Nuvei to enable them to settle transactions using USDC rather than traditional fiat currencies.\n\nIn financial terms, a ‘settlement’ refers to the process in which the issuing bank transfers funds from the cardholder’s account, typically facilitated through a payment gateway, to the bank responsible for receiving card payments on behalf of the merchant.\n\n“By leveraging stablecoins like USDC and global blockchain networks like Solana and Ethereum, we’re helping to improve the speed of cross-border settlement and providing a modern option for our clients to easily send or receive funds from Visa’s treasury,” said Cuy Sheffield, Visa’s Head of Crypto.\n\nVisa’s application of USDC stablecoin for settlements began back in 2022 by collaborating with the cryptocurrency exchange, Crypto.com. This collaboration allowed Crypto.com to use Ethereum for settling cross-border payments involving Crypto.com Visa cards.\n\nVisa also recently introduced an experimental solution built on the Ethereum platform which enables users to pay gas fees (transaction costs) using their credit or debit cards, making it more convenient for them to participate in Ethereum-based transactions.\n\nFollow us on Twitter for the latest posts and updates\n\n_________________________________________"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3Mvc29sYW5hLWFubm91bmNlcy1oeXBlcmRyaXZlLWhhY2thdGhvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Sep 2023 07:00:00 GMT",
        "title": "Solana Announces Hyperdrive Hackathon - Blockchain.News - Blockchain.News",
        "content": "Solana, a leading blockchain platform, unveiled its latest initiative, Hyperdrive, in a series of tweets on September 6, 2023. The event is described as an engineering and business competition where teams can transform an idea into a fully operational project within a span of five weeks.\n\nKey Highlights\n\nGrand Prize & Speciality Prizes: Solana has partnered with various entities for specialty prizes in categories such as Mobile Apps by MagicEden, Finance/Payments by Helio Pay, AI by UXD Protocol, DePIN by ionet official, Crypto Infrastructure by Ironforge Cloud, Gaming by Phantom, and DAOs/Network States by Balajis & The Network State.\n\nResources & Support: For participants seeking guidance, Solana has provided a range of resources available on its official website, along with FAQs and a dedicated Discord channel.\n\nPast Success: According to Solana, their previous hackathons have garnered over 48,000 participants, led to the creation of more than 3,000 eco products, and attracted over $600 million in venture funding for winners.\n\nPhysical Locations: In addition to the online format, Solana is also facilitating in-person collaborations through Solana Hacker Houses in Bengaluru and Mumbai.\n\nEligibility: The competition is open to participants who are of the age of majority in their state or country of residence. No purchase is necessary to enter or win.\n\nThird-Party Perspective\n\nWhile Solana's Hyperdrive aims to foster innovation in the crypto space, it's worth noting that the competition is one among many in a crowded field of blockchain initiatives. The event does, however, offer a structured platform for developers and entrepreneurs to bring their ideas to fruition, backed by a blockchain that has previously demonstrated its ability to attract significant venture capital.\n\nSEO Metrics\n\nAs of the latest data, the keyword \"Solana Hyperdrive\" is yet to gain significant search volume. However, related terms like \"Solana Hackathon\" and \"Solana Competition\" have shown consistent interest over the past year, indicating a potential uptick in searches as the event progresses.\n\nConclusion\n\nHyperdrive presents an opportunity for both novice and experienced developers to engage with Solana's ecosystem. With a history of successful hackathons and a variety of specialty prizes, the competition could serve as a launchpad for the next wave of crypto innovations.\n\nImage source: Shutterstock\n\n. . .\n\nTags"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzMyMDQxL3NvbGFuYS1hbm5vdW5jZXMtMS1taWxsaW9uLWhhY2thdGhvbi1mb3ItYXNwaXJpbmctZm91bmRlcnMtYW5kLWRldnMv0gFraHR0cDovL2FtcC5jb2luY29kZXguY29tL2FydGljbGUvMzIwNDEvc29sYW5hLWFubm91bmNlcy0xLW1pbGxpb24taGFja2F0aG9uLWZvci1hc3BpcmluZy1mb3VuZGVycy1hbmQtZGV2cy8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Sep 2023 07:00:00 GMT",
        "title": "Solana Announces $1 Million Hackathon for Aspiring Founders and Devs - CoinCodex",
        "content": "Key highlights:\n\nThey're calling all founders and developers far and wide to take part in a 5-week sprint of turning their ideas into working products.\n\nA panel of bigwigs will be the judges, keeping an eye out for slick presentations of clever projects.\n\nSolana is hoping this competition turbocharges their whole ecosystem of decentralized apps. Past hackathons have seen startups raise millions and new careers launched.\n\nSolana, one of the leading blockchain platforms for decentralised apps, has announced a major hackathon aimed at inspiring a new wave of innovation. The Hyperdrive global competition launches today and promises up to $1 million in prizes and funding to the biggestthinkers.\n\n1/ Announcing the Hyperdrive Hackathon! ?\n\n\n\n? An online, global Solana hackathon\n\n? Running Sept. 6 - Oct. 15\n\n? $1 million in prizes and seed funding up for grabs\n\n\n\nJoin and start building today: https://t.co/0HfrxRWgbd pic.twitter.com/Pw5HgHEVMA — Solana (@solana) September 6, 2023\n\nWhat is the Hyperdrive Hackathon?\n\nRunning from September 6th to October 15th, Hyperdrive will see developers from around the world collaborate online to design the applications of tomorrow. Whether you've been coding for years or are just starting out, all are welcome to participate.\n\nTeams will have 5 weeks to take their ideas from concept to minimum viable product. A diverse array of tracks are offered to spark creativity, covering everything from artificial intelligence to gaming. It's the perfect opportunity for both seasoned founders looking to get their next ventures off the ground, as well as students testing their skills.\n\nBig awards for bold ideas\n\nThe prizes on offer provide real incentive. The biggest jackpot of $50,000 and tickets to next year's Solana conference will go to the absolute champion. Additional awards focus on areas like public goods, universities and sustainability. Even if you don't win, there's seed funding accessible just for taking part.\n\nJudging will be done by an all-star panel including CEOs, VCs and engineers from top companies like Solana Labs and Coinbase. They'll be on the lookout for projects harnessing the power of the Solana blockchain in clever new ways. Good presentation skills and convincing pitches will serve competitors well when showcasing their creations.\n\nThough intended to spur growth and innovation, these developer competitions may have unexpected benefits for Solana’s native SOL token as well. As reported on CoinCodex, SOL Price fell 0.90% over the previous 24 hours to $19.58 after recent gains, likely thanks to broader crypto volatility. Another question on the minds of long-term Solana investors is; How High Can Solana (SOL) Go?\n\nA launchpad for the future of crypto\n\nSolana hopes Hyperdrive will turbocharge efforts to build out the entire Solana ecosystem. Previous hackathons have seen amazing success stories emerge, from startups raising millions to developers launching careers in the industry. Who knows, the next biggest crypto companies may very well have their origins in this competition.\n\nSo whether you fancy yourself the next tech billionaire or simply want to spend your month learning whilst having fun, sign up for Hyperdrive today. The deadline is soon but the rewards could last a lifetime in crypto. You can also check the top 7 NFT marketplaces of the Solana ecosystem."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vZGVjcnlwdC5jby8xNTU0NzAvc2hhcS1wbGF5ZWQtYWN0aXZlLXJvbGUtc29sYW5hLW5mdC1wcm9qZWN0LWJlZm9yZS1hYmFuZG9uaW5nLWxhd3N1aXQtYWxsZWdlc9IBbGh0dHBzOi8vZGVjcnlwdC5jby8xNTU0NzAvc2hhcS1wbGF5ZWQtYWN0aXZlLXJvbGUtc29sYW5hLW5mdC1wcm9qZWN0LWJlZm9yZS1hYmFuZG9uaW5nLWxhd3N1aXQtYWxsZWdlcz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 07 Sep 2023 07:00:00 GMT",
        "title": "Shaq Played Active Role in Solana NFT Project Before Abandoning It, Lawsuit Alleges - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAn amended complaint was filed on Thursday in the federal class action lawsuit against Shaquille O’Neal over his NFT project Astrals, and the basketball icon faces allegations of violating securities laws in connection to offering Solana-based assets and an associated token.\n\nThe 111-page filing comes after a district judge in Florida appointed the case’s lead plaintiffs last month, who are represented by counsel at The Moskowitz Law Firm. Managing Partner Adam Moskowitz told Decrypt the filing represents a pivotal step forward.\n\n“People applied and Judge [Federico] Moreno selected our clients to be the lead plaintiff,” he said. “That's a big, big development, because now it means that they basically run the show for all of the investors, and they've selected us to be class counsel.”\n\nAD\n\nAD\n\nMoskowitz’s firm is helping lead the charge on several other crypto-related class action lawsuits, including cases that involve collapsed firms Voyager and FTX. When O’Neal was served a complaint for the Astrals-focussed lawsuit at an NBA game in May, the phenom was also served a complaint that stems from a commercial he did for FTX following several previous attempts.\n\nThursday’s amended complaint—which is twice as long as the case’s initial one—offers a more robust look at O’Neal’s involvement in Astrals, Moskowitz claimed, including now-deleted videos and tweets gathered through websites like archive.org. O’Neal was in contact with Astral team members weekly if not daily, Moskowitz claimed.\n\nAn NFT from Shaq's collection. Image: Astrals.\n\n“What we've put in this amended complaint is a much more extensive proof about how personally involved Shaquille O’Neal, his business partner, and his son were in Astrals,” he said. “It’s much more than we ever expected.”\n\nRepresentatives for O’Neal did not immediately respond to a request for comment from Decrypt.\n\nThe amended complaint alleges that Shaq was intimately tied to Astrals and that the project's value was \"linked almost entirely to O'Neal's celebrity status.\" But not long after cryptocurrency exchange FTX—which O'Neal had endorsed—collapsed last November, the hoops legend allegedly disappeared from the Astrals community.\n\nAD\n\nAD\n\nHowever, the suit alleges that he posted a GIF from the film \"The Wolf of Wall Street\" with the phrase \"I'm not fucking leaving\" as his final post in the Astrals Discord community.\n\n\"But O'Neal has not been seen at Astrals since this now-legendary 'Wolf of Wall Street' post,\" the complaint alleges.\n\nAn alleged Discord screenshot of a Shaq post from the complaint. Image: Astrals\n\nAstrals, a Solana-based NFT project, consisted of 10,000 “metaverse-ready” avatars tied to a DAO and a “story-driven, play-to-earn role-playing game,” according to part of the project’s white paper quoted in the complaint. The lawsuit also takes issue with the DAO’s governance token, $GLXY, claiming that it’s an unregistered security too.\n\nTwo large venture capital firms that struck partnerships with Astrals and allegedly traded $GLXY, Cypher Capital and MH Ventures, are mentioned in the complaint. While they are not listed as defendants, Moskowitz noted, he said they will be served as the lawsuit progresses.\n\n“We're not naming them yet, but when we have an opportunity, we're certainly going to serve third-party subpoenas to Cypher Capital in Dubai and MH Ventures in London,” he said.\n\nCypher Capital and MH Ventures did not immediately respond to requests for comment from Decrypt.\n\nIn July, O’Neil’s lawyers asked for the class-action lawsuit to be dismissed, explaining that the digital assets in question were meant for gamers and not investors, per Law 360.\n\nAccording to a court filing in late August, O’Neal’s motion was ultimately denied. The district judge overseeing the case set a September 29 deadline for the basketball star to respond to Thursday’s amended complaint.\n\nAD\n\nAD"
    }
]