[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMjUvYml0Y29pbi1kaXBzLWJlbG93LTI2ay1zbWFsbGVyLWNyeXB0b3MtaGVhZC1sb3dlci1vbi1mZWRzLXBvd2VsbHMtaGF3a2lzaC1yZW1hcmtzL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA4LzI1L2JpdGNvaW4tZGlwcy1iZWxvdy0yNmstc21hbGxlci1jcnlwdG9zLWhlYWQtbG93ZXItb24tZmVkcy1wb3dlbGxzLWhhd2tpc2gtcmVtYXJrcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 25 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Dips Below $26K, Smaller Cryptos Head Lower on Fed's Powell's Hawkish Remarks - CoinDesk",
        "content": "\"It's possible that BTC and the wider crypto market have just entered a consolidation phase and could potentially renew their uptrend in the near future,\" Lin said. \"Looking at the current BTC chart, we can see it has formed a ranging pattern with 25,000 as its lower limit and 31,500 as its upper limit. A sustained break on either side of this range could decide the market's direction for the coming months.\""
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmRtdGMuY29tL21lZGlhL25ld3MvZWRkaWVzLW5ldy1kcmVhbS1zaXRzLWEtcGVyZmVjdC10cmlwLWZpcmVzLWxhdGUtdG8tMjM0MdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 25 Aug 2023 07:00:00 GMT",
        "title": "Eddie's New Dream Sits a Perfect Trip, Fires Late to Capture Solana Beach - Del Mar Thoroughbred Club",
        "content": "Eddie's New Dream © Benoit Photo\n\nReddam Racing’s homebred gray Eddie’s New Dream sat in the garden for virtually all of the one-mile grass run that was Friday’s Solana Beach Stakes at Del Mar, then accelerated come stretch time and pulled away to a length and a quarter tally in the $151,000 California-bred headliner.\n\nThe winner, a 5-year-old daughter of Square Eddie, was registering the eighth victory of her career and earned a first prize of $85,500. She also has eight seconds and four thirds from 26 starts and now has earnings of $705,580.\n\nFinal time for the race was 1:36.16 and the winner returned $7.20 to win for her backers.\n\nEddie’s New Dream was piloted by her regular guy, Mario Gutierrez, and is trained by Ben Cecil.\n\nFinishing second was Nick Alexander’s Rose Maddox, who had a head on Smolich or Smolich’s Chancery Way, who had cut out all the fractions in the affair.\n\nThe track’s popular Pick Six wager was not solved once again and now will offer a carryover of $183,777 heading into Saturday’s 11-race card. First post is 2 p.m.\n\nMARIO GUTIERREZ (Eddie’s New Dream, winner) – “Usually she’s up in the bit, but today she was happy right where she was; nice and relaxed. As she’s gotten older, she’s gotten better. She’s real mature now and she’s real good. She one of those ones that you like to ride.”\n\nJ. PAUL REDDAM (Owner/Breeder) (Eddie’s New Dream, winner) – “We thought the one (horse, Chancery Way) had a lot of speed and the idea was if she broke out of there well we would just track her. Plans rarely work out, but this time they did. It looked to me like he (Gutierrez) measured her well; he didn’t move too early which sometimes, when you think you’re the best, that can happen in a turf race. When she rolled up (alongside the leader) I thought: ‘Ok, here we go.’”\n\nFRACTIONS: :22.92 :47.39 1:12.65 1:24.35 1:36.16\n\nThe stakes win was the first of the meet for both rider Gutierrez and trainer Cecil.\n\nThe stakes win was the first in the Solana Beach for rider Gutierrez, but his 19th overall at Del Mar.\n\nThe stakes win was the second (Poteen in 2019) for trainer Cecil and his 16th overall.\n\nThe winning owner and breeder is J. Paul Reddam of Laguna Beach, CA."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMivAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjUtYXVndXN0LTIwMjMvYXJ0aWNsZXNob3cvMTAzMDU0NjI1LmNtc9IBwAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjUtYXVndXN0LTIwMjMvYW1wX2FydGljbGVzaG93LzEwMzA1NDYyNS5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 25 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $26,000 ahead of US Fed Chair speech at Jackson Hole; Solana, Polygon sh - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nAhead of Federal Reserve Chair Jerome Powell's speech on the economic outlook at a global central bank gathering, crypto tokens were trading in the red on Friday.The global cryptocurrency market cap was trading lower, around $1.05 trillion, falling 1.43% in the last 24 hours. Bitcoin (BTC) fell 1.76% to $26,002, whereas its largest peer, Ethereum, declined nearly 2% to below the $ 1,650 level.Other top crypto tokens, BNB (2%), XRP (2.8%), Cardano (3.1%), Dogecoin (2.7%), Solana (5.5%), Polygon (3.5%), and Shiba Inu (3.2%) were also trading lower on Friday.The crypto market has seen minor selling pressure since yesterday. The crypto fear and greed index has seen some correction as it fell by 2 points since yesterday. The index continues to be in the fear zone with a score of 39/100, Parth Chaturvedi, Investments Lead at CoinSwitch Ventures said.\"The market is looking forward to the US Federal Reserve Chair Jerome Powell’s speech on Friday. Investors are expecting an end to the rate hike cycles, which may impact how the crypto market performs subsequently,\" Parth said.The market cap of Bitcoin, the world's largest cryptocurrency, was around $506 billion. Bitcoin's dominance is currently 48.35%, an increase of 0.04% over the day, according to CoinMarketCap. Meanwhile, BTC volume stood at approximately $12.67 billion, falling 22.94% in the last 24 hours.\"Market dynamics could change due to Jerome Powell's upcoming speech in Jackson Hole, which could affect the crypto markets. A hawkish stance could lower the price of Bitcoin, while a dovish stance could raise it,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.\"Currently above $25,000, Bitcoin has stabilized after the August 18 plunge. Signs of a bullish correction suggest a climb to $27,400 with a potential at $28,650 or even $30,300. Conversely, a bearish reversal could lead to a decline to $24,100 from $25,450,\" he added.BTC's Exponential Moving Average for 10-day and 200-day indicate strong Sell sentiment at 26683 and 27208, respectively. Similarly, the Simple Moving Average for 10-day and 200-day SMA indicates Sell at 26,455 and 27,393, respectively. Simple moving averages show strong Sell sentiments.The Ichimoku Base Line, valued at 27780, shows a Neutral sentiment for quite a long time, whereas the Hull Moving Average indicates a Buy signal at 26164. The Volume Weighted Moving Average at 27600 showed a Sell signal.The MACD Level (12, 26) at -918 indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 26 with a Neutral indicator, while the Williams Percent Range (14) at −83 signals Neutral.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMivAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjUtYXVndXN0LTIwMjMvYXJ0aWNsZXNob3cvMTAzMDU0NjI1LmNtc9IBwAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjUtYXVndXN0LTIwMjMvYW1wX2FydGljbGVzaG93LzEwMzA1NDYyNS5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 25 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds $26,000 ahead of US Fed Chair speech at Jackson Hole; Solana, Polygon sh - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nAhead of Federal Reserve Chair Jerome Powell's speech on the economic outlook at a global central bank gathering, crypto tokens were trading in the red on Friday.The global cryptocurrency market cap was trading lower, around $1.05 trillion, falling 1.43% in the last 24 hours. Bitcoin (BTC) fell 1.76% to $26,002, whereas its largest peer, Ethereum, declined nearly 2% to below the $ 1,650 level.Other top crypto tokens, BNB (2%), XRP (2.8%), Cardano (3.1%), Dogecoin (2.7%), Solana (5.5%), Polygon (3.5%), and Shiba Inu (3.2%) were also trading lower on Friday.The crypto market has seen minor selling pressure since yesterday. The crypto fear and greed index has seen some correction as it fell by 2 points since yesterday. The index continues to be in the fear zone with a score of 39/100, Parth Chaturvedi, Investments Lead at CoinSwitch Ventures said.\"The market is looking forward to the US Federal Reserve Chair Jerome Powell’s speech on Friday. Investors are expecting an end to the rate hike cycles, which may impact how the crypto market performs subsequently,\" Parth said.The market cap of Bitcoin, the world's largest cryptocurrency, was around $506 billion. Bitcoin's dominance is currently 48.35%, an increase of 0.04% over the day, according to CoinMarketCap. Meanwhile, BTC volume stood at approximately $12.67 billion, falling 22.94% in the last 24 hours.\"Market dynamics could change due to Jerome Powell's upcoming speech in Jackson Hole, which could affect the crypto markets. A hawkish stance could lower the price of Bitcoin, while a dovish stance could raise it,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.\"Currently above $25,000, Bitcoin has stabilized after the August 18 plunge. Signs of a bullish correction suggest a climb to $27,400 with a potential at $28,650 or even $30,300. Conversely, a bearish reversal could lead to a decline to $24,100 from $25,450,\" he added.BTC's Exponential Moving Average for 10-day and 200-day indicate strong Sell sentiment at 26683 and 27208, respectively. Similarly, the Simple Moving Average for 10-day and 200-day SMA indicates Sell at 26,455 and 27,393, respectively. Simple moving averages show strong Sell sentiments.The Ichimoku Base Line, valued at 27780, shows a Neutral sentiment for quite a long time, whereas the Hull Moving Average indicates a Buy signal at 26164. The Volume Weighted Moving Average at 27600 showed a Sell signal.The MACD Level (12, 26) at -918 indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 26 with a Neutral indicator, while the Williams Percent Range (14) at −83 signals Neutral.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3Qvd2lsbC1zb2xhbmEtYm91bmNlLWJhY2vSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 25 Aug 2023 07:00:00 GMT",
        "title": "Will Solana Bounce Back? - BSC NEWS",
        "content": "SOL\n\nSolana has shown promising signs of making a recovery in the industry. However, with the market’s volatility, users should exercise caution.\n\nSummary\n\nSolana endured a challenging 2022, facing network troubles and NFT departures that led to a significant drop in SOL's price.\n\nPromising indicators suggest a potential recovery for Solana, with improved scalability, a thriving DeFi and NFT ecosystem, and strong developer and investor support.\n\nDespite positive signs, caution is advised due to market volatility. Solana's rebound remains uncertain, though it stands poised to attract new users and developers.\n\nSolana faced a tough year in 2022, encountering network outages, links to the FTX crypto exchange's collapse, and the departure of NFT collections like DeGods and y00ts to other blockchains. Consequently, the SOL price plummeted by over 90% from its peak of $260.06.\n\nThat said, there have been some promising signs for optimism as the protocol looks to re-establish itself as a leading player in the Layer 1 ecosystem. As of writing, Solana trades at $20.70, but is there a chance for a potential bull run? This article explores the blockchain’s progress and potential for a positive recovery.\n\nReasons for optimism around Solana\n\n1. Enhanced Scalability and Reliability\n\nSolana has taken significant strides in improving its scalability and reliability. Transactions per second (TPS) have notably increased, and the network has enjoyed months free of significant outages.\n\nSolana maintained 4K+ TPS in the last seven days | Solscan\n\n2. Thriving DeFi and NFT Ecosystem\n\nSolana remains a favored platform for DeFi and NFT projects. Its vibrant community of developers and users keeps it bustling with activity.\n\n‍\n\n3. Strong Developer and Investor Support\n\nA robust team of developers and investors backs Solana, with the Solana Foundation dedicated to long-term project success.\n\nPositive Indicators in Recent Months\n\nSolana has recently exhibited some impressive metrics. Solana’s TVL has recovered somewhat from lows of around $200 million, in late 2022, to now reach approximately the $310 million mark, according to data from DefiLlama. Certainly, this remains magnitudes lower than highs of more than $10 billion in November 2022, but a more than 50% increase in just a handful of months is no small feat.\n\nAdditionally, the count of daily active addresses on Solana has been encouraging, with over 240,000 active wallet addresses recorded in a week. The Layer1 blockchain, designed for mass adoption, also observed more than 350,000 unique wallet addresses interacting with it sometime in August.\n\nNumber of daily active addresses in the last seven days | Solscan\n\nThe Path Ahead for Solana\n\nThese positive trends position Solana as a prominent player in the blockchain ecosystem. Still, it's premature to determine if the project will fully recover from past setbacks. The market's volatility and various influencing factors could sway SOL's price.\n\nNonetheless, Solana is poised to attract new users and developers, reestablishing its influence in the DeFi and NFT sectors.\n\nBalancing Optimism with Caution\n\nOverall, a mix of optimism and caution shrouds Solana's future. While its potential is evident, challenges need overcoming for it to thrive truly. Time holds the key to whether Solana can achieve a rebound in 2023 and beyond."
    }
]