[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZGVjcnlwdC5jby8yMDcxMzMvYm9uay1jb2luLXRva2VuLXNvbGFuYS1tZW1lLWNvaW4tYmluYW5jZdIBSGh0dHBzOi8vZGVjcnlwdC5jby8yMDcxMzMvYm9uay1jb2luLXRva2VuLXNvbGFuYS1tZW1lLWNvaW4tYmluYW5jZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "Solana Meme Coin BONK Up 25% As It Gains Binance Listing - Decrypt",
        "content": "We do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt appears every dog shall have its moon, as well as its day, as BONK—a meme coin on the Solana network that saw a huge jump in value earlier this week—rose even higher today, logging a more than 25% spike, according to CoinGecko.\n\nThe pump comes as Binance, the world's largest cryptocurrency exchange, announced that it will be launching a BONK futures offering—1000BONK—along with one for PYTH, a decentralized finance (DeFI) network of oracles that made waves with a 255 million PYTH token air drop.\n\nFor the two buzziest coins on Solana to land Binance listings is notable, given that the exchange recently lost its high-profile CEO, and has seen over $1 billion in outflows since. Industry watchers are calling the BONK and PYTH moves an early market-making play by new Binance CEO Richard Teng.\n\n\"Binance Futures will launch the USDⓈ-M 1000BONK and PYTH Perpetual Contracts at 2023-11-22 14:00 (UTC) and 2023-11-22 14:30 (UTC) respectively, with up to 50x leverage,\" the company said, sharing details on both.\n\nAD\n\nAD\n\nBONK is barely within the top 250 cryptocurrencies by market cap, which stands at $197 million as of this writing, trading at $0.00000459. But it set an all-time high on Monday with a 1,700% boom.\n\nIts popularity would appear to be riding the coat-tails of which has seen a surge in the price of SOL as developers redeiscover the blockchain's strengths. But while SOL was up by 90% over the last 30 days, the network’s top meme coin, BONK, saw even bigger gains."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvc29sYW5hLWNoYXRncHQtcHJlZGljdHMtc29sLXRvLXJpc2UtNzAwLWFuZC1oaXQtNTAw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "Solana: ChatGPT Predicts SOL to Rise 700% and Hit $500 - Watcher Guru",
        "content": "Solana (SOL) has emerged as one of the best-performing cryptos in 2023. Since January, the token has risen by over 500%, more than triple Bitcoin’s (BTC) 124% growth in the same time frame. SOL’s growth this year is especially commendable, given that it was one of the worst-affected projects due to the collapse of FTX in November 2022.\n\nAlso Read: Solana: SOL Continues to See Fund Inflows as Price Spikes 36%\n\nHowever, this might not be the end of SOL’s incredible run. According to OpenAi’s AI (Artificial Intelligence) chatbot, ChatGPT, the token might rise 700% in 2024. According to the chatbot, SOL could hit a price of $500 as early as next year.\n\nWhat will push Solana’s price in 2024?\n\nSource – Wealth Mastery\n\nAccording to ChatGPT, bullish market trends and widespread adoption of Solana’s blockchain technology will push its price in 2024. Moreover, reaching $500 would mean over 90% growth from SOL’s all-time high of $259, which it attained in November 2021.\n\nAdditionally, investment firm VanEck has predicted a bullish outlook for SOL in the long run. The firm anticipates the crypto to surge by 7600% by the end of this decade. Meanwhile, VanEck expects Ethereum (ETH) to reach a price of $11,800, a growth of about 475% from current levels.\n\nAlso Read: Solana (SOL) Could Surge 7600% by 2030: Predicts VanEck.\n\nAdditionally, analysts and experts expect another bull run for the crypto market in early 2024. Bitcoin (BTC) will undergo its next halving cycle in April 2024, which is considered bullish for the market. Moreover, industry experts anticipate that the SEC (Securities and Exchange Commission) will approve a spot BTC ETF (Exchange Traded Fund) in 2024. Both developments could usher in another bull run, like that of late-2021. BTC and other major cryptos, such as Solana (SOL), Ethereum (ETH), etc., might hit new all-time highs."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8yMi90cmFkZXItdW52ZWlscy1idWxsLW1hcmtldC1wcmljZS10YXJnZXRzLWZvci1iaXRjb2luLWV0aGVyZXVtLXNvbGFuYS1hbmQtdHdvLWFkZGl0aW9uYWwtYWx0Y29pbnMv0gGGAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzIyL3RyYWRlci11bnZlaWxzLWJ1bGwtbWFya2V0LXByaWNlLXRhcmdldHMtZm9yLWJpdGNvaW4tZXRoZXJldW0tc29sYW5hLWFuZC10d28tYWRkaXRpb25hbC1hbHRjb2lucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "Trader Unveils Bull Market Price Targets for Bitcoin, Ethereum, Solana and Two Additional Altcoins - The Daily Hodl",
        "content": "A closely followed crypto analyst is sharing his price targets for Bitcoin (BTC) and four other digital assets.\n\nPseudonymous analyst Inmortal tells his 201,000 followers on the social media platform X that Bitcoin could soar by more than 255% from its current value in the next bull market.\n\nHe also says that Ethereum (ETH) could soar more than 393% from its current value and ETH competitor Solana (SOL) could soar more than 813% from its current value.\n\nLastly, the trader predicts decentralized oracle provider Chainlink (LINK) could soar more than 1,190% from its current value, and 0x0.ai (0x0), an AI-powered smart contract auditor, could soar more than 3,378% from its current value.\n\n“I don’t usually do this, but here it goes. Bull run (2024-2025) predictions:\n\nBTC: $131,000\n\nETH: $9,800\n\nSOL: $490\n\n0x0: $4\n\nLINK: $180.”\n\nLooking at Ethereum, the trader predicts that ETH will soon take out recent high prices and cross the $2,100 level within days.\n\n“Sweep the highs first.”\n\nHe also predicts that 0x0 will continue its strong performance against Wrapped Ethereum (0x0/WETH) and hit 0.00110 WETH in early 2024, up from its current value of 0.0000557 WETH.\n\n“Casual +70% up move in one week.\n\nAnother normal day for 0x0 holders.”\n\nBitcoin is trading for $36,851 at time of writing, down 1.8% in the last 24 hours. Meanwhile, Ethereum is trading for $1,985 at time of writing, down 2.2% in the last 24 hours.\n\nSolana is trading for $53.66 at time of writing, down 5.8% in the last 24 hours, while Chainlink is trading for $13.95 at time of writing, down 4.5% in the last 24 hours.\n\n0x0 is trading for $0.115 at time of writing, down 13.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vcHl0aC1haXJkcm9wLXRyaWdnZXJzLXN1cmdlLWluLWtleS1zb2xhbmEtbWV0cmljcy_SAVBodHRwczovL2VuZy5hbWJjcnlwdG8uY29tL3B5dGgtYWlyZHJvcC10cmlnZ2Vycy1zdXJnZS1pbi1rZXktc29sYW5hLW1ldHJpY3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "PYTH airdrop triggers surge in key Solana metrics - AMBCrypto English",
        "content": "PYTH announced an airdrop of around 250 million tokens.\n\nThe Solana network saw a surge in the number of new token addresses.\n\nA newly introduced token on the Solana [SOL] network recently conducted an airdrop for eligible users. This event had effects on some key metrics within the Solana ecosystem.\n\nAdditionally, it is interesting to see how the network managed this latest development as the number of users increased.\n\nPYTH on Solana\n\nOn 20th November, Pyth, a decentralized finance (DeFi) oracle network, initiated an airdrop for its PYTH token. Notably built on the Solana blockchain, the airdrop attracted attention and interest in the Solana network.\n\nAs per CoinMarketCap, the self-reported circulating supply of the PYTH token was around 1.5 billion, with a total supply of 10 billion.\n\nReportedly, around 250 million tokens were allocated for the airdrop. In light of these developments, how did the Solana network respond to this event?\n\nVolume and fees see uptrends on Solana\n\nAn analysis of the volume chart on DefiLlama revealed a recent rise in Solana’s trading activity. On 20th November, coinciding with the airdrop announcement, the volume rose to around $392 million.\n\nAs of this writing, there has been a continued rise in volume over the last 24 hours, surpassing $490 million. Notably, the highest volume observed in recent months was around $466 million on 11h November.\n\nIn addition to increased trading volume, the network’s fees have also increased in the past few days.\n\nNotably, on 20th November, the total fees reached over $130,000, marking the highest point in the year. As of this writing, fees in the last 24 hours have remained high and were around $123,000.\n\nThe data suggested a remarkable impact on the network. This is considering the increased volume and fees coinciding with the PYTH token airdrop.\n\nNew token addresses surge as network remains stable\n\nAMBCrypto’s examination of Solscan showed that the recent developments have had a notable impact on the new token chart.\n\nThe analysis highlighted a substantial increase in the number of new token accounts. Over the past three months, the peak number of new token accounts observed was around 391,000.\n\nHowever, on 20th November, this figure rose to over 593,000, marking the highest count.\n\nAlso, the number of active wallets reached the second-highest point in the last three months, surpassing 438,000 as of the latest data.\n\nFurthermore, a review of Solana’s uptime status revealed consistent stability over the past three months.\n\nRead Solana ( SOL) Price Prediction 2023-24\n\nThe uptime extends the number of months without significant downtimes, reducing concerns previously associated with the network’s performance.\n\nAs of this writing, Solana was experiencing a 5% increase in its value, trading at around $54.5."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL2NyeXB0b25ld3MuY29tL25ld3Mvc29sYW5hLXByaWNlLXByZWRpY3Rpb24tYXMtc29sLXRvcHMtYWx0Y29pbi1mdW5kLWluZmxvdy13aXRoLTEzLTYtbWlsbGlvbi1sYXN0LXdlZWstaXMtc29sLXRoZS1uZXctaW52ZXN0b3ItZmF2b3JpdGUuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Nov 2023 08:00:00 GMT",
        "title": "Solana Price Prediction as SOL Tops Altcoin Fund Inflow with $13.6 Million Last Week – Is SOL the New Investor ... - Cryptonews",
        "content": "Solana Price Prediction as SOL Tops Altcoin Fund Inflow with $13.6 Million Last Week – Is SOL the New Investor Favorite?\n\nThe Solana price has dipped by 3% in the past 24 hours, dropping to $54.67 after Binance’s settlement with the US Department of Justice sent the entire market lower yesterday.\n\nSOL is now down by 8.5% in the past week, yet the altcoin remains up by 26% in the past fortnight and by an impressive 84% in the last 30 days.\n\nIt has even risen by more than 400% since the beginning of the year, and with Solana continuing to top the leaderboard for altcoin fund inflows, it will likely see further gains in the coming weeks.\n\nSolana Price Prediction as SOL Tops Altcoin Fund Inflow with $13.6 Million Last Week – Is SOL the New Investor Favorite?\n\n\n\nCompared to many other tokens today, SOL’s chart and indicators continue to look relatively healthy, even with yesterday’s slip.\n\nIts RSI (purple) is already close to 60 again after dropping overnight, suggesting that buying pressure remains with the altcoin and is likely to continue climbing soon enough.\n\nIt’s also encouraging that SOL’s 30-day average (yellow) is still climbing above than its 200-day average (blue), a sign that the coin is likely to continue pushing towards higher levels for the foreseeable future.\n\nThere are other positive signs, including the coin’s 24-hour trading volume, which remains high at $2.5 billion.\n\nIt’s likely that much of this increased volume stems from funds, which have shown a growing demand for SOL over the past few weeks.\n\nIndeed, SOL witnesses the highest weekly fund inflows of any altcoin, with the latest CoinShares report showing that it attracted $13.6 million in fund inflows last week.\n\n🚀 Solana's investment products soar with a 500% increase this year, attracting $135m! Last week alone saw $13.6m inflows, outshining other altcoins as $SOL jumps 115% in 30 days. Meanwhile, Bitcoin remains dominant with $154.7m. Diversified crypto investments? Up by $7.9m.… — BlockVoyager (@BlockVoyagerAIO) November 21, 2023\n\nThis compares favorably to $3.3 million Ethereum received, with only Bitcoin (BTC) – at $154.7 million – beating it.\n\nAs such, SOL is likely to continue rising healthily once the market regains a more positive outlook.\n\nAt the moment, Binance’s settlement with the DoJ has dampened the mood, pulling SOL down along with most other tokens.\n\nYet the overall picture remains very positive for SOL, which has had an excellent 2023.\n\nTo some extent, its gains are a product of it making for a very poor 2022, during which it suffered a series of outages that damaged its reputation.\n\nsolana has flawlessly sustained 100% uptime for almost nine consecutive months what was once a 'joke' is now hardly a valid argument those hating on $sol will find themselves left behind as it continues to dominate in the bull market pic.twitter.com/qZg8Onm3m3 — buckets | sandbar.io 🏝️ (@SOLbuckets) November 21, 2023\n\nYet it has now enjoyed 100% uptime for close to nine consecutive months, a sign of how much updates have improved its efficiency and resilience.\n\nBased on this, the Solana price is likely to reach $60 in the next couple of weeks and potentially end the year at around $80.\n\nOther Strong Altcoins\n\n\n\nSOL isn’t the only promising alt in the market right now, with a number of newer coins – including presale tokens – looking like they could rally in the next few weeks.\n\nOne prime candidate to do this is Bitcoin Minetrix (BTCMTX), a stake-to-mine platform that has raised over $4.2 million in its ongoing presale.\n\nThis figure stands as a big vote of confidence in Bitcoin Minetrix, which will enable users to mine Bitcoin (BTC) by staking its native BTCMTX token.\n\nStaking BTCMTX provides users with mining credits, which they can spend on actual Bitcoin mining.\n\nDoing this enough will earn them freshly mined BTC, something which is likely to widen and democratize access to Bitcoin mining.\n\nIn addition, staking also earns users newly issued BTCMTX as well, meaning that Bitcoin Minetrix could end up being a highly lucrative platform for users.\n\n#BitcoinMinetrix imagines a renewed cloud mining landscape that merges ownership and cloud mining. Through transparency, independence, and safety, #BitcoinMinetrix aims to lead tokenized cloud mining, providing a reliable $BTC mining path for everyone. 🌐⚒️ pic.twitter.com/SOETy3de0a — Bitcoinminetrix (@bitcoinminetrix) November 21, 2023\n\nTo join the presale, investors need simply go to the official Bitcoin Minetrix website and connect their software wallets.\n\nThe sale is currently in its penultimate stage, with 1 BTCMTX costing $0.0118.\n\nThis will move $0.0119 by the sale’s final stage, which begins in just under five days.\n\nAnd once the final stage is over, BTCMTX will list on exchanges, where it could potentially rally big.\n\nVisit Bitcoin Minetrix Now\n\nDisclaimer: Crypto is a high-risk asset class. This article is provided for informational purposes and does not constitute investment advice. You could lose all of your capital."
    }
]