[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LjEwbmV3cy5jb20vbmV3cy9sb2NhbC1uZXdzL25vcnRoLWNvdW50eS1uZXdzL2NvYXN0LWd1YXJkLWFwcHJlaGVuZHMtMTMtb24tY3Jvd2RlZC12ZXNzZWwtbmVhci1zb2xhbmEtYmVhY2gtY29hc3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "Coast Guard apprehends 14 on crowded vessel near Solana Beach coast - ABC 10 News San Diego KGTV",
        "content": "SOLANA BEACH, Calif. (KGTV) — The United States Coast Guard says it caught 13 undocumented migrants trying to enter the United States on a small boat in San Diego County on Thursday.\n\nAccording to the agency, they received a report from California State Parks around 10:30 a.m. about a vessel trying to land near Carlsbad.\n\nThe boat was blocked by local police and lifeguards in the area, causing it to continue southbound and make another attempt at landing north of Del Mar at Fletcher Cove, officials said.\n\nFor unknown reasons, the vessel became disabled around 100 yards from the shore, and someone jumped into the water.\n\nThat person was apprehended by lifeguards and turned over to Border Patrol. It is unclear if they were a migrant or a U.S. native.\n\nThe Coast Guard told ABC 10News they launched a small boat to the scene and apprehended 13 people in the vessel. Those individuals were also handed over to Border Patrol, who seized the vessel as well.\n\nLocal police, Solana Beach and State lifeguards, San Clemente Border Patrol, and the Marine Task Force assisted with the incident."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb2xhbmEtMS0wMDAtc2FnYS1waG9uZS0wMzUyMTE3ODguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "Solana's $1,000 Saga Phone Sees Price Reduction by $400 To “Get Wider Adoption” - Yahoo Finance",
        "content": "Solana’s $1,000 Saga Phone Sees Price Reduction by $400 To “Get Wider Adoption”\n\nSolana’s Saga Phone Sees Price Reduction\n\nThe cost of Solana Saga, an Android-based smartphone made by Solana Mobile, has been significantly reduced from its original $1,000 price to $599.\n\nSolana Mobile, a division of Solana Labs, announced on X stating that it wants to encourage further adoption of mobile web3 and improve the experience for the Solana mobile community,\n\nHowever, according to Flipside Crypto, data indicates a decline in Solana Saga sales since its peak in April and May. Since launching at the end of April, there are a total of 2,200 Saga Genesis NFT owners, which represents the number of Solana Sagas that had been activated.\n\nEmmett Hollyer, Head of Business Operations at Solana Mobile, noted that such price reductions are common practice in the consumer electronics sector, with the goal of promoting customer adoption.\n\nTwitter users responded differently, with some criticizing the price drop and others endorsing it. The justifications of early adopters included paying a premium and receiving exclusive NFTs, such Claynosaurz, which can make up for the price difference.\n\nThe Solana Saga smartphone's native app store initially included 16 decentralized applications, giving customers a mobile-first method of managing their crypto and NFT holdings."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb2xhbmEtMS0wMDAtc2FnYS1waG9uZS0wMzUyMTE3ODguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "Solana's $1,000 Saga Phone Sees Price Reduction by $400 To “Get Wider Adoption” - Yahoo Finance",
        "content": "Solana’s $1,000 Saga Phone Sees Price Reduction by $400 To “Get Wider Adoption”\n\nSolana’s Saga Phone Sees Price Reduction\n\nThe cost of Solana Saga, an Android-based smartphone made by Solana Mobile, has been significantly reduced from its original $1,000 price to $599.\n\nSolana Mobile, a division of Solana Labs, announced on X stating that it wants to encourage further adoption of mobile web3 and improve the experience for the Solana mobile community,\n\nHowever, according to Flipside Crypto, data indicates a decline in Solana Saga sales since its peak in April and May. Since launching at the end of April, there are a total of 2,200 Saga Genesis NFT owners, which represents the number of Solana Sagas that had been activated.\n\nEmmett Hollyer, Head of Business Operations at Solana Mobile, noted that such price reductions are common practice in the consumer electronics sector, with the goal of promoting customer adoption.\n\nTwitter users responded differently, with some criticizing the price drop and others endorsing it. The justifications of early adopters included paying a premium and receiving exclusive NFTs, such Claynosaurz, which can make up for the price difference.\n\nThe Solana Saga smartphone's native app store initially included 16 decentralized applications, giving customers a mobile-first method of managing their crypto and NFT holdings."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jYnM4LmNvbS9hcnRpY2xlL25ld3MvbG9jYWwvbWVuLXRha2VuLWludG8tY3VzdG9keS1vZmZzaG9yZS1vZi1zb2xhbmEtYmVhY2gvNTA5LTVkMzFhMmVkLTExNTctNDYzMy04NzIwLWEwOTBmYjliYTY1ONIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "Several people detained on boat offshore of Solana Beach - CBS News 8",
        "content": "The United States Coast Guard detained approximately 14 men who were found on a seemingly disabled boat off the coast of Solana Beach.\n\nExample video title will go here for this video\n\nNext up in 5\n\nExample video title will go here for this video\n\nNext up in 5\n\nSAN DIEGO — Several people were detained offshore at Solana Beach after authorities discovered them onboard a small boat reported to authorities as \"capsized\" late Thursday morning.\n\nAccording to the U.S. Coast Guard, around 10:30 a.m., state park employees notified them about a vessel attempting to beach near Carlsbad. However, the 18-foot boat continued southbound instead and tried to land near Fletcher Cove.\n\nOfficials said the boat became disabled about 100 yards offshore.\n\nOne person jumped into the water. Solana Beach Lifeguards picked him up and handed him to U.S. Customs and Border Protection.\n\nVideo from Chopper 8 showed authorities examining the boat and circling it in the water until the U.S. Coast Guard approached about 15 minutes later.\n\nSeveral men emerged from the boat's hull, were transferred onto the U.S. Coast Guard vessel, searched, and detained.\n\nU.S. Customs and Border Protection said they responded to detain about 14 people.\n\nA witness said lifeguards announced over a loudspeaker for the boat to back from the shore as they were too close.\n\n\"Once all those people just appeared on the deck of the boat, I did not know what the heck was happening,\" said Sean Kennedy, who was at the beach with his family.\n\nA CBS 8 photojournalist waiting on the shoreline for the boat to be tugged in said U.S. Customs and Border Protection agents were parked alongside Solana Beach and Encinitas Fire Department trucks who had also responded to the call for help.\n\nIt's unknown where the boat originated from.\n\nThe situation is under investigation."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3NvbGFuYS1zYWdhLXBob25lLXByaWNlLWN1dNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 10 Aug 2023 07:00:00 GMT",
        "title": "Solana cuts price of its Saga phone by 40% four months after launch - Blockworks",
        "content": "The Android-based Solana Saga has seen a significant price reduction from its iPhone-like starting price of $1,000 down to $599.\n\nSolana Mobile, a subsidiary of Solana Labs, announced the news via Twitter on Wednesday. The company said the $400 cut is “the next step to get wider adoption of mobile web3 and continue to improve the experience for the Solana mobile community.”\n\nThe numbers tell a slightly different story.\n\nOn-chain data compiled by Flipside Crypto shows that sales for the Solana Saga have come down massively since their April and May highs.\n\nThe data tracks the number of Saga Genesis NFT mints, something that occurs when the owner of a Solana Saga sets up their phone and the Solana app store.\n\nAs of July 25, there are slightly more than 2,100 unique Saga Genesis NFT owners. This suggests that approximately this many Solana Sagas have been activated since early April.\n\nEmmett Hollyer, the head of business operations for Solana Mobile, told Blockworks that price cuts like this are standard in the industry.\n\n“Implementing a price reduction several months after launch is common practice in the consumer electronics business, particularly with smartphones,” Hollyer said.\n\n“A lower price will accelerate user adoption,” he added.\n\nTwitter users who say they purchased the Solana Saga at the $1,000 price point voiced their frustration with Solana’s decision. Others showed support for the price reduction.\n\nOne user said they regretted buying the phone and said this was a “terrible look.”\n\nLoading Tweet..\n\nIn the replies to that tweet, some argued that early adopters often pay a premium. In this case, that would be the people who bought the first 2,000 Solana Sagas.\n\nOther argued that early owners of the phone were able to mint exclusive Claynosaurz NFTs. The floor price for one of these collectibles on Magic Eden is about 33 SOL, which equates to over $800. This more than covers the price differential of $400.\n\nLoading Tweet..\n\nThe first rumblings of the Solana Saga occurred way back in June 2022, when the company unveiled their plan to give people an opportunity to manage their crypto and NFT holdings from a mobile device.\n\n“We live our lives on our mobile devices — except for Web3 because there hasn’t been a mobile-centric approach to private key management,” Solana co-founder Anatoly Yakovenko told Blockworks at the time.\n\nThe phone launched in April, starting out with 16 decentralized apps on its native app store, including Audius, Dialect, Jupiter Aggregator, Ledger and Magic Eden among others.\n\nUpdated Aug. 10, 2023 at 4:36 pm ET: Added comment from Emmett Hollyer, the head of business operations for Solana Mobile.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    }
]