[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3NvbGFuYS1wcmljZS1jb3VsZC1oaXQtdGhyZWUtZGlnaXRzLWluLTIwMjQtYW5hbHlzdC1zaGFyZXMtYnVsbGlzaC1vdXRsb29rLW9uLXNvbC0yMDIzMTEyNTEzMDDSAZEBaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3Mvc29sYW5hLXByaWNlLWNvdWxkLWhpdC10aHJlZS1kaWdpdHMtaW4tMjAyNC1hbmFseXN0LXNoYXJlcy1idWxsaXNoLW91dGxvb2stb24tc29sLTIwMjMxMTI1MTMwMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "Solana price could hit three digits in 2024, analyst shares bullish outlook on SOL - FXStreet",
        "content": "Solana monthly volume exceeds $6 billion, supporting ongoing SOL price rally.\n\nCrypto analyst Altcoin Sherpa predicted a massive surge in SOL price in 2024.\n\nSOL price could retrace to sub-$50 level, before another leg up.\n\nSolana, one of the largest competitors of Ethereum, is currently experiencing a surge in its price. SOL rallied to $68.21, its highest level in 2023 and the altcoin is primed for further gains, according to a pseudonymous crypto analyst.\n\nAlso read: Ethereum whale activity could pave way for ETH price to hit new yearly highs\n\nSolana price hits 2023 peak in November\n\nSolana price is in an uptrend that started in mid-October 2023. The altcoin’s price climbed steadily in the past month, hitting its 2023 peak of $68.21 on November 16, before commencing a correction.\n\nAt the time of writing, SOL price is $58.07, the altcoin is trending sideways close to the $60 psychological level. The breakthrough past $60 was key to SOL price rallying to a yearly high. SOL price is above its three long-term Exponential Moving Averages (EMAs), 10, 50 and 200-day at $56.53, $43.25 and $29.51.\n\nIf SOL price sustains above the 10-day EMA, the altcoin is likely to continue its climb. A decline below the 10-day EMA could invalidate the bullish thesis for Solana.\n\nSOL/USDT 1-day chart\n\nAnalyst predicts SOL price rally to three digits in 2024\n\nCrypto analyst behind the X handle @AltcoinSherpa is bullish on SOL. The analyst evaluated the SOL price trend and commented that they expect the SOL price to correct and a sub-$50 entry would be ideal.\n\nAccording to @AltcoinSherpa, SOL price is likely to hit three digits in 2024, a massive surge in the Ethereum-alternative token."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzI1L3NvbGFuYS1jb21wZXRpdG9yLWV4cGxvZGVzLW92ZXItMTEwLWluLXR3by13ZWVrcy1hbWlkLW5ldy1pbnZlc3RtZW50LWZyb20tdXNkYy1pc3N1ZXItY2lyY2xlL9IBggFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8yNS9zb2xhbmEtY29tcGV0aXRvci1leHBsb2Rlcy1vdmVyLTExMC1pbi10d28td2Vla3MtYW1pZC1uZXctaW52ZXN0bWVudC1mcm9tLXVzZGMtaXNzdWVyLWNpcmNsZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "Solana Competitor Explodes Over 110% in Two Weeks Amid New Investment From USDC Issuer Circle - The Daily Hodl",
        "content": "A Solana (SOL) competitor is suddenly soaring amid news that stablecoin issuer Circle (USDC) is investing in the blockchain project.\n\nThe Sei Network (SEI), the new layer-1 blockchain that claims to be a blockchain faster than Solana, reached a high of $0.250 after the Circle announcement, a more than 110% increase from its value of $0.118 on November 10th.\n\nCircle said they were investing in the SEI network to expand use cases for USDC, its dollar-pegged digital asset.\n\nSEI has slightly retraced and is trading for $0.239 at time of writing.\n\nSaid SEI,\n\n“SEI is designed specifically to address the primary use case of cryptocurrency – the exchange of digital assets. This blockchain isn’t just fast; it’s the fastest, achieving 390ms time to finality and boasts unparalleled speed.\n\nThrough integration with SEI, USDC will provide developers and entrepreneurs around the world something they’ve never had before: the ability to build products and commerce on an open platform globally, quickly, and cheaply with instantaneous transaction settlement.”\n\nAccording to SEI, its trading-focused blockchain network is faster than Solana’s based on certain key data.\n\nSEI says its transaction finality on its blockchain is 500 milliseconds whereas Solana’s transaction finality is around 2.5 seconds. SEI also compares its transactional throughput with Solana by saying Sei Network has the capability of 20,000 orders per second (ops) and Solana can handle 10,000 transactions per second (tps).\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZmluYm9sZC5jb20vd2hhdC1pZi1hdmFsYW5jaGUtYXZheC1oYWQtc29sYW5hcy1zb2wtbWFya2V0LWNhcC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "What if Avalanche (AVAX) had Solana's (SOL) market cap? - Finbold - Finance in Bold",
        "content": "In the speculative market, the asymmetry between fundamental aspects and the market’s perception of value is what creates opportunity. Cryptocurrency investors can benefit from finding asymmetries and positioning accordingly.\n\nInterestingly, Avalanche (AVAX) has one of the largest Total Value Locked (TVL) in DeFi, with a suggested asymmetry to its market capitalization. In particular, it gets stronger when comparing Solana’s (SOL) higher market cap and lower TVL.\n\nIt is important to understand that value investing involves many nuances, and investors must consider multiple factors when fundamentally evaluating projects. However, Finbold picked TVL as a benchmark to provide insights on a possible value asymmetry in the cryptocurrency market.\n\nIn this context, TheCoinPerspective shows that AVAX would be priced at $66.71 if Avalanche had Solana’s $24.4 billion market capitalization. This would result in an upside of 222%, considering a price of $20.75 per AVAX by press time.\n\nAvalanche (AVAX) vs. Solana (SOL) market cap. Source: TheCoinPerspective\n\nAvalanche and Solana’s TVL to measure market cap\n\nThe two competitors are aiming to meet a similar demand for layer-1 blockchains to Decentralized Apps (DApps), Decentralized Finance, and Web3. Therefore, we can use the total value locked in Avalanche and Solana to spot potential asymmetries on the market cap.\n\nSolana’s TVL surged by 73.19% in one month to $620.2 million, giving it the 8th highest value, according to DefiLlama. Notably, Avalanche still has a higher $652.17 million TVL for a smaller monthly growth of 22.37%.\n\nThis means that investors are locking $32 million more value in the Avalanche ecosystem of 346 protocols than in Solana’s 115.\n\nTotal value locked for each chain. Source: DefiLlama\n\nFrom another perspective, AVAX has $16.81 billion less capitalization than SOL, with a $7.59 billion market cap for the former. Essentially, Avalanche has an 11.75 market cap for each TVL, while Solana has 39.88 MCap/TVL. Looking at this metric alone, AVAX could be 3.4 times cheaper than SOL at the time of publication.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLWV5ZXMtZGFuZ2Vyb3VzLWJyZWFrdGhyb3VnaNIBOmh0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLWV5ZXMtZGFuZ2Vyb3VzLWJyZWFrdGhyb3VnaD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "Solana (SOL) Eyes Dangerous Breakthrough - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSolana (SOL) is eyeing a dangerous breakthrough since it fell below the $60 support zone on Nov. 20. At the time of writing, Solana is trading at a price of $58.21, up 2.36% in the past 24 hours. The core Solana metrics are bullish and suggest recapturing the $60 price level is imminent in the near term.\n\nAdvertisement\n\nSince Solana was rejuvenated this year, its price has been on a meteoric rise that saw it push past the psychologically important threshold at $60 on Nov. 15. Bears did not allow Solana to form a support above this threshold, and as such, it lost its grip and retraced back to a low of $51.6 on Nov. 22.\n\nThe attempt to reclaim $60 has become a key hurdle that SOL bulls have been unable to work their way past in recent times. With the current outlook and resolve as showcased in the 6.64% jump in trading volume to $1,374,937,101, a consistent increase in the trading volume is a sign retail investors are flooding the market. Notably, their presence can help stabilize the price as SOL makes an attempt to reclaim its lost mandate.\n\nSolana (SOL) price riding on history\n\nWhile in the immediate term, the $60 price target may seem an ambitious level to breach, it is worth noting that Solana has traded at a level far higher than this in the past. Prior to the FTX collapse of 2022, Solana traded at an all-time high (ATH) of $260. This implies that the ultimate goal is to retest this ATH by first conquering as many immediate price levels as possible.\n\nSolana is no longer tied to the pangs or negative impacts of the FTX implosion, and though the bankrupt exchange continues to sell off the coin in its liquidation spree, Solana has made a crucial anchor that naturally attracts other liquidity to it."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmhlcmFsZG5ldC5jb20vbGlmZS9ob21lLWZvci10aGUtaG9saWRheXMtd2l0aC10aGUtZ290aGFyZC1zaXN0ZXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Nov 2023 08:00:00 GMT",
        "title": "Home for the holidays with the Gothard Sisters | HeraldNet.com - The Daily Herald",
        "content": "The Edmonds trio brings tidings of Celtic comfort and joy with a new Christmas album and concert\n\nSisters Greta, Willow and Solana Gothard have been playing music together since childhood, expanding from early violin lessons to playing guitar, mandolin, djembe, bodhran and more alongside vocal harmonies. (Ruth H Photography)\n\nBy Sara Bruestle / Special to The Herald\n\nThe Gothard Sisters are back home in Edmonds for their annual Celtic-inspired Christmas concert — this time with a new Christmas album.\n\nSisters Greta, 36, Willow, 34, and Solana, 28, are award-winning singer-songwriters, talented multi-instrumentalists and championship Irish dancers with an international following.\n\nThe world-traveling trio has played over 2,000 live shows around the globe, including performing aboard seven Disney cruises and two tours in Japan.\n\nToday, they perform three annual U.S. tours: a St. Patrick’s Day tour, a summer tour and a Christmas tour.\n\nThe Gothard Sisters will play their not-to-be-missed Christmas show Dec. 7 at the Edmonds Center for the Arts.\n\nThe threesome play a festive mix of Christmas carols and Celtic tunes, both originals and covers. They switch instruments often, break out into Irish dance and even have the audience do a sing-along or two. As is tradition, they’ll invite a local Irish dance school to perform with them on stage.\n\n“We love Christmas,” Greta Gothard said. “We love all the traditions that go along with it, the festive spirit in the wintertime, that the holiday is just so full of joy and light.”\n\n“A Celtic Christmas,” to be released on Nov. 10, is a 12-track recording featuring “Angels We Have Heard on High,” “O Come, O Come, Emmanuel,” “I Saw Three Ships,” “Away in a Manger” and “Deck the Halls.”\n\nThe new album “A Celtic Christmas” is the sisters’ 10th, featuring a selection of traditional carols rendered in the band’s signature, ethereal style. They’ll perform live Dec. 7 in Edmonds. (Knecht Creative)\n\nThe Gothard Sisters have put out 10 albums in all — including three other Christmas recordings — in their 14 years performing, touring and writing as a Celtic-folk trio. “A Celtic Christmas” is the first Christmas album they’ve recorded and produced on their own.\n\n“We’ve had more modern Christmas songs on our previous albums — this one is entirely much older,” Willow Gothard said, adding that some of the carols are literally ancient. “Except for one original tune. It’s instrumental and is called ‘Winterberry Set.’’’\n\nThis new recording is their take on Christmas carols that were penned hundreds if not thousands of years ago, many of them from the Celtic nations: Brittany, Cornwall, Ireland, Isle of Man, Scotland and Wales.\n\n“We picked 12 tunes from those regions from a long time ago and reinvented them in Gothard Sisters’ style,” Greta Gothard said, adding that their family heritage is “a little bit” Irish and Scottish. “We want them to sound new and fresh, like you’re hearing them again for the first time.”\n\nThe sisters say that the tracks on “A Celtic Christmas” are both festive and restful.\n\nSome songs are cheerful, great to play while you’re shopping or decorating, while others are cozy, meant to be listened to as you wrap presents or sit by the window with a warm cup.\n\n“When I turn on music during the holidays, it’s like I want something to just center me,” Solana Gothard said. “It’s like a little oasis in the middle of all the crazy busyness going on. I can focus on this magical moment right here, right now. We want our music to help with that.”\n\nLayers of sound\n\nThe Gothard Sisters fell in love with Celtic music while listening to National Public Radio’s “The Thistle and Shamrock” on family road trips over Snoqualmie Pass. The popular Sunday radio program, named after the national emblems of Scotland and Ireland, specializes in Celtic music.\n\nThe trio also danced to Celtic music competitively for many years. They competed in the World Irish Dancing Championships four times. Of note, Greta and Willow placed second with Seattle’s Comerford School of Irish Dance team in 2007.\n\nAll three sisters play the violin. Greta asked for lessons when she was 5 because a concert violinist had brought her to tears. After that, Willow and Solana both wanted to learn violin, too. Willow picked it up at 5; Solana couldn’t wait that long, so she started when she was 3.\n\nThe Gothards began their careers by playing classical violin for tips at the Edmonds Farmers Market.\n\nThree years later, they traded classical for Celtic. Studying Irish dance, performing to Celtic tunes and watching shows like “Riverdance” and “Lord of the Dance” had them thinking that they should play it too.\n\nAfter forming their Celtic band in 2009, the sisters started adding layers to their sound. All together, they now play seven different instruments: violin, guitar, mandolin, bodhran, ukulele, djembe and the penny whistle. Greta and Willow sing backup vocals, while Solana is the lead singer.\n\n(In “A Celtic Christmas,” they also added cello to six of the new album’s songs thanks to Willie Braun of the Seattle-based Skyros Quartet.)\n\nThe sisters divvy up the behind-the-scenes work, too: Greta does interviews, books gigs and writes their blog; Willow records songs, produces their albums and works with sound techs; Solana monitors emails, posts to Instagram and makes playlists to share with fans.\n\nAn agent who had seen one of their local shows soon booked them gigs all over the U.S. and recommended they write their own songs. In 2013, the Gothard Sisters were named “Best New Irish Artists” by the Irish Music Awards. They had made it.\n\nThree of their albums have since charted: “Falling Snow” reached No. 13 on Billboard’s world music chart, “Midnight Sun” reached No. 6 on Billboard and “Dragonfly” reached No. 1 on the iTunes world music chart.\n\n“‘Dragonfly’ didn’t chart on the Billboard world music chart this last time,” Solana Gothard said. “It’s pretty hard for independent groups to show up on there anymore as Korean pop is now on the world chart instead of the pop chart.”\n\nThe sisters plan to submit their new Christmas album under Billboard’s new age chart to see how it will fare there.\n\nBut the Gothards say tracking their listener numbers has become more meaningful to them because they represent their fans, whereas awards and charts are essentially popularity contests between artists.\n\nTheir music has been streamed 28 million times around the globe on platforms like Spotify, Apple Music and Pandora. On Spotify alone, their “Dragonfly” album has been streamed 5 million times.\n\nThe Gothard Sisters were also the most played artists three years in a row on Mark Dunn’s “Irish & Celtic Music” podcast — in 2019, 2020 and 2021.\n\n‘See what happens’\n\nWhile the Gothards have written their fair share of originals, most of those songs are instrumental. Writing lyrics for every song on their album is still relatively new to them. Just two of the Gothard Sisters’ 10 albums are 100% their own — “Midnight Sun” and “Dragonfly.”\n\n“I’d ask artists I respected, ‘What do you think we should do?’” Greta Gothard said. “They would say, ‘Write your own words. You can be a cover band forever, or you could try writing your own words and see what happens.’”\n\nThe trio listen to a lot of Celtic music when picking cover songs for their albums. If a track resonates with them, so much that they want to share it, they’ll rearrange it and see how it sounds with Solana’s voice.\n\nWhen they write their own songs, Solana comes up with the rhythm, Greta writes the lyrics and Willow provides the melody. The sisters give each other feedback and tweak their work as they go.\n\nThe Gothards plan to send “Thistle & Shamrock” host Fiona Ritchie their new Christmas album in hopes that she will play it on the radio, bringing the band’s origin story full circle. Five Gothard Sisters songs have been featured on the NPR program so far.\n\n“It was definitely a childhood dream of ours to get played on that show,” Willow Gothard said. “The artists featured there are still so inspiring to us.”\n\nOn Dec. 1, the Gothard Sisters will kick off a Northwest tour to promote their new album. They’ll play Portland, Lincoln City and Corvallis in Oregon, Edmonds and Leavenworth in Washington and Sandpoint in Idaho.\n\nOf all the shows, the sisters look forward to their annual hometown concert the most. After traveling the world, they long to return to the Edmonds Center for the Arts to play for audiences who are like friends and family.\n\n“Nine years in, it’s really becoming an annual tradition for families in Edmonds,” Willow Gothard said. “Some kids play the violin now because they grew up seeing our concerts. It’s just really lovely to see.”\n\nWhere to hear the Gothard Sisters\n\nThe Gothard Sisters’ new album, “A Celtic Christmas,” is available at gothardsisters.com.\n\nThe band returns home for their annual “Celtic Christmas with the Gothard Sisters” concert at 7:30 p.m. Dec. 7 at the Edmonds Center for the Arts, 410 Fourth Ave. N., Edmonds. Tickets are $27-$42. Visit edmondscenterforthearts.org for more information.\n\nAncient Songs from “A Celtic Christmas”\n\nJust how old are the carols in the Gothard Sisters’ newest Christmas album? Here are five of the older ones.\n\n“O Come, O Come, Emmanuel” was written in Latin about 1,200 years ago by Catholic monasteries for Advent, though some of the verses may date back to the 8th or 9th century. The Latin hymn had seven verses, but only five were translated into English in 1851 by Angelican priest John Mason Neale.\n\n“Deck The Halls” was authored in English and Welsh more than 150 years ago. The Scottish musician Thomas Oliphant wrote the verses in English and poet John Johns, known by his bardic name Talhaiarn, translated them into Welsh in 1862.\n\n“Christ Child Lullaby” was written by Catholic priest Ranald Rankin for Midnight Mass almost 200 years ago. The song from 1855 had 29 verses in Scottish, but the popular English translation by Scottish singer Marjory Kennedy-Fraser from the 20th century is limited to five.\n\n“The Wexford Carol,” also known by its first verse “Good people all this Christmas time,” was penned in Irish at least 500 years ago, with some verses dating back to the 15th or 16th century. Irish composer William Grattan Flood transcribed the carol into English in 1928.\n\n“Adeste Fideles,” also known as “O Come, All Ye Faithful,” was written in Latin and is at least 250 years old. It has been attributed to various authors spanning the 13th and 17th centuries, including King John IV of Portugal, English composer John Reading or English hymnist John Francis Wade. The original four verses of the hymn were extended to eight.\n\nSound & Summit\n\nThis article is featured in the winter issue of Sound & Summit, a supplement of The Daily Herald. Explore Snohomish and Island counties with each quarterly magazine. Each issue is $4.99. Subscribe to receive all four editions for $18 per year. Call 425-339-3200 or go to soundsummitmagazine.com for more information.\n\nGallery"
    }
]