[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9lcy9idXNpbmVzcy8yMDIzLzAzLzIwL3JlbmRlci1uZXR3b3JrLWV5ZXMtc29sYW5hLW1pZ3JhdGlvbi1haGVhZC1vZi1uZXR3b3JrLWNoYW5nZXMv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2VzL2J1c2luZXNzLzIwMjMvMDMvMjAvcmVuZGVyLW5ldHdvcmstZXllcy1zb2xhbmEtbWlncmF0aW9uLWFoZWFkLW9mLW5ldHdvcmstY2hhbmdlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Render Network Eyes Solana Migration Ahead of Network Changes - CoinDesk",
        "content": "The Render network currently builds on the Polygon blockchain but has received strong support among its users for a Solana migration. Roughly 55% of users favor making the switch to Solana, while 14% of users would prefer the network remain on Polygon, according to a community sentiment poll included in the proposal. The other 31% of users supported migrations to other blockchains, including Aptos, Ethereum and Algorand, among others."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiqQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG9jdXJyZW5jeS1hbmFseXRpY3MtaW5zaWdodC90aGUtdG9wLWNyeXB0b3Mtb24tdGhlLWJsb2NrY2hhaW4tYm5iLXNvbGFuYS1hbmQtZG9nZXR0aS1zaGFrZS11cC10aGUtY3J5cHRvLXdvcmxkLWFtaWRzdC1yZWNlbnQtc3VyZ2Vz0gGzAWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2FtcC9zdG9yeS9jcnlwdG9jdXJyZW5jeS1hbmFseXRpY3MtaW5zaWdodC90aGUtdG9wLWNyeXB0b3Mtb24tdGhlLWJsb2NrY2hhaW4tYm5iLXNvbGFuYS1hbmQtZG9nZXR0aS1zaGFrZS11cC10aGUtY3J5cHRvLXdvcmxkLWFtaWRzdC1yZWNlbnQtc3VyZ2Vz?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "The Top Cryptos On The Blockchain: BNB, Solana, And Dogetti Shake Up The Crypto World Amidst Recent Surges - Analytics Insight",
        "content": "Dogetti (DETI) is a relatively new meme coin that has been making waves in the DeFi landscape. It has a playful and unique mafia-themed branding that appeals to crypto enthusiasts and movie fanatics alike. The Dogetti family, the name of its community, has been one of the crucial aspects leading to the project's massive success. DETI has been gaining popularity due to its strong pre-ICO sales, indicating that investors are eager to get involved with this new canine on the block and maximise their investments at the launch of the meme coin."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjAtbWFyY2gtMjAyMi9hcnRpY2xlc2hvdy85ODc5OTg1MS5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTIwLW1hcmNoLTIwMjIvYW1wX2FydGljbGVzaG93Lzk4Nzk5ODUxLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin rises above $27,500; Shiba Inu, Polygon shed up to 5% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency markets were trading mixed on Monday. Bitcoin, Solana and BNB gained, while Ethereum, Polygon and Shiba Inu were trading with cuts.\"BTC broke above $28,000 briefly on Monday as the collapse of US banks like SVB and signature has rekindled the debate on the importance of DeFi and digital assets. Bitcoin is poised to test $30,000 very soon but may face some resistance at that level. The FOMC meeting this week will be a major market-moving factor,\" Shivam Thakral, CEO of BuyUcoin, said.Edul Patel, Co-founder and CEO at Mudrex, said, \"With instability in the banking sector, inflation data that exceeded expectations, and renewed optimism about a dovish Federal Reserve, Bitcoin has reached levels unseen in approximately nine months.\"Bitcoin (BTC) rose 1.10% to $27,519, while Ethereum (ETH) was above the $1,750 level. The global cryptocurrency market cap was trading around $1.16 trillion, rising 0.13% in the last 24 hours.The total volume in DeFi is currently 6.67 billion, 9.30% of the total crypto market 24-hour volume. The volume of all stablecoins stood at $61.89 billion, which is 86.26% of the total crypto market 24-hour volume.BTC volume in the last 24 hours stood at approximately $41.76 billion, rising 29.55%. The market cap of Bitcoin was around $531.77 billion. Its dominance is currently 45.90%, an increase of 0.48% over the day, according to CoinMarketCap.“The BTC/USD pair is bullish and faces resistance at $27,740; a breakout could push the price of BTC to $29,000 or $30,700,” said Sathvik Vishwanath, Co-Founder & CEO of Unocoin.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.03 hours, IST on March 20, 2023)Bitcoin $27,519 1.10%Ethereum $1,761 -1.37%Tether $1 0.08%BNB $335.78 0.16% XRP $0.3833 0.70%Cardano $0.3404 -0.52%Polygon $1.14 -4.87% Dogecoin $0.07393 -1.24%Solana $22.41 2.32%Polkadot $6.34 -1.79%Tron $0.06652 0.11%Shiba Inu $0.00001072 -2.07%Litecoin $82.16 -1.97%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjAtbWFyY2gtMjAyMi9hcnRpY2xlc2hvdy85ODc5OTg1MS5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTIwLW1hcmNoLTIwMjIvYW1wX2FydGljbGVzaG93Lzk4Nzk5ODUxLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin rises above $27,500; Shiba Inu, Polygon shed up to 5% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency markets were trading mixed on Monday. Bitcoin, Solana and BNB gained, while Ethereum, Polygon and Shiba Inu were trading with cuts.\"BTC broke above $28,000 briefly on Monday as the collapse of US banks like SVB and signature has rekindled the debate on the importance of DeFi and digital assets. Bitcoin is poised to test $30,000 very soon but may face some resistance at that level. The FOMC meeting this week will be a major market-moving factor,\" Shivam Thakral, CEO of BuyUcoin, said.Edul Patel, Co-founder and CEO at Mudrex, said, \"With instability in the banking sector, inflation data that exceeded expectations, and renewed optimism about a dovish Federal Reserve, Bitcoin has reached levels unseen in approximately nine months.\"Bitcoin (BTC) rose 1.10% to $27,519, while Ethereum (ETH) was above the $1,750 level. The global cryptocurrency market cap was trading around $1.16 trillion, rising 0.13% in the last 24 hours.The total volume in DeFi is currently 6.67 billion, 9.30% of the total crypto market 24-hour volume. The volume of all stablecoins stood at $61.89 billion, which is 86.26% of the total crypto market 24-hour volume.BTC volume in the last 24 hours stood at approximately $41.76 billion, rising 29.55%. The market cap of Bitcoin was around $531.77 billion. Its dominance is currently 45.90%, an increase of 0.48% over the day, according to CoinMarketCap.“The BTC/USD pair is bullish and faces resistance at $27,740; a breakout could push the price of BTC to $29,000 or $30,700,” said Sathvik Vishwanath, Co-Founder & CEO of Unocoin.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.03 hours, IST on March 20, 2023)Bitcoin $27,519 1.10%Ethereum $1,761 -1.37%Tether $1 0.08%BNB $335.78 0.16% XRP $0.3833 0.70%Cardano $0.3404 -0.52%Polygon $1.14 -4.87% Dogecoin $0.07393 -1.24%Solana $22.41 2.32%Polkadot $6.34 -1.79%Tron $0.06652 0.11%Shiba Inu $0.00001072 -2.07%Litecoin $82.16 -1.97%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vY29pbmdhcGUuY29tL2VkdWNhdGlvbi9ob3ctdG8tc3Rha2Utc29sYW5hLXNvbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Mar 2023 07:00:00 GMT",
        "title": "How To Stake Solana (SOL)? - CoinGape",
        "content": "Staking Solana signifies that the stakeholders have decided to grant the validator a certain degree of authority.\n\nSolana (SOL) is a proof of stake (PoS) blockchain. It allows participants to contribute in the blockchain network for validating transactions and data. Unlike other proof of work (PoW) coins like Bitcoin (BTC), Solana joins the bandwagon of Avalanche, Polkadot, Ethereum, and others. It allows the participants to earn passively without investing in expensive mining rigs. The participants can earn SOL staking rewards as part of the network fees.\n\nToday, Solana is a high-performance blockchain that validates over 50,000 transactions per second. Additionally, it stands out from the competition thanks to its low transaction fees. To make this performance possible, Solana incorporates a number of innovations into the project. A decentralized network of nodes with performance comparable to a single node is what Solana envisions. The Solana network’s native token is SOL.\n\nWhat is Solana Staking?\n\nStaking Solana can help you earn more passively while you are away from trading hassles and worries. The staking process of Solana helps you win SOL staking rewards.\n\nWith staking SOL, you agree to lock your SOL coins for a said period of time. You can choose the duration and amount of Solana you wish to lock. While Solana staking, your coins never leave your crypto wallet and are protected by the exchange. However, if you decide to withdraw within the lock-in period, you will miss out on the Solana staking reward.\n\nWhen sending or exchanging money, you will only need to wait for a few epochs.\n\nIf you agree to stake SOL, that would mean you are actively contributing to the Solana network by allocating resources and providing stability to the network. In return, stakeholders receive Solana staking rewards.\n\nHow staking Solana work?\n\nSolana staking works with the help of validators. Staking with SOL means the stakeholders have agreed to delegate a specific amount to the validator. This makes the stakeholders the delegators. The sol validators in SOL staking validate the transaction and data on the solana network.\n\nThe number of delegators is completely proportional to the number of validators. This means the more delegators, the more validators will validate the transactions. The said function helps Solana become more efficient and powerful. The delegation of SOL in Solana staking signifies your vote and trust in the network making it more reputable. Moreover, it helps in earning more money and which will help stakeholders to earn more Solana staking yields.\n\nIt takes some time for staking to take effect. To begin receiving rewards after staking your SOL, you must wait for a number of epochs.\n\nAt epoch boundaries, stakes, and unstakes are both effective. An epoch is roughly equivalent to 2-4 days, but the length of the epoch, the time it lasts, and the warmup or cooldown period all affect how quickly your SOL finishes staking and unstaking.\n\nHow to stake Solana (SOL)?\n\nSolana staking is something very easy and straightforward. The investor needs to move SOL from the wallet to an SOL staking compatible exchange and follow the steps.\n\nStep 1: Select an SOL staking compatible exchange for an efficient staking process.\n\nSelect an SOL staking compatible exchange for an efficient staking process. Step 2: Transfer the SOL coins, keeping in mind the transaction fees of the exchange. Many exchanges or wallets need a minimum of 0.01 SOL for a seamless transfer\n\nTransfer the SOL coins, keeping in mind the transaction fees of the exchange. Many exchanges or wallets need a minimum of 0.01 SOL for a seamless transfer Step 3: Click on the stake option in the wallet. The wallet will navigate you to the staking process. You can select the amount of SOL you wish to stake.\n\nYou’ll be asked to select a delegator by the wallet. Complete the wallet staking process after selecting a validator. There is no need to manually claim stake rewards; they will be automatically added to your balance.\n\nStaking Solana (SOL) on Coinbase\n\nFor its users, Solana staking on Coinbase has automated the staking procedure. The user doesn’t need to take any additional steps. Users receive 75% of the staking rewards from Coinbase, while the company keeps 25% as a service charge.\n\nStaking Solana (SOL) on Binance\n\nFor SOL coins, Binance offers locked staking. Returns can be significantly better than staking with a validator, where duration is the deciding factor. Binance ensures that the same number of coins as those deposited will be returned to investors in addition to yields being paid out in the same kind of coin. Although interest rates vary and are influenced by market conditions, the principle is always protected. Users who stake SOL with Binance run the risk of losing their coins in the event of bankruptcy due to third parties.\n\nIs staking Solana safe?\n\nMostly, staking SOL takes place in a non-custodial way. Non-custodial means holding SOL in your wallet even during the staking process. This gives the stakeholder complete control over the coins. They can at any time choose to unstake and give their Solana staking yields.\n\nTherefore, it is wise to use the SOL coins sitting ideal in your wallet and make money while you are asleep. Solana staking rewards have helped many crypto enthusiasts to restart their journey in the crypto world."
    }
]