[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMi5AFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG9jdXJyZW5jeS1hbmFseXRpY3MtaW5zaWdodC90aGUtYmVzdC1uZXctY3J5cHRvLXByb2plY3RzLWFuYWx5emluZy10aGUtdG9wLWNyeXB0b2N1cnJlbmN5LXByb2plY3QtYW5kLW5ldy1leGNpdGluZy1jb2lucy13aXRoLXNoaWJhLWludS1taW5hLXByb3RvY29sLWRvZ2Vjb2luLWV0aGVyZXVtLWFwZW1heC1zb2xhbmEtYW5kLW1vcmXSAe4BaHR0cHM6Ly93d3cuYW5hbHl0aWNzaW5zaWdodC5uZXQvYW1wL3N0b3J5L2NyeXB0b2N1cnJlbmN5LWFuYWx5dGljcy1pbnNpZ2h0L3RoZS1iZXN0LW5ldy1jcnlwdG8tcHJvamVjdHMtYW5hbHl6aW5nLXRoZS10b3AtY3J5cHRvY3VycmVuY3ktcHJvamVjdC1hbmQtbmV3LWV4Y2l0aW5nLWNvaW5zLXdpdGgtc2hpYmEtaW51LW1pbmEtcHJvdG9jb2wtZG9nZWNvaW4tZXRoZXJldW0tYXBlbWF4LXNvbGFuYS1hbmQtbW9yZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "The Best New Crypto Projects | Analyzing the Top Cryptocurrency Project and New Exciting Coins with Shiba Inu, Mina protocol, Dogecoin, Ethereum, ApeMax, Solana, and More. - Analytics Insight",
        "content": "However, it's essential to exercise caution in the crypto realm. Cryptocurrencies are inherently volatile and come with risks. This article provides a snapshot of the current landscape but does not constitute financial advice. Understanding the risks and proceeding with care is crucial. Additionally, ApeMax may not be accessible to all individuals, so it's important to verify eligibility by checking the official ApeMax website for information on regional restrictions and eligibility prior to proceeding."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG9jdXJyZW5jeS1hbmFseXRpY3MtaW5zaWdodC9iaXRjb2luLXNwYXJrLXByaWNlLXByZWRpY3Rpb24tc29sYW5hLXdoYWxlLXN1Z2dlc3RzLWEtNzAwLWJ0Y3MtaXMtdmVyeS1saWtlbHktaW4tMjAyNNIBogFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9hbXAvc3RvcnkvY3J5cHRvY3VycmVuY3ktYW5hbHl0aWNzLWluc2lnaHQvYml0Y29pbi1zcGFyay1wcmljZS1wcmVkaWN0aW9uLXNvbGFuYS13aGFsZS1zdWdnZXN0cy1hLTcwMC1idGNzLWlzLXZlcnktbGlrZWx5LWluLTIwMjQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Spark Price Prediction: Solana Whale Suggests a $700 BTCS is “Very Likely In 2024” - Analytics Insight",
        "content": "Bitcoin Spark's network is giving investors an opportunity similar to purchasing Bitcoin in 2013. The network has a strategic plan to stabilize the price of BTCS tokens after the launch. The network will introduce exclusive perks for wallet addresses and accounts that have received BTCS tokens directly from the ICO deployer address. The wallets will have a two-fold mining rate lasting for two years, and the strategy has been closely monitored to reward early adopters. After the two years elapse, the mining fold will end, and the network will stabilize."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9zb2xhbmFzLWxpcXVpZC1zdGFraW5nLWV4cGxvZGVzLXdoYXRzLWJlaGluZC10aGUtc3VyZ2UtaW4tc3Rha2VkLXNvbC_SAW1odHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vc29sYW5hcy1saXF1aWQtc3Rha2luZy1leHBsb2Rlcy13aGF0cy1iZWhpbmQtdGhlLXN1cmdlLWluLXN0YWtlZC1zb2wvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "Solana’s Liquid Staking Explodes: What’s Behind the Surge in Staked SOL? - Crypto News Flash",
        "content": "Engagement Surge: Jito’s protocol propels liquid staking on Solana with 1.9 million $SOL staked.\n\nUntapped Potential: Solana’s liquid staking remains expansive, showcasing vast DeFi capabilities.\n\nIn a recent development within the blockchain sphere, Solana’s ($SOL) liquid staking scenario is experiencing a significant uptick, propelled by the emerging liquid staking protocol Jito. As per a tweet update by Emperor Osmo, Jito’s staking deposits have been rocketing, signifying a robust growth in Solana’s staking landscape.\n\n$SOL staking is looking beautiful.@jito_sol 's staking deposits are going parabolic. 📈 – 1.9m $SOL staked\n\n– Weekly staking growing\n\n– Depositors outpacing withdrawers significantly. This will go even higher with Jito points airdrop to stakers. pic.twitter.com/8mpN5L9gmb — Emperor Osmo🧪 (@Flowslikeosmo) September 20, 2023\n\nThe specifics from Osmo illustrate a progressive narrative: 1.9 million $SOL staked, escalating weekly staking, and depositors markedly overshadowing withdrawers. Furthermore, the surge is poised to climb with a forthcoming Jito points airdrop to stakers, fostering a deeper engagement within the staking community.\n\nThe JitoSOL Staking Pool: A Catalyst for Growth\n\nThe essence of liquid staking is the empowerment it bestows upon users, facilitating direct staking participation while concurrently allowing the staked assets to be utilized across the decentralized finance (DeFi) domain for additional yield prospects. JitoSOL is catalyzing this space by enabling a staking pool where users can stake their Solana tokens in return for a liquid staking token known as JitoSOL. Like its counterparts, this token appreciates in value through staking rewards over time, thus serving as an attractive proposition for stakeholders. MEV (Miner Extractable Value) powered staking rewards on Solana further accentuate the appeal, rendering a fresh dynamism to Solana’s staking ecosystem, as cited from JitoSOL’s (Staking and MEV) MEV Powered Staking Rewards on Solana.\n\nSolana’s Staking Landscape: A Closer Look\n\nThe vibrancy in Solana’s staking numbers is palpable. Data from The Staking Explorer reveals a staking market cap of $7.77 billion with an annualized average reward rate of 6.97% at the time of publication. While the staking momentum has robustly accelerated over recent months, it’s observed that staking yields have tapered. This is attributed to the core proof-of-stake (PoS) doctrine, whereby an augmentation in staker numbers dilutes the yield distribution. Despite facing bearish market sentiments with $SOL trading at $19.58, down by 2.6% over the last 24 hours at the time of publication, the unfolding narrative of Solana’s liquid staking surge emboldens its standing in the blockchain domain.\n\nThis factual exegesis sans a summary or conclusion lays down the burgeoning milieu of Solana’s liquid staking, engendered significantly by Jito’s innovative protocol, thus enriching the discourse surrounding Solana’s DeFi potential.\n\nRecommended for you:"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9zb2xhbmFzLWxpcXVpZC1zdGFraW5nLWV4cGxvZGVzLXdoYXRzLWJlaGluZC10aGUtc3VyZ2UtaW4tc3Rha2VkLXNvbC_SAW1odHRwczovL3d3dy5jcnlwdG8tbmV3cy1mbGFzaC5jb20vc29sYW5hcy1saXF1aWQtc3Rha2luZy1leHBsb2Rlcy13aGF0cy1iZWhpbmQtdGhlLXN1cmdlLWluLXN0YWtlZC1zb2wvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "Solana’s Liquid Staking Explodes: What’s Behind the Surge in Staked SOL? - Crypto News Flash",
        "content": "Engagement Surge: Jito’s protocol propels liquid staking on Solana with 1.9 million $SOL staked.\n\nUntapped Potential: Solana’s liquid staking remains expansive, showcasing vast DeFi capabilities.\n\nIn a recent development within the blockchain sphere, Solana’s ($SOL) liquid staking scenario is experiencing a significant uptick, propelled by the emerging liquid staking protocol Jito. As per a tweet update by Emperor Osmo, Jito’s staking deposits have been rocketing, signifying a robust growth in Solana’s staking landscape.\n\n$SOL staking is looking beautiful.@jito_sol 's staking deposits are going parabolic. 📈 – 1.9m $SOL staked\n\n– Weekly staking growing\n\n– Depositors outpacing withdrawers significantly. This will go even higher with Jito points airdrop to stakers. pic.twitter.com/8mpN5L9gmb — Emperor Osmo🧪 (@Flowslikeosmo) September 20, 2023\n\nThe specifics from Osmo illustrate a progressive narrative: 1.9 million $SOL staked, escalating weekly staking, and depositors markedly overshadowing withdrawers. Furthermore, the surge is poised to climb with a forthcoming Jito points airdrop to stakers, fostering a deeper engagement within the staking community.\n\nThe JitoSOL Staking Pool: A Catalyst for Growth\n\nThe essence of liquid staking is the empowerment it bestows upon users, facilitating direct staking participation while concurrently allowing the staked assets to be utilized across the decentralized finance (DeFi) domain for additional yield prospects. JitoSOL is catalyzing this space by enabling a staking pool where users can stake their Solana tokens in return for a liquid staking token known as JitoSOL. Like its counterparts, this token appreciates in value through staking rewards over time, thus serving as an attractive proposition for stakeholders. MEV (Miner Extractable Value) powered staking rewards on Solana further accentuate the appeal, rendering a fresh dynamism to Solana’s staking ecosystem, as cited from JitoSOL’s (Staking and MEV) MEV Powered Staking Rewards on Solana.\n\nSolana’s Staking Landscape: A Closer Look\n\nThe vibrancy in Solana’s staking numbers is palpable. Data from The Staking Explorer reveals a staking market cap of $7.77 billion with an annualized average reward rate of 6.97% at the time of publication. While the staking momentum has robustly accelerated over recent months, it’s observed that staking yields have tapered. This is attributed to the core proof-of-stake (PoS) doctrine, whereby an augmentation in staker numbers dilutes the yield distribution. Despite facing bearish market sentiments with $SOL trading at $19.58, down by 2.6% over the last 24 hours at the time of publication, the unfolding narrative of Solana’s liquid staking surge emboldens its standing in the blockchain domain.\n\nThis factual exegesis sans a summary or conclusion lays down the burgeoning milieu of Solana’s liquid staking, engendered significantly by Jito’s innovative protocol, thus enriching the discourse surrounding Solana’s DeFi potential.\n\nRecommended for you:"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmJhZ3Vpb21pZGxhbmRjb3VyaWVyLmNvbS5waC9zb2xhbmFzLWVxdWVzdHJpYW4tam91cm5leS10aGUtbW9uZ29sLWRlcmJ5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 24 Sep 2023 07:00:00 GMT",
        "title": "Solana’s equestrian journey: The Mongol Derby - Baguio Midland Courier",
        "content": "Baguio born Solana Lim Perez is the first Filipina to compete in the longest and toughest horse race in the world popularly known as the Mongol Debry, which was held in August with over 1,000 km of Mongolian steppe (a vast grassland, devoid of trees and with little diversity in vegetation.\n\nJudging from this definition, I would say that the grassland is similar to the summit or plateau of Mount Pulag but over undetermined boundary.\n\nOne has to be armed with stamina, determination and will power to be able to handle the hurdles that will come your way.\n\nAs one rider stated: “It is physically and mentally demanding and the sheer vastness is epic.”\n\nAnother one attested: “To be on a horse from 6:30 in the morning to 8:00 o’clock at night for 10 days in a row is absolutely grueling. This is not an ordinary horse race; it is something else. One has to change horses every 40 km. As the horses rest, the rider endures, until he or she finishes the race.”\n\nForty-four equestrians of different backgrounds and different nationalities from all over the world joined the horse race challenge and learned about the wilderness of Mongolia, the nomadic culture and goodness of its people and the steadfastness of its steeds. Even if there were the best people watching over you, who were usually one step ahead, you still had to rely on yourself. Sheer will power could not be overstated.\n\nGenghis Khan was best known for unifying the Mongolian steppe under a massive empire that was able to challenge the powerful Jin dynasty in China. He said, “It is easy to conquer the world from the back of a horse.”\n\nHence, you can imagine the immensity of the Mongol Derby. It is a test of endurance, wits and survival. This phenomenal race brought together about 500 people, medics, vets, equestrians and guests from all over the world and from all walks of life. About twenty five riders completed the 2023 Mongol Derby.\n\nSwedish rider Linda Hermann won the race.\n\nWith Solana being the first Filipina to compete, it is surely a feather in our cap. She started training with the Kabajo Handlers Association at Camp John Hay and the Wright Park Pony Boys Association in 2019.\n\nSolana’s mother, Padmapani Lim Perez, is a doctor of Anthropology, a research fellow, a poet and a freelance feature writer. Together with sister Feliz, who is another anthropologist, they own and manage Mt. Cloud Bookstore at Yangco Road in Baguio. Solana’s grandparents are Adelaida Lim, a gourmet enthusiast, environmentalist and one of the proprietors of Café by the Ruins, and Butch Perez, a film director.\n\nSolana mentioned in a TV interview she was overwhelmed with the support of the community and her friends from abroad when they heard that she was joining the derby.\n\nMencie Kinao also cited in her report that Solana expressed that she was only able to finish 625-kilometer of the 1,000-km. race because of various reasons, but the race had gifted her with friendships and brief moments which warmed her heart.\n\n“More than my hydration system breaking down, more than bad luck at the horse lottery, this is the true reason I stuck to the back of the pack during the derby. I do feel changed but I do not feel diminished. I feel loved. I will forever treasure the memories I made with all the people I met. Thank you, Mongolia. Thank you for sheltering me in the warm and strong arms of your people under your Eternal Blue Sky,” she said.\n\nShe also asked the people of Baguio to support her ponyboy friends. They served as her inspiration, “sila ang nag train sa akin at nagbigay ng inspiration.” She also recalled being enthralled by her horse Viper when she was young and how his passing had left a dent in her heart which gave her the passion to care for horses and to join the derby.\n\nSo, guys, when you bring your visitors and kins to Wright Park or Camp John Hay, remember to request the Pony Boys to teach your kids how to mount, how to hold the rein and steer the horse and to thank them for taking care of the horses. Remember too to treat the horses gently.\n\nCongratulations Solana for putting Baguio on the world map in the Mongol Derby. Your feat will surely be an inspiration for horse lovers and enthusiasts. (Photos from Solana Perez) — Stella Maria L. de Guia"
    }
]