[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMy8xMy9tb3ZlLXRvLWVhcm4taGFzLWEtcG9uemktcHJvYmxlbS1jdWx0dXJlLXdlZWsv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzAzLzEzL21vdmUtdG8tZWFybi1oYXMtYS1wb256aS1wcm9ibGVtLWN1bHR1cmUtd2Vlay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Move-to-Earn Has a Ponzi-Economics Problem - CoinDesk",
        "content": "While building WheelCoin, my team reviewed all of these different business models and approaches to community building and monetization. We leaned much more heavily on the SweatCoin business model than Stepn’s, and I believe that future M2E projects will do so as well. You may ask why would we do that when Stepn had more than $120 million in profit in one quarter while SweatCoin likely earns way less than that annually?"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMy8xMy93ZWIzLWV4ZXJjaXNlLWFwcC1zdGVwbi1jcnlwdG8tcmV3YXJkcy_SAWJodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDMvMTMvd2ViMy1leGVyY2lzZS1hcHAtc3RlcG4tY3J5cHRvLXJld2FyZHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Stepn Was a Runaway Success During COVID but Can It Keep Moving Forward? - CoinDesk",
        "content": "There are stories like Werk’s all over Stepn Twitter. In something of a Web3 version of the Peloton cult, where the community (loudly) encourages each other to keep cycling. The “Stepineers” broadcast their results and cheer each other on. One woman shared the story of how, after she battled cancer, Stepn helped her go from using crutches to walking with confidence. Another user proudly tweeted, “Lost 20 pounds since February.” Another gushed that he had lost 40 pounds of fat and that “Stepn helped me quit smoking. Nicotine free, baby! Can you put a price on that?” Although someone cheekily responded that yes, actually, you can put a price on that – the price is what you spent on all those sneaker NFTs. “That is true,” the smoking-quitter replied, acknowledging that he’d invested $25,000 to that point, but was “completely happy with the returns.”"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3Lm55dGNvLmNvbS9wcmVzcy92aWRlby10ZWFtLXdlbGNvbWVzLW5ldy1mYWNlcy1pbi1uZXcteW9yay1hbmQtc2VvdWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Video Team Welcomes New Faces in New York and Seoul - The New York Times Company",
        "content": "Jeesoo Park joins as a senior producer based in New York. In this role, she will help oversee our field reporting team, guiding everything from breaking news coverage to original projects and desk collaborations.\n\nShe joins us from CNN, where as a supervising producer she led teams across news and enterprise video, working with correspondents daily to deepen and further both national and international news coverage. She reported on topics ranging from Roe v. Wade to immigration to the criminal justice system. In 2021, she was nominated for an Emmy Award for a report featuring the scene on-the-ground in Wuhan, China, as the Covid pandemic was first taking hold.\n\nPreviously, Jeesoo worked as a documentary producer for ABC News and National Geographic, creating series and long-form content for both digital and broadcast. She is a D.C. native and a graduate of Bucknell University and the Columbia University Graduate School of Journalism."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9saWZlc3R5bGUvc3RvcnkvMjAyMy0wMy0xMy9sb2NhbC1zdC1wYXRyaWNrcy1kYXktdHJlYXRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Local St. Patrick's Day treats and eats - Del Mar Times",
        "content": "Susie Cakes in One Paseo\n\nSusie Cakes will celebrate St. Patrick’s Day with an assortment of festive sweets. Available starting March 1 until St. Patrick’s Day March 17, menu offerings include Chocolate Guinness Cupcakes with Baileys Buttercream, Shamrock Frosted Sugar Cookies, a four pack of “Kiss Me I’m Irish” Cupcakes, Green Velvet Cupcakes and a St. Patrick’s Day Vanilla Celebration Cake. The bakery also offers a St. Patrick’s Day Cupcake and Sugar Cookie DIY Kit stocked with buttercream and sprinkles available for pick up March 16 and 17.\n\n3705 Caminito Court, Carmel Valley\n\nGreen beer with a view of the San Dieguito Lagoon at Viewpoint. (Tyler Grove)\n\nGreen brew at Viewpoint\n\nToast to good luck with a green beer at Del Mar’s Viewpoint Brewery. The beer itself is an American lager and it will be on a $5 special for St. Patty’s Day while supplies last. The restaurant side will also be serving a signature shepherd’s pie as the food special.\n\n2201 San Dieguito Drive Suite D, Del Mar\n\nA corned beef plate from Ranch 45. (Chris Costa)\n\nRanch 45\n\nSolana Beach’s Ranch 45 eatery and butcher shop is celebrating St. Patrick’s Day with three corned beef specials. Those who want to enjoy a full corned beef dinner at home can pick up two pounds of Brandt corned beef, cooked, sliced ready to be reheated along with potatoes, cabbage, carrots and a house made mustard sauce. At the restaurant guests can enjoy corned beef hash and pastrami sandwiches on the menu all day.\n\n512 Via De La Valle, suite 102, Solana Beach"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGVjcnlwdC5jby8xMjMxOTkvc2lsaWNvbi12YWxsZXktYmFuay1jcnlwdG8tY29tcGFuaWVzLWNvbnRhZ2lvbtIBTmh0dHBzOi8vZGVjcnlwdC5jby8xMjMxOTkvc2lsaWNvbi12YWxsZXktYmFuay1jcnlwdG8tY29tcGFuaWVzLWNvbnRhZ2lvbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Mar 2023 07:00:00 GMT",
        "title": "Silicon Valley Bank Contagion: Crypto Companies Affected Include BlockFi, Circle, Avalanche, Ripple - Decrypt",
        "content": "We do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAs the fallout from the stunning collapse of Silicon Valley Bank (SVB) plays out, numerous crypto companies have signaled their exposure to the bank, which long maintained a reputation as one of the most prominent lenders to tech startups in the world.\n\nThe bank’s closure Friday by the California Department of Financial Protection marked the second-largest bank failure in American history, after the undoing of Washington Mutual during the financial crisis of 2008. Silicon Valley Bank reported $212 billion in assets last quarter.\n\nThe stock (SIVB) began spiraling late Wednesday after rumors circulated that the institution was seeking an acquisition after failing to raise sufficient capital to cover its obligations. In the hours and days that followed, numerous venture capital funds reportedly advised their clients to withdraw their funds, resulting in $42 billion of withdrawals initiated on Thursday, constituting a run on the bank. On Friday morning, the Nasdaq halted trading of SIVB shares.\n\nThough it was venture capital firms and tech startups that were most severely affected by the SVB scare on Friday, numerous crypto companies have also disclosed their exposure to the bank. Here’s a running list of the crypto firms caught in the crosshairs of SVB's collapse, along with those that have publicly claimed they avoided the damage.\n\nAD\n\nAD\n\nNote: On Sunday, U.S. Federal Reserve Chairman Jerome Powell, Treasury Secretary Janet Yellen, and Federal Deposit Insurance Corporation (FDIC) Chairman Martin Gruenberg issued a joint statement saying that all Silicon Valley Bank depositors would be made whole and have access to their funds on Monday, March 13. The Federal Reserve is now investigating the bank's failure.\n\nCrypto companies that had money in SVB\n\nRipple\n\nOn Sunday night, Ripple CEO Brad Garlinghouse tweeted that Ripple \"had some exposure to SVB—it was a banking partner, and had some of our cash balance.\"\n\nDespite this, Garlinghouse asserted that Ripple expects \"no disruption to our day-to-day business\" and that the company \"remains in a strong financial position.\"\n\nSetting the record straight on SVB Qs: Ripple had some exposure to SVB – it was a banking partner, and held some of our cash balance. Fortunately, we expect NO disruption to our day-to-day business, and already held a majority of our USD w/ a broader network of bank partners. — Brad Garlinghouse (@bgarlinghouse) March 12, 2023\n\nAD\n\nAD\n\nBlockFi\n\nFailed crypto lender BlockFi, which filed for bankruptcy in November in the wake of FTX's collapse, has $227 million in funds held at SVB, according to documents filed Friday related to BlockFi's bankruptcy proceedings. Those funds are reportedly not insured by the Federal Deposit Insurance Commission (FDIC) as they are in a money market mutual fund, which itself may constitute a violation of bankruptcy law.\n\nBlockFi first halted withdrawals just days after the implosion of crypto exchange FTX. The lender had previously been bailed out by FTX with a revolving $250 million line of credit, last June.\n\nPer new bankruptcy filing, BlockFi has $227m in Silicon Valley Bank. The bankruptcy trustee warned them on Mon that bc those funds are in a money market mutual fund, they’re not FDIC secured — which could be a prblm w/ keeping in compliance of bankruptcy law pic.twitter.com/hnpo8anrrS — Lauren Hirsch (@LaurenSHirsch) March 10, 2023\n\nCircle\n\nCircle, issuer of the world's second-largest stablecoin USDC, announced on Friday that some undisclosed portion of the cash reserves used to back USDC and tie its value to the US dollar were held at Silicon Valley Bank.\n\nThe company said in a statement Friday that SVB was one of six banks relied on to manage USDC's cash reserves, but claims USDC will be able to continue operating normally.\n\nSilicon Valley Bank is one of six banking partners Circle uses for managing the ~25% portion of USDC reserves held in cash. While we await clarity on how the FDIC receivership of SVB will impact its depositors, Circle & USDC continue to operate normally.https://t.co/NU82jnajjY — Circle (@circle) March 10, 2023\n\nStablecoins like USDC are cryptocurrencies backed by and pegged to the value of real-world assets. They are meant to serve as a sturdy intermediary between traditional finance and more volatile crypto markets; USDC, with a market capitalization of $42.17 billion, is the second-most used stablecoin in the world. 25% of the assets backing USDC, which purports to be fully collateralized, are cash, according to Circle.\n\nLast week, Circle cut ties with collapsed crypto-friendly bank Silvergate, which shut down on Wednesday. Circle had also used Silvergate to hold cash reserves until that point.\n\nAD\n\nAD\n\nPantera\n\nCrypto-focused venture capital firm Pantera may have an unknown amount of exposure to SVB's collapse. As recently as last month, the firm counted the failed bank among just three custodians of its private funds, according to a February 3 SEC filing.\n\nPantera counts among the largest crypto-focused VC firms in the world; last year alone it raised $1.3 billion for a fund exclusively focused on blockchain-based projects.\n\nAvalanche\n\nThe Avalanche Foundation, which supports the Avalanche blockchain, announced Friday evening that it has \"a little over\" $1.6 million in exposure to Silicon Valley Bank.\n\nAvalanche's native token AVAX, currently boasts a market capitalization of $4.84 billion.\n\nIn light of recent news, we would like to confirm that the Avalanche Foundation has no exposure to Silvergate and a little over $1.6mm of exposure to Silicon Valley Bank. Avalanche Foundation is saddened by the news about SI and SIVB, and hope that all depositors are made whole. — Avalanche 🔺 (@avalancheavax) March 10, 2023\n\nYuga Labs\n\nYuga Labs, the $4 billion company behind dominant NFT collection Bored Ape Yacht Club (among other projects), is exposed to SVB. Yuga co-founder Greg Solano said Friday that the company has \"super limited exposure\" to the failed bank, though Yuga has not yet confirmed exactly how much.\n\nSolano said the amount \"doesn't impact our business or plans in any way.\"\n\nBREAKING NEWS » @yugalabs Co-Founder @CryptoGarga Said that Yuga Labs Had “Super Limited” Financial Exposure To The @SVB_Financial Fallout. pic.twitter.com/RXxBkyPOwX — The Bored Ape Gazette🍌 (@BoredApeGazette) March 10, 2023\n\nAD\n\nAD\n\nProof\n\nProof, another leader in NFTs, may have been hit harder. The Web3 project created by Digg co-founder Kevin Rose, which is behind leading NFT collection Moonbirds, issued a statement Friday confirming the company holds cash as Silicon Valley Bank.\n\n\"Proof holds cash at SVB, however... We've thankfully diversified our assets across ETH, stablecoins, as well as fiat,\" the company Tweeted Friday.\n\nProof has not yet disclosed what amount of cash it has tied up with SVB. While the company conceded that SVB's collapse \"sucks,\" it also insisted the potential loss wouldn't affect the security of customer's assets, or Proof's roadmap.\n\n2/5: In the spirit of transparency, here’s everything we know about the situation with SVB: Proof holds cash at SVB, however…\n\nWe’ve thankfully diversified our assets across ETH, stablecoins, as well as fiat—so financially and operationally, we’re going to be OK. — PROOF (🥃,🦉) (@proof_xyz) March 10, 2023\n\nNova Labs\n\nNova Labs, the startup behind decentralized network and internet provider Helium, disclosed exposure to SVB late Friday.\n\n\"Nova Labs has some $ stuck in SVB, but the vast majority is in other institutions, Nova Labs CEO and Helium co-founder Amir Haleem said.\n\nincredible that (3,3) really was the right strategy@novalabs_ has some $ stuck in SVB, but the vast majority is in other institutions I feel terrible for all the other founders and startups who were not so fortunate. hoping for a speedy resolution 🙏🏽 — amir 🎈 (@amirhaleem) March 11, 2023\n\nDapper Labs\n\nDapper Labs, the company behind NBA Top Shot NFTs, said it had “minimal cash balances” with Silicon Valley Bank, and has not been “materially impacted” by the bank’s failure as a result. But \"minimal\" impact is still something.\n\nAD\n\nAD\n\n🚨 Announcement from Dapper community Discord: \"Dapper Labs is not materially impacted by the situation involving SVB. We had minimal cash balances with SVB.\" pic.twitter.com/nW2bG0gjo7 — Flowverse 🌊 - Discover Flow Blockchain (@flowverse_) March 12, 2023\n\nCrypto companies claiming no exposure to SVB\n\nNumerous crypto companies have also rushed to declare their lack of exposure to Silicon Valley Bank, in attempts to stave any potential additional panic.\n\nPaxos\n\nThe crypto brokerage firm Paxos said it had “no relationship” with Silicon Valley Bank, adding its stablecoins have zero exposure to the bank’s failure. The market capitalization of Paxos’s Binance-branded stablecoin BUSD is $8.4 billion and $840 million for its Pax Dollar stablecoin, according to CoinGecko.\n\nStatement from Paxos: Paxos has no relationship with Silicon Valley Bank. For further certainty, Paxos stablecoins have zero exposure to Silicon Valley Bank failure. — Paxos (@PaxosGlobal) March 10, 2023\n\nCrypto.com\n\nKris Marszalek, CEO of cryptocurrency exchange Crypto.com, said the company has no exposure to Silicon Valley Bank as well as Silvergate, a crypto-friendly bank that announced it would voluntarily wind down operations last week.\n\nhttps://t.co/pFc4Pz8PQj has $0 exposure to Silvergate and SVB. — Kris | Crypto.com (@kris) March 11, 2023\n\nBinance\n\nThe CEO of leading cryptocurrency exchange Binance Changpeng Zhao said the firm “does not have any exposure to” the collapse of Silicon Valley Bank. Invoking the crypto term that’s become a familiar phrase since it was first used in 2018, Zhao said funds “are #SAFU.”\n\n#Binance does not have exposure to SVB. Funds are #SAFU. — CZ 🔶 Binance (@cz_binance) March 10, 2023\n\nAD\n\nAD\n\nKraken\n\nJesse Powell, co-founder and CEO of cryptocurrency exchange Kraken, said the company has no exposure to Silicon Valley Bank. His comment was made in response to a user who asked for clarification about the systematic risk posed by the bank’s failure on Twitter.\n\nWe have no exposure to SVB. — Jesse Powell (@jespow) March 11, 2023\n\nTether\n\nTether, the company behind the world's largest stablecoin, USDT, announced Friday that it had no exposure to SVB's collapse. USDT has a market capitalization of $72.38 billion.\n\n#tether doesn't have any exposure to SVB — Paolo Ardoino 🍐 (@paoloardoino) March 10, 2023\n\nSolana\n\nAnatoly Yakovenko, co-founder of the Solana blockchain, claimed that neither Solana Labs nor the Solana Foundation had any exposure to SVB.\n\nNeither labs or foundation banked at svb. Dodged another bullet. — toly 🇺🇸 (@aeyakovenko) March 10, 2023\n\nPolygon\n\nRyan Wyatt, president of Polygon Labs, the company behind Ethereum scaling solution Polygon, similarly announced that no Polygon-affiliated companies or foundations had any exposure to SVB.\n\nSad day for a lot of companies who are going through the collapse of SVB, and my heart goes out to all these startups exposed to this. I am grateful that we had no relationship with SVB, and have escaped these bank failures unscathed. — Ryan Wyatt 💜 (@Fwiz) March 11, 2023\n\nAD\n\nAD\n\nImmutable\n\nImmutable, the Web3 game publisher and firm behind Ethereum scaling network Immutable X, had no SVB exposure, per a tweet from co-founder Robbie Ferguson. \"We have more than A$280M in the bank (predominantly in USD), and do not use financial leverage,\" he said on Thursday night, ahead of the bank's announced demise.\n\nA quick update: @immutable has no exposure to Silvergate or SVB. We have more than A$280M in the bank (predominantly in USD), and do not use financial leverage. Stay safe out there - and keep building. The infrastructure we build today will form the basis of digital property… https://t.co/B5hPTtgncP — Robbie Ferguson 🅧 | Immutable (@0xferg) March 10, 2023\n\nGala Games\n\nWeb3 gaming and entertainment startup Gala Games did not have any exposure to Silicon Valley Bank, according to Jason Brink, the firm's president of blockchain, in a tweet reply to Decrypt reporter Kate Irwin.\n\nHappy to note that we, at @GoGalaGames, do not have exposure to SVB. — Jason Brink aka BitBender (@BitBenderBrink) March 11, 2023\n\nOther companies that announced no exposure to SVB on Friday include Blur, the emergent NFT marketplace, Ledn, the crypto lending platform, crypto wallet Phantom, and DeLabs, the company behind top NFT collections DeGods and Y00ts.\n\nThis article was last updated Monday, March 13, 2023 at 5:05 p.m. EST."
    }
]