[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTA5L2RlcmliaXQtdG8tb2ZmZXItb3B0aW9ucy1vbi1zb2wteHJwLW1hdGljLWFuZC1leHBhbmQtaW4tZXXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Crypto's Deribit to Offer Options on More Tokens, Expand in EU - Bloomberg",
        "content": "The largest cryptocurrency exchange for options, Deribit, is pushing ahead with plans to provide customers with contracts on more coins despite a slump in volatility in digital assets.\n\nDeribit will offer options on Solana’s SOL , the XRP token linked to Ripple Labs and Polygon’s MATIC starting January, Chief Commercial Officer Luuk Strijers said in an interview, adding a lack of volatility “won’t defer our plans.” The firm will also apply for a brokerage license in the European Union, he said."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTA5L2RlcmliaXQtdG8tb2ZmZXItb3B0aW9ucy1vbi1zb2wteHJwLW1hdGljLWFuZC1leHBhbmQtaW4tZXXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Crypto's Deribit to Offer Options on More Tokens, Expand in EU - Bloomberg",
        "content": "The largest cryptocurrency exchange for options, Deribit, is pushing ahead with plans to provide customers with contracts on more coins despite a slump in volatility in digital assets.\n\nDeribit will offer options on Solana’s SOL , the XRP token linked to Ripple Labs and Polygon’s MATIC starting January, Chief Commercial Officer Luuk Strijers said in an interview, adding a lack of volatility “won’t defer our plans.” The firm will also apply for a brokerage license in the European Union, he said."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1pbnNjcmlwdGlvbnMtc3VycGFzcy1uZnQtbWludGluZy1vbi1ldGhlcmV1bS1zb2xhbmEtcG9seWdvbi1kZXNwaXRlLWJlYXItbWFya2V00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Inscriptions Surpass NFT Minting On Ethereum, Solana, Polygon Despite Bear Market - Nasdaq",
        "content": "Bitcoin inscriptions, a new way to store data on the Bitcoin (CRYPTO: BTC) blockchain, have surpassed 35 million since their inception in January.\n\nOrdinals are digital artifacts that can be inscribed onto Bitcoin using the Ordinals protocol.\n\nThey can be anything from text files, images, and audio to videos, and can be used to store a wide variety of data on the Bitcoin blockchain.\n\nAccording to a report by Galaxy Digital, text files represent the vast majority of Bitcoin inscriptions, accounting for approximately 95% of all inscriptions.\n\nAlso Read: People Are Going To Start Cashing Out Bitcoin — Here's Why\n\nImage-based inscriptions account for approximately 3.5% of all inscriptions, with the remaining 1.5% consisting of other types of digital artifacts.\n\nOrdinals Activity Since March: In the first 200 days since the first inscription on Bitcoin, a total of 1.14 million image-based inscriptions have been created.\n\nThis surpasses the number of non-fungible tokens (NFTs) minted on other blockchains, such as Ethereum (CRYPTO: ETH), Solana (CRYPTO: SOL), and Polygon (CRYPTO: MATIC), since the debut of NFTs on these respective networks.\n\nHowever, it is important to note that Bitcoin's minting activity throughout the first 200 days is still much lower than the total minting activity for NFTs on other blockchains, illustrating how Ordinals still have a long way to go in terms of adoption relative to the broader NFT ecosystem.\n\nOrdinals Trading Volume: Despite the unfavorable market conditions for NFTs in 2023, Ordinals accomplished meaningful growth.\n\nBitcoin has accumulated the third-highest NFT trading volume by the network at $596.4 million.\n\nEven when excluding BRC-20s, which represent ~30% of all Ordinals volume ($187.5 million), Bitcoin remains the third most popular chain for digital collectible activity after Ethereum and Solana.\n\nOrdinals Marketplaces: The most dominant marketplaces by volume for Ordinals are now Magic Eden, Unisat, and OKX at 28%, 28%, and 38% respectively.\n\nImplications for the Future of Bitcoin: The growing popularity of Bitcoin inscriptions is a significant development for the Bitcoin ecosystem.\n\nIt suggests that Bitcoin is being used for more than just a store of value and a medium of exchange. It is also being used to store and share data, which could lead to new and innovative use cases for Bitcoin in the future.\n\nFor example, Bitcoin inscriptions could be used to create a decentralized social media platform or a decentralized storage platform. They could also be used to create new forms of digital art and collectibles.\n\nRead Next: Bitcoin To $20K, Ethereum To $1K? Prominent Venture Capitalist Predicts Market Bottom\n\nMeet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga's exclusive event - Future of Digital Assets. Tickets are flying- get yours!\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1pbnNjcmlwdGlvbnMtc3VycGFzcy1uZnQtbWludGluZy1vbi1ldGhlcmV1bS1zb2xhbmEtcG9seWdvbi1kZXNwaXRlLWJlYXItbWFya2V00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Inscriptions Surpass NFT Minting On Ethereum, Solana, Polygon Despite Bear Market - Nasdaq",
        "content": "Bitcoin inscriptions, a new way to store data on the Bitcoin (CRYPTO: BTC) blockchain, have surpassed 35 million since their inception in January.\n\nOrdinals are digital artifacts that can be inscribed onto Bitcoin using the Ordinals protocol.\n\nThey can be anything from text files, images, and audio to videos, and can be used to store a wide variety of data on the Bitcoin blockchain.\n\nAccording to a report by Galaxy Digital, text files represent the vast majority of Bitcoin inscriptions, accounting for approximately 95% of all inscriptions.\n\nAlso Read: People Are Going To Start Cashing Out Bitcoin — Here's Why\n\nImage-based inscriptions account for approximately 3.5% of all inscriptions, with the remaining 1.5% consisting of other types of digital artifacts.\n\nOrdinals Activity Since March: In the first 200 days since the first inscription on Bitcoin, a total of 1.14 million image-based inscriptions have been created.\n\nThis surpasses the number of non-fungible tokens (NFTs) minted on other blockchains, such as Ethereum (CRYPTO: ETH), Solana (CRYPTO: SOL), and Polygon (CRYPTO: MATIC), since the debut of NFTs on these respective networks.\n\nHowever, it is important to note that Bitcoin's minting activity throughout the first 200 days is still much lower than the total minting activity for NFTs on other blockchains, illustrating how Ordinals still have a long way to go in terms of adoption relative to the broader NFT ecosystem.\n\nOrdinals Trading Volume: Despite the unfavorable market conditions for NFTs in 2023, Ordinals accomplished meaningful growth.\n\nBitcoin has accumulated the third-highest NFT trading volume by the network at $596.4 million.\n\nEven when excluding BRC-20s, which represent ~30% of all Ordinals volume ($187.5 million), Bitcoin remains the third most popular chain for digital collectible activity after Ethereum and Solana.\n\nOrdinals Marketplaces: The most dominant marketplaces by volume for Ordinals are now Magic Eden, Unisat, and OKX at 28%, 28%, and 38% respectively.\n\nImplications for the Future of Bitcoin: The growing popularity of Bitcoin inscriptions is a significant development for the Bitcoin ecosystem.\n\nIt suggests that Bitcoin is being used for more than just a store of value and a medium of exchange. It is also being used to store and share data, which could lead to new and innovative use cases for Bitcoin in the future.\n\nFor example, Bitcoin inscriptions could be used to create a decentralized social media platform or a decentralized storage platform. They could also be used to create new forms of digital art and collectibles.\n\nRead Next: Bitcoin To $20K, Ethereum To $1K? Prominent Venture Capitalist Predicts Market Bottom\n\nMeet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga's exclusive event - Future of Digital Assets. Tickets are flying- get yours!\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGVjcnlwdC5jby8yMDA3MzMvb25lLWdhbWUtc29sYW5hLWRvaW5nLW1vcmUtZGFpbHktdHJhbnNhY3Rpb25zLXRoYW4tcG9seWdvbtIBWmh0dHBzOi8vZGVjcnlwdC5jby8yMDA3MzMvb25lLWdhbWUtc29sYW5hLWRvaW5nLW1vcmUtZGFpbHktdHJhbnNhY3Rpb25zLXRoYW4tcG9seWdvbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Just One Game on Solana Is Doing More Daily Transactions Than All of Polygon - Decrypt",
        "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nSAGE Labs, the browser-based sci-fi game experience on Solana from the Star Atlas team, saw over 2.29 million transactions on Sunday—surpassing the total for the entire Polygon network by about 256,000 transactions.\n\nAccording to data from analytics platform Flipside Crypto, Star Atlas’ SAGE Labs experience has seen over 16 million total transactions since it launched last month. The browser game is a fully on-chain experience, with nearly every interaction requiring the user to sign with their wallet on the Solana blockchain, triggering a small gas fee to verify each transaction.\n\nSAGE Labs is a 2D space management simulation experience that’s heavy on menus, simulated resource management tasks, and data—as opposed to being a 3D immersive gaming experience like the core Star Atlas MMORPG in development.\n\nSAGE Labs has liftoff! Updated stats below. 👇 🔹 16,000,000+ Solana transactions\n\n🔹 15% of daily @solana transactions 🤯\n\n🔹 2,000,000+ DAILY transactions\n\n🔹 8,577 profiles created\n\n🔹 37,640 fleets created ➡️ Join the journey now: https://t.co/o8W50NyxsP — Star Atlas (@staratlas) October 9, 2023\n\nAD\n\nAD\n\nOn Sunday, SAGE Labs recorded 2,293,210 transactions, per Flipside. By comparison, the entire Polygon network saw 2,037,330 transactions, according to data from blockchain explorer Polygonscan. Polygon is an Ethereum scaling network.\n\nUltimately, SAGE Labs transactions alone made up about 15% of all activity on the Solana network on October 8. But while SAGE Labs’ transaction tally may indicate a sizable player pool, digging into the data suggests otherwise.\n\nSAGE Labs saw 1,442 active players on Sunday, each making roughly 1,590 transactions apiece. That’s a staggeringly high number of transactions for one player—but it’s because of how the game was designed.\n\nThe spike in SAGE Labs activity has generated some social media attention, with Twitter users debating how exactly a single game is dwarfing an entire blockchain ecosystem.\n\nAD\n\nAD\n\nIt’s unclear, however, how many of these transactions might be from bots or automated accounts. Star Atlas developer ATMTA did not immediately respond to Decrypt’s request for comment regarding whether it is able to determine if any, or how many, of SAGE’s users might be bots or otherwise automating the experience.\n\nA Star Atlas representative previously told Decrypt via email that SAGE Labs is “unlike any other ‘Web3’ game out there” because “absolutely everything is done on-chain.” When more (or all) game elements require a player to sign a transaction with their wallet, it can add up—even with a relatively small player base.\n\nA game like SAGE Labs is different from other games that deploy NFTs because many blockchain games offer an optional crypto experience—meaning that players aren’t forced to connect a wallet or spend crypto to play.\n\nBut SAGE Labs requires a Solana-compatible wallet to play, as well as some SOL or Star Atlas’ ATLAS tokens in said wallet in order to create a character and progress through the experience.\n\nStar Atlas CEO Michael Wagner previously told Decrypt that developers can use SAGE Labs to build their own UI or modify the game’s mechanics to create their own experience.\n\nWhile SAGE Labs is seeing substantial traffic, Star Atlas has faced economic challenges this year. Back in July, it laid off 73% of its staff. At the time, Wagner told Decrypt that the layoffs were needed to adapt to the market conditions and to reduce overhead to “accommodate a long runway” for Star Atlas’ continued development."
    }
]