[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8wOS90b3AtYW5hbHlzdC1wcmVkaWN0cy1wdWxsYmFja3MtZm9yLXNvbGFuYS1hbmQtYWx0Y29pbnMtdXBkYXRlcy1vdXRsb29rLW9uLW9uZS1ldGhlcmV1bS1iYXNlZC1jcnlwdG8tYXNzZXQv0gGPAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzA5L3RvcC1hbmFseXN0LXByZWRpY3RzLXB1bGxiYWNrcy1mb3Itc29sYW5hLWFuZC1hbHRjb2lucy11cGRhdGVzLW91dGxvb2stb24tb25lLWV0aGVyZXVtLWJhc2VkLWNyeXB0by1hc3NldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Top Analyst Predicts Pullbacks for Solana and Altcoins, Updates Outlook on One Ethereum-Based Crypto Asset - The Daily Hodl",
        "content": "A crypto analyst who nailed the top of the 2021 Bitcoin (BTC) bull market says Solana (SOL) will likely pull back after a big rally.\n\nPseudonymous analyst Pentoshi tells his 706,400 followers on the social media platform X that Solana could dip by more than 25% from its current value.\n\n“Whether it goes higher, or lower first. I think you’ll get another shot to buy $35-$36 and maybe even $32.”\n\nSolana is trading for $43.05 at time of writing.\n\nThe trader also predicts that other surging altcoins will likely see up to 20% pullbacks.\n\n“In regards to alts, many of these will have massive 15-20% pullbacks in due time. And a lot of people are sidelined. Your opportunities will come.”\n\nNext, the trader weighs in on the confidential transaction blockchain project Beam (BEAM), noting key milestones in the ecosystem.\n\n“BEAM has already had its first buyback and burn worth $158,000 since the migration. To date 37%+ has been burned and the treasury is up another 2.5 million-plus this month inching closer to the 100 million mark. Expecting at least another million USD to be burned by end-of-year at this pace.”\n\nThe trader also says he is bullish on BEAM.\n\n“Expecting a few solid updates by end-of-year.”\n\nBEAM is worth $0.00534 at time of writing, up 10.6% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZmluYm9sZC5jb20vY2hhdGdwdC1wcmVkaWN0cy1zb2xhbmEtcHJpY2UtZm9yLXN0YXJ0LW9mLTIwMjQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "ChatGPT predicts Solana price for start of 2024 - Finbold - Finance in Bold",
        "content": "Amid a renewed wave of optimism in the cryptocurrency market that has seen most digital assets trading in the green, Solana (SOL) has been one of the best performers, rallying nearly 10% in a single day, and the artificial intelligence (AI) platform ChatGPT suggests even more gains for the start of 2024.\n\nAs it happens, Finbold has consulted ChatGPT-4, the most recent model of OpenAI’s famous product, for insights regarding the price of the seventh-largest cryptocurrency by market capitalization, and it delivered some useful insights from the viewpoint on November 9.\n\nChatGPT’s SOL prediction\n\nSpecifically, based on the online information accessible to it, including historic price trends, technical analysis (TA), and expert predictions, the AI platform has set an optimistic price range of Solana to “anywhere from $50 to $150 by the start of 2024.”\n\n“A historic price analysis indicates that Solana had a remarkable price surge from its inception in 2020 until now, which, if continues to follow, Solana might see high price growth by 2024.”\n\nFrom a TA perspective, ChatGPT pointed out Solana’s track record as “a strong project backed by robust technology,” which, in addition to the continuous development and projects built on its network, could push the price of its cryptocurrency upward, depending on the growth and success of these projects.\n\nSolana price analysis\n\nAs things stand, Solana was at press time changing hands at the price of $47.57, up 9.98% in the last 24 hours, adding up to the 7.58% gain across the previous seven days and rallying a whopping 115.39% in the last month alone, according to the latest charts on November 9.\n\nSolana 30-day price chart. Source: Finbold\n\nMeanwhile, the ‘buy and sell indicator’ for Solana has recently flashed a massive buy signal despite the reports that wallets owned by disgraced crypto exchange FTX and crypto investment firm Alameda Research involved in the criminal fraud scandal were dumping their SOL.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLXVwLTEwLWFzLXByaWNlLWhvdmVycy1pbi11bmNoYXJ0ZWQtdGVycml0b3J50gFLaHR0cHM6Ly91LnRvZGF5L3NvbGFuYS1zb2wtdXAtMTAtYXMtcHJpY2UtaG92ZXJzLWluLXVuY2hhcnRlZC10ZXJyaXRvcnk_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Solana (SOL) up 10% as Price Hovers in Uncharted Territory - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSolana (SOL) is on the verge of making history following its 12.56% surge in the past 24 hours to $48.55. This price point extends its overall gains for the year to 388%.\n\nSoaring toward history\n\nSolana has had an exceptional showing thus far this year as the price has made a dramatic recovery since it touched its lowest point at $9.961 earlier in the year. The initial sentiment hinges on the susceptibility of SOL to the bankruptcy events that surrounded the FTX Derivatives Exchange.\n\nKnown as one of its largest holders at the time, normalcy started returning to the market when the court approved sales of FTX assets featuring some altcoins, including Solana. With the sell-off, SOL buyers established a bottom of $17 on Sept. 12, a point that served as a springboard to where SOL is today.\n\nUndoubtedly, the current price growth is the biggest for the coin thus far this year, returning to the level it traded at in early May 2022, long before FTX's implosion. From the level it is at at the moment, SOL is at its prime to mark a new history for the year, as any further resurgence will activate the greed existing in the market moving forward.\n\nLong-term HODLers are beneficiaries\n\nSolana has a lot of supporters with a dedicated community. Those who kept faith in the protocol in its darkest days are the biggest beneficiaries today.\n\nData from CoinMarketCap shows that SOL is now 81.64% away from retesting its all-time high (ATH) of $260.06. With 118% growth in the past month and a 129% surge in the trailing six-month period, Solana has returned a profit to anyone who bought the coin after FTX imploded.\n\nThis is no small feat as even Bitcoin, with its 79% year-to-date (YTD) rate of gain, cannot currently boast of Solana's rate."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9ldGhlcmV1bS1yaXBwbGUtYW5kLXNvbGFuYS1wcmljZS1mb3JlY2FzdC1ldGgtYnJlYWtzLTJrLWJ1bGwtcnVuLW9yLWJ1YmJsZS0xMzg3NjY00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Ethereum, Ripple and Solana Price Forecast: ETH Breaks $2K, Bull Run or Bubble? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vY29pbmdhcGUuY29tL2VkdWNhdGlvbi9hbmF0b2x5LXlha292ZW5rby_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Who is Anatoly Yakovenko? Solana Founder's Net Worth, Career, and Personal Life - CoinGape",
        "content": "Yakovenko’s technical knowledge combined with innovation has resulted in the scalability-focused Solana blockchain. However, the Ukraine-based founder says that he cannot imagine a world where Solana succeeds because Ethereum 2.0 fails. Let us learn more about his career journey, education, net worth, and personal life in this article.\n\nAnatoly Yakovenko is the founder and CEO of one of the Ethereum killers, Solana blockchain. Similar to many of us and other blockchain founders, he made his way from working in a traditional industry to the blockchain industry. Having extensive working experience as a software engineer at Qualcomm, Yakovenko built the high-performance Solana blockchain.\n\nAnatoly Yakovenko was born in Ukraine but completed his education and established his career in the United States. He graduated from the University of Illinois Urbana-Champaign with a computer science degree. Because of the ongoing dot-com bubble during his education, Yakovenko was advised not to pursue computer science. But, it was a good thing he didn’t listen to them. Otherwise, we wouldn’t have one of the popular Ethereum killers, Solana blockchain today.\n\nCareer Journey of Anatoly Yakovenko\n\nDuring his education at the University of Illinois, Yakovenko founded a Voice Over Internet Protocol (VOIP) startup named Alescere. After working with it for more than 3 years, Yakovenko joined Qualcomm as a software engineer and worked with it under prominent roles for more than a decade.\n\nAt Qualcomm, Yakovenko worked on the development of advanced technologies such as virtual and augmented reality products, 3D cameras, and operating systems of mobile devices. After working with several other companies such as Mesosphere and Dropbox, the journey of Solana started.\n\nCEO of Solana Labs\n\nYakovenko was one of the early adopters of Bitcoin and Ethereum and kept a close eye on the emerging blockchain industry. To address the scalability issues and slow transaction processing times of the legacy blockchain networks, Yakovenko founded a new blockchain at the end of 2017. By joining forces with the Qualcomm alumni Greg Fitzgerald, Stephen Akridge, and Raj Gokal, Yakovenko founded the Solana blockchain, named after the popular Solana beach in California.\n\nYakovenko introduced the Proof-of-History (PoH) mechanism with Solana instead of relying on the existing Proof-of-Work (PoW) and Proof-of-Stake (PoS) consensus mechanisms. This new method promised scalability with faster transaction execution at low fees. The adoption of Solana increased significantly in 2021 and the Solana price went from nearly $2 to $250 in 2021. Despite the ongoing Ethereum 2.0 upgrades, Solana was believed to be the Ethereum Killer throughout the year.\n\nHowever, Solana had to face networth outage issues several times after its price rally. The network couldn’t process the increasing number of transactions, while still being the blockchain with a high TPS of 65,000. However, the network was up and running within 24 hours and Yakovenko claimed that the incident showed the strength of the network.\n\nSolana network performance improved significantly in 2023 with no signs of network outages and had 100% uptime in the first half of the year. The network has been expanding with more and more applications such as Web3 games, NFT projects, and others, along with network developments. And, Anatoly Yakovenko continues to be the CEO of the blockchain.\n\nAchievements\n\nApart from his extensive career journey at Qualcomm and other companies, Yakovenko holds patents to some of the crucial technological developments. The first one was filed in 2017 for general purpose lossless data compression using a recurrent neural network. And, the second patient of Yakovenko was filed in 2018 for lossless compression of content item using a neural network trained on content item cohorts."
    }
]