[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8wNy9hc3NpZ25tZW50LWNyeXB0by10cmFkZXItc2F5cy1hdmFsYW5jaGUtYXZheC10by1zdXJnZS1ieS1kb3VibGUtZGlnaXRzLXVwZGF0ZXMtb3V0bG9vay1vbi1zb2xhbmEtc29sL9IBigFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8wNy9hc3NpZ25tZW50LWNyeXB0by10cmFkZXItc2F5cy1hdmFsYW5jaGUtYXZheC10by1zdXJnZS1ieS1kb3VibGUtZGlnaXRzLXVwZGF0ZXMtb3V0bG9vay1vbi1zb2xhbmEtc29sL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Crypto Trader Says Avalanche (AVAX) To Surge by Double Digits, Updates Outlook on Solana (SOL) - The Daily Hodl",
        "content": "A closely followed crypto strategist is predicting Avalanche (AVAX) will undergo a massive surge due to one main reason.\n\nPseudonymous crypto analyst Altcoin Sherpa tells his 196,600 followers on the social media platform X that the Ethereum (ETH) rival could increase by more than 12% from its current value.\n\nThe analyst says that Avalanche is in an uptrend after the launch of Friend.tech rival Stars Arena, a decentralized social finance application (SocialFi), on the AVAX blockchain. Friend.tech launched on Coinbase’s Base blockchain.\n\n“AVAX: buy AVAX due to Stars Arena. $12 eventually maybe.\n\nIf Base had a token during FT (Friend.tech), that would have also done extremely well.\n\nPeople who don’t want exposure to Stars Arena might just buy AVAX and ride this instead.”\n\nLooking at his chart, the trader expects Avalanche will run into resistance at around its current value and dip to $10.20 before surging past $12 in November.\n\nAVAX is worth $10.66 at time of writing, up 4.7% in the last 24 hours.\n\nAccording to the trader, it remains unclear if Stars Arena has a strong future.\n\n“Creator/influencer time/energy is running thin in regards to overall social network fragmentation. Before, all information/alpha/conversation was shared on Twitter. Now? People sharing on FT, Stars Arena, etc. Is it possible for many of these social apps to win? Hard to say.”\n\nNext, the trader says Ethereum challenger Solana (SOL) will likely dip to lower levels before another move to the upside.\n\n“SOL: I feel confident these lower levels are going to come for Solana. [It] should be good dip buying opportunities as long as BTC (Bitcoin) holds up.\n\n$21-$22 are the areas.”\n\nLooking at his chart, the trader uses Fibonacci retracement levels to pick a possible dip to the $21 range.\n\nSolana is trading for $23.42 at time of writing, up 2.8% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3Lm1pcnJvci5jby51ay8zYW0vY2VsZWJyaXR5LW5ld3MvYmVuaWRvcm0tc3RhcnMtbG92ZS1saXZlcy1hd2t3YXJkLTMxMDY1MzI30gFaaHR0cHM6Ly93d3cubWlycm9yLmNvLnVrLzNhbS9jZWxlYnJpdHktbmV3cy9iZW5pZG9ybS1zdGFycy1sb3ZlLWxpdmVzLWF3a3dhcmQtMzEwNjUzMjcuYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Benidorm stars' love lives from awkward encounters to age-gap love - The Mirror",
        "content": "Benidorm star Asa Elliott shot to fame as the singer in the fictional Solana Hotel on the hit ITV series. However, it seems that singing in a Benidorm bar has given him more than just stardom because Asa, 41, actually met his wife Natalie Elliott while he was on stage serenading the crowds.\n\n\"I met my wife in Benidorm,\" Asa exclusively told the Mirror at last year's Benicon, a convention for the fans and cast of the hit show which ran from 2007 to 2018. \"I was just performing out here and she'd never seen the TV show, which helped. Then she came to see me singing and the rest is history,\" the stars added.\n\n\n\nBut Asa's wife isn't in the showbiz industry herself, and has a very different career to her singer husband. \"My wife is a sexual health worker, she does all the testing. Its very interesting and very different. She's not in the entertainment industry,\" he explains. Asa and his wife have two children, Buddy, born in 2020, and Rockie whom Natalie gave birth to in October of last year. Asa's wife shared the news of the family's new arrival on Twitter at the time, writing, \"Our littlest Elliott, she's going to be a Rockstar. 8lb 8.5oz of pure sass.\" Meanwhile, Asa revealed the baby's name with a funny clip that was inspired by the flick Rocky starring Sylvester Stallone.\n\nImage: Kennedy News and Media) Kennedy News and Media)\n\nAside from a brief stint as an ASDA delivery driver during the pandemic Asa has continued working as singer since his stint on the hit show, often entertaining people on cruise ships. However, he isn’t the only cast member of Derren Litten's hit ITV show to find love in the Spanish city of Benidorm.\n\nCrissy Rock, who played fiery hotel manageress Janey York in the sitcom, also revealed to the Mirror that she met her husband Julian Buck in the garden of a Benidorm hotel in 2017. She exclusively told the Mirror, \"We were all sitting outside. There were loads of people there and before we knew it was just me and him sitting there.\"\n\n\n\nImage: instagram.com/crissyrock_) instagram.com/crissyrock_)\n\n\"Then he was talking to me and he said, 'Do you mind if I keep in touch as a friend?'\" said the comedian, 65. \"I never looked at him that day and thought, 'I was going to marry him'. It just happened, we are like mates. Sometimes I think, \"Does he really love me?'\" The pair got married in 2018, and Crissy explains that the businessman is \"lovely\" and \"dead funny\" before adding: \"He's ten years younger, I don't even know what he sees in me!\"\n\nAdditionally on September 28 it was revealed that fellow co-stars Laila Zaidi, 30, and Adam Gillen, 38, who played Liam and Cyd on the show, were engaged after falling in love on set back in 2018. Laila took to Instagram to share the happy news that Adam had proposed in Croatia, by posting a snap of the pair smiling broadly as she showed off her dazzlingly engagement ring."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vcHVuY2huZy5jb20vY2hhaW5saW5rLWxpbmstc3RhbGxzLWF0LTE3LXNvbGFuYS1zb2wtaW5xdWJldGEtcXViZS1yZWFkeS1mb3ItaW5jcmVkaWJsZS1zdXJnZS_SAWhodHRwczovL3B1bmNobmcuY29tL2NoYWlubGluay1saW5rLXN0YWxscy1hdC0xNy1zb2xhbmEtc29sLWlucXViZXRhLXF1YmUtcmVhZHktZm9yLWluY3JlZGlibGUtc3VyZ2UvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Chainlink (LINK) Stalls at $17; Solana (SOL), &InQubeta (QUBE) Ready for Incredible Surge - Punch Newspapers",
        "content": "Chainlink (LINK) was a good crypto to buy in 2023 as prices grew 173%, but its momentum dwindled in December, with prices barely growing. A strong pullback occurred after prices broke $17, and prices are now down to around $15.\n\nMeanwhile,InQubeta (QUBE) and Solana (SOL) have emerged as top altcoins to invest in. SOL prices rose by 974% in 2023, and its market share grew considerably. It’s one of the best DeFi projects around, and it might even enjoy more growth in 2024.\n\nQUBE prices surged 175% in 2023, and it’s set for 60% more growth before tokens launch on exchanges. Projections have QUBE prices growing as much as 10,000%, especially given how undervalued tokens are at their present price of $0.01925.\n\nTop altcoins to invest in: Analysts dub InQubeta a good crypto to buy in 2024\n\nInQubeta could be 2024’s biggest winner thanks to the creative way it intends to make artificial intelligence (AI) investments more accessible. The project is hosted on the Ethereum (ETH) network, allowing it to share its security and functionality.\n\nInQubeta is the first decentralized finance platform to focus on artificial intelligence, which sets it up for tremendous growth as investments in the space grow considerably. AI investments presently exceed $120 billion, and that figure is estimated to reach $1.5 trillion by 2030.\n\nThe increasing viability of AI is responsible for this tremendous surge in investment capital, and InQubeta is well-positioned to play a significant role in directing some of these funds to startups by providing a more efficient and accessible investment medium.\n\nInvesting in AI today is like investing in online media giants like Netflix during the internet’s early days. AI will reshape the world in the coming years, and those who invest in some of the startups emerging today will earn substantial profits in the coming years.\n\nA hassle-free investment protocol\n\nInvestors don’t have to worry about unreasonable requirements when investing in AI through InQubeta. They simply purchase QUBE and use it to buy ERC20 coins that signify investment opportunities.\n\nThese tokens are the blockchain’s version of stocks, and they appreciate over time as their makers grow their market capitalizations.\n\nERC20 coins are made by AI startups seeking capital, fractionalized, and sold on the NFT marketplace. Investors who buy these tokens can resell them in the marketplace whenever they choose.\n\nSolana (SOL) is one of the top crypto coins to buy right now\n\nSolana was once one of the many rivals of the Ethereum network, but it’s now its main competitor, thanks to the massive growth the project enjoyed in 2023. It closed out the year extremely strong, with 79% growth in December, and many expect similar growth patterns in 2024 as Bitcoin’s (BTC) price increases are expected to encourage bullish sentiments all over the cryptocurrency space.\n\nSolana provides a DeFi ecosystem that has been a massive success with users and the network is constantly improving to better serve its uses.\n\nChainlink (LINK) leaves investors worried after poor December showing\n\nChainlink provides a protocol that allows blockchain networks to communicate with external data sources, allowing developers to create hybrid smart contracts that use variables from the external world for their computations.\n\nIts utility should push LINK prices upward in 2024, but it’s highly unlikely to enjoy as much growth as QUBE or SOL.\n\nSummary\n\nQUBE and SOL are two of the top altcoins to invest in right now to earn major profits in 2024. SOL prices could grow by more than 1,000%, while QUBE prices could surge as high as 10,000% as investors flock to its ecosystem for easier access to AI investments.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9hbGwteW91LW5lZWQtdG8ta25vdy1hYm91dC1zb2xhbmFzLWxhdGVzdC11cGdyYWRlL9IBTGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9hbGwteW91LW5lZWQtdG8ta25vdy1hYm91dC1zb2xhbmFzLWxhdGVzdC11cGdyYWRlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "All you need to know about Solana’s latest upgrade - AMBCrypto News",
        "content": "The new upgrade allows ZK proofs to enhance runtime support for Solana.\n\nWith encryption on SPL tokens, users can make private transactions without compromising on security.\n\nSolana [SOL] has finally adopted a new update to its validator client known as the Solana v1.16. In an article posted on 6 October, the project’s ultimate developer platform Helium, wrote a detailed explainer on what the latest upgrade is about.\n\nRealistic or not, here’s SOL’s market cap in ETH terms\n\nZK-SNARKS to the rescue\n\nBefore going into the attributes, Helius gave a step-by-step report of how the v1.16 was tested. According to the post, the upgrade was in development for ten good months with efforts by both volunteers and canary nodes.\n\nFor context, a canary node involves the testing of a new feature with real users before it’s eventually deployed. Helius noted that the Solana v1.16 had been running on Testnet since 7 June.\n\nThe development team, however, noted that there were some issues with the RPC nodes and a bit of security.\n\nBut with the help of the canary node, Solana was able to call in Halborn a blockchain security solution firm to audit the upgrade before it went live on Mainnet Beta.\n\nInterestingly, the features of the new upgrade constituted some of the benefits users and validators have been hoping Solana integrates.\n\nFirst, Solana noted that the v1.16 upgrade allows for the effective implementation of Zero-Knowledge Succinct Non-Interactive Argument of Knowledge (ZK-SNARKS). Typically, ZK features are known to be linked with Ethereum [ETH] scaling solutions.\n\nHowever, Solana’s decision to implement it was because of its mission to enhance runtime support for ZK computations. Hence, the report mentioned that,\n\n“These operations are standardized on Ethereum through EIP-196, EIP-197, and EIP-198. The introduction of alt_bn128 syscalls is a significant leap towards bridging the compatibility gap.”\n\nIndexing and more for validators\n\nAnother feature introduced with the upgrade is confidential transfers which also need the Zero-Knowldege input. With Solana’s confidential transfers, users can improve privacy and encrypt transactions and balances of SPL tokens.\n\nSPL is an acronym for Solana Program Library. They are similar to Ethereum’s ERC-20 tokens. But what SPL tokens do is a bit different from ERC-20 tokens. Still, they follow a specific standard for creating and managing tokens on the Solana blockchain.\n\nFor validators, the v1.16 upgrade automatically reduces the Random Access Memory Usage (RAM) for indexing accounts. Since the deployment of the upgrade, validators now run on 39 GB of RAM instead of the previous 120GB. This was also confirmed by Yanshu, a developer from Luganodes.\n\n1/\n\nWe've been closely monitoring memory requirements for running @solana nodes & it's remarkable how they've dropped since the release of v1.16! ? We recently upgraded our nodes to the latest v1.16.14, which comes with host of performance improvements & enhanced resiliency?? pic.twitter.com/D1B423y0Ey — Yanshu | Luganodes (@0xyanshu) September 28, 2023\n\nAt press time, data from Solana Beach showed that there were 1,993 validators on the blockchain. Also, 81.1% of the nodes were operating on v1.16.14 while 12.14% upgraded to v1.16.15.\n\nHow much are 1,10,100 SOLs worth today?\n\nOther features of the new upgrade include better resource allocation for deploying applications. Also, v.1.16 addresses introduced the Epoch Account Hash, which allows the Solana network to increase security by identifying corrupt data.\n\nWhile Solana admitted that the ZK integration was long overdue, it noted that it won’t rest on its oars. In concluding the report, its development arm noted that Solana could be working on releasing another upgrade in the next three months, and v1.17 could be next."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9hLXJ1bmRvd24tb2Ytd2hhdC10cmFuc3BpcmVkLXdpdGgtYnRjLWV0aC1hbmQtdGhlLXJlc3QtaW4tcTMv0gFXaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2EtcnVuZG93bi1vZi13aGF0LXRyYW5zcGlyZWQtd2l0aC1idGMtZXRoLWFuZC10aGUtcmVzdC1pbi1xMy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "A rundown of what transpired with BTC, ETH, and the rest in Q3 - AMBCrypto News",
        "content": "Solana outperforming Bitcoin and Ethereum was the major highlight of the last quarter.\n\nOP and MKR had their highs as there were more to look forward to in Q4.\n\nThe third quarter of 2023 (Q3) was full of twists and turns for the crypto market led by Bitcoin [BTC]. At some point, market participants had much to celebrate. Other times, the conviction that the market would either be favorable or maintain a good level of stability dampened.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-2024\n\nCrypto assets decouple from others\n\nInterestingly, 21Shares released an in-depth report of what went down in the sector across all levels. To start with, the largest suite of cryptocurrency Exchange Traded Products (ETPs), mentioned that macroeconomic factors remained in limbo despite the Fed interest hike to 25 basis points (bps).\n\nHowever, in September, the rate did not increase, leaving open the possibility of an interest hike in the latter months. On a Quarter-on-Quarter (QoQ) basis, Bitcoin decreased by 11.52% while Ethereum [ETH] fell by 13.60%. The S&P 500, which had a strong correlation with BTC and ETH at one point moved in the opposite direction, leading 21Share to conclude that,\n\n“Crypto has been historically negatively correlated with this index, signaling that investors view it as a risky asset class. However, as crypto expands on use cases, we are seeing increasing decorrelation within the asset class itself.”\n\nSolana beats Bitcoin and Ethereum\n\nBut there was Solana [SOL], which faced numerous challenges and FUD lately, outperformed both Bitcoin and Ethereum. One of the major reasons for the token’s impressive performance was its partnership with payment platform Visa.\n\nAround September, the credit card giant announced that it had added support for the Solana blockchain for Circle [USDC] transactions. According to Visa, its decision to integrate Solana was because of the blockchain efficiency to process as high as 2,000 Transactions Per Second (TPS).\n\nConsequently, SOL price was the only part of the ecosystem positively affected. According to data shared by 21Shares, Solana’s Total Value Locked (TVL) also recorded a notable increase in the quarter.\n\nThe TVL measures the unique deposits of assets locked or staked in a protocol. When the TVL increases, it implies a rise in liquidity deposits into dApps under a protocol.\n\nConversely, a decrease suggests a dearth of liquidity. In Solana’s case, the increase means that market participants were back to trusting the project.\n\nOP and MKR had their times\n\nIt also seemed that it was only Solana which registered a 90-day increase in TVL out of the top project. However, two projects that could not be ignored all through the quarter were MakerDAO [MKR] and Optimism [OP].\n\nFor Optimism, its native token was able to maintain a 7.43% increase in the last 90 days. This hike could be linked to several developments that happened within the blockchain. For instance, there has been a surge in the adoption of the OP Stack among others.\n\nMKR, on the other hand, could boast a 79% hike in Q3, thanks to the increase in its annualized revenue and interest from Maker’s involvement with Real World Assets (RWAs). Ethereum also made some notable advancements in the quarter especially as it concerns staking and scaling solutions on the blockchain.\n\nEthereum and Chainlink days\n\nFor instance, to combat the centralization of the blockchain, Ethereum leveraged the Distributed Validator Technology (DVT). The DVT allows multiple node operators to run a single validator. This is done to reduce the risk of compromise associated with the validators without affecting the blockchain.\n\nFurthermore, the liquid staking sector continues to dominate the activity on the blockchain. According to the report, liquid staking accounted for 42.8% of all activity with Lido Finance [LDO] leading the cohort.\n\nMeanwhile, Ethereum has also delayed its next major upgrade, the Dencun upgrade, till next year. As per scaling on the blockchain, Eclipse, a customizable rollup provider introduced a modular scaling solution. Interestingly, this development brought Solana and Ethereum together.\n\n21Shares noted that,\n\n“In the context of Eclipse, the L2 architecture will use Ethereum for settlement, while leveraging Solana for execution on the back of its parallel processing capabilities for high performance.”\n\nAnother project that experienced major development in the quarter was Chainlink [LINK]. But this time, it introduced a study explaining how tokenization of world assets on the blockchain can improve adoption.\n\nAs shown above, Chainlink explained that the Cross Chain Interoperability Protocol (CCIP) could help with the infrastructure for dollar stablecoins noting that,\n\n“The initiative is built around three pillars – educational content to facilitate understanding of the ecosystem, development of best practices and industry recommendations to promote a compliant industry, and actively work toward building on-chain infrastructure that scales to the needs of all stakeholders.”\n\nQ4 could bring more\n\nGoing into the fourth quarter (Q4), there seems to be a lot to look forward to. One example is the integration of the Bitcoin Lightning Network on Coinbase. This is to ensure quicker and more effective BTC transactions and cross-border payments.\n\nHowever, on-chain data from TheBlock showed that the activity with the Bitcoin scaling solution decreased at one point. But its recent resurgence means that market players who trust the Lightning Network have increased and may continue to do so.\n\nRealistic or not, here’s SOL’s market cap in ETH terms\n\nAnother aspect to consider is Solana’s possible revival. It is no news that the blockchain’s reaction to the FTX collapse was very bad. However, with several key developments in Q3, it is possible to see an increase in Solana adoption. With respect to this, 21Shares noted that,"
    }
]