[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9zb2wtZXhwbG9kZXMtb3Zlci0xMC1kYWlseS1pcy0zMC1pbW1pbmVudC1zb2xhbmEtcHJpY2UtYW5hbHlzaXMv0gFdaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL3NvbC1leHBsb2Rlcy1vdmVyLTEwLWRhaWx5LWlzLTMwLWltbWluZW50LXNvbGFuYS1wcmljZS1hbmFseXNpcy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "SOL Explodes Over 10% Daily, is $30 Imminent? (Solana Price Analysis) - CryptoPotato",
        "content": "Solana broke above $24 and escaped the downtrend in the process.\n\nSolana Price Analysis\n\nKey Support levels: $21, $24\n\nKey Resistance levels: $26, $30\n\nSOL started a major breakout after successfully escaping the resistance at $24, which has now turned into support. Another push above $26 would open the way for the price to reach $30 next. The current price action is bullish, and the momentum favors buyers.\n\nTrading Volume: The sustained buy volume in the past four days has allowed Solana to move higher.\n\nRSI: The daily RSI is making higher highs and inches closer to the overbought area above 70 points.\n\nMACD: The daily MACD painted a bullish cross yesterday, which signals a major move higher becomes more likely.\n\nBias\n\nThe bias for SOL is bullish.\n\nShort-Term Prediction for SOL Price\n\nWith renewed momentum coming back to Solana after a short correction, it appears that the price is ready for higher levels."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL2NyeXB0b2N1cnJlbmN5L3N0b3J5L2NyeXB0by1wcmljZXMtdG9kYXktYml0Y29pbi1hYm92ZS10aGUtMjQwMDAtbWFyay1zb2xhbmEtYW5kLXNoaWJhLWludS1zaG93LXByaWNlLWdhaW5zLTIzMzcwMzYtMjAyMy0wMi0yMNIBnAFodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL2FtcC9jcnlwdG9jdXJyZW5jeS9zdG9yeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWJpdGNvaW4tYWJvdmUtdGhlLTI0MDAwLW1hcmstc29sYW5hLWFuZC1zaGliYS1pbnUtc2hvdy1wcmljZS1nYWlucy0yMzM3MDM2LTIwMjMtMDItMjA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Crypto prices today: Bitcoin above the $24,000 mark, Solana and Shiba Inu show price gains - India Today",
        "content": "Most of the top cryptocurrencies witnessed mixed trends on the first day of the week. Bitcoin, the world’s most popular and largest crypto, was down by 0.85 percent over the last 24 hours and is trading at $24,496.36 at the time of writing this article (1030 IST). Ethereum, its closest rival, fell by 0.50 percent and is presently trading at $1,689.25.\n\nOther top crypto coins that were trading with cuts on 20 February included XRP, Polygon, Litecoin, Toncoin, and Cosmos, which declined by 0.58 percent, 1.10 percent, 1.84 percent, 0.32 percent, and 2.23 percent, respectively. Contrastingly, Solana registered a 12.54 percent growth in its previous day's value. Also, Polkadot, Avalanche, Uniswap, Chainlink, and Filecoin registered gains today.\n\nAt the time of writing, the global crypto market cap decreased by 0.23 percent to $1.12 trillion since the past 24 hours. However, the total crypto market volume stood at $63.07 billion, having witnessed an increase of 51.96 percent over the last day.\n\nGainers and decliners of the day\n\nToday's top gainer was Stacks which soared by 75.17 percent. Others in the green zone consist of Conflux, Neo, and VeChain, up by 36.02 percent, 22.77 percent, and 10.37 percent, respectively. On the other hand, Blur and Render Token were among the top losers, decreasing by 6.03 percent and 5.72 percent, respectively.\n\nMeme coins trade mix\n\nOn Monday, meme coins displayed mixed momentum. Elon Musk’s favourite, Dogecoin, was down by 1.04 percent to $0.08783, while its rival, another canine-based meme coin, Shiba Inu, grew by 1.55 percent to $0.00001348.\n\nMetaverse tokens in the green\n\nA majority of the top metaverse tokens showed price growth today. Popular tokens like ApeCoin was up by 1.43 percent, Decentraland increased by 0.58 percent, Axie Infinity gained by 1.24 percent and The Sandbox rose by 4.17 percent.\n\nPublished By: Jasmine anand Published On: Feb 20, 2023 --- ENDS ---"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3Mvc29sYW5hL2hlcmVzLXRoZS1yZWFzb24tYmVoaW5kLXNvbGFuYS0xMi1qdW1wL9IBT2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3Mvc29sYW5hL2hlcmVzLXRoZS1yZWFzb24tYmVoaW5kLXNvbGFuYS0xMi1qdW1wL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 17:01:57 GMT",
        "title": "Here’s The Reason Behind Solana’s (SOL) 12% Jump - NewsBTC",
        "content": "Solana (SOL) saw a sudden 12% jump coming out of the weekend which sent the digital asset’s price rocketing toward $30. This was obviously a welcome development for supporters of the cryptocurrency but what was behind this rapid surge in the price?\n\nWhy Solana Pumped By 12%\n\nOn Monday, the Helium Network revealed that it will be migrating to the Solana blockchain. This news was corroborated by the official Solana Twitter handle, sparking a wave of positivity across the entire community.\n\nRelated Reading\n\nWhy Ethereum Price Could Reach $1,800 Before The Rally Burns Out 1 year ago\n\nIn the official blog post shared by Helium, it said that the migration to the new Layer 1 blockchain would happen in a month on March 27th. It comes after the Solana community approved the HIP-70 which would allow the Helium network to scale on Solana.\n\n“The completion of the migration marks a new era for the Helium Network, enabling it to achieve greater scale and truly become a network of networks,” Helium said in the blog post.\n\nHelium is already growing and is becoming a popular provider with almost 1 million hotspots, the company said. It also added that its move to Solana was brought about by the fact that the blockchain provided it the speed and scale it would need to operate on a blockchain while enabling utility.\n\nHelium Network News Spurs SOL Recovery\n\nSolana’s recovery over the weekend sent the price back to pre-FTX collapse levels to a local peak of just under $27. This recovery arguably puts SOL at a fair value where it would be if it wasn’t for the FTX implosion. Now, SOL is now able to contend with competitors as it is seeing reasonable gains.\n\nRelated Reading\n\nBitcoin Price Gets Rejected At $25,000, But Is This The End? 1 year ago\n\nFor the future bull case for the cryptocurrency, the rally was triggered by just Helium’s announcement. The migration is yet to be completed, so there could be more recovery to be seen in the one month leading up to the official migration.\n\nSolana’s market cap is now sitting at $9.9 billion which makes it the 11th largest cryptocurrency by market cap. It is also the best-performing coin of the top 15 cryptocurrencies by market cap in the last week, surpassing MATIC’s 27% with weekly gains of 28.77%.\n\nAt the time of writing, SOL is still holding steady above $26 after recording over 12% in the last day alone.\n\nSOL price rallies above $26 | Source: SOLUSD on TradingView.com"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdS50b2RheS9zb2xhbmEtc29sLXVwLTEyLWZvbGxvd2luZy10aGlzLW1ham9yLWFubm91bmNlbWVudC1kZXRhaWxz0gFOaHR0cHM6Ly91LnRvZGF5L3NvbGFuYS1zb2wtdXAtMTItZm9sbG93aW5nLXRoaXMtbWFqb3ItYW5ub3VuY2VtZW50LWRldGFpbHM_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "Solana (SOL) up 12% Following This Major Announcement: Details - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSolana (SOL) is starting the week on a very bullish note, with its price up 12.62% to $26.61, according to data from CoinMarketCap. Per its current price action, Solana is now up by more than 26% over the trailing seven-day period, doubling its rank as one of the best-performing Layer-1 protocols for this year.\n\nAdvertisement\n\nThe growth in the price of Solana over the past week can be traced to positive investor sentiment following the recent revelation that Helium network is planning a migration to Solana. Solana confirmed the news earlier today, revealing the migration will be completed at the end of the first quarter.\n\nHelium is a decentralized blockchain-powered network for Internet of Things (IoT) devices. Using the proof-of-coverage (PoC) consensus mechanism, the protocol powers a ton of hotspots for devices, deliberately growing its utility since it was launched back in 2019.\n\nAccording to Solana, Helium will help onboard nearly one million hotspots worldwide across the LoRa and 5G networks, based on this integration. The possibilities of this integration will know no bounds as Helium may also be used to power the much-anticipated Solana Phone Saga.\n\nStarting on right foot\n\nThe sustained growth of Solana is obviously the biggest for the top 15 digital currencies this morning. This is a good way to start the week as regulatory pressures from the United States are far from being abated.\n\nAs a Layer-1 protocol, Solana is very focused on the growth of its network, and it appears it is now the destination for decentralized physical infrastructure networks (dePIN). With most L1s still in their infancy, being known as the go-to blockchain for such important service providers as Helium and the Hivemapper Network is a way to pick a niche in order to connect with the global digital tech ecosystem.\n\nWhile many blockchain protocols have their strength, Solana is leading others in this regard."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vZmluYm9sZC5jb20vYWktc2V0cy1zb2xhbmEtcHJpY2UtZm9yLXRoZS1lbmQtb2YtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Feb 2023 08:00:00 GMT",
        "title": "AI sets Solana price for the end of 2023 - Finbold - Finance in Bold",
        "content": "Solana (SOL) was one of the fastest-growing cryptocurrencies in 2021, rising from less than $1 to over $200, with the project gaining a lot of attention for its lightning-fast transaction rates, low fees, and attracting a lot of developers to build on its blockchain.\n\nAlthough decreasing from as high as $170 in January 2022 to as low as $9 in late 2022, the SOL has since been on a rising trend in 2023, with its price more than doubling from below $10 to over $26 at the time of publishing.\n\nIn turn, investors are curious as to where the potential price of Solana could end up by the end of 2023, taking into account its NFTs, network, community, and transaction speed. Using the projections made by CoinPriceForecast, the finance prediction platform that uses machine self-learning technology, SOL is expected to increase by the end of 2023, as per data retrieved by Finbold on February 20.\n\nSOL started 2023 at $9.99, and it is currently trading at $26.31, so the price has increased by over 160% from the beginning of the year. The forecasted artificial intelligence (AI) price prediction at the end of 2023 is $39.22, a 48% climb from the price on February 20. Meanwhile, the year-to-year change is a 293% increase.\n\nSOL 2023 price target. Source: CoinPriceForecast\n\nSOL price analysis\n\nBy press time, Solana was changing hands at $26.31 with gains of over 8.5% on the daily chart. At the moment, the price of SOL has a significant support level of $23.46, while the price of the currency has to break through the next important resistance level, which is $28.16. If the token can break above this level, the next target will be holding support above $30.\n\nSOL 1-day price chart. Source: Finbold\n\nSolana’s technical indicators on TradingView‘s one-day gauges are bullish, with the summary aligning with the ‘strong buy’ sentiment at 16 while moving averages are for the ‘strong buy’ at 13. Oscillators are slightly less bullish, although still point to ‘buy’ with 3.\n\nSOL 1-day gauges chart. Source: Trading View\n\nSolana network\n\nAs the popularity of non-fungible tokens (NFTs) continues to grow, it’s likely that Solana will continue to be a popular choice for developers looking to build NFT projects. This could lead to increased demand for SOL tokens, driving up the price. Solana-based NFT sales grew over 12% in the last 24 hours to $2.6 million per data from Cryptoslam.\n\nNFTs have been a hot topic in the cryptocurrency space in recent years, and Solana’s fast and efficient blockchain has attracted many NFT projects to build on its network. One example is the Degenerate Ape Academy, which launched on Solana in October 2021 and quickly sold out its collection of 10,000 unique digital ape NFTs. Other popular NFT projects on Solana include SolSea, Star Atlas, and SolRazr.\n\nThis speed and efficiency has attracted many developers to build on Solana’s network, and the project has seen explosive growth in recent months. If Solana continues to attract developers and users to its network, it’s likely that the demand for SOL tokens will continue to increase, leading to a higher price.\n\nFor instance, the decentralized wireless communication network Helium (HNT) will entirely shift to the Solana blockchain by March 27, developers said on February 17. The shift will see HNT, MOBILE, and IOT issued on the Solana network, which will continue to be the tokens in the Helium ecosystem.\n\nBased on Solana’s NFT potential, network, community support, and transaction speed, it’s likely that the price of SOL will continue to rise in the coming years. While it’s impossible to predict the exact price of Solana at the end of 2023, it’s clear that the project has a lot of potential for growth and adoption.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]