[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vZGVjcnlwdC5jby8yMDAzODgvcnVuZS1wbHVtbWV0cy10aG9yc3dhcC1mcmVlemVzLW9wZXJhdGlvbnMtYW1pZC1wb3RlbnRpYWwtaWxsaWNpdC1hY3Rpdml0edIBaWh0dHBzOi8vZGVjcnlwdC5jby8yMDAzODgvcnVuZS1wbHVtbWV0cy10aG9yc3dhcC1mcmVlemVzLW9wZXJhdGlvbnMtYW1pZC1wb3RlbnRpYWwtaWxsaWNpdC1hY3Rpdml0eT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Oct 2023 07:00:00 GMT",
        "title": "RUNE Plummets 9% as Thorswap Freezes Operations Amid 'Potential Illicit Activity' - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nWe do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThorswap, a decentralized exchange (DEX) that supports multiple blockchains atop the Thorchain network, announced that it had paused activity.\n\nThe exchange has moved to “maintenance mode” after detecting a series of illicitly-linked funds had been funneled through the platform.\n\nThe native token powering the Thorchain network RUNE has since plummeted by 9%, per CoinGecko data. The token is now trading hands at $1.88.\n\nThorswap will remain paused until it is able to implement “a more durable and comprehensive solution” to improve security.\n\nAD\n\nAD\n\n“A pressing and persistent concern has recently come to light: the potential movement of illicit funds through THORChain and, specifically, THORSwap,” the exchange wrote. “Such activities have no place on the THORSwap platform, and THORSwap stands firmly against any and all criminal actions.”\n\nIn a subsequent update, Thorswap clarified that functions such as \"LP actions, Earn (for savers), Borrow (lending), and Staking actions\" continue to be fully accessible.\n\nAt present, there's no specific timeline as to when the platform will return to full operations.\n\n“THORSwap stands firmly against any and all criminal activity—especially on the THORSwap platform,” a representative of the Thor community reached via Discord told Decrypt.\n\nAD\n\nAD\n\nIlicit transactions linked to FTX hack\n\nThe dubious transactions are believed to be associated with an FTX hack from November 2022, where an unidentified entity drained multiple wallets, amounting to about $600 million.\n\nCrypto investigation agency Arkham Intelligence revealed on September 30 that the anonymous hacker channeled over 15,000 Ethereum through several platforms, Thorswap being one of them.\n\nAfter the platform halted its operations, members of the Thor community criticized the way the team handled the situation.\n\nTaylor Monahan founder of MyCrypto Wallet and product manager at MetaMask said that she had been raising the alarm around this precise issue for months.\n\n“Your incentivized shitshills are cluttering my notifs and your recent volume bump was solely bc criminals laundered the atomic wallet hack via thorchain,” Tayvano wrote in a post on July 10.\n\nBacking Tayvano's claim, co-founder of Bidali Eric Kryski said he had already traced a significant portion of stolen funds to Thorchain last July.\n\nMany community members also expressed their disappointment about Thor team actions, likening their response to that of centralized exchanges, pausing operations without community consultation.\n\nOthers in the community recalled a similar incident with Uniswap, calling the Thor team to take inspiration from the way it handled the issue.\n\nAD\n\nAD\n\nIn April 2022, Uniswap started blocking wallets linked to illicit actions. Over the subsequent months, they've blocked 253 crypto wallet addresses, without halting the exchange activities."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LnJhbmNob3NhbnRhZmVyZXZpZXcuY29tL25ld3Mvc3RvcnkvMjAyMy0xMC0wNi9zb2xhbmEtc2FudGEtZmUtc2Nob29scy1ncmFuZC1yZW9wZW5pbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Oct 2023 07:00:00 GMT",
        "title": "Solana Santa Fe School holds grand reopening - Rancho Santa Fe Review",
        "content": "On a sunny and warm Oct. 4 afternoon, the Solana Beach School District celebrated a grand reopening for the refreshed Solana Santa Fe School. Students took on the duties of snipping the ceremonial red ribbon for the modernized campus that SBSD Superintendent Jodee Brentlinger said maximizes the learning experience for all students.\n\nFrom the initial design team meetings in 2018 to the finishing touches placed last month, the project was a five-year “adventure”. The modernization journey was delayed by district attendance boundary decisions and weathered issues like a global pandemic, ever-rising construction costs, atmospheric rivers, supply chain challenges, labor shortages and a construction process that occurred over a two-year period on an occupied campus.\n\n“I can say without hesitation, it was quite a ride,” Principal Matthew Frumovitz said.\n\nFrumovitz believes the results were worth the journey, with the refreshed school entry, remodeled administrative offices, brand new kindergarten playground, enhanced child nutrition area, covered dining areas for students, revamped pick-up and drop-off area for efficiency and safety, and an “unbelievably fantastic” new two-story classroom building. The overhaul also included new carpet and furniture in all classrooms and new heating, ventilation, air conditioning and fire alarm systems throughout.\n\nStudents helped snip the ribbon at the Solana Santa Fe grand reopening. (Karen Billing)\n\nHe was thankful for the teachers, staff, students and families who demonstrated flexibility, adaptability and patience over the past two years: “This was done all for the good and ultimately for the benefit of our most precious resource: our children.”\n\nAs SBSD School board Vice President Dana King noted with gratitude, the school’s $26 million “rebirth” was made possible by Measure JJ bond funds, passed by the community in 2016.\n\n“If it weren’t for our constructive citizenry and belief in great schools for great kids, we would not have this amazing new campus to celebrate and be so proud of,” said King, who served on the district’s bond oversight committee before joining the school board.\n\nThis year Solana Santa Fe is celebrating its 30-year anniversary—the school originally opened with 10 classrooms and eight relocatable buildings in 1993. Assistant Superintendent of Operations John Leeland shared the fun fact that the school’s 1991 groundbreaking was actually held at the Fairbanks Ranch Country Club due to a number of water issues found on the site during construction. Marsi Hays, a teacher who was at the school when it opened in 1993,remains at the school as a third grade teacher.\n\nAn additional classroom building was added in 1997 but the portables remained until this campus renovation took place, replaced with the two-story eight classroom building.\n\nSolana Santa Fe student Niveta Anand led a campus tour.\n\n(Karen Billing)\n\nFollowing the ribbon cutting, Solana Santa Fe students led campus tours of the upgraded facilities as well as the newly enhanced school garden, with a fence painted to look like colorful crayons. New signage placed before a flowering archway reads: “In our garden we plant seeds of kindness, dance with the butterflies, wish for sun and rain, pause to play in the dirt, learn from Ms. Barbara and enjoy the beauty”.\n\nStudent Niveta Anand led one tour with visiting VIPs such as SBSD board members Vicki King and Julie Union as well as Superintendents Holly McClurg, Andrée Grey and Jill Vinson from the Del Mar, Encinitas and Cardiff School Districts."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LnJhbmNob3NhbnRhZmVyZXZpZXcuY29tL25ld3Mvc3RvcnkvMjAyMy0xMC0wNi9zb2xhbmEtc2FudGEtZmUtc2Nob29scy1ncmFuZC1yZW9wZW5pbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Oct 2023 07:00:00 GMT",
        "title": "Solana Santa Fe School holds grand reopening - Rancho Santa Fe Review",
        "content": "On a sunny and warm Oct. 4 afternoon, the Solana Beach School District celebrated a grand reopening for the refreshed Solana Santa Fe School. Students took on the duties of snipping the ceremonial red ribbon for the modernized campus that SBSD Superintendent Jodee Brentlinger said maximizes the learning experience for all students.\n\nFrom the initial design team meetings in 2018 to the finishing touches placed last month, the project was a five-year “adventure”. The modernization journey was delayed by district attendance boundary decisions and weathered issues like a global pandemic, ever-rising construction costs, atmospheric rivers, supply chain challenges, labor shortages and a construction process that occurred over a two-year period on an occupied campus.\n\n“I can say without hesitation, it was quite a ride,” Principal Matthew Frumovitz said.\n\nFrumovitz believes the results were worth the journey, with the refreshed school entry, remodeled administrative offices, brand new kindergarten playground, enhanced child nutrition area, covered dining areas for students, revamped pick-up and drop-off area for efficiency and safety, and an “unbelievably fantastic” new two-story classroom building. The overhaul also included new carpet and furniture in all classrooms and new heating, ventilation, air conditioning and fire alarm systems throughout.\n\nStudents helped snip the ribbon at the Solana Santa Fe grand reopening. (Karen Billing)\n\nHe was thankful for the teachers, staff, students and families who demonstrated flexibility, adaptability and patience over the past two years: “This was done all for the good and ultimately for the benefit of our most precious resource: our children.”\n\nAs SBSD School board Vice President Dana King noted with gratitude, the school’s $26 million “rebirth” was made possible by Measure JJ bond funds, passed by the community in 2016.\n\n“If it weren’t for our constructive citizenry and belief in great schools for great kids, we would not have this amazing new campus to celebrate and be so proud of,” said King, who served on the district’s bond oversight committee before joining the school board.\n\nThis year Solana Santa Fe is celebrating its 30-year anniversary—the school originally opened with 10 classrooms and eight relocatable buildings in 1993. Assistant Superintendent of Operations John Leeland shared the fun fact that the school’s 1991 groundbreaking was actually held at the Fairbanks Ranch Country Club due to a number of water issues found on the site during construction. Marsi Hays, a teacher who was at the school when it opened in 1993,remains at the school as a third grade teacher.\n\nAn additional classroom building was added in 1997 but the portables remained until this campus renovation took place, replaced with the two-story eight classroom building.\n\nSolana Santa Fe student Niveta Anand led a campus tour.\n\n(Karen Billing)\n\nFollowing the ribbon cutting, Solana Santa Fe students led campus tours of the upgraded facilities as well as the newly enhanced school garden, with a fence painted to look like colorful crayons. New signage placed before a flowering archway reads: “In our garden we plant seeds of kindness, dance with the butterflies, wish for sun and rain, pause to play in the dirt, learn from Ms. Barbara and enjoy the beauty”.\n\nStudent Niveta Anand led one tour with visiting VIPs such as SBSD board members Vicki King and Julie Union as well as Superintendents Holly McClurg, Andrée Grey and Jill Vinson from the Del Mar, Encinitas and Cardiff School Districts."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMTAvMDYvcHJpY2UtYW5hbHlzaXMtYml0Y29pbi1idGMtc29sYW5hLXNvbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Oct 2023 07:00:00 GMT",
        "title": "Price Analysis: Bitcoin (BTC) and Solana (SOL) - The Cryptonomist",
        "content": "SPONSORED POST*\n\nRecent financial landscapes are characterized by unpredictability, evident from the 10-year U.S. Treasury yield’s sharp rise of almost 90 basis points this year. This follows a hefty 200 bp climb last year. Adding to the mix, the S&P 500 Index has reported a dip of 5.89% over the past month, now resting at $4263.76. This turmoil isn’t just limited to traditional sectors; the crypto world is equally affected. Enigma Securities has recently projected a calm period in the crypto arena, expecting the volatility to take a back seat for the coming months. Vetle Lunde from K33 Research supports this sentiment, hinting at a stagnant October in the markets, providing a prime window for long-haul investors.\n\nThe conventional markets, after weathering a stormy session, found solace with the release of the latest job figures indicating a lukewarm U.S. labor market. The U.S. economy, as per the ADP’s recent report, managed to add only 89,000 jobs in September. This figure starkly contrasts the expected 153,000 and even falls short of August’s 180,000. Kathy Jones from Charles Schwab amplified this sentiment, stating that this was the feeblest private sector job growth since 2020.\n\nBitcoin (BTC): A Phoenix Rising Amidst Uncertainty\n\n\n\nThe recent report from Matrixport highlights the Bitcoin (BTC) resilience, noting its break from a downtrend and successfully consolidating above the $27,000 mark.\n\nWithin this framework of potential growth, the Bitcoin (BTC) current price exhibits fluctuations, ranging between $25,428 and $28,000. The 10-Day and 100-Day Moving Averages, standing at $27,176 and $28,137 respectively, underscore a balanced yet cautious market sentiment. Additionally, the drop in trading volumes from $19 billion to $11 billion signifies a need for close observation.\n\nMatrixport’s projection indicates a potential move towards the $30,000 mark. However, market dynamics emphasize the importance of monitoring resistance levels. Should Bitcoin (BTC) surpass the $29,029 resistance level, we could foresee a climb towards the $31,600 mark. Conversely, failure to do so might prompt a retraction to the foundational $25,428 or potentially deeper to lower support levels.\n\nWhile Bitcoin (BTC) remains a preferred asset for many crypto enthusiasts, new contenders like ScapesMania may offer a breakthrough in diversifying your portfolio.\n\nSolana (SOL): Comprehensive Market Assessment\n\n\n\nProminent market voices, including analysts like “CryptoGodJohn”, have indicated a positive trajectory for Solana, emphasizing a possible surge in its valuation in the forthcoming quarters.\n\nHowever, the Solana (SOL) current price range of $18.55 to $23.00, complemented by its Moving Averages, signals a market in careful deliberation. While the short-term 10-Day Moving Average stands at $21.66, the longer 100-Day Average is pegged at $21.73, providing a consolidated view of the asset’s performance.\n\nGiven current market indicators, if Solana (SOL) breaks through the $24.62 resistance, a journey towards the $29.07 level will be feasible. On the contrary, inability to maintain momentum might see a regression towards its base at $18.55 or further downward movement to established support levels. Amidst the uncertainty about the future of Solana (SOL), a rising star like ScapesMania can be a worthy bet.\n\nScapesMania: A Glimpse into the Future of Gaming and Cryptocurrency Fusion\n\nScapesMania is the revolutionary project in the Web3 space. It offers an opportunity for Web3 enthusiasts and backers to tap into the booming Web2 gaming market, projected to reach $521.61 billion in revenue by 2027.\n\nKey Highlights of ScapesMania\n\nScapesMania is not a single project; it’s a thriving gaming ecosystem with diverse revenue streams. The reward potential is starting at the expected ROI of 412% post-listing, and the sky’s the limit for further possible earnings.\n\nThe team behind ScapesMania is all about transparency, with open social media profiles. The project has already passed audits by industry-leading security labs, instilling confidence in early adopters. It’s listed on major tracking websites, and negotiations are underway to get ScapesMania on top exchanges.\n\nWhy Join Presale Today?\n\nWhile it’s still priced at $0.002428 in its early bird stage, the listing price will be $0.01 — that’s a potential x4 return! Early buyers can also score an up to 150% bonus, plus exclusive perks like token buyback & burn and staking opportunities.\n\nSecure your ScapesMania tokens now, at a whopping 80% discount! With each subsequent sales stage, the price is set to soar. Seize the opportunity for a potential astounding 412% ROI after listing!\n\n<<Join the Presale>>\n\nConclusion: A Dance of Titans and the Emergence of a New Challenger\n\nIn this dynamic cosmos, every coin is a universe of stories, every trend a narrative of triumphs and trials. As Bitcoin (BTC) and Solana (SOL) navigate their paths marked by victories and vicissitudes, ScapesMania waits in the wings, poised for a grand entry.\n\nBy embracing ScapesMania today, you could be looking at a potential >500% ROI thanks to the post-listing price surge, a whopping +150% bonus, and other incentives for holders. Now is the right moment to act if you want to grab a 80% discount on purchase as well!\n\nFind out more about ScapesMania:\n\nVisit the ScapesMania Presale\n\nJoin the Telegram Group\n\nFollow ScapesMania on Twitter\n\n*This article was paid for Cryptonomist did not write the article or test the platform."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMTAvMDYvc29sYW5hLWdyb3d0aC1uZnQtY3J5cHRvLWxpcXVpZC1zdGFraW5nLXNlY3RvcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 06 Oct 2023 07:00:00 GMT",
        "title": "Solana: growth in the NFT and crypto liquid staking sectors - The Cryptonomist",
        "content": "After a tumultuous 2022 for Solana in which the crypto project lost its main backer, namely FTX, here come the first positive signs of recovery with several metrics showing growth, especially in the NFT and liquid staking sectors.\n\nSuccessful implementations in the technology stack and important new partnerships are driving the resurgence of Solana and its crypto SOL, which many are still betting on, including institutional investors.\n\nWill the famous “Ethereum killer” blockchain network be able to return to its heyday with its decentralized ecosystem?\n\nWe see it together in this article.\n\nSolana’s progress in recent months: excellent numbers in liquid staking\n\nSolana has been posting excellent numbers since the beginning of the year after a catastrophic 2022, with the NFT and liquid staking sectors driving the crypto project’s progress.\n\nStarting with the basics, we can see how during 2023 Solana’s TVL increased from 25.12 million SOL to the current 30.95 million.\n\nEven in USD, the metric marks an increase of more than 50%, giving investors hope that the worst of the bear market is now behind us.\n\nIndeed, the emotional and image damage caused by the collapse of the FTX exchange in November 2022 (the main backer for technology developments) and all the recent problems related to network outages seem to have been overcome.\n\nThe crypto project team continues to innovate with major improvements in the technology stack achieving major milestones in the NFT market (which we will elaborate on in the next section) and achieving 100% chain uptime since the beginning of the year.\n\nThis is an excellent achievement for Solana considering that it has been repeatedly attacked publicly, as often in the past it has been necessary to perform a synchronized reboot of the network through the coordinated intervention of the validator team.\n\nIn addition, the two partnerships signed with Shopify and Visa in the past two months have been well received by the community, with both companies developing their services on top of the decentralized infrastructure.\n\nOn the liquid staking front, we can see that in the last month all LSD protocols on Solana have seen strong growth with TVL increasing in double digit percentages.\n\nJito for example has seen a 62.33% increase in value locked within the application over the past 30 days, while the top-of-the-line protocol Marinade Finance has grown by 20.65%.\n\nOver the course of the year, more than 2.4 million SOLs have been added to Jito, sending metrics on this platform soaring.\n\nInvestors are seizing the profit opportunities in a niche sector such as liquid staking on Solana, where only 3-4% of SOLs are actually being staked while on Ethereum we can observe a percentage around 40% for the same context.\n\nThe return offered by these crypto platforms is twice as high as those offered by Lido, RocketPool and Stakewise on Ethereum, where however we can count a higher level of security.\n\nCurrently, the LSD market on Solana is worth about $258 million, and forecasts assume further upside on the horizon.\n\nCrypto: Solana improves some waits in its technology stack and reduces minting costs for NFTs by 2,000 times\n\nAs mentioned earlier, Solana’s developers have moved over the past year to introduce key upgrades by improving its technology stack.\n\nThe positive effects have been seen in terms of both the development of the crypto ecosystem as a whole and the NFT market in particular.\n\nOne of the most interesting updates to mention in this regard is Firedancer, which by promoting significant optimizations should make Solana’s validation client much more effective than the foundation’s current client.\n\nTo date, only 3% of the crypto market is on the Solana Virtual Machine (SVM) while the remaining 97% works primarily with the Ethereum Virtual Machine (EVM).\n\nAt each Firedancer and hardware/bandwidth side improvements could contribute to SVM adoption.\n\nTurning instead to the NFT topic, it is worth noting the innovation introduced in April this year with the “State Compression” solution that greatly reduced storage costs by keeping data off the original chain.\n\nBy leaving only essential data on the Solana chain and using the Merkle Trees structure, the developers arrived at a compressed version of non-fungible tokens, namely cNFTs, which are highly optimized on the data storage side.\n\nIn June 2023, Tensor launched its compressed NFT market by taking advantage of this technology implementation and capturing most of the market share of the collectible cryptographic asset market on Solana.\n\nThe main advantage of “State Compression” is essentially about reducing the cost of mining per c-NFT by being the storage itself (done off-chain) better challenging.\n\nConsider that without the compression technology, the minting cost for 1 million NFTs would have been $253,000 whereas now it requires only $113.\n\nThis is a reduction of more than 2,000 times the cost of minting, which is a key competitive advantage within the blockchain landscape.\n\nSolana by doing so has also become cheaper than Polygon on this front, as to create 1 million NFTs, Sandeep Nailwal’s network requires payment of $32.8 thousand in gas fees.\n\nEthereum in comparison still remains the most expensive network with the highest fee costs in the market, but also with the most thriving ecosystem and on which the most volumes are spinning.\n\nSolana is still far from reaching the same goals as the world’s second-largest decentralized network after Bitcoin, but with this new update the distances have shortened considerably as have improved growth prospects for the coming years."
    }
]