[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8va2lzc2VscGFzby5jb20vanVuZ2xlLXJlZWYtaW50ZXJhY3RpdmUtYXF1YXJpdW0tdG8tYnJpbmctc2hhcmtzLW90dGVycy1hbmQtbW9yZS10by1zaG9wcGVzLWF0LXNvbGFuYS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Jungle Reef Interactive Aquarium to Bring Sharks, Otters, and More to Shoppes At Solana - 93.1 KISS FM",
        "content": "The Shoppes At Solana is adding something new to their list of businesses in the west El Paso mall: Jungle Reef!\n\nJungle Reef is an Interactive Aquarium and it will be the first and only interactive aquarium in El Paso.\n\n“It will be an interactive aquarium, meaning you will be able to touch and feed and get close and personal with these animals,” said business owners.\n\nThe interactive aquarium will take over the spot where Old Navy once was.\n\nI’ve been to tons of Interactive Aquariums out of El Paso and I have always loved taking my son there so knowing that El Paso will finally have one of its own is exciting to hear! I won't have to travel far away to try something new.\n\nJungle Reef will have sharks, birds, stingrays, otters, reptiles and more. It will definitely be a destination location for families, friends, and school field trips.\n\nThe interactive aquarium is a family owned business. The Hepworth brother’s have been in the construction business for over 20 years and are no stranger to opening up new and exciting businesses in Sunland Park Mall.\n\nMost recently, the brother’s opened “Monkey Rock” which is an entertainment venue that has bowling, arcades, plus a full bar and restaurant.\n\nThey are excited to bring the community back together through the revitalization of an old retail space, and turn it into a destination.\n\n“Having such an entertaining facility will bring over 150,000 people annually through Sunland Park mall. This foot traffic has proven to bring back life to old empty spaces. We also feel that jobs created from this will help those that would otherwise never have the chance to work in an educational animal environment,” said Jungle Reef owners.\n\nWhen Is Jungle Reef Expected to Open?\n\nJungle Reef will be located at 750 Shoppes At Solana.\n\nUpdates on opening day will all be worked out during construction period, but Jungle Reef owners have a tentative opening date for Jungle Reef during Spring 2024."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy50aGVmYXN0bW9kZS5jb20vaW52ZXN0bWVudHMtYW5kLWV4cGFuc2lvbnMvMzE5OTgtc29sYW5hLWxhYnMtdW52ZWlscy1sb3dlci1tYW5oYXR0YW4tb2ZmaWNlLWNvbXBsZXgtZm9yLXNvbGFuYS1ibG9ja2NoYWluLWVjb3N5dGVt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 01:39:11 GMT",
        "title": "Solana Labs Unveils Lower Manhattan Office Complex for Solana Blockchain Ecosytem - The Fast Mode",
        "content": "Solana Labs yesterday unveiled its new office space in Lower Manhattan. The office is a space for projects from the Solana blockchain ecosystem to co-work and host events.\n\nNew York City Economic Development Corporation President & CEO Andrew Kimball, New York City Chief Technology Officer Matt Fraser, and Manhattan Borough President Mark Levine kicked off the event with a few words, followed by a ribbon cutting to celebrate the new office space. Tech:NYC co-hosted the event with Solana Labs and Solana Foundation.\n\nThe four-story high-tech glass-enclosed office space sits at the intersection of Soho, the East Village, and the Lower East Side. Three of the four floors are reserved for web3 companies building in the Solana ecosystem to co-work, collaborate, and host events. Solana ecosystem teams can apply to work in the space, and when selected they will receive deskspace at no cost.\n\nNew York City Economic Development Corporation (NYCEDC) President & CEO Andrew Kimball New York City has all the ingredients to be the global epicenter of web3. It has the arts, culture, innovation, technology, and talent. It's exciting to see the Solana community plant a flag right here in New York and let the world know the city is the place to build in blockchain,\n\nNew York City Chief Technology Officer Matthew Fraser As a global hub for emerging tech, New York City is committed to creating an immersive environment for Web3 companies to grow and innovate. We are excited by the vast potential benefits this technology offers New Yorkers – democratizing access to finance for unbanked residents, enhancing the delivery of digital services, and reducing the amount of time necessary to complete processes such as document verification and benefits delivery. I welcome the Solana community to New York City and look forward to working with them,\n\nRaj Gokal, co-founder of Solana Labs The New York office shows our commitment to fostering the crypto ecosystem in New York. At a time when most are shying away from office space, we're doubling down and making sure early-stage entrepreneurs have a place to build and collaborate,"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy50aGVjb2lucmVwdWJsaWMuY29tLzIwMjMvMDUvMTIvcmVuZGVyLXRva2VuLW1pZ3JhdGVzLXRvLXRoZS1zb2xhbmEtYmxvY2tjaGFpbi1jb2xsYXRlcmFsLW5ldHdvcmstcHJlc2FsZS1wZXJmb3JtYW5jZS1zdHVucy1ob2xkZXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Render Token migrates to the Solana blockchain, Collateral Network presale performance stuns holders - The Coin Republic",
        "content": "Render Network (RNDR) announced a new technical roadmap that aims to bring the core of the network into the Solana’s ecosystem, and the partnership with Metaplex is just the start. With an increase of 40% in a month, Collateral Network (COLT) demonstrates enormous potential for investors and with its unique and borderless business model. Collateral Network is set to change the way we lend and borrow forever.\n\n>>BUY COLT TOKENS NOW<<\n\nRender Network’s Move to Solana\n\nRender Network has announced a new technical roadmap to bring the core of the network into the Solana ecosystem, with the partnership with Metaplex being just the start. RNDR goal has been to create a free and open metaverse since the creation of toolsets and infrastructure.\n\nIts core function is to distribute GPU resources across a distributed network of consumers to make it possible to access the computing power to build the metaverse at high scale and speed. Render Network chose Solana for its programmable and secure infrastructure, scalability, and possibilities.\n\nSolana’s high TPS and low latency enable decentralization of core rendering processes, and Render Network is funding the development of open-source Rust GPU cross-compiler tools for the RNDR SDK to enable developers to use the Solana smart contract VM and Render Network GPU nodes.\n\nThis provides transparency into the rendering and computation processes, higher interoperability for computing on the blockchain, and underscores Render Network’s commitment to building an open, freely accessible metaverse that is not threatened by centralized powers.\n\nAs of press time, the RNDR token is trading at $1.75 and has decreased by 8% in the last 24 hours.\n\nCollateral Network: Borderless Lending and Borrowing\n\nCollateral Network allows multiple lenders to earn passive income with a fixed interest rate by offering a decentralized Web3 lending platform that collateralizes real-world assets using NFTs. COLT issues asset-backed NFTs against physical assets such as property, gold, cars, art, jewelry, and more.\n\nBuilt on Ethereum, the blockchain technology ensures the security and transparency of the network and keeps participants in complete control of their investments. Collateral Network offers an easy-to-use and borderless marketplace for everyone, with decent interest rates and fair valuations. It is audited by SolidProof and Interfi Network, and team tokens are locked for 2 years, while liquidity tokens are locked for 33 years.\n\nCOLT is the native token of the ecosystem, and since the presale started in February 2023, COLT has already gained 40%. Collateral Network is the first of its kind and is built on Ethereum and will soon bridge to multiple blockchains to ensure fast TPs, low latency, and affordable network fees for the multi-ecosystem.\n\n>>BUY COLT TOKENS NOW<<\n\nConclusion\n\nRender Network is the go-to address for many of the leading crypto artists, with over $500 million in NFT sales in 2021 alone. Render has collaborations with Marvel and DC, Beeple, and Gene Roddenberry, to archive their work on the blockchain for future generations.\n\nIt enters an untapped market and offers fresh possibilities for would-be lenders and borrowers, by easing the process of lending. For the presale alone, gains of up to 35x are expected, with a possible 100x after listing on major exchanges. COLT is now available in presale at $0.014.\n\nCollateral Network presale here:\n\nWebsite: https://www.collateralnetwork.io/\n\nPresale: https://app.collateralnetwork.io/register\n\nTelegram: https://t.me/collateralnwk\n\nTwitter: https://twitter.com/Collateralnwk\n\nDisclaimer: Any information written in this press release or sponsored post does not constitute investment advice. Thecoinrepublic.com does not, and will not endorse any information on any company or individual on this page. Readers are encouraged to make their own research and make any actions based on their own findings and not from any content written in this press release or sponsored post. Thecoinrepublic.com is and will not be responsible for any damage or loss caused directly or indirectly by the use of any content, product, or service mentioned in this press release or sponsored post."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vY3J5cHRvLXJvbGxlcmNvYXN0ZXItYmluYW5jZXMtYnVsbGlzaC1ib3VuY2UtYW5kLXNvbGFuYXMtc3RlZXAtc2xpZGUtaW4tYmVhcmlzaC1ibGl0ei_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Crypto Rollercoaster: Binance's Bullish Bounce and Solana's Steep Slide in Bearish Blitz - Securities.io",
        "content": "The crypto market continues to lose ground, with Bitcoin falling under $26,200 and Ethereum below $1,750 this week.\n\nThe low liquidity in the market seems to be driving the prices lower. Market depth or liquidity has been worsening even on major exchanges like Binance while two of the biggest institutional liquidity providers, Jane Street and Jump Crypto, dialed back their crypto-trading businesses in the US. This move from the market makers came amidst the country's regulators' continuing their crackdown on the industry. As such, with order books thinner, it now takes less capital to move an asset's price.\n\nAn absence of liquidity, which has been failing to recover since the collapse of FTX, combined with the highly-leveraged nature of the crypto market, can cause a significant increase in volatility. Additionally, if the US equities market takes a dump, then the collapsing market can see an acceleration on the downside.\n\nThese latest losses have the total cryptocurrency market cap down by 3.% in the past 24 hours at $1.14 trillion, according to CoinGecko.\n\nWhile the combined market capitalization of all the coins in the crypto industry is up from the $820 billion low hit in Nov. 2022 as a result of the FTX collapse, it is still far off from the all-time high (ATH) a year prior to that when it surpassed $3 trillion.\n\nThis is because the majority of altcoins are down 80% to 90% from their peaks. And when it comes to majors, Bitcoin and Ether are down about 62% and 64% from their respective ATHs.\n\nBut among the top 20 crypto assets, there is one coin that has managed to do better than even BTC and ETH in sustaining its gains, while others have been hit far more brutally. So, let's take a look at them!\n\nBinance Coin (BNB)\n\nWhen it comes to the asset with the least percentage of downside from its ATH, BNB is the clear winner. The 4th largest cryptocurrency with a market cap of $47.7 billion has only lost about 56% of its value since its ATH of $686 hit on May 10, 2021.\n\nBNB is currently up 24.5% in 2023 so far and 32.3% in the past year while being down 7% in the past week. As of writing, BNB has been exchanging hands at $304.\n\nLately, BNB has been seeing some fresh accumulation among large institutional investors. While a group of whales with balances of 100,000 to one million BNB stopped selling, they added 90,000 BNB coins into their wallet balances.\n\nBNB is the native token of the largest cryptocurrency exchange Binance, which was founded by Changpeng Zhao, also known as “CZ,” in 2017. BNB holders get access to discounted fees on the platform. As such, demand for the token is linked to the exchange's usage and activity. This is why buying BNB can be seen as a bet on the exchange's success.\n\nIn April, the spot trading volume of Binance plummeted by 48%, marking the second consecutive month of declines and recording its second-lowest monthly trading volume since 2021, as per CCData's latest Exchange Review report.\n\nIn addition, Binance's market share kept on sliding, falling for the second consecutive month to 46.3%, its lowest since October 2022, prior to FTX's collapse. Despite this, Binance is still dominating the industry with a huge lead over its competitors.\n\nBNB was actually created to raise capital through an ICO in 2017, during which Binance sold 100 million BNB at a price of 2,700 BNB for 1 ETH. As per its original whitepaper, Binance proposed spending 20% of its profits every quarter buying and burning BNB, essentially removing coins from circulation, until the volume was brought down to 100 million. As of May 2023, the volume in circulation is around 157 million BNB, according to CoinGecko.\n\nOriginally, BNB was launched on the Ethereum blockchain but later migrated to its own blockchain called BNB Chain, which was launched in April 2019. The old tokens were destroyed and created on the new chain in equivalent numbers during this migration.\n\nBNB Chain is a layer 1 network that allows other applications to be built on top of it. It offers a faster and cheaper alternative to Ethereum, but it is more centralized. BNB token is also used to pay transaction fees on the blockchain. Besides its primary centralized exchange, Binance also has a decentralized exchange (DEX) on the BNB Chain.\n\nBNB Chain uses a proof-of-stake authority (PoSA) consensus mechanism under which it has a small number of the largest stakers as validators.\n\nBNB's gains in 2021 were the result of the growing popularity and a thriving ecosystem of decentralized applications (dApps), including DeFi and NFT on BSC.\n\nAt the time, the total value locked (TVL) in BSC went to almost $22 billion, as per DeFi Llama. This activity has since slowed down tremendously, with TVL currently standing at $4.51 billion — the third largest after Ethereum ($26.54 bln) and Tron ($5.31 bln).\n\nAccording to recent on-chain indicators, the BNB Chain has also been gaining market share. Over the past week, the number of Daily Active Users (DAU) on the network increased by 27%, from 4,068 to 5,148. DAU metric measures the number of unique wallet addresses interacting on a blockchain.\n\nBesides being a utility token, BNB also acts as a governance token for the BNB chain, allowing holders to participate in some of the project's decision-making. It is further in demand for staking on the BNB Chain.\n\nClick here to learn all about investing in Binance Coin (BNB).\n\nSolana (SOL)\n\nOnce a coveted cryptocurrency and one of the top-performing assets of the 2021 crypto bull run, SOL has suffered the most among the top 20 crypto assets, even worse than meme coins. The 10th largest cryptocurrency, with a market cap of $7.96 billion, is currently trading at $20.18, having lost just over 92% of its value since its ATH of almost $260 on Nov. 6, 2021.\n\nHowever, SOL is performing well in 2023 with gains of 102% YTD, the highest among the top 30 coins. Meanwhile, the cryptocurrency is down 7.7% in the past week and 54.3% in the past year.\n\nSOL is the native token of the Solana blockchain, which was founded by software engineer Anatoly Yakovenko in 2017. Those who invested in the project include Multicoin Capital, BlockTower Capital, Distributed Global, NEO Global Capital, Foundation Capital, Blockchange Ventures, Slow Ventures, Rockaway Ventures, and Passport Capital.\n\nLaunched in March 2020, Solana is a layer 1 platform that has fast transaction times and inexpensive fees. The token is used to pay transaction fees as well as to run smart contracts on the network.\n\nIt is an inflationary cryptocurrency with no hard cap on the total number of tokens. As of May 2023, about 395 million SOL tokens are in circulation. SOL has a starting annual inflation rate of 8%, which decreases by 15% every year until it reaches 1.5%, which will be the fixed long-term rate.\n\nSolana is secured through the popular proof-of-stake (PoS) consensus mechanism, where validators are tasked with ensuring transactions are valid. To become a validator and help secure the network, people can stake “some of their SOL. And in exchange for locking their tokens up, holders earn rewards. Validators are chosen based on how many SOL tokens they own.\n\nIn addition to PoS, Solana also uses proof-of-history, which is its core advancement and aims to speed up the process of ordering transactions in a blockchain. This mechanism is used to prove that an event has happened at a particular time.\n\nA competitor to Ethereum, Solana also offers a way to build dApps and currently has $263 million in TVL. This value has fallen considerably since it peaked at just above $10 bln in late 2021 but jumped 23.5% Quarter over Quarter (QoQ) this year.\n\nThe blockchain, which is known for offering users fast, secure, and scalable infrastructure for DeFi and NFT, experienced substantial growth in Q1 of 2023. When it comes to the NFT sector of the ecosystem, daily new NFTs on Solana surged from 2.6 Million to 2.9 Million QoQ, and NFT sales volume in the secondary market denominated in USD increased by almost 36%. Moreover, the network saw 96,000 unique active programs in 1Q23 compared to 58,000 in 1Q22.\n\nMeanwhile, the overall earnings of Solana declined by 17.9% in the last 30 days, according to the token terminal. The number of code commits, however, continued to increase on GitHub. This growth comes after turbulent times during which the blockchain saw a large number of downtimes and various prominent NFTs migrating to other protocols.\n\nWhile Solana has seen the most amount of losses during the last two years of the bear market, some coins like Dogecoin (DOGE), Polkadot (DOT), and Shiba Inu (SHIB) are not far behind with losses of 90.4%, 90.3%, and 90% respectively.\n\nClick here to learn all about investing in Solana (SOL)."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vc2FuZGllZ29tYWdhemluZS5jb20vZ3VpZGVzL3lvdXItZ3VpZGUtdG8tbm9ydGgtY291bnR5LXNhbi1kaWVnby_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Your Guide to North County San Diego - San Diego Magazine",
        "content": "San Diego Botanic Garden Courtesy of San Diego Botanic Garden\n\nOne of the great joys of San Diego is the way its culture shifts between neighborhoods. We all contain multitudes—and there’s a SD borough for every self. We can unleash our inner Carrie Bradshaw amid the high rises of downtown. Relive our halcyon college days in hard-partying PB. Cultivate the cocktail taste of a film noir detective at a North Park whiskey bar.Sometimes, though, we want to leave city life behind for the slower pace of smaller coastal ’burbs, where we can wake to the sound of crashing waves and make leisurely plans over diner coffee. Of course, in SD county, things can slow down, but they’re never boring.Just north of downtown San Diego is a collection of towns that are rich in history and full of unique attractions. From surf museums to three-star Michelin restaurants and family-friendly activities, North County celebrates Southern California’s creativity and sense of community.Here are the top must-visit spots to eat, adventure, shop, and stay in North County San Diego, California:\n\n101 Cafe Breakfast Courtesy of 101 Cafe\n\nEat & Drink\n\n101 Cafe\n\nOceanside, CA\n\nAn Oceanside staple, the 101 Cafe has been serving diner-style food since 1928. The retro, easygoing eatery is a local-favorite spot to enjoy a hearty omelet, stack of pancakes, and a good ‘ole cup of joe.\n\nAddison Appetizer Photo Credit: Eric Wolfinger\n\nAddison\n\nSan Diego, CA\n\nThere’s no menu at Southern California’s first and only three-star Michelin restaurant, Addison. Instead, diners place their palates in the capable hands of chef William Bradley and explore a seasonal, nine-course tasting that celebrates California ingredients and cuisine.\n\nCali Cream\n\nEncinitas, CA\n\nSatisfy your sweet tooth at Cali Cream. The Encinitas ice cream shop is known for their vast selection (50-plus flavors!) and generous scoops. With a second shop located in the Gaslamp Quarter, Cali Cream is a must-visit for a sunny day treat.\n\nCampfire Restaurant in San Diego Courtesy of Campfire\n\nCampfire\n\nCarlsbad, CA\n\nInspired by the California landscape and its produce-forward flavors, Campfire is a rustic spot built on the spirit of bringing people together. The Carlsbad eatery lives up to their name, preparing meals on a custom 12-foot hearth. Led by chef Eric Bost, Campfire offers fun cocktails, vegan options, and s’mores for dessert.\n\nClaire’s on Cedros\n\nSolana Beach, CA\n\nIf you’re looking for a cozy breakfast and lunch joint, then Claire’s on Cedros is the place to go. Try meals like the brioche breakfast grilled cheese sandwich, blackberry-stuffed french toast, and salted caramel waffles, all made with locally sourced ingredients. Claire’s Too, the restaurant’s coffee shop and bakery, is a great quick stop for grab-and-go goodies.\n\nGolden Coast Mead Bottles & Cans Courtesy of Golden Coast Mead\n\nGolden Coast Mead\n\nOceanside, CA\n\nGolden Coast Mead sells delicious, preservative-free sips made from fermented honey. Serving dry, sour, sweet, and spiced versions of mead, the Oceanside shop prides itself on innovative flavors—and its commitment to saving the bees.\n\nIronsmith Coffee Shop Interior Courtesy of Encinitas Visitors Center\n\nIronsmith Coffee Roasters\n\nEncinitas, CA\n\nBringing coffee shop cuteness to Encinitas is Ironsmith Coffee Roasters. The team focuses on sourcing high-quality coffee beans and providing rejuvenating drinks. Need a little treat? Ironsmith serves Wayfarer Bread pastries and sourdough loaves on Sundays.\n\nPizza Port & Beer Courtesy of Pizza Port\n\nPizza Port\n\nSolana Beach, CA\n\nWhile Pizza Port has made its mark in San Diego with multiple spots, the original location is nestled in Solana Beach. Siblings Gina and Vince Marsaglia opened the restaurant in 1987, launching their line of craft brews five years later.\n\nRouleur Brewing Company\n\nCarlsbad, CA\n\nCarlsbad watering hole Rouleur Brewing Company is a local, cycling-inspired craft brewery that keeps charity and philanthropy top of mind. They’ve collaborated with orgs such as Curebound, a local nonprofit striving to raise money for cancer research.\n\nTony’s Jacal\n\nSolana Beach, CA\n\nIn 1946, Tony and Catalina Gonzales transformed their family home into a cozy Mexican restaurant called Tony’s Jacal. Today, their daughters, grandchildren, and great-grandchildren run the business, cooking up the couple’s original recipes for turkey tacos and chile rellenos.\n\nExplore\n\nBelly Up Tavern\n\nSolana Beach, CA\n\nA San Diego legend, the Belly Up Tavern has been North County’s hottest venue for live music since the 1970s. Located in Solana Beach, the venue has hosted a laundry list of talented artists and bands, including Etta James, The Red Hot Chili Peppers, and the Rolling Stones.\n\nCalifornia Surf Museum Courtesy of the California Surf Museum\n\nCalifornia Surf Museum\n\nOceanside, CA\n\nThe California Surf Museum, founded in 1986, celebrates the sport and its history with revolving exhibits and events. This unique Oceanside museum prioritizes the preservation of surf stories and the community’s rich SoCal heritage.\n\nDel Mar Fairgrounds at Sunset Courtesy of Del Mar Fairgrounds\n\nDel Mar Fairgrounds\n\nDel Mar, CA\n\nThe Del Mar Fairgrounds hosts horse races, concerts, and, most notably, the San Diego County Fair. With over 300 acres and a colorful history, the San Diego landmark is a must-visit when in North County.\n\nCarlsbad Flower Fields Kids Courtesy of Carlsbad Flower Fields\n\nThe Flower Fields\n\nCarlsbad, CA\n\nThe Flower Fields in Carlsbad draw thousands to North County every spring. There’s plenty to enjoy beyond the myriad rows of vibrant ranunculus flowers, including wagon rides, bird aviaries, and a sweet pea maze for the little ones.\n\nFree Flight Exotic Bird Sanctuary\n\nDel Mar, CA\n\nOpened in 1981, Free Flight Exotic Bird Sanctuary in Del Mar works to save, resocialize, and rehome exotic companion birds. Book a visit online to visit and feed Free Flight’s flock of resident macaws, parakeets, and other feathered friends.\n\nLegoland California Courtesy of Legoland\n\nLegoland\n\nCarlsbad, CA\n\nThis Carlsbad amusement park features more than 60 rides, shows, and attractions that are perfect for families with younger kids. Build in even more good times with visits to the Water Park and Sea Life Aquarium or a stay at one of the park’s Lego-themed hotels.\n\nMission San Luis Rey Fountain Courtesy of Mission San Luis Rey\n\nMission San Luis Rey\n\nOceanside, CA\n\nSan Diego’s complex colonial history is evident in Mission San Luis Rey. Still a working mission, the Oceanside attraction is the largest of all 21 California missions and rings in its 225th anniversary this June. Guests may wander the cemetery grounds and go on a self-guided tour.\n\nMuseum of Making Music Courtesy of Museum of Making Music\n\nMuseum of Making Music\n\nCarlsbad, CA\n\nCarlsbad’s Museum of Making Music celebrates the power of music, instruments, and artists. Opened to the public in 2000, the museum features multiple galleries and exhibits for guests to explore every day except Monday.\n\nNorth Coast Repertory Theatre Actors Courtesy of North Coast Repertory Theatre\n\nNorth Coast Repertory Theatre\n\nSolana Beach, CA\n\nLocated in Solana Beach, the North Coast Repertory Theatre features performances all year long in an intimate, 194-seat setting. The performing arts company also encourages young people to get involved in their education and outreach programs through Theatre School @ North Coast Rep.\n\nOceanside Pier\n\nOceanside, CA\n\nThe town of Oceanside is known for their historic and picturesque pier. Jutting 1,942 feet out over the water, the landmark is the perfect spot for fishing, a scenic stroll, or a photo-op.\n\nSan Diego Botanic Garden Yoga Class Courtesy of San Diego Botanic Garden\n\nSan Diego Botanic Garden\n\nEncinitas, CA\n\nSprawling across 37 acres, the San Diego Botanic Garden delights the senses with 29 themed gardens, 5,300 plant species, and four miles of trails. The Encinitas Eden offers classes and programming, including open-air yoga, DIY workshops, and a bee-identification course.\n\nSan Diego Zoo Safari Park\n\nEscondido, CA\n\nLocated in Escondido, the San Diego Zoo Safari Park is a popular expansion of the San Diego Zoo. The must-visit park is home to more than 300 species, including elephants, kangaroos, and California condors. Plus, your admission costs bolster the zoo’s Wildlife Alliance conservation efforts.\n\nCedros Ave Design District Sign Courtesy of Cedros Avenue Design District\n\nShop\n\nCedros Avenue Design District\n\nSolana Beach, CA\n\nSupport small businesses at Cedros Avenue Design District. The Solana Beach shopping area features more than 85 artists, makers, eateries, and retailers across two-and-a-half blocks, as well as a bustling Sunday farmers market.\n\nDel Mar Plaza and Restaurants Courtesy of Del Mar Plaza\n\nDel Mar Plaza\n\nDel Mar, CA\n\nFind some of North County’s best retail therapy at Del Mar Plaza, an open-air shopping center. The elevated mall features European-inspired architecture, fountains, and public viewing decks, plus award-winning restaurants and specialty boutiques.\n\nFlower Hill Promenade\n\nDel Mar, CA\n\nSpend an afternoon wandering around the Flower Hill Promenade in Del Mar and drop a little cash at NoCo’s local businesses. With unique retailers, global brands, and outdoor dining, the shopping space offers the chance to indulge in a beautiful setting.\n\nSeaweed and Gravel Shop Exterior Courtesy of Seaweed and Gravel\n\nSeaweed and Gravel\n\nEncinitas, CA\n\nSeaweed and Gravel does more than vend sweet vintage attire and home good items. The Leucadia shop also hosts bonsai workshops, skate contests, art shows, and group motorcycle rides, striving to serve as a community gathering space that brings people together.\n\nFairmont Grand Del Mar Courtyard Courtesy of Fairmount Grand Del Mar\n\nStay\n\nFairmont Grand Del Mar\n\nSan Diego, CA\n\nLuxury-seekers, settle into a suite at the Fairmont Grand Del Mar, a San Diego golf course resort and spa. With 249 commodious rooms and gorgeous garden views, the hotel offers a relaxing and idyllic getaway.\n\nLakehouse Resort Room with View Courtesy of Lakehouse Resort\n\nLakehouse Resort\n\nSan Marcos, CA\n\nSituated on Lake San Marcos, Lakehouse Resort is a boutique hotel with photo-worthy views. Unwind in one of the resort’s many pool-view studios or cottages, and have fun at their Summer Concert Series. Amenities at Lakehouse Resort include two outdoor pools and hot tubs, a full service marina, and nearby pickleball and tennis courts.\n\nRancho Bernardo Inn Courtyard and Pool Courtesy of Rancho Bernardo Inn\n\nRancho Bernardo Inn\n\nSan Diego, CA\n\nIn the hills of North County sits the Rancho Bernardo Inn, a 265-acre resort, spa, and golf course. Intimate and tranquil despite its sprawling size, the hotel also has hiking trails and a garden sprouting produce and herbs for the onsite California restaurant.\n\nSurfhouse Boutique Hotel\n\nEncinitas, CA\n\nLocated in Leucadia, Surfhouse Boutique Hotel encapsulates the fun, adventurous spirit of the neighborhood’s coastal community. The unique Encinitas lodging features eight surf-inspired rooms and classic NoCo activities like yoga classes and surf lessons. For an even more out-there experience, Surfhouse allows you to hit the road in their “ninth room:” a Mercedes-Benz camper sprinter van."
    }
]