[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNyeXB0b2dsb2JlLmNvbS9sYXRlc3QvMjAyMy8wNS95YWtvdmVua28tZW52aXNpb25zLXNvbGFuYS1zb2wtaGFuZGxpbmctYWxsLW9mLXRoZS13b3JsZHMtYmxvY2tjaGFpbi1uZWVkcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 May 2023 07:00:00 GMT",
        "title": "Yakovenko Envisions Solana ($SOL) Handling All of the World's Blockchain Needs - CryptoGlobe",
        "content": "In a recent interview, Solana Labs Co-Founder Anatoly Yakovenko revealed that the Solana (SOL) blockchain is prepared to accommodate hundreds of millions of users.\n\nDuring an interview with YouTube series Token Terminal, Yakovenko stated that the Ethereum (ETH) competitor has the potential to meet global blockchain needs, considering the affordability of the current bandwidth infrastructure.\n\nYakovenko explained that today’s data centers offer one gigabit as the free tier, and egress costs less than a dollar per terabyte, making bandwidth remarkably inexpensive. Despite Solana’s capacity to handle numerous users, he acknowledged that the platform still lacks the applications necessary to attract a larger audience.\n\nYakovenko mentioned that with new generations emerging every two years, Solana has the capacity to support hundreds of millions of users. However, it needs more applications to draw them in. He identified potential growth drivers such as Helium (HNT), a network of IoT devices that successfully migrated to the Solana blockchain earlier this year, and Hivemapper, a decentralized map building tool.\n\nDiscussing Helium, Yakovenko highlighted that the project has created nearly a million IoT hotspots and has the potential for virtual tokens to impact the physical world through cryptography. He also mentioned that Helium plans to achieve similar success with 5G by creating a network of antennas for that technology.\n\nRegarding Hivemapper, Yakovenko stated that the project aims to map the world like Google Street View, covering 60 million kilometers globally. He shared that Hivemapper has already surpassed 2 million kilometers and continues to grow.\n\nAs of 7:40 p.m. UTC on May 7, 2023, TradingView data shows that $SOL is trading at approximately $22.48, experiencing a 1.91% increase within the past 24 hours and a 127.41% rise year-to-date."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vdGltZXN0YWJsb2lkLmNvbS9oZXJlcy13aHktYW5hdG9seS15YWtvdmVua28tc2F5cy1zb2xhbmEtc29sLWNhbi1oYW5kbGUtaHVuZHJlZHMtb2YtbWlsbGlvbnMtb2YtdXNlcnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 May 2023 07:00:00 GMT",
        "title": "Here's Why Anatoly Yakovenko Says Solana (SOL) Can Handle Hundreds of Millions of Users - Times Tabloid",
        "content": "Anatoly Yakovenko, the co-founder of Solana (SOL), has recently stated that the blockchain, which is currently a top Ethereum rival, has the capability to handle hundreds of millions of users.\n\nIn a recent interview on Token Terminal’s YouTube channel, the Solana co-founder said he is optimistic that the blockchain is capable of handling the world’s needs in relation to blockchain technology.\n\nRead Also: Solana Co-Founder Says “We Want To Synchronize the World at the Speed of Light”\n\nIn the course of the conversation, Yakovenko said although Solana has all it takes to manage a huge number of users, it still lacks the applications that could attract larger numbers of users.\n\n“I can definitely see [Solana] handling all of the world’s needs because when you look at today’s bandwidth infrastructure around data centers, the one gigabit is the free tier. You get a box, they give you one gigabit for free and it costs less than a dollar per terabyte of egress right now, so bandwidth is ridiculously cheap right now…\n\n“Every two years there’s a new generation, so from my perspective, I think we can already handle hundreds of millions of users and we have an abundance of capacity. We don’t have the applications to actually attract those users yet…\n\nRead Also: Everything You Should Know About the Solana-Powered Web3 Smartphone, Saga\n\n“Helium created close to a million IoT (Internet of Things) hot spots, that’s really cool. Think about virtual tokens moving around between people with cryptography impacting the physical world, there’s literally a close to a million antennas generated from that, and they’re going to attempt to do the same thing with 5G.\n\n<\n\n“Hivemapper, on the other hand, is trying to map the entire world like Google Street View and there’s 60 million kilometers in the world. They’re already at [a] 2 million kilometers map, they just crossed that, they’re growing.”\n\nFollow us on Twitter, Facebook, Telegram, and Google News"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8wNy9zb2xhbmEtY3JlYXRvci1hbmF0b2x5LXlha292ZW5rby1zYXlzLWV0aGVyZXVtLXJpdmFsLWNhbi1hbHJlYWR5LWhhbmRsZS1odW5kcmVkcy1vZi1taWxsaW9ucy1vZi11c2Vycy_SAYsBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDUvMDcvc29sYW5hLWNyZWF0b3ItYW5hdG9seS15YWtvdmVua28tc2F5cy1ldGhlcmV1bS1yaXZhbC1jYW4tYWxyZWFkeS1oYW5kbGUtaHVuZHJlZHMtb2YtbWlsbGlvbnMtb2YtdXNlcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 May 2023 07:00:00 GMT",
        "title": "Solana Creator Anatoly Yakovenko Says Ethereum Rival Can Already Handle Hundreds of Millions of Users - The Daily Hodl",
        "content": "Anatoly Yakovenko says that the Solana (SOL) chain is already set up to handle hundreds of millions of users.\n\nIn a new interview on Token Terminal’s YouTube channel, Yakovenko says that he believes the Ethereum (ETH) rival has the capacity to handle the world’s blockchain requirements.\n\n“I can definitely see [Solana] handling all of the world’s needs because when you look at today’s bandwidth infrastructure around data centers, the one gigabit is the free tier. You get a box, they give you one gigabit for free and it costs less than a dollar per terabyte of egress right now, so bandwidth is ridiculously cheap right now.”\n\nAccording to Yakovenko, even though Solana already has the ability to manage many users, it still lacks the applications to attract larger amounts of people.\n\n“Every two years there’s a new generation, so from my perspective, I think we can already handle hundreds of millions of users and we have an abundance of capacity. We don’t have the applications to actually attract those users yet.”\n\nYakovenko goes on to name a few possible growth drivers that could bring more people to the Solana network, including Helium (HNT), a network of IoT devices that successfully migrated over to the Solana blockchain earlier this year, and Hivemapper, a decentralized map building tool.\n\n“Helium created close to a million IoT (Internet of Things) hot spots, that’s really cool. Think about virtual tokens moving around between people with cryptography impacting the physical world, there’s literally a close to a million antennas generated from that, and they’re going to attempt to do the same thing with 5G.\n\nHivemapper, on the other hand, is trying to map the entire world like Google Street View and there’s 60 million kilometers in the world. They’re already at [a] 2 million kilometers map, they just crossed that, they’re growing.”\n\nSolana is trading for $22.06 at time of writing, a 3.4% decrease during the last 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Malyutin Nikita"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNS8wNy9zb2xhbmEtY3JlYXRvci1hbmF0b2x5LXlha292ZW5rby1zYXlzLWV0aGVyZXVtLXJpdmFsLWNhbi1hbHJlYWR5LWhhbmRsZS1odW5kcmVkcy1vZi1taWxsaW9ucy1vZi11c2Vycy_SAYsBaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDUvMDcvc29sYW5hLWNyZWF0b3ItYW5hdG9seS15YWtvdmVua28tc2F5cy1ldGhlcmV1bS1yaXZhbC1jYW4tYWxyZWFkeS1oYW5kbGUtaHVuZHJlZHMtb2YtbWlsbGlvbnMtb2YtdXNlcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 May 2023 07:00:00 GMT",
        "title": "Solana Creator Anatoly Yakovenko Says Ethereum Rival Can Already Handle Hundreds of Millions of Users - The Daily Hodl",
        "content": "Anatoly Yakovenko says that the Solana (SOL) chain is already set up to handle hundreds of millions of users.\n\nIn a new interview on Token Terminal’s YouTube channel, Yakovenko says that he believes the Ethereum (ETH) rival has the capacity to handle the world’s blockchain requirements.\n\n“I can definitely see [Solana] handling all of the world’s needs because when you look at today’s bandwidth infrastructure around data centers, the one gigabit is the free tier. You get a box, they give you one gigabit for free and it costs less than a dollar per terabyte of egress right now, so bandwidth is ridiculously cheap right now.”\n\nAccording to Yakovenko, even though Solana already has the ability to manage many users, it still lacks the applications to attract larger amounts of people.\n\n“Every two years there’s a new generation, so from my perspective, I think we can already handle hundreds of millions of users and we have an abundance of capacity. We don’t have the applications to actually attract those users yet.”\n\nYakovenko goes on to name a few possible growth drivers that could bring more people to the Solana network, including Helium (HNT), a network of IoT devices that successfully migrated over to the Solana blockchain earlier this year, and Hivemapper, a decentralized map building tool.\n\n“Helium created close to a million IoT (Internet of Things) hot spots, that’s really cool. Think about virtual tokens moving around between people with cryptography impacting the physical world, there’s literally a close to a million antennas generated from that, and they’re going to attempt to do the same thing with 5G.\n\nHivemapper, on the other hand, is trying to map the entire world like Google Street View and there’s 60 million kilometers in the world. They’re already at [a] 2 million kilometers map, they just crossed that, they’re growing.”\n\nSolana is trading for $22.06 at time of writing, a 3.4% decrease during the last 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Malyutin Nikita"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYm9sZC5jb20va2luZy1zb2xhbmFzLWFuc3dlci10by1ldGhlcmV1bXMtcGVwZS1saXN0cy1vbi1iaXRtYXJ0LWV4Y2hhbmdlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 May 2023 07:00:00 GMT",
        "title": "$KING, Solana's Answer To Ethereum's $PEPE, Lists on BitMart Exchange - Finbold - Finance in Bold",
        "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. Crypto assets/products can be highly risky. Never invest unless you’re prepared to lose all the money you invest.\n\nLondon, United Kingdom, May 7th, 2023, Chainwire\n\n$KING coin, the revolutionary memecoin on the Solana blockchain, has recently achieved a significant milestone by securing a listing on the prestigious BitMart exchange. This listing not only increases the accessibility and visibility of $KING within the global crypto market but also provides a platform for its rapidly growing community to trade and invest with ease, bringing the famous Solana coin one step closer to becoming the “$KING of Memecoins”.\n\nThe listing is a huge milestone for $KING and great news for all crypto traders, as it enables every person on earth to buy and hold the $KING token now through the CEX (“Centralized Exchange”), a luxury that was limited exclusively to Solana blockchain users until now. BitMart, a top global cryptocurrency exchange, offers a secure and advanced trading environment, enabling users to seamlessly buy, sell, and trade $KING tokens. The listing follows the meteoric success of $KING since its launch, where it quickly claimed the #3 spot as the most popular token across all blockchains within just 24 hours. The project has attracted over 8,000 unique wallet holders and generated a trading volume exceeding $18M in its first day alone.\n\nTo celebrate this momentous achievement, $KING is launching an exclusive international community campaign, giving away a staggering 10,000,000 $KING tokens as part of a viral marketing initiative. Every participant in the campaign will receive a portion of the prize pool, reinforcing $KING’s commitment to fostering a strong, sustainable community and rewarding its supporters.\n\nGonzoSOL, the founder of DucksVegas and creator of $KING, shared his excitement about the campaign: “Our listing on BitMart is a significant milestone, and we want to celebrate it with our community. This campaign enables us to give back to our supporters while simultaneously raising awareness about $KING and its unique value proposition within the Solana ecosystem.”\n\n$KING is designed to attract new users and cultivate a vibrant, sustainable community by employing a redistributive reward system and continually expanding its offerings. The project, which was launched in tandem with King Charles III’s coronation, has garnered significant attention due to its innovative approach, strategic alignment of narratives, and the renouncement of its smart contract, exemplifying transparency and trust.\n\nFor more information on the $KING token, its BitMart listing, and details on how to participate in the exclusive international community campaign, visit the $KING Coin Official Website and follow $KING on Twitter.\n\nAbout $KING\n\n$KING is a memecoin on the Solana blockchain, designed to onboard new users and foster a sustainable, thriving community. Launched to coincide with King Charles III’s coronation, $KING aspires to become the premier memecoin within the Solana ecosystem. Created by GonzoSOL, founder of DucksVegas, the project utilizes a redistributive reward system and is committed to the ongoing expansion of its offerings for the benefit of its community members. Notably, the $KING smart contract has been renounced, showcasing the project’s dedication to transparency and trust. The $KING roadmap encompasses a special coronation celebration, centralized exchange listings, and holder rewards for active community participation. Strategically aligning with various narratives and catalysts, $KING has rapidly gained attention, becoming the #3 most popular token across all blockchains within 24 hours of launch. With an impressive trading volume of over $18 million and more than 8,000 unique wallet holders on its first day, $KING will significantly impact the Solana ecosystem and the broader crypto market.\n\nFor more information visit $KING: Website | Twitter | Telegram\n\nCMO\n\nXavier Nukajam\n\nKing Coin Finance\n\n[email protected]\n\n"
    }
]