[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTIyL3NvbGFuYS1zcGFjZXMtc2h1dHRlcnMtY3J5cHRvLXRoZW1lZC1zdG9yZXMtaW4tbmV3LXlvcmstbWlhbWnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Feb 2023 08:00:00 GMT",
        "title": "Solana Spaces Shutters Crypto-Themed Stores in New York, Miami - Bloomberg",
        "content": "Solana Spaces — a venture that made a splash last summer when it launched brick-and-mortar stores in New York and Miami to back projects and technology around the namesake blockchain — is abandoning the initiative after less than a year as the crypto industry remains under a cloud.\n\n“We’ve made the difficult decision to sunset our stores in NYC and Miami by the end of February, and to pivot our Solana onboarding efforts into digital products,” including its free nonfungible token, the startup’s Chief Executive Vibhu Norby said in a statement posted on Twitter on Wednesday."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTIyL3NvbGFuYS1zcGFjZXMtc2h1dHRlcnMtY3J5cHRvLXRoZW1lZC1zdG9yZXMtaW4tbmV3LXlvcmstbWlhbWnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Feb 2023 08:00:00 GMT",
        "title": "Solana Spaces Shutters Crypto-Themed Stores in New York, Miami - Bloomberg",
        "content": "Solana Spaces — a venture that made a splash last summer when it launched brick-and-mortar stores in New York and Miami to back projects and technology around the namesake blockchain — is abandoning the initiative after less than a year as the crypto industry remains under a cloud.\n\n“We’ve made the difficult decision to sunset our stores in NYC and Miami by the end of February, and to pivot our Solana onboarding efforts into digital products,” including its free nonfungible token, the startup’s Chief Executive Vibhu Norby said in a statement posted on Twitter on Wednesday."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTIyL3NvbGFuYS1zcGFjZXMtc2h1dHRlcnMtY3J5cHRvLXRoZW1lZC1zdG9yZXMtaW4tbmV3LXlvcmstbWlhbWnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Feb 2023 08:00:00 GMT",
        "title": "Solana Spaces Shutters Crypto-Themed Stores in New York, Miami - Bloomberg",
        "content": "Solana Spaces — a venture that made a splash last summer when it launched brick-and-mortar stores in New York and Miami to back projects and technology around the namesake blockchain — is abandoning the initiative after less than a year as the crypto industry remains under a cloud.\n\n“We’ve made the difficult decision to sunset our stores in NYC and Miami by the end of February, and to pivot our Solana onboarding efforts into digital products,” including its free nonfungible token, the startup’s Chief Executive Vibhu Norby said in a statement posted on Twitter on Wednesday."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDIvMjIvc29sYW5hLXN0b3Jlcy1leHBlcmltZW50LW1pYW1pLW5ldy15b3JrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Feb 2023 08:00:00 GMT",
        "title": "Solana stores in New York and Miami are shuttering - Fortune",
        "content": "Two experimental brick-and-mortar stores in New York City and Miami centered around the Solana blockchain are closing less than a year after opening.\n\nThe stores, which were launched with funds from the Solana Foundation, were meant to spread the word about the blockchain and its cryptocurrency, SOL, whose value has fallen after FTX’s implosion and subsequent bankruptcy.\n\nFrom August to the end of 2022, the independently owned and operated stores, dubbed “Solana Spaces,” helped facilitate some 16,000 tutorials of the network, according to the Solana Foundation, which works to build out the blockchain.\n\n“While it’s unfortunate that Spaces is sunsetting its two experimental retail locations, the Solana Foundation looks forward to the community creating other unique onboarding experiences,” a spokesperson for the foundation said in a statement to Fortune.\n\nOn a tour of the New York City store in Hudson Yards a day before it opened in July, Fortune found that people were excited by the concept.\n\nThis version of the store included a display of Degenerate Ape Academy NFTs on the wall and an interactive dashboard of the real-time transactions happening on the blockchain. It also had a station to help customers create a Phantom wallet, the most popular crypto wallet for Solana.\n\nThe New York City Solana Spaces store included a wall of Degenerate Ape Academy NFTs. Gabby Jones—Bloomberg via Getty Images\n\nAt the time, Vibhu Norby, the Solana Spaces CEO, told Fortune that the store is “an experiment that we think a lot of people will love.”\n\nThe store closings come as the larger crypto market continues to struggle, with even the most popular cryptocurrency, Bitcoin, not able to maintain an extended bull run.\n\nThe Solana blockchain and its token SOL have faced headwinds in particular because of close ties with Sam Bankman-Fried, the disgraced former CEO of FTX who’s now facing criminal charges for fraud.\n\nThe network bills itself as a faster alternative to the dominant blockchain for decentralized applications, Ethereum, and received support from Sam Bankman-Fried, who called SOL the most “underrated token right now…” in an August interview with Fortune."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvbnljLWFsbGlhbmNlLWlua3MtaXAtYWdyZWVtZW50LXdpdGgtc29sYW5hLWhpbGxzLW5mdC1wcm9qZWN0LTMwMTc1Mzc4NC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Feb 2023 08:00:00 GMT",
        "title": "NYC Alliance Inks IP Agreement with Solana Hills NFT Project - PR Newswire",
        "content": "SOLANA HILLS, Calif. and NEW YORK, Feb. 22, 2023 /PRNewswire/ -- NYC Alliance (NYCA), a leading privately owned, global, multi-platform apparel conglomerate (licenses brands including Juicy Couture, Frye, and Tretorn) announces a game-changing partnership with trailblazing NFT project Solana Hills. The deal cements the organization's status as a key player in bridging the gap between Web2 and Web3 by bringing its innovative branding and omni-channel strategies to the world of NFTs.\n\nBy licensing the Solana Hills IP for product creation, NYC Alliance becomes the first vertically-integrated global apparel company to acquire, re-mint and expand an NFT collection for its designs. The partnership with Solana Hills will allow NYCA to offer a new level of engagement within the NFT space by leveraging the speed, efficiency, and scalability of the Solana blockchain while forging unprecedented opportunities for consumer participation. For NYCA Group President, Suzanne Silverstein, the decision was a no-brainer thanks to three solid pillars on which the teams agreed:\n\n\"NYC Alliance is the first global apparel company to acquire and re-mint an NFT collection for its designs.\" Post this\n\nART: Solana Hills offers some of the most dynamic art—in any chain. Layered and diverse, the project was designed to stand out on any platform and we believe there is truly something for everyone, even beyond the digital space. Playful details, characters boasting cult-followings and unique traits that correspond to varying degrees of rarity are a designer's dream as creative fuel and certain to ignite consumer frenzy.\n\nBUSINESS MODEL: Partnering with global fashion conglomerate NYCA will propel Solana Hills into a leading global brand, shoppable online and IRL, with community involvement all along the way. Our unmatched portfolio which boasts more than 1,000 retailers and partners spans the market, from major department stores and boutiques to discount and big-box stores. NYCA's vertically-integrated model allows for quick turnaround of product with in-house design and sales teams, showrooms and a direct line to many of the world's largest retailers.\n\nUTILITY: While the utility of NFT projects has primarily been limited to Web3, we see IRL opportunities for sustainable scaling and expansion thanks to our vast retail network and distribution channels. Creating value through innovative utilities is essential to the growth, success and sustainability of Solana Hills as we aim to connect, support and reward both Web3 and Web2 communities through the establishment of a new revenue share model.\n\nCommitted to long-term and sustainable growth, both organizations are confident that the partnership will be transformative for the space while also raising the bar for NFT- associated merchandise.\n\nWe invite you to join us on this exciting journey, as we help to shape the future of digital assets together. Join our Discord and follow @SolanaHills on Twitter and Instagram for the latest developments as we usher in a new era of innovation in the NFT space.\n\nSOURCE NYC Alliance"
    }
]