[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9zb2xhbmEtdGFrZXMtbGVhZC1pbi1kYWlseS1zdGFibGVjb2luLXRyYW5zZmVyLXZvbHVtZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Dec 2023 08:00:00 GMT",
        "title": "Solana Takes the Lead in Daily Stablecoin Transfer Volume - Unchained - Unchained",
        "content": "Since the start of December, Solana’s daily stablecoin transfer volume has grown 600% to $16.6 billion and now outpaces major blockchain networks, according to Artemis, an institutional crypto data platform.\n\nSolana's daily stablecoin transfer volume has risen 600% to $16.6 billion in the month of Dec. 2023.\n\nSolana has taken the lead in daily stablecoin transfer volume for the first time in the layer 1 blockchain’s history.\n\nRead more: Circle’s Euro-Backed Stablecoin $EURC Goes Live on Solana\n\nOn Monday, daily stablecoin transfer volume on Solana had reached $16.6 billion, outpacing other major blockchain networks, including Ethereum, Tron, BNB Chain and Arbitrum, according to Artemis, an institutional crypto data platform. Solana’s stablecoin transfer volume has soared about 600% since the start of the month when it stood at nearly $2.4 billion.\n\n\n\nSolana’s daily stablecoin transfer volume in 2022 ranged from as little as $33 million to as high as $743 million, never exceeding $1 billion. During the bull market of 2021, Solana’s daily stablecoin transfer volume reached $7.1 billion, its previous highest level before this month.\n\n\n\nThe growth in Solana’s stablecoin transfer volume underscores heightened activity and liquidity in the layer 1 blockchain’s ecosystem over the past year. Circle, the issuer of the second-largest stablecoin USD Coin (USDC), announced yesterday that decentralized finance applications and digital wallets on Solana can now use Euro Coin (EURC), a stablecoin pegged one-to-one with the euro.\n\nStablecoins are digital assets used on blockchains and pegged to fiat currencies like the U.S. dollar to bring stability to the crypto ecosystem, widely known for its price volatility.\n\n“Growth was kickstarted by the JTO airdrop [on Dec. 7],” wrote Nirmal Krishnan, head of engineering at Artemis, in an email to Unchained. “SOL has flipped Ethereum on both [DEX & NFT trading volume] in the last few days.”\n\nHe added: “Additionally, the growth of memecoins like BONK and WIF, which have historically never played out on Solana, has created room for more retail activity. Ultimately, I do think the combination of these factors has resulted in significantly more on-chain activity, with Solana reaching its highest daily active address numbers since summer of ’22.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9zb2xhbmEtcHJpY2UtYW5hbHlzaXMtc29sLXRvLW92ZXJ0YWtlLWV0aC1hbmQtYWRhLWluLW9yZGluYWxzLXJhY2UtMTM5Njk4MtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Dec 2023 08:00:00 GMT",
        "title": "Solana Price Analysis: SOL to Overtake ETH and ADA in Ordinals Race? - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8xMi8zNjMxNjQ4OS9pZi15b3UtaW52ZXN0ZWQtMS0wMDAtaW4tc29sYW5hLXdoZW4tc2FtLWJhbmttYW4tZnJpZWQtb2ZmZXJlZC10by1idXktYWxsLXRoZS1zb2wtaGUtY291bGTSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzYzMTY0ODk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Dec 2023 08:00:00 GMT",
        "title": "If You Invested $1,000 In Solana When Sam Bankman-Fried Offered To Buy All The SOL He Could, Here's How M - Benzinga",
        "content": "Loading... Loading...\n\nCryptocurrency Solana SOL/USD is up over 500% year-to-date in 2023, outpacing the returns of leading cryptocurrencies Bitcoin BTC/USD and Ethereum ETH/USD. Interest in Solana is increasing from investors around the world.\n\nHere's a look back at a key moment in Solana and cryptocurrency history, which could have provided an investment opportunity for some.\n\nWhat Happened: Interest in Solana has exploded thanks to many items, including airdrops like Jito JTO/USD, to people who participated in a Solana-based liquid staking protocol.\n\nThe launch of Solana-based meme coins like Bonk BONK/USD and Dogwifhat WIF/USD have also led to more interest in Solana and Solana non-fungible tokens (NFTs).\n\nLaunched in 2020, Solana is a layer-1 blockchain designed to help facilitate smart contracts and create new decentralized applications. The cryptocurrency can process many transactions per second and has a low transaction cost.\n\nOver the years, Solana has gained interest and seen use cases thanks to its position in the worlds of non-fungible tokens and blockchain gaming.\n\nNow the sixth largest cryptocurrency by market capitalization, Solana has partnered with major financial company Visa Inc V to help with cross-border payments. E-commerce company Shopify SHOP also announced the integration of Solana as a payment option on the company's shopping platforms.\n\nThe rebound of Solana in 2023 comes after a rough 2022 that saw the bankruptcy of several cryptocurrency platforms, including FTX. Solana was also volatile around the time of former FTX CEO Sam Bankman-Fried's arrest and FTX's struggles. The coin was the company's former top holding.\n\nBankman-Fried previously had one of the best-timed callouts of Solana in the coin's history.\n\nTwitter user @coinmamba called out Bankman-Fried on whether he said Solana was overvalued. Bankman-Fried denied saying the coin was overvalued. He instead offered multiple bets with Twitter users on the coin going up in value.\n\nAfter a few tweets back and forth betting on the price of SOL at $2, $2.05, $2.38 and $3, Bankman-Fried finally had enough and offered to buy every single SOL that the user owned for $3.\n\n\"I'll buy as much SOL as you have, right now, at $3. Sell me all you want. Then go f*** off,\" Bankman-Fried said.\n\nRelated Link: SEC May Be Hinting About A Bitcoin ETF – Here Are Clues And Warnings We're Following\n\nLoading... Loading...\n\nIf You Invested $1,000 in Solana: It's not clear if Bankman-Fried ended up buying Solana for $3 at the time. But investors who bought at the time of his tweet ended up seeing a great return.\n\nSolana traded between $2.94 and $3.66 on Jan. 9, 2021, the date of the tweet from Bankman-Fried.\n\nA $1,000 investment in Solana based on the day's high could have purchased 273.22 SOL.\n\nToday, the $1,000 investment would be worth $20,114.46. This represents a potential return of 1,911.4% over the last nearly two years.\n\nTime will tell if Solana can maintain momentum and return to all-time highs of $260.06 set in November 2021. One crypto trader predicts the price of Solana will hit $360 in 2025.\n\nRead Next: Bitcoin Flies Past Meme Number $42,069: Could Cryptocurrency Hit $69,420 And Break The Internet?\n\nImage: Shutterstock"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8xMi8zNjMxNjQ4OS9pZi15b3UtaW52ZXN0ZWQtMS0wMDAtaW4tc29sYW5hLXdoZW4tc2FtLWJhbmttYW4tZnJpZWQtb2ZmZXJlZC10by1idXktYWxsLXRoZS1zb2wtaGUtY291bGTSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzYzMTY0ODk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Dec 2023 08:00:00 GMT",
        "title": "If You Invested $1,000 In Solana When Sam Bankman-Fried Offered To Buy All The SOL He Could, Here's How M - Benzinga",
        "content": "Loading... Loading...\n\nCryptocurrency Solana SOL/USD is up over 500% year-to-date in 2023, outpacing the returns of leading cryptocurrencies Bitcoin BTC/USD and Ethereum ETH/USD. Interest in Solana is increasing from investors around the world.\n\nHere's a look back at a key moment in Solana and cryptocurrency history, which could have provided an investment opportunity for some.\n\nWhat Happened: Interest in Solana has exploded thanks to many items, including airdrops like Jito JTO/USD, to people who participated in a Solana-based liquid staking protocol.\n\nThe launch of Solana-based meme coins like Bonk BONK/USD and Dogwifhat WIF/USD have also led to more interest in Solana and Solana non-fungible tokens (NFTs).\n\nLaunched in 2020, Solana is a layer-1 blockchain designed to help facilitate smart contracts and create new decentralized applications. The cryptocurrency can process many transactions per second and has a low transaction cost.\n\nOver the years, Solana has gained interest and seen use cases thanks to its position in the worlds of non-fungible tokens and blockchain gaming.\n\nNow the sixth largest cryptocurrency by market capitalization, Solana has partnered with major financial company Visa Inc V to help with cross-border payments. E-commerce company Shopify SHOP also announced the integration of Solana as a payment option on the company's shopping platforms.\n\nThe rebound of Solana in 2023 comes after a rough 2022 that saw the bankruptcy of several cryptocurrency platforms, including FTX. Solana was also volatile around the time of former FTX CEO Sam Bankman-Fried's arrest and FTX's struggles. The coin was the company's former top holding.\n\nBankman-Fried previously had one of the best-timed callouts of Solana in the coin's history.\n\nTwitter user @coinmamba called out Bankman-Fried on whether he said Solana was overvalued. Bankman-Fried denied saying the coin was overvalued. He instead offered multiple bets with Twitter users on the coin going up in value.\n\nAfter a few tweets back and forth betting on the price of SOL at $2, $2.05, $2.38 and $3, Bankman-Fried finally had enough and offered to buy every single SOL that the user owned for $3.\n\n\"I'll buy as much SOL as you have, right now, at $3. Sell me all you want. Then go f*** off,\" Bankman-Fried said.\n\nRelated Link: SEC May Be Hinting About A Bitcoin ETF – Here Are Clues And Warnings We're Following\n\nLoading... Loading...\n\nIf You Invested $1,000 in Solana: It's not clear if Bankman-Fried ended up buying Solana for $3 at the time. But investors who bought at the time of his tweet ended up seeing a great return.\n\nSolana traded between $2.94 and $3.66 on Jan. 9, 2021, the date of the tweet from Bankman-Fried.\n\nA $1,000 investment in Solana based on the day's high could have purchased 273.22 SOL.\n\nToday, the $1,000 investment would be worth $20,114.46. This represents a potential return of 1,911.4% over the last nearly two years.\n\nTime will tell if Solana can maintain momentum and return to all-time highs of $260.06 set in November 2021. One crypto trader predicts the price of Solana will hit $360 in 2025.\n\nRead Next: Bitcoin Flies Past Meme Number $42,069: Could Cryptocurrency Hit $69,420 And Break The Internet?\n\nImage: Shutterstock"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3Mvc29sYW5hLXE0LXRyaXVtcGgtc29hcmluZy1hY3Rpdml0eS1sZWF2ZXMtZXRoZXJldW0taW4tdGhlLWR1c3QtcmVwb3J0L9IBZ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3Mvc29sYW5hLXE0LXRyaXVtcGgtc29hcmluZy1hY3Rpdml0eS1sZWF2ZXMtZXRoZXJldW0taW4tdGhlLWR1c3QtcmVwb3J0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 19 Dec 2023 08:00:00 GMT",
        "title": "Solana Q4 Triumph: Soaring Activity Leaves Ethereum In The Dust – Report - NewsBTC",
        "content": "Solana (SOL) has undeniably emerged as a standout performer in the recent cryptocurrency landscape, showcasing a remarkable surge in value that has captured the attention of market participants.\n\nIts extraordinary performance, marked by substantial gains, has propelled Solana beyond the ranks of other leading cryptocurrencies, securing a coveted position among the top five by market capitalization.\n\nSolana’s Surge: Outshining Rivals, Proving Dominance\n\nThe impressive rally of Solana stands as a testament to the blockchain’s underlying strength and the growing confidence of investors in its capabilities.\n\nRelated Reading\n\nThis bullish momentum has not only allowed SOL to outshine some of the traditionally dominant cryptocurrencies but has also affirmed its relevance and potential within the broader digital asset ecosystem.\n\nThe daily user activity on Solana has increased as a result of this outstanding performance. As the year’s final quarter draws to a close, the most recent statistics reveals a noteworthy growth of about 400%. According to a recent study by on-chain data company Messari, this far outpaced Ethereum’s pitiful 3% gain.\n\nSource: Messari\n\nThe research firm claims that several protocols located within the Layer 1 (L1) blockchain network have completed a series of token airdrops, which is what is responsible for the recent rise in new demand for Solana.\n\nOn December 16th, the trading volume of decentralized exchanges (DEX) on Solana temporarily surpassed that of Ethereum for the first time. This occurred as the smart-contract-enabled blockchain ecosystem continued to expand.\n\nSolana currently trading at $76.7377K territory. Chart: TradingView.com\n\nAccording to data from DeFillama, Ethereum’s trading volume during that time was only $1.164 billion, whereas the trading volume of DEXs on the blockchain surpassed $1.5 billion.\n\nBitfinex Cheers Solana\n\nOne of the biggest cryptocurrency exchanges in the world, Bitfinex, recently tweeted about Solana’s expansion. The tweet claims that in the previous three months alone, SOL’s price has increased by more than 340%.\n\nGood morning, @Solana fam! ☀️ Today’s a great day to celebrate the 343% growth of $SOL. From $19.80 per SOL 3 months ago to $67.94 today! Stay bullish.https://t.co/Ltajh1l15C — Bitfinex (@bitfinex) December 18, 2023\n\nRelated Reading\n\nThree months later, the token’s value had increased to $67.94 from $19.80 at the start of its bull surge.\n\nAs this developed, Jupiter, one of the biggest decentralized finance (DeFi) protocols on Solana and a swap aggregator, revealed that its much awaited 4 billion JUP token airdrop would happen in January.\n\n$SOL is on a tear. For the first time since 2021, the SOL/ETH price ratio saw a strong reversal as the Solana network recovers from the devastating collapse of FTX. pic.twitter.com/hAlCC23Yq0 — Kaiko (@KaikoData) December 19, 2023\n\nMeanwhile, data analytics provider Kaiko said Solana is seeing a sharp increase in price, and the price ratio of SOL to ETH is strongly reversing.\n\nThe Solana (SOL) to Ethereum (ETH) ratio is close to 0.04, according to a post on X published on December 19. Prior highs were around 0.06 in 2021 and lows were at 0.01 in early 2023.\n\nAt the time of writing, the price of SOL is currently trading at $77.40, up 3.5% over the last day and rallying 17% over the last week, data from CoinMarketCap shows.\n\nFeatured image from Shutterstock"
    }
]