[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9zcG9ydHMvc3RvcnkvMjAyMy0wMi0xMC9zb2xhbmEtYmVhY2gtc29jY2VyLWNsdWItaG9sZHMtYXdhcmQtbmlnaHTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Solana Beach Soccer Club holds Award Night - Del Mar Times",
        "content": "The Solana Beach Soccer Club held its annual award night on Feb. 1 at Skyline Elementary School. The club presents the Peter Schmid Memorial Sportsmanship Award to deserving players and sometimes to entire teams. The award honors the memory of Peter Schmid, a young member of the Soccer Club who loved the game. Recipients are honored for their sportsmanship. This year’s recipients are: Giuliana Criscuolo, Rafael Ramirez, Parker McNeil, Kino Rodarte, Jordan Azevedo, Matthew Quiroz, Jesus Conde, Ethan Bruch, Josue Arroyo, Milan Mendoza, and the entire boys U16 team (Aidan Cote, Reed Ellis, Apollo Espinosa, Tate Evans, Graham Ford, Breckin Germon, Dylan Granholm, Stefan Grossfeld, Sammy Komen, Cole Leshner , JP Montoya, Grayson Pope, Cameron Rauhala, Zane Schwender, Andres Sotelo, and Brian Terrill).\n\nThe club recognizes coaches for their leadership and selfless enthusiasm with the Scott Billington Memorial Award. Scott was a longtime member of the soccer club’s board, including four years as president, who passed away in 2015 after a battle with cancer. In addition to leading the soccer club, he also volunteered for the Solana Beach School Foundation and was a tireless supporter of the community. This year’s recipients are: Amber Evans, Stephen Cassar, Patrick Ferry, Joe Villassenor, Joe Klebba, Cole Leshner, Thomas Maurer, Levi Stratton, Carly Bazzett, and Jake Stratton."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9zcG9ydHMvc3RvcnkvMjAyMy0wMi0xMC9zb2xhbmEtYmVhY2gtc29jY2VyLWNsdWItaG9sZHMtYXdhcmQtbmlnaHTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Solana Beach Soccer Club holds Award Night - Del Mar Times",
        "content": "The Solana Beach Soccer Club held its annual award night on Feb. 1 at Skyline Elementary School. The club presents the Peter Schmid Memorial Sportsmanship Award to deserving players and sometimes to entire teams. The award honors the memory of Peter Schmid, a young member of the Soccer Club who loved the game. Recipients are honored for their sportsmanship. This year’s recipients are: Giuliana Criscuolo, Rafael Ramirez, Parker McNeil, Kino Rodarte, Jordan Azevedo, Matthew Quiroz, Jesus Conde, Ethan Bruch, Josue Arroyo, Milan Mendoza, and the entire boys U16 team (Aidan Cote, Reed Ellis, Apollo Espinosa, Tate Evans, Graham Ford, Breckin Germon, Dylan Granholm, Stefan Grossfeld, Sammy Komen, Cole Leshner , JP Montoya, Grayson Pope, Cameron Rauhala, Zane Schwender, Andres Sotelo, and Brian Terrill).\n\nThe club recognizes coaches for their leadership and selfless enthusiasm with the Scott Billington Memorial Award. Scott was a longtime member of the soccer club’s board, including four years as president, who passed away in 2015 after a battle with cancer. In addition to leading the soccer club, he also volunteered for the Solana Beach School Foundation and was a tireless supporter of the community. This year’s recipients are: Amber Evans, Stephen Cassar, Patrick Ferry, Joe Villassenor, Joe Klebba, Cole Leshner, Thomas Maurer, Levi Stratton, Carly Bazzett, and Jake Stratton."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LnRhcGFzbWFnYXppbmUuZXMvZW4vcGljby12ZWxhc2NvLW5ldy1ob3RlbC1jYW50YWJyaWEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "This is Pico Velasco, the perfect blend of nature and Cantabrian gastronomy - Tapas",
        "content": "Click here to read the Spanish version.\n\nNext March, Pico Velasco Hotel will open its doors in the heart of the Marismas de Santoña Natural Park, overlooking the sea. It is a historic 17th century manor house whose interior has been refurbished by the Álvarez del Manzano architectural studio, which has managed to establish a spatial and harmonious dialogue between the old and the modern with delicate nuances and framed views. The project, under the direction of Herbert Diess (former CEO of the Volkswagen Group), will be managed by Inés Aguirreburualde and will feature the gastronomic proposal of Michelin-starred chef Ignacio Solana.\n\nIn a unique location, where history, modernity, nature and territory go hand in hand, Pico Velasco will have 11 rooms divided into two floors, where guests will be immersed in a unique sensation. In addition, the estate has 85,000 m2 where Black Angus graze and promises to become a place of reference in the world of events.\n\nA contemporary vision of Cantabrian cuisine\n\nRegarding the gastronomic proposal, the chef Ignacio Solana will propose a journey through time, full of history, with yesterday’s flavours, young talent and a modern outlook. This chef of reference already has a Michelin star at his restaurant Solana, which he achieved at the age of 31, making him one of the ten youngest national chefs to achieve it.\n\nNature, environment and produce will be some of the ingredients of the Cantabrian chef to simmer a quality gastronomic experience for any type of event. Undoubtedly, his contemporary version of Cantabrian cuisine is a plus to make your stay at Pico Velasco a 10-star experience.\n\nIn short, from March Pico Velasco will become a hotspot in Cantabria for anyone looking for a getaway in a privileged location between green forests and maritime horizons, or who wants to enjoy an event with all the guarantees of being an unforgettable event."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1zbGlwcy1iZWxvdy0yMjAwMC1zaGliYS1pbnUtYXZhbGFuY2hlLXNvbGFuYS10YW5rLXVwLXRvLTgtMzY5NzMyLTIwMjMtMDItMTDSAZQBaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvY3J5cHRvL3N0b3J5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLXNsaXBzLWJlbG93LTIyMDAwLXNoaWJhLWludS1hdmFsYW5jaGUtc29sYW5hLXRhbmstdXAtdG8tOC0zNjk3MzItMjAyMy0wMi0xMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin slips below $22,000; Shiba Inu, Avalanche & Solana tank up to 8% - Business Today",
        "content": "The crypto market was trading sharply lower on Friday after fresh concerns about crypto regulations. The US Securities and Exchange Commission (SEC) investigating the popular cryptocurrency exchange Kraken for alleged securities laws violations, said the reports. Most other cryptos spent the day in solidly negative territory.\n\nThe largest crypto token Bitcoin dropped another 3 per cent during the early hours as it slipped below the $22,000 mark. Its largest peer, Ethereum, also tumbled about 5 per cent and broke the key psychological level of $1,600. Pain in altcoin was more severe.\n\nThe altcoins expectedly saw a bit more profit booking than Bitcoin. With the rise in trading volumes, it remained clear that the market participants wanted to book profits before the weekend, said Edul Patel, Co-founder and CEO at Mudrex.\n\n\"The crucial number to keep an eye on for the next couple of days would be the total crypto market cap. If it falls below the $1 trillion mark, it will likely trigger another set of sell-offs,\" he said.\n\nBarring the US dollar-pegged stablecoins and Polygon, all other top crypto tokens were trading sharply lower on Friday. Avalanche plunged about 8 per cent, whereas Solana was down 7 per cent. Memetokens Shiba Inu and Dogecoin were down 6 per cent, each.\n\nThe global cryptocurrency market cap was trading lower at $1.02 trillion, dropping more than 3 per cent in the last 24 hours. However, the total trading volumes surged more than 29 per cent close to $76.83 billion.\n\nThe Federal Reserve has signaled that they may raise interest rates later this year, raising some concerns about high inflation in the market. Technical indicators such as RSI and MACD indicate that GRT is in a state of consolidation and another upward move could come in the future, said Sathvik Vishwanath, Co-Founder & CEO at Unocoin.\n\nCrypto updates\n\nCrypto exchange Kraken will 'immediately' end its crypto staking-as-a-service platform for US customers and pay $30 million to settle Securities and Exchange Commission (SEC) charges it offered unregistered securities, the US agency announced.\n\nMakerDAO, one of the largest decentralized finances (DeFi) platforms, successfully onboarded blockchain data provider Chainlink’s smart contract automation into its Keeper system that maintains the stability of Maker’s DAI stablecoin, Chainlink Labs said.\n\nAave, one of crypto’s largest decentralized finance (DeFi) protocols, has deployed its native stablecoin GHO on Ethereum’s Goerli testnet, Aave Companies, one of the firms that develops the lending protocol,.\n\nTech View By Giottus Crypto Platform\n\nRipple (XRP) has been unable to hold on to its 200-day moving average at $0.39, but is still trading above its 50-day moving average at $0.37. It seems to have strong support from a descending trendline that has held on since almost a year ago, and that coupled with the support of its 50-day moving average should mean that XRP has a decent chance of making a recovery.\n\nXRP’s RSI at around 35 also indicates that it is bordering on oversold. If XRP manages to claim its 200-day moving average along with the resistance at $0.40, the next resistance at $0.46 should be the next target to aim for bulls.\n\nMajor levels\n\nResistance: $0.40, $0.46\n\nSupport: $0.36, $0.30\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\nAlso read: LIC, M&M, ACC: What should be your strategy amid the Q3 results, market volatility\n\nAlso read: MSCI cuts free-float designations of Adani Enterprises, Adani Total Gas, Adani Transmission & ACC"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vd3d3LmJiYy5jb20vbmV3cy9zY2llbmNlLWVudmlyb25tZW50LTY0NTQwNjk20gE5aHR0cHM6Ly93d3cuYmJjLmNvbS9uZXdzL3NjaWVuY2UtZW52aXJvbm1lbnQtNjQ1NDA2OTYuYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Feb 2023 08:00:00 GMT",
        "title": "Turkey earthquake: Where did it hit and why was it so deadly? - BBC.com",
        "content": "Turkey earthquake: Where did it hit and why was it so deadly?\n\n10 February 2023 By Pallab Ghosh , Science correspondent Share\n\nGetty Images\n\nTens of thousands of people have been killed and scores more injured by a huge earthquake which struck south-eastern Turkey, near the Syrian border, in the early hours of Monday morning.\n\nThe earthquake, which hit near the town of Gaziantep, was closely followed by numerous aftershocks - including one quake which was almost as large as the first.\n\nWhy was it so deadly?\n\nThe first earthquake was big - it registered as 7.8, classified as \"major\" on the official magnitude scale. It broke along about 100km (62 miles) of fault line, causing serious damage to buildings near the fault.\n\nProf Joanna Faure Walker, head of the Institute for Risk and Disaster Reduction at University College London, said: \"Of the deadliest earthquakes in any given year, only two in the last 10 years have been of equivalent magnitude, and four in the previous 10 years.\"\n\nBut it is not only the power of the tremor that causes devastation.\n\nThis incident occurred in the early hours of the morning, when people were inside and sleeping.\n\nThe sturdiness of the buildings is also a factor.\n\nDr Carmen Solana, reader in volcanology and risk communication at the University of Portsmouth, says: \"The resistant infrastructure is unfortunately patchy in South Turkey and especially Syria, so saving lives now mostly relies on response. The next 24 hours are crucial to find survivors. After 48 hours the number of survivors decreases enormously.\"\n\nThis was a region where there had not been a major earthquake for more than 200 years or any warning signs, so the level of preparedness would be less than for a region which was more used to dealing with tremors.\n\nWhat caused the earthquake?\n\nThe Earth's crust is made up of separate bits, called plates, that nestle alongside each other.\n\nThese plates often try to move but are prevented by the friction of rubbing up against an adjoining one. But sometimes the pressure builds until one plate suddenly jerks across, causing the surface to move.\n\nIn this case it was the Arabian plate moving northwards and grinding against the Anatolian plate.\n\nFriction from the plates has been responsible for very damaging earthquakes in the past.\n\nOn 13 August 1822 it caused an earthquake registering 7.4 in magnitude, significantly less than the 7.8 magnitude recorded on Monday.\n\nEven so, the 19th Century earthquake resulted in immense damage to towns in the area, with 7,000 deaths recorded in the city of Aleppo alone. Damaging aftershocks continued for nearly a year.\n\nThere have already been several aftershocks following the current earthquake and scientists are expecting it to follow the same trend as the previous big one in the region.\n\nHow are earthquakes measured?\n\nThey are measured on a scale called the Moment Magnitude Scale (Mw). This has replaced the better known Richter scale, now considered outdated and less accurate.\n\nThe number attributed to an earthquake represents a combination of the distance the fault line has moved and the force that moved it .\n\nA tremor of 2.5 or less usually cannot be felt, but can be detected by instruments. Quakes of up to five are felt and cause minor damage. The Turkish earthquake at 7.8 is classified as major and usually causes serious damage, as it has in this instance.\n\nAnything above 8 causes catastrophic damage and can totally destroy communities at its centre.\n\nHow does this compare with other large earthquakes?\n\nOn 26 December 2004, one of the largest earthquakes ever recorded struck off the coast of Indonesia, triggering a tsunami that swept away entire communities around the Indian Ocean.\n\nThe 9.1 magnitude quake killed about 228,000 people.\n\nAnother earthquake - off the coast of Japan in 2011 - registered as magnitude 9 and caused widespread damage on the land, and caused a tsunami. It led to a major accident at the Fukushima nuclear plant along the coast."
    }
]