[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDkvMDEvbWFrZXJkYW8tc2hvdWxkLXVzZS1zb2xhbmFzLWNvZGUtdG8tYnVpbGQtaXRzLW5ldy1ibG9ja2NoYWluLWNvLWZvdW5kZXItc2F5cy_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA5LzAxL21ha2VyZGFvLXNob3VsZC11c2Utc29sYW5hcy1jb2RlLXRvLWJ1aWxkLWl0cy1uZXctYmxvY2tjaGFpbi1jby1mb3VuZGVyLXNheXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "MakerDAO Should Use Solana’s Code to Build Its New Blockchain, Co-Founder Says - CoinDesk",
        "content": "MakerDAO Should Use Solana’s Code to Build Its New Blockchain, Co-Founder Says\n\nSome community members have already pushed back against the idea.\n\nBy Krisztian Sandor Sep 1, 2023 at 6:02 p.m. UTC"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NyeXB0b2N1cnJlbmN5LWFuYWx5dGljcy1pbnNpZ2h0L3NoaWJhLWludS1zaGliLWFuZC1zb2xhbmEtc29sLWhvdy1kb2VzLWV2ZXJsb2RnZS1jb21wYXJl0gGEAWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2FtcC9zdG9yeS9jcnlwdG9jdXJyZW5jeS1hbmFseXRpY3MtaW5zaWdodC9zaGliYS1pbnUtc2hpYi1hbmQtc29sYW5hLXNvbC1ob3ctZG9lcy1ldmVybG9kZ2UtY29tcGFyZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Shiba Inu (SHIB) and Solana (SOL): How Does Everlodge Compare? - Analytics Insight",
        "content": "ELDG is the utility token powering the Everlodge ecosystem and will be launched on the Ethereum blockchain. There is no minimum purchase amount, and ELDG tokens are currently only available directly from the Everlodge website, which also provides a full timeline and official whitepaper. Everlodge plans to later list ELDG on Uniswap and major centralized exchanges."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL21ha2VyZGFvLXNvbGFuYS1mb3JrLWVuZGdhbWXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "MakerDAO co-founder floats using Solana's code to build new chain - Blockworks",
        "content": "Rune Christensen, MakerDAO’s co-founder, suggested that a forthcoming appchain dedicated to the DeFi lending protocol could be built using the codebase of Solana.\n\nThat new appchain is part of the so-called Endgame plan, as previously reported by Blockworks. The plan is intended to improve MakerDAO governance and ensure that the protocol itself becomes more self-sustainable. It’s been in the works since May 2022, with the “Maker Constitution” receiving approval earlier this year.\n\nEndgame itself is split into five phases. The final phase — Phase 5 — will deploy a new chain, now known as NewChain, as a hub for the backend tools supporting MakerDAO.\n\nRead more: Takeaways From MakerDAO’s 5-phase Endgame Update\n\n“The most important reason for why NewChain is needed, is that it will allow the ecosystem to use hard forks to gracefully recover from the most severe form of governance attacks or technical failures,” Christensen wrote in an ecosystem discussion post on Friday.\n\n“After having researched all the different options available to act as the foundation for NewChain, I believe that the Solana stack is the most promising codebase to explore further,” Christensen went on to write.\n\nHe argued that the code is “engineered well and benefits from being designed long after the bottlenecks and challenges of blockchains were already well understood.”\n\nIf the MakerDAO community voted in favor of the proposal, Christensen suggested that a “symbiotic relationship” be formed between MakerDAO and the existing Solana community.\n\nThis could be achieved through maintaining an independent client or providing funding to the Solana ecosystem, he said.\n\n“It would be strategically beneficial to ensure there is a Two-Stage Gravity Bridge from NewChain to Solana alongside the bridge from NewChain to Ethereum,” he wrote. “It would also provide a useful boost to the network effect of the entire multichain economy.”\n\nAside from a Solana fork, Christensen argued that the only other contender for launching Maker’s new app chain would be the Cosmos SDK.\n\nThe downside, he said, is that the Cosmos ecosystem is not as efficient as Solana, which may make it more expensive to maintain over time.\n\n“Cosmos also doesn’t have a strong central foundation organization like Solana has, which could be either a good or bad thing,” Christensen wrote.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8wMS9zb2xhbmEtY291bGQtaGF2ZS1zZXJpb3VzLXBvdGVudGlhbC1pbi1uZXh0LWJ1bGwtbWFya2V0LWFjY29yZGluZy10by1jb2luLWJ1cmVhdXMtZ3V5LXR1cm5lci1oZXJlcy13aHkv0gGMAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzAxL3NvbGFuYS1jb3VsZC1oYXZlLXNlcmlvdXMtcG90ZW50aWFsLWluLW5leHQtYnVsbC1tYXJrZXQtYWNjb3JkaW5nLXRvLWNvaW4tYnVyZWF1cy1ndXktdHVybmVyLWhlcmVzLXdoeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Solana Could Have Serious Potential in Next Bull Market, According to Coin Bureau’s Guy Turner – Here’s Why - The Daily Hodl",
        "content": "A widely followed crypto analyst says that Solana (SOL) has enormous upside potential in the next bull cycle.\n\nIn a new video update, Coin Bureau host Guy Turner says that Solana could go on a huge rally as other digital asset projects compete against SOL in the crypto space.\n\n“Solana could have serious potential during the next crypto bull market. This is simply because most of the new layer-1s have branded themselves as Solana killers. Consider that the cryptos that did the best during the previous cycle were those that branded themselves Ethereum killers.\n\nIn the end, both ETH and these Ethereum killers saw massive gains. It’s possible that we’ll see a similar scenario play with SOL and all the Solana killers during the next cycle. However, this assumes that Ethereum hasn’t already won the layer-1 competition, which, you’ll recall, seems to be the case.”\n\nSolana is trading for $19.68 at time of writing, down 5.3% in the last 24 hours.\n\nThe trader also weighs in on Binance Coin (BNB), which is at risk of losing key support at the $200 level.\n\nHe believes that the price action of BNB will largely be determined by regulatory developments in the United States, including what happens with the lawsuit the U.S. Securities and Exchange Commission (SEC) has filed against Binance.\n\n“Now whether BNB can bounce from its recent lows fundamentally depends on what happens with Binance. If we suddenly start to see positive regulatory developments such as settlements with US authorities, which are reportedly in the works, BNB could explode to the upside on the news.\n\nAlternatively, if the regulatory crackdown on Binance continues, then BNB could continue to suffer. This is what the charts suggest, but I’ll remind you that technicals don’t work too well with exchange tokens. There could be unforeseen zones of support for BNB if it does break below that $200 level.”\n\nBNB is trading for $216 at time of writing, down 3% in the last 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmZpbmFuY2Vjb2xvbWJpYS5jb20vc3R1ZHktZGV0YWlscy1mb3VyLW5ldy1zcGlkZXItc3BlY2llcy1mb3VuZC1pbi1jb2xvbWJpYW4tcGFjaWZpYy1yZWdpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Study Details Four New Spider Species Found in Colombian Pacific Region - Finance Colombia",
        "content": "A recent study by faculty members of the Medellín-based Universidad EAFIT has yielded new findings about four spider species discovered last year in the Colombian department of Chocó and potentially broadened the science community’s understanding of this type of arachnid category and its diversity in the region.\n\nPhoto: Ummidia solana, one of the new spider species discovered in Chocó. (Photo credit: Mariana Echeverri, Sebastián Gómez Torres, Nicolás Pinel, Carlos Perafán)\n\nThe four new spider species (Ummidia solana, Melloina pacifica, Euthycaelus cunampia, and Neischnocolus mecana) are described as “predatory animals” and “primarily terrestrial and relatively sedentary,” which helps explain their ability to elude scientists up until now.\n\nEach belongs to the “mygalomorph” group of spiders that is concentrated in tropical regions and accounts for about 6% of the currently known species, including tarantulas, hairy spiders, trapdoor spiders, funnel-web spiders, millimeter-sized spiders, and bald-legged spiders.\n\nSpeaking to Finance Colombia about their discovery, Sebastián Gómez Torres, a researcher and one of the paper’s co-authors, hopes that the findings will have a “positive impact” in the scientific community and speculates that these creatures may even have the potential to impact the country’s private sector.\n\n“These newfound species might harbor chemical compounds, enzymes, or other unique biological characteristics with potential applications in diverse domains, such as medicine, agriculture, biotechnology, and industry,” he said.\n\nTorres also hopes for the discovery to help further the development of “strategies aimed at the conservation and sustainable use of natural resources” while advancing research into the spiders’ roles in the ecosystem.\n\nStudy co-author Sebastián Gómez Torres hopes for the discovery to help further the development of “strategies aimed at the conservation and sustainable use of natural resources” while advancing research into the spiders’ roles in the ecosystem.\n\nWhile Torres and his co-authors hope to explore more of the region to continuing investigating the species discovered there, a lack of funding has thus far kept them from fulfilling all their research goals.\n\n“As a consequence of this situation, our intention is to promote collaboration and support from institutions interested in endorsing endeavors of this nature, with the aim of fostering and propelling scientific research within the Colombian context,” he said.\n\nThe authors of the research paper — Sebastián Gómez Torres, Mariana Echeverri, Nicolás Pinel, and Carlos Perafánv — first collected samples of the species in February 2022 in the Chocó Biogeographic Region before transporting them for preservation to the Arachnological Collection at the Instituto de Ciencias Naturales at Universidad Nacional de Colombia.\n\nAs home to the Amazon, other rainforests, the Andes mountains and so many other climates within its borders, Colombia is the second most biodiverse country on earth after Brazil."
    }
]