[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5kZWxtYXJ0aW1lcy5uZXQvbGlmZXN0eWxlL2V2ZW50cy9zdG9yeS8yMDIzLTEwLTExL2FubnVhbC1kaWEtZGUtbG9zLW11ZXJ0b3MtY2VsZWJyYXRpb24tdG8tYmUtaGVsZC1pbi1zdHlsZS1zb2xhbmEtYmVhY2hzLWxhLWNvbG9uaWEtcGFya9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "Annual 'Día de los Muertos' celebration to be held in style at Solana Beach's La Colonia Park - Del Mar Times",
        "content": "Join the City of Solana Beach and the La Colonia Community Foundation in celebrating Día de los Muertos while honoring the ancestral legacy of La Colonia de Eden Gardens. Solana Beach’s annual Día de los Muertos – “Day of the Dead” - will be held on Sunday, Oct. 22 from 10 a.m. to 5 p.m. at La Colonia Park, 715 Valley Avenue. Each year, the event features a unique theme, and this year the event is paying tribute to the Pachuco era, a significant and enduring part of Chicano history. The Pachuco era is a symbol of resilience, style, and identity, and event organizers are excited to explore and celebrate this important chapter in our heritage.\n\nThis free family-friendly community event offers many exciting cultural opportunities for the whole family, including Ballet Folklórico Grupo Jalisciense, a Classic Car Show by Viejitos Car Club, musical performances by Santana Soul, Smooth Groove band and Mariachi Del Mar. Other fun activities for the whole family will include Piñatas for kids, a Catrin/Catrina costume contest, a dog costume contest, a face mask contest and free kids activities, such as crafts and a scavenger hunt.\n\nThe highlight of the event will be more than 40 altars honoring the memories of family and friends who have passed away. The blessing of the altars by the Aztec Dancers Danza Coatlique Ceminitzli begins at 9:30 a.m.\n\nDelicious and authentic Mexican American food and beverages will be available for sale. Vendor booths will be available for those looking for a special gift or something unique. Parking will be limited. Organizers encourage carpooling, biking, walking or taking public transportation to the event. Please bring your own picnic chairs and blankets.\n\nYou may request your own Día de Los Muertos altar space by emailing lacoloniacommunity@gmail.com. Sponsorship and vendor booth opportunities are also available. You may request information by emailing lacoloniacommunityandpriscilla@gmail.com. Volunteers for the event are welcome. If you are interested, contact lacoloniacommunityandpriscilla@gmail.com.\n\nThis event is free and open to the public. For more information, visit the city website at www.cityofsolanabeach.org or call the Parks and Recreation Department at 858-720-2453.\n\n"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzExL2hlcmVzLXRoZS1vYnZpb3VzLXVzZS1jYXNlLWZvci1jcnlwdG8tYWNjb3JkaW5nLXRvLXNvbGFuYS1jcmVhdG9yLWFuYXRvbHkteWFrb3ZlbmtvL9IBeWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzExL2hlcmVzLXRoZS1vYnZpb3VzLXVzZS1jYXNlLWZvci1jcnlwdG8tYWNjb3JkaW5nLXRvLXNvbGFuYS1jcmVhdG9yLWFuYXRvbHkteWFrb3ZlbmtvL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "Here’s the Obvious Use Case for Crypto, According to Solana Creator Anatoly Yakovenko - The Daily Hodl",
        "content": "Anatoly Yakovenko, co-founder of smart contract platform Solana (SOL), is naming what he says is an “obvious” use case for crypto and blockchain.\n\nIn a new interview with Austin Federa, head of strategy at the Solana Foundation, Yakovenko says simple payments are one obvious use case for digital assets that anyone can benefit from.\n\n“I’m actually more focused on trying to do stuff that’s obvious today. I think that’s just really important, to try to get users to go do the things that already work at scale – and those are payments. Very simple kind of thing – let’s send money to each other in a cheap and fast way without [going] around the world.”\n\nAccording to Yakovenko, crypto assets could help simplify finance over the internet as well as let content creators work for themselves rather than be tied to the financial systems of their hosts.\n\n“[Crypto payments are] just such a better experience for anyone that generates user content. So the problem is that because it’s such a pain to deal with finance on the web, these platforms are able to aggregate power by creating these rails for a large number of content creators…\n\nThey own the content, they own the creator’s financial relationship between the creator and the user, they own that rail, they own that connection, and once they own it, the creator doesn’t want to leave – it’s like a kick in their revenues. They’re not like working for themselves, they’re working for Twitter or for Tik Tok or whatever because all of the financialization happens through these platforms.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/annfossa"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8xMS9pbnZlc3RpbmctZ2lhbnQtZmlkZWxpdHktbmFtZXMtZXRoZXJldW0tYW5kLXNvbGFuYS1hcy1leGFtcGxlcy1vZi1zdWNjZXNzZnVsLW5ldHdvcmstZWZmZWN0cy1hbmQtZGV2ZWxvcGVyLWJhc2VzL9IBlgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8xMS9pbnZlc3RpbmctZ2lhbnQtZmlkZWxpdHktbmFtZXMtZXRoZXJldW0tYW5kLXNvbGFuYS1hcy1leGFtcGxlcy1vZi1zdWNjZXNzZnVsLW5ldHdvcmstZWZmZWN0cy1hbmQtZGV2ZWxvcGVyLWJhc2VzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "Investing Giant Fidelity Names Ethereum and Solana As Examples of Successful Network Effects and Developer Bases - The Daily Hodl",
        "content": "Financial services titan Fidelity is naming leading smart contract platform Ethereum (ETH) and one of its rivals as examples of success.\n\nIn a recent report, the investing giant says that Ethereum and Solana (SOL) are good examples of blockchains with successful network effects and developer bases.\n\nAccording to Fidelity, for a crypto project to ultimately be successful, it must be able to attract talented developers as well as maintain its core user base – two things the firm says Ethereum and Solana excel at.\n\n“Projects that have shown the ability to be successful and create something promising have done so by attracting the proper talent and retaining their user base. Ethereum and Solana provide a great example of what is possible for a protocol that can attract a large amount of developers, build a usable platform, and gain a loyal network of users. When done right, there is clearly a lot of value that can be created for investors.”\n\nFidelity goes on to say that those who invest in non-Bitcoin (BTC) digital assets tend to take small positions in many different altcoins rather than just one, giving them options in an increasingly complex and growing crypto landscape.\n\n“Given the increased amount of competition and potential paths of failure for many of these projects, allocating to non-Bitcoin tokens is often done with a venture capital-like mindset. Instead of picking one particular project, investment allocators typically take small positions across many individual names.\n\nThis typically results in seeking out an actively managed solution to deal with the increase in overall complexity. Again, this shows a stark contrast to a simple Bitcoin-only approach to digital assets.”\n\nEthereum is trading for $1,565 at time of writing, a fractional decrease on the day while Solana is moving for $22.07.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Tatiana Gavrish"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW50cmlidW5lLmNvbS9lbi90cmFuc2FjdGlvbnMtY3J5cHRvLWNvbmZpZGVudGllbGxlcy1sYS12ZXJzaW9uLTEtMTYtZGUtc29sYW5hLXNvbC1ldC1zZXMtbm9tYnJldXNlcy1zdXJwcmlzZXMtMi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "Crypto: Solana v1.16 Introduces Confidential Transactions - Cointribune EN",
        "content": "Wed 11 Oct 2023 ▪ 4 min of reading ▪ by Mikaia A.\n\nAnonymous transactions are becoming a crucial element in the future of the crypto sphere. Considering recent improvements in Solana, this once-regulatory-despised convenience will soon be integrated. Version 1.16 of the protocol will also include other enticing features. Details!\n\nSolana on the Rise with Version 1.16\n\nSolana is experiencing a resurgence. The issuer of the SOL cryptocurrency recently witnessed a 4.15% increase in its total value locked (TVL) from Sunday to Monday. DefiLlama, a data provider, reported a figure close to $340 million just yesterday.\n\nSolana's new 1.16 update includes:\n\n\n\n– confidential transfers\n\n– better zk support\n\n– reduced hardware requirements\n\n\n\nthese are big improvements — I don't think enough people are aware\n\n\n\n(we need to get much better at communicating)\n\n\n\nwe wrote an overview:\n\nhttps://t.co/IxXdyGvluL — rpc mert | helius.dev (@0xMert_) October 5, 2023 Summary of the new features in Solana version 1.16 (SOL):\n\nHelius Labs’ article attached to this tweet complements Solana’s official communication dated September 26. In fact, a day before that, Solana Labs engineers confirmed to validators the imminent deployment of Solana v1.16. Its beta version will soon be integrated into the mainnet.\n\nBefore this announcement, the Solana team had to conduct numerous audits and address prior issues. It took about 10 months to reach this stage. Furthermore, the developers behind this v1.16 project acknowledge that it has not yet reached its zenith. They have promised the addition of more features over time.\n\nWhat are the updated features and performance improvements in this new iteration of Solana? Among other things, you’ll find:\n\nImproved support for execution for zero-knowledge math\n\nSupport for confidential SPL Token transfers\n\nSupport for 128 operations on elliptic curves (equivalents of EIP-196, EIP-197, and EIP-198)\n\nSupport for resizable program data accounts\n\nLedger data cleaning service optimization\n\nPeer-sampling improvements for Gossip request extraction\n\nDefault migration of account indexes to disk\n\nPrivacy over Anonymity for Crypto Traders\n\nHere’s how Helius Labs, a Solana infrastructure provider, described this feature:\n\n“Confidential transfers, a feature introduced by Token2022, use zero-knowledge proofs to encrypt SPL token balances and transaction amounts. The primary goal of this feature is to enhance user privacy with an emphasis on confidentiality rather than anonymity.”\n\nIn its development, Helius also highlighted that mathematical operations on encrypted amounts for these so-called “confidential” crypto transactions are based on Twisted EIGamal encryption. In validating these, Sigma protocols will be of great utility. These protocols fall under the category of ZK proofs where the prover can demonstrate to the verifier that they know secret information without revealing it.\n\nTo top it off, developers propose the addition of Command Line Interface (CLI) support.\n\nIt’s worth noting that the question of privacy and anonymity is Monero’s (XMR) domain. However, financial market regulators and central banks do not approve of this idea. Recently, the BIS has established “Atlas,” a platform that will strictly monitor cryptocurrency transactions.\n\nMaximize your Cointribune experience with our 'Read to Earn' program! Earn points for each article you read and gain access to exclusive rewards. Sign up now and start accruing benefits.\n\nClick here to join 'Read to Earn' and turn your passion for crypto into rewards!\n\nA A Lien copié"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90cmFkZWN1cnZlLW1hcmtldHMtdGNydi1wcmVzYWxlLXNjb3JjaGluZy1ob3QtYXMteHJwLWFuZC1zb2xhbmEtc29sLWJvdGgtdHJlbmRpbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "Tradecurve Markets (TCRV) Presale Scorching Hot as XRP and Solana (SOL) Both Trending - CryptoPotato",
        "content": "At the moment, some coins and tokens stand out from the crowd, capturing global attention. Two cryptocurrencies that have recently been making waves are XRP (XRP) and Solana (SOL).\n\nIn addition to these trending coins, the sizzling hot presale of Tradecurve Markets (TCRV) has entered Stage 6.\n\n>>Visit The Tradecurve Markets Presale<<\n\nXRP (XRP): Under Bull Control\n\nXRP (XRP) displays significant bullish signs after its recent legal victories against the United States Securities and Exchange Commission (SEC). According to Santiment, the XRP coin has emerged as the most trending digital asset after its consecutive courtroom successes.\n\nThe XRP price surged to nearly $0.54 on October 5 following a judge’s dismissal of the SEC’s wish to appeal its initial loss in July. This legal momentum has reignited investor confidence. As a result, experts are now forecasting a potential surge in the price of XRP to $0.79 by December 2023.\n\nWith its legal battles slowly going behind it, XRP is charting an exciting path for the future. Thus making it a cryptocurrency to watch closely in the coming months.\n\n>>Register For The Tradecurve Markets Presale<<\n\nSolana (SOL): Achieves New Record\n\nSolana (SOL) is undeniably on an impressive uptrend, with capital inflows surging to nearly $24M in the week ending October 6. This is marking a level not seen since March 2022. Looking at the bigger picture, this remarkable momentum can be attributed to the launch of ether futures ETF products.\n\nDuring that week, the value of Solana rose to $24.42 – a price not achieved since August 2023. As more investors flock to its ecosystem, the Solana crypto has garnered significant attention for its high-performance blockchain. Therefore, market analysts are optimistic about its future, forecasting the Solana price to hover between $26.39 and $29.22 before 2023 ends.\n\nSolana’s rapid ascent and growing popularity indicate that it will remain a key player in the crypto space and a notable contender for future success.\n\nTradecurve Markets (TCRV): The Sizzle of the Presale\n\nWhile XRP and Solana are grabbing headlines, Tradecurve Markets (TCRV) has generated excitement with its scorching hot presale. The project is now in stage 6. With millions of TCRV native tokens sold, over 18,000 users onboarded, and $6.6M raised so far, the future for Tradecurve Markets looks bright.\n\nThis upcoming hybrid trading platform is poised to solve issues that have plagued the online trading market. For instance, some trading platforms like Binance or Coinbase only focus on cryptocurrencies, while others require multiple accounts. However, Tradecurve Markets will change this by allowing the trade of all derivatives from one account.\n\nAdditionally, concerns about data privacy and security are big. To solve this issue, Tradecurve Markets will eliminate sign-up KYC checks. This means traders can access the platform and start trading without disclosing personal information. As a result, users can enjoy a completely private trading environment.\n\nCurrently, TCRV is worth only $0.03. But, thanks to its low market cap and real-world connections to the forex market (valued at $753.2B in 2022 as per IMARC Impactful Insights), there’s an allure.\n\nFor more information about the Tradecurve Markets (TCRV) presale:\n\nVisit presale: https://app.tradecurvemarkets.com/sign-up\n\nTwitter: https://twitter.com/Tradecurveapp\n\nDisclaimer: The above article is sponsored content; it’s written by a third party. CryptoPotato doesn’t endorse or assume responsibility for the content, advertising, products, quality, accuracy, or other materials on this page. Nothing in it should be construed as financial advice. Readers are strongly advised to verify the information independently and carefully before engaging with any company or project mentioned and do their own research. Investing in cryptocurrencies carries a risk of capital loss, and readers are also advised to consult a professional before making any decisions that may or may not be based on the above-sponsored content.\n\nReaders are also advised to read CryptoPotato’s full disclaimer."
    }
]