[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9jcnlwdG9jdXJyZW5jeS1hbmFseXRpY3MtaW5zaWdodC9hcmUtc29sYW5hLXNvbC1hbmQtY2hpbGl6LWNoei10b28tdm9sYXRpbGUtZm9yLXlvdS1vcmJlb24tcHJvdG9jb2wtb3Jibi1pcy1oZXJl0gGbAWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2FtcC9zdG9yeS9jcnlwdG9jdXJyZW5jeS1hbmFseXRpY3MtaW5zaWdodC9hcmUtc29sYW5hLXNvbC1hbmQtY2hpbGl6LWNoei10b28tdm9sYXRpbGUtZm9yLXlvdS1vcmJlb24tcHJvdG9jb2wtb3Jibi1pcy1oZXJl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "Are Solana (SOL) And Chiliz (CHZ) Too Volatile For You? Orbeon Protocol (ORBN) Is Here! - Analytics Insight",
        "content": "The stormy year of 2022 has finally ended, and some cryptocurrency enthusiasts are exhaling with joy. In light of the recent bear market's widespread decline in coin prices, traders have started to review their cryptocurrency assets. They have noticed that investing early in projects is the most profitable, which is why Orbeon Protocol is attracting alot of crypto investors, It is already in stage 3 of its presale, but its popularity is soaring. Let's see why."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMS8xNy9zb2xhbmEtZm91bmRhdGlvbi1yaXBwbGUtZ2JiYy1hbmQtb3RoZXJzLWZvcm0tcGFydG5lcnNoaXAtdG8tcHJvbW90ZS1jcnlwdG8tc29sdXRpb25zLWZvci1jbGltYXRlLWNoYW5nZS_SAZoBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDEvMTcvc29sYW5hLWZvdW5kYXRpb24tcmlwcGxlLWdiYmMtYW5kLW90aGVycy1mb3JtLXBhcnRuZXJzaGlwLXRvLXByb21vdGUtY3J5cHRvLXNvbHV0aW9ucy1mb3ItY2xpbWF0ZS1jaGFuZ2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "Solana Foundation, Ripple, GBBC and Others Form Partnership to Promote Crypto Solutions for Climate Change - CoinDesk",
        "content": "Hwang, who works on supporting the infrastructure ecosystem for the initiative, including carbon credit measurements, which calculates the reduced amount of greenhouse gases generated by human actions, said his team has been meeting every week for the last two and a half years hosting workshops and forums focused on education. The initiative looks to come up with principles of cooperation and best practices for climate-related blockchain efforts in different sectors, as well as business cases for climate-crypto projects."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDEvMTcvc29sYW5hLXByaWNlLXJlY292ZXJzLXNpbmNlLWZ0eC1pbXBsb3Npb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "Solana Price Recovers Since FTX Implosion - Crypto Times",
        "content": "The Solana community lets out a sigh of relief as Solana’s SOL token spikes 80% in the second week of 2023. Solana has increased almost 130% since 2023 started after suffering the most since the FTX implosion in November 2022.\n\nAccording to CoinGecko, the price of SOL has more than doubled this month, climbing more than 60 percent to $23.55 in the last seven days.\n\nThe Solana ecosystem plummeted almost 98% to $210 million, from its peak of $10.17 billion in November 2021, causing uncertainty in the community.\n\nBut Solana momentarily pulled down Polygon MATIC and returned to the list of the top 10 digital assets by market cap after the spectacular surge, now sitting at the 11th position. New Year, New Milestones!!\n\nSolana traded as low as $9 at the height of the uncertainty, with Solana not only losing its most popular NFT project, DeGods but also the y00ts NFT collection from its platform.\n\nSolana’s active wallet has risen by more than three times since FTX collapsed in November. Even decentralized exchanges on Solana DEXs have seen an 83% increase in total active wallets since the beginning of 2023.\n\nSolana’s rising number of active wallets coincided with the emergence of the Bonk Inu meme coin within its ecosystem. BONK experienced a gain of almost 130%, reviving interest in the Solana ecosystem.\n\nRecently, even Vitalik Buterin expressed support for Solana developers’ causing the SOL token price to hike. Will all these positive movements continue for the rest of the year is still an open question. Even yet, given the effect of the FTX collapse on the protocol, it demonstrates that the Solana network is on the right track."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDEvMTcvc29sZmxhcmUtd2FsbGV0LWltcGxlbWVudHMtcHJpb3JpdHktZ2FzLWZlZXMtaW4tc29sYW5hL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "Solflare Wallet Implements Priority Gas Fees in Solana - Crypto Times",
        "content": "The popular wallet built for the Solana blockchain, Solflare, announced that Solana users can now pay higher gas fees to push through network congestion.\n\nSolrise Finance co-founder Vidor Gencel tweeted “@solflare_wallet is the first to implement this in a user-friendly way! In-wallet transactions will automatically be prioritized with the current market price for fees, ensuring that your transactions are included faster than those in other wallets.”\n\n🚀 Priority fees are live in Solflare Web/Extension 🚀\n\n\n\nSolflare will automatically detect whether the @solana network is under load & slightly increase fees to prioritize your transaction over others.\n\n\n\nWhen it matters the most, your transactions will go through and be fast! 🤝 pic.twitter.com/4OGV4IvjxZ — Solflare – The Solana Wallet (@solflare_wallet) January 16, 2023\n\nPriority fees also contribute to the stability of a blockchain network by deterring users from repeatedly sending transactions to the Solana network in the hopes that one of them would be accepted.\n\nDue to improper prioritization, users of other wallets might not be able to conduct transactions during periods of high network traffic.\n\nSolflare will now automatically detect whether the Solana network is under load and slightly increase fees to prioritize some transactions over others.\n\nAccording to Gencel, the next stages include working with dApps to effectively prioritize their transactions and offering a safety feature in the wallet to prevent any misuse of the fee mechanism.\n\nThe Solflare priority fees mechanism is currently active for in-wallet transactions as well as on the web and extension. Priority fees for mobile and app users will soon be live.\n\nSolana experiences network congestion most of the time as it tries to manage a spike in transactions. In September 2021, Solana experienced a 17-hour network outage which occurred due to resource exhaustion. The number of transactions was 400,000 transactions per second, which flooded the processing queue and led to a fork."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzAxLzE3L3RvcC10cmFkZXItc2F5cy1zb2xhbmEtc29sLWNvdWxkLXJlcGVhdC1ldGhlcmV1bXMtZXRoLWV4cGxvc2l2ZS0yMDIxLXJhbGx5LWhlcmVzLWhpcy1jaGFydC_SAYABaHR0cHM6Ly9kYWlseWhvZGwuY29tLzIwMjMvMDEvMTcvdG9wLXRyYWRlci1zYXlzLXNvbGFuYS1zb2wtY291bGQtcmVwZWF0LWV0aGVyZXVtcy1ldGgtZXhwbG9zaXZlLTIwMjEtcmFsbHktaGVyZXMtaGlzLWNoYXJ0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Jan 2023 08:00:00 GMT",
        "title": "Top Trader Says Solana (SOL) Could Repeat Ethereum’s (ETH) Explosive 2021 Rally – Here’s His Chart - The Daily Hodl",
        "content": "A popular crypto strategist and trader says smart contract protocol Solana (SOL) could mirror Ethereum’s (ETH) 2021 meteoric rise.\n\nPseudonymous analyst Inmortal tells his 191,200 Twitter followers that Solana could be following ETH’s pattern that eventually led to the top altcoin breaking out of its resistance at $400 in 2021 and rallying to its all-time high.\n\n“Still in play.”\n\nLooking at the trader’s chart, the similarities between the two charts could have more weight should Solana manage to take out its resistance at around $60.\n\nAt time of writing, SOL is changing hands for $23.18. The ETH rival has risen in value by nearly 200% from its low of $8.03 in December 2022.\n\nFellow crypto analyst Altcoin Sherpa is also keeping a close watch on Solana. He tells his 189,100 Twitter followers that while SOL has more upside potential, he believes the crypto asset will likely undergo a significant correction.\n\n“Do we think this Solana run is going to keep going? I could see more upside to the mid $30s from here if BTC continues. Ultimately, though, I think that we fill the gap with trading volume between $17-$28 or so. Probably going to eventually trade there.”\n\nAs for Bitcoin (BTC), Inmortal predicts that the king crypto could briefly dip below $20,000 before recovering the key psychological level and rallying to around $24,000.\n\n“$21,000 ? $18,000 ? $24,000.”\n\nSource: Inmortal/Twitter\n\nAt time of writing, Bitcoin is changing hands at $21,055.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Colourful Cat"
    }
]