[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzMwL2NyeXB0by1mdW5kcy1zZWUtbGFyZ2VzdC1pbmZsb3ctaW4tMTUtbW9udGhzLXdpdGgtYml0Y29pbi1zb2xhbmEtbGVhZGluZy1yYWxseS1jb2luc2hhcmVzL9IBigFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzMwL2NyeXB0by1mdW5kcy1zZWUtbGFyZ2VzdC1pbmZsb3ctaW4tMTUtbW9udGhzLXdpdGgtYml0Y29pbi1zb2xhbmEtbGVhZGluZy1yYWxseS1jb2luc2hhcmVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Crypto Funds See Largest Inflow in 15 Months, With Bitcoin, Solana Leading Rally: CoinShares - CoinDesk",
        "content": "CoinShares, however, did note that last week's inflows – while sizable – were only the 21st largest weekly gain over the three years the company has been keeping a record of such data, indicating that investors might still be somewhat cautious about deploying capital."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vdS50b2RheS90aGVzZS0zLXNvbGFuYS1zb2wtbWV0cmljcy1wb2ludC10by10aGlzLXByaWNlLXRhcmdldNIBSWh0dHBzOi8vdS50b2RheS90aGVzZS0zLXNvbGFuYS1zb2wtbWV0cmljcy1wb2ludC10by10aGlzLXByaWNlLXRhcmdldD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "These 3 Solana (SOL) Metrics Point to This Price Target - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nAdvertisement\n\nSolana (SOL) is on a bullish run in its bid to consolidate its growth for October and, possibly, to end the month on a massive bullish surge. Solana's price, according to data from CoinMarketCap, is pegged at $34.61, up by 7.41% over the past 24 hours. This growth comes at a time when Bitcoin (BTC) appears to be paring off its gains, an unsurprisingly bearish move.\n\nWhat Solana metrics show\n\nBesides this massive uptrend recorded overnight, Solana is also displaying an impressive trading volume. Per on-chain data, a total SOL worth $885,337,875 has been traded, amounting to a 116% jump in price. This massive interest as showcased by the trading volume underscores the attractiveness of Solana to both retail and institutional investors.\n\nSOL 1D Chart. Source: CoinMarketCap\n\nSolana's daily chart, as depicted above shows a surge from $32.41 to its current price level on the back of the trading volume. Besides volume, Solana's total value locked (TVL) on its DeFi platforms also underscores the protocol has massive room for growth. Pegged at $394.16 million, Solana has the capacity for growth in the long term to catch up with its peers.\n\nOverall, Solana has maintained as much as a 241% year-to-date (YTD) growth, leaving behind its top competitors, like Cardano (ADA), as the protocol continues to welcome bullish predictions for the coming months and years.\n\nPotential SOL price target\n\nWith the current price outlook, Solana is currently trading at its highest price level for the month. However, with the coin in a price discovery level, we can see it touch a high of $40, a feat that, if achieved, will mark its highest level since June 2022.\n\nSolana has obvious whale actions, predictions and fundamentals within its ecosystem that can help it achieve this historic price growth in the near future."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL3RoaXMtc29sYW5hLWJhc2VkLXRva2VuLWhhcy1yYWxsaWVkLWJ5LTEwMS1pbi1hLXdlZWstYW5kLWNvdWxkLXJlaWduaXRlLXRoZS1tZW1lLWNvaW4tcmFsbHktMjAyMzEwMzAyMDEx0gGbAWh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3RoaXMtc29sYW5hLWJhc2VkLXRva2VuLWhhcy1yYWxsaWVkLWJ5LTEwMS1pbi1hLXdlZWstYW5kLWNvdWxkLXJlaWduaXRlLXRoZS1tZW1lLWNvaW4tcmFsbHktMjAyMzEwMzAyMDEx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "This Solana-based token has rallied by 101% in a week and could reignite the meme coin rally - FXStreet",
        "content": "Solana price rally is highly anticipated as the protocol-organized developer conference Breakpoint began on Monday.\n\nMemecoin BONK, which is less than a year old, is up by 101% in the past week in anticipation of Breakpoint.\n\nBONK price rally could either induce bullishness in DOGE, SHIB, and other meme coins, or a liquidity crisis could cause a rapid crash.\n\nSolana is making the headlines with Breakpoint at the moment as the month of crypto conferences is upon us. Starting Monday, the developer meetup is expected to generate some significant bullishness for SOL as well as the entire ecosystem.\n\nHowever, even before the conference begins, one of the tokens based on the network is causing ripples in the meme coin community.\n\nSolana Breakpoint BONKs memecoin market\n\nBonk (BONK), a Solana-based meme coin, has generated significant interest among investors over the past week. The token, which is based on the “Bonk” meme, has rallied by more than 100% in just seven days, entering the watchlist of analysts.\n\nBONK/USD 1-day chart\n\nWhile the Bitcoin ETF-fuelled rally pushed many tokens upward, BONK stands out for the potential it represents in the crypto market. The cryptocurrency is the first meme coin in a long time to post such gains in such a short span. More than the rise, the demand for Bonk is also rather significant.\n\nIn the last 24 hours, the memecoin has observed investors conducting transactions consistently, generating volume worth over $19.5 million. Given that the total market capitalization of Bonk at the time of writing is a little under $34.5 million, the 24-hour volume alone is worth more than half the value of the entire circulating supply of BONK.\n\nBONK market capitalization and 24-hour trading volume\n\nThis, according to popular analyst Miles Deutscher, is both a potentially great and terrible development. As he stated on X, formerly Twitter,\n\n“There are 2 scenarios here: 1. SOL tops around Breakpoint, and BONK retraces even further - fitting my SOL short-term short bias. Or, 2. This is the start of a proper move, and memecoins gain steam.\n\nPut simply, since the volume of the transactions conducted in a day is so high in comparison to the market capitalization of BONK, a liquidity crisis is not too far from the realm of reality. But if the meme coin manages to avoid that and keep on rallying, it could induce bullishness in its peers such as Dogecoin, Shiba Inu, and Floki Inu.\n\nWatch out for Solana price rise too\n\nSince Breakpoint is the first major event conducted by Solana since the FTX collapse last November, a lot of pressure sits atop its shoulders. The success or failure of the event could translate to either a rally or a crash in Solana price, which is why the altcoin is currently on the hot list of many analysts and traders who are looking to both long and short the asset.\n\nIn a bullish scenario, SOL is expected to shoot up from $34 to $37 and likely even breach $40, while a bearish outcome would result in the “Ethereum killer” falling below $30, potentially hitting $26.\n\nRead more about Solana price’s targets here - SOL pumps 7%, records highest daily close since FTX went down as Solana Breakpoint conference commences"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3Mvc29sYW5hcy1zb2wtcHJpY2UtcHJlZGljdGVkLXRvLXN1cnBhc3MtMzAwMC1pbi1idWxsaXNoLXNjZW5hcmlvLWJ5LTIwMzDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Solana's SOL Price Predicted to Surpass $3000 in Bullish Scenario by 2030 - Blockchain News",
        "content": "A detailed analysis by VanEck, a major asset management firm, sketches various valuation scenarios for Solana (SOL) by the year 2030, amid the blockchain's remarkable performance and its strive for scalability , dated October 27, 2023.\n\nVanEck's examination lays out three potential SOL price paths by 2030: a bearish $9.81, a bullish $3,211.28, and a base case of $335, driven by diverse market shares and revenue estimations across key sectors. This is part of a broader scenario where Solana emerges as the first blockchain to host an application with over 100 million users. Despite the envisioned lower monetization rate at 20% of Ethereum's (ETH) and smaller market shares due to community philosophy differences, there's a credible trajectory to $8 billion in revenues for SOL token holders by the end of the decade.\n\nCentral to Solana's promise is its technical prowess, particularly in scaling blockchain operations. Through rigorous optimization, Solana achieves higher transaction throughput, surpassing many legacy competitors. This technical edge extends to its data throughput capacity, a critical metric for blockchain efficacy, which is slated for a tenfold increase with the upcoming Firedancer upgrade. The blockchain's unique features like Local Fee Markets further refine the user experience by effectively managing transaction costs and system congestion.\n\nSolana's innovative spirit has birthed an array of ventures, such as blockchain-optimized mobile phones and consumer-centric applications like decentralized mapping. Its initial vision of becoming a \"Decentralized Nasdaq\" has broadened with the advent of intriguing non-financial applications, underpinned by partnerships with industry giants like Shopify, Visa, and Google, which augment its ecosystem.\n\nHowever, sustainability concerns loom. A glaring discrepancy between Solana’s revenue ($1.26 million) and blockchain security costs ($52.78 million) over a recent 30-day period underscores the pressing need for a more balanced financial framework. The continuous influx of speculative capital to offset validator selling pressure, against a backdrop of minuscule transaction fees, paints a challenging picture for long-term economic viability.\n\nSolana's journey is also marred by technical instabilities, with notable network downtimes between January 2022 and February 2023. Despite subsequent improvements, the complexity of Solana's design, coupled with a high bar of programming proficiency, hinders a broader developer engagement. The blockchain's share of active crypto developers has stagnated around 6-7% over the last 18 months, which might impede its ambition to host tomorrow's blockbuster applications.\n\nUtilizing a standardized valuation framework, VanEck projects a base SOL token valuation of $335 by 2030, based on an expected real rate of return applied to the terminal year's Free Cash Flow. The projection, however, is pinned on substantial growth in user and developer adoption, which presently trails that of Ethereum. The potential implementation of token-voting governance by 2030 could enhance SOL token economics, provided a vibrant ecosystem activity ensues.\n\nSolana, with its relentless focus on user-centric innovations and blockchain efficiency, offers a compelling narrative. Yet, its path to significant valuation and ecosystem growth is fraught with technical, financial, and developer adoption challenges that require diligent addressing to ensure a robust and sustainable blockchain platform through 2030 and beyond.\n\nImage source: Shutterstock\n\n. . .\n\nTags"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbmNvZGV4LmNvbS9hcnRpY2xlLzMzODUxL3NvbGFuYS1hdC1vdmVyLTMwMDAtYnktMjAzMC10aGlzLWludmVzdG1lbnQtYW5hbHlzdC10aGlua3MtaXRzLXBvc3NpYmxlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 30 Oct 2023 07:00:00 GMT",
        "title": "Solana at Over $3,000 by 2030? This Investment Analyst Thinks It's Possible - CoinCodex",
        "content": "Key takeaways\n\nSolana (SOL) bull case projected to be north of $3,000 by the year 2030, according to investment analysts at VanEck\n\nVanEck shared their ‘Base, Bear, Bull Case’ for SOL, highlighting the blockchain’s in-built performance capacity as reason to be bullish and several major hurdles as reason to be bearish\n\nOn balance, VanEck is positive about the future of Solana and clarified that the company itself has investment exposure following the launch of the Solana ETP\n\nVanEck provides its base, bear and bull case for SOL by 2030\n\nVanEck, an ETF and mutual fund management company based in the United States, recently released a fundamental analysis of Solana’s (SOL) price potential over the coming years. The ‘Base, Bear, Bull Case’ features an in-depth look into Solana’s unique value proposition within the world of Web3.\n\nTo summarize the content before getting into its reasoning, VanEck believes that SOL could hit $3,000 per token under the right circumstances. This projection represents the bull case for SOL, with the bear case being as low as $10.\n\nThe major discrepancy between the bull case and the bear case for SOL should come as little surprise. Blockchain-based cryptocurrencies are experimental technologies — while they certainly have major potential to disrupt the digital landscape, they also contain risks that are inherent in the process of discovery.\n\nVanEck clarified that it has investment exposure to SOL. The financial analysts believe that Solana is one of the more promising blockchain networks due to its unique capacity to scale the decentralized web, stating that there is a “credible path” towards $8bn in revenue for Solana by 2030.\n\nVanEck’s Base, Bear, Bull Case for Solana (SOL)\n\nSolana could be the most efficient blockchain in Web3, but is demand the missing link?\n\nVanEck highlighted Solana’s scalability potential as the underlying value proposition of the blockchain. The layer-1 network currently processes more data than any of its competitors and is soon releasing its Firedancer upgrade that will multiply this statistic by a factor of 10. VanEck believes that, after Firedancer is implemented, Solana will be far and away the most efficient blockchain in Web3.\n\nSolana was specifically designed to meet the requirements of consumer-based dApps. It offers ultra-low transaction fees and rapid block confirmations, being able to process transactions in as little as 2 seconds for less than $0.01. Its main problem is that no dApps have so far been able to attract the level of demand that this kind of performance is able to support.\n\nSolana outperforms other blockchains when measuring data throughput\n\nInfrastructure projects such as digital asset exchanges and L1/L2 blockchains often support the highest number of on-chain users by far. dApps, however, rarely support more than 100,000 users at a time. Some notable exceptions to these conditions are the highest-rated GameFi titles — Axie Infinity and Splinterlands, for example, each attracted more than 1 million daily active users at their peak.\n\nHowever, Axie Infinity and Splinterlands’ figures are still extremely low compared to the most-used web apps in the world. VanEck referenced “2bn monthly Facebook users and 431m monthly PayPal users” to show the gulf in demand between on-chain services and traditional web apps at this moment in time.\n\nVanEck believes that this discrepancy highlights Solana’s long term potential. Solana has the unique capacity to support dApps that can truly scale to the same level as the most popular web apps in the world. VanEck therefore sees Solana’s scalability as a fundamental reason why it could be the blockchain that delivers global adoption.\n\nHowever, the gap between Solana’s scalability potential and its current user base is seen as a major hurdle for the project to overcome. Solana suffers from operating losses due to the high costs of running its network infrastructure combined with low revenue generation from relatively few users and sub-cent transaction fees.\n\nUnless Solana can successfully match its costly high-performance network with truly scaled demand, then it may struggle to ever turn a profit as an organization.\n\nThe cost of running Solana’s high performance blockchain is high, and the network operates at a loss due to its low transaction fees\n\nBottom line: VanEck’s Base, Bear, Bull Case highlights a key hurdle for Solana to overcome if it is to be successful long-term\n\nThe major discrepancy between VanEck’s bear case and bull case boils down to a gulf between the blockchain’s potential to support users and its actual usership rates in 2023. At this moment in time, Solana operates at a loss that is unsustainable over the long-term, and it therefore must match its highly scalable network with equally popular dApps if it’s ever going to achieve its potential.\n\nThat said, the blockchain industry’s rapid rate of adoption bodes well. The total number of people in the world who own cryptocurrency grew from 5 million to 295 million between 2016 and 2021, which averages to a +11,800% annual adoption rate. If Web3 continues its rapid rate of adoption, it is well on course to reaching 1 billion users before 2030.\n\nWithin this context, VanEck believes that Solana could be the first layer-1 network to support a dApp that serves 100 million users. If the blockchain successfully fulfills its value proposition, then the investment analysts believe that it could solve its revenue problem and hit its bull target of $3,211 by the year 2030."
    }
]