[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA4LzA5L2JlbmphbWluLWNvd2VuLXNheXMtc29sYW5hLXNvbC1jb3VsZC1yZXBlYXQtY2FyZGFub3MtYWRhLTIwMTktYmVhci1tYXJrZXQtdHVybmFyb3VuZC_SAXpodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8wOS9iZW5qYW1pbi1jb3dlbi1zYXlzLXNvbGFuYS1zb2wtY291bGQtcmVwZWF0LWNhcmRhbm9zLWFkYS0yMDE5LWJlYXItbWFya2V0LXR1cm5hcm91bmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Benjamin Cowen Says Solana (SOL) Could Repeat Cardano’s (ADA) 2019 Bear Market Turnaround - The Daily Hodl",
        "content": "Top crypto trader Benjamin Cowen thinks Solana (SOL) could be in for some rough days ahead before making a big turnaround.\n\nCowen tells his 784,000 YouTube subscribers that Solana has “a bit more resilient” than some other altcoins because of its heavy capitulation at the end of 2022.\n\nThe analyst notes SOL put in a low earlier this year, then put in a high, then “swept the high.” Cowen compares it to Cardano’s (ADA) price trajectory in 2019.\n\n“I’m wondering if Solana’s now going to sweep the low. So if it breaks down below that trendline [around $16.50], which is an ‘if/then’ statement, I don’t know for sure if it would, but if it did break down below that trendline, then it makes me wonder — does it actually go on to sweep the low [around $11]?\n\nNow I know that might be seen as a fairly bearish view, but I can’t help but remember the last cycle when ADA… did the exact same thing. It basically capitulated over here, put in a high, we then swept the high, and then we went down, and guess what? We swept the lows.\n\nIt was only after Cardano swept the lows that it then took off into a more sustained run. So I’m still thinking that there is a chance that a lot of these altcoins could fade back down and sweep some of their lows, maybe take those lows out. It could even occur as late as right before the halving.”\n\nSOL is trading at $24.20 at time of writing. The 10th-ranked crypto asset by market cap is up nearly 5% in the past 24 hours.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiuwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtOS1hdWd1c3QtMjAyMy9hcnRpY2xlc2hvdy8xMDI1NjQzMjguY21z0gG_AWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZXMtdG9kYXktbGl2ZS1uZXdzLWJpdGNvaW4tZG9nZWNvaW4tZXRoZXJldW0tc2hpYmhhLWludS1jcnlwdG9jdXJyZW5jeS1sYXRlc3QtdXBkYXRlcy05LWF1Z3VzdC0yMDIzL2FtcF9hcnRpY2xlc2hvdy8xMDI1NjQzMjguY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $29,700 ahead of US inflation data; Shiba Inu, Solana surge up to - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe crypto tokens were trading higher in Wednesday's trade ahead of key US inflation data. Bitcoin (BTC) rose 1.62% to $29,727, whereas Ethereum (ETH) was above the 1,850 level.BTC volume stood at approximately $18.1 billion, rising 34.35% in the last 24 hours.\"Bitcoin’s price breached the $30000 mark in the early hours of today but consolidated to trading above the $29500 level. This movement could be because of the fall in Chinese trade numbers for July and the U.S. 10-year Treasury yield descending lower by 11 basis points to 3.98%,\" Edul Patel, Co-founder and CEO at Mudrex, said.Other top crypto tokens, BNB , XRP, Dogecoin , Solana, Polygon, and Polkadot were also trading higher on Wednesday.Meanwhile, the global cryptocurrency market cap was trading higher, around $1.18 trillion, rising 1.49% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $578 billion. Bitcoin's dominance is currently 48.93%, an increase of 0.12% over the day, according to CoinMarketCap.\"BTC managed to break the $30k resistance level but failed to sustain the momentum, and is currently trading around $29.7k. Given its recent performance, BTC’s support level has been gradually increasing. If BTC continues to trade in a narrow range, it may find strong support at $29k itself in the coming weeks. This could provide a good base for a strong move that may follow,\" Shubham Hudda, Senior Manager at CoinSwitch Markets Desk, said.Rajagopal Menon, Vice President at WazirX, said, \"Major market oscillators point toward a Buy sentiment. The Relative Strength Index (14), one of the key indicators, sits at 54, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) is at 62 and 15, respectively, further indicating a Neutral market.\"\"The MACD Level (12, 26) at -90 indicates a Buy. The Stochastic RSI Fast (3, 3, 14, 14) is at 76 with a Neutral indicator, while the Williams Percent Range (14) at −30 signals Neutral,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.25 hours, IST on August 9, 2023)Bitcoin $29,727 1.62%Ethereum $1,856 1.27%Tether $0.9995 0.06%BNB $244 0.94%XRP $0.6448 3.22%Cardano $0.2981 1.99%Dogecoin $0.07498 1.46%Solana $24.4 5.03%Polygon $0.6911 3.27% Litecoin $84.04 1.64%Polkadot $5.05 1.43%Tron $0.07659 -0.22%Shiba Inu $0.000009627 7.07%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiuwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtOS1hdWd1c3QtMjAyMy9hcnRpY2xlc2hvdy8xMDI1NjQzMjguY21z0gG_AWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZXMtdG9kYXktbGl2ZS1uZXdzLWJpdGNvaW4tZG9nZWNvaW4tZXRoZXJldW0tc2hpYmhhLWludS1jcnlwdG9jdXJyZW5jeS1sYXRlc3QtdXBkYXRlcy05LWF1Z3VzdC0yMDIzL2FtcF9hcnRpY2xlc2hvdy8xMDI1NjQzMjguY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $29,700 ahead of US inflation data; Shiba Inu, Solana surge up to - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe crypto tokens were trading higher in Wednesday's trade ahead of key US inflation data. Bitcoin (BTC) rose 1.62% to $29,727, whereas Ethereum (ETH) was above the 1,850 level.BTC volume stood at approximately $18.1 billion, rising 34.35% in the last 24 hours.\"Bitcoin’s price breached the $30000 mark in the early hours of today but consolidated to trading above the $29500 level. This movement could be because of the fall in Chinese trade numbers for July and the U.S. 10-year Treasury yield descending lower by 11 basis points to 3.98%,\" Edul Patel, Co-founder and CEO at Mudrex, said.Other top crypto tokens, BNB , XRP, Dogecoin , Solana, Polygon, and Polkadot were also trading higher on Wednesday.Meanwhile, the global cryptocurrency market cap was trading higher, around $1.18 trillion, rising 1.49% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $578 billion. Bitcoin's dominance is currently 48.93%, an increase of 0.12% over the day, according to CoinMarketCap.\"BTC managed to break the $30k resistance level but failed to sustain the momentum, and is currently trading around $29.7k. Given its recent performance, BTC’s support level has been gradually increasing. If BTC continues to trade in a narrow range, it may find strong support at $29k itself in the coming weeks. This could provide a good base for a strong move that may follow,\" Shubham Hudda, Senior Manager at CoinSwitch Markets Desk, said.Rajagopal Menon, Vice President at WazirX, said, \"Major market oscillators point toward a Buy sentiment. The Relative Strength Index (14), one of the key indicators, sits at 54, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) is at 62 and 15, respectively, further indicating a Neutral market.\"\"The MACD Level (12, 26) at -90 indicates a Buy. The Stochastic RSI Fast (3, 3, 14, 14) is at 76 with a Neutral indicator, while the Williams Percent Range (14) at −30 signals Neutral,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.25 hours, IST on August 9, 2023)Bitcoin $29,727 1.62%Ethereum $1,856 1.27%Tether $0.9995 0.06%BNB $244 0.94%XRP $0.6448 3.22%Cardano $0.2981 1.99%Dogecoin $0.07498 1.46%Solana $24.4 5.03%Polygon $0.6911 3.27% Litecoin $84.04 1.64%Polkadot $5.05 1.43%Tron $0.07659 -0.22%Shiba Inu $0.000009627 7.07%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8xNTE4MzYvYml0c3RhbXAtZW5kLXRyYWRpbmctc29sYW5hLXBvbHlnb24tNS1vdGhlci1hbHRjb2lucy11cy11c2Vyc9IBXWh0dHBzOi8vZGVjcnlwdC5jby8xNTE4MzYvYml0c3RhbXAtZW5kLXRyYWRpbmctc29sYW5hLXBvbHlnb24tNS1vdGhlci1hbHRjb2lucy11cy11c2Vycz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Bitstamp to End Trading of Solana, Polygon and 5 Other Altcoins for US Users - Decrypt",
        "content": "We do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCryptocurrency exchange Bitstamp has announced its decision to “permanently” suspend trading for several altcoins for its U.S.-based users, effective from August 29, 2023.\n\nThe assets that will be affected by the suspension include Axie Infinity (AXS), Chiliz (CHZ), Decentraland (MANA), Polygon (MATIC), NEAR Protocol (NEAR), The Sandbox (SAND), and Solana (SOL).\n\nEstablished in 2011 and currently headquartered in Luxembourg, Bitstamp is the longest-standing crypto exchange. Over the past 24 hours, it's pushed roughly $175 million in volume, according to CoinGecko.\n\nBitstamp indicated that the decision was \"necessary\" due to the current regulatory uncertainty in the United States.\n\nAD\n\nAD\n\n\"We have taken this decision out of an abundance of caution, which we feel is necessary given continued uncertainty in the U.S. regulatory landscape,\" U.S. CEO and global CCO of Bitstamp Bobby Zagottta told Decrypt. \"We are and have always been supportive of clear and complete regulation in the U.S. and around the globe and remain hopeful that there will be improved clarity in the regulatory environment in the U.S. in the coming months.\"\n\nUpdate for our US users 📢 Starting August 29: AXS, CHZ, MANA, MATIC, NEAR, SAND, and SOL trading will be halted after evaluating recent market developments. Execute any open trades. Holding and withdrawing tokens afterwards will be unaffected. More info:… — Bitstamp (@Bitstamp) August 8, 2023\n\n“At Bitstamp, we have a comprehensive framework in place to continuously evaluate the cryptocurrencies we provide, taking into account the dynamic regulatory environment,” the exchange said in its announcement Tuesday. “Considering recent developments, we are making some changes to our crypto offerings—specifically for our customers residing in the United States.”\n\nThe exchange has clarified that although trading activities for these seven tokens will be halted, users can still hold them in their accounts and withdraw them at any time.\n\nAD\n\nAD\n\nSEC cracks down on crypto exchanges\n\nBinance.US, the American subsidiary of the world's largest cryptocurrency exchange, and Coinbase, the largest crypto trading platform in the U.S., are facing legal challenges as the SEC alleges that multiple tokens available for trading on these platforms qualify as unregistered securities.\n\nThe SEC also alleges that Coinbase operated as an unregistered national securities exchange, broker, and clearing agency for years and “elevated its interest in increasing its profits over investors’ interests.”\n\nCoinbase filed a motion to dismiss the SEC’s lawsuit on June 28, arguing that the agency does not have statutory authority over the exchange and that its position regarding its powers is “untenable as a matter of law.”\n\nThis was followed by a federal filing last week, in which the San Francisco-based company asked a judge to dismiss the SEC’s case\n\nLast month, a Coinbase representative told Decrypt that the crypto exchange is engaged in discussions with the SEC and believes \"that transparent and fair rulemaking and Congressional action […] represent the best path forward for American crypto users and the companies building the cryptoeconomy in the U.S.”"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9saWZlc3R5bGUvc3RvcnkvMjAyMy0wOC0wOS8yMDIzLXNjaG9sYXJzaGlwcy1hd2FyZGVkLWJ5LWZyaWVuZHMtb2YtdGhlLXNvbGFuYS1iZWFjaC1saWJyYXJ50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "2023 scholarships awarded by Friends of the Solana Beach Library - Del Mar Times",
        "content": "The directors of the Friends of the Solana Beach Library recently announced the recipients of the 2023 Friends Scholarship awards for education beyond the high school level. Six awards of $1,000 each were awarded to a diverse group of Solana Beach residents in terms of schools attended, educational, and career aspirations, and life experiences as detailed in their application essays. They all have significant records of academic achievement, service to the Solana Beach community and beyond, and outstanding recommendations from teachers, counselors, and others. On the evening of Tuesday, July 11, the awardees met with the the Friends of the Solana Beach Library Board of Directors to receive their scholarships at a ceremony at the Solana Beach Library.\n\nThe awardees listed in alphabetical order by first name include:\n\nAlexandra Worms\n\n\n\n(Courtesy of Alexandra Worms)\n\nAlexandra Worms who is a 2023 graduate of Canyon Crest Academy and plans to attend the University of Virginia as a Jefferson Scholar in the fall. Alexandra is interested in studying ethics, politics, and economics with the goal of a career in government, possibly as a legislator. She represented Solana Beach as a student board member of the San Diego County Board of Education and was also the Canyon Crest Academy Associated Student Body executive president and the San Dieguito Union High School District board student representative for Canyon Crest Academy.\n\nGabriela Sanchez\n\n\n\n(Courtesy of Gabriela Sanchez)\n\nGabriela Sanchez is a recent graduate of Torrey Pines High School and plans to attend California State University at San Marcos to major in kinesiology with the goal of becoming a physical therapist or athletic trainer. She became interested in this field of study through her years of playing rugby. She has served the Solana Beach community as an employee at the Boys & Girls Clubs of San Dieguito La Colonia Branch, volunteering at her local church food bank and thrift shop, and activities in the Solana Beach Soccer Club.\n\nGeorgia Villarreal\n\n\n\n(Courtesy of Georgia Villarreal)\n\nGeorgia Villarreal graduated in June from San Dieguito Academy. She will attend the University of California in Santa Cruz and plans to major in neuroscience. Her career goal is to become neurologist or neuropsychologist. At San Dieguito Academy Georgia was involved in clubs that help freshmen transition into high school and that promote mental health awareness. She has played field hockey in high school at the varsity level and has volunteered as a field hockey coach at Earl Warren Middle School.\n\nJacquelyn Perez\n\n\n\n(Courtesy of Jacquelyn Perez)\n\nJacquelyn Perez is a 2021 graduate of Torrey Pines High School and now is a first-year student at MiraCosta Community College. She plans to transfer to San Diego State University after graduating from MiraCosta. She is currently studying the administration of justice and plans a career in law enforcement, potentially as a probation/parole officer. Jackie has participated in many community activities, including Dia de Los Muertos, the Solana Beach Easter Event, and various Solana Beach Boys & Girls Club programs. She is currently involved in campus life at MiraCosta as a student ambassador and is a member of the Phi Theta Kappa honor society.\n\nJosue Arroyo\n\n\n\n(Courtesy of Josue Arroyo)\n\nJosue Arroyo graduated in June from Torrey Pines High School. He plans to attend MiraCosta College also prior to transferring to a four-year college. He currently plans to major in construction management. His community service has included participation in Casa De Amistad’s tutoring program including helping younger children learn about marine life and working at his local church on food fundraising. He also volunteered at Keystone South Summer Camp.\n\nMelissa Cruz Rios\n\n\n\n(Courtesy of Melissa Cruz Rios)\n\nMelissa Cruz Rios just completed her freshman year at the University of California, Riverside. She was a 2022 graduate of Torrey Pines High School. She plans on becoming a mechanical engineer. Her community service in Solana Beach included volunteering at the San Diego Community Resource Center, supervising teens associated with the Dia de Los Muertas annual event, and volunteering at the Boys & Girls Clubs. In addition, she was actively involved in her local church, helping to raise money and create Easter baskets for disadvantaged youth. More recently she has continued community service at UC Riverside by participating in the Student Association of Latino-Spanish Affairs, helping homeless people, and volunteering with TreePeople, a Southern California conservation and environmental nonprofit. She has also helped plan and organize the annual MEChA Youth Empowerment Conference and the 31st Annual Chicano/Latino Youth Leadership Conference.\n\nOver the past 14 years, the Friends of the Solana Beach Library is proud to have provided just over $47,000 in scholarship funds to students pursuing education beyond the high school level. If you wish to help them continue to support students through scholarships, you may specifically direct any money you wish to donate to the Friends to its Scholarship Fund. To donate and learn more, visit friendsofsolanabeachlibrary.org. —Friends of Solana Beach Library news release\n\n"
    }
]