[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2luYmFzZS11cGRhdGVzLXN0YWtpbmctZm9sbG93aW5nLXJlZ3VsYXRvcnktMjMxMjI1MzY3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Coinbase Updates Staking Service Following Regulatory Crackdown - Yahoo Finance",
        "content": "Coinbase today told users that it is updating the terms and conditions of its staking service—one month after U.S. regulators cracked down on similar products.\n\nAmerica’s biggest cryptocurrency exchange said in an email to customers on Friday that staking will continue and emphasized that clients will earn rewards through protocols and not Coinbase itself—which is a particular point of contention among U.S. regulators like the SEC.\n\nStaking is the process of “locking-up” cryptocurrency to keep a blockchain’s network running. Proof-of-stake assets—such as Ethereum, Cardano, and Solana—require people to pledge the blockchain’s native cryptocurrency to the network and earn rewards for doing so.\n\nIt can be a complicated process to do it yourself, so exchanges like Coinbase offer to do the process for their clients.\n\n“Coinbase acts only as a service provider connecting you, the validators, and the protocol,” the company said today, adding that there will also be a “transparent Coinbase fee.” The biggest change, however, is that users must now unstake certain assets before selling or transferring them, which brings Coinbase’s service more in line with the kinds of staking services that exist on blockchain networks natively.\n\nThe assets that must now be unstaked on Coinbase are Solana (SOL), Cosmos (ATOM), Cardano (ADA), and Tezos (XTZ). Up to now, users who hold Solana on Coinbase, for instance, earn staking rewards passively without the need to opt into the service, and can transfer and sell those assets whenever they wish. But that is changing.\n\nCoinbase now cautions that any asset staked on its platform may take between a “few hours or a few weeks” before it can be unstaked and then moved or sold. “The time required is due to protocol rules and Coinbase’s processing time,” the email to customers read.\n\nAre Regulators Taking Aim at Crypto Staking? Rumors Suggest New SEC Scrutiny\n\nThe update to Coinbase’s terms comes after the U.S. Securities and Exchange Commission last month fined Kraken—another popular American digital asset exchange—$30 million because its staking product allegedly violated securities laws.\n\nThe SEC said that Kraken had failed to register the offer and sale of their crypto asset staking-as-a-service program. The regulator also ordered the exchange to halt its staking service for U.S. customers.\n\nKraken agreed to pay the fine but said it would still offer staking services for non-U.S. clients through a separate Kraken subsidiary.\n\nAccording to the SEC, staking services may run afoul of federal securities laws in the U.S. when exchanges make themselves too much of an intermediary by determining the returns its customers would receive, instead of strictly the protocol.\n\n“Defendants determine these returns, not the underlying blockchain protocols, and the returns are not necessarily dependent on the actual returns that Kraken receives from staking,” the SEC said last month in its complaint against the San Francisco-based exchange."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2luYmFzZS11cGRhdGVzLXN0YWtpbmctZm9sbG93aW5nLXJlZ3VsYXRvcnktMjMxMjI1MzY3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Coinbase Updates Staking Service Following Regulatory Crackdown - Yahoo Finance",
        "content": "Coinbase today told users that it is updating the terms and conditions of its staking service—one month after U.S. regulators cracked down on similar products.\n\nAmerica’s biggest cryptocurrency exchange said in an email to customers on Friday that staking will continue and emphasized that clients will earn rewards through protocols and not Coinbase itself—which is a particular point of contention among U.S. regulators like the SEC.\n\nStaking is the process of “locking-up” cryptocurrency to keep a blockchain’s network running. Proof-of-stake assets—such as Ethereum, Cardano, and Solana—require people to pledge the blockchain’s native cryptocurrency to the network and earn rewards for doing so.\n\nIt can be a complicated process to do it yourself, so exchanges like Coinbase offer to do the process for their clients.\n\n“Coinbase acts only as a service provider connecting you, the validators, and the protocol,” the company said today, adding that there will also be a “transparent Coinbase fee.” The biggest change, however, is that users must now unstake certain assets before selling or transferring them, which brings Coinbase’s service more in line with the kinds of staking services that exist on blockchain networks natively.\n\nThe assets that must now be unstaked on Coinbase are Solana (SOL), Cosmos (ATOM), Cardano (ADA), and Tezos (XTZ). Up to now, users who hold Solana on Coinbase, for instance, earn staking rewards passively without the need to opt into the service, and can transfer and sell those assets whenever they wish. But that is changing.\n\nCoinbase now cautions that any asset staked on its platform may take between a “few hours or a few weeks” before it can be unstaked and then moved or sold. “The time required is due to protocol rules and Coinbase’s processing time,” the email to customers read.\n\nAre Regulators Taking Aim at Crypto Staking? Rumors Suggest New SEC Scrutiny\n\nThe update to Coinbase’s terms comes after the U.S. Securities and Exchange Commission last month fined Kraken—another popular American digital asset exchange—$30 million because its staking product allegedly violated securities laws.\n\nThe SEC said that Kraken had failed to register the offer and sale of their crypto asset staking-as-a-service program. The regulator also ordered the exchange to halt its staking service for U.S. customers.\n\nKraken agreed to pay the fine but said it would still offer staking services for non-U.S. clients through a separate Kraken subsidiary.\n\nAccording to the SEC, staking services may run afoul of federal securities laws in the U.S. when exchanges make themselves too much of an intermediary by determining the returns its customers would receive, instead of strictly the protocol.\n\n“Defendants determine these returns, not the underlying blockchain protocols, and the returns are not necessarily dependent on the actual returns that Kraken receives from staking,” the SEC said last month in its complaint against the San Francisco-based exchange."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2luYmFzZS11cGRhdGVzLXN0YWtpbmctZm9sbG93aW5nLXJlZ3VsYXRvcnktMjMxMjI1MzY3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Coinbase Updates Staking Service Following Regulatory Crackdown - Yahoo Finance",
        "content": "Coinbase today told users that it is updating the terms and conditions of its staking service—one month after U.S. regulators cracked down on similar products.\n\nAmerica’s biggest cryptocurrency exchange said in an email to customers on Friday that staking will continue and emphasized that clients will earn rewards through protocols and not Coinbase itself—which is a particular point of contention among U.S. regulators like the SEC.\n\nStaking is the process of “locking-up” cryptocurrency to keep a blockchain’s network running. Proof-of-stake assets—such as Ethereum, Cardano, and Solana—require people to pledge the blockchain’s native cryptocurrency to the network and earn rewards for doing so.\n\nIt can be a complicated process to do it yourself, so exchanges like Coinbase offer to do the process for their clients.\n\n“Coinbase acts only as a service provider connecting you, the validators, and the protocol,” the company said today, adding that there will also be a “transparent Coinbase fee.” The biggest change, however, is that users must now unstake certain assets before selling or transferring them, which brings Coinbase’s service more in line with the kinds of staking services that exist on blockchain networks natively.\n\nThe assets that must now be unstaked on Coinbase are Solana (SOL), Cosmos (ATOM), Cardano (ADA), and Tezos (XTZ). Up to now, users who hold Solana on Coinbase, for instance, earn staking rewards passively without the need to opt into the service, and can transfer and sell those assets whenever they wish. But that is changing.\n\nCoinbase now cautions that any asset staked on its platform may take between a “few hours or a few weeks” before it can be unstaked and then moved or sold. “The time required is due to protocol rules and Coinbase’s processing time,” the email to customers read.\n\nAre Regulators Taking Aim at Crypto Staking? Rumors Suggest New SEC Scrutiny\n\nThe update to Coinbase’s terms comes after the U.S. Securities and Exchange Commission last month fined Kraken—another popular American digital asset exchange—$30 million because its staking product allegedly violated securities laws.\n\nThe SEC said that Kraken had failed to register the offer and sale of their crypto asset staking-as-a-service program. The regulator also ordered the exchange to halt its staking service for U.S. customers.\n\nKraken agreed to pay the fine but said it would still offer staking services for non-U.S. clients through a separate Kraken subsidiary.\n\nAccording to the SEC, staking services may run afoul of federal securities laws in the U.S. when exchanges make themselves too much of an intermediary by determining the returns its customers would receive, instead of strictly the protocol.\n\n“Defendants determine these returns, not the underlying blockchain protocols, and the returns are not necessarily dependent on the actual returns that Kraken receives from staking,” the SEC said last month in its complaint against the San Francisco-based exchange."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZm9ya2FzdC5uZXdzL3NvbGFuYS1uZnQtc2FsZXMtc3VyZ2UtYXMtdHJhZGVycy1mYXJtLWZvci10ZW5zb3ItcmV3YXJkcy_SAVNodHRwczovL2Zvcmthc3QubmV3cy9zb2xhbmEtbmZ0LXNhbGVzLXN1cmdlLWFzLXRyYWRlcnMtZmFybS1mb3ItdGVuc29yLXJld2FyZHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Solana NFT sales surge as traders farm for Tensor rewards - Forkast News",
        "content": "Non-fungible token (NFT) traders on Solana could be moving to newer projects, as the Forkast SOL NFT Composite dipped this week while sales surged, an industry expert said.\n\nThe Forkast SOL NFT Composite – a measurement of the performance of the Solana NFT market through 100 smart contracts launched this week by Forkast.News and data partner CryptoSlam – dropped 6.13% to 1,155.15 over the past seven days through 3:30 p.m. in Hong Kong.\n\nSales on Solana, the second largest NFT blockchain, surged 40.66% over the past week to US$20.21 million, but the number of unique buyers for Solana NFTs shrank 86% to 12,113, according to data from CryptoSlam.\n\n“The Forkast SOL NFT Composite being down can reflect the casino aspect of NFTs where traders are moving from the more established projects to the newer ones, but it also could show some traders simply cashing out,” said Yehudah Petscher, NFT strategist at CryptoSlam.\n\nPetscher added: “With the overall weekly sales on Solana being up, and the announcement of rewards from the Tensor marketplace, it seems safe to assume that the Forkast SOL NFT Composite is reflecting traders farming for Tensor rewards.”\n\nActivity on Tensor, a Solana NFT marketplace, started to pick up this week after it launched an airdrop on Monday as part of its reward program, a model similar to what Ethereum NFT marketplace Blur has deployed to take customers and market share from OpenSea.\n\nSome 21.63% of all Solana NFT trades were made on Tensor over the past 24 hours, compared to 53.51% on Magic Eden, the dominant marketplace on the blockchain, according to figures from Solana data aggregator Tiexo. Tensor was a little-known marketplace where less than 10% of Solana NFT trades occurred until it launched its Blur-inspired airdrop.\n\nOn Monday, Tensor said it raised US$3 million in a seed round led by blockchain venture capital Placeholder.\n\n“It’s hard not to root for just good old-fashioned competition,” Petscher said. “Since Tensor announced a US$3 million raise and an upcoming airdrop of reward tokens, we’re seeing the markets react similarly to how they did on Ethereum with Blur.”\n\nPetscher added that the method of marketplaces winning over traders with rewards worked. “Trader-friendly tools then give Tensor an identity that differentiates them from other marketplaces, and in this case, they are tools that we’re proven to be preferred by traders (similar to Blur’s tools).”\n\nMeanwhile, Global NFT sales rose 1.73% over the past seven days to US$188.2 million, with the number of unique buyers plunging 70.62% to 175,708, according to CryptoSlam data.\n\nOutside Solana, Yuga Labs, creator of top collections like Bored Ape Yacht Club, released a new project on the Bitcoin blockchain, which raised about US$16.5 million through the sale of 288 NFTs over 24 hours. The “TwelveFold” collection, which launched on Sunday, consists of 300 individual works of 3D-rendered art.\n\n“Whether it’s wanting a stake in Bitcoin history with a low-numbered inscription, or simply having exposure to Yuga Labs, the provenance is the real value here, and apparently, it’s worth a lot,” Petscher wrote in a CryptoSlam’s Tuesday newsletter."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LnVzYXRvZGF5LmNvbS9zdG9yeS9tb25leS9pbnZlc3RpbmcvMjAyMy8wMy8xMC93aHktYml0Y29pbi1ldGhlcmV1bS1zb2xhbmEtY3Jhc2hpbmcvNjk5OTQyMDUwMDcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 10 Mar 2023 08:00:00 GMT",
        "title": "Why are Bitcoin, Ethereum, and Solana crashing today? Here's what happened. - USA TODAY",
        "content": "Travis Hoium\n\nThe Motley Fool\n\nCryptocurrencies have had a rough couple of days as word spread that the influential Silicon Valley Bank, which trades under SVB Financial Group (NASDAQ: SIVB), is facing a liquidity crisis. While this isn't directly a hit to crypto, many venture capital firms use Silicon Valley Bank, so there's a risk of a broader financial impact, which is why cryptocurrencies are down Friday.\n\nAs of 10:30 a.m. ET, Bitcoin (CRYPTO: BTC) had fallen by 8.5% over the prior 24 hours, Ethereum (CRYPTO: ETH) had fallen 8.8%, and Solana (CRYPTO: SOL) was down 5.7%. Looking further back, over the past seven days, those cryptocurrencies are down 11.2%, 10.7%, and 18.5% respectively.\n\nWhat happened with SVB? Silicon Valley Bank assets seized by FDIC in largest bank failure since 2008\n\nWhat happened this week with crypto\n\nThe two major events of the past week have been the collapse of Silvergate Capital and the potential collapse of Silicon Valley Bank. Silvergate provided a direct gateway into cryptocurrencies for many wealthy investors and institutions, and even operates many publicly traded funds. But it was seen as a more crypto-specific bank.\n\nThis week's bank run on Silicon Valley Bank is more concerning for the broader tech ecosystem. It is used by many start-ups and provides services small companies need in order to scale their businesses quickly.\n\nDo you have to report crypto on taxes? Yes. Here's what you should know about form 8949\n\nContagion, or cascading risks from one entity to another, is the biggest fear here. That could lead to less lending and investors pulling back their investments. Silicon Valley's venture capital firms provide the fuel for the tech ecosystem, and anything that impacts them could impact a lot of smaller start-ups.\n\nAs far as crypto goes, dozens of blockchain start-ups have been funded by venture capitalists in Silicon Valley. If they face pressure from regulators, banks and ultimately, investors, they may not be able to build the tools and services that are intended to make cryptocurrencies like Bitcoin, Ethereum, and Solana more useful, and thus more valuable.\n\nIn short, these ecosystems are intertwined, and the fear this week is that a collapse of Silicon Valley Bank will make this crypto winter even worse.\n\nWhat does this mean now for crypto?\n\nThe risk to financial institutions can't be understated because they're critical to making the financial system work. When lending pulls back all at once or there's a credit crisis, there can be an economywide impact, as we saw in 2008 and 2009.\n\nThe Labor Department's February jobs report Friday morning did provide some positive news. The U.S. economy added 311,000 non-farm jobs last month, but more people entered the workforce to seek jobs, so the unemployment rate rose to 3.6%. So far, the tech sector slowdown, the crypto collapse, and the downfall of some banks haven't spilled over to the broader economy.\n\nInvestors with a long-term view should start looking at this as a buying opportunity for high-quality cryptocurrencies. Despite the downturn in token values, the crypto industry continues to grow and innovate, which is ultimately what's going to drive value.\n\nIn the news:How crypto industry can move on after the fall of FTX founder Sam Bankman-Fried\n\nI don't know if we are at or even near the bottom, but I am betting on innovation in the blockchain winning in the long term. The Ethereum and Solana blockchains are where most developers are building, and that's where I'm looking to be a buyer if this crash gets worse.\n\nSVB Financial provides credit and banking services to The Motley Fool. Travis Hoium has positions in Ethereum and Solana. The Motley Fool has positions in and recommends Bitcoin, Ethereum, SVB Financial, and Solana. The Motley Fool has a disclosure policy.\n\nThe Motley Fool is a USA TODAY content partner offering financial news, analysis and commentary designed to help people take control of their financial lives. Its content is produced independently of USA TODAY.\n\nOffer from the Motley Fool:10 stocks we like better than Bitcoin\n\nWhen our award-winning analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*\n\nThey just revealed what they believe are the ten best stocks for investors to buy right now... and Bitcoin wasn't one of them! That's right -- they think these 10 stocks are even better buys.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of March 8, 2023"
    }
]