[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbmdhcGUuY29tL3NvbC1wcmljZS1wcmVkaWN0aW9uLWJ1bGxzLXBvaXNlZC1mb3ItbmV3LXJhbGx5LXNvbGFuYS1zdHJlbmd0aGVucy10ZWNobmljYWwtb3V0bG9vay_SAW5odHRwczovL2NvaW5nYXBlLmNvbS9zb2wtcHJpY2UtcHJlZGljdGlvbi1idWxscy1wb2lzZWQtZm9yLW5ldy1yYWxseS1zb2xhbmEtc3RyZW5ndGhlbnMtdGVjaG5pY2FsLW91dGxvb2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "SOL Price Prediction: Bulls Poised For New Rally, Solana Strengthens Technical Outlook - CoinGape",
        "content": "Solana has set out into the new week with a vivid bullish outlook—1.6% in 24-hour gains to highs almost at $20. This competitive smart contracts token, like many of its peers, continues to deal with a rather dilapidated market structure, as losses accumulate to 14% in 30 days. SOL price closed the month of August noticeably lower than the monthly opening price of roughly $25.\n\nSOL Price On The Move To $30\n\nKey indicators, especially short-term reveal that the path with the least resistance has finally flipped to the upside. Solana has since the beginning of September sustained a bullish outlook, bolstered by support at $18.\n\nadvertisement\n\nHowever, the validity of the uptrend will depend on whether bulls can bring down the resistance at $20. Such a move would imply a stronger bullish grip reinforced by a buy signal from the Moving Average Convergence Divergence (MACD) indicator.\n\nIn that case, traders should be on the lookout for a bullish cross, with the blue MACD line flipping above the red signal line.\n\nThe Relative Strength Index (RSI), although not oversold in August is in the process of validating the ongoing rebound above $20.\n\nA break above $20 might not be enough to propel the Solana live price to $30, hence bulls must not rest until Solana holds above the next crucial hurdle at $23. If they manage to bring down this hurdle, traders can start booking profits at $25, $30, and later at $37.\n\nSOL Price Flaunts Falling Wedge Pattern\n\nA falling wedge pattern on the four-hour chart hints at a 12% breakout to $22.5, This pattern serves as hope that the downtrend is coming to an end and bulls are ready to take over. Two downward-slopping trendlines form this pattern, one connecting the series of lower highs and the other the lower lows.\n\nAs the trendlines converge, the trading volume drops. SOL price will mark the beginning of the uptrend by breaking above the resistance trendline before the lines converge. Buy orders are usually above the breakout point with the target representing the distance between the widest points of the pattern.\n\nThe MACD in the short-term chart already flipped bullish, calling on traders to fire up their buy orders. Notice the blue MACD line above the red signal line and the momentum indicator generally moving toward the mean line and the positive region.\n\nIf resistance at $20 holds in place, SOL price may remain vulnerable to seller influence. Support at $18 is expected to come in handy but there is the possibility of Solana sliding to $15 and testing post-FTX implosion support at $8.\n\nRelated Articles"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbmNoYXB0ZXIuY29tL3NvbGFuYS1kb2VzLWF3YXktd2l0aC1uZXR3b3JrLW91dGFnZS1yZWNvcmRzLTEwMC11cHRpbWUtc2luY2UtZmVicnVhcnkv0gFjaHR0cHM6Ly9jb2luY2hhcHRlci5jb20vc29sYW5hLWRvZXMtYXdheS13aXRoLW5ldHdvcmstb3V0YWdlLXJlY29yZHMtMTAwLXVwdGltZS1zaW5jZS1mZWJydWFyeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Solana Does Away With Network Outage: Records 100% Uptime Since February - CoinChapter",
        "content": "Key Takeaways:\n\nSolana Network has not experienced an outage since February.\n\nThe network was notorious for having embarrassing outages.\n\nSince then, Solana’s transactions per second have also increased.\n\nThe Solana has experienced a stable summer, with no network outages, according to the latest data.\n\nYEREVAN (CoinChapter.com) — In an impressive streak, the Solana Network (SOL) has not had an outage since February. For a network infested with service interruptions, maintaining 100% uptime for six months straight is monumental progress.\n\nThe network performance comes following a series of upgrades that the developers had focused on to stabilize the Solana ecosystem.\n\nOn Feb. 25, Solana (SOL) experienced a network outage lasting over 18 hours, temporarily halting user transactions. Solana engineers faced severe challenges in identifying the root cause of the issue.\n\nThe embarrassing incident drew criticism from rival blockchain communities, including Ethereum (ETH).\n\nSolana’s co-founder, Anatoly Yakovenko, committed significant resources to enhance the blockchain’s stability throughout the year. Six months since then, it seems he has delivered on the commitment.\n\nAccording to crypto investor Mike Dudas, who is also the co-founder of The Block, Solana has shown commitment to network improvement. As a result, traders have enjoyed a summer of prolonged stability.\n\nSolana Foundation seems to have solved its outage problem\n\nSolana network outages show the door\n\nIn its July report, the Solana Foundation highlighted the impact of various upgrades in enabling the network to handle increased traffic and demand efficiently. These upgrades include the implementation of QUIC TPU, Stake-weighted QoS, and localized free markets,\n\nBlock production time, which measures the speed at which the network adds new “blocks” to the blockchain, has maintained a consistent trajectory through this period.\n\nFurthermore, the average transactions per second on the Solana network have remained relatively stable since December 2022.\n\nAccording to the foundation, the maximum daily transactions per second have steadily increased since January. Data from Dune Analytics indicates a current figure of 4,127 TPS while writing.\n\nSolana Network’s transactions per second have also increased since February.\n\nDespite the improvements, the network’s native token, SOL, remains over 90% down from its all-time high of $260 nearly two years back. Year-to-date, the altcoin has lost about 40% in its price.\n\nAt the time of writing, SOL exchanges hands at $19.57, according to TradingView charts.\n\nMeanwhile, Solana’s emphasis on stability could signify a change in the mindset of the SOL community and investors."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vZGVjcnlwdC5jby8xNTQ4MzQvdml0YWxpay1idXRlcmluLXNlbGxzLW1rci10b2tlbnMtYXMtbWFrZXJkYW8tY28tZm91bmRlci1wdXNoZXMtZm9yLXNvbGFuYS1iYXNlZC1uZXdjaGFpbtIBeGh0dHBzOi8vZGVjcnlwdC5jby8xNTQ4MzQvdml0YWxpay1idXRlcmluLXNlbGxzLW1rci10b2tlbnMtYXMtbWFrZXJkYW8tY28tZm91bmRlci1wdXNoZXMtZm9yLXNvbGFuYS1iYXNlZC1uZXdjaGFpbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Sells MKR Tokens as MakerDAO Co-Founder Pushes for Solana-based ‘NewChain’ - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nWe do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum co-founder Vitalik Buterin has sold around $580,000 worth of MakerDAO’s MKR tokens, after the project’s co-founder Rune Christensen advocated launching the project’s new chain on a Solana-based platform.\n\nIn the Discord channel of rival stablecoin issuance platform Reflexer Finance, Buterin offered some suggestions on how to compete with and complement the leading platform in stablecoin issuance, “if MakerDAO is torpedoing itself in weird directions.”\n\nMakerDAO, the issuer of the stablecoin DAI, is currently pursuing an overhaul of its protocol dubbed “Endgame.” In recent days, Christensen has pushed for the launch of a native blockchain for Maker codenamed NewChain, based on Solana’s codebase.\n\nSolana co-founder Anatoly Yakovenko clarified that the proposed new Maker chain has “nothing to do with Solana’s mainnet” or the ongoing Ethereum versus Solana debate.\n\nAD\n\nAD\n\nThe last phase of Endgame is the launch of a native blockchain for Maker with the codename NewChain It will make the ecosystem more secure and efficient After some research, I believe the Solana codebase should be considered as the basis for NewChainhttps://t.co/KyGxBBGlVH — Rune (@RuneKek) September 1, 2023\n\nHowever, Buterin appears dissatisfied with the Maker co-founder’s decision, selling his MKR holdings from 2020 a day after Christensen sent his tweet.\n\nButerin sold 500 MKR for 353.4 ETH, equivalent to approximately $579,000, through CoW Protocol, according to Etherscan data.\n\nButerin’s advice to Reflexer\n\nThe Ethereum co-founder also paid a visit to the Discord channel of rival stablecoin platform Reflexer Finance, where he encouraged the community to expand their collateral options to liquidity staking derivatives on Ethereum.\n\nAD\n\nAD\n\nReflexer enables the minting of the RAI stablecoin using only Ethereum as collateral.\n\nRAI does not target any specific peg like the dollar pegged-DAI. Instead, its price is determined by the price of ETH and demand for RAI.\n\nLiquid staking derivatives (LSDs) are tokens that represent the amount of staked ETH in Ethereum’s proof-of-stake validating contract.\n\nButerin emphasized the importance of active community governance in adding support for “staked ETH.”\n\nImage: Discord\n\nHe added that the community must “ideally intentionally” begin with “only non-dominant forms of staked ETH (so, not Lido).”\n\nLido has raised some concerns due to its rising dominance, representing one-third of total staked ETH.\n\nImage: Discord\n\nThe Ethereum co-founder went on to recommend to the Reflexer community that “if MakerDAO is torpedoing itself in weird directions”, then Reflexer can improve by providing more collateral options like MakerDAO. Nevertheless, Buterin added that there’s value in maintaining some kind of norm where \"ETH is the collateral.”\n\nThe price of Reflexer Finance’s governance token Reflexer Ungovernance (FLX) surged almost 75% overnight after Vitalik’s endorsement to the community, per CoinGecko data.\n\nAD\n\nAD\n\nFollowing an overnight dip, MakerDAO’s MKR token is now trading flat on the day, at around $1,130."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vZGVjcnlwdC5jby8xNTQ4MzQvdml0YWxpay1idXRlcmluLXNlbGxzLW1rci10b2tlbnMtYXMtbWFrZXJkYW8tY28tZm91bmRlci1wdXNoZXMtZm9yLXNvbGFuYS1iYXNlZC1uZXdjaGFpbtIBeGh0dHBzOi8vZGVjcnlwdC5jby8xNTQ4MzQvdml0YWxpay1idXRlcmluLXNlbGxzLW1rci10b2tlbnMtYXMtbWFrZXJkYW8tY28tZm91bmRlci1wdXNoZXMtZm9yLXNvbGFuYS1iYXNlZC1uZXdjaGFpbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Vitalik Buterin Sells MKR Tokens as MakerDAO Co-Founder Pushes for Solana-based ‘NewChain’ - Decrypt",
        "content": "Create an account to save your articles.\n\nCreate an account to save your articles.\n\nWe do the research, you get the alpha! Get exclusive reports and access to key insights on airdrops, NFTs, and more! Subscribe now to Alpha Reports and up your game! Go to Alpha Reports\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEthereum co-founder Vitalik Buterin has sold around $580,000 worth of MakerDAO’s MKR tokens, after the project’s co-founder Rune Christensen advocated launching the project’s new chain on a Solana-based platform.\n\nIn the Discord channel of rival stablecoin issuance platform Reflexer Finance, Buterin offered some suggestions on how to compete with and complement the leading platform in stablecoin issuance, “if MakerDAO is torpedoing itself in weird directions.”\n\nMakerDAO, the issuer of the stablecoin DAI, is currently pursuing an overhaul of its protocol dubbed “Endgame.” In recent days, Christensen has pushed for the launch of a native blockchain for Maker codenamed NewChain, based on Solana’s codebase.\n\nSolana co-founder Anatoly Yakovenko clarified that the proposed new Maker chain has “nothing to do with Solana’s mainnet” or the ongoing Ethereum versus Solana debate.\n\nAD\n\nAD\n\nThe last phase of Endgame is the launch of a native blockchain for Maker with the codename NewChain It will make the ecosystem more secure and efficient After some research, I believe the Solana codebase should be considered as the basis for NewChainhttps://t.co/KyGxBBGlVH — Rune (@RuneKek) September 1, 2023\n\nHowever, Buterin appears dissatisfied with the Maker co-founder’s decision, selling his MKR holdings from 2020 a day after Christensen sent his tweet.\n\nButerin sold 500 MKR for 353.4 ETH, equivalent to approximately $579,000, through CoW Protocol, according to Etherscan data.\n\nButerin’s advice to Reflexer\n\nThe Ethereum co-founder also paid a visit to the Discord channel of rival stablecoin platform Reflexer Finance, where he encouraged the community to expand their collateral options to liquidity staking derivatives on Ethereum.\n\nAD\n\nAD\n\nReflexer enables the minting of the RAI stablecoin using only Ethereum as collateral.\n\nRAI does not target any specific peg like the dollar pegged-DAI. Instead, its price is determined by the price of ETH and demand for RAI.\n\nLiquid staking derivatives (LSDs) are tokens that represent the amount of staked ETH in Ethereum’s proof-of-stake validating contract.\n\nButerin emphasized the importance of active community governance in adding support for “staked ETH.”\n\nImage: Discord\n\nHe added that the community must “ideally intentionally” begin with “only non-dominant forms of staked ETH (so, not Lido).”\n\nLido has raised some concerns due to its rising dominance, representing one-third of total staked ETH.\n\nImage: Discord\n\nThe Ethereum co-founder went on to recommend to the Reflexer community that “if MakerDAO is torpedoing itself in weird directions”, then Reflexer can improve by providing more collateral options like MakerDAO. Nevertheless, Buterin added that there’s value in maintaining some kind of norm where \"ETH is the collateral.”\n\nThe price of Reflexer Finance’s governance token Reflexer Ungovernance (FLX) surged almost 75% overnight after Vitalik’s endorsement to the community, per CoinGecko data.\n\nAD\n\nAD\n\nFollowing an overnight dip, MakerDAO’s MKR token is now trading flat on the day, at around $1,130."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LnZlcmRpY3QuY28udWsvY29tbWVudC9ibG9ja2NoYWluLXBob25lcy1zb2xhbmEtc2FnYS12ZXJzdXMtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Two new blockchain phones aim to mobilize Web3 - Verdict",
        "content": "Plans for the Ethereum mobile OS and accompanying ethOS-based smartphone were both disclosed in a December 2021. Credit: DaLiu via Shutterstock.\n\nIn a tale of two fledgling blockchain phones, one, the Solana Saga, has slashed its selling price while the other, the Ethereum Phone, is preparing to begin shipping.\n\nBoth devices are generally aimed at fusing mobility with Web3, the third iteration of the internet that incorporates open-source software, blockchain transaction ledgers, decentralized governance, and native payments based on token-based economics.\n\nThe saga of the Saga\n\nSaga is a creation of Solana Labs, which created the Solana blockchain platform in 2020, and in June 2022 announced Solana Mobile as a subsidiary aimed at creating a Web3-focused smartphone, Saga, which debuted in the US market during April 2023.\n\nSaga is a flagship Android handset, created and built by development company OSOM, and is tightly integrated with the Solana blockchain in order to make cryptocurrency transactions and management of digital assets such as tokens and non-fungible tokens (NFTs) easily accessible via phone rather than computer, which is the more typical method. Saga represents an attempt to not only compete with established smartphone brands like Apple and Samsung but also to extend the influence of Solana, which competes with larger blockchains such as Ethereum. Both Solana and Ethereum also have their own cryptocurrencies – Solana (SOL) and ether (ETH), respectively.\n\nSolana Labs and its Solana blockchain platform are known primarily within the cryptocurrency community. Solana Mobile and the Saga phone have even less mass market name recognition. It seemed probable that Solana’s Saga would struggle to attract buyers, so it wasn’t a surprise that after launching at a cost of $1,000, Saga’s price was slashed to $599 in August 2023. Some Saga buyers who paid the original price only to see it slashed by 40% just four months after the phone’s debut have publicly expressed their displeasure, not exactly a good sign for a nascent product that needs to build goodwill.\n\nBlockchain and a Web3 ethOS\n\nSome observers attribute Saga’s price reduction to the impending arrival of new competition from a company based in Delaware (US), Freedom Factory. Like many blockchain and cryptocurrency projects, Freedom Factory is a community-led effort with global reach. Its small team developed both ethOS, a free, open-source native mobile operating (OS) system, and the new Ethereum Phone, also called ethOS.\n\nHow well do you really know your competitors? Access the most comprehensive Company Profiles on the market, powered by GlobalData. Save hours of research. Gain competitive edge. View profiles in store Company Profile – free sample Thank you! Your download email will arrive shortly Not ready to buy yet? Download a free sample We are confident about the unique quality of our Company Profiles. However, we want you to make the most beneficial decision for your business, so we offer a free sample that you can download by submitting the below form By GlobalData Submit Country * UK USA Afghanistan Åland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Democratic Republic of the Congo Cook Islands Costa Rica Côte d\"Ivoire Croatia Cuba Curaçao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati North Korea South Korea Kuwait Kyrgyzstan Lao Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macao Macedonia, The Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territory Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Réunion Romania Russian Federation Rwanda Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Pierre and Miquelon Saint Vincent and The Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and The South Sandwich Islands Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates US Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela Vietnam British Virgin Islands US Virgin Islands Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Kosovo Industry * Academia & Education Aerospace, Defense & Security Agriculture Asset Management Automotive Banking & Payments Chemicals Construction Consumer Foodservice Government, trade bodies and NGOs Health & Fitness Hospitals & Healthcare HR, Staffing & Recruitment Insurance Investment Banking Legal Services Management Consulting Marketing & Advertising Media & Publishing Medical Devices Mining Oil & Gas Packaging Pharmaceuticals Power & Utilities Private Equity Real Estate Retail Sport Technology Telecom Transportation & Logistics Travel, Tourism & Hospitality Venture Capital Tick here to opt out of curated industry news, reports, and event updates from Verdict. Submit and download Visit our Privacy Policy for more information about our services, how we may use, process and share your personal data, including information of your rights in respect of your personal data and how you can unsubscribe from future marketing communications. Our services are intended for corporate subscribers and you warrant that the email address submitted is your corporate email address.\n\nPlans for the Ethereum mobile OS and accompanying ethOS-based smartphone were both disclosed in a December 2021 manifesto posted on Discord, which contended that Google’s Android and Apple’s iOS cannot serve Web3 needs due to their centralized platforms. Its backers assert that ethOS, designed to be decentralized and permissionless like the Ethereum blockchain, will foster novel economics and experiences through new apps, tokens based on ERC20 (the technical standard for fungible tokens created using the Ethereum blockchain), and NFTs.\n\nPeople can already load ethOS onto select unlocked Google Pixel 3, 3XL, or 5a smartphones, but the Ethereum Phone is designed to provide a turnkey option for side-loading ethOS onto a device. The Ethereum Phone is actually a flashed version of Google’s Pixel 7a using GrapheneOS 13, which is an Android fork with hardened security.\n\nPreorders for the first 50 Ethereum Phones began on August 22, 2023, and sold out in 24 hours. Particular NFTs worth 0.39 Ethers (ETH), or nearly $650, had to be minted to qualify for a preorder, which means the phone was selling at a premium, given that a regular Google Pixel 7A retails for $499 in the US. After preorders begin shipping, regular orders are slated to open in fall 2023.\n\nLooking ahead with blockchain\n\nThe promise of blockchain phones to fuse mobility and Web3 is captivating. Though it’s unclear whether there will ever be a substantial market for these niche devices, their Web3-oriented features and functionalities could migrate to smartphones that are marketed to a broader swath of the mass market."
    }
]