[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHA6Ly93d3cuY2hpbmEub3JnLmNuL3Bob3Rvcy8yMDIzLTAyLzA5L2NvbnRlbnRfODUwOTgzMjkuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Beijing citizens enjoy Lantern Festival_china.org.cn - China.org",
        "content": "A variety of lanterns hanging at Solana Mall on the eve of Lantern Festival in Chaoyang district, Beijing, Feb. 4, 2023. [Photo by Yan Bin/China.org.cn]\n\nAs a traditional Chinese festival, Lantern Festival is celebrated on the 15th day of the first month of the lunar year, and marks the end of the Chinese New Year celebrations. On this day, people usually go out to admire lanterns and guess lantern riddles while enjoying the festive atmosphere of Lantern Festival."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvLWNvbW11bml0eS1zZXRzLXNvbGFuYS1wcmljZS1mb3ItZmVicnVhcnktMjgtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Crypto community sets Solana price for February 28, 2023 - Finbold - Finance in Bold",
        "content": "After starting the year on a positive note, the value of Solana (SOL) is exhibiting sideway trading pressure that has resulted in uncertainty regarding the asset’s next move. With Solana still looking for more positive fundamentals, interest remains on how the asset will likely trade in the days ahead.\n\nOn this note, the crypto community on CoinMarketCap, through the Price Estimate feature, is forecasting that SOL will likely trade at an average price of $22.94 on February 28, 2023, representing a minor increase of about 0.23% from the token’s price at the time of publishing, according to data obtained by Finbold on February 9.\n\nThe prediction by the community has emanated from votes from 1,312 members, slightly varies from the value set by the machine learning algorithm at PricePedictions. According to the tool, Solana will likely trade at $24.56 on the last day of February 2023.\n\nSolana community price prediction. Source: CoinMarketCap\n\nSolana community’s bullish outlook\n\nFrom the prediction, the Solana community is expressing bullishness, considering that the token slumped to below $10 in the wake of the FTX crypto exchange collapse. Notably, Solana had a strong relationship with FTX, and the collapse cast uncertainty on the blockchain’s sustainability.\n\nAlthough SOL has rallied in tandem with the general market, the asset needs strong fundamentals. In this case, contrary to the previous speculation, the network appears resilient.\n\nThis is after Solana’s founders Anatoly Yakovenko and Raj Gokal published a report on the ecosystem’s future that expressed optimism about at a time developers on the blockchain have increased 83% in a single year to over 20,000. The activity has enabled Solana to rank among projects with the highest development activities.\n\nAt the same time, the network is recording increased adoption activity, with a partnership with Brave Browser emerging as the latest. Under the partnership, Solana dApp is now supported by the browser, allowing users to connect to top Solana applications like Magic Eden and conduct decentralized finance (DeFi)-related transactions.\n\nSolana price analysis\n\nSolana is facing bearish pressure that threatens to invalidate the asset’s recent gains. The token is changing hands at $22.90 with daily losses of over 3%.\n\nSolana seven-day price chart. Source: Finbold\n\nElsewhere, the one-day technical analysis on TradingView is offering mixed signals. A summary of the gauges is for the neutral sentiment at 9, while moving averages are for ‘sell’ at 9. On the other hand, oscillators are also neutral at 8.\n\nSolana technical analysis. Source: TradingView\n\nOverall, bears seem to be dominating SOL’s price, and any selling pressure will see the asset possibly slip to the $20 support zone.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1iZWxvdy0yMzAwMC1zaGliYS1pbnUtZG9nZWNvaW4tc29sYW5hLXRhbmstdXAtdG8tOC0zNjk1OTgtMjAyMy0wMi0wOdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin below $23000; Shiba Inu, Dogecoin, & Solana tank up to 8% - Business Today",
        "content": "Crypto market was trading sharply lower on Thursday as the sentiments were jittered after US Federal Reserve's official hinted that there is no respite in aggressive rate hikes. The central bank would remain vigilant about stamping out high inflation, reiterating its hawkish tone.\n\nAfter only a single day, Bitcoin slipped below $23,000-mark during the early Asian markets as the numero-uno crypto token plunged 3 per cent. Ethereum, the second largest crypto asset tanked 3 per cent but held above $1,600-levels. However, the pain in altcoins was more severe.\n\nBarring the US dollar pegged stablecoins, all the top crypto tokens were trading sharply lower on Thursday. Shiba Inu tanked more than 8 per cent, whereas Avalanche was down 7 per cent. Dogecoin and Solana were down 6 per cent each, while Polkadot and Litecoin tumbled 5 per cent.\n\nThe global cryptocurrency market cap was trading lower at $1.05 trillion mark, dropping more than 3 per cent in the last 24 hours. Similarly, the total trading volumes declined almost 4 per cent close to $59.49 billion.\n\nBitcoin continues ranging at $22,700-23,400 and Ethereum at $1600-$1680. With the ranging markets, there are many growth metrics that point that new users or dormant users are returning back to the space, said CoinDCX Research Team.\n\n\"There has been a certain increase in the interest of Decentralized Protocols, with Total Value Locked across different staking protocols hitting $74.6 Billion, increasing by 26 per cent from December 2022, it said.\"\n\nCrypto updates\n\nLeading MakerDAO community participants have proposed creating a liquidity market called Spark Protocol for lending and borrowing crypto assets focused on DAI, Maker’s $5 billion stablecoin, according to a proposal posted on Wednesday in Maker’s governance forum.\n\nRobinhood Market’s board of directors authorized the company to pursue purchasing most or all of the 55 million shares that Emergent Fidelity Technologies bought in May 2022, Robinhood said in its fourth-quarter earnings report.\n\nTech View By WazirX Trade Desk\n\nChromia (CHR) is an open-source public blockchain conceived of by Swedish company Chromaway AB. The Chroma token (CHR) was launched in May of 2019. The technology behind the Chromia blockchain is adapted from an earlier technology called ‘Postchain’, a solution provided by Chromaway AB for enterprise clients. Chromia is a microcap crypto project trading at 177th rank with $153 million Market Cap as per coinmarketcap website.\n\nThe CHR coin gained more than 30 per cent in the last 7 days compared to Bitcoin, which is up around 1 per cent in the same period. As per the chart OP has broken out of a descending trendline on a weekly timeframe. It is also trading above the 21-week moving average which is a positive sign, it is showing good strength compared to the rest of the crypto market from last 7 days.\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\n\n\nAlso read: Adani Wilmar, Tata Power, Hindalco: What should be your strategy amid market volatility\n\nAlso read: Q3 results previews: LIC, Zomato, Hindalco and IRCTC"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1iZWxvdy0yMzAwMC1zaGliYS1pbnUtZG9nZWNvaW4tc29sYW5hLXRhbmstdXAtdG8tOC0zNjk1OTgtMjAyMy0wMi0wOdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin below $23000; Shiba Inu, Dogecoin, & Solana tank up to 8% - Business Today",
        "content": "Crypto market was trading sharply lower on Thursday as the sentiments were jittered after US Federal Reserve's official hinted that there is no respite in aggressive rate hikes. The central bank would remain vigilant about stamping out high inflation, reiterating its hawkish tone.\n\nAfter only a single day, Bitcoin slipped below $23,000-mark during the early Asian markets as the numero-uno crypto token plunged 3 per cent. Ethereum, the second largest crypto asset tanked 3 per cent but held above $1,600-levels. However, the pain in altcoins was more severe.\n\nBarring the US dollar pegged stablecoins, all the top crypto tokens were trading sharply lower on Thursday. Shiba Inu tanked more than 8 per cent, whereas Avalanche was down 7 per cent. Dogecoin and Solana were down 6 per cent each, while Polkadot and Litecoin tumbled 5 per cent.\n\nThe global cryptocurrency market cap was trading lower at $1.05 trillion mark, dropping more than 3 per cent in the last 24 hours. Similarly, the total trading volumes declined almost 4 per cent close to $59.49 billion.\n\nBitcoin continues ranging at $22,700-23,400 and Ethereum at $1600-$1680. With the ranging markets, there are many growth metrics that point that new users or dormant users are returning back to the space, said CoinDCX Research Team.\n\n\"There has been a certain increase in the interest of Decentralized Protocols, with Total Value Locked across different staking protocols hitting $74.6 Billion, increasing by 26 per cent from December 2022, it said.\"\n\nCrypto updates\n\nLeading MakerDAO community participants have proposed creating a liquidity market called Spark Protocol for lending and borrowing crypto assets focused on DAI, Maker’s $5 billion stablecoin, according to a proposal posted on Wednesday in Maker’s governance forum.\n\nRobinhood Market’s board of directors authorized the company to pursue purchasing most or all of the 55 million shares that Emergent Fidelity Technologies bought in May 2022, Robinhood said in its fourth-quarter earnings report.\n\nTech View By WazirX Trade Desk\n\nChromia (CHR) is an open-source public blockchain conceived of by Swedish company Chromaway AB. The Chroma token (CHR) was launched in May of 2019. The technology behind the Chromia blockchain is adapted from an earlier technology called ‘Postchain’, a solution provided by Chromaway AB for enterprise clients. Chromia is a microcap crypto project trading at 177th rank with $153 million Market Cap as per coinmarketcap website.\n\nThe CHR coin gained more than 30 per cent in the last 7 days compared to Bitcoin, which is up around 1 per cent in the same period. As per the chart OP has broken out of a descending trendline on a weekly timeframe. It is also trading above the 21-week moving average which is a positive sign, it is showing good strength compared to the rest of the crypto market from last 7 days.\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\n\n\nAlso read: Adani Wilmar, Tata Power, Hindalco: What should be your strategy amid market volatility\n\nAlso read: Q3 results previews: LIC, Zomato, Hindalco and IRCTC"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3doYXRpcy9mZWF0dXJlL1RoZS1iZXN0LWNyb3NzLWNoYWluLWJyaWRnZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "6 best cross-chain bridges in 2023 - TechTarget",
        "content": "As the demand for different blockchain-based Web 3.0 technologies continues to grow, so too does the need to enable interoperability. This is something that is enabled with cross-chain bridge services.\n\nBlockchain is a distributed ledger technology that uses cryptography to provide assurance and integrity to data and transactions. Blockchain networks enable many types of services, including secured databases, immutable ledgers, decentralized applications (dApps), decentralized finance (DeFi), non-fungible tokens (NFTs) and cryptocurrencies.\n\nThere are many blockchain networks and cryptocurrencies that use different blockchain technologies, including Bitcoin, Ethereum, Avalanche, Polygon, Solana and Arbitrum. Enabling interoperability and exchange across different blockchain networks is an area where cross-chain bridges -- sometimes also referred to as blockchain bridges -- play an increasingly important role.\n\nWhat is a cross-chain bridge? A cross-chain bridge enables an exchange of information, cryptocurrency or NFTs from one blockchain network to another. It enables the flow of data and tokens across what would otherwise be siloed sets of data on different blockchains. With fiat currency there are many established ways for individuals and businesses to exchange money, creating a globally available and interoperable system of financial payments. Those systems include financial institutions, banks and credit cards that handle foreign exchange. In the world of blockchains, a cross-chain bridge serves an analogous purpose. Exchange across different blockchains for cryptocurrency is possible without a cross-chain bridge, but it is expensive and more time-consuming. Without the use of a cross-chain bridge, users must first convert a cryptocurrency token into a fiat currency, which often involves fees. They then use currency to get the other desired type of cryptocurrency, incurring more fees and taking time. One characteristic of a cross-chain bridge is that it enables users to exchange one cryptocurrency for another without first changing it to fiat currency. Cross-chain bridges aren't limited to just cryptocurrency value transfer either. An effective cross-chain bridge can also enable the transfer of smart contracts and NFTs from one blockchain environment to another. There are several approaches to enabling transfers with a cross-chain bridge. One common approach is using a wrapped token issued by the cross-chain bridge provider platform. With a wrapped token, the value of one token from a specific blockchain network can be encapsulated inside another token. Wrapped tokens are typically based on the ERC-20 technical specification for an Ethereum network. For example, WBTC is a Bitcoin token wrapped with an ERC-20 Ethereum smart contract. Another approach to enabling cross-chain bridge transfers is by using a liquidity pool. With a liquidity pool, a cross-chain bridge provider holds inventory -- or pools -- of various coins where one can be exchanged for another. Cross-chain bridges can also be a lucrative target for hackers. One of the largest attacks occurred in February 2022, when cross-chain bridge platform Wormhole was the victim of an attack in which the threat actor stole 120,000 wrapped Ethereum tokens -- worth an estimated $320 million at the time of the theft. BNB Chain, also known as Binance Smart Chain, was the victim of an attack in October 2022 that resulted in losses estimated at $570 million. Blockchain bridge analysis vendor Chainalyis has estimated that 69% of cryptocurrency funds stolen in 2022 have been attributed to attacks on cross-chain bridges. Learn more about how cryptocurrency cyber attacks are on the rise."
    }
]