[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL3d3dy5zdGF0ZXNtYW4uY29tL3N0b3J5L25ld3MvbG9jYWwvMjAyMy8wNC8xNC93aWxsaWFtc29uLWJlbGwtY291bnR5LW11ZC1wcm9wb3NlZC1yZXNpZGVudGlhbC1kZXZlbG9wbWVudC1ob21lcy1zb2xhbmEtbXVuaWNpcGFsLXV0aWxpdHktZGlzdHJpY3QvNzAxMDgzMTkwMDcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Proposed community in Williamson, Bell counties will have 14,000 homes - Austin American-Statesman",
        "content": "No commitment required. Cancel anytime.\n\n*Offer available to new customers only. All savings based off the regular rate.\n\nRead the full Subscription Terms and Conditions."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmJsb2NrY2hhaW5nYW1lci5iaXovbmV3cy8yMzcyNC9zb2xhbmFzLXNhZ2EtcGhvbmUtbGl2ZS_SAUdodHRwczovL3d3dy5ibG9ja2NoYWluZ2FtZXIuYml6L2FtcC9uZXdzLzIzNzI0L3NvbGFuYXMtc2FnYS1waG9uZS1saXZlLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Solana's Saga phone is live - Blockchain Gamer",
        "content": "Solana’s long awaited $1,000 web3 phone, Saga, is now reality and is now being rolled out to those who pre-ordered, with shipping set to start on Wednesday 20th April.\n\nCo-founder and CEO of Solana, Anatoly Yakavenko, started off the Saga launch event stating that he couldn’t see a future that wasn’t mobile. Hence Solana’s efforts to break new ground and make a smartphone adapted for our age, where web3 services are more accessible for users.\n\nBuilt on top of a highend OV1 Android device from US OEM OSOM, the Saga device is natively web3 as it runs full-stack Solana software – labelled Solana Mobile Stack. In terms of hardware, it has the Seed Vault, which securely holds the private key for a Solana wallet in its own trusted execution environment in such a way that no apps or even the Android OS can access it.\n\nSaga owners will get some special rewards to get them started including 0.01 SOL for gas and $20 in USDC as part of Solana Mobile’s welcome pack.\n\nAlso exciting is the limited-release collection of Saga genesis NFTs, which will enable future Solana-based projects to identify early adopters and decide how they want to access and reward them.\n\nIn the meantime, there are assets from titles such as Genopets and Honeyland as well as exclusive music from Audius. Added to that is $25 in USDC from Magic Eden, and US users will get access to web3 mobile network Helium.\n\nMore importantly, there is the embedded app store, enabling developers to create fully-native blockchain games and DeFi products, without having to deal with issues like platform holder T&Cs. Users will be able to sign transactions in the apps simply, using biometrics, as well as securely, because all transactions are signed in the Seed Vault.\n\nNew orders will be open from 8th May. To find out more, visit the Saga phone website."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vc3BlY3RydW1uZXdzMS5jb20vY2EvbGEtd2VzdC9idXNpbmVzcy8yMDIzLzA0LzE0L2Fub3RoZXItbmV3LWx1eHVyeS1hcGFydG1lbnQtaXMtY29taW5nLXRvLWR1YXJ0ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Another new luxury apartment is coming to Duarte - Spectrum News 1",
        "content": "DUARTE, Calif. — Duarte’s new luxury apartment has broken ground as the city pushes for transit-oriented developments around the City of Hope Metro L station.\n\nWhat You Need To Know R.D. Olson and MBK broke ground on a new luxury apartment in Duarte\n\n\n\nSolana at Duarte is a 292-unit five story luxury apartment on 3.4 acres near the Metro Gold Line and City of Hope\n\n\n\nThe development is part of the city's Duarte Station Specific Plan\n\n\n\nThe plan allows for the adaptive reuse of existing buildings and other residential uses and focuses on open space and promenade-style plazas\n\nIrvine-based construction and developers R.D. Olson and MBK recently began construction on Solana at Duarte, a 292-unit five-story luxury apartment on 3.43 acres on Fasana Road near the city’s Metro Gold line station and the City of Hope Hospital campus.\n\nR.D. Olson officials said the units, ranging in size from studio to four-bedroom apartments, will wrap around an eight-story concrete parking structure.\n\nR.D. officials told Spectrum News the project expects to be complete by May 2025.\n\n“The city of Duarte is an up-and-coming area and perfectly situated for these new homes,” R.D. Olson President Bill Wilhelm said. “Our experience working in Duarte was amazing. The mayor, city planners, and building department were supportive and made the work seamless.”\n\nThe apartment project comes as Duarte pushed forward with its Duarte Station Specific Plan and cities statewide build more housing around public transit lines to meet housing needs and green initiatives.\n\nLos Angeles passed Measure JJJ in 2016, creating a framework to incentivize developers that build affordable housing around a public transit line.\n\nInitially adopted in 2013 and amended in 2019, Duarte city officials said their plan allows for the adaptive reuse of existing buildings and other residential uses and focuses on open space and promenade-style plazas.\n\n“The vision for the Duarte Station Area is to create a vibrant, mixed-use transit village with residential uses, office space, hospitality, and urban green space,” city staff said in the report.\n\nThe project is situated about 20 miles from downtown Los Angeles and is easily accessible via the nearby Metro Gold Line or 210 freeway.\n\nSolana is the second transit development for R.D. Olson and MBK in Duarte.\n\nThe duo recently completed Esperanza, a 344-unit luxury apartment, in December.\n\nSolana, R.D. Olson officials said would feature units with dual masters and kitchenettes on the second floor, an indoor pet spa, co-working and private offices and conference rooms, a cafe, fitness center, clubroom, pool, ping pong tables and three-outdoor courtyards."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvc29sYW5hcy1zYWdhLXBob25lLWZlYXR1cmVzLXNwZWNpZmljYXRpb25zLXByaWNlLW1vcmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Solana's SAGA Phone: Features, Specifications, Price & More - Watcher Guru",
        "content": "The cryptocurrency industry has been proving to be much more than just trading. The Solana [SOL] network was seen expanding itself by rolling out a Web3-focused smartphone. Anatoly Yakovenko, co-founder and CEO of Solana, announced the release of Saga, an Android smartphone about ten months ago. Now, the phone is finally making a debut on May 8, in the US, EU, UK, Canada, Switzerland, Australia, and New Zealand.\n\nDiving into the basics\n\nThe $1,000 smartphone is built on hardware from the Bay Area tech firm OSOM. The device comes in a black box with a USB-C charging connection. Alongside, a physical seed phrase paper card is also provided to allow users to record recovery phrases of their respective cryptocurrency wallet.\n\nThe Saga phone boasts a 6.67-inch OLED display, a fingerprint scanner, two interchangeable rear camera lenses, and 512 GB of storage. The phone entails a 4011mAh battery. The device is equipped with a Snapdragon 8+ Gen mobile platform, which combines an “integrated secure element,” also known as OSOM’s Seed Vault. This provides the user the speed to do a number of activities.\n\nThe most recent version of Android will be preinstalled when it is shipped. Pre-ordered gadgets are currently shipping. Furthermore, the setup process is quite similar to any other Andriod phone which involves setting up an account with an internet connection.\n\nHere’s what makes Solana’s Saga unique\n\nThe Saga contains web3 capabilities, unlike ordinary Andriod smartphones. It has a “Solana dApp Store,” which allows users to download web3 platform apps. The store, however, has a limited number of applications.\n\nCurrently, it entails four wallets namely, Phantom, Solflare, Ledger, and Sqauds. This is followed by three DeFi applications Marinade.finance, Jupiter, and Mango along with three NFT apps: Nokiamon, Minty Fresh, and TIEXO. Social apps like Dialect, Audius Music, and urFeed are also on the phone. A dApp “workspace” is part of the device.\n\nThe Seed Vault, an integrated feature of the phone, is another component of the system that focuses on Web3 and crypto. Users have the option of establishing a new seed phrase or even importing one from another cryptocurrency wallet.\n\nSaga device users to get rewards\n\nSaga owners get incentives from the dApp Store. This includes an airdropped Saga genesis token. It should be noted that this is an NFT that grants users access to rewards provided by dApps. The coin is not transferable nor burnable, thus users should make sure it is not linked to a temporary wallet.\n\nIn addition to this, owners of Saga receive 0.01 SOL, or 0.0026 of a dollar, and $20 worth of USDC as part of the dApp store welcome package. Interested users can preorder the device with a deposit of $100. According to Solana, the goal of Saga was to provide consumers with access to crypto platforms and services via phones rather than the more conventional method, which is through computers. Therefore, this launch is deemed to be revolutionary to the industry."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vbGlsaXB1dGluZy5jb20veW91LWNhbi1ub3ctcHJlLW9yZGVyLXRoZS1zb2xhbmEtc2FnYS1jcnlwdG8tcGhvbmUtZm9yLTEwMDAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Solana Saga crypto phone for $1000 (if you want a crypto phone from the makers of the Essential PH-1) - Liliputing",
        "content": "The Solana Saga, the smartphone created by former Essential employees, went up for pre-order last year for a deposit of $100 toward the full $1,000 price tag.\n\nNow customers who paid that deposit can actually buy the phone, and folks who didn’t get in on the early action can join a waitlist… if that’s something you actually want to do. Because while the phone has an interesting pedigree, it’s also a niche device aimed at cryptocurrency enthusiasts. In fact, you need to use cryptocurrency to buy it.\n\nFor those who aren’t familiar, the Saga began taking shape as the OSOM OV1. Originally the plan was to deliver a device that was a spiritual successor to the Essential PH-1. The privacy-focused OV1 was teased with a stainless steel frame, titanium buttons and a zirconia ceramic back last March.\n\nFast forward to June and OSOM announced that its plans had changed. The Saga would now be developed in partnership with Solana, the company behind the SOL cryptocurrency, and blockchain and web3 would be central to its design. A quick visit to Solana’s hardware page makes it abundantly clear that the Solana ecosystem is the main selling point.\n\nThat said, the Saga is a good-looking phone built around some pretty solid hardware. It starts with Qualcomm’s powerful Snapdragon 8+ Gen 1 platform, 12GB of LPDDR5 RAM and a generous 512GB of storage. The 120Hz 1080p AMOLED display measures 6.67 inches and is covered with a layer of ultra-tough Gorilla Glass Victus. The back of the Saga is clad with a zirconia ceramic and its stainless steel frame is accented by flashy titanium buttons.\n\nSituated on the back of the phone are a pair of Sony Cameras: an f/1.8 wide angle with a 50MP sensor and an f/2.2 ultra-wide with a 12MP sensor. Decrypt’s Andrew Hayward notes that the shots they produce are decent, though not on par with the similarly-priced iPhone 14 Pro Max. There’s also a 16MP front-facing camera.\n\nThe Saga is powered by a 4110 mAh battery which can be recharged via USB-C or a Qi-compatible wireless charger. Solana also includes a charging cable with a data privacy switch so that you can (if you absolutely have to) utilize an unfamiliar charger without putting your Saga at risk.\n\nInterestingly, the developers confirmed in an AMA that all the Solana experience is optional and can be disabled. Do that, and you’re left with a device that would feel a lot like a sequel to the PH-1… though purchasing a different phone might make more sense, especially for $1,000.\n\nSupport Liliputing Liliputing's primary sources of revenue are advertising and affiliate links (if you click the \"Shop\" button at the top of the page and buy something on Amazon, for example, we'll get a small commission). But there are several ways you can support the site directly even if you're using an ad blocker* and hate online shopping. Contribute to our Patreon campaign or... Contribute via PayPal * If you are using an ad blocker like uBlock Origin and seeing a pop-up message at the bottom of the screen, we have a * If you are using an ad blocker like uBlock Origin and seeing a pop-up message at the bottom of the screen, we have a guide that may help you disable it."
    }
]