[
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yNC8wMS8zNjc0NDc5Mi9kb2dlY29pbi1tYWludGFpbnMtc3Ryb25nLW5ldHdvcmstZG9taW5hbmNlLW92ZXItbWVtZWNvaW4tcml2YWxzLXRyYWRlci1mb3Jlc2Vlcy1hYnVuZGFuY2XSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzY3NDQ3OTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Dogecoin And Shiba Inu Outperform Solana-Based Rivals Dogwifhat, Myro: Trader Foresees 'Abundance Of Weal - Benzinga",
        "content": "Dogwifhat and Myro, two dog-themed memecoins on Solana SOL/USD are down 50% and 30% respectively from their highs set in the last week. This marks a significant underperformance compared to more established meme coins like Dogecoin DOGE/USD and Shiba Inu SHIB/USD.\n\nWhat Happened: Shiba Inu and Dogecoin notably outperformed their Solana-based rivals, with only modest losses of 9.6% and 5.4% respectively over the last week.\n\nDogwifhat and Myro have been show-stoppers on Solana in the past two months: Dogwifhat ran to over $400 million in market capitalization in less than three months, while Myro was tipped to be \"the $SHIB of this bull run.\"\n\nThis led to Binance listing $WIF for trading, while Myro was listed on Poloniex, another cryptocurrency exchange.\n\nHowever, the party for the newcomers may be over, following the latest downslide in cryptocurrency prices.\n\nRead Also: Shiba Inu Whale Transactions Volumes Surge 551%, SHIB Community Expects 'One Zero' Erased Soo\n\nWhy It Matters: Cryptocurrency observers on social media picked up on the shift in tone.\n\nTOPDOGE, digital marketing ninja, tweeted that, “Dogecoin will generate an abundance of wealth for those that maintain patience. Be uncomfortable for the next one to three years to be comfortable the rest of your life.”\n\nMeanwhile, IBC Group Official indicates that Shibarium, the Shiba Inu-based blockchain, hit 300 million transactions. It said: “Despite a general cryptocurrency downturn, Shiba Inu's layer-2 network sees a surge in activity with 1.3M + wallets and 2.8M blocks.”\n\nAn X user, Shib Spain said, “ShibaInu is more than just a coin. It's a Revolution!” The network activity backs up this sentiment.\n\nDespite mediocre price performance, IntoTheBlock data indicates Dogecoin’s significant lead in network transactions over peers such as Shiba Inu and Floki, a dominance that becomes even more pronounced against memecoins like PEPE and LADYS.\n\nThe indicator reflects high level of activity, adoption and its potential use cases as a payment system and a tipping currency.\n\nAmid sliding prices, Whale Alert data over the past 24 hours showed around 4.3 trillion SHIB, worth $37.9 million, being transferred from one unknown wallet to another.\n\nIn another positive development, Shiba Inu’s social media marketing lead, Lucie, revealed the name of the whale who burned 100 million SHIB over the past 24 hours. The whale is the issuer of the Shib Dream NFT collection.\n\nRead Next: Dogecoin's Weekend Rally Hits A Pause — Traders Betting On DOGE Longs Face Liquidation Worth $2.5M In A Single Day, Price Drops 4%\n\nPhoto: Shutterstock"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yNC8wMS8zNjc0NDc5Mi9kb2dlY29pbi1tYWludGFpbnMtc3Ryb25nLW5ldHdvcmstZG9taW5hbmNlLW92ZXItbWVtZWNvaW4tcml2YWxzLXRyYWRlci1mb3Jlc2Vlcy1hYnVuZGFuY2XSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzY3NDQ3OTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Dogecoin And Shiba Inu Outperform Solana-Based Rivals Dogwifhat, Myro: Trader Foresees 'Abundance Of Weal - Benzinga",
        "content": "Dogwifhat and Myro, two dog-themed memecoins on Solana SOL/USD are down 50% and 30% respectively from their highs set in the last week. This marks a significant underperformance compared to more established meme coins like Dogecoin DOGE/USD and Shiba Inu SHIB/USD.\n\nWhat Happened: Shiba Inu and Dogecoin notably outperformed their Solana-based rivals, with only modest losses of 9.6% and 5.4% respectively over the last week.\n\nDogwifhat and Myro have been show-stoppers on Solana in the past two months: Dogwifhat ran to over $400 million in market capitalization in less than three months, while Myro was tipped to be \"the $SHIB of this bull run.\"\n\nThis led to Binance listing $WIF for trading, while Myro was listed on Poloniex, another cryptocurrency exchange.\n\nHowever, the party for the newcomers may be over, following the latest downslide in cryptocurrency prices.\n\nRead Also: Shiba Inu Whale Transactions Volumes Surge 551%, SHIB Community Expects 'One Zero' Erased Soo\n\nWhy It Matters: Cryptocurrency observers on social media picked up on the shift in tone.\n\nTOPDOGE, digital marketing ninja, tweeted that, “Dogecoin will generate an abundance of wealth for those that maintain patience. Be uncomfortable for the next one to three years to be comfortable the rest of your life.”\n\nMeanwhile, IBC Group Official indicates that Shibarium, the Shiba Inu-based blockchain, hit 300 million transactions. It said: “Despite a general cryptocurrency downturn, Shiba Inu's layer-2 network sees a surge in activity with 1.3M + wallets and 2.8M blocks.”\n\nAn X user, Shib Spain said, “ShibaInu is more than just a coin. It's a Revolution!” The network activity backs up this sentiment.\n\nDespite mediocre price performance, IntoTheBlock data indicates Dogecoin’s significant lead in network transactions over peers such as Shiba Inu and Floki, a dominance that becomes even more pronounced against memecoins like PEPE and LADYS.\n\nThe indicator reflects high level of activity, adoption and its potential use cases as a payment system and a tipping currency.\n\nAmid sliding prices, Whale Alert data over the past 24 hours showed around 4.3 trillion SHIB, worth $37.9 million, being transferred from one unknown wallet to another.\n\nIn another positive development, Shiba Inu’s social media marketing lead, Lucie, revealed the name of the whale who burned 100 million SHIB over the past 24 hours. The whale is the issuer of the Shib Dream NFT collection.\n\nRead Next: Dogecoin's Weekend Rally Hits A Pause — Traders Betting On DOGE Longs Face Liquidation Worth $2.5M In A Single Day, Price Drops 4%\n\nPhoto: Shutterstock"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL2dtby16Y29tLXRydXN0LWNvbXBhbnktYW5ub3VuY2VzLXRoZS1sYXVuY2gtb2Ytc3RhYmxlY29pbnMtZ3llbi1hbmQtenVzZC1vbi10aGUtc29sYW5hLW5ldHdvcmstMzAyMDQxMzQ2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "GMO-Z.com Trust Company Announces the Launch of Stablecoins GYEN and ZUSD on the Solana Network - PR Newswire",
        "content": "The world's first regulated Japanese yen stablecoin, GYEN, and the trusted U.S. dollar stablecoin, ZUSD, are now available on Solana.\n\nNEW YORK, Jan. 23, 2024 /PRNewswire/ -- GMO-Z.com Trust Company, Inc. (\"GMO Trust\") today launched GYEN, the first regulated Japanese yen (\"JPY\") stablecoin, and ZUSD, the trusted U.S. dollar (\"USD\") stablecoin, on the Solana network. This integration on the Solana network enables individuals and institutions to conduct seamless and secure transactions within the industry-leading Solana ecosystem.\n\nLeveraging Solana's advanced blockchain technology, Solana GYEN and Solana ZUSD are transacted in a lightning-fast execution process while ensuring unparalleled stability and reliability, fulfilling a streamlined fiat-to-crypto gateway experience and bridging the Japanese yen and U.S. dollars with the digital asset field. This launch on Solana also paves the way for users to easily explore its expansive and diverse ecosystem, ranging from payment solutions to creative artistic support, GameFi, and Web3 mobile applications.\n\nGMO-Z.com Trust Company Announces the Launch of Stablecoins GYEN and ZUSD on the Solana Network Post this\n\nGMO Trust plans to provide Solana GYEN and Solana ZUSD on its official website for trading starting February 14.\n\nQuotes:\n\nKen Nakamura, CEO of GMO-Z.com Trust Company, Inc., said: \"The announcement of the first JPY stablecoin and a new USD stablecoin in the Solana ecosystem marks an important milestone in our multi-chain development, and we are very pleased to unveil this long-awaited Solana integration to our users. We look forward to integrating GYEN and ZUSD with the numerous projects in the Solana ecosystem.\"\n\nRaj Gokal, Co-Founder of Solana, said: \"GMO Trust's issuance of stablecoins on the Solana blockchain highlights how Solana's high-performance network and low transaction fees enable companies to launch regulated financial products in a scalable manner.\"\n\nPlease note that GYEN and ZUSD will not be offered to Japanese residents due to regulatory restrictions until further notice.\n\nAbout GMO Internet Group\n\nGMO Internet Group, based in Tokyo, has been a global market leader in the Internet infrastructure, Internet finance, and the digital asset space since its inception in 1991. It operates the world's largest online FX trading platform, an Internet bank, a cryptocurrency exchange, a cryptocurrency mining operation, a payment gateway, and regulated stablecoins. GMO Internet Group, Inc. (TSE: 9449) is headquartered in Tokyo, Japan. For more information, please visit https://www.gmo.jp/en/ .\n\nAbout GMO-Z.com Trust Company\n\nGMO-Z.com Trust Company, based in New York, is a Limited-Purpose Trust Company, regulated by the New York Department of Financial Services. Issuing the world's first regulated JPY stablecoin, \"GYEN,\" GMO-Z.com Trust also offers a USD stablecoin, \"ZUSD.\" GMO-Z.com Trust is on a mission to bring traditional finance into the digital age with blockchain services. For more information on GMO-Z.com Trust Company, Inc., visit https://stablecoin.z.com .\n\nCopyright (C) 2024 GMO-Z.com Trust Company, Inc. All Rights Reserved.\n\nSOURCE GMO-Z.com Trust Company, Inc."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvc25hcHNob3QvcGFudGVyYS1jYXBpdGFsLXBhaW50cy1yb3N5LXBpY3R1cmUtZm9yLWNyeXB0by1pbi0yMDI0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Hedge fund Pantera says Solana's surge shows why this crypto rally will be different - DLNews",
        "content": "Pantera Capital says Bitcoin ETFs won't be the only headline for crypto this year.\n\nBitcoin's DeFi ecosystem, the halving, and tokenisation will all take center stage in 2024.\n\nAnalysts at US crypto hedge fund Pantera Capital wrote in a recent report that the crypto rally was unlikely to be over despite bearish performances across the industry.\n\nLet’s dig into it.\n\nCooling off\n\nThe crypto market has cooled since BlackRock and others launched spot Bitcoin exchange-traded funds earlier this month, ushering in a new era for the industry.\n\nBitcoin has slumped 20%, falling from $49,000 to below $39,000, while Ethereum is down 16%. Solana, which outperformed on the way up, is now 30% cheaper than its January top.\n\nVarious crypto stocks — Coinbase, Marathon Digital, MicroStrategy — have also taken a beating.\n\nDespite the headwinds, crypto is emerging from the 2022 crash with a much stronger foundation than previous bear markets, said Pantera Capital’s managing partner Paul Veradittakit in the report from January 16.\n\nHis main argument?\n\nLeading crypto projects today aren’t fuelled by pure speculation — unlike in 2017.\n\nJoin the community to get our latest stories and updates\n\nParty like it’s 2021, not 2017\n\n“In hindsight, one can say that was speculative froth and hype on unproductive tokens,” Veradittakit said. “What’s been interesting about this rally is how little change there has been.”\n\nHe added that while the 2022 downturn was just as harsh on crypto prices as prior bear markets, it wasn’t due to crypto facing an existential crisis.\n\nInstead, prices crashed because of leverage and bad actors, Veradittakit said.\n\n“That’s why it is not surprising that we see the same projects coming back,” he said. “They were not down because they were not good projects, they were down in sympathy with the overall market.”\n\n“Solana is a particularly good example,” Veradittakit added, referring to the coin once backed by FTX co-founder Sam Bankman-Fried, who was convicted of seven counts of fraud last year.\n\nSolana has experienced a 975% surge since it bottomed in December 2022.\n\nBitcoin on DeFi rails\n\nBitcoin ETFs aren’t the only headlines the largest cryptocurrency will make this year, Veradittakit said.\n\nThe fourth halving, which will see the network halve how much Bitcoin miners earn to maintain the blockchain, is currently expected in April 2024, he noted.\n\nHalvings have historically preceded hefty rallies for the market’s largest cryptocurrency.\n\nThey can also be trying times for inefficient mining outfits: With fewer rewards doled out for their work, revenues can take a beating.\n\nVeradittakit also wrote about a rise in Bitcoin’s newly revived programmability, which could lead to an explosion of DeFi activity on the network.\n\n“There is clearly an enormous demand for Bitcoin in DeFi,” Veradittakit said, citing the $6 billion in wrapped Bitcoin tokens used on other blockchains like Ethereum.\n\nEthereum had $32 billion in total value locked across its DeFi ecosystem — about 11% of the network’s $280 billion market capitalisation.\n\nBitcoin’s DeFi play could catch up, he said.\n\n“As Bitcoin DeFi infrastructure matures, we could potentially see Bitcoin [DeFi] rise from the current $300 million [in value locked] to 1-2% of Bitcoin market capitalisation — $10-15 billion at current prices,” he said.\n\nVeradittakit also predicted an explosion in Bitcoin NFT activity thanks partly to the meteoric rise of Ordinals, the network’s take on native non-fungible tokens called inscriptions.\n\n“As Bitcoin has much higher cultural recognition and memetic value, it is possible that web2 brands — such as luxury retailers — will choose to release NFTs on Bitcoin, similar to how Tiffany’s partnered with Cryptopunks” in 2022.\n\nOutperforming the market\n\nAnother area of interest was the crossover between traditional finance and crypto technology.\n\n“TradFi assets will be ‘mirrored’ in DeFi, while crypto assets will have increased exposure in TradFi markets, thus creating TradFi-DeFi ‘bridges’ that bring these two worlds closer together for increased liquidity and diversification for investors,” Veradittakit said.\n\nThe report also covered the growth of zero-knowledge technology — particularly the merging of zero-knowledge proofs and modular blockchains.\n\n“In the upcoming year, I expect this trend to continue, with zero knowledge proofs emerging as an interface between different components of the modular blockchain stack,” Veradittakit said.\n\n“On the consumer side, zero-knowledge proofs may see increased use cases as a way to preserve identity and privacy, such as in the form of zero-knowledge based decentralised IDs,” he added.\n\nCrypto market movers\n\nBitcoin fell 1.36% from Monday to just under $39,000.\n\nEthereum dropped 4.28%, to trade just above $2,200\n\nWhat we’re reading\n\nTom Carreras is a markets correspondent at DL News. Got a tip? Reach out at tcarreras@dlnews.com"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9raW5nZG9tLWFudHMtbGF1bmNoLXNvbGFuYS1wb3dlcmVkLTA4MDAwMDU0My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 23 Jan 2024 08:00:00 GMT",
        "title": "Kingdom of ANTs Will Launch Solana-Powered Platform, Making DeFi Easy and Fun for All - Yahoo Finance",
        "content": "Kingdom of ANTs\n\nEmbrace AI-driven DeFi solutions. Seamlessly integrated, AI acts as your guide, simplifying complex decisions and strategies.\n\nSaint Vincent and the Grenadines, Jan. 23, 2024 (GLOBE NEWSWIRE) -- Kingdom of ANTs (KOA) aims to revolutionize the DeFi space in 2024. With a gamified platform and a sustainable, long-term APY, they aim to make DeFi accessible, fun, and rewarding.\n\nKOA wishes to change the game using Solana for a faster and smoother user experience. With the integration of AI, users can also expect optimized returns and help with complex DeFi functions.\n\nIn this context, staking will also play a pivotal role for crypto enthusiasts, as it will enable them to earn a passive income in crypto. The project will also launch a collection of 10,000 NFTs that will enhance the user experience.\n\nChanging DeFi Leveraging the Solana Competitive Advantage\n\nKOA will launch its innovative, Solana-based DeFi platform in January 2024. The team has meticulously built and perfected every aspect, from tokenomics to user experience, over the last 18 months.\n\nKOA chose Solana for multiple reasons, such as:\n\nUsing Solana's technology allows for faster transactions and lower user fees. Ultimately, this feature makes the DeFi experience more efficient and cost-effective. Integrating AI into KOA's platform is made possible by Solana's high-speed processing capabilities. The main idea is to allow for precise decision-making and optimized user returns. Building on Solana gives KOA access to a vibrant ecosystem full of opportunities for NFTs and gaming. This allows KOA to create a unique and engaging experience for its users.\n\nThanks to Solana's advantage, KOA aims to revolutionize DeFi, making it accessible and fun for all.\n\nPromising a Sustainable APY Over the Long Term\n\nUnrealistic APY promises are a common issue in Web3. KOA aims to change this narrative. Instead of lofty promises, KOA offers tangible, sustainable yields. This fresh approach stems from an understanding of the volatile nature of DeFi ecosystems.\n\nThe project's strategy focuses on real, achievable gains. The priority is sustainability, not hype. This realistic outlook is part of KOA's DNA. It symbolizes maturity in the highly speculative DeFi sector.\n\nKOA's yield generation model is grounded in the principles of a circular economy. Revenue comes from the sale of in-game assets. This revenue supports the ecosystem, with features such as 60% of the revenue coming from fees flowing to the project’s Treasury.\n\nThe Treasury, backed by solid blue-chip assets, further fortifies the ecosystem. It provides a theoretical floor price for the $ANTC token. This ensures that ANTC holders are not left high and dry.\n\nStory continues\n\nKOA also values transparency, as their dApp offers real-time insights into the Treasury's health. In this context, the team introduces a metric called “Runway.” This measure indicates the number of days that the Treasury can last, with the current reward level, without any inflows.\n\nThe Leveling Mechanism in the Kingdom of ANTs also endorses realistic expectations. It provides a clear pathway for yield growth. As an ANT levels up, the APY increases, up to 90% at Level 40. KOA's goal is to build a sustainable, high-yielding DeFi simulation.\n\nThe \"AI ANT Advisor\" is a game-changer in KOA's treasury management. Excelling at asset allocation, it optimally utilizes the ecosystem's resources. It also manages risk to ensure the treasury's stability. Its algorithms intricately control treasury operations, fostering prosperity. Furthermore, it simplifies complex DeFi strategies into digestible insights, aiming to substantially boost user returns.\n\nAnt Coin ($ANTC) and Its Benefits\n\nANT Coin, or $ANTC, is the Kingdom of ANTS' main token. Holders can acquire it through various means, such as completing tasks or purchasing at a DEX. A percentage of specific in-platform activities is charged as fees in $ANTC, contributing to the platform's sustainability; these collected $ANTC tokens are then burned, reducing the total circulating supply.\n\nWith a circulating supply of 100,000,000 upon launch, $ANTC holders can pay fees and earn sustainable APYs. They also gain voting power in the KOA DAO.\n\nAdditionally, they may receive NFT airdrops and VIP access to exclusive benefits. Holders can also purchase in-game assets with $SOL, with 60% of the sale revenue going back to the treasury. Overall, $ANTC offers various use cases and benefits within KOA's ecosystem. So far, it has been a highly successful token with great potential for future growth and utility.\n\nAbout Kingdom of ANTs\n\nKingdom of ANTs (KOA) is a next-gen, gamified DeFi platform with yield-bearing NFTs under the hood. The team is building it on Solana to deliver a fast, flexible, and low-cost experience.\n\nKOA will shape DeFi’s future, making it super fun, engaging, and easy to use for degens, gamers, and NFT collectors.\n\nIt’s more than just staking: this is an adventure where the user is the hero. Players will make smarter choices with ANT AI’s help, designed to optimize returns and offer personalized insights.\n\nAll players will find that this is their kingdom, playing under their rules. Potential buyers can acquire $ANTC through MEXC or Raydium.\n\nX (Twitter) | Telegram | Discord\n\n\n\n\n\n\n\nCONTACT: Niko S. Info at kingdomofants.io\n\n\n\n"
    }
]