[
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vYmxvY2tzdGVyLmNvbS9jb2xvc3NldW0tZnVlbGluZy1zb2xhbmFzLXdlYjMtaW5ub3ZhdGlvbi13aXRoLTI1MGstcHJlLXNlZWQtY2FwaXRhbC1vcHBvcnR1bml0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Colosseum: Fueling Solana's Web3 Innovation with $250K Pre-seed Capital Opportunity - Blockster",
        "content": "As the Founder, Editor-In-Chief, and Creative Director of Blockster, I lead the creation of captivating stories, collaborate with top Web3 brands, and drive our innovative product strategy."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY3J5cHRvLm5ld3Mvc29sYW5hcy13ZW4tbWVtZWNvaW4tbmVhcnMtMTAwbS1tYXJrZXQtY2FwLWZvbGxvd2luZy1sYXVuY2gv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Solana's WEN memecoin nears $100m market cap following launch - crypto.news",
        "content": "Following other Solana memecoins, WEN aims to immortalize a popular part of a crypto culture centered on timelines and milestones.\n\nThe WEN token skyrocketed over 4,000% from launch on Jan. 26, racing above a $50 million market capitalization less than 12 hours after its debut on Solana’s ecosystem. WEN was airdropped to users of the decentralized exchange Jupiter.\n\nTo claim the free tokens, Jupiter users must have traded at least $5 in volume between July 2023 and January. The six-month qualification period ended at midnight UTC on Jan. 19 when a snapshot was taken. According to WEN’s launch page, tokens unclaimed by Jan. 29 will be burned.\n\nWEN is inspired by a fractionalized NFT poem written by pseudonymous developer Weremeow, one of the minds behind Jupiter exchange and other Solana-native dapps like Meteora. The Ovals team manages the cryptocurrency and was launched via Jupiter’s launchpad platform dubbed LFG.\n\nhttps://twitter.com/weremeow/status/1738590330805719289?s=20\n\nYou might also like: Jupiter tokens to drop in January 2024 for Solana defi users\n\nOf WEN’s one trillion supply, 70% was airdropped to eligible users who can earn trading fees by providing liquidity. Per the project’s page, the idea is a community-backed salute to Weremeow and the common crypto question of when.\n\nThe term often refers to inquiries regarding when a token might launch, or a new feature might be shipped.\n\nWEN’s launch comes ahead of a Jupiter airdrop likely slated for month’s end and follows a frenzy of Solana memecoins toward the end of last year. Cryptos like BONK and dogwifhat were said to turn speculators into overnight millionaires.\n\nUsers bought in with small-sized capitals, sometimes turning a few bucks into thousands of dollars in profits.\n\nMemecoin mania is synonymous with each crypto cycle, usually leading into a bull run. However, caution is advised when dealing with altcoins dependent on community speculation rather than proven utility."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbmZvbWFuaWEuY29tL3NvbGFuYS1mb3VuZGVyLWNsYXJpZmllcy13aGVuLW5ldHdvcmstd2lsbC1uby1sb25nZXItYmUtaW4tYmV0YS1tb2RlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Solana Founder Clarifies When Network Will No Longer Be in “Beta” Mode - Coinfomania",
        "content": "Solana Network’s co-founder, Anatoly Yakovenko, has confirmed the conditions the blockchain would meet before finally exiting the much-talked-about beta mode. According to a tweet on Friday, the Solana network would go full mainnet when “firedancer is stable and it’s running as a safety check on mainnet.”\n\nI know I’ve said that it’s the line for beta, but we should actually get serious about it. Beta ends when firedancer is stable and it’s running as a safety check on mainnet. Safety of the state is paramount. https://t.co/AEtfqxVgcj — toly ???????? (@aeyakovenko) January 26, 2024\n\nThe revelation came in response to a tweet flaunting the stability of the Solana Network. The X user revealed that the blockchain has maintained an uptime of 336 days, 29 days shy of a full year without downtime.\n\nMainnet Finally?\n\nThe “Mainnet Beta” phrase affiliated with the Solana Network had seen it receive less criticism during downtimes. However, the blockchain has shown appreciable stability amidst peak usage.\n\nThe Solana Network experienced zero downtime during the SOL’s mini-bull run last year, surpassing daily and monthly transaction highs. At one point, SOL’s DEX trading volume surpassed that of Ethereum and other layer-1 networks combined, but it maintained uptime and a reasonable transaction fee.\n\nDespite the positives, Yakovenko maintained that its independent client validator, Firedancer, must be more stable and run safety checks before Solana goes mainnet entirely. Solana introduced the Firedancer last year to boost the network’s scalability, speed, and decentralization.\n\nWay to the Top?\n\nAlthough Solana suffered several setbacks during and after the Mainnet Beta 2 launch in 2020, it is on course to become one of the leading blockchains in the crypto sector. Solana’s scalability has improved drastically and is second only to the Ethereum Network.\n\nWith Yakovenko stating at one time that he sees nothing holding developers from building layer-2s on Solana’s blockchain, the network might be on track to greater scalability and stability and may finally match Ethereum toe-to-toe. However, Solana co-founder Raj Gokal insists he wants to see the second-largest crypto asset thrive."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzI2L2NyeXB0by1hbmFseXN0LWJyZWFrcy1kb3duLXJlYm91bmRpbmctYml0Y29pbi1idGMtc29sYW5hLXNvbC1hbmQtYWx0Y29pbi1tYXJrZXQtY3ljbGVzL9IBfGh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzI2L2NyeXB0by1hbmFseXN0LWJyZWFrcy1kb3duLXJlYm91bmRpbmctYml0Y29pbi1idGMtc29sYW5hLXNvbC1hbmQtYWx0Y29pbi1tYXJrZXQtY3ljbGVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Crypto Analyst Breaks Down Rebounding Bitcoin (BTC), Solana (SOL) and Altcoin Market Cycles - The Daily Hodl",
        "content": "A widely followed crypto trader is analyzing the up-and-down price activity of Bitcoin (BTC), Solana (SOL) and altcoins in general.\n\nPseudonymous trader Rekt Capital tells his 390,400 followers on the social media platform X that BTC is about to face a moment of truth.\n\n“Moment of truth for Bitcoin\n\nGreen arrows show good retests of the Range Low as support.\n\nBut this current rebound could turn the old Range Low into new resistance.\n\nHowever, a Daily Close above the Range Low & later a one week Close would recover the range.”\n\nBTC is worth $41,952 at time of writing, up 6% in the last 24 hours. According to Rekt Capital, this recent leap will have an impact on the cycle of the altcoin markets.\n\n“Yesterday the Q1 Altcoin Hype Cycle was doubted.\n\nToday BTC has moved +3% and suddenly there is new hope.\n\nThe reality is that Bitcoin may very well continue to see-saw in the near-term but it shouldn’t impact your view on what lays weeks ahead.”\n\nDiving deeper into the altcoin cycle, the analyst shares a graph and asks the question — is altcoin hype about to spike?\n\n“Is the Q1 Altcoin Hype Cycle slowly getting closer?\n\nLowest hype = peak financial opportunity (green)\n\nHighest hype = peak financial risk (red)”\n\nLooking at one altcoin in particular, Rekt Capital says he expects Solana to dip slightly before continuing its rally.\n\n“Solana is perfectly following the orange path\n\n+15% up since the green zone”\n\nSOL is trading for $93.20 at time of writing, up nearly 9% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/happyframe/Sol Invictus"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vaW52ZXN0aW5naGF2ZW4uY29tL2NyeXB0by1mb3JlY2FzdHMvbG9va2luZy1mb3ItdGhlLW5leHQtc29sYW5hLXRvcC10aHJlZS1hbHRlcm5hdGl2ZXMv0gFjaHR0cHM6Ly9pbnZlc3RpbmdoYXZlbi5jb20vY3J5cHRvLWZvcmVjYXN0cy9sb29raW5nLWZvci10aGUtbmV4dC1zb2xhbmEtdG9wLXRocmVlLWFsdGVybmF0aXZlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Looking For ‘The Next Solana’? Top Three Alternatives - Investing Haven",
        "content": "Solana (SOL) had an excellent 2023, shooting from $20 to above $120 in the second half of the year. And there has been considerable hype surrounding Solana-based coins.\n\nThe ecosystem is fast, low-cost, and scalable, making it a prime place for dApp development, and there has been a considerable amount of bullish Solana news regarding how the network is progressing in terms of partnerships and upgrades.\n\nHowever, after a 6x bull run, the chart suggests that it needs a break. This is a great time to consider alternatives, in our own words ‘the next Solana.’ It’s not going to 6x again again time soon, while other coins might have a chance of doing so, even more than 6x.\n\nA broad Solana outlook for 2024 and 2025\n\nWe at InvestingHaven have a bullish outlook on Solana for 2024 and 2025. The network fundamentals are very strong and there is a lot of development going on within the ecosystem. Many new projects are choosing to develop on top of the Solana infrastructure, it scores well in speed, scalability, and cost, and it has impressive on-chain metrics.\n\nHowever, the price is exhausted in the short to medium term. We wrote about this extensively in the article about SOL being vulnerable to further downside. Within the article, we outlined how fundamentals are not always driving price and how a cooling period is inevitable for tokens that make rapid gains.\n\nThis is also precisely how we predicted the current Bitcoin price drop, as it had already experienced an increase and needed a cooling off period. This was to herald in a rising altcoin market over the next year. The charts back this view up – the graph below indicates an exhausted SOL price:\n\nMost likely, Solana is going to continue to hover between $72 – $120. It needs a consolidation period after experiencing such rapid expansion. Solana also offers support levels at $64, $72, and $80. While the coin is likely to experience further upside as 2024 progresses, there are far better buying opportunities. The time to buy Solana was when we recommended it to premium subscribers between $20 – $30.\n\nThree Solana alternatives with super upside\n\nThe following three charts indicate some of our top Solana alternatives that we give to dedicated subscribers. This is a 50x token by 2026, with a bullish falling wedge breakout followed by a bullish reversal:\n\nThis is a bullish rounded reversal followed by another wide bullish rounded reversal, with 10x potential by 2025.\n\nFinally, this is a bullish W-reversal followed by a bullish rounded reversal. It has a 6x upside potential by 2024.\n\nOnly a very small number of analysts with experience in the field are capable of interpreting these charts correctly. We excel at identifying specific chart setups that are hard for the untrained eye to understand. This allows us to find specific entry and exit points. In contrast, most headlines are created in saturated bull markets where most investors buy at a high and sell at a low.\n\nAfter all, hype is what sells – it’s difficult to attract readers with headlines telling them about a sideways trading coin. People want to believe in 10x coins, which are notoriously difficult to pick out without significant expertise.\n\nThe ‘next Solana’ – tremendous upside potential\n\nThere are certainly many coins that outrank Solana in terms of upside, think of the upside potential that Solana had back in the summer of 2023. While it can still do well, it won’t be 2024’s top-performing asset. With the recent SOL price rise, it’s entirely feasible that all the positive fundamental news is already priced in.\n\nAnd the 2023 price rise could have been driven, in large part, by the Solana-based meme coin frenzy (SPONGE, BONK, WIF, MYRO, etc). Moreover, Solana outperformed major cryptos in 2023 and must have a period of consolidation before embarking on another breakout.\n\nAs we have continually reiterated, periods of boring consolidation are what demark a major breakout. Bull runs only have so much steam before needing to revitalize and consolidate. If you want to see our picks that have 6x, 10x, and 50x potential in 2024, 2025, and 2026, then you’ll need to join the premium service.\n\nUpon signup, you’ll gain immediate access to top coins with alerts when a token is set to pump, based on what the charts are saying.\n\nDisclaimer: This is not financial advice. Please consult with a licensed financial advisor prior to making any investments.\n\nReceive our crypto FREE newsletter alerts Download 50 crypto investing tips"
    }
]