[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvc29sYW5hLXNvbC1wbGFubmluZy0xMC1taWxsaW9uLWV4cGFuc2lvbi1pbnRvLWJyYXppbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Solana (SOL) Planning $10 Million Expansion Into Brazil - Watcher Guru",
        "content": "In a major move for its global operations, Solana is reportedly planning a massive $10 million expansion into Brazil. The Solana Foundation has targeted the South American country as a key growth area. Moreover, that is proven by the massive investment that the firm is planning in the country.\n\nDiego Dias, Solana’s Head of the Brazilian and Latam Grops, noted the firm’s intention to empower the growth of a Web3 ecosystem in the country. Subsequently, the non-profit is set to infuse Brazil’s Web3 initiatives with the investment to build areas like tokenized assets, AI, and more.\n\nSource: PYMNTS.com\n\nAlso Read: Solana Holds Steady Above $100; Will SOL Hit $130 Soon?\n\nSolana Planning Web3 Investment Into Brazil\n\nThe past year has certainly been one defined by its growth in the digital asset sector. A host of networks and tokens have seen regulatory action taken across the globe. Moreover, these entities have explored various expansive efforts to increase the presence of Web3 technology worldwide.\n\nThat is continuing today, as Solana has announced it is planning a $10 million expansion into Brazil. Specifically, the non-profit organization is set to inject Brazilian Web3 projects with the funds. Subsequently, it should bring about a new development in the country’s ecosystem.\n\nAlso Read: Solana: How High Can SOL Rise In January 2024?\n\n“Our intention at the Solana Foundation is to have a diminishing influence on the ecosystem and empower our community to lead the future of Solana,” Dias stated. Moreover, they noted that the investment will see Solana sponsor a “superteam” in Brazil. Moreover, the development team will be similar to what the foundation has already formulated in seven other countries.\n\nDias stated that the superteams began as decentralized organizations, but now operate as worldwide extensions of the Solana Foundation. For Brazil, this investment is set to equip local developers in ways that should bear increased fruit for its Web3 development. Subsequently, it should continue the great work Solana is doing on an international level."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2FyYml0cnVtLWRleHMtZGFpbHktdHJhbnNhY3Rpb24tdm9sdW1lLWVjbGlwc2UtZXRoZXJldW0tc29sYW5hL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Arbitrum DEXs daily transaction volume eclipse Ethereum, Solana - CryptoSlate",
        "content": "Decentralized exchanges (DEX) transaction volume on Arbitrum, a layer2 network, surpassed that of Ethereum for the first time during the past day, according to DeFillama data.\n\nDuring the reporting period, DEXs on Arbitrum saw their volume soar to $1.843 billion, surpassing Ethereum’s $1.444 billion and Solana’s $683.59 million.\n\nThis surge aligns with Arbitrum’s continuous weekly growth, rising by 32.58% to $6.804 billion, a new all-time high, though still trailing Ethereum’s $9.581 billion. However, it surpasses Solana’s $5.039 billion and notably exceeds Binance Smart Chain’s daily volume by nearly fourfold.\n\nThe rising DEX volume also coincided with high-network activity on the layer2 network. During the past day, Arbitrum’s daily transaction per second stood at 14.05, while Ethereum mainnet’s was 12.92, according to L2beat data.\n\nUniswap dominates\n\nThe increased trading volume can be attributed to heightened activity on Arbitrum’s DEXs like Uniswap, Camelot, Ramses Exchange, and Trader Joe. Data from DeFillama shows that these protocols have enjoyed double-digit growth to new highs during the past week.\n\nUniswap Labs, the developers of the popular decentralized trading protocol Uniswap, revealed that Arbitrum became the first layer2 network to cross a billion in daily volume on the platform on Jan. 4.\n\nUniswap is the largest DEX protocol by trading volume across all chains, with an average volume of more than $1.5 billion during the past week.\n\nArbitrum’s rising TVL\n\nThe rising DEX volume has also coincided with a sharp increase in the total value of assets locked on the Ethereum-based layer2 network.\n\nData from DefiLlama shows the TVL on Arbitrum-based applications has increased by around $1 billion in the last six months to nearly $2.5 billion, with the dominant DeFi protocol being GMX, a decentralized spot, and perpetual exchange, which controls about 20% of the network’s total TVL.\n\nAdditionally, Arbitrum’s native ARB token recently reached a new all-time high of more than $2 on Jan. 4 but has retraced to $1.94 as of press time, according to CryptoSlate’s data.\n\nMentioned in this article"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbmZvbWFuaWEuY29tL3NvbGFuYS1mb3VuZGVyLXNheXMtdGhlcmVzLW5vdGhpbmctc3RvcHBpbmctZGV2cy1mcm9tLWJ1aWxkaW5nLWwycy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Solana Founder Says There's Nothing Stopping Devs from Building L2s on Solana - Coinfomania",
        "content": "The layer-1 blockchain network Solana may soon start to see layer-2 networks building in its ecosystem. In a Friday tweet, Solana founder Anatoly Yakovenko stated that “there’s nothing stopping developers” from creating layer-2 blockchains on the Solana network.\n\nWhat are Layer-2 Networks?\n\nLayer-2 solutions are blockchain networks built on an existing layer-1 blockchain. These secondary protocols benefit from the base blockchain’s network and security. At the same time, it solves the base network’s scalability issues, facilitating faster and cheaper transactions.\n\nThese L2 networks enable transactions off-chain. These off-chain trades are bundled and transported to the base blockchain, reducing the burden on them. An example of a blockchain network with several L2 networks is the Ethereum blockchain.\n\nNotably, L2s are not to be confused with sidechains, an independent chain linked to a parent blockchain to address the scalability issue. Unlike layer-2 networks that rely on the layer-1 blockchain’s security, sidechains have separate security characteristics from the base blockchain. A popular sidechain is the Ronin network.\n\nL2s to Build on Solana\n\nIn his tweet, Yakovenko categorized layer-2 networks, side chains, and zero-knowledge (zk) proofs as bringing the same result. He explains that these technologies cannot be as good as a well-optimized layer-1 blockchain.\n\nOperating a well-optimized L1 network entails that all transactions and projects will live on the base blockchain, promoting a “global atomic state machine” where all decentralized apps (dApps) and users will have access to the same data in real-time without passing through an L2 solution or side chain.\n\nWhile acknowledging that L2s and sidechains “are innovative and welcomed,” Yakovenko emphasized that Solana’s goal is to bring the entirety of its on-chain services into a single execution layer that would undergo “hardware upgrades in the future.”\n\nMeanwhile. it is likely that a shift towards layer-2 networks will allow for more projects to onboard the Solana ecosystem. This may have a ripple effect on the blockchain’s native cryptocurrency, SOL. At the time of writing, SOL traded at $102."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vdS50b2RheS9zb2xhbmFzLWJvbmstYm9uay0xMzAwMC1zcGlrZS1oZXJlcy13aGF0LXRvLXBheS1hdHRlbnRpb24tdG8tYW5hbHlzdNIBWGh0dHBzOi8vdS50b2RheS9zb2xhbmFzLWJvbmstYm9uay0xMzAwMC1zcGlrZS1oZXJlcy13aGF0LXRvLXBheS1hdHRlbnRpb24tdG8tYW5hbHlzdD9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Solana's Bonk (BONK) 13,000% Spike, Here's What to Pay Attention To: Analyst - U.Today",
        "content": "Disclaimer: The opinions expressed by our writers are their own and do not represent the views of U.Today. The financial and market information provided on U.Today is intended for informational purposes only. U.Today is not liable for any financial losses incurred while trading cryptocurrencies. Conduct your own research by contacting financial experts before making any investment decisions. We believe that all content is accurate as of the date of publication, but certain offers mentioned may no longer be available.\n\nSolana dog coin Bonk (BONK) saw stellar performance in 2023, ranking among the top gainers.\n\nAdvertisement\n\nBonk (BONK), the Solana meme coin, gained nearly 13,000% in value in 2023 as Solana ecosystem tokens surged several times in the past year.\n\nHowever, the narrative seems to be shifting as traders seem to be taking profits to rotate funds into newer plays.\n\nSolana ecosystem tokens, notably BONK, have dropped from recently set highs, hinting at profit-taking from investors who probably made significant returns on their initial positions as prices jumped.\n\nData from CoinGecko shows meme coin Bonk (BONK) has fallen 11% in the past 24 hours to trade at $0.00001097 at the time of writing. BONK is now down 67.4% from its all-time high of $0.00003416, attained Dec. 15, 2023.\n\nDespite the current price drop, BONK remains up 12,819.20% from its all-time low price of $0.000000086142 recorded on Dec. 29, 2022.\n\nCrypto analyst says to keep an eye on BONK\n\nIn a tweet, crypto analyst Lark Davis, \"CryptoLark,\" recounts the bull-driven rally experienced by several meme coins in 2023.\n\n#1 $BONK\n\n\n\nA dog-themed meme coin created to rally together the Solana community.\n\n\n\n- Market Cap: $738M\n\n- Down 50% since ATH (12/23)\n\n- Future Catalyst: If Solana continues to blow up, BONK could do big things. — Lark Davis (@TheCryptoLark) January 4, 2024\n\nCryptoLark believes that things are only getting started, anticipating the end of 2024 and extending into the 2025 crypto bull run.\n\n\"We've had some decent meme coin action over the past month, but this is nothing compared to the crazy degen action we'll see during the end of the 2024–2025 crypto bull run,\" CryptoLark wrote in a post on X.\n\nIn this light, Lark Davis outlines 10 meme coins to keep an eye on; the top of the list is Bonk. \"If Solana continues to blow up,\" he says, \"BONK could do big things.\"\n\nSolana has captivated most of the market's interest, becoming one of the strongest draws among on-chain traders as its general ecosystem flourished."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vdW5jaGFpbmVkY3J5cHRvLmNvbS9hcmJpdHJ1bS10YWtlcy1sZWFkLWluLWRhaWx5LWRleC12b2x1bWUtZm9yLWZpcnN0LXRpbWUtc3VycGFzc2luZy1ldGhlcmV1bS1hbmQtc29sYW5hL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Arbitrum Takes Lead in Daily DEX Volume for First Time, Surpassing Ethereum and Solana - Unchained - Unchained",
        "content": "The surge in Arbitrum’s daily volume likely stems from the upcoming Ethereum upgrade dubbed Dencun, not the memecoin frenzy experienced by other blockchain networks.\n\nArbitrum, a layer 2 scaling solution for Ethereum, has taken the lead in daily volume on decentralized exchanges (DEX) for the first time in Arbitrum’s history, according to the most recent data from crypto analytics firm DefiLlama.\n\nOver the past 24 hours, the total value of transactions made on Arbitrum by crypto users stands at $1.83 billion, taking the lead from base layer blockchain Ethereum, which has a 24-hour volume of $1.44 billion. In fact, the combined 24-hour volume of Solana, Binance Smart Chain, Polygon, Avalanche, Optimism and zkSync Era is less than that of Arbitrum.\n\n\n\nThe historical leader in 24-hour volume has been Ethereum, though its seat on the throne has been challenged recently. Solana, a layer 1 blockchain that implements proof-of-history, surpassed Ethereum’s daily DEX volume for several days in December 2023. Now, less than a month later, Arbitrum has taken the lead.\n\n“It’s not an easy feat, there’s a lot of chains and not many have been able to do that, even if it’s just temporarily,” said Martin Lee, content lead at on-chain metrics firm Nansen, to Unchained via Telegram. “While it’s an impressive achievement, ideally, I’d want to see this trend continue over a longer time horizon before putting any weight behind it. We’ve seen moments where chains get massive spikes in activity but few manage to maintain it.”\n\nDencun’s Impact\n\nThe spike in Arbitrum’s volume likely stems from the upcoming Ethereum upgrade known as Dencun, Lee noted. Set to be activated on several testnets this month, Dencun is the first major upgrade to Ethereum since Shapella in April of last year, which enabled stakers to withdraw their ETH. The newest upgrade includes EIP-4844, also known as proto-danksharding, which is designed to scale Ethereum in a decentralized way.\n\n“Proto-danksharding reduces the cost of posting large amounts of data to Ethereum and thereby lowers the operational cost of rollups,” wrote Galaxy’s vice president of research Christine Kim in a research report last June. “EIP 4844 is considered a boost to Ethereum scalability because it makes Layer-2 networks built atop Ethereum more cost-effective,” the report said.\n\nIn addition, Carlos Mercado, data scientist at blockchain data firm Flipside Crypto told Unchained over Telegram that “Arbitrum over the last few weeks has been preparing for Arbitrum Orbit, their competitor to the Optimism ‘Superchain’ thesis,” a network of chains that all share Optimism’s open-source development stack.\n\nNotably, the surge in Arbitrum’s daily DEX volume is not from the recent memecoin frenzy that has gone viral on other Layer-1 networks such as Bitcoin, Solana, and Avalanche. Memecoins “never took off” on Arbitrum, according to Nansen’s Lee.\n\nARB, the native governance token for the Arbitrum ecosystem, has slid roughly 11% in the past 24 hours, but has gained nearly 27% in the past seven days to change hands at $1.86, according to CoinGecko.\n\nDisclosure: Arbitrum is a sponsor of Unchained."
    }
]