[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9uZXdzL3N0b3J5LzIwMjQtMDEtMjcvc29sYW5hLWJlYWNoLWFzc2lzdGFudC1jaXR5LW1hbmFnZXItZGFuLWtpbmctYXBwb2ludGVkLWludGVyaW0tY2l0eS1tYW5hZ2Vy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "Solana Beach Assistant City Manager Dan King appointed interim city manager - Del Mar Times",
        "content": "Solana Beach Assistant City Manager Dan King will serve as interim city manager following the resignation of City Manager Greg Wade, who has held the position since 2015.\n\nWade is about to begin a new role as the CEO of the Clean Energy Alliance, one of the state’s newest Community Choice Aggregation programs. The CEA announced last fall that Wade had been hired.\n\nThe Solana Beach City Council voted Jan. 24 to appoint King, who was first hired as a management intern with the city in 2002, to the interim position while the search for a new permanent city manager takes place.\n\nOver the years, King has worked for the city of Solana Beach as an environmental specialist, environmental programs manager, management analyst, assistant to the city manager, and, since 2016, has been assistant city manager.\n\nA city staff report says that King “has a comprehensive understanding of the projects that require attention in the coming months, ensuring the transition will be as smooth as possible and not disrupt City projects or operations.”\n\nKing’s first day will be Feb. 1, following Wade’s last day on Jan. 31.\n\nKing’s compensation includes a $250,000 salary and $450 monthly vehicle allowance."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9uZXdzL3N0b3J5LzIwMjQtMDEtMjcvZGVsLW1hci1tYXlvci1kYXZlLWRydWtlci10by1zZXJ2ZS1zZWNvbmQtdGVybS1hcy1jaGFpci1vZi10aGUtY2VhLWJvYXJk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "Del Mar Mayor Dave Druker to serve second term as chair of the CEA board - Del Mar Times",
        "content": "Since launching in 2019 with the cities of Solana Beach, Del Mar and Carlsbad, the Clean Energy Alliance has added Vista, Escondido, Oceanside and San Marcos.\n\nDel Mar Mayor Dave Druker was elected to a second term as chair of the Clean Energy Alliance during the board’s Jan. 25 meeting.\n\nVista City Councilmember Katie Melendez became the board’s vice chair.\n\nThe seven members of the board, representing the agency’s seven member cities, elect the chair and vice chair of the board each year. Under the agency’s bylaws, the chair and vice chair can serve for two consecutive terms at a time.\n\nSince launching in 2019 with the cities of Solana Beach, Del Mar and Carlsbad, the Clean Energy Alliance has added Vista, Escondido, Oceanside and San Marcos. San Diego Community Power also emerged as the second CCA program in San Diego County, covering most of the rest of the county.\n\nThe Clean Energy Alliance also introduced a number of personnel additions, including new CEO Greg Wade. Wade, who is stepping down as Solana Beach city manager, oversaw Solana Energy Alliance, which served the city of Solana Beach and merged with the CEA.\n\nOther positions hired include regulatory analyst, board secretary, power procurement manager.\n\n“It’s exciting to see the CEA finally have some permanent staff that can work with us and grow this organization, especially as we bring on Vista and Oceanside,” Druker said."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9uZXctc29sYW5hLW1lbWUtY29pbi13ZW4tYWlyZHJvcHBlZC10by0xLW1pbGxpb24td2FsbGV0cy1oZXJlcy1ob3ctdG8tY2hlY2stZWxpZ2liaWxpdHkuaHRt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "New Solana Meme Coin 'WEN' Airdropped to 1 Million Wallets – Here's How to Check Eligibility - Cryptonews",
        "content": "New Solana Meme Coin ‘WEN’ Airdropped to 1 Million Wallets – Here’s How to Check Eligibility\n\nWEN, a new Solana meme coin, has gained significant traction after being airdropped to over a million wallets.\n\nThe airdrop, which took place on Friday morning, was facilitated through the decentralized exchange (DEX) aggregator Jupiter, as part of a large-scale test of its new launchpad.\n\nJupiter will continue its airdrop spree next week with its own token, JUP, which is eagerly anticipated by nearly a million eligible wallets.\n\nHowever, the WEN airdrop had an even wider reach, extending eligibility to over a million Solana wallets.\n\nThis included active Jupiter users from the past six months, holders of various popular NFT projects on the platform, and even owners of the Solana Saga smartphone.\n\nEach wallet that met the eligibility criteria could claim an airdrop of 643,652 WEN tokens.\n\nAt the current price of $0.00009095, this translates to a value of over $58, according to CoinGecko. Since the airdrop, WEN has experienced a price increase of approximately 483%.\n\nDifferent data sources reported temporary price spikes, with CoinMarketCap noting a peak at $2,915 and Birdeye recording a peak at $4,836.\n\nHowever, both platforms currently show a significant drop in value from those peaks, with WEN now trading at a fraction of a penny.\n\nWhile these price fluctuations may have caught some traders off guard, it is important to remember that token prices can be highly volatile, particularly during and immediately after an airdrop.\n\nMeme coins, in particular, are known for their wild price swings.\n\nSolana Meme Coins Continue to Make Waves\n\n\n\nDespite the initial chaos, there is a history of Solana meme coins experiencing significant price surges, leading some WEN recipients to hold onto their tokens in the hope of a similar jump.\n\nSpecifically, some have speculated that the meme coin may follow in the footsteps of popular Solana tokens like BONK and Dogwifhat (WIF), which have seen their price skyrocket.\n\nAccording to data from CoinMarketCap, BONK has gained more than 1,000% over the past year while WIF has surged by more than 110% over the past month alone.\n\nMeanwhile, the Solana network managed to handle the immense demand during the airdrop, with approximately 118,000 wallets attempting to connect simultaneously, according to data from Solana Floor.\n\nHowever, there were some technical issues reported during the early stages of the drop, particularly by the Phantom wallet, which experienced performance issues.\n\nThe Phantom team assured users that they would address these problems to ensure a smoother experience during next week’s JUP airdrop.\n\nSolana continues to make waves in the crypto community as it achieves several significant milestones.\n\nEarlier this month, the network surpassed Ethereum (ETH) in 7-day stablecoin trading volume for the first time ever.\n\nAs reported, the value of stablecoin transfers on Solana reached a staggering $103 billion last week, outperforming all other networks.\n\nEthereum secured the second position with $90.9 billion, followed by Tron with $82.3 billion and BNB Chain with $14.6 billion.\n\nIn addition to stablecoin trading volume, Solana also surpassed Ethereum in NFT trade volume for the month of December."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzI3L3NvbGFuYS1kb3duLTY4LWZyb20tYWxsLXRpbWUtaGlnaC10aW1lLXRvLWJ1eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "Solana Is Down 68% From Its All-Time High: Time to Buy? - The Motley Fool",
        "content": "Investors won't struggle to find reasons to want to own this innovative digital asset.\n\nPutting money to work in the cryptocurrency market is back in style. The industry saw its value double in 2023, so some investors are trying to buy digital tokens that can supercharge their portfolio returns.\n\nLook at Solana (SOL -0.93%). This cryptocurrency skyrocketed 963% last year, and it's currently the fifth most valuable blockchain network in the world.\n\nHowever, Solana remains 67% off its peak price (as of Jan. 25). Does this mean it's a smart idea to buy it on the dip right now?\n\nUnique features\n\nWhen looking at a potential cryptocurrency investment, it's a good idea to figure out what makes a digital token stand out from the tens of thousands that are out there. With this perspective, it's safe to say that Solana is unique.\n\nIt includes functionality for smart contracts. This makes it similar to Ethereum and Cardano, and it opens up Solana to launch decentralized applications. In fact, Solana is in the top 10 on the list of cryptocurrencies with the most active developers, which bodes well for its future when it comes to introducing use cases.\n\nSolana's greatest feature, though, is its incredible speed, with a theoretical throughput of 50,000 transactions per second (TPS). This puts it in the same ballpark as Visa, one of the largest payment networks in the world. In comparison, Ethereum is only able to process about 12 TPS. The way Solana orders its transactions, called a proof-of-history, requires less data. This also makes Solana a top blockchain when it comes to decentralized finance protocols.\n\nIndeed, Solana is making a push in the payments industry. Solana Pay allows merchants and customers to transact directly with each other, using the native SOL token or a stablecoin, to facilitate transactions on the blockchain. With near-zero fees and instant settlement, the hope is that Solana Pay will achieve greater adoption. Integrating with Shopify should help in this regard.\n\nEntering the hardware space\n\nBesides services, Solana is trying to make a splash in the world of hardware. Last April, the Saga smartphone was released with a $1,000 price tag. This is a mobile device developed specifically for users to interact with web3 applications on the Solana network.\n\nRecently, the Saga Chapter 2, which is a cheaper smartphone that costs $450, started taking pre-orders. Solana is trying to target a mass audience, but the project could be canceled if there's weak demand.\n\nThis hardware strategy is interesting. Consumer electronics is typically a very difficult business, and I wonder if there's that much demand for a crypto-specific smartphone. Only 20,000 Saga phones were produced. So it's difficult for me to see people wanting to buy this over an iPhone or top Android devices. But its progress is something to keep close tabs on.\n\nKeep expectations realistic\n\n\n\nIt's still easy to see the favorable characteristics that might make Solana a potential portfolio addition, at least when it comes to your crypto exposure. Should things work out and Solana gain greater adoption, this digital asset could be worth significantly more a decade from now. At least that's what the bull case centers on.\n\nBut investors also need to set realistic expectations. The cryptocurrency industry, despite its enormous returns, is still full of uncertainty as to the ultimate outcome. There's still a meaningful chance that this entire technology won't even exist 10 years from now. Investors need to understand the risk that they are taking if they buy Solana.\n\nAnd although you might have conviction in this cryptocurrency's prospects, it's always good to remember the extreme volatility that you will face. It's not going to be a smooth ride. For those who are bullish, perhaps initiating a tiny position is a smart approach."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzI3LzItY3J5cHRvcy10by1idXktaGFuZC1vdmVyLWZpc3QtaW4tamFudWFyeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 Jan 2024 08:00:00 GMT",
        "title": "2 Cryptocurrencies to Buy Hand Over Fist in January - The Motley Fool",
        "content": "Bitcoin and Solana may be down in January, but both have strong catalysts in place for 2024.\n\nThe recent pullback in the crypto market could be the perfect opportunity to buy the dip in undervalued cryptos. But which ones?\n\nTwo cryptos on my radar right now are Bitcoin (BTC 0.19%) and Solana (SOL -0.93%). Both started off the year with tremendous momentum, but are now trading a steep discount from where they were just a month ago. Let's take a closer look at the case for buying them now.\n\n1. Bitcoin\n\nBitcoin seemed to be a no-brainer crypto investment at the beginning of January. At that time, Bitcoin was trading around $45,000, and impending SEC approval of the new spot Bitcoin ETFs was supposed to send the price of Bitcoin soaring. But that simply has not been the case. Bitcoin now trades under $40,000, and concerns are mounting that the \"buy the rumor, sell the news\" phenomenon could continue to send Bitcoin lower.\n\nBut that's OK. Bitcoin has a second catalyst in the works that could ultimately unlock much more value: the next Bitcoin halving. This event is now scheduled for April 2024, and if everything goes according to plan (a big \"if\"), it could be huge for Bitcoin.\n\nThat's because Bitcoin has had three previous halving events (2012, 2016, and 2020), and each one has been spectacular. In 2020, for example, the halving eventually propelled Bitcoin to an all-time high of $69,000 per coin. The thinking is that we could soon see another all-time high for Bitcoin at the $100,000 mark or higher by the end of 2024.\n\nOf course, past performance is no guarantee of future performance, so just be careful of expecting too much, too soon. Typically, every Bitcoin halving cycle 's bullish phase lasts for 12 to 18 months, so it might be sometime in 2025 before Bitcoin blasts off into the stratosphere.\n\nThe Bitcoin halving was once an event entirely reserved for crypto enthusiasts only, but what is truly remarkable this time around is how deeply big-name investors are buying into the idea of the halving. That gives me more confidence that this catalyst will not disappoint.\n\n2. Solana\n\nSimilar to Bitcoin, Solana seemed to be a no-brainer crypto investment for 2024. At one point last year, Solana was up more than 1,000% and seemed to be unstoppable. With just one week to go until the new year, Solana was trading for over $120. So it seems almost unfathomable that Solana is now trading around $80.\n\nTwo factors seem to be behind this substantial drop in value. For one, all the hype around the new Bitcoin ETFs has meant less institutional money flowing into Solana. That has placed a cap on just how much higher Solana can go over the short term. At one point in January, Bitcoin accounted for nearly 98% of all institutional money flowing into crypto.\n\nSecondly, the whole \"Solana is the next Ethereum (ETH 0.82%)\" argument seems to have been turned on its head. The new narrative apparently is \"Ethereum is the next Ethereum.\" There's buzz building over a new speed-boosting Ethereum blockchain upgrade, as well as new hype over a potential spot Ethereum ETF.\n\nAccording to this narrative, investor money will flood into Ethereum as soon as the SEC approves this new ETF. From my perspective, though, investors are much less excited about an Ethereum ETF than a Bitcoin ETF.\n\nLong story short, this could be a perfect buy-the-dip opportunity for Solana while everyone else is focused on Ethereum. Cathie Wood of Ark Invest recently appeared on CNBC, making a bullish case for why Solana is a superior investment to Ethereum. Nothing has changed here. It's still faster and more cost-efficient.\n\nAnd I would argue that Solana is now innovating at a much faster pace than Ethereum. Solana now has a mobile crypto strategy that appears to be picking up steam. The Saga \"crypto phone\" officially launched last April, and Solana will launch a new, lower-priced version this year. At the same time, Solana is gaining ground with its blockchain payment strategy, thanks to a new partnership with Visa.\n\nRisk factors\n\nIt's important to point out that both Bitcoin and Solana -- like all cryptos -- are very volatile, risky assets. In terms of overall risk-reward profile, though, Bitcoin is likely a \"safer\" investment than Solana. It now has increasing approval from Wall Street (with a few notable exceptions, such as Jamie Dimon). And it has a much longer track record of delivering market-beating performance than Solana.\n\nThat being said, both cryptos are worthy of a closer look. Short-term factors appear to have pushed down their prices in January, but their long-term outlook remains relatively unchanged. I'm still bullish on Bitcoin as the future of digital money, and I see Solana as the first-ever smart contracts blockchain able to take on Ethereum on its digital home turf -- and win."
    }
]