[
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9zb2xhbmEtbWVtZS1jb2luLXdpZi1oaXRzLWF0aC1hZnRlci0xMjAtd2Vla2x5LXN1cmdlLXBvc3NpYmxlLXJlYXNvbnMv0gFjaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL3NvbGFuYS1tZW1lLWNvaW4td2lmLWhpdHMtYXRoLWFmdGVyLTEyMC13ZWVrbHktc3VyZ2UtcG9zc2libGUtcmVhc29ucy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Solana Meme Coin WIF Hits ATH After 120% Weekly Surge: Possible Reasons - CryptoPotato",
        "content": "TL;DR\n\nDogwifhat (WIF) surged to an all-time high following listings on major cryptocurrency exchanges.\n\nWIF’s market cap exceeded $450 million, approaching the top 100 cryptocurrencies.\n\nThe recently-emerged Solana-based meme coin – dogwifhat (WIF) – experienced another impressive rally today (January 18), surging to an all-time high price of over $0.45 (per CoinGecko’s data). It has been among the market’s top performers lately, skyrocketing by 120% on a weekly scale and 250% in the past 30 days.\n\nThe reason for the most latest increase is likely in the fact that Binance added support to the token, launching WIF/USDT perpetual contracts.\n\nThe company’s offering has the multi-assets mode activated, meaning users can employ a variety of cryptocurrencies, such as Bitcoin (BTC), as a margin.\n\nWIF’s market capitalization spiked above the $450 million mark, while PEPE (the fourth-largest meme coin) has around $505 million. The latter has been on a downfall as of late, meaning the Solana meme coin could claim its position in the future should its upswing continue.\n\nIts latest increase could also be attributed to the involvement of several leading cryptocurrency exchanges. As CryptoPotato reported earlier this week, BitMEX listed the perpetual swap contract WIF/USDT.\n\nWIF is $250 million away from entering the list of the top 100 largest cryptocurrencies. PancakeSwap (CAKE) is currently on the 100th spot with a market cap of $707 million.\n\nThe meme coin’s rally coincides with the resurgence of Solana (SOL). The latter is up 3% on a 24-hour basis, surpassing the $100 mark once again."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8xOC9zb2xhbmEtbGFicy1raWNrcy1vZmYtcHJlLW9yZGVycy1mb3ItbmV3LXNtYXJ0cGhvbmUtd2Vla3MtYWZ0ZXItZmlyc3QtZWRpdGlvbi1vZi10aGUtd2ViMy1kZXZpY2Utc29sZC1vdXQv0gGPAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDI0LzAxLzE4L3NvbGFuYS1sYWJzLWtpY2tzLW9mZi1wcmUtb3JkZXJzLWZvci1uZXctc21hcnRwaG9uZS13ZWVrcy1hZnRlci1maXJzdC1lZGl0aW9uLW9mLXRoZS13ZWIzLWRldmljZS1zb2xkLW91dC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Solana Labs Kicks Off Pre-Orders for New Smartphone Weeks After First Edition of the web3 Device Sold Out - The Daily Hodl",
        "content": "Solana (SOL) Labs is kicking off pre-orders for the new version of its crypto-focused smartphone weeks after the first edition sold out in a frenzy.\n\nSolana Mobile is offering customers a “Founder Window” to deposit $450 for the upcoming “Chapter 2” phone, which the project says is expected to ship in the first half of 2025.\n\nSolana Mobile says “the goal” is for the $450 deposit to cover the full price of the phone, excluding taxes, shipping and fees.\n\nThe company’s goal target is to hit 100,000 pre-orders. Solana Mobile says they may not proceed with the release of the phone if that target isn’t met, and the company will refund deposits if that happens.\n\nThe Ethereum (ETH) challenger started shipping the first version of its smartphone, Saga, in April.\n\nIn December, Solana Mobile announced that its web3-enabled phones had sold out. One possible contributing factor to the sales: buying a Saga came with a reward of free Bonk (BONK), a Solana-based Dogecoin (DOGE) competitor, according to the project’s website.\n\nDecentralized finance (DeFi) crypto wallet Phantom indicated the size of the reward was 30 million BONK, a trove that was worth up to $630 in December as the memecoin surged in price. The Saga’s price was reduced to $599 in August.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on X Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyNC8wMS8xOC90b3AtY3J5cHRvLXRyYWRlci1zYXlzLWV0aGVyZXVtLWNoYWxsZW5nZXItc29sYW5hLWdlYXJpbmctdXAtZm9yLWEtZG91YmxlLWRpZ2l0LXJhbGx5LWhlcmUtYXJlLWhpcy10YXJnZXRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Top Crypto Trader Says Ethereum Challenger Solana Gearing Up for a Double-Digit Rally – Here Are His Targets - The Daily Hodl",
        "content": "A widely followed cryptocurrency analyst and trader is expressing bullish sentiment on Ethereum (ETH) competitor Solana (SOL).\n\nThe analyst pseudonymously known as Bluntz tells his 237,000 followers on the social media platform X that Solana might soar more than 39% from its current value.\n\n“I think SOL might be gearing up for a leg up to $140-plus. This downtrend has been tested too many times now for me to consider bearish and can’t ignore the clear three-wave move down from the highs looking corrective. Looks like the past two-week range has been a base, send it.”\n\nBluntz practices the Elliott Wave theory, a technical analysis approach that attempts to predict future price action that tends to manifest in waves. According to the theory, a bullish asset goes through a five-wave rise followed by an ABC corrective move before starting its next leg up.\n\nLooking at the trader’s chart, he seems to predict that Solana will ignite a new five-wave surge after completing an ABC correction.\n\nSolana is trading for $100.62 at time of writing, up nearly 4% in the last 24 hours.\n\nNext up, the trader says memecoin dogwifhat (WIF) is set up for a breakout after a period of price consolidation around the $0.33 level.\n\n“Very healthy consolidation range beneath prior ATH (all-time high) on WIF. You better believe once we get out of this range it’s going to full send.”\n\nWIF is trading for $0.42 at time of writing, up more than 59% in the last 24 hours.\n\nThe trader also believes that decentralized exchange (DEX) project Maverick Protocol (MAV) is undergoing a massive rally after breaking out of an ascending channel.\n\n“Now that is a monster daily MAV breakout. We’ve entered the parabola phase.”\n\nMAV is trading for $0.67 at time of writing, up more than 2% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nCheck Price Action\n\nFollow us on X, Facebook and Telegram\n\nSurf The Daily Hodl Mix\n\n\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any losses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvLm5ld3MvZnJhbmtsaW4tdGVtcGxldG9uLWV5ZXMtc29sYW5hLW5ldHdvcmstYS1wcmVsdWRlLXRvLWEtc29sYW5hLWV0Zi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Franklin Templeton eyes Solana network: A prelude to a Solana ETF? - crypto.news",
        "content": "Franklin Templeton, a trillion-dollar asset management firm, has recently expressed its support for the Solana network, leading to speculation about the possibility of a future Solana exchange-traded fund (ETF).\n\nSolana (SOL) is increasingly attracting attention from leading investment firms, with Franklin Templeton being the latest to express support. Founded in 1947, Franklin Templeton praised Solana’s protocol co-founder Anatoly Yakovenko’s vision on X on Jan. 17.\n\nOn Solana, we see Anatoly’s vision of a single atomic state machine as a powerful use case of decentralized blockchains, lowering information asymmetry. And we are impressed by all the activity seen on Solana in Q4 2023\n\n-DePIN\n\n-DeFi\n\n-Meme coins\n\n-NFT innovation\n\n-Firedancer — Franklin Templeton (@FTI_US) January 17, 2024\n\nFranklin Templeton highlighted the potential of Yakovenko’s concept of a single atomic state machine in decentralized blockchains, which could reduce information asymmetry.\n\nFranklin Templeton also pointed to several areas of growth within the Solana network, including decentralized finance (defi), infrastructure networks, and nonfungible token (NFT) innovations.\n\nThe recent rise of the Dogwifhat (WIF) memecoin on Solana was playfully acknowledged by the firm, suggesting a potential change in their profile picture on X to feature Benjamin Franklin wearing a knitted hat, referencing this new coin.\n\nYou are unsure how to feel about Laser Eye Ben? Just think instead of Ben wif hat — Franklin Templeton (@FTI_US) January 17, 2024\n\nApart from its known prowess in defi and NFT sectors, Solana has been instrumental in developments such as DePIN and Firedancer. DePIN aims to manage vital physical resources, finding applications in sectors like energy. Meanwhile, Firedancer, a third-party validator client, seeks to enhance transaction processing and overall efficiency on the Solana blockchain.\n\nYou might also like: Solana price set for $150 rally as SOL staking spikes $450m\n\nWhile Franklin Templeton acknowledged other platforms such as Ethereum, Bitcoin Ordinals, BTC-based layer 2s, and various other Layer 1 networks, its digital assets team seemed particularly inclined towards Solana.\n\nThe focus Franklin Templeton gave to Solana led numerous cryptocurrency enthusiasts on X to voice their anticipation that the asset management firm might consider releasing a Solana ETF in the future.\n\nMeanwhile, a post from Bitcoin proponent “Lex” suggested the possibility of a Solana-based ETF being introduced shortly.\n\nSEC will never approve BTC ETF\n\n→ You are here ←\n\nSEC will never approve ETH ETF\n\nSEC will never approve SOL ETF — lex (@mskvsk) January 12, 2024\n\nFollowing the launch of spot Bitcoin ETFs on Jan. 11, there’s an industry-wide expectation for other crypto assets, including Ether and XRP, to feature in United States spot crypto ETFs.\n\nAnalysts predict that the U.S. Securities and Exchange Commission will make a final decision on several pending spot Ether ETFs around May.\n\nWhile Franklin Templeton has not filed for a spot Ether ETF, it has expressed enthusiasm for Ethereum and its ecosystem, acknowledging recent challenges but foreseeing a bright future.\n\nWe are excited about ETH and its ecosystem. Despite the midlife crisis it's recently experienced, we see a bright future with many strong tailwinds to push the Ethereum ecosystem forward\n\n-EIP 4844\n\n-Alt DA\n\n-Community Revitalization\n\n-Restaking — Franklin Templeton (@FTI_US) January 17, 2024\n\nThe firm is particularly interested in developments like Protodank Sharding via EIP-4844 and restaking, which involve adding cheaper data to blocks and recycling staked Ether for fees and rewards, respectively.\n\nThe firm is also keeping an eye on other layer-1 blockchains, which they believe have significant potential, though specific networks were not mentioned."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyNC8wMS8xOC9zb2xhbmEtbW9iaWxlcy1zZWNvbmQtcGhvbmUtYW5ub3VuY2VtZW50LWRyaXZlcy1idXlpbmctZnJlbnp5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 Jan 2024 08:00:00 GMT",
        "title": "Buying frenzy for Solana Mobile’s second phone drives preorders sky-high - TechCrunch",
        "content": "Solana Mobile is swinging for the stars after it announced a second, cheaper web3 phone phone dubbed “ Chapter 2 ” earlier this week. While its first handset, Saga, sold out like a budding avalanche — slow at first, then all at once in the U.S. and European Union — its second device is selling out much faster to begin with.\n\nDemand for the Chapter 2 is apparently so high, Solana Mobile hit its seven-day sales goal within the first 24 hours, Raj Gokal, co-founder of Solana and president of Solana Labs, exclusively told TechCrunch.\n\nIn the first 24 hours after the phone was announced, Solana Mobile saw over 25,000 preorders, and by the 30-hour mark, it had 30,000 preorders, Gokal said. At those numbers, this new device has already eclipsed 12 months’ worth of sales of Solana’s first handset, Saga.\n\nThe new phone will have similar features as its predecessor: It’s based on Android, has a built-in crypto wallet, a Seed Vault and a “dApp store” for decentralized crypto applications. It is initially being offered at $450, less than the $599 the Saga is sold for. Chapter 2 will ship in the first half of 2025, a Solana spokesperson said.\n\n“For developers, Solana Mobile is creating a massive opportunity for crypto app teams looking to incentivize their users,” Gokal said. “It gives them a concentrated distribution channel to die-hard, dedicated users. It allows them to do this without any prohibitive app store fees.”\n\nGokal added that the device represents what’s possible with crypto, providing value in incentivizing apps to users.\n\nSaga’s climb\n\nSolana’s first smartphone didn’t see much demand when it was first launched in mid-2023 for $1,000. But the company soon lowered the price to $599 in light of weak demand. YouTuber Marques Brownlee even called Saga the “worst new phone of 2023” and said it was a “bust.”\n\nInitially, it seemed the lackluster sales were because the phone went unnoticed in the crowded smartphone market. But the crypto-savvy crowd’s ears perked up when dog-focused memecoin BONK’s decentralized application (dApp) announced that it was providing 30 million BONK tokens to Saga owners for free. The Saga then sold out almost overnight.\n\nhttps://techcrunch.com/2023/12/21/dog-themed-memecoins-are-pawing-their-way-back-into-investors-hearts/\n\nAt the time, 30 million BONK tokens were worth more than the cost of the phone, so users basically got the device (or the tokens, depending on how you look at it) for free. Before then, Saga owners received other crypto rewards, like the mint for the Claynosaurz NFT collection, but those promotions didn’t garner as much attention. Following the BONK hype, though, other dApps began offering similar rewards, which resulted in even more people wanting to buy the phone to get their hands on its offered value.\n\n“As the market rebounded in Q4 of last year, the Saga sold out, with the large majority of those sales taking place over just two days in December,” Gokal said. “Since then, we’ve been inundated daily with thousands of requests for more.”\n\nNow Solana is hoping to re-create the same magic with Chapter 2. The Saga genesis token, the non-transferrable NFT that came with every Saga and helped owners redeem rewards, will not be available to owners of the new devices, but the company plans on “building on this experience in Chapter 2,” according to its FAQ.\n\n“Giving back to the community has a snowball effect: As more developers start releasing crypto-incentivized apps to Solana Mobile users, we’ll see even greater adoption,” Gokal said. The Chapter 2 has launched with sponsors, including Backpack, Tensor, Phantom, Solflare, Magic Eden and Drip, which plan to reward owners, he added.\n\n“Chapter 2 is focused on wider distribution, greater accessibility, and uses learnings from the last two years to enable greater flexibility for developers and users,” Gokal said.\n\nThe new device has “been in the works” for over a year, Gokal said, as the company wanted to give “complete freedom for crypto developers and users,” by having no restrictions on tokens or NFTs, and no prohibitive fees."
    }
]