[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb2xhbmEtYmFzZWQtZ2FtZXN0b3AtbWVtZS1jb2luLTIwNDgyNzg2MS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Solana-based GameStop meme coin gains traction after retailer pulls plug on crypto - Yahoo Finance",
        "content": "A Solana-based meme coin inspired by GameStop’s GME shares has surged to over US$31 million in market capitalization in just three days.\n\nThe new cryptocurrency, which also has the GME ticker, rose by more than 285% in the past 24 hours, echoing GameStop’s headline-making stock market saga.\n\nIn January 2021, GameStop experienced a dramatic stock surge due to a short squeeze largely driven by users of the Reddit forum r/wallstreetbets, inflicting heavy losses on hedge funds and short sellers.\n\nThis event also impacted other heavily shorted stocks and cryptocurrencies. Users of subreddits r/SatoshiStreetBets tried to recreate the GME price pump with Dogecoin.\n\nAs reported by Decrypt, GameStop announced earlier this month that it will be closing its non-fungible tokens (NFT) marketplace on Feb. 2, citing regulatory uncertainty. The company had previously discontinued its crypto wallet service for the same reason.\n\nHowever, it appears the NFT market has been in the middle of a resurgence, CryptoSlam data suggests.\n\nLast December, global NFT sales topped US$1.77 billion, the highest since recording nearly US$3.4 billion in May 2022. NFT sales is on pace to cross US$1 billion for the second straight month, the first time it has done so since last February."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb2xhbmEtYmFzZWQtZ2FtZXN0b3AtbWVtZS1jb2luLTIwNDgyNzg2MS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Solana-based GameStop meme coin gains traction after retailer pulls plug on crypto - Yahoo Finance",
        "content": "A Solana-based meme coin inspired by GameStop’s GME shares has surged to over US$31 million in market capitalization in just three days.\n\nThe new cryptocurrency, which also has the GME ticker, rose by more than 285% in the past 24 hours, echoing GameStop’s headline-making stock market saga.\n\nIn January 2021, GameStop experienced a dramatic stock surge due to a short squeeze largely driven by users of the Reddit forum r/wallstreetbets, inflicting heavy losses on hedge funds and short sellers.\n\nThis event also impacted other heavily shorted stocks and cryptocurrencies. Users of subreddits r/SatoshiStreetBets tried to recreate the GME price pump with Dogecoin.\n\nAs reported by Decrypt, GameStop announced earlier this month that it will be closing its non-fungible tokens (NFT) marketplace on Feb. 2, citing regulatory uncertainty. The company had previously discontinued its crypto wallet service for the same reason.\n\nHowever, it appears the NFT market has been in the middle of a resurgence, CryptoSlam data suggests.\n\nLast December, global NFT sales topped US$1.77 billion, the highest since recording nearly US$3.4 billion in May 2022. NFT sales is on pace to cross US$1 billion for the second straight month, the first time it has done so since last February."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbmdhcGUuY29tLzUtcmVhc29ucy13aHktc29sYW5hLXNvbC1wcmljZS1za3lyb2NrZXRpbmctZGFpbHkv0gFLaHR0cHM6Ly9jb2luZ2FwZS5jb20vNS1yZWFzb25zLXdoeS1zb2xhbmEtc29sLXByaWNlLXNreXJvY2tldGluZy1kYWlseS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "5 Reasons Why Solana (SOL) Price Skyrocketing Daily - CoinGape",
        "content": "Solana bulls are back in the spotlight, aided by the strong technical edge and new projects building on the Solana blockchain, spearheading the recent crypto market recovery. Solana (SOL) price surpassed $100 psychological level backed by strong uplift in trading volume, with analysts predicting a move to $150. Here are 5 reasons behind Solana price rally.\n\nKey Reasons Behind Solana Price Rally\n\nSolana-Based Projects In Demand\n\nSolana-based projects are leading the crypto market recovery in multiple spaces including decentralized exchanges, lending protocols, staking, NFTs, and other areas.\n\nadvertisement\n\nFrom Lending protocols Solend, Marginfi, and Kamino, staking protocols Marinade Finance and Jito to NFTs such as Mad Lads and Tensorians are making waves in the crypto market despite spot Bitcoin ETF hype. Moreover, Helium and Render Network are also growing swiftly.\n\nJupiter DEX and Airdrops\n\nDEXs Jupiter, Orca, and Drift witnessing massive trading volumes. Jupiter even flipped the leaded Uniswap V3 in crypto trading volume amid WEN and JUP airdrops. The recent airdrops saw massive success, causing Solana flipping Ethereum on multiple fronts.\n\nJupiter co-founder Meow took to X on January 29 to reveal that they will conduct airdrops every year, starting the process every November and run until January. However, recent participants will not be included in the coming round of airdrops.\n\nSolana Roadmap For 2024\n\nWhile peers are looking for layer-2 for growth, Solana’s co-founder Anatoly Yakovenko prioritizes commitment to Layer 1 scaling for unparalleled blockchain efficiency and innovation.\n\nMoreover, developers in the Solana ecosystem can anticipate groundbreaking enhancements, from token extensions to institutional support, promising a year of innovation and growth. Solana’s ground-up rebuild of the validator client Firedancer has promised to optimize networking, runtime, and consensus components.\n\nSuccess of Solana Saga Mobile\n\nAfter the success of Saga smartphone, Solana Mobile has announced plans to unveil Saga Chapter 2. The successor to Saga will have new hardware and be cheaper in terms of price.\n\nThe recent BONK airdrop hype caused a massive buying of Saga smartphone, causing it to go out of stock. People flock into BONK airdrop as price rallied over 3000% in a month.\n\nSOL Price Breaks Multiple Support\n\nPopular crypto analyst Ali Martinez predicted Solana price to hit $113 as it seems to break above the descending channel. Michael van de Poppe also gave bullish outlook on Solana, saying “It’s ready for upward continuation.” He predicts SOL price to continue moving higher towards $140 as a higher timeframe support test at $80 provided support.\n\nSOL price has soared 7% in the past 24 hours, with the price currently trading at $104.77. The 24-hour low and high are $95.68 and $104.43, respectively. Furthermore, the trading volume has increased by 40% in the last 24 hours, indicating a rise in interest among traders.\n\nAlso Read:"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjQvMDEvMzAvc29sYW5hLWFuemEtbmV3LWxlZ2FsLWVudGl0eS10aGlyZC1vZi1lbXBsb3llZXMtZGVjZW50cmFsaXphdGlvbi10aGVhdGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Drama at Solana: Creation of new corporate entity raises questions of 'decentralization theater' - Fortune",
        "content": "Decentralization is the North Star of the crypto industry—an ideal that requires blockchains beyond the control of any single central actor. In response, savvy companies have developed tactics to show they are not pulling the strings of a given blockchain, but, if those tactics are unconvincing, critics are quick to pan them as “decentralization theater.” On Tuesday, the team behind one of the largest blockchain networks, Solana, became the latest to engage in a corporate shuffle potentially aimed at deflecting claims of centralization—and it’s not clear if the effort will work.\n\nThe shuffle is taking place at Solana Labs, one of two legal entities tied to the blockchain where around 45 employees are moving to a new entity called Anza to help further “decentralize” Solana’s ecosystem, maintain and improve the blockchain’s existing infrastructure, and develop other applications and products. “Now’s the right time for us to figure out how to build a standalone business,” Jeff Washington, an Anza cofounder and former engineer at Solana Labs, told Fortune.\n\nAccording to a spokesperson, about half of Solana Labs’ staff of 100 have moved to Anza, named after a desert located about 60 miles from the California town of Solana Beach.\n\nThe legal reshuffling follows more than a year of scrutiny from both regulators and crypto industry onlookers, and after Solana recovers from a series of controversies that saw its SOL token plummet in value. Those include the November 2022 bankruptcy of FTX, whose founder Sam Bankman-Fried was once one of Solana’s biggest boosters, and allegations by the Securities and Exchange Commission that SOL is an unregistered security. More recently, the cryptocurrency has seen a huge upswing on the back of a broader crypto resurgence.\n\nWhen asked whether the creation of a new legal entity has anything to do with increased legal scrutiny on the blockchain over the past year, spokespeople for Solana Labs were adamant that the spinoff was part of a broader strategic plan. \"This is not smoke and mirrors,\" said one.\n\n'Just a coincidence'\n\nConversations surrounding Anza began in earnest since the first half of 2022, according to Jed Halfon, the former head of strategy and former general consul at Solana Labs. Now Anza's chief strategy officer, he told Fortune that the new company was a \"business opportunity to leverage the engineers that we have to start working on other major projects\" and also a way to make the Solana ecosystem more \"credibly neutral,\" or more decentralized.\n\nHowever, according to a person familiar with the matter, Halfon told employees in 2023 that the move was partly in response to the Coinbase and Binance lawsuits as well as also ongoing litigation with an investor in Solana, Mark Young, who alleged in a suit filed prior to the SEC's that SOL was an unregistered security.\n\nMoreover, Anza Technologies, Inc., the legal name of the entity, was established June 20 in Delaware, per incorporation filings, a little more than two weeks after the SEC argued that SOL was as an unregistered security. A Solana Labs spokesperson said the timing was \"just a coincidence.\"\n\nThat same person familiar with the matter, who spoke on the condition of anonymity, told Fortune that it took the Solana team more than six months after incorporation to launch Anza because Labs was wrangling with details over token vesting. As with equity vesting, employees are rewarded with SOL tokens the longer they work for the firm. All employees at Solana Labs are on a three-year vesting schedule, said the person familiar, with no tokens for the first year, a third of the tokens received at the beginning of the second year, and the last trove distributed quarterly over two years. If employees were to leave, they could potentially be leaving millions of dollars in SOL on the table. Fortune viewed a photo of the token clause in the employee contract to corroborate the source.\n\nHalfon denied that this was a hinderance and said that the structure of token vesting at Solana Labs mirrors similar clauses at other crypto companies. \"It didn't really delay anything,\" he said.\n\nAnza's current war chest comes from a grant from the Solana Foundation, according to Washington, also the CEO of Anza. He said that the new entity is an \"employee-owned, for-profit\" business but declined to provide more details on its structure or the size of the grant. Halfon said that Solana cofounders Anatoly Yakovenko and Raj Gokal have no stake in the business and Solana Labs owned 13% of the firm. In addition to Washington and Halfon, Stephen Akridge, a Solana cofounder, and Amber Christiansen, Labs' former head of operations, are also moving to the new engineering outfit.\n\nDecentralization or 'smoke and mirrors?'\n\nLegal experts told Fortune that Solana's move to split off half of its employees at Labs into a new entity may be a workable strategy for showing how, currently, SOL is not a security and therefore not subject to a raft of SEC regulations.\n\n“However, if the SEC were to bring an enforcement action involving SOL, in prosecuting its case, it would likely focus on the initial launch of token and its early years,\" Philip Moustakis, a securities lawyer at Seward & Kissel who represents clients in crypto-related SEC investigations, told Fortune.\n\nHalfon is aware of this, according to the person familiar, telling employees that potential jurors' approximation of the situation outweighs the perceptions of securities experts, since they're the ultimate arbiters of successful litigation. Halfon said he isn't able to \"comment on questions related to any internal legal discussions.\"\n\nA general counsel for the team behind a blockchain protocol, who declined to be named while talking about a competitor, told Fortune that the Solana team should be lauded for creating a legal structure that further decentralizes the management and maintenance of the network. Another lawyer for a blockchain firm, who declined to be named for the same reason, said that the formation of Anza falls into one category: \"decentralization slash protecting your ass.\"\n\nHalfon pushed back and said that these lawyers aren't briefed on the particularities of the Solana ecosystem. Moreover, he added, it's no surprise if they do disagree, given the \"regulatory uncertainty in the air in the industry.\" And when asked whether he thinks Anza is actually contributing to Solana's decentralization, he said: \"I think the answer is, most certainly, yes.\""
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvZGVmaS9qdXBpdGVyLXdlbi1haXJkcm9wLWludHJvZHVjZXMtbmV3LXNvbGFuYS1uZnQtc3RhbmRhcmQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 30 Jan 2024 08:00:00 GMT",
        "title": "Jupiter dev's WEN airdrop introduces new Solana NFT standard - DLNews",
        "content": "A version of this story appeared in our The Decentralised newsletter. Sign up here.\n\nGM, Tim here.\n\nHere’s what caught my DeFi-eye recently:\n\nExcitement over Jupiter’s token launch is reaching a fever pitch\n\nEuler Labs CEO finds his lost governance tokens\n\nCircle deploys USDC on another Ethereum layer 2\n\nJupiter dev whets appetites with WEN\n\nAfter a more than two-month wait, Jupiter is making the final preparations ahead of its token airdrop scheduled for January 31.\n\nAs the biggest decentralised exchange aggregator, not just on Solana, but in all of DeFi, the expectations for Jupiter’s airdrop are high.\n\nJupiter dev Ming Ng took the excitement to another level late last week when he and the Ovols team launched WEN — a so-called memecoin created using Solana’s new token extensions and launched through Jupiter’s LFG launchpad\n\nWEN was airdropped to over a million wallets — including active Jupiter users, several top NFT collection holders, and genesis Saga phone holders. The one trillion WEN tokens near-instantly rose to over a $100 million in total value.\n\nOn the surface, creating and airdropping WEN might seem like little more than another way to hype up Jupiter ahead of its token launch.\n\nJoin the community to get our latest stories and updates\n\nBut under the hood, WEN acts as a proof of concept for the WEN New Standard — or WNS — a new, lightweight token standard for NFTs on Solana created by LFG. WEN is a WNS NFT fractionalised into one trillion fungible tokens.\n\nThe WEN launch also acted as a stress test for Jupiter’s infrastructure, its bot mitigation measures, and the Solana network as a whole.\n\nWhile WNS is the first Solana NFT standard built using the 13 new token extensions the blockchain deployed last week, it almost certainly won’t be the last.\n\nWatch out for other Solana projects using the token standards to build new and innovative stuff in the future.\n\nEuler CEO recovers lost governance tokens\n\nEuler Labs CEO Michael Bentley told DL News that he has recovered the $3.8 million worth of governance tokens he said he had lost at the start of the month.\n\nOn January 10, DL News managing editor Ekin Genç reported that Bentley had lost access to his EUL tokens after a losing the private key to the wallet where they were stored.\n\nBentley’s approximately 1.2 million EUL tokens were lost, representing 4.4% of the total token supply.\n\nIn September 2022, when the token’s price peaked at $12.78, his holdings would have been worth about $15 million.\n\nAfter the Euler protocol suffered a $200 million hack in March, many assumed it would wind down, even after it was able to recover the stolen funds.\n\nBut Bentley and Euler Labs have carried on. In January, they announced a new DeFi primitive called the Ethereum Vault Connector, which lets lending protocol smart contracts communicate with each other.The promise of future Euler launches has helped EUL rally over 159% from its 2023 lows.\n\nCelo gets native USDC\n\nEthereum layer 2 Celo has just become the latest blockchain to get a native USDC deployment. It’s the 16th blockchain Circle has launched USDC on.\n\n🗞️ Welcome @Circle to the Celo ecosystem! 🤝\n\n\n\nNative USDC is deploying on Celo to further everyday adoption of digital currencies & assets\n\n\n\nWhat does this mean? 🧵👇 pic.twitter.com/aVP6vyBXvQ — Celo 🦇 🌳 (@Celo) January 30, 2024\n\nNative deployment means that Circle, the company behind USDC, has built the infrastructure for users to mint and redeem USDC directly on a specific blockchain. The benefit is that Circle now directly guarantees native USDC trading on Celo.\n\nNot all USDC trading on blockchains is deployed natively. Some blockchains use bridged versions of USDC. These work by letting users lock up native USDC on a different blockchain, then issuing a placeholder token on a destination chain.\n\nWhile such bridges are convenient — it’s often faster to build bridges instead of waiting for Circle to go through the process of deploying natively — they are much less secure.\n\nBecause these kind of token bridges hold user’s USDC deposits, often in multi-signature wallets, they are susceptible to hacks and exploits.\n\nPrevious hacks at the Ronin bridge, Muiltichain, and several others highlight the risks of such bridges.\n\nAs Circle deploys USDC natively on more chains it will boost interoperability in DeFi and make blockchain ecosystems more secure.\n\nBut for Circle, which is planning to IPO in the US later this year, it needs to make sure it doesn’t fall foul of regulations doing so.\n\nData of the week\n\nSolana activity is rising again in the lead-up to Jupiter’s token launch.\n\nActive wallets and new token deployments saw the most prominent spikes, but other metrics, such as transaction count and network fees, have also increased over the past week.\n\nWhile new tokens deployments have surpassed their December high, active wallets have yet to do so.\n\nSolana active wallets and new token deployments are spiking again. (Solscan)\n\nThis week in DeFi governance\n\nPROPOSAL: Cosmos wants to make asset issuance easier by onboarding Noble as a new consumer chain to the Cosmos Hub\n\nVOTE: Arbitrum votes on changes to its constitution and Security Council election process\n\nVOTE: Euler requests more funding for the Euler Foundation\n\nPost of the week\n\nUniswap founder Hayden Adams adds to the piling criticism of the points epidemic sweeping crypto.\n\ncan't believe the current industry meta is tokens but we removed the transfer function and track them in an offchain database — hayden.eth 🦄 (@haydenzadams) January 27, 2024\n\nWhat we’re watching\n\nDecided to look at the chain.\n\n\n\nThere has been a total of ~$120B of USDC transfers over the last week. >90% of that is by 9 accounts. Literally every single one of them are Phoenix market makers. Phoenix does not have a volume of $120B, this number is heavily inflated by creating… https://t.co/16CI6EXa6N — CherryWorm (@CarryWorm) January 26, 2024\n\nCherryWorm and several others have noticed that the stablecoin transfer volumes on Solana have skyrocketed in recent weeks.\n\nSolana-based decentralised exchange Phoenix confirmed to DL News that the increase in transfers is due to how trades are processed on the exchange.\n\nWhen market makers create and cancel orders on Phoenix, as they routinely do thousands of times a day, those unfulfilled trades technically count as transfers.\n\nThe situation has caused a lot of confusion among analysts, who interpreted the increased transfer volume as actual trading volume.\n\nGot a tip about DeFi? Reach out at tim@dlnews.com."
    }
]