[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ob25nLWtvbmctdmlydHVhbC1hc3NldC1jb25zb3J0aXVtLTA0Mjk0OTI4Mi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Hong Kong's Virtual Asset Consortium Adds Solana, Drops XRP in Top 5 Index - Yahoo Finance",
        "content": "Hong Kong’s Virtual Asset Consortium Adds Solana, Drops XRP in Top 5 Index\n\nThe Hong Kong Virtual Asset Consortium (HKVAC) has made some notable changes to its crypto indexes. In a recent statement, the HKVAC announced that Ripple's XRP has been removed from its top five global crypto index, making way for Solana to take its place. This move reflects Solana's impressive performance in recent months, which saw it surpass XRP in market capitalization.\n\nMeanwhile, Avalanche (AVAX) has secured a spot in the top 10 index, replacing Tron's (TRX) token. This change comes after AVAX experienced a surge in value while other cryptocurrencies struggled in December 2023. The HKVAC's global large crypto index has also undergone some changes, with the addition of Internet Computer (ICP), Near Protocol (NEAR), Optimism (OP), Injective (INJ), and Immutable (IMX). These additions reflect the growing popularity and potential of these cryptocurrencies.\n\nThe HKVAC's index revisions aim to provide investors and analysts with accurate and up-to-date information on the evolving cryptocurrency market. These changes also align with Hong Kong's efforts to foster a supportive environment for the crypto industry.\n\nThe city's financial regulator has recently signaled its readiness to welcome spot crypto exchange-traded funds (ETFs), subject to certain regulatory requirements. This move indicates Hong Kong's commitment to embracing digital assets and promoting responsible innovation in the crypto space.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ob25nLWtvbmctdmlydHVhbC1hc3NldC1jb25zb3J0aXVtLTA0Mjk0OTI4Mi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Hong Kong's Virtual Asset Consortium Adds Solana, Drops XRP in Top 5 Index - Yahoo Finance",
        "content": "Hong Kong’s Virtual Asset Consortium Adds Solana, Drops XRP in Top 5 Index\n\nThe Hong Kong Virtual Asset Consortium (HKVAC) has made some notable changes to its crypto indexes. In a recent statement, the HKVAC announced that Ripple's XRP has been removed from its top five global crypto index, making way for Solana to take its place. This move reflects Solana's impressive performance in recent months, which saw it surpass XRP in market capitalization.\n\nMeanwhile, Avalanche (AVAX) has secured a spot in the top 10 index, replacing Tron's (TRX) token. This change comes after AVAX experienced a surge in value while other cryptocurrencies struggled in December 2023. The HKVAC's global large crypto index has also undergone some changes, with the addition of Internet Computer (ICP), Near Protocol (NEAR), Optimism (OP), Injective (INJ), and Immutable (IMX). These additions reflect the growing popularity and potential of these cryptocurrencies.\n\nThe HKVAC's index revisions aim to provide investors and analysts with accurate and up-to-date information on the evolving cryptocurrency market. These changes also align with Hong Kong's efforts to foster a supportive environment for the crypto industry.\n\nThe city's financial regulator has recently signaled its readiness to welcome spot crypto exchange-traded funds (ETFs), subject to certain regulatory requirements. This move indicates Hong Kong's commitment to embracing digital assets and promoting responsible innovation in the crypto space.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ob25nLWtvbmctdmlydHVhbC1hc3NldC1jb25zb3J0aXVtLTA0Mjk0OTI4Mi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Hong Kong's Virtual Asset Consortium Adds Solana, Drops XRP in Top 5 Index - Yahoo Finance",
        "content": "Hong Kong’s Virtual Asset Consortium Adds Solana, Drops XRP in Top 5 Index\n\nThe Hong Kong Virtual Asset Consortium (HKVAC) has made some notable changes to its crypto indexes. In a recent statement, the HKVAC announced that Ripple's XRP has been removed from its top five global crypto index, making way for Solana to take its place. This move reflects Solana's impressive performance in recent months, which saw it surpass XRP in market capitalization.\n\nMeanwhile, Avalanche (AVAX) has secured a spot in the top 10 index, replacing Tron's (TRX) token. This change comes after AVAX experienced a surge in value while other cryptocurrencies struggled in December 2023. The HKVAC's global large crypto index has also undergone some changes, with the addition of Internet Computer (ICP), Near Protocol (NEAR), Optimism (OP), Injective (INJ), and Immutable (IMX). These additions reflect the growing popularity and potential of these cryptocurrencies.\n\nThe HKVAC's index revisions aim to provide investors and analysts with accurate and up-to-date information on the evolving cryptocurrency market. These changes also align with Hong Kong's efforts to foster a supportive environment for the crypto industry.\n\nThe city's financial regulator has recently signaled its readiness to welcome spot crypto exchange-traded funds (ETFs), subject to certain regulatory requirements. This move indicates Hong Kong's commitment to embracing digital assets and promoting responsible innovation in the crypto space.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL292ZXItNGstc29sYW5hLXVzZXJzLWxvc3QtbW9yZS10aGFuLTRtLXRvLXBoaXNoaW5nLWF0dGFja3MtbGFzdC1tb250aC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Over 4k Solana users lost more than $4 million to phishing attacks last month - CryptoSlate",
        "content": "Phishing scammers have siphoned off over $4 million from Solana wallets in December 2023, according to estimates posted on X by Scam Sniffer, a scams tracker. The attacks affected around 4,000 users, according to the Scam Sniffer.\n\nThe stolen assets include those robbed by the rainbow attacker through an airdrop phishing attack. The scammers employed “anti-simluation techniques” that prevented wallets from reflecting changed balances.\n\nWhen unsuspecting victims tried to claim the airdrop fishing non-fungible tokens (NFTs), they signed malicious transactions allowing the attackers to drain their wallets. The airdrop phishing scammers stole $2.14 million from over 2,189 victims, according to Scam Sniffer.\n\nAnother notable scammer was the Solana node drainer, who victimized over 1,700 users and stole more than $2 million in less than two weeks. The node drainer used a Christmas phishing campaign to lure victims.\n\nAccording to Scam Sniffer, the Solana node drainer bagged over $1 million in profit by converting stolen USDC to Ethereum (ETH) using AllBridge.\n\nUnlike Ethereum, where most thefts happen due to approval issues, on Solana, the main phishing trick involves tricking people into making direct transfers. Solana does support transaction simulation, but some sneaky methods take advantage of anti-simulation measures and fake simulation results. This is done to confuse users and make them more likely to fall for malicious signature schemes.\n\nWhat is more concerning, however, is that the Solana blockchain does not have a NFT blacklist system that prevents malicious actors from displaying them. This means that the attackers can continue with their phishing campaigns without needing to deploy new fake NFTs to lure victims.\n\nInterestingly, these phishing attacks took place in the same month that Shakeeb Ahmed pleaded guilty to stealing $12 million by exploiting Solana decentralized finance (DeFi) applications in 2022. Ahmed’s guilty plea led to the first smart contract fraud conviction last month. Ahmed is scheduled to be sentenced in March 2024."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9zb2xhbmEtbWFya3MtY29uc2lzdGVudC1ncm93dGgtaW4tZGV2ZWxvcGVyLWVjb3N5c3RlbS1kYXRhL9IBWGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9zb2xhbmEtbWFya3MtY29uc2lzdGVudC1ncm93dGgtaW4tZGV2ZWxvcGVyLWVjb3N5c3RlbS1kYXRhLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 14 Jan 2024 08:00:00 GMT",
        "title": "Solana Marks Consistent Growth in Developer Ecosystem: Data - CryptoPotato",
        "content": "Solana’s native SOL token was one of the best-performing crypto assets in 2023. The developer ecosystem of the Layer 1 network also showed consistent growth during the same period.\n\nIn the same timeframe, the Solana ecosystem saw a notable increase in developer retention, jumping from 31% to more than 50% within a three-month timeframe. This improved retention was attributed to several factors, including advancements in developer onboarding, the growing appeal of the Solana blockchain among developers, and an increase in opportunities within the ecosystem.\n\nSolana Ecosystem Sees Surge in Developer Retention\n\nIn a recent report, the Solana Foundation revealed that the assessment of retention rates specifically targeted developers who consistently made at least one commitment over three consecutive months. Moreover, 400-500 Solana developers, having completed various boot camps, entered the ecosystem every six months, leading to a remarkable 500% growth in job listings over the year.\n\nAccording to GitHub data, the improved retention rate resulted in a steady monthly active developer count, fluctuating between 2,500 and 3,000 within the Solana ecosystem throughout 2023. The foundation said that progress in tooling for various programming languages and the introduction of additional educational resources proved to help drive this positive trend.\n\nHowever, they also acknowledged potential areas for improvement, particularly in areas such as testing and debugging.\n\nDespite being relatively new, with the Solana mainnet beta going live in March 2020, the report also claimed that the Solana ecosystem has rapidly expanded to become the second-largest in terms of total monthly active developers.\n\n“This growth is due to many different factors and it is hard to pinpoint what led to the majority of developers joining. Since the launch of mainnet beta, the Solana Foundation has either run or funded a variety of initiatives with the core objective of growing the developer ecosystem.”\n\nIncreasing Popularity\n\nSolana had a rough start to the year due to its association with the FTX collapse, which dragged the value of the SOL token into a massive downward spiral. The asset grew by over 800% in the past year and strengthened its position as the fifth-largest crypto asset by market cap.\n\nThe Solana ecosystem saw an impressive recovery during the last months of 2023. Solana-related investment products also posted strong performance, attracting net inflows totaling $167 million, while Ethereum trailed behind with a comparatively modest $78 million.\n\nSolana’s searches on Google surpassed those for Ethereum in December, gaining the most popularity in Spain and the Philippines."
    }
]