[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LjEwbmV3cy5jb20vbmV3cy9sb2NhbC1uZXdzL3NvbGFuYS1iZWFjaC1hbmQtZW5jaW5pdGFzLWxhdW5jaC0zMi1taWxsaW9uLWJlYWNoLXJlc3RvcmF0aW9uLXByb2plY3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Solana Beach and Encinitas launch $32 million beach restoration project - ABC 10 News San Diego KGTV",
        "content": "SOLANA BEACH, Calif. (KGTV) — Crowds gathered at Fletcher Cove Sunday to watch as a large pipe sprayed sand along Solana Beach, with bulldozers spreading it around. This beach restoration project aims to combat years of erosion caused by storms and high tides.\n\n“I think it’s great. It needed to happen,\" said Eric Richey, an Encinitas resident. \"There has not been much beach for the locals or the tourists.”\n\n“This is to protect public safety, but also public infrastructure,” said Mayor Lesa Heebner of Solana Beach.\n\nBoth Solana Beach and Encinitas have secured $32 million in federal funding to replenish their shores. “Because of upstream development, we don’t have the normal natural sources of sand to nourish our beaches with more and more sand,\" she said.\n\nAccording to Heebner, crews will be working at Solana Beach for the next 45 to 60 days, transporting sand from the San Dieguito Lagoon to cover the entire length of the beach. Then the same replenishment efforts will extend to Encinitas.\n\nUpon completion, the shoreline is expected to double in size, reaching 150 feet, Heebner said.\n\n“I’m going to spend a lot more time here, that’s for sure,\" Richey said. \"There will be a lot more room for people. It was pretty crowded this summer.”\n\nThis beach replenishment initiative is part of a broader 50-year project to maintain the coastline. Crews will revisit Solana Beach every ten years and Encinitas every five years.\n\nWhile the construction at Fletcher Cove draws attention, the active site will be secured with barricades to ensure public safety. The project's next phase is set to progress northward to Cardiff."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vaG93LXNvbGFuYS1zdWktbWFkZS1nYWlucy1mcm9tLWV0aC1vdXRmbG93cy_SAUpodHRwczovL2VuZy5hbWJjcnlwdG8uY29tL2hvdy1zb2xhbmEtc3VpLW1hZGUtZ2FpbnMtZnJvbS1ldGgtb3V0Zmxvd3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "How Solana, Sui made gains from ETH outflows - AMBCrypto English",
        "content": "Solana and Sui take in Ethereum outflow.\n\nSUI and SOL have seen declines but flash different RSI signals.\n\nSolana [SOL] and Sui [SUI] have experienced significant inflows from Ethereum [ETH] over the past month, according to data from Wormhole. However, it raises the question of whether this has influenced the overall transaction volume on these networks.\n\nSui and Solana take in the Ethereum flow\n\nWormhole data showed that around $370 million in liquidity shifted away from Ethereum in the last month. Sui and Solana accounted for about 90% of this outflow.\n\nPresently, these two networks continue to dominate, with an Ethereum outflow totaling over $106.2 million. Sui received around $68 million, while Solana received approximately $27 million, making up a combined 89% of the outflow from Ethereum.\n\nAnalyzing the Sui and Solana volume\n\nA recent analysis of Sui’s volume on DefiLlama showed a significant uptick in the past few days. Examining the chart reveals that the volume witnessed in January surpassed that of the preceding three months.\n\nThe upward trend peaked on 13th January, reaching over 76 million, marking the highest point in months. As of this writing, the volume was around 44 million.\n\nNotably, Sui’s Total Value Locked (TVL), despite a recent dip from around $344 million to $322 million, remained at its historically highest level.\n\nConversely, Solana has experienced a shift in volume trends. While the network’s volume increased towards the end of the year, it has witnessed a recent decline. Presently, the volume is over $740 million, reflecting a decrease but still outpacing Sui’s volume.\n\nSOL and SUI post different price trends\n\nAnalyzing the daily price trend of Sui showed an uptrend that peaked around 15th January, reaching around $1.3 with a notable 9% increase.\n\nDuring this rise, the price entered the overbought zone, as evidenced by the Relative Strength Index (RSI). After this peak, the price experienced declines, causing the RSI to dip below 60.\n\nAt present, the price has decreased by nearly 5%, trading at around $1.1.\n\nRead Solana (SOL) Price Prediction 2023-24\n\nIn contrast, Solana has dipped below the neutral line on its RSI, reflecting a decline in the price over the past three days.\n\nAs of this writing, SOL was trading at around $92, marking a decrease of over 1% in its price."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FsdGNvaW4vYWF2ZS12My1yZWFkeS1zb2xhbmEtY3J1Y2lhbC12b3RlLXBhc3NlZC_SAU1odHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbHRjb2luL2FhdmUtdjMtcmVhZHktc29sYW5hLWNydWNpYWwtdm90ZS1wYXNzZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Aave V3 Ready For Solana After This Crucial Vote Passed - NewsBTC",
        "content": "The Aave community has overwhelmingly approved a proposal that will set the ball rolling for deploying Aave V3 on Solana, a smart contracts platform. The motion, put forward by the Neon Foundation and the Aave Chan Initiative (ACI), passed with a majority vote of 83% based on results posted on January 21.\n\nSolana Fast Rising, DeFi Ecosystem Active\n\nSolana has been rapidly expanding, with its native currency, SOL, emerging as one of the top performers in 2023. To put it in perspective, SOL prices exploded from about $10 in 2023 to around $125 by the end of the year.\n\nThis surge saw SOL reverse losses of November 2022 while concurrently catalyzing events on the blockchain, spurring various activities, including the expansion of decentralized finance (DeFi), non-fungible token (NFT), and meme coin activities.\n\nRelated Reading: Bitcoin Price Turns Red, Why BTC Could Tumble Below $40K\n\nOn the other hand, Aave has been expanding to multiple Ethereum Virtual Machine (EVM) compatible networks, emerging as one of the leading decentralized finance (DeFi) protocols. According to on-chain data from DeFiLlama on January 22, Aave manages over $6.9 billion worth of assets across ten chains. A big chunk, over 90%, comprises assets on Ethereum. Aave v3 has a total value locked (TVL) of $4.9 billion.\n\nAave V3 On Solana, What It Means\n\nThe TEMP CHECK proposers are keen on Aave v3 deploying on Solana, considering the blockchain’s rapid growth in the past year. They observe that the blockchain’s DeFi TVL and broad user base would likely benefit the lending and borrowing protocol, cementing its position as a market leader.\n\nIf Aave is deployed on Solana, the protocol will access the deep liquidity on the blockchain. At the same time, users will access Aave services more conveniently. Subsequently, the proposers reiterated this move will cement Aave’s position as the leading liquidity market on-chain. Moreover, it will likely open up new opportunities for collaboration between the Aave, Solana, and other Neon EVM communities.\n\nRelated Reading\n\nXRP Crash Fears Mount As Whale Dumps 26 Million Tokens – Details 4 months ago\n\nNeon EVM is a cross-chain bridge for users to transfer assets between Ethereum and other blockchains. Through this bridge, Aave v3 will go live on Solana without any major reconfiguration of the protocol’s codebase. Among the tokens that will be initially supported is SOL. Users will be free to borrow USDC, a stablecoin.\n\nThe passing of the TEMP CHECK also reflects Aave’s ambition to expand across multiple blockchains beyond EVM networks. So far, Aave has been deployed on various platforms, including layer-2s like Arbitrum and Base, Avalanche, and Ethereum’s sidechain, Polygon.\n\nFeature image from Canva, chart from TradingView"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2NpcmNsZS1zb2xhbmEtam9pbi1jcnlwdG8tY291bmNpbC1mb3ItaW5ub3ZhdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Crypto Hiring: Crypto Council for Innovation adds Circle and Solana, stocks up on policy hires - Blockworks",
        "content": "The Crypto Council for Innovation brought on two new policy-related hires this week while also announcing Circle and the Solana Foundation as new members.\n\nThe council is an industry alliance that is involved in the policy realm — from anti-money laundering (AML) rules in Europe to Coinbase’s ongoing feud with the US Securities and Exchange Commission. Circle and Solana join an alliance of firms that includes stalwarts like Andreessen Horowitz and Fidelity Digital Assets.\n\nThe Crypto Council for Innovation is based in Washington DC, according to Crunchbase.\n\nThe organization brought on Ryan Eagen as associate director of government affairs and Patrick Kirby as policy counsel. Eagen previously worked in the office of Senate Majority Leader Chuck Schumer. Kirby came from a government relations job at the law firm Dentons.\n\nRead more: EU comes to provisional agreement to expand AML to crypto\n\nThe policy and government affairs hires come as US crypto advocates score a win with spot bitcoin ETFs gaining SEC approval. It’s also a presidential election year, though crypto-focused GOP candidate Vivek Ramaswamy recently dropped out of the race.\n\nRead more: House Republicans offer rare praise to SEC after bitcoin ETF approval\n\n“As part of @crypto_council, the Foundation looks forward to collaborating on responsible innovation, advocating for sensible Web3 regulations, and advancing blockchain for social good,” the Solana Foundation wrote on X.\n\n“We are proud to join @crypto_council and share our perspective and commitment to responsible growth of open money,” Circle said.\n\nCompany behind Axie Infinity taps CFO\n\nEllen Gormley has been named the first chief financial officer of Sky Mavis, the blockchain game developer behind the popular title Axie Infinity.\n\nGormley has a track record in Web3, most recently serving as chief financial officer of DeFi platform Radix after spending four years at blockchain technology firm Bitfury.\n\n“My role is to ensure that Sky Mavis has the best financial framework for sustainable growth and leverage my experience to optimize operational efficiency,” Gormley said in a press release reviewed by Blockworks.\n\nSky Mavis survived a $625 million hack of the Ronin Bridge in 2022. It has continued to develop new games, releasing the card-battling game Apeiron in December. Despite the hack and woes with its tokenomics, Axie Infinity remains popular, seeing the most volume of any blockchain game over the past 30 days, according to DappRadar.\n\nOther notable hiring news\n\nThe 1inch DAO retained the Swiss consulting firm Storm Partners to protect 1inch’s members from personal legal liability for the DAO’s actions.\n\nTrident Digital, the firm being contracted to boost on-chain liquidity for PayPal’s stablecoin, hired Adam Oozeer to be its director of sales.\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vaW52ZXN0aW5naGF2ZW4uY29tL2NyeXB0by1ibG9ja2NoYWluL3NvbGFuYS1zb2wtYW5kLXRoZS1tYWdpY2FsLW51bWJlci04LWluLWl0cy1jaGFydC_SAWJodHRwczovL2ludmVzdGluZ2hhdmVuLmNvbS9jcnlwdG8tYmxvY2tjaGFpbi9zb2xhbmEtc29sLWFuZC10aGUtbWFnaWNhbC1udW1iZXItOC1pbi1pdHMtY2hhcnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 21 Jan 2024 08:00:00 GMT",
        "title": "Solana (SOL) and the Magical Number 8 in its Chart - Investing Haven",
        "content": "Crypto investing very often comes with excitement as a result of rising prices. Anxiety comes with falling prices. The recent uptrend in Solana has triggered a lot of fascination. Investors’ emotions typically start dominating their thinking, especially as they start focusing on Solana fundamentals are SOL’s long term price target.\n\nBeyond excitement, beyond bias, beyond emotion, there is a very powerful message available on Solana’s chart: the 88-day uptrend, coupled with an $88 surge, goes beyond mere numbers – it’s a harmonic time/price setup that deserves a closer look.\n\nSolana’s uptrend may result in bias\n\nAmidst the thrill of climbing values, investors can easily fall into the trap of biased thinking. The surge in excitement tends to create a loop where information sought aligns with bullish biases, overshadowing the critical need for a well-planned exit strategy.\n\nRelying too much on fundamentals is a typical result of a hot market.\n\nBe careful, bias creates bad decisions as explained in great detail in 7 Secrets of Successful Investing.\n\nSolana’s chart and our unbiased eye\n\nThis is where the chart comes in handy. While fundamentals are undeniably crucial, the chart provides a visual representation of market dynamics. It can help you by acting as an unbiased guide amid the emotions driven by wild price swings, in both directions.\n\nConsider this a nugget of investor wisdom: let the chart be your unbiased eye in the market storm. Charts, devoid of emotion, offer a realistic perspective, a visual representation of a market’s journey that can be overlooked in the excitement of rising values.\n\nApplying wisdom to Solana’s chart\n\nNow, let’s apply this wisdom to Solana’s recent performance. The 88-day upward trajectory is more than just a numerical curiosity; it’s a visual ‘harmony’ on the chart. Focusing on the chart reveals the magic number 8 on both the time and price axes, prompting us to ponder the broader implications beyond the bias of fundamentals.\n\nBelow is Solana’s daily chart, also featured in previously written articles like will the price of SOL rise in 2024 and SOL trending to $250.\n\nWhat matters is the grey box – 88 days of an uptrend resulted in price appreciation of $88. This is no coincidence. It certainly is no voodoo nor conspiracy. It’s plain and simple harmony, an harmonic set up.\n\nWhat this means? Very simple – a strong uptrend. This implies that the strong uptrend is over now, for now, trend completion. Solana requires a break which is healthy price action.\n\nNone of this will impact our long term targets by the way, but investors may look into other directions to find ‘the next Solana.’\n\nImplications for investors\n\nThinking beyond fundamentals is an important skill. It is a mental skill which requires training.\n\nThe chart, with its simplicity and clarity, acts as a complementary source of information, providing insights that might not be immediately apparent in traditional analyses. Understanding the interplay between fundamentals and chart patterns enables investors to make rational, hence profitable, decisions.\n\nLooking for ‘the next Solana?’ We may have found it. In our latest premium service alert, we tipped this one token that may go up 800% in 2024 – please read this alert (after signing up): This Cryptocurrency Can Rise 5x, Up to 8x, Provided ‘Narrative Effect’ Kicks In.\n\nReceive our crypto FREE newsletter alerts Download 50 crypto investing tips"
    }
]