[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmtwYnMub3JnL25ld3MvZW52aXJvbm1lbnQvMjAyNC8wMS8xMC93aW50ZXItc3Rvcm1zLWRlbGF5LXN0YXJ0LXRvLXNvbGFuYS1iZWFjaC1lbmNpbml0YXMtc2FuZC1yZXBsZW5pc2htZW50LXByb2plY3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Winter storms delay start to Solana Beach-Encinitas sand replenishment project - KPBS",
        "content": "In 2000, Solana Beach and Encinitas reached out to the Army Corps of Engineers for help with their eroding coastline.\n\nDecades of human development have interrupted the natural flow of sand onto the beaches there, causing a gradually shrinking coastline.\n\nIn Solana Beach, sand loss means that waves are encroaching on the bluffs, threatening homes and public infrastructure.\n\nAfter more than two decades of planning, environmental studies and the infusion of federal money, the sand replenishment project is now ready to start.\n\nSolana Beach Mayor Lesa Heebner said the project will prevent further erosion.\n\n\"It buffers the bluffs, and that's our thing. Our whole beach is basically lined with 60-, 70-, 80-foot tall bluffs,\" she said. \"It's different than the beaches in Del Mar and in Cardiff, in many places.”\n\nRep. Mike Levin, D-CA-49th, was instrumental in getting $30.5 million for the project, which also includes sand replenishment for Beacon’s Beach in Encinitas, from the Bipartisan Infrastructure Law passed two years ago.\n\n\"What I will tell you is that this wasn't easy securing these federal funds,\" he said at a Dec. 18 news conference in San Clemente. \"And what we will see is a 50-foot wide sandy beach or 50 feet additional sandy beach.”\n\nLevin also helped secure funding for the sand replenishment project in Orange County. The plan was for the Army Corps to finish the replenishment in San Clemente before starting the Solana Beach-Encinitas project, which was slated to begin mid-January.\n\nHowever, a succession of winter storms caused a delay in the San Clemente project.\n\n\"So because of the storm swells that we had over the holidays, we had to cease operations,\" said Doland Cheung, project manager for the Corps. \"It's not only a potential equipment issue, but it's also a safety issue as well for the operators.\"\n\nThat delay means the Solana Beach-Encinitas project will be delayed as well. Cheung estimates that the project there will start around the end of the month.\n\nIn preparation for the project, Solana Beach has already installed a pipeline at Fletcher Cove, which will bring the dredged sand onto the beach. The sand comes from the dredge off-shore at the mouth of the San Dieguito River.\n\nThe sand replenishment is a 50-year commitment for the Corps, which will replenish the sand several times.\n\n“We will do roughly eight additional renourishment events over those 50 years,\" Chueng said. \"The average cycle based upon our computer modeling is roughly about six years between renourishment cycles.”\n\nThe initial replenishment will add 700,000 cubic yards of sand in Solana Beach and 340,000 cubic yards in Encinitas."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzEwL3VwLTYwMC1vdmVyLXRoZS1wYXN0LXllYXItaXMtc29sYW5hLWEtYnV5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Up 500% Over the Past Year, Is Solana a Buy? - The Motley Fool",
        "content": "Solana skyrocketed in value last year, but did it go up too far, too fast?\n\nIn late December, Solana (SOL -0.70%) broke through the $100 mark for the first time in 18 months. At that point, the cryptocurrency was up nearly 10-fold for the year and seemingly out of nowhere had become one of the best-performing cryptocurrencies in the world.\n\nBut the new year has been a completely different story. While Solana is still up a staggering 500% during the past 12 months, it's gone nowhere since the start of 2024 and at one point was down as much as 20%. Is this just a case of profit-taking by investors who won big on Solana in 2023, or has something fundamentally changed?\n\nThe case for Solana\n\nOn the positive side, Solana's underlying blockchain fundamentals continue to show signs of improvement. The key here is to focus on \"on-chain\" activity, which tells you what's actually happening on the blockchain itself. The more activity, the better.\n\nIn this regard, Solana hasn't disappointed. Whether it's non-fungible token (NFT) sales volume or decentralized exchange trading volume, activity seems to be picking up across the board.\n\nThat's showing up in key metrics such as total value locked (TVL), which is a quick way to gauge the overall health of a blockchain. In 2023, TVL for Solana skyrocketed, and that led to a surge in positive investor sentiment. By the end of 2023, it wasn't just retail investors piling into Solana, but also institutional investors who liked what they saw. It was very easy to support the overall narrative of Solana being a faster, more cost-efficient blockchain than Ethereum (ETH 0.77%) with these improving metrics.\n\nCurrently, the ultimate bull case scenario calls for Solana to increase nearly 50-fold in value over the next 12 months. That's if you buy into the narrative that Solana really is an Ethereum killer and is capable of displacing Ethereum as the preeminent Layer 1 blockchain network. According to this narrative, there will be a huge migration of users and developers away from Ethereum and into Solana, triggering a gigantic surge of value creation.\n\nThe case against Solana\n\nThe problem, quite frankly, is that all of those improving numbers and metrics might be somewhat of a mirage. At the end of the year, there was a tremendous amount of speculation around meme coins trading on the Solana blockchain. Did all of that increase trading volume on Solana's decentralized exchanges? It was probably just the result of people moving in and out of a bunch of dog-themed meme coins like Bonk.\n\nIf there is a meme coin collapse, as now seems to be happening, these numbers could easily reverse. Just to give you an idea of how frenetic the trading in Solana meme coins was at the end of last year, people were going to great lengths to buy Solana's $599 Saga smartphone as part of an elaborate arbitrage opportunity.\n\nIf you bought the Saga phone, you received 30 million free Bonk meme coins. At some point, the value of the meme coins became vastly greater than the value of the phone itself. By the end of December, people were willing to pay more than $5,000 for a new phone on eBay, just to get access to those meme coins.\n\nWhat's even more concerning is that there are now a lot of questions being raised about potential security flaws in that Solana phone. Crypto analysts were sounding the alarm, and the security issue quickly became so hot that the co-founder of Solana had to make public statements about the overall security of the Solana blockchain ecosystem. That's not the way you want to begin a new year.\n\nIs Solana overheating?\n\nOver the long term, I remain bullish on Solana's prospects. That's due, in large part, to the possibility that Solana one day displaces Ethereum as the top Layer 1 blockchain network. If you look at Ethereum's current market cap ($275 billion) and compare it to Solana's current market cap ($43 billion), it's easy to see just how much value Solana might be able to unlock in the coming years.\n\nHowever, over the short term, I'm increasingly concerned that Solana has overheated. It's gone up too far, too fast, and that's resulted in a lot of speculators and momentum traders getting in on the action, all hoping to make a quick buck. Instead of feeding the frenzy around meme coins and smartphone arbitrage opportunities, Solana needs to get back to basics and build lasting value in the blockchain world."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb2xhbmEtbmV4dC1iaXRjb2luLTIxMDYwOTM4Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Is Solana the Next Bitcoin? - Yahoo Finance",
        "content": "Cryptocurrencies have long puzzled traditional stock analysts. How can an asset class with no earnings, dividends, or fundamental value be worth anything more than zero?\n\nYet here we are. Bitcoin (BTC-USD) is worth almost $1 trillion. $75 million worth of non-fungible tokens (NFTs) trade hands daily. Even “meme” coins are returning. Speculators are naturally drawn to rising prices, and their buying pressure often sends prices even higher, regardless of the fundamentals.\n\nToday, a new cryptocurrency has captured speculator interest. Since October, prices of Solana (SOL-USD) have risen from the $20 range to nearly $100, making it one of the best-performing large-cap cryptos on the market. The FTX scandal that plagued Solana is fading from the market’s collective memory, and the high-quality cryptocurrency continues to hold an impressive technological lead over rivals.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nCould Solana, therefore, become the next Bitcoin?\n\nSolana Prices: Using Technical Analysis\n\nTo answer this, I turn to technical analysis — the use of pricing and other data to determine investor sentiment.\n\nWe know from history that technical analysis can work in certain circumstances. Many high-risk moonshot companies (similarly with no earnings, dividends, or fundamental worth) follow predictable patterns that technical analysis strategies can exploit. And machine learning can also be used to sniff out patterns with startling efficiency. (In that particular study, I show how neural networks can pick out Bitcoin trades that return 25% on average!)\n\nFortunately, you don’t need a degree in data science to find patterns that work. You only need to know the tools and assets you’re working with.\n\nConsider Bitcoin, a coin that typically “breaks out” when investor interest is high, and then flatlines when it fades from headlines. Here, I’ll use a MACD Crossover Strategy — a technical strategy particularly good at finding “breakouts” while ignoring sideways movements.\n\nAs you might expect, the MACD strategy does exceptionally well on Bitcoin. Since 2013, the system has returned four times more than a buy-and-hold strategy, even without short positions. (The flat orange lines represent times where the strategy sells its Bitcoin and holds cash).\n\nThe same is true for Solana. Though the MACD system failed to capture all of Solana’s upside during the 2021 crypto craze, it was enough to outperform the buy-and-hold strategy over the long run. The MACD system would have sold Solana in December 2021 (represented by the flatlining orange line) and kept investors mostly on the sidelines to come out far ahead.\n\nStory continues\n\nWhat Does Technical Analysis Say About Solana Today?\n\nSince October, the MACD indicator has been decidedly bullish on Solana. The MACD line (blue) remains above zero, and the gap between the MACD line (blue) and signal line (red) remains greater than the 0.015 threshold. This gap is important to avoid sideways trading.\n\nThat tells us that markets remain bullish about Solana’s prospects. The cryptocurrency has only traded above its current level 31% of the time, once you adjust for prices. And history tells us that the MACD line is a strong predictor of future gains.\n\nHowever, astute readers will notice that the MACD “strength” has dropped off since peaking in December. Prices have begun to cool off in recent weeks. And using the same graph for Bitcoin shows that the world’s largest cryptocurrency has rebounded more strongly than its smaller rival.\n\nTogether, that tells us that markets believe Solana is still not Bitcoin. Bitcoin remains far ahead, both in consumer adoption and potential regulation, and its rising prices reflect that sentiment. If you had to buy just one crypto, it should probably be Bitcoin.\n\nWhat’s Next for Solana?\n\nHistory tells us that Solana remains a “buy” at current prices. The cryptocurrency’s strong fourth quarter means its MACD signal remains above zero. And investor interest remains high; traded volumes in the past week remain 7 times higher than the average in 2023.\n\nSolana saw a similar pattern emerge in September 2021, when the cryptocurrency’s MACD line dropped from 30 to 1.9 before accelerating back to 22. (Its price would rise from $164 to $220 during that reaccelerating period).\n\nBut even in 2021, Solana’s second surge was far smaller than its first. When asset prices are high, it takes far more fresh money to send values even higher.\n\nThis time around looks no different. Prices of Solana have already risen 5X since October, and Solana’s sagging MACD figure comes even as excitement over Bitcoin ETFs is rising.\n\nIn 2021, I recommended investors buy $500 of Dogecoin (DOGE-USD) to experience the meme mania firsthand. Prices of Dogecoin would eventually rise fivefold on extreme investor interest. This time around, however, I’m urging far more caution. Though the technicals suggest that Solana will grind higher, investors should still remember that it pays to wait for the best opportunities.\n\nOn the date of publication, Thomas Yeung did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nTom Yeung is a market analyst and portfolio manager of the Omnia Portfolio, the highest-tier subscription at InvestorPlace. He is the former editor of Tom Yeung’s Profit & Protection, a free e-letter about investing to profit in good times and protecting gains during the bad.\n\nMore From InvestorPlace\n\nThe post Is Solana the Next Bitcoin? appeared first on InvestorPlace."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb2xhbmEtbmV4dC1iaXRjb2luLTIxMDYwOTM4Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Is Solana the Next Bitcoin? - Yahoo Finance",
        "content": "Cryptocurrencies have long puzzled traditional stock analysts. How can an asset class with no earnings, dividends, or fundamental value be worth anything more than zero?\n\nYet here we are. Bitcoin (BTC-USD) is worth almost $1 trillion. $75 million worth of non-fungible tokens (NFTs) trade hands daily. Even “meme” coins are returning. Speculators are naturally drawn to rising prices, and their buying pressure often sends prices even higher, regardless of the fundamentals.\n\nToday, a new cryptocurrency has captured speculator interest. Since October, prices of Solana (SOL-USD) have risen from the $20 range to nearly $100, making it one of the best-performing large-cap cryptos on the market. The FTX scandal that plagued Solana is fading from the market’s collective memory, and the high-quality cryptocurrency continues to hold an impressive technological lead over rivals.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nCould Solana, therefore, become the next Bitcoin?\n\nSolana Prices: Using Technical Analysis\n\nTo answer this, I turn to technical analysis — the use of pricing and other data to determine investor sentiment.\n\nWe know from history that technical analysis can work in certain circumstances. Many high-risk moonshot companies (similarly with no earnings, dividends, or fundamental worth) follow predictable patterns that technical analysis strategies can exploit. And machine learning can also be used to sniff out patterns with startling efficiency. (In that particular study, I show how neural networks can pick out Bitcoin trades that return 25% on average!)\n\nFortunately, you don’t need a degree in data science to find patterns that work. You only need to know the tools and assets you’re working with.\n\nConsider Bitcoin, a coin that typically “breaks out” when investor interest is high, and then flatlines when it fades from headlines. Here, I’ll use a MACD Crossover Strategy — a technical strategy particularly good at finding “breakouts” while ignoring sideways movements.\n\nAs you might expect, the MACD strategy does exceptionally well on Bitcoin. Since 2013, the system has returned four times more than a buy-and-hold strategy, even without short positions. (The flat orange lines represent times where the strategy sells its Bitcoin and holds cash).\n\nThe same is true for Solana. Though the MACD system failed to capture all of Solana’s upside during the 2021 crypto craze, it was enough to outperform the buy-and-hold strategy over the long run. The MACD system would have sold Solana in December 2021 (represented by the flatlining orange line) and kept investors mostly on the sidelines to come out far ahead.\n\nStory continues\n\nWhat Does Technical Analysis Say About Solana Today?\n\nSince October, the MACD indicator has been decidedly bullish on Solana. The MACD line (blue) remains above zero, and the gap between the MACD line (blue) and signal line (red) remains greater than the 0.015 threshold. This gap is important to avoid sideways trading.\n\nThat tells us that markets remain bullish about Solana’s prospects. The cryptocurrency has only traded above its current level 31% of the time, once you adjust for prices. And history tells us that the MACD line is a strong predictor of future gains.\n\nHowever, astute readers will notice that the MACD “strength” has dropped off since peaking in December. Prices have begun to cool off in recent weeks. And using the same graph for Bitcoin shows that the world’s largest cryptocurrency has rebounded more strongly than its smaller rival.\n\nTogether, that tells us that markets believe Solana is still not Bitcoin. Bitcoin remains far ahead, both in consumer adoption and potential regulation, and its rising prices reflect that sentiment. If you had to buy just one crypto, it should probably be Bitcoin.\n\nWhat’s Next for Solana?\n\nHistory tells us that Solana remains a “buy” at current prices. The cryptocurrency’s strong fourth quarter means its MACD signal remains above zero. And investor interest remains high; traded volumes in the past week remain 7 times higher than the average in 2023.\n\nSolana saw a similar pattern emerge in September 2021, when the cryptocurrency’s MACD line dropped from 30 to 1.9 before accelerating back to 22. (Its price would rise from $164 to $220 during that reaccelerating period).\n\nBut even in 2021, Solana’s second surge was far smaller than its first. When asset prices are high, it takes far more fresh money to send values even higher.\n\nThis time around looks no different. Prices of Solana have already risen 5X since October, and Solana’s sagging MACD figure comes even as excitement over Bitcoin ETFs is rising.\n\nIn 2021, I recommended investors buy $500 of Dogecoin (DOGE-USD) to experience the meme mania firsthand. Prices of Dogecoin would eventually rise fivefold on extreme investor interest. This time around, however, I’m urging far more caution. Though the technicals suggest that Solana will grind higher, investors should still remember that it pays to wait for the best opportunities.\n\nOn the date of publication, Thomas Yeung did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nTom Yeung is a market analyst and portfolio manager of the Omnia Portfolio, the highest-tier subscription at InvestorPlace. He is the former editor of Tom Yeung’s Profit & Protection, a free e-letter about investing to profit in good times and protecting gains during the bad.\n\nMore From InvestorPlace\n\nThe post Is Solana the Next Bitcoin? appeared first on InvestorPlace."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zb2xhbmEtbmV4dC1iaXRjb2luLTIxMDYwOTM4Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 10 Jan 2024 08:00:00 GMT",
        "title": "Is Solana the Next Bitcoin? - Yahoo Finance",
        "content": "Cryptocurrencies have long puzzled traditional stock analysts. How can an asset class with no earnings, dividends, or fundamental value be worth anything more than zero?\n\nYet here we are. Bitcoin (BTC-USD) is worth almost $1 trillion. $75 million worth of non-fungible tokens (NFTs) trade hands daily. Even “meme” coins are returning. Speculators are naturally drawn to rising prices, and their buying pressure often sends prices even higher, regardless of the fundamentals.\n\nToday, a new cryptocurrency has captured speculator interest. Since October, prices of Solana (SOL-USD) have risen from the $20 range to nearly $100, making it one of the best-performing large-cap cryptos on the market. The FTX scandal that plagued Solana is fading from the market’s collective memory, and the high-quality cryptocurrency continues to hold an impressive technological lead over rivals.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nCould Solana, therefore, become the next Bitcoin?\n\nSolana Prices: Using Technical Analysis\n\nTo answer this, I turn to technical analysis — the use of pricing and other data to determine investor sentiment.\n\nWe know from history that technical analysis can work in certain circumstances. Many high-risk moonshot companies (similarly with no earnings, dividends, or fundamental worth) follow predictable patterns that technical analysis strategies can exploit. And machine learning can also be used to sniff out patterns with startling efficiency. (In that particular study, I show how neural networks can pick out Bitcoin trades that return 25% on average!)\n\nFortunately, you don’t need a degree in data science to find patterns that work. You only need to know the tools and assets you’re working with.\n\nConsider Bitcoin, a coin that typically “breaks out” when investor interest is high, and then flatlines when it fades from headlines. Here, I’ll use a MACD Crossover Strategy — a technical strategy particularly good at finding “breakouts” while ignoring sideways movements.\n\nAs you might expect, the MACD strategy does exceptionally well on Bitcoin. Since 2013, the system has returned four times more than a buy-and-hold strategy, even without short positions. (The flat orange lines represent times where the strategy sells its Bitcoin and holds cash).\n\nThe same is true for Solana. Though the MACD system failed to capture all of Solana’s upside during the 2021 crypto craze, it was enough to outperform the buy-and-hold strategy over the long run. The MACD system would have sold Solana in December 2021 (represented by the flatlining orange line) and kept investors mostly on the sidelines to come out far ahead.\n\nStory continues\n\nWhat Does Technical Analysis Say About Solana Today?\n\nSince October, the MACD indicator has been decidedly bullish on Solana. The MACD line (blue) remains above zero, and the gap between the MACD line (blue) and signal line (red) remains greater than the 0.015 threshold. This gap is important to avoid sideways trading.\n\nThat tells us that markets remain bullish about Solana’s prospects. The cryptocurrency has only traded above its current level 31% of the time, once you adjust for prices. And history tells us that the MACD line is a strong predictor of future gains.\n\nHowever, astute readers will notice that the MACD “strength” has dropped off since peaking in December. Prices have begun to cool off in recent weeks. And using the same graph for Bitcoin shows that the world’s largest cryptocurrency has rebounded more strongly than its smaller rival.\n\nTogether, that tells us that markets believe Solana is still not Bitcoin. Bitcoin remains far ahead, both in consumer adoption and potential regulation, and its rising prices reflect that sentiment. If you had to buy just one crypto, it should probably be Bitcoin.\n\nWhat’s Next for Solana?\n\nHistory tells us that Solana remains a “buy” at current prices. The cryptocurrency’s strong fourth quarter means its MACD signal remains above zero. And investor interest remains high; traded volumes in the past week remain 7 times higher than the average in 2023.\n\nSolana saw a similar pattern emerge in September 2021, when the cryptocurrency’s MACD line dropped from 30 to 1.9 before accelerating back to 22. (Its price would rise from $164 to $220 during that reaccelerating period).\n\nBut even in 2021, Solana’s second surge was far smaller than its first. When asset prices are high, it takes far more fresh money to send values even higher.\n\nThis time around looks no different. Prices of Solana have already risen 5X since October, and Solana’s sagging MACD figure comes even as excitement over Bitcoin ETFs is rising.\n\nIn 2021, I recommended investors buy $500 of Dogecoin (DOGE-USD) to experience the meme mania firsthand. Prices of Dogecoin would eventually rise fivefold on extreme investor interest. This time around, however, I’m urging far more caution. Though the technicals suggest that Solana will grind higher, investors should still remember that it pays to wait for the best opportunities.\n\nOn the date of publication, Thomas Yeung did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nTom Yeung is a market analyst and portfolio manager of the Omnia Portfolio, the highest-tier subscription at InvestorPlace. He is the former editor of Tom Yeung’s Profit & Protection, a free e-letter about investing to profit in good times and protecting gains during the bad.\n\nMore From InvestorPlace\n\nThe post Is Solana the Next Bitcoin? appeared first on InvestorPlace."
    }
]