[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LjEwbmV3cy5jb20vbmV3cy9sb2NhbC1uZXdzL25vcnRoLWNvdW50eS1uZXdzL2FmdGVyLTIwLXllYXJzLXNvbGFuYS1iZWFjaHMtc2FuZC1yZXBsZW5pc2htZW50LXByb2plY3QtYmVnaW5z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "After 20 years, Solana Beach's sand replenishment project begins - ABC 10 News San Diego KGTV",
        "content": "SOLANA BEACH, Calif. (KGTV) — After 20 years of waiting, Solana Beach is finally replenishing its beaches with some much-needed sand.\n\nFor residents in the area, that means they're going to see some construction and closures intermittently along the shore for the next two months.\n\nThe sand replenishment project is critical because Solana Beach has eroded significantly over the years. The project is going to expand the shores once again, which will protect the people living and working on the bluffs from the impacts of the ocean.\n\nWith the operation underway as of Wednesday morning, the beach access point at Fletcher's Cove will be closed for the next few days as crew work on part of the project. The park itself will still be open.\n\nThe project itself and how the operations work is fascinating.\n\nSolana Beach residents will notice a pipe structure out in the middle of the ocean. Underneath it is a pipe running straight down to the ocean floor, and then another pipe stretching out towards the beach.\n\nA dredge, or ship, will connect to the pipe structures and pump sand through it where it will funnel and spray sand onto the shores.\n\nBulldozers and other construction equipment will be flattening the piles of sand that's going to expand the width of the shores. Construction crews will have to close certain areas on the shoreline for the sand placement from 7 a.m.-7 p.m. daily until the project is done.\n\nSolana Beach Mayor Lesa Heebner said sand will be replenished for 7,200 feet, starting at the north point of the beach and running all the way to its south point.\n\nHeebner explained how the residents and businesses on the bluffs are going to benefit from the project.\n\n\"These bluffs are part of old sand dunes, and we've got infrastructure built on them,\" Heebner said. \"All the condominiums, we have our own marine safety center, community center, east of that is our utility line, a lot of public infrastructure that we need to protect with sand on the beach.\"\n\nHeebner said it will also protect Solana Beach's coast better against storms.\n\n\"It will help buffer the bluffs from damaging winds and rain and waves most importantly. We've been seeing a lot of bluff failures. So, this is designed so that we can actually have the sand take the wave action rather than the bluffs themselves,\" Heebner said.\n\nThe project has been in the works for 20 years, as the city has needed everything from conducting studies to votes of approval. The city has also partnered with Encinitas and the Army Corps on scheduling.\n\nA huge part of the operations was securing the dredge as it had to come down from San Clemente.\n\nHeebner said Congressman Mike Levin played an integral part in funding the project as sand is expensive. This project will cost $32 million, and it includes the costs to bring the dredge in from up north.\n\nThis project ultimately will build coastal resilience that will last for the next 50 years."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vc29sYW5hLXN0cnVnZ2xlcy10by1yZWFjaC0xMDAtd2lsbC1hYXZlLWNvbWUtdG8taXRzLXJlc2N1ZS_SAVlodHRwczovL2VuZy5hbWJjcnlwdG8uY29tL3NvbGFuYS1zdHJ1Z2dsZXMtdG8tcmVhY2gtMTAwLXdpbGwtYWF2ZS1jb21lLXRvLWl0cy1yZXNjdWUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Solana struggles to reach $100: Will Aave come to its rescue? - AMBCrypto English",
        "content": "Open Interest in SOL fell to $1.14 billion as the price remained below $100.\n\nAave will reportedly deploy its v3 on Solana.\n\nThe price of Solana [SOL] found it hard to retest $100 on the 15th of January, despite clearing the path when the year began. At press time, SOL changed hands at $97.85. This value represented a 3.60% decrease in the last seven days.\n\nLike the price action, the Open Interest (OI) of SOL has decreased as well. AMBCrypto checked out Coinglass’ data and discovered that the OI was $1.14 billion at press time.\n\nInterest in trading SOL falls\n\nThis was a significant decrease from what the OI was last Christmas. On the 25th of December 2023, the OI surged to $120.96 billion.\n\nThe increase, at the time, indicated a rise in open contracts connected to the token. But as of this writing, the decline in OI was a sign that longs are no more aggressive but now cautious. It was also an indication of a decrease in net open positions.\n\nWhen placed alongside the price action, the OI signaled a possible weakness for the SOL uptrend. However, there has been a notable development around Solana that could impact the cryptocurrency’s value. But this time, it involved Aave [AAVE].\n\nOn the 15th of January, the Aave community, through Neon Foundation, proposed the expansion of the lending and borrowing protocol to Solana.\n\nAave keeps tabs on SOL\n\nAccording to the proposal, Neon’s compatibility with the Solana blockchain could give Aave access to some of Solana’s liquidity. It suggested that Solana’s revival, coupled with Aave’s prominence in DeFi, could make a good combination.\n\nHowever, Aave noted that the proposal would not only involve SOL but,\n\n“Three collaterals (SOL, mSOL, jitoSOL 1) and one borrowable asset (USDC) with no isolated mode, e-mode enabled for correlated assets (SOL, mSOL, jitoSOL), conservative LTV and supply, borrow caps.”\n\nIf the Aave community approves the proposal, Solana’s adoption might increase. Also, if traction on the network increases, it is possible for the price to also follow.\n\nConsidering the Development Activity, AMBCrypto noticed that the metric rose to 10.18 on the 12th of January. This increase was proof that new features were being shipped out on Solana.\n\nHowever, the Development Activity, at press time, had decreased to 8.37.\n\nThis drop indicated that developers’ commitment to polishing the blockchain had decreased. Should the metric continue to drop, SOL’s price could also be affected.\n\nThis is because market players might deem the decrease as a sign that developers were not bullish on the project in the short term.\n\nHow much are 1,10,100 SOLs worth today?\n\nThis perception was also evident in the Weighted Sentiment. As of this writing, the Weighted Sentiment was in the negative region, at 0.261. Weighted Sentiment shows the positive/negative commentary around an asset.\n\nSo, the reading implied that the average market player was not bullish on Solana."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmRlbG1hcnRpbWVzLm5ldC9idXNpbmVzcy1zcG90bGlnaHQvc3RvcnkvMjAyNC0wMS0xNy9tYXNzYWdlLWNvbmNlcHRzLXRvLW9wZW4tbmV3LXNvbGFuYS1iZWFjaC1mYWNpbGl0eS1pbi1mZWJydWFyedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Massage Concepts to open new Solana Beach facility in February - Del Mar Times",
        "content": "Massage Concepts is expanding to Solana Beach in February, adding more convenience for its existing clients base and looking to attract more people from the local community with its wide array of services.\n\nThe new Solana Beach location follows an announcement last year that Massage Concepts was expanding its Del Mar Highlands Town Center location.\n\n“We have a lot of existing customers at the Del Mar location who come from Solana Beach, so that’s the ideal, perfect location for us,” said Anne Weitz, owner of Massage Concepts “It’s a beautiful community, so I think it fits our concept. We want people to incorporate wellness and massage into their basic health and wellness routines.”\n\nShe added that Massage Concepts outgrew its capacity at its longtime Del Mar Highlands Town Center location, and looked to Solana Beach because many clients come from there.\n\n“It’s going to look very similar to the Del Mar location,” Weitz said. The service will be the same too, with some of the company’s best therapists holding sessions in Solana Beach to help get started.\n\nWeitz and her staff have been busy furnishing the 10 rooms in the Solana Beach facility, where they will continue to fulfill the spa’s mission of providing high quality massages at affordable prices that meet the needs of all their clients.\n\nLike the Del Mar Highlands Town Center location, the Solana Beach facility will not be membership based, giving clients flexibility that many others don’t provide.\n\nMassage Concepts offers several popular services, including the Tech Buster Combo Massage, which was created to relieve muscle tension in the shoulders, arms and hands of clients who spend a lot of time on their computers or cell phones. The therapist spends the first part of the session on the client’s neck, shoulder, arms, wrist and hands. The second part of the session can be customized to be full body, targeted back pain or foot reflexology.\n\nMassage Concepts also offers Swedish, deep tissue, shiatsu, prenatal, sports, aromatherapy and other types of massage to meet the needs of its clientele. Popular add-ons include 10- or 15-minute stretching, 15- or 20-minute foot reflexology, and 15-minute scalp or neck massage.\n\n“I think we offer a wide range of services,” Weitz said. “We are confident we have something for everybody who is in need of healing or pain relief, relaxation.”\n\nThe sessions at Massage Concepts are also designed to fit into the busy lives of its clientele.\n\n“We offer mini sessions to help people who want to do self care but don’t have much time, we offer mini sessions that range from 30 minutes to 50 minutes, so in and out,” Weitz said. “And we have convenient, online booking. But they can also call or text us. That’s another feature that people like, they can text us to book with their favorite therapist.”\n\nPrepaid session and gift cards will be honored at both locations.\n\nMassage Concepts’ Solana Beach office will be located at 665 San Rodolfo Drive, Suite 125. For more information, call 858-399-1007 or email info@massageconcepts-sb.com.\n\nVisit massageconceptsdelmar.com and massageconceptsdelmar.com/solanabeach/ for more information on both locations.\n\n— Business Spotlight features enterprises that support this publication."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9oZXJlcy1tdWNoLXlvdWQtYm91Z2h0LXNvbGFuYS0yMzE2Mjg2OTQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Here's How Much You'd Have If You Bought Solana After The FTX Crash - Yahoo Finance",
        "content": "During the 2021 bull market, Solana saw incredible price gains. Going from $2 to an all-time high of $260 made many investors wealthy. When looking back at this run and attempting to pinpoint some of the causes, Sam Bankman-Fried's (SBF) name pops up.\n\nSBF was an advocate for Solana, creating projects, investing in the token and speaking about it publicly. Many believe that SBF's praise and use of Solana was a major contributor to its huge spike in 2021.\n\nSpecifically, SBF created a decentralized exchange (DEX) on the Solana blockchain called Serum. This project allowed users to trade and convert Solana and other tokens on a peer-to-peer exchange. SBF's success with centralized exchange FTX also contributed to Serum's success.\n\nDon't Miss:\n\nThis brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it ?\n\nThe last-standing top crypto exchange without a major security breach offers what now?\n\nHowever, SBF and FTX Trading Ltd. eventually came tumbling down. In early November 2022, FTX became insolvent. As the details became public, it was discovered that SBF was using customer funds for his proprietary trading firm Alameda Research.\n\nThis event was shattering for the crypto community, but Solana was hit particularly hard. Because SBF backed the project, many were hesitant to continue investing, and the price of SOL fell drastically. Within two months of FTX's insolvency, SOL had depreciated by 50%. By the end of 2022, the token was worth less than $10. While other tokens also lost value during this time, SOL's fall from grace was much larger than its peers.\n\nSolana had a strong recovery in 2023. Despite beginning the year at a two-year low, the price reached a new 52-week high of over $125. This recovery was largely because of a handful of new projects and airdrops on the platform. Most notable are the memecoin Bonk (BONK) and the staking platform Jito (JITO). These projects attracted new investors and spurred new interest in SOL.\n\nSOL's recovery makes many wonder about SBF's large position. At the peak, FTX and SBF held more than 60 million tokens, which was more than 10% of the total supply. While the amount of tokens has fallen slightly because of FTX's selling to repay creditors, it still holds over 55 million tokens.\n\nIt is also important to note that FTX has a vesting schedule for the SOL tokens — it can sell around 1% of its tokens every month. However, in March 2025, FTX will be allowed to sell over 7.5 million tokens.\n\nStory continues\n\nFTX's Solana position currently is worth over $5.5 billion. This is derived from a position of 55.8 million tokens priced at $100.\n\nAt its peak of 60 million tokens valued at $125 per token, the holding would have been worth $7.5 billion. At its lowest, this position would have been worth a mere $600 million in early 2023.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Here's How Much You'd Have If You Bought Solana After The FTX Crash originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvZGVmaS91bmlib3Qtc29sYW5hLXN1cmdlLXRlbGVncmFtLWJvdC1hbGwtdGltZS1oaWdoLWV0aGVyZXVtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 Jan 2024 08:00:00 GMT",
        "title": "Telegram trading bot Unibot hits record use on Solana after Ethereum success - DLNews",
        "content": "Telegram bots welcome a flood of new users from the memecoin trading community on Solana.\n\nTrading volumes through Unibot are now heavily dominated by Solana.\n\nThe success of Unibot’s migration has caught the attention of competitors in this sector.\n\nDaily users on Unibot, the mega-popular Telegram trading bot, hit an all-time high after its Solana integration this month.\n\nOn January 11, Unibot’s daily users soared to a record. Days later, daily users jumped another 43%, reaching a new all-time high of 3,151 on January 15.\n\nTelegram bots are designed to simplify on-chain trading by letting users buy and sell tokens on decentralised exchanges — or DEXs — through the popular messaging app.\n\nThese features were trendy among meme coin traders on Ethereum last summer, as six of the top 10 trading pairs of all time were meme coins.\n\nUnibot’s Solana launch has helped turn its fortunes around after falling use on Ethereum, where it was initially launched. Solana users now account for 90% of Unibot’s users, and over 79% of the total volume.\n\nSince its Solana launch on January 4, Unibot earned $275,000 in fees to add to the $534,000 it earned in fees on Ethereum.\n\nThis is an over 50% increase in total fees generated that Unibot would not have had without integrating Solana.\n\nTotal volume generated by Unibot daily. (Dune: @Whale_Hunter)\n\nThe episode shows that Solana, which prides itself on low transaction fees and its dApps’ slick interfaces, is winning over the DeFi degens who make up Unibot’s user base.\n\nJoin the community to get our latest stories and updates\n\nA second start with Solana\n\nUnibot’s expansion to Solana comes as trading on the blockchain has boomed throughout December.\n\nDecentralised exchanges on Solana are now the third-most active among traders behind those built on Ethereum and Arbitrum.\n\nLast summer, Ethereum also saw a similar memecoin mania to the one that just occurred on Solana, driven mainly by the advent of Telegram trading bots like Unibot and Maestro.\n\nAt its peak in August, Unibot facilitated over $8 million in daily trading volume through its Telegram trading interface, generating over 11,400 Ether worth $29.5 million in lifetime fees.\n\nBut with a significant portion of memecoin trading activity exiting Ethereum to other chains — most notably Solana — in recent months, Unibot’s revenue has also dropped.\n\nNow, in what was a bid to boost revenues, trading bots popular among traders are following them to Solana. And it appears to be working.\n\nCompetitors follow suit\n\nOne of Unibot’s main competitors, Banana Gun Bot, has also made the move to Solana.\n\nBanana Gun Bot saw similar success following its launch on Solana. The total fees generated on January 16 were the most since December 6, and the fourth highest all time.\n\nIn just three days, it has generated over 270 SOL in fees, worth approximately $27,000 at current prices.\n\nDaily active users also saw a bump, on January 16th 1,727 new users and 4,543 total users interacted with the bot. This is just below the previous all time high of 4,730 total users set on November 29.\n\nUNIBOT token\n\nThe price of Unibot’s eponymous token has gone up by 85% over the past month, trading around $94.\n\nRevenues generated by Unibot are shared with token holders who hold at least 10 UNIBOT. Holders have received over 4,496 ETH in total rewards, valued at over $11.3 million at current prices.\n\nUnibot's token price\n\nToken holders can earn even more rewards by distributing their unique referral code to other users. Referrers earn 25% of the total fees generated by anyone who uses their referral code.\n\nHolders can expect to receive a 9.43% APR for staking."
    }
]