[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90aGVzZS1zb2xhbmEtY29pbnMtZXhwbG9kZS1vdmVybmlnaHQtaGVyZXMtd2h5L9IBTGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90aGVzZS1zb2xhbmEtY29pbnMtZXhwbG9kZS1vdmVybmlnaHQtaGVyZXMtd2h5Lz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "These Solana Coins Explode Overnight: Here’s Why - CryptoPotato",
        "content": "TL;DR\n\nCertain Solana coins are experiencing significant increases in their market values.\n\nThese tokens have gained attention from major crypto exchanges, possibly playing a role in the uptick.\n\nPositive market trends and the rise of Solana (SOL) are also mentioned as possible drivers behind the price rally.\n\nBONK, WIF, and JTO are Flying High\n\nSome of the best-performing cryptocurrencies today (January 9) include the Solana coins – Bonk Inu (BONK), Jito (JTO), and dogwifhat (WIF).\n\nBONK has soared by nearly 30% (per CoinGecko’s data) in the past 24 hours, while its market capitalization surpassed the $800 million mark. JTO experienced a more modest increase of 6%.\n\nOne factor playing a role in the positive performance of those tokens could be OKX’s decision to list them on its spot trading markets on January 8.\n\nOther leading crypto exchanges, including Coinbase and Binance, also embraced BONK a while back, boosting its value to an all-time high price in December.\n\nDespite not being included in OKX’s listing, the recent sensation in the crypto market – dogwifhat (WIF) – is also well in the green today. The meme coin currently trades at around $0.13, representing a whopping 88% surge in the past 24 hours.\n\n\n\nThe Market’s Bullish Condition\n\nAnother element fueling a price appreciation for BONK, JTO, and WIF might be the overall green wave in the cryptocurrency market. Recall that a few hours ago, Bitcoin surpassed the $47,000 level for the first time since the spring of 2022, potentially driven by arising expectations that a spot BTC ETF would see the light of day in the United States in the upcoming days.\n\nLast but not least, the upswing of the Solana coins could be attributed to SOL’s rally. The latter has jumped by over 12% in the past 24 hours, exceeding the $100 mark once again.\n\nAccording to some experts, including the one using the X handle, Ali, SOL is “showing signs of forming a bull flag.” The analyst suggested that crossing the $110 resistance tag could be a catalyst for an additional pump toward $163."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY3J5cHRvLm5ld3Mvc29sYW5hLWVjb3N5c3RlbS1zZWVzLXN1cmdlLWluLWRldmVsb3Blci1yZXRlbnRpb24tYW5kLWdsb2JhbC1ncm93dGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Solana ecosystem sees surge in developer retention and global growth - crypto.news",
        "content": "Solana’s developer retention soared to 50%, with global expansion, diverse hackathon participation, and SOL’s impressive 1,000% gain marking 2023.\n\nIn 2023, the Solana ecosystem experienced a significant boost in developer retention, surging from 31% to over 50% in a three-month period, as reported by the Solana Foundation. This improvement was attributed to enhanced developer onboarding processes and increased opportunities within the ecosystem.\n\nhttps://twitter.com/solana/status/1744408593917759993\n\nThe evaluation of retention rates focused on developers who consistently made at least one commit over three consecutive months. Notably, 400-500 Solana developers graduated from various bootcamps every six months, contributing to a 500% growth in job listings throughout the year.\n\nGitHub data revealed that the improved retention rate led to a consistent monthly active developer count ranging from 2,500 to 3,000 within the Solana ecosystem in 2023. The foundation highlighted advancements in tooling for multiple programming languages and additional educational resources as key factors contributing to the positive trend, while acknowledging areas like testing and debugging for potential improvement.\n\nSolana’s monthly active developers\n\nYou might also like: Coinbase says Bitcoin, Ethereum current cycles resemble 2018-2022\n\nThe Solana Foundation emphasized the ecosystem’s global growth, citing initiatives like SuperteamDAO expanding to eight countries in 2023. Diverse participation in hackathons from over 150 countries underscored the platform’s worldwide reach.\n\nSolana’s number of hackathon submissions\n\nOver the past three years, more than 3,000 projects were launched, securing over $600 million in funding through hackathons. The most recent hackathon, Solana Hyperdrive, received a record-breaking 900 submissions.\n\nSolana’s submission statistics\n\nNotably, this surge in developer activity aligned with a remarkable year for Solana’s native cryptocurrency, SOL, which saw a remarkable 1,000% increase from $10 to $102, making it the top-performing major altcoin in 2023. Currently, Solana (SOL) is trading at $101, with Solana setting fresh records for new and active monthly addresses in December amid a notable price rally."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy50cmFkaW5ndmlldy5jb20vbmV3cy9uZXdzYnRjOjczNTYyZTc0MTA5NGI6MC1lcGljLXJhbGx5LWFsZXJ0LXNvbGFuYS1ob3VybHktY2hhcnQtcmV2ZWFscy1idWxsLWZsYWctZm9ybWF0aW9uLXNvbC10YXJnZXRzLTE2My_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Epic Rally Alert: Solana Hourly Chart Reveals Bull Flag Formation, SOL Targets $163 - TradingView",
        "content": "Solana (SOL), the fifth largest cryptocurrency by market capitalization, has experienced a significant surge after undergoing a correction from its 20-month high of $125, reached on December 25.\n\nFollowing a dip to the $85 level on Monday, January 8, SOL reclaimed the $100 level again, demonstrating a 6.4% surge in the past 24 hours.\n\nMoreover, technical analysis indicates a potential bullish continuation pattern known as a bull flag in Solana’s 1-hour chart, which suggests the possibility of further price gains beyond the previous high.\n\nSolana Optimism For Price Breakout\n\nTechnical analyst Ali Martinez has identified a bullish pattern known as a bull flag formation on Solana’s hourly chart. A bull flag is characterized by a consolidation period following a strong upward move.\n\nIn this case, the dip to the $85 level could be considered the consolidation phase. The formation suggests that SOL may experience another significant upward move shortly.\n\nNewsBTC\n\nAs seen in the chart above, to confirm the validity of the bull flag pattern, SOL needs to achieve a decisive close above the $110 resistance level. Such a breakthrough could catalyze upward momentum and propel the price to new highs.\n\nIf the bull flag pattern holds, Ali Martinez anticipates that SOL could aim for an ambitious target of $163. However, Solana faces multiple resistance levels that it must overcome to reach the potential target indicated in Ali Martinez’s hourly chart analysis.\n\nThe $110 resistance, the $120 mark, and the previous 20-month high of $125 present significant hurdles for Solana’s price action. These levels have the potential to impede further upward movement, as they have previously acted as resistance during the bear market of 2022.\n\nAdditionally, the $132 and $137 levels are anticipated to provide additional resistance, as they were the price points from which Solana’s price decreased in April 2022.\n\nLastly, the $151 and $154 levels will serve as the final thresholds for Solana’s bears to hold if they aim to halt any potential price increase before reaching the $163 target.\n\nSolana’s Ecosystem Consistent Growth\n\nDespite the volatility in SOL’s price over the past month, Token Terminal data reveals consistent growth in Solana’s blockchain ecosystem.\n\nAccording to the data, Solana’s circulating market cap has surged impressively to $43.54 billion, representing a substantial 20.08% increase in value over the last 30 days.\n\nMoreover, the fully diluted market cap has surged to $57.13 billion, reflecting an 18.82% growth, which illustrates a strong investor interest in Solana and its potential for future growth.\n\nSolana’s revenue has also experienced substantial growth over the past 30 days, with a staggering increase of 217.18% to reach $5.68 million. On an annual basis, the revenue has reached an impressive $69.12 million, exhibiting a remarkable surge of 142.15%.\n\nUltimately, Solana’s fees have significantly increased over the past 30 days, with an increase of 217.18% to $11.36 million. On an annualized basis, the fees amount to $138.24 million, marking a substantial growth of 142.15%, reflecting the network’s growing usage and transactional activity.\n\nFeatured image from Shutterstock, chart from TradingView.com"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9wb2RjYXN0L2VtcGlyZS8xYWEyYWMzMC1hZWE5LTExZWUtODI5Ny1jYjEyODJkMGNjMGPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Empire Podcast: Solana 2024: Fee Markets, SVM Economics, and Saga Phone | Anatoly Yakovenko & Ben Sparango - Blockworks",
        "content": "In today's episode Jason and Santi are joined by Solana Labs founder and CEO Anatoly Yakovenko and Ben Sparango, the Head of Strategic Business Development. The duo has returned to discuss Solana's progress beyond the FTX fallout. They dive into Solana's priorities around scaling, fees, and alignment incentives between builders and validators. Anatoly elaborates on the network effects of open-sourcing core technology like the SVM, while Ben highlights mobile adoption and NFTs as driving new crypto demand. They debate the trajectory for permissionless finance to run mainstream markets on Solana, and whether the Saga phone can make a dent in Apple and Google's distribution monopolies. We hope you enjoy!\n\n- -\n\nFollow Anatoly: https://twitter.com/aeyakovenko\n\nFollow Jason: https://twitter.com/JasonYanowitz\n\nFollow Santiago: https://twitter.com/santiagoroel\n\nFollow Empire: https://twitter.com/theempirepod\n\n\n\n\n\nSubscribe on YouTube: https://tinyurl.com/4fdhhb2j\n\nSubscribe on Apple: https://tinyurl.com/mv4frfv7\n\nSubscribe on Spotify: https://tinyurl.com/wbaypprw\n\n\n\n\n\nGet top market insights and the latest in crypto news. Subscribe to Blockworks Daily Newsletter: https://blockworks.co/newsletter/\n\n- -\n\nArbitrum is a game-changer for daily Ethereum's users and developers, offering top applications and lower fees. As the leading scaling solution with 600+ apps, explore Arbitrum’s Portal to find your perfect fit. Interact with the home of DeFi, a flourishing NFT and creator ecosystem, and a rapidly growing Web3 gaming hub – Arbitrum has it all.\n\n\n\n\n\nGet started at:\n\nportal.arbitrum.io\n\n- -\n\nHarpie is the most advanced on-chain security solution for monitoring and protecting your crypto wallet from theft in real time. Harpie detects, blocks, and recovers compromised assets from malicious transactions before they execute, and is the only security tool to also protect users from off-chain signature attacks like the recent Ledger Connect Kit exploit.\n\n\n\n\n\nSecure your wallet for free at harpie.io.\n\n- -\n\nJoin us at DAS (Digital Asset Summit) in London this March! DAS is the #1 institutional conference in crypto, hosted by Blockworks.\n\n\n\n\n\nUse the link below to learn more, and use EMPIRE10 to get 10% off your ticket! Sign up now because the price goes up every month. See you there!\n\n\n\n\n\nLearn more + get your ticket here: https://blockworks.co/event/digital-asset-summit-2024-london/home\n\n- -\n\nTimestamps\n\n\n\n\n\n(02:00) The Solana Recovery Post SBF\n\n(10:30) Priorities for Solana Development\n\n(22:14) The Next Gen L1 Case for Builders\n\n(24:56) Economics of the SVM\n\n(34:17) State of Solana Fee Market\n\n(48:18) Inflation & Staking Dynamics\n\n(51:17) DAS 2024\n\n(52:32) Arbitrum Ad\n\n(53:18) Harpie Ad\n\n(54:32) Open Source & Security Approach\n\n(01:02:02) Governance & Alignment\n\n(01:12:25) The Value of Permisionless Systems\n\n(01:19:04) Saga Mobile Strategy & Potential\n\n(01:25:14) Remaining Moonshot Ideas\n\n- -\n\nDisclaimer: Nothing said on Empire is a recommendation to buy or sell securities or tokens. This podcast is for informational purposes only, and any views expressed by anyone on the show are solely our opinions, not financial advice. Santiago, Jason, and our guests may hold positions in the companies, funds, or projects discussed."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9zb2xhbmEtZWNvc3lzdGVtLWJvYXN0cy1vdmVyLTI1MDAtbW9udGhseS1hY3RpdmUtZGV2ZWxvcGVycy1yZXBvcnRzLXNvbGFuYS1mb3VuZGF0aW9uLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 09 Jan 2024 08:00:00 GMT",
        "title": "Solana Ecosystem Boasts Over 2,500 Monthly Active Developers, Reports Solana Foundation - Cryptonews",
        "content": "Solana Ecosystem Boasts Over 2,500 Monthly Active Developers, Reports Solana Foundation\n\nThe Solana (SOL) ecosystem now boasts more than 2,500 monthly active developers, according to the Solana Foundation.\n\nIn a comprehensive report released on January 9, the foundation highlighted that the network has maintained a consistent range of 2,500 to 3,000 monthly active developers throughout the past year, a testament to the ecosystem’s ability to attract and retain talent.\n\nHowever, it’s worth noting that this measurement only considers developers who contribute to public repositories.\n\nIn contrast, data from Electric Capital’s blockchain development tracker, Developer Report, indicates a different picture.\n\nAccording to their data, as of October 1, 2023, Solana’s developer count stood at 946, a significant decline from its all-time high of 2,634 recorded on December 22, 2022.\n\nIt’s important to acknowledge that the Electric Capital report relies on data from GitHub and covers statistics up until October 1.\n\nThe report’s spokesperson assured that the fourth-quarter data would be updated in the following week.’\n\nIn comparison, Ethereum, one of Solana’s main competitors, had a total monthly active developer count of 5,769 on October 1, 2023, reflecting a 22% decrease from its peak count of 7,433 on June 16, 2022, according to Electric Capital data.\n\nSOL Registers More Gains\n\n\n\nThe growth in Solana’s developer ecosystem aligns with the ongoing surge in activity on Solana’s network and the upward price movement of its native token, SOL.\n\nThe ecosystem experienced a remarkable 500% price rally from October to December, largely driven by the popularity of SOL-based memecoins.\n\nThis surge propelled Solana to briefly surpass Binance’s BNB token and secure the position of the fourth-largest cryptocurrency by market capitalization on December 22.\n\nJust days later, on December 26, SOL reached yearly highs of $122.\n\nThe network also demonstrated a noteworthy surge in activity, momentarily surpassing Ethereum in 24-hour decentralized exchange volumes during the same month.\n\nWhile the Solana Foundation’s report showcases the ecosystem’s strong developer base, it is important to consider the contrasting data from Electric Capital’s Developer Report.\n\nAs Solana continues to attract attention and demonstrate impressive price performance, the coming weeks will likely provide more clarity on the ecosystem’s developer activity and its position within the competitive landscape of blockchain technology.\n\nSolana Continues to Achieve New Milestones\n\n\n\nSolana continues to make waves in the crypto community as it achieves several significant milestones.\n\nOver the past week, the network surpassed Ethereum (ETH) in 7-day stablecoin trading volume for the first time ever.\n\nAs reported, the value of stablecoin transfers on Solana reached a staggering $103 billion last week, outperforming all other networks.\n\nEthereum secured the second position with $90.9 billion, followed by Tron with $82.3 billion and BNB Chain with $14.6 billion.\n\nIn addition to stablecoin trading volume, Solana also surpassed Ethereum in NFT trade volume for the month of December.\n\nAccording to Degen News, Solana hosted trades worth $366.6 million, while Ethereum recorded $353.2 million.\n\nHowever, data from CryptoSlam reveals that over the past 30 days, Solana’s NFT sales amounted to $329.3 million, which is approximately 5% less than Ethereum’s $345 million during the same period.\n\nThe popularity of Solana is evident not only in trading volumes but also in search trends.\n\nIn mid-December, worldwide searches for “Solana” surpassed those for “Ethereum,” as reported by Google Trends.\n\nThese milestones cap off a bullish year for Solana in 2023."
    }
]