[
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9wb3B1bGFyLXNvbGFuYS1iYXNlZC1tZW1lY29pbi1kb2d3aWZoYXQtMDQ0MzE4Nzc4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Popular Solana-Based Memecoin Dogwifhat Soars After Listing on Bitget - Yahoo Finance",
        "content": "Popular Solana-Based Memecoin Dogwifhat Soars After Listing on Bitget\n\nIn a remarkable surge, Solana memecoin Dogwifhat (WIF) skyrocketed almost 50% in the past day, reaching a price of $0.34, following the announcement of its listing on crypto exchange Bitget. However, WIF is still down from its all-time-high of $0.46, which it hit on January 18. Binance announced that it will list WIF perpetual contracts on January 18.\n\nTrading for WIF is offered in Bitget’s Innovation Zone, which is dedicated to trending tokens. Newly listed pairs in this zone are subject to a 60-day valuation period, and those that fail to meet certain criteria, such as market depth, may be delisted.\n\nThe listing on Bitget has propelled WIF to a market capitalization of $332 million. In the past 24 hours, the meme coin has generated an impressive trading volume of $111 million, making it the top 54 cryptocurrency in terms of volume. Fellow Solana memecoin BONK has also experienced gains, rising 7.5% on Wednesday. It is currently ranked 86th, with a market capitalization of $685 million.\n\nMeanwhile, SOL, the native token of the Solana network, has rebounded following a wider market sell-off, gaining 11.5% since Wednesday and trading at $88.50. Despite the price sell-off, Solana has maintained its position as the fifth-largest cryptocurrency, with a market capitalization of $38.3 billion."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9wb3B1bGFyLXNvbGFuYS1iYXNlZC1tZW1lY29pbi1kb2d3aWZoYXQtMDQ0MzE4Nzc4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Popular Solana-Based Memecoin Dogwifhat Soars After Listing on Bitget - Yahoo Finance",
        "content": "Popular Solana-Based Memecoin Dogwifhat Soars After Listing on Bitget\n\nIn a remarkable surge, Solana memecoin Dogwifhat (WIF) skyrocketed almost 50% in the past day, reaching a price of $0.34, following the announcement of its listing on crypto exchange Bitget. However, WIF is still down from its all-time-high of $0.46, which it hit on January 18. Binance announced that it will list WIF perpetual contracts on January 18.\n\nTrading for WIF is offered in Bitget’s Innovation Zone, which is dedicated to trending tokens. Newly listed pairs in this zone are subject to a 60-day valuation period, and those that fail to meet certain criteria, such as market depth, may be delisted.\n\nThe listing on Bitget has propelled WIF to a market capitalization of $332 million. In the past 24 hours, the meme coin has generated an impressive trading volume of $111 million, making it the top 54 cryptocurrency in terms of volume. Fellow Solana memecoin BONK has also experienced gains, rising 7.5% on Wednesday. It is currently ranked 86th, with a market capitalization of $685 million.\n\nMeanwhile, SOL, the native token of the Solana network, has rebounded following a wider market sell-off, gaining 11.5% since Wednesday and trading at $88.50. Despite the price sell-off, Solana has maintained its position as the fifth-largest cryptocurrency, with a market capitalization of $38.3 billion."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmxlZGdlcmluc2lnaHRzLmNvbS9zb2xhbmEtcHVibGljLWJsb2NrY2hhaW4tdGFyZ2V0cy1lbnRlcnByaXNlcy1pbnN0aXR1dGlvbnMtd2l0aC10b2tlbi1mdW5jdGlvbmFsaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Solana public blockchain targets enterprises, institutions with token functionality - Ledger Insights - Ledger Insights",
        "content": "Today the Solana Foundation unveiled a set of token extensions that aim to add out-of-the-box blockchain functionality that would appeal to enterprises. Rather than having to write a custom smart contract for a token such as a bond, it’s possible to select modular token extensions to support functionality such as compliance, confidentiality and even interest on the public blockchain.\n\n“The Solana network is the blockchain of choice for enterprise-grade companies looking to enter the web3 space,” said Sheraz Shere, Head of Payments at the Solana Foundation.\n\n“Companies like Visa, Worldpay, Stripe, Google, and Shopify have already seen the performance advantages inherent to the Solana network and have launched solutions and applications that are only possible on Solana. With token extensions, we are expanding what is possible for enterprise adoption of blockchain by natively enabling features that matter to large regulated enterprises.”\n\nTwo stablecoin providers already using token extensions are Paxos and Japan’s GMO-Z. Both are New York-licensed trust companies. We previously reported the Paxos launch on Solana, and GMO-Z has issued its ZUSD and GYEN on the blockchain.\n\nSolana token extensions\n\nOne of the Solana token extensions is a ‘transfer hook’, allowing the creator to add functionality at the point of transfer. For example, it might check that the token recipient is on a KYC-allow list. As mentioned there’s an interest bearing extension to attach a rate of interest to the token.\n\nOne of the more curious extensions was the one for confidentiality. It uses zero-knowledge proofs to hide the transfer amount but not the other details. One of the use cases mentioned is for payroll, and it would certainly help enterprise applications. However, we can think of quite a few applications where you might also want identities to be hidden. Consider a supply chain where a supplier may not want their up-chain suppliers to be visible. Otherwise, their customers can see who they work with.\n\nSolana is the latest to target enterprises, though its approach is different from others. Public blockchains popular with enterprises include Ethereum, Polygon, Avalanche, Provenance, Hedera, Polkadot, Ripple and Algorand. Polygon, Avalanche and Polkadot essentially support private blockchains that can be linked to the public networks."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL25mdC1tYXJrZXRwbGFjZS11c2VyLXJld2FyZHMtcHJvZ3JhbdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 18:49:50 GMT",
        "title": "Magic Eden expands rewards program, starting with Solana users - Blockworks",
        "content": "The NFT marketplace Magic Eden is building out a user rewards program based around the so-called diamonds it rolled out in 2023. The platform said it would retroactively disburse diamonds to “Solana OGs” on Feb. 2.\n\nMagic Eden announced its decision to open-source its protocol code and grant governance rights to the newly-formed Non-Fungible DAO, to which it contributes. This move is yet another example of a project using non-trading “points” to motivate user behavior amidst increased regulatory scrutiny in the crypto industry.\n\nRead more: Treasury’s Wally Adeyemo: My agency needs more power to regulate crypto ‘\n\nMagic Eden debuted diamonds in March 2023, offering users rewards like lower fees and access to whitelists via the tokens. Now, Magic Eden users can earn diamonds by buying, selling or making offers to an entire collection of NFTs. Users can boost their rewards by relying exclusively on Magic Eden for their NFT trading.\n\nSome have expressed frustration at the ambiguity surrounding the usefulness of diamonds, which are not apparently tradable.\n\nThe scheme resonates with a larger movement in crypto toward systems where users accumulate non-trading points, as opposed to tokens, for their participation in a project. The SocialFi upstart friend.tech employed a points program to incentivize usage, and the Solana-based exchange Drift announced Drift Points this week.\n\nPoints tend to be winkingly thought of as a placeholder for a future token while projects iron out a spotty relationship between crypto and US regulators.\n\n“God bless all the crypto founders trying points. It’s the box regulators have put us in, and we are just dealing with it and trying to figure out how to innovate with our hands tied behind our back,” Unstoppable Domains founder Matthew Gould wrote on X this week.\n\nRead more: Lufthansa to offer NFT rewards program\n\nMagic Eden did not immediately return a request for comment on how it conceptualizes diamonds relative to points. In a post on X, the platform wrote: “This isn’t just another points campaign. It’s a meticulously crafted plan to give back to Magic Eden’s OGs, collectors, creators and degens alike.”\n\nConcurrently with the diamonds airdrop, the just-announced Non-Fungible DAO, which now owns and governs the smart contracts behind Magic Eden, has announced a token. The DAO implied that community members will be able to accrue the future token by interacting with Magic Eden.\n\nDetails on the new DAO are sparse, but a press release reviewed by Blockworks said Magic Eden had “pledged to contribute” to the DAO to “further support industry growth.”\n\nStart your day with top crypto insights from David Canellis and Katherine Ross. Subscribe to the Empire newsletter.\n\nThe Lightspeed newsletter is all things Solana, in your inbox, every day. Subscribe to daily Solana news from Jack Kubinec and Jeff Albus."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMirwFodHRwczovL3d3dy5wcm5ld3N3aXJlLmNvbS9uZXdzLXJlbGVhc2VzL3NvbGFuYS1uZXR3b3JrLXVudmVpbHMtdG9rZW4tZXh0ZW5zaW9ucy1lbXBvd2VyaW5nLWZpbmFuY2lhbC1pbnN0aXR1dGlvbnMtYW5kLWVudGVycHJpc2UtZ3JhZGUtYnVzaW5lc3Nlcy10by1lbnRlci13ZWIzLTMwMjA0MjYyNS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Solana Network Unveils Token Extensions: Empowering Financial Institutions and Enterprise-Grade Businesses to ... - PR Newswire",
        "content": "Solana is the first network to offer this level of integrated developer and user experience in a single token program on a public network\n\nSAN FRANCISCO, Jan. 24, 2024 /PRNewswire/ -- The Solana Foundation, a non-profit organization dedicated to the Solana network's decentralization, adoption, and security, today announced the launch of token extensions – the next generation of the SPL Token standard that represents a significant leap forward in what is possible to build on blockchain.\n\nToken extensions are a comprehensive suite of turnkey solutions tailored to meet the needs of businesses moving onchain – arming developers, enterprises, financial institutions, and Solana-native development teams with ready-to-use advanced token functionality. Token extensions provide businesses with many of the same security and compliance controls as permissioned blockchain environments, with massively reduced engineering time, all while operating on one of the world's most popular public blockchains. These solutions represent another major advancement in developer tools on the Solana network contributing to the growth and health of the ecosystem and overall developer experience.\n\n\"Token extensions build on the characteristics that make Solana the ideal destination for developers,\" said Anatoly Yakovenko, co-founder of Solana and CEO of Solana Labs. \"Solana is the first network to offer this level of integrated developer and user experience in a single token program. We're already seeing the potential to build using token extensions via deployments from some of the most recognizable names in crypto.\"\n\nAt the forefront of this launch are recognizable industry leaders like Paxos and GMO-Z.com Trust Company Inc. (GMO Trust) – companies that are leveraging the benefits of token extensions to issue stablecoins on the Solana blockchain. Paxos, a leading regulated blockchain and tokenization infrastructure platform, recently expanded its stablecoin issuance to Solana on December 22. Additionally, GMO Trust announced the first regulated Japanese yen stablecoin as well as their own U.S. dollar stablecoin on the Solana network. Token extensions provided the tools and optionality needed for companies like Paxos and GMO Trust to be at the forefront of innovation, while also remaining compliant.\n\n\"The Solana network is the blockchain of choice for enterprise-grade companies looking to enter the web3 space,\" said Sheraz Shere, Head of Payments at the Solana Foundation. \"Companies like Visa, Worldpay, Stripe, Google, and Shopify have already seen the performance advantages inherent to the Solana network and have launched solutions and applications that are only possible on Solana. With token extensions, we are expanding what is possible for enterprise adoption of blockchain by natively enabling features that matter to large regulated enterprises.\"\n\n\"A growing number of enterprises are interested in the benefits of blockchain, but want to ensure that they can adopt the technology in a responsible way that adheres to their internal compliance processes,\" said Amira Valliani, Head of Policy at the Solana Foundation. \"One of the many benefits of token extensions is that it simplifies these processes. Extensions like transfer hooks, confidential transfers, and permanent delegates streamline compliance obligations and ensure that companies don't spend resources customizing smart contracts to implement their compliance frameworks.\"\n\nToken extensions were designed specifically to cater to builders across various industries, including stablecoins, real-world assets (RWA), and payments. The extensions include:\n\nTransfer hooks , which give token issuers control over how tokens and users interact, allowing a flexible design that empowers developers to build elaborate token interactions.\n\n, which give token issuers control over how tokens and users interact, allowing a flexible design that empowers developers to build elaborate token interactions. Transfer fees , which add the ability to charge a fee every time a token is transferred, providing sustainable revenue models for any type of token built using token extensions.\n\n, which add the ability to charge a fee every time a token is transferred, providing sustainable revenue models for any type of token built using token extensions. Confidential transfers , which publicly share the source, destination, and token type, but use zero-knowledge proofs to encrypt the amount of the transfer while still providing the issuer of the token certain audit rights necessary for compliance.\n\n, which publicly share the source, destination, and token type, but use zero-knowledge proofs to encrypt the amount of the transfer while still providing the issuer of the token certain audit rights necessary for compliance. Permanent delegate authority , which gives the token issuer absolute authority over tokens they issue, specifically those that require some sort of revocation ability, like licenses or credentials.\n\n, which gives the token issuer absolute authority over tokens they issue, specifically those that require some sort of revocation ability, like licenses or credentials. Non-transferability, which only permits the issuer to transfer tokens to another wallet. This feature can be used for credentialing and unique user identification.\n\nFor more information on token extensions, visit solana.com/solutions/token-extensions .\n\nAbout Solana\n\nSolana is a blockchain built for mass adoption. It's a high performance network that is utilized for a range of use cases, including finance, NFTs, payments, and gaming. Solana operates as a single global state machine, and is open, interoperable and decentralized. For more information, please visit https://solana.com .\n\nAbout Solana Labs\n\nSolana Labs is a technology company, a developer of web3 projects, a creator of open-source software, and the author and publisher of a Solana validator client. Solana Labs is based in San Francisco. For more information, please visit https://solanalabs.com .\n\nAbout Solana Foundation The Solana Foundation is a non-profit foundation based in Zug, Switzerland, dedicated to the decentralization, adoption, and security of the Solana network. For more information, please visit https://solana.org/ .\n\nMedia Contact\n\npress@solana.org\n\nSOURCE Solana Foundation"
    }
]