[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTEzL2NhdXRpb24tYWJvdXQtYml0Y29pbi1ncm93cy1hcy1hLWp1bXAtaW4tZ2xvYmFsLW1hcmtldHMtYnlwYXNzZXMtY3J5cHRv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Caution About Bitcoin Grows as a Jump in Global Markets Bypasses Crypto - Bloomberg",
        "content": "Bitcoin missed out on a rally in global markets sparked by cooling US inflation, triggering some caution about the token’s outlook.\n\nThe largest digital asset on Thursday mostly held losses of 0.7% from a day earlier, while stocks and bonds extended gains on bets that an end to Federal Reserve monetary tightening is getting closer."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTA3LTE0L2luZmxhdGlvbi1ncm93cy1sZXNzLXNjYXJ5LWFuZC1iaXRjb2luLWxlc3MtZXhjaXRpbmctY29taW5nLXVwLWVhcm5pbmdz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Inflation Grows Less Scary, and Bitcoin Less Exciting. Coming Up, Earnings - Bloomberg",
        "content": "To get John Authers' newsletter delivered directly to your inbox, sign up here.\n\nMore great news for those who hate inflation. The day after the US Consumer Price Index came in below expectations, producer prices performed the same trick. Indeed, if measured by the traditional method of tracking finished goods, PPI in the US has gone negative:"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTEzL2JsYWNrcm9jay1maWRlbGl0eS1hbmQtaW52ZXNjby1yYWNlLXRvLWJlY29tZS1maXJzdC1zcG90LWJpdGNvaW4tZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Blackrock, Fidelity and Invesco Race to Become First Spot Bitcoin ETF - Bloomberg",
        "content": "It’s been a brutal stretch for crypto. Almost $2 trillion of market value in cryptocurrencies has been wiped away since the market peak in late 2021. Major digital asset companies have collapsed amid allegations of fraud and market manipulation. US regulators are cracking down on many of the businesses still standing. But one corner of the market is suddenly garnering enthusiasm: Bitcoin exchange-traded funds.\n\nSome of the biggest and most established names on Wall Street are filing or refiling applications with the US Securities and Exchange Commission in an attempt to be the first to release such a product. A Bitcoin ETF would invest in the cryptocurrency on behalf of its shareholders. In other words, investors could easily get direct exposure to crypto by going to their brokerage and buying shares the way they would a stock."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vYml0Y29pbi1wcmljZXMtYWJvdmUtMzBrLXNwb3QtMTYwMDMzOTMxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin prices above $30K as spot bitcoin ETF approval dependent on courts - Yahoo Finance",
        "content": "Approval for spot bitcoin ETFs hinges on a court battle between crypto firm Grayscale and the SEC. Yahoo Finance Markets Reporter Jared Blikre checks out bitcoin's price action amid regulatory pressures.\n\nVideo Transcript\n\n- Well, amid the surge in tech stocks, small caps, and government bonds, one asset class isn't participating in the latest run up. Bitcoin has held a tight trading range over the last three weeks as the industry braces for a critical decision in federal court, where Grayscale Investments, the manager of the world's largest publicly traded crypto fund is suing the SEC to allow a spot Bitcoin ETF to operate in the US market.\n\nYahoo Finance's Jared Blikre is here with those details. Hey, Jared.\n\nJARED BLIKRE: Hey, there. And I thought before I got into the court case, I just begin with a year to date look at what's happening in cryptocurrency land. Bitcoin, up 85%. But as you said, Rachelle, we haven't seen a lot of that price action made recently. This is a-- let's see, let's get a year to date chart on there. And you can see over the last three weeks, basically treading water going sideways.\n\nHowever, given the fact that we are in the upper right hand side of this chart, this consolidation is actually bullish. And when you see what's overhead, let me put a three-year chart, the most price action in Bitcoin is lying directly ahead. And that's basically 30,000 to 40,000, goes up to maybe 50,000. But a ton of price memory in there. So not surprising to see Bitcoin at least taking a pause, and it could still reverse.\n\nBut back to the main point. This court case that we were talking about, Grayscale versus the SEC, they want to sue the SEC in order to allow them to convert into an ETF. They are currently an ETN, it gets into the weeds there. But they want to be able to be based their reference price on spot Bitcoin.\n\nAnd we saw in anticipation of a decision of that in this case, we saw BlackRock file for a Bitcoin ETF, a spot Bitcoin ETF only a few weeks ago. Then a bunch of other issuers piled on. Fidelity did as well, and they just issued a note, they just filed an amendment only today or yesterday with regard to their previous amendments. So things are moving along there. But is it going to be approved? Is the spot Bitcoin ETF going to be approved on its own merits or is it going to be forced and shoehorned in because of this court case? We don't know.\n\nBut nevertheless, Bitcoin poised-- poised, I should, say to break higher. But as we know in crypto, anything can happen.\n\n- It's true, we're always waiting for that breakout moment here, still waiting for it. But thank you for getting us up to speed, our very own Jared Blikre there."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLXN1cmdlLXJpcHBsZS1ub3RjaGVkLTAyMDQ1MDQxMC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether surge after Ripple notched partial win against SEC; Ripple's XRP leads crypto rally - Yahoo Finance",
        "content": "Bitcoin surged on Friday morning in Asia to breach the US$31,000 resistance level, after Ripple Labs achieved a partial victory in its three-year lawsuit against the U.S. Securities and Exchange Commission (SEC). The regulator accused Ripple of offering XRP as an unregistered security. Along with Bitcoin, Ether and all other top 10 non-stablecoin cryptocurrencies logged considerable gains, with XRP spearheading the rally with a rise of over 70%. U.S. equity futures traded flat in the Asia time zone on Friday as investors await earnings reports from major U.S. banks. Thursday’s U.S. producer price index (PPI) has added to a sense that inflation is slowing in the country.\n\nXRP ruling provides crypto market boost\n\nBitcoin climbed 3.45% over the last 24 hours to US$31,463 as of 07:50 a.m. in Hong Kong for a weekly gain of 4.93%, according to data from CoinMarketCap. The world’s largest cryptocurrency reached a high of US$31,814 early Friday morning, the highest price since June 2022.\n\nIn a summary judgement on Thursday, New York Southern District Court Judge Analisa Torres ruled that Ripple’s programmatic sales of the XRP token on public exchanges do not constitute securities, marking a partial victory for Ripple with the SEC. The regulator first sued the San Francisco-based financial technology firm on the grounds that XRP constitutes a security in 2020.\n\nThe verdict came with a critical caveat, however. The court ruled that Ripple’s XRP sales to institutional investors did violate securities laws.\n\nNonetheless, Ripple’s Chief Executive Officer Stuart Alderoty called the judgement “a huge win” in a Friday tweet.\n\nA huge win today – as a matter of law – XRP is not a security. Also a matter of law – sales on exchanges are not securities. Sales by executives are not securities. Other XRP distributions – to developers, to charities, to employees are not securities. — Stuart Alderoty (@s_alderoty) July 13, 2023\n\nAlderoty said that “the only thing the Court found constitutes an investment contract is past direct XRP sales to institutional clients.” Those transactions will now be subject to further court proceedings.\n\nStory continues\n\nDespite the overall optimism in the crypto community evidenced by the upswing in the market, there are also a number of industry voices sounding a note of caution.\n\nIn an emailed comment, CoinShares’ Head of Product Townsend Lansing said that the aspect of the ruling that identifies Ripple’s sales to institutional customers as a violation of securities law marks “a considerable victory for the SEC.”\n\nThe ruling will now set a precedent for legal action against other cryptocurrencies by regulators, he said.\n\n“It is important to note that institutional investors who purchased directly from Ripple may find themselves subject to class-action litigation as potential underwriters,” Lansing added. “This is an area to watch closely, especially if big-name venture capitalists were involved.”\n\nBut, while some sense of jeopardy remained for those involved, Justin d’Anethan, head of APAC business development at Belgium-based crypto market maker Keyrock, believes that the ruling had at least “shook investors in the best of ways.”\n\nElsewhere, Europe’s first Bitcoin exchange-traded fund (ETF) is set for a public listing this month. That follows a 12-month delay from the initially planned date, the Financial Times reported on Thursday.\n\nExperts have identified the listing as another potential catalyst for the crypto market.\n\n“With the talks of ETFs in the background, the idea that we could see products tracking many cryptocurrencies is not implausible and traders are naturally positioning themselves accordingly,” said Keyrock’s d’Anethan.\n\nLike Bitcoin, Ether surged 6.99% to US$2,004, moving up 7.69% for the week. The token is trading above US$2,000 for the first time since April.\n\nBoosted by the ruling on the SEC-Ripple case, all other top 10 non-stablecoin cryptocurrencies rose in the past 24 hours. Cardano’s ADA, Solana’s SOL and Polygon’s MATIC each logged two-digit gains.\n\nXRP, subject of the SEC’s lawsuit against issuer Ripple, jumped 72.75% to US$0.8142 and added 74.89% for the week. In doing so, it replaced Binance’s BNB as the third largest non-stablecoin cryptocurrency by market cap.\n\nThe total crypto market capitalization rose 6.19% in the past 24 hours to US$1.26 trillion, while trading volume jumped 95.72% to US$60.3 billion.\n\nForkast 500 up, Dapper Labs announces layoffs\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe main Forkast 500 NFT index edged up 0.14% in the past 24 hours to 2,699.39 as of 09:55 a.m. in Hong Kong. Forkast’s Solana and Cardano NFT market indices also moved higher, while the Etheum and Polygon indices dropped.\n\nDespite the overnight rise in cryptocurrency prices associated with the Ripple ruling, total NFT sales volume dipped 1.72% in the past 24 hours to US$24.45 million, according to data from CryptoSlam.\n\nAmong all NFT collections, Bitcoin-based $FRAM BRC-20 NFTs topped the 24-hour sales volume, edging up 0.31% to US$2.14 million. In doing so, it recorded over two thirds of the total volume on the Bitcoin network. Ethereum-based collections Bored Ape Yacht Club (BAYC) and the Captainz ranked second and third respectively.\n\nBAYC #1734, part of the BAYC collection, topped collectible sales in the past 24 hours. It was sold at 600 Ether (US$1.2 million) early Friday. As exciting as this big sale is, BAYC #1734 was previously sold at 800 Ether in January 2022.\n\n“This grail Bored Ape was sold at a huge loss, but the takeaway is that there is still a market for very high-priced NFTs, even in a bear market,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\nAs the bear market continues, Dapper Labs, the developer of hit NFT collections such as CryptoKitties and NBA Top Shot, announced the layoff of 51 staff on Thursday — roughly 12% of its workforce.\n\n“The decision was incredibly difficult” but necessary to “ensure a lean and efficient” company, said Dapper Labs Chief Executive Officer Roham Gharegozlou in a letter to employees. It is the third round of layoffs at the company in the past 12 months. Those layoffs saw its workforce cut by 22% in November 2022 and by a further 20% in February this year.\n\nCool Cats Group, the Web3 company behind NFT collection Cool Cats, announced a partnership with game developer nWayPlay, a subsidiary of Hong Kong-based software and investment giant Animoca Brands. Together, the two companies will develop a Web3 game set to be released between late 2023 and early 2024.\n\nUS equities flat amid data releases\n\nImage: Envato Elements\n\nU.S. stock futures traded flat as of 11:50 a.m. in Hong Kong. All three major U.S. indexes closed higher in regular Thursday trading, with the Nasdaq leading the gains with a 1.58% rise.\n\nThe U.S. producer price index (PPI) released Thursday recorded a 0.1% year-on-year rise for the month of June, down from 0.9% in May. The June figure is the smallest increase since August 2020.\n\nThe data is also well below analyst expectations of a 0.4% annual increase in PPI. Combined with weak consumer price index data released on Wednesday, the data points to a slowdown in U.S. inflation.\n\n“The better-than-expected inflation figures for June 2023 would suggest that policy is working to ease price pressures as higher interest rates reduce demand. Key payroll figures announced in early July also came in below expectations with the economy generating less jobs than expected in June,” said Keith Wade, chief economist & strategist at asset management Schroders.\n\nHowever, given lingering inflation worries, Wade still expects the Federal Reserve to make another interest rate hike in July. The tight labor market and the potential for a reversal in the Fed’s monetary policy could, Wade said, trigger a rally in the bond market that would “loosen financial conditions.”\n\n“Given the efforts the Fed has made to convince markets they were serious about inflation and not about to pivot, this would seem to be too early,” said Wade.\n\nFederal Reserve Governor Christopher Waller said in a Thursday speech that the Fed would need to “keep policy restrictive for some time” in order to reduce inflation below its 2% target. He said that he anticipates two more rate hikes by the end of the year.\n\n“I am more confident that the banking turmoil is not going to result in a significant problem for the economy, and I see no reason why the first of those two hikes should not occur at our meeting later this month,” said Waller.\n\nMeanwhile, a Wednesday report by financial comparison service company Bankrate showed that economists believe there is a 59% chance the U.S. economy will enter a recession inside the next twelve months. The report cited concern about the long-term economic impact of this year’s extended series of rate hikes.\n\nThe 59% figure is, however, a decrease on the 64% chance given in April, and the lowest level in the past 12 months.\n\nThe Federal Reserve meets on July 26 to discuss its next move on rates, which now sit between 5% and 5.25%. The CME FedWatch Tool predicts a 92.4% chance the Fed will enact a 25-basis-point rate increase this month, and a 7.6% chance it will leave the rate unchanged.\n\nInvestors are now awaiting the release of second-quarter earnings reports from major financial institutions on Friday. The releases will include reports from JPMorgan Chase, Wells Fargo, Citigroup, BlackRock and more.\n\nElsewhere, main stock indexes across Asia traded higher on Friday morning. China’s Shanghai Composite, Hong Kong’s Hang Seng, Japan’s Nikkei and South Korea’s Kospi all posted rises as of 12:30 p.m. in Hong Kong.\n\n(Updates with equity section.)"
    }
]