[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMTIvYml0Y29pbi1idGMtcHJpY2UtZmFsbHMtdG8tbG93ZXN0LWxldmVsLXNpbmNlLW1hcmNoLW9uLWxpcXVkaXR5LWlzc3Vlcy1yZWd1bGF0b3J5LXNjcnV0aW55Lmh0bWzSAYMBaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDUvMTIvYml0Y29pbi1idGMtcHJpY2UtZmFsbHMtdG8tbG93ZXN0LWxldmVsLXNpbmNlLW1hcmNoLW9uLWxpcXVkaXR5LWlzc3Vlcy1yZWd1bGF0b3J5LXNjcnV0aW55Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin briefly falls below $26,000, posts worst week since November - CNBC",
        "content": "In this article BTC.CM=\n\nETH.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nBitcoin. Nurphoto | Getty Images\n\nBitcoin traded at its lowest level since mid-March on Friday as volatility, driven by low liquidity, continued to hit cryptocurrency markets. Bitcoin ended the day lower by 2.58% at 26,181.46 after briefly hitting a low of 25,833.34 the lowest level since March 17, according to Coin Metrics. The biggest crypto asset by market cap posted a weekly loss of 11.25%, making it its worst week since Nov. 11. There are a number of issues facing crypto markets right now including low liquidity, a crackdown on the industry from regulators in the U.S. and macroeconomic worries.\n\nLiquidity issues\n\nBitcoin is up around 59% this year but prices have remained volatile, with low liquidity exacerbating moves higher and lower. Clara Medalie, director of research at Kaiko, said there has been a \"notable drop in market depth\" for bitcoin. Market depth refers to a market's ability to absorb relatively large buy and sell orders. When market depth is low, then relatively small orders can cause the price of an asset to move up or down in a substantial way. And the liquidity situation could be set to get worse after Bloomberg reported that Jane Street and Jump Crypto, two of the biggest crypto market makers, will take a step back from crypto trading in the U.S. as the country's regulators continue their crackdown on the nascent industry.\n\n\"While it is yet unclear the catalyst for today's sharp drop, the volatility is to be expected given the current state of liquidity, especially after larger market maker Jane Street and Jump Crypto revealed they were winding down their crypto exposure,\" Medalie said. Liquidity has been a big issue for crypto markets since the closure of Silvergate and Signature Bank — two key platforms that people used to buy into the crypto market.\n\nRegulatory scrutiny, congestion issues\n\nScrutiny from U.S. regulators on the digital currency industry has ramped up since the collapse of crypto exchange FTX last year. The U.S. Securities and Exchange Commission warned American crypto exchange Coinbase in March over potential securities law violations. Coinbase CEO Brian Armstrong said the company is preparing for a years-long court battle with the SEC. Meanwhile, the Commodity Futures and Trading Commission alleged in March that crypto exchange Binance violated trading rules.\n\nwatch now"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMTIvYml0Y29pbi1idGMtcHJpY2UtZmFsbHMtdG8tbG93ZXN0LWxldmVsLXNpbmNlLW1hcmNoLW9uLWxpcXVkaXR5LWlzc3Vlcy1yZWd1bGF0b3J5LXNjcnV0aW55Lmh0bWzSAYMBaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDUvMTIvYml0Y29pbi1idGMtcHJpY2UtZmFsbHMtdG8tbG93ZXN0LWxldmVsLXNpbmNlLW1hcmNoLW9uLWxpcXVkaXR5LWlzc3Vlcy1yZWd1bGF0b3J5LXNjcnV0aW55Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Bitcoin briefly falls below $26,000, posts worst week since November - CNBC",
        "content": "In this article BTC.CM=\n\nETH.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nBitcoin. Nurphoto | Getty Images\n\nBitcoin traded at its lowest level since mid-March on Friday as volatility, driven by low liquidity, continued to hit cryptocurrency markets. Bitcoin ended the day lower by 2.58% at 26,181.46 after briefly hitting a low of 25,833.34 the lowest level since March 17, according to Coin Metrics. The biggest crypto asset by market cap posted a weekly loss of 11.25%, making it its worst week since Nov. 11. There are a number of issues facing crypto markets right now including low liquidity, a crackdown on the industry from regulators in the U.S. and macroeconomic worries.\n\nLiquidity issues\n\nBitcoin is up around 59% this year but prices have remained volatile, with low liquidity exacerbating moves higher and lower. Clara Medalie, director of research at Kaiko, said there has been a \"notable drop in market depth\" for bitcoin. Market depth refers to a market's ability to absorb relatively large buy and sell orders. When market depth is low, then relatively small orders can cause the price of an asset to move up or down in a substantial way. And the liquidity situation could be set to get worse after Bloomberg reported that Jane Street and Jump Crypto, two of the biggest crypto market makers, will take a step back from crypto trading in the U.S. as the country's regulators continue their crackdown on the nascent industry.\n\n\"While it is yet unclear the catalyst for today's sharp drop, the volatility is to be expected given the current state of liquidity, especially after larger market maker Jane Street and Jump Crypto revealed they were winding down their crypto exposure,\" Medalie said. Liquidity has been a big issue for crypto markets since the closure of Silvergate and Signature Bank — two key platforms that people used to buy into the crypto market.\n\nRegulatory scrutiny, congestion issues\n\nScrutiny from U.S. regulators on the digital currency industry has ramped up since the collapse of crypto exchange FTX last year. The U.S. Securities and Exchange Commission warned American crypto exchange Coinbase in March over potential securities law violations. Coinbase CEO Brian Armstrong said the company is preparing for a years-long court battle with the SEC. Meanwhile, the Commodity Futures and Trading Commission alleged in March that crypto exchange Binance violated trading rules.\n\nwatch now"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93ZWVrbHktbWFya2V0LXdyYXAtYml0Y29pbi1kaXBzLTEzMTAzOTQ1NS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin dips to US$26,166 as memecoins flood the blockchain - Yahoo Finance",
        "content": "Bitcoin fell 9.42% from May 5 to May 12 to trade at US$26,365 as of 7:30 p.m. on Friday in Hong Kong. The world’s largest cryptocurrency by market capitalization has been trading under US$30,000 since April 19. Ether fell 7.3% over the week to US$1,765, losing the key US$1,800 support level.\n\nimage 3\n\nThe U.S. Consumer Price Index (CPI) released this week showed slower headline inflation in April, boosting hopes for the Federal Reserve to pause rate hikes next month. U.S. annual inflation slowed to 4.9% last month, from 5% in March, but gained 0.4% on the month.\n\nBitcoin briefly topped US$28,300 following the release of U.S. inflation data, but has since been trading lower.\n\n“Bitcoin dropped to US$26,900 after rejecting from the ~US$28,200 area. The reaction from the ~US$26,900 area was quite strong,” tweeted pseudonymous crypto analyst Rekt Capital. “The US$28,200 resistance is the resistance to beat if the price is to enjoy bullish momentum,” he added.\n\nThe global crypto market capitalization stood at US$1.1 trillion on Friday at 07:30 p.m. in Hong Kong, down 8.33% from US$1.2 trillion a week ago, according to CoinMarketCap data. Bitcoin’s US$510 billion market cap accounted for 46.3% of the market, while Ether’s US$214 billion accounted for 19.4%.\n\nBitcoin stuck in traffic\n\nIn another milestone for the world’s first blockchain, the number of non-zero balance Bitcoin addresses reached an all-time high of 46.6 million on Thursday, boosted by the surging interest in Ordinals, a protocol that allows data to be inscribed in the smallest monetary unit of Bitcoin, according to on-chain data analytics firm Glassnode.\n\nAs a result, Bitcoin congestion issues worsened. The network faced a growing backlog of transactions exacerbated by the network surpassing 5 million Ordinals inscriptions, fueled by the arrival of memecoins in the form of BRC-20 tokens, a fungible token standard built on Ordinals protocol. BRC-20 tokens surpassed US$1 billion in market capitalization on Tuesday.\n\nStory continues\n\nAdding to the negative market sentiment, Binance temporarily halted Bitcoin withdrawals twice in 12 hours on Monday, due to a “large volume of pending transactions.” The world’s largest crypto exchange resumed Bitcoin withdrawals on the same day, while Bitcoin fell as low as US$27,419 on Monday.\n\n“[The correction] was highly due to that since Binance witnessed historically-high BTC outflows,” said Leena ElDeeb, a research associate at 21.co, the parent company of 21Shares, an issuer of crypto exchange-traded products.\n\nBitcoin supply on exchanges fell to a five-year low of 5.84% on Tuesday, according to crypto analytics firm Santiment, indicating that long-term holders are increasingly opting for self-custody solutions.\n\n“The downtrend was also influenced by misinformation on Twitter, calling the congestion a denial of service attack when, in fact, it was increased demand that led to that congestion and skyrocketing transactions only meant that people were willing to pay more money for faster settlements,” ElDeeb added.\n\nNilesh Verma, crypto market analyst and founder of Crypto Granth consultancy in India, pointed to a separate thread of inaccurate information dissemination surrounding the U.S. government and its Bitcoin holdings as a significant factor in the declining value of Bitcoin this week.\n\nMisinformation emerged on Wednesday, stating that the U.S. government started selling its Bitcoin holdings. According to a March 31 court filing, the U.S. government seized 51,351.89 Bitcoin (worth US$1.4 billion) from Ross Ulbricht, the creator of the darknet marketplace Silk Road. The government sold 9,861 Bitcoin (US$279 million) on March 14 and is planning to sell the remaining 41,490 Bitcoin (US$1.1 billion) in four batches this year.\n\n“Someone shared fake news that the U.S. government will sell Bitcoin by showing the wrong labeling on the Arkham Platform… same we saw on April 27, when Bitcoin dropped from US$29,000 to US$27,000 on a glitch in the Arkhram platform,” Verma said.\n\nMarket analysis\n\nCrypto Granth’s Verma said that Bitcoin has strong support around US$26,111. “Bitcoin has to hold this support for continued bullish momentum. As of now, we can see a retest of this area. We believe that we will see strong buying near US$25,000-26,000. Weekly closing below US$26,000 will make Bitcoin bearish,” wrote Verma.\n\nBut Dr. Jeff Ross, founder and chief executive officer of investment firm Vailshire Capital Management, said Bitcoin needs to dip lower before starting a new rally.\n\n“Short-term momentum indicators need one more flush lower, ideally to US$24,000, to complete the healthy reset and begin the next leg higher, starting in mid-to-late May,” wrote Ross on his verified Twitter account.\n\nBiggest gainers:\n\nKava, the governance token of a layer-1 blockchain of the same name, was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap. Kava rose 17% to US$0.9204, after the protocol announced that its mainnet launch is one week away.\n\nBitcoin SV (BSV) – a fork of Bitcoin Cash focused on scalability – was this week’s second biggest gainer, rising 8.47% to US$35.88. The token saw a surge of interest after congestion on the Bitcoin network caused transaction fees to rise .\n\nSee related article: Central Banks’ actions move Crypto; Standard Chartered eyes $100K Bitcoin\n\nNext week: All eyes on the U.S. debt ceiling\n\nNegotiations over raising the U.S. debt ceiling of US$31.4 trillion to keep the government solvent continued on Wednesday, with congressional Republicans demanding more budget cuts. President Biden’s meeting with top Congress leaders planned for Friday was postponed to next week, three sources familiar with the matter told NBC News.\n\nInvestors are also anticipating Europe’s Harmonised Indices of Consumer Prices report, scheduled for next Wednesday. Euro area annual inflation for April is expected to come in at 7% for April, up from 6.9% in March, according to flash estimates from Eurostat, the European Union’s statistical office.\n\nIn the crypto space, liquid Ether staking protocol Lido Finance is preparing for its V2 upgrade, enabling Ether and staked Ether (stETH) withdrawals directly on the protocol. The Lido DAO is set to vote for the V2 upgrade starting today, from 10 p.m. Hong Kong time. With the community’s approval, the upgrade is expected to go live next Monday.\n\nWeb 3.0 gaming protocol Gala Games is also preparing for a contract upgrade on Monday. The protocol will issue its new Gala V2 token in a 1:1 ratio for all Gala token holders, while support and utility for the initial token will cease simultaneously. While most major exchanges signaled their support for the new token, Coinbase stated that it will not be supporting Gala V2.\n\nSee related article: Crypto and NFT Market Update – May 11th"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vZmVhdHVyZXMvMjAyMy1jcnlwdG8td2ludGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Crypto Winter 2022 Cost Bitcoin ($BTC) Holders More Than Cash - Bloomberg",
        "content": "Tales From the Crypto Winter Some acolytes lost faith, others blamed devils—and some went even harder. An essay exploring what happens when the prophecy of blockchain fails.\n\nShare this article\n\n\n\n\n\n\n\n\n\nOne day in early 2021, my old friend George called. I always enjoyed our catch-ups. We’d usually talk about dating, movies and his screenwriting career. But this time he steered the conversation toward a new topic: Bitcoin.\n\nGeorge, whose surname I’m omitting to protect his privacy, seemed genuinely eager for me to learn about the cryptocurrency. He sent me podcasts featuring blockchain “experts” and chart-heavy newsletters about “on-chain analytics.” George was planning his financial future around Bitcoin, he told me, and didn’t want his friends to get left behind. For a while, I ignored his appeals—the whole thing seemed complicated and vaguely annoying. But as the price of Bitcoin rose, his messages became more insistent. I agreed to look into it, and after “doing my own research,” i.e., half-listening to a few podcasts set on 2x speed, I decided to buy some.\n\nA series of cascading implosions caused the value of crypto to plummet last year. After that, George and I had a very different conversation. “Let me issue a blanket apology here,” George said. “It was the blind leading the blind.” Indeed, since I’d bought it, Bitcoin had lost three-quarters of its value. We were deep in what the blockchain faithful are calling crypto winter—an extended downturn that has yet to thaw.\n\nFor George, apologizing to me wasn’t the hardest part. He’d persuaded his Chinese immigrant parents to refinance their mortgage and lend him $50,000 to invest in Bitcoin. He stored the funds on Celsius, a sort of crypto bank where they could accrue interest. The company collapsed into bankruptcy, and now the money was frozen, much of it likely lost. “I said, ‘I’m really sorry, I’m deeply ashamed, and I will commit ritual seppuku if you demand it,’ ” he says. They didn’t, but he said he plans to pay them back when he can.\n\nIt seemed that George, like a lot of us who got caught up in crypto, was experiencing not just a financial loss but a kind of financial grief—a tangle of guilt, second-guessing and that awful feeling of having fallen for something. Bitcoin’s price has bounced back some since we spoke, but that’s little comfort if you’ve had your money stuck on a janky platform such as Celsius, or lost funds on Sam Bankman-Fried’s allegedly fraudulent FTX exchange, or held one of the now-worthless “altcoins” that popped up like mushrooms in a big rain during the pandemic trading boom. For many, crypto had become an identity, a way to feel smart and subversive and on the cutting edge of a new technology. What happens to that self-image when its foundation erodes? When instead of being someone’s savvy son or daughter, you are the sheepish adult child who has to explain where the family savings went? (Disclosure: I haven’t sold the tokens—mostly Bitcoin and Ether—that I bought near the top of the bull market, making me the object of delicate inquiry and gleeful mockery at family gatherings.)\n\nIt’s complicated. George, despite the frauds, the constant hacks and the market’s collapse, says he still has faith. “I still believe blockchain is a revolutionary development,” he says. “In 10, 20, 50 years, I do believe—I want to believe, badly—that we’ll look back and say Bitcoin was an invention on the scale of the printing press or the internet.”\n\nIn their seminal 1956 social psychology study, When Prophecy Fails, Leon Festinger, Henry Riecken and Stanley Schachter described how followers of a doomsday cult responded when their prophet’s precise predictions of apocalypse turned out to be false: They just pushed the date back. Some became even stronger believers and proselytized more. They’d already committed too much, perhaps quitting their jobs or giving away money, to accept that there was nothing to it. The study became a classic example of the “cognitive dissonance” that occurs when evidence contradicts one’s model of the world.\n\nI was curious how people in crypto were handling the dissonance. In the summer of 2021, with blockchain fervor in full swing, I wrote an article about crypto communities and found it useful to divide them into factions based on their favorite investment. There were the Bitcoin maximalists, who thought the OG token was the one true way to resist the scourges of modern finance and government; Ethereum hobbyists who regarded blockchains as a nifty Lego set for building new widgets; DeFi (decentralized finance) day traders who just gambled for the buzz. Each group came with its own values and culture. Today it feels more apt to sort people by their narratives of what the hell happened to crypto and where it all goes from here.\n\nTHE DOUBLE-DOWNERS\n\nAt a dude-heavy meet-up at a Midtown bar in New York in January, a group stood in a circle debating what had gone wrong with crypto. One guy blamed the large amount of “fluff” in the market, because anyone could spin a token out of nothing. Another pointed to the lack of transparency in many crypto institutions. A trader named Boris Friedman said that while people are currently “fearful” of crypto because of FTX, he expects the market to rebound in the next three to five years. “Long term, there will be more adoption,” he said.\n\nNearby, Corey Wilson, wearing two necklaces—one featuring the Egyptian Eye of Ra, the other the logo for a blockchain called HEX—sipped a margarita. Wilson told me that after losing funds on the crypto scam BitConnect and then making it all back and more with HEX, he still buys tokens every day. “I see a higher upside now that we’re in the lows of the market,” he said. (HEX is down almost 90% from its peak.)\n\nWilson buys tokens every day. Photographer: Levi Mandel for Bloomberg Businessweek He sports a necklace with the logo of a favorite token. Photographer: Levi Mandel for Bloomberg Businessweek\n\nRich Etienne, an engineer in Florida who lost about $100,000 in the Celsius collapse, said in a phone interview that he has a good feeling about the market now. He says it’s a matter of watching for patterns in the charts—“little movements, fake-outs, certain people shilling.” It’s less science than art, he says: “You start to get the vibe that this is it.”\n\nA Dutch institutional investor-turned-Bitcoin analyst who goes by the handle “Plan B” is best known for his charts predicting that Bitcoin would pass $100,000 in 2021. When that didn’t happen, his reputation took a hit. “You see a lot of hate,” Plan B told me over Zoom. (Like many crypto influencers, he prefers to be identified by his handle out of concern for his safety.) He stands by his optimistic analysis, particularly his popular “stock-to-flow” model that predicts Bitcoin will continue trending upward as the issuance of new coins slows, as it was programmed to do by its pseudonymous creator, Satoshi Nakamoto. (The model assumes Bitcoin’s price is driven by scarcity, a logic familiar to gold bugs as well as Beanie Babies collectors.) Plan B now estimates that by 2028, Bitcoin will be worth $100,000 to $1 million, up from about $27,000 today. The date, in other words, moved back a few years. “For me it’s the long game,” he says. He adds that his bet on Bitcoin is all-or-nothing: “It’s either going to zero or it’s going to be the successor to the US dollar.”\n\nAcademics say this type of thinking—doubling down on one’s conviction, despite a crash—is consistent with the psychology of both trading and gambling. Investors are more apt to sell assets that have gained in value than to let go of ones that have dropped; it’s a phenomenon known as the disposition effect. There are different explanations for this, says Tobin Hanspal, assistant professor of finance at the Vienna University of Economics and Business. One is that traders with plunging assets become risk-loving because they feel they have nothing to lose. Another says they’re avoiding feelings of regret. People “do not want to admit defeat or face the realization that they made a mistake,” Hanspal says. (This is me.)\n\nBlec blames the collapse on “too much trust.” Photographer: Tamara Reynolds for Bloomberg Businessweek\n\nOthers keeping the faith describe the crash as a purge that proves crypto must return to its roots. The whole point of Bitcoin, according to Satoshi’s white paper, was to allow people to transact money directly with “no central authority” like a government or bank, or a company such as FTX or Celsius. This idea of decentralization has a totemic power for some, with a resonance that seems as much emotional as intellectual.\n\nChris Blec, who writes an online newsletter called the Blec Report, has made a career out of criticizing any crypto project that deviates from the original purpose of blockchain technology. Companies such as FTX were “abusing Satoshi’s invention,” he says. “They’re using it in ways it’s not intended to be used.” Blec argues that most of the projects that collapsed over the past year suffered from the same problem: “too much trust.” Any system that requires trusting human beings is inherently unstable, he says, and can create a bubble. “Every time it bursts,” he says, “more people understand that.”\n\nThose Who Knew\n\nFrances Coppola wasn’t always a crypto hater. “When Bitcoin first came out, I was quite keen on it,” she says. The UK-based writer on economics and banking had long seen a need for an alternative to the bank-based payment system, and cryptocurrencies seemed like a promising development. But by 2021 she’d turned skeptic. That summer she posted a Twitter thread explaining why even decentralized crypto systems run by code could be prone to catastrophic failure. She argued that they’d suffer digital bank runs if investors started to pull their money out quickly, which their algorithms wouldn’t be able to stop. “The algos are built on the assumption that humans never panic and stampede for the exit, ignoring the overwhelming evidence that they do,” she wrote.\n\nHer tweets caught the attention of Do Kwon, the creator of TerraUSD, a then-hot coin that used a decentralized algorithm to maintain a steady value of $1. TerraUSD was a popular substitute for US dollars among DeFi traders, and it could be reinvested to earn high yields. “I don’t debate the poor on Twitter,” Kwon tweeted in Coppola’s thread.\n\nCoppola foresaw the crypto panic. Photographer: Jack Kenyon for Bloomberg Businessweek\n\n“Schadenfreude is the right term”\n\n“That came back to haunt him,” Coppola says. “I ended up being cited in the court case.” She then bursts into a merry laugh. In May 2022, TerraUSD unraveled in exactly the type of bank run Coppola had described. Kwon is now being sued by investors and has been charged with fraud by US prosecutors; he’s denied wrongdoing. For Coppola, the crash, which TerraUSD’s fall partly triggered, has been bittersweet. She doesn’t want to take pleasure in it, given how many people have gotten hurt. And yet, “I did feel a bit, ‘So there,’ ” she says. “Schadenfreude is the right term.”\n\nCoppola belongs to a community of skeptics who have long pushed back against the narratives spread by crypto boosters. During the bull market, many of those boosters swamped the skeptics with derision. “We did take a lot of abuse from the ‘Have fun staying poor’ crowd,” she says. Since the crash, the skeptics have taken a victory lap. “I wouldn’t say people are opening bottles of Champagne,” says Amy Castor, another prominent crypto critic, who works as a freelance journalist and writes a reader-supported blog. But they’ve seen their ranks grow. “There were a handful of us before, screaming into the abyss,” she says. “Now there’s a lot more.”\n\nThe Blame-casters\n\nIn crypto, 2022 was the year of the “bad actor.” (As in malefactor, not Steven Seagal.) Bad actors were suddenly everywhere, tainting the purity of the otherwise unassailable technology. Instead of pointing to structural problems in crypto—the lack of investor protections, say, or the fundamental question of how to prevent a fully decentralized, largely anonymous currency from being used to fund terrorism—believers blamed individuals (or groups) for … acting badly.\n\nThe baddest actor of all, of course, is the man now known across the cryptosphere as “Scam Bankrupt-Fraud.” Molly White, a vocal crypto critic who runs the site Web3 Is Going Just Great, has argued that Bankman-Fried is a useful scapegoat for crypto fans. “It’s very convenient for them to say, ‘This isn’t our problem, this is just one guy,’ ” she said in a recent podcast interview. (Bankman-Fried, who’s facing criminal fraud charges, has denied wrongdoing.)\n\nOther scapegoats abound. On Fox News’ Tucker Carlson Tonight, guest host Tulsi Gabbard highlighted an unfounded theory that American politicians were channeling US taxpayer dollars to Ukraine, which was then investing in FTX, which was then funneling money back to Democrats. (Bankman-Fried was a major Democratic donor; his colleague Ryan Salame gave millions to Republicans.) Ukraine’s deputy minister of digital information tweeted that Ukraine “never invested any funds into FTX.”\n\nThe Communitarians\n\nPerhaps the only byword in the crypto lexicon as powerful as decentralization has been community. Across Twitter and Telegram and Discord, owners of the same asset gather to discuss the greatness of their asset, share memes about it and trash competing assets. This was particularly true of nonfungible tokens, or NFTs, those bits of digital art that in some cases traded for hundreds of thousands of dollars. Now, previously bustling Discord chatrooms lie quiet, and a few remaining fans wait for updates. “Devs, do something” is the pitiable refrain, the digital equivalent of poking a dead animal with a stick.\n\n“It’s very funny to look back and think, ‘Were we all just drunk or something?’ ”\n\nThe dissolution of these communities has left scars—some of them literal. In February 2022, Emma Crudgington was scrolling Twitter at her office in Brisbane, Australia, when she spotted a hot new NFT. It was called Tasty Bones, and the logo featured a cartoonish skull with an ice cream cone upended on it. The art was “cute,” she thought, and, more important, the project was getting lots of hype. Demand for access to the presale exceeded supply, and she needed a way to distinguish herself. “I was like, ‘What’s the most extreme thing I can do?’ ” she says. She got the logo tattooed on her arm. She posted a photo of it on the Tasty Bones community Discord chat, and the creators put her on the list to receive two NFTs. She ended up selling them a week later, netting around $12,000.\n\nCrudgington may lose her Tasty Bones tattoo. Photographer: Tammy Law for Bloomberg Businessweek\n\nNow that the project has disintegrated—a Tasty Bones currently sells for about $50—Crudgington is amused by the tattoo. “It’s a great story to tell people,” she says. “It’s very funny to look back and think, ‘Were we all just drunk or something?’ ” She expects she’ll have it removed or covered up. Crudgington is still involved in an NFT project called Sappy Seals. She spends hours every week talking to a subgroup of Seals owners called Sappy Sisters. “It’s like having a personal therapist,” she says. “We talk about the most random things, from physics to lip gloss.” Crudgington says the Sisters have transcended their origins. They’ve raised money for a dog charity, rallied support for a community member with cancer and discussed sexual harassment in the NFT space. She can be vague describing the nature of their bond (“the theme of the community is community”) but says the connection is authentic.\n\nConnection in crypto can be dicey. White has coined the term “predatory community” for the way it can foster bonds at the expense of its users, much like a multilevel marketing scheme. When emotions get tied up with money and a sense of belonging, it can be hard to see oneself and one’s peers clearly, especially in communities that tout virtuous causes. Such environments are ripe for manipulation. Countless projects have gotten “rugged,” or sold off by the creators, leaving investors with worthless tokens. Those that simply fizzle produce the same result.\n\nCrudgington says she recognizes such communities can be exploitative, but the Sappy Sisters are different. “There’s no monetization,” she says. “There’s no ulterior motive behind it.”\n\nThe Ones Who Step Away\n\nIn 2021, after working half a decade in traditional finance—TradFi is the dismissive crypto term—Jill took a job at a firm specializing in DeFi. (She requested I not use her full name so she can speak candidly about her work.) She was drawn to the idea of transaction without go-betweens, particularly in a world where governments can prohibit bank accounts from being used for, say, sex work or birth control. “For a while, I drank that Kool-Aid,” she says. “Then I realized no one had any idea about OFAC rules.” (The Office of Foreign Assets Control enforces sanctions against terrorist organizations.) The more she learned about the technical aspects of crypto, the less it seemed about financial freedom than “getting around capital controls.” She says she was also put off by its consumerist culture of boats and models: “I did not fit in.” She recently left that job and is looking for work in TradFi.\n\nThe idea of boats and models didn’t seem to bother another former crypto worker I spoke to, who asked not to be named at all. (People in this group are skittish about talking.) After making six figures in the 2021 bull run, he dropped out of college and took a job at a crypto venture capital firm. His thinking was simple, he says: School sucked, and he wanted to be free, make a ton of money and have a Lambo. The business model in the space was to find a project, promote it, wait for its tokens to rise and take profits. This didn’t seem sinister because everyone was making money. When he did think about the morality of his work, it wasn’t hard to justify; if anyone was getting rugged, it was rich people. In retrospect, he says it was callous not to think about what was going on under the hood.\n\nAfter the market began to slip, what had felt to him like a positive-sum game suddenly seemed zero-sum. He realized that if anyone was making outsize returns, that wasn’t happening for free. A lot of projects his firm had invested in had failed, and he found it hard to get excited about the new ones. I asked if his colleagues believed the projects had real value. They do, he says, and he thinks that’s delusional. Last fall he went back to school.\n\nIn early March, I told David, my normally laconic barber, that I was writing about crypto winter. He perked up and, taking long pauses between snips of hair while gesturing with his scissors, delivered an analysis of what he assured me is the next big thing: artificial intelligence tokens.\n\nIndeed, after the debut of ChatGPT in November, crypto tokens with some link to AI technology (the connection isn’t always clear) have rocketed in value. Multiple people I spoke with mentioned AI integration as a possible path forward for crypto. Perhaps chatbots will be able to spend cryptocurrency to accomplish their tasks. Maybe blockchain technology can help verify authenticity in a world saturated with deepfakes. The influential Twitter account @punk6529 recently posted, “AI will unveil what crypto’s true purpose is.” The tone of these conversations—hushed, commiserating, vaguely oracular, comically speculative—felt familiar. I told David I’d look into it. I have not.\n\nBeam is a freelance journalist. He made his first crypto purchase in April 2021; he hasn’t made a trade since April 2022."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vZmVhdHVyZXMvMjAyMy1jcnlwdG8td2ludGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 12 May 2023 07:00:00 GMT",
        "title": "Crypto Winter 2022 Cost Bitcoin ($BTC) Holders More Than Cash - Bloomberg",
        "content": "Tales From the Crypto Winter Some acolytes lost faith, others blamed devils—and some went even harder. An essay exploring what happens when the prophecy of blockchain fails.\n\nShare this article\n\n\n\n\n\n\n\n\n\nOne day in early 2021, my old friend George called. I always enjoyed our catch-ups. We’d usually talk about dating, movies and his screenwriting career. But this time he steered the conversation toward a new topic: Bitcoin.\n\nGeorge, whose surname I’m omitting to protect his privacy, seemed genuinely eager for me to learn about the cryptocurrency. He sent me podcasts featuring blockchain “experts” and chart-heavy newsletters about “on-chain analytics.” George was planning his financial future around Bitcoin, he told me, and didn’t want his friends to get left behind. For a while, I ignored his appeals—the whole thing seemed complicated and vaguely annoying. But as the price of Bitcoin rose, his messages became more insistent. I agreed to look into it, and after “doing my own research,” i.e., half-listening to a few podcasts set on 2x speed, I decided to buy some.\n\nA series of cascading implosions caused the value of crypto to plummet last year. After that, George and I had a very different conversation. “Let me issue a blanket apology here,” George said. “It was the blind leading the blind.” Indeed, since I’d bought it, Bitcoin had lost three-quarters of its value. We were deep in what the blockchain faithful are calling crypto winter—an extended downturn that has yet to thaw.\n\nFor George, apologizing to me wasn’t the hardest part. He’d persuaded his Chinese immigrant parents to refinance their mortgage and lend him $50,000 to invest in Bitcoin. He stored the funds on Celsius, a sort of crypto bank where they could accrue interest. The company collapsed into bankruptcy, and now the money was frozen, much of it likely lost. “I said, ‘I’m really sorry, I’m deeply ashamed, and I will commit ritual seppuku if you demand it,’ ” he says. They didn’t, but he said he plans to pay them back when he can.\n\nIt seemed that George, like a lot of us who got caught up in crypto, was experiencing not just a financial loss but a kind of financial grief—a tangle of guilt, second-guessing and that awful feeling of having fallen for something. Bitcoin’s price has bounced back some since we spoke, but that’s little comfort if you’ve had your money stuck on a janky platform such as Celsius, or lost funds on Sam Bankman-Fried’s allegedly fraudulent FTX exchange, or held one of the now-worthless “altcoins” that popped up like mushrooms in a big rain during the pandemic trading boom. For many, crypto had become an identity, a way to feel smart and subversive and on the cutting edge of a new technology. What happens to that self-image when its foundation erodes? When instead of being someone’s savvy son or daughter, you are the sheepish adult child who has to explain where the family savings went? (Disclosure: I haven’t sold the tokens—mostly Bitcoin and Ether—that I bought near the top of the bull market, making me the object of delicate inquiry and gleeful mockery at family gatherings.)\n\nIt’s complicated. George, despite the frauds, the constant hacks and the market’s collapse, says he still has faith. “I still believe blockchain is a revolutionary development,” he says. “In 10, 20, 50 years, I do believe—I want to believe, badly—that we’ll look back and say Bitcoin was an invention on the scale of the printing press or the internet.”\n\nIn their seminal 1956 social psychology study, When Prophecy Fails, Leon Festinger, Henry Riecken and Stanley Schachter described how followers of a doomsday cult responded when their prophet’s precise predictions of apocalypse turned out to be false: They just pushed the date back. Some became even stronger believers and proselytized more. They’d already committed too much, perhaps quitting their jobs or giving away money, to accept that there was nothing to it. The study became a classic example of the “cognitive dissonance” that occurs when evidence contradicts one’s model of the world.\n\nI was curious how people in crypto were handling the dissonance. In the summer of 2021, with blockchain fervor in full swing, I wrote an article about crypto communities and found it useful to divide them into factions based on their favorite investment. There were the Bitcoin maximalists, who thought the OG token was the one true way to resist the scourges of modern finance and government; Ethereum hobbyists who regarded blockchains as a nifty Lego set for building new widgets; DeFi (decentralized finance) day traders who just gambled for the buzz. Each group came with its own values and culture. Today it feels more apt to sort people by their narratives of what the hell happened to crypto and where it all goes from here.\n\nTHE DOUBLE-DOWNERS\n\nAt a dude-heavy meet-up at a Midtown bar in New York in January, a group stood in a circle debating what had gone wrong with crypto. One guy blamed the large amount of “fluff” in the market, because anyone could spin a token out of nothing. Another pointed to the lack of transparency in many crypto institutions. A trader named Boris Friedman said that while people are currently “fearful” of crypto because of FTX, he expects the market to rebound in the next three to five years. “Long term, there will be more adoption,” he said.\n\nNearby, Corey Wilson, wearing two necklaces—one featuring the Egyptian Eye of Ra, the other the logo for a blockchain called HEX—sipped a margarita. Wilson told me that after losing funds on the crypto scam BitConnect and then making it all back and more with HEX, he still buys tokens every day. “I see a higher upside now that we’re in the lows of the market,” he said. (HEX is down almost 90% from its peak.)\n\nWilson buys tokens every day. Photographer: Levi Mandel for Bloomberg Businessweek He sports a necklace with the logo of a favorite token. Photographer: Levi Mandel for Bloomberg Businessweek\n\nRich Etienne, an engineer in Florida who lost about $100,000 in the Celsius collapse, said in a phone interview that he has a good feeling about the market now. He says it’s a matter of watching for patterns in the charts—“little movements, fake-outs, certain people shilling.” It’s less science than art, he says: “You start to get the vibe that this is it.”\n\nA Dutch institutional investor-turned-Bitcoin analyst who goes by the handle “Plan B” is best known for his charts predicting that Bitcoin would pass $100,000 in 2021. When that didn’t happen, his reputation took a hit. “You see a lot of hate,” Plan B told me over Zoom. (Like many crypto influencers, he prefers to be identified by his handle out of concern for his safety.) He stands by his optimistic analysis, particularly his popular “stock-to-flow” model that predicts Bitcoin will continue trending upward as the issuance of new coins slows, as it was programmed to do by its pseudonymous creator, Satoshi Nakamoto. (The model assumes Bitcoin’s price is driven by scarcity, a logic familiar to gold bugs as well as Beanie Babies collectors.) Plan B now estimates that by 2028, Bitcoin will be worth $100,000 to $1 million, up from about $27,000 today. The date, in other words, moved back a few years. “For me it’s the long game,” he says. He adds that his bet on Bitcoin is all-or-nothing: “It’s either going to zero or it’s going to be the successor to the US dollar.”\n\nAcademics say this type of thinking—doubling down on one’s conviction, despite a crash—is consistent with the psychology of both trading and gambling. Investors are more apt to sell assets that have gained in value than to let go of ones that have dropped; it’s a phenomenon known as the disposition effect. There are different explanations for this, says Tobin Hanspal, assistant professor of finance at the Vienna University of Economics and Business. One is that traders with plunging assets become risk-loving because they feel they have nothing to lose. Another says they’re avoiding feelings of regret. People “do not want to admit defeat or face the realization that they made a mistake,” Hanspal says. (This is me.)\n\nBlec blames the collapse on “too much trust.” Photographer: Tamara Reynolds for Bloomberg Businessweek\n\nOthers keeping the faith describe the crash as a purge that proves crypto must return to its roots. The whole point of Bitcoin, according to Satoshi’s white paper, was to allow people to transact money directly with “no central authority” like a government or bank, or a company such as FTX or Celsius. This idea of decentralization has a totemic power for some, with a resonance that seems as much emotional as intellectual.\n\nChris Blec, who writes an online newsletter called the Blec Report, has made a career out of criticizing any crypto project that deviates from the original purpose of blockchain technology. Companies such as FTX were “abusing Satoshi’s invention,” he says. “They’re using it in ways it’s not intended to be used.” Blec argues that most of the projects that collapsed over the past year suffered from the same problem: “too much trust.” Any system that requires trusting human beings is inherently unstable, he says, and can create a bubble. “Every time it bursts,” he says, “more people understand that.”\n\nThose Who Knew\n\nFrances Coppola wasn’t always a crypto hater. “When Bitcoin first came out, I was quite keen on it,” she says. The UK-based writer on economics and banking had long seen a need for an alternative to the bank-based payment system, and cryptocurrencies seemed like a promising development. But by 2021 she’d turned skeptic. That summer she posted a Twitter thread explaining why even decentralized crypto systems run by code could be prone to catastrophic failure. She argued that they’d suffer digital bank runs if investors started to pull their money out quickly, which their algorithms wouldn’t be able to stop. “The algos are built on the assumption that humans never panic and stampede for the exit, ignoring the overwhelming evidence that they do,” she wrote.\n\nHer tweets caught the attention of Do Kwon, the creator of TerraUSD, a then-hot coin that used a decentralized algorithm to maintain a steady value of $1. TerraUSD was a popular substitute for US dollars among DeFi traders, and it could be reinvested to earn high yields. “I don’t debate the poor on Twitter,” Kwon tweeted in Coppola’s thread.\n\nCoppola foresaw the crypto panic. Photographer: Jack Kenyon for Bloomberg Businessweek\n\n“Schadenfreude is the right term”\n\n“That came back to haunt him,” Coppola says. “I ended up being cited in the court case.” She then bursts into a merry laugh. In May 2022, TerraUSD unraveled in exactly the type of bank run Coppola had described. Kwon is now being sued by investors and has been charged with fraud by US prosecutors; he’s denied wrongdoing. For Coppola, the crash, which TerraUSD’s fall partly triggered, has been bittersweet. She doesn’t want to take pleasure in it, given how many people have gotten hurt. And yet, “I did feel a bit, ‘So there,’ ” she says. “Schadenfreude is the right term.”\n\nCoppola belongs to a community of skeptics who have long pushed back against the narratives spread by crypto boosters. During the bull market, many of those boosters swamped the skeptics with derision. “We did take a lot of abuse from the ‘Have fun staying poor’ crowd,” she says. Since the crash, the skeptics have taken a victory lap. “I wouldn’t say people are opening bottles of Champagne,” says Amy Castor, another prominent crypto critic, who works as a freelance journalist and writes a reader-supported blog. But they’ve seen their ranks grow. “There were a handful of us before, screaming into the abyss,” she says. “Now there’s a lot more.”\n\nThe Blame-casters\n\nIn crypto, 2022 was the year of the “bad actor.” (As in malefactor, not Steven Seagal.) Bad actors were suddenly everywhere, tainting the purity of the otherwise unassailable technology. Instead of pointing to structural problems in crypto—the lack of investor protections, say, or the fundamental question of how to prevent a fully decentralized, largely anonymous currency from being used to fund terrorism—believers blamed individuals (or groups) for … acting badly.\n\nThe baddest actor of all, of course, is the man now known across the cryptosphere as “Scam Bankrupt-Fraud.” Molly White, a vocal crypto critic who runs the site Web3 Is Going Just Great, has argued that Bankman-Fried is a useful scapegoat for crypto fans. “It’s very convenient for them to say, ‘This isn’t our problem, this is just one guy,’ ” she said in a recent podcast interview. (Bankman-Fried, who’s facing criminal fraud charges, has denied wrongdoing.)\n\nOther scapegoats abound. On Fox News’ Tucker Carlson Tonight, guest host Tulsi Gabbard highlighted an unfounded theory that American politicians were channeling US taxpayer dollars to Ukraine, which was then investing in FTX, which was then funneling money back to Democrats. (Bankman-Fried was a major Democratic donor; his colleague Ryan Salame gave millions to Republicans.) Ukraine’s deputy minister of digital information tweeted that Ukraine “never invested any funds into FTX.”\n\nThe Communitarians\n\nPerhaps the only byword in the crypto lexicon as powerful as decentralization has been community. Across Twitter and Telegram and Discord, owners of the same asset gather to discuss the greatness of their asset, share memes about it and trash competing assets. This was particularly true of nonfungible tokens, or NFTs, those bits of digital art that in some cases traded for hundreds of thousands of dollars. Now, previously bustling Discord chatrooms lie quiet, and a few remaining fans wait for updates. “Devs, do something” is the pitiable refrain, the digital equivalent of poking a dead animal with a stick.\n\n“It’s very funny to look back and think, ‘Were we all just drunk or something?’ ”\n\nThe dissolution of these communities has left scars—some of them literal. In February 2022, Emma Crudgington was scrolling Twitter at her office in Brisbane, Australia, when she spotted a hot new NFT. It was called Tasty Bones, and the logo featured a cartoonish skull with an ice cream cone upended on it. The art was “cute,” she thought, and, more important, the project was getting lots of hype. Demand for access to the presale exceeded supply, and she needed a way to distinguish herself. “I was like, ‘What’s the most extreme thing I can do?’ ” she says. She got the logo tattooed on her arm. She posted a photo of it on the Tasty Bones community Discord chat, and the creators put her on the list to receive two NFTs. She ended up selling them a week later, netting around $12,000.\n\nCrudgington may lose her Tasty Bones tattoo. Photographer: Tammy Law for Bloomberg Businessweek\n\nNow that the project has disintegrated—a Tasty Bones currently sells for about $50—Crudgington is amused by the tattoo. “It’s a great story to tell people,” she says. “It’s very funny to look back and think, ‘Were we all just drunk or something?’ ” She expects she’ll have it removed or covered up. Crudgington is still involved in an NFT project called Sappy Seals. She spends hours every week talking to a subgroup of Seals owners called Sappy Sisters. “It’s like having a personal therapist,” she says. “We talk about the most random things, from physics to lip gloss.” Crudgington says the Sisters have transcended their origins. They’ve raised money for a dog charity, rallied support for a community member with cancer and discussed sexual harassment in the NFT space. She can be vague describing the nature of their bond (“the theme of the community is community”) but says the connection is authentic.\n\nConnection in crypto can be dicey. White has coined the term “predatory community” for the way it can foster bonds at the expense of its users, much like a multilevel marketing scheme. When emotions get tied up with money and a sense of belonging, it can be hard to see oneself and one’s peers clearly, especially in communities that tout virtuous causes. Such environments are ripe for manipulation. Countless projects have gotten “rugged,” or sold off by the creators, leaving investors with worthless tokens. Those that simply fizzle produce the same result.\n\nCrudgington says she recognizes such communities can be exploitative, but the Sappy Sisters are different. “There’s no monetization,” she says. “There’s no ulterior motive behind it.”\n\nThe Ones Who Step Away\n\nIn 2021, after working half a decade in traditional finance—TradFi is the dismissive crypto term—Jill took a job at a firm specializing in DeFi. (She requested I not use her full name so she can speak candidly about her work.) She was drawn to the idea of transaction without go-betweens, particularly in a world where governments can prohibit bank accounts from being used for, say, sex work or birth control. “For a while, I drank that Kool-Aid,” she says. “Then I realized no one had any idea about OFAC rules.” (The Office of Foreign Assets Control enforces sanctions against terrorist organizations.) The more she learned about the technical aspects of crypto, the less it seemed about financial freedom than “getting around capital controls.” She says she was also put off by its consumerist culture of boats and models: “I did not fit in.” She recently left that job and is looking for work in TradFi.\n\nThe idea of boats and models didn’t seem to bother another former crypto worker I spoke to, who asked not to be named at all. (People in this group are skittish about talking.) After making six figures in the 2021 bull run, he dropped out of college and took a job at a crypto venture capital firm. His thinking was simple, he says: School sucked, and he wanted to be free, make a ton of money and have a Lambo. The business model in the space was to find a project, promote it, wait for its tokens to rise and take profits. This didn’t seem sinister because everyone was making money. When he did think about the morality of his work, it wasn’t hard to justify; if anyone was getting rugged, it was rich people. In retrospect, he says it was callous not to think about what was going on under the hood.\n\nAfter the market began to slip, what had felt to him like a positive-sum game suddenly seemed zero-sum. He realized that if anyone was making outsize returns, that wasn’t happening for free. A lot of projects his firm had invested in had failed, and he found it hard to get excited about the new ones. I asked if his colleagues believed the projects had real value. They do, he says, and he thinks that’s delusional. Last fall he went back to school.\n\nIn early March, I told David, my normally laconic barber, that I was writing about crypto winter. He perked up and, taking long pauses between snips of hair while gesturing with his scissors, delivered an analysis of what he assured me is the next big thing: artificial intelligence tokens.\n\nIndeed, after the debut of ChatGPT in November, crypto tokens with some link to AI technology (the connection isn’t always clear) have rocketed in value. Multiple people I spoke with mentioned AI integration as a possible path forward for crypto. Perhaps chatbots will be able to spend cryptocurrency to accomplish their tasks. Maybe blockchain technology can help verify authenticity in a world saturated with deepfakes. The influential Twitter account @punk6529 recently posted, “AI will unveil what crypto’s true purpose is.” The tone of these conversations—hushed, commiserating, vaguely oracular, comically speculative—felt familiar. I told David I’d look into it. I have not.\n\nBeam is a freelance journalist. He made his first crypto purchase in April 2021; he hasn’t made a trade since April 2022."
    }
]