[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1jcm9zcy1ib3JkZXItcGF5bWVudHMtbW9yZS1zdWJzdGFudGlhbC10aGFuLXB1YmxpYy1kYXRhLXNob3dz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Cross-Border Payments More 'Substantial' Than Public Data Shows - Nasdaq",
        "content": "A new study conducted by the Bank of International Settlements (BIS) has shed light on the true extent of Bitcoin's impact on cross-border payments, revealing that its significance may be even greater than previously believed.\n\nAccording to a report by Reuters, the findings challenge conventional assumptions and underscore the growing relevance of Bitcoin in the global financial landscape.\n\nConducted by the organization's test lab, the study sought to comprehensively examine Bitcoin's role in cross-border transactions. While public data often provides a partial view of cryptocurrency activities, this study utilized a novel approach, including the development of a new \"global Bitcoin mapping system\" that also reportedly incorporates non-public data from private companies.\n\nDetails about the proprietary system were not provided by the report. Notably, however, it did acknowledge that its data is likely imperfect given it remains possible to use Bitcoin anonymously and without identification.\n\nThe system tracked transactions, addresses, and wallet movements to paint a more complete picture of Bitcoin's cross-border payment activities, the report said.\n\nMoreover, the study revealed that Bitcoin was increasingly being used for remittances, providing a lifeline for individuals in regions with limited access to traditional banking services. Its borderless nature and ease of use made it an attractive option for sending funds across international boundaries.\n\nThe findings of this study are expected to stimulate further discussions among regulators, financial institutions, and policymakers regarding the role of cryptocurrencies in cross-border transactions.\n\nFounded in the 1930s, the BIS is owned by member central banks, and its primary goal is to \"foster international monetary and financial cooperation.\"\n\nAs such, the report demonstrates a continued interest in Bitcoin among global central banks, some who want a stronger regulatory approach to the technology.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1jcm9zcy1ib3JkZXItcGF5bWVudHMtbW9yZS1zdWJzdGFudGlhbC10aGFuLXB1YmxpYy1kYXRhLXNob3dz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Cross-Border Payments More 'Substantial' Than Public Data Shows - Nasdaq",
        "content": "A new study conducted by the Bank of International Settlements (BIS) has shed light on the true extent of Bitcoin's impact on cross-border payments, revealing that its significance may be even greater than previously believed.\n\nAccording to a report by Reuters, the findings challenge conventional assumptions and underscore the growing relevance of Bitcoin in the global financial landscape.\n\nConducted by the organization's test lab, the study sought to comprehensively examine Bitcoin's role in cross-border transactions. While public data often provides a partial view of cryptocurrency activities, this study utilized a novel approach, including the development of a new \"global Bitcoin mapping system\" that also reportedly incorporates non-public data from private companies.\n\nDetails about the proprietary system were not provided by the report. Notably, however, it did acknowledge that its data is likely imperfect given it remains possible to use Bitcoin anonymously and without identification.\n\nThe system tracked transactions, addresses, and wallet movements to paint a more complete picture of Bitcoin's cross-border payment activities, the report said.\n\nMoreover, the study revealed that Bitcoin was increasingly being used for remittances, providing a lifeline for individuals in regions with limited access to traditional banking services. Its borderless nature and ease of use made it an attractive option for sending funds across international boundaries.\n\nThe findings of this study are expected to stimulate further discussions among regulators, financial institutions, and policymakers regarding the role of cryptocurrencies in cross-border transactions.\n\nFounded in the 1930s, the BIS is owned by member central banks, and its primary goal is to \"foster international monetary and financial cooperation.\"\n\nAs such, the report demonstrates a continued interest in Bitcoin among global central banks, some who want a stronger regulatory approach to the technology.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1jcm9zcy1ib3JkZXItcGF5bWVudHMtbW9yZS1zdWJzdGFudGlhbC10aGFuLXB1YmxpYy1kYXRhLXNob3dz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Cross-Border Payments More 'Substantial' Than Public Data Shows - Nasdaq",
        "content": "A new study conducted by the Bank of International Settlements (BIS) has shed light on the true extent of Bitcoin's impact on cross-border payments, revealing that its significance may be even greater than previously believed.\n\nAccording to a report by Reuters, the findings challenge conventional assumptions and underscore the growing relevance of Bitcoin in the global financial landscape.\n\nConducted by the organization's test lab, the study sought to comprehensively examine Bitcoin's role in cross-border transactions. While public data often provides a partial view of cryptocurrency activities, this study utilized a novel approach, including the development of a new \"global Bitcoin mapping system\" that also reportedly incorporates non-public data from private companies.\n\nDetails about the proprietary system were not provided by the report. Notably, however, it did acknowledge that its data is likely imperfect given it remains possible to use Bitcoin anonymously and without identification.\n\nThe system tracked transactions, addresses, and wallet movements to paint a more complete picture of Bitcoin's cross-border payment activities, the report said.\n\nMoreover, the study revealed that Bitcoin was increasingly being used for remittances, providing a lifeline for individuals in regions with limited access to traditional banking services. Its borderless nature and ease of use made it an attractive option for sending funds across international boundaries.\n\nThe findings of this study are expected to stimulate further discussions among regulators, financial institutions, and policymakers regarding the role of cryptocurrencies in cross-border transactions.\n\nFounded in the 1930s, the BIS is owned by member central banks, and its primary goal is to \"foster international monetary and financial cooperation.\"\n\nAs such, the report demonstrates a continued interest in Bitcoin among global central banks, some who want a stronger regulatory approach to the technology.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmVjb25vbWlzdC5jb20vc2NpZW5jZS1hbmQtdGVjaG5vbG9neS8yMDIzLzEwLzA0L2RpZC1iaXRjb2luLWxlYWstZnJvbS1hbi1hbWVyaWNhbi1zcHktbGFi0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Did bitcoin leak from an American spy lab? - The Economist",
        "content": "Listen to this story. Enjoy more audio and podcasts on iOS or Android Your browser does not support the <audio> element.\n\nT he origins of covid-19 remain unknown. Most scientists think it jumped from wild animals to humans at a meat market in Wuhan. But it is also possible it escaped from a virology research lab in the same city.\n\nNow a similar argument has broken out around bitcoin, the first and most used cryptocurrency. Bitcoin’s accepted origin is that it was invented by Satoshi Nakamoto, a pseudonymous coder, who published a paper describing it in 2008 before later vanishing from sight.\n\nBut a theory circulating online holds that bitcoin was dreamed up by the National Security Agency ( NSA ), an American spy agency that also does cutting-edge cryptography research. “I think it was a shuttered internal R & D project which one researcher thought was too good to lay fallow on the shelf and chose to secretly release,” tweeted Nic Carter, a prominent bitcoin fan. Mr Carter and his fellow travellers think they have a smoking gun: a paper written in 1996 by NSA employees entitled “How to make a mint: the cryptography of anonymous electronic cash”. And the paper cites work by a researcher named “Tatsuaki Okamoto”.\n\nBut the paper is more smoke than gun. It is merely a survey of cryptographic ideas that might be used in digital cash. Unlike bitcoin, whose big innovation was its decentralised design, the schemes in the paper rely on an overseeing authority. It discusses the risks that electronic cash would pose to taxation and law enforcement. “Thus the idea that the NSA would develop a decentralised, trustless cryptocurrency as a ‘monetary bioweapon’ that would impair their own government’s functions” is implausible,” writes David Rosenthal, a cryptocurrency sceptic, on his blog.\n\nJust another conspiracy theory, then? Almost certainly. But something similar has happened before. In 1997 it emerged that Clifford Cocks, a mathematician at GCHQ , Britain’s NSA equivalent, had secretly invented a vital cryptographic technology that underlies both bitcoin and the internet in general, several years before the trio of American researchers who had been given credit.\n\nA better parallel between bitcoin and covid-19 may be that, like the virus, the cryptocurrency has proved hard to kill off. Despite a big crash last year, a bitcoin is still worth around $27,500. ■"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWVkZ2VzLWhpZ2hlci0yNy03ay0yMjIwMzMxNjAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Edges Higher to $27.7K; AVAX, XRP Jump as Crypto Market Settles - Yahoo Finance",
        "content": "Bitcoin (BTC) edged higher Wednesday, gaining 1.3% over the past 24 hours as headwinds in traditional markets alleviated and crypto markets calmed after Monday’s sharp rally.\n\nThe largest cryptocurrency by market capitalization was changing hands at around $27,700 during U.S. afternoon hours. Earlier this week, BTC briefly rose above $28,000 then pared some of its gains.\n\nCrypto services provider Matrixport’s analysts noted Wednesday that BTC broke out from its downtrend starting in the summer and turned the $27,000 level into support.\n\nThe report said BTC’s price could be headed toward $30,000. However, the initial surge on Monday lacked a significant follow-through, as BTC trading volume dropped to $11 billion from $19 billion.\n\nEnigma Securities, an institutional digital asset liquidity and advisory firm, forecasted Wednesday in a report that low volatility on crypto markets will prevail for the next months.\n\nMarkets will likely consolidate and chop sideways in October, extending the window for accumulation for long-term investors, Vetle Lunde, senior analyst at K33 Research, noted in a market report.\n\nThe broader crypto market-proxy CoinDesk Market Index inched 0.8% higher.\n\nTraditional markets calmed after a turbulent Tuesday session as fresh jobs data pointed to a cooling U.S. labor market.\n\nThe ADP reported earlier today that the U.S. economy added 89,000 jobs in September, significantly less than the 153,000 analysts expected and August’s 180,000. Kathy Jones, chief fixed income strategist at Charles Schwab, noted in an X (formerly Twitter) post that this was the smallest rise in private sector jobs since 2020.\n\nThe S&P 500 index closed the day 0.8% higher, while the tech-heavy NASDAQ 100 index posted a 1.45% gain.\n\nEther (ETH) price underperformed and slid 0.7% as market participants digested the disappointing first days of the first futures-based exchange-traded funds in the U.S. K33 Research advised investors to rotate into BTC, citing the lack of medium-term catalysts for ETH.\n\nSolana’s native token SOL also pared its gains from earlier this week, slumping 2.3% in the past 24 hours. The token is still up over 20% in a week.\n\nLayer 1 blockchain Avalanche’s AVAX was a top performer among major cryptocurrencies, surging 7%. XRP also rallied over 3% earlier in the day as Ripple’s Asian arm obtained a license in Singapore and a favorable court ruling."
    }
]