[
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDYvMDYvYml0Y29pbi13aGlwc2F3cy1zZWMtc3Vlcy1jb2luYmFzZS1iaW5hbmNlLWNuYmMtY3J5cHRvLXdvcmxkLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin whipsaws after SEC sues Coinbase and Binance in two-day span - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin whipsaws after SEC sues Coinbase and Binance in two-day span: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Cory Klippsten, the CEO of Swan Bitcoin, discusses the impact of the SEC's continued crackdown on crypto exchanges."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMDYvYml0Y29pbi1pcy1saXR0bGUtY2hhbmdlZC1hZnRlci1zZWMtc3Vlcy1jb2luYmFzZS0uaHRtbNIBW2h0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA2LzA2L2JpdGNvaW4taXMtbGl0dGxlLWNoYW5nZWQtYWZ0ZXItc2VjLXN1ZXMtY29pbmJhc2UtLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin rallies above $27,000 after SEC sues Coinbase, alleging its an unregistered broker - CNBC",
        "content": "Cryptocurrency prices rose Tuesday after the Securities and Exchange Commission sued crypto services provider Coinbase.\n\nBitcoin climbed 6.3% to $27,155.16, according to Coin Metrics, recovering its losses from the previous day after the SEC sued Binance. Earlier, it fell as low as $25,368.57, its lowest level since March. Ether gained nearly 5% to trade at $1,896.19.\n\nOn Tuesday, the SEC filed a lawsuit in New York federal court alleging that Coinbase has been acting as an unregistered broker and exchange. The agency demanded that the company be \"permanently restrained and enjoined\" from continuing to do so.\n\n\"If there's a real value in these crypto tokens then compliance will build trust and the business model might change,\" SEC Chair Gary Gensler said in an interview Tuesday with CNBC's \"Squawk on the Street.\" \"What we're doing at the SEC is pro-innovation because the capital markets really don't work.\"\n\n\"There's a lot of work here for the crypto field but we stand ready to work to get them into compliance,\" he added."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMDYvYml0Y29pbi1pcy1saXR0bGUtY2hhbmdlZC1hZnRlci1zZWMtc3Vlcy1jb2luYmFzZS0uaHRtbNIBW2h0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA2LzA2L2JpdGNvaW4taXMtbGl0dGxlLWNoYW5nZWQtYWZ0ZXItc2VjLXN1ZXMtY29pbmJhc2UtLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin rallies above $27,000 after SEC sues Coinbase, alleging its an unregistered broker - CNBC",
        "content": "Cryptocurrency prices rose Tuesday after the Securities and Exchange Commission sued crypto services provider Coinbase.\n\nBitcoin climbed 6.3% to $27,155.16, according to Coin Metrics, recovering its losses from the previous day after the SEC sued Binance. Earlier, it fell as low as $25,368.57, its lowest level since March. Ether gained nearly 5% to trade at $1,896.19.\n\nOn Tuesday, the SEC filed a lawsuit in New York federal court alleging that Coinbase has been acting as an unregistered broker and exchange. The agency demanded that the company be \"permanently restrained and enjoined\" from continuing to do so.\n\n\"If there's a real value in these crypto tokens then compliance will build trust and the business model might change,\" SEC Chair Gary Gensler said in an interview Tuesday with CNBC's \"Squawk on the Street.\" \"What we're doing at the SEC is pro-innovation because the capital markets really don't work.\"\n\n\"There's a lot of work here for the crypto field but we stand ready to work to get them into compliance,\" he added."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNi1qdW5lLTIwMjMvYXJ0aWNsZXNob3cvMTAwNzg3OTk5LmNtc9IBvQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNi1qdW5lLTIwMjMvYW1wX2FydGljbGVzaG93LzEwMDc4Nzk5OS5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin slips below $25,800 after SEC sues Binance; BNB, Dogecoin shed over 7% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading in the red on Tuesday after the U.S. Securities and Exchange Commission (SEC) filed suit against Binance, accusing the exchange giant of violating securities laws.Bitcoin (BTC) declined 4% to $25,764, whereas Ethereum (ETH) was below the $1,850 level. BTC volume stood at approximately $20.32 billion, rising 76% in the last 24 hours.\"The latest development between Binance and SEC has spooked the global crypto market resulting in a bloodbath across digital assets. The market will respond sharply as the Binance-SEC saga unfolds; we should brace ourselves for a choppy market in the coming weeks. Regulatory clarity is the need of the hour for the global crypto ecosystem,\" Shivam Thakral, CEO of BuyUcoin, said.The world's biggest cryptocurrency exchange Binance and its CEO Changpeng Zhao have been sued by the US Securities and Exchange Commission (SEC), which alleged in a June 5 court filing that the firm operated a \"web of deception\" that included artificially inflating its trading volumes and commingling customer funds.The US Commodity Futures Trading Commission (CFTC) also sued Binance over regulatory violations in March.Other top crypto tokens were also trading lower. BNB and Solana declined by over 7%. Meanwhile, Dogecoin XRP , Cardano, Polygon and Polkadot also traded with cuts. The global cryptocurrency market cap was trading lower around $1.09 trillion, falling 4% in the last 24 hours.The total volume in DeFi is currently at $3.46 billion, which is 7.5% of the total crypto market 24-hour volume. The volume of all stablecoins is now $43.78 billion, which is 94% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $499 billion. Bitcoin’s dominance is currently 45.78%, a decrease of 0.08% over the day, according to CoinMarketCap.\"The sell-off in crypto markets as a reaction to US SEC suing Binance has brought Bitcoin to its 3-month low. There is a strong confluence of support for BTC at the $25,200 range that will likely hold to form a 'higher low' for the asset and provide a bounce for the next leg up. Markets will likely remain volatile in the upcoming week,\" Vikram Subburaj, CEO of Giottus Crypto Platform, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 37, with a neutral outlook. The Stochastic %K (14, 3, 3) at 24 and the Average Directional Index (14) at 21 indicate a Neutral outlook as well.\"The MACD Level (12, 26), at −317, indicates Sell. The Stochastic RSI Fast (3, 3, 14, 14) is Neutral at 18 and William's Percentage indicates Buy at -88,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.43 hours, IST on June 6, 2023)Bitcoin $25,764 -3.94%Ethereum $1,816 -2.96%Tether $1.00 0.01%BNB $277 -7.92%XRP $0.5115 -4.95%Cardano $0.3513 -6.36%Dogecoin $0.06659 -7.18%Polygon $0.8318 -6.14%Solana $19.96 -7.32% Litecoin $87.57 -6.1%Polkadot $5.08 -3.6%Tron $0.07886 -3.17%Shiba Inu $0.000008019 -6.07%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1pcy1sZXNzLXRoYW4tYS15ZWFyLWF3YXktZnJvbS1hLW11Y2gtaHlwZWQtZXZlbnQtdGhhdC1oYXMtaGlzdG9yaWNhbGx5LXNlZW4taXRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 06 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Is Less Than a Year Away From a Much-Hyped Event That Has Historically Seen Its Price Soar - Nasdaq",
        "content": "***Money is not a client of any investment adviser featured on this page. The information provided on this page is for educational purposes only and is not intended as investment advice. Money does not offer advisory services.***\n\nThe crypto market has been laying somewhat low in 2023 compared to its massive price swings that made constant headlines in recent years.\n\nBut we’re now less than a year out from an event that has historically seen bitcoin’s price rise during the lead-up and aftermath: bitcoin halving, which happens once every four years.\n\nThe regular event limits the amount of new bitcoins that come to the market. Because of the historical gains around bitcoin halving, some investors are hoping that the next halving, expected in April or May of 2024, could spur the start of a crypto bull run (a period of prices going up). That would be welcome news for investors, given thatbitcoin prices— along with those of other financial assets, like stock prices — have taken a hit in the last year amid interest rates hikes and recession fears.\n\nBut can we actually expect a price boost as we head towards the next halving? Here’s what crypto investors should know.\n\nWhat is bitcoin halving?\n\nBitcoin halving has everything to do with bitcoin miners, who are involved in the process of creating new bitcoins. That includes everyone from individual hobbyists to corporate enterprises, with anywhere from one to thousands of specialized computers. These computers work constantly at the singular task of solving mathematical problems for the bitcoin network. If a computer solves a problem, it is rewarded with the bitcoin that is minted as a result of its work.\n\nBitcoin halving causes the total reward that miners receive for their work to be slashed in half. Miners currently earn 6.25 bitcoin for solving a problem, but they will begin to receive only 3.125 bitcoin for their efforts after the halving. From its very inception, bitcoin’s creator only ever intended for the supply to reach 21 million coins — and the goal of the bitcoin halving is to decrease the supply of new bitcoin overtime.\n\nMuch of the rhetoric around halving as a cause for a crypto rally has to do with this tightening of rewards. Many investors see the event as increasing scarcity of bitcoin and say it will inflate the coin’s value because of supply and demand economics.\n\nBitcoin halving has historically come with price gains\n\nSo far, there has been a bitcoin halving in 2012, 2016 and 2020 — and each one has seen the price of bitcoin rise in the months before and after the event.\n\nFollowing the 2016 halving, for instance, bitcoin’s price jumped to a record of nearly $20,000 per coin in 2017. In the year leading up to the May 2020 halving, bitcoin’s price rose around 20%. Between the halving and the end of the year, bitcoin’s price gained more than 200%.\n\nPast performance is no guarantee of how bitcoin’s price will do in the future, but there’s already chatter about the halving’s potential as fuel for a new price run.\n\nWill there be a crypto bull run?\n\nSome crypto experts are challenging the notion that the bitcoin halving is going to bring on a prolonged bull market. Crypto is still relatively new, so nothing should be taken as a certainty, says Omid Malekan, an adjunct professor at Columbia Business School. He adds that when it comes to the bitcoin network, nothing changes for anybody during a halving except for miners: There’s a misconception that the halving reduces the overall supply of bitcoin, but it really just reduces the amount of new bitcoin coming on the market, Malekan says. The plan is that there will still ultimately be 21 million coins, as was always intended. Plus, the halving is no surprise.\n\n“You would think [halving events] would be priced in long before the actual event and not have any material impact,” Malekan says.\n\nThere’s a lot of back and forth about whether or not the halving is baked into bitcoin’s price, and whether the fact that bitcoins are scarce make them more valuable. Morningstar senior research analyst Madeline Hume’s recent analysis of bitcoin scarcity indicates that the argument that increasing the scarcity of new bitcoin pushes up its value is reductive. Hume notes that bitcoin looks on charts like its pricing operates in four-year cycles, which seems to indicate a correlation between scarcity and price increases. But she also notes that, excluding the “honeymoon periods” that followed previous halvings, the relationship between the production of new bitcoin and prices is more or less negligible.\n\n“[It could] be pure coincidence that bitcoin’s halving cycles arrived just as narratives around crypto reached their frothy peaks, and the relationship is totally spurious,” Hume says. She goes on to also say that a major flaw in these scarcity-based analyses is that they all predict bitcoin’s price will keep going up, which is impossible to know.\n\nCould the bitcoin halving cause prices to drop?\n\nIt’s possible that the bitcoin halving could actually cause the cryptocurrency’s price to go down, Malekan says. The slashing of miners’ rewards will make the practice less profitable and miners who are already struggling could be forced to shut down when their potential profits are cut in half, Malekan says. This could hurt the network’s security since there would be fewer people monitoring activity.\n\n“A lot of miners are suffering during this bear market and unless prices recover or fees go substantially higher, some will be forced to shut down once the block reward falls,” Malekan says.\n\nIf there are gains, don’t expect them to be long-lived\n\nHanna Halaburda, an associate professor at NYU Stern School of Business, says that post-halving gains are nothing more than hype, and that while prices may go up in the near-term, investors shouldn’t expect a long-lasting bull market thanks to the halving alone.\n\n“The only real explanation for why the price goes up is that we start talking about bitcoin more,” Halaburda says.\n\nThe halving, like many happenings in the world of crypto, gets a lot of social media chatter in its lead-up. Halaburda points to studies that say there is a relationship between social media posting and crypto price fluctuations. (Nowadays, a tweet from Elon Musk can send dogecoin’s price soaring.) She adds that newer investors learning about the coin’s limited new supply could help along a short-lived speculative rally, since they may have not been aware of the halving before.\n\nHalaburda also says investors need to keep in mind that the halving won’t do anything to improve the use cases for bitcoin, which is ultimately what matters most for ensuring the longevity of the network.\n\nMore from Money:\n\n‘Free’ Games Like Candy Crush and Counter-Strike Are Wrecking People’s Finances\n\nCrypto Graveyard: Thousands of Coins Listed in Recent Years Have Already Failed\n\nStock Ownership Is at Its Highest Level Since 2008\n\n© Copyright 2023 Money Group, LLC. All Rights Reserved.\n\nThis article originally appeared on Money.com and may contain affiliate links for which Money receives compensation. Opinions expressed in this article are the author's alone, not those of a third-party entity, and have not been reviewed, approved, or otherwise endorsed. Offers may be subject to change without notice. For more information, read Money’s full disclaimer.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]