[
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTA2L2RjZy1zLWJpdGNvaW4tbWluaW5nLWZpcm0tZm91bmRyeS10by1zdG9wLW9mZmVyaW5nLWZyZWUtc2VydmljZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Digital Currency Group (DCG)'s Bitcoin Mining Foundry to Start Charging - Bloomberg",
        "content": "Crypto-mining firm Foundry, which is owned by embattled conglomerate Digital Currency Group, is going to start charging users a fee for its Bitcoin mining services.\n\nFoundry USA will begin levying a pool fee on members between April 19 and April 22, according to a notice it circulated to clients on April 6. The Rochester, New York-based company has provided its services for free since launching the mining pool in 2019."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcHBsZS1oaWRkZW4tYml0Y29pbi1tYW5pZmVzdG8tZXZlcnktMTI1OTE4ODgwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Apple has hidden a bitcoin manifesto in every Mac since 2018, says a tech blogger who discovered it by accident - Yahoo Finance",
        "content": "Apple CEO Tim Cook attends an Apple store in Shanghai Thomson Reuters\n\nTechnologist Andy Baio wrote in an April 5 blog post that he found a PDF of the original bitcoin white paper on his Macbook.\n\nHe said Apple has seemingly hid the original crypto manifesto in \"every copy of macOS since Mojave in 2018.\"\n\nBaio shared how any users could locate the manifesto on their own Apple computers.\n\nTechnologist Andy Baio says he accidentally discovered a copy of Satoshi Nakamoto's bitcoin white paper on his Apple Mac computer.\n\n\"While trying to fix my printer today, I discovered that a PDF copy of Satoshi Nakamoto's Bitcoin whitepaper apparently shipped with every copy of macOS since Mojave in 2018,\" Baio wrote in an April 5 blog post.\n\nHe said he asked over a dozen of his friends and fellow Mac users to confirm, and the document was there for every single one, the file called \"simpledoc.pdf.\"\n\nTo find it, according to Baio's instructions, users can open the terminal and type the following command:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nFor those using macOS 10.14 or later, the document should immediately open in Preview as a PDF file, he explained.\n\nInsider tested out Baio's instructions and found a copy of the document stored on the computer running the most recent update of macOS.\n\nThe now-famous white paper, titled \"Bitcoin: A Peer-to-Peer Electronic Cash System\", was published in October, 2008 by the pseudonymous Satoshi Nakamoto. In it, the author lays out their thesis for the underlying mechanisms that power what is now the world's largest cryptocurrency by market value. The paper's abstract reads:\n\n\"A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution.\"\n\nBaio added that he found barely any other evidence online save for a lone Twitter thread from November 2020, with a user posting similar screenshots.\n\nStory continues\n\nBaio couldn't figure out why, of all documents, the original bitcoin manifesto was chosen to be included in Apple's operating system.\n\n\"Maybe,\" he wrote, \"it was just a convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.\"\n\nAs for token itself, bitcoin is hovering around $27,925 on Thursday, and has rallied 68% so far in 2023. The crypto has seen nearly 24% of those gains come in March amid broader banking turmoil and uncertainty.\n\nRead the original article on Business Insider"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2lucy10aWdodC1jb3JyZWxhdGlvbi1uYXNkYXEtc3B4LTA5NTMwMDA3MS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Tight Correlation With Nasdaq-SPX Ratio Muddies Safe-Haven Narrative - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nBitcoin's (BTC) price rose 23% in March as multiple U.S. banks went bust, bolstering fears that is a recession is coming.\n\nSeveral analysts have called the move higher a safe-haven rally – with the price gain being attributed to investors seeking shelter in the top cryptocurrency amid bank failures.\n\nBitcoin, however, rose in tandem with the Nasdaq to S&P 500, or NDX/SPX, ratio, a sign the rally was partly, if not mainly, driven by improved risk appetite stemming from hopes for an early Federal Reserve pivot in favor of liquidity-boosting rate cuts.\n\nThe NDX/SPX ratio measures the relative difference in valuation between technology stocks represented in the Nasdaq 100 and a basket of broader industry stocks from the S&P 500.\n\nThe ratio rose by 5.65% in March, capping its best monthly performance since February 2009, as banking sector instability saw traders aggressively reinstate bets that the Fed would cut rates later this year. Nasdaq surged nearly 10%, outperforming the S&P 500's 3.5% gain by a big margin.\n\nThe 90-day correlation coefficient between bitcoin and the NDX/SPX ratio rose from 0.81 to 0.90, signaling the strongest positive relationship between the two assets since June 2022. At press time, the correlation coefficient stood at 0.89. The positive correlation means on days when the ratio rises, bitcoin is more likely to do the same and vice versa.\n\n\"BTC is still trading like a risk asset,\" Noelle Acheson, the author of the popular Crypto is Macro Now newsletter, said, referring to the positive correlation between bitcoin and the NDX/SPX ratio. \"The rising NDX/SPX ratio means tech is doing better, which says risk sentiment is strong.\"\n\nTech stocks tend to be more sensitive to interest-rate expectations than the broader market. Thus a rising ratio is often equated with dovish Fed expectations and improved investor risk appetite that often percolates into other assets like cryptocurrencies, as observed in 2020 and early 2021. A falling ratio represents a sentiment against risky assets.\n\nStory continues\n\n\"Much like crypto, growth-style companies, which are expected to provide cash flows, or some form of fundamental value, further out into the future, find their performance more heavily influenced by shifts in interest rates. The Nasdaq 100 index, for example, is comprised of mostly growth-style sectors, such as technology, which are more sensitive to rising or falling rate expectations,\" Gabriel Selby, a research analyst at CF Benchmarks, told CoinDesk in an email.\n\nSelby added that as the NDX/SPX ratio is closely tracking the crypto market, it suggests interest-rate expectations are in the driver's seat and the pricing divergence between equities and crypto markets may not be as wide as initially thought.\n\nBitcoin and the NDX/SPX ratio bottomed out in late 2022. (TradingView/CoinDesk)\n\nThe correlation between bitcoin and the NDX/SPX ratio was consistently positive during the 2022 bear market and between May 2020 and March 2021, when the cryptocurrency rallied nearly tenfold to $60,000.\n\nIf that's not enough, both have been rallying in lockstep since early January. While bitcoin has risen nearly 70% this year, the ratio is up 11.26%.\n\nBitcoin's pause at around $28,000 since March 22 is consistent with the consolidation in the NDX/SPX ratio.\n\nWhile bitcoin's near-term prospects appear tied to gyrations in the NDX/SPX ratio, it could benefit from fears of fiat currency devaluations over time, according to Acheson.\n\n\"BTC is still (and always will be) a risk asset for traditional investors. It is also likely to be regarded as a safe haven,\" Acheson said. \"We are likely to see continued accumulation from longer-term investors interested in its currency debasement hedge properties, while short-term moves are dictated by shifting theories about what monetary liquidity will do.\""
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcHBsZXMtaGlkZGVuLWJpdGNvaW4td2hpdGUtcGFwZXItMTczMTQ3MDk2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Apple's Hidden Bitcoin White Paper the Latest in a Long List of Easter Eggs - Yahoo Finance",
        "content": "The Bitcoin white paper has been hiding in plain sight on Apple computers.\n\nBlogger Andy Baio recently revealed that an innocuous file, \"simpledoc.pdf,\" included as part of Apple operating system MacOS, contains a copy of the foundational text of Bitcoin, written by pseudonymous founder Satoshi Nakamoto in 2008.\n\n\"While trying to fix my printer today, I discovered that a PDF copy of Satoshi Nakamoto’s Bitcoin white paper apparently shipped with every copy of macOS since Mojave in 2018.\" Baio wrote on his Waxy blog, \"I’ve asked over a dozen Mac-using friends to confirm, and it was there for every one of them.\"\n\nAlthough Baio uncovered the mysterious easter egg on Satoshi Nakamoto's purported 48th birthday, April 5th, 2023, it’s not the first time it’s been sighted. Twitter user Joshua Dickens, a former Apple product designer, first discovered the white paper lurking in MacOS in 2020, but his tweet did not gain much traction.\n\nWeirdly, there's also a PDF of the original Bitcoin white paper: pic.twitter.com/JjPnI4fyzc — Josh D (@schwa23) November 28, 2020\n\nHow to find the Bitcoin white paper on Apple computers\n\nThe Bitcoin white paper can be found on Apple computers running macOS Mojave or later, by entering the following command into Terminal:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nAlternatively, using Finder, navigate to the Macintosh HD -> System -> Library -> Image Capture -> Devices, and open the Contents -> Resources folder, where you’ll find the file “simpledoc.pdf.”\n\nThe white paper appears to be used as a sample document for the image capture device Virtual Scanner II, with Apple site MacRumors suggesting that it could be a sample document for a system for transferring photos from iOS devices to Macs.\n\nStory continues\n\nIn his 2020 Twitter thread, Dickens highlighted another peculiar file, named cover.jpg, in the same folder. This has been confirmed to be a photograph taken by Thomas Hawk named Warning Alarm System, taken on Treasure Island in San Francisco in 2008.\n\nIn 2021, a thread was made on the Apple forum to discuss these findings but, again, gained very little traction. One user even commented, \"I find it hard to believe anyone cares.\"\n\nHow did the Bitcoin white paper end up on Apple computers?\n\nThe Bitcoin white paper, titled \"Bitcoin: A Peer-to-Peer Electronic Cash System,\" sets out the thesis for a decentralized cash based on a public ledger, essentially birthing Bitcoin and cryptocurrency in turn.\n\nIt is unclear why or how the Bitcoin white paper ended up on Apple systems. The company has a long history of including easter eggs in its products, however, including references to “Star Wars” and “Lord of the Rings.\" Earlier versions of the Macintosh operating system had hidden, playable versions of Tetris, Pong, and snake, and its MacOS and mobile application icons have always featured hidden messages or meanings.\n\nThe Bitcoin white paper appears to be the first crypto-related easter egg that has been found buried in Apple software.\n\nBaio himself speculated that the white paper could have been included as an in-joke by a “secret Bitcoin maxi” working at Apple, or simply included as a “convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.\"\n\nEx-App Store Director: 'Apple Had a Problem With Crypto From Day One'\n\nIts inclusion on Apple computers is particularly surprising given that the company’s former App Store director Philip Shoemaker has claimed that the company “had a problem with crypto from day one.” Speaking earlier this year, Shoemaker told Decrypt that Apple leadership considered cryptocurrency to be “a Ponzi scheme” and had maintained an arbitrarily harsh stance against crypto and NFTs.\n\nApple's insistence on imposing its 30% App Store fee on crypto apps prompted many developers to protest its policy, with some calling for a boycott of iOS.\n\nApple CEO Tim Cook Says He Holds Crypto\n\nIn a 2021 interview, Apple CEO Tim Cook said that he owns some crypto, but that the company had no plans to invest in it as an asset class. “I think it’s reasonable to own it as part of a diversified portfolio,” Cook said.\n\nDecrypt has reached out to Apple for comment and will update this article should we receive a response."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzVlMDZlMjdiLWE0NWQtNDM1Yy04OTdiLTNjOGUwZTFkMmI2ZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "El Salvador hasn't defaulted. Don't thank Bitcoin - Financial Times",
        "content": "Print this page\n\nDid a bitcoin per day keep default away? So El Salvador’s crypto-touting Presidente would have us believe.\n\nSince January, the country has led Citi’s emerging market sovereign bond index as the top outperformer year to date, with returns of 22.2 per cent.\n\nAnd in late January, Nayib Bukele announced (over Twitter, of course) that his country had dodged default. With help from the Central American Bank for Economic Integration (CABEI) and the Development Bank of Latin America (CAF), El Salvador repaid in full an $800mn bond which was set to mature a week later.\n\nThroughout his presidency, Bukele has spooked investors and conventional financiers like the IMF. The prices of its bonds began to tumble in mid 2021, after Bukele did normal dictator-like things, like firing judges and brutal crackdowns. Worse still was Bukele’s face plant into cryptomania. After embracing Bitcoin and buying up plenty (2,381 as of last November), the cryptocurrency selfishly collapsed.\n\nRating agency Fitch said a “default of some sort” was probable downgrading the country’s debt into junk territory. Moody’s did the same. At their nadir in July 2022, El Salvadoran bonds maturing in 2025 and 2027 traded at 26.38 and 25.13 cents on the dollar respectively.\n\nBut times have changed. In February, Moody’s changed its outlook from negative to stable, citing a “decreased risk of a credit event in the near term” and “manageable” repayments on the 2025 bond. Its 2025 and 2027 debts are now trading at 78.39 and 55.92 cents on the dollar.\n\nSo, ¿que pasa?\n\nSaviour complex\n\nAéter settling the bond, Bukele turned his wrath on the media. “[A]lmost every legacy international news outlet said that because of our “#Bitcoin bet”, El Salvador was going to default on its debt by January 2023,” he lamented, claiming there were “[l]iterally, hundreds of articles” that did so (while apparently struggling to find very many of them).\n\nIn the past year, almost every legacy international news outlet said that because of our “#Bitcoin bet”, El Salvador was going to default on its debt by January 2023 (since we had an 800 million dollar bond maturing today).\n\n\n\nLiterally, hundreds of articles https://t.co/rEiK7K13U4 — Nayib Bukele (@nayibbukele) January 24, 2023\n\nBukele has connected his making Bitcoin legal tender in September 2021 with the country’s improved economic fortunes, saying it gave El Salvador an “advantage in the new economic system” and spurred private investment from “people escaping censorship.”\n\nBut was it really Bitcoin that helped El Salvador dodge default? Perhaps the truth is much more mundane.\n\nEl Salvador regained many investors’ graces in July 2022, after announcing a $1.6bn bond buyback using special drawing rights from the IMF and a $200mn loan from the Central American Bank for Economic Integration. Buybacks in September and December reduced the principal for the 2025 bond to $348mn from $800mn.\n\n“The buybacks to some extent fixed their communication issues. They changed from catering to the crypto community back to catering to traditional investors,” says Esteban Tamayo, a Citi economist covering the region.\n\nThe country is even earning something of a reputation for financial prudence.\n\n“When you dig in, while El Salvador has its share of difficulties, the amount of debt is manageable and the budget is under control,” says Aaron Stern, chief investment officer and managing partner at Converium Capital.\n\nAccording to Fitch, the government’s fiscal deficit was 2.7 per cent of GDP in 2022, down from 5.7 per cent in 2021 and 10.1 per cent in 2020 - driven by the post-pandemic economic rebound, subsidy cuts and enhanced tax collection.\n\n“There was a windfall of revenues in 2022, because there was better compliance on income tax collection. If you’re in a somewhat autocratic country, you’re going to be motivated to pay your income taxes,” says Siobhan Morden, managing director Latin America fixed income strategy at Santander Investment Securities.\n\nPublic debt has also decreased to 78 per cent of GDP, down from 82.4 per cent in 2021.\n\nThe IMF says the economy is bound for moderate real GDP growth in 2023, 1.7 per cent, after expanding by 2.8 per cent the previous year. This is in line with its peers in Latin America and the Caribbean, but below its peers in the emerging and developing economies bracket.\n\nWhile Bukele’s anti-crime initiatives have not endeared him to human rights advocates, the “unprecedented reduction in crime” has contributed to robust economic and investment activity, says the IMF. Bukele asked congress to agree to a state of emergency last March, giving him the power to go after the notorious Barrio 18 and MS-13 gangs. However, he is accused of sweeping up and disappearing innocents as well as gang operatives. Less crime means there’s plenty to like for investors, as well as tourist fans of Bitcoin, surfing, and the Miss Universe pageant. Less so for critics of arbitrary detentions and cattle pen prisons.\n\nMeanwhile investors are heartened that the government has some additional levers to pull. In December the government passed a pension system reform bill which imposed a cap of $3,000 per month and gave it the ability to tap into private pension savings as a source of income. While dipping into pension pots would be a bold move for even a popular President, investors are somewhat assured that the option is open.\n\n“There is still budget flexibility… fiscal adjustment could occur under the inertia and spending constraints of dollarisation since you cannot spend what you cannot borrow, ” Santander said in a note.\n\nEl Salvage-ador\n\nIt also looks like Bukele’s bitcoin dalliance hasn’t sunk the ship — for now. Partially, this is because it has bombed. In the concluding statement of its January mission, the IMF said that the “risks have not materialised due to the limited Bitcoin use so far,” — according to the University of Chicago, less than 20 per cent of businesses accept it alongside the greenback. The mooted volcano bonds, meanwhile, are going out with a whimper — “our view is that traditional investors won’t participate – making it less likely that they will try to issue it,” said Tamayo. The experiment flopping has proven a help rather than a hindrance.\n\nBut whether the world’s most online dictator can keep the wheels on is a different question. The current account deficit rose to 8 per cent of GDP in 2022, due to skyrocketing import volumes, with international reserves falling to around two months of imports.\n\n“They’ve been smashing up their reserves, which is never a good plan,” says Stephen Bailey-Smith, a portfolio manager at Global Evolution. “For me they need to further tighten up monetarily, at least in order to maintain the spread with the Federal Reserve funds rate to stem import demand and prevent locals taking money offshore”.\n\nThe same pension reform which gave the government dipping rights also increased entitlements by 30 per cent, likely creating larger liabilities for El Salvador’s treasury.\n\nThe country’s domestic debt stock, 8.75 per cent of GDP, is high too, due to high spending and tax revenue hits during Covid-19. It still has nine international dollar bonds worth $6.4bn, roughly 30 per cent of its gross domestic product.\n\nAccess to international capital markets is a further issue, with Moody’s saying the 2025 bond payments are achievable “so long as multilateral disbursements remain around programmed levels.” An IMF deal also looks elusive.\n\n“If you have a high debt stock you’re not going to be able to reduce that overnight, you have to generate a primary fiscal surplus for several years to work that down,” says Siobhan Morden from Santander Investment Securities.\n\n“The problem that El Salvador has is that there are very limited financing alternatives, they’ve saturated their local markets and they do not get a lot of access to multilateral money, because they do not have an IMF program.”\n\nAnd with an election coming up, investors are fretting about whether Bukele can keep the purse strings tight.\n\n“He’s held expenditure quite flat, which is really encouraging. But can he continue to do that, in the year before the [February 2024] election?” asks Bailey-Smith.\n\nWhile it was Bukele’s crypto capers that captured headlines, his real priorities seem much more pedestrian.\n\nFurther reading\n\nEl Bagholder strikes again"
    }
]