[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTI0L3B1YmtleS1pcy1hLWNyeXB0by1iYXItaW4tbmV3LXlvcmstY2l0eS1pdC1kb2Vzbi10LWFjY2VwdC1iaXRjb2luLWJ0Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Jan 2023 08:00:00 GMT",
        "title": "There Is a Bitcoin Bar in New York City for Thirsty Crypto Fans (Podcast) - Bloomberg",
        "content": "It’s 2023 and the crypto community is hoping to pull out of its funk and put the blowups, bankruptcies and price slumps of the last year in the rear-view mirror.\n\nWhile some remain hopeful — churning out ideas for a more fruitful, and perhaps community-driven, crypto future — others are still smarting from last year’s carnage. But now, both groups have a place where they can toast a revival — or drown their sorrows — at a new Bitcoin-themed bar in New York. It’s called PubKey."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTAxLTI0L3BldGVyLXRoaWVsLWlzLW5vdC1hLWNyeXB0by10cnVlLWJlbGlldmVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Jan 2023 08:00:00 GMT",
        "title": "Peter Thiel Is Not a Crypto True Believer - Bloomberg",
        "content": "Welcome to Bw Daily, the new Bloomberg Businessweek newsletter, where we’ll bring you interesting voices, great reporting and the magazine’s usual charm every weekday. Let us know what you think by emailing our editor here! If this has been forwarded to you, click here to sign up. And without further ado …\n\nEven for Peter Thiel, the talk was a little … well … let’s just say it was “spirited.” Nine months ago, Thiel showed up at Bitcoin2022 in Miami Beach, speed-walked onto the stage and, with the manic intensity befitting a true believer, took out a stack of $100 bills. “It’s really weird: What is this?” Thiel asked, waving around the currency. “It’s probably not very good as toilet paper. It’s not good as wallpaper. It’s sort of this crappy fiat money.”"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTAxLTI0L2phbnVhcnktZWZmZWN0LWxlYWRzLXRvLWNyeXB0by13aW50ZXItdGhhdy1iaXRjb2luLWJ0Yy1yYWxsedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Jan 2023 08:00:00 GMT",
        "title": "January Effect Leads to Crypto Winter Thaw, Bitcoin (BTC) Rally - Bloomberg",
        "content": "Welcome to Bloomberg Crypto, our twice-weekly look at Bitcoin, blockchain and more. In today’s edition, Michael P. Regan takes the temperature of crypto’s January hot streak:\n\nIt’s often been said that “markets bottom on bad news,” and even a Hollywood scriptwriter couldn’t have written a harsher chapter of news for the crypto market than what we saw in November – the month when FTX went bankrupt and the savings and lending programs at Gemini and Genesis froze up.\n\n\n\nSo it’s tempting to think that this old trader cliche is at work when it comes to the almost 50% rebound in Bitcoin since its two-year low in late November. And who knows, maybe that’s the right take – after all, even “Sam coins,” or tokens linked to FTX’s former CEO Sam Bankman-Fried, have surged following brutal losses in 2022."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2MzMjhlYzIzLTgzZDktNDc1MS1iMzk3LTRlNjM0ZjcyNTc4MdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Jan 2023 08:00:00 GMT",
        "title": "Crypto miners seek financial lifeline with intense battle for bitcoins - Financial Times",
        "content": "Print this page\n\nCryptocurrency miners are turning their machines back on as the rallying price of bitcoin offers a vital lifeline to their cash-strapped businesses.\n\nThe value of the token has emerged from the doldrums to soar by more than a quarter this year against the dollar, incentivising the owners of huge warehouses of servers for mining to accelerate their use in the battle to secure more bitcoins.\n\nThe average hashrate, or the computing power directed towards mining bitcoin, rose to a record 280 exahash — or quintillion — operations per second on January 20, according to data from Hashrate Index, a mining information service.\n\nThe upsurge in activity is a sign that the battered sector may be crawling back to life after being buffeted by high energy costs and the slumping price of the cryptocurrency. The activity level has more than doubled from a low point in July, when the crypto market was hit by a credit crisis.\n\nMiners race each other to solve cryptographic puzzles that validate batches of transactions and create new blocks in the blockchain, a ledger of deals. That makes them the guarantors that bitcoin deals are trustworthy in a system that bypasses third parties such as banks and exchanges. The winner is rewarded with new coins.\n\nMany are sat on large quantities of mining equipment and capacity, bought with cheap money in 2021 and early 2022 in anticipation of turning a profit from the rising price of coins. But bitcoin prices slumped 65 per cent last year and energy prices soared, forcing many companies to switch off servers to save money. Others, such as Core Scientific, could not withstand the pressure and filed for bankruptcy.\n\n“The sentiment among miners is better than in a long time,” said Jaran Mellerud, an analyst at Hashrate Index. “For many bankruptcy threatened players, the sudden increase in the bitcoin price is a lifeline.”\n\nThe rebound has underpinned investor optimism in listed companies like Marathon Digital Holdings, which has soared 155 per cent this year, and Hut 8, which has climbed 134 per cent.\n\nBut miners still face a long haul back from the brink. Turning on their servers is expensive. An algorithm adjusts the “difficulty level” of mining bitcoin when new computers enter or exit the network, to ensure that the token is mined at its regular interval of roughly every 10 minutes.\n\nThe influx of miners has raised that level. It now takes miners a record 37tn hashes or guesses before verifying a block, according to BTC.com, so the losers expend ever-larger quantities of energy for nothing.\n\nThey are also facing a squeeze from politicians around the world, who see the miners’ computers sucking up large amounts of power, draining local resources or damaging the environment. Others see the profits they make as a taxable asset.\n\nThe Canadian provinces British Columbia and Manitoba have barred new connections to their grids for 18 months, while Hydro-Québec, Quebec’s public utility provider, has filed a request to reallocate 270 megawatts of power it had set aside for the mining industry.\n\nIn December, the lower house of Kazakhstan, host of the world’s third largest share of mining activity, approved a bill that will impose a corporate tax on miners and curtail their energy usage.\n\n\n\nParaguay, which has an abundance of cheap hydroelectric power, rejected legislation that would have capped the tariffs imposed on miners to 15 per cent.\n\n“Miners are becoming very selective about where they build out their infrastructure,” said Joe Burnett, an analyst at mining advisory firm Blockware Solutions. “A few years ago people were really just focused on cheap power but now it’s become a lot more critical to look at which political jurisdiction is more favourable and isn’t going to shut down our operations.”\n\nMiners say they have become an unfair target. The Bitcoin Mining Council, an industry group, estimated in July that just under 60 per cent of global mining energy use was sustainable, although the Cambridge Centre for Alternative Finance puts the figure at about 37 per cent.\n\n“There is a fake environmental argument being waged against the mining industry,” said Samir Tabar, chief strategist at Bit Digital, a mining company with operations in New York, Texas, Nebraska and Georgia. “It seems that no matter what bitcoin miners do, even if we use 100 per cent renewables, nothing is OK.”\n\nErcot, the organisation that operates Texas’s power grid, will launch a voluntary curtailment programme for large energy consumers like bitcoin miners to reduce their power use during high demand periods, until it develops a permanent regime to deal with shortages.\n\nBut that pinch point may provide an unexpected opportunity. Miners with power purchase agreements, which lock in the price they pay for energy, are able to sell power back to the grid. Riot and Hive Blockchain have earned $4.9mn and $3.1mn respectively in December.\n\n“Curtailment is the future of mining,” said Burnett. “If it doesn’t make financial sense to mine, you might as well sell [energy] back to somebody.”"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9sZWFkaW5nLWJpdGNvaW4tYXRtLW9wZXJhdG9yLWJpdGNvaW4tMTMzMDAwODczLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 24 Jan 2023 08:00:00 GMT",
        "title": "Leading Bitcoin ATM Operator Bitcoin Depot Strengthens U.S. Footprint with New Retail Partnerships - Yahoo Finance",
        "content": "GSR II Meteora Acquisition Corp. logo\n\nSigns 440 New Retail Locations Across North America, Continuing as Leading U.S. BTM Operator by Market Share\n\nBitcoin Depot Kiosk\n\nBitcoin Depot has approximately 7,000 kiosk locations across 47 states and ten Canadian provinces.\n\nATLANTA, Jan. 24, 2023 (GLOBE NEWSWIRE) -- Lux Vending, LLC dba Bitcoin Depot Inc. (“Bitcoin Depot”), a U.S.-based Bitcoin ATM (“BTM”) operator and leading fintech company, today announced multiple partnerships with convenience store brands with locations spanning across several states, including FastLane, Gas Express, High’s, Majors Management and Stinker Stores. These partnerships bolster Bitcoin Depot’s retail footprint across the U.S. and further support Bitcoin Depot’s mission to Bring Crypto to the Masses®.\n\n\"We are seeing more retailers understand the potential value of providing their customers access to Bitcoin through Bitcoin Depot ATMs and these partnerships reinforce our value proposition for notable retailers in the U.S.,” said Brandon Mintz, CEO and Founder of Bitcoin Depot.\n\nIncluding the partnerships announced today, Bitcoin Depot signed 440 additional retailer locations across North America in the second half of 2022.\n\nBitcoin Depot’s products and services provide an intuitive, quick and convenient process for converting cash into Bitcoin, giving users the ability to access the broader, digital financial system, including for purposes of making payments, transfers, remittances, online purchases and investments.\n\nBitcoin Depot’s footprint, supported by these new business partnerships, enables users to convert their cash into Bitcoin at approximately 7,000 kiosk locations and via BDCheckout in 48 states and ten Canadian provinces.\n\nRetail Partner Quotes\n\n\"I was really impressed to learn that Bitcoin Depot had a record Q3 in terms of revenue,” said Harry Sorrow, Regional Manager and Brand Ambassador for Majors Management. “This makes me feel very comfortable that I am working with one of the largest companies in the BTM industry.\"\n\n“Bitcoin Depot provided exactly what they said they would provide in their original proposal and kept their word in terms of the locations they were installing in and the timeline to complete the rollout,” said John Phelps Jr, Vice President of Marketing for High’s.\n\nStory continues\n\n“One of the great things about Bitcoin Depot is they provide a turnkey operation,” said Billy Colemire, Director of Marketing for Stinker Stores. “I don't have to worry about payment coming through on time or answering customer questions as they provide fantastic customer support to anyone in our stores using the Bitcoin ATM.”\n\n“I'm very excited to be working with Bitcoin Depot because of the potential impact that their Bitcoin ATMs can have on our business, and look forward to continuing to further our partnership,” said Gas Express CEO Amin Chitalwala. “Every square footage in retail space matters and what they pay for the space their kiosks take up is extremely attractive to us.”\n\n\"At FastLane, our mission statement is: ‘Modern Convenience, Timeless Values.’ The addition of Bitcoin Depot ATMs throughout our Missouri footprint is one way we are delivering our promise of modern convenience; while still providing our customers with the excellent service and the products they expect,” said Brian Baker, Marketing and Merchandising Strategist at FastLane.\n\nAbout Bitcoin Depot\n\nBitcoin Depot was founded in 2016 with the mission to connect those who prefer to use cash to the broader, digital financial system. Bitcoin Depot provides its users with simple, efficient and intuitive means of converting cash into cryptocurrency, which users can deploy in the payments, spending and investing space. Users can convert cash to cryptocurrencies at Bitcoin Depot’s kiosks and at thousands of name-brand retail locations through BDCheckout. The company has the largest market share in North America with approximately 7,000 kiosk locations. Learn more at www.bitcoindepot.com.\n\nOn August 24, 2022, Bitcoin Depot and GSR II Meteora Acquisition Corp. (“GSRM”), a special purpose acquisition corporation, entered into a definitive agreement for a business combination that would result in Bitcoin Depot becoming a public company listed on the Nasdaq under the ticker symbol “BTM.”\n\nAbout GSR II Meteora Acquisition Corp.\n\nGSR II Meteora Acquisition Corp. (NASDAQ: GSRM) is blank check company formed for the purpose of effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization or similar business combination with one or more businesses. Our management team is led by co-CEOs Gus Garcia and Lewis Silberman, President Anantha Ramamurti and CFO Joseph Tonnos. The company was formed in partnership with Meteora Capital, an investment adviser specializing in SPAC-related investments. For additional information, please visit www.gsrmet.com.\n\nNot an Offer\n\nThis communication does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval.\n\nForward-Looking Statements\n\nThe information in this press release includes “forward-looking statements” within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words such as “estimate,” “plan,” “project,” “forecast,” “intend,” “will,” “expect,” “anticipate,” “believe,” “seek,” “target” or other similar expressions that predict or indicate future events or trends or that are not statements of historical matters, although not all forward-looking statements contain such identifying words. These forward-looking statements include, but are not limited to, statements regarding estimates and forecasts of financial and performance metrics and expectations and timing related to potential benefits, terms and timing of the proposed business combination. These statements are based on various assumptions, whether or not identified in this press release, and on the current expectations of Bitcoin Depot’s and GSRM’s management and are not predictions of actual performance. These forward-looking statements are provided for illustrative purposes only and are not intended to serve as, and must not be relied on by any investor as, a guarantee, an assurance, a prediction or a definitive statement of fact or probability. Actual events and circumstances are difficult or impossible to predict and will differ from assumptions. Many actual events and circumstances are beyond the control of Bitcoin Depot and GSRM. These forward-looking statements are subject to a number of risks and uncertainties, including changes in domestic and foreign business, market, financial, political and legal conditions; the inability of the parties to successfully or timely consummate the proposed business combination, including the risk that any required regulatory approvals are not obtained, are delayed or are subject to unanticipated conditions that could adversely affect the combined company or the expected benefits of the proposed business combination or that the approval of the shareholders of GSRM or Bitcoin Depot is not obtained; failure to realize the anticipated benefits of the proposed business combination; risks relating to the uncertainty of the projected financial information with respect to Bitcoin Depot; future global, regional or local economic and market conditions; the development, effects and enforcement of laws and regulations; Bitcoin Depot’s ability to manage future growth; Bitcoin Depot’s ability to develop new products and services, bring them to market in a timely manner, and make enhancements to its platform; the effects of competition on Bitcoin Depot’s future business; the amount of redemption requests made by GSRM’s public shareholders; the ability of GSRM or the combined company to issue equity or equity-linked securities in connection with the proposed business combination or in the future; the outcome of any potential litigation, government and regulatory proceedings, investigations and inquiries; and those factors described or referenced in GSRM’s final initial public offering prospectus dated February 24, 2022 and its most recent Quarterly Report on Form 10-Q for the quarter ended September 30, 2022, in each case, under the heading “Risk Factors,” and other documents of GSRM filed, or to be filed, from time to time with the U.S. Securities and Exchange Commission (“SEC”). If any of these risks materialize or our assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. There may be additional risks that neither Bitcoin Depot nor GSRM presently know or that Bitcoin Depot and GSRM currently believe are immaterial that could also cause actual results to differ from those contained in the forward-looking statements. In addition, forward-looking statements reflect Bitcoin Depot’s and GSRM’s expectations, plans or forecasts of future events and views as of the date of this press release. Bitcoin Depot and GSRM anticipate that subsequent events and developments will cause Bitcoin Depot’s and GSRM’s assessments to change. However, while Bitcoin Depot and GSRM may elect to update these forward-looking statements at some point in the future, Bitcoin Depot and GSRM specifically disclaim any obligation to do so except as otherwise required by applicable law. These forward-looking statements should not be relied upon as representing Bitcoin Depot’s and GSRM’s assessments as of any date subsequent to the date of this press release. Accordingly, undue reliance should not be placed upon the forward-looking statements.\n\nAdditional Information About the Proposed Business Combination and Where to Find It\n\nThe proposed business combination will be submitted to shareholders of GSRM for their consideration. Copies of the proxy statement (a preliminary filing of which has been made with the SEC) will be mailed (if and when available) to all GSRM shareholders once definitive. GSRM also plans to file other documents with the SEC regarding the proposed business combination. GSRM will mail copies of the definitive proxy statement and other relevant documents to its shareholders as of the record date established for voting on the proposed business combination. GSRM’s shareholders and other interested persons are advised to read the preliminary proxy statement and any amendments thereto and, once available, the definitive proxy statement, as well as all other relevant materials filed or that will be filed with the SEC, in connection with GSRM’s solicitation of proxies for its special meeting of shareholders to be held to approve, among other things, the proposed business combination, because these documents will contain important information about GSRM, Bitcoin Depot and the proposed business combination. Shareholders may also obtain a copy of the preliminary proxy statement and, once available, the definitive proxy statement, as well as other documents filed with the SEC regarding the proposed business combination and other documents filed with the SEC by GSRM, without charge, at the SEC’s website located at www.sec.gov or by directing a request to Cody Slach or Alex Kovtun, (949) 574-3860, GSRM@gatewayir.com.\n\nParticipants in the Solicitation\n\nGSRM, Bitcoin Depot and certain of their respective directors, executive officers and other members of management and employees may, under SEC rules, be deemed to be participants in the solicitations of proxies from GSRM’s shareholders in connection with the proposed business combination. Information regarding the persons who may, under SEC rules, be deemed participants in the solicitation GSRM’s shareholders in connection with the proposed business combination is set forth in the preliminary proxy statement that has been filed with the SEC. You can find more information about GSRM’s directors and executive officers in GSRM’s final initial public offering prospectus dated February 24, 2022 and filed with the SEC on February 28, 2022. Additional information regarding the participants in the proxy solicitation and a description of their direct and indirect interests will be included in the definitive proxy statement and other relevant materials to be filed with the SEC when they become available. Shareholders, potential investors and other interested persons should read the proxy statement carefully when it becomes available before making any voting or investment decisions. You may obtain free copies of these documents from the sources indicated above.\n\nContacts:\n\nInvestors\n\nCody Slach, Alex Kovtun\n\nGateway Group\n\n949-574-3860\n\nGSRM@gatewayir.com\n\nMedia\n\nZach Kadletz, Brenlyn Motlagh, Ryan Deloney\n\nGateway Group\n\n949-574-3860\n\nGSRM@gatewayir.com\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/2e27d882-b375-4337-b6b0-96e84a05d0db\n\n\n\n"
    }
]