[
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9idGMtdW5hYmxlLXRvLWVzY2FwZS0yOGstcmFuZ2UtaXMtYS1jb3JyZWN0aW9uLWluY29taW5nLWJpdGNvaW4tcHJpY2UtYW5hbHlzaXMv0gFsaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2J0Yy11bmFibGUtdG8tZXNjYXBlLTI4ay1yYW5nZS1pcy1hLWNvcnJlY3Rpb24taW5jb21pbmctYml0Y29pbi1wcmljZS1hbmFseXNpcy8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "BTC Unable to Escape $28K Range, is a Correction Incoming? (Bitcoin Price Analysis) - CryptoPotato",
        "content": "Bitcoin’s recent upward trend has ceased, and the price has entered a phase of steady consolidation with no clear direction. The cryptocurrency is currently in a crucial zone, and in order to surpass the significant obstacle of the $30K resistance level, there must be an increase in demand and buying power.\n\nTechnical Analysis\n\nBy Shayan\n\nThe Daily Chart\n\nBitcoin has recently reached a critical zone of $30,000, which has proven to be a significant resistance level.. This level has halted Bitcoin’s recent impulsive rally and has resulted in a period of steady PA with low volatility.\n\nIf the BTC bulls push the price above this crucial region, it could likely lead to a long-term bullish trend.\n\nHowever, the divergence between the price and the RSI indicator suggests that a short-term correction is likely to occur soon. In this case, the $25K region, which aligns with the 50-day moving average, will become the primary support level for Bitcoin.\n\nThe 4-Hour Chart\n\nBitcoin has formed an ascending trendline on the 4-hour timeframe, which has been in place for several months and is currently acting as a support for the price. However, the cryptocurrency has been trapped between the ascending trendline and the $30K price region. A significant move above or below this crucial range will potentially eliminate any uncertainty and determine the mid-term outlook of the price.\n\nTo summarize recent movements, a short-term rejection followed by a consolidation correction stage seems likely for Bitcoin in the coming days.\n\nOn-chain Analysis\n\nBy Shayan\n\nBitcoin’s difficulty adjusts based on the behavior of miners and the latest movements in the hash rate. The difficulty level is readjusted depending on the number of miners currently using their machines to mine. When there are more active miners, the difficulty adjustment makes it harder for them to mine a block, which helps ensure that the rate of block production remains relatively constant.\n\nAccording to data from CryptoQuant, the most recent adjustment has led to a spike in the difficulty metric, resulting in a new all-time high. This indicates that more miners are willing to mine Bitcoins and keep their machines running, making the network more secure. Overall, this is a bullish sign for the cryptocurrency."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3RlY2guaGluZHVzdGFudGltZXMuY29tL3RlY2gvbmV3cy9lbG9uLW11c2stamFjay1kb3JzZXktZmluYWxseS1saW5rLXVwLW5vdy1ibG9jay10by1taW5lLWJpdGNvaW4tYXQtdGVzbGEtdGV4YXMtc29sYXItcGxhbnQtNzE2NDk0ODE1MDgxMzEuaHRtbNIBnAFodHRwczovL3RlY2guaGluZHVzdGFudGltZXMuY29tL2FtcC90ZWNoL25ld3MvZWxvbi1tdXNrLWphY2stZG9yc2V5LWZpbmFsbHktbGluay11cC1ub3ctYmxvY2stdG8tbWluZS1iaXRjb2luLWF0LXRlc2xhLXRleGFzLXNvbGFyLXBsYW50LTcxNjQ5NDgxNTA4MTMxLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Elon Musk, Jack Dorsey finally link-up! Now, Block to mine Bitcoin at Tesla Texas Solar Plant - HT Tech",
        "content": "Tesla Inc. is collaborating with Jack Dorsey's Block Inc. and crypto firm Blockstream Corp. to mine Bitcoin at a solar-powered battery manufacturing facility run by the automaker in Texas. The mining farm will tap into Tesla's energy storage technology with rechargeable large-scale batteries at the site, Adam Back, chief executive of Blockstream, said at the Bitcoin Conference 2022 in Miami. Back didn't specify the location.\n\nThe venture is the latest manifestation of the aligning interests of Tesla Chief Executive Elon Musk and Twitter co-founder Dorsey, including over the energy usage of Bitcoin. Earlier this week, Dorsey said he was happy that Musk joined the board of directors of Twitter after Musk revealed his sizable stake in the social media giant.\n\nMusk expressed his interest in Bitcoin and Dogecoin early last year and allowed Tesla customers to buy the electric cars with Bitcoin, helping to send the crypto market to record highs. However, the carmaker later suspended the Bitcoin payment opening citing environmental concerns over Bitcoin mining.\n\nThe latest move comes after Block, which is formerly known as digital payment company Square, secured a purchase from Intel Corp.'s Bitcoin mining chip. Buyers of the chip can potentially either make their own mining rigs or receive an assembled machine from the chipmaker.\n\nDorsey revealed the plan to decentralize Bitcoin mining and make the token's network more secure with Block earlier this year.\n\nIn the meanwhile, Dorsey has fully embraced the largest cryptocurrency by including Bitcoin micropayment Lightening Network in Twitter's tipping function and launching the NFT profile function. He has funded Bitcoin developers and planned to decentralize Bitcoin mining.\n\nTesla's first-quarter filing disclosed the company held $2.48 billion in Bitcoin as of March 31. Bitcoin revenue contributed to over half of the total net revenue of Block's Cash App, a separate filing showed.\n\nThe central and western parts of Texas are among the regions with rich wind and solar power resources. Bitcoin miners have flocked to the region, set up mines or expand transmission capacity in the past year.\n\nA Tesla subsidiary registered as Gambit Energy Storage LLC is building a more than 100 megawatt energy storage project in Angleton, Texas, a town roughly 40 miles (64 kilometers) south of Houston."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYXBwbGUtbWFjYm9vay1iaXRjb2luLWRvY3VtZW50YXJ5LWIyMzE2Nzk2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Every Mac computer is hiding a secret Bitcoin document - The Independent",
        "content": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox Sign up to our free IndyTech newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyTech email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nA secret Bitcoin document is hiding inside every modern Mac.\n\nAny Mac computer that has been updated to use a version of the MacOS operating system since 2018 is hiding a copy of the “Bitcoin Whitepaper”, a technology blogger has found.\n\nThe Bitcoin Whitepaper was written in 2008, by a person or group of people calling themselves Satoshi Nakamoto and whose real identity has never been found. The document not only details how the cryptocurrency works, but also explains in detail the thinking behind why it was created in the first place.\n\nAs a result, it has become an important document to those advocating for Bitcoin and cryptocurrencies in general.\n\nThat may be the reason that it was seemingly quietly added to the software, presumably by an engineer working on MacOS.\n\nAnyone can open it, simply by looking inside the files for a device called “Virtual Scanner II”. The document appears to have been added as a sample file for that utility, and it may just have been a useful, short document to use as an example.\n\nThe secret document was found by Andy Baio, the blogger and technologist. He noted that despite the file being inside the software for five years, there was very little discussion of it online.\n\nApple has not given any information about how the file came to be added to MacOS. The company did not immediately respond to a request for comment from The Independent.\n\nMr Baio said that he had received a tip-off that the existence was filed as an issue a year ago, and that it was assigned to the engineer who added it, but that there has not been any update since.\n\nOfficially, Apple has stayed largely separate from cryptocurrency, even as it moves into more traditional financial services such as payments and lending.\n\nIn 2021, chief executive Tim Cook said Apple was “looking at” cryptocurrencies and that he had invested in it personally. But he said that the company did not have “immediate plans” to move into it."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvZWNvbm9teS13aXRob3V0LWJpdGNvaW4tbmVnYXRpdmUtd2FzdGUtbW9uZXktY29zdHMtc29jaWFsLWZpbmFuY2lhbC1lZmZlY3QtMjAyMy000gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Why the Economy Would Be Better Off Without Bitcoin: Dieter Wermuth - Markets Insider",
        "content": "Bitcoin is a wasteful asset that doesn't add to global welfare, Dieter Wermuth, economist and partner at Wermuth Asset Management, wrote in a recent note.\n\nHe says the bitcoin market is highly centralized, and primarily benefits early investors and miners.\n\nThe tokens fail as currency, given their high volatility and lack of real-world use, according to Wermuth.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nDespite calls from crypto enthusiasts to HODL (hold on for dear life), letting go of bitcoin may be good for world prosperity, at least according to one economist.\n\nThat's because the cryptocurrency is a wasteful investment that takes funds away from general economic growth, Dieter Wermuth — economist and partner at Wermuth Asset Management — wrote in a note published on Wednesday.\n\nNot only does the speculative asset not contribute to broader welfare, it creates social inequalities and allows for money laundering, tax evasion and major climate deterioration, Wermuth said.\n\n\"Bitcoin activities are a negative-sum game,\" he wrote. \"Without crypto, the economy would be better off — there would be more money for consumption and investment.\"\n\nAdvertisement\n\nDetailed below are three reasons to support Wermuth's negative assertions about bitcoin.\n\n(1) It doesn't distribute wealth equally\n\nAfter the front-and-center cryptocurrency bitcoin first launched in 2009, it went from being a virtually worthless asset to holding a level of nearly $68,000 by 2021. But Wermuth argues that the gains were not enjoyed by every investor; rather, an uneven wealth distribution formed that favored crypto insiders.\n\nTo illustrate, a 2021 Wall Street Journal article reported that 0.01% of bitcoin investors held 27% of coins then in circulation, or approximately $232 billion at the time.\n\nWermuth notes that coin-producing crypto miners and those who had positions long before the 2021 rally overwhelmingly profited from the currency's gains, while those who joined late helped make the initial investors richer — only to potentially undergo losses themselves when bitcoin crashed by around 75% in 2022.\n\nAdvertisement\n\n(2) It's not really a currency\n\nThe intense volatility that bitcoin has experienced through its history also demonstrates how ill-equipped it is for a monetary role.\n\n\"Bitcoin has been brought to market with the narrative that it would be a better, more stable currency than traditional money,\" Wermuth wrote. \"This story has been a deception.\"\n\nHis assertion runs on the premise that money needs to attain three core roles — as a means of payment, unit of account and store of value — all of which bitcoin performs poorly at.\n\nIn order to facilitate stability, cryptocurrencies like bitcoin have a limit to the amount of tokens that will enter circulation. However, this is quickly undone when investors treat it as an investment and create more daily volatility than other markets, Wermuth said.\n\nAdvertisement\n\nAt the same time, he cites the fact that bitcoin has yet to have widespread use as a purchasing device, and hasn't been accepted as a means to pay taxes. Transfers between bitcoin accounts, meanwhile, continue to be slower and more expensive than traditional ones.\n\n(3) It's a negative-sum asset\n\nDespite the elements outlined above, bitcoin generates a great deal of financial liquidity without any proof that it contributes to productivity growth, Wermuth said.\n\n\"Back in November 2021 bitcoin's market capitalization reached 1.27 trillion dollars,\" he wrote. \"When Lehman Brothers went belly-up in 2008, a smaller amount of money had triggered the largest financial crisis and the deepest recession of the post-World War period.\"\n\nOn top of that, the process of bitcoin mining — which uses computer hardware to add transactions in the crypto to a blockchain in return for newly minted coins — is so energy intensive that Wermuth described it as a \"major climate killer.\"\n\nAdvertisement\n\nBroader crypto-market issues\n\nHis note comes at a time of high-profile challenges for the broader crypto world — ones that may have started deteriorating investor confidence in the asset.\n\nMost recently, the collapse of the crypto-friendly Signature Bank revealed that it had faced a US probe indicating that its crypto clients may have been taking part in money laundering. At the same time, crypto-exchange Binance is facing a US lawsuit, with one of the allegations citing that it knew that it was facilitating criminal transactions.\n\nBefore that, November's FTX collapse demonstrated the risks for crypto investors operating in the unregulated market, as many of the lender's clients saw their holdings wiped out.\n\n\"I wonder whether it will be enough to just step up regulatory efforts, or to forbid the participation of banks and other financial institutions — or to get rid of these markets altogether (if this is still an option),\" he wrote."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXNldHMtdXAtZm9yLWFuLWV4cGxvc2l2ZS1tb3ZlLWFzLWFkYS14bG0tYWF2ZS1hbmQtY2Z4LXR1cm4tYnVsbGlzaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price sets up for an explosive move as ADA, XLM, AAVE and CFX turn bullish - Cointelegraph",
        "content": "The long weekend has not produced any fireworks in Bitcoin (BTC) price, which continues to trade inside an ever-narrowing range. Bitcoin is on track to form a third consecutive Doji candlestick pattern on the weekly chart. This suggests that the Bitcoin bulls and the bears are not clear about the next directional move.\n\nIt is not only Bitcoin that is stuck inside a range. On April 7, Jurrien Timmer, director of global macro at asset manager Fidelity Investments, tweeted that the S&P 500 Index had been stuck inside a range for the past nine months and a breakout was due “sooner or later.”\n\nCrypto market data daily view. Source: Coin360\n\nBitcoin’s failure to break above the $30,000 level has attracted profit-booking in several altcoins but a few have witnessed shallow pullbacks. This indicates that traders are holding on to their positions expecting a move higher.\n\nLet’s study the charts of select altcoins that may turn up and start an uptrend if Bitcoin breaks out to the upside. What are the resistance levels above which these five cryptocurrencies turn bullish?\n\nBitcoin price analysis\n\nBitcoin has been trading inside a tight range for the past two days, indicating indecision among the bulls and the bears. Usually, tight ranges are followed by an expansion in volatility.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe 20-day exponential moving average ($27,500) is flattening out and the relative strength index (RSI) has gradually been slipping toward the center. This suggests a balance between supply and demand.\n\nIf the price tumbles below the 20-day EMA, several short-term stop losses may be triggered and the BTC/USDT pair may dive to the breakout level of $25,250.\n\nConversely, if the price rebounds off the 20-day EMA with strength, it will suggest that the sentiment remains positive and traders are buying the dips. A rally above $29,200 could enhance the prospects of a rally to $30,000 and subsequently to $32,500.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe 20-EMA is flattening out on the four-hour chart and the RSI is just below the midpoint. This does not give a clear advantage either to the bulls or the bears. This uncertainty is unlikely to continue for long, and a directional move could soon start. However, it is difficult to predict the direction of the breakout.\n\nTherefore, it is better to wait for the breakout to happen before establishing directional bets. The important level to watch on the upside is $29,200 and on the downside is $26,500. A breach of either level could start a short-term trending move.\n\nCardano price analysis\n\nThe bulls are not allowing Cardano (ADA) to dip below the 20-day EMA ($0.37), indicating demand at lower levels.\n\nADA/USDT daily chart. Source: TradingView\n\nThe upsloping 20-day EMA and the RSI in the positive area suggest that the path of least resistance is to the upside. The ADA/USDT pair could first rise to the neckline of the inverse head-and-shoulders pattern. A break and close above this resistance will signal a potential trend change. The pair could then rally toward the pattern target of $0.60.\n\nIf bears want to prevent the up-move, they will have to quickly yank the price back below the 20-day EMA. The pair may then drop to the 200-day simple moving average ($0.35) and later to $0.30.\n\nADA/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bulls have pushed the price above the 20-EMA and will next try to overcome the barrier at the downtrend line. If they do that, it will suggest that the pullback may be over. The pair may then climb to the neckline where the bears are expected to mount a strong defense.\n\nContrarily, if the price faces rejection at the downtrend line, it will suggest that bears are active at higher levels. The selling could accelerate below $0.37 and the pair may plunge to the 200-SMA.\n\nStellar price analysis\n\nStellar (XLM) turned down from the overhead resistance of $0.12 and the price is nearing the 20-day EMA ($0.10). The bulls are likely to buy the dips to the 20-day EMA.\n\nXLM/USDT daily chart. Source: TradingView\n\nIf the price rebounds off the 20-day EMA, the bulls will again try to clear the overhead hurdle. If they succeed, the XLM/USDT pair will complete a bullish rounding bottom pattern. That could signal the start of a new up-move. The pair may first rally to $0.15 and thereafter march toward the pattern target of $0.17.\n\nContrary to this assumption, if the price turns down and breaks below the 20-day EMA, it will suggest that bulls are losing their grip. The pair may then drop to the 200-day SMA ($0.09). This is a make-or-break level for the bulls because if it cracks, the pair may plummet to $0.07.\n\nXLM/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the pair is correcting inside a falling wedge pattern. The price has bounced off the support line and the bulls will next attempt to propel the pair above the wedge. If they manage to do that, the pair could rally to $0.11 and subsequently to $0.12.\n\nOn the other hand, if the price turns down and plummets below the support line, it will suggest that the selling has intensified. There is a small support at $0.10 but if that cracks, the decline could extend to the 200-SMA.\n\nRelated: SushiSwap approval bug leads to $3.3 million exploit\n\nAave price analysis\n\nAave (AAVE) has turned down from the overhead resistance of $82, indicating that the bears are fiercely protecting this level. They have pulled the price below the immediate support at the 20-day EMA ($75).\n\nAAVE/USDT daily chart. Source: TradingView\n\nThe AAVE/USDT pair could next slip to the 200-day SMA ($73), which is close to the uptrend line. Buyers are likely to defend this level with vigor. If the price rebounds off the uptrend line and breaks above the 20-day EMA, the pair could reach $82.\n\nIf bulls overcome this barrier, the pair will complete an ascending triangle pattern. This setup has a target objective of $100. This bullish view will invalidate if the price continues lower and breaks below the uptrend line. The pair may then slide to $68 and later to $64.\n\nAAVE/USDT 4-hour chart. Source: TradingView\n\nThe bears have pulled the price to the 200-SMA on the four-hour chart. The 20-EMA has started to turn down and the RSI is in the negative territory, indicating that bears have the upper hand.\n\nIf the 200-SMA gives way, the pair could decline further to the uptrend line. This is an important level for the bulls to defend because a break below it will further strengthen the bears.\n\nOn the upside, a break above the 20-EMA will be the first sign that the bulls are making a comeback. The pair may then rise to the overhead resistance at $82.\n\nCFX price analysis\n\nConflux (CFX) has been in a corrective phase for the past few days but a minor positive is that the bulls are trying to defend the 20-day EMA ($0.36).\n\nCFX/USDT daily chart. Source: TradingView\n\nIf the price rebounds off the current level, the CFX/USDT pair could reach the downtrend line. This is an important level for the bears to guard because a break above it could open the doors for a possible rally to $0.44 and then $0.49.\n\nConversely, if the price plunges and sustains below the 20-day EMA, it will suggest that the bulls may be rushing to the exit. That could attract further selling, pulling the price toward the next support at $0.30. The bulls are expected to buy the dips to this level.\n\nCFX/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bears are trying to keep the price below the 20-EMA. That could pull the pair to the 200-SMA, which is likely to act as a major support.\n\nIf the price rebounds off this level, the bulls will again try to drive the price to the downtrend line. This is the key level to keep an eye on because a break above it will signal that bulls are back in the game.\n\nOn the downside, a break and close below the $0.30 support could attract further selling, sinking the price to $0.25.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    }
]