[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTAxL21pY3Jvc3RyYXRlZ3ktcG9zdHMtcHJvZml0LW9uLWJlbmVmaXQtdGllZC10by1iaXRjb2luLWhvbGRpbmdz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "MicroStrategy Posts Profit on Benefit Tied to Bitcoin Holdings - Bloomberg",
        "content": "MicroStrategy Inc., the enterprise-software maker better known as the largest public holder of Bitcoin, posted its first profit in nine quarters after registering a tax benefit related to its horde of the cryptocurrency.\n\nThe Tysons Corner, Virginia-based company controlled by Bitcoin advocate Michael Saylor had net income of $461 million, or $31.79 a share, in the first quarter, compared with a loss a year earlier. During the recent quarter, the 72% rise in the price of Bitcoin allowed MicroStrategy to basically reduce a reserve related to earlier large impairment charges for the cryptocurrency, resulting in a one-time tax benefit of $453.2 million."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTAxL21pY3Jvc3RyYXRlZ3ktcG9zdHMtcHJvZml0LW9uLWJlbmVmaXQtdGllZC10by1iaXRjb2luLWhvbGRpbmdz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "MicroStrategy Posts Profit on Benefit Tied to Bitcoin Holdings - Bloomberg",
        "content": "MicroStrategy Inc., the enterprise-software maker better known as the largest public holder of Bitcoin, posted its first profit in nine quarters after registering a tax benefit related to its horde of the cryptocurrency.\n\nThe Tysons Corner, Virginia-based company controlled by Bitcoin advocate Michael Saylor had net income of $461 million, or $31.79 a share, in the first quarter, compared with a loss a year earlier. During the recent quarter, the 72% rise in the price of Bitcoin allowed MicroStrategy to basically reduce a reserve related to earlier large impairment charges for the cryptocurrency, resulting in a one-time tax benefit of $453.2 million."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMDEvYml0Y29pbi1wdWxscy1iYWNrLXRvLXN0YXJ0LW1heS1hcy1maXJzdC1yZXB1YmxpYy1iYW5rLXNhZ2EtY29tZXMtdG8tYW4tZW5kLmh0bWzSAXRodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNS8wMS9iaXRjb2luLXB1bGxzLWJhY2stdG8tc3RhcnQtbWF5LWFzLWZpcnN0LXJlcHVibGljLWJhbmstc2FnYS1jb21lcy10by1hbi1lbmQuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "Bitcoin pulls back to start May as First Republic Bank saga comes to an end - CNBC",
        "content": "Cryptocurrencies took a dip on Monday to start the week and new month as investors bet the takeover of First Republic Bank could put an end to the financial crisis, which has been the biggest driver of this year's bitcoin rally.\n\nBitcoin fell about 4.2% to 28,137.76 to start the week and new month, according to Coin Metrics. Ether lost 4% to 1,828.81.\n\nOn Monday regulators took possession of First Republic, making it the third U.S. bank failure this year and the biggest one since the 2008 financial crisis. JPMorgan Chase will acquire most of its deposits and assets.\n\nLast week, the price of bitcoin rallied in the final week of April as troubles at the bank unfolded. Trading of the cryptocurrency has been choppy, however, as investors straddle the effects of the banking crisis on crypto with high inflation, Federal Reserve policy, a potential recession and an increasingly bearish narrative building around the U.S. dollar.\n\n\"It's unclear whether the banking crisis narrative can continue to be a boon for bitcoin,\" said Alex Thorn, head of firmwide research at Galaxy. \"Overall, the market lacks clear positive near-term catalysts, with supply issues overhanging bitcoin … That being said, bitcoin accumulation by small addresses is outpacing issuance, and we expect Ethereum staking to increase, each of which provides a supportive supply narrative.\"\n\n\"Outside of crypto-native factors, we expect a back-of-the-year macro environment to be characterized by tightening, recession, and an expanding multipolarity in the global economy, all of which can be supportive of gold and bitcoin,\" he added.\n\nInvestors have been expecting a slowdown from bitcoin's first-quarter rally, although cryptocurrency remains on its upward trend and has gained about 70% for the year, after finishing down more than 60%. April marked the first time in two years that bitcoin notched a fourth consecutive positive month.\n\n\"Bitcoin and ether started 2023 inorganically cheap, allowing for plenty of room to move higher off a low-base effect,\" Thorn said. \"A widening banking crisis became evident in March and the contrast with Bitcoin's transparent and decentralized nature provided a further leg up for bitcoin, while Ethereum's successful Shanghai upgrade provided a catalyst for ethereum.\""
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMDEvYml0Y29pbi1wdWxscy1iYWNrLXRvLXN0YXJ0LW1heS1hcy1maXJzdC1yZXB1YmxpYy1iYW5rLXNhZ2EtY29tZXMtdG8tYW4tZW5kLmh0bWzSAXRodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNS8wMS9iaXRjb2luLXB1bGxzLWJhY2stdG8tc3RhcnQtbWF5LWFzLWZpcnN0LXJlcHVibGljLWJhbmstc2FnYS1jb21lcy10by1hbi1lbmQuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "Bitcoin pulls back to start May as First Republic Bank saga comes to an end - CNBC",
        "content": "Cryptocurrencies took a dip on Monday to start the week and new month as investors bet the takeover of First Republic Bank could put an end to the financial crisis, which has been the biggest driver of this year's bitcoin rally.\n\nBitcoin fell about 4.2% to 28,137.76 to start the week and new month, according to Coin Metrics. Ether lost 4% to 1,828.81.\n\nOn Monday regulators took possession of First Republic, making it the third U.S. bank failure this year and the biggest one since the 2008 financial crisis. JPMorgan Chase will acquire most of its deposits and assets.\n\nLast week, the price of bitcoin rallied in the final week of April as troubles at the bank unfolded. Trading of the cryptocurrency has been choppy, however, as investors straddle the effects of the banking crisis on crypto with high inflation, Federal Reserve policy, a potential recession and an increasingly bearish narrative building around the U.S. dollar.\n\n\"It's unclear whether the banking crisis narrative can continue to be a boon for bitcoin,\" said Alex Thorn, head of firmwide research at Galaxy. \"Overall, the market lacks clear positive near-term catalysts, with supply issues overhanging bitcoin … That being said, bitcoin accumulation by small addresses is outpacing issuance, and we expect Ethereum staking to increase, each of which provides a supportive supply narrative.\"\n\n\"Outside of crypto-native factors, we expect a back-of-the-year macro environment to be characterized by tightening, recession, and an expanding multipolarity in the global economy, all of which can be supportive of gold and bitcoin,\" he added.\n\nInvestors have been expecting a slowdown from bitcoin's first-quarter rally, although cryptocurrency remains on its upward trend and has gained about 70% for the year, after finishing down more than 60%. April marked the first time in two years that bitcoin notched a fourth consecutive positive month.\n\n\"Bitcoin and ether started 2023 inorganically cheap, allowing for plenty of room to move higher off a low-base effect,\" Thorn said. \"A widening banking crisis became evident in March and the contrast with Bitcoin's transparent and decentralized nature provided a further leg up for bitcoin, while Ethereum's successful Shanghai upgrade provided a catalyst for ethereum.\""
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmtpcGxpbmdlci5jb20vaW52ZXN0aW5nL2ludmVzdC1pbi1iaXRjb2luLWltLWEtYml0Y29pbi1sb3Nlci1hbmQtaS13b250LWJlLWdvaW5nLW5lYXItaXQtYWdhaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 01 May 2023 07:00:00 GMT",
        "title": "Invest in Bitcoin? I'm a Bitcoin Loser and I Won't Be Going Near It Again - Kiplinger's Personal Finance",
        "content": "Should you invest in Bitcoin is a common question posed by many who have witnessed the cryptocurrency’s rollercoaster ride over recent years.\n\nEach Bitcoin is now worth about $30,000 after a year of gains for the cryptocurrency, but the last five years have seen it swing from $3,000 to $65,000, which shows the seesaw it’s been on. That has led not just to a surge in Bitcoin investing but also in Bitcoin mining .\n\nI have tried my luck at it, albeit with rather small sums compared to some, but it taught me that seeing it as an investment is the wrong course of action for most. Unless you really, really know what you are doing, then it’s a gamble, akin to playing the tables in Vegas.\n\nSubscribe to Kiplinger’s Personal Finance Be a smarter, better informed investor. Save up to 74% Sign up for Kiplinger’s Free E-Newsletters Profit and prosper with the best of expert advice on investing, taxes, retirement, personal finance and more - straight to your e-mail. Profit and prosper with the best of expert advice - straight to your e-mail. Sign up\n\nThat means it really should be viewed as something only to dabble in if you can afford to lose that cash, so something to have fun with rather than truly invest in. That’s my view, and you may disagree, but here’s why I think so.\n\nWhy Bitcoin is closer to gambling than investing\n\nWhen you invest in the stock market or in commodities you can at least do some research to help inform your decision. How has this fund manager performed? What is this company’s growth plans? Or, what do experts think will happen to the price of gold?\n\nThese are all questions you can answer using research to help inform you of potential outcomes. You can also get financial advice from experts who know the markets and the system.\n\nOf course, most investors know that there is always the risk of their investment tanking due to big world events such as COVID-19, or due to more localized or company-specific issues.\n\nYet few stocks or commodities have experienced the white-knuckle ride of Bitcoin, and that propensity for it to move suddenly, sometimes seemingly with no warning, is why it is so much harder to predict, and why it is closer to gambling than investing in my view.\n\nOne reason Bitcoin is hard to predict is because the mechanics behind it are so complex that most people don’t understand them and therefore don’t have the same knowledge they have of more traditional investments.\n\nI suspect die-hard crypto experts who do nothing but study Bitcoin and other similar currencies such as Ethereum will disagree with me, but this article isn’t aimed at them, but at the less-well-informed majority.\n\nMy Bitcoin loss\n\nA few years ago when everyone seemed to be talking Bitcoin up during one of its highs, I bought $300 of it. I saw it rise to about $500, then drop suddenly, only to go back up again.\n\nAfter a few months later, I withdrew it all at a loss of $50. I could swallow a $50 hit and I saw the experience as a bit of fun to see what would happen to the $300.\n\nThe problem is, I had no idea why it was going up or down and saw no way to even remotely forecast which way it would go. I didn’t like the feeling that I had no control at all.\n\nDon’t get into Bitcoin unless you understand the risks\n\nBitcoin is having a good 2023, with its value up 75% year-to-date. That may encourage some people to try their luck.\n\nI say go for it if you want to have some fun, but only with money you can afford to lose, unless you really consider yourself a cryptocurrency expert.\n\nBut please beware the many companies out there trying to sell you a Bitcoin “investment” as a sure-fire way to make money. You may get lucky but you may as easily get burnt.\n\nWhether you agree or disagree, feel free to tweet me @guyanker."
    }
]