[
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1hcmtldHBsYWNlLW9wZW5iYXphYXItY29taW5nLWJhY2stMjE1NzQ3MjQ4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Marketplace OpenBazaar Is Coming Back - Yahoo Finance",
        "content": "After a two year break, OpenBazaar, the decentralized marketplace platform, is on its way back to life, according to some vague tweets from its official account.\n\nThe digital marketplace—where users sold goods from homemade candles to medicine—had shuttered in late 2020 due to dried up funding. After initially announcing its closure, the marketplace was temporarily rescued by an anonymous donor—but it ultimately wasn't enough to keep OpenBazaar open for business.\n\nOpenBazaar CEO Brian Hoffman confirmed in a message to Decrypt that he is rebuilding the marketplace, though he declined to add any further detail. The OpenBazaar website has been updated to say \"openbazaar 3.0 - coming soon.\"\n\nopenbazaar was built by the community from nothing.\n\nfor a long time it has slept, but it is now time to grow again from the ashes. — OpenBazaar (@openbazaar) March 28, 2023\n\nOpenBazaar is like the digital marketplace to Bitcoin’s currency. It was known for its unique approach to online shopping, providing a decentralized marketplace where users could buy and sell goods without the need for a central authority, like, say, Amazon or Etsy. The idea was to give users more freedom over the goods they sold.\n\nThe plan worked for a while before OpenBazaar's funding issues. Merchants set up hundreds of shops, accepting cryptocurrencies for their goods.\n\nAccording to Hoffman's GitHub account (a site where developers post their code publicly for others to use), he has been working on a new implementation of OpenBazaar in the programming language Rust, which is all the rage in Bitcoin lately.\n\nBitcoin Privacy Tool Aims to 'Confuse' Surveillance Companies\n\nOn Twitter, some users are already excited about OpenBazaar’s return.\n\nIn an interview with CoinDesk in 2018, OpenBazaar co-founder Washington Sanchez described OpenBazaar's purpose as such: \"OpenBazaar is supposed to be a free and open protocol for trade using cryptocurrency, a way for currencies and tokens to gain meaningful economic utility to acquire goods and service, and an entry point for people to earn and onboard.\"\n\nFollowing the OpenBazaar's shutdown in 2020, its founders hinted that structural changes would be needed to further place control of the marketplace in the hands of its community and away from the company that initially created it."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiuwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8tY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTEzLWFwcmlsLTIwMjMvYXJ0aWNsZXNob3cvOTk0NTc1OTAuY21z0gG_AWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5Ly1jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTMtYXByaWwtMjAyMy9hbXBfYXJ0aWNsZXNob3cvOTk0NTc1OTAuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin holds above $30k; Solana, Ethereum rise up to 5% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nMost of the cryptocurrencies were trading higher on Thursday amid better-than-expected US economic data. Bitcoin (BTC) rose 0.67% to $30,093, whereas Ethereum (ETH) was above the $1,900 level. BTC volume stood at approximately $18.62 billion, rising 6.42% in the last 24 hours.\"Most cryptocurrencies rose slightly in the past 24 hours after mildly encouraging inflation data on one side and Ethereum Shanghai upgrades on the other. Bitcoin was seen trading above the US$30,000 level, with its resistance set at US$30,500. This shows that the bulls currently have the upper hand in the market. However, the support of BTC lies at the US$29,900 level,\" Edul Patel, Co-founder and CEO at Mudrex, said.Other top crypto tokens were also trading higher. Solana surged over 5%. Meanwhile, Polkadot, Litecoin Dogecoin and Cardano also traded with gains. The global cryptocurrency market cap was trading higher around $1.23 trillion, rising 1.09% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $582 billion. Bitcoin’s dominance is currently 47.25%, a decrease of 0.25% over the day, according to CoinMarketCap.\"Bitcoin (BTC) continues to consolidate above $30,000, which indicates a rally towards $32,000 is possible until it encounters strong resistance. CPI cooling off may also signal the end of the rate hike season, which will bring new liquidity into the markets,\" Vikram Subburaj, CEO of Giottus Crypto Platform, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 69, with a neutral outlook. The Stochastic %K (14, 3, 3) indicates ‘sell’ at 86 and the Average Directional Index (14) indicates a Neutral outlook at 38.\"The MACD Level (12, 26), at 1027, indicates Buy. The Stochastic RSI Fast (3, 3, 14, 14) indicates Sell at 84 and William's Percentage is Neutral at −13,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.54 hours, IST on April 13, 2023)Bitcoin $30,107 0.66%Ethereum $1,918 2.92%Tether $1.00 -0.01% BNB $318 0.16%XRP $0.5072 -0.1%Cardano $0.407 3.67%Dogecoin $0.0833 1.82%Polygon $1.11 2.23%Solana $23.98 5.05%Polkadot $6.42 2.59%Shiba Inu $0.00001093 1.13%Litecoin $92.55 0.77%Tron $0.06496 1.97%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vZG9udC1yZWFsbHktY2hvb3NlLWJldHdlZW4tYml0Y29pbi0yMTQyMjM4NTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "'You don't have to really choose' between Bitcoin and Ethereum: Trader - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) has surged by over 80% in 2023. Ethereum (ETH-USD) is up by more than 65% over the same span after completing its Shanghai upgrade this week. But according to one trader, choosing where to invest shouldn't come down to picking one over the other.\n\n\"Wolf of All Streets\" podcast host Scott Melker describes Bitcoin as \"digital gold\" and Ethereum as more of a technological investment. \"I think you can love one, love both, and it's totally fine,\" Melker says. \"You don't have to really choose. I think they're separate asset classes and should be viewed as such.\"\n\nBe sure to watch Rachelle Akuffo's full interview with Melker here.\n\nKEY VIDEO MOMENTS:\n\n0:13 Melker's take on Ethereum's Shanghai upgrade.\n\n1:20 Melker breaks down the Bitcoin vs. Ethereum debate\n\nVideo Transcript\n\nRACHELLE AKUFFO: And I want to talk Ethereum as well, the Shanghai upgrade. Because obviously, we're seeing at least today, Ethereum off to the races here versus Bitcoin. I mean, up about almost 6% on the day. What are your takeaways from that? Obviously, a lot of excitement surrounding this.\n\nSCOTT MELKER: Yeah, there was a bit of a nonsensical narrative that everybody who had staked their Ethereum for the past few years was going to try to withdraw all at once, which you couldn't do anyways, and sell all their Ethereum. But you have to remember that anyone who staked their 30 to Ethereum, which by the way, for most people, was over $60,000. But anyone who staked that 30 to Ethereum had no guarantee they would even be able to withdraw.\n\nThese are the people who are the biggest believers, the maximalists of Ethereum, who really wanted to help secure the network. So now that they're getting the opportunity to withdraw, they're going to continue staking. I think there were more people. And I can speak to this anecdotally from fund managers that I speak to in institutions.\n\nThere are a lot more people who are actually waiting to deposit because they would then know that they would be able to withdraw at some point. So we're actually seeing net inflows over the past 24 hours. It's going back and forth. But there has not been a huge demand for people to withdraw. And there are just as many people putting their money into the contract. I think that this is a huge development for Ethereum. Yet another major step in the right direction for the protocol.\n\nRACHELLE AKUFFO: And do you think perhaps investors are more bullish on Ethereum given the use cases versus Bitcoin?\n\nSCOTT MELKER: I view them as completely separate assets. I think that the flipping narrative is completely irrelevant. I view Bitcoin as a digital gold, store of value, flight to safety. And we've obviously seen that, especially, with the banking collapses a few months ago, and Bitcoin rise a few weeks ago. With Bitcoin rising from roughly 19,000 to over $30,000, Ethereum is more of a technological investment. It's a internet of value. And I think that we're starting to see that separation in people's minds. So I think you can love one, love both, and it's totally fine. You don't have to really choose. I think that they're separate asset classes and should be viewed as such."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vZG9udC1yZWFsbHktY2hvb3NlLWJldHdlZW4tYml0Y29pbi0yMTQyMjM4NTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "'You don't have to really choose' between Bitcoin and Ethereum: Trader - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) has surged by over 80% in 2023. Ethereum (ETH-USD) is up by more than 65% over the same span after completing its Shanghai upgrade this week. But according to one trader, choosing where to invest shouldn't come down to picking one over the other.\n\n\"Wolf of All Streets\" podcast host Scott Melker describes Bitcoin as \"digital gold\" and Ethereum as more of a technological investment. \"I think you can love one, love both, and it's totally fine,\" Melker says. \"You don't have to really choose. I think they're separate asset classes and should be viewed as such.\"\n\nBe sure to watch Rachelle Akuffo's full interview with Melker here.\n\nKEY VIDEO MOMENTS:\n\n0:13 Melker's take on Ethereum's Shanghai upgrade.\n\n1:20 Melker breaks down the Bitcoin vs. Ethereum debate\n\nVideo Transcript\n\nRACHELLE AKUFFO: And I want to talk Ethereum as well, the Shanghai upgrade. Because obviously, we're seeing at least today, Ethereum off to the races here versus Bitcoin. I mean, up about almost 6% on the day. What are your takeaways from that? Obviously, a lot of excitement surrounding this.\n\nSCOTT MELKER: Yeah, there was a bit of a nonsensical narrative that everybody who had staked their Ethereum for the past few years was going to try to withdraw all at once, which you couldn't do anyways, and sell all their Ethereum. But you have to remember that anyone who staked their 30 to Ethereum, which by the way, for most people, was over $60,000. But anyone who staked that 30 to Ethereum had no guarantee they would even be able to withdraw.\n\nThese are the people who are the biggest believers, the maximalists of Ethereum, who really wanted to help secure the network. So now that they're getting the opportunity to withdraw, they're going to continue staking. I think there were more people. And I can speak to this anecdotally from fund managers that I speak to in institutions.\n\nThere are a lot more people who are actually waiting to deposit because they would then know that they would be able to withdraw at some point. So we're actually seeing net inflows over the past 24 hours. It's going back and forth. But there has not been a huge demand for people to withdraw. And there are just as many people putting their money into the contract. I think that this is a huge development for Ethereum. Yet another major step in the right direction for the protocol.\n\nRACHELLE AKUFFO: And do you think perhaps investors are more bullish on Ethereum given the use cases versus Bitcoin?\n\nSCOTT MELKER: I view them as completely separate assets. I think that the flipping narrative is completely irrelevant. I view Bitcoin as a digital gold, store of value, flight to safety. And we've obviously seen that, especially, with the banking collapses a few months ago, and Bitcoin rise a few weeks ago. With Bitcoin rising from roughly 19,000 to over $30,000, Ethereum is more of a technological investment. It's a internet of value. And I think that we're starting to see that separation in people's minds. So I think you can love one, love both, and it's totally fine. You don't have to really choose. I think that they're separate asset classes and should be viewed as such."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wNC8zMTc5ODU4NS9uZmxzLWFhcm9uLXJvZGdlcnMtaGFpbC1tYXJ5LWZvci0yMDI0LXByZXNpZGVudGlhbC1lbGVjdGlvbi1mZWxsb3ctYW50aS12YXh4ZXItcm9iZXJ0LWtlbm7SAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzE3OTg1ODU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "NFL's Aaron Rodgers' Hail Mary For 2024 Presidential Election: Fellow Anti-Vaxxer Robert Kennedy Jr. - Benzinga",
        "content": "A leading National Football League player has shown early support for a presidential candidate ahead of the 2024 election. Here’s who quarterback Aaron Rodgers is supporting and how one important platform plays into the potential support.\n\nWhat Happened: The 2023 NFL offseason has seen the retirement of Tom Brady for a second time and a looming decision between the Green Bay Packers and star quarterback Aaron Rodgers for the second straight season.\n\nRodgers has expressed his intent to get traded to the New York Jets and leave the Packers. The team has not made a trade official, but many believe it will happen before the start of the 2023 season.\n\nWhile Rodgers has been outspoken about his intent to leave the Packers and play for a new team in 2023, the quarterback could also be sharing his early opinion on the 2024 presidential election.\n\nWith an Instagram stories post, Rodgers shared a promotion of a podcast interview featuring anti-vaxxer Aubrey Marcus and anti-vax presidential candidate Robert Kennedy Jr. In the post, Rodgers showed the hashtag #kennedy2024 and two flexed bicep emojis, alongside two heart emojis. Rodgers has been a guest on Marcus’ podcast several times.\n\nKennedy Jr., the son of former presidential candidate Robert Kennedy and nephew of former President John F. Kennedy, filed to run for president as a Democrat in the 2024 election.\n\nWith his anti-vax platform, Kennedy Jr. has seen his family distance themselves from him, according to the Washington Post. Kennedy Jr. previously compared COVID-19 vaccine mandates to the Holocaust and said that things were worse during COVID-19 with mandates than they were for Anne Frank, a comment he later apologized for.\n\nPresident Joe Biden has not officially declared his intent to run for president in 2024 but an announcement is expected anytime and Biden is the current favorite to get the Democratic nomination.\n\nKennedy Jr. is seen as a longshot to win the Democratic nomination and overall 2024 election. Betting odds from Covers show Kennedy Jr. listed at odds of +10,000, implying a 0.99% chance of becoming the next president.\n\nRelated Link: Aaron Rodgers Says Ayahuasca Helped Him Achieve 'Best Season' Of His NFL Career And Love Himself\n\nAnti-Vax and Anti-Crypto?: Rodgers support for Kennedy Jr. comes as both have been well-known for their stances on vaccinations.\n\nKennedy Jr. has been a major advocate against vaccines, which has led to the presidential candidate being banned from Instagram and having an organization he backs banned from Instagram and Facebook.\n\nRodgers faced backlash after previously saying he was “immunized” against COVID-19 and misleading the public and potentially the NFL about his vaccine status. Rodgers missed an NFL game in the 2021 season after testing positive for COVID-19.\n\nThe Packers quarterback said he underwent alternative treatment because of being allergic to an ingredient in the vaccines from Pfizer and Moderna.\n\nWhile it shouldn’t come as a huge surprise that Rodgers is backing a fellow anti-vax candidate, Kennedy Jr. and the quarterback may differ on opinions on another topic, the world of cryptocurrency.\n\nKennedy Jr. has been vocal as a candidate against central bank digital currencies (CBDCs).\n\n“CBDCs grease the slippery slope to financial slavery and political tyranny,” Kennedy Jr. said. “A CBDC tied to digital ID and social credit score will allow the government to freeze your assets or limit your spending to approved vendors if you fail to comply with arbitrary diktats, i.e. vaccine mandates.”\n\nWhile Kennedy Jr. is speaking out against CBDCs, he could show future support for Bitcoin with additional comments.\n\n“Cryptocurrencies like Bitcoin give the public an escape route from the splatter zone when this [financial] bubble invariably bursts,” Kennedy Jr said.\n\nRodgers has been a proponent of Bitcoin BTC/USD and cryptocurrency over the years. In 2021, the quarterback announced a partnership with CashApp, a unit of Block Inc SQ.\n\n“I’m pumped to share that I’ve recently teamed with CashApp, they’ve enabled me to take part of my salary in Bitcoin for the very first time,” Rodgers said in a video.\n\nRodgers also offered fans the chance to win $1 million in Bitcoin through the partnership.\n\n“I believe in Bitcoin & the future is bright.”\n\nRodgers was also featured at the Bitcoin 2022 Conference where he encouraged college athletes who have NIL and scholarship money to invest a portion into cryptocurrencies like Bitcoin.\n\n“The Fed keeps printing trillions of dollars, you know, the best defense against inflation, I believe is Bitcoin, and they will keep printing money.”\n\nRead Next: Trump Gains Against DeSantis In New Poll After Indictment, Here's How He Matcches Up Against Biden For 2024 Election\n\nPhotos: Shutterstock"
    }
]