[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTI3L2JpdGNvaW4tYnRjLWV4dGVuZHMtcmVjZW50LWJvdXQtb2Ytdm9sYXRpbGl0eS1pbi1jbGltYi1iYWNrLXRvd2FyZC0zMC0wMDDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC USD) Back Toward $30,000, Extending Bout of Volatility - Bloomberg",
        "content": "Bitcoin pushed its way back toward $30,000, extending a recent period of turbulence around the closely watched round-number level.\n\nThe world’s largest digital currency rose as much as 5.2% on Thursday to trade at $29,883. Smaller tokens including Ether , Cardano and Avalanche made gains too, reflecting buoyant sentiment across the crypto market."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTI3L2JpdGNvaW4tdGhpZWYtcGhvdG9ncmFwaGVkLWluLWJhdGh0dWItb2YtY2FzaC1nZXRzLWZvdXIteWVhcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Thief Photographed in Bathtub of Cash Gets Four Years - Bloomberg",
        "content": "An Ohio man photographed lounging in a bathtub full of dollar bills must serve four years in prison for stealing 713 Bitcoin from a computer device seized by the government in a case against his older brother.\n\nGary Harmon, 31, was sentenced Thursday by US District Judge Beryl Howell in Washington, DC, where he pleaded guilty in January. He also agreed to forfeit crypto currencies and other property valued at more than $20 million, the US Justice Department said."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yYXktZGFsaW8tc2F5cy1saXR0bGUtYml0Y29pbi0xOTUxMDg0NTAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Ray Dalio says he has a little bitcoin but prefers gold, calling it 'timeless and universal' - Yahoo Finance",
        "content": "Bridgewater founder Ray Dalio. Brendan McDermid/File Photo/Reuters\n\nBillionaire investor Ray Dalio said he has a little bitcoin but prefers gold.\n\nOn a recent podcast, he said bitcoin is volatile and has a smaller valuation than mega-cap stocks like Microsoft.\n\n\"I don't understand why people are more inclined to go to bitcoin than gold.\"\n\nRay Dalio said he holds a small amount of bitcoin, but the cryptocurrency moves in unreliable ways and the billionaire investor favors gold.\n\n\"I would prefer gold,\" he said on Chris Williamson's YouTube podcast this week, pointing out that bitcoin has a smaller valuation than mega-cap stocks like Microsoft.\n\nOn Thursday, bitcoin's market cap was about $574 billion, compared to Microsoft's $2.27 trillion.\n\n\"I don't understand why people are more inclined to go to bitcoin than gold. If you look internationally, gold is, for central banks, the third highest reserve asset,\" the Bridgewater Associates founder said. \"First is dollars, then euros, then gold, and Japanese yen. And central bankers are buying gold, and they're not buying bonds. And it's timeless and universal.\"\n\nDalio added that he isn't a big fan of bitcoin, while acknowledging he has \"a little bit of it.\"\n\nBut even with a small holding, bitcoin's volatility demands an outsized amount of attention from investors, he warned.\n\n\"But if you have a little bit of it, you have to think about those things. Like I said, you have to be prepared for it to fall a lot, if it goes down 80% or something. But that limits the amount that you can have,\" Dalio said. \"So I don't know. I don't think a lot of bitcoin.\"\n\nWhile bitcoin remains well off its November 2021 high of $67,000, it has soared 80% so far this year to nearly $30,000.\n\nIts rally has coincided with hopes for a pause in Federal Reserve rate hikes and the banking turmoil caused by Silicon Valley Bank's collapse in March.\n\nA Standard Chartered note on Monday said bitcoin is an attractive asset during stress periods thanks to its decentralized nature, adding that it could skyrocket towards $100,000 by the end of 2024.\n\nRead the original article on Business Insider"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2lucy1uZWdhdGl2ZS1jb3JyZWxhdGlvbi1kb2xsYXItaW5kZXgtMTEwNjUwNTU3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Negative Correlation With Dollar Index Strengthens Ahead of U.S. GDP Data - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nBitcoin (BTC) has historically moved in the opposite direction of the U.S. Dollar Index (DXY), which gauges the greenback's exchange rate against major fiat currencies, including the euro.\n\nThe negative correlation has strengthened, reversing the brief let-up witnessed in late March, and indicating the possibility of accelerated gains in the cryptocurrency in the case of a continued dollar slide following the release of the U.S. gross domestic product data on Thursday.\n\nThe 90-day correlation coefficient between bitcoin and the dollar index has slipped to a two-month low of -0.70, according to data from charting platform TradingView. It had weakened to -0.11 four weeks ago.\n\nCorrelations are measured on a scale of -1 to +1. Values skewed toward -1 indicate that lower prices for one variable are associated with higher prices for the other.\n\nThe 90-day correlation coefficient of -0.70 suggests a notably strong negative relationship between the two assets. (TradingView/CoinDesk)\n\nBitcoin and the DXY have been mostly negatively correlated over the past three years, except in times where crypto-specific factors overshadowed the dollar trends. For instance, bitcoin fell in late 2022 as the collapse of crypto exchange FTX kept investors from cheering weakness in the U.S. currency. A similar breakdown was seen in the lead-up to Coinbase's (COIN) Nasdaq debut in April 2021 and the launch of a futures-based exchange-traded fund in the U.S. the following October.\n\nFocus on GDP\n\nAt 12:30 UTC, the U.S. Bureau of Economic Analysis will release its preliminary estimate of first-quarter GDP. The data is likely to show the world's largest economy grew at an annualized rate of 2.0%, a slower pace than the 2.6% growth in the fourth quarter last year, according to Reuters estimates published by FXStreet.\n\nSeveral economic indicators and bond market metrics have been warning of a recession for months. The dollar index has declined by over 12% since early October in the hopes that the Federal Reserve would halt its interest-rate hikes and resort to liquidity easing to support the economy.\n\nStory continues\n\nBesides, traders are back to pricing three interest-rate cuts by year end in the wake of issues at First Republic Bank (FRC), even though the Fed didn't cut rates and maintained a hawkish or anti-stimulus bias following the banking crisis episode of March.\n\nWith so much dovish expectations already in the air, the GDP figure might have to indicate a sharper-than-expected moderation in economic activity to trigger a deeper dollar sell-off and rally in risky assets, including cryptocurrencies.\n\nIt also means that a upbeat figure may see markets price out rate cuts and lift the dollar higher.\n\n\"The market eyes growth at 2% – shouldn't move markets too intently given the backward nature of the data point – would need to be a big beat/miss to the move rates expectations and the USD, gold, Nasdaq,\" Chris Weston, head of research at foreign-exchange brokerage Pepperstone, said in a tweet.\n\nAt press time, bitcoin was changing hands at $29,010, up 2% in the past 24 hours. The dollar index was little changed at 101.50."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy83LWJlc3QtYWR2YW50YWdlcy1kZWNlbnRyYWxpemVkLWN1cnJlbmNpZXMtMDgyODM0ODc1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 27 Apr 2023 07:00:00 GMT",
        "title": "7 Best Advantages Of Decentralized Currencies Like Bitcoin - Yahoo Finance",
        "content": "Do you know about Bitcoin and other cryptos that operate without a central authority? They provide advantages over conventional, centralized currencies. We’ll look at the seven main benefits of Bitcoin and similar decentralized currencies to see why they’re gaining popularity. Let’s get started, so make yourself a cup of coffee.\n\nWhy Are Decentralized Currencies Gaining Popularity?\n\nBitcoin and other decentralized currencies are gaining popularity because of their many benefits over controlled currencies. The high level of protection and privacy it provides is a significant selling point. Using a decentralized currency allows for transactions to be documented on an unchangeable and publicly shared database called a blockchain. This eliminates the need to provide private information during a transaction, lowering the potential for fraud.\n\nDecentralized currencies save the time and cost of using intermediaries, allowing for quicker and cheaper transaction processing. They are more trustworthy since a single entity does not manage them. The transaction costs are often more affordable than conventional money\n\nDecentralized currencies are helpful for those needing access to conventional banking systems since they may be used by anybody with an internet connection, regardless of where they live or their financial standing. Last, some people see Bitcoin and other decentralized currencies as good investment options because of their growth potential.\n\nThe benefits of decentralized currencies are attracting more and more users and investors, and this trend is expected to continue in the years to come.\n\nThe 7 Advantages of Decentralized Currencies\n\nBecause of its many advantages over centralized currencies, decentralized ones like Bitcoin are quickly gaining popularity in the financial sector. Transactions in these digital currencies are recorded on a distributed ledger system known as a blockchain and are not subject to the oversight of any governing body or central authority. Users benefit from increased safety, privacy, and convenience, cheaper transaction costs, and the possibility of value appreciation. This essay will examine the rising popularity of decentralized currencies among users and investors by looking at their top benefits.\n\nStory continues\n\nAdvantages of Decentralized Currencies:\n\n1. Financial Inclusion\n\nThe principle of financial inclusion is that all people, regardless of location or socioeconomic status, should have equal opportunity to use and benefit from the financial system. Banking, loaning, insurance, and other financial services may fall under this category. Sadly, many people need help accessing these services because of the significant obstacles to entry posed by conventional financial institutions, such as account minimums or credit score restrictions.\n\nBitcoin and other cryptocurrencies provide a decentralized alternative to conventional banking systems, which may facilitate greater financial inclusion. In contrast to fiat money issued by central banks, decentralized currencies do not need a bank account or a credit history for their use. Instead, access to the internet and a digital wallet is required to make and receive financial transactions.\n\n2. Immunity To Inflation\n\nIt is often believed that decentralized currencies, such as Bitcoin, are unaffected by inflation resulting from either government policy or economic shocks. This is because the quantity of such currencies is usually capped or otherwise preset, protecting them against abrupt spikes in supply that would otherwise cause their value to drop.\n\nYet, traditional currencies often experience inflationary pressures. Inflation may result from governments and central banks increasing the money supply by printing more currency or reducing interest rates. As a result, people may find it more costly to acquire necessities like food and shelter when the value of their currency decreases due to inflation.\n\nIn many cases, the total quantity of money that one may generate is capped for decentralized currencies like Bitcoin. Because of its small supply, it is less vulnerable to inflationary pressures brought on by spikes in production.\n\n3. Transparency\n\nOne of the main benefits of decentralized currencies like Bitcoin is their openness. All transactions on the blockchain are open and available to the public. The system may gain confidence and responsibility from its users if all transactions are public and easily accessible.\n\nIt might be challenging to see who did what and when in conventional monetary systems. Nevertheless, unlike controlled currencies, decentralized currencies are entirely transparent. This might make it harder to verify the legality of a transaction.\n\nThe blockchain is a public database that records every Bitcoin transaction, including the sender’s address, the recipient’s address, and the amount sent or received. The system may gain confidence and responsibility from its users if all transactions are public and easily accessible.\n\n4. No Geographic Barriers\n\nBitcoin and other decentralized currencies benefit from being global. This eliminates the necessity for centralized clearinghouses like banks or financial organizations in all but minor transactions.\n\nGeographical obstacles in traditional financial systems may make using them more accessible for certain people. For instance, some people may need more accessible access to banking services because they live in a rural or economically disadvantaged location. They may require assistance shopping or apply for credit as a result.\n\nThe opposite is true with decentralized currencies, which anybody with access to the internet may use. This eliminates the need for centralized monetary authorities such as banks or other financial organizations, making it possible for people in economically disadvantaged regions to make transactions and access financial services.\n\n5. Decentralized Autonomous Organizations (DAOs)\n\nDAOs are intended to operate without the oversight of a single person or group or are “completely autonomous and decentralized.” Instead, they are governed by the blockchain’s community of stakeholders in exchange for governance tokens.\n\nDecisions in a DAO are made using a decentralized voting system. Decisions are made based on the results of votes cast by everyone in possession of governance tokens for the organization. This eliminates strict hierarchies and permits a more democratic, bottom-up decision-making approach.\n\n6. Potential for Growth\n\nBitcoin and other decentralized currencies have tremendous room for development, which is one of their primary benefits. Its potential originates from the fact that decentralized currencies are not anchored to any one national or economic system and may therefore function outside of established monetary frameworks.\n\nDecentralized currencies are not managed by the federal government or any other single entity like conventional financial systems. They may be employed in nations where the currency is volatile or where there are stringent limitations on money movement.\n\nMoreover, decentralized currency usage helps protect against inflation and economic uncertainty. For instance, individuals in nations with significant inflation may prefer to keep their wealth in decentralized currencies like Bitcoin. This may provide some insurance against currency depreciation and inflation.\n\n7. Security and Privacy\n\nDecentralized currencies, such as Bitcoin, provide several benefits, including security and anonymity. Blockchain technology is one of the key reasons behind this.\n\nCryptography is used to increase security. Blockchain transactions are protected by elaborate mathematical procedures, making them difficult to hack. Since it is decentralized, the blockchain has no single vulnerable point. Because of this, it’s harder for hackers and cybercriminals to break in and steal money.\n\nDecentralized currencies enable users to avoid disclosing their financial information and history to financial organizations, a requirement of conventional economic systems. Furthermore, decentralized currencies help protect users’ anonymity. Because of this, more people are opting for trading bots like Bitcoin Loophole. Pseudonymity is preserved throughout blockchain transactions since users are known only by their public addresses, not their names or other identifying details. This allows for a degree of discretion and anonymity unavailable via more conventional means of exchanging money.\n\nConclusion\n\nThere are several benefits to using a decentralized currency like Bitcoin rather than a centralized one. Many people and companies would benefit from using decentralized currencies because of their desirable features, including their potential for growth, security, privacy, and resistance to inflation.\n\nDecentralized currencies are an intriguing and promising new development in the world of money, even though they still present significant difficulties and dangers. Decentralized currency markets are poised for further expansion and innovation as blockchain technology undergoes constant refinement and new applications and use cases are created.\n\nDecentralized currency markets are poised for further development and innovation as blockchain technology continuously improves and new applications and use cases are made. Decentralized currency markets are poised for further growth and innovation as blockchain technology undergoes continuous refinement and new applications and use cases are created."
    }
]