[
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY29sb3JhZG8tZG12LW5vdy1hY2NlcHRzLWJpdGNvaW4tcGF5bWVudHMtdmlhLXBheXBhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Sep 2023 07:00:00 GMT",
        "title": "Colorado DMV Now Accepts Bitcoin Payments Via PayPal - Nasdaq",
        "content": "The Colorado Division of Motor Vehicles (DMV) has announced that it now accepting Bitcoin and cryptocurrency as a payment option through PayPal for Coloradans to renew driver's licenses, identification cards, and vehicle registrations.\n\n“At the DMV, we’re always looking for ways to better serve Coloradans and leverage technology to offer our services,” said Senior Director Electra Bustle. “This new online cryptocurrency payment option is yet another way the DMV is providing innovative and convenient service delivery to our customers.”\n\nHere's how it works: customers just have to select the cryptocurrency payment option, and they will be redirected to PayPal, where they can choose their preferred cryptocurrency to complete the transaction. The selected cryptocurrency is then converted into dollars, covering the total amount due along with applicable fees, before being remitted to the DMV.\n\nHowever, it's important to note that there is a service fee associated with using cryptocurrency, amounting to $1 plus 1.83% of the total DMV charges. Additionally, PayPal may apply its own fees. As of now, PayPal is the sole cryptocurrency provider accepted for online DMV payments.\n\nFor those interested in learning more about this development and how to use Bitcoin or cryptocurrency for DMV transactions, you can visit the official Colorado DMV website here.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc2hpbm9iaS1qb2lucy1iaXRjb2luLW1hZ2F6aW5lLWFzLXRlY2huaWNhbC1lZGl0b3LSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Sep 2023 07:00:00 GMT",
        "title": "Shinobi Joins Bitcoin Magazine as Technical Editor - Nasdaq",
        "content": "Bitcoin privacy researcher Shinobi is joining Bitcoin Magazine as Technical Editor.\n\nWith a long history of contributions to the Bitcoin development conversation, Shinobi will seek to enhance the publication’s ability to elevate ongoing technical discussions at a time when navigating the extensive variety of proposals is more difficult than ever.\n\nShinobi has previously received a grant from Bitcoin payments startup Strike, and has served as Technical Advisor to the popular industry podcast What Bitcoin Did.\n\n“Bitcoin Magazine's decision to bring Shinobi on board as Technical Editor underscores its dedication to providing readers with accurate, timely, and in-depth coverage of the evolving technical landscape of Bitcoin,” said Editor-in-Chief Mark Goodwin.\n\nShinobi's work to date has involved exploring privacy solutions such as CoinJoin and other techniques that obfuscate the origin and destination of Bitcoin transactions. Further, his work has shed light on how Bitcoin transactions can be made more private and fungible, crucial qualities for a digital currency aiming to be widely adopted.\n\n“I am very excited and looking forward to the opportunity to help steer the conversation in the community away from memeing and infighting and towards constructive consideration of the many options we have to solve Bitcoin’s engineering challenges,” Shinobi said.\n\nOverall, Bitcoin Magazine remains committed to maintaining an open platform for discourse on Bitcoin, meaning Shinobi will be tasked with ensuring consistent Editorial standards are applied to all community submissions on a go-forward basis.\n\nBitcoin Magazine is open to all contributors interested in joining the Bitcoin discussion, with our editors able to be reached at editors@bitcoinmagazine.com.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jbmJjLmNvbS8yMDIzLzA5LzA1L3NvbGFuYS1qdW1wcy1vbi12aXNhLXN0YWJsZWNvaW4tYW5ub3VuY2VtZW50LWFzLWJpdGNvaW4tYW5kLW90aGVyLWNyeXB0b2N1cnJlbmNpZXMtcmVtYWluLWZsYXQuaHRtbNIBhwFodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wOS8wNS9zb2xhbmEtanVtcHMtb24tdmlzYS1zdGFibGVjb2luLWFubm91bmNlbWVudC1hcy1iaXRjb2luLWFuZC1vdGhlci1jcnlwdG9jdXJyZW5jaWVzLXJlbWFpbi1mbGF0Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Sep 2023 07:00:00 GMT",
        "title": "Solana jumps on Visa stablecoin announcement as bitcoin and other cryptocurrencies remain flat - CNBC",
        "content": "The Solana logo on a phone screen and representation of cryptocurrencies are seen in this photo taken in Krakow, Poland, Aug. 21, 2021.\n\nThe native token of the Solana blockchain jumped Tuesday after Visa announced it will expand its stablecoin capabilities to the Ethereum alternative.\n\nSolana's sol token was last higher by 4.39% at $20.25, according to Coin Metrics. At one point it rose as much as 6%. Other cryptocurrencies were little changed, with bitcoin hovering below the flat line at $25,803.25 and ether up slightly at $1,640.06.\n\nThe move came after Visa announced it will introduce settlement of the USDC stablecoin over the Solana network. The payments giant said in a statement that the development could help \"improve the speed of cross-border settlement and providing a modern option for our clients to easily send or receive funds from Visa's treasury.\"\n\nSolana is one of several networks aiming to rival Ethereum. It's loved among developers, who may choose to build applications on it instead of Ethereum because of its speed and cost effectiveness. It's year-to-date gain is one of the biggest in the crypto market at 101%.\n\nThe announcement follows the launch of PayPal's company-branded stablecoin, PayPal USD. The company said the function of PayPal USD is to reduce friction for in-experience payments in virtual settings and allow direct flows to developers.\n\nVisa has been experimenting with USDC, the second-largest stablecoin in the market, since 2021, exploring how it could be used inside its treasury operations to make currency conversion in cross-border payments shorter and cheaper.\n\nBernstein has called stablecoins the \"monster killer app\" for crypto, identifying them as a nearly $3 trillion market over the next five years.\n\n\"We expect major global financial and consumer platforms to issue co-branded stablecoins to power value exchange on their platforms,\" Bernstein said. \"Going forward, we expect tokenized stablecoins to be a $2.8 trillion market, led by regulated, onshore stablecoins.\""
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ncmF5c2NhbGUtcHJvZHMtc2VjLXRvLXRha2UtYWN0aW9uLWFzLWJpdGNvaW4tcmFsbHktZmFkZXMtMjA0MjAwNjk2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Sep 2023 07:00:00 GMT",
        "title": "Grayscale prods SEC to take action as bitcoin rally fades - Yahoo Finance",
        "content": "A lawyer working for Grayscale Investments asked to meet with the Securities and Exchange Commission \"as soon as practical\" in a Tuesday letter that prodded the regulator to approve the conversion of Grayscale’s bitcoin trust into a spot bitcoin exchange-traded fund.\n\nThe attorney from Davis Polk & Wardwell LLP asked for the meeting to \"discuss the way forward\" following a critical decision last month from a three-judge panel of the District of Columbia Court of Appeals that injected a new wave of optimism into crypto markets.\n\nThe judges concluded that the SEC was \"arbitrary and capricious\" when it denied Grayscale's conversion application in 2022 after previously approving ETF products that held bitcoin futures contracts.\n\nA spot bitcoin ETF would allow investors to get exposure to the world’s largest cryptocurrency without having to own it, possibly expanding mainstream acceptance of digital assets.\n\nIn the hours following the court decision, bitcoin rose 8% and briefly touched $28,000. But within 48 hours bitcoin (BTC-USD) gave back those gains and the rally soon fizzled.\n\nIn the last 24 hours bitcoin has fallen slightly, trading below $26,000 by Tuesday afternoon. It is down 1% over the past week.\n\nThere is no guarantee the SEC will act in a way favorable to Grayscale following the court ruling, which only requires the SEC to review Grayscale's application, not to approve it. The SEC has until mid-October to request a re-hearing of the case. It has said it is reviewing the decision.\n\n\"We must not get too excited, too carried away,\" Ric Edelman, founder of the Digital Assets Council of Financial Professionals, told Yahoo Finance on Tuesday. \"The court did not order the SEC to approve these ETFs. The court merely said that its rejection of Grayscale's application was inappropriate.\"\n\nLast week Grayscale CEO Michael Sonnenshein said in an interview with Yahoo Finance that \"we have to be a little bit patient.\"\n\nStory continues\n\nMichael Sonnenshein, CEO of Grayscale, in 2022. (Arturo Holmes/Getty Images) (Arturo Holmes via Getty Images)\n\nTuesday’s letter from his firm’s attorney applied more urgency, arguing that any further delay would harm investors.\n\n\"We believe the trust’s nearly one million investors deserve this fair playing field as quickly as possible,\" wrote Joseph Hall of Davis Polk.\n\nThe Grayscale bitcoin trust (GBTC) is the largest trust holder of bitcoin in the world. It trades at an 18% discount to the performance of bitcoin, according to YCharts.\n\nThe SEC can approve Grayscale’s ETF application, offer another argument for why it will not approve the application, or even revoke listings for the bitcoin futures ETFs it has already approved, Edelman said.\n\nRevoking the current futures ETF products \"would be shocking,\" he added, noting that \"no one is expecting it.\"\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ncmF5c2NhbGUtc2Vla3Mtc2VjLW1lZXRpbmctcHVzaC0wMDQ5NTQ2NjAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 05 Sep 2023 07:00:00 GMT",
        "title": "Grayscale Seeks SEC Meeting to Push Spot Bitcoin ETF Approval - Yahoo Finance",
        "content": "Grayscale Investments is urging the SEC to approve its request to convert its bitcoin trust into an ETF and has asked the agency to meet with them as quickly as possible after a court ruled against the agency's refusal to review Grayscale’s application.\n\nThe crypto asset manager delivered a letter on Sept. 5 to the regulator urging it to approve the conversion of the $16 billion Grayscale Bitcoin Trust into an exchange-traded fund.\n\nThe letter sent by Grayscale’s lawyers argued that the filing to turn the Grayscale Bitcoin Trust into an ETF has been “pending for nearly three times the length permitted” for the SEC to act. It also sought to address security issues raised by the agency, saying that if safety differences between a spot bitcoin and currently available futures bitcoin ETFs existed, the firm is “confident it would have surfaced by now.”\n\n“There is no available rationale that would distinguish a bitcoin futures ETP from a spot bitcoin ETP,” according to the letter sent by attorney Joseph Hall of New York’s Davis Polk.\n\nGrayscale’s Court Victory Over SEC\n\nThe request follows Grayscale’s watershed legal win over the agency on Aug. 29. The company had sued the SEC after the agency, which has to date not approved a spot bitcoin ETF, refused to permit the conversion of the Grayscale Bitcoin Trust into an ETF. Judges on the U.S. Court of Appeals D.C. Circuit last month sided with Grayscale and called the SEC’s decision “arbitrary and capricious.”\n\nThe SEC has 45 days after the ruling to appeal.\n\nInvestment managers from BlackRock Inc. to Fidelity Investments have pending spot bitcoin ETF applications in front of the SEC. Approval of the Grayscale application would open the door to their spot bitcoin ETFs being available to investors.\n\nWhile the regulatory body allows ETFs that track bitcoin futures contracts, it thus far has blocked firms from rolling out ETFs that track physical bitcoin, which is the product investors are vying for.\n\nStory continues\n\nThe ProShares Bitcoin Strategy ETF (BITO) is by far the largest bitcoin futures ETF, which has $952 million in assets under management. The SEC has denied more than 30 spot bitcoin proposals since 2021.\n\n“GBTC is ready to operate as an ETF upon regulatory approval, and Grayscale and its investors look forward to more information from the SEC,” said a Grayscale spokesperson in the company’s statement on the letter.\n\nSEC Meeting With Grayscale\n\nGrayscale is now seeking to meet with the SEC “as soon as practical” to “discuss the way forward in view of recent developments,” according to the letter.\n\nAn SEC spokesperson said the agency is “reviewing the next steps” after the Grayscale lawsuit decision.\n\nGrayscale also argued that dragging out the approval process is hurting investors by pushing down the price of the trust. It also said that a spot bitcoin ETF is the least complicated and best product structure for bitcoin ETF investors.\n\nThe firm also said that its security measures, known as surveillance sharing agreements, handled by the Chicago Mercantile Exchange, are as effective as other firms’ proposed agreements with Coinbase.\n\nGrayscale currently has one ETF, the Grayscale Future of Finance ETF (GFOF), which has $5.3 million in AUM.\n\nContact Lucy Brewster at lucy.brewster@etf.com\n\n\n\n\n\nPermalink | © Copyright 2023 etf.com. All rights reserved"
    }
]