[
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTA5L2JpdGNvaW4tYnRjLWJ1bGxzLWNoZWVyZWQtYnktbGl0ZWNvaW4tbHRjLXN1cmdlLWJlZm9yZS1oYWx2aW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Bulls Cheered by Litecoin (LTC) Surge Before Halving - Bloomberg",
        "content": "Bitcoin investors are drawing succor from a surge in the smaller token Litecoin over the past year that has outstripped the broader crypto market.\n\nThat’s because one of the drivers of Litecoin’s near 90% climb over the period was its so-called halving — or halvening — that will curb the supply of the token, a process that also lies ahead for Bitcoin in coming months."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTEwL3N0YW5kYXJkLWNoYXJ0ZXJlZC11cHMtYml0Y29pbi1mb3JlY2FzdC10by0xMjAtMDAwLWJ5LWVuZC0yMDI00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) May Reach $120,000 by End of 2024, Standard Chartered Says - Bloomberg",
        "content": "Standard Chartered is ramping up its bullish Bitcoin prediction, targeting as much as $120,000 by the end of 2024 — almost quadruple the current price — as increasingly cash-rich miners reduce sales of the token.\n\n“Increased miner profitability per BTC mined means they can sell less while maintaining cash inflows, reducing net BTC supply and pushing BTC prices higher,” Geoff Kendrick at Standard Chartered wrote Monday."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zdGFuZGFyZC1jaGFydGVyZWQtcHJlZGljdHMtYml0Y29pbi1yZWFjaC0wMjQ2MjY1MjcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Standard Chartered Predicts Bitcoin Will Reach $120K by 2025 - Yahoo Finance",
        "content": "Standard Chartered Predicts Bitcoin Will Reach $120K by 2025\n\nBitcoin (BTC) Is Up 84% Year-to-Date\n\nStandard Chartered now expects the price of Bitcoin to reach $120,000 by the end of 2024, citing the key factors as miners' hoarding of their coins and halting supply additions.\n\nThe bank also stated, according to a report published in April, that while miners continue to sell 100% of their freshly mined coins to cover costs currently, if Bitcoin's price increases to $50,000 by the end of the year, this percentage of sold coins may drop to just 20-30%, reducing the amount of coins in circulation and triggering a bullish feedback loop. Geoff Kendrick, one of the bank's top FX analysts, claimed there was now 20% \"upside\" to that prediction.\n\nBitcoin (BTC) is up 84% year-to-date, from $16,547 on January 1 to $30,455.The bank's forecast was based on the supposition that the price momentum of Bitcoin will contribute to increasing industry revenue since the beginning of the year, reversing negative momentum while revenue declines in 2022.\n\nIn the meantime, data from on-chain analytics company Glassnode reveals that over the past few months, a significant portion of BTC has been shifting hands from short-term holders to strong hands, which is a key element of all prior Bitcoin bull markets."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLWZhbGxzLWJlbG93LTMwMTAwLWxpdGVjb2luLXNvbGFuYS1wbHVuZ2Utb3Zlci0zL2FydGljbGVzaG93LzEwMTYzMzc2MC5jbXPSAYgBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1mYWxscy1iZWxvdy0zMDEwMC1saXRlY29pbi1zb2xhbmEtcGx1bmdlLW92ZXItMy9hbXBfYXJ0aWNsZXNob3cvMTAxNjMzNzYwLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin falls below $30,100; Litecoin, Solana plunge over 3% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency market was trading in the red on Monday. Bitcoin (BTC) fell 0.65% to $30,069, while Ethereum was just above the $1850 level.Meanwhile, BTC volumes in the last 24 hours stood at approximately $8.8 billion, rising 17.78% in the last 24 hours.Bitcoin started the new week trading sideways above the US$30,000 level as the market continued to digest the latest nonfarm payroll report, Edul Patel, Co-founder and CEO at Mudrex, said.\"BTC has been trading between the levels of US$30,000 and US$31,400 since the past few days. This suggests both bulls and bears are active in the market and that bulls are continuing to defend the level aggressively,\" Edul added.The global cryptocurrency market cap was trading lower, around $1.17 trillion, falling 0.74% in the last 24 hours.The total volume in DeFi is currently 1.79 billion, 7.94% of the total crypto market 24-hour volume. The volume of all stablecoins is now $20.53 billion, which is 90.86% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $584 billion. Bitcoin's dominance is currently 49.98%, an increase of 0.11% over the day, according to CoinMarketCap.\"Bitcoin has been trading within a range defined by the 20-day exponential moving average ($29,854) and the resistance level at $31,000. This consolidation indicates a sense of uncertainty among both bullish and bearish market participants regarding the next significant move. Buyers are likely to make another attempt to break above the resistance at $31,500,\" said ZebPay Trade desk.Rajagopal Menon, Vice President at WazirX, said, \"Major market oscillators point toward a Neutral sentiment. The Relative Strength Index (14), one of the key indicators, sits at 56, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) is at 33 and 31, respectively, further indicating a Neutral market.\"The MACD Level (12, 26) at 619 indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 10 with a Neutral indicator, while the Williams Percent Range (14) at -72 signals Neutral,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.34 hours, IST on July 10, 2023)Bitcoin $30,069 -0.65%Ethereum $1,856 -0.55%Tether $0.999 0.07%BNB $233.2 -0.83%XRP $0.4688 -0.14%Cardano $0.2823 -1.51% Dogecoin $0.06452 -1.87%Solana $20.9 -3.69%Polygon $0.6778 -0.80% Litecoin $93.39 -3.80%Polkadot $5.04 -1.60%Tron $0.07725 -3.52%Shiba Inu $0.000007565 -1.21%"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ub3ctc3RvcmUtYml0Y29pbi1wcml2YXRlLWtleS0wMDEwMTMzNDcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Jul 2023 07:00:00 GMT",
        "title": "You Can Now Store Your Bitcoin Private Key as Colors - Yahoo Finance",
        "content": "Forget lists of words and alphanumeric strings: a new Bitcoin tool lets you hide the key to your coins inside a rainbow.\n\nBitcoin developer Entero Positivo launched “BIP39Colors” last month, an open-source tool that can convert one’s BIP39 mnemonic phrase into a series of colors, and vice versa.\n\n“With this method, you can convert your 12-word phrase to 8 colors (or your 24-word phrase to 16 colors),” explained Positivo to Decrypt via DM. “Then you can convert your colors back to your original seed.”\n\nBIP39 Colors translates a BIP39 mnemonic to colors and viceversa. Check out the tool :https://t.co/IGrq8LlCXu - It obfuscates your mnemonic phrase\n\n- You can save each color independently without any order (at home, in css files, png images, ...)\n\n- Color codes are… pic.twitter.com/Td2sm3igVt — Entero Positivo (@EnteroPositivo) June 25, 2023\n\nBIP39 is a standard for generating one’s seed phrase, an ordered set of 12 to 24 words that contains the information necessary to create a private key, which is used to create and access one’s Bitcoin wallet.\n\nThe standardization of mnemonic phrases was meant to make it easier for users to recover their crypto in case they lose their wallet device, converting their complex private key into a set of readable words.\n\nMost wallet providers today encourage users to write their 12 words on a sheet of paper as backup, and to keep anyone else from seeing it. As Positivo explains, however, storing one’s crypto as a list of 12 words is very obvious to hackers or thieves who come across the list.\n\nColors, by contrast, \"are everywhere.\" A private key could be hidden in plain sight, and a thief wouldn’t be the wiser.\n\n“A paper with 12 words is more suspicious than a color palette labeled like 'my new home wall colors,' for example, or inside a styles.css of your [website],” he said.\n\nStory continues\n\nThe colors generated by the tool are expressed as a hex color code, a six-digit system that represents virtually any color as some combination of red, blue, and green. These colors can be stored across “several files,” Positivo explained, including HTML, CSS, or the color palette of a PNG.\n\nUnlike the word-based system, one need not remember the “order” of the colors to recover one’s seed: all that matters is that all colors are present. The developer believes the flexibility of this storage method could make it more difficult for governments to seize someone's Bitcoin.\n\n“You can give one color to your mother, another inside your [website], another one written in a web design book... and in the future recover your seed from these agnostic colors,” he wrote.\n\n🚫 No, never enter your real seed in any online tool, please ! - Generate random seeds with Iancoleman tool for example ...\n\n- Play with this tool\n\n- If you consider usefull, download it and use it on a new installed offline computer, raspberry, TailsOS, #DTails, ...\n\n- And… — Entero Positivo (@EnteroPositivo) June 26, 2023\n\nThe developer also provided instructions for how to decode one’s BIP39 colors back into their mnemonic phrase with only a calculator, not requiring any external tool."
    }
]