[
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTI3L2NyeXB0by1oZWRnZS1mdW5kcy1wYW50ZXJhLXNlZS0yMDI0LWJvb3N0LW9uLWJpdGNvaW4tYnRjLXJhbGx5LXRva2VuLW1hbmlh0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Crypto Hedge Funds, Pantera, See 2024 Boost on Bitcoin (BTC) Rally, Token Mania - Bloomberg",
        "content": "Crypto hedge funds that survived a bruising 2022 are recovering, and many are thriving. Some are even expecting a banner 2024.\n\nTake Dan Morehead ’s Pantera Capital, one of the industry’s oldest and biggest funds. The firm’s liquid-token fund was up nearly 80% this year as of mid-December, after falling 80% in 2022, according to a person familiar with the performance. Chainview Capital, the crypto hedge fund run by 31-year-old Dan Slavin , has doubled after an 18% decline last year, Slavin said."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTI3L21pY3Jvc3RyYXRlZ3ktbXN0ci1iaXRjb2luLWhvbGRpbmdzLXRvcC04LWJpbGxpb24td2l0aC1sYXRlc3QtcHVyY2hhc2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "MicroStrategy (MSTR) Bitcoin Holdings Top $8 Billion With Latest Purchase - Bloomberg",
        "content": "MicroStrategy Inc., the enterprise software maker which has made buying Bitcoin as part of its corporate strategy, increased its total holdings of the cryptocurrency to more than $8 billion through additional purchases this month.\n\nThe Tysons Corner, Virginia-based company run by Bitcoin advocate Michael Saylor acquired 14,620 Bitcoin for $616 million in cash from Nov. 30 to Dec. 26, according to a filing with the US Securities and Exchange Commission on Wednesday. That brings its total holding to 189,150 Bitcoin, or to almost 1% of the 19.58 million Bitcoin outstanding."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jbmJjLmNvbS92aWRlby8yMDIzLzEyLzI3L21pY3Jvc3RyYXRlZ3ktYnV5cy1tb3JlLWJpdGNvaW4tcHVzaGluZy1ob2xkaW5ncy10by1uZWFybHktNi1iaWxsaW9uLWNuYmMtY3J5cHRvLXdvcmxkLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "MicroStrategy buys more bitcoin, pushing holdings to nearly $6 billion - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nMicroStrategy buys more bitcoin, pushing holdings to nearly $6 billion: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, industry experts take a look back at U.S. regulatory advancements in digital assets over the past year and discuss what can be expected in 2024."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvbWljaGFlbC1zYXlsb3JzLW1pY3Jvc3RyYXRlZ3ktYnV5cy0xNDYyMC1iaXRjb2luLWZvci0lMjQ2MTUtbWlsbGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Michael Saylor's MicroStrategy Buys 14620 Bitcoin For $615 Million - Nasdaq",
        "content": "MicroStrategy, a leading business intelligence and software company, has continued its steadfast commitment to Bitcoin by purchasing an additional 14,620 BTC at a total cost of $615.7 million, Founder & Chairman Michael Saylor announced today. The purchase came as Bitcoin's price has been experiencing upward momentum, reaching highs of over $42,000.\n\nThe company initially entered the Bitcoin market in August 2020, making a significant initial investment of $250 million into BTC. Since then, they have consistently added to their Bitcoin holdings, creating a treasury reserve strategy that has garnered over 189,150 bitcoin worth more than $8.11 billion at the time of writing.\n\n“On December 27, 2023, MicroStrategy Incorporated (“MicroStrategy”) announced that, during the period between November 30, 2023 and December 26, 2023, MicroStrategy, together with its subsidiaries, acquired approximately 14,620 bitcoins for approximately $615.7 million in cash, at an average price of approximately $42,110 per bitcoin, inclusive of fees and expenses,” MicroStrategy stated. “As of December 26, 2023, MicroStrategy, together with its subsidiaries, held an aggregate of approximately 189,150 bitcoins, which were acquired at an aggregate purchase price of approximately $5.895 billion and an average purchase price of approximately $31,168 per bitcoin, inclusive of fees and expenses.”\n\nAs the fourth Bitcoin halving quickly approaches and the first spot Bitcoin ETF in the United States may be approved early into the new year, MicroStrategy continues its aggressive bitcoin investment strategy with no signs of slowing down.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTIvMjcvYml0Y29pbi0yMDIzLXJhbGx5LXB1bXBlZC11cC1tYXJhdGhvbi1jb2luYmFzZS1taWNyb3N0cmF0ZWd5LWdidGMuaHRtbNIBamh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzEyLzI3L2JpdGNvaW4tMjAyMy1yYWxseS1wdW1wZWQtdXAtbWFyYXRob24tY29pbmJhc2UtbWljcm9zdHJhdGVneS1nYnRjLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 27 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin's 2023 rally drove some of the stock market's biggest gains this year - CNBC",
        "content": "In this article COIN\n\nMSTR\n\nGBTC\n\nMARA Follow your favorite stocks CREATE FREE ACCOUNT\n\nMonitors display Coinbase signage during the company's initial public offering at the Nasdaq MarketSite in New York on April 14, 2021. Michael Nagle | Bloomberg | Getty Images\n\nFor crypto bulls, the most lucrative bets in 2023 were in the stock market. While bitcoin rallied over 150% for the year, shares of Coinbase , MicroStrategy and the Grayscale Bitcoin Trust , which are all tied closely to the digital currency, did substantially better, rising more than 300% in value. Bitcoin miner Marathon Digital soared 688%. Not only have those stocks outperformed the primary cryptocurrency, but they've been among the biggest gainers across the whole U.S. market. In the universe of publicly traded U.S. businesses with a market value of at least $5 billion, the four bitcoin-tied stocks were among the eight best performers, according to FactSet. The crypto boom represents a major bounce back from 2022, when coin prices plummeted, taking related equities down with them. A year highlighted by hedge fund collapses, crypto lender failures and crippling losses at miners was punctuated in November 2022, when crypto exchange FTX spiraled into bankruptcy, leading to the arrest of founder Sam Bankman-Fried on fraud charges. Last month, a jury in New York convicted Bankman-Fried on seven criminal counts, setting the 31-year-old former billionaire up for a possible life behind bars. Weeks later, Changpeng Zhao, founder of crypto exchange Binance, pleaded guilty and stepped down as the company's CEO as part of a $4.3 billion settlement with the Department of Justice. He faces a possible prison sentence of 18 months or longer. By the time of Bankman-Fried's conviction and Zhao's plea deal, the damage to the broader crypto market had mostly been realized, and investors were looking to the future. One of the biggest drivers for bitcoin this year was an easing of the Federal Reserve's interest rate hikes, which created a more attractive case for riskier assets. Prices were also bolstered by the upcoming bitcoin halving, which takes place every four years and is scheduled for May 2024. In the halving process, the reward for mining is cut in half, capping the supply of bitcoin. Additional buying was sparked by the potential for a flurry of bitcoin exchange-traded funds popping up in the new year. \"It's just more fuel for a fire,\" said Galaxy Digital CEO Michael Novogratz, in an interview on CNBC's \"Squawk Box\" last week. \"Crypto stocks are trading almost like a mania.\"\n\nwatch now\n\nBitcoin has climbed to $42,683 as of Tuesday, a massive win for investors who got in at the beginning of the year, when the price was around $16,500. But the leading cryptocurrency is still 38% below its record high of nearly $69,000 in November 2021. Among companies closely tied to bitcoin and valued at $5 billion or more, the best-performing stock this year was Marathon, a mining firm that just eclipsed that market cap level last week thanks to a 125% surge in December as of Tuesday's close. On Wednesday, the shares surged another 15%. Last year at this time, Marathon was hanging on by a thread. The company was in the midst of a quarter that ended with a loss of almost $400 million on sales of just $28.4 million because of tumbling bitcoin prices, a power outage at its facility in Montana and Marathon's financial exposure to bankrupt miner Compute North. \"It was pretty dire times,\" Marathon CEO Fred Thiel said in an interview last week. Bitcoin mining is an expensive operation because of the high energy costs required to operate the supercomputers. A drop in bitcoin prices means a sharp reduction in the money producers make selling the coins they mine, even as their energy bills get little relief. Thiel said the company was able to sell equity and was in the fortunate position of not having debt other than a convertible note. The picture has brightened dramatically in 2023. Last month, Marathon reported third-quarter net income of $64.1 million, as revenue jumped from a year earlier to $97.8 million. Now the company is in expansion mode, and last week announced the purchase of its first two fully owned bitcoin mining sites — one in Texas and one in Nebraska — for $178.6 million. The acquisitions increased the size of Marathon's mining portfolio by 56% to 910 megawatts of capacity. \"By vertically integrating, we take the profit margin for the third party out and we can run the site the way we want to run it,\" Thiel said. Much of the technology Marathon has been developing, he said, is focused on increased efficiency, \"which in an up market people will ignore\" because high prices lead to high margins. Thiel is trying to make sure the company is on sound financial footing the next time there's a downturn in bitcoin prices. That means bringing down production costs and creating more ways to sell energy back to the grid. He's also optimistic that through energy harvesting — taking methane gas and converting it to sellable electricity — Marathon will eventually have much more diverse revenue streams. One of the company's goals by 2028, Thiel said, is to bring bitcoin mining down to 50% of revenue.\n\nBrian Armstrong, co-founder and chief executive officer of Coinbase Inc., speaks during the Singapore Fintech Festival, in Singapore, Nov. 4, 2022. Bryan van der Beek | Bloomberg | Getty Images\n\n'Multiple sources of revenue'\n\nOutside of the mining universe, the best-performing crypto stock in the U.S. this year is Coinbase, which has soared 386% as of Tuesday's close. It rose 7.7% on Wednesday. As the only major publicly traded crypto exchange in the U.S., Coinbase has long been a popular way to buy and trade cryptocurrencies in its home market. But with the struggles at Binance, the largest exchange in the world, Coinbase picked up market share during non-U.S. trading hours, according to a report from research firm Kaiko in late November. Shortly after Zhao's plea deal, Coinbase CEO Brian Armstrong told CNBC that the news amounted to \"a vindication of the long-term strategy that we've taken to focus on compliance, make sure we were building a trusted company.\" Coinbase's revenue and stock price are still way below where they were during the heyday of crypto trading in 2021, when retail investors were jumping into the market to buy all sorts of digital currencies, including gimmicks like Dogecoin. But the business has stabilized following drastic cost-cutting measures starting last year and extending into early 2023. Coinbase also offers investors a bit of diversity outside of bitcoin. In the third quarter, bitcoin accounted for only 37% of transaction revenue at Coinbase, while ethereum made up 18% and other crypto assets amounted to 46%. Additionally, the combination of interest income and stablecoin revenue (earned through USDC reserves) more than doubled in the latest quarter to $212 million due to higher interest rates. Transaction revenue now accounts for less than half of Coinbase's net revenue, down from 96% at the time of the company's public market debut in 2021. \"We made a big effort around the time we went public to start diversifying our revenue,\" Armstrong said in an interview last week with CNBC. \"Now we have multiple sources of revenue, some of them in a high interest rate environment go up, some of them in a low interest environment go up. That means revenue has started to become more predictable.\"\n\nwatch now\n\nThe other top stock performers in crypto are much more closely tied to bitcoin. The Grayscale Bitcoin Trust is up 330% this year. GBTC hit the over-the-counter market in 2015 as the first publicly traded bitcoin fund in the U.S., offering investors a way to passively own bitcoin. The challenge for investors in the past has been that GBTC is a closed-end fund, which makes it less liquid than an ETF. Late last year, in the darkest days of crypto, GBTC's discount to its net asset value approached 50%, meaning its market cap was about half the value of the bitcoin it owned. As of Dec. 22, that discount had narrowed to 5.6%, the lowest since early 2021. The fund currently owns about $26.6 billion worth of bitcoin and has a market cap of $24.7 billion. In addition to the rally in bitcoin this year, GBTC is getting a boost from the prospects that it will get regulatory clearance next year to convert to an ETF, a move that would allow it to trade through a traditional stock exchange and gain liquidity measures that would bring its market value more in alignment with its NAV. Grayscale said in a regulatory filing Tuesday that Barry Silbert, CEO of parent company Digital Currency Group, is resigning as chairman of Grayscale Investments and exiting the board, effective Jan. 1. No reason for his departure was provided. He's being succeeded as chairman by Mark Shifke, DCG's finance chief.\n\nBig investors join the party\n\nThe Securities and Exchange Commission met with Grayscale in November and has been formally engaging with other asset managers about the issuance of bitcoin ETFs. Those meetings began after an appeals court sided in August with Grayscale in a lawsuit against the regulator, which had opposed the firm's efforts on concern that investors would lack sufficient protections. Other large money managers, such as BlackRock , Fidelity Investments and Invesco, have taken steps to create their own funds. Grayscale CEO Michael Sonnenshein told CNBC's \"Squawk Box\" last week that the \"hopeful approval\" for ETFs will bring in new participants, most notably investment advisors who oversee roughly $30 trillion in the U.S. but have restrictions on what they can buy. \"When my team had our court victory, I think that certainly unlocked a lot of optimism amongst investors about GBTC and the prospects for it to uplist as a spot bitcoin ETF,\" Sonnenshein said. \"As we turn the corner into the new year, I know there's a lot of focus on that from the investment community.\"\n\nwatch now\n\nIn the absence of an accessible ETF to date, many investors have flocked to MicroStrategy as a way to buy bitcoin. Founded in 1989 as a business intelligence software company, MicroStrategy now gets the vast majority of its value from the 174,530 bitcoins it owned as of the end of November, currently worth $7.4 billion. The stock's 327% jump this year has lifted the company's market cap to $8.3 billion. Its software and services business generated about $130 million in sales in the third quarter. The company said in a regulatory filing on Wednesday that it purchased an addition 14,620 bitcoins from Nov. 30 to Dec. 26 for $615.7 million, bringing its total to 189,150 bitcoins. The stock jumped 11%. MicroStrategy announced its plan to invest in bitcoin in mid-2020, disclosing in an earnings call that it would commit $250 million over the next 12 months to \"one or more alternative assets,\" which could include digital currencies like bitcoin. At the time, the company's market cap was about $1.1 billion. In the third quarter of 2020, MicroStrategy acquired 38,250 bitcoins for a total of $425 million. Phong Le, who was elevated to CEO from CFO last year, said on the October 2020 earnings call that MicroStrategy's investment in bitcoin allowed it to \"tap into the passion of the broader crypto market,\" adding that, \"We've seen a notable and unexpected benefit from our investment in bitcoin in elevating the profile of the company.\" Since then, MicroStrategy has come to be known as a bitcoin proxy. Co-founder and ex-CEO Michael Saylor is one of the cryptocurrency's principal evangelists, even co-authoring a book on the subject last year called \"What is Money?\" \"The one thing that we can count on is that bitcoin goes forward in the year 2024 and a strategy built around bitcoin is generally a pretty safe one for institutions,\" Saylor said in an interview Dec. 18 on CNBC's \"Closing Bell.\" \"Education makes a difference. Institutional adoption makes a difference. The spot ETF news is good news. Loosening of monetary policy is good news.\"\n\nwatch now\n\nSaylor is also optimistic about a mark-to-market accounting rule set to go into effect in 2025 (though companies can choose to adopt it earlier) that changes how companies record crypto assets. Instead of being classified as intangible assets that have to be marked down if the value drops below the purchase price, crypto will be in a separate category and companies will mark it up or down based on where it's trading. Saylor says the new measure provides an incentive for companies with billions of dollars of cash sitting on their balance sheets to put some of that money to work in bitcoin. As good of a year as it's been for the bitcoin bulls, it's been equally painful for the bears. Short sellers, or investors who bet on a drop in stock prices, have lost a combined $6.3 billion on their positions against Coinbase, MicroStrategy and Marathon, according to data supplied by S3 Partners last week. In the first three quarters of the year, crypto shorts spent $2.19 billion buying the stocks to reduce their exposure, the firm said. There's still a hefty dose of skepticism. More than 23% of Marathon's shares available for trading are sold short, while MicroStrategy's short interest-to-float ratio is about 21% and Coinbase's sits at 14%. The average among U.S. stocks is 5%, according to S3.\n\nDimon vs. the evangelists\n\nBut risk remains for the bitcoin believers. While enthusiasts like Saylor are betting on the long-term appreciation of the asset as a hedge against inflation and as a store of value, new investors are jumping into a historically volatile market. When bitcoin fell by more than 60% in 2022, Coinbase, GBTC and MicroStrategy each dropped by at least 74%. Marathon lost 90% of its value and some of its peers went out of business. Even with a more stable environment in 2023, crypto still has high-profile detractors like JPMorgan Chase CEO Jamie Dimon, who told the Senate Banking Committee earlier this month that, \"The only true use case for it is criminals, drug traffickers … money laundering, tax avoidance.\" \"If I was the government, I'd close it down,\" he said. But that prospect is looking less likely than ever as more institutional money flows into bitcoin as an investment vehicle. In mid-December, analysts at BTIG lifted their price target on MicroStrategy to $690 from $560, citing improving sentiment and the approaching bitcoin halving. \"Our expectation is that the approval of a spot BTC ETF would increase regulatory clarity around bitcoin, which should give large institutional investors, such as insurance companies, greater comfort investing in bitcoin,\" the analysts wrote. Galaxy Digital's Novogratz says that \"broadly we're still in bull market phase,\" noting that there's a constant and inherent scarcity of bitcoin supply. Novogratz expects bitcoin to eclipse its record high next year, and says that among respected investors, \"I can give you 50 of them on the other side of the table from Jamie Dimon.\" In the near term, Novogratz cautions that with so much momentum coming from crypto traders, the tide could turn and cause a correction. \"I'm a little nervous because it feels so good,\" he said. — CNBC's MacKenzie Sigalos contributed to this report WATCH: The crypto market is going to 'rally further, research firm says"
    }
]