[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTA3L2JpdGNvaW4tYnRjLXJhbGx5LWZhbHRlcnMtYXMtbW9yZS10dXJtb2lsLXJhdGVzLXByZXNlbnQtaGVhZHdpbmRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Rally Falters as More Turmoil, Rates Present Headwinds - Bloomberg",
        "content": "Bitcoin is ending the week on a down note after the optimism that pushed the price of the largest digital asset to a one-year high fades amid a flurry of fresh industry turmoil and crosscurrents in global financial markets.\n\nThe cryptocurrency, which accounts for about half of the crypto sector’s $1.2 trillion market value, edged lower for a fourth consecutive day to settle around $30,200 on Friday. The token briefly touched $31,504 on Thursday, the highest level since June 2022."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA3LTA3L2pwbW9yZ2FuLXNheXMtYS1iaXRjb2luLWV0Zi13b3VsZG4tdC1iZS1hbi1pbmR1c3RyeS1nYW1lLWNoYW5nZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "JPMorgan Doubts That the Approval of a US Bitcoin ETF Would Be a Game-Changer - Bloomberg",
        "content": "Should an exchange-traded fund that invests directly in Bitcoin receive approval in the US, it won’t be the game-changer for crypto markets that many digital-asset advocates have long predicted.\n\nThat’s according to JPMorgan strategist Nikolaos Panigirtzoglou , who argues that even though there’s broader optimism a physically backed fund could get regulatory blessing, any approval won’t be transformational for the sector since such products have existed in Canada and Europe for years without having seen tremendous inflows. Bitcoin funds overall have “attracted little investor interest” over the past two years, “failing to benefit from investor outflows from gold ETFs,” he said in a note."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYmxhY2tyb2Nrcy1iaXRjb2luLWV0Zi1maWxpbmctaWduaXRlcy1wcmljZS1yYWxseS1ob3BlLWZvci1hcHByb3ZhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Blackrock's Bitcoin ETF Filing Ignites Price Rally, Hope for Approval - Nasdaq",
        "content": "By Landon Manning\n\nAfter contentious rumors and a re-filing with the U.S. Securities And Exchange Commission (SEC), major investment management firm BlackRock’s proposal to launch a long-awaited Bitcoin ETF may soon meet regulatory approval.\n\nOne of the most anticipated developments in the world of Bitcoin financialization is the concept of the Bitcoin ETF, which has yet to be approved for the U.S. financial ecosystem. Essentially, an ETF (exchange-traded fund) is a pooled investment security, a financial instrument that ties its value to that of some external source like a collection of commodities, stock indices or other types of asset. In other words, a Bitcoin ETF would be a security that corporate and individual investors could purchase to speculate on Bitcoin’s success without actually owning the crypto asset directly.\n\nAlthough the number of people getting into Bitcoin and cryptocurrency has gone up over the years, a Bitcoin ETF would make the leading cryptocurrency vastly more accessible and potentially give millions of new investors skin in the game. Understandably then, the possibility of such a product becoming a reality has been making headlines for years, and while many have filed for regulatory approval of Bitcoin-focused ETFs, none have been approved by regulators in the U.S.\n\nBut the entrance of BlackRock as the latest financial firm to submit a Bitcoin-focused ETF proposal to the SEC, is particularly notable. This leading legacy firm has a near-perfect track record in obtaining ETF approvals. Following initial document filing for a spot Bitcoin ETF last month, the cryptocurrency market seemed to take heart, with bitcoin reaching one-year highs shortly after the application.\n\nAlthough the SEC has long signaled concern over the volatility of crypto assets, momentum now seems to favor bitcoin, with BlackRock potentially offering a product never seen before in the space. Although many comparisons can be made between this and previous existing products, an approval here could mark a new era for mainstream acceptance of Bitcoin.\n\nAs the bitcoin price appears to be rallying merely from the rumor of such a product, it seems likely that an actual approval would bring even more price momentum.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDcvMDcvcmVmaWxlLWFuZC13YWl0LXB1bHNlLWNoZWNrLW9uLXRoZS1xdWVzdC1mb3ItYS1zcG90LWJpdGNvaW4tZXRmLS5odG1s0gFpaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDcvMDcvcmVmaWxlLWFuZC13YWl0LXB1bHNlLWNoZWNrLW9uLXRoZS1xdWVzdC1mb3ItYS1zcG90LWJpdGNvaW4tZXRmLS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "Refile and wait? Pulse check on the quest for a spot bitcoin ETF - CNBC",
        "content": "Bitcoin's bounce back this summer has largely been fueled by renewed hopes of a spot bitcoin exchange-traded fund launch this year, but recent attempts from major firms like Fidelity and BlackRock continue to be deemed insufficient for approval by the U.S. Securities and Exchange Commission.\n\n\"Everybody refiled, depending on how you read the paperwork,\" Dave Nadig, financial futurist at VettaFi, told Bob Pisani on CNBC's \"ETF Edge\" on Wednesday. \"All of them are now talking about having a surveillance-sharing agreement with Coinbase .\"\n\nSurveillance-sharing agreements between exchanges and crypto custodians like Coinbase were put into place by asset managers in an attempt to appease the SEC's concerns about possible fraud and market manipulation. But the regulator still found the filings to lack clarity and comprehension, prompting BlackRock to refile last week.\n\n\"And I think there's this idea that somehow BlackRock knew something,\" Nadig said. \"And that the SEC is on the verge of approving this, once these surveillance-sharing agreements are in place.\"\n\nBlackRock first filed its application to launch the iShares Bitcoin Trust last month, with Fidelity following suit two weeks later. WisdomTree, VanEck and Invesco have also taken the steps toward their own funds.\n\nNadig explained that he still remains fairly negative on the SEC's imminent approval, the most realistic scenario being an SEC response indicating a new standard for filings and surveillance-sharing agreements across the board.\n\n\"There's a level of scrutiny involved that I will be surprised if Coinbase can meet the mark on,\" Nadig said. \"However, if [the SEC] is trying to manufacture a way to approve a bitcoin ETF, this would be the way to do it. It would still be a big shift from what they've said in the past.\"\n\nThe filings come amid an ongoing legal battle between Grayscale and the SEC about converting its Grayscale Bitcoin Trust (GBTC) into an ETF. A decision in the case is expected later this year.\n\n\"I think it's quite reasonable to say that the SEC has been arbitrary and capricious on how they've applied certain rules,\" Nadig said, adding that the SEC historically has viewed corresponding commodity spot and futures products as a positive indicator for approval.\n\n\"That doesn't mean that they necessarily approve the conversion of GBTC into an ETF,\" he added. \"But I think they can still lose that lawsuit that says [the SEC] treated somebody unfairly under the Administrative Procedures Act.\"\n\nBut Nadig explained that a potential loss by the SEC in the Grayscale lawsuit will not necessarily translate to a green light for asset management firms seeking spot funds.\n\n\"I think the odds are still negative for this year,\" Nadig said. \"But certainly, things look more positive than they did maybe three weeks ago, six weeks ago.\"\n\nDisclaimer"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDcvMDcvcmZrLWpyLWJpdGNvaW4taW52ZXN0bWVudC1yYWlzZXMtZXRoaWNzLWNvbmNlcm5zLmh0bWzSAVlodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNy8wNy9yZmstanItYml0Y29pbi1pbnZlc3RtZW50LXJhaXNlcy1ldGhpY3MtY29uY2VybnMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Jul 2023 07:00:00 GMT",
        "title": "RFK Jr. touted bitcoin but said he wasn't an investor. Financial records show otherwise - CNBC",
        "content": "Robert F. Kennedy Jr., son of former U.S. Sen. Robert F. Kennedy, speaks during the Bitcoin 2023 conference in Miami Beach, Florida, May 19, 2023.\n\nRobert F. Kennedy Jr., a Democratic candidate for president, stood at the world's biggest bitcoin conference in Miami in May and told the crowd, \"I am not an investor and I am not here to give investment advice.\" Then he announced he would be accepting campaign donations in bitcoin.\n\nWhat Kennedy didn't tell the crowd was that his family had invested in bitcoin recently, according to a financial disclosure form he filed June 30. On the twelfth page of the report, Kennedy lists a brokerage account that held between $100,001 and $250,000 worth of bitcoin. Hours after publication of this story, Kennedy's campaign manager, former Democratic Rep. Dennis Kucinich, told CNBC that the bitcoin purchase was made after the speech in Miami and before the June 30 filing deadline.\n\nThe situation could represent a conflict of interest if Kennedy were touting bitcoin on the campaign trail while his immediate family held the cryptocurrency, according to Virginia Canter, the chief ethics counsel for watchdog group Citizens for Responsibility and Ethics in Washington.\n\n\"There is no conflict here,\" Kucinich told CNBC in a follow-up interview.\n\nSince the conference, Kennedy has continued to tout bitcoin.\n\nIn late June, he tweeted: \"Bitcoin is not only a bulwark against totalitarianism and the manipulation of our money supply, it points the way toward a future in which government institutions are more transparent and more democratic.\" The tweet includes a video of part of his Miami speech where he describes how he would be pro-bitcoin as president.\n\nThe filing says the bitcoin holding made less than $201 in income but doesn't say when it was purchased. Nor does the filing say who purchased it or how much the family may have spent on their original investment. It also doesn't say whether they sold their bitcoin holding.\n\nThe bitcoin holding is listed under a section on the form that includes assets that can also belong to spouses and dependent children. It is intended to reflect holdings from the \"preceding calendar year and current year to filing date,\" according to the Office of Government Ethics. Kennedy is married to \"Curb Your Enthusiasm\" star Cheryl Hines and has six children. Kennedy signed and filed the disclosure form to the Office of Government Ethics at the end of last month, according to the document.\n\nAfter CNBC made multiple attempts to get a comment, the Kennedy campaign said hours after the publication of this story that \"the investments were not his, but his wife's. He is not involved in her investment decisions.\" The campaign did not say for how long Hines held the bitcoin investment or when she purchased the asset.\n\nLater Friday, however, a campaign representative sent a new statement, saying the bitcoin investment is indeed Kennedy's. \"I was mistaken in my last communication. Mr. Kennedy does hold a bitcoin investment, but it came later. At the time of the bitcoin speech he had no cryptocurrency holdings,\" the representative said.\n\nBefore the Kennedy campaign commented, CREW's Canter said the ownership is certainly current as of June 30, when he filed his disclosure. \"Under a traditional conflict of interest analysis, Hines' financial interests are imputed to him,\" Canter said.\n\n\"I'm really concerned that he's speaking at this conference, touting this investment to potential voters while the family has a history of owning bitcoin. It's like he could do the same thing for Procter and Gamble,\" she added. \"There's no difference in my mind from a conflicts perspective.\"\n\nAfter Kennedy's appearance in May at the Miami conference, CNBC inquired whether Kennedy had any crypto holdings. \"Mr. Kennedy has no crypto holdings,\" a spokeswoman for the campaign said at the time.\n\nKennedy said at the conference that if he were to become president he would \"make sure that your right to hold and use bitcoin is inviolable.\"\n\nPresident Joe Biden's administration has waged an aggressive fight in regard to cryptocurrencies. Securities and Exchange Commission Chairman Gary Gensler told CNBC in June \"we don't need more digital currency\" after the SEC sued crypto exchange Coinbase for allegedly acting as an unregistered broker and exchange.\n\nBitcoin's price has seen an upswing recently, hitting a 13-month high Thursday, despite parts of the crypto industry seeing headwinds.\n\nKennedy's campaign has seized attention from several wealthy supporters, even as he remains far behind Biden in Democratic primary polls. A Quinnipiac survey from June shows Biden with 70% support among Democrats and Democratic-leaning voters, while Kennedy has 17%. Kennedy, 69, is the son of former Attorney General and U.S. Sen. Robert F. Kennedy and the nephew of former President John F. Kennedy, both of whom were assassinated in the 1960s.\n\nKennedy's pro-bitcoin stance has aligned him with several top tech investors, such as billionaire and bitcoin enthusiast Jack Dorsey, with several of them offering support for his presidential run. Others include David Sacks, Chamath Palihapitiya and Omeed Malik.\n\nKennedy, who has come under fire for spreading misinformation about vaccines at large, has a history of boosting bitcoin. His nonprofit, Children's Health Defense, or CHD, also has an interest in cryptocurrencies.\n\nIts 2021 tax records show under the \"investments\" section that the group had crypto valued at over $78,000. A spokeswoman for CHD, which reportedly played a key role in pushing back on Covid vaccines and helping elevate Kennedy's profile before he began to run for president, previously told CNBC that the cryptocurrencies listed were not \"investments\" but, in fact, \"donations.\" The CHD website shows that bitcoin is one of the cryptocurrencies accepted for donations toward the nonprofit group.\n\nIn April, before he started running for president, Kennedy tweeted what appeared to be an endorsement of bitcoin being a tool to avoid impacts from a struggling U.S. economy.\n\n\"Cryptocurrencies like Bitcoin give the public an escape route from the splatter zone when this bubble invariably bursts,\" Kennedy said.\n\nIn May, days before he took the stage at the Miami bitcoin conference, Kennedy tweeted: \"Cryptocurrencies, led by bitcoin, along with other crypto technologies are a major innovation engine. It is a mistake for the U.S. government to hobble the industry and drive innovation elsewhere.\"\n\nA day later he tweeted: \"Bitcoin has been a lifesaver for people's movements around the world.\""
    }
]