[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMDUvc3RvY2stbWFya2V0cy1pbnZlc3RvcnMtc3RpbGwtYXJlbnQtY29udmluY2VkLWJ5LWJpdGNvaW4uaHRtbNIBYWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA5LzA1L3N0b2NrLW1hcmtldHMtaW52ZXN0b3JzLXN0aWxsLWFyZW50LWNvbnZpbmNlZC1ieS1iaXRjb2luLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "CNBC Daily Open: Investors still aren’t convinced by bitcoin - CNBC",
        "content": "A sign is seen in a stand during the Bitcoin Conference 2023, in Miami Beach, Florida, U.S., May 19, 2023.\n\nThis report is from today's CNBC Daily Open, our new, international markets newsletter. CNBC Daily Open brings investors up to speed on everything they need to know, no matter where they are. Like what you see? You can subscribe here .\n\nDip in markets\n\nU.S. markets were closed Monday for the Labor Day holiday. The pan-European Stoxx 600 was flat, but major bourses dipped slightly and ended the day in the red. Germany's DAX lost 0.1% as new data showed the country's July exports dropping 0.9% on the month and 1% year on year, adding to fears about the German economy contracting in the third quarter.\n\n'Sick man of Europe'\n\nGermany is once again the \"sick man of Europe,\" said Hans-Werner Sinn, president emeritus at the Ifo institute. The country's business activity in August contracted sharply, according to the HCOB flash purchasing managers index. Moreover, Germany's plans to be carbon neutral by 2045 poses a risk to its industry, which might cause a \"backlash\" from the population, Sinn said.\n\nMissing Xi at G20\n\nPremier Li Qiang will lead China's delegation at the G20 summit in New Delhi this weekend, said China's foreign ministry. While the ministry declined to confirm if President Xi Jinping would attend the summit, spokesperson Mao Ning didn't correct reporters who asked if Li's attendance meant Xi would not show up. Another noteworthy absence: Russian President Vladimir Putin.\n\nNegotiating new grain deal\n\nPutin met his Turkish counterpart Recep Tayyip Erdogan in Sochi, Russia on Monday. Putin reportedly said Russia is ready to renew the Black Sea Grain Initiative which allowed Ukraine to export agricultural products — but only if concessions are made to Russia as well.\n\n[PRO] Don't sleep on these stocks\n\nAdults need seven to nine hours of sleep per day. Even though 63% of U.S. adults don't meet that requirement, they are growing increasingly concerned about their wellbeing, according to a 2022 McKinsey survey. That's the start of a good dream for these sleep-related stocks."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMivgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNC1zZXB0ZW1iZXItMjAyMy9hcnRpY2xlc2hvdy8xMDMzNDkxMzAuY21z0gHCAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZXMtdG9kYXktbGl2ZS1uZXdzLWJpdGNvaW4tZG9nZWNvaW4tZXRoZXJldW0tc2hpYmhhLWludS1jcnlwdG9jdXJyZW5jeS1sYXRlc3QtdXBkYXRlcy00LXNlcHRlbWJlci0yMDIzL2FtcF9hcnRpY2xlc2hvdy8xMDMzNDkxMzAuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $26,000; Ethereum holds $1,600 level - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe crypto tokens were trading mixed in Monday's trade. Bitcoin, XRP , Cardano, and Solana were trading with gains, while Dogecoin , Polkadot, Litecoin , and Shiba Inu were trading with cuts.Meanwhile, the global cryptocurrency market cap was trading higher, around $1.05 trillion, rising 0.18% in the last 24 hours.The crypto market was range-bound over the weekend and continues to trade sideways. The crypto fear and greed index, too, remained steady over the weekend. The index is currently in the fear zone with a score of 40/100, said Parth Chaturvedi, Investments Lead at CoinSwitch Ventures.\"All major cryptos by market capitalization are trading marginally in the green. BTC and ETH continue to trade in a narrow range around their respective anchor levels of $26k and $1.6k. However, recent whale activity pertaining to BTC underlines optimism among investors,\" Parth said.The total volume in DeFi is currently $2.04 billion, 9.54% of the total crypto market 24-hour volume. The volume of all stablecoins is now $19.96 billion, which is 93.44% of the total crypto market 24-hour volumeThe market cap of Bitcoin, the world's largest cryptocurrency, was around $505 billion. Bitcoin's dominance is currently 48.36%, according to CoinMarketCap. Meanwhile, BTC volume stood at approximately $9.6 billion, rising 14.83% in the last 24 hours.Notably, both Bitcoin and Ether are trading below their 50-day moving averages, indicating a bearish trend, said the CoinDCX Research Team.BTC's exponential moving average (EMA) for 10-days and 200-days indicate strong Sell sentiment at 26226 and 27118, respectively. Similarly, the Simple Moving Average for 10-day and 200-day SMA indicates Sell at 26276 and 27580, respectively. Simple moving averages show strong Sell sentiments.The Ichimoku Base Line, valued at 27518, shows a Neutral sentiment for quite a long time, whereas the Hull Moving Average indicates a Buy signal at 25649. The Volume Weighted Moving Average at 26574 showed a Sell signal.The MACD Level (12, 26) at -644 indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 52 with a Neutral indicator, while the Williams Percent Range (14) at −78 signals Neutral.Quick Glance (Source: coinmarketcap.com , data as of 12.04 hours, IST on September 4, 2023)Bitcoin $25,969 0.20%Ethereum $1,638 0.02%Tether $0.9997 -0.02% BNB $215 0.16%XRP $0.5072 0.64%Cardano $0.257 0.30%Dogecoin $0.06326 -0.65%Solana $19.73 0.75%Polygon $0.5452 0.17%Litecoin $64.28 -0.46%Polkadot $4.27 -0.54%Tron $0.07706 0.29%Shiba Inu $0.000007734 -1.42%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vd2VhbHRoL2ludmVzdC93aHktY3J5cHRvY3VycmVuY2llcy1saWtlLWJpdGNvaW4tYXJlLXVubGlrZWx5LXRvLWRpc2FwcGVhci1hbnl0aW1lLXNvb24vYXJ0aWNsZXNob3cvMTAzMzAxNTcyLmNtc9IBkAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vd2VhbHRoL2ludmVzdC93aHktY3J5cHRvY3VycmVuY2llcy1saWtlLWJpdGNvaW4tYXJlLXVubGlrZWx5LXRvLWRpc2FwcGVhci1hbnl0aW1lLXNvb24vYW1wX2FydGljbGVzaG93LzEwMzMwMTU3Mi5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Why cryptocurrencies like Bitcoin are unlikely to disappear anytime soon - The Economic Times",
        "content": "I ’m sorry to say that Bitcoin has not been cancelled. After the FTX collapse, I had written that I was happy crypto had not been officially regulated in India. However, it’s clear that apart from the taxation-based measures, there won’t be a crypto ban in India, unlike, say, in China. This is fine. Crypto should not be regulated, and those who dabble in it should be left to their own devices. They should be free to go bankrupt in the manner and time they choose.At the same time, the FTX scam has not proven to be the death knell of crypto, something one could have hoped for. This implies that the cryptocurrency market may now be a permanent fixture in the global financial landscape . FTX has demonstrated that it’s possible to attract billions from investors around the globe and squander it, and yet, fail to fundamentally challenge the underlying basis of cryptocurrency. The potential for profit is simply too great and too easy to attain. The prevailing opinion is that cryptocurrency is a valid asset class, and while there may be some regulatory hurdles, these will eventually be resolved. In time, another surge in value is inevitable, leading to a significant increase in the value of the surviving currencies and tokens. Consequently, a new wave of unsuspecting savers worldwide will jeopardise their finances. While many of the fringe cryptos have become irrelevant, Bitcoin has survived and has actually performed well enough for people to start getting fooled again. This year, for instance, despite the recent drops, Bitcoin is up 57%. In fact, from its low in November last year to its high in mid-July this year, Bitcoin has doubled.Any speculative asset that can randomly double and halve is well equipped to be exploited for luring newcomers. Clearly, this is the role that Bitcoin will play well from now onwards. Unfortunately, this could continue in the foreseeable future. Looking at the Bitcoin advocacy in social media, it becomes evident that the FTX crash and the post-FTX period have, in a somewhat paradoxical manner, benefited Bitcoin. The Bitcoin advocates’ argument now is that if it has survived this, it will survive anything.At a rational level, it is not possible to refute this argument in a manner that will satisfy the surviving cryptomaniacs. To them, it’s just the line of graph that matters. If someone’s entire focus is on speculative trading without regard to the asset class, then Bitcoin serves perfectly well. In fact, it serves better than anything else because the more violent the gyrations of price, the more exciting the speculation. If something shoots up drastically and then falls as spectacularly, those who guess correctly will make that much more. This is like a drug to an addict. The crypto phenomenon cannot be understood without looking at the ordinary people who drive it. Some time ago, I read a book, Cryptostorm, written by business journalist Sundeep Khanna. It focuses almost entirely on people who got caught up in crypto. It’s a very diverse set of people, with many defying our stereotypical image of cryptomaniacs.There’s a small-town teacher, a hacker, a lawyer, and a student, among others. In many of these, one can see a yearning, a desire that if technology can create so many changes at such a fast pace, perhaps it can change money too. The entire crypto propaganda is based on inventing and exploiting this urge. Unfortunately for all these people, the rules of money and investing don’t change. That’s why this story will continue. Beyond criminal activities and ransomware, cryptocurrency is perfectly designed to take advantage of the savers, who lack the fundamental understanding about why some investments succeed and others seem too promising to be real. Human nature is invariably marked by greed, as well as the manipulation of this greed by others. That is not going to change.(The author is CEO, VALUE RESEARCH.)"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLXJlbWFpbi11bmRlci1rZXktMDk0MjI1NDE2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether remain under key levels; Sol leads gains in top 10 cryptos - Yahoo Finance",
        "content": "Bitcoin and Ether have struggled to gain traction since the Securities and Exchange Commission (SEC) postponed its decision on seven Bitcoin ETF proposals. Most top 10 non-stablecoin cryptocurrencies by market capitalization rose, except Dogecoin.\n\nSee related article: Weekly Market Wrap: Grayscale’s favorable court verdict, ETF hype fail to lift Bitcoin above US$28,000\n\nBitcoin, Ether remain subdued by SEC’s ETF delay; Sol leads gains in top 10 cryptos\n\nBitcoin was little changed during afternoon trading in Asia, trading at US$25,985 as of 4:30 p.m. in Hong Kong.\n\nThe world’s first cryptocurrency fell below the US$27,000 support level last Thursday after the SEC delayed its decisions on seven Bitcoin exchange-traded fund (ETF) proposals, including one submitted by BlackRock, the world’s largest asset manager.\n\n“Despite the prospect of U.S.-based spot ETFs and positive supply dynamics next year, tight monetary policy, albeit near its peak, remains a challenge for Bitcoin price in the near term,” wrote Jamie Coutts, a senior market structure analyst at Bloomberg Intelligence, in a research note shared with Forkast.\n\n“US-listed ETFs – despite being kneecapped by the SEC for 10 years while other jurisdictions leapfrog with their spot exchange traded products – have significant potential to attract sizable flows. The U.S. still accounts for US$23 billion, or 80% of the total assets invested in listed Bitcoin fund products.”\n\nEther slipped 0.18% during afternoon trading in Asia to US$1,638 and declined 0.03% during the past week.\n\nSolana’s SOL token was the day’s biggest winner in the top 10, after it rose 1.9% in the past 24 hours to US$19.84, but remained near a two-month low.\n\nThe total crypto market capitalization over the past 24 hours rose 0.31% to US$1.05 trillion while market volume increased 8.21% to US$21.56 billion, according to CoinMarketCap data.\n\nMythos Chain becomes 2nd largest network by NFT sales, Lufthansa launches NFT rewards platform on Polygon\n\nThe Forkast 500 NFT index rose 0.28% to 2,198.27 points in the 24 hours to 4:30 p.m. in Hong Kong but fell 1.93% during the week.\n\nStory continues\n\nMythos Chain became the second largest blockchain by 24-hour sales volume, despite its sales falling 17.44% in the past 24 hours to US$1.15 million. The network was boosted by the DMarket collection that generated US$1.14 million in sales for the network in the past 24 hours.\n\nEthereum’s 24-hour NFT sales rose 6.49% to US$5.05 million, but sales for the largest Ethereum-native NFT collection, the Bored Ape Yacht Club, fell 33.69% to US$446,463.\n\nIn the wider NFT space, Lufthansa Group, the parent company of one of the world’s largest airlines, announced the launch of an NFT-based loyalty program called Uptrip. Built on the Polygon blockchain, the platform will reward travelers with digital trading cards.\n\nFollowing the positive news, the Forkast POL NFT Composite rose 0.65% during the day, while all other Forkast Labs NFT indexes were in the red.\n\nAsian, European equities rise ahead of ECB President Christine Lagarde’s speech\n\nImage: elements.envato\n\nMajor Asian equities rose as of 4:30 p.m. in Hong Kong, with Japan’s Nikkei 225, Hong Kong’s Hang Seng Index, the Shenzhen Component and the Shanghai Composite all posting gains.\n\nChina’s Shanghai Composite Index logged its biggest weekly gains in over a month last Friday, as the country ramped up policy support for its ailing post-Covid economic recovery, according to Reuters on Monday. Investor confidence also received a boost from Beijing’s measure to allow cities to reduce payments for homebuyers and encourage lenders to lower rates on existing mortgages, to boost the country’s real estate industry.\n\nOver in the U.S., the stock market is closed for the Labor Day holiday.\n\nMajor European bourses started the week in the green, with the benchmark STOXX 600 rising 0.66% and Frankfurt’s DAX 40 up 0.5% for the day, in line with its Asian peers that also strengthened, fueled by optimism over China’s property support measures.\n\nInvestors are anticipating a speech by European Central Bank President Christine Lagarde at the Distinguished Speakers Seminar organized by the European Economics & Financial Centre later today, expecting further clues on the bloc’s interest rate trajectory.\n\nSee related article: Grayscale wins against SEC as India moves on blockchain; Friend.tech loses friends\n\nUpdates with equities"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLWRvd24tYmluYW5jZS1sb3Nlcy0wMjA4MjEwODYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 04 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether down; Binance loses another top executive - Yahoo Finance",
        "content": "Bitcoin edged lower on Tuesday morning in Asia to trade below the weekend’s resistance level of US$26,000. Ether dipped to near the US$1,600 mark, while other top 10 non-stablecoin cryptocurrencies traded mixed. XRP posted the biggest gains while Solana led the losers. Digital asset investment products saw a minor outflow last week accompanied by a surge in trading volumes, indicating mixed sentiment among institutional investors. U.S. stock futures traded mixed ahead of regular trading following the long holiday weekend.\n\nBitcoin below US$26,000\n\nBitcoin dipped 0.57% in the last 24 hours to US$25,804.63 as of 07:30 a.m. in Hong Kong for a weekly loss of 1.15%, according to CoinMarketCap data. The world’s leading cryptocurrency had been trading in the US$26,000 range since Friday. It briefly breached US$28,000 last Tuesday as an apparent victory for Grayscale Investment against the U.S. Securties and Exchange Commission boosted sentiment. That optimism has now cooled.\n\nEther dipped 0.49% to US$1,627.26, losing 1.58% over the past seven days.\n\nThe crypto market is suffering from regulatory uncertainties in the U.S., said Samer Hasn, market analyst for online brokerage XS.com, in an emailed comment. He also noted the effect of large transactions on the market, including a US$213 million XRP transaction and a US$37 million Shiba Inu transaction recorded over the weekend.\n\n“Although the reasons behind the series of huge transfers that we are witnessing in the cryptocurrency market are not yet completely clear, I believe that they may continue to fuel a state of anticipation and caution in the markets, especially since these transfers come amid weak sentiment among market participants, with the continuing battle in the judicial arena in the United States,” Hasn said.\n\nMeanwhile, Binance’s global head of product Mayur Kamat resigned from the company, Reuters reported on Monday. The world’s largest crypto exchange faces lawsuits from the U.S. SEC and Commodity Futures Trading Commission (CFTC), as well as an investigation from the U.S. Department of Justice (DOJ).\n\nStory continues\n\nMost other top 10 non-stablecoin cryptocurrencies traded mixed over the past 24 hours, with movement within the 1% range across the board. XRP led the winners with a 0.61% gain to US$0.5082, but remained 3.01% lower for the week.\n\nDigital asset investment products saw a minor outflow of US$11.2 million in the week ending Sept. 1. That was a slowdown from US$168 million last week, according to a Monday report by European alternative asset manager CoinShares. Despite the small outflow, digital investment products’ trading volume totaled US$2.8 billion, a 90% rise on the year-to-date average.\n\n“The recent minor outflows from digital asset funds may be due to uncertainty around the approval of the spot Bitcoin ETFs — following an initial surge of enthusiasm upon their announcement,” said John Stefanidis, CEO of blockchain infrastructure foundation Balthazar DAO.\n\n“As we approach the upcoming Bitcoin halving event, it will be interesting to see how these regulatory uncertainties are balanced,” he added.\n\nThe Bitcoin halving event will see the amount of new tokens issued every 10 minutes cut in half, increasing its scarcity. This is widely anticipated to produce a surge in the token’s price. The next Bitcoin halving is expected to take place in April 2024.\n\nElsewhere, crypto exchange Bybit introduced TradeGPT on Monday — an artificial intelligence-powered education tool that uses ChatGPT to generate market analysis and answer technical questions based on Bybit’s real-time market data. Other crypto exchanges including Binance, Crypto.com and OKX also launched A.I.-powered analyzing tools earlier this year.\n\nThe total crypto market capitalization dipped 0.56% to US$1.04 trillion. Trading volume rose 20.65% to US$23.77 billion.\n\nU.S. stock futures dip; China services activity slows\n\nImage: Getty Images\n\nU.S. stock futures were trading lower ahead of the opening bell Tuesday after a holiday-extended weekend for markets. Despite closing mixed on Friday, all three major U.S. indexes posted weekly gains, with Friday’s jobs data easing rate hike worries.\n\nAll the main stock indexes across Asia were showing losses as of 10:00 a.m. in Hong Kong.\n\nChina’s release of key economic data Tuesday morning cast a cloud over markets. The Caixin China services purchasing managers index (PMI) — a private gauge of the business activities in the country’s service industry — dropped from 54.1 in July to 51.8 in August, the lowest level in the past eight months. A PMI reading above 50 indicates a growth in business activities, while a sub-50 reading indicates a contraction.\n\nThe PMI report followed an unexpected expansion in China’s manufacturing industry on September 1. But a slowdown of growth in the services industry provides more evidence of a wider economic downturn.\n\n“The marginal slowdown in the services sector’s supply and demand expansion offset the improvement in manufacturing production and demand,” Wang Zhe, an economist at Caixin Insight Group, told Reuters. “There was still considerable downward pressure on the economy.”\n\nMeanwhile, Japan’s manufacturing PMI rose from 53.8 in July to 54.3 in August — the highest reading in three months, according to Reuters on Tuesday.\n\n“A stronger improvement in new orders received by Japanese service firms underpinned an acceleration in business activity growth,” Usamah Bhatti, an economist at S&P Global Market Intelligence, told Reuters. “That said, service providers signalled a steeper increase in inflationary pressures during August.”\n\nInvestors now await a decision on interest rates from the Reserve Bank of Australia expected later Tuesday. Analysts expect the country’s central bank to keep the rate unchanged at 4.10% for the third straight month, Bloomberg reported on Tuesday.\n\nIn the U.S., the Federal Reserve will meet on Sept. 20 to make its next move on interest rates, which are currently between 5.25% and 5.50%, the highest level in 22 years.\n\nThe CME FedWatch Tool predicts a 93% chance the Fed will maintain the current rate unchanged in September, up from 78% on August 28.\n\nFurther indication of how the Fed’s plan for rates will arrive with a series of official speeches on Thursday. Elsewhere, S&P will release its U.S. services purchasing manager index (PMI) for August on Wednesday.\n\n(Updates with equity section.)"
    }
]