[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTMxL2JpdGNvaW4tcy1idGMtc3VyZ2UtbWtlcy1pdC10aGUtYmVzdC1wZXJmb3JtaW5nLWFzc2V0LWluLXExLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin’s (BTC) Surge Makes It the Best Performing Asset in Q1 2023 - Bloomberg",
        "content": "Bitcoin ’s surprising fast exit from its “crypto winter” has once again put the notoriously volatile digital currency atop the leader-board in the first quarter for being the best-performing asset class by a wide margin.\n\nWith a 72% gain, Bitcoin closed out its best quarter since the three months ended March 2021, when it surged some 103%, Bloomberg data show. That vastly outstripped the S&P 500 ’s 7% year-to-date advance, the Nasdaq 100 ’s 20.5% uptick and the iShares 20+ Year Treasury Bond ETF’s 6.8% jump."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTMxL3NpbGstcm9hZC1zY2FtbWVyLXNob3VsZC1nZXQtY3JlZGl0LWZvci1haWRpbmctcmVjb3ZlcnktdXMtc2F5c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Thief Who Held $3.4 Billion in Bitcoin Deserves Prison, US Says - Bloomberg",
        "content": "Federal prosecutors urged prison time for a Georgia man who stole more than 50,000 Bitcoin valued at $3.35 billion when authorities seized it in November 2021, which at the time was the second-largest financial seizure in US history.\n\nThe seized Bitcoin is now worth $1.48 billion, but James Zhong, 32, should do time behind bars for his heist in 2012 from the Silk Road darkweb site, prosecutors told a federal judge Friday, noting he deserves leniency for helping authorities recover the stolen crypto. Zhong pleaded guilty in November and wants the judge to spare him a prison term."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTMxL21pY3Jvc3RyYXRlZ3ktbXN0ci1idGMtYml0Y29pbi1iZXQtaXMtb24tdmVyZ2Utb2YtcHJvZml0YWJpbGl0eS1hZ2FpbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "MicroStrategy's Bitcoin Bet is on Verge of Profitability Again - Bloomberg",
        "content": "MicroStrategy Inc. co-founder and Executive Chairman Michael Saylor ’s more-than $4 billion bet on Bitcoin is on the verge of turning profitable once again after the first quarter surge in the value of the original cryptocurrency.\n\nSaylor first revealed that he was buying Bitcoin in August 2020, saying the digital currency was a better place to invest the enterprise software company’s cash than traditional staples such as short-term Treasuries because of the threat of rising inflation. Since then, Bitcoin has seen wide price fluctuations that have resulted in quarterly paper gains of as much as $3.1 billion and cumulative impairment charges of more than $2.1 billion for MicroStrategy. The company’s holdings have been underwater at the close of the last three quarters."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDMvMzEvdGVjaG5vbG9neS9iaXRjb2luLWJhbmtzLWNyaXNpcy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Has Bitcoin Benefited From the Banking Crisis? Not in the Way Its Fans Hoped. - The New York Times",
        "content": "Shortly after Silicon Valley Bank failed this month, the price of Bitcoin soared above $25,000, reaching a threshold the digital currency hadn’t touched since June. This week, Bitcoin reached nearly $30,000, up 70 percent for the year.\n\nBitcoin proponents seized on the price rise to argue that the banking crisis was prompting investors to convert traditional currencies into digital coins. One crypto executive hailed the bank failures as “the end of the USD and the dawn of hyperbitcoinization.” A company that markets Bitcoin to investors started putting references to the bank runs in its promotional materials.\n\nBut despite the fanfare, there is little evidence that the recent banking collapse has generated widespread support for Bitcoin as a financial alternative.\n\nInstead, the surge in Bitcoin’s price was driven by a range of financial trends that have little to do with the technology’s philosophical underpinnings, analysts said. The reasons for the surge include growing optimism that the Federal Reserve may pause interest rate increases, as well as increasing concerns about the safety of so-called stablecoins, a type of cryptocurrency intended to maintain a price of $1."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy91cy1nb3Zlcm5tZW50LXNlbGxzLTIxNW0tc2VpemVkLTE4MzEwMjA5Mi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "US Government Sells $215M in Seized Silk Road Bitcoin, Plans to Dump Another $1.1 Billion - Yahoo Finance",
        "content": "The crypto markets may be looking uncertain right now but some are still making money from Bitcoin sales: the U.S. government.\n\nAccording to court documents filed today, the Feds sold the crypto earlier this month—making over $215 million.\n\nThe crypto in question came from the Silk Road marketplace. Hacker James Zhong confessed to stealing it, and then cops then took it in a historic seizure back in November. They are now selling it—and they still have 41,490 Bitcoins ($1.1 billion) to get rid of, the filing said.\n\n“With respect to the 51,351.89785803 Bitcoin forfeited in the Ulbricht case before Judge Schofield, the Government has begun liquidating (selling) it,” Friday’s document read.\n\n“On March 14, 2023, the Government sold 9,861.1707894 BTC (of the 51,351.89785803 BTC) for a total of $215,738,154.98. After $215,738.15 in transaction fees, the net proceeds to the Government were $215,522,416.83.”\n\nThe “Ulbricht case” refers to Silk Road founder Ross Ulbricht, who was sentenced to life in prison back in 2015 in a high-profile case.\n\nUlbricht ran the Silk Road online black market which was used to—mostly—buy and sell illegal drugs before authorities shut it down in 2014.\n\nJames Zhong pleaded guilty last year to wire fraud after the government alleged that he manipulated the Silk Road transaction system in 2012 to pocket 50,676 Bitcoins. He kept the stash hidden for 10 years until it ballooned to hit a value of $3.3 billion.\n\nBillions in Bitcoin Linked to Silk Road Seized by US Attorney’s Office\n\n“The defendant had in his possession multiple computer servers, virtual private networks, among other things, enabling him to commit the offense,” prosecutors added in Friday’s filing. “He then managed to keep the Bitcoin protected, and his identity hidden for several years.”\n\nWith the authorities planning to get rid of the remaining Bitcoin throughout 2023 in four different batches, what kind of effect might that have on the price of the biggest digital asset amid a brutal bear market?\n\nThe views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    }
]