[
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTA5L2JpdGNvaW4tYnRjLXByaWNlLXZvbGF0aWxpdHktbWF5LXNwaWtlLWFmdGVyLWhpc3RvcmljLWx1bGzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC USD) Price Volatility May Spike After Historic Lull - Bloomberg",
        "content": "Bitcoin may be closer to bursting out of a period of unusually low volatility if chart patterns and the token’s history are any guide.\n\nSome gauges of how much the largest digital asset swings around dropped toward a record low in the past month as Bitcoin hovered around $30,000. The lull coincided with a cooling in the token’s 2023 rebound from last year’s rout. The year-to-date gain stands at 80%, down from 90% through mid-July."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTA5L2JpdGNvaW4tbWluZXItcmlvdC1tYWRlLW1pbGxpb25zLWZyb20tY3JlZGl0cy1kdXJpbmctaGVhdC13YXZl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Riot Made Millions From Credits During Heat Wave - Bloomberg",
        "content": "Bitcoin miner Riot Platforms Inc. made millions of dollars by selling power rather than producing the tokens in the second quarter as the crypto-mining industry continued to grapple with the impact of low digital asset prices.\n\nThe Castle Rock, Colorado-based company had $13.5 million in power curtailment credits during the quarter, while generating $49.7 million in mining revenue. Riot booked $27.3 million in power curtailment credits last year and $6.5 million in 2021 from power sales to the Electric Reliability Council of Texas, which is the grid operator for the Lone Star state."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcmstaW52ZXN0LWJpdGNvaW4tZXRmLWV4cGVjdGVkLTA0NDAyNzI0Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "ARK Invest Bitcoin ETF Expected To Be Delayed: Cathie Wood - Yahoo Finance",
        "content": "ARK Invest Bitcoin ETF Expected To Be Delayed: Cathie Wood\n\nSEC may yet extend the deadline for deciding whether to approve Bitcoin spot ETFs\n\nThe founder of ARK Invest, Cathie Wood, has stated that she anticipates a further delay for the company's proposed spot Bitcoin ETF.\n\nThe US Securities and Exchange Commission (SEC)'s evaluation period for ARK Invest’s fund expires on August 13.\n\nIf the SEC decides to approve any Bitcoin spot ETFs, Wood stated that she anticipates that more than one will be approved simultaneously.\n\nThe ARK Invest and 21Shares Bitcoin ETF is in the lead among the eight applications being reviewed by the regulator.\n\nThe decision date may be extended further by the SEC. This week, the SEC closes the public comment period for many of the funds.\n\nGary Gensler, the chairman of the Securities and Exchange Commission, has voiced his concern over fraud and manipulation in the industry, and Grayscale has urged that any potential approval should include prior funds that have been rejected.\n\nAccording to Wood, the focus will be on marketing and communication because the majority of the fund will essentially be the same."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiuwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtOS1hdWd1c3QtMjAyMy9hcnRpY2xlc2hvdy8xMDI1NjQzMjguY21z0gG_AWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZXMtdG9kYXktbGl2ZS1uZXdzLWJpdGNvaW4tZG9nZWNvaW4tZXRoZXJldW0tc2hpYmhhLWludS1jcnlwdG9jdXJyZW5jeS1sYXRlc3QtdXBkYXRlcy05LWF1Z3VzdC0yMDIzL2FtcF9hcnRpY2xlc2hvdy8xMDI1NjQzMjguY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $29,700 ahead of US inflation data; Shiba Inu, Solana surge up to - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe crypto tokens were trading higher in Wednesday's trade ahead of key US inflation data. Bitcoin (BTC) rose 1.62% to $29,727, whereas Ethereum (ETH) was above the 1,850 level.BTC volume stood at approximately $18.1 billion, rising 34.35% in the last 24 hours.\"Bitcoin’s price breached the $30000 mark in the early hours of today but consolidated to trading above the $29500 level. This movement could be because of the fall in Chinese trade numbers for July and the U.S. 10-year Treasury yield descending lower by 11 basis points to 3.98%,\" Edul Patel, Co-founder and CEO at Mudrex, said.Other top crypto tokens, BNB , XRP, Dogecoin , Solana, Polygon, and Polkadot were also trading higher on Wednesday.Meanwhile, the global cryptocurrency market cap was trading higher, around $1.18 trillion, rising 1.49% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $578 billion. Bitcoin's dominance is currently 48.93%, an increase of 0.12% over the day, according to CoinMarketCap.\"BTC managed to break the $30k resistance level but failed to sustain the momentum, and is currently trading around $29.7k. Given its recent performance, BTC’s support level has been gradually increasing. If BTC continues to trade in a narrow range, it may find strong support at $29k itself in the coming weeks. This could provide a good base for a strong move that may follow,\" Shubham Hudda, Senior Manager at CoinSwitch Markets Desk, said.Rajagopal Menon, Vice President at WazirX, said, \"Major market oscillators point toward a Buy sentiment. The Relative Strength Index (14), one of the key indicators, sits at 54, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) is at 62 and 15, respectively, further indicating a Neutral market.\"\"The MACD Level (12, 26) at -90 indicates a Buy. The Stochastic RSI Fast (3, 3, 14, 14) is at 76 with a Neutral indicator, while the Williams Percent Range (14) at −30 signals Neutral,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.25 hours, IST on August 9, 2023)Bitcoin $29,727 1.62%Ethereum $1,856 1.27%Tether $0.9995 0.06%BNB $244 0.94%XRP $0.6448 3.22%Cardano $0.2981 1.99%Dogecoin $0.07498 1.46%Solana $24.4 5.03%Polygon $0.6911 3.27% Litecoin $84.04 1.64%Polkadot $5.05 1.43%Tron $0.07659 -0.22%Shiba Inu $0.000009627 7.07%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDgvMDkvbmV4dC13ZWVrLW9yLW5leHQteWVhci1zaGlmdHktZGVhZGxpbmUtbG9vbXMtZm9yLWEtc3BvdC1iaXRjb2luLWV0Zi5odG1s0gFsaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDgvMDkvbmV4dC13ZWVrLW9yLW5leHQteWVhci1zaGlmdHktZGVhZGxpbmUtbG9vbXMtZm9yLWEtc3BvdC1iaXRjb2luLWV0Zi5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 09 Aug 2023 07:00:00 GMT",
        "title": "Next week or next year? Shifty deadline looms for a spot bitcoin ETF - CNBC",
        "content": "While a decision from the Securities and Exchange Commission on the future of spot bitcoin ETFs could come as soon as this weekend, Bitwise Asset Management CIO Matt Hougan warns that crypto investors might have to wait a while longer.\n\n\"In every case since 2016, [the SEC] has taken up to or entirety of the 240 days they have to review these applications,\" Hougan told CNBC's Bob Pisani on \"ETF Edge\" on Monday.\n\nFollowing ARK's application for the spot iteration of the fund, a June 15 filing in the Federal Register named Aug. 13 as the deadline for the SEC to give a thumbs up or thumbs down on the exchange-traded fund.\n\nBut the SEC also has the option to stretch the deadline, with a final response not coming until as late as January 2024 for the Ark, Hougan explained.\n\n\"These are complex applications with a lot of data,\" he said. \"I think they're likely to extend this until the final review.\"\n\nHougan noted there have been a series of positive indicators for the fund's approval, such as surveillance-sharing agreements between exchanges and custodians, a more regulated and robust bitcoin futures market, and a better understanding of crypto custody and broker transfer.\n\n\"The totality of circumstances is what the SEC is looking at,\" Hougan said. \"I don't think there's any silver bullet.\"\n\nWhile classification of cryptocurrencies and the funds that track them have been a point of deliberation among investors and institutions alike, the SEC has firmly labeled the bitcoin as a commodity, something that Hougan agrees with.\n\n\"It's so decentralized, we don't know who created it,\" he explained of the flagship coin. \"There's no single person in charge of it, it's globally distributed. There are no insiders, all the information is public. And that's what makes it clearly a commodity.\"\n\nBut as you go from bitcoin to Ethereum and other assets, Hougan said, the degree of centralized control increases and the question will eventually get more complex, an obstacle he believes legislation will solve.\n\n\"You have the two largest regulators disagreeing on whether most crypto assets are securities or commodities,\" Hougan added, referring to past classification efforts between the SEC and the Commodity Futures Trading Commission.\n\n\"The right solution there is for legislators to come through and make that clear so that U.S. innovators can win in the market.\"\n\nBesides Ark, eight other organizations including Hougan's firm, Bitwise, have filed applications for a spot bitcoin ETF. Grayscale has also filed to convert its Grayscale Bitcoin Trust into a spot fund.\n\nShould the SEC move forward with the approval process, he said the best outcome for investors would be the approval of multiple products.\n\n\"I think there should be a fair playing field that allows us to have multiple spot Bitcoin ETFs that compete in the market,\" Hougan said. \"It will allow prices to be the lowest, it will allow competition to be the highest, [and] it will allow service to be the highest.\"\n\nDisclaimer"
    }
]