[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctdGhlLW9yZGluYWxzLW1vdmVtZW50LXdpbGwtYmVuZWZpdC10aGUtYml0Y29pbi1ibG9ja2NoYWlu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "How the Ordinals movement will benefit the Bitcoin blockchain - Cointelegraph",
        "content": "According to independent developer Udi Wertheimer, Bitcoin (BTC) non fungible tokens (NFTs) will positively impact the ecosystem by improving its security and incentivizing developers to build on the network.\n\nThe number of newly created Ordinals has been spiking in recent weeks, causing a surge in transaction fees and average block size on the Bitcoin blockchain.\n\nAccording to Wertheimer, Bitcoin NFTs are going to be beneficial for Bitcoin’s security budget. By driving up transaction fees, the creation of Ordinals will incentivize miners to secure the network while the revenue from mining rewards will decrease with each Bitcoin halving.\n\n“Because the block space is scarce and because there’s demand for stuff like inscriptions, there’s a lot of hope that we will get enough people who want to pay fees in order to keep the Bitcoin network secure,” Wertheimer explained in a recent interview with Cointelegraph.\n\nAlso, Wertheimer noted, Ordinals provide a new use case to make building on Bitcoin commercially profitable.\n\n“With all of that interest around Ordinals and inscriptions, I expect that there is going to be a very big ecosystem that is built around that,” he said.\n\nWertheimer dismisses the notion held by some Bitcoin core developers that creating NFTs is not an appropriate use case for Bitcoin. According to him, in recent years, Bitcoin core developers “have ignored what actual Bitcoin users want.“\n\nTo learn more about Ordinals and how they impact the Bitcoin network, watch the full interview on our YouTube channel and don’t forget to subscribe!"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90aGUtZWNvbm9taWNzLW9mLWNyeXB0b2N1cnJlbmN5LW1pbmluZy1jb3N0cy1yZXZlbnVlcy1hbmQtbWFya2V0LXRyZW5kc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "The economics of cryptocurrency mining: Costs, revenues and market trends - Cointelegraph",
        "content": "Mining refers to the process of verifying and adding new transactions to a blockchain network, such as in the case of Bitcoin (BTC) or other cryptocurrencies. The economics of mining refers to the economic incentives and costs associated with the mining process, as well as its impact on the broader economy.\n\nThe economics of crypto mining are driven by a variety of factors, including cryptocurrency prices, mining difficulty, hardware costs, energy expenses, block rewards and transaction fees. This article will explain economics of mining, including costs, revenues and market trends.\n\nCryptocurrency mining costs\n\nThe costs associated with cryptocurrency mining can be broken down into several categories:\n\nHardware costs: The price of specialized application-specific integrated circuits (ASICs), for example, can have a big impact on the profitability of mining.\n\nEnergy expenses: Since mining uses a substantial quantity of electricity to run the computing equipment, energy consumption is one of the highest costs involved. Therefore, the profitability of mining can be significantly impacted by the cost of power in a particular area.\n\nCooling costs: The heat produced by mining equipment needs to be dispersed to keep the machinery in good condition. Costs associated with cooling can be high, particularly in hotter areas or in large-scale mining operations.\n\nMaintenance and repair costs: For mining equipment to operate at its best, constant maintenance and repairs are necessary, and these expenses can mount over time.\n\nTransaction fees: Miners may receive transaction fees in addition to block rewards for processing network transactions. The profitability of mining may be impacted by the level of transaction fees, which may change depending on network activity and other elements.\n\nRelated: Bitcoin miners as energy buyers, explained\n\nCryptocurrency mining revenues\n\nThe amount of cryptocurrency that a miner is able to produce over a specific time period is often used to determine how much mining revenue a miner generates. The revenue is determined by multiplying the value of the mined cryptocurrency by its current market price.\n\nConsider a scenario in which a miner employs mining equipment that can produce 1 BTC every 10 days. The miner’s profit for each block produced would be as follows if the market price of BTC is $50,000:\n\nHowever, the amount of revenue made from mining cryptocurrencies fluctuates based on a number of variables, such as the price at which the cryptocurrency is currently trading on the market, the difficulty of the mining process, the price of power and the effectiveness of the mining equipment being utilized.\n\nFor example, in the early days of Bitcoin mining, it was possible to generate significant revenue with relatively simple hardware. The revenue per unit of computer power did, however, decline as mining complexity and the number of miners rose.\n\nRelated: How to build a cryptocurrency mining rig\n\nCryptocurrency mining market trends\n\nIn recent years, the cryptocurrency mining market has experienced significant growth and has become an increasingly important part of the overall cryptocurrency ecosystem. Some key trends in the crypto mining market include:"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZhY2VzLWRvLW9yLWRpZS13ZWVrbHktbW9udGhseS1jbG9zZS13aXRoLW1hY3JvLWJ1bGwtdHJlbmQtYXQtc3Rha2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin faces do-or-die weekly, monthly close with macro bull trend at stake - Cointelegraph",
        "content": "Bitcoin (BTC) is leaving traders guessing as the bull market's future depends on the last week of February.\n\nIn multiple tweets on Feb. 17, popular trader and analyst Rekt Capital flagged crucial resistance battles ongoing on BTC/USD across multiple timeframes.\n\nBitcoin price squares off with bear market downtrend\n\nBitcoin hit new six-month highs this week as the latest innings of its 2023 recovery kept the bull-bear debate raging.\n\nAfter a consolidatory start to the month, February has become a reckoning point for Bitcoin price strength. Gains have been harder to cement than in January, when BTC/USD finished up nearly 40%.\n\nFor Rekt Capital, now is the time to pay attention — whether trading daily, weekly or even monthly timeframes.\n\nThe weekly chart perhaps represents the biggest struggle in the wake of the 2022 bear market. Bitcoin is currently attempting to beat out an area of resistance it failed to conquer last August, so far without success.\n\n“Ultimately, a Weekly Close above this key area is what BTC needs to achieve to break this confluent area of resistance to continue moving higher,” Rekt Capital wrote in part of an update on the weekly chart.\n\nThe picture is complicated thanks to two other major resistance trend lines lying overhead, coming in the form of the 50-week and 200-week moving averages (MAs).\n\nAs Cointelegraph reported, these have formed their first-ever “death cross” — a potential nail in the coffin for those hoping that a new bull market is beginning.\n\nOn monthly time frames, an equally tense situation is developing. Here, too, BTC/USD is “getting very close to breaking the Macro Downtrend,” Rekt Capital says.\n\nThe upcoming monthly close will be the deciding factor, as continued strength could see Bitcoin begin March outside a falling trend line in place since the November 2021 all-time highs.\n\nWhile this would be a significant event, certain signs already suggest that it could become a reality. Bitcoin’s relative strength index (RSI), formerly at all-time lows, “has confirmed a new Bull Trend already.”\n\nBTC price analysis: Whales targeting “bull market maxis”\n\nCloser to home, intraday activity remains tantalizingly opaque as Bitcoin bulls cling to a portion of the week’s upside.\n\nRelated: Bitcoin metric prints ‘mother of all BTC bullish signals’ for 4th time ever\n\nTwo trips above $25,000 have nonetheless failed to result in a resistance-support flip, and at the time of writing, BTC/USD traded at around $24,500, data from Cointelegraph Markets Pro and TradingView showed.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nWhile Rekt Capital is celebrating a confirmed breakout, others remain fearful that the entire episode has been the result of manipulation by market whales.\n\nAnalyzing order book activity on Binance, monitoring resource Material Indicators appeared to be in no doubt about the spurious nature of current price “strength.“\n\nWhales have been moving bid support moving higher, creating the illusion of a “bull market breakout.“\n\n“We already have 2 rejections so if they get it, it’s a bonus,“ Material Indicators wrote about the twin moves above $25,000.\n\n“IMO, the goal was to raise the distribution range and drop ask liquidity on to bull market maxis.“\n\nAn accompanying order book chart captured the action, along with whale volumes decreasing as spot price increased — a phenomenon Material Indicators recently dubbed “whalish divergence.“\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2hvdy1vcmRpbmFscy1hcmUtYWZmZWN0aW5nLWJpdGNvaW4tbWVtcG9vbHMtdHJhbnNhY3Rpb24tc2l6ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "The impact of Ordinals on Bitcoin mempools & transaction size - CryptoSlate",
        "content": "The introduction of the Ordinals Protocol, which enables the development of Bitcoin-based NFTs, has coincided with significant changes to mempool activity and transaction size, new data by CryptoSlate and Glassnode show.\n\nWhat are Bitcoin Ordinals?\n\nThe ability to mint non-fungible tokens directly onto Bitcoin’s blockchain with all associated content, such as images and videos, is made possible by Ordinal NFTs, also known as digital artifacts or inscriptions.\n\nLaunched in January 2023, the Ordinals protocol allows users to interact with and exchange individual satoshis that may contain unique inscribed data. This new approach to creating NFTs on Bitcoin takes advantage of changes included in the Bitcoin Taproot upgrade. It involves placing the complete content of the NFT directly on-chain, providing a novel way to explore, transfer, and receive such tokens.\n\nWhen combined with the SEC’s decision to exempt Bitcoin from the “security” classification, some experts say a bullish outlook for Bitcoin begins to emerge, which could positively impact the entire cryptocurrency ecosystem.\n\nQuantitative analysis\n\nAccording to recent Glassnode data sourced in conjunction with CryptoSlate, the aftermath of Ordinals has positively impacted Bitcoin. However, the data suggests there are factors to consider in relation to the ‘health’ of the Bitcoin network. For example, the mean size of transactions increased by over 100%, from 600 B (bytes) to 1100 B.\n\nHowever, the below chart illustrates that Ordinal transactions have low satoshi fees (purple color dominant).\n\nThe total fees (USD Value) of transactions waiting in the mempool in different size (vByte) cohorts have increased since FTX collapsed, and inscriptions have lifted the baseline fee from 1 – 4 satoshis. The congestion within the mempools was raised partly due to an increase in space needed to store Ordinals inscriptions compared to standard transaction data. In addition, a surge in Bitcoin usage during the FTX saga, as investors led an exodus in exchange-held crypto, played a role in the November spike.\n\nGlassnode data shows that Bitcoin’s mean block size upper range has increased significantly since the launch of Ordinals, rising from 1.5-2.0 MB to 3.0-3.5 MB within a few weeks. The increase correlates with not only images but larger files such as audio and video starting to be stored as Ordinals.\n\nNotably, on Feb. 1, Inscription 652, the first piece in the Taproot Wizards collection, set a new record as the largest block and transaction in the history of Bitcoin, reaching 4 MB in size. Additionally, on Feb. 17., CryptoSlate reported on a fart that had been uploaded to the Ordinal network, inscription 2042.\n\nQualitative analysis\n\nGlassnode shows that while the Ordinal network has had a significant impact on Bitcoin transaction hash size and cost, qualitatively, this may be connected to a broader crackdown on proof-of-stake mechanisms.\n\nThe majority of other layer-1 crypto protocols, which refer to base-layer blockchains having their own native tokens, are built on a proof-of-stake consensus mechanism, including Ethereum.\n\nHowever, with the SEC’s crackdown on Kraken’s staking service in the United States, which suggests that only highly sophisticated retail investors can partake in validating networks of such blockchains, it appears that investing in ETH and similar tokens could become the exclusive domain of institutional players, leading to improvements to the Ordinal network.\n\nAs a result, the Ordinals Protocol is being hailed as a game-changer for the Bitcoin blockchain. By enabling the creation of Bitcoin-based NFTs, it has given the world’s most famous cryptocurrency a new purpose beyond just facilitating peer-to-peer transactions. This is particularly significant, given that the mainstream appeal of Bitcoin has arguably been hindered by factors like banking system regulations and its volatile price swings.\n\nAs evidenced by data from Glassnode, intense bullish activity appears to be forming around the Ordinal network.\n\nFeatured Data Partner\n\nMentioned in this article"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vd3d3LmZpbmRlci5jb20uYXUvYnV5LWJpdGNvaW4tY3JlZGl0LWNhcmTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Feb 2023 08:00:00 GMT",
        "title": "How to buy Bitcoin with credit card in Australia (2024 update) - finder.com.au",
        "content": "Although it's possible to buy cryptos like Bitcoin with a credit card, you should think very carefully before you do.\n\nWhile a credit card might seem like a convenient payment option, there are some serious downsides you need to consider, including excess fees and the risk of your payment being blocked. And, it can be tricky to find a crypto trading platform that accepts credit card payments.\n\nThis is not an endorsement of cryptocurrency or any specific provider, service or offering. It is not a recommendation to trade or use any services.\n\nHow to buy Bitcoin with credit card\n\nIf you've decided to buy Bitcoin with credit card from an exchange, there are a few steps you will need to follow.\n\nChoose a platform that accepts credit cards First you will need to find a platform that actually accepts credit card payments. There are a small number of platforms including crypto exchanges, investment apps and brokers that may let you pay by card. Create an account Regardless of which service you use to buy Bitcoin with a credit card, you will need to create an account. At a minimum, this requires you to sign up with an email and password. Additionally, most exchanges will require you to pass a Know Your Customer (KYC) process which involves photo ID. Make your purchase The next step is to actually purchase Bitcoin with your credit card. This requires you to provide your full credit card details. Depending on the service provider, they will also ask for billing details such as the associated address, along with the name on the card. Once the details of the credit card have been entered, then you can choose the amount of Bitcoin you would like to purchase. Remember – you can purchase less than 1 whole BTC. Store your crypto Trading platforms typically offer an in-built wallet to hold your Bitcoin on your behalf. If you don't plan on trading frequently, it's a good idea to consider transferring most of your funds to a personal crypto wallet for added security.\n\nPurchasing Bitcoin with a credit card might seem convenient but it carries a lot more risk than using funds in your bank account. Using a credit card means you are taking on debt which is going to compound rapidly if you don't pay it off immediately. Taking on debt to invest in anything – especially a volatile asset like Bitcoin – is particularly ill-advised because you could wind up losing more than your initial investment. James Edwards\n\nFinder's Global Crypto Editor\n\nWhere to buy crypto with credit card in Australia\n\nUse the table to compare platforms that let you purchase Bitcoin with a credit card in Australia. Compare fees, supported currencies and special offers.\n\nBest places to buy Bitcoin with a credit card\n\nThere are several places to buy Bitcoin with a credit card, including:\n\nCryptocurrency trading platforms. Exchanges and brokers that accept credit card typically require identity verification before purchase.\n\nExchanges and brokers that accept credit card typically require identity verification before purchase. Bitcoin ATMs. Some Bitcoin ATMs accept credit card payments, allowing users to purchase Bitcoin in person.\n\nSome Bitcoin ATMs accept credit card payments, allowing users to purchase Bitcoin in person. Peer-to-peer marketplaces. P2P platforms such as Paxful connect crypto buyers and sellers, some of whom may accept credit card payments.\n\nHow much does it cost to buy Bitcoin with a credit card?\n\nWhile buying crypto with credit is generally straightforward, it can also be quite expensive. This is because there are several fees that can contribute to the cost of your transaction, not only from the crypto broker but also from your card issuer. These charges can include:\n\nCash advance fee Many card issuers treat a cryptocurrency purchase as a cash advance. This means your purchase will usually incur a cash advance fee and will also attract higher interest rates than normal purchases. Exchange/broker fee The platform you use to buy Bitcoin or another cryptocurrency will impose its own transaction fee. These tend to range from 4–5%, but are higher in some cases. Credit card surcharge You may also be asked to pay a credit card surcharge on top of any other fees and commissions being charged. Currency exchange fee If you're using a local credit card on an overseas exchange, you might wind up paying foreign currency conversion fees. Higher interest rates Credit card providers often charge fees upwards of 10% p.a on credit loans. Double-check the loan and repayment information with your card provider and remember to account for interest rates when calculating your repayments.\n\nPros and cons of buying Bitcoin with a credit card Pros Speed. Transactions made with a credit card are usually processed quickly, allowing you to buy Bitcoin and have it in your wallet in a matter of minutes.\n\nTransactions made with a credit card are usually processed quickly, allowing you to buy Bitcoin and have it in your wallet in a matter of minutes. Earn rewards. Some credit cards offer rewards or cashback for purchases made on the card, which could help offset the cost of buying Bitcoin. Cons High fees. Buying Bitcoin with a credit card can be more expensive than other methods due to the fees charged by the credit card company and the platform used to make the purchase. Exchanges typically apply a surcharge of between 1.5% and 5%.\n\nBuying Bitcoin with a credit card can be more expensive than other methods due to the fees charged by the credit card company and the platform used to make the purchase. Exchanges typically apply a surcharge of between 1.5% and 5%. Debt. Using a credit card to purchase Bitcoin means you are going into debt. If the price of Bitcoin drops, you will still need to repay your debt in full, plus any interest.\n\nUsing a credit card to purchase Bitcoin means you are going into debt. If the price of Bitcoin drops, you will still need to repay your debt in full, plus any interest. Interest. If you don't pay off your credit card balance in full each month, you will be charged interest on the purchase, which can add significant costs over time and increase your debt.\n\nIf you don't pay off your credit card balance in full each month, you will be charged interest on the purchase, which can add significant costs over time and increase your debt. Blocked payments. Credit card issuers have been known to freeze the accounts of customers who use their cards to buy crypto, so it's a good idea to check if your bank is crypto-friendly before making a purchase.\n\nCredit card issuers have been known to freeze the accounts of customers who use their cards to buy crypto, so it's a good idea to check if your bank is crypto-friendly before making a purchase. Credit card fraud. As with any online purchase, there is a risk of credit card fraud when buying Bitcoin with a credit card. It's important to only buy from reputable platforms and to take steps to secure your credit card information.\n\nIs it safe to buy Bitcoin with a credit card?\n\nThere are a few things worth considering before you decide to purchase Bitcoin with a credit card.\n\nSecurity of the platform. Make sure the platform you are using is reputable and has a good track record of protecting customer information. Check for security features such as 2-factor authentication and SSL encryption.\n\nFees and charges. Be aware of any fees or charges associated with buying Bitcoin with a credit card. Compare these to other purchasing options to ensure you get a fair deal.\n\nVolatility of Bitcoin. The value of Bitcoin can be highly volatile, so be prepared for the possibility of significant price fluctuations after purchasing.\n\nLegal and regulatory compliance. Some countries have regulations and laws that restrict or prohibit the buying and selling of Bitcoin. Be sure to check the laws and regulations in your country before making a purchase.\n\nWallet security. If you plan to store your Bitcoin in a wallet, make sure to choose a secure and reputable wallet provider.\n\nReputation of the company. Check the company's reputation, its regulatory compliance and if it has had any security breaches in the past.\n\nCredit card debt. Buying Bitcoin on credit can easily lead to credit card debt if not managed properly, so it's essential only to spend what you can afford to repay.\n\nOther ways to buy Bitcoin\n\nCredit cards aren't the only way to purchase Bitcoin – or the best. There are several other ways to buy Bitcoin that are generally more cost effective.\n\nBank transfer. You can use a cryptocurrency exchange that accepts bank transfers as a payment method. Many major exchanges allow you to deposit funds via bank transfer and then use those funds to buy Bitcoin. ACH transfers are often free and instant. Wire transfers typically incur a cost.\n\nYou can use a cryptocurrency exchange that accepts bank transfers as a payment method. Many major exchanges allow you to deposit funds via bank transfer and then use those funds to buy Bitcoin. ACH transfers are often free and instant. Wire transfers typically incur a cost. PayPal. You can buy Bitcoin with PayPal which can then be used to make purchases on millions of online stores that accept PayPal as a payment method. Some crypto exchanges also support PayPal as a deposit method, allowing you to transfer funds from your PayPal onto the exchange, and then trade them for Bitcoin.\n\nYou can buy Bitcoin with PayPal which can then be used to make purchases on millions of online stores that accept PayPal as a payment method. Some crypto exchanges also support PayPal as a deposit method, allowing you to transfer funds from your PayPal onto the exchange, and then trade them for Bitcoin. Cash. You can buy Bitcoin with cash through a variety of methods, including a Bitcoin ATM or via a peer-to-peer crypto marketplace.\n\nIt's important to remember that each of these methods has its own advantages and disadvantages. Be sure to research and compare the different options before making a decision, and always use reputable providers to ensure the safety and security of your funds.\n\nFrequently asked questions about buying Bitcoin with a credit card\n\nCan I buy Bitcoin with a credit card instantly? Yes, but you will need to complete the ID verification process first. Verification times vary between platforms, but it's still possible to complete the sign-up and purchasing process within an hour.\n\nCan I buy Bitcoin anonymously with a credit card? Buying crypto with a credit card without ID verification can be difficult as most exchanges require personal details and KYC verification before allowing a purchase. While it may be possible to find a platform where you can make an anonymous purchase, such as a peer-to-peer exchange, the credit card you use will still be linked to your ID, making the purchase traceable.\n\nCan I buy Bitcoin with a prepaid card? Yes, some exchanges will allow you to buy cryptocurrency with a prepaid debit card or voucher.\n\nCan I buy cryptocurrency with a debit card? Yes. Check the comparison table for details of a number of leading crypto exchanges that accept debit card payments."
    }
]