[
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMDYvdGV4YXMtcGFpZC1iaXRjb2luLW1pbmVyLXJpb3QtMzFwb2ludDctbWlsbGlvbi10by1zaHV0LWRvd24taW4tYXVndXN0Lmh0bWzSAW5odHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wOS8wNi90ZXhhcy1wYWlkLWJpdGNvaW4tbWluZXItcmlvdC0zMXBvaW50Ny1taWxsaW9uLXRvLXNodXQtZG93bi1pbi1hdWd1c3QuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Sep 2023 07:00:00 GMT",
        "title": "Texas paid bitcoin miner Riot $31.7 million to shut down during heat wave in August - CNBC",
        "content": "During the crypto boom of 2021, Riot Platforms was raking in cash from bitcoin mining. Now the company is losing so much money that it's counting on energy credits from selling power back to the Texas grid to keep its costs under control.\n\nRiot said on Wednesday that it earned $31.7 million in energy credits last month from Texas power grid operator ERCOT. The company generated the credits by voluntarily curtailing its energy consumption during a record-breaking heatwave.\n\nThe total value of the credits dwarfed the 333 bitcoin the company mined in August, worth about $8.9 million dollars as of the end of the month.\n\n\"August was a landmark month for Riot in showcasing the benefits of our unique power strategy,\" said Jason Les, CEO of Riot, in the company's press release. \"The effects of these credits significantly lower Riot's cost to mine Bitcoin and are a key element in making Riot one of the lowest cost producers of bitcoin in the industry.\"\n\nIt's a dramatic strategy shift for Riot, whose revenue soared almost 8,000% in 2021 from booming demand for bitcoin. The crypto market reversed in 2022, leading to a net loss of over $500 million for the year. In the latest quarter, the company lost $27.7 million.\n\nBitcoin's recovery this year from 2022's lows has boosted Riot's stock, which is up about 230% so far in 2023, closing Wednesday at $11.24. But it's still way down from its 2021 peak of $77.90.\n\nBitcoin miners broadly have struggled amid low trading volume, according to an analyst note from JPMorgan Chase on Sept. 1. The firm found that the market cap of the 14 U.S.-listed bitcoin miners it tracked fell 21% in August to $9.7 billion. Riot was the worst-performing stock in that list, falling 39% for the month.\n\nBallooning energy prices have also helped to drag down profits for the sector, so companies have turned to alternative sources of income."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMDYvc2l4LWJpdGNvaW4tYnRjLWJpbGxpb25haXJlcy1pbi10aGUtd29ybGQtbmV3LWNyeXB0by1zdXBlci1yaWNoLXJlcG9ydC1zYXlzLmh0bWzSAXRodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wOS8wNi9zaXgtYml0Y29pbi1idGMtYmlsbGlvbmFpcmVzLWluLXRoZS13b3JsZC1uZXctY3J5cHRvLXN1cGVyLXJpY2gtcmVwb3J0LXNheXMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Sep 2023 07:00:00 GMT",
        "title": "There are just six bitcoin billionaires in the world, new crypto super-rich report says - CNBC",
        "content": "Hundreds of millions of people have crypto investments. A new report shows how many crypto millionaires and billionaires exist.\n\nHundreds of millions of people around the world have some form of crypto holdings, whether that is in bitcoin or one of the many other digital currencies.\n\nTo be exact, 425 million people use crypto, according to Henley & Partners' Crypto Wealth Report, which was released by the investment migration consultancy on Tuesday.\n\nCrypto may no longer be booming in the same way as it did at the peak of its popularity, but it remains a highly common investment. For example, over half of Gen Z (between the ages of 18 and 25) have invested in it, a report by the CFA Institute and Financial Industry Regulatory Authority's Investor Education Foundation showed earlier this year.\n\nSeventy-five percent of Americans however aren't sure that investing in, trading or using cryptocurrency is currently safe or that they can rely on the currently available tools to do so, a Pew Research survey found in April. Forty-five percent of those surveyed also said their investments hadn't done as well as they thought they would — and only 15% said it had exceeded expectations.\n\nBut some seem to have found more success with crypto, and now have holdings worth millions or even billions of U.S. dollars, according to Henley & Partners.\n\nThe firm's report on Tuesday says says 88,200 people have crypto assets worth at least $1 million — less than 1% of overall crypto users. Some 40,500 of them hold their investments in bitcoin, just under 46% of the total.\n\nFar fewer people are so-called centi-millionaires who have crypto holdings valued at over $100 million. Just 182 such investors exist, with a reported 78 of them focused on bitcoin.\n\nAnd 22 people have crypto holdings worth at least $1 billion. Six of them hold their investments in bitcoin — a far smaller proportion than among the crypto millionaires and centi-millionaires.\n\nFor comparison, the total value of the crypto market, at the time the report was written, was $1.18 trillion."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTA5LTA2L3doby1uZWVkcy1hLWJpdGNvaW4tZXRmLWFjdHVhbGx5LXRoZS1zZWMtZG9lc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Sep 2023 07:00:00 GMT",
        "title": "Who Needs a Bitcoin ETF? Actually, the SEC Does. - Bloomberg",
        "content": "Should the US Securities and Exchange Commission approve an exchange-traded fund focused on the spot market for Bitcoin? The question has yet again gained relevance, thanks to the District of Columbia Court of Appeals, which last week reversed the SEC’s decision to reject a Bitcoin ETF proposed by Grayscale Investments.\n\n\n\nThe answer is yes: With a revised approach to the issue, the SEC could turn its loss into a win.\n\n\n\nSet aside the irony of using an ETF to bet on Bitcoin, a technology supposedly designed to displace such traditional intermediaries. Maybe enthusiasts expect that Bitcoin’s many flaws — including extreme volatility, high transaction costs, inadequate throughput, and a large carbon footprint — will eventually be fixed, and that the benefits will somehow accrue to token holders. It isn’t regulators’ job to stop people from making bad decisions.\n\n\n\nSo why not just let it happen?\n\n\n\nIn a way, the SEC is already doing so: It has approved ETFs that track Bitcoin futures on the Chicago Mercantile Exchange. It’s less partial to ETFs like Grayscale’s because they would directly track the price on crypto exchanges such as Coinbase, which don’t face the same requirements for safety, soundness and investor protection that the CME does. This distinction makes little sense: If, say, “wash” trades on exchanges artificially inflate spot prices, they’ll affect futures, too. But given that the SEC is suing Coinbase for operating an illegal securities exchange, it’s understandably reluctant to approve an ETF with the company’s involvement.\n\n\n\nA different approach could both establish more consistency and give regulators much-needed authority over crypto. The SEC could approve spot Bitcoin ETFs, provided that the exchanges involved meet the same standards that their regulated competitors do. Such conditionality would rationalize the rules while motivating big ETF sponsors (such as BlackRock and Fidelity) to monitor compliance.\n\n\n\nIt would also help resolve another persistent challenge. Because Bitcoin is defined as a commodity, it doesn’t fall under the SEC’s direct jurisdiction. Instead, it’s overseen by the Commodity Futures Trading Commission — but only when it comes to futures, not spot trading. The ETF approval could thus become an important step toward setting consistent standards across crypto, including for products that don’t fit into traditional categories. And it would in no way undermine the SEC’s enforcement of securities laws.\n\n\n\nIn the absence of action from Congress, regulators should do what they can to bring crypto into line without killing it off. Here’s an opportunity. People would still be free to lose their money on ill-considered bets. But they’d be much less likely to get ripped off along the way.\n\nMore from Bloomberg Opinion:"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvZmFzYi12b3Rlcy1pbi1mYXZvci1vZi1mYWlyLXZhbHVlLWFjY291bnRpbmctZm9yLWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Sep 2023 07:00:00 GMT",
        "title": "FASB Votes In Favor of Fair Value Accounting For Bitcoin - Nasdaq",
        "content": "In a long-anticipated move, Bloomberg Tax reported that the Financial Accounting Standards Board (FASB) is set to introduce new fair value accounting rules for Bitcoin and other cryptocurrencies. These new rules aim to provide a more accurate reflection of the market value of digital assets and bring greater transparency to the financial reporting of companies that hold cryptocurrencies.\n\nThe rules, expected to be published by the end of the year, are set to go into effect as soon as 2025, but companies will be able to apply them earlier than that, the report said.\n\nFor years, the valuation of cryptocurrencies like Bitcoin has been a challenging aspect of financial reporting for companies. The volatile nature of these digital assets has made it difficult to accurately assess their fair market value. Under the current accounting standards, companies often struggled to present a true picture of their financial health, as the value of Bitcoin and cryptocurrencies fluctuated wildly.\n\nThe FASB's move to introduce fair value accounting rules will require companies to regularly assess the fair market value of their digital assets and report any fluctuations in value as part of their financial statements. This means that if the price of Bitcoin surges or plummets, companies will have to reflect these changes in their financial reports, providing stakeholders with a more accurate picture of their financial position.\n\nThe old treatment accounted for Bitcoin as an intangible asset, which meant if the price went lower than what companies bought it for, they had to take an impairment charge on their books, even if they didn't sell. But if the price went up, they couldn't receive any benefit on their books unless they sold. Now, with fair value accounting, periodically (i.e. every quarter) companies can report the unrealized gains and losses to get an actual benefit on their books if the price of the asset increases (without having to sell to capture it). This could make companies more likely to add bitcoin to their balance sheet and become long-term holders as they can report the appreciation without having to sell anything.\n\nInvestors and regulators will now have access to more timely and accurate information about the financial health of companies involved in the Bitcoin space. This increased transparency is expected to foster greater trust and confidence in the industry, which has often been plagued by concerns over its lack of oversight and regulation.\n\nThe move towards fair value accounting also aligns with the growing acceptance of Bitcoin in mainstream finance. As it become more integrated into the global financial system, it is essential that accounting standards evolve to accommodate digital assets. The FASB's decision to implement fair value accounting rules is a recognition of the maturing market and its importance in the broader economy.\n\nHowever, implementing fair value accounting for cryptocurrencies is not without its challenges. The volatility of Bitcoin and other digital assets means that companies will need to invest in robust valuation methods and procedures to ensure accuracy in their financial reporting. Additionally, auditors will need to develop expertise in assessing the fair market value of these assets, which can be a complex task.\n\nDespite these challenges, the introduction of fair value accounting rules for Bitcoin and other cryptocurrencies is a significant step forward for the industry. It will provide much-needed clarity and transparency, ultimately benefiting investors, companies, and regulators alike. As the Bitcoin market continues to grow and evolve, having a standardized accounting framework in place is essential to maintain trust and ensure the responsible integration of BTC into the global financial system.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLWNyeXB0by1zdG9ja3MtZm9jdXMtYml0Y29pbi0xNDAxMDA1MDMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 06 Sep 2023 07:00:00 GMT",
        "title": "3 Crypto Stocks in Focus as Bitcoin Gears Up for a Comeback - Yahoo Finance",
        "content": "The cryptocurrency rally came to a sudden halt in August. The price of Bitcoin (BTC) fell below the $25,000 mark in late August, its lowest level since mid-June, as volatility continues to grip markets ahead of the Federal Reserve’s September policy meeting.\n\nBitcoin staged a solid turnaround from its 2022 lows and was trading above $31,500 in early July. However, the rally stalled in late July, and August saw somewhat of a bloodbath for Bitcoin, with a nearly 10% decline.\n\nIn fact, the start to September is also rocky, holding below the psychological level of $26,000 over the past 24 hours. So, what’s in store for Bitcoin in September?\n\nTraditionally, the price of Bitcoin has been closely correlated with the performance of the tech-heavy Nasdaq 100 stock index. This is because both tech stocks and cryptocurrencies are viewed as risky assets, and investors often respond to market conditions in a similar manner when assessing their investment strategies.\n\nRight now, there are a lot of positives for having faith in Bitcoin despite its recent lows. Last month, NVIDIA Corporation NVDA came up with robust earnings. This gave not only investors confidence to invest in tech stocks but also cryptocurrencies, including Bitcoin, a boost.\n\nMoreover, the long-date Treasury yields hit multi-year highs in August. The 10-year Treasury yield hit its highest level since 2007 last month. However, it has since fallen to 4.23% as of Sep 5.\n\nThe Fed has so far increased interest rates by 525 basis points, taking the benchmark rate to the range of 5.25-5.5%. The measure has resulted in inflation declining sharply over the past year. However, inflation remains a lot higher than the Fed’s target of 2%. This has kept the Fed open for more interest rate hikes, which has been putting pressure on the bond yield.\n\nHowever, a series of economic data released over the past week indicates that the labor market is cooling. This has raised hopes of the Fed keeping interest rates unaltered in its September meeting. The CME FedWatch Tool shows that around 95% of the market participants are now confident about the Fed pausing its interest rate hikes in September.\n\nStory continues\n\nThis definitely bodes well for high-risk assets, including cryptocurrencies. Moreover, the growing interest in cryptocurrencies among financial giants is expected to drive up the prices of Bitcoin and other digital currencies in the near future.\n\nFor instance, BlackRock, Inc. BLK has urged regulators to create a spot Bitcoin ETF, a move that could boost retail investor involvement.\n\nSimilarly, The Charles Schwab Corporation SCHW is backing a new exchange called EDX Markets, indicating a growing institutional interest in the crypto space. These developments could have a positive impact on the cryptocurrency market.\n\nBitcoin’s rally may have taken a pause but the future holds promise. Currently, it is advisable for investors to contemplate accumulating cryptocurrencies through a buying-on-the-dip strategy. Each decline in cryptocurrency prices may present an advantageous opportunity for acquisitions, potentially resulting in significant gains as the market's volatility eventually settles.\n\nStocks to Watch\n\nRobinhood Markets, Inc. HOOD operates a financial services platform in the United States. Its platform allows users to invest in stocks, exchange-traded funds, options, gold and cryptocurrencies. HOOD buys and sells Bitcoin, Ethereum, Dogecoin and other cryptocurrencies using its Robinhood Crypto platform.\n\nRobinhood Markets expected earnings growth rate for the current year is 57.3%. Shares of HOOD have gained 14.8% in the past three months. Robinhood Markets currently has a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nCoinbase Global, Inc. COIN offers financial infrastructure and technology to support the global cryptocurrency economy. COIN provides a main financial account for consumers in the crypto space, a marketplace with liquidity for institutional crypto asset transactions, and technology and services for developers to build crypto-based applications and accept cryptocurrencies securely as payment.\n\nCoinbase Global’s expected earnings growth rate for the current year is 84.8%. Shares of COIN have increased 20.7% in the past three months. Coinbase currently has a Zacks Rank #3.\n\nHIVE Blockchain Technologies Ltd. HIVE operates as a cryptocurrency mining firm. The company validates transactions on blockchain networks, as well as provides crypto mining and builds bridges between crypto and traditional capital markets.\n\nHIVE Blockchain’s expected earnings growth rate for the current year is 72.3%. Shares of HIVE have gained 4.9% in the past three months. HIVE presently carries a Zacks Rank #3 (Hold).\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nThe Charles Schwab Corporation (SCHW) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nHIVE Digital Technologies Ltd. (HIVE) : Free Stock Analysis Report\n\nCoinbase Global, Inc. (COIN) : Free Stock Analysis Report\n\nRobinhood Markets, Inc. (HOOD) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    }
]