[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTE2L2JpdGNvaW4tYnRjLWV0Zi1jcmV3LWhpdC1hcy1mYWtlLW5ld3Mtc3B1cnMtODUtbWlsbGlvbi1saXF1aWRhdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin ETF Enthusiasts Hit as Fake News Fuels $85 Million Liquidation - Bloomberg",
        "content": "An erroneous news report that sparked a brief 10% rally in Bitcoin is shining a spotlight on a crypto industry that’s waiting with bated breath for the arrival of mass-market ETFs to revitalize its fortunes.\n\nOn Monday morning, a rally in the token was quickly reversed after a news report incorrectly asserted that BlackRock Inc. had received the green light to launch a spot exchange-traded fund in the cryptocurrency."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTAvMTYvY3J5cHRvY3VycmVuY2llcy1yaXNlLWJyaWVmbHktc2VuZGluZy1iaXRjb2luLW92ZXItMzAwMDAuaHRtbNIBYWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzEwLzE2L2NyeXB0b2N1cnJlbmNpZXMtcmlzZS1icmllZmx5LXNlbmRpbmctYml0Y29pbi1vdmVyLTMwMDAwLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Oct 2023 07:00:00 GMT",
        "title": "Cryptocurrencies rise, sending bitcoin over $30,000 at one point, on optimism for a new ETF - CNBC",
        "content": "At one point Monday morning, bitcoin surged above $30,000 in a sudden spike on an unconfirmed report that the iShares spot bitcoin ETF had been formally approved by the Securities and Exchange Commission. But the coin quickly gave up those gains as that report was unable to be confirmed by major media. BlackRock told CNBC the iShares Bitcoin ETP application is still under review by the SEC. Sources close to the SEC said that Monday's report was not accurate.\n\nCryptocurrencies jumped to start the week as hopeful investors weighed the likelihood that the U.S. will finally see a bitcoin ETF in the coming months.\n\nIn recent trading, bitcoin rose about 5.28% to $28,454.17, according to Coin Metrics, while ether added 1.86% to trade at $1,589.10.\n\nLast week, bitcoin had jumped on Friday on news that the SEC would not appeal a ruling in Grayscale's lawsuit against regulators. In June of 2022, Grayscale sued the SEC over its denial of the company's application to convert the popular Grayscale Bitcoin Trust (GBTC) to an ETF.\n\n\"The Federal Rules of Appellate Procedure's 45-day period to seek rehearing has now passed. The Court will now issue its final mandate within seven calendar days,\" a Grayscale spokeswoman told CNBC. \"The Grayscale team remains operationally ready to convert GBTC to an ETF upon the SEC's approval, and we look forward to sharing more information as soon as practicable.\"\n\nIt's possible the SEC could again deny Grayscale's request, but the commission has recently been losing momentum in its attempt to broadly regulate crypto, with Grayscale in particular proving an obstacle. For example, the D.C. Court of Appeals called the SEC's denial \"arbitrary and capricious.\" Many investors read Friday's news as a signal that the SEC could be close to allowing Grayscale to list GBTC shares.\n\n\"Many people think the fact that the SEC chose to ask questions is a change of behavior and therefore I do think hopes are rising that a or a number of bitcoin ETFs will be approved,\" Ark Invest CEO Cathie Wood said on CNBC's \"Halftime Report\" Monday.\n\nTo be sure, bitcoin is coming off its worst week since Aug. 18 and first negative week in six. It lost 4.35% for the week, closing at $26,755.66, according to Coin Metrics. Ether lost 6.36% for the week and ended the week at $1,544.24.\n\nBitcoin and ether may also be benefiting from worries about a recession, which has Paul Tudor Jones last week to Bernstein this morning touting bitcoin as a safe haven trade in an uncertain macroeconomy.\n\nStill, the price of bitcoin is under some pressure as the regulatory uncertainty in the U.S. crypto industry has investors apathetic about boosting their positions. As a result, the market has been plagued by low volume and liquidity and bitcoin has been unable to reach new highs above $30,000.\n\nThe optimism Monday morning lifted other crypto assets. Ripple's XRP and Binance Coin , the top coins by market cap behind bitcoin and ether excluding stablecoins, were higher by 1.77% and 2.42%, respectively. Smart contracts platform Solana's sol token was up 9% and Polygon's matic token added 2.8%.\n\nCrypto equities, which have also struggled recently, are outperforming crypto assets. On Monday morning Coinbase was higher by more than 2% in early trading. Mining stocks including Riot Platforms and Marathon Digital , were up about 5% across the board.\n\n— CNBC's Jesse Pound, Nick Wells and John Melloy contributed reporting.\n\nDon't miss these CNBC PRO stories:"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0Zi1jb21pbmctdXMtZXhwZWN0LTA5MDEwMDk5NC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Oct 2023 07:00:00 GMT",
        "title": "A Bitcoin ETF is coming to the US. Here's what to expect when that happens - Yahoo Finance",
        "content": "Since its inception 15 years ago this month, Bitcoin has become the star around which the rest of the blockchain industry revolves. It remains the most widely known and best-understood project in the broader crypto ecosystem, and it continues to galvanize interest in digital currencies across the world.\n\nOne thing that unites all Bitcoin holders is trust in unchangeable code. Every day, the network’s miners convert real-world energy into a scarce digital asset that exists on an immutable public ledger. But one place where this trust has yet to take hold is traditional finance, where many big players are unwilling to hold Bitcoin outside of a familiar investment instrument.\n\nThere are any number of reasons for this state of affairs. Though the process of buying, storing, managing and transferring Bitcoin has gotten much simpler, it’s still easy to misplace private keys or send Bitcoin to the wrong address — to say nothing of persistent concerns regarding its regulatory prospects. Ultimately, what this means is that traders operating within institutions beholden to restrictive investment rules have effectively been locked out of a promising and potentially highly profitable new arena.\n\nThe most obvious solution to this problem would be an exchange-traded fund specializing in Bitcoin. An ETF is a basket of investments that can be traded on a stock exchange. A spot Bitcoin ETF, therefore, is effectively the same thing as making Bitcoin tradeable on such an exchange. While self-custody is preferable for some folks, this would furnish a straightforward way for other investors to gain exposure to Bitcoin without needing to directly manage it themselves.\n\nAbsent an ETF, investors — particularly institutions that aren’t allowed to own Bitcoin directly — are limited to instruments like the Grayscale Bitcoin Trust. While GBTC indirectly grants exposure to Bitcoin, it doesn’t allow for immediate redemptions. This means that at various times it has traded at either sizable premiums or sizable discounts to Bitcoin, leading to incredibly inefficient cryptoasset markets. An ETF would allow many more investors to get direct exposure to Bitcoin, including major institutions that will bring an air of legitimacy to the broader digital asset space.\n\nStory continues\n\nHow close are we to a Bitcoin ETF in the United States? The short answer is: much closer than we were even a few months ago. The U.S. Court of Appeals in Washington D.C. recently sided with Grayscale in its attempt to overrule the Securities and Exchange Commission’s denial of their earlier request to establish a Bitcoin ETF. A few months before that the largest asset management company in the world, BlackRock, submitted its own proposal for a Bitcoin ETF, with many other blue-chip institutions following suit. Outside of the U.S., recent efforts in this direction have included the introduction of Europe’s first spot Bitcoin ETF, along with multiple successful approvals of Bitcoin ETFs in Canada over the past two years.\n\nIn addition to various other legal and economic justifications, global analysts offer these two examples as proof of the inevitability of a spot Bitcoin ETF in the U.S. JPMorgan’s Nikolaos Panigirtzoglou recently stated that the SEC would either be forced to approve GBTC’s Bitcoin ETFs or would have to suffer the embarrassment of retroactively withdrawing a prior approval of similar ETFs based on futures contracts. Bloomberg’s James Seyffart, in addition, predicted that spot Bitcoin ETF approvals would be a “done deal” by 2024.\n\nAt this point, the destination is inevitable; how much longer it takes to get there remains to be seen.\n\nAs for the question of “why now,” two core reasons stand out as especially important. First, in a world marked by a growing distrust of authority, Bitcoin represents a comforting mathematical certainty. A core tenet of Bitcoin is that its supply is capped at 21 million, making it one of the only assets whose supply is completely unaffected by demand. Given that increasing Bitcoin’s supply ahead of its pre-programmed emissions schedule is impossible, the only way to address an increase in demand is to make it more accessible with instruments like ETFs.\n\nThe second reason stems from the fact that more and more people are building on top of the underlying Bitcoin network. Earlier this year, NFTs and fungible tokens were introduced to the Bitcoin blockchain, causing demand for network capacity to skyrocket. Though we’re no doubt in the early stages of these developments, they are nevertheless glimpses into a future where Bitcoin contributes to the governance of complex systems with uniquely credible neutrality.\n\nAs things stand, Bitcoin is now attempting to gain access to the traditional financial system, but there is the intriguing possibility that it will compete with that system in a much more fundamental way. Rather than an ETF being a basket through which investors hold Bitcoin, for example, “tokenization” — the issuance of scarce digital tokens representing shares of ownership — could eventually be the means by which traditional assets are held in a decentralized way. This would increase transparency and available liquidity while simultaneously reducing the prevalence of fee-extracting intermediaries.\n\nAs an asset, Bitcoin is only the beginning. Its second-order effects will be truly vast."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2Y4M2Q0OWE3LWEwOGMtNDdlOS04YTU4LTI1YTE3Y2EwZDlhNNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Oct 2023 07:00:00 GMT",
        "title": "Fight to launch spot bitcoin ETF in the US passes another hurdle - Financial Times",
        "content": "Print this page\n\nThe long-running fight to launch a US exchange traded fund investing directly in bitcoin has passed another hurdle after the regulator declined to contest a court ruling made against it.\n\nThe US Securities and Exchange Commission had until Friday to appeal against an August federal appeals court ruling that it had been wrong to reject an application from cryptocurrency house Grayscale Investments to convert its $16.7bn Bitcoin Trust (GBTC), the world largest crypto fund, into an ETF.\n\nJudge Neomi Rao, writing for a three-judge panel, said the SEC had been “arbitrary and capricious” in failing to explain why it had rejected applications for “spot” bitcoin ETFs — which invest directly in the digital token — while giving the green light to ETFs trading in bitcoin futures contracts.\n\nInvestors reacted to the deadline passing for an SEC appeal by cutting GBTC’s discount to net asset value to about 14 per cent, according to Bloomberg, its narrowest margin since November 2021, having hit a record 48.9 per cent in December 2022. Bitcoin rose 3.7 per cent to $27,757 between Friday and noon UK time on Monday on the news, before spiking above $28,000 on unfounded reports that a rival BlackRock spot bitcoin ETF had been approved, a rumour later denied by both BlackRock and the SEC.\n\nGiven that the discount is expected to disappear entirely if the private trust is able to convert into an ETF, it is widely perceived as a barometer of investors’ expectations.\n\nTodd Rosenbluth, head of research at VettaFi, a consultancy said the SEC’s decision not to appeal suggested the future launch of spot bitcoin ETF looked more likely.\n\n“Combined with the regulator’s ongoing interactions with other asset managers seeking to launch a spot bitcoin ETF is a sign that a US spot bitcoin ETF is more likely to come to market in the near future. We could see new products trading in early 2024 after years of the SEC rejecting such plans.”\n\nGrayscale said it “remains operationally ready to convert GBTC to an ETF upon the SEC’s approval”.\n\nThe regulator had based its opposition to GBTC’s conversion on a view that bitcoin, which trades on unregulated exchanges, is prone to fraud and market manipulation, whereas bitcoin futures were an acceptable asset for a mainstream retail fund because they traded on regulated venues such as the Chicago Mercantile Exchange.\n\nThe SEC’s decision not to appeal against the ruling now leaves it with the option of opposing GBTC’s conversion on alternative grounds or ultimately approving it, which would seemingly open the floodgates to a wave of spot bitcoin ETFs.\n\nAlongside Grayscale, 10 other managers, including BlackRock, the world’s largest money manager, Fidelity, Ark Invest, WisdomTree, VanEck and Valkyrie, have outstanding filings in place to launch spot bitcoin ETFs.\n\nSeveral of these applicants have amended their filings in recent days to say that their assets would be held in segregated accounts by their custodian and not commingled with either corporate or other customer assets.\n\nThe list of risk factors has also been extended in many cases. Ark, for instance, in its joint filing with 21Shares now refers to “the actual or perceived use of bitcoin and other digital assets in illicit transactions, which may adversely affect the bitcoin industry and an investment in the trust”.\n\nIt further says that “digital asset mining operations can consume significant amounts of electricity, which may have a negative environmental impact and give rise to public opinion against allowing, or government regulations restricting, the use of electricity for mining operations”.\n\nThe fact that many of the applicants have adopted additional wording has given rise to speculation that the SEC is actively engaging with them rather than planning to reject the filings outright, as it has done with every application for the past decade.\n\nBradley Duke, chief strategist at ETC Group, a provider of crypto exchange traded products, said that while it was possible the SEC might find another reason to oppose spot bitcoin ETFs “it’s becoming increasingly difficult for them to do that”.\n\n“More and more of the largest American financial services firms are opening up some sort of bitcoin or crypto-backed business,” Duke said, mentioning the likes of BlackRock, Fidelity and Charles Schwab.\n\n“There is a feeling of inevitability around crypto and a spot bitcoin ETF in the US,” he added, with Patrick McHenry, chair of the House Financial Services Committee, last month criticising the SEC’s “crusade against the digital assets ecosystem”, which he argued had caused “lasting damage”.\n\nSimilar exchange traded products already exist in Canada and Europe, where their advent has so far proved uncontentious.\n\n“We have had the equivalent of spot bitcoin ETFs in Europe for many years and they have traded well and efficiently with no problems,” Duke added.\n\nRosenbluth believed the SEC would be likely to follow the pattern it set with this month’s rollout of futures-based ETFs investing in ether, the second-largest cryptocurrency, when it created a level playing field by allowing several ETFs to list on the same day, “rather than giving one firm a first-mover advantage,” as it did with the ProShares Bitcoin Trust (BITO), the first US futures-based bitcoin ETF to launch in October 2021.\n\nArk and the SEC both declined to comment.\n\nThe advent of spot bitcoin ETFs in the US would be seen as potentially opening the way for greater mainstream investment in the cryptocurrency industry, given ETFs’ status as a cheap, safe and well-understood regulatory wrapper.\n\nRegistered investment advisers, which are typically only permitted to invest in listed, regulated assets, would also have access to spot crypto for client portfolios for the first time."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWxpZ2h0bmluZy1uZXR3b3JrLXNjYWxpbmctc29sdXRpb24tMTExMDI1NzkxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 16 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin's Lightning Network Scaling Solution Seeks Resurgence After Losing Way - Yahoo Finance",
        "content": "(Bloomberg) -- When Bitcoin development company Lightning Labs first launched the Lightning Network in 2018, it was all the rage. The protocol, built on top of the Bitcoin blockchain, was designed to make cryptocurrency transactions faster and cheaper.\n\nMost Read from Bloomberg\n\nAt the time, Lightning Labs had raised $2.5 million of seed financing from investors including Twitter’s Jack Dorsey and PayPal’s David Sacks, who dubbed it “the most important protocol being built on Bitcoin.”\n\nBut soon after launching, murmurs of failed transactions on the Lightning Network began popping up on X, and suddenly, the next big thing for Bitcoin seemed anything but. Users reported liquidity issues and security vulnerabilities, creating a perception that the Lightning Network was an over-complicated, unreliable protocol.\n\nRead More: The ‘Blockchain Trilemma’ That’s Holding Back Crypto: QuickTake\n\nAs the volume of activity on Bitcoin increases, transactions can become slower and costlier. The reason Bitcoin transactions take a while to process is the underlying technology, which ensures decentralization and security by recording each transaction on an encrypted chain.\n\nThe demand for so-called “Layer-2” scaling solutions like Lightning Network has only grown, but those for Bitcoin in particular, have struggled with capital constraints. About 99% of venture capital investments over the past few years flowed into other crypto products, not Bitcoin, according to a 2022 report by Trammell Venture Partners. Since its inception, Lightning Labs has raised $82.5 million in funding compared with one of Ethereum’s leading Layer-2 solutions, Polygon, which brought around $450 million in its latest funding round.\n\nStory continues\n\n“When the Bitcoin scaling wars were happening from 2015 to 2017, it was decided that Lightning Network was going to be the layered approach that Bitcoin would pursue,” Nic Carter, a partner at Castle Island Ventures, said in an interview. “But Bitcoin itself is a very difficult protocol to change. And whenever there has been change, it’s been highly contentious.”\n\nRead More: Technology Meant to Make Bitcoin Money Again Goes Live\n\nOn the Rise Again\n\nThe protocol was first proposed by Thaddeus Dryja and Joseph Poon in 2015 as a solution to Bitcoin’s scaling limitations. While traditional digital payment companies like Visa can process around 24,000 transactions per second, Bitcoin can only process seven. Lightning Network seemed to be on the path to change that.\n\n“Historically, Bitcoin has not been the place where venture capitalists tend to be focused,” Carter said. “The Bitcoin space is very ideological, and a lot of Bitcoiners have a negative view of venture capital.”\n\nEarlier this year, two of the largest crypto exchanges, Binance and Coinbase, announced their integration with Lightning Network, joining companies like Lightspark, a crypto startup which works on Bitcoin’s Lightning Network, and digital payments firm Strike.\n\nAlthough Coinbase was eying Lightning Network “for a long time,” the technology only recently reached a place the exchange company felt “a lot better about,” Viktor Bunin, who leads the Protocol Operations team at Coinbase, said in a recent interview on the Galaxy Brains podcast.\n\n“For many years Lighting has been quite challenging to use and run,” Bunin continued. “The non-custodial experience is still severely lacking relative to the custodial experience.”\n\nBut, as a company that is “unequivocally pro-Bitcoin,” Bunin adds, Lightning Network’s eventual integration only made sense for Coinbase.\n\nLightning Labs and Binance did not respond to a request for comment. Coinbase declined to comment.\n\nBitcoin rose about 2% to $27,760 on Monday in New York. That’s less than half the record high of almost $69,000 reached in November 2021.\n\n‘An Integral Step’\n\nLast year, Lightning Labs announced the creation of Taproot Assets, formerly known as Taro, a protocol that allows users to instantly transfer other digital currencies, like stablecoin and nonfungible tokens, on the Bitcoin blockchain.\n\nChristopher Calicott, managing director of Trammell Venture Partners, said Taproot Assets is an integral step to Lightning Network’s development, as wider adoption is one of the primary obstacles the Layer-2 solution faces. A 2022 report by Arcane Research said that more than 80 million people have access to Lightning Network.\n\nWhile Lightning Network theoretically has the capability to support one million transactions per second, its ability to reach that potential is dependent on its wide-scale usability. And as a peer-to-peer network, it’s difficult to gage how many transactions are happening at any given point, according to Graham Krizek, the founder & CEO of Voltage, a Lightning as a Service (LaaS) provider.\n\nRead More: Valor, Brevan Howard Back Lightning to ‘Bitcoinize the Dollar’\n\n“You’d have to ask everyone that’s using Lightning Network how many transactions they are doing, how frequently, all of those things to really calculate it,” Krizek said.\n\nHis company Voltage was established in 2020 after he found Lightning Network difficult to understand and use, even as a developer. But compared to Lightning Network’s early days, Krizek said he’s optimistic about its future.\n\n“Now there’s a whole ecosystem, where you can use Lightning for not only depositing and withdrawing from Binance, but also in social networks or even traditional finance,” Krizek said. “There are a lot of more applications to it now and will continue to be, particularly in back end systems.”\n\nSome, like Carter, remain skeptical of the Layer-2 solution’s ability to transform even Bitcoin.\n\n“There’s a very high mental cost involved in learning to use the Lightning protocol yourself,” Carter said. “But as a different payment technology for digitally native content, I think that’s where it’ll find its niche.”\n\n(Updates to add the price of Bitcoin.)\n\nMost Read from Bloomberg Businessweek\n\n©2023 Bloomberg L.P."
    }
]