[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTA5L2V0aGVyLWV0aC1kaXNhcHBvaW50bWVudC1oYXMtYml0Y29pbi1idGMtZ2FpbmluZy1zaGFyZS1kdXJpbmctZG93bnR1cm7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Ether Disappointment Has Bitcoin Gaining Crypto Market Share During Downturn - Bloomberg",
        "content": "Ether is ceding ground to market bellwether Bitcoin with investors seeking refuge in the most widely-held digital asset while the recent downturn in crypto prices deepens.\n\nThe second-largest digital currency by market value has slumped around 18% since June, while Bitcoin was down around half that amount during the same period. Ether dropped as much as 5.4% to $1,639 on Monday, and the original cryptocurrency slipped as much as 2.3% to $27,290."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWJldHRlci1kaWdpdGFsLWdvbGQtbWF0cml4cG9ydC0wOTQ5MTI0ODguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Is Better Than Digital Gold: Matrixport - Yahoo Finance",
        "content": "The connection between gold and bitcoin (BTC) as stores of value is obvious, and the demand for BTC as a digital store of value was a big reason why the cryptocurrency grew in popularity, crypto services provider Matrixport said in a report Monday.\n\nBitcoin’s market capitalization is $540 billion, equivalent to 10.8% of the market cap of physical financial gold, Matrixport said, adding that gold exchange-traded-funds (ETFs) are valued at $200 billion.\n\nThis is why potential approval by the Securities and Exchange Commission (SEC) of a U.S.-listed spot bitcoin ETF could result in inflows of $20 - $30 billion, potentially triggering a large rally in the cryptocurrency, the report said.\n\nThe SEC has dragged its heels on approving a spot bitcoin ETF, and in August said it was delaying its decision on all new applications until October. The crypto market is hopeful that such an approval will trigger a flood of mainstream money into the sector.\n\nStill, bitcoin has an edge over gold as the private keys can be memorized, which eliminates the risk of confiscation, the report said.\n\n“Even today, storing assets in the form of gold has not only become unfashionable in the digital age, but comes with significant restrictions when crossing borders,” wrote Markus Thielen, head of research at Matrixport, adding that “bitcoin offers a solution to this dilemma, enabling the swift and relatively inconspicuous movement of value across borders.”\n\n“Therefore, considering the current state of technological developments, bitcoin’s primary roles are likely as a store of value akin to gold and a speculative financial asset,” the report added.\n\nRead more: Bitcoin Price May Boom in October, Could Hit $37K by Year-End: Matrixport"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvam9lLXJvZ2FuLXRlbGxzLXNhbS1hbHRtYW4tdGhhdC1iaXRjb2luLWNhbi1iZWNvbWUtYS11bml2ZXJzYWwtdmlhYmxlLWN1cnJlbmN5LWFkbWl0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Joe Rogan Tells Sam Altman That Bitcoin Can Become A 'Universal Viable Currency' — Admits CBDCs 'Scares The Sh ... - Nasdaq",
        "content": "Podcaster Joe Rogan expressed his optimism for Bitcoin (CRYPTO: BTC), highlighting its potential to become a “universal viable currency.”\n\nWhat Happened: In an episode of The Joe Rogan Experience podcast on Friday, Rogan said that Bitcoin’s limited supply and decentralized mining process make it an intriguing candidate for broader adoption.\n\nHe said, “The real fascinating crypto is Bitcoin. To me, that’s the one that I think has the most likely possibility of becoming a universal viable currency. It’s limited in the amount that there can be [and] people mine it with their own [computer]. That to me is very fascinating. I love the fact that it’s been implemented.”\n\nRogan invited Sam Altman, co-founder of OpenAI who also expressed his excitement about Bitcoin, stating, “I think this idea that we have a global currency that is outside of the control of any government is a super logical and important step on the tech tree.”\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nSee More: A Stay At The Floating Palace From James Bond's ‘Octopussy\n\nWhy It Matters: Altman, who also serves as founder of Worldcoin, said the shift to a \"technologically enabled world,\" including Bitcoin, could help reduce corruption.\n\nBoth Altman and Rogan expressed concerns about central bank digital currencies (CBDCs), fearing that they could lead to increased government surveillance and control over individuals’ spending habits.\n\nRogan emphasized his worries regarding CBDCs being tied to a social credit score, stating, “That scares the shit out of me. The push to that is not for the overall good of society, that’s for control.”\n\nEarlier in August, musician Post Malone joined Rogan to discuss the potential risks associated with CBDCs. Malone asked Rogan about his views on the government’s digital currency. Rogan strongly opposed CBDCs, stating, \"No f**ing way. That's what I think. That's checkmate. That's game over.\" Malone agreed, adding, \"That is f**ing checkmate.\"\n\nIn addition, Altman expressed disappointment with the U.S. government’s handling of the cryptocurrency industry, calling it a “war on crypto.” Altman believes that maintaining the freedom and independence of cryptocurrencies is crucial, stating, “We can't give this up, like we're going to control this and all that. That’s the thing that makes me quite sad about the country.”\n\nPhoto by AlyoshinE on Shutterstock\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1pbnNjcmlwdGlvbnMtc3VycGFzcy1uZnQtbWludGluZy1vbi1ldGhlcmV1bS1zb2xhbmEtcG9seWdvbi1kZXNwaXRlLWJlYXItbWFya2V00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Inscriptions Surpass NFT Minting On Ethereum, Solana, Polygon Despite Bear Market - Nasdaq",
        "content": "Bitcoin inscriptions, a new way to store data on the Bitcoin (CRYPTO: BTC) blockchain, have surpassed 35 million since their inception in January.\n\nOrdinals are digital artifacts that can be inscribed onto Bitcoin using the Ordinals protocol.\n\nThey can be anything from text files, images, and audio to videos, and can be used to store a wide variety of data on the Bitcoin blockchain.\n\nAccording to a report by Galaxy Digital, text files represent the vast majority of Bitcoin inscriptions, accounting for approximately 95% of all inscriptions.\n\nAlso Read: People Are Going To Start Cashing Out Bitcoin — Here's Why\n\nImage-based inscriptions account for approximately 3.5% of all inscriptions, with the remaining 1.5% consisting of other types of digital artifacts.\n\nOrdinals Activity Since March: In the first 200 days since the first inscription on Bitcoin, a total of 1.14 million image-based inscriptions have been created.\n\nThis surpasses the number of non-fungible tokens (NFTs) minted on other blockchains, such as Ethereum (CRYPTO: ETH), Solana (CRYPTO: SOL), and Polygon (CRYPTO: MATIC), since the debut of NFTs on these respective networks.\n\nHowever, it is important to note that Bitcoin's minting activity throughout the first 200 days is still much lower than the total minting activity for NFTs on other blockchains, illustrating how Ordinals still have a long way to go in terms of adoption relative to the broader NFT ecosystem.\n\nOrdinals Trading Volume: Despite the unfavorable market conditions for NFTs in 2023, Ordinals accomplished meaningful growth.\n\nBitcoin has accumulated the third-highest NFT trading volume by the network at $596.4 million.\n\nEven when excluding BRC-20s, which represent ~30% of all Ordinals volume ($187.5 million), Bitcoin remains the third most popular chain for digital collectible activity after Ethereum and Solana.\n\nOrdinals Marketplaces: The most dominant marketplaces by volume for Ordinals are now Magic Eden, Unisat, and OKX at 28%, 28%, and 38% respectively.\n\nImplications for the Future of Bitcoin: The growing popularity of Bitcoin inscriptions is a significant development for the Bitcoin ecosystem.\n\nIt suggests that Bitcoin is being used for more than just a store of value and a medium of exchange. It is also being used to store and share data, which could lead to new and innovative use cases for Bitcoin in the future.\n\nFor example, Bitcoin inscriptions could be used to create a decentralized social media platform or a decentralized storage platform. They could also be used to create new forms of digital art and collectibles.\n\nRead Next: Bitcoin To $20K, Ethereum To $1K? Prominent Venture Capitalist Predicts Market Bottom\n\nMeet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga's exclusive event - Future of Digital Assets. Tickets are flying- get yours!\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1kZWNvdXBsZXMtZnJvbS10cmFkaXRpb25hbC1lcXVpdGllczotYS1uZXctZXJhLWJlZ2luc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 09 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Decouples From Traditional Equities: A New Era Begins - Nasdaq",
        "content": "Bitcoin (CRYPTO: BTC) appears to have largely decoupled from traditional equities, as evidenced by its price trajectory no longer mirroring that of major indices such as the S&P 500.\n\nThis divergence is particularly noteworthy given the S&P 500's recent bounce off the 4200 points level, while Bitcoin had already reached the bottom of its current range, according to a Bitfinex report.\n\nThis phenomenon underscores the evolving dynamics between traditional financial markets and the cryptocurrency sector. Such developments and their implications for investors and traders will be a focal point of discussion at the upcoming Benzinga's Future of Digital Assets conference on Nov. 14.\n\nThe correlation between Bitcoin and the S&P 500 reached its zenith on Aug. 25, with a value of 0.8. Since then, the correlation has been on a decline, with Bitcoin exhibiting slower upward movement compared to equities and more pronounced downturns throughout September.\n\nCurrently, the correlation value stands at -0.5, indicating that the two are moving in opposite directions.\n\nSuch decorrelation is typically observed when there's a sudden bullish or bearish development in either asset class, or when one market prices in information more rapidly than the other.\n\nThe S&P 500, for instance, closed above the pivotal 4300 level on Oct. 6, marking its second-largest daily increase since June 15 this year.\n\nMeanwhile, the dominance of stablecoins in the crypto market has seen a slight dip, now accounting for 11-11.4% of the total crypto market cap.\n\nBitcoin's volatility has also made a significant entrance this October.\n\n\"As of now, the Implied volatility to Historical volatility ratio is 1.16, which, though a decrease from last week, still signifies that the market expects greater volatility. It's noteworthy that while the disparity between these metrics has narrowed, both measures have simultaneously risen on an absolute basis, indicating that expectations of future volatility are aligned with recent historical data but at a higher level than before,\" the Bitfinex analysts told Benzinga.\n\nAlso Read: Komainu Gets Approval For UK Crypto Register: Crypto Custody Goes Mainstream\n\nHistorical data shows a 24-hour volatility surge of over 340% on Oct. 2, with predictions suggesting that this trend will continue for the remainder of the month.\n\nSince October's onset, Bitcoin's volatility has surpassed its average for the past 200 days.\n\nHistorically, volatility in the U.S. stock market precedes similar trends in other risk assets, including Bitcoin.\n\nThe VIX, which measures the S&P 500's volatility, hit its lowest point in three and a half years on Sept. 15, 2023, but has since rebounded past the crucial 18 level.\n\nIn terms of Bitcoin holdings, short-term holders (STH) — those who've held BTC for less than 155 days — have offloaded approximately 1 million BTC since April 13, 2023.\n\nA significant portion of this, 200,000 BTC, was sold between Sep. 25 and 26.\n\nOn the broader economic front, the U.S. presents a mixed bag.\n\nWhile the housing market is under pressure with declining mortgage applications and pending home sales, the manufacturing sector is showing signs of recovery.\n\nThe Purchasing Managers manufacturing sub-index recently reported its first expansion in almost a year.\n\nHowever, the U.S. job market's foundation appears shaky, despite an uptick in job openings and employment growth.\n\nRead Next: Hacker Steals Then Returns Funds For Reward To Huobi's HTX: 'You Made The Right Choice'\n\nMeet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga's exclusive event: Future of Digital Assets. Tickets are flying: Get yours!\n\nPhoto: Shutterstock\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]