[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjEvMDEvMTIvdGVjaG5vbG9neS9iaXRjb2luLXBhc3N3b3Jkcy13YWxsZXRzLWZvcnR1bmVzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 25 Jun 2023 07:00:00 GMT",
        "title": "Lost Passwords Lock Millionaires Out of Their Bitcoin Fortunes (Published 2021) - The New York Times",
        "content": "Stefan Thomas, a German-born programmer living in San Francisco, has two guesses left to figure out a password that is worth, as of this week, about $220 million.\n\nThe password will let him unlock a small hard drive, known as an IronKey, which contains the private keys to a digital wallet that holds 7,002 Bitcoin. While the price of Bitcoin dropped sharply on Monday, it is still up more than 50 percent from just a month ago, when it passed its previous all-time high of around $20,000.\n\nThe problem is that Mr. Thomas years ago lost the paper where he wrote down the password for his IronKey, which gives users 10 guesses before it seizes up and encrypts its contents forever. He has since tried eight of his most commonly used password formulations — to no avail.\n\n“I would just lay in bed and think about it,” Mr. Thomas said. “Then I would go to the computer with some new strategy, and it wouldn’t work, and I would be desperate again.”"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjEvMDEvMjYvdGVjaG5vbG9neS9iaWctdGVjaC1wb3dlci1iaXRjb2luLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 25 Jun 2023 07:00:00 GMT",
        "title": "They Found a Way to Limit Big Tech's Power: Using the Design of Bitcoin (Published 2021) - The New York Times",
        "content": "SAN FRANCISCO — Jack Dorsey, Twitter’s chief executive, publicly wrestled this month with the question of whether his social media service had exercised too much power by cutting off Donald J. Trump’s account. Mr. Dorsey wondered aloud if the solution to that power imbalance was new technology inspired by the cryptocurrency Bitcoin.\n\nWhen YouTube and Facebook barred tens of thousands of Mr. Trump’s supporters and white supremacists this month, many flocked to alternative apps such as LBRY, Minds and Sessions. What those sites had in common was that they were also inspired by the design of Bitcoin.\n\nThe twin developments were part of a growing movement by technologists, investors and everyday users to replace some of the internet’s fundamental building blocks in ways that would be harder for tech giants like Facebook and Google to control.\n\nTo do so, they are increasingly focused on new technological ideas introduced by Bitcoin, which was built atop an online network designed, at the most basic level, to decentralize power."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zZWMtYXBwcm92ZXMtZmlyc3QtZXZlci1sZXZlcmFnZWQtMDIxNjIwODY3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 25 Jun 2023 07:00:00 GMT",
        "title": "SEC Approves First Ever Leveraged Bitcoin Futures ETF - Yahoo Finance",
        "content": "SEC Approves First Ever Leveraged Bitcoin Futures ETF\n\nThe BITX Fund Was Approved by the SEC\n\nThe US Securities and Exchange Commission (SEC) has approved the first leveraged Bitcoin futures exchange-traded fund (ETF), Volatility Shares 2X Bitcoin Strategy ETF (BITX). It is scheduled to launch on the Chicago Board Options BZX Exchange on 27 June, 2023.\n\nThe fund looks for investment returns that are equivalent to double the return of the CME Bitcoin Futures Daily Roll Index. Investors can purchase shares of an ETF, which bundles securities like equities and commodities, to receive exposure to those securities without actually owning them.\n\nThere are two main types of Bitcoin ETFs: Bitcoin futures and Bitcoin spot. BITX will be a leveraged ETF, using Bitcoin futures as leverage to amplify the returns of a benchmark index. The news was largely applauded by proponents of cryptocurrencies, but others wondered why a simple spot ETF launched before a 2X leveraged futures offering. The BITX fund was approved by the SEC as large traditional financial institutions look to enter the cryptocurrency market recently."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG8taGFzLWEtbmV3LXJlc2N1ZXItd2FsbC1zdHJlZXQtMTIzOTQ2NDE4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 25 Jun 2023 07:00:00 GMT",
        "title": "Crypto has a new rescuer: Wall Street - Yahoo Finance",
        "content": "Some of the biggest names in finance are making new bets on cryptocurrencies, adding competition and momentum to an upstart industry that is under increasing pressure from US regulators.\n\nThe world's largest money manager, BlackRock (BLK), wants to start a new exchange-traded fund that would use bitcoin as an underlying asset.\n\nTwo other sizable money managers, Fidelity Investments and Charles Schwab (SCHW), are backing a new cryptocurrency exchange with Citadel Securities.\n\nAnd one of the world's biggest lenders, Deutsche Bank, wants to operate a crypto custody business that would hold digital assets for its clients.\n\nThese endorsements from institutions that have a track record on Wall Street are helping to push the value of cryptocurrencies higher, especially bitcoin (BTC-USD).\n\nThe world’s largest cryptocurrency rose to its highest price in a year on Friday, to $31,389, after climbing above $30,000 for the first time since April. Through Friday bitcoin had risen 81% year to date.\n\nOther cryptocurrencies also surged this week, including ether (ETH-USD) and Avalanche's AVAX (AVAX-USD) token.\n\nThe total market capitalization for crypto assets reached $1.2 trillion on Friday, 14% higher than where it stood a week earlier.\n\nRising peril\n\nThis new interest from mainstream financial institutions comes at a time of rising peril for an industry that struggled to regain its footing following the 2022 implosion of cryptocurrency exchange FTX and the regulatory crackdown that followed.\n\nThe Securities and Exchange Commission earlier this month filed lawsuits against the biggest crypto exchanges in the US and the world, Coinbase (COIN) and Binance, alleging they both allowed digital currencies to trade on their platforms that should have been registered with the agency.\n\nThat stoked new concerns that it could become more difficult to trade certain digital assets. Since the beginning of 2023 the SEC has charged 15 different crypto actors with violating securities laws.\n\nStory continues\n\nA surprise turnaround in sentiment about the industry started June 15, when BlackRock, which controls more than $9 trillion in assets, filed paperwork with the SEC to create a spot bitcoin exchange-traded fund.\n\nSuch a fund would be tagged to the value of the original digital asset instead of merely tracking bitcoin futures. Coinbase would be the custodian for the bitcoin holdings.\n\n\"I think there's an element of — we need institutional custodians to step in and play roles and participate in digital token economies,\" BlackRock’s head of strategic partnerships Joseph Chalom said Thursday at the Coinbase State of Crypto Summit in partnership with the FT.\n\nThe value of bitcoin soared on the announcement. Other institutional players such as Invesco and Wisdom Tree Investments quickly followed by renewing spot bitcoin ETF applications they had previously submitted to regulators.\n\nThe efforts still face a significant hurdle. The SEC has denied 27 prior applications to create spot bitcoin ETFs since 2013, arguing the products are vulnerable to market manipulation.\n\nWisdom Tree, in fact, was turned away in 2021. One asset manager, Grayscale Investments, is suing the SEC because it wasn't allowed to convert its Grayscale Bitcoin Trust (GBTC) into a spot bitcoin offering.\n\n'Conflicts of interest'\n\nAnother catalyst for the industry came this week when a new cryptocurrency exchange that has backing from Citadel, Fidelity and Charles Schwab said it had begun executing trades.\n\nThe venture, EDX Markets, began discussing its plans in late 2022 and touting itself as an operation that would \"remove significant conflicts of interest that affect existing cryptocurrency exchanges.\"\n\nIt made the same point again last week, citing a \"non-custodial model designed to mitigate conflicts of interest.\" It won't handle digital assets owned by customers, instead running a marketplace where buyers and sellers deal with each other directly.\n\nAs part of FTX's collapse last year it was revealed that an affiliated trading firm used customer assets to make its own trades. The SEC has also alleged that Binance misused customer funds, a charge Binance denies.\n\nSecurities and Exchange Commission Chairman Gary Gensler. (AP Photo/Jacquelyn Martin, File) (ASSOCIATED PRESS)\n\nEarlier this month SEC Chair Gary Gensler said in a briefing with reporters that a standard business model for crypto exchanges is \"built on conflicts,\" \"limited disclosure” and “at times deception.\"\n\nJamil Nazarali, CEO of EDX, said in an interview that \"FTX just validated our business model.\" What EDC is doing, he added, is \"taking the best of the digital world, 24 by seven trading, many of the innovations of blockchain and combining it with the investor protections in traditional finance.\"\n\nEDX says it will offer trading in just four cryptocurrencies—bitcoin, ether, litecoin and bitcoin cash. None of those assets have been deemed securities by the SEC, allowing EDX to potentially sidestep some of the problems encountered by Coinbase and Binance.\n\nTogether those exchanges allow the trading of 19 digital currencies that the SEC has labeled as securities, meaning they need to be registered with the agency. In total the agency has designated 55 cryptocurrencies as securities in various lawsuits, according to data compiled by Cryptorank.io.\n\nCoinbase is fighting the suit and denies the SEC's claims. On Thursday its CEO Brian Armstrong did not sound worried while speaking at a crypto conference in New York.\n\nCoinbase CEO Brian Armstrong. (Photo by Steven Ferdman/Getty Images) (Steven Ferdman via Getty Images)\n\nInstead he said in the next five to seven years the Coinbase platform could turn into a \"superapp' like WeChat, which is used in Asia for everything from messaging to banking to ordering food.\n\n\"Despite some negative rhetoric, headlines, this industry is moving forward,\" he said.\n\nRoger Bayston, head of digital assets for Franklin Templeton, said the scrutiny from regulators is necessary.\n\n\"​​As much as it's been bumpy, regulatory clarity really is clearing the decks for the adoption of standards that will allow capital to flow,\" he told Yahoo Finance.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMjYvYml0Y29pbi1idGMtaXMtdXAtMTJwZXJjZW50LXRoaXMtbW9udGgtaW4tcGFydC1kdWUtdG8tdGhpbi1saXF1aWRpdHkuaHRtbNIBbWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA2LzI2L2JpdGNvaW4tYnRjLWlzLXVwLTEycGVyY2VudC10aGlzLW1vbnRoLWluLXBhcnQtZHVlLXRvLXRoaW4tbGlxdWlkaXR5Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 25 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin is up 12% this month — even though barely anybody is trading it - CNBC",
        "content": "In this article BTC.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nAndriy Onufriyenko | Moment | Getty Images\n\nBitcoin has rallied sharply this month — but not for reasons you might think. The world's largest digital currency has risen more than 12% since the beginning of June. On Wednesday, its price topped $30,000 to hit its highest level since April 14, according to Coin Metrics data. Market players have attributed the jump to the news that U.S. asset management giant BlackRock had filed for a spot bitcoin exchange-traded fund tracking the market price of the underlying asset. While that may be part of the reason, the outsized moved can be put down to another factor beyond the news flow surrounding large institutions taking steps to embrace bitcoin or other digital assets.\n\nThin liquidity and big players\n\nCrypto \"market depth\" has been sitting at very low levels this year. Market depth refers to a market's ability to absorb relatively large buy and sell orders. When market depth is low and big players put in orders to buy or sell digital coins, prices can move in a big way up or down, even if the orders are not that huge. Market depth is a measure of liquidity in a market. According to data firm Kaiko, bitcoin's market depth has fallen 20% since the start of this year. Bitcoin has been one of the hardest-hit cryptocurrencies in terms of market depth, Kaiko said.\n\nThe market depth of bitcoin at a 1% range from the mid price has fallen about 20% since the start of the year, according to data firm Kaiko. Kaiko\n\n\"Bitcoin's recent surge in value has largely been driven by large trades within a less liquid market,\" Jamie Sly, head of research at CCData, told CNBC via email. \"Our analysis of market orders over 5 BTC reveals an aggressive surge in market buying, suggesting large players are seeking to gain exposure to digital assets.\" \"When combining large orders with thin books, the market is subject to more volatile movements,\" Sly added. That lack of liquidity has in part been driven by the regulatory scrutiny of the crypto industry from U.S. authorities. The Securities and Exchange Commission has sued major exchanges such as Coinbase and Binance. Low liquidity, which has been a feature of the crypto market all year, is also partly behind bitcoin's 80% year-to-date rally.\n\nRetail traders aren't back — yet\n\nAnother notable feature of the current crypto market is the low volumes being traded on exchanges. Daily trading volume in the cryptocurrency currently sits at around $24 billion, according to crypto data website CoinGecko.\n\nThat's down markedly from the more than $100 billion of overall trading volume in bitcoin during the peak of the 2021 crypto rally, when bitcoin rose close to an all-time high of nearly $69,000. Large crypto investors usually hope that an early surge in prices will be enough to tempt retail investors back into participating in the rally which ultimately boosts prices for bitcoin and other digital coins. But that hasn't happened. \"What is notable about this rally is that trade volumes overall are at multi-year lows, and we are only seeing a slight increase, which even then is far lower than levels we saw from January to March,\" Clara Medalie, director of research at Kaiko, told CNBC. \"I think trading volumes and price volatility are two of the most telling indicators of crypto market activity. Both volatility and volumes are at multi-year lows, and even a rapid increase in price is not enough to draw traders in.\"\n\n'It's not a market for ordinary clients'\n\nIn the last bitcoin cycle, market momentum was largely driven by big, institutional names as investment banks from Morgan Stanley to Goldman Sachs set up trading desks to give their clients exposure to the digital currency. However, the market really started to break out only when retail traders started to take notice — in early 2021, people became tempted by the phenomenon that was NFTs, or nonfungible tokens, and other more speculative bets. Later that year, the cryptocurrency market experienced a seismic rally, with the price of bitcoin zooming to unprecedented levels. That was in tandem with surging trading volume, which climbed from $21.2 billion at the start of 2020 to $105.4 billion on Nov. 9, 2021, when bitcoin hits its all-time high, according to CoinGecko. Today, trading volume is nowhere near where it was at the height of the 2021 crypto boom. \"Any bit of news, if it's good, then the professional traders trade — otherwise, they're not trading,\" Carol Alexander, a professor of finance at the University of Sussex, told CNBC. \"If a bit of good news like the bitcoin ETF comes, they fire the cannons upwards.\" BlackRock's ETF filing was followed by similar move from Invesco and WisdomTree, which also filed for their own respective bitcoin-related products.\n\nwatch now\n\n\"Bitcoin and ether are both being manipulated in this way by the professional traders. They don't trade most of the time, they wait until there's a bit of good news,\" Alexander said. \"Then they'll sell the top and you've got a sideways market.\" Indeed, bitcoin has traded within a range this year, and attempts to burst significantly higher have been thwarted. Alexander thinks bitcoin is likely to trade within a range of between $25,000 and $30,000 for the remainder of the summer. She expects, however, that toward the end of the year, the cryptocurrency will climb toward $50,000, citing attempts from larger market players to prop up the market, with big purchases making outsized moves. \"It's not a market for ordinary clients. It's really is not,\" she warned.\n\nHas the market bottomed?\n\nVijay Ayyar, vice president of international markets at the Indian crypto exchange CoinDCX, told CNBC he suspects the latest run-up in bitcoin's price is being driven more by \"long term institutional buyers.\" Big funds and crypto-focused hedge funds are among the market participants driving the action, Ayyar added. \"I don't think this is as much of a retail push, since retail was quite flushed out during the recent pullback,\" he said. Several crypto industry insiders have expressed hopes that the market is nearing a \"bottoming\" period where it can start to rise again. The recent price action echoes activity in 2018, when both bitcoin's price and volumes were subdued for several months before beginning to rise again the following year. However, CCData's Sly said it is \"still too early to say whether the worst is over for bitcoin.\" \"The recent wave of interest from traditional financial institutions, like Blackrock, Citadel [Securities], and Fidelity instils a renewed optimism in the market,\" he said. \"Provided the wider macro environment and equity markets continue to be favorable, it is possible that bitcoin could maintain its current positive price trajectory.\" WATCH: Can ethereum topple bitcoin as the crypto king?\n\nwatch now"
    }
]