[
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1mYWxscy1iZWxvdy0yNTkwMC1ibmItc2hpYmEtaW51LXNoZWQtdXAtdG8tNS9hcnRpY2xlc2hvdy8xMDA5MzI5NjUuY21z0gGYAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWZhbGxzLWJlbG93LTI1OTAwLWJuYi1zaGliYS1pbnUtc2hlZC11cC10by01L2FtcF9hcnRpY2xlc2hvdy8xMDA5MzI5NjUuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $25,900; BNB, Shiba Inu shed up to 5% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading mixed on Monday ahead of key inflation data later in the day. Bitcoin, XRP, Cardano, and Polygon were trading with gains, while Ethereum, BNB, Solana, and Shiba Inu were trading with cuts.Bitcoin (BTC) rose 0.28% to $25,864, whereas Ethereum (ETH) was below the $1,750 level.\"The crypto market is yet to respond to the US Fed's decision to pause rate hikes. It is important to note that the US Fed has increased interest rates by 500 basis points since it started its war against inflation and prevented the economy from slipping into possible recession,\" Shivam Thakral, CEO of BuyUcoin, said.\"The crypto market may respond positively to the latest development related to rate hikes in the coming weeks but the real relief will come if interest rates are brought down to boost market liquidity,\" Thakral added.The global cryptocurrency market cap was trading lower around $1.05 trillion, falling 0.12% in the last 24 hours.\"Crypto markets observed brisk selling pressure over the weekend. The crypto fear and greed index has maintained its position in the neutral zone since yesterday with a score of 47 points. This could be attributed to the ongoing lawsuits by the SEC against Binance and Coinbase, which has led to a mass exodus of deposits in these exchanges,\" Parth Chaturvedi, Investments Lead, CoinSwitch Ventures said.The total volume in DeFi is currently 1.9 billion, 7% of the total crypto market 24-hour volume. The volume of all stablecoins is now $25.15 billion, which is 94% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $501 billion. BTC volume stood at approximately $11.55 billion, falling 24% in the last 24 hours. Bitcoin’s dominance is currently 47%, an increase of 0.21% over the day, according to CoinMarketCap.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point toward a Neutral sentiment. The Relative Strength Index (14), one of the key indicators, sits at 41, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) is at 18 and 26, respectively, further indicating a Neutral market.\"The MACD Level (12, 26) at -376 indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 27 with a Neutral indicator, while the Williams Percent Range (14) at −82 signals Neutral,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com, data as of 12.20 hours, IST on June 12, 2023)Bitcoin $25,864 0.28%Ethereum $1,741 -0.92%Tether $1.00 -0.03%BNB $225 -5.18%XRP $0.514 1.32%Cardano $0.2764 4.52% Dogecoin $0.6084 -2.02%Polygon $0.6328 4.18%Solana $15.19 -2.76%Litecoin $76.44 -1.45%Polkadot $4.5 0.70%Tron $0.06982 0.72%Avalanche $11.43 -1.80%Shiba Inu $0.000006584 -3.58%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMTIvY29pbmJhc2Utc3VlZC1ieS1zZWMtb3Zlci1hbGxlZ2VkLXVucmVnaXN0ZXJlZC1zZWN1cml0aWVzLmh0bWzSAWJodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNi8xMi9jb2luYmFzZS1zdWVkLWJ5LXNlYy1vdmVyLWFsbGVnZWQtdW5yZWdpc3RlcmVkLXNlY3VyaXRpZXMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Jun 2023 07:00:00 GMT",
        "title": "Coinbase is the latest target of the SEC’s crypto crackdown—how U.S. investors may be affected - CNBC",
        "content": "The U.S. federal government is pursuing a case against one of the most popular cryptocurrency trading platforms. On June 6, the U.S. Securities and Exchange Commission sued Coinbase, the second-largest crypto exchange by volume, according to CoinMarketCap.com. The federal regulator alleges Coinbase operated its crypto asset trading platform as an unregistered national securities exchange and broker, per the June 6 press release. The SEC also alleges at least 13 crypto assets that Coinbase made available to customers, including Solana and Cardano's tokens, qualify as \"crypto asset securities,\" according to the complaint. Coinbase's staking program, which the regulator describes as a way for crypto investors \"to earn financial returns through Coinbase's managerial efforts,\" counts as an investment contract and unregistered security, the SEC says. In a tweet following the SEC's announcement, Coinbase co-founder and CEO Brian Armstrong said, in part, \"Regarding the SEC complaint against us today, we're proud to represent the industry in court to finally get some clarity around crypto rules.\" \"The SEC's reliance on an enforcement-only approach in the absence of clear rules for the digital asset industry is hurting America's economic competitiveness and companies like Coinbase that have a demonstrated commitment to compliance,\" Coinbase's chief legal officer and general counsel Paul Grewal said in a statement to CNBC Make It. \"In the meantime, we'll continue to operate our business as usual.\" This comes just one day after the SEC sued Binance, the world's largest crypto exchange, and its billionaire founder, Changpeng Zhao. On June 5, the agency filed 13 charges against them both, which included allegations that Zhao and his exchange worked to \"secretly allow high-value U.S. customers\" to continue trading on its unregulated international exchange despite publicly claiming that U.S. customers were restricted from doing so, according to the June 5 press release. Zhao has dismissed the charges on Twitter.\n\nWhat the SEC's crackdown on crypto may mean for investors\n\n\"The harsh messaging coming from the agency and its Chair Gary Gensler is a sign the SEC may be doing exactly what many in the industry have believed: shut down crypto in the U.S.,\" Chen Arad, co-founder and chief experience officer of Solidus Labs, a company that provides tools to help crypto exchanges and institutions prevent market manipulation, tells CNBC Make It. The U.S. remains a core market for crypto firms. About 20% of Americans say they've invested in, traded or used cryptocurrency, per a January NBC News poll, and around 42% of Americans between the ages of 18 and 34 say they've dabbled in crypto trading. Still, platforms may prefer to avoid the potential regulatory risks involved in operating here and shift their focus to countries with clearer legal requirements, Arad says. Omid Malekan, an adjunct professor at Columbia Business School and author of \"Re-Architecting Trust: The Curse of History and the Crypto Cure for Money, Markets, and Platforms,\" agrees. Some crypto firms may choose limit which services they offer to U.S. customers due to the complicated regulatory framework, he tells CNBC Make It. \"That's bad for U.S. investors,\" he says. \"It means that they'll have less options and are probably going to have to pay higher fees.\" Malekan owns Coinbase stock and is a longtime Coinbase customer. There is a potential upside to the SEC's latest enforcement action against crypto exchanges. Now that the lawsuits have been filed, the platforms can respond to the allegations in an open court and the public will be able to listen in, Arad says. But don't expect crypto traders to make a mass exodus from various exchanges any time soon, Malekan says. \"The people who are going to stay away or leave already have,\" he says. \"Those who are still left and investing and using services like Coinbase are probably OK with the risks that are involved.\" Although the ongoing regulatory dynamic in the U.S. can have some effect on demand, the people who want to buy crypto will continue to find ways to do so, Arad says, and using established crypto exchanges that are regulated in the U.S. is still one of the best and safest ways.\n\nDoes the suit affect bitcoin specifically?\n\nBitcoin, one of the most well-known cryptocurrencies, wasn't named in the SEC's complaint. Bitcoin has been determined to be a commodity under the Commodity Exchange Act, which means, typically, the Commodity Futures Trading Commission regulates it, according to the agency's website. There's a general understanding within the industry that if you're just trading bitcoin, you're probably OK, Malekan says. Cryptocurrency prices briefly rose following the SEC's announcement. On June 6, bitcoin prices climbed to a little above $27,100, according to Coin Metrics. As of June 12 at 11:09am EST, bitcoin had fallen to around $25,800, per Coin Metrics.\n\nThe state of crypto platform regulation in the U.S.\n\nCurrently, one of the ways the SEC determines whether an asset is an investment contract and, therefore, a security, is through the \"Howey test.\" If an asset meets the following criteria, the agency considers it to be a security that may be subject to federal securities law: There is an investment of money; in a common enterprise; in which the investor expects a profit; and the profit is derived solely from the efforts of others. But crypto challenges a lot of these older regulatory precedents and may require a new framework, Malekan says. \"We don't regulate self-driving cars under the same rules that once applied to horse and buggies,\" he says. \"With new financial instruments, we should probably have new rules.\"\n\nTrading crypto on an exchange versus peer-to-peer"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMTIvY29pbmJhc2Utc3VlZC1ieS1zZWMtb3Zlci1hbGxlZ2VkLXVucmVnaXN0ZXJlZC1zZWN1cml0aWVzLmh0bWzSAWJodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNi8xMi9jb2luYmFzZS1zdWVkLWJ5LXNlYy1vdmVyLWFsbGVnZWQtdW5yZWdpc3RlcmVkLXNlY3VyaXRpZXMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Jun 2023 07:00:00 GMT",
        "title": "Coinbase is the latest target of the SEC’s crypto crackdown—how U.S. investors may be affected - CNBC",
        "content": "The U.S. federal government is pursuing a case against one of the most popular cryptocurrency trading platforms. On June 6, the U.S. Securities and Exchange Commission sued Coinbase, the second-largest crypto exchange by volume, according to CoinMarketCap.com. The federal regulator alleges Coinbase operated its crypto asset trading platform as an unregistered national securities exchange and broker, per the June 6 press release. The SEC also alleges at least 13 crypto assets that Coinbase made available to customers, including Solana and Cardano's tokens, qualify as \"crypto asset securities,\" according to the complaint. Coinbase's staking program, which the regulator describes as a way for crypto investors \"to earn financial returns through Coinbase's managerial efforts,\" counts as an investment contract and unregistered security, the SEC says. In a tweet following the SEC's announcement, Coinbase co-founder and CEO Brian Armstrong said, in part, \"Regarding the SEC complaint against us today, we're proud to represent the industry in court to finally get some clarity around crypto rules.\" \"The SEC's reliance on an enforcement-only approach in the absence of clear rules for the digital asset industry is hurting America's economic competitiveness and companies like Coinbase that have a demonstrated commitment to compliance,\" Coinbase's chief legal officer and general counsel Paul Grewal said in a statement to CNBC Make It. \"In the meantime, we'll continue to operate our business as usual.\" This comes just one day after the SEC sued Binance, the world's largest crypto exchange, and its billionaire founder, Changpeng Zhao. On June 5, the agency filed 13 charges against them both, which included allegations that Zhao and his exchange worked to \"secretly allow high-value U.S. customers\" to continue trading on its unregulated international exchange despite publicly claiming that U.S. customers were restricted from doing so, according to the June 5 press release. Zhao has dismissed the charges on Twitter.\n\nWhat the SEC's crackdown on crypto may mean for investors\n\n\"The harsh messaging coming from the agency and its Chair Gary Gensler is a sign the SEC may be doing exactly what many in the industry have believed: shut down crypto in the U.S.,\" Chen Arad, co-founder and chief experience officer of Solidus Labs, a company that provides tools to help crypto exchanges and institutions prevent market manipulation, tells CNBC Make It. The U.S. remains a core market for crypto firms. About 20% of Americans say they've invested in, traded or used cryptocurrency, per a January NBC News poll, and around 42% of Americans between the ages of 18 and 34 say they've dabbled in crypto trading. Still, platforms may prefer to avoid the potential regulatory risks involved in operating here and shift their focus to countries with clearer legal requirements, Arad says. Omid Malekan, an adjunct professor at Columbia Business School and author of \"Re-Architecting Trust: The Curse of History and the Crypto Cure for Money, Markets, and Platforms,\" agrees. Some crypto firms may choose limit which services they offer to U.S. customers due to the complicated regulatory framework, he tells CNBC Make It. \"That's bad for U.S. investors,\" he says. \"It means that they'll have less options and are probably going to have to pay higher fees.\" Malekan owns Coinbase stock and is a longtime Coinbase customer. There is a potential upside to the SEC's latest enforcement action against crypto exchanges. Now that the lawsuits have been filed, the platforms can respond to the allegations in an open court and the public will be able to listen in, Arad says. But don't expect crypto traders to make a mass exodus from various exchanges any time soon, Malekan says. \"The people who are going to stay away or leave already have,\" he says. \"Those who are still left and investing and using services like Coinbase are probably OK with the risks that are involved.\" Although the ongoing regulatory dynamic in the U.S. can have some effect on demand, the people who want to buy crypto will continue to find ways to do so, Arad says, and using established crypto exchanges that are regulated in the U.S. is still one of the best and safest ways.\n\nDoes the suit affect bitcoin specifically?\n\nBitcoin, one of the most well-known cryptocurrencies, wasn't named in the SEC's complaint. Bitcoin has been determined to be a commodity under the Commodity Exchange Act, which means, typically, the Commodity Futures Trading Commission regulates it, according to the agency's website. There's a general understanding within the industry that if you're just trading bitcoin, you're probably OK, Malekan says. Cryptocurrency prices briefly rose following the SEC's announcement. On June 6, bitcoin prices climbed to a little above $27,100, according to Coin Metrics. As of June 12 at 11:09am EST, bitcoin had fallen to around $25,800, per Coin Metrics.\n\nThe state of crypto platform regulation in the U.S.\n\nCurrently, one of the ways the SEC determines whether an asset is an investment contract and, therefore, a security, is through the \"Howey test.\" If an asset meets the following criteria, the agency considers it to be a security that may be subject to federal securities law: There is an investment of money; in a common enterprise; in which the investor expects a profit; and the profit is derived solely from the efforts of others. But crypto challenges a lot of these older regulatory precedents and may require a new framework, Malekan says. \"We don't regulate self-driving cars under the same rules that once applied to horse and buggies,\" he says. \"With new financial instruments, we should probably have new rules.\"\n\nTrading crypto on an exchange versus peer-to-peer"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW5mdHMtcmFpc2UtdW5pcXVlLWxlZ2FsLTA5MDEwMDQwNi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin NFTs raise unique legal issues. Here's what you need to know - Yahoo Finance",
        "content": "While non-fungible tokens (NFTs) originally gained popularity on smart-contract platforms such as Ethereum and Solana, creators can now mint and transfer digital artifacts on the Bitcoin blockchain. But even though outwardly all those NFTs seem similar, the differences in how these digital assets are minted raise different intellectual property law issues — in particular, regarding the patent eligibility of applications related to NFTs.\n\nInvestors as well as NFT creators and buyers alike should be aware of these differences, to make sure they are protected by IP laws as well as beware of limitations, to decrease the likelihood of a potential infringer being able to avoid liability.\n\nDifferences between Bitcoin and smart-contract NFTs\n\nBitcoin NFTs are created in a much different way than NFTs on other blockchains. For example, NFTs can be inscribed into the Bitcoin blockchain as Ordinals. To inscribe an Ordinal, a user sends a transaction to a Taproot address and includes an asset/digital artifact such as a text or an image in the witness data section of the transaction. The witness data section can store up to 4 MB of data, which is generally large enough for most images and other digital artifacts.\n\nBut Ordinals aren’t the only way to mint NFTs on the Bitcoin blockchain. Alternatively, users can mint NFTs using the STAMPS (Secure Tradeable Art Maintained Securely) protocol, which stores digital artifacts within the Unspent Transaction Output (UTXO) portion of the transaction. Proponents of the STAMPS protocol argue that because witness data can be pruned over time, Ordinals are not immutable.\n\nBy including an encoding of a digital artifact within the UTXO portion of the transaction, the digital artifact cannot be pruned from the Bitcoin blockchain. Also, instead of using the order in which a Satoshi was mined as a unique identifier for the digital artifact, the STAMPS protocol includes an asset identifier in the UTXO with the digital artifact. When the asset identifier is transferred to another user, the user takes ownership of the digital artifact.\n\nStory continues\n\nThe user also sends a Satoshi (1/100,000,000th of a Bitcoin) in the transaction, where each Satoshi is numbered in the order in which it was mined. For example, the first Satoshi ever mined is Ordinal number 1, the millionth Satoshi mined is ordinal number 1,000,000, and so on. The Satoshi (identified by its ordinal number) is then associated with the digital artifact so that the Ordinal number acts as a unique identifier on the Bitcoin blockchain for the digital artifact. Then when the user transfers the satoshi, the recipient becomes the owner of the digital artifact.\n\nBitcoin NFTs are also structured differently than other types of NFTs. For example, other types of NFTs are typically created with a unique token identifier and an associated set of properties, such as a name, a link to a digital image, etc. On the other hand, a user does not create a unique token identifier or a token at all when inscribing an Ordinal. Instead, the digital asset is inscribed with an existing Satoshi.\n\nArguably, the Satoshi does not have a unique token identifier, as it is originally mined as a fungible token which then takes on some non-fungible properties by being numbered in the order it was mined. Recently, developers have created a protocol using Ordinals for BRC-20 tokens, which is a reference to Ethereum’s ERC-20 tokens. These BRC-20 tokens are fungible tokens created and transferred using Ordinals, thereby adding further confusion when determining the fungibility of a Satoshi used to inscribe fungible tokens.\n\nAlso, the Satoshi does not have off-chain metadata like an NFT on other blockchains, which includes a set of properties of the NFT. Instead, the digital artifact is directly inscribed into the witness data section (or the UTXO section in the STAMPS protocol) of a transaction.\n\nLegal ramifications of NFT differences\n\nPatents that only describe NFTs as they exist on smart-contract platforms (e.g., having a unique identifier and a set of properties that describes the digital artifact that they represent) may be vulnerable to a design around by a potential infringer that alters their software so that digital artifacts are minted and transferred on the Bitcoin blockchain instead of on Ethereum, Solana, or another smart contract platform. If the patent claims some use of NFTs, the potential infringer may argue that their digital artifacts on the Bitcoin blockchain are not NFTs since they may not have a unique token identifier, may not be represented by a non-fungible token, and/or do not have off-chain metadata.\n\nAccordingly, it is important to consider including a description of Bitcoin NFTs as well as smart contract platform NFTs in the patent description. For example, NFTs can be defined to include any digital artifact stored on a blockchain or referenced by a blockchain (in the case where a smart-contract platform NFT includes a link to the digital artifact) regardless of whether it is associated with a token or a unique token identifier.\n\nAddressing these legal ramifications in the patent description may also have some benefits later on when the United States Patent and Trademark Office determines whether to grant the patent. For example, U.S. patent law requires that patents claim eligible subject matter. In some instances, patent claims — particularly when they involve software — may fall under a judicial exception to patent eligibility, which can be very difficult to overcome. However, a claim is patent-eligible if the claim, for example, improves a technical field. By describing Bitcoin NFTs and their technical advantages, the legal team for NFT creators may have the proper ammunition for overcoming these eligibility concerns.\n\nFor example, Bitcoin NFTs improve upon smart contract platform NFTs by including the digital artifacts directly on the blockchain rather than including a reference or pointer to the digital artifacts. Because the Bitcoin blockchain is immutable, the digital artifacts stored on the Bitcoin blockchain are likely to remain on the blockchain forever unchanged. Bitcoin NFT owners do not have to worry about a centralized entity taking down or altering the digital artifacts so that they no longer have proof of ownership of the original. This also reduces the opportunity for fraud by selling an NFT that the seller claims to reference a particular digital artifact in a centralized storage or decentralized file storage system but does not actually reference the particular digital artifact. Instead, users can verify an inscription or STAMP on the public blockchain.\n\nExtra work, new advantages\n\nThe advent of the Bitcoin NFT may create some extra work for NFT creators and their lawyers to ensure that potential infringers aren’t able to work around patents by launching their NFTs on the Bitcoin blockchain. However, with this extra work comes an increased likelihood of success at reaching allowance on patent applications that describe NFTs by being able to highlight the new technical advantages of Bitcoin NFTs.\n\nWhile NFT thieves may still have other ways to avoid liability for infringement, attorneys who specialize in blockchain intellectual property and patents should do their best to stay up-to-date with the latest in this rapidly developing and ever-evolving technology so that creators can enjoy the fullest protection under the law, no matter what the innovation.\n\nDISCLAIMER: The information contained in this article is for informational purposes only and is not legal advice or a substitute for obtaining legal advice from an attorney. Views expressed are those of the author and are not to be attributed to Marshall, Gerstein & Borun LLP or any of its former, present or future clients."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW5mdHMtcmFpc2UtdW5pcXVlLWxlZ2FsLTA5MDEwMDQwNi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 12 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin NFTs raise unique legal issues. Here's what you need to know - Yahoo Finance",
        "content": "While non-fungible tokens (NFTs) originally gained popularity on smart-contract platforms such as Ethereum and Solana, creators can now mint and transfer digital artifacts on the Bitcoin blockchain. But even though outwardly all those NFTs seem similar, the differences in how these digital assets are minted raise different intellectual property law issues — in particular, regarding the patent eligibility of applications related to NFTs.\n\nInvestors as well as NFT creators and buyers alike should be aware of these differences, to make sure they are protected by IP laws as well as beware of limitations, to decrease the likelihood of a potential infringer being able to avoid liability.\n\nDifferences between Bitcoin and smart-contract NFTs\n\nBitcoin NFTs are created in a much different way than NFTs on other blockchains. For example, NFTs can be inscribed into the Bitcoin blockchain as Ordinals. To inscribe an Ordinal, a user sends a transaction to a Taproot address and includes an asset/digital artifact such as a text or an image in the witness data section of the transaction. The witness data section can store up to 4 MB of data, which is generally large enough for most images and other digital artifacts.\n\nBut Ordinals aren’t the only way to mint NFTs on the Bitcoin blockchain. Alternatively, users can mint NFTs using the STAMPS (Secure Tradeable Art Maintained Securely) protocol, which stores digital artifacts within the Unspent Transaction Output (UTXO) portion of the transaction. Proponents of the STAMPS protocol argue that because witness data can be pruned over time, Ordinals are not immutable.\n\nBy including an encoding of a digital artifact within the UTXO portion of the transaction, the digital artifact cannot be pruned from the Bitcoin blockchain. Also, instead of using the order in which a Satoshi was mined as a unique identifier for the digital artifact, the STAMPS protocol includes an asset identifier in the UTXO with the digital artifact. When the asset identifier is transferred to another user, the user takes ownership of the digital artifact.\n\nStory continues\n\nThe user also sends a Satoshi (1/100,000,000th of a Bitcoin) in the transaction, where each Satoshi is numbered in the order in which it was mined. For example, the first Satoshi ever mined is Ordinal number 1, the millionth Satoshi mined is ordinal number 1,000,000, and so on. The Satoshi (identified by its ordinal number) is then associated with the digital artifact so that the Ordinal number acts as a unique identifier on the Bitcoin blockchain for the digital artifact. Then when the user transfers the satoshi, the recipient becomes the owner of the digital artifact.\n\nBitcoin NFTs are also structured differently than other types of NFTs. For example, other types of NFTs are typically created with a unique token identifier and an associated set of properties, such as a name, a link to a digital image, etc. On the other hand, a user does not create a unique token identifier or a token at all when inscribing an Ordinal. Instead, the digital asset is inscribed with an existing Satoshi.\n\nArguably, the Satoshi does not have a unique token identifier, as it is originally mined as a fungible token which then takes on some non-fungible properties by being numbered in the order it was mined. Recently, developers have created a protocol using Ordinals for BRC-20 tokens, which is a reference to Ethereum’s ERC-20 tokens. These BRC-20 tokens are fungible tokens created and transferred using Ordinals, thereby adding further confusion when determining the fungibility of a Satoshi used to inscribe fungible tokens.\n\nAlso, the Satoshi does not have off-chain metadata like an NFT on other blockchains, which includes a set of properties of the NFT. Instead, the digital artifact is directly inscribed into the witness data section (or the UTXO section in the STAMPS protocol) of a transaction.\n\nLegal ramifications of NFT differences\n\nPatents that only describe NFTs as they exist on smart-contract platforms (e.g., having a unique identifier and a set of properties that describes the digital artifact that they represent) may be vulnerable to a design around by a potential infringer that alters their software so that digital artifacts are minted and transferred on the Bitcoin blockchain instead of on Ethereum, Solana, or another smart contract platform. If the patent claims some use of NFTs, the potential infringer may argue that their digital artifacts on the Bitcoin blockchain are not NFTs since they may not have a unique token identifier, may not be represented by a non-fungible token, and/or do not have off-chain metadata.\n\nAccordingly, it is important to consider including a description of Bitcoin NFTs as well as smart contract platform NFTs in the patent description. For example, NFTs can be defined to include any digital artifact stored on a blockchain or referenced by a blockchain (in the case where a smart-contract platform NFT includes a link to the digital artifact) regardless of whether it is associated with a token or a unique token identifier.\n\nAddressing these legal ramifications in the patent description may also have some benefits later on when the United States Patent and Trademark Office determines whether to grant the patent. For example, U.S. patent law requires that patents claim eligible subject matter. In some instances, patent claims — particularly when they involve software — may fall under a judicial exception to patent eligibility, which can be very difficult to overcome. However, a claim is patent-eligible if the claim, for example, improves a technical field. By describing Bitcoin NFTs and their technical advantages, the legal team for NFT creators may have the proper ammunition for overcoming these eligibility concerns.\n\nFor example, Bitcoin NFTs improve upon smart contract platform NFTs by including the digital artifacts directly on the blockchain rather than including a reference or pointer to the digital artifacts. Because the Bitcoin blockchain is immutable, the digital artifacts stored on the Bitcoin blockchain are likely to remain on the blockchain forever unchanged. Bitcoin NFT owners do not have to worry about a centralized entity taking down or altering the digital artifacts so that they no longer have proof of ownership of the original. This also reduces the opportunity for fraud by selling an NFT that the seller claims to reference a particular digital artifact in a centralized storage or decentralized file storage system but does not actually reference the particular digital artifact. Instead, users can verify an inscription or STAMP on the public blockchain.\n\nExtra work, new advantages\n\nThe advent of the Bitcoin NFT may create some extra work for NFT creators and their lawyers to ensure that potential infringers aren’t able to work around patents by launching their NFTs on the Bitcoin blockchain. However, with this extra work comes an increased likelihood of success at reaching allowance on patent applications that describe NFTs by being able to highlight the new technical advantages of Bitcoin NFTs.\n\nWhile NFT thieves may still have other ways to avoid liability for infringement, attorneys who specialize in blockchain intellectual property and patents should do their best to stay up-to-date with the latest in this rapidly developing and ever-evolving technology so that creators can enjoy the fullest protection under the law, no matter what the innovation.\n\nDISCLAIMER: The information contained in this article is for informational purposes only and is not legal advice or a substitute for obtaining legal advice from an attorney. Views expressed are those of the author and are not to be attributed to Marshall, Gerstein & Borun LLP or any of its former, present or future clients."
    }
]