[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTAzL2JpdGNvaW4tc2xpZGVzLXdpdGgtd2lkZXItY3J5cHRvLW1hcmtldHMtYW1pZC1zaWx2ZXJnYXRlLWZhbGxvdXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin Price (BTC) Slides With Wider Crypto Markets Amid Silvergate Fallout - Bloomberg",
        "content": "Bitcoin dropped to the lowest level in about two weeks, part of a wider retreat in crypto markets as investors digested the unraveling of a key industry payments network.\n\nThe largest token by market value sank as much as 6% before paring some of the slide to trade 4.9% lower at $22,323 as of 1:44 p.m. Friday in New York. Smaller coins such as Ether , Avalanche and the meme token Dogecoin also suffered declines."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMy1tYXJjaC0yMDIzL2FydGljbGVzaG93Lzk4Mzg1NTY4LmNtc9IBvQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMy1tYXJjaC0yMDIzL2FtcF9hcnRpY2xlc2hvdy85ODM4NTU2OC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Mar 2023 08:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin falls below $22,500; Litecoin, Dogecoin tumble up to 8% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency markets were trading in the red on Friday, with a decline of 4% in the global crypto market cap. Bitcoin (BTC) fell 4.5% to $22,386, whereas Ethereum (ETH) was below the $1,600 level. BTC volume in the last 24 hours stood at approximately $26.01 billion, rising 12.56% in the last 24 hours.\"In the past 24 hours, Bitcoin, Ethereum, and other cryptocurrencies dropped in value due to the release of US manufacturing data and uncertainties concerning access to banking services for crypto companies in the US. Furthermore, the fallout of Silvergate has also played a role in the decline. Bitcoin is at its lowest point in about two weeks and is trading below $23,000 at $22,300,\" Edul Patel, Co-founder and CEO at Mudrex, said.Other top tokens were also trading lower on Friday. Litecoin declined by 8%. Dogecoin , Solana, Cardano, and BNB were also trading with cuts. The global cryptocurrency m-cap was trading lower around $1.03 trillion, falling 4.01% in the last 24 hours.The total volume in DeFi is currently 5.39 billion, 9.78% of the total crypto market 24-hour volume. The volume of all stablecoins is now $50.24 billion, which is 91.11% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $432.63 billion. Bitcoin’s dominance is currently 42.09%, a decrease of 0.23% over the day, according to CoinMarketCap.\"Big crypto-specific development to watch out for is the unfolding of events at Silvergate, as the crypto-friendly bank failed to file its annual report to the SEC, and its stock has come under heavy selling pressure. Markets are watching with bated breath to see if there's another domino left to fall post the FTX fiasco,\" Parth Chaturvedi, Crypto Ecosystem Lead at CoinSwitch, said.Rajagopal Menon, Vice President at WazirX, said, \"Major market indicators point to a neutral sentiment. The Relative Strength Index (14) sits at 42.82, with a neutral outlook. The Stochastic %K (14, 3, 3) indicates a Neutral outlook at 24.38 and the Average Directional Index (14) at 27.69 indicates Sell.\"\"The MACD Level (12, 26), at 159.87, indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 14.28 with a Neutral indicator, while the Williams Percent Range (14) at −89.48 also signals Neutral,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.03 hours, IST on March 03, 2023)Bitcoin $22,386 -4.51%Ethereum $1,570 -4.57%Tether $1 -0.01%BNB $291.82 -2.46%XRP $0.3691 -2.74%Dogecoin $0.07571 -6.41%Cardano $0.337 -5.34%Polygon $1.17 -4.10%Polkadot $6.06 -5.23%Tron $0.06687 -3.81%Litecoin $89.21 -8.21%Shiba Inu $0.00001142 -4.52%Solana $21.08 -4.08%"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDMvMDMvYml0Y29pbi1ldGhlci1zbGlkZS1vbi1mcmlkYXktYXMtaW52ZXN0b3JzLXdlaWdoLXBvdGVudGlhbC1mYWxsb3V0LWZyb20tc2lsdmVyZ2F0ZS13b2VzLmh0bWzSAYABaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDMvMDMvYml0Y29pbi1ldGhlci1zbGlkZS1vbi1mcmlkYXktYXMtaW52ZXN0b3JzLXdlaWdoLXBvdGVudGlhbC1mYWxsb3V0LWZyb20tc2lsdmVyZ2F0ZS13b2VzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin, ether slide on Friday as investors weigh potential fallout from Silvergate woes - CNBC",
        "content": "A pedestrian walks past signage for Ethereum, top, and Bitcoin outside the Hong Kong Digital Asset Exchange Ltd. digital currency trading store in Hong Kong, China, on Thursday, June 24, 2021.\n\nThe drop came late Thursday night, hours after several crypto companies said they'd stopped accepting or initiating payments to or from Silvergate – including Coinbase, Galaxy Digital, Circle, Paxos and Bitstamp. Silvergate, which has become the go-to bank for cryptocurrency businesses, gave notice Wednesday that it won't meet an extended deadline to file its annual report and warned it may not be able to operate another 12 months.\n\nBitcoin dipped by more than 5% to $22,261.22, according to Coin Metrics. Ether lost 5.5% and traded at $1,555.37.\n\nCryptocurrency prices fell on Friday as investors weighed the latest financial woes at Silvergate Capital and assessed what a potential bankruptcy at the crypto bank could mean for the broader crypto industry.\n\n\"To start 2023, crypto markets enjoyed a solid rally to six-month highs following a slowdown in FTX-related contagion, but the Silvergate news has renewed concerns around liquidity and risk,\" Medalie added.\n\n\"The bearish turn could certainly be a delayed reaction to Silvergate's ongoing issues,\" said Clara Medalie director of research at Kaiko. \"Many large exchanges and market makers partner with Silvergate for fast transactions between entities, and any halt inactivity could have an impact on global crypto liquidity.\"\n\nBitcoin has recovered this year after tumbling more than 60% in 2022 to below $17,000 amid the pullback in risk assets and the implosion of FTX, which was a Silvergate customer. Even after the recent decline, bitcoin is up more than 30% this year — though it could be in for a month of sideways trading now that the broader rally in risk assets has faded.\n\nCrypto market resilience\n\nAnalysts said the Silvergate woes weren't an obvious trigger for the drop in bitcoin and ether. They also pointed to liquidations, macro factors and technical indicators.\n\n\"Overnight, bitcoin dropped below $23,000, hitting its lowest level in two weeks. In the process, traders were hit by millions of long liquidations,\" Medalie said.\n\nYuya Hasegawa, an analyst at Japanese crypto firm Bitbank, said that drop happened \"without a clear trigger.\" Noelle Acheson, economist and author of the \"Crypto is Macro Now\" newsletter, echoed the point about liquidations.\n\n\"The fact that it was a short and sharp dump, and that bitcoin and ether prices are now bouncing along steadily, suggests that the move was largely structural, and that the market still has considerable resilience,\" she said.\n\nThat resilience was a big takeaway for investors from the February trading month, in which bitcoin and ether suffered a brief drop of 6% and 8.5%, respectively, as U.S. financial regulators began their crypto crackdown. Bitcoin went on to finish the month les than 1% above the flatline, while ether eked out a roughly 2% gain.\n\nGiven the bad news and the ongoing recovery from the FTX debacle in November, investors saw that as a win even though the crypto assets failed to match their double digit January returns.\n\n\"The Silvergate news is really bad, but should not directly affect bitcoin holdings,\" Acheson added. \"It could spook some macro investors, however, who could withdraw and wait for this to blow over.\"\n\nJoel Kruger, market strategist at LMAX Group, pointed to bitcoin's recent inability to \"establish above critical technical resistance in the form of the August 2022 high around $25,200\" and \"global inflation data that continues to suggest central banks, particularly the Fed, will need to keep with a less investor-friendly monetary policy track of higher for longer\" – in addition to the Silvergate scare.\n\nIf bitcoin fails to hold the $22,000 level, the next stop will likely be around $21,400, where the February low and November high converge, according to Hasegawa."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy91ay1jcnlwdG8tY3JhY2tkb3duLWJyaXRpc2gtYmFua3MtMTg1MzM5NDY2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Mar 2023 08:00:00 GMT",
        "title": "UK Crypto Crackdown: Which British Banks Allow You to Buy Bitcoin? - Yahoo Finance",
        "content": "UK banks are getting tougher on customers using crypto. In the past week, two of the country’s biggest banks—Nationwide and HSBC—cracked down by applying daily limits for buyers or restricting credit cards from making crypto purchases.\n\nThese two banks aren’t the only ones: a number of banks over the past year have got tougher. Some took a tougher stance following the collapse of mega digital asset exchange FTX back in November.\n\nAccording to most U.K. high-street banks with limits, the crackdown is to protect investors from cryptocurrency fraud. “We want to do everything we can to protect our customers and we feel that limiting payments to cryptocurrency exchanges is the best way to make sure your money stays safe,” Santander says.\n\nSo what are the current rules? Here is the low-down on which banks are crypto-friendly for the retail investor.\n\nNationwide\n\nBeen offered a cryptocurrency investment opportunity? If someone offers you a low risk, high reward crypto investment, be cautious. This could be a scam. Many cryptocurrency investments aren’t regulated, so you’re unlikely to get your money back if something goes wrong. pic.twitter.com/bgb3PLbAHT — Nationwide Building Society (@AskNationwide) October 15, 2021\n\nMajor high-street bank Nationwide this week said it was setting up new restrictions to “help protect you and to try and keep your money safe.” Customers can no longer buy crypto with credit cards and with debit cards, and there are daily limits of £5,000 ($5,965).\n\nHSBC\n\nHSBC this week also imposed tougher rules. Now, customers cannot buy any digital assets from exchanges using credit cards. Those who bank with HSBC can buy crypto with a debit card through certain U.K.-regulated platforms—but not exchanges like Coinbase.\n\nThe banking giant has said it has no interest in Bitcoin and has banned customers from buying stocks of companies with Bitcoin exposure.\n\nStory continues\n\nLloyds\n\nLloyds allows its clients to buy crypto via U.K.-regulated platforms and make withdrawals from exchanges such as Coinbase—but only using debit cards.\n\nIt was one of the first banks in the U.K. to stop its clients from buying crypto with credit cards back in 2018.\n\nNatWest\n\nNatWest Group CEO Alison Rose last month said that the bank had “taken a pretty hard line as a bank on crypto.”\n\nAnd in 2021, the bank barred corporate customers who deal in cryptocurrencies. That means companies like crypto exchanges with a base in the U.K. cannot hold accounts at NatWest.\n\nThe FCA Has 5 Entirely Reasonable Concerns About Cryptocurrency\n\nBut right now, according to the bank, that “doesn't mean that we block cryptocurrency payments altogether but we will restrict payments to cryptocurrency exchanges that present the highest risk of financial harm.”\n\nYou can use a NatWest account to buy digital assets from exchanges such as Coinbase. Amounts are limited, according to the bank, though NatWest has not revealed exactly by how much.\n\nBarclays\n\nBarclays bank does not allow customers to buy or sell crypto through its online banking platform. Would-be investors can buy crypto via a regulated, FCA-approved broker, though.\n\nBarclays was one of the U.K. banks that stopped customers making payments to crypto exchange Binance in 2021 after the British regulatory body FCA issued a warning over exchange.\n\nSantander\n\nHigh-street bank Santander announced last year that it would be limiting U.K. customers from making large crypto transactions. As it stands, those who bank with Santander can make single transactions of £1,000, with a total limit of £3,000 in any rolling 30-day period.\n\nA crypto trader who banks with Santander told Decrypt that his account was closed without warning after making withdrawals from Coinbase.\n\nWise\n\nFormerly known as TransferWise, Wise does not deal in cryptocurrencies at all. And you can’t use an account to buy digital assets from an exchange. But Wise customers can receive money to their account from a platform that deals with crypto if it is regulated in the EU or UK.\n\nMonzo\n\nYou can buy cryptocurrency on big, established exchanges such as Coinbase (but not Binance) with popular challenger bank Monzo, but it “may block a small number of transactions based on risk.” The bank does not say how big or small these transactions are.\n\nStarling\n\nChallenger bank Starling is one of the strictest: it has banned customers from all crypto-related payments. “We consider crypto activity to be high risk,” the bank said in November. Starling clients told Decrypt that the move was sudden.\n\nHi there 👋 We always review our position in relation to financial crime. We consider crypto activity to be high risk. We’ve taken the decision to prevent all card payments to crypto merchants and to implement further restrictions on outgoing and incoming transfers. — Starling Bank (@StarlingBank) November 22, 2022\n\nRevolut\n\nThis challenger bank is the most crypto-friendly of them all: users can buy, sell, and store a number of digital assets via the mobile banking app. And just last month, the bank launched a staking service for Ethereum, Cardano, Polkadot, and Tezos."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93ZWVrbHktbWFya2V0LXdyYXAtYnVsbHMtZmlnaHQtMTQwNTQxMjAwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Mar 2023 08:00:00 GMT",
        "title": "Weekly Market Wrap: Bulls fight to keep Bitcoin above US$22,300, as industry experts predict 'crab walk' - Yahoo Finance",
        "content": "Bitcoin, the world’s largest cryptocurrency by market capitalization, fell 6.57% in the week from Feb. 24 to March 3, trading at US$22,362 at 8:30 p.m. on Friday in Hong Kong. Ether slid 5.06% in the same period to change hands at US$1,565.\n\n2McLg0Jp hKdSIirH3XdnMD3PvjzNR S2H6vLL9XEOjAdH2Doet7RAqKFa7MS557i2UWnnzAl2QePUnWs1aF95Z59V4rDYUbCkH8 wtQJzRnkcxCR9 amDHr0CG 5ZzYKL8ruHjMa7fvol2wP Umve4\n\n“Bitcoin tested the US$22,300 mark this week, the important level I highlighted during my previous analysis. This level holds strong support for both static and dynamic,” wrote Aziz Kenjaev, head of partnerships at decentralized crypto derivatives exchange GammaX, to Forkast.\n\n“See also the rebound of Bitcoin from US$22,030 backed by a dynamic support and a lower border of the parallel channel of Jan. 18,” wrote Kenjaev, referring to the chart below.\n\n2HpKMPlk3pnAJ\n\n“Buyers will try to keep BTC price above US$22,300 today and during weekends, however next week another giant red bar might fill in the Bitcoin chart,” added Kenjaev.\n\nColin Johnson, chief executive officer and co-founder of Freeport, a platform bringing fine art investment on-chain, expects Bitcoin’s crab walk to continue.\n\n“I wouldn’t expect a pumping BTC price in the near term – even with the upcoming Yuga Labs launch. As has been the trend, we can expect to see BTC continue its crab walk between US$22,000-24,000 until the uncertainty surrounding macro elements begins to clear,” wrote Johnson.\n\n“The markets are likely to feel just like March weather – uninviting and finicky. We appear to be squarely in the doldrums with very little on the horizon indicating a long-term recovery of the stock market. Crypto will follow suit, unless a significant change in the perception of crypto assets as hedges against inflation begins to take hold amongst large players, which remains a possibility,” added Johnson.\n\nJonas Betz, a Germany-based crypto analyst, told Forkast that Mt. Gox exchange’s upcoming bankruptcy repayments decision could contribute to Bitcoin’s crab walk.\n\n“Due to fears of a Bitcoin dump because of the Mt. Gox bankruptcy redemptions as well as a tense macroeconomic situation, I expect Bitcoin to continue its sideways trend in the coming week. Though pessimism among market participants is increasing, a break below US$20,000 is unlikely, as Bitcoin has shown only little reaction to bad news in recent weeks. I expect the bitcoin price to continue its sideways trend in the range between US$21,000-25,000,” wrote Betz.\n\nStory continues\n\nThe global crypto market cap stood at US$1.03 trillion on Friday at 8:30 p.m. in Hong Kong, falling 5.5% from US$1.09 trillion a week ago, according to CoinMarketCap data. Bitcoin’s US$431 billion market cap represented 42.1% of the market, while Ether’s US$191 billion accounted for 18.7%.\n\nOver 69% of Bitcoin supply was in profit on March 2, according to on-chain data provider CryptoQuant, up from 49% on Jan. 1. The higher this percentage, the more Bitcoin holders are in profit, increasing the probability of investors selling to take profit.\n\n4aGVzoM2PeWyrx0CZV4bkykgE hPns8vvPfobsSmNNtNhd82cLwMHb4M941 b2Oo9daXIzTWV\n\nInvestment management giant Morgan Stanley warned on Tuesday that the current stock market rally is a “bull trap,” and that “March is a high-risk month for the bear market to resume.”\n\nEvgeny Goncharov, director and blockchain advisor at crypto consulting firm BDC Consulting, said that an incoming bull trap might be possible.\n\n“The bull trap is real. Chinese money supply (US$1.7 million) in the last year influenced investing activities at the beginning of this year. It’s a new narrative impacting the crypto market too. But Chinese investors copy the behavior of western investors. That’s why we consider this factor reinforcement of the traditional markets’ trends and could be switched to different sides,” wrote Goncharov.\n\nBiggest gainers: MKR & SSV\n\nMakerDAO’s governance token was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap. The Mkr token rose 25.82% on the weekly chart, to trade at US$930.16 at 8:30 p.m. in Hong Kong. Maker is the largest crypto lending protocol in the decentralized finance space.\n\nThe token started picking up on March 1, following MakerDAO’s proposal to enable the use of its governance token as collateral for borrowing the DAI stablecoin.\n\nSSV.Network’s Ssv token was the second biggest gainer, rising 14.72% to change hands at US$44.37. SSV.Network is a project that builds distributed validator infrastructure and decentralized Ether staking products, which gained significant attention at the ETHDenver Hackathon.\n\nSee related article: Bitcoin Punks exceed 1,145 ETH in daily trading volume as Bitcoin Ordinals gain traction\n\nNext week?\n\n“Beware the ides of March. Bitcoin is likely to end the month around or possibly just below US$21,000. Below US$20,000 means a possible re-testing of the US$16,000-17,000 floor. Above US$25,000 is possible only on breakout macroeconomic news, or a significant sentiment shift against the US Dollar because of runaway inflation,” wrote Freeport’s Johnson.\n\n“Confidence reports on inflation, interest rates, the war in Ukraine, China, and possibly the outcome of the student debt relief decision in the Supreme court,” will be the main factors driving markets, according to Johnson. “Relief could drive the perception that young Americans will push their newly found ‘cash’ into the crypto ecosystem,” he added.\n\nGammaX’s Kenjaev warned of more potential volatility next week, due to the upcoming testimony of U.S. Federal Reserve Chair Jerome Powell.\n\n“Bitcoin’s price is also driven by the gains and losses of its major trading counterpart – the U.S. Dollar… We are expecting high volatility during the testament of Fed Chairman Jerome Powell Tuesday and Wednesday. And for the rest of the week we are expecting a slight roller coaster since the important data on job openings, NFP (nonfarm payroll report) and unemployment will be released,” wrote Kenjaev, adding that any developments regarding Paxos and Kraken will be significant.\n\n“I am expecting a retest of US$22,800-22,900 by Monday and another drop to US$21,450 next week. The key level to watch is US$22,300. If there is a daily close below this level, then US$21,450 is the next important support to watch. Although I still stand for a drop to US$19,000, this level to me would be a significant booster level for the next major uptrend,” wrote Kenjaev.\n\nAlex Reinhardt, the founder of PLC Ultima, a firm building crypto infrastructure for mass adoption, said that the crypto market is mainly driven by the U.S. economy and growing consumer prices.\n\n“So far, data on the state of the American economy and the growth of consumer prices in the U. S. have a more significant impact on the crypto market and the price of Bitcoin. The PCE index published last week turned out to be worse than expected, and this negative effect immediately affected the crypto market. The risks that the Fed will decide to raise the key rate by 50 basis points instead of 25, as previously expected, have grown after the publication of the household consumption index,” wrote Reinhardt, adding that “Bitcoin Ordinals definitely cannot compare with the expected effect of the FOMC press conference scheduled for March 22.”\n\nBetz the analyst expects more bearish momentum in March. “I can see Bitcoin ending March at US$22,000. The reason for my bearish price target is that inflation has picked up and it is likely that the Fed funds rate will be increased after the FOMC meeting on March 21-22. An important price level to watch is the psychological levels of US$20,000 and US$25,000. A breach of either of these levels will lead to a major price move,” wrote Betz.\n\nSee related article: Industry reacts: US cracks down on crypto, India calls for regulatory collaboration"
    }
]