[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzE5L2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1zbGlwcy10by0yNjNrLWFzLWludmVzdG9ycy13ZWlnaC1wb3RlbnRpYWwtaW50ZXJlc3QtcmF0ZS1kZWNpc2lvbnMv0gGMAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMTkvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLXNsaXBzLXRvLTI2M2stYXMtaW52ZXN0b3JzLXdlaWdoLXBvdGVudGlhbC1pbnRlcmVzdC1yYXRlLWRlY2lzaW9ucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Jun 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Slips Back to $26.3K in Weekend Trading as Investors Weigh Potential Interest Rate Decisions - CoinDesk",
        "content": "Binance's French unit is under investigation for the \"illegal\" provision of digital asset services and \"acts of aggravated money laundering.\" BlackRock (BLK) iShares had filed paperwork with the U.S. Securities and Exchange Commission (SEC) for the formation of a spot bitcoin (BTC) ETF. Anthony Georgiades, Innovating Capital General Partner, weighed in on market reaction. Plus, Cboe Digital President John Palmer joined to discuss gaining CFTC approval to launch margin futures on bitcoin and ether. Generative artist Dmitri Cherniak's Ringers #879 non-fungible token (NFT) sold at auction for a full price of $6.2 million. Sotheby’s Head of Digital Art and NFTs Michael Bouhanna joined the conversation."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vZGVjcnlwdC5jby8xNDUxNzIvOTVrLWNyeXB0b3B1bmstbmZ0LWJ1cm5lZC1ieS1iaXRjb2luLWJhbmRpdHMtcmV2aXZlZC1hcy1vcmRpbmFscy1pbnNjcmlwdGlvbtIBbGh0dHBzOi8vZGVjcnlwdC5jby8xNDUxNzIvOTVrLWNyeXB0b3B1bmstbmZ0LWJ1cm5lZC1ieS1iaXRjb2luLWJhbmRpdHMtcmV2aXZlZC1hcy1vcmRpbmFscy1pbnNjcmlwdGlvbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Jun 2023 07:00:00 GMT",
        "title": "$95K CryptoPunk NFT Burned by Bitcoin Bandits, Revived as Ordinals Inscription - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA pricy Ethereum NFT from one of Web3’s preeminent PFP collections has been permanently removed from circulation and symbolically tied to an Ordinals inscription, as a group of Bitcoiners celebrate the costly, eye-catching endeavor.\n\nCryptoPunk #8611 sold for around 55 Ethereum or $95,000 on Saturday, according to Etherescan. And hours later, the NFT was burned in a way that points to inscription 12,456,749, an NFT-like asset on Bitcoin that bears the same image as its predecessor.\n\nThe decision to effectively destroy CryptoPunk #8611 was a community-led effort conducted by Wolf Capital Developer Nathan Stein on Twitter and holders of Bitcoin Bandits, a Western-themed collection of Ordinals inscriptions, a spokesperson for the project told Decrypt.\n\nAD\n\nAD\n\n“The community rallied behind the idea like crazy,” the Bitcoin Bandits spokesperson said, adding that around 150 people contributed to the cause.\n\nWhen a digital asset is burned, it’s locked up for eternity in a digital wallet that nobody controls, and CryptoPunk #8611 has been put to rest in a well-known burn address that also contains $21 million worth of Ethereum.\n\n“What a wild night,” an account named Minh on Twitter told Decrypt, who also posted a video documenting the purchase and burning of CryptoPunk #8611. He described the move as “chaotic, yet beautiful.”\n\nOrdinals, a buzzy Bitcoin protocol that launched earlier this year, is used to create NFT-like assets on Bitcoin by “inscribing” data to individual satoshi, the smallest denomination of currency a Bitcoin can be broken down into. That data can include pictures, videos, or even plain text, which people have used to create BRC-20 tokens.\n\nAD\n\nAD\n\nWhile NFTs could be considered a nascent industry or an emerging frontier for digital art, Ordinals inscriptions are much more new, leading to a wave of hype, bugs, and scams surrounding crypto’s oldest coin.\n\nAs the community surrounding Ordinals continues to take shape, siphoning off pricy NFTs from the Ethereum space and pointing them in the direction of other assets on Bitcoin is becoming a more common move, referred to as teleburning.\n\nSo, if Saturday’s CryptoPunk burn sounds somewhat familiar, that’s because it’s not the first time a pricy NFT has been burned by someone looking to symbolically shift an asset’s underlying chain from Ethereum to Bitcoin.\n\nIn February, an NFT from the Bored Ape Yacht Club collection worth around $169,000 at the time was burned by Jason Williams, who told Decrypt not long after that, essentially, “throwing a Lamborghini into a trash compactor” is kind of fun.\n\nNotably, Yuga Labs, creators of the Bored Ape Yacht Club, told Decrypt that the Ordinals inscription tied to Williams’ BAYC NFT represents an illegitimate ape, explaining only tokens that come from the project's original smart contract are considered valid, granting holders commercial rights and access to events.\n\nHowever, unlike Williams’ maneuver, CryptoPunk #8611 wasn’t burned purely for entertainment, according to Stein.\n\nThe end goal is to create a series of Ordinals inscriptions that correspond to a slice of ownership in CryptoPunk #8611—even though the underlying asset itself can no longer be owned by anyone on its original chain.\n\nThat collection of inscriptions will be created after the one that currently points to CryptoPunk #8611 is ceremonially sent to a digital wallet that belongs to Satoshi Nakamoto, the pseudonymous creator of Bitcoin, in what is effectively a one-way trip, Stein said in a tweet.\n\nAD\n\nAD\n\nPhase #2 1- Send money to escrow\n\n2- Escrow buys Punk for them\n\n3- Escrow burns & inscribes it on BTC\n\n4- Escrow sends the punk to Satoshis wallet Ok! Now we have burned Punk 2 times LMAO Whats next? — NatanStein (@natan_stein) June 16, 2023\n\nMembers of the Bitcoin Bandits community who pooled funds together to purchase CryptoPunk #8611 have also been entered into a contest related to a separate inscriptions project—but that’s beside the point, the spokesperson said.\n\n“Bandits did it more to show the way,” the spokesperson said. “The Bandits Community thinks that CryptoPunks deserve better than ETH.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWRpcHMtcmVjbGFpbWluZy11cy0yNi0wMDU1MzEwODUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin dips after reclaiming US$26,000, Ether falls; XRP gains, Tron leads losers in crypto top 10 - Yahoo Finance",
        "content": "Bitcoin dipped on Monday morning in Asia after reclaiming the US$26,000 support level over the weekend. Ether also fell back, but held above US$1,700. XRP, Dogecoin and Litecoin were the only gainers among the top 10 non-stablecoin cryptocurrencies, while Tron’s TRX led the losers. The U.S.-based crypto exchange Bakkt reportedly joined other trading platforms in delisting Polygon, Solana and Cardano after the U.S. regulator this month labelled them illegally issued financial securities. U.S. equity markets are closed Monday for a public holiday, but they could gain in the week ahead as economic data on Friday pointed to slowing inflation, while the first visit to China in almost five years by a top U.S. diplomat could be a positive for capital markets.\n\nBitcoin, Ether dip; XRP rises\n\nBitcoin fell 0.97% over the last 24 hours to US$26,308 at 07:00 a.m. in Hong Kong, but held onto a weekly gain of 1.58%, according to data from CoinMarketCap.\n\nThe world’s largest cryptocurrency breached the US$26,000 level on Saturday to reach a seven-day high of US$26,769. The token had slumped to three-month lows at the end of last week.\n\nEther edged down 0.82% to US$1,716, logging a weekly loss of 2.18%.\n\nWith the exception of XRP, other top 10 non-stablecoin cryptocurrencies traded lower in the past 24 hours. Polygon’s Matic led the losers, slumping 3.22% to US$0.5971 and down 5.88% over the past seven days.\n\nNew York-based crypto exchange Bakkt has suspended trading of Polygon, Solana and Cardano tokens and plans to delist them, according to Fortune on Friday. Trading platforms such as Robinhood and eToro have also decided to delist multiple cryptocurrencies after the U.S. Securities and Exchange Commission (SEC) filed lawsuits this month against Coinbase and Binance.US and named a long list of cryptocurrencies as securities that were issued and sold without SEC approval.\n\n“Bitcoin and other cryptocurrencies were affected by increasingly changing sentiment toward crypto as traders could limit their risk-taking in the crypto market due to limited upside catalysts and particularly considering the legal risks in the US,” said Wael Makarem, senior market strategist at trading platform Exness Group, in emailed comments.\n\nStory continues\n\n“The legal actions could scare away some investors from the market but could be relatively positive for Bitcoin’s dominance against other cryptocurrencies. In this regard, Bitcoin has also been gaining ground against Ethereum,” said Makarem.\n\nThe Bitcoin balance on crypto exchanges reached a three-month low of 2,281,978.198 tokens on Sunday, according to blockchain data tracker Glassnode, which reduced some selling pressure as investors normally move tokens to exchanges when they plan to sell.\n\nXRP logged gains for the past 24 hours, rising 1.01% to US$0.4859, but losing 6.34% for the week.\n\nFinTech firm Ripple Labs, whose crypto payment platform is powered by XRP, announced on Friday a partnership with Columbia’s central bank to explore the use of blockchain technologies in the country’s digital payment system.\n\nLast Friday, MakerDAO’s stablecoin Dai replaced Binance USD (BUSD) as the third largest stablecoin by market cap. BUSD has seen its market cap falling over 10% in the past seven days, after the SEC issued charges against Binance on June 5, according to data from CoinGecko.\n\nThe total cryptocurrency market cap dipped 0.53% to US$1.07 trillion in the last 24 hours, while crypto trading volume fell 18.47% to US$19.69 billion, according to CoinMarketCap data.\n\nEthereum NFT sales fall, Nike teases deal with Fortnite\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dipped 0.16% to 2,878.56 in the 24 hours to 09:30 a.m. in Hong Kong. The index is down 4.80% for the seven days.\n\nNFT sales on Ethereum fell 20.61% in the past 24 hours to US$11.06 million, according to CryptoSlam data. Sales on the Bitcoin blockchain slid 44.71% to US$882,550.\n\n“Sales across Ethereum and Bitcoin continue to lose steam, and it’s hard to say when this could turn around due to uncertainty with regulations and legal matters up in the air,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\nDespite the decline, Sotheby’s NFT auction saw Ringers #879, an Ethereum-based NFT created by Canadian artist Dmitri Cherniak, sell for US$6.2 million on Friday, the second highest sale of a piece of generative art, or created using autonomous systems.\n\n“Sotheby’s auction concluded and saw $10.9m in sales, over half of which was from the Ringers grail,” said Petscher, “It’s worth noting that the supposed buyer already a major NFT trader, so this auction didn’t seem to draw attention from the traditional art world. Is it bullish still for NFT art? Yes, but there’s still always concern that the NFT ecosystem is largely an echochamber.”\n\nElsewhere, the U.S. sportswear giant Nike released a teaser on Saturday which appears to be an NFT collaboration with online video game Fortnite, which will be unveiled on June 20. .SWOOSH, Nike’s Web 3.0 platform that issues NFT sneakers, also announced a partnership with sports video game publisher EA Sports earlier this month.\n\n“A new innovation has reached Ethereum called ethscriptions, inspired by inscriptions on Bitcoin. This new process allows you to inscribe tiny images (under 96kb) on mostly any Ethereum transaction, thus allowing cheap on-chain image storage,” said Petscher.\n\n“The innovation here is the ease of storing an image on-chain, which is typically avoided in standard contract storage due to the high cost. In just a few days nearly 200ETH of secondary volume has been transacted, most from a sold out 10k collection of Ethereum Punks.”\n\nU.S. futures trade mixed\n\nImage: Envato Elements\n\nU.S. stock futures traded mixed as of 11:30 a.m. in Hong Kong. Dow Jones Industrial Average futures dipped 0.10%, the S&P 500 inched up 0.01%, while Nasdaq futures added 0.16%. The U.S. stock market is closed Monday for a public holiday and will open on Tuesday.\n\nThe three major U.S. stock indexes all closed lower on Friday but logged gains for the week, as investors sorted through mixed signals from economic data and comments from Federal Reserve officials on Friday.\n\nA survey by the University of Michigan on Friday showed consumers expect annual inflation of 3.3% over the next year, the lowest since March 2021, but still above the Federal Reserve’s goal of annual inflation below 2%.\n\nFederal Reserve Governor Christopher Waller and Richmond Federal Reserve Bank President Thomas Barkin said on Friday that more interest rate hikes might be required to fight inflation.\n\n“We’re seeing policy rates having some effects on parts of the economy. The labor market is still strong, but core-kind of inflation is just not moving and that’s going to require probably some more tightening to try to get that going down,” said Waller in his Friday speech.\n\nThe Federal Reserve will meet on July 26 to make its next move on interest rates, which are now between 5 and 5.25%, the highest since 2006. The CME FedWatch Tool predicts a 28.1% chance the Fed will keep rates unchanged in July, and a 71.9% chance for another 25-basis-point rate hike.\n\nMeanwhile in China, analysts expect the country’s central bank to make a 10 basis-point cut to its one-year and five-year loan prime rates on Tuesday, lowering the rates to 3.55% and 4.20% as the country struggles with a slow post-Covid recovery, according to Reuters on Monday.\n\n(Updates with equities section.)"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWRpcHMtcmVjbGFpbWluZy11cy0yNi0wMDU1MzEwODUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin dips after reclaiming US$26,000, Ether falls; XRP gains, Tron leads losers in crypto top 10 - Yahoo Finance",
        "content": "Bitcoin dipped on Monday morning in Asia after reclaiming the US$26,000 support level over the weekend. Ether also fell back, but held above US$1,700. XRP, Dogecoin and Litecoin were the only gainers among the top 10 non-stablecoin cryptocurrencies, while Tron’s TRX led the losers. The U.S.-based crypto exchange Bakkt reportedly joined other trading platforms in delisting Polygon, Solana and Cardano after the U.S. regulator this month labelled them illegally issued financial securities. U.S. equity markets are closed Monday for a public holiday, but they could gain in the week ahead as economic data on Friday pointed to slowing inflation, while the first visit to China in almost five years by a top U.S. diplomat could be a positive for capital markets.\n\nBitcoin, Ether dip; XRP rises\n\nBitcoin fell 0.97% over the last 24 hours to US$26,308 at 07:00 a.m. in Hong Kong, but held onto a weekly gain of 1.58%, according to data from CoinMarketCap.\n\nThe world’s largest cryptocurrency breached the US$26,000 level on Saturday to reach a seven-day high of US$26,769. The token had slumped to three-month lows at the end of last week.\n\nEther edged down 0.82% to US$1,716, logging a weekly loss of 2.18%.\n\nWith the exception of XRP, other top 10 non-stablecoin cryptocurrencies traded lower in the past 24 hours. Polygon’s Matic led the losers, slumping 3.22% to US$0.5971 and down 5.88% over the past seven days.\n\nNew York-based crypto exchange Bakkt has suspended trading of Polygon, Solana and Cardano tokens and plans to delist them, according to Fortune on Friday. Trading platforms such as Robinhood and eToro have also decided to delist multiple cryptocurrencies after the U.S. Securities and Exchange Commission (SEC) filed lawsuits this month against Coinbase and Binance.US and named a long list of cryptocurrencies as securities that were issued and sold without SEC approval.\n\n“Bitcoin and other cryptocurrencies were affected by increasingly changing sentiment toward crypto as traders could limit their risk-taking in the crypto market due to limited upside catalysts and particularly considering the legal risks in the US,” said Wael Makarem, senior market strategist at trading platform Exness Group, in emailed comments.\n\nStory continues\n\n“The legal actions could scare away some investors from the market but could be relatively positive for Bitcoin’s dominance against other cryptocurrencies. In this regard, Bitcoin has also been gaining ground against Ethereum,” said Makarem.\n\nThe Bitcoin balance on crypto exchanges reached a three-month low of 2,281,978.198 tokens on Sunday, according to blockchain data tracker Glassnode, which reduced some selling pressure as investors normally move tokens to exchanges when they plan to sell.\n\nXRP logged gains for the past 24 hours, rising 1.01% to US$0.4859, but losing 6.34% for the week.\n\nFinTech firm Ripple Labs, whose crypto payment platform is powered by XRP, announced on Friday a partnership with Columbia’s central bank to explore the use of blockchain technologies in the country’s digital payment system.\n\nLast Friday, MakerDAO’s stablecoin Dai replaced Binance USD (BUSD) as the third largest stablecoin by market cap. BUSD has seen its market cap falling over 10% in the past seven days, after the SEC issued charges against Binance on June 5, according to data from CoinGecko.\n\nThe total cryptocurrency market cap dipped 0.53% to US$1.07 trillion in the last 24 hours, while crypto trading volume fell 18.47% to US$19.69 billion, according to CoinMarketCap data.\n\nEthereum NFT sales fall, Nike teases deal with Fortnite\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dipped 0.16% to 2,878.56 in the 24 hours to 09:30 a.m. in Hong Kong. The index is down 4.80% for the seven days.\n\nNFT sales on Ethereum fell 20.61% in the past 24 hours to US$11.06 million, according to CryptoSlam data. Sales on the Bitcoin blockchain slid 44.71% to US$882,550.\n\n“Sales across Ethereum and Bitcoin continue to lose steam, and it’s hard to say when this could turn around due to uncertainty with regulations and legal matters up in the air,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\nDespite the decline, Sotheby’s NFT auction saw Ringers #879, an Ethereum-based NFT created by Canadian artist Dmitri Cherniak, sell for US$6.2 million on Friday, the second highest sale of a piece of generative art, or created using autonomous systems.\n\n“Sotheby’s auction concluded and saw $10.9m in sales, over half of which was from the Ringers grail,” said Petscher, “It’s worth noting that the supposed buyer already a major NFT trader, so this auction didn’t seem to draw attention from the traditional art world. Is it bullish still for NFT art? Yes, but there’s still always concern that the NFT ecosystem is largely an echochamber.”\n\nElsewhere, the U.S. sportswear giant Nike released a teaser on Saturday which appears to be an NFT collaboration with online video game Fortnite, which will be unveiled on June 20. .SWOOSH, Nike’s Web 3.0 platform that issues NFT sneakers, also announced a partnership with sports video game publisher EA Sports earlier this month.\n\n“A new innovation has reached Ethereum called ethscriptions, inspired by inscriptions on Bitcoin. This new process allows you to inscribe tiny images (under 96kb) on mostly any Ethereum transaction, thus allowing cheap on-chain image storage,” said Petscher.\n\n“The innovation here is the ease of storing an image on-chain, which is typically avoided in standard contract storage due to the high cost. In just a few days nearly 200ETH of secondary volume has been transacted, most from a sold out 10k collection of Ethereum Punks.”\n\nU.S. futures trade mixed\n\nImage: Envato Elements\n\nU.S. stock futures traded mixed as of 11:30 a.m. in Hong Kong. Dow Jones Industrial Average futures dipped 0.10%, the S&P 500 inched up 0.01%, while Nasdaq futures added 0.16%. The U.S. stock market is closed Monday for a public holiday and will open on Tuesday.\n\nThe three major U.S. stock indexes all closed lower on Friday but logged gains for the week, as investors sorted through mixed signals from economic data and comments from Federal Reserve officials on Friday.\n\nA survey by the University of Michigan on Friday showed consumers expect annual inflation of 3.3% over the next year, the lowest since March 2021, but still above the Federal Reserve’s goal of annual inflation below 2%.\n\nFederal Reserve Governor Christopher Waller and Richmond Federal Reserve Bank President Thomas Barkin said on Friday that more interest rate hikes might be required to fight inflation.\n\n“We’re seeing policy rates having some effects on parts of the economy. The labor market is still strong, but core-kind of inflation is just not moving and that’s going to require probably some more tightening to try to get that going down,” said Waller in his Friday speech.\n\nThe Federal Reserve will meet on July 26 to make its next move on interest rates, which are now between 5 and 5.25%, the highest since 2006. The CME FedWatch Tool predicts a 28.1% chance the Fed will keep rates unchanged in July, and a 71.9% chance for another 25-basis-point rate hike.\n\nMeanwhile in China, analysts expect the country’s central bank to make a 10 basis-point cut to its one-year and five-year loan prime rates on Tuesday, lowering the rates to 3.55% and 4.20% as the country struggles with a slow post-Covid recovery, according to Reuters on Monday.\n\n(Updates with equities section.)"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWRpcHMtcmVjbGFpbWluZy11cy0yNi0wMDU1MzEwODUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 18 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin dips after reclaiming US$26,000, Ether falls; XRP gains, Tron leads losers in crypto top 10 - Yahoo Finance",
        "content": "Bitcoin dipped on Monday morning in Asia after reclaiming the US$26,000 support level over the weekend. Ether also fell back, but held above US$1,700. XRP, Dogecoin and Litecoin were the only gainers among the top 10 non-stablecoin cryptocurrencies, while Tron’s TRX led the losers. The U.S.-based crypto exchange Bakkt reportedly joined other trading platforms in delisting Polygon, Solana and Cardano after the U.S. regulator this month labelled them illegally issued financial securities. U.S. equity markets are closed Monday for a public holiday, but they could gain in the week ahead as economic data on Friday pointed to slowing inflation, while the first visit to China in almost five years by a top U.S. diplomat could be a positive for capital markets.\n\nBitcoin, Ether dip; XRP rises\n\nBitcoin fell 0.97% over the last 24 hours to US$26,308 at 07:00 a.m. in Hong Kong, but held onto a weekly gain of 1.58%, according to data from CoinMarketCap.\n\nThe world’s largest cryptocurrency breached the US$26,000 level on Saturday to reach a seven-day high of US$26,769. The token had slumped to three-month lows at the end of last week.\n\nEther edged down 0.82% to US$1,716, logging a weekly loss of 2.18%.\n\nWith the exception of XRP, other top 10 non-stablecoin cryptocurrencies traded lower in the past 24 hours. Polygon’s Matic led the losers, slumping 3.22% to US$0.5971 and down 5.88% over the past seven days.\n\nNew York-based crypto exchange Bakkt has suspended trading of Polygon, Solana and Cardano tokens and plans to delist them, according to Fortune on Friday. Trading platforms such as Robinhood and eToro have also decided to delist multiple cryptocurrencies after the U.S. Securities and Exchange Commission (SEC) filed lawsuits this month against Coinbase and Binance.US and named a long list of cryptocurrencies as securities that were issued and sold without SEC approval.\n\n“Bitcoin and other cryptocurrencies were affected by increasingly changing sentiment toward crypto as traders could limit their risk-taking in the crypto market due to limited upside catalysts and particularly considering the legal risks in the US,” said Wael Makarem, senior market strategist at trading platform Exness Group, in emailed comments.\n\nStory continues\n\n“The legal actions could scare away some investors from the market but could be relatively positive for Bitcoin’s dominance against other cryptocurrencies. In this regard, Bitcoin has also been gaining ground against Ethereum,” said Makarem.\n\nThe Bitcoin balance on crypto exchanges reached a three-month low of 2,281,978.198 tokens on Sunday, according to blockchain data tracker Glassnode, which reduced some selling pressure as investors normally move tokens to exchanges when they plan to sell.\n\nXRP logged gains for the past 24 hours, rising 1.01% to US$0.4859, but losing 6.34% for the week.\n\nFinTech firm Ripple Labs, whose crypto payment platform is powered by XRP, announced on Friday a partnership with Columbia’s central bank to explore the use of blockchain technologies in the country’s digital payment system.\n\nLast Friday, MakerDAO’s stablecoin Dai replaced Binance USD (BUSD) as the third largest stablecoin by market cap. BUSD has seen its market cap falling over 10% in the past seven days, after the SEC issued charges against Binance on June 5, according to data from CoinGecko.\n\nThe total cryptocurrency market cap dipped 0.53% to US$1.07 trillion in the last 24 hours, while crypto trading volume fell 18.47% to US$19.69 billion, according to CoinMarketCap data.\n\nEthereum NFT sales fall, Nike teases deal with Fortnite\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dipped 0.16% to 2,878.56 in the 24 hours to 09:30 a.m. in Hong Kong. The index is down 4.80% for the seven days.\n\nNFT sales on Ethereum fell 20.61% in the past 24 hours to US$11.06 million, according to CryptoSlam data. Sales on the Bitcoin blockchain slid 44.71% to US$882,550.\n\n“Sales across Ethereum and Bitcoin continue to lose steam, and it’s hard to say when this could turn around due to uncertainty with regulations and legal matters up in the air,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\nDespite the decline, Sotheby’s NFT auction saw Ringers #879, an Ethereum-based NFT created by Canadian artist Dmitri Cherniak, sell for US$6.2 million on Friday, the second highest sale of a piece of generative art, or created using autonomous systems.\n\n“Sotheby’s auction concluded and saw $10.9m in sales, over half of which was from the Ringers grail,” said Petscher, “It’s worth noting that the supposed buyer already a major NFT trader, so this auction didn’t seem to draw attention from the traditional art world. Is it bullish still for NFT art? Yes, but there’s still always concern that the NFT ecosystem is largely an echochamber.”\n\nElsewhere, the U.S. sportswear giant Nike released a teaser on Saturday which appears to be an NFT collaboration with online video game Fortnite, which will be unveiled on June 20. .SWOOSH, Nike’s Web 3.0 platform that issues NFT sneakers, also announced a partnership with sports video game publisher EA Sports earlier this month.\n\n“A new innovation has reached Ethereum called ethscriptions, inspired by inscriptions on Bitcoin. This new process allows you to inscribe tiny images (under 96kb) on mostly any Ethereum transaction, thus allowing cheap on-chain image storage,” said Petscher.\n\n“The innovation here is the ease of storing an image on-chain, which is typically avoided in standard contract storage due to the high cost. In just a few days nearly 200ETH of secondary volume has been transacted, most from a sold out 10k collection of Ethereum Punks.”\n\nU.S. futures trade mixed\n\nImage: Envato Elements\n\nU.S. stock futures traded mixed as of 11:30 a.m. in Hong Kong. Dow Jones Industrial Average futures dipped 0.10%, the S&P 500 inched up 0.01%, while Nasdaq futures added 0.16%. The U.S. stock market is closed Monday for a public holiday and will open on Tuesday.\n\nThe three major U.S. stock indexes all closed lower on Friday but logged gains for the week, as investors sorted through mixed signals from economic data and comments from Federal Reserve officials on Friday.\n\nA survey by the University of Michigan on Friday showed consumers expect annual inflation of 3.3% over the next year, the lowest since March 2021, but still above the Federal Reserve’s goal of annual inflation below 2%.\n\nFederal Reserve Governor Christopher Waller and Richmond Federal Reserve Bank President Thomas Barkin said on Friday that more interest rate hikes might be required to fight inflation.\n\n“We’re seeing policy rates having some effects on parts of the economy. The labor market is still strong, but core-kind of inflation is just not moving and that’s going to require probably some more tightening to try to get that going down,” said Waller in his Friday speech.\n\nThe Federal Reserve will meet on July 26 to make its next move on interest rates, which are now between 5 and 5.25%, the highest since 2006. The CME FedWatch Tool predicts a 28.1% chance the Fed will keep rates unchanged in July, and a 71.9% chance for another 25-basis-point rate hike.\n\nMeanwhile in China, analysts expect the country’s central bank to make a 10 basis-point cut to its one-year and five-year loan prime rates on Tuesday, lowering the rates to 3.55% and 4.20% as the country struggles with a slow post-Covid recovery, according to Reuters on Monday.\n\n(Updates with equities section.)"
    }
]