[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWdhaW5zLWludmVzdG9ycy1kaXZlcnNpZnktYW1pZC0wMzMzMTIwNTkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin gains as investors diversify amid worries about banking system; U.S. equity futures rise - Yahoo Finance",
        "content": "Bitcoin and the other top 10 non-stablecoin cryptocurrencies opened the working week with gains in Monday morning trading in Asia, as investors seek to diversify portfolios amid banking turmoil and the Federal Reserve’s latest rate hike. Litecoin led the winners. U.S. equity futures rose this morning as authorities sought to reassure investors the financial system is sound following bank failures and sharp declines in some lender’s stocks.\n\nSee related article: Weekly Market Wrap: Bitcoin hovers around US$28,000 as banking concerns return. Will it hit US$30,000?\n\nBitcoin rose 1.69% to US$28,026 in the 24 hours to 09:00 a.m. in Hong Kong, adding 0.37% for the week, according to CoinMarketCap data. The world’s largest cryptocurrency dipped below the US$28,000 resistance level over the weekend, and bounced back above it early on Monday. Trading turned choppy later in the morning and it moved above and below that line.\n\n“Traders are flocking to Bitcoin and similar assets to diversify their holdings. Recent bank failures have also strengthened the case for investing in Bitcoin, along with murmurs of hyperinflation,” Maxwell Goldstein, cofounder of on-chain fine art investment platform Freeport, told Forkast.News on Friday. Due to fears of inflation, “investors are absolutely seeking a safe haven asset and Bitcoin fits the bill.”\n\nEther moved up 1.61% to US$1,780, a weekly gain of 0.16%. Ethereum developer Matter Labs launched the mainet of zkSync Era on Friday, making it the first zero-knowledge scaling system for Ethereum that was opened to general users.\n\nLitecoin led the winners for the past 24 hours, gaining 1,85% to US$93.57 and up 12.39% for the week.\n\nThe total crypto market capitalization rose 1.34% in the past 24 hours to US$1.17 trillion. Total trading volume over the last 24 hours dipped 4.67% to US$31.46 billion.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dropped 1.52% in the past 24 hours to 4,024.34 as of 09:30 a.m. in Hong Kong, moving down 2.66% for the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day. It is managed by Forkast sister company, CryptoSlam.\n\nU.S. equities closed higher on Friday. The Dow Jones Industrial Average rose 0.41%, the S&P 500 gained 0.56%, and the Nasdaq Composite Index moved up 0.31%. All three indices logged gains after a volatile week characterized by wobbly banks and the Federal Reserve’s latest 25-basis-point rate hike.\n\nDespite the gains, bank worries remain. Deutsche Bank, the largest lender in Germany, saw the cost of its default insurance jump on Friday, triggering an 8% sell-off in its stock, according to CNBC.\n\nOn the same day in the U.S., the Financial Stability Oversight Council said that although “some institutions have come under stress, the U.S. banking system remains sound and resilient.” Other officials from U.S. President Joe Biden on down have repeated the same in recent weeks.\n\nAhead of the opening of U.S. equity markets on Monday, stock futures rose as of 9:00 a.m. in Hong Kong. Dow Jones Industrial Average futures moved up 0.36%. S&P 500 futures gained 0.37%. The Nasdaq Composite Index futures edged up 0.24%.\n\nIn the week ahead, the U.S. Congress on Wednesday will hold a hearing on Silicon Valley Bank and Signature Bank, which both failed this month, and data releases are expected on U.S. inflation and GDP growth.\n\nThe Federal Reserve will meet on May 3 to make its next move on interest rates to tackle inflation. Analysts at the CME Group expect a 83.2% chance the Fed will keep rates at 4.75% to 5%. The chance of another 25 basis-point hike is at 16.8%, down from 34.2% on Friday."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWdhaW5zLWludmVzdG9ycy1kaXZlcnNpZnktYW1pZC0wMzMzMTIwNTkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin gains as investors diversify amid worries about banking system; U.S. equity futures rise - Yahoo Finance",
        "content": "Bitcoin and the other top 10 non-stablecoin cryptocurrencies opened the working week with gains in Monday morning trading in Asia, as investors seek to diversify portfolios amid banking turmoil and the Federal Reserve’s latest rate hike. Litecoin led the winners. U.S. equity futures rose this morning as authorities sought to reassure investors the financial system is sound following bank failures and sharp declines in some lender’s stocks.\n\nSee related article: Weekly Market Wrap: Bitcoin hovers around US$28,000 as banking concerns return. Will it hit US$30,000?\n\nBitcoin rose 1.69% to US$28,026 in the 24 hours to 09:00 a.m. in Hong Kong, adding 0.37% for the week, according to CoinMarketCap data. The world’s largest cryptocurrency dipped below the US$28,000 resistance level over the weekend, and bounced back above it early on Monday. Trading turned choppy later in the morning and it moved above and below that line.\n\n“Traders are flocking to Bitcoin and similar assets to diversify their holdings. Recent bank failures have also strengthened the case for investing in Bitcoin, along with murmurs of hyperinflation,” Maxwell Goldstein, cofounder of on-chain fine art investment platform Freeport, told Forkast.News on Friday. Due to fears of inflation, “investors are absolutely seeking a safe haven asset and Bitcoin fits the bill.”\n\nEther moved up 1.61% to US$1,780, a weekly gain of 0.16%. Ethereum developer Matter Labs launched the mainet of zkSync Era on Friday, making it the first zero-knowledge scaling system for Ethereum that was opened to general users.\n\nLitecoin led the winners for the past 24 hours, gaining 1,85% to US$93.57 and up 12.39% for the week.\n\nThe total crypto market capitalization rose 1.34% in the past 24 hours to US$1.17 trillion. Total trading volume over the last 24 hours dipped 4.67% to US$31.46 billion.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dropped 1.52% in the past 24 hours to 4,024.34 as of 09:30 a.m. in Hong Kong, moving down 2.66% for the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day. It is managed by Forkast sister company, CryptoSlam.\n\nU.S. equities closed higher on Friday. The Dow Jones Industrial Average rose 0.41%, the S&P 500 gained 0.56%, and the Nasdaq Composite Index moved up 0.31%. All three indices logged gains after a volatile week characterized by wobbly banks and the Federal Reserve’s latest 25-basis-point rate hike.\n\nDespite the gains, bank worries remain. Deutsche Bank, the largest lender in Germany, saw the cost of its default insurance jump on Friday, triggering an 8% sell-off in its stock, according to CNBC.\n\nOn the same day in the U.S., the Financial Stability Oversight Council said that although “some institutions have come under stress, the U.S. banking system remains sound and resilient.” Other officials from U.S. President Joe Biden on down have repeated the same in recent weeks.\n\nAhead of the opening of U.S. equity markets on Monday, stock futures rose as of 9:00 a.m. in Hong Kong. Dow Jones Industrial Average futures moved up 0.36%. S&P 500 futures gained 0.37%. The Nasdaq Composite Index futures edged up 0.24%.\n\nIn the week ahead, the U.S. Congress on Wednesday will hold a hearing on Silicon Valley Bank and Signature Bank, which both failed this month, and data releases are expected on U.S. inflation and GDP growth.\n\nThe Federal Reserve will meet on May 3 to make its next move on interest rates to tackle inflation. Analysts at the CME Group expect a 83.2% chance the Fed will keep rates at 4.75% to 5%. The chance of another 25 basis-point hike is at 16.8%, down from 34.2% on Friday."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy50aGVndWFyZGlhbi5jb20vdGVjaG5vbG9neS8yMDIzL21hci8yNi9jcnlwdG9jdXJyZW5jaWVzLWFkZC1ub3RoaW5nLXVzZWZ1bC10by1zb2NpZXR5LW52aWRpYS1jaGF0Ym90cy1wcm9jZXNzaW5nLWNyeXB0by1taW5pbmfSAYoBaHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3RlY2hub2xvZ3kvMjAyMy9tYXIvMjYvY3J5cHRvY3VycmVuY2llcy1hZGQtbm90aGluZy11c2VmdWwtdG8tc29jaWV0eS1udmlkaWEtY2hhdGJvdHMtcHJvY2Vzc2luZy1jcnlwdG8tbWluaW5n?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Cryptocurrencies add nothing useful to society, says chip-maker Nvidia - The Guardian",
        "content": "The US chip-maker Nvidia has said cryptocurrencies do not “bring anything useful for society” despite the company’s powerful processors selling in huge quantities to the sector.\n\nMichael Kagan, its chief technology officer, said other uses of processing power such as the artificial intelligence chatbot ChatGPT were more worthwhile than mining crypto.\n\nNvidia never embraced the crypto community with open arms. In 2021, the company even released software that artificially constrained the ability to use its graphics cards from being used to mine the popular Ethereum cryptocurrency, in an effort to ensure supply went to its preferred customers instead, who include AI researchers and gamers.\n\nKagan said the decision was justified because of the limited value of using processing power to mine cryptocurrencies.\n\nThe first version ChatGPT was trained on a supercomputer made up of about 10,000 Nvidia graphics cards.\n\n“All this crypto stuff, it needed parallel processing, and [Nvidia] is the best, so people just programmed it to use for this purpose. They bought a lot of stuff, and then eventually it collapsed, because it doesn’t bring anything useful for society. AI does,” Kagan told the Guardian.\n\n“With ChatGPT, everybody can now create his own machine, his own programme: you just tell it what to do, and it will. And if it doesn’t work the way you want it to, you tell it ‘I want something different’.”\n\nCrypto, by contrast, was more like high-frequency trading, an industry that had led to a lot of business for Mellanox, the company Kagan founded before it was acquired by Nvidia.\n\n“We were heavily involved in also trading: people on Wall Street were buying our stuff to save a few nanoseconds on the wire, the banks were doing crazy things like pulling the fibres under the Hudson taut to make them a little bit shorter, to save a few nanoseconds between their datacentre and the stock exchange,” he said.\n\n“I never believed that [crypto] is something that will do something good for humanity. You know, people do crazy things, but they buy your stuff, you sell them stuff. But you don’t redirect the company to support whatever it is.”\n\nOriginally best known for producing powerful graphics cards for PC gamers to play the latest games, it was almost by chance that Nvidia’s products took their place at the heart of the AI boom.\n\nThe computationally intensive work of training a new AI system, which can take millions of billions of dollars-worth of computing power, happened to work significantly faster on the types of simple yet powerful processors that had been adopted by gamers.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nTwo weeks ago, Microsoft said it had bought tens of thousands of Nvidia’s AI-focused processors, the A100 GPU, in order to power the workload of OpenAI. Nvidia has sold 20,000 H100s, the successor to that chip, to Amazon for its cloud computing AWS service, and another 16,000 have been sold to Oracle.\n\nNvidia also rents access to the chips directly, with its DGX cloud service starting at just under $37,000 (£30,250) a month for just eight H100s wired together in a “cluster”.\n\nSpeaking at the company’s annual conference last week, Jensen Huang, Nvidia’s chief executive, described the company as the engine behind “the iPhone moment of AI”, and said the “generative AI” his firm powers would “reinvent nearly every industry”.\n\nLast year, Nvidia’s $40bn takeover of the UK-based tech firm Arm collapsed because of regulatory difficulties."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDMvMjYvYml0Y29pbi1pcy1wb2lzZWQtdG8tYmxvdy11cC1hZnJpY2FzLTg2LWJpbGxpb24tYmFua2luZy1zeXN0ZW0uaHRtbNIBZ2h0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzAzLzI2L2JpdGNvaW4taXMtcG9pc2VkLXRvLWJsb3ctdXAtYWZyaWNhcy04Ni1iaWxsaW9uLWJhbmtpbmctc3lzdGVtLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin is poised to blow up Africa's $86 billion banking system - CNBC",
        "content": "watch now\n\nACCRA, Ghana — Block CEO Jack Dorsey and his top brass descended on Accra for the inaugural Africa Bitcoin Conference in December to talk about one of the most potentially disruptive and transformative alternatives to the continent's existing financial system: bitcoin. Since its inception in 2008, this unfamiliar form of money has alternatively been disdained as an absurdly complex toy for libertarian techies, a legalized form of gambling, a speculative bet to get rich quick, and a vehicle for criminals and fraudsters to obscure the origins of their ill-begotten gains. But this parallel financial system can also serve a tangible social good, offering an onramp to the financial system for people who would otherwise be left out. In countries where the vast majority of the population is unbanked, national currencies are no longer a safe store of value, remittances comprise a hefty portion of GDP, and international sanctions complicate connections to the global economy, a virtual currency that doesn't require an intermediary to approve transactions can be a vital lifeline for survival. As cryptocurrency continues to rise in prominence and becomes a growing flashpoint for regulators, Dorsey and his deputies are providing an essential counternarrative: Bitcoin brings financial power to people who would otherwise have none. \"It doesn't matter to me if the price goes down or up, because I can still use bitcoin as a vehicle to move money around the world instantaneously,\" said Mike Brock, the CEO of TBD at Block, a unit which focuses on cryptocurrency and decentralized finance. \"I can exchange dollars for bitcoin and then bitcoin for Brazilian rial. There is a market for bitcoin in every corner of the world today,\" continued Brock.\n\nA broken financial system\n\nMoving money in Africa is an expensive and complicated process. Commercial bank branch access is limited, especially for people living in remote and rural areas. Digital banking options are also limited. Tack on rampant hyperinflation, widespread government corruption, and capital controls trapping domestic cash in banks, and money can stop making sense altogether. \"If someone wants to move money to the country next door, normally, you'd have to fill up a suitcase full of cash and move it over the border,\" explains Ray Youssef, CEO of Paxful. Part of the problem stems from the continent's quasi-colonial payment framework, in which roughly 80% of cross-border payments originating from African banks are processed offshore, mostly in the U.S. or Europe. That translates to higher costs and processing times that are sometimes measured in weeks. Then there's mobile money, which has been around since the early 2000s. Think of it like an electronic wallet tied to a phone number that does not require a smartphone or data to operate. Users can pay bills and shop with their phone through SMS texting, instead of having to rely on traditional banking options. Africa's mobile money transactions rose 39% to more than $700 billion in 2021, according to data from the GSM Association, a non-profit representing mobile network operators worldwide. World Bank data shows that account ownership at a financial institution — or via a mobile money service provider — has more than doubled in the last decade, rising to 55% of adults in Sub-Saharan Africa.\n\nAn employee uses a Nokia 1200 mobile phone inside an M-Pesa store in Nairobi, Kenya, on Sunday, April 14, 2013. Trevor Snap | Bloomberg | Getty Images\n\nBut even as adoption proliferates, mobile money users don't get the perks of legacy banking, including earning interest on banked savings and building up a credit score based on a history of spending. Interoperability on the continent also remains a major issue with this alternative way of banking. \"The entire banking system in Africa is completely and utterly broken, even amongst the mobile money providers, the telcos,\" said Youssef from Paxful, a peer-to-peer crypto marketplace where users can directly buy and sell tokens with one another. \"Two thousand payment networks and only 2% of them talk to each other. That number continues to grow. It's not getting better, it's actually getting worse,\" continued Youssef. Companies like Western Union and MoneyGram offer an expansive physical network of storefronts around the world designed to move money for those who are unbanked. That cash network was extraordinarily difficult and expensive to build, which is why there aren't a lot of direct competitors. It is also why those cash transfers often incur substantial fees. Bitcoin could eliminate all these intermediaries, allowing citizens to send digital payments directly to one another, without relying on credit and without incurring multiple settlement fees along the way. \"We're going to move to a model where we can make payments without IOUs, or credit, or promises, or fiat,\" said Alex Gladstein, chief strategy officer for the Human Rights Foundation, an organization that works with activists from authoritarian regimes around the world. \"It's literally like sending a piece of gold or a $20 bill instantly somewhere else.\" \"If you can get access to the internet, you can settle bitcoin payments,\" said Brock. \"And the government can't do anything about it.\" Dorsey points to the example of what happened in Nigeria during the protests against the brutality of the country's Special Anti-Robbery Squad — a movement referred to as #EndSARS. \"The Nigerian government went to various bank corps to stop protesters from receiving money — which bitcoin made up for,\" Dorsey said in Accra. \"So our whole reason for being as a company is solving the same problem that bitcoin will ultimately solve for everyone in the world.\"\n\nwatch now\n\nMoving money on the bitcoin blockchain at its base layer has its own challenges. At times of peak demand, fees will often spike higher, and if a user is unwilling to pay a premium for the transaction, they may have to wait for more blocks of transactions to get confirmed before their transfer goes through. Bitcoin's Lightning Network helps alleviate both of those problems by slashing the cost of transactions to virtually zero and enabling nearly instantaneous cash payments around the planet – making bitcoin a more effective payment rail. This so-called \"layer two\" technology is built on top of bitcoin's main chain, in part because bitcoiners are conservative about introducing changes to the base layer, for fear of opening it up to hacks or other mischief. Yellow Card — Africa's largest centralized cryptocurrency exchange run by CEO Chris Maurice — is also looking to embed this layer two technology into the platform, in order to drive down the price of transactions to virtually zero. Currently, the exchange doesn't charge a commission for transactions, but network fees can be pretty steep when a lot of trades are happening at once. \"It'll have a pretty big impact to our customers, because a lot of them are very price sensitive,\" says Justin Poiroux, the co-founder and CTO of Yellow Card. Yellow Card's plan is still in its infancy, but Poiroux tells CNBC that he thinks the Lightning Network could ultimately provide a lot of value for its retail customers.\n\nZoom In Icon Arrows pointing outwards Bitnob CEO Bernard Parah and Cash App's crypto product lead, Miles Suter, at the Africa Bitcoin Conference in Accra, Ghana. Bernard Parah\n\nBecause Lightning offers a universal monetary language, money can travel around the world between any Lightning-enabled bitcoin wallet. Someone who uses a platform like Block's Cash App — a regulated, American financial product with 51 million monthly transacting users which integrated with the Lightning Network in Feb. 2022 — can pay any Lightning invoice in the world instantly. \"It's a new way of doing business. It's a different paradigm entirely,\" said Gladstein. The crypto product lead at Cash App, Miles Suter, believes that a big part of bitcoin's utility is how it gets around broken and convoluted payment systems that don't talk to each other. \"At Cash App in particular, we've always been really interested in taking bitcoin beyond just being seen as an investment and bringing day-to-day utility to it,\" Suter told CNBC on the sidelines of the Africa Bitcoin Conference. \"In many ways, the people on the African continent are already doing that with the tools they have,\" continued Suter.\n\nSending cash with Lightning\n\nBernard Parah is a 30-year-old entrepreneur living in Jos, Nigeria, about a five hour drive from the capital city of Abuja. He's the CEO of Bitnob, an app that lets users across Africa buy, save, and invest in bitcoin. Bitnob is SMS-based and piggybacks on the mobile money system, making it easier for people to send money directly into bank accounts and mobile money wallets in African countries. Parah recently teamed up with Strike, a Lightning Network payments platform, to launch a feature called \"Send Globally\" that allows Americans to transfer money to people living in Nigeria, Ghana, and Kenya. It uses local fiat cash on either side of the transaction, but bitcoin is used under the hood as the pipeline to jump money over the border. The end user never touches the cryptocurrency themselves. \"We're able to settle into bank accounts or mobile money accounts, without the recipients having to interact with bitcoin themselves,\" Parah tells CNBC. \"Over time, we've seen that there are still people who really don't understand how to use bitcoin; who don't care about bitcoin. What they do care about is their problems getting solved,\" continued Parah.\n\nBitnob CEO Bernard Parah and Strike CEO Jack Mallers announcing the launch of 'Send Globally' on stage at the Africa Bitcoin Conference in Accra, Ghana. Bernard Parah\n\nIt feels like a wire transfer or a Venmo payment, according to Strike CEO Jack Mallers. \"It's instant. There's no debt. There's no credit. There's no delays,\" explains Mallers. The model works because Parah and Mallers are willing to take on the liability associated with the transfer by holding cash in escrow on either end of the exchange. Once the money is received in Nigeria, Bitnob — which is a regulated entity with connections to the local banks — will take that bitcoin and turn it into their local currency. \"It's just two regulated entities communicating over the language of bitcoin and cutting out excess fees,\" said Suter. \"I think that's revolutionary.\" Mallers says that they offer more competitive foreign exchange rates by using bitcoin as a price-setting intermediary, a sort of new world reserve currency. \"The rate that we got was actually 60% better than the traditional forex market rate,\" said Mallers. \"The way to actually think about how we're achieving forex if we clear through bitcoin is, 'I have dollars. How many bitcoin can I get for my dollars? And then how many naira can I get for my bitcoin?'\" said Mallers. \"It's acting as the most liquid, accessible, global instrument for us to clear and settle value amongst each other,\" he said. The arrangement also offers a few big ancillary benefits, including interoperability with payment apps around the world that have tens of millions of users. Block's Suter explained that Cash App could theoretically interoperate with Bitnob. \"We're only live in the U.S. right now, but that doesn't mean we can't speak to Bitnob in Nigeria and transfer value instantly and for free across these borders,\" Suter said of Cash App.\n\nMeeting customers where they are\n\nZoom In Icon Arrows pointing outwards South African developer Kgothatso Ngako built a custodial lightning wallet called Machankura. Kgothatso Ngako\n\nSouth African developer Kgothatso Ngako, who goes by KG, has integrated the Lightning Network into the GSM network, combining the best of a few worlds, in a larger effort to meet customers where they are. \"My focus is giving people without an internet connection the ability to send or receive bitcoin,\" Ngako said. KG calls his custodial Lightning wallet \"Machankura\" — South African slang for money. Whereas most Lightning transactions today require a smartphone and data, Ngako's service integrates lightning via Unstructured Supplementary Service Data, or USSD, which is the protocol that mobile money runs on. (It is similar to HTTP, or HyperText Transport Protocol, the protocol on which the web was built.) Ngako tells CNBC that he currently has around 3,000 users spread across eight countries, with a concentration in South Africa, Uganda, Kenya, and Nigeria. In his home market of South Africa, there are strict rules around currency exchange, which make his product even more appealing to some users looking to move their money abroad. \"The South African Reserve Bank regulates the cross-border flow of capital — including the exchange of currency — to and from South Africa. You need some form of approval to convert ZAR into foreign currency,\" said Ernest Marais, partner at Johannesburg law firm, Tabacks. KG's Machankura is compatible with any Lightning wallet on the planet. In practice, this means that someone with Cash App in San Francisco, for example, could instantly send bitcoin via Lightning to the phone number of someone with a data-less, basic phone living in a remote part of Uganda. Ngako's project does face some risks, including regulatory blowback. Marais tells CNBC that because the South African Reserve Bank cannot regulate the cross-border flow of cryptocurrency, it is considered to be illegal and a criminal offense — though crypto regulation largely remains nebulous across most of the continent. \"All African central banks, except for Central African Republic, have made notices stating that they don't issue bitcoin and hence they don't regulate it,\" counters Ngako, adding that a bitcoin transaction cannot be considered a cross-border exchange as bitcoin transactions aren't regulated within the central bank's institution. But the rules are confusing for everyone involved. \"The actual location of crypto assets is an anomaly. At what point does it leave the country?\" continued Marais. Ultimately, Ngako believes that once Machankura begins to scale, it will be a major driver of bitcoin adoption across the continent. To that end, Ngako is raising money and building — a common refrain among the entrepreneurs on the ground in Accra. As Dorsey said in Africa, \"More and more mass adoption will, in my belief, take away all the oxygen\" from governments attempting to control behavior through financial oppression. \"So what do we do? We build, we build, we build, we build, we build, they can't stop us. And that's what's important.\""
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDMvMjYvYml0Y29pbi1pcy1wb2lzZWQtdG8tYmxvdy11cC1hZnJpY2FzLTg2LWJpbGxpb24tYmFua2luZy1zeXN0ZW0uaHRtbNIBZ2h0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzAzLzI2L2JpdGNvaW4taXMtcG9pc2VkLXRvLWJsb3ctdXAtYWZyaWNhcy04Ni1iaWxsaW9uLWJhbmtpbmctc3lzdGVtLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 26 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin is poised to blow up Africa's $86 billion banking system - CNBC",
        "content": "watch now\n\nACCRA, Ghana — Block CEO Jack Dorsey and his top brass descended on Accra for the inaugural Africa Bitcoin Conference in December to talk about one of the most potentially disruptive and transformative alternatives to the continent's existing financial system: bitcoin. Since its inception in 2008, this unfamiliar form of money has alternatively been disdained as an absurdly complex toy for libertarian techies, a legalized form of gambling, a speculative bet to get rich quick, and a vehicle for criminals and fraudsters to obscure the origins of their ill-begotten gains. But this parallel financial system can also serve a tangible social good, offering an onramp to the financial system for people who would otherwise be left out. In countries where the vast majority of the population is unbanked, national currencies are no longer a safe store of value, remittances comprise a hefty portion of GDP, and international sanctions complicate connections to the global economy, a virtual currency that doesn't require an intermediary to approve transactions can be a vital lifeline for survival. As cryptocurrency continues to rise in prominence and becomes a growing flashpoint for regulators, Dorsey and his deputies are providing an essential counternarrative: Bitcoin brings financial power to people who would otherwise have none. \"It doesn't matter to me if the price goes down or up, because I can still use bitcoin as a vehicle to move money around the world instantaneously,\" said Mike Brock, the CEO of TBD at Block, a unit which focuses on cryptocurrency and decentralized finance. \"I can exchange dollars for bitcoin and then bitcoin for Brazilian rial. There is a market for bitcoin in every corner of the world today,\" continued Brock.\n\nA broken financial system\n\nMoving money in Africa is an expensive and complicated process. Commercial bank branch access is limited, especially for people living in remote and rural areas. Digital banking options are also limited. Tack on rampant hyperinflation, widespread government corruption, and capital controls trapping domestic cash in banks, and money can stop making sense altogether. \"If someone wants to move money to the country next door, normally, you'd have to fill up a suitcase full of cash and move it over the border,\" explains Ray Youssef, CEO of Paxful. Part of the problem stems from the continent's quasi-colonial payment framework, in which roughly 80% of cross-border payments originating from African banks are processed offshore, mostly in the U.S. or Europe. That translates to higher costs and processing times that are sometimes measured in weeks. Then there's mobile money, which has been around since the early 2000s. Think of it like an electronic wallet tied to a phone number that does not require a smartphone or data to operate. Users can pay bills and shop with their phone through SMS texting, instead of having to rely on traditional banking options. Africa's mobile money transactions rose 39% to more than $700 billion in 2021, according to data from the GSM Association, a non-profit representing mobile network operators worldwide. World Bank data shows that account ownership at a financial institution — or via a mobile money service provider — has more than doubled in the last decade, rising to 55% of adults in Sub-Saharan Africa.\n\nAn employee uses a Nokia 1200 mobile phone inside an M-Pesa store in Nairobi, Kenya, on Sunday, April 14, 2013. Trevor Snap | Bloomberg | Getty Images\n\nBut even as adoption proliferates, mobile money users don't get the perks of legacy banking, including earning interest on banked savings and building up a credit score based on a history of spending. Interoperability on the continent also remains a major issue with this alternative way of banking. \"The entire banking system in Africa is completely and utterly broken, even amongst the mobile money providers, the telcos,\" said Youssef from Paxful, a peer-to-peer crypto marketplace where users can directly buy and sell tokens with one another. \"Two thousand payment networks and only 2% of them talk to each other. That number continues to grow. It's not getting better, it's actually getting worse,\" continued Youssef. Companies like Western Union and MoneyGram offer an expansive physical network of storefronts around the world designed to move money for those who are unbanked. That cash network was extraordinarily difficult and expensive to build, which is why there aren't a lot of direct competitors. It is also why those cash transfers often incur substantial fees. Bitcoin could eliminate all these intermediaries, allowing citizens to send digital payments directly to one another, without relying on credit and without incurring multiple settlement fees along the way. \"We're going to move to a model where we can make payments without IOUs, or credit, or promises, or fiat,\" said Alex Gladstein, chief strategy officer for the Human Rights Foundation, an organization that works with activists from authoritarian regimes around the world. \"It's literally like sending a piece of gold or a $20 bill instantly somewhere else.\" \"If you can get access to the internet, you can settle bitcoin payments,\" said Brock. \"And the government can't do anything about it.\" Dorsey points to the example of what happened in Nigeria during the protests against the brutality of the country's Special Anti-Robbery Squad — a movement referred to as #EndSARS. \"The Nigerian government went to various bank corps to stop protesters from receiving money — which bitcoin made up for,\" Dorsey said in Accra. \"So our whole reason for being as a company is solving the same problem that bitcoin will ultimately solve for everyone in the world.\"\n\nwatch now\n\nMoving money on the bitcoin blockchain at its base layer has its own challenges. At times of peak demand, fees will often spike higher, and if a user is unwilling to pay a premium for the transaction, they may have to wait for more blocks of transactions to get confirmed before their transfer goes through. Bitcoin's Lightning Network helps alleviate both of those problems by slashing the cost of transactions to virtually zero and enabling nearly instantaneous cash payments around the planet – making bitcoin a more effective payment rail. This so-called \"layer two\" technology is built on top of bitcoin's main chain, in part because bitcoiners are conservative about introducing changes to the base layer, for fear of opening it up to hacks or other mischief. Yellow Card — Africa's largest centralized cryptocurrency exchange run by CEO Chris Maurice — is also looking to embed this layer two technology into the platform, in order to drive down the price of transactions to virtually zero. Currently, the exchange doesn't charge a commission for transactions, but network fees can be pretty steep when a lot of trades are happening at once. \"It'll have a pretty big impact to our customers, because a lot of them are very price sensitive,\" says Justin Poiroux, the co-founder and CTO of Yellow Card. Yellow Card's plan is still in its infancy, but Poiroux tells CNBC that he thinks the Lightning Network could ultimately provide a lot of value for its retail customers.\n\nZoom In Icon Arrows pointing outwards Bitnob CEO Bernard Parah and Cash App's crypto product lead, Miles Suter, at the Africa Bitcoin Conference in Accra, Ghana. Bernard Parah\n\nBecause Lightning offers a universal monetary language, money can travel around the world between any Lightning-enabled bitcoin wallet. Someone who uses a platform like Block's Cash App — a regulated, American financial product with 51 million monthly transacting users which integrated with the Lightning Network in Feb. 2022 — can pay any Lightning invoice in the world instantly. \"It's a new way of doing business. It's a different paradigm entirely,\" said Gladstein. The crypto product lead at Cash App, Miles Suter, believes that a big part of bitcoin's utility is how it gets around broken and convoluted payment systems that don't talk to each other. \"At Cash App in particular, we've always been really interested in taking bitcoin beyond just being seen as an investment and bringing day-to-day utility to it,\" Suter told CNBC on the sidelines of the Africa Bitcoin Conference. \"In many ways, the people on the African continent are already doing that with the tools they have,\" continued Suter.\n\nSending cash with Lightning\n\nBernard Parah is a 30-year-old entrepreneur living in Jos, Nigeria, about a five hour drive from the capital city of Abuja. He's the CEO of Bitnob, an app that lets users across Africa buy, save, and invest in bitcoin. Bitnob is SMS-based and piggybacks on the mobile money system, making it easier for people to send money directly into bank accounts and mobile money wallets in African countries. Parah recently teamed up with Strike, a Lightning Network payments platform, to launch a feature called \"Send Globally\" that allows Americans to transfer money to people living in Nigeria, Ghana, and Kenya. It uses local fiat cash on either side of the transaction, but bitcoin is used under the hood as the pipeline to jump money over the border. The end user never touches the cryptocurrency themselves. \"We're able to settle into bank accounts or mobile money accounts, without the recipients having to interact with bitcoin themselves,\" Parah tells CNBC. \"Over time, we've seen that there are still people who really don't understand how to use bitcoin; who don't care about bitcoin. What they do care about is their problems getting solved,\" continued Parah.\n\nBitnob CEO Bernard Parah and Strike CEO Jack Mallers announcing the launch of 'Send Globally' on stage at the Africa Bitcoin Conference in Accra, Ghana. Bernard Parah\n\nIt feels like a wire transfer or a Venmo payment, according to Strike CEO Jack Mallers. \"It's instant. There's no debt. There's no credit. There's no delays,\" explains Mallers. The model works because Parah and Mallers are willing to take on the liability associated with the transfer by holding cash in escrow on either end of the exchange. Once the money is received in Nigeria, Bitnob — which is a regulated entity with connections to the local banks — will take that bitcoin and turn it into their local currency. \"It's just two regulated entities communicating over the language of bitcoin and cutting out excess fees,\" said Suter. \"I think that's revolutionary.\" Mallers says that they offer more competitive foreign exchange rates by using bitcoin as a price-setting intermediary, a sort of new world reserve currency. \"The rate that we got was actually 60% better than the traditional forex market rate,\" said Mallers. \"The way to actually think about how we're achieving forex if we clear through bitcoin is, 'I have dollars. How many bitcoin can I get for my dollars? And then how many naira can I get for my bitcoin?'\" said Mallers. \"It's acting as the most liquid, accessible, global instrument for us to clear and settle value amongst each other,\" he said. The arrangement also offers a few big ancillary benefits, including interoperability with payment apps around the world that have tens of millions of users. Block's Suter explained that Cash App could theoretically interoperate with Bitnob. \"We're only live in the U.S. right now, but that doesn't mean we can't speak to Bitnob in Nigeria and transfer value instantly and for free across these borders,\" Suter said of Cash App.\n\nMeeting customers where they are\n\nZoom In Icon Arrows pointing outwards South African developer Kgothatso Ngako built a custodial lightning wallet called Machankura. Kgothatso Ngako\n\nSouth African developer Kgothatso Ngako, who goes by KG, has integrated the Lightning Network into the GSM network, combining the best of a few worlds, in a larger effort to meet customers where they are. \"My focus is giving people without an internet connection the ability to send or receive bitcoin,\" Ngako said. KG calls his custodial Lightning wallet \"Machankura\" — South African slang for money. Whereas most Lightning transactions today require a smartphone and data, Ngako's service integrates lightning via Unstructured Supplementary Service Data, or USSD, which is the protocol that mobile money runs on. (It is similar to HTTP, or HyperText Transport Protocol, the protocol on which the web was built.) Ngako tells CNBC that he currently has around 3,000 users spread across eight countries, with a concentration in South Africa, Uganda, Kenya, and Nigeria. In his home market of South Africa, there are strict rules around currency exchange, which make his product even more appealing to some users looking to move their money abroad. \"The South African Reserve Bank regulates the cross-border flow of capital — including the exchange of currency — to and from South Africa. You need some form of approval to convert ZAR into foreign currency,\" said Ernest Marais, partner at Johannesburg law firm, Tabacks. KG's Machankura is compatible with any Lightning wallet on the planet. In practice, this means that someone with Cash App in San Francisco, for example, could instantly send bitcoin via Lightning to the phone number of someone with a data-less, basic phone living in a remote part of Uganda. Ngako's project does face some risks, including regulatory blowback. Marais tells CNBC that because the South African Reserve Bank cannot regulate the cross-border flow of cryptocurrency, it is considered to be illegal and a criminal offense — though crypto regulation largely remains nebulous across most of the continent. \"All African central banks, except for Central African Republic, have made notices stating that they don't issue bitcoin and hence they don't regulate it,\" counters Ngako, adding that a bitcoin transaction cannot be considered a cross-border exchange as bitcoin transactions aren't regulated within the central bank's institution. But the rules are confusing for everyone involved. \"The actual location of crypto assets is an anomaly. At what point does it leave the country?\" continued Marais. Ultimately, Ngako believes that once Machankura begins to scale, it will be a major driver of bitcoin adoption across the continent. To that end, Ngako is raising money and building — a common refrain among the entrepreneurs on the ground in Accra. As Dorsey said in Africa, \"More and more mass adoption will, in my belief, take away all the oxygen\" from governments attempting to control behavior through financial oppression. \"So what do we do? We build, we build, we build, we build, we build, they can't stop us. And that's what's important.\""
    }
]