[
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTA1L2NyeXB0by1hZnJpY2EtZm9jdXNlZC1iaXRjb2luLW1hcmtldHBsYWNlLXBheGZ1bC1zdXNwZW5kcy1vcGVyYXRpb25z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Crypto: Bitcoin Trading Platform Paxful Suspends Operations - Bloomberg",
        "content": "Paxful, an Africa-focused Bitcoin trading platform, is indefinitely suspending its operations, the company’s co-founder, Ray Youssef, said in a statement, citing a staffing crisis and growing regulatory challenges.\n\nCustomers will be able to retrieve their funds from the Paxful wallet, he said. The peer-to-peer Bitcoin platform, whose trading volumes were more than $4 billion since launching in 2015, was popular with users in countries including Nigeria and Ghana."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTA0LTA1L3BlcnNvbmFsLXdlYWx0aC1iaXRjb2luLWRlc2VydmVzLXNvbWUtc3BhY2UtaW4teW91ci1wb3J0Zm9saW_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Personal Wealth: Bitcoin Deserves Some Space in Your Portfolio - Bloomberg",
        "content": "First, Goldman Sachs Group Inc. highlighted Bitcoin as the best-performing asset in terms of absolute and risk-adjusted returns earlier this year. Then the banking crisis happened and the largest digital coin rose to its highest price in ten months. It's enough to make even some naysayers reconsider.\n\nBut is this year’s turnaround just a short-lived bubble or evidence of the what-doesn't-kill-you-makes-you-stronger thesis? Views are all over the place. The White House put out an economic report recently slamming crypto, saying the assets don't have fundamental value; while Bitcoin bulls like ARK Investment Management CEO Cathie Wood see its climb as an affirmation of decentralization."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9taWNyb3N0cmF0ZWd5LWJ1eXMtMS0wNDUtYml0Y29pbi0xMzE3MzY3MzUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "MicroStrategy buys 1,045 Bitcoin, holds 140,000 BTC in total - Yahoo Finance",
        "content": "MicroStrategy acquired 1,045 Bitcoin for around US$29.3 million, at an average price of US$28,016 per coin, between March 24 and April 4, 2023, said Michael Saylor, MicroStrategy’s co-founder and executive chairman.\n\nSee related article: Weekly Market Wrap: Bitcoin pops above US$29,000, market shrugs off Binance legal woes\n\nThis brings MicroStrategy’s total Bitcoin holdings to 140,000 coins, acquired for approximately US$4.17 billion, bought at an average price of US$29,803 per Bitcoin, according to Saylor’s Wednesday announcement.\n\nSaylor’s announcement comes a week after MicroStrategy announced purchasing 6,555 Bitcoin for around US$150 million.\n\nBitcoin rose 0.73% in the 24 hours to 8:30 p.m. in Hong Kong, to trade at US$28,558, according to CoinMarketCap data.\n\nAs the world’s largest corporate Bitcoin holder, MicroStrategy’s Bitcoin acquisition could boost sentiment among crypto investors.\n\nSaylor stepped down from his role as CEO to become executive chairman last August, and to focus on the company’s “Bitcoin acquisition strategy and related Bitcoin advocacy initiatives.”"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXN0YW1wcy1uZnRzLWdhaW5pbmctb3JkaW5hbHMtMjI1MTUzMDU4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "'Bitcoin Stamps' NFTs Are Gaining On Ordinals - Yahoo Finance",
        "content": "There’s another wave of NFTs starting to flood the Bitcoin blockchain—and they’re not in the form of Ordinals.\n\nThe emergent STAMPS (Secure Tradeable Art Maintained Securely) protocol is proposing a different method of embedding image data into the OG blockchain, making different tradeoffs compared to the inscription technology that exploded in popularity earlier this year.\n\nRather than storing image data within prunable transaction witness data, “Bitcoin Stamps” store it directly within spendable transaction outputs.\n\n“By doing so, the data is preserved in such a manner that is impossible to prune from a full node, preserving the data immutably forever,” wrote pseudonymous Stamps creator Mike In Space on the project’s GitHub page. The developer noted that he is already in discussions with Emblem and Hiro Wallet to arrange protocol integrations, the former of which will allow users to buy and sell Stamps on OpenSea.\n\nMagic Eden’s New Bitcoin NFT Marketplace Dominates Ordinals Market\n\nAs Ordinals growth surged in early February, proponents argued that they were superior to NFTs on other platforms because they store image data within the Bitcoin blockchain. By contrast, Ethereum NFTs are usually just image pointers to centralized hosting services, which can be changed by anyone with control of the image URL.\n\nYet even Ordinals data can be pruned by choice by individual node runners, limiting the immutability and decentralization benefits of such NFTs. As such, Bitcoin Stamps go all the way, forcing nodes to store their image data across many different unspent transaction outputs (UTXOs).\n\nThe NFT is then broadcast across the network using Counterparty—an old protocol that ushered in Bitcoin images back in 2014 before the term “NFT” even existed.\n\n\n\n“They are good for the preservation of art forever by storing them securely on the strongest ledger ever devised by man backed by Proof of Work,” the creator told Decrypt via DM. He added that other services are already being built atop the STAMPS protocol, such as a Name Service by Rarity Garden.\n\nStory continues\n\nWith 11,000 NFTs Minted to Bitcoin, Are Bitcoin Maxis Coming Around?\n\nBut storing data across all Bitcoin nodes comes at a cost—quite literally. In fact, the protocol creator suggests using Stamps for lightweight “24x24 pixel, 8-color-depth PNG or GIF” files to make up for their implicit storage costs.\n\n“The constraints of this \"canvas\" are ideal for pixel art,” he wrote on GitHub. “In particular, the CryptoPunks use a native resolution of 24x24 pixels.”\n\nStamps also come with the benefit of being “semi-fungible”: they can be issued as “1 of 1” or “1 of many” digital assets. Trevor.btc on Twitter, host of The Ordinals Show, recognized this feature as similar to the Ethereum ERC-1155 multi-token standard, and as a reason for their remarkably fast growth.\n\nThe Stamps website shows that over 8,300 Stamps have been minted since their launch on March 7, compared to under 500 Ordinals within the same time period after their launch.\n\nThat said, the number of Ordinals on Bitcoin only continues to grow, now standing at over 910,000 inscriptions to date, according to Dune Analytics. Major brands including Bored Ape Yacht Club and Bugatti have already adopted the tech."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jYXRoZWRyYS1iaXRjb2luLWFubm91bmNlcy1ib2FyZC1kaXJlY3RvcnMtMTEzMDAwMTgwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 05 Apr 2023 07:00:00 GMT",
        "title": "Cathedra Bitcoin Announces Board of Directors Change - Yahoo Finance",
        "content": "TORONTO, April 05, 2023--(BUSINESS WIRE)--(Block Height: 783,963) – Cathedra Bitcoin Inc. (TSX-V: CBIT; OTCQX: CBTTF) (\"Cathedra\" or the \"Company\"), a Bitcoin company that develops and operates world-class bitcoin mining infrastructure, today announces the resignation of Roy Sebag from the Company’s board of directors (the \"Board\") effective April 4, 2023. President and Chief Operating Officer Drew Armstrong, who has also served on the Board since September 2021, will assume the role of Chairman. The Board has begun searching for a replacement for Mr. Sebag and hopes to provide an update in short order. Until such time, the Board shall consist of Drew Armstrong (Chairman and President), AJ Scalia (Chief Executive Officer), David Jaques (independent), and Marcus Dent (independent).\n\nStatement from Roy Sebag:\n\n\"Due to other business and personal demands on my time, I have decided to vacate my position as Chairman of the Board of Cathedra. My activity at the Company has naturally diminished into a less active role than in the 2018-2021 period, particularly since Marcus Dent, AJ Scalia, and Drew Armstrong joined the Board and AJ and Drew took the reins as management in Q3 2021.\n\nThough I will no longer serve on the Board, I will continue to be an advocate for the Company. I remain the largest individual shareholder and Cathedra is the most promising investment I have in the space. If I had any doubts about the Company’s prospects, I would not have made this decision. Indeed, it is my confidence in the existing Board along with the management team which gives me peace of mind as a long-term shareholder.\n\nI have enjoyed my time on the Board and would like to thank my fellow directors for their diligent work over the past few years.\"\n\nStatement from Drew Armstrong:\n\n\"We thank Roy for his service during his five-year tenure at Cathedra. Roy’s vision and prudence have directly benefited shareholders, employees, and partners alike. We look forward to Roy’s continued support as a shareholder. The Board has begun working to fill the vacant independent director seat with a worthy replacement and will update the market in due time.\"\n\nStory continues\n\nAbout Cathedra Bitcoin\n\nCathedra Bitcoin Inc. (TSX-V: CBIT; OTCQX: CBTTF) is a Bitcoin company that develops and operates world-class bitcoin mining infrastructure.\n\nCathedra believes sound money and abundant energy are the fundamental ingredients to human progress and is committed to advancing both by working closely with the energy sector to secure the Bitcoin network. Today, Cathedra’s diversified bitcoin mining operations total 247 PH/s and span three states and five locations in the United States. The Company is focused on expanding its portfolio of hash rate through a diversified approach to site selection and operations, utilizing multiple energy sources across various jurisdictions.\n\nFor more information about Cathedra, visit cathedra.com or follow Company news on Twitter at @CathedraBitcoin or on Telegram at @CathedraBitcoin.\n\nCautionary Statement\n\nTrading in the securities of the Company should be considered highly speculative. No stock exchange, securities commission or other regulatory authority has approved or disapproved the information contained herein. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\n\nForward-Looking Statements\n\nThis news release contains certain \"forward-looking information\" within the meaning of applicable Canadian securities laws that are based on expectations, estimates and projections as at the date of this news release. The information in this release about future plans and objectives of the Company, are forward-looking information. Other forward-looking information includes but is not limited to information concerning: the Debt Settlement, the approval of the TSXV, the intentions and future actions of senior management, the intentions, plans and future actions of the Company, as well as the Company’s ability to successfully mine digital currency; revenue increasing as currently anticipated; the ability to profitably liquidate current and future digital currency inventory; volatility of network difficulty and, digital currency prices and the resulting significant negative impact on the Company’s operations; the construction and operation of expanded blockchain infrastructure as currently planned; and the regulatory environment of cryptocurrency in applicable jurisdictions.\n\nAny statements that involve discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions, future events or performance (often but not always using phrases such as \"expects\", or \"does not expect\", \"is expected\", \"anticipates\" or \"does not anticipate\", \"plans\", \"budget\", \"scheduled\", \"forecasts\", \"estimates\", \"believes\" or \"intends\" or variations of such words and phrases or stating that certain actions, events or results \"may\" or \"could\", \"would\", \"might\" or \"will\" be taken to occur or be achieved) are not statements of historical fact and may be forward-looking information and are intended to identify forward-looking information.\n\nThis forward-looking information is based on reasonable assumptions and estimates of management of the Company at the time it was made, and involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by such forward-looking information. The Company has also assumed that no significant events occur outside of the Company’s normal course of business. Although the Company has attempted to identify important factors that could cause actual results to differ materially, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. The Company undertakes no obligation to revise or update any forward-looking information other than as required by law.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20230405005308/en/\n\nContacts\n\nMedia and Investor Relations Inquiries\n\nSean Ty\n\nChief Financial Officer\n\nir@cathedra.com"
    }
]