[
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jbmJjLmNvbS92aWRlby8yMDIzLzAzLzE0L2JpdGNvaW4tbmVhcnMtMjYwMDAtYmluYW5jZS1oYWx0cy1kZXBvc2l0cy13aXRoZHJhd2Fscy11ay1jdXN0b21lcnMtY25iYy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin nears $26,000, and Binance halts UK customer deposits and withdrawals - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin nears $26,000, and Binance halts UK customer deposits and withdrawals: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Sid Powell, CEO and co-founder of Maple, breaks down what's next for institutions following the demise of the two main banks for the crypto industry."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jbmJjLmNvbS92aWRlby8yMDIzLzAzLzE0L2JpdGNvaW4tbmVhcnMtMjYwMDAtYmluYW5jZS1oYWx0cy1kZXBvc2l0cy13aXRoZHJhd2Fscy11ay1jdXN0b21lcnMtY25iYy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin nears $26,000, and Binance halts UK customer deposits and withdrawals - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin nears $26,000, and Binance halts UK customer deposits and withdrawals: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Sid Powell, CEO and co-founder of Maple, breaks down what's next for institutions following the demise of the two main banks for the crypto industry."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTQtbWFyY2gtMjAyMy9hcnRpY2xlc2hvdy85ODYyODEyOC5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTE0LW1hcmNoLTIwMjMvYW1wX2FydGljbGVzaG93Lzk4NjI4MTI4LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin above $24,500; Ethereum, Litecoin rise up to 5% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: Taking their gaining streak for the second straight day, the cryptocurrency markets were trading higher in Tuesday's trade. Bitcoin (BTC) rose 9.25% to $24,514 whereas Ethereum (ETH) was above the $1,650 level. BTC volume stood at approximately $48.26 billion, rising 39.89% in the last 24 hours.Meanwhile, the global cryptocurrency market cap was trading higher around $1.08 trillion, rising 5.11% in the last 24 hours.\"In the last 24 hours, Bitcoin experienced a surge of almost 10%, surpassing the US$24,000 mark, following the announcement that U.S. regulators have backed Silicon Valley Bank and Signature Bank. This news has given investors, and traders hope that the banking sector's recent near meltdown will prompt the Federal Reserve to ease its monetary hawkishness. As a result, BTC has risen above a floor and reached a two-week high,\" Edul Patel, Co-founder and CEO at Mudrex, said.Other top crypto tokens were also trading higher. Dogecoin , Solana, Polygon and Polkadot were trading over 3% higher.The total volume in DeFi is currently 8.03 billion, 8.83% of the total crypto market 24-hour volume. The volume of all stablecoins is now $86.66 billion, which is 95.29% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $473 billion. Bitcoin’s dominance is currently 43.70%, an increase of 1.41% over the day, according to CoinMarketCap.\"The next major level for BTC to break is $25,300 post which $28,000 will be on the cards. BTC dominance has surged to over 43% today, indicating that investors are choosing BTC over altcoins in the short term. Some volatility is expected this week as US CPI data comes through tomorrow,\" Vikram Subburaj, CEO of Giottus Crypto Platform said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 61.68, with a neutral outlook. The Stochastic %K (14, 3, 3) indicates a Neutral outlook at 81.95 and the Average Directional Index (14) at 22.36 indicates Buy.\"\"The MACD Level (12, 26), at −88.41, indicates a Buy, contrary to previous day’s prediction. The Stochastic RSI Fast (3, 3, 14, 14) and the Williams Percent Range (14) continue to be Neutral at 93.02 and −5.03 respectively,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.48 hours, IST on March 14, 2023)Bitcoin $24,514 9.25%Ethereum $1,682 4.92%Tether $1 0.03%BNB $307.69 1.15%XRP $0.3712 0.58%Cardano $0.3447 1.71%Polygon $1.18 3.75%Dogecoin $0.07285 3.13%Solana $20.45 3.90%Polkadot $6.17 4.04%Tron $0.0671 -1.99%Shiba Inu $0.00001111 2.38%Litecoin $81.27 4.20%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTQtbWFyY2gtMjAyMy9hcnRpY2xlc2hvdy85ODYyODEyOC5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTE0LW1hcmNoLTIwMjMvYW1wX2FydGljbGVzaG93Lzk4NjI4MTI4LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin above $24,500; Ethereum, Litecoin rise up to 5% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: Taking their gaining streak for the second straight day, the cryptocurrency markets were trading higher in Tuesday's trade. Bitcoin (BTC) rose 9.25% to $24,514 whereas Ethereum (ETH) was above the $1,650 level. BTC volume stood at approximately $48.26 billion, rising 39.89% in the last 24 hours.Meanwhile, the global cryptocurrency market cap was trading higher around $1.08 trillion, rising 5.11% in the last 24 hours.\"In the last 24 hours, Bitcoin experienced a surge of almost 10%, surpassing the US$24,000 mark, following the announcement that U.S. regulators have backed Silicon Valley Bank and Signature Bank. This news has given investors, and traders hope that the banking sector's recent near meltdown will prompt the Federal Reserve to ease its monetary hawkishness. As a result, BTC has risen above a floor and reached a two-week high,\" Edul Patel, Co-founder and CEO at Mudrex, said.Other top crypto tokens were also trading higher. Dogecoin , Solana, Polygon and Polkadot were trading over 3% higher.The total volume in DeFi is currently 8.03 billion, 8.83% of the total crypto market 24-hour volume. The volume of all stablecoins is now $86.66 billion, which is 95.29% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $473 billion. Bitcoin’s dominance is currently 43.70%, an increase of 1.41% over the day, according to CoinMarketCap.\"The next major level for BTC to break is $25,300 post which $28,000 will be on the cards. BTC dominance has surged to over 43% today, indicating that investors are choosing BTC over altcoins in the short term. Some volatility is expected this week as US CPI data comes through tomorrow,\" Vikram Subburaj, CEO of Giottus Crypto Platform said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 61.68, with a neutral outlook. The Stochastic %K (14, 3, 3) indicates a Neutral outlook at 81.95 and the Average Directional Index (14) at 22.36 indicates Buy.\"\"The MACD Level (12, 26), at −88.41, indicates a Buy, contrary to previous day’s prediction. The Stochastic RSI Fast (3, 3, 14, 14) and the Williams Percent Range (14) continue to be Neutral at 93.02 and −5.03 respectively,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.48 hours, IST on March 14, 2023)Bitcoin $24,514 9.25%Ethereum $1,682 4.92%Tether $1 0.03%BNB $307.69 1.15%XRP $0.3712 0.58%Cardano $0.3447 1.71%Polygon $1.18 3.75%Dogecoin $0.07285 3.13%Solana $20.45 3.90%Polkadot $6.17 4.04%Tron $0.0671 -1.99%Shiba Inu $0.00001111 2.38%Litecoin $81.27 4.20%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAzLzE0L2lzLWJpdGNvaW4tYS1zYWZlLWhhdmVuLWFzc2V0LW5vdy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Mar 2023 07:00:00 GMT",
        "title": "Is Bitcoin a Safe-Haven Asset Now? Recent Data and Market Experts Say Yes - The Motley Fool",
        "content": "Bitcoin (BTC 1.63%) has been a hot topic in the financial world for years, with opinions about the cryptocurrency running the gamut from a \"revolutionary new asset class\" to a \"dangerous speculative bubble.\" One thing that most experts can agree on, however, is that its volatility has historically made it a less-than-ideal safe-haven asset. But recent market movements seemed to have changed that tune. There are fewer sad trombones and more sparkly vibraphone grooves in the Bitcoin canticle nowadays.\n\nBut is the cryptocurrency really ready to serve as a long-term vault for your hard-earned wealth? Let's look closer at Bitcoin's suitability for that august role in light of recent data and expert analyses.\n\nWhat's going on?\n\nBitcoin has been on a tear since the beginning of 2023, rising 45% since the start of the year. On the other hand, the S&P 500 (^GSPC -0.19%) index is up by a mere 0.8% over the same period, and gold has gained 2.6%.\n\nZooming out to a three-year view, you'll find that Bitcoin has outperformed the traditional safe havens of gold and broad stock market indexes again. This time, gold is up by 19%. The S&P 500's dividend-adjusted total return stops at 49%. Over the same span, Bitcoin soared 367% higher.\n\nAnd if you allow me to go back six years instead, incorporating the surge of 2017 and the 2018 crypto winter into the data, we can see how a $10,000 investment in Bitcoin has performed against gold and the S&P 500 since the spring of 2017:\n\nOf course, past performance is not a reliable indicator of future results. Bitcoin is notoriously volatile, and its value could plummet just as quickly as it has risen. The chart above, impressive as it is, also shows many dramatic price drops over the years.\n\nBut it seems that Bitcoin has finally established itself as a contender in the category of safe-haven assets. As investors seek out alternatives to traditional value stores, like precious metals or diverse stock market indexes, Bitcoin's unique characteristics and limited supply could make it an attractive option for those looking to protect their wealth against inflation and currency fluctuations.\n\nAnd that's right in line with the original intentions of Satoshi Nakamoto, Bitcoin's unknown inventor (or group of inventors). The cryptocurrency was designed to resist inflation through a lifetime maximum of 21 million digital coins, and 19.3 million of them are already minted. This capped long-term supply is similar to the limited amount of gold on the planet, which is why Bitcoin bulls often refer to it as \"digital gold.\"\n\nExpert analysis\n\nDespite its volatility, some market experts believe that Bitcoin could continue to serve as a safe-haven asset in the future. Beyond the gold-like supply-and-demand equation, some Bitcoin gurus point to the growing interest from institutional investors and large corporations. As a result, the cryptocurrency may be becoming more mainstream and accepted as a legitimate asset class.\n\nIn fact, companies like Tesla (TSLA -4.54%) and Block (SQ 4.91%) have even added Bitcoin to their balance sheets, further signaling their confidence in the cryptocurrency. Taking that idea to its next logical step, business software builder MicroStrategy (MSTR 10.85%) has converted most of its cash reserves into Bitcoin -- and keeps buying more coins financed by a combination of cash flows, loans, and stock sales.\n\ndeVere Group CEO Nigel Green calls the current banking crisis a \"springboard event\" for Bitcoin as traditional-minded investors start to treat the digital asset as a safe port in the storm. The financial shake-up may inspire others to follow in the steps of Tesla, Block, and MicroStrategy. Massive long-term inflation of the U.S. dollar is a critical part of this scenario: \"Investors are therefore looking for alternative currencies, such as cryptocurrencies,\" Green writes in a recent press release. \"Moving forward, these will increasingly compete with traditional, fiat ones, and this will help trigger the decreasing dominance of currently leading international currencies.\"\n\nWhat's next for Bitcoin holders with \"diamond hands\"?\n\nNobody knows for sure where Bitcoin is going next. The crypto winter may be thawing as we speak, or another cold snap could bring Bitcoin prices down again in 2023.\n\nBut I think it's abundantly clear by now that cryptocurrencies are here to stay, and that Bitcoin will probably be a reliable store of wealth for many years. MicroStrategy chairman Michael Saylor may be onto something after all. Truly committed Bitcoin bulls with diamond hands should see stellar results a few years down the road.\n\nThat being said, I still don't want to convert my entire net worth into Bitcoin and take out loans to buy more. Leave that to the professional risk-takers for now. Instead, I'm happy with a modest Bitcoin position that could serve me well in the long run without adding much short-term risk. It's a good place to park cash you won't need for at least a year or two, allowing Bitcoin to get over speed bumps and challenges on the road to sustained wealth. In fact, that's how I think about all investments. Saintly patience is arguably the best quality an investor could have. Just ask Warren Buffett or Peter Lynch."
    }
]