[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDkvMDEvc2VjLWRlbGF5cy1kZWNpc2lvbi1zcG90LWJpdGNvaW4tZXRmcy1ibGFja3JvY2stZmlkZWxpdHktY3J5cHRvLXdvcmxkLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "SEC delays decision on spot bitcoin ETFs from BlackRock, WisdomTree and more - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nSEC delays decision on spot bitcoin ETFs from BlackRock, WisdomTree and more: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Paul Brody, global blockchain leader at EY, discusses his new book on how companies can implement Ethereum's blockchain."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMDEvc2VjLWRlbGF5cy1kZWNpc2lvbi1vbi1zcG90LWJpdGNvaW4tZXhjaGFuZ2UtdHJhZGVkLWZ1bmRzLmh0bWzSAWJodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wOS8wMS9zZWMtZGVsYXlzLWRlY2lzaW9uLW9uLXNwb3QtYml0Y29pbi1leGNoYW5nZS10cmFkZWQtZnVuZHMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "SEC delays decision on spot bitcoin exchange-traded funds. What that means for investors - CNBC",
        "content": "Even as the U.S. Securities and Exchange Commission delays a decision on several applications for the first spot bitcoin exchange-traded fund, many in the crypto industry are still feeling optimistic for a future blessing from the agency.\n\nSEC filings dated Aug. 31 indicated the agency would give itself until mid-October to make decisions on several applications. But another extension could be possible, experts say.\n\nThe update came two days after a federal appeals court sided with Grayscale in a lawsuit against the SEC for denying its application to convert the Grayscale Bitcoin Trust to an ETF.\n\n\"It is clear that bitcoin is something that retail investors want access to,\" former SEC chair Jay Clayton said on CNBC's \"Squawk Box\" on Friday, noting that \"an approval is inevitable.\"\n\nMore from Personal Finance:\n\nStudent loan interest resumes — what that means for borrowers\n\n63% of workers unable to pay a $500 emergency expense, survey finds\n\nThe job market is 'normalizing,' economist says — what that means for workers\n\nThe Grayscale ruling isn't necessarily a green light for a spot bitcoin ETF, said Bryan Armour, director of passive strategies research at Morningstar. But pending applications from Blackrock , Fidelity and others \"have increased the probability overall.\"\n\nU.S. investors currently have access to bitcoin futures ETFs, which invest in bitcoin futures contracts, or agreements to buy or sell the asset later for an agreed-upon price. The long-awaited bitcoin spot ETF, however, would invest in the digital currency directly."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzhjODQ0NGI4LTAwMjAtNDA2NC04N2U3LTM4NTkxNTk0NGNjMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin price slides after SEC pushes back ETF approvals - Financial Times",
        "content": "Print this page\n\nThe price of bitcoin sank 5 per cent after regulators deferred approvals of the first US exchange traded funds that invest directly in the cryptocurrency, damping investors hopes for a speedy route to the world’s largest capital market.\n\nThe US Securities and Exchange Commission said late on Thursday in a series of filings that it needed more time to consider seven bitcoin ETF applications, including one from BlackRock, the world’s largest asset manager.\n\nThe fall in the price of bitcoin meant the token had unwound most of the gains it had made after a Washington court this week ruled the agency had been wrong to reject an application by asset manager Grayscale to turn its flagship vehicle, Grayscale Bitcoin Trust, into an ETF.\n\nThe court ruling has put pressure on the SEC to relent from a decade-long policy of refusing ETFs based directly on the controversial token. Crypto advocates have long called for a spot bitcoin ETF, arguing it offers consumers a cheap and safe way to trade the coin, instead of buying it directly from unregulated crypto exchanges.\n\nDemand for a spot bitcoin ETF has grown this year and more traditional players have attempted to break into the sector. Fidelity, WisdomTree, Invesco Galaxy, VanEck, Bitwise and Valkyrie Digital Assets also had their applications for a spot bitcoin ETF delayed on Thursday.\n\nBut the regulator has argued that it cannot offer investors reassurance that the bitcoin market is not prone to being manipulated. Gary Gensler, chair of the SEC, in July called the crypto market “rife with fraud, rife with hucksters”. Even so, the SEC has approved bitcoin futures ETFs, which track the price of futures linked to the cryptocurrency.\n\nThe Washington court has forced the SEC to review its approach to bitcoin ETFs. It has 45 days to decide whether to abide by the court decision, ask a court to review it or make a direct appeal. The SEC said it was “reviewing the court’s decision to determine next steps”. The regulator is expected to make its decisions on spot bitcoin ETFs in mid-October.\n\n“We believe it is quite feasible that the SEC will craft alternative arguments to justify continued rejections of spot bitcoin ETF applications based on concerns specific to the spot bitcoin market,” said Mark Palmer, an analyst at Berenberg Capital Markets.\n\nHe pointed out that the involvement of Coinbase in the ETF filings further complicated the issue. Coinbase has proposed surveillance-sharing agreements with the regulated exchanges hosting the potential ETF listings, CBOE Global Markets and Nasdaq. Earlier this year the regulator sued Coinbase for allegedly violating US securities laws.\n\n“We would not be surprised if [Coinbase’s] potential involvement in those ETFs were to serve as part of the SEC’s reconfigured arguments for rejecting the applications,” added Palmer.\n\nHowever, lawyers suggest a fresh round of rejections citing new concerns will be a challenge for the SEC, which has long justified its opposition to these products on market manipulation grounds.\n\n“In theory, they could try to oppose these applications on other grounds but for years they’ve put all their eggs in the basket of there not being a sufficiently regulated market to trade cryptocurrencies, and the court resoundingly rejected the SEC’s argument for that,” said Jeremy Senderowicz of law firm Vedder Price."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zZWMtZGVsYXlzLXZlcmRpY3QtYmxhY2tyb2NrLWV0Zi0xMjAwMDA0MzguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "SEC delays verdict on BlackRock's ETF application; Will Bitcoin ETFs see light of day? - Yahoo Finance",
        "content": "The U.S. Securities and Exchange Commission (SEC) on Thursday postponed its decisions on seven Bitcoin exchange-traded fund (ETF) proposals, including one submitted by BlackRock, the world’s largest asset manager.\n\nSeven firms — BlackRock, WisdomTree, Invesco Galaxy, Wise Origin, VanEck, Bitwise and Valkyrie Digital Assets — published ETF applications in the Federal Register on July 19. The SEC was scheduled to rule on all seven applications by Sept. 4. However, the regulator postponed by 45 days meaning the seven firms will now have to wait until mid-October for a decision.\n\n“We fully expected delays on this round of spot Bitcoin ETF filings. Would have been a shock if they were approved this week,” James Seyffart, research analyst at Bloomberg Intelligence, tweeted on Friday.\n\nTo the frustration of those in the crypto industry, the SEC can delay its verdict on ETF proposals for a maximum of 240 days, or about six months. The federal agency had already delayed its deadline on the proposal from Cathie Wood’s Ark Investment Management on Aug 11.\n\nThe SEC’s latest decision comes days after the District of Columbia Court of Appeals sided with Grayscale Investments, the manager of the world’s largest Bitcoin fund, the Grayscale Bitcoin Trust (GBTC). The court overturned an earlier SEC decision preventing GBTC’s conversion into a spot Bitcoin ETF.\n\nDistrict Court Judge Neomi Rao called the SEC’s denial of Grayscale’s proposal “arbitrary” and “capricious” in the review of the petition because the agency failed to clearly explain what distinguishes spot Bitcoin ETFs from already-listed futures ETFs.\n\nGrayscale argued in an October 2022 legal update posted on its website that the SEC did not provide clear explanations for the rejection, violating the Administrative Procedure Act. The company also stated that the SEC decision was inconsistent with its approvals of Bitcoin futures ETFs.\n\nDespite the SEC postponing the latest series of applications, Nigel Green, founder of financial management group deVere, said in a statement that Grayscale’s victory now makes spot Bitcoin ETFs in the U.S. an “inevitability.”\n\nStory continues\n\n“The court’s decision destroys the SEC’s central argument for rejecting every spot Bitcoin ETF over the last few years. This win paves the way for Bitcoin ETFs,” Green said.\n\nGeorgetown University’s McDonough School of Business professor James Angel said before the court’s decision that the SEC may even want to lose the Grayscale case, forcing them to allow all the ETF applications currently pending.\n\n“This would take the blame away from the SEC if and when Bitcoin has another crash or another crypto ice age,” Angel said.\n\nBitcoin’s price rollercoaster pause\n\nThe news of Grayscale’s win triggered a surge in crypto prices. Bitcoin grew 7% shortly after the news to above US$28,000 on Tuesday. But the SEC’s subsequent delay in the seven other cases Thursday poured cold water on the sector, triggering a downturn to below US$26,000. Bitcoin fell 4.62% in the past 24 hours to US$25,988 at 3:45 p.m. on Friday in Hong Kong.\n\nThe sharp price swings reflect the industry’s interest in Bitcoin ETFs. Ric Edelman, founder of the U.S.-based think tank Digital Assets Council of Financial Professionals, said that a green light from the SEC, if given, would cause an even greater upswing in crypto prices.\n\n“Around half of the nation’s financial advisors in the United States personally own Bitcoin, but only 12% are recommending Bitcoin to their clients,” said Edelman. “And the primary reason that advisors are not recommending Bitcoin is because there isn’t an ETF.”\n\n“Those advisors manage about US$8 trillion in investor assets,” he added.\n\nHowever, Georgetown’s James Angel said that a spot Bitcoin ETF win will not be a long-term growth factor for the crypto market.\n\n“Investors already have an almost identical product with the futures-backed ETF, so I don’t see a big long-term impact,” said Angel. “There will clearly be an emotional short-term rally when the approval comes out, but that will get lost in the noise in the long-term.”\n\nSean Stein Smith, professor of economics at the City University of New York and founder of the Institute for Blockchain & Cryptoasset Research, said that the approval of spot Bitcoin ETFs will have a positive impact on the wider crypto industry.\n\n“[Spot Bitcoin ETFs] will open the proverbial door for more product approvals and launches, including those that are related to Bitcoin as well as other crypto assets,” Smith added.\n\nSo when will investors have access to spot Bitcoin ETFs from investment giants like BlackRock, Fidelity and Invesco?\n\nTaking account of different possibilities and factors, it is more likely we’ll see a batch of ETFs approved in the early half of next year, said Julian Klymochko, founder and CEO of Calgary-based investment solutions firm Accelerate.\n\n“I think a spot Bitcoin ETF in the U.S. is a 2024 story. When in 2024 they’ll launch, it’s to be seen, but I wouldn’t be surprised to see it in the first or second quarter,” said Klymochko. “I think that things are going to be moving quickly. There are many, many companies that have applied for a spot Bitcoin ETF, so it’s certainly going to be a battle.”\n\nCrypto wild west: SEC sheriff’s rules\n\nThe series of spot Bitcoin ETF applications from major U.S. firms was submitted in the midst of an ongoing crypto crackdown. Increased scrutiny over the industry by the SEC is based on the regulator’s claim that most cryptocurrencies other than Bitcoin are securities. The federal agency sued Coinbase and Binance.US in July on the basis that the two exchanges offer unregistered securities in the form of cryptocurrencies.\n\nMore recently, the SEC made its first enforcement action against non-fungible tokens (NFTs), charging media company Impact Theory with offering unregistered securities in the form of NFTs on Monday.\n\nSEC Chair Gary Gensler, who has emerged as the crypto industry’s main bogeyman, said at a Senate Appropriations Financial Services subcommittee hearing in Washington D.C. in July that the “Wild West” of crypto is “rife with noncompliance.”\n\nGustavo Schwenkler, professor of finance at Santa Clara University, said that Gensler and the SEC have reason to be concerned.\n\n“The existing ETFs track derivatives that are traded on strictly regulated derivatives exchanges. There are not that many derivatives exchanges that are closely monitored by the regulator,” said Schwenkler. “A spot Bitcoin ETF would track the Bitcoin price that is available across global crypto exchanges. There are a lot of them and many are not well regulated.”\n\nHowever, Megan Enright, spokesperson for Swiss digital asset manager 21Shares, said that “material changes” in the market over the past year or so mean that it is now better prepared for ETFs than it was in the past.\n\n“The market has matured, there is additional data supporting the efficiency of these markets and there are new surveillance sharing agreements that are being established between major crypto markets and traditional exchanges,” Enright added.\n\nIn April, 21Shares refiled its application for a spot Bitcoin ETF in the U.S. with its partner, Ark Invest."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzVhOTBiMWFiLWU5ZmMtNDYyMC1hZWI3LTZkMDA5NWVmY2E4ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Sep 2023 07:00:00 GMT",
        "title": "Grayscale faces ETF war after winning bitcoin battle - Financial Times",
        "content": "Print this page\n\nHello and welcome to the latest edition of the FT Cryptofinance newsletter. This week, we’re taking a look at Grayscale’s victory in the US courts.\n\nMany previous editions of this newsletter have covered regulators punching at every corner of the crypto industry, from the largest crypto exchange to obscure lines of code.\n\nThis week, the tables turned.\n\nAsset management firm Grayscale, which holds roughly $17bn in bitcoin, won a landmark case against the Securities and Exchange Commission when a Washington DC court ruled that the regulator was wrong to reject the company’s application to convert its flagship product into a bitcoin-backed exchange traded fund.\n\nA spot bitcoin ETF has become something of a crypto holy grail — a way to trade bitcoin that is cheap, safe and wrapped in a well-understood regulatory wrapper. To say the crypto market was delighted is an understatement.\n\n“An SEC-regulated bitcoin ETF would unlock the next generation of crypto adoption, allowing trillions in institutional capital to come off the sidelines,” said Diogo Mónica, co-founder and president of Anchorage Digital.\n\nBitcoin leapt roughly 7 per cent after the ruling. I’d say such excitement over the prospect of a spot bitcoin exchange traded fund potentially happening at some point in the future, is a reflection of the failings of that global financial revolution bitcoin’s founder promised 14 years ago.\n\nStill, the victory is a rare oasis of optimism for a space so often set back by scandals. Potentially great for the industry, but at what cost to Grayscale?\n\nEven before the hard-charging Gary Gensler became chair of the SEC, the agency had a consistent record of punting applications to launch a bitcoin spot ETF.\n\nSome have had specific reasons but the SEC has long argued the asset that underlies it all — bitcoin — trades on largely unregulated exchanges that may be susceptible to market manipulation.\n\nGrayscale won because it focused on the SEC’s weak spot — that the regulator had given the green light to bitcoin ETFs that track futures on the token, traded on the CME.\n\nFutures and their underlying assets are closely linked. While the CME can attest to the orderliness of its own market and the way prices are formed and fed into it, the underlying market can still be manipulated. Market makers arbitraging prices just help close the gap.\n\nThe judge, Neomi Rao, agreed that this stance was odd and called the denial of Grayscale’s application “arbitrary and capricious”. The ruling didn’t permit a spot bitcoin ETF, and only told the SEC to go away and rethink its justifications for its denial.\n\nBut while Grayscale has been fighting it out in court, others have been banging on the SEC’s door this summer with their own bitcoin ETF applications. They include BlackRock — the largest money manager in the world — and other household names such as WisdomTree and Fidelity.\n\nShould the ruling finally open the door to spot bitcoin ETFs, Grayscale is likely to be up against a host of household ETF names in the battle for customers. None of them come associated with the crypto crash of 2022.\n\n“Retail investors and institutions alike may be attached to bigger names. If so, Grayscale made the legal investments to win this case, but having knocked the door down their competitors may walk right through it, marching on Grayscale’s back in the process,” Peter Fox, partner at Scoolidge, Peters, Russotti & Fox, told me over the phone.\n\nMore importantly, these rivals are all very accustomed to serious price competition. Grayscale earns a 2 per cent management fee on the bitcoin it holds — at present worth about $17bn. BlackRock, Invesco, etc are used to charging fractions of that total.\n\nOthers, such as Jeremy Senderowicz of law firm Vedder Price, are more optimistic. “Grayscale has a pretty established name for bitcoin products and they’re staring off with an asset base in their fund that nobody else has,” he told me, referring to the fact that Grayscale is one of the largest holders of bitcoin on the planet.\n\nBut it’s not hard to imagine the likes of BlackRock quickly scooping up their own stash of coins, either. It’s also important to remember the court’s decision does not by any stretch compel the SEC to approve Grayscale’s application: however unlikely, the regulator could revert with an entirely new rationale to reject the company’s ETF ambitions all over again.\n\nOvernight the SEC again deferred all the main spot bitcoin ETF applications filed this summer.\n\nStill, the expectation is growing that spot bitcoin ETFs will make landfall in the US at some point.\n\nIf and when the day comes, the SEC will probably approve several ETFs at once, rather than granting one player a potentially unassailable first-mover advantage.\n\n“That means this becomes a market share game. So on percentage share and take-rate, Grayscale revenues should decline significantly,” Ram Ahluwalia, chief executive of investment adviser Lumida Wealth Management, told me.\n\nWhat’s your take on Grayscale’s court victory over the SEC? As always, email me at scott.chipolina@ft.com.\n\nWeekly highlights\n\nDespite a setback in ETF land, the SEC’s push against all crypto-related activity continues unabated. On Monday it charged media and entertainment company Impact Theory LLC with conducting an unregistered offering of crypto asset securities in the form of non-fungible tokens. The company agreed to a cease-and-desist order without admitting or denying the SEC’s findings.\n\nOn Thursday industry giant Binance said it would “gradually” cease support for BUSD products, advising users to convert into other stablecoins before February 2024. The news doesn’t come as a surprise after New York regulators halted further issuance of the coin in February this year, but it serves as a reminder of the impact of regulatory action: Binance’s share of the crypto trading market has fallen from roughly 57 per cent to 38 per cent following the New York Department of Financial Services aiming its crosshairs on BUSD.\n\nSoundbite of the week: Crypto gets its latest cheerleader\n\nCrypto has a new high-profile political supporter: Vivek Ramaswamy. The biotech entrepreneur turned Republican presidential candidate has made waves for describing the climate “agenda” as a “lie”, and outlandish promises to fire 75 per cent of all US federal government employees.\n\nRamaswamy took to social media platform X this week to celebrate Grayscale’s victory in court over the SEC, suggesting the federal courts (presumably he’d like to keep those running) as the only defence against overreaching agencies such as the SEC.\n\n“The shadow government in D.C. is out of control & the federal courts are our *only* remaining line of defence against the unlawful rogue behaviours of 3-letter government agencies. This decision is strong and clears a path to keep Bitcoin & blockchain innovation in the US instead of overseas.”\n\nData mining: Grayscale added over $1bn in AUM after court victory\n\nGrayscale’s flagship vehicle, Grayscale Bitcoin Trust, added nearly $1.2bn in assets under management on August 29 and 30 following the asset manager’s victory in the courts. That added 7 per cent to its total, bringing it to $17.4bn in assets under management, according to figures from provider CCData.\n\nStill, that was only a minor ray of sunshine in a poor August. The digital asset market had a 12 per cent decline in assets under management last month, to $29.7bn. Grayscale itself was managing more than $18bn only two weeks ago.\n\n\n\nFT Cryptofinance is edited by Philip Stafford. Please send any thoughts and feedback to cryptofinance@ft.com."
    }
]