[
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTA3L2JpdGNvaW4tYnRjLWJvdW5jZS1mcm9tLXNlYy1ibG93LXNpZ25hbHMtbW9yZS1nYWlucy1pZi1oaXN0b3J5LXJpZ2h00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin's Bounce From Turbulence Sparked by SEC Suits Signals More Gains if History Is Right - Bloomberg",
        "content": "A bout of Bitcoin turbulence caused by US Securities and Exchange Commission lawsuits against key crypto exchanges may be a precursor to short-term gains in the token, if history is any guide.\n\nThe largest digital asset sank more than 5% on Monday, before recovering over 5% on Tuesday, as investors digested the agency’s actions first against Binance Holdings Ltd. and then Coinbase Global Inc."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDYvMDcvdGVjaG5vbG9neS9jcnlwdG8tZmlybXMtc3RhcnQtbG9va2luZy1hYnJvYWQtYXMtdXMtY3JhY2tzLWRvd24uaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Crypto Firms Start Looking Abroad as U.S. Cracks Down - The New York Times",
        "content": "The wave of government enforcement against cryptocurrency companies is beginning to remake the industry.\n\nCoinbase, the largest crypto exchange in the United States, has opened a business in Bermuda. Gemini, a rival firm based in New York, is seeking a license in the United Arab Emirates. And Bittrex, an exchange in Seattle, has shut down its U.S. operations.\n\nAfter years of trying to shape federal regulation in the United States, a growing number of American crypto companies — particularly the exchanges where customers buy and sell digital tokens — are exploring plans to build their businesses abroad. They are expanding into new markets and weighing the possibility of leaving the country entirely.\n\nThe moves are a response to a growing law enforcement crackdown that has made the United States one of the strictest regulators of crypto in the world. On Tuesday, the Securities and Exchange Commission filed a long-anticipated lawsuit against Coinbase, arguing that the exchange was marketing securities without the proper registration. A day earlier, the S.E.C. sued the international crypto exchange Binance, seeking to bar its founder from the U.S. securities market."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzBkZTE3ZGMzLTVmNzAtNDVjMi1hOTMzLTJmOTE0YmFjMzJkMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Crypto ownership doubles in UK before new rules kick in - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Cryptocurrencies myFT Digest -- delivered directly to your inbox.\n\nCrypto ownership more than doubled in the UK last year, the Financial Conduct Authority said on Wednesday, as it announced an October start date for its clampdown on mis-selling in a sector often dubbed finance’s “Wild West”.\n\nAlmost one in 10 people surveyed by the UK’s top financial regulator owned cryptocurrencies in 2022, more than twice the number a year earlier, despite regulators warning that crypto investors should be prepared to lose their entire outlay.\n\n“It is up to people to decide whether they buy crypto . . . Our rules give people the time and the right risk warnings to make an informed choice,” said Sheldon Mills, the FCA’s head of consumers and competition. He added that its crackdown on crypto group advertising would begin on October 8.\n\nThe regulator’s update comes in a bruising week for the crypto industry after two of its largest exchanges, Binance and Coinbase, were sued by the US Securities and Exchange Commission over alleged securities law violations.\n\nIn recent months, the UK has proposed a sweeping new regulatory regime for crypto where rules governing the industry will be brought more closely into line with those for traditional financial services. A cross-party group of MPs recently criticised the policy, suggesting instead that crypto be overseen as a form of gambling.\n\nSome 36 per cent of 2,000 adults polled by the FCA said they had seen or heard crypto adverts, while 25 per cent of those who had not previously been involved in crypto became “curious” as a result of being exposed to advertising campaigns.\n\nThe FCA’s crypto marketing regime will require companies to use risk warnings and offer a “24-hour cooling-off period” for customers. Incentives for customers to “refer a friend” will also be banned.\n\nThe regime will apply to all crypto asset businesses marketing to UK customers, regardless of whether they are based in the UK or overseas. “The crypto industry needs to prepare now for this significant change,” Mills said.\n\nHarry Eddis, a lawyer at Linklaters, said the rules would have a “significant impact” on the UK market by making it harder for people to buy crypto currency.\n\nThe FCA currently regulates crypto firms for money-laundering compliance only. Its research found that 28 per of those who do not use crypto would be “more likely” to buy it if the market and activity were regulated to a similar standard as traditional financial services.\n\nThe increase in ownership of crypto assets has come despite a tumultuous period for the market, which suffered a crisis of confidence last year that resulted in the collapse of former industry bellwether FTX.\n\nThe research also showed almost four-fifths of those buying crypto used disposable income to fund the purchases, 6 per cent borrowed money, and the rest used savings or gains from crypto sales.\n\nThe mean value of their investments was put at just under £1,600, with 40 per cent holding less than £100. The most common reason given for buying crypto, as stated by 40 per cent of respondents, was “as a gamble”.\n\nThe price of the popular cryptocurrency Bitcoin, which peaked at more than $64,000 in November 2022, on Wednesday fell nearly 3 per cent to $26,484.\n\nA renewed crackdown on crypto marketing follows a blitz of American enforcement cases this week.\n\nThe SEC on Monday filed a lawsuit against Binance, alleging the world’s largest crypto exchange mixed billions of dollars of customer cash with a separate trading firm owned by its chief executive Changpeng Zhao.\n\nOn Tuesday, the SEC sued Nasdaq-listed rival exchange Coinbase, alleging it violated US securities law by failing to register as a broker, national securities exchange or clearing agency."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9vbmUtd2lubmVyLWluLXRoZS1zZWNzLWNsYXNoLXdpdGgtY3J5cHRvLWJpdGNvaW4tMTYyNDEwMTg1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "One winner in the SEC's clash with crypto: bitcoin - Yahoo Finance",
        "content": "The Securities and Exchange Commission is suing Coinbase (COIN) and Binance because it believes many cryptocurrencies traded on those exchanges are securities that should be registered with the US regulator.\n\nThere is one big exception: bitcoin.\n\n“The SEC has been extremely clear. Bitcoin is not a security,” Steven Lubka, managing director of Swan Bitcoin, told Yahoo Finance. “We’re very, very confident that never changes.”\n\nThat belief is encouraging investors to stick with the world’s largest cryptocurrency despite the industry turmoil triggered by new SEC lawsuits against the biggest cryptocurrency exchanges in the world and the US.\n\nBitcoin (BTC-USD) was up 5% Wednesday at 9:30 am New York time to $26,759, before settling back to $26,400 by noon. Its market share, a ratio of the coin's market capitalization over the total crypto market capitalization, rose 0.85% over the same period, suggesting crypto investors are seeking it out as a safe bet within the market.\n\nBitcoin is up 58% year to date, while still down by roughly the same amount from its November 2021 peak of $68,790.\n\nSome bitcoin proponents expressed their optimism on social media, suggesting their favorite digital asset could benefit amid the legal battles.\n\nCory Klippsten, an outspoken critic of the larger crypto ecosystem and CEO of bitcoin financial services firm Swan Bitcoin, tweeted a graphic of bitcoin’s recovery this week and added a sarcastic: “Oh noes! Whatever is bitcoin going to do???!”\n\nOh noes! The sh*tcoin casinos I mean \"tool manufacturers\" are f***ed whatever is Bitcoin going to do???!\n\n\n\nTick tock, next block. pic.twitter.com/uqnBs6ePfv — Cory Klippsten 🖐️ Swan.com 🦢 #Bitcoin (@coryklippsten) June 7, 2023\n\nPierre Rochard of bitcoin miner Riot Platforms (RIOT) tweeted that Coinbase should \"pivot back to being focused on #Bitcoin.\"\n\nStory continues\n\nTwitter co-founder Jack Dorsey then attached the Rochard comment to his Twitter feed and added a hundred points emoji.\n\nCoinbase does rely on bitcoin for roughly one-third of its trading volume and transaction revenue.\n\nThe Howey test\n\nThe SEC's framework for evaluating digital assets as securities relies on the so-called Howey Test. It can be linked back to a 1946 Supreme Court case dealing with tracts of Florida orange groves sold by W.J. Howey Co. and leased back to the company.\n\nThe Supreme Court labeled these leaseback deals as investment contracts, meaning they needed to be registered with the SEC.\n\nIt also defined what constitutes a security: \"an investment of money in a common enterprise with profits to come solely from the efforts of others.\"\n\nBitcoin, its defenders say, doesn't meet that test. It wasn't created, they say, by entrepreneurs seeking profits via pre-listed private sales to larger institutional investors — as other digital coins have.\n\nIt was instead created by anonymous software developer Satoshi Nakamoto in January 2009 as an open-source concept.\n\n\"Satoshi never raised a single dollar and because he never raised a single dollar, there were no expectations of future profits in an investment contract,\" Lubka said.\n\nWhile there is no law declaring whether or not bitcoin is a security, SEC Chair Gary Gensler as well as former Chair Jay Clayton have indicated in numerous public comments they do not believe bitcoin is a security. Instead, most investors understand it to be a commodity such as gold or wheat.\n\n\"I’m extremely confident that Bitcoin is going to remain a commodity and will not be labeled a security,\" Grant McCarty, co-executive director of advocacy group Bitcoin Policy Institute, told Yahoo Finance.\n\nAbsolutely hilarious seeing all the shitcoiners and “venture capitalists” trying to crawl their way back to #Bitcoin. — Magoo PhD (@HodlMagoo) June 6, 2023\n\nThe SEC listed 19 different crypto tokens in its lawsuits against Coinbase and Binance that it considers securities, accounting for roughly 11% of crypto's total market capitalization. Those coins fell Wednesday.\n\nBNB (BNB-USD) was down 7.5%, Cardano's ADA (ADA-USD) was down 7%, Polygon's MATIC (MATIC-USD) token was down 4.8% while Solana's SOL token was down 4.2%.\n\nAfter falling 12% Tuesday, Coinbase's stock rose 2.8% at Wednesday's open.\n\nCustomers withdrew $105 million from Coinbase in the 24 hours after it was sued by the SEC, after losing $1.3 billion in the previous 24 hours, according to crypto data provider Nansen.\n\nBinance customers pulled $492 million and $1.4 billion in the two previous 24-hour periods.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9vbmUtd2lubmVyLWluLXRoZS1zZWNzLWNsYXNoLXdpdGgtY3J5cHRvLWJpdGNvaW4tMTYyNDEwMTg1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "One winner in the SEC's clash with crypto: bitcoin - Yahoo Finance",
        "content": "The Securities and Exchange Commission is suing Coinbase (COIN) and Binance because it believes many cryptocurrencies traded on those exchanges are securities that should be registered with the US regulator.\n\nThere is one big exception: bitcoin.\n\n“The SEC has been extremely clear. Bitcoin is not a security,” Steven Lubka, managing director of Swan Bitcoin, told Yahoo Finance. “We’re very, very confident that never changes.”\n\nThat belief is encouraging investors to stick with the world’s largest cryptocurrency despite the industry turmoil triggered by new SEC lawsuits against the biggest cryptocurrency exchanges in the world and the US.\n\nBitcoin (BTC-USD) was up 5% Wednesday at 9:30 am New York time to $26,759, before settling back to $26,400 by noon. Its market share, a ratio of the coin's market capitalization over the total crypto market capitalization, rose 0.85% over the same period, suggesting crypto investors are seeking it out as a safe bet within the market.\n\nBitcoin is up 58% year to date, while still down by roughly the same amount from its November 2021 peak of $68,790.\n\nSome bitcoin proponents expressed their optimism on social media, suggesting their favorite digital asset could benefit amid the legal battles.\n\nCory Klippsten, an outspoken critic of the larger crypto ecosystem and CEO of bitcoin financial services firm Swan Bitcoin, tweeted a graphic of bitcoin’s recovery this week and added a sarcastic: “Oh noes! Whatever is bitcoin going to do???!”\n\nOh noes! The sh*tcoin casinos I mean \"tool manufacturers\" are f***ed whatever is Bitcoin going to do???!\n\n\n\nTick tock, next block. pic.twitter.com/uqnBs6ePfv — Cory Klippsten 🖐️ Swan.com 🦢 #Bitcoin (@coryklippsten) June 7, 2023\n\nPierre Rochard of bitcoin miner Riot Platforms (RIOT) tweeted that Coinbase should \"pivot back to being focused on #Bitcoin.\"\n\nStory continues\n\nTwitter co-founder Jack Dorsey then attached the Rochard comment to his Twitter feed and added a hundred points emoji.\n\nCoinbase does rely on bitcoin for roughly one-third of its trading volume and transaction revenue.\n\nThe Howey test\n\nThe SEC's framework for evaluating digital assets as securities relies on the so-called Howey Test. It can be linked back to a 1946 Supreme Court case dealing with tracts of Florida orange groves sold by W.J. Howey Co. and leased back to the company.\n\nThe Supreme Court labeled these leaseback deals as investment contracts, meaning they needed to be registered with the SEC.\n\nIt also defined what constitutes a security: \"an investment of money in a common enterprise with profits to come solely from the efforts of others.\"\n\nBitcoin, its defenders say, doesn't meet that test. It wasn't created, they say, by entrepreneurs seeking profits via pre-listed private sales to larger institutional investors — as other digital coins have.\n\nIt was instead created by anonymous software developer Satoshi Nakamoto in January 2009 as an open-source concept.\n\n\"Satoshi never raised a single dollar and because he never raised a single dollar, there were no expectations of future profits in an investment contract,\" Lubka said.\n\nWhile there is no law declaring whether or not bitcoin is a security, SEC Chair Gary Gensler as well as former Chair Jay Clayton have indicated in numerous public comments they do not believe bitcoin is a security. Instead, most investors understand it to be a commodity such as gold or wheat.\n\n\"I’m extremely confident that Bitcoin is going to remain a commodity and will not be labeled a security,\" Grant McCarty, co-executive director of advocacy group Bitcoin Policy Institute, told Yahoo Finance.\n\nAbsolutely hilarious seeing all the shitcoiners and “venture capitalists” trying to crawl their way back to #Bitcoin. — Magoo PhD (@HodlMagoo) June 6, 2023\n\nThe SEC listed 19 different crypto tokens in its lawsuits against Coinbase and Binance that it considers securities, accounting for roughly 11% of crypto's total market capitalization. Those coins fell Wednesday.\n\nBNB (BNB-USD) was down 7.5%, Cardano's ADA (ADA-USD) was down 7%, Polygon's MATIC (MATIC-USD) token was down 4.8% while Solana's SOL token was down 4.2%.\n\nAfter falling 12% Tuesday, Coinbase's stock rose 2.8% at Wednesday's open.\n\nCustomers withdrew $105 million from Coinbase in the 24 hours after it was sued by the SEC, after losing $1.3 billion in the previous 24 hours, according to crypto data provider Nansen.\n\nBinance customers pulled $492 million and $1.4 billion in the two previous 24-hour periods.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance"
    }
]