[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDQvMTQvcG9kY2FzdHMvYml0Y29pbi1taW5pbmctYmVlZi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "The Price of Bitcoin Mining and More: The Week in Reporter Reads - The New York Times",
        "content": "Winter Storm Uri had knocked out power plants across Texas, leaving tens of thousands of homes in icy darkness. Meanwhile, in the husk of a onetime aluminum smelting plant an hour outside of Austin, row upon row of computers were using enough electricity to power about 6,500 homes as they raced to earn Bitcoin, the world’s largest cryptocurrency.\n\nThe New York Times has identified 34 such large-scale operations, known as Bitcoin mines, in the United States, all putting immense pressure on the power grid and most finding novel ways to profit from doing so. Their operations can create costs — including higher electricity bills and enormous carbon pollution — for everyone around them, most of whom have nothing to do with Bitcoin."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDQvMTQvcG9kY2FzdHMvYml0Y29pbi1taW5pbmctYmVlZi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "The Price of Bitcoin Mining and More: The Week in Reporter Reads - The New York Times",
        "content": "Winter Storm Uri had knocked out power plants across Texas, leaving tens of thousands of homes in icy darkness. Meanwhile, in the husk of a onetime aluminum smelting plant an hour outside of Austin, row upon row of computers were using enough electricity to power about 6,500 homes as they raced to earn Bitcoin, the world’s largest cryptocurrency.\n\nThe New York Times has identified 34 such large-scale operations, known as Bitcoin mines, in the United States, all putting immense pressure on the power grid and most finding novel ways to profit from doing so. Their operations can create costs — including higher electricity bills and enormous carbon pollution — for everyone around them, most of whom have nothing to do with Bitcoin."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMTQvcGV3LWNyeXB0by10cmFkZXJzLXNheS1pbnZlc3RtZW50cy1wZXJmb3JtZWQtd29yc2UtdGhhbi1leHBlY3RlZC5odG1s0gFpaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDQvMTQvcGV3LWNyeXB0by10cmFkZXJzLXNheS1pbnZlc3RtZW50cy1wZXJmb3JtZWQtd29yc2UtdGhhbi1leHBlY3RlZC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "75% of Americans don't trust crypto—and nearly half of traders say their investments have performed worse than expected - CNBC",
        "content": "Americans don't have a lot of faith in cryptocurrency. Around 75% of those who are familiar with crypto say they aren't confident that the current ways to invest in, trade or use cryptocurrency are reliable and safe, according to Pew Research Center's April survey of 10,071 people ages 18 and older living in the U.S.\n\nAbout 18% say they're somewhat confident, but just 6% feel extremely or very confident, the survey found.\n\nConfidence varies by age as well. About 66% of U.S. adults under 50 who are familiar with crypto aren't confident in its reliability and safety, the survey found. For those over 50, that number rises to 85%.\n\nWhat's more, American crypto traders feel their investments haven't performed as well as they had hoped, according to Pew's survey.\n\nAbout 45% of respondents say their investments have actually done worse than they expected. While 30% say their investments have performed as expected, only 15% say their investments have performed better than anticipated."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yaXNlcy1hYm92ZS0zMDcwMC1ldGhlcmV1bS1jYXJkYW5vLWp1bXAtdXAtdG8tMTEvYXJ0aWNsZXNob3cvOTk0ODQwMzMuY21z0gGbAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLXJpc2VzLWFib3ZlLTMwNzAwLWV0aGVyZXVtLWNhcmRhbm8tanVtcC11cC10by0xMS9hbXBfYXJ0aWNsZXNob3cvOTk0ODQwMzMuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $30,700; Ethereum, Cardano jump up to 11% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading higher on Friday with an increase of over 4% in the crypto market cap in the last 24 hours. Bitcoin (BTC) rose 2.30% to $30,786, whereas Ethereum (ETH) surged 10.5%, and was above the $2,100 level.\"Rising by over 10% in the past 24 hours, ETH is trading in the $2.1k zone despite some fearing a massive dump after the Shapella upgrade. BTC is also on the rise to chase the $31k mark. The crypto fear and greed index have jumped 7 points to regain the scoring for 68, hinting towards increasing investor confidence,\" Parth Chaturvedi, Crypto Ecosystem Lead at CoinSwitch, said.Other top crypto tokens were also trading higher on Friday. Dogecoin jumped nearly 9%. Meanwhile, BNB , XRP, Litecoin , Solana and Cardano also traded with gains. The global cryptocurrency market cap was trading higher around $1.28 trillion, rising 4.25% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $595 billion. Bitcoin’s dominance is currently 46.30%, a decrease of 0.95% over the day, according to CoinMarketCap.\"Bitcoin surged above the US$30,800 level in the past 24 hours as crypto markets continued to react to the latest US inflation report. The support for BTC is located at the US$30,400 level, while resistance lies at the US$30,800 level,\" Edul Patel, Co-founder and CEO at Mudrex, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 71, with a neutral outlook. The Stochastic %K (14, 3, 3) indicates “Sell” at 88 and the Average Directional Index (14) indicates a Neutral outlook at 39.\"The MACD Level (12, 26), at 1097, indicates Buy. The Stochastic RSI Fast (3, 3, 14, 14) indicates Sell at 86 and William's Percentage is Sell at −9 as well,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 10.54 hours, IST on April 14, 2023)Bitcoin $30,780 2.34%Ethereum $2,117 10.52%Tether $1.00 0.01%BNB $334 4.82%XRP $0.5247 3.79%Cardano $0.4414 8.49%Dogecoin $0.09086 9.12%Polygon $1.18 6.97%Solana $25.32 5.60%Polkadot $6.79 5.81%Shiba Inu $0.00001139 4.18%Litecoin $98.24 6.28%Tron $0.0665 2.31%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vbWFuLWdldHMtcHJpc29uLXRpbWUtYWZ0ZXItY2F1Z2h0LXN0b2xlbi1iaXRjb2luLTIwMjMtNNIBW2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vbWFuLWdldHMtcHJpc29uLXRpbWUtYWZ0ZXItY2F1Z2h0LXN0b2xlbi1iaXRjb2luLTIwMjMtND9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Man gets prison time after caught with $3.4 billion in stolen bitcoin - Business Insider",
        "content": "A man convicted of stealing about 50,000 bitcoins was sentenced Friday to a year in prison.\n\nWhen it was seized, the bitcoin haul was worth over $3.4 billion.\n\nProsecutors said the cryptocurrency was stolen from the Silk Road dark-web marketplace.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nA man who stored billions of dollars' worth of stolen cryptocurrency in an underground safe — and a Cheetos popcorn tin — was sentenced Friday to a year and a day in prison.\n\nAccording to federal prosecutors, James Zhong, 32, stole more than 50,000 bitcoins from the Silk Road marketplace, a place on the so-called dark web where people could buy illicit items such as pornography and drugs. Its founder, Ross Ulbricht, was sentenced in 2015 to life in prison without the possibility of parole after he was convicted of drug trafficking, money laundering, and hacking, among other charges.\n\nZhong was able to steal from the marketplace by creating multiple accounts and tricking Silk Road into releasing the bitcoin to his accounts, per the Department of Justice. He never actually purchased or sold anything on the website, according to a DOJ statement.\n\n\"Back in 2012, James Zhong committed wire fraud by stealing 50,000 Bitcoin from Silk Road, and for the next 10 years, he managed to conceal what he had done and how he obtained his fortune,\" US Attorney Damian Williams said in the statement.\n\nAdvertisement\n\nBut in November 2021, US authorities obtained a search warrant to search his home in Gainesville, Georgia. There, the DOJ says, investigators recovered more than 50,000 bitcoins, split between \"an underground floor safe and on a single-board computer that was submerged under blankets in a popcorn tin stored in a bathroom closet.\" Authorities also recovered at Zhong's home more than $660,000 in cash, as well as silver and gold bars.\n\nThe bitcoin was valued at $3.4 billion when it was seized and is now worth more than $1.5 billion, according to the DOJ.\n\nA photo shared by the department shows that the crypto tin originally contained Cheetos-brand popcorn in both Flamin' Hot and Cheddar flavors. According to media reports, the tin and its promise of \"2 favorites together\" was available exclusively at Walmart during the 2020 holiday season.\n\nHave a news tip? Email this reporter: cdavis@businessinsider.com"
    }
]