[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wNi0zMC9iaXRjb2luLWJ0Yy1zZXQtZm9yLXNlY29uZC1xdWFydGVybHktZ2Fpbi1hcy1zbWFsbGVyLXRva2Vucy1sYWctbW9zdC1zaW5jZS0yMDIw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Set for Second Quarterly Gain as Smaller Tokens Lag by the Most Since 2020 - Bloomberg",
        "content": "Bitcoin registered a second straight quarterly gain, tightening its grip on crypto markets as smaller tokens nurse losses.\n\nThe largest digital asset rose 7% in April through June, aided by optimism about increasing demand if BlackRock Inc., Fidelity Investments and others succeed in their efforts to start spot Bitcoin exchange-traded funds in the US."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTMwL2NpdGFkZWwtYmFja2VkLWV4Y2hhbmdlLXNwYXJrcy1mcmVuenktaW4tYml0Y29pbi1jYXNoLWJjaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Citadel-Backed Exchange Sparks Frenzy in Bitcoin Cash (BTC) - Bloomberg",
        "content": "The opening of a new crypto exchange backed by Citadel Securities has unleashed a speculative mania in Bitcoin Cash, an offshoot of the original digital token, with interest especially high among traders in South Korea.\n\nBitcoin Cash soared as much as 32% to $324 on Friday, taking gains in June to around 170%. The coin is among just four — including bellwethers Bitcoin and Ether — selected to trade on EDX Markets, the institutional-only platform that went live this month."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTMwL2ZpZGVsaXR5LWxlYWRzLWZsdXJyeS1vZi1iaXRjb2luLWJ0Yy1ldGYtcmVmaWxpbmdzLXRvLWFuc3dlci1zZWPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Crypto Spot Bitcoin ETFs Re-Filed After SEC Expresses Caution (BTC, COIN) - Bloomberg",
        "content": "In a flurry of Friday afternoon activity, Fidelity Investments led a handful of firms that filed a fresh set of applications for a spot-Bitcoin exchange-traded fund to add new details after the US Securities and Exchange Commission indicated that the initial filings were insufficient.\n\nThe companies — which also include Invesco, VanEck, 21Shares and WisdomTree — are among eight that are seeking to launch what would be an initial crop of US spot Bitcoin ETFs. BlackRock Inc. set off the wave with its surprise filing for such a fund in mid-June."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTMwL3NlYy1xdWVzdGlvbnMtZmlkZWxpdHktYmxhY2tyb2NrLW9uLXNwb3QtYml0Y29pbi1ldGYtZmlsaW5nc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "SEC Pushes Back Against Fidelity, BlackRock Spot Bitcoin ETF Filings - Bloomberg",
        "content": "The US Securities and Exchange Commission is pushing back against a wave of filings by asset managers to launch the first US exchange-traded fund that invests directly in Bitcoin, saying the applications lack clarity and further information is needed before they’re considered for approval.\n\nThe agency told exchanges including Nasdaq and Cboe Global Markets, which filed the applications on behalf of BlackRock and Fidelity Investments, that their filings are insufficient, according to people familiar with the matter. A Cboe spokesperson confirmed that it will refile on the behalf of Fidelity. Nasdaq is working to answer questions and give updates for its next iteration of the filing."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5jbmJjLmNvbS8yMDIzLzA2LzMwL2JpdGNvaW4tc2xpcHMtYWZ0ZXItc2VjLXJlcG9ydGVkbHktY2FsbHMtZXRmLWZpbGluZ3MtaW5hZGVxdWF0ZS1idXQtaXMtaGVhZGluZy1mb3ItYS13aW5uaW5nLW1vbnRoLmh0bWzSAYsBaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDYvMzAvYml0Y29pbi1zbGlwcy1hZnRlci1zZWMtcmVwb3J0ZWRseS1jYWxscy1ldGYtZmlsaW5ncy1pbmFkZXF1YXRlLWJ1dC1pcy1oZWFkaW5nLWZvci1hLXdpbm5pbmctbW9udGguaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 30 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin briefly falls after SEC reportedly calls ETF filings inadequate, but posts a winning month - CNBC",
        "content": "The price of bitcoin fell Friday following a report that recent bitcoin filings from big names such as BlackRock and Fidelity have been deemed inadequate in the eyes of the U.S. Securities and Exchange Commission.\n\nBitcoin finished the day below the flat line at $30,398.43, according to Coin Metrics. Earlier, it briefly fell under the $30,000 level, after rising as high as $31,260.52.\n\nBitcoin ended the week down 1.5%. Nevertheless, it finished the month up 12.3%, following a down month in May, which was the cryptocurrency's first losing month of the year and worst month since November 2022. June's positive performance brought its year-to-date gains to 83%.\n\nThe move came after The Wall Street Journal reported Friday that the SEC told Nasdaq and Cboe Global Markets, both of which filed bitcoin exchange-traded funds applications on behalf of various institutions this month, that the filings aren't sufficiently clear or comprehensive.\n\nSpecifically, the SEC said it returned the filings because they didn't name the spot bitcoin exchange that the Nasdaq and Cboe would have a \"surveillance-sharing agreement\" with or provide enough detail about the arrangement, according to the report.\n\nThe filings can be resubmitted. A Cboe spokesperson told CNBC that the exchange plans to update and refile."
    }
]