[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTA5L2JpdGNvaW4tdHJhZGVzLXBhc3QtMzYtMDAwLW9uLXBvc3NpYmxlLWV0Zi1pbnZlc3RtZW50LWFwcHJvdmFs0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Trades Past $36000 on Possible ETF Investment Approval - Bloomberg",
        "content": "It took just over 18 months, but Bitcoin is finally back to where it traded before the event that precipitated the last crypto crash.\n\nThe dominant cryptocurrency rose as much as 6.7% to $37,973 on Thursday before paring the gain. That was the highest since May 5, 2022 — just before the TerraUSD stablecoin collapsed and ignited a daisy chain of failures across the cryptoasset space. Bitcoin completed its full recovery from that debacle almost exactly to the year after the rout reached its nadir when Sam Bankman-Fried ’s exchange FTX filed for bankruptcy."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWJyZWFrcy11cy0zNi0wMDAtMDc0NjU4ODgyLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin breaks US$36,000 as SEC enters potential ETF approval period - Yahoo Finance",
        "content": "Bitcoin, the world’s first cryptocurrency, rose above US$36,000 on Thursday for the first time since May 2022. Thursday kicks off the first day of an eight-day period for the U.S. Securities and Exchange Commission (SEC) to “theoretically approve” pending spot Bitcoin exchange-traded fund (ETF) applications.\n\nSee related article: HSBC plans tokenized securities custody service with Ripple’s Metaco\n\nBloomberg ETF analysts James Seyffart and Eric Balchunas said on X (formerly Twitter) that from Nov. 9 to Nov. 17, the SEC has an eight-day period when it could theoretically approve all 12 spot Bitcoin ETF applications.\n\n“We still believe 90% chance by Jan. 10 for spot Bitcoin ETF approvals. But if it comes earlier we are entering a window where a wave of approval orders for all current applications *COULD* occur,” tweeted Seyffart."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jbmJjLmNvbS8yMDIzLzExLzA5L2JpdGNvaW4tdG9wcy0zNzAwMC1mb3ItdGhlLWZpcnN0LXRpbWUtaW4tMTgtbW9udGhzLWFzLW9wdGltaXNtLWFib3V0LWEtZm9ydGhjb21pbmctZXRmLWJ1aWxkcy0uaHRtbNIBhwFodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8xMS8wOS9iaXRjb2luLXRvcHMtMzcwMDAtZm9yLXRoZS1maXJzdC10aW1lLWluLTE4LW1vbnRocy1hcy1vcHRpbWlzbS1hYm91dC1hLWZvcnRoY29taW5nLWV0Zi1idWlsZHMtLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Ether tops $2,000 for the first time since April, bitcoin reaches an 18-month high - CNBC",
        "content": "ETF optimism had been building earlier in the morning, with bitcoin climbing and giving a big lift to crypto assets across the market to start the day. The rise in bitcoin price triggered a wave of short liquidations overnight, which propelled crypto prices higher, said Clara Medalie, head of research at crypto data provider Kaiko.\n\nThe website for Delaware's Division of Corporations showed that an iShares Ethereum Trust was registered on Thursday. A similar notice for the iShares Bitcoin Trust came on June 8, one week before BlackRock's filing for a bitcoin ETF. BlackRock declined to comment on the matter.\n\nEther was last higher by nearly 7.48% at $2,037.61, according to Coin Metrics. Meanwhile, bitcoin added 2.67% to trade at $36,574.83. Earlier, it climbed as high as $37,970, its highest level since May 2022.\n\nThe price of ether jumped Thursday, topping the key $2,000 level for the first time since April, after BlackRock took initial steps toward filing for a spot ether ETF.\n\n\"Over the past year, crypto markets have been desperately searching for a catalyst amid a sea of bad news, and the ETF news have been a welcome respite,\" she said. \"Should [an ETF approval] come, we may see another big surge, or we could be witnessing the extent of it right now. Ultimately, it is too early to tell if the rally has legs, but things look promising.\"\n\nHowever, with the exception of ether, prices across the crypto market retreated midday. Ryan Rasmussen, analyst at Bitwise Asset Management, noted that leverage and open interest ballooned on the sharp move towards $38,000 and then evaporated almost instantly on the pullback.\n\n\"That's a reflection of traders on both sides — bulls and bears — getting whipsawed by the sharp price movements,\" he said. \"Any time leverage builds like that in either direction, it's at risk of getting wiped out. I think it's fair to expect more volatility as prices rise — bull markets don't go up in a straight line.\"\n\nBitcoin has seen $134.41 million in short liquidations over the past 24 hours, according to crypto data provider CoinGlass, and $41.12 million in long liquidations in the same period.\n\nOther crypto assets rode the bitcoin price wave Thursday, also coming off their highs of the day. Solana , one of the biggest outperformers in crypto this year, added 2.69% after jumping 11% earlier. Most other tokens gave back earlier gains and ended the day flat.\n\nSeparately, FTT, the token tied to the now defunct FTX, spiked by 51% after SEC chair Gary Gensler told CNBC a revival of the exchange could work if new leadership does so with a clear understanding of the law.\n\nIn equities, shares of crypto services provider Coinbase and bitcoin proxy Microstrategy gained 5.1% and 4.1%, respectively. Among the bitcoin miners, Marathon Digital was up 8%, while Riot was flat. Both stocks gave back double digit gains.\n\n—CNBC's Jesse Pound contributed reporting.\n\nDon't miss these stories from CNBC PRO:\n\nCorrection: The price of bitcoin topped $37,000 for the first time since May 2022. An earlier version of this story misstated the time interval."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vYml0Y29pbi1ldGYtYXBwcm92YWwtd29ya3MtMTQ1NTExNjkxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Is a Bitcoin ETF approval in the works? - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) surged past $37,000 early Thursday, its highest level in 18 months. The cryptocurrency's gains come amid speculation that the SEC may finally approve a spot bitcoin ETF.\n\nYahoo Finance Senior Reporter Jared Blikre analyzes the factors behind bitcoin's rise, observing patterns in other cryptocurrencies as the digital asset market aims to stage a recovery from recent crashes.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nVideo Transcript\n\nSEANA SMITH: Well, Bitcoin is climbing higher today, hitting its highest level that we've seen in about 18 months, sitting just shy of 37,000 on renewed hopes of a spot Bitcoin ETF approval. Yahoo Finance's Jared Blikre standing by on the floor of the New York Stock Exchange with the latest. Jared.\n\nJARED BLIKRE: Yes, 37,000, really impressive. Let's go to the Wi-Fi interactive and talk about this Grayscale Bitcoin, which is about to become an ETF. The SEC lost that court case and there are a bunch of other spot ETFs-- spot Bitcoin ETFs that are just waiting to come into the market from BlackRock and a bunch of different ETF providers. So lots of hype surrounding that.\n\nAnd if we take a look at the chart, you can see 37,500 and change here. We have really accelerated off of this base here. So not much was happening for a few months. And then, suddenly, we got what some people are calling a God candle that would be right here. And now, we're clearing resistance. 35,000 was a big number. Now we're up to 37,000.\n\nLet me just show you a three-year chart so we can see where some of the price memory is. We're really in the thick of it right now at the lower end down here. But you can see tons of price memory all the way up to about 65,000-70,000. So the short story is there's a long way to go.\n\nBut, if Bitcoin is emerging finally from this crypto winter then there's lots of enthusiasm behind it, and perhaps we can clear a lot of these major hurdles. It was only yesterday, I was talking about the FTC's, perhaps, rising from the ashes, there are a number of potential suitors there. Three of which are leading the negotiations. One of which is headed by Tom Farley, who used to be the President of the New York Stock Exchange right here.\n\nStory continues\n\nBut back to the Wi-Fi interactive. Let me just show you what's happened over the last three days so you can really appreciate some of the outsized move that we've seen from some of the smaller tokens. FTT token. That's up 75%.\n\nLet me show you a one year chart. And it kind of looks like a sinusoidal pattern here. Periodic bouts of enthusiasm. I guess not worried that it's going to go to zero at least. We've seen this play out over the last year.\n\nBut if I put a three-year chart, you can really see the damage that was done to this token. It's basically down over 90% over the last two years. There you go, 96%-97%. All told here. It's looking good for the risk market it's not just Bitcoin and crypto, which is being seeing a lot of love.\n\nLet me go to some of our leading markets. If we go over the last three days. Actually, let me pull it up for the last seven that's going to take us back to, I believe, last Wednesday's Fed announcement, which really started the risk engine juice. ARK Invest is up 17.6%.\n\nCannabis up 12%. Gambling up 10%. So this is really all about risk on. And Crypto is just kind of participating, although, it admittedly does have its own fundamentals here, guys."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXN1cmdlcy1hYm92ZS0zNzAwMC1oaXR0aW5nLWhpZ2hlc3QtbWFyay1pbi0xOC1tb250aHMtMTcxMTU4OTMxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin surges above $37,000, hitting highest mark in 18 months - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) surged above $37,000 Thursday morning to its highest price in 18 months, a rally fueled by more optimism that regulators could soon approve the first spot bitcoin exchange-traded fund.\n\nAs of 12 p.m. ET it had slipped below $37,000 but was still up nearly 3% over the last 24 hours.\n\nThe world’s largest cryptocurrency has now gained more than 32% over the past month and 120% since the beginning of January.\n\n\"There is no question that the very positive action in bitcoin this year continues to be very impressive,\" Matt Maley, chief market strategist with Miller Tabak + Co., wrote in a Thursday morning note.\n\nIt is still far from an all-time high, however. Bitcoin peaked at $68,789 in November 2021 but then crashed in 2022 as the Federal Reserve began raising interest rates and a series of firms imploded, including crypto exchange FTX in November 2022.\n\nA widespread crackdown on the crypto industry followed. Regulators sued a number of big players, including Coinbase and Binance, and last week a jury convicted FTX founder Sam Bankman-Fried of defrauding customers, lenders, and investors.\n\nFTX founder Sam Bankman-Fried. (AP Photo/Bebeto Matthews, File) (ASSOCIATED PRESS)\n\nNow investors are newly optimistic that the industry is poised for more mainstream acceptance. They are hoping the Securities and Exchange Commission will soon grant approval for a spot bitcoin ETF, which would allow investors to get exposure to the cryptocurrency without having to own it.\n\nBlackRock (BLK) is among the big-name money managers that have recently applied to launch such a product.\n\nBlackRock is the world's largest money manager. (STRF/STAR MAX/IPx) (STRF/STAR MAX/IPx)\n\nGrayscale Investments wants the SEC to sign off on the conversion of its bitcoin trust into a spot bitcoin exchange-traded fund following an August decision in its favor from a three-judge panel of the District of Columbia Court of Appeals.\n\nThe panel concluded the SEC had been \"arbitrary and capricious\" when it denied Grayscale's conversion application in 2022.\n\nGrayscale has since picked up discussions with the SEC’s divisions of markets and trading and division of corporate finance, according to a person familiar with the matter.\n\nStory continues\n\nThe next official milestone where the SEC must accept or reject approval for a spot bitcoin ETF is Jan. 10. But the SEC could approve applications sooner.\n\n“Any timing is absolutely speculative,” this person added.\n\nBitcoin’s surge on Thursday also pushed the stocks of digital asset companies higher. Coinbase (COIN), the largest US crypto exchange, rose 8% while MicroStrategy (MSTR) was up 7%. Meanwhile, Marathon Digital (MARA) surged 11%.\n\nCrypto stocks had given back some of their gains by midday.\n\nBitcoin appears to be getting “very overbought,” Maley said, suggesting it may soon see a pullback. However, its mid-week surge hasn’t seen the momentum loss of previous rallies this year, he added.\n\n“This is the kind of breakout move that frequently leads to an even bigger advance before long,” Maley said.\n\nTo be sure, bitcoin and the crypto markets are heavily driven by derivatives trading and that can exaggerate market activity in either direction.\n\nOver the past 24 hours, crypto trading volume has doubled to $87 billion as of noon New York time. For the same period, $132 million in trader positions shorting bitcoin have been liquidated, according to crypto derivatives source Coinglass.\n\nThe size of total short liquidations is far smaller than past so-called short squeeze fueled rallies that bitcoin has experienced this year, suggesting that more investors are directly buying the underlying/spot asset.\n\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto and other areas in finance.\n\nClick here for the latest crypto news, updates, values, prices, and more related to bitcoin, ethereum, dogecoin, DeFi, and NFTs\n\nRead the latest financial and business news from Yahoo Finance"
    }
]