[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiowFodHRwczovL3d3dy5zY21wLmNvbS9uZXdzL3dvcmxkL3VuaXRlZC1zdGF0ZXMtY2FuYWRhL2FydGljbGUvMzIxNzE2Mi9tYW4td2hvLWhpZC11czM0LWJpbGxpb24tc3RvbGVuLWJpdGNvaW4taW5zaWRlLXBvcGNvcm4tdGluLWFuZC11bmRlcmdyb3VuZC1zYWZlLWdldHMteWVhci1qYWls0gGjAWh0dHBzOi8vYW1wLnNjbXAuY29tL25ld3Mvd29ybGQvdW5pdGVkLXN0YXRlcy1jYW5hZGEvYXJ0aWNsZS8zMjE3MTYyL21hbi13aG8taGlkLXVzMzQtYmlsbGlvbi1zdG9sZW4tYml0Y29pbi1pbnNpZGUtcG9wY29ybi10aW4tYW5kLXVuZGVyZ3JvdW5kLXNhZmUtZ2V0cy15ZWFyLWphaWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "Man jailed for hiding US$3.4 billion in stolen bitcoin inside popcorn tin - South China Morning Post",
        "content": "A man who stored billions of dollars worth of stolen cryptocurrency in an underground safe – and a Cheetos popcorn tin – was sentenced on Friday to a year and a day in prison.\n\nAccording to federal prosecutors, James Zhong, 32, stole more than 50,000 bitcoin from Silk Road, a marketplace on the so-called “dark web” where users can buy anything from pornography to illicit drugs.\n\nIts founder, Ross Ulbricht, was sentenced in 2015 to life in prison without the possibility of parole after he was convicted of drug trafficking, money laundering, and hacking, among other charges.\n\nZhong was able to steal from the marketplace by creating multiple accounts and tricking Silk Road into releasing the bitcoin to his accounts, according to the Department of Justice. He never actually bought or sold anything on the website, per a DOJ statement."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3Mvc3RvY2tzL2hvd2FyZC1tYXJrcy1vYWt0cmVlLWludGVyZXN0LXJhdGVzLWZlZC1iaXRjb2luLWNyeXB0by1nb3Zlcm5tZW50LWRlYnQtMjAyMy000gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "Howard Marks on Interest Rate Outlook, Bitcoin, AI, Government Debt - Markets Insider",
        "content": "Howard Marks says interest rates won't return to zero anytime soon.\n\nThe billionaire investor warns the ballooning US federal debt may cause problems in the future.\n\nMarks says AI won't replace the best investors, and the banking fiasco shone a light on bitcoin.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nInterest rates aren't going back to zero anytime soon, and the best investors won't be usurped by artificial intelligence, Howard Marks says.\n\nThe billionaire investor and Oaktree Capital Management cofounder also rang the alarm on ballooning government debt, suggested bitcoin has its uses, and called for the Federal Reserve to intervene in the economy as little as possible. He spoke during a recent episode of the \"We Study Billionaires\" podcast.\n\nHere are Marks' 8 best quotes from the interview, lightly edited for length and clarity:\n\n1. \"The declining interest rates were responsible for the majority of all the money that's been made in the last 45 years.\" (Marks hailed the Federal Reserve's embrace of lower rates as a \"sea change\" for financial markets, as it made borrowing cheaper and debt financing easier.)\n\n2. \"The rates are high today to fight inflation. I don't think they're going to stay this high. But they're through coming down in any major way, and they're through being ultra-low.\"\n\nAdvertisement\n\n3. \"I just think it's too good to be true to think we can have a credit card we never have to pay the balance on.\" (Marks was warning that continued growth in the US federal debt will likely have serious consequences down the line.)\n\n4. \"AI, just like passive investing and machine learning — even maybe to a greater extent — will knock out everybody who doesn't add value. It should be harder and harder and harder to run money and be paid highly for producing inferior. But hopefully there will still be a small group of people who can do something that the machine can't do.\"\n\n5. \"Can an AI-enabled computer sit down with CEOs and figure out which one is Steve Jobs? Can it sit down with five business plans and figure out which one is Amazon? I just don't think so. This is an art form.\"\n\n6. \"There are people who believe that when you have a bank crisis, like we did with Silicon Valley Bank and some of the others, that the weakness of the banks shows the strength of bitcoin. It's in many ways an anti-bank play. It does seem that there are good uses for some coins, and bitcoin seems to be the one in the lead so far.\"\n\nAdvertisement\n\n7. \"Humility is a really important thing, especially in the market, which humbles us all. Anybody who doesn't allow for humility, in a field where there's randomness and uncertainty, and qualitative and subjective things are important, is riding for a fall.\"\n\n8. \"People used to talk about the factory of the future, which would have one man and one dog, and it was the dog's job to keep the man from touching the equipment. It was the man's job to feed the dog. I would like to have the Fed keep its hands off the machinery most of the time.\""
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzE1L21pY2hhZWwtc2F5bG9yLWJ1eXMtYW5vdGhlci0xNTAtbWlsbGlvbi1pbi1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "Michael Saylor Buys Another $150 Million in Bitcoin: Is the Crypto a Screaming Buy? - The Motley Fool",
        "content": "The crypto markets had a rough 2022, and Bitcoin (BTC 0.02%) wasn't spared -- the cryptocurrency fell nearly 65% last year. But 2023 has become a comeback story, with Bitcoin up 83% since January.\n\nBitcoin mega-supporter and MicroStrategy co-founder Michael Saylor recently revealed that his company bought 6,455 Bitcoin in late March, a transaction worth $150 million.\n\nShould investors follow Saylor's lead? One shouldn't base their investment decisions on someone else's, but there are some excellent reasons to consider adding Bitcoin to your portfolio today. Here is what you need to know.\n\nA hefty vote of confidence\n\nAlthough investors should make their own decisions, there's no denying the influence that well-known investors such as Warren Buffett can have on a stock's sentiment. Saylor is arguably the Buffett equivalent to Bitcoin investors, and his latest $150 million investment is a vote of confidence if anything.\n\nMicroStrategy now owns 138,955 total Bitcoin worth almost $4.2 billion. The company's average Bitcoin cost is $29,817, just a bit below where it trades today. In other words, you could argue that Saylor sees value in Bitcoin at its current price; a $4 billion investment would imply an expectation that the asset's value will increase over time.\n\nHowever, one shouldn't automatically mirror Saylor's sentiment on Bitcoin, just as one shouldn't blindly buy Coca-Cola stock just because Buffett owns it. Instead, look at it as a prompt to revisit your investment thesis.\n\nRevisiting Bitcoin's investment case\n\nThe overarching theme for Bitcoin is that it's a store of value, similar to gold or silver. Ideally, Bitcoin can protect investors from two critical problems of the fiat-based financial system. First, Bitcoin has a limited supply of 21 million coins, a hedge against inflation that continually devalues fiat currency as more is created. Second, it's decentralized, independent of central control like the U.S. financial system, which is dominated by the Federal Reserve.\n\nAdditionally, banks use a fractional reserve system, where they leverage their deposits to lend more money than they have. That's fine until too many people try to pull their money out of the banks at once. Bitcoin's scarcity and independence from any person or party controlling it have driven demand and fantastic investment returns. Bitcoin has easily outpaced the S&P 500 despite the coin's dramatic decline in 2022.\n\nSome might ask whether Bitcoin's volatility disqualifies it as a store of value, but Bitcoin doesn't seem any more volatile than silver and gold. You can see below that gold and silver have experienced similar declines from their highs, a reminder that asset prices fluctuate.\n\nYes, Bitcoin has been more volatile than gold, but it's a less-known commodity than a precious metal that has been sought after and valued for thousands of years. Perhaps Bitcoin will become less volatile as it ages -- it's a fair question, at the least.\n\nIs Bitcoin's comeback just beginning?\n\nFor now, markets seem to value Bitcoin as a riskier asset, which declines when investors flee to safety. Gold is near its all-time high, while Bitcoin is far from it. Bitcoin's early 2023 comeback could signal that the crypto winter, as some call it, is nearing its end.\n\nInvestors will only know for sure in hindsight, but it appears Bitcoin's long-term appeal is still intact, especially after the near-miss of another crisis in the modern banking system. Bitcoin will likely remain a volatile asset, but it could have more up days than down if the market's sentiment toward riskier assets turns positive."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oZWFsdGh5LWJpdGNvaW4tcmFsbHktd2hhdC1kb2VzLWEtbWFyZ2luLWxlbmRpbmctcmF0aW8tZHJvcC1tZWFuLWZvci1idGMtcHJpY2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "Healthy Bitcoin rally: What does a margin lending ratio drop mean for BTC price? - Cointelegraph",
        "content": "Bitcoin (BTC) price rallied over 10% between April 9 and April 14, marking the highest daily close in over 10 months. While some analysts may argue the move justifies a degree of decoupling from traditional markets, both the S&P 500 and gold are near their highest levels in over six months.\n\nBitcoin price breaks $30,000 despite macro headwinds\n\nBitcoin’s gains and rally above $30,000 also happened while the U.S. Dollar Index (DYX), which measures the currency against a basket of foreign exchanges, reached its lowest level in 12 months.\n\nThe indicator fell to 100.8 on April 14 from 104.7 one month prior as investors priced in higher odds of further liquidity injections by the United States Federal Reserve.\n\nRelated: Bitcoin price teases $30K breakdown ahead of US CPI, FOMC minutes\n\nThe latest Federal Reserve’s monetary policy meeting minutes, released on April 12, made explicit reference to the anticipation of a “mild recession” later in 2023 due to the banking crisis. Even if inflation is no longer a primary concern, the monetary authority has little room to raise interest rates further without escalating an economic crisis.\n\nEven if inflation is no longer a primary concern, the monetary authority has little room to raise interest rates further without escalating an economic crisis.\n\nStrong macroeconomic data explains investors’ bullishness\n\nWhile the global economy may deteriorate in the coming months, recent macroeconomic data has been mostly positive. For example, the European Union’s statistics office reported that industrial production in the 20 member countries increased 1.5% month on month in February, whereas economists polled by Reuters expected a 1% increase.\n\nFurthermore, China’s latest macroeconomic data showed an encouraging trend, with exports increasing 14.8% year on year in March, snapping a five-month decline and surprising economists who expected a 7% decline. As a result, China’s trade balance for March was $89.2 billion, far exceeding the $39.2 billion market consensus.\n\nThe contrast between the current economic momentum and the forthcoming recession triggered by higher financing costs and a reduced appetite for risk among lenders causes Bitcoin investors to question the sustainability of the $30,000 support.\n\nLet’s look at Bitcoin derivatives metrics to better understand how professional traders are positioned in the current market environment.\n\nBTC derivatives show no excessive leverage from longs\n\nMargin markets provide insight into how professional traders are positioned because they allow investors to borrow cryptocurrency to leverage their positions.\n\nOKX, for instance, provides a margin lending indicator based on the stablecoin/BTC ratio. Traders can increase exposure by borrowing stablecoins to buy Bitcoin. On the other hand, Bitcoin borrowers can only bet on the decline of a cryptocurrency’s price.\n\nOKX stablecoin/BTC margin lending ratio. Source: OKX\n\nThe above chart shows that OKX traders’ margin lending ratio decreased between April 9 and April 11. That is extremely healthy as it shows no leverage has been used to support Bitcoin’s price gains, at least not using margin markets. Moreover, given the general bullishness of crypto traders, the current margin lending ratio of 15 is relatively neutral.\n\nThe long-to-short metric excludes externalities that might have solely impacted the margin markets. In addition, it gathers data from exchange clients’ positions on the spot, perpetual and quarterly futures contracts, thus offering better information on how professional traders are positioned.\n\nThere are occasional methodological discrepancies between different exchanges, so readers should monitor changes instead of absolute figures.\n\nExchanges’ top traders Bitcoin long-to-short ratio. Source: Coinglass\n\nInterestingly, despite Bitcoin breaking $30,000 for the first time in 10 months, pro traders have kept their leverage long positions unchanged, according to the long-to-short indicator.\n\nFor instance, the ratio for Huobi traders stood firm near 0.98 from April 9 until April 14. Meanwhile, at crypto exchange Binance, the long-to-short slightly increased, favoring longs, moving from 1.12 on April 9 to the current 1.14. Lastly, at crypto exchange OKX, the long-to-short ratio slightly declined, from 1.00 on April 9 to the current 0.91.\n\nRelated: Tesla selling Bitcoin last year turned out to be a $500M mistake\n\nMoreover, Bitcoin futures traders were not confident enough to add leveraged bullish positions. Thus, even if Bitcoin’s price retests $29,000 in terms of derivatives, bulls should be unconcerned because there has been little demand from short-sellers and no excessive leverage from buyers.\n\nIn other words, Bitcoin’s market structure is bullish, where BTC’s price can quickly rally another 10% to $33,000, given sellers are currently reluctant to short it.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vZGFpbHljb2luLmNvbS93aGF0LWlzLW1pbmluZy1pbi1jcnlwdG8tZXhwbGFpbmVkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Apr 2023 07:00:00 GMT",
        "title": "What is Mining in Crypto? - DailyCoin",
        "content": "15 years after the Bitcoin (BTC) white paper was published, ‘What is mining in cryptocurrency?’ is still the question on the tip of everyone’s tongue. The birth of blockchain technology and the crypto market began with Bitcoin mining.\n\nInitially, Bitcoin miners could mine new coins with a laptop in their bedrooms. Today, professional mining operations are worth millions, with ASIC mining farms burning through a huge amount of energy to earn new Bitcoin payouts.\n\nCrypto mining isn’t only about earning digital currency through block rewards; it also helps secure the blockchain network.\n\nDespite crypto mining being an iconic industry staple, the mining process remains complicated and inaccessible to most people. In this article, we’ll break down cryptocurrency mining for beginners and unpack how it works.\n\nWhat Is Cryptocurrency Mining?\n\nCryptocurrency mining is the process by which new blocks are added to a blockchain and new coins are ‘minted’, or created. In the case of the Bitcoin network, miners receive new bitcoins in exchange for validating transactions on a decentralized public ledger.\n\nCrypto mining is a competitive game. Miners want to accumulate as many bitcoins as possible, so having large mining rigs with powerful mining hardware gives them a better chance of earning the right to create new blocks.\n\nSource: Bloomberg\n\nWhen you have thousands of individual miners and mining farms trying to create new blocks for a distributed ledger like the Bitcoin blockchain, there needs to be an algorithm that decides who ‘wins.’ We call this the Proof-of-Work consensus mechanism.\n\nWhat Is Proof-of-Work?\n\nIn a Proof-of-Work consensus mechanism, Bitcoin miners compete to create new blocks and earn mining rewards. In its simplest definition, powerful computers work to solve complex mathematical problems and validate Bitcoin transactions. The first miner to find the answer creates the new block and earns their mining rewards.\n\nDiving a bit deeper, every new block generates a target hash. The target hash is a 64-digit hexadecimal number. These digits are made up of not only numbers from 1-10 but also letters A-F. The first miner to guess a number lower or equal to the target hash gets to create the next block and earn the reward.\n\nSource: Union Journal\n\nWith trillions of possible solutions, the odds of guessing these numbers are extremely difficult. Miners with powerful mining equipment can make more ‘guesses’ faster, giving them a better chance of being the first to find the number.\n\nWhile Bitcoin is the classic example of a Proof-of-Work chain in action, there are plenty of other examples. These include altcoins like Dogecoin (DOGE), Litecoin (LTC), and pre-merge Ethereum (ETH).\n\nBefore taking a closer look at the specifics of crypto mining, let’s have a quick recap:\n\nCryptocurrency mining creates new blocks for a blockchain network and mints new coins to the circulating supply.\n\nMiners compete amongst themselves to solve complex equations, verify new transactions and earn mining rewards.\n\nHigher computing power increases the chance of being the first miner to solve an equation.\n\nHow Does Bitcoin Mining Work?\n\nWhen Satoshi Nakamoto first published the Bitcoin white paper, bitcoin mining was far more democratized than now. Anyone with a computer could start mining at home with a half-decent GPU (Graphics Processing Unit).\n\nBitcoin mining has since become a serious business, with ASIC (Application-Specific Integrated Circuits) mining farms reaching explosive hash rates and boosting mining difficulty.\n\nIndividual miners struggle to compete with the larger players. To compete in the crypto mining monopoly, smaller miners often join forces to create mining pools, where each miner gets their fair share of new coins.\n\nMining Difficulty\n\nAs the name would suggest, mining difficulty refers to the complexity of the problem each miner is trying to solve. Remember the hexadecimal number that every miner tries to find that we mentioned earlier? The more miners competing to create new blocks, the more possible solutions there are that miners have to guess correctly.\n\nWhen mining difficulty is high, that generally means that market conditions are bullish for Bitcoin or whichever PoW cryptocurrency is being mined. Another way of looking at crypto mining demand is a network’s hash rate.\n\nHash Rate\n\nA blockchain’s hash rate is an indicator of its computational power. Put simply, a network’s hash rate measures how many guesses all miners in the system make per second. To give you an idea, in Q1 2023, Bitcoin averaged a hash rate of roughly 310 million terahashes per second.\n\nSource: BitInfoCharts\n\nA hash rate can also refer to the computational power of individual mining units or groups of miners. Powerful ASIC miners with high hash rates have a better of solving the mining puzzle first, making them far more desirable than smaller CPUs.\n\nWhat Is the Bitcoin Halving?\n\nThe Bitcoin halving is an event that happens every 210,000 blocks, or roughly every four years. After each halving, the number of new bitcoins in each block reward is cut in half.\n\nWhen the Bitcoin blockchain first went live, each newly minted block paid out 50 bitcoins to miners. Since then, we’ve witnessed three Bitcoin halvings, bringing the block rewards to 6.25 bitcoins per newly created block.\n\nSome miners anticipate that the last Bitcoin will be mined sometime around 2140. If this eventually comes to pass, miners will still earn rewards paid in BTC. However, these rewards will come from network transaction fees rather than newly minted block rewards.\n\nThe Bitcoin Halving is considered a significant event that historically marks the start of a new bull run. This is because when new emissions of BTC are cut in half, the selling pressure that miners generally provide evaporates. After every recorded halving, the price of Bitcoin has reacted positively.\n\nCrypto Mining Pros and Cons\n\nWhile crypto mining can be a good way to acquire new coins and help secure a blockchain network you want to support, many drawbacks remain.\n\nPros\n\nEarn Crypto Rewards\n\nThe main benefit that attracts people to crypto mining is simple. Crypto mining can be a profitable enterprise if managed correctly. Mining cryptocurrencies like Bitcoin or Dogecoin gives investors a revenue stream of their chosen cryptos.\n\nFor miners with a long-term outlook, this is a great way to accumulate new coins without buying them from a crypto exchange like Coinbase.\n\nSecure and Decentralize a Network\n\nOn top of earning rewards, miners also help to keep the blockchain safe from hacks and malicious actors. Moreover, running a mining operation also helps to decentralize and further distribute the blockchain, making it less reliant on central points of failure.\n\nThis aligns with the original vision of the Bitcoin network, which is to provide a distributed public ledger owned and operated by the people, for the people.\n\nCons\n\nSustainability Problems\n\nPerhaps the biggest issue facing Bitcoin and its mass adoption is its monstrous energy consumption. The Proof-of-Work consensus mechanism demands an enormous amount of power. For example, when Ethereum transitioned to a Proof-of-Stake mechanism, the network reduced its power consumption by 99%.\n\nSource: Bitcoin Energy Consumption Index\n\nAccording to the Bitcoin Energy Consumption Index, the network consumes as much energy as the entire nation of Kazakhstan over a year and has a carbon footprint equivalent to that of Singapore.\n\nHigh Costs\n\nStarting a mining operation is a risky business. First, there’s no guarantee that you’ll be able to turn a consistent profit through crypto mining. Volatility in the crypto market presents a constant and significant risk to new miners trying to enter the mining business.\n\nNot to mention the expensive mining equipment and high electricity costs associated with crypto mining.\n\nOn the Flipside\n\nDue to Bitcoin’s immense energy consumption concerns, emerging blockchains are moving away from crypto mining and the Proof-of-Work algorithm. Top blockchain protocols like Ethereum, Cardano, and Avalanche all use a variety of a Proof-of-Stake mechanism, which is far more energy efficient.\n\nWhy You Should Care\n\nWith time, crypto mining outside the Bitcoin blockchain might cease as emerging networks opt for more sustainable alternatives.\n\nFAQs"
    }
]