[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTMxL3Nob3VsZC1pLWJ1eS1iaXRjb2luLXByaWNlLWdhaW5zLWZ1ZWwtZW5kb3JzZW1lbnRzLWZyb20tZmluYW5jaWFsLXBsYW5uZXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Should I Buy Bitcoin? Price Gains Fuel Endorsements from Financial Planners - Bloomberg",
        "content": "Bitcoin’s climb to $35,000 is helping to restore its reputation in the world of investment advice.\n\nThe world’s largest cryptocurrency has more than doubled from last year’s epic collapse, a significant development when stocks have dropped and bond yields are surging. With the Federal Reserve planning to keep interest rates high, and geopolitical tensions threatening financial stability, some advisors say adding Bitcoin to an investment portfolio can be a good way to diversify."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0xMC0zMS9iaXRjb2luLXMtYnRjLWV0Zi1tb21lbnR1bS1pcy1zcHVycmluZy10aGUtYmlnZ2VzdC1tb250aGx5LWdhaW5zLXNpbmNlLWphbnVhcnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin's ETF Momentum is Spurring the Biggest Monthly Gains Since January - Bloomberg",
        "content": "Fifteen years after the unofficial launch of Bitcoin, digital-asset enthusiasts are touting the cryptocurrency as finally being on the verge of mainstream acceptance.\n\nBitcoin has rallied about 27% in October, the biggest monthly increase since January, on surging expectations that the US Securities and Exchange Commission may soon approve exchange-traded funds that invest directly in the cryptocurrency after more than a decade of deliberation. Bitcoin was trading at around $34,450 on Tuesday, compared with $16,540 at the end of last year."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2FiZDQyODNkLWVlN2QtNDFhMi05NDI2LTQyYjlkM2UxMjljZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin: trial of SBF is no match for ETF enthusiasm - Financial Times",
        "content": "Print this page\n\nThe collapse of cryptocurrency exchange giant FTX marked the depths of the crypto downturn. Yet the ensuing trial of founder Sam Bankman-Fried, accused of defrauding customers, has not dragged crypto prices down further. Despite negative publicity, the price of bitcoin has doubled in the past year.\n\nThis has been attributed to two things. In early 2024, rewards for bitcoin miners are expected to drop by 50 per cent. The result is a tightening of supply that could lift prices. At the same time, the US could be on the cusp of regulatory action that confers new legitimacy on to digital assets.\n\nNext year, bitcoin buyers expect the US Securities and Exchange Commission to give BlackRock and other financial companies permission to launch exchange traded funds that invest directly in bitcoin. This, they believe, could spur more adoption by institutional investors and act as a challenge to nefarious, unregulated crypto platforms.\n\nBoth assumptions are wrong, even if the SEC grits its teeth and grants approval. ETFs may be more appealing than setting up wallets and buying tokens directly from unregulated exchanges, but their existence does not eliminate scams and volatility that investors find off-putting. When ProShares launched the first ETF that tracked contracts speculating on the future price of bitcoin in late 2021, bitcoin prices rose. The ETF finished its first day of trading at close to $42. It now trades at $17.50.\n\nThe global cryptocurrency market cap has fallen from a $3tn market cap to about $1.3tn. Elon Musk, an outspoken supporter of digital assets, has not opted to expose his electric car company Tesla to further price swings. Tesla invested $1.5bn in bitcoin in early 2021 to “maximise returns on our cash”. At the last count, its digital assets were just $184mn.\n\nLiquidity is in short supply. Remaining platforms are under pressure from regulators. Trading volumes at Coinbase, the largest US digital asset platform, fell 55 per cent in the first six months of the year. Without a supply of new money, the latest price rally is unsustainable."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTAvMzEvYml0Y29pbi1jb3VsZC1oaXQtMTUwMDAwLWJ5LTIwMjUtcHJlZGljdHMtYmVybnN0ZWluLmh0bWzSAVxodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8xMC8zMS9iaXRjb2luLWNvdWxkLWhpdC0xNTAwMDAtYnktMjAyNS1wcmVkaWN0cy1iZXJuc3RlaW4uaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin could hit $150,000 by 2025, predicts Bernstein - CNBC",
        "content": "The price of bitcoin could rise to $150,000 by 2025, Bernstein said Tuesday in a note citing optimism about a bitcoin exchange-traded fund.\n\nBernstein analyst Gautam Chhugani said the firm expects the U.S. Securities and Exchange Commission to approve a bitcoin ETF by the first quarter of 2024.\n\nThe bullish estimate is about five times the current price of around $34,000 and more than double bitcoin's all-time high of more than $67,000 set in November 2021.\n\nBernstein also expects that ETF approval would shift up to 10% of bitcoin's circulating supply toward ETFs. The approval would allow conventional investors to get bitcoin exposure directly from their investment portfolios. The only similar product is Grayscale's Bitcoin Trust , or GBTC, which presently holds around 3% of outstanding bitcoin, according to the note.\n\n\"You may not like Bitcoin as much as we do, but a dispassionate view of Bitcoin as a commodity, suggests a turn of the cycle,\" Chhugani wrote. \"A good idea is only as good as its timing - SEC approved ETFs by world's top asset managers (BlackRock, Fidelity et al), seems imminent.\"\n\nThe prediction came in a note where Chhugani initiated coverage on several bitcoin mining firms, saying that the bitcoin \"halving\" in April 2024 — in which bitcoin rewards will be halved as part of a planned and recurring event baked into the currency's underlying code — will force \"losing miners\" to be \"washed out,\" paving the way for big gains by the survivors.\n\nLast week, the price of bitcoin reached $35,000, its highest level since May 2022. Investors have said they remain hopeful for a green light on the ETF by the end of the year after the SEC declined to appeal a key court ruling in Grayscale's lawsuit against it.\n\nHowever, the court ruling does not guarantee the SEC will approve a bitcoin ETF. SEC Chair Gary Gensler has long criticized the crypto industry as being rife with \"fraudsters and scam artists,\" so whether the regulator will continue to fight against crypto ETFs is an open question.\n\nThe crypto industry has faced recent struggles, including the SEC's lawsuit against Binance for securities violations earlier this year. Last year, crypto exchange FTX filed for bankruptcy and its former CEO Sam Bankman-Fried is currently on trial for fraud.\n\n\n\nDon't miss these CNBC PRO stories:"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvaWYteW91LWludmVzdGVkLSUyNDEwMDAtaW4tYml0Y29pbi13aGVuLXdhcnJlbi1idWZmZXR0LWNhbGxlZC1pdC1yYXQtcG9pc29uLXNxdWFyZWQtaGVyZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 31 Oct 2023 07:00:00 GMT",
        "title": "If You Invested $1000 In Bitcoin When Warren Buffett Called It 'Rat Poison Squared,' Here's How Much You'd Have Now - Nasdaq",
        "content": "Leading investor Warren Buffett is well-known for his sharp investment eye and buying companies and acquiring stock and watching values rise over the years.\n\nOne sector that Buffett has shied away from is cryptocurrency. Here's a look at Buffett's thoughts on cryptocurrency and how investors may have wanted to avoid the Oracle of Omaha's advice in this particular case.\n\nWhat Happened: Buffett has been a vocal critic of the leading cryptocurrency Bitcoin (CRYPTO: BTC) for many years. The bearish position of the Berkshire Hathaway Inc (NYSE:BRK)(NYSE:BRK) CEO even made him named Bitcoin enemy number one by entrepreneur Peter Thiel previously.\n\nIn January 2018, Buffett warned investors about investing in cryptocurrency.\n\n\"In terms of cryptocurrencies, generally, I can say with almost certainty that they will come to a bad ending,\" Buffett said at the time. \"If I could buy a five-year put on every one of the cryptocurrencies, I'd be glad to do it but I would never short a dime's worth.\"\n\nRelated Link: Exclusive – Scaramucci On What Warren Buffett Gets Wrong About Bitcoin\n\nA few month later, Buffett took his feelings on Bitcoin further during an interview with CNBC.\n\nReiterating Berkshire Vice Chairman Charlie Munger's thoughts that Bitcoin is \"rat poison,\" Buffett told CNBC anchor Becky Quick that the cryptocurrency is \"probably rat poison squared.\"\n\nBuffett has said that he wouldn't buy Bitcoin even if it dropped to $25.\n\nWhile the billionaire investor has not bought cryptocurrencies and has continued to speak out against them, he does own shares of a company that has bet on Bitcoin and other leading cryptocurrencies.\n\nAs Benzinga previously reported, Buffett and Berkshire Hathaway are shareholders in Nu Holdings (NYSE:NU), a Latin American digital bank. Nu Holdings is a crypto-friendly bank and has launched several cryptocurrency products along with allocating a portion of its cash to Bitcoin.\n\nMeet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga’s exclusive event: Future of Digital Assets. Tickets are flying: Get yours!\n\nInvesting $1,000 in Bitcoin: While Buffett said he wouldn't invest in Bitcoin even if it hit $25, some investors have chosen to allocate a portion of their investments or holdings in the leading cryptocurrency.\n\nBitcoin traded between $9,695.12 and $9,964.50 on May 5, 2018 — the day of Buffett's \"rat poison squared\" comment.\n\nAn investor could have purchased 0.1004 BTC at the coin's high price of that day.\n\nThe $1,000 investment would be worth $3,462.82 today based on a price of $34,490.19 for Bitcoin at the time of writing. This represents a return of 246.3% since Buffett's comments.\n\nFor comparison, shares of Berkshire Hathaway are up 76.2% over the same time period, based on a starting price of $294,720 each.\n\nThe SPDR S&P 500 ETF Trust (NYSE:SPY), which tracks the S&P 500 Index, is up 56.8% over the same time period, based on a starting price of $266.89.\n\nAs investors can see, Bitcoin has outperformed both the S&P 500 and Berkshire Hathaway since Buffett's now famous quote about the leading cryptocurrency.\n\nWhile Buffett has said he wouldn't touch cryptocurrency even if it hit $25 per coin, investors who bought when the legendary investor made his quote would be glad that they did.\n\nReady to win big? Discover the #1 strategy for trading options in today's unpredictable market… with potential gains of 44%, 125% and even 411% every month on average. Starting at only $1 a day. Click here now.\n\n© 2023 Benzinga.com. Benzinga does not provideinvestment advice All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]