[
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wNC0yMS9hLWNsb3Nlci1sb29rLWF0LWJpdGNvaW4tcy1idGMtcmFsbHktc3VnZ2VzdHMtdGhlLWRlcHRoLW9mLWRlbWFuZC1pcy1kZWNlcHRpdmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Rally Data Suggests Depth of Demand Is Deceptive - Bloomberg",
        "content": "Crypto trading volumes seem to have surged last quarter as token prices spiked higher. But looking at the data more closely paints a different picture.\n\nWhen looking at overall trends, Bitcoin trade volumes seem to have spiked, with two trading pairs standing out during that stretch — Bitcoin-Tether and Bitcoin-BUSD, a relatively little-known stablecoin trading on the Binance platform that has since halted issuance, according to crypto market data provider Kaiko. Those two were the top-traded duos on that exchange in the first three months of the year."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2lucy1kb21pbmFuY2UtcmF0ZS1ydW5zLWZhbWlsaWFyLTExMjEyOTMxMy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Dominance Rate Runs Into Familiar Resistance, Hints at 'Altcoin Season' Ahead - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nThe increase in bitcoin's (BTC) dominance rate, or the largest cryptocurrency's share of the overall crypto market, has halted, hinting at the potential outperformance of alternative tokens known as altcoins ahead.\n\nAltcoins are any cryptocurrency other than bitcoin.\n\nData from TradingView show bitcoin's dominance rate rose to 48% from 42% during the first quarter and has struggled to surpass that level so far this month.\n\nThe metric has oscillated between 38% and 48% for almost two years, with declines from 46% to 48% coinciding with outsized gains in altcoins.\n\n\"Bitcoin’s dominance could peak out, this would signal that altcoins would outperform,\" Markus Thielen, head of research and strategy at crypto-services provider Matrixport, said in a note to clients on Thursday.\n\nBitcoin's dominance rate's previous declines from 48% coincided with the altcoin market boom. (CoinDesk/TradingView)\n\nThe chart shows that the total market cap of altcoins (white line, blue arrows) rose more than 60% to $1.39 trillion in the two months after the BTC dominance rate turned lower from 48% in July 2021. Similar bearish turnarounds in the dominance rate in mid-October 2021 and June 2022 also pushed altcoin valuations higher.\n\nHistory could repeat itself, according to Thielen.\n\n\"Bitcoin’s dominance appears to be peaking out at similar levels as in 2022 – accounting for 45/46% of the total crypto market capitalization,\" Thielen said. \"For bitcoin to continue outperforming the rest of the ecosystem would imply that only bitcoin matters, which appears to be unlikely considering the intellectual and financial firepower that is being deployed on other chains.\n\n\"Bitcoin benefited from U.S. liquidity, but going forward, this could change,\" he said."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXdoYWxlLW1vdmVzLW5lYXJseS04bS0xODEzMTk1NjkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Whale Moves Nearly $8M After 10 Years of Inactivity - Yahoo Finance",
        "content": "Another sleeping Bitcoin whale just woke up.\n\nToday, a holder who hadn’t touched their cryptocurrency for a decade moved over 279 BTC—or $7.8 million worth—to three new wallets, according to a tweet from on-chain sleuth, Lookonchain.\n\nThe blockchain tracker said in a Friday tweet that the whale in question had originally received 1,128 BTC in the months of October 2012 and May 2013, when prices were about $12 and $195, respectively. In total, the whale holds $31.6 million in BTC.\n\nA whale with 1,128 $BTC($31.6M) that has been dormant for 10 years transferred 279 $BTC($7.8M) to 3 new addresses just now. The whale received 1,128 $BTC in October 2012 and May 2013, when prices were $12 and $195.https://t.co/2MxnVzcEMl pic.twitter.com/2GM7Oq4e2P — Lookonchain (@lookonchain) April 21, 2023\n\nAncient, untouched Bitcoin stashes have been on the move lately. “Whales”—those who have hoarded huge amounts of cryptocurrency—sometimes reemerge after a long stretch of time to move their investment to other addresses.\n\nIn February, an old BTC address that had not budged in 11 years came back to life to move $9.6 million worth of the cryptocurrency—which had appreciated by 120,000,000% over the years.\n\nBitcoin whales are the most successful crypto investors, according to research from the Bank for International Settlements. In February, it said that those who sit on the asset for years tend to do well, while the retail investor who buys and sells in a short time frame typically loses out.\n\nStory continues\n\nBlockchain firm Arkham Intelligence told Decrypt in February that data shows that Bitcoin investors are again focusing on long-term gains, as over 53% of coins ever minted hadn’t budged for more than two years by that point.\n\nNumber of Bitcoin Whales Drops to Lowest Level Since 2019\n\nAt the time of writing, Bitcoin is trading for about $27,900, according to CoinGecko, still way below—by nearly 60%—the $69,045 all-time high it hit in November 2021. It is also down over 8% in the past week.\n\nBut the largest digital asset by market cap is still up massively this year, having gone from under $17,000 in January to $30,000 last week."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXdoYWxlLW1vdmVzLW5lYXJseS04bS0xODEzMTk1NjkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Whale Moves Nearly $8M After 10 Years of Inactivity - Yahoo Finance",
        "content": "Another sleeping Bitcoin whale just woke up.\n\nToday, a holder who hadn’t touched their cryptocurrency for a decade moved over 279 BTC—or $7.8 million worth—to three new wallets, according to a tweet from on-chain sleuth, Lookonchain.\n\nThe blockchain tracker said in a Friday tweet that the whale in question had originally received 1,128 BTC in the months of October 2012 and May 2013, when prices were about $12 and $195, respectively. In total, the whale holds $31.6 million in BTC.\n\nA whale with 1,128 $BTC($31.6M) that has been dormant for 10 years transferred 279 $BTC($7.8M) to 3 new addresses just now. The whale received 1,128 $BTC in October 2012 and May 2013, when prices were $12 and $195.https://t.co/2MxnVzcEMl pic.twitter.com/2GM7Oq4e2P — Lookonchain (@lookonchain) April 21, 2023\n\nAncient, untouched Bitcoin stashes have been on the move lately. “Whales”—those who have hoarded huge amounts of cryptocurrency—sometimes reemerge after a long stretch of time to move their investment to other addresses.\n\nIn February, an old BTC address that had not budged in 11 years came back to life to move $9.6 million worth of the cryptocurrency—which had appreciated by 120,000,000% over the years.\n\nBitcoin whales are the most successful crypto investors, according to research from the Bank for International Settlements. In February, it said that those who sit on the asset for years tend to do well, while the retail investor who buys and sells in a short time frame typically loses out.\n\nStory continues\n\nBlockchain firm Arkham Intelligence told Decrypt in February that data shows that Bitcoin investors are again focusing on long-term gains, as over 53% of coins ever minted hadn’t budged for more than two years by that point.\n\nNumber of Bitcoin Whales Drops to Lowest Level Since 2019\n\nAt the time of writing, Bitcoin is trading for about $27,900, according to CoinGecko, still way below—by nearly 60%—the $69,045 all-time high it hit in November 2021. It is also down over 8% in the past week.\n\nBut the largest digital asset by market cap is still up massively this year, having gone from under $17,000 in January to $30,000 last week."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vd3d3LmJlbnppbmdhLmNvbS9hbXAvY29udGVudC8zMTk0MjEyNNIBLWh0dHBzOi8vd3d3LmJlbnppbmdhLmNvbS9hbXAvY29udGVudC8zMTk0MjEyNA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 21 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum And Dogecoin Drop Following Hawish Inflation Data: What To Watch Over The Weekend - Benzinga",
        "content": "This 141-Year-Old Retailer Is Outperforming Amazon Forget tech behemoths. This old stock is expanding faster while raising dividends. Believe it or not, it has handily beaten Amazon’s 117% run since 2019. By reading Benzinga’s latest insider-only report, you can set yourself up for future profits and income with this stock, plus more.Get access for just $0.99.\n\nBitcoin (CRYPTO: BTC) was falling about 3% lower during Friday’s trading session, showing weakness compared to the general market, which saw the S&P 500 holding flat.\n\nThe crypto sector appeared to be trading more in tandem with spot gold, which was retracing about 1.3% lower.\n\nENTER TO WIN $500 IN STOCK OR CRYPTO Enter your email and you'll also get Benzinga's ultimate morning update AND a free $30 gift card and more! {{message}} {{message}}\n\nU.S. Services Purchasing Managers' Index rose from 52.6 points in March to 53.7 points in April, which came in above the expectation of 51.5. The news had investors fearing the Federal Reserve may continue with its hawkish stance when it meets in May to decide whether to continue hiking interest rates or pause.\n\nEthereum (CRYPTO: ETH) was following Bitcoin to trade about 5% lower, and Dogecoin (CRYPTO: DOGE) was falling by about the same amount.\n\nTraders will be watching the crypto sector over the weekend for clues on how the S&P 500 may open on Monday.\n\nWant direct analysis? Find me in the BZ Pro lounge! Click here for a free trial.\n\nThe Bitcoin and Ethereum Charts: Bitcoin and Ethereum reversed downward on April 14 and April 16, respectively, with both negating their uptrends on Friday by printing lower lows.\n\nBitcoin’s most recent high was printed on April 14 at $31,050 and Ethereum’s high was formed at the $2,142 mark two days later. Although the cryptos negated their uptrends, neither has bounced up to print a lower high yet to confirm a new downtrend is intact.\n\nBitcoin and Ethereum were working to print bearish Marubozu candlesticks on Friday, which may indicate more downside is on the horizon before a bounce. Traders can watch for the cryptos to eventually print a bullish reversal candlestick, such as a doji or hammer candlestick, to indicate the bounce is on the horizon.\n\nBitcoin has resistance above at $28,690 and $31,418 and support below at $25,772 and $25,288.\n\nEthereum has resistance above at $1,957 and $2,150 and support below at $1,846 and $1,717.\n\nThe Dogecoin Chart: Dogecoin’s drop on Friday caused the crypto to fall under the 200-day simple moving average, which is bearish and the crypto also printed a lower low to negate its uptrend. Like Bitcoin and Ethereum, Dogecoin was working to print a bearish Marubozu candlestick.\n\nThe move lower was coming on lower-than-average volume, which indicates a reversal to the upside may be in the cards over the next few days. Bullish traders can watch for Dogecoin to eventually print a reversal candlestick to indicate a bounce is in the cards.\n\nDogecoin has resistance above at $0.083 and $0.091 and support below at $0.075 and at 7 cents.\n\nRead Next: 'Rich Dad, Poor Dad' Author Says Bitcoin On Its Way To $100K"
    }
]