[
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTEzL29uY2UtaGlnaC1mbHlpbmctY3J5cHRvLXJlbGF0ZWQtZnVuZHMtYXJlLXN0cnVnZ2xpbmctdG8tZHJhdy1hbnktYXR0ZW50aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Crypto’s Falling PR Image Hurts Interest in Bitcoin, ETFs - Bloomberg",
        "content": "The cryptoverse has seen what seems like a lifetime of ups and downs already this year, yet activity in products linked to the industry have been nearly nonexistent, with analysts saying that investors have abandoned the sector without plans to come back anytime soon.\n\nNearly $172 million exited from global exchange-traded products tracking everything from Bitcoin to Cardano in the first six months of 2023 amid an industry wide rally, following outflows of just $37 million in 2022. That compares to record cash inflows of nearly $10 billion in 2021 and $6.7 billion in 2020, Bloomberg data show."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTEzL21pY3Jvc3RyYXRlZ3ktcy1tc3RyLXNheWxvci1zYXlzLWJpdGNvaW4tYnRjLW1hcmtldC1zaGFyZS13aWxsLWNsaW1iLXRvLTgw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "MicroStrategy’s (MSTR) Saylor Says Bitcoin (BTC) Market Share Will Climb to 80% - Bloomberg",
        "content": "Bitcoin’s dominance of the cryptocurrency markets will nearly double as more investors gravitate to the original digital asset while regulators continue to crack down on the sector, according to MicroStrategy Inc.’s Michael Saylor .\n\nBitcoin currently accounts for nearly 48% of crypto’s $1 trillion market value, according to data tracker CoinMarketCap. Its dominance will rise to 80%, as other coins are declared securities by regulators and their use is reduced, Saylor said in a Bloomberg Television interview. MicroStrategy is the enterprise-software that Saylor co-founded and has made into the largest public holder of the cryptocurrency."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcHBsZS1hcHAtc3RvcmUtc2F5cy1kYW11cy0xNDExMTg1NDcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Apple App Store Says Damus Has 2 Weeks to Cut Bitcoin Tipping or Get Booted - Yahoo Finance",
        "content": "Decentralized social networking app Damus was today warned by Apple’s App Store that it has fourteen days to bring its tipping feature into compliance or it will face removal from the app store, according to a tweet by Damus on Tuesday.\n\nDamus’s tipping function—known as \"zaps\"—lets users send Bitcoin to their favorite content creators via the blockchain’s second-layer Lightning Network, but the feature appears to have fallen foul of Apple’s terms by not using the tech giant’s in-app purchase mechanism.\n\nApple has given Damus until June 27 to bring its app into compliance or it will be removed from the store.\n\nDamus will be removed from the app store in 14 days, apple says zaps are not allowed on their platform because they *could* be used by content creators to sell digital content. This is right before we’re about to give our talk at the oslo freedom forum on how decentralized social… pic.twitter.com/uAK1U0UBet — Damus⚡️ (@damusapp) June 13, 2023\n\nDamus described the move as “pretty sus” given the timing: right before the team appears at Oslo’s Freedom Forum to talk about how Bitcoin and decentralized social media can help bring about financial freedom.\n\n\"They are trying to make the argument that since zaps potentially enable content creators to sell digital content with Lightning, this would be against their guidelines,\" Damus developer William Casarin told Decrypt. \"This threatens any app on the app store that interacts with Lightning in any way.”\n\nHe further explained that while Damus was not explicitly enabling the sale of digital content through Bitcoin, today’s clampdown on peer-to-peer payments means that “any app that allows users to post lightning invoices may suffer from the same line of reasoning.\"\n\nApple’s 30% slice on NFTs\n\nThis isn’t the first time that Apple’s app store has found itself at loggerheads for control over emerging technology.\n\nStory continues\n\nAt the end of 2022, the iPhone maker began charging its standard 30% commission on in-app NFT sales, a move which industry Epic Games CEO Tim Sweeney at the time called “grotesquely overpriced.”\n\nApple’s hefty cut once again made headlines this year. This time in connection with OpenAI’s famous ChatGPT chatbot. The machine learner’s progenitors opted to remain compliant with the App Store’s terms, opting for the in-house in-app purchase mechanism rather than setting up a separate subscription site.\n\nOpenAI may not mind playing ball, but federal law appears to partially be in Apple critics’ favor.\n\nEpic Games filed a lawsuit against Apple over its 30% tax back in 2020. Recently, the U.S. federal appeals court ruled that while Apple breached California’s Unfair Competition Law by forbidding alternative payment methods, it did not break U.S. antitrust laws.\n\nBoth parties last week asked the court to reconsider its ruling."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wNi0xMy9yZWd1bGF0b3JzLWhhdmUtbm8tbG92ZS1mb3ItYml0Y29pbi1vci1jcnlwdG8tc2F5bG9yLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Regulators Have No Love for Bitcoin or Crypto: Saylor - Bloomberg",
        "content": "00:00\n\nI feel like we already have clarity in terms of the US regulatory regime for now. Gary Gensler at the S.E.C. seems to want to stop any crypto companies in their tracks and either have them close their businesses down completely or move offshore. How do you think how do you think it's all playing out? Well, I think MicroStrategy is view since 2020 has been that the only institutional grade investable assets in the crypto space is bitcoin. Bitcoin is the universally, globally acknowledged digital commodity in this industry. I think it's pretty clear that the regulators don't see a legitimate path forward for crypto currencies like the stable coins, crypto securities, like the tokens mentioned. They don't they don't have any love for crypto derivatives. They don't have any love for crypto tokens. And and they have a view of crypto exchanges, which is of far constrained. I mean, their view is crypto exchanges should change, which should trade and and hold a pure digital commodities like Bitcoin. And so the entire industry is kind of destined to be rationalised down to a bitcoin focused industry with maybe a half a dozen to a dozen other other proof of work tokens. So, Michael, what happens then to the exchanges in the US, at least it seems? You know, if they're only going to offer trading in Bitcoin or other, you know, clearly pure commodity tokens, that's not going to be a great business model. Do exchanges in the US just go away? I take a different point of view there. I think there's been a lot of confusion because of the 25000 other cryptos and because of of all of the crypto securities that have been angling to position himself as the next bitcoin or a better bitcoin. So now I think that the public is beginning to realize that bitcoin is the next Bitcoin. The next logical step is for bitcoin to 10x from here and then 10x again. So eventually I have confidence that the crypto exchanges will come around to realizing that Bitcoin really is the dominant asset in this space and their business models are fine. When bitcoin goes up by a factor of 10 and you know, we can see that the dominance of bitcoin and the crypto economy as measured by coin market cap has moved from 40 to 48 percent this year alone. But I think that is the stable coins and the tokens go away that long term dominance is headed for 80 percent. And I think what you got to remember is the reason that we don't have mega institutional money flowing into this space is confusion and anxiety. When that disappears, you're going to see mega amounts of money flow into space and the business models will be just fine focused on Bitcoin. Michael, I want to ask what the future of some of these centralized exchanges does look like right now, because to your point that maybe once that confusion clears up, more institutions will come in. When you have a company like Coinbase, obviously there's a big regulatory overhang right now for normal investors in the space, not the big institutions. Do you see them moving away from these sort of centralized exchanges, maybe gravitating more towards cold wallets from here? Well, you know, I I think that there is a massive need for exchanges to help people acquire Bitcoin in custody, bitcoin, especially as the pension funds, the insurance companies, the banks, the institutional investors get into the space. Companies like grayscale need to have a custodian. So. So I see a lot of bullish things for bitcoin on the horizon. I think the accounting treatment, the upcoming having the explosion and the half hour hash rate and also the clarity that has come out of the S.E.C. of late is actually laying the foundation for the next bull run. And and there is a place for crypto exchanges to help people buy bitcoins, sell bitcoin, custody, bitcoin, and. And I don't think that's going away. I think that's going to be a great business. Michael, how does MicroStrategy actually accumulate its bitcoin and has that process changed at all? We use a variety of of institutional grade bitcoin companies, we work with Coinbase and we have work with Coinbase. We have a number of institutional grade custodians as well. MicroStrategy has been kind of special in this regard because unlike, say, an ETF or the like, we're able to access the Bitcoin spot markets and hold Bitcoin. And we're also able to access the equity in the debt markets as we pursue our Bitcoin acquisition strategy. How is. I mean, you've outperformed Beto and Gray Scale and other, you know, ETF exchange traded products year to date. How how is your strategy, though, in your company different from one of these, you know, products that just hold large amounts of bitcoin? Well, we're an operating company, so we have a profitable software business and so we can sweep the cash flows of our software business into Bitcoin. Our aim is, is to allow institutional investors to get bitcoin exposure, but without charging them a fee and generating a yield when we can. And because we're able to tap the debt markets, we're able to issue debt. We're also able to refinance or pay back our debt like when we retire our silver gate loan earlier this year. We're able to issue equity when it's a creative we're able to purchase bitcoin with with cash flows when it's a creative. So those are our flexibilities you have as an operating company. If you were in FCC 40 company like an ATP or like grayscale as a trust, you can't really do those things. And I mean, the result is, you know, Bitcoin is up 55 percent this year to date. MicroStrategy is up 92 percent this year to date."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wNi0xMy9tYXJhdGhvbi1kaWdpdGFsLWNlby1leHBlY3RzLW1vcmUtYml0Y29pbi1taW5lci1kZWFscy12aWRlb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 13 Jun 2023 07:00:00 GMT",
        "title": "Marathon Digital CEO Expects More Bitcoin Miner Deals - Bloomberg",
        "content": "00:00\n\nYou have a lot of crypto companies saying that they're looking overseas, that they're looking to get out of the US. What's Marathon's view? Are you looking at offshore opportunities here? Well, we recently announced a new project in the UAE where we're building one of the largest digital asset operations or mining in Abu Dhabi. We're also looking in other places. Our goal, a longer term is to be about 50 percent offshore, 50 percent onshore. Bitcoin is treated a little bit differently than broader crypto. The SCC and the CFTC have both given it clarity that Bitcoin is a commodity. It's not a security. So Bitcoin is being treated a little bit differently and I think the situation around Bitcoin is different. That being said, clearly, you know, all the way up to the top at the White House, the economic report that they issued in January had a very different tone than the one they issued prior year. So clearly this is coming from the top that crypto is bad in their views. But we're very hopeful that the legislation that is going through Congress now will hopefully add some market structure guidelines and alleviate some of the lack of clarity that exists today so that the regulators can operate in a more friendly way towards the industry that will allow people to innovate, build businesses in the US as opposed to just moving offshore. Is there any hope, Fred, in kind of fighting this crackdown from the S.E.C. in the court of public opinion? I mean, you mentioned legislation. Obviously, that's, I guess, the main mechanism through which you you would change the FTSE mandate, because so many of these coins, you can argue that they're a commodity and not a security. So I think part of the challenge is that with no clear legal rules, legislation around this, the FCC mandate is seemingly a little broader than it should be. There have been some mentions of overreach. I think there is a Republican member of the House that has put forth a bill that essentially would restructure the FCC. So I think momentum is building towards people really starting to pay attention to this at the end of the day. Congress needs to provide very clear legislation. And then I think the FCC and the CFTC have to come to terms regarding how this is all going to be regulated. But, you know, a lot of this is definitely potentially a bit of strong arming. You think about what the FCC is doing by essentially scaring people enough. They will achieve the end that they're looking for, which is to move all this off shore. You look at all these coins that have been delisted by exchanges. You look at Robinhood Hood listing all coins and stopping trading in crypto. You know, essentially the S.E.C. is achieving its end without having to take all these people were caught. So it's a matter of who gets to the finish line first and what happens come next year. You we have three presidential candidates who have come out on the Republican side that are pro bitcoin. And I think momentum, again, is building for at least a more positive environment for bitcoin in the US. But we'll have to see what Congress can do to really rein things in and get everybody aligned around how things should operate so people can get back to business. You mentioned Robin Hood. We've also seen E Toro stop new purchases of these tainted 19 coins, so to speak. Are you also avoiding any any tokens that the S.E.C. has deemed securities? Well, we're a pure Bitcoin company. So in our case, we focus on Bitcoin. It's been declared a commodity by both the SCC and the CFTC. So we're continuing just business as usual. And Fred, I'd love to get your thoughts on the mining industry. Take a step back and talk about the state of Bitcoin mining, because obviously Bitcoin had a great 20 twenty three up well over 50 percent, but still down dramatically from its peaks. What does that mean for your margins? What is your current break even rate look like and how does that compare to the rest of the industry? The industry has been going through a big upgrade cycle. There's some recent reports that have been issued that show that energy consumption is maintaining at the same level. But at the same time, the global hash rate or the amount of compute power that's applied to bitcoin mining has increased substantially. We've grown substantially. We've doubled our capacity year to date over the end of last year and will continue to grow at more throughout this year. We're using the most modern, most energy efficient machines. What we're seeing is miners that had older machines have been upgrading those to more energy efficient machines, which is making the overall industry more energy efficient. So I think people are continued to grow. Margins are essentially staying flat to a little bit lower because as global hash rate grows, the difficult. The increases, but Bitcoin prices obviously moved in the right direction this year. So I think what we're going to see is a slow uptick in the price of Bitcoin over the balance of this year leading into the having next year. At that point, there's a big impact to margins because companies cost to mine will essentially double. Right. So it'll be very interesting to see, you know, miners are very focused now on becoming more energy efficient. We have one of the most energy efficient fleets in the industry operating at somewhere around 24 jewels for terror, harsher. What's what's a hash for the average industry or the industry average, rather, is in the 40s. So I think it's going to be a bit of a period of people continue to upgrade and then there'll be some sort of cleansing post to having next year. I'm glad you brought up the having, because if we take a look forward at that, hypothetically, when we do get to that point, what would you expect the mining industry to look like? Will they? Will there be fewer miners after we get through the how long? I think what's going to happen is the larger miners that have most modern fleets, the best energy costs and are the most efficient are going to thrive. While the smaller miners that either can't raise capital, can't upgrade their machines and can't get out of generally more expensive energy contracts are either going to have to consolidate or essentially go away as well. You're seeing more miners moving offshore. There's some great stranded energy opportunities in Latin America, Asia and Africa that are coming to market at very low energy prices. And I think you're going to see this industry continue to chase the lowest cost of energy. You'll also see miners focus more on starting to own energy generation, because instead of being parasitic load on the grid, you're going to see miners move behind the meter. This is what we do. We sit behind the meter at wind farms typically. So we get to use that stranded energy and not take it off the grid. But at the same time, you're going to see miners start owning and investing in energy projects to develop their own energy, whether that's methane flare, whether that's landfill methane, whether that's solar or wind, et cetera. And I think the miners, together with the renewable energy companies, are going to be the largest investors in renewable energy projects in the US because we have a very big problem in the U.S. There is a lack of transmission capacity to shift the energy from the renewable energy farms to the consumer. And the only way you can get these projects financed is there has to be a customer for the energy and bitcoin miners make the ideal customer for that. All right. I think you're going to continue to see a lot of progress there."
    }
]