[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMTEvYml0Y29pbi10b3BzLTMwMDAwLWZvci10aGUtZmlyc3QtdGltZS1zaW5jZS1qdW5lLmh0bWzSAVlodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNC8xMS9iaXRjb2luLXRvcHMtMzAwMDAtZm9yLXRoZS1maXJzdC10aW1lLXNpbmNlLWp1bmUuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin tops $30,000 for the first time since June ahead of key inflation data; ether nears $2,000 - CNBC",
        "content": "Bitcoin climbed on Tuesday, topping the key psychological level of $30,000 as investors awaited key inflation data later in the week that could steer crypto prices.\n\nThe largest cryptocurrency by market cap was last higher by more than 3% $30,237.42, according to Coin Metrics. Earlier in the day it rose as high as $30,432.83. On Monday night it climbed 7% Monday night to break through the $30,000 level for the first time since June.\n\nEther advanced more than 1.5% to $1,922.06 as investors awaited the Ethereum network's latest tech upgrade, scheduled for Wednesday. Earlier, it rose to $1,937.03, its highest level in a year.\n\nNow that bitcoin has touched $30,000, a move into the mid- to high-30s will be \"likely\" if it pushes through with conviction and would \"force short speculators to cover and buy instead,\" said James Lavish, managing partner at the Bitcoin Opportunity Fund. \"Some investors are trying to get positioned ahead of that,\" he said."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWhvbGRzLWFib3ZlLXVzLTI4LTExMjgyMjQ4Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin holds above US$28,000, Dogecoin rises most in top 10 cryptos - Yahoo Finance",
        "content": "Bitcoin and Ether rose in Monday afternoon trade in Asia, along with most other top 10 non-stablecoin cryptocurrencies by market capitalization. Polygon’s Matic token was the only loser, while Dogecoin gained the most. Asian equity markets were mixed as investors assessed Friday’s U.S. jobs data while awaiting key inflation figures to be released later this week.\n\nSee related article: FTX’s lack of financial controls complicates bankruptcy asset recovery, says legal filing\n\nBitcoin, the world’s largest cryptocurrency by market capitalization, rose 1.36% to US$28,301 in the 24 hours to 4 p.m. in Hong Kong, bringing its weekly gains to 1.23%, according to CoinMarketCap data.\n\nEthereum gained 1.24% to US$1,859, ahead of its Shapella Upgrade on Wednesday, which is expected to lower gas fees for developers and allow investors to withdraw their staked Ether.\n\n“The Beacon Chain and Ethereum have been working smoothly as one since last year, and the Shapella Upgrade is set to enable new features based on the new architecture,” Chen Zhuling, founder and chief executive of crypto staking provider RockX, said in a statement shared with Forkast.\n\n“While some short-term market volatility is to be expected, the long-term benefits to the ecosystem are substantial, as Ethereum’s capacity to handle more transactions per second increases, transaction costs decrease, and the security and efficiency of smart contracts improve,” Zhuling added.\n\nDogecoin led gains at 1.44% to US$0.08287, bringing its weekly gains to 6.15%. Polygon’s Matic was the only coin among the top 10 cryptos to drop, diving 0.09% to US$1.10 in 24 hours, although it is still up 0.32% on the week.\n\nThe global crypto market capitalization rose 1.02% to US$1.18 trillion, while the total crypto market volume gained 4.09% to US$29.18 billion in the last 24 hours.\n\nThe Forkast 500 NFT index fell 0.24% to 3,942.37 points during the day and 2.93% during the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day.\n\nAsian markets were mixed on Monday, after U.S. jobs data on Friday revealed that nonfarm payrolls increased by 236,000 jobs in March, indicating that the Federal Reserve may again raise interest rates at its meeting on May 3. Currently, interest rates in the world’s biggest economy are 4.75% to 5%, the highest since June 2006.\n\nThe Shanghai Composite dropped 0.37%, while the Shenzhen Component Index lost 0.80%. Japan’s Nikkei 225 gained 0.42%, and South Korea’s Kospi strengthened 0.87%.\n\nThe U.S. dollar index slid 0.2% to trade above 102 on Monday, a near one-week high, after the U.S. non-farm payrolls report signaled a tight labor market and supported speculation for another interest rate hike in May.\n\nThe euro rose 0.14% to hover above US$1.09 on Monday, close to its two-month high on April 4, as investors expect another interest rate hike from the European Central Bank (ECB). Last week, Klass Knot, a member of the ECB governing council, said he was unsure whether rates should rise by 25 or 50 basis points."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXZzLWdvbGQtaGVyZXMtZm91bmRlci0xNDI0MDYwNzMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin vs. Gold: Here's What the Founder of the World's Largest Hedge Fund Would Choose - Yahoo Finance",
        "content": "The price of Bitcoin and gold surged in March after Silicon Valley Bank led a string of bank failures and liquidity crises. Few analysts were surprised by these price movements as both are used to circumvent banks and other centralized financial institutions. The question is, which one is a better choice in the current economic climate?\n\nRay Dalio, the founder of the world's largest hedge fund, Bridgewater Associates, has weighed in on the great Bitcoin vs. gold or digital gold vs. real gold debate. Few were surprised to hear his opinion as he is well known for his bullish stance on gold. In an interview with Maria Bartiromo at Fox Business, Dalio expressed that he much prefers gold over Bitcoin, even though he said that he holds a small amount of Bitcoin.\n\nDalio has soured further on Bitcoin since the interview, saying that Bitcoin “has no relation to anything” and that it receives disproportionate attention. Dalio believes that Bitcoin's status as a form of digital gold is still unproven, citing concerns that it’s too volatile to be money or a store of value. He acknowledges the potential of blockchain tech; he just doesn’t think Bitcoin will be the one to win out.\n\nIn contrast, gold is stable because it has been a reliable store of value and medium of exchange for thousands of years. Its stability, scarcity and inherent value make it a trusted asset for preserving wealth.\n\nDalio has emphasized that he is not opposed to cryptocurrencies in general but remains skeptical of their ability to replace gold. He has previously stated that he owns \"some Bitcoin,\" but his personal investments in the digital asset have been limited compared to his holdings in gold.\n\nOne of the main arguments against Bitcoin as a store of value is its volatility. Although the digital asset has seen a meteoric rise in value over the past decade, it has also experienced significant price fluctuations. In contrast, gold's price has remained relatively stable, providing investors with a more secure option for preserving their wealth.\n\nStory continues\n\nAnother concern Dalio has raised is the possibility of government intervention in the cryptocurrency market. In a recent podcast, he warned that “in history, they’ve outlawed gold and they’ve outlawed silver and so on, and they could outlaw Bitcoin.” He isn’t the only one who expects world governments to try to shut down a currency they have no control over before it supplants their own.\n\nAs governments around the world start to pay closer attention to digital assets, there is a growing risk of regulatory crackdowns that could impact Bitcoin's value and adoption. Gold, on the other hand, is less likely to face such intervention because it’s a physical asset, it already plays a large role in the global economy and would be extremely difficult to ban. It can also provide unique exposure to things like volatility and fear in the markets, making it a popular tool for diversification and hedging.\n\nInvestors are turning to gold and silver in droves to protect their portfolios as uncertainty rises in the economy. Check out Benzinga’s Precious Metals Hub to master the sector and discover the best precious metals trading platforms.\n\nCheck Out More Precious Metals Articles From Benzinga:\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Bitcoin vs. Gold: Here's What the Founder of the World's Largest Hedge Fund Would Choose originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWRlZmllcy1za2VwdGljcy1icmVha3MtMzAtMDQyMDA0MTc4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Defies Skeptics, Breaks $30,000 - Yahoo Finance",
        "content": "Bitcoin Reclaims $30,000\n\nThe road to redemption for the world’s oldest and most popular cryptocurrency has been a rough one (to say the least) and has had plenty of skeptics. However, last night, Bitcoin breached the $30,000 mark for the first time since June 2022. Against all odds, BTC is up ~80% year-to-date. Here are a few important things you should know:\n\n“Buy when there’s blood in the streets”: More times than not, the best time to buy a market is when the news is the worst. Indeed, this turned out to be the case for BTC and various BTC proxies such as the Grayscale Bitcoin Trust (GBTC) and the ProShares Bitcoin ETF (BITO). In November 2022, doomed crypto exchange FTX filed for bankruptcy (after committing the largest fraud since Madoff’s Ponzi scheme), shaking crypto markets. Over that short time, BTC has doubled.\n\nZacks Investment Research\n\n\n\nImage Source: Zacks Investment Research\n\nSafe Haven Asset: For months in 2022, Bitcoin was closely correlated to equities, specifically tech, and the Nasdaq. However, in the past few months, Bitcoin has been trading more in sync with gold. Finally, it appears that “Bitcoin Maximalists” that believe BTC is a safe haven asset and not just a “yolo” product of easy money central bank policies have something to hang their hats on.\n\nBitcoin Behemoth is Back Onside: In 2020, MicroStrategy (MSTR), a public software company in business since the late 1990s, took the bold and unorthodox step to move to the “Bitcoin Standard”. Led by its outspoken and eccentric founder Michael Saylor, MSTR has purchased nearly $4 billion worth of Bitcoin, which translates to roughly 130,000 BTC! In a show of conviction or unfounded confidence (you decide), Saylor and MSTR have dollar cost averaged into BTC the entire way down is finally back to their cost basis of around $30,000 per coin.\n\nZacks Investment Research\n\n\n\nImage Source: Zacks Investment Research\n\nBitcoin Halving is Slated for Early 2024: Roughly one year from now, Bitcoin will experience its next “Halving”. Bitcoin halvings occur every four years and refers to when the reward for Bitcoin miners (network validators) is cut in half. Each halving event means that the number of new Bitcoin being let out into circulation is slashed in half. Remember, unlike central bank currencies, Bitcoin is finite – there will only ever be 21 million in existence. Past halving events have led to dramatic bull markets in BTC’s price.\n\nStory continues\n\nMiners are on Fire: Year-to-date, the Valkyrie Bitcoin Miners ETF (WGMI) is up 97%, making it one of the top-performing ETFs in the entire market. The ETF’s top three holdings include Marathon Digital Holdings (MARA), HIVE Blockchain Technologies (HIVE), and Riot Platforms (RIOT).\n\nLong-Term Technical Picture is Improving: While it is hard to chase Bitcoin into a large round number like $30,000 after a rapid short-term move, BTC and BTC proxies like the Grayscale Bitcoin Trust (GBTC) are showing improving longer-term technical. GBTC just triggered a bullish golden cross – a bullish technical signal that occurs when the 50-day moving average crosses over the 200-day from below. While the signal failed the last time, when it happened in 2020, GBTC shot higher from $10 to $60 is rapid order fashion.\n\nZacks Investment Research\n\n\n\nImage Source: Zacks Investment Research\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nMicroStrategy Incorporated (MSTR) : Free Stock Analysis Report\n\nHIVE Blockchain Technologies Ltd. (HIVE) : Free Stock Analysis Report\n\nMarathon Digital Holdings, Inc. (MARA) : Free Stock Analysis Report\n\nGrayscale Bitcoin Trust (GBTC): ETF Research Reports\n\nRiot Platforms, Inc. (RIOT) : Free Stock Analysis Report\n\nProShares Bitcoin Strategy ETF (BITO): ETF Research Reports\n\nValkyrie Bitcoin Miners ETF (WGMI): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1pbmVycy1zYW1lLXJpZ2h0cy1kYXRhLTEwMDUyOTQ3Mi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 10 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Miners Will Have Same Rights as Data Centers, Says New Arkansas Bill - Yahoo Finance",
        "content": "A new bill aimed at regulating Bitcoin mining in Arkansas has been approved by both the House of Representatives and Senate and is now awaiting Governor Sarah Huckabee Sanders’ signature.\n\nThe Arkansas Data Centers Act of 2023 seeks to establish guidelines for Bitcoin miners and protect them from discriminatory regulations and taxes, guaranteeing that firms have the same rights as data centers.\n\nProposed on March 30 by Rep. Rick McClure and co-sponsored by Arkansas Senator Joshua Bryant (R), the bill quickly garnered support from state legislators.\n\nThe legislation acknowledges the economic value of data centers, recognizing that they \"create jobs, pay taxes, and provide general economic value to local communities.\"\n\nArkansas to Lure Remote Tech Workers With ‘Bitcoin and a Bike’ Sweetener\n\n“Data centers, digital currency, and blockchain technology are legal in all fifty (50) states; and guidance for future industry growth is needed in Arkansas to protect Arkansans from fraudulent business practices,” reads the document.\n\nWhile the bill mandates that crypto miners must pay applicable taxes and government fees using acceptable forms of currency and must operate in a way that does not strain the public electricity grid, it also specifies that the Arkansas government cannot impose unique requirements that are different from those imposed on data centers.\n\n“Discrimination against digital asset mining business [is] prohibited,” states paragraph 14-1-505 of the bill.\n\n“The state of Arkansas has pulled off a surprise victory and become the first in the nation to pass the ‘Right to Mine’ Bitcoin bill in both the House and Senate,” Satoshi Act Fund CEO and co-founder Dennis Porter commented on the news.\n\nThe state of Arkansas has pulled off a surprise victory and become the first in the nation to pass the ‘Right to Mine’ #Bitcoin bill in both the House and Senate. I hope to join @SarahHuckabee for the signing ceremony soon. — Dennis Porter (@Dennis_Porter_) April 8, 2023\n\nThe proposed bill also defines certain terms related to digital asset mining. For instance, \"digital asset mining business\" refers to a collection of computers located at a single site that consumes over one megawatt (1MW) of power on average per year to generate digital assets through blockchain network security.\n\nStory continues\n\nThe legislation also seeks to protect individuals engaged in cryptocurrency mining from their homes, saying that “an individual may utilize a node in this state for the purpose of operating home digital asset mining at the individual's residence according to applicable utility rules and rates.”\n\nThe bill defines a \"node\" as a computational device that houses a copy of the blockchain-distributed ledger technology, while a \"residence\" is defined as a permanent dwelling place, unit, or accessory structure.\n\nFurthermore, “a person that is engaged in home digital asset mining or that has a digital asset mining business shall not be considered a money transmitter under the Uniform Money Services Act,” reads the bill.\n\nIt’s quite a different picture in Texas, where legislators are seeking to remove incentives for Bitcoin miners through Bill 1751. Last week, the bill was unanimously approved in a state Senate committee vote; however, lobbying groups opposing the legislation still hope it doesn’t become a law.\n\nAs explained by Kristine Cranley, Director of Business Development at the Texas Blockchain Council, after being voted out of the Senate, the bill will proceed to the House and have to go through the same process there.\n\n“It does not at this point have a co-sponsor in the House. Even if it does get heard on the house floor, time is short for bills to make it through the entire process before the legislature adjourns on May 29, so there are many places along the way where it can get stalled,” Cranley told Decrypt.\n\nThe Texas Blockchain Council is now focusing on contacting senators and asking them to register a “no” vote on the bill, and is urging others to reach out to their senators “to request that they support a level playing field for all industries by voting no on this discriminatory bill,” added Cranley.\n\nA more significant decision was made by the State of New York in November 2022, when Governor Kathy Hochul approved the proof-of-work mining moratorium, which effectively prohibits cryptocurrency mining operations in the state for a period of two years.\n\nMeanwhile, at the federal level, crypto miners may soon be liable for a 30% tax on their electricity expenses if President Biden's budget proposal, introduced on March 9, is enacted."
    }
]