[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTEvMjEvYmluYW5jZS1ibmItdG9rZW4tZHJvcHMtOC1wZXJjZW50LW9uLWNyaW1pbmFsLWNoYXJnZXMtYml0Y29pbi1hbmQtYnJvYWRlci1tYXJrZXQtcmV0cmVhdC_SAYMBaHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyMy8xMS8yMS9iaW5hbmNlLWJuYi10b2tlbi1kcm9wcy04LXBlcmNlbnQtb24tY3JpbWluYWwtY2hhcmdlcy1iaXRjb2luLWFuZC1icm9hZGVyLW1hcmtldC1yZXRyZWF0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Binance BNB token drops on criminal charges, Bitcoin and broader crypto market dip slightly - Fortune",
        "content": "The native token of crypto exchange Binance, known as BNB, plummeted Tuesday on news the Justice Department is filing criminal charges against the company and its CEO, Changpeng “CZ” Zhao.\n\nBinance’s cryptocurrency, BNB, fell as much as 9% on the initial news, before narrowing the drop to around 5% by midafternoon. The initial report came from the Wall Street Journal, which said Zhao would soon step down as CEO of the exchange and plead guilty to violating U.S. anti-money-laundering laws. Court documents have since confirmed this.\n\nBinance will also plead guilty to a criminal charge and pay $4.3 billion in fines, which will allow it to settle civil charges brought against it by regulators. Zhao himself will pay $50 million.\n\nAs BNB fell, so did the broader crypto market, with the global cryptocurrency market cap dropping 3.5% over the past day to $1.43 trillion, according to CoinGecko. Bitcoin, the most popular cryptocurrency, fell just under 2% following news of the charges against Zhao and Binance.\n\nBinance initially sold millions of BNB in 2019, and currently allows customers to use the tokens for a discount on trading. The company and Zhao still hold billions of dollars worth of the coin.\n\nThe Justice Department is scheduled to hold a press conference at 3 p.m. Eastern Time on the criminal charges. The lawsuit follows previous lawsuits by the Securities and Exchange Commission and the Commodity Futures Trading Commission."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jZWxzaXVzLW5ldHdvcmstZm9jdXMtYml0Y29pbi1taW5pbmctMDYwNjQxODUzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Celsius Network To Focus on Bitcoin Mining Following Post-Bankruptcy Restructuring - Yahoo Finance",
        "content": "Celsius Network To Focus on Bitcoin Mining Following Post-Bankruptcy Restructuring\n\nCrypto lending platform Celsius Network has made changes to its plans after emerging from bankruptcy, focusing solely on Bitcoin mining due to regulatory concerns expressed by U.S. authorities about its other proposed business activities.\n\nCelsius had initially intended to generate income through \"staking\" fees, which involved validating blockchain transactions and managing cryptocurrency loans, as part of its restructuring strategy. However, the company announced on Monday that it had adjusted its direction based on feedback received from the U.S. Securities and Exchange Commission (SEC).\n\nThe revised plan, approved by a U.S. bankruptcy court in Manhattan on November 9, allowed Celsius to return cryptocurrency to its customers and establish a new company owned by Celsius creditors. However, the SEC did not explicitly state during the bankruptcy proceedings whether the new company's business plans would violate U.S. regulations.\n\nThis strategic shift has led to further negotiations with Fahrenheit, a consortium of bidders chosen to oversee the reorganized company. Celsius plans to seek court approval for a modified bankruptcy plan in the near future.\n\nCelsius anticipates that the reduced scope of the new company will lead to reduced management fees and enable a larger amount of cryptocurrency to be directly returned to customers starting in January 2024.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jZWxzaXVzLW5ldHdvcmstZm9jdXMtYml0Y29pbi1taW5pbmctMDYwNjQxODUzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Celsius Network To Focus on Bitcoin Mining Following Post-Bankruptcy Restructuring - Yahoo Finance",
        "content": "Celsius Network To Focus on Bitcoin Mining Following Post-Bankruptcy Restructuring\n\nCrypto lending platform Celsius Network has made changes to its plans after emerging from bankruptcy, focusing solely on Bitcoin mining due to regulatory concerns expressed by U.S. authorities about its other proposed business activities.\n\nCelsius had initially intended to generate income through \"staking\" fees, which involved validating blockchain transactions and managing cryptocurrency loans, as part of its restructuring strategy. However, the company announced on Monday that it had adjusted its direction based on feedback received from the U.S. Securities and Exchange Commission (SEC).\n\nThe revised plan, approved by a U.S. bankruptcy court in Manhattan on November 9, allowed Celsius to return cryptocurrency to its customers and establish a new company owned by Celsius creditors. However, the SEC did not explicitly state during the bankruptcy proceedings whether the new company's business plans would violate U.S. regulations.\n\nThis strategic shift has led to further negotiations with Fahrenheit, a consortium of bidders chosen to oversee the reorganized company. Celsius plans to seek court approval for a modified bankruptcy plan in the near future.\n\nCelsius anticipates that the reduced scope of the new company will lead to reduced management fees and enable a larger amount of cryptocurrency to be directly returned to customers starting in January 2024.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0xMS0yMi93aGF0LXVzLW1hcnNoYWxzLXNlaXplLWFuZC1zZWxsLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Rolexes, Bitcoin and Louboutins: What US Marshals Seize and Sell - Bloomberg",
        "content": "00:00\n\nRolexes, Bitcoin and Louboutins. What U.S. Marshals Seize and sell. So the U.S. Marshals are seizing these this contraband item. Who are they taking it from? What kind of criminals are we talking about here? Oh, you can kind of like take your pick. It's people who are involved in drug dealing, money laundering, Darkweb, the Internet stuff when they're selling drugs and malware and other sorts of things, then the items that the marshals seize are those that are basically proceeds from a crime or things that are used in the commission of crimes. And Michael, if I'm in the market to buy a Rolex, how do I attend one of these auctions and get my hand on a Rolex, which according to reporting, is at a pretty decent discount? Oh, yeah. That's the hard part, is sometimes that discount goes away. But these auctions happen online fairly often, and they partner with these national auction houses that basically like when you had a lot of really interesting things. Was there an item that stood out the most to you when you were doing your sleuthing through some of these filings? I think the racehorse was a really interesting one. That was the only animal that we saw on this list, and it was from an attorney who was basically taking funds from family members and other clients and used it to buy racehorses and all sorts of other things. Yeah, seem like Rolexes were a dime a dozen. There are a lot of Rolexes on there. Are there a couple of cars, classic cars? There's also digital coins, which you found were very a big haul in 2021. Makes sense given the price action. Yeah, absolutely. And I think, you know, unintentionally, the government probably made one of the best crypto trades of all time because they had they had all of this crypto that they seized and then sold it when it was basically at the highs. So I think it was something like $39 million from like 680 Bitcoin or something like they time the market like right at the top and entirely unintentionally, just given the way that the crypto markets were acting and upon. You know what interested me in all this? And we talk about, you know, this racehorse, the private jets, the boats, the digital coins, is that the auction data is not really accessible to the public. You actually had to file a Freedom of Information Act to get all this data to get five years worth of sales. Why is it not available to most people? Why is it not more public, given that the U.S. Marshal services are seizing this from criminals and taxpayers are funding a lot of these efforts? Yeah, I mean, they have annual reports. Second kind of breakdown of how much is being sold every year and how many items have been sold and how much has been given out in terms of victim compensation and that kind of thing. But there's no central database that tells you like they sold this Pokemon card on February 8th or whatever. So I don't know why they don't maintain a database that would have made my job a lot easier and I wouldn't have had to wait six months for it. But sometimes you just have to file the request and see what happens. And I filed this in September 2022, and I got it back in July 2023. And luckily it was free, but I just had to wait a bunch of time and it was not an easy thing to kind of like convert and get into Excel. It was all on like a PDF. And so there's a lot of work that had to be done to kind of get the project to publication. And Michael, this story has a lot of really cool graphics. I'm looking at the jump though, from 20 1922 and a half million dollars to more than $83 million in 2021. Is that more things being seized by the marshals, the more expensive items? What drove the run up because that was still before COVID. Yeah, there is a big ol cryptocurrency that was in there. And then I think the second biggest category is cars as well. So I want to say that part of the reason why that jump is so big is some of those crypto sales and you mentioned the graphics. Amanda Chan did a fantastic job putting all of this together. She's a Business Week designer. Where does this money go? Yes, When it is? Yes. What like the greatest, as you mentioned, great crypto trade by the U.S. government. Does it go to schools? Does it go to can they fund the government, fund the deficit? Yes. It does not go back to Treasury or anything like that. There's no deficit reduction or anything happening. It goes back to local law enforcement and then there's victim compensation funds to like if you were somebody who had been a victim of some sort of scammer crime and somebody, you know, stole your money to buy racehorses or cars or something like that, that money will hopefully go back to you. But it's not a sure process from what I heard. Like, I think they distributed $506 million of bonds last year, but some of that was around like prior years. So just like anything, it's going to take some time. We're talking we're talking to Bloomberg reporter Michael Tobin about a story about what U.S. marshals seize. Michael, with these big sales, do the auction houses get their traditional cut of the proceeds? Oh, that's a great question. I haven't I didn't have a chance to ask them that, but I know that they have what I assume is a contract with the US Marshals, all these auctions. But I have no idea about a cut from it. I don't think there's a buyer's premium on these either. So in a lot of auctions there can be like a 10% buyer's premium. But from what I've seen on the Marshals website, it doesn't look like it a buyer's premium on some of the auctions, least when when they auction off these items. Do people know that their seized items I mean, is it advertised as such? Yeah. So one of the auction houses, like the really big one, they do stuff with local governments as well but it specifically says US U.S. marshals forfeiture auctions. So it's it's pretty well advertised. Said this is property. Interesting. Is there a way to track where some of these items come from? I know you you in your reporting, you show like the Steinway piano for $34,000 belong to the consultant who allegedly made $30 million in a plot to bribe Indonesian government officials. Is there a way to see where the these pianos came from? Are these cars were pre-owned? That was honestly one of the hardest parts of this project. So a lot of this had to do with kind of like chasing down court records and then also doing more research on the Internet. But we have the Bloomberg Law tool, which is super helpful. So I was able to type in like specific keywords like Steinway piano, and I was able to pull off the court case because the government has to file documents essentially in which the property is the defendant. So the title of the case will be the United States of America versus 75 Gold bars, Steinway Piano, Serial Number, X-Y-Z or whatever. So if you're or if you are good at searching, you can kind of figure out kind of quickly where these are coming from. The hard part is some of the items are so fungible that you can't really say for sure if this one Rolex was connected to this one guy."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0xMS0yMi93aGF0LXVzLW1hcnNoYWxzLXNlaXplLWFuZC1zZWxsLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Rolexes, Bitcoin and Louboutins: What US Marshals Seize and Sell - Bloomberg",
        "content": "00:00\n\nRolexes, Bitcoin and Louboutins. What U.S. Marshals Seize and sell. So the U.S. Marshals are seizing these this contraband item. Who are they taking it from? What kind of criminals are we talking about here? Oh, you can kind of like take your pick. It's people who are involved in drug dealing, money laundering, Darkweb, the Internet stuff when they're selling drugs and malware and other sorts of things, then the items that the marshals seize are those that are basically proceeds from a crime or things that are used in the commission of crimes. And Michael, if I'm in the market to buy a Rolex, how do I attend one of these auctions and get my hand on a Rolex, which according to reporting, is at a pretty decent discount? Oh, yeah. That's the hard part, is sometimes that discount goes away. But these auctions happen online fairly often, and they partner with these national auction houses that basically like when you had a lot of really interesting things. Was there an item that stood out the most to you when you were doing your sleuthing through some of these filings? I think the racehorse was a really interesting one. That was the only animal that we saw on this list, and it was from an attorney who was basically taking funds from family members and other clients and used it to buy racehorses and all sorts of other things. Yeah, seem like Rolexes were a dime a dozen. There are a lot of Rolexes on there. Are there a couple of cars, classic cars? There's also digital coins, which you found were very a big haul in 2021. Makes sense given the price action. Yeah, absolutely. And I think, you know, unintentionally, the government probably made one of the best crypto trades of all time because they had they had all of this crypto that they seized and then sold it when it was basically at the highs. So I think it was something like $39 million from like 680 Bitcoin or something like they time the market like right at the top and entirely unintentionally, just given the way that the crypto markets were acting and upon. You know what interested me in all this? And we talk about, you know, this racehorse, the private jets, the boats, the digital coins, is that the auction data is not really accessible to the public. You actually had to file a Freedom of Information Act to get all this data to get five years worth of sales. Why is it not available to most people? Why is it not more public, given that the U.S. Marshal services are seizing this from criminals and taxpayers are funding a lot of these efforts? Yeah, I mean, they have annual reports. Second kind of breakdown of how much is being sold every year and how many items have been sold and how much has been given out in terms of victim compensation and that kind of thing. But there's no central database that tells you like they sold this Pokemon card on February 8th or whatever. So I don't know why they don't maintain a database that would have made my job a lot easier and I wouldn't have had to wait six months for it. But sometimes you just have to file the request and see what happens. And I filed this in September 2022, and I got it back in July 2023. And luckily it was free, but I just had to wait a bunch of time and it was not an easy thing to kind of like convert and get into Excel. It was all on like a PDF. And so there's a lot of work that had to be done to kind of get the project to publication. And Michael, this story has a lot of really cool graphics. I'm looking at the jump though, from 20 1922 and a half million dollars to more than $83 million in 2021. Is that more things being seized by the marshals, the more expensive items? What drove the run up because that was still before COVID. Yeah, there is a big ol cryptocurrency that was in there. And then I think the second biggest category is cars as well. So I want to say that part of the reason why that jump is so big is some of those crypto sales and you mentioned the graphics. Amanda Chan did a fantastic job putting all of this together. She's a Business Week designer. Where does this money go? Yes, When it is? Yes. What like the greatest, as you mentioned, great crypto trade by the U.S. government. Does it go to schools? Does it go to can they fund the government, fund the deficit? Yes. It does not go back to Treasury or anything like that. There's no deficit reduction or anything happening. It goes back to local law enforcement and then there's victim compensation funds to like if you were somebody who had been a victim of some sort of scammer crime and somebody, you know, stole your money to buy racehorses or cars or something like that, that money will hopefully go back to you. But it's not a sure process from what I heard. Like, I think they distributed $506 million of bonds last year, but some of that was around like prior years. So just like anything, it's going to take some time. We're talking we're talking to Bloomberg reporter Michael Tobin about a story about what U.S. marshals seize. Michael, with these big sales, do the auction houses get their traditional cut of the proceeds? Oh, that's a great question. I haven't I didn't have a chance to ask them that, but I know that they have what I assume is a contract with the US Marshals, all these auctions. But I have no idea about a cut from it. I don't think there's a buyer's premium on these either. So in a lot of auctions there can be like a 10% buyer's premium. But from what I've seen on the Marshals website, it doesn't look like it a buyer's premium on some of the auctions, least when when they auction off these items. Do people know that their seized items I mean, is it advertised as such? Yeah. So one of the auction houses, like the really big one, they do stuff with local governments as well but it specifically says US U.S. marshals forfeiture auctions. So it's it's pretty well advertised. Said this is property. Interesting. Is there a way to track where some of these items come from? I know you you in your reporting, you show like the Steinway piano for $34,000 belong to the consultant who allegedly made $30 million in a plot to bribe Indonesian government officials. Is there a way to see where the these pianos came from? Are these cars were pre-owned? That was honestly one of the hardest parts of this project. So a lot of this had to do with kind of like chasing down court records and then also doing more research on the Internet. But we have the Bloomberg Law tool, which is super helpful. So I was able to type in like specific keywords like Steinway piano, and I was able to pull off the court case because the government has to file documents essentially in which the property is the defendant. So the title of the case will be the United States of America versus 75 Gold bars, Steinway Piano, Serial Number, X-Y-Z or whatever. So if you're or if you are good at searching, you can kind of figure out kind of quickly where these are coming from. The hard part is some of the items are so fungible that you can't really say for sure if this one Rolex was connected to this one guy."
    }
]