[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vdGhlZ2l2aW5nYmxvY2suY29tL3Jlc291cmNlcy9ub25wcm9maXRzLWFjY2VwdGluZy1jcnlwdG8tZG9uYXRpb25zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "List of Nonprofits Accepting Bitcoin & Crypto Donations - The Giving Block",
        "content": "We are able to process some donations of cryptocurrencies that aren't listed in The Giving Block's Donation Form. Please read this information and/or contact us to verify."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tb3JlLXRoYW4tMzYwMC1iaXRjb2luLWF0bXMtd2VudC1vZmZsaW5lLXRvLXJlY29yZC1sYXJnZXN0LW1vbnRobHktZGVjbGluZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "More than 3,600 Bitcoin ATMs went offline to record largest monthly decline - Cointelegraph",
        "content": "Contradicting the growing global Bitcoin (BTC) adoption rate, physical ATMs dedicated to fiat-crypto conversions are on the decline. In March alone, 3,627 crypto ATMs were removed from the network, bringing down the total ATMs to 33,727.\n\nIn the decade since the first Bitcoin ATM was launched on Oct. 29, 2013, the net change of cryptocurrency machines installed and removed monthly remained positive most times — implying that total crypto ATMs worldwide were steadily increasing. However, the trend is reversing, according to data from Coin ATM Radar.\n\nNet change of cryptocurrency machines number installed and removed monthly. Source: Coin ATM Radar\n\nAs shown above, net crypto ATM installations declined for four months between September 2022 and March 2023. However, with 3,627 crypto ATMs going down last month, March 2023 stands out as the month with the largest monthly decline.\n\nNumber of bitcoin machines installed over time. Source: Coin ATM Radar\n\nThe chart above shows the number of Bitcoin machines installed over time, revealing the sudden drop in the total crypto ATMs. The significance of this reduction seems enormous, considering that the highest number of ATMs installed in a month was 2,048 — back in January 2021.\n\nThe number of cryptocurrency machines installed per each top manufacturer over time. Source: Coin ATM Radar\n\nOn the bright side, April broke the three-month-long downtrend by recording 37 crypto ATM installations on April 1. Current market leaders in manufacturing crypto ATMs are General Bytes, BitAccess and Genesis Coin.\n\nRelated: Bitcoin ATM maker shuts cloud service after user hot wallets compromised\n\nAfter losing customer funds in a “security incident” in March that saw its customers’ hot wallets accessed, General Bytes promised to reimburse the losses.\n\nMagazine: Web3 Gamer: Shrapnel wows at GDC, Undead Blocks hot take, Second Trip\n\nOn March 17-18th, 2023, GENERAL BYTES experienced a security incident.\n\n\n\nWe released a statement urging customers to take immediate action to protect their personal information.\n\n\n\nWe urge all our customers to take immediate action to protect their funds and https://t.co/fajc61lcwR… — GENERAL BYTES (@generalbytes) March 18, 2023\n\n“We have taken immediate steps to prevent further unauthorized access to our systems and are working tirelessly to protect our customers,” General Bytes said in a statement."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vZnV0dXJpc20uY29tL3RoZS1ieXRlL3NwYWNleC1iaXRjb2luLW1vb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "SpaceX Flying Bitcoin Bounty to Moon, Where Anyone Can Grab It If They Can Get There - Futurism",
        "content": "Don't expect it to cover travel expenses. At all.\n\nBitcoin Booty\n\nAhoy swashbuckling spacefarers: if you're hunting for off-world treasure, look no further than the Moon.\n\nAs spotted by Gizmodo, the crypto company LunarCrush says it'll be leaving a bounty of 62 Bitcoin near the lunar south pole that's completely up for grabs. So in theory, any adventurer daring enough to hitch a ride to the Moon can snatch up the booty for themselves, which hopefully will still be worth anywhere near the purported $1.5 million it's valued at now (don't necessarily count on that, though). The sticker price won't even come close to the exorbitant travel expenses for getting there and back, but hey, it's the novelty that counts, right?\n\nThe goal of this stunt is to \"inspire people to build communities that will unlock a new era of exploration,\" according to LunarCrush CEO Joe Vezzani. \"It's like Willy Wonka's 'golden ticket' for the Web3 era, and we couldn't be more excited to see how it all unfolds,\" he said in a press release. Uh yeah, sure.\n\nThe bounty is called Nakomoto_1, named after the pseudonymous creator of Bitcoin — but it's not actually some space-shielded hard drive with Bitcoin sitting in it. Instead, it's merely a key to a private crypto wallet, engraved on a hidden portion of a lunar rover called the Mobile Autonomous Prospecting Platform, or MAPP, which is decidedly less cool than unearthing a real treasure chest.\n\nActual Mission\n\nThe MAPP rover, however, isn't there just to be a glorified crypto receptacle, and it certainly doesn't belong to LunarCrush — that's way out of the platform's budget.\n\nA creation of the space company Lunar Outpost, its real purpose is part of Tipping Point, a NASA-backed campaign to get private companies to flex their tech in space in the hopes of furthering commercial spacefaring capabilities and infrastructure, which includes having Nokia set up the first 4G network on the Moon.\n\nThe rover and its crypto bounty will be brought to the Moon aboard a SpaceX Falcon 9 rocket launch scheduled for June. Once it's there, MAPP will deploy around the lunar south pole, where it will be used to test Nokia's wireless network for two weeks. Once the mission's over, the rover will simply be abandoned, at which point it and its bounty will be at the mercy of any motivated off-world crypto bros.\n\nAs of now, LunarCrush is still trying to raise funds for the bounty by selling NFTs, so you might want to hold off until LunarCrush can put its money where its mouth is.\n\nMore on crypto: It Turns Out FTX and Alameda Owe Margaritaville a Staggering Amount of Money"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2hhcy1iaXRjb2luLWJlbmVmaXRlZC1mcm9tLXRoZS1iYW5raW5nLWNyaXNpcy1ub3QtaW4tdGhlLXdheS1pdHMtZmFucy1ob3BlZC9hcnRpY2xlc2hvdy85OTE3MDgxNS5jbXPSAZQBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL3RlY2gvdGVjaG5vbG9neS9oYXMtYml0Y29pbi1iZW5lZml0ZWQtZnJvbS10aGUtYmFua2luZy1jcmlzaXMtbm90LWluLXRoZS13YXktaXRzLWZhbnMtaG9wZWQvYW1wX2FydGljbGVzaG93Lzk5MTcwODE1LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "Has bitcoin benefited from the banking crisis? Not in the way its fans hoped - The Economic Times",
        "content": "Elevate Your Tech Prowess with High-Value Skill Courses Offering College Course Website Indian School of Business ISB Professional Certificate in Product Management Visit IIT Delhi IITD Certificate Programme in Data Science & Machine Learning Visit Indian School of Business ISB Product Management Visit\n\nShortly after Silicon Valley Bank failed this month, the price of bitcoin soared above $25,000, reaching a threshold the digital currency hadn’t touched since June. This week, bitcoin reached nearly $30,000, up 70% for the year.Bitcoin proponents seized on the price rise to argue that the banking crisis was prompting investors to convert traditional currencies into digital coins. One crypto executive hailed the bank failures as “the end of the USD and the dawn of hyperbitcoinization.” A company that markets bitcoin to investors started putting references to the bank runs in its promotional materials.But despite the fanfare, there is little evidence that the recent banking collapse has generated widespread support for bitcoin as a financial alternative.Instead, the surge in bitcoin’s price was driven by a range of financial trends that have little to do with the technology’s philosophical underpinnings, analysts said. The reasons for the surge include growing optimism that the Federal Reserve may pause interest rate increases, as well as increasing concerns about the safety of so-called stablecoins, a type of cryptocurrency intended to maintain a price of $1.“Is there widespread interest in and growth coming into the space? Is it a lot of new money?” asked Ed Moya, a crypto analyst at the trading firm OANDA. “It doesn’t really seem like that’s happening.”Bitcoin’s recent rise is also a result of low liquidity, a measure of how easy it is to buy and sell a digital asset without affecting its price, according to an analysis by crypto research firm Kaiko. Since the crypto market cratered last year, fewer large financial firms have been buying and selling bitcoin, making the currency harder to trade. Bitcoin’s price has always been volatile, but in the current market, it can increase or decrease significantly after only a few trades. Last week, bitcoin’s liquidity reached a 10-month low, according to Kaiko.“It doesn’t mean that because there’s a big price move one way that this is a whole new wave of institutional money or anything like that,” said Conor Ryder, a research analyst for Kaiko. “It’s more so a liquidity issue.”Bitcoin was created after the 2008 financial crisis, which sowed widespread distrust in the banking system. Early proponents trumpeted the new technology as a safer long-term alternative to banks and traditional currencies.That vision never came to fruition. Over the past 15 years, traders have largely treated bitcoin as a speculative investment — and, in some cases, as a tool for money laundering and other crimes.But the implosion of Silicon Valley Bank — and the broader crisis it unleashed — seemed to give credence to the original bitcoin thesis.“Bitcoin is a clear winner of the U.S. banking crisis,” a column for crypto publication CoinDesk declared this month.The price of bitcoin has increased about 40% since the fall of Silicon Valley Bank in early March, rising to $28,000 from $20,000. But that’s still far from bitcoin’s peak price of nearly $70,000 in November 2021.And the surge has been fueled partly by problems in other corners of the crypto industry. The banking crisis briefly endangered billions of dollars held by Circle, one of the largest stablecoin issuers, causing investors to panic. Some crypto traders who have held their digital savings as stablecoins are now looking for other options.“You’re seeing some flows just go out of stablecoins into bitcoin,” said Moya, the crypto analyst.The bank runs also stoked excitement among crypto investors who hoped that the Federal Reserve would slow its interest-rate increases to calm the panic. Over the past year, the increases have crippled the crypto market by making it more expensive to invest money in speculative assets.In a widely shared blog post last week, Molly White, a crypto critic, noted that bitcoin’s price began rising around the time the government announced it would backstop Silicon Valley Bank — an intervention that some analysts interpreted as a signal that the Fed might take further steps to calm the situation.“If the spike was fear-driven, I would have expected it to have started during the SVB bank run,” she wrote.Last week, the Fed announced that it would move forward with another rate increase. Bitcoin’s price has stayed relatively flat since then, settling around $28,000.Still, bitcoin proponents said they sensed an opportunity to recruit new adherents.Swan Bitcoin, a financial services firm that helps people invest in bitcoin, has experienced a wave of new customers looking to buy the digital coin as an alternative to keeping money at the bank, said Cory Klippsten, the company’s CEO.“They’re believers that this will be the global reserve currency,” Klippsten said. “This is the best moment for bitcoin marketing and bitcoin adoption in its history.”Cody Candee, the CEO of startup Bounce, got in touch with Swan this month, hoping to convert a portion of his company’s funds into bitcoin.“Having a couple percent in bitcoin feels like a really great insurance policy on the U.S. dollar, on the banking system, on the Fed, on the whole infrastructure,” he said.But Candee hesitated to commit fully. Bounce, which runs a network of luggage storage and package pickup locations, raised $12 million in a funding round last year. Candee said he planned to spend only $200,000 on bitcoin.“If that went substantially down,” he said, “it wouldn’t be an impact on the business.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vdW5kZXJzdGFuZGluZy1iaXRjb2luLWRvbWluYW5jZS1hLWNvbXByZWhlbnNpdmUtZ3VpZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "Understanding Bitcoin dominance: A comprehensive guide - OKX",
        "content": "Bitcoin (BTC) is the world's most traded and largest cryptocurrency. With a current market capitalization of over $543 billion, Bitcoin has the largest share of the entire cryptocurrency market.\n\nThis guide explains what Bitcoin dominance is, how to calculate it, the factors that influence it, and other related details.\n\nWhat Is Bitcoin dominance?\n\nIn simple terms, Bitcoin dominance is the ratio of BTC's market capitalization compared to the entire crypto market cap. Better still, it is the percentage of Bitcoin’s cryptocurrency market share from the total market capitalization of all existing cryptocurrencies. Total market capitalization refers to the total market value of all cryptocurrencies. An asset's market cap is determined by multiplying the asset's total supply by its current price.\n\nMany years ago, Bitcoin had 100% of the entire crypto market share, as there was a period in which it was the only tradeable asset. But with the introduction of Ethereum and other altcoins, Bitcoin dominance continued to drop. However, despite the thousands of altcoins on the market, Bitcoin's dominance is yet to be topped.\n\nHow Is BTC market dominance calculated?\n\nDue to the cryptos volatile nature, Bitcoin’s dominance isn't fixed and is ever changing. For instance, at the end of March 2023, Bitcoin’s market cap was about $543 billion. At the same time, the global crypto market cap was $1.18 trillion.\n\nThe Bitcoin dominance is the percentage that is calculated by dividing Bitcoin’s market share by the total market capitalization. Let's do the maths below:\n\nBitcoin Market Cap ($543 billion) ÷ Global Crypto Market Cap ($1.18 trillion) x 100% = 46%. In this example, the BTC dominance ratio as a percentage is 46%.\n\nHowever, there's also a term called \"Real BTC Dominance”. In this case, traders don't compare BTC's market cap with the global crypto market. Instead, it's compared with the combined market cap of proof-of-work cryptocurrencies. Some of these include Litecoin, Dogecoin and Bitcoin Cash. This method narrows BTC's performance to similar cryptocurrencies.\n\nThe relationship between Bitcoin dominance and market cap\n\nBitcoin dominance allows crypto traders to understand the trend of BTC and altcoins like Ethereum. Since BTC has the largest market share, it's easy to see the influence Bitcoin has on other altcoins. BTC's dominance has an inverse relationship with the market cap of other coins.\n\nFor instance, when Bitcoin dominance increases, the total market share of other cryptocurrencies reduces in value. Similarly, when BTC dominance reduces, the altcoin dominance increases.\n\nFactors influencing Bitcoin dominanceAs stated earlier, Bitcoin dominance isn't fixed. The value changes from time to time due to various factors. Some of these influencing factors are highlighted below:\n\nMarket volatility\n\nArguably the most influential factor affecting Bitcoin's dominance is the market's volatility. As previously mentioned, the cryptocurrency market is highly volatile. This means the total market cap, including Bitcoin, experiences drastic changes. However, Bitcoin's market dominance can increase even when the total market cap plummets. It ultimately depends on the price movement of the altcoin market. If the value of altcoins takes a greater hit than Bitcoin's, then the Bitcoin dominance will likely rise.\n\nAltcoin performance\n\nSince Ethereum launched in 2015, thousands of other altcoins and tokens have been created. Before this time, Bitcoin was the only primary digital currency, so it enjoyed the entire market share. However, with the addition of more altcoins, the dominance of Bitcoin has been negatively impacted, especially as these assets increase in adoption and price.\n\nStablecoin popularity\n\nWhile BTC is one of the most popular cryptocurrencies, its price volatility means investors move their funds from the asset during downturns. They turn to stablecoins. Stablecoins like Tether (USDT) have their values pegged to real-world assets like the USD, gold, and other assets. Because of this, assets like Tether, USD Coin (USDC), and Binance USD (BUSD) have grown in popularity.\n\nRisk-averse investors prefer to use these stablecoins as a store of value during periods of extreme volatility. Investors tend to do this since price swings hardly impact the price of stablecoins. Therefore, as they become more prominent among investors, their market presence increases, negatively impacting BTC dominance\n\nWhat are the uses of BTC dominance?\n\nCrypto traders use Bitcoin dominance for a variety of reasons. Some of them include the following:\n\nRisk-aversion\n\nWhen the Bitcoin dominance increases in value, traders are treading cautiously. This implies they're taking money from risky altcoins and putting it into a more stable asset like Bitcoin. This usually happens during downturns within the market as investors look to hedge their portfolios against decline.\n\nTradeable\n\nBesides being an indicator, the Bitcoin dominance index is also tradable on major cryptocurrency exchanges. It's offered as BTCDOM/USDT in its perpetual futures market. With this, traders can trade Bitcoin's market dominance.\n\nTrack market performance\n\nBitcoin is widely viewed as a measure of the performance of the total market cap in the crypto space. Given this, the broader crypto market capitalization tends to dip when the Bitcoin Dominance Index increases. However, when the BTC Dominance drops, the broader market sees a major uptrend due to increased investment in alternative digital assets like Ethereum, Shiba Inu, and others.\n\nHow to trade crypto using BTC dominance\n\nTrading with BTC dominance is a common practice. The common way to trade crypto using BTC dominance is to identify periods in which altcoins outperform Bitcoin, otherwise known as Altcoin season.\n\nAltcoin season occurs when altcoins experience a significant rise in prices while Bitcoin price stalls for a long period. This often leads to investors plowing their funds in these altcoins and kickstarting an uptrend in prices.\n\nInvestors can identify such periods by using the TradingView Bitcoin Dominance Index. This compares the BTC market capitalization relative to other cryptocurrencies. The end product helps show whether to buy BTC or if altcoins have a stronger trend in the financial landscape.\n\nIn the chart presented below, Bitcoin dominance is significantly rising, showing that an altcoin season is not in play.\n\nSimilarly, BTC dominance can be used to trade or predict cryptocurrency market extremes. When the BTC dominance ratio is very high, history shows that the coin’s price may fall. In contrast, low dominance suggests that the BTC price may experience an uptrend. As such, investors can use this data to determine when to buy or sell BTC.\n\nIs the Bitcoin dominance a reliable indicator?\n\nBitcoin dominance is a common crypto trading analysis tool among investors. It can be a viable tool to identify the market trend since it reflects BTC's strength relative to the broader market. It also provides useful insights into changing market conditions and when to adjust trading strategies. However, like other market data and trends, it does not guarantee that Bitcoin and other altcoins will react in a certain manor. Instead, the Bitcoin dominance index should be used as a guide alongside other market indicators.\n\nIn addition, the crypto market is still witnessing the launch of several more altcoin projects. The more altcoins there are, the less dominance BTC will enjoy due to the increased market share of these projects. This could shrink the market dominance of Bitcoin as more altcoins appear. Nonetheless, it still holds a strong position in the market and can still be used in identifying profitable trading positions.\n\nFAQ\n\nWhat is the Bitcoin dominance index?\n\nThe BTC dominance index is a cryptocurrency market analysis tool. The tool helps investors determine the market trend between Bitcoin and altcoins or other proof-of-work coins.\n\nWhy is BTC dominance important?\n\nBTC Dominance is crucial because it can provide insight into market trends. This way, when the BTC Dominance increases, it signals that investors are playing safe and hedging against riskier assets. When the BTC Dominance drops, it could suggest that investors are taking on riskier assets in hopes of higher profits. This helps traders get a snapshot of the overall market sentiment at a glance.\n\nWhere to check the BTC dominance chart?\n\nThe common place to find the Bitcoin dominance chart is on TradingView. Alternatively, users can use the chart available on CoinMarketCap.\n\nHow long does BTC dominance last?\n\nBTC dominance will last as long as Bitcoin remains the most valuable digital currency. However, the coin's dominance fluctuates from time to time.\n\nHow is Bitcoin dominance calculated?\n\nBitcoin dominance is calculated by dividing Bitcoin’s market cap by the total market cap of all cryptocurrencies, then multiplying by 100%. This gives a percentage value which represents Bitcoin's share of the total crypto market.\n\nWhat factors influence Bitcoin dominance?\n\nSeveral factors can affect Bitcoin dominance, including market volatility, the performance of altcoins, and the popularity of stablecoins. Market volatility can result in drastic changes in the market caps of all cryptocurrencies, including Bitcoin. Altcoin performance and the introduction of new altcoins can decrease Bitcoin's dominance, and the increased use of stablecoins can also impact Bitcoin's share of the total market.\n\nWhat does Bitcoin dominance tell us?\n\nBitcoin dominance is a measure of Bitcoin's market share compared to the entire crypto market. When Bitcoin's dominance increases, it indicates that investors may be moving their funds into Bitcoin as a safer investment compared to other cryptocurrencies. Conversely, a decrease in Bitcoin dominance could signal that investors are taking on riskier investments in altcoins.\n\nWhat is real BTC dominance?\n\nReal BTC Dominance is a term used to describe a measure of Bitcoin's market cap compared to the combined market cap of proof-of-work cryptocurrencies like Litecoin, Dogecoin, and Bitcoin Cash. This method provides a narrower comparison of Bitcoin's performance to similar cryptocurrencies.\n\nIs the Bitcoin dominance a reliable indicator?\n\nBitcoin dominance can provide valuable insights into market trends and can be a useful tool for traders. However, like all market indicators, it is not infallible and should be used in conjunction with other market data and trends.\n\nHow to use BTC dominance for crypto trading?\n\nBTC dominance is commonly used to identify the altcoin season - periods when altcoins outperform Bitcoin. If the BTC dominance is falling, this could signal an altcoin season, and traders may decide to invest in altcoins. Conversely, a rising BTC dominance could indicate a favorable market for Bitcoin.\n\nWhat does the increase in stablecoin popularity mean for BTC dominance?\n\nThe rise in stablecoin popularity can negatively impact BTC dominance. During periods of high market volatility, investors often move their funds into stablecoins, which have their values pegged to real-world assets. This can result in a decrease in Bitcoin's market share.\n\nWhat are the implications of more altcoins launching on BTC dominance?\n\nThe launch of more altcoins could potentially decrease Bitcoin's market dominance, as these new coins increase the total market cap of all cryptocurrencies. However, Bitcoin's dominance could remain high if it continues to be seen as a more stable or reliable investment compared to these new altcoins.\n\nDisclaimer:\n\nTHIS ARTICLE IS PROVIDED FOR INFORMATIONAL PURPOSES ONLY. IT IS NOT INTENDED TO PROVIDE ANY INVESTMENT, TAX, OR LEGAL ADVICE, NOR SHOULD IT BE CONSIDERED AN OFFER TO PURCHASE OR SELL OR HOLD DIGITAL ASSETS. DIGITAL ASSET HOLDINGS, INCLUDING STABLECOINS, INVOLVE A HIGH DEGREE OF RISK, CAN FLUCTUATE GREATLY, AND CAN EVEN BECOME WORTHLESS. YOU SHOULD CAREFULLY CONSIDER WHETHER TRADING OR HOLDING DIGITAL ASSETS IS SUITABLE FOR YOU IN LIGHT OF YOUR FINANCIAL CONDITION. PLEASE CONSULT YOUR LEGAL/TAX/INVESTMENT PROFESSIONAL FOR QUESTIONS ABOUT YOUR SPECIFIC CIRCUMSTANCES."
    }
]