[
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzJiNmFmOThkLWU1NTktNDYxYi05NmM2LWVjMzRiZjJlMmMyONIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Robinhood: bitcoin price rally is no salve for trading woes - Financial Times",
        "content": "Print this page\n\nThink this year’s S&P 500 rally of 15 per cent is pretty good? Take a look bitcoin’s price, which has more than doubled since January.\n\nYet even that has done little to lift the fortunes of Robinhood. The company, whose app allows users to trade a number of cryptocurrencies, has lost four-fifths of its value since hitting a high in 2021. The stock fell another 15 per cent on Wednesday.\n\nThird-quarter earnings underscore how the app is losing its cachet among young traders.\n\nRobinhood’s funded accounts grew by 360,000 year-on-year to 23.3mn. But fewer customers are actively trading. The number of monthly active users fell 16 per cent to just over 10mn compared with the period for the prior year. That is about half the figure reached at the height of the retail trading frenzy two years ago.\n\nThe company’s woes are not shared by all its rivals. Brokerage platform Charles Schwab added 665,000 active accounts during its third quarter. Morgan Stanley, which owns E*Trade, added about 300,000 accounts during the September quarter.\n\nOverall, Robinhood’s transaction-based revenue fell 11 per cent to $185mn during the quarter, amid a sharp drop in crypto and equities trading. It now makes more from its customers’ idle cash. Segregated client accounts hold about $3.5bn of cash and securities. Revenue from net interest income nearly doubled year-on-year to $251mn. Even so, it booked a net loss of $85mn.\n\nThe boost from net interest income should soon diminish. The Federal Reserve appears to have finished raising interest rates. That will make for tougher comparatives in future. This is reflected in Robinhood’s lowly valuation of less than four times revenue. Charles Schwab manages five times.\n\nRobinhood has sought to reinvent itself by branching out into new products such as retirement accounts. But to do so it will compete against established brands like Charles Schwab and Fidelity. It needs to find more arrows in its quiver to draw in more active traders."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1pbnNjcmlwdGlvbi1udW1iZXItNzYtc2VsbHMtZm9yLSUyNDYwMDAwLWluLWxhdGVzdC1zdWItMTAwLW9yZGluYWxzLXNhbGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Inscription Number 76 Sells for $60000 in Latest Sub-100 Ordinals Sale - Nasdaq",
        "content": "BTC Inc., through its Ordinals-focused division Rare BTC, has brokered the sale of inscription number 76 for 1.7 BTC, which is equivalent to approximately $61,000 at the time of sale.\n\nThe sale is indicative of the active interest and perceived value in the Ordinals space, with Rare BTC positioning itself as a key player in the market for these distinctive bitcoin-based digital artifacts and unique satoshis.\n\nThe bitcoin ecosystem saw Ordinals generate a craze earlier this year, between May and June, with trading volume nearing that seen on Ethereum NFTs and leading to a spike in bitcoin fees. After a somewhat dull summer, Ordinals activity is back and already nearing the highs seen in May. Notably, yesterday public Ordinals trading volume in the preceding 24 hours surpassed Ethereum NFT’s for the first time.\n\nRare BTC specializes in the sale of rare satoshis and Sub-100 Ordinals, considered to be highly sought after in the digital collectibles space. This recent transaction follows a previous successful brokerage by Rare BTC, where inscription number 20 was sold for 3 BTC.\n\nThe company’s role in the Ordinals market includes connecting collectors, artists, and independent brokers to facilitate transactions. BTC Inc.'s established network within the Bitcoin community and its reputation for reliability play a crucial part in completing these sales, particularly as it offers escrow services to ensure secure exchanges between buyers and sellers.\n\nThose interested in acquiring or selling prime Ordinal inscriptions, or seeking brokerage partnerships, can reach out to Rare BTC through their email at rare@b.tc or DM on Twitter (X). Further information about their services and offerings can be accessed on their website.\n\nBitcoin Magazine was a pioneer in the Ordinals space, having inscribed its own historic print magazine covers into the bitcoin blockchain among the first 100,000 inscriptions. The oldest cover, Historic Cover #1, sold for 1.25 BTC at auction.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYmluYW5jZS1jZW8tYmxhc3RzLWRyLWRvb21zLW5ldy10b2tlbi1hcy1zaGFtZWxlc3MtYW1pZHN0LWJpdGNvaW4tY3JpdGljcy11LXR1cm7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Binance CEO Blasts Dr Doom's New Token As 'Shameless' Amidst Bitcoin Critic's U-Turn - Nasdaq",
        "content": "Economist Nouriel Roubini popularly known as Dr Doom, long known for his critical stance towards cryptocurrencies, has made a sudden pivot by unveiling his own cryptocurrency. This surprising turn of events has stirred controversy, with Binance co-founder and CEO Changpeng Zhao expressing his disapproval.\n\nWhat Happened: Roubini, who once labeled Bitcoin as a “shitcoin,” belittled Ethereum, and dismissed blockchain technology as no more than a spreadsheet, has now ventured into the world of cryptocurrency with his latest project. However, this unexpected move has not been well received by Zhao.\n\nSome people are shameless. After attacking Binance publicly on stage a year ago, now issues a token and puts #Binance logo on their website WITHOUT permission. 🤡🤷‍♂️😂 pic.twitter.com/WENaTO4tE4\n\n— CZ 🔶 Binance (@cz_binance) November 7, 2023\n\nRoubini’s has ventured into launching a stablecoin. According to the project’s website, the Atlas Climate Token (ACT) is not just a digital investment contract, but an actual blockchain-based stablecoin. The stablecoin is designed to be pegged to a diverse portfolio of tangible real-world assets, including climate-resilient REITs, strategic commodities, inflation-hedged sovereign bonds, and gold, the project website reads.\n\nThe website also reveals that Atlas is currently in active discussions with top-tier ETF issuers and distributors to facilitate the launch of the ETF.\n\nTaking to X, Zhao did not hold back in criticizing Roubini. “Some people are shameless,” he wrote.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nSee More: A Stay At The Floating Palace From James Bond's ‘Octopussy\n\nWhy It Matters: Ironically, Roubini’s new crypto venture, Atlas Capital, highlighted the experience of one of its team members who had previously worked at Binance, seemingly using it as proof of their own credibility. This move did not sit well with Zhao.\n\nZhao accused Roubini of including the Binance logo on Atlas Capital’s website without permission. Since Zhao’s tweet, Atlas Capital has removed all external company logos, including that of Binance, from the “Team” page on its website.\n\nInterestingly, during a CNBC live event in Abu Dhabi last year, Roubini did not mince words when describing Zhao. Referring to him as a “walking time bomb.\"\n\nAt the time of writing, Bitcoin (CRYPTO: BTC) was trading at $36,338.55 up 2.29% in the last 24 hours, according to Benzinga Pro.\n\nPhoto Courtesy: Wikimedia Commons\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYmluYW5jZS1jZW8tYmxhc3RzLWRyLWRvb21zLW5ldy10b2tlbi1hcy1zaGFtZWxlc3MtYW1pZHN0LWJpdGNvaW4tY3JpdGljcy11LXR1cm7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Binance CEO Blasts Dr Doom's New Token As 'Shameless' Amidst Bitcoin Critic's U-Turn - Nasdaq",
        "content": "Economist Nouriel Roubini popularly known as Dr Doom, long known for his critical stance towards cryptocurrencies, has made a sudden pivot by unveiling his own cryptocurrency. This surprising turn of events has stirred controversy, with Binance co-founder and CEO Changpeng Zhao expressing his disapproval.\n\nWhat Happened: Roubini, who once labeled Bitcoin as a “shitcoin,” belittled Ethereum, and dismissed blockchain technology as no more than a spreadsheet, has now ventured into the world of cryptocurrency with his latest project. However, this unexpected move has not been well received by Zhao.\n\nSome people are shameless. After attacking Binance publicly on stage a year ago, now issues a token and puts #Binance logo on their website WITHOUT permission. 🤡🤷‍♂️😂 pic.twitter.com/WENaTO4tE4\n\n— CZ 🔶 Binance (@cz_binance) November 7, 2023\n\nRoubini’s has ventured into launching a stablecoin. According to the project’s website, the Atlas Climate Token (ACT) is not just a digital investment contract, but an actual blockchain-based stablecoin. The stablecoin is designed to be pegged to a diverse portfolio of tangible real-world assets, including climate-resilient REITs, strategic commodities, inflation-hedged sovereign bonds, and gold, the project website reads.\n\nThe website also reveals that Atlas is currently in active discussions with top-tier ETF issuers and distributors to facilitate the launch of the ETF.\n\nTaking to X, Zhao did not hold back in criticizing Roubini. “Some people are shameless,” he wrote.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nSee More: A Stay At The Floating Palace From James Bond's ‘Octopussy\n\nWhy It Matters: Ironically, Roubini’s new crypto venture, Atlas Capital, highlighted the experience of one of its team members who had previously worked at Binance, seemingly using it as proof of their own credibility. This move did not sit well with Zhao.\n\nZhao accused Roubini of including the Binance logo on Atlas Capital’s website without permission. Since Zhao’s tweet, Atlas Capital has removed all external company logos, including that of Binance, from the “Team” page on its website.\n\nInterestingly, during a CNBC live event in Abu Dhabi last year, Roubini did not mince words when describing Zhao. Referring to him as a “walking time bomb.\"\n\nAt the time of writing, Bitcoin (CRYPTO: BTC) was trading at $36,338.55 up 2.29% in the last 24 hours, according to Benzinga Pro.\n\nPhoto Courtesy: Wikimedia Commons\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8xMS8zNTY5MTAzOC9iaXRjb2luLWV0aGVyZXVtLWRvZ2Vjb2luLXN1cmdlLWFzLWRvemVuLWJ0Yy1ldGZzLWhhdmUtYnJpZWYtd2luZG93LWZvci1zZWMtYXBwcm92YWwtYW5hbHnSAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzU2OTEwMzg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum, Dogecoin Surge As Dozen BTC ETFs Have 'Brief Window' For SEC Approval: Analyst Predict - Benzinga",
        "content": "Major cryptocurrencies experienced a significant surge on Wednesday evening amid anticipation surrounding the upcoming decision by the Securities and Exchange Commission (SEC). Starting tomorrow, a limited time frame will emerge, within which the approval of 12 pending Bitcoin ETF applications could potentially take place.\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EST) Bitcoin BTC/USD +1.51% $35,929 Ethereum ETH/USD +0.66% $1,909 Dogecoin DOGE/USD +3.07% $0.076\n\nWhat Happened: The BlackRock iShares Spot Bitcoin ETF and the conversion of the Grayscale Bitcoin Trust could potentially receive approval, as suggested by Bloomberg analysts James Seyffart and Eric Balchunas.\n\nTheir reasoning stems from the fact that when the SEC granted an extension for pending ETF applications, it designated Wednesday, Nov. 8 as the cutoff date for rebuttal comments. It is also possible that the SEC might approve multiple funds before Nov. 17, but mandate that all of them commence trading on the same day.\n\n\"Delay orders were issued by the SEC for BlackRock, Bitwise, VanEck, WisdomTree, Invesco, Fidelity & Valkyrie at the same time,\" Seyffart wrote on X. \"If the agency wants to allow all 12 filers to launch—as we believe—this is the first available window since Grayscale’s court victory was affirmed.\"\n\nMeet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga’s exclusive event – Future of Digital Assets. Tickets are flying- get yours!\n\nTop Gainer (24 Hour)\n\nCryptocurrency Gains +/- Price (Recorded 9:30 p.m. EDT) Toncoin +9.56% $2.63 Woo Network +9.03% $0.26 Polygon +8.53% $0.77\n\nThe global crypto market cap currently stands at $1.33 trillion, reflecting an increase of 0.92% in the past 24 hours.\n\nThe S&P 500 continued its winning streak on Wednesday, marking its eighth consecutive day of gains – the longest streak in two years. The index added 0.1% to reach a closing level of 4,382.78, matching the eight-day winning run it achieved in November 2021.\n\nMeanwhile, the Nasdaq Composite closed slightly higher, climbing by 0.08% to settle at 13,650.41. This marked the index’s ninth consecutive positive day, also its longest winning streak in two years.\n\nIn addition to these market movements, investors are eagerly anticipating forthcoming statements from Federal Reserve Chair Jerome Powell at the IMF on Thursday.\n\nSee More: Best Cryptocurrency Scanners\n\nAnalyst Notes: Michael Van de Poppe believes that Bitcoin is currently maintaining a strong upward trend, characterized by higher highs and higher lows. He anticipates that the next target for Bitcoin is around $37-38K. \"If that happens, buy the dip.\"\n\nPseudonymous crypto analyst TradingShot has made a bold prediction on the TradingView website, suggesting that the price of Bitcoin could potentially reach a staggering $200,000. This analysis centers around the Bitcoin Vortex bullish cross and the Bollinger Bands Width (BBW) bottoms, indicators used to determine when BTC may embark on its next parabolic rally.\n\nThe analyst’s forecast is based on the upcoming Bitcoin halving event, scheduled to occur in Q2 2024. According to the analyst, this event marks the beginning of the final and most aggressive phase of the Bull Cycle’s Parabolic Rally sequence.\n\nSantiment, the on-chain data analytics firm, has reported that Bitcoin has experienced a remarkable surge of +37% in just 2 months. This surge has resulted in a significant increase in the ratio of traders opening bullish positions compared to bearish positions, reaching its highest level in the past 3 months. Furthermore, the total open interest on exchanges has skyrocketed to an impressive $7.2 billion. With hopes that the fear of missing out (FOMO) will subside, it is anticipated that Bitcoin will continue its upward trajectory.\n\nCrypto Photo by Fernando Cortes on Shutterstock\n\n\n\nJoin Benzinga’s Fintech Deal Day & Awards on Nov. 13 and Future of Digital Assets on Nov. 14 in New York City to stay updated on trends like AI, regulations, SEC actions and institutional adoption in the crypto space. Secure early bird discounted tickets now!\n\nRead Next: Jim Cramer Advises Against Using Binance, Provokes Strong Reactions From Twitter Users"
    }
]