[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTAyL2phY2stZG9yc2V5LXMtYmxvY2staW5jLXRvLXRhcC1iaXRjb2luLXJlc2VydmVzLWZvci1saWdodG5pbmctbmV0d29ya9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Mar 2023 08:00:00 GMT",
        "title": "Jack Dorsey’s Block (SQ) Taps Bitcoin Reserves Lightning Network - Bloomberg",
        "content": "Jack Dorsey ’s digital payment company Block Inc. said it will be using its own Bitcoin reserves to provide liquidity to Bitcoin’s Lightning Network, a protocol meant to make transactions on the blockchain more efficient.\n\nTBD, the Bitcoin-focused unit of Block, plans to launch a so-called Lightning Service Provider named c=, hoping to reduce failed transactions on the Lightning Network stemming from a lack of liquidity."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTAyL2phY2stZG9yc2V5LXMtYmxvY2staW5jLXRvLXRhcC1iaXRjb2luLXJlc2VydmVzLWZvci1saWdodG5pbmctbmV0d29ya9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Mar 2023 08:00:00 GMT",
        "title": "Jack Dorsey’s Block (SQ) Taps Bitcoin Reserves Lightning Network - Bloomberg",
        "content": "Jack Dorsey ’s digital payment company Block Inc. said it will be using its own Bitcoin reserves to provide liquidity to Bitcoin’s Lightning Network, a protocol meant to make transactions on the blockchain more efficient.\n\nTBD, the Bitcoin-focused unit of Block, plans to launch a so-called Lightning Service Provider named c=, hoping to reduce failed transactions on the Lightning Network stemming from a lack of liquidity."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMveGFwby1iYW5rLWJlY29tZXMtZmlyc3QtYmFuay10by1vZmZlci1iaXRjb2luLWxpZ2h0bmluZy1wYXltZW50c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Mar 2023 08:00:00 GMT",
        "title": "Xapo Bank Becomes First Bank To Offer Bitcoin Lightning Payments - Nasdaq",
        "content": "Xapo is partnering with Lightspark to allow its customers to send bitcoin near-instantaneously to any vendor who accepts BTC over Lightning.\n\nGibraltar-licensed private bank Xapo Bank has partnered with Lightspark, the startup spearheaded by former Facebook crypto lead David Marcus, to integrate the Lightning Network and enable near-instant bitcoin payments for its customers.\n\nXapo Bank members can now make small purchases of up to $100 USD at any vendor that accepts Lightning payments, without high transaction fees and long blockchain confirmation waiting times. This integration will make Xapo Bank the first fully licensed private bank to offer Lightning payments.\n\nThe Lightning Network enables scalable payments at millions of transactions per second across the network, reducing the time-consuming and costly experiences often faced by users who pay for small transactions in bitcoin.\n\nSeamus Rocca, CEO of Xapo Bank, said in regards to the partnership, \"By integrating with the hyper-efficient Lightning Network, we are the first bank in the world to streamline this process and allow our members to pay for small purchases with Bitcoin without having to convert to USD first.\" Rocca added that Xapo Bank offers an annual interest rate of 4.1% on US dollars and will soon be offering up to 1% on Bitcoin, to be paid out daily.\n\n\n\n\"We're thrilled to enable the first bank on the Lightning Network to offer instant, cheap Bitcoin payments to its customers,” said David Marcus, co-founder and CEO of Lightspark. “Xapo has been one of our early closed beta partners, and we're delighted they chose Lightspark's enterprise-grade solution to reliably send and receive payments on the Lightning Network without all the complexity and operational overhead that typically comes with running a node on it.\"\n\nXapo Bank members can pay via the Lightning Network by holding bitcoin in the Xapo Bank App and scanning and paying an invoice at any merchant that accepts Lightning payments.\n\n\n\nThe network charges a small fee for each transaction, and Xapo Bank has set a fixed payment fee for 15 sats to protect members from executing transactions with high fees.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWZhbGxzLWJlbG93LXVzLTIzLTAyNTM1NDcwNC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin falls below US$23,000, Ether slides in crypto price slump across the board - Yahoo Finance",
        "content": "Bitcoin and Ether prices slumped in Friday morning trading in Asia, along with all other top 10 non-stablecoin cryptocurrencies amid reports U.S.-based cryptocurrency bank Silvergate Capital Corp. could be the next corporate victim of the FTX crash. Polkadot led the losses. U.S. equities rose Thursday after a week of fluctuations on conflicting Federal Reserve comments about interest rates and data suggesting inflation is well entrenched in the economy.\n\nSee related article: Bitcoin’s price gains this year bring needed relief to cash-strapped crypto mining industry\n\nBitcoin fell 3.22% in the past 24 hours to US$22,827 as of 09:30 a.m. in Hong Kong, according to CoinMarketCap data, extending its weekly loss to 4.78%. Ether dropped 3.19% to US$1,602, for a seven-day fall of 3.33%.\n\nBoth tokens fell as much as 5% later in the Asia morning. Despite the slump, both are still up around 40% for the year to date.\n\nPolkadot led the losers among the top cryptocurrencies, sliding 6.00% to US$6.08, and losing 14.63% in the past seven days. The token has been in a downward trend for two weeks, though the Polkadot community remains active, leading the daily development on Github, according to Github tracker ProofofGithub on Thursday.\n\nSilvergate said Thursday in a filing to the U.S. Securities and Exchange Commission (SEC) that the company is evaluating “its ability to continue as a going concern,” which sparked a more than 50% plunge in its stock price. A raft of crypto exchanges and platforms have cut ties with the bank.\n\nAs a Federal Reserve member bank, Silvergate positioned itself as a gate between traditional finance and crypto. The bank was hit hard by the FTX collapse and reported a US$1 billion loss for the fourth quarter of 2022. It laid off 40% of its staff in January.\n\nThe total crypto market capitalization dropped 1.02% in the past 24 hours to US$1.07 trillion. And the total trading volume over the last 24 hours went down 12.30% to US$42.65 billion.\n\nU.S. equities closed higher on Thursday. The Dow Jones Industrial Average rose 1.05%, the S&P 500 moved up 0.76% and the Nasdaq Composite Index edged higher to 0.73%.\n\nAtlanta Fed President Raphael Bostic indicated on Thursday that he supports an interest rate increase of 25 basis points in March, alleviating some recent concern the Fed may hike 50 points. This helped stocks move higher, but the market is caught in cross-currents as Fed Governor Christopher Waller said the same day that recent data suggests the inflation fight is far from over.\n\nData from the U.S. Department of Labour on Thursday showed initial jobless claims fell in the week ending Feb. 25, while labor costs rose, indicating inflation hasn’t been tamed by the Fed’s interest rate hikes so far.\n\nThe Fed set U.S. interest rates between 4.5% to 4.75% in February, the highest since October 2007. Analysts at the CME Group expect a 72.3% chance that the Fed will raise rates by another 25 basis points this month. They also predict a 27.7% chance for a raise of 50 basis points, a decrease from 29.9% on Thursday."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jbGVhbnNwYXJrLXJlbGVhc2VzLWZlYnJ1YXJ5LTIwMjMtYml0Y29pbi0xNDAwMDAxNDQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Mar 2023 08:00:00 GMT",
        "title": "CleanSpark Releases February 2023 Bitcoin Mining Update - Yahoo Finance",
        "content": "Company mines 576 bitcoin in the year’s shortest month; hits new efficiency milestone of 30.6 watts per terahash\n\nLAS VEGAS, March 02, 2023 (GLOBE NEWSWIRE) -- CleanSpark, Inc. (Nasdaq: CLSK), America’s Bitcoin Miner™, today released its unaudited bitcoin mining and operations update for the month ending February 28, 2023.\n\n“Our background in energy efficiency gives us a clear advantage in the market as we make incremental improvements to our mining fleet,” said Zach Bradford, CEO. “For example, this month we improved our efficiency by over three percent compared to December 2022, when we last reported these numbers in our quarterly report. That progress, coupled with average wholesale power rates as low as two cents per kilowatt hour, has allowed us to increase our profit margins even as production compressed month-over-month due to February being the shortest month of the year. Months like February are practice-runs for halving—and we intend to continue to test and deploy all hardware and software at our disposal in our bid to be the best prepared miner when halving happens next year.\n\n“Meanwhile, construction continues in Washington, where an additional 50 megawatts are set to go online in a few months. We are relying on everything we have learned in this space, since constructing our very first mining campus in College Park, as we build the Washington expansion. Our ability to constantly iterate—whether we are building air-cooled facilities or deploying latest-gen immersion cooling—is built into the CleanSpark way. It’s how we have managed to grow fast and reliably in the few short years since we entered this industry—and how we’ll continue to grow well into our future.”\n\nFebruary Bitcoin Mining Update (unaudited)\n\nBitcoin mined in February: 576\n\nCY2023 bitcoin mined: 1,273\n\nTotal BTC holdings as of February 28: 100\n\nTotal BTC converted for operations and growth in February: 778\n\nCurrently deployed fleet of about 66,900 latest-generation bitcoin miners with a hashrate of 6.6 EH/s\n\nStory continues\n\nThe Company funded growth and operations through the sale of 778 bitcoins in February 2023 at an average of approximately $23K per BTC (compared to $19K in January 2023). Sales of BTC equated to proceeds of approximately $17.9 million. February daily BTC mined averaged about 20.6 and reached a high of 21.5.\n\nAbout CleanSpark\n\nCleanSpark (NASDAQ: CLSK) is America’s Bitcoin Miner™. Since 2014, we’ve helped people achieve energy independence for their homes and businesses. In 2020, we began applying that expertise to develop sustainable infrastructure for Bitcoin, an essential tool for financial independence and inclusion. We strive to leave the planet better than we found it by sourcing and investing in low-carbon energy, like wind, solar, nuclear, and hydro. We cultivate trust and transparency among our employees, the communities we operate in, and the people around the world who depend on Bitcoin. CleanSpark is a Forbes 2022 America’s Best Small Company and holds the 44th spot on the Financial Times’ List of the 500 Fastest Growing Companies in the Americas. For more information about CleanSpark, please visit our website at www.cleanspark.com.\n\nForward-Looking Statements\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding expectations for expansion of the Company’s Washington, Georgia bitcoin mining facility, the resulting anticipated benefits to CleanSpark (including as to anticipated additions to CleanSpark’s hashrate and the timing thereof) and plans to expand the facility. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). All statements other than statements of historical facts contained in this press release may be forward-looking statements. In some cases, you can identify forward-looking statements by terms such as “may,” “will,” “should,” “expects,” “plans,” “anticipates,” “could,” “intends,” “targets,” “projects,” “contemplates,” “believes,” “estimates,” “forecasts,” “predicts,” “potential” or “continue” or the negative of these terms or other similar expressions. Forward-looking statements contained in this press release, but are not limited to statements regarding our future results of operations and financial position, industry and business trends, business strategy, expansion plans, market growth and our objectives for future operations.\n\nThe forward-looking statements in this press release are only predictions. We have based these forward-looking statements largely on our current expectations and projections about future events and financial trends that we believe may affect our business, financial condition and results of operations. Forward-looking statements involve known and unknown risks, uncertainties and other important factors that may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements, including, but not limited to: the anticipated timing of the expansion; the risk that the electrical power available to our facilities does not increase as expected; the success of its digital currency mining activities; the volatile and unpredictable cycles in the emerging and evolving industries in which we operate; increasing difficulty rates for bitcoin mining; bitcoin halving; new or additional governmental regulation; the anticipated delivery dates of new miners; the ability to successfully deploy new miners; the dependency on utility rate structures and government incentive programs; dependency on third-party power providers for expansion efforts; the expectations of future revenue growth may not be realized; and other risks described in the Company's prior press releases and in its filings with the Securities and Exchange Commission (SEC), including under the heading \"Risk Factors\" in the Company's Annual Report on Form 10-K and any subsequent filings with the SEC. The forward-looking statements in this press release are based upon information available to us as of the date of this press release, and while we believe such information forms a reasonable basis for such statements, such information may be limited or incomplete, and our statements should not be read to indicate that we have conducted an exhaustive inquiry into, or review of, all potentially available relevant information. These statements are inherently uncertain and investors are cautioned not to unduly rely upon these statements.\n\nYou should read this press release with the understanding that our actual future results, performance and achievements may be materially different from what we expect. We qualify all of our forward-looking statements by these cautionary statements. These forward-looking statements speak only as of the date of this press release. Except as required by applicable law, we do not plan to publicly update or revise any forward-looking statements contained in this press release, whether as a result of any new information, future events or otherwise.\n\nInvestor Relations Contact\n\nMatt Schultz, Executive Chairman\n\nir@cleanspark.com\n\nMedia Contacts\n\nIsaac Holyoak\n\npr@cleanspark.com\n\nBlocksBridge Consulting\n\ncleanspark@blocksbridge.com\n\nCONTACT: Isaac Holyoak CleanSpark Inc. 702-989-7694 pr@cleanspark.com\n\n\n\n"
    }
]