[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLWNvbnNvbGlkYXRlcy1hdDI3NTAwLXBvc3QtbGFzdC13ZWVrcy1zaG9ydC10ZXJtLXJhbGx5L2FydGljbGVzaG93LzEwNDIzMjQyMy5jbXPSAY4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1jb25zb2xpZGF0ZXMtYXQyNzUwMC1wb3N0LWxhc3Qtd2Vla3Mtc2hvcnQtdGVybS1yYWxseS9hbXBfYXJ0aWNsZXNob3cvMTA0MjMyNDIzLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin consolidates at $27,500 post last week’s short-term rally - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nAfter surging above the US$28,000 level, Bitcoin traded between US$27,500 and US$27,800 this week. Factors such as a surge in the US 10-year Treasury yield by 11 basis points to reach 4.8% on Tuesday, and traders capitalizing on recent profits, led to a period of consolidation.The immediate resistance levels for Bitcoin on the upside are located around US$27,650 and subsequently US$28,000. A decisive breakthrough above the US$28,000 resistance level could trigger another bullish run. However, if Bitcoin fails to maintain its upward momentum, the next support level is positioned around US$27,400, with further support possibly at US$27,200.It's noteworthy that Bitcoin has demonstrated a remarkable year-to-date performance, surging by 65%, although it remains down by 59% from its all-time high.In parallel with Bitcoin, Ethereum closely followed a similar trajectory in its price action. Ethereum initiated an attempt at recovery, originating from the US$1,630 zone. Key resistance levels for ETH are seen at US$1,650 and then US$1,720. Failing to breach these immediate resistance levels could lead to a retracement, with the next crucial support situated at US$1,600. Despite a 66% decline from its all-time high, Ethereum has shown resilience in 2023, registering a 34% increase year-to-date.In an interesting turn of events, Ethereum futures exchange-traded funds (ETFs) have commenced trading in the US. Diverse investment firms, including ProShares, VanEck, Bitwise, Valkyrie, Kelly, and Volshares, collectively launched a total of 9 ETFs on the Chicago Board Options Exchange (CBOE), marking a significant milestone in the crypto investment landscape.Furthermore, the Canadian Securities Administrators (CSA) has taken a proactive stance by offering guidance to cryptocurrency exchanges and issuers regarding their interim approach to what they term \"value-referenced crypto assets.\" This guidance, with a specific focus on stablecoins , provides much-needed clarity and a regulatory framework for crypto-service providers operating in Canada.Lastly, following ongoing efforts to convert its Bitcoin Trust into an exchange-traded fund, Grayscale has now revealed its intentions to pursue a similar transformation for its Ethereum product, highlighting the growing interest and demand for crypto ETFs as traditional financial institutions embrace digital assets.Coming to the price action, among the top 100 cryptos by market cap, here are the best and worst-performing cryptos over the past week:As per prices on Friday.1. Trust Wallet Token is up by 20%2. Solana is up by 15%3. Bitcoin SV is up by 14%4. Avalanche is up by 13%5. Render is up by 13%1. Frax Share is down by 12%2. ApeCoin is down by 11%3. Pepe is down by 10%4. Compound is down by 9%5. Curve DAO Token is down by 9%(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLWNvbnNvbGlkYXRlcy1hdDI3NTAwLXBvc3QtbGFzdC13ZWVrcy1zaG9ydC10ZXJtLXJhbGx5L2FydGljbGVzaG93LzEwNDIzMjQyMy5jbXPSAY4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1jb25zb2xpZGF0ZXMtYXQyNzUwMC1wb3N0LWxhc3Qtd2Vla3Mtc2hvcnQtdGVybS1yYWxseS9hbXBfYXJ0aWNsZXNob3cvMTA0MjMyNDIzLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin consolidates at $27,500 post last week’s short-term rally - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nAfter surging above the US$28,000 level, Bitcoin traded between US$27,500 and US$27,800 this week. Factors such as a surge in the US 10-year Treasury yield by 11 basis points to reach 4.8% on Tuesday, and traders capitalizing on recent profits, led to a period of consolidation.The immediate resistance levels for Bitcoin on the upside are located around US$27,650 and subsequently US$28,000. A decisive breakthrough above the US$28,000 resistance level could trigger another bullish run. However, if Bitcoin fails to maintain its upward momentum, the next support level is positioned around US$27,400, with further support possibly at US$27,200.It's noteworthy that Bitcoin has demonstrated a remarkable year-to-date performance, surging by 65%, although it remains down by 59% from its all-time high.In parallel with Bitcoin, Ethereum closely followed a similar trajectory in its price action. Ethereum initiated an attempt at recovery, originating from the US$1,630 zone. Key resistance levels for ETH are seen at US$1,650 and then US$1,720. Failing to breach these immediate resistance levels could lead to a retracement, with the next crucial support situated at US$1,600. Despite a 66% decline from its all-time high, Ethereum has shown resilience in 2023, registering a 34% increase year-to-date.In an interesting turn of events, Ethereum futures exchange-traded funds (ETFs) have commenced trading in the US. Diverse investment firms, including ProShares, VanEck, Bitwise, Valkyrie, Kelly, and Volshares, collectively launched a total of 9 ETFs on the Chicago Board Options Exchange (CBOE), marking a significant milestone in the crypto investment landscape.Furthermore, the Canadian Securities Administrators (CSA) has taken a proactive stance by offering guidance to cryptocurrency exchanges and issuers regarding their interim approach to what they term \"value-referenced crypto assets.\" This guidance, with a specific focus on stablecoins , provides much-needed clarity and a regulatory framework for crypto-service providers operating in Canada.Lastly, following ongoing efforts to convert its Bitcoin Trust into an exchange-traded fund, Grayscale has now revealed its intentions to pursue a similar transformation for its Ethereum product, highlighting the growing interest and demand for crypto ETFs as traditional financial institutions embrace digital assets.Coming to the price action, among the top 100 cryptos by market cap, here are the best and worst-performing cryptos over the past week:As per prices on Friday.1. Trust Wallet Token is up by 20%2. Solana is up by 15%3. Bitcoin SV is up by 14%4. Avalanche is up by 13%5. Render is up by 13%1. Frax Share is down by 12%2. ApeCoin is down by 11%3. Pepe is down by 10%4. Compound is down by 9%5. Curve DAO Token is down by 9%(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLWNvbnNvbGlkYXRlcy1hdDI3NTAwLXBvc3QtbGFzdC13ZWVrcy1zaG9ydC10ZXJtLXJhbGx5L2FydGljbGVzaG93LzEwNDIzMjQyMy5jbXPSAY4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1jb25zb2xpZGF0ZXMtYXQyNzUwMC1wb3N0LWxhc3Qtd2Vla3Mtc2hvcnQtdGVybS1yYWxseS9hbXBfYXJ0aWNsZXNob3cvMTA0MjMyNDIzLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin consolidates at $27,500 post last week’s short-term rally - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nAfter surging above the US$28,000 level, Bitcoin traded between US$27,500 and US$27,800 this week. Factors such as a surge in the US 10-year Treasury yield by 11 basis points to reach 4.8% on Tuesday, and traders capitalizing on recent profits, led to a period of consolidation.The immediate resistance levels for Bitcoin on the upside are located around US$27,650 and subsequently US$28,000. A decisive breakthrough above the US$28,000 resistance level could trigger another bullish run. However, if Bitcoin fails to maintain its upward momentum, the next support level is positioned around US$27,400, with further support possibly at US$27,200.It's noteworthy that Bitcoin has demonstrated a remarkable year-to-date performance, surging by 65%, although it remains down by 59% from its all-time high.In parallel with Bitcoin, Ethereum closely followed a similar trajectory in its price action. Ethereum initiated an attempt at recovery, originating from the US$1,630 zone. Key resistance levels for ETH are seen at US$1,650 and then US$1,720. Failing to breach these immediate resistance levels could lead to a retracement, with the next crucial support situated at US$1,600. Despite a 66% decline from its all-time high, Ethereum has shown resilience in 2023, registering a 34% increase year-to-date.In an interesting turn of events, Ethereum futures exchange-traded funds (ETFs) have commenced trading in the US. Diverse investment firms, including ProShares, VanEck, Bitwise, Valkyrie, Kelly, and Volshares, collectively launched a total of 9 ETFs on the Chicago Board Options Exchange (CBOE), marking a significant milestone in the crypto investment landscape.Furthermore, the Canadian Securities Administrators (CSA) has taken a proactive stance by offering guidance to cryptocurrency exchanges and issuers regarding their interim approach to what they term \"value-referenced crypto assets.\" This guidance, with a specific focus on stablecoins , provides much-needed clarity and a regulatory framework for crypto-service providers operating in Canada.Lastly, following ongoing efforts to convert its Bitcoin Trust into an exchange-traded fund, Grayscale has now revealed its intentions to pursue a similar transformation for its Ethereum product, highlighting the growing interest and demand for crypto ETFs as traditional financial institutions embrace digital assets.Coming to the price action, among the top 100 cryptos by market cap, here are the best and worst-performing cryptos over the past week:As per prices on Friday.1. Trust Wallet Token is up by 20%2. Solana is up by 15%3. Bitcoin SV is up by 14%4. Avalanche is up by 13%5. Render is up by 13%1. Frax Share is down by 12%2. ApeCoin is down by 11%3. Pepe is down by 10%4. Compound is down by 9%5. Curve DAO Token is down by 9%(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLXByaWNlLXJpc2UtdG8tMjIwMDAv0gFFaHR0cHM6Ly93d3cubmV3c2J0Yy5jb20vbmV3cy9iaXRjb2luL2JpdGNvaW4tcHJpY2UtcmlzZS10by0yMjAwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Price: El Salvador Crypto Advisor Predicts Explosive Rise To $220,000 - NewsBTC",
        "content": "In a recent development, Bitcoin proponent and crypto advisor to El Salvador’s President Max Keiser has made a future prediction for the Bitcoin price, joining the ranks of analysts who have made bold assertions about the flagship cryptocurrency’s trajectory.\n\nKeiser Says Bitcoin Price To $220,000\n\nIn a tweet shared on his X (formerly Twitter) platform, Keiser stated that the Bitcoin price will experience an explosive rise to $220,000 in the short term. However, he didn’t specify how soon the crypto token would see such a rally. He made this assertion in response to a CNBC article about the current decline in the financial market amid economic and inflation concerns.\n\nIn a subsequent tweet, Keiser once again reiterated that Bitcoin would rise to $220,000 as he claims that “Central banks will print a wall of money visible from outer space.” His belief seems to stem from the fact that many will be looking to use Bitcoin as a hedge against rising inflation.\n\nHe even alluded to the fact that the US dollar was losing its purchasing power “at a very rapid pace.” He gave an instance of how paying $100 for hamburgers years ago looked like a joke, but he had just spent “$84 for a very ordinary hamburger.”\n\nFor the longest time, Keiser has been bullish on the foremost cryptocurrency. In 2011, he called Bitcoin the “currency of the resistance” and the “biggest story of the decade.” Additionally, he always touted a financial collapse as what would spark a massive rally in the Bitcoin price. Then, he stated that Bitcoin’s adoption and price will increase as banks collapse.\n\nArthur Hayes, the co-founder of BitMEX, also shares similar sentiments with Keiser. He recently stated that the government would likely resort to money printing to save the bond market, which could lead to a meteoric rise in Bitcoin’s price and other cryptocurrencies.\n\nBTC bulls struggle to maintain control | Source: BTCUSD on Tradingview.com\n\nIs Inflation Good Or Bad For Crypto?\n\nThere seem to be divergent views on how rising inflation could affect Bitcoin and the crypto market by extension. While people like Keiser and Hayes see rising inflation as bullish for Bitcoin, others like Crypto analyst Nicholas Merten believe that inflation could spell more trouble for Bitcoin’s price.\n\nAccording to Merten, the Federal Reserve needs to keep hiking interest rates to bring down the inflation rate as there is excess money in the system due to the “excess printing of money.” Meanwhile, Bloomberg analyst Mike McGlone warned that the rising interest rates could cause a further decline in the Bitcoin price.\n\nThere also seems to be a correlation between the stock and crypto markets. As such, it doesn’t seem like Bitcoin and the crypto market exist in isolation, as any financial crisis could significantly impact it.\n\nFeatured image from The Face, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3Mvc3RvY2tzL3N0b2NrLW1hcmtldC1mb3JlY2FzdC1ncmFudGhhbS1jcmFzaC1ob3VzZS1wcmljZXMtcmVjZXNzaW9uLWJpdGNvaW4tYWktMjAyMy0xMNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 07 Oct 2023 07:00:00 GMT",
        "title": "Grantham on 50% Crash in S&P 500, House Prices, Recession, Bitcoin, AI - Markets Insider",
        "content": "Stocks are in a bubble and could crash by over 50% if it ends badly, Jeremy Grantham says.\n\nThe elite investor sees house prices falling and predicts a recession will strike next year.\n\nHere are his 16 best quotes from a new interview, including comments about bitcoin and AI.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nJeremy Grantham floated the possibility of a 50% crash in the S&P 500, predicted US house prices would drop, and rang the recession alarm during the latest episode of Bloomberg's \"Merryn Talks Money\" podcast.\n\nThe GMO cofounder and market-bubble historian also slammed bitcoin as a scam, advised against buying US stocks or real estate, and shared his outlook for fossil fuels and artificial intelligence.\n\nHere are Grantham's 16 best quotes, lightly edited for length and clarity:\n\n1. \"The market suffers from attention deficit disorder, so it always thinks every rally is the beginning of the next great bull market.\"\n\n2. \"If everything works out badly, I would not be amazed if the S&P went to 2,000. That would require a couple of wheels to fall off, and wheels tend to fall off in the great bubbles' unraveling, but it doesn't mean they have to. The S&P would be unlikely not to get to something close to 3,000.\"\n\nAdvertisement\n\n3. \"The simple arithmetic suggests you'll either have a dismal return forever, or you'll have a nice bear market and then a normal return. And the nice bear market will be hopefully less than a 50% decline, but it won't be a huge amount less than 50% from the peak in real terms.\"\n\n4. \"You increase the pressure on a very complicated system until a few things snap. That is the pattern — something breaks and nobody seems to know what it is. It's always a surprise, but you always have a surprise, so the idea of a surprise is totally unsurprising.\"\n\n5. \"My guess is we will have a recession. I don't know whether it will be fairly mild or fairly serious, but it will probably go deep into next year.\"\n\n6. \"The most vulnerable area in my opinion is the Russell 2000. It often has no collective earnings at all. It has a very high density of zombies — companies that really can only pay their interest payments by issuing more debt. They're vulnerable on the debt front, vulnerable on the financial front, and vulnerable on a broad economic front.\"\n\nAdvertisement\n\n7. \"An over 40-year period of driving down mortgage rates, of course you drove up house prices all over the world, pretty much. And now the rates have gone up, of course it will drive down.\"\n\n8. \"House prices are worse for the ordinary household. They're worse for the economy than stocks because they're substantially more broadly owned. It's really an important part of the median family's income picture and capital picture. The motto should be, 'Don't mess with housing.' The super motto should be, 'Never have a housing bubble at the same time as you have a stock-market bubble.'\"\n\n9. \"Although we didn't get carried away with ridiculous subprime this time, the multiple of family income actually went higher than it did in 2007. So in terms of actual long-term vulnerability posed by overpricing, this housing market was more overpriced, and it was accompanied by a much more overpriced and classically bubbly stock market than 2007.\"\n\n10. \"Don't invest in real estate, don't invest in the US. If you have to invest in the US, quality has been the mispriced asset for 100 years. They outperform in bear markets. They underperform in bull markets, because you want to own Tesla, you want to own meme stocks, you want to own what's flying. You don't want to own Coca-Cola, it's just too boring.\"\n\nAdvertisement\n\n11. \"When it comes to quality, they have less risk of every kind. They have less debt, they go bankrupt less, they have less volatility, they have a lower beta. Yet they outperform. That is a free lunch.\"\n\n12. \"Bitcoin is, of course, an elaborate scam, really.\"\n\n13. \"Commodities break your heart because just as they're doing well, they have a wipeout for 18 months, and then they go roaring back to a new high.\"\n\n14. \"Artificial intelligence is absolutely for real. Is it big enough, soon enough to stop the deflating? No, I don't think it is. It's a 10-, 20-year, multi-decadal effect going off into the distant future, and it will be potentially vast in its effects.\"\n\nAdvertisement\n\n15. \"I'm not a great believer in economists. They've lost the plot for the last 70 years. They've forgotten their job description, which is to be useful. They drown in assumptions and closed systems, which are largely irrelevant for everything except their reputation inside their industry.\"\n\n16. \"You should not be surprised if the price of oil doesn't go over $100 maybe once or twice in the next five years. You should be amazed if the price of oil does not then have a long-term crutch, and it will run down to a level where the Saudis or somebody will be able to grind out $45 oil into the setting sun. That's how I think the game will end.\""
    }
]