[
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vc2VjLWFza2VkLWNvaW5iYXNlLWRlbGlzdC1jcnlwdG8tMTU1NDMzMTc3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "SEC asked Coinbase to delist all crypto tokens except bitcoin: Report - Yahoo Finance",
        "content": "Coinbase CEO Brian Armstrong claims that, ahead of its legal action against the company, the SEC requested that the platform delist most crypto tokens, except bitcoin, according to a report from the Financial Times. Yahoo Finance Crypto Reporter David Hollerith breaks down the report.\n\nVideo Transcript\n\n- Well, early this morning we got more color on the clash between the Securities and Exchange Commission and Coinbase before the SEC filed legal action against the major US crypto exchange in June. Here to tell us more, we're joined by our senior reporter David Hollerith. So David, give us some context here.\n\nDAVID HOLLERITH: Yeah, Rochelle. So as you mentioned, the SEC sued Coinbase at the beginning of June for allegedly operating an unregistered Securities Exchange. Now in the SEC's lawsuit, they named 13 different cryptocurrencies, including ADA and Sol, which they identified as crypto security assets.\n\nNow according to this story from the Financial Times from earlier this morning, the Coinbase CEO Brian Armstrong said that ahead of launching the legal action against the crypto exchange, the SEC had asked Coinbase to delist more than 200 of its crypto tokens. And this essentially is everything but Bitcoin is what Armstrong was highlighting. And that is obviously far different from the 13 or so coins that are named in the lawsuit. And the implication here is pretty clear.\n\nArmstrong has argued in his statement is that if Coinbase had agreed with the SEC and hadn't opposed it and this case hadn't gone to court, it would have essentially set a legal precedent for the crypto industry, which would have stilted it as far as how much it could grow in the US.\n\nSo again, this goes back to the legal murkiness between whether or not a cryptocurrency is a commodity or a security in the US. And there's not a clear law decided. There the SEC believes that most everything, except Bitcoin, in the crypto asset class is a security. And this is obviously now playing out a series of lawsuits in the courts. The most-- I guess the latest stage lawsuit of these we would bring up would be the Ripple case against the SEC.\n\nStory continues\n\nSo it's also interesting that owning Coinbase stock at this point has kind of become like a regulatory bet for investors on the crypto industry having sort of a more positive regulatory outlook in the near future. It's particularly interesting if you look at Coinbase's stock compared to Bitcoin.\n\nSo there's also this ETF situation that's been going on. BlackRock and a number of other asset managers have filed for a Bitcoin ETF, naming Coinbase is a major partner in those offerings. And that, of course, needs to be approved by the SEC. But around the time of the lawsuit and the BlackRock filing, Coinbase's stock has significantly outperformed Bitcoin.\n\nAnd that's interesting because for most of its-- since its inception, for most of its trading history, Coinbase's stock has well underperformed Bitcoin. So we're seeing a huge outperformance over the month of July and we're going to continue to watch that obviously on Thursday when the company reports second quarter earnings. And we'll want to hear more about the regulatory side of things. It is interesting, though, that Coinbase, their financials are important as ever but it does seem like the legal clash right now is really defining how the stock performs."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2luYmFzZS1jZW8tc2F5cy1zZWMtd2FudGVkLTEwMDc0NjgwMy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Coinbase CEO Says SEC Wanted All Assets Except Bitcoin Delisted: Report - Yahoo Finance",
        "content": "The U.S. Securities and Exchange Commission (SEC) reportedly requested Coinbase to stop trading in all cryptocurrencies except Bitcoin (BTC) before suing America’s largest crypto exchange last month, according to a report by the Financial Times citing CEO Brian Armstrong.\n\n“They came back to us, and they said [. . .] we believe every asset other than bitcoin is a security,” said Coinbase CEO. “And, we said, well how are you coming to that conclusion, because that’s not our interpretation of the law. And they said, we’re not going to explain it to you, you need to delist every asset other than Bitcoin.”\n\nA Coinbase spokesperson told Decrypt that the interview \"omitted critical context regarding [Coinbase's] conversations with the SEC in the US,\" adding that \"per the SEC’s own admission, the views shared in the FT article may have represented the views of some staff at the time, but did not represent those of the Commission more broadly.\"\n\nThe SEC didn't immediately respond to Decrypt’s requests for comment.\n\nIn a June lawsuit, the SEC accused Coinbase of operating illegally because it failed to register as an exchange. The regulator also alleged the exchange’s staking service offered at least 13 crypto assets that should have been registered as securities, including tokens such as Solana (SOL), Cardano (ADA), Polygon (MATIC), and The Sandbox (SAND).\n\nIn a separate move, the SEC also sued Binance in June for offering unregistered securities and allowing U.S. investors to access its global website Binance.com. The Wall Street regulator also alleged that Binance CEO Changpeng Zhao and the crypto exchange misused and commingled customers' funds.\n\nAccording to Armstrong, had Coinbase agreed to the request, it would have set a precedent and may have led to the regulator cracking down on the majority of American crypto businesses operating under similar conditions.\n\n“We really didn’t have a choice at that point, delisting every asset other than Bitcoin, which by the way is not what the law says, would have essentially meant the end of the crypto industry in the US,” said Armstrong. “It kind of made it an easy choice [. . .] let’s go to court and find out what the court says.”\n\nStory continues\n\nThe regulator reportedly said its enforcement division did not make formal requests for “companies to delist crypto assets.”\n\nThe Coinbase representative added that the crypto exchange is still in discussions with the SEC and believes \"that transparent and fair rulemaking and Congressional action, such as bills that we saw gain bipartisan support in the U.S. House of Representatives last week, represent the best path forward for American crypto users and the companies building the cryptoeconomy in the U.S.”\n\nGensler on Bitcoin\n\nSEC Chair Gary Gensler has previously suggested that all cryptocurrencies aside from Bitcoin are securities.\n\nHe’s also often been citing the lack of investor protection as a reason for enforcement actions against crypto companies, comparing the sector to “the Wild West.”\n\nSEC Chair Gensler Again Says Bitcoin Is Not a Security. What About Ethereum?\n\nIn the June lawsuit against Coinbase, the SEC, however, didn’t mention Ethereum (ETH), the world’s second-largest cryptocurrency by market cap, among those tokens it asserted to be securities.\n\nOn June 28, the San Francisco-based company filed a motion to dismiss the SEC’s lawsuit, arguing that the agency does not have statutory authority over the exchange and that its position regarding its powers is “untenable as a matter of law.”\n\nEditor's note: This article was updated on July 31, 2023 at 6 am Eastern Standard Time to include comment from Coinbase."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vY3J5cHRvLWNvdXBsZS10by1wbGVhZC1ndWlsdHktaW4tNDUtYmlsbGlvbi1iaXRjb2luLWhlaXN0LTIwMjMtN9IBZGh0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vY3J5cHRvLWNvdXBsZS10by1wbGVhZC1ndWlsdHktaW4tNDUtYmlsbGlvbi1iaXRjb2luLWhlaXN0LTIwMjMtNz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "'Crypto couple' to plead guilty in $4.5 billion bitcoin heist - Business Insider",
        "content": "The \"crypto couple\" Ilya Lichtenstein and Heather Morgan are due for a plea hearing on Thursday.\n\nThe couple are expected to plead guilty to orchestrating a $4.5 billion bitcoin-laundering scheme.\n\nThey were arrested in 2022 following what the DOJ called its \"largest financial seizure.\"\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nThe husband and wife ensnared in charges related to a $4.5 billion bitcoin-laundering scheme are due in federal court on Thursday for a hearing and expected to plead guilty to orchestrating an elaborate plot to sell bitcoin that was stolen during the 2016 hack of Bitfinex.\n\nIlya Lichtenstein and Heather Morgan, an eccentric couple known for walking a leashed Bengal cat in Manhattan and for Morgan's rap performances under the name \"Razzlekhan,\" were arrested in February 2022 following what the Department of Justice said was its \"largest financial seizure ever.\" The second largest occurred later that same year, when the feds seized $3.36 billion worth of bitcoin that had been stolen from a dark-web site years earlier.\n\nLichtenstein and Morgan, Federal prosecutors have alleged, \"employed numerous sophisticated laundering techniques,\" creating fake identities to set up online accounts, depositing the funds into virtual currency exchanges and dark-web markets, and converting them into other virtual currencies — all to cover their tracks.\n\nLichtenstein and Morgan are charged with conspiracy to commit money laundering and conspiracy to defraud the United States. Together, the charges carry a maximum penalty of 25 years in prison.\n\nAdvertisement\n\nAn attorney for both Lichtenstein and Morgan did not respond to a request for comment ahead of Thursday's plea hearing.\n\nOlivier Douliery/Getty Images\n\nThe saga began in August 2016 when the cryptocurrency exchange Bitfinex was hacked. As Insider previously reported, Lichtenstein and Morgan were not accused of carrying out the hack itself, but as a result of the hack, 119,754 bitcoins were moved into an outside wallet Lichtenstein controlled.\n\nThat bitcoin amounted to $71 million by January 2017, at which point the IRS began tracing thousands of transactions moving through dozens of accounts — eventually landing in Lichtenstein's and Morgan's personal accounts.\n\nAt the time, the couple said the bitcoin came from investments that predated 2015, but Lichtenstein kept highly detailed notes about the scheme in cloud storage, which authorities eventually gained access to. Among the documents authorities found was a list of 2,000 virtual currency addresses and their private keys, all of which could be traced back to the hack. Authorities also found a spreadsheet with login information for cryptocurrency-exchange accounts, with notes about which accounts were frozen.\n\nAdvertisement\n\nProsecutors also alleged that Lichtenstein and Morgan had been planning to flee to Russia under new identities.\n\nAuthorities found a folder in Lichtenstein's cloud storage labeled \"personas\" with information on how to use the dark web to obtain fake identities. While executing a search warrant on the couple's home, authorities found hollowed-out books, dozens of electronic devices, a bag labeled \"burner phones,\" $40,000 in cash, and foreign currency.\n\nSince their 2022 arrests, Morgan has been on house arrest on a $3 million bond, and court records said she had a new job as a \"growth marketing and business development specialist\" at an undisclosed tech company. Lichtenstein, whom prosecutors have described as a flight risk over his Russian citizenship, has remained incarcerated."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi0zLXN1cHBvcnRpbmctdGhlLWVuZXJneS1mdXR1cmUtb2YtdGhlLXBsYW5ldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin 3.0: Supporting the Energy Future of the Planet - Nasdaq",
        "content": "By Sanjay Gupta, Head of Strategy, Auradine Inc.\n\nBitcoin, the first blockchain network and most popular cryptocurrency, has come a long way since its inception in 2009. What started as a niche hobby for cyberpunks and speculators has grown into a global phenomenon with increasing adoption. In order to understand the future trajectory and impact of Bitcoin, it’s important to examine the historical evolution of Bitcoin— both the technology and asset class— its breakthroughs and shortcomings, and what is necessary to reach adoption on a global scale.\n\nIn this blog, we will explore the road to “Bitcoin 3.0”, what we consider to be the near future state of Bitcoin and its potential to support the energy future of the planet. When implemented and deployed responsibly, Bitcoin mining provides capabilities that can support base energy loads, provide stability to mismatched energy demand and supply characteristics, drive the growth of renewable infrastructure, and enable grid modernization. Breakthroughs in hardware and software optimization are the next step in enabling Bitcoin to scale sustainably and achieve optimal impact worldwide.\n\nSustainable and scalable evolution of Bitcoin 3.0\n\nSource: Auradine\n\nBitcoin 1.0: Early days – “The Hobbyist Era”\n\nBitcoin 1.0 refers to the early days of Bitcoin, when it was mainly used by hobbyists and speculators who were fascinated by the allure of Satoshi’s groundbreaking white paper, innovative technology, and its potential to create a decentralized, peer-to-peer, trustless form of money. Bitcoin 1.0 was characterized by trial adoption with primarily speculative use cases. At this time, while the blockchain technology that powered Bitcoin was beginning to be understood as a decentralized, trustless system, it was also exploited for illicit uses that took advantage of its anonymous and global reach as an exchange of value. Bitcoin 1.0 however laid the foundation for the subsequent crypto revolution and proved that it was possible to create a digital currency that operates without intermediaries and central authorities.\n\nBitcoin 2.0: Rapid mining growth “The Industrialized Mining Era”\n\nBitcoin 2.0 refers to the most recent phase of Bitcoin, where the days of mining in dorm rooms and basements were replaced by a rapid rise of industrial-scale miners and global hashing capacity being measured in Exahash/second (1018 hashes/second!). The Bitcoin security protocol uses a ‘proof of work’ (PoW) consensus mechanism and requires participants or ‘miners’ to validate transactions on the block approximately every 10 minutes. Successful miners earn Bitcoin block rewards in addition to any transaction fees.\n\nWhen Bitcoin mining is done at scale, the needed compute speed requires large numbers of specialized ASIC-based computers. These consume significant quantities of energy, which has been an ongoing focus of considerable analysis and debate.\n\nDuring this time, ideas around Bitcoin as a store of value and a legitimate asset gained increasing momentum. For example, Bitcoin was seen as a valuable means for transacting ‘crisis capital’ in situations of natural or man-made calamities, such as aid at the outset of the Ukraine war. Bitcoin is also experiencing increasing use as an exchange of value in payments for goods and services with initial merchant acceptance enablement.\n\nBitcoin 2.0 attracted the attention and participation of institutional investors, corporations, governments, and regulators, who saw its potential to transform the financial system.\n\nBitcoin 3.0: The Next Phase “Responsible Partner of the Energy and Financial Ecosystem”\n\nBitcoin 3.0 refers to the next evolution of Bitcoin, and, where used properly, can make Bitcoin a responsible partner of the energy and financial ecosystems.\n\nIn addition to the use cases of Bitcoin 2.0 as a store of value, the next era of Bitcoin is poised for increasing use as an exchange of value with widespread merchant acceptance. In the recent past, there has been a rise of NFT-like applications called ‘ordinals’ where data can be immutably etched onto a micro-building block of Bitcoin called a Satoshi (100 million Satoshis = 1 Bitcoin) and as a currency hedge in countries facing hyperinflation.\n\nHowever, Bitcoin 3.0’s most important use can be as a store for excess and wasted energy that can support the energy future of the planet. Using large quantities of computational power is necessary to support the security aspect of Bitcoin, something that makes it robust compared to other blockchains. But this computational power can be harnessed productively, as the extent of computational power consumed can be deployed to balance the energy grid using rapid demand response, drive sustainable investment in renewable energy and reduce carbon emissions by reducing gas flaring. This is a massive breakthrough. With systems purpose-built to support Bitcoin 3.0, Bitcoin can become a responsible partner to the energy ecosystem and a strong net positive contributor to the planet in the following ways:\n\nDemand response to balance the energy grid: bitcoin mining computations can be rapidly curtailed for energy demand response and grid balancing when needed. ERCOT, Texas electricity grid operator, estimated in a December 2022 report that bitcoin mining operations were able to curtail their operations and relieve roughly 1.7GW of energy during the Texas winter. On the other hand, in times of excess energy supply without corresponding demand, bitcoin mining can be a sink of energy, providing grid stability and economic value. This is especially useful for renewable energy sources like solar and wind which can have highly variable supply. With systems designed for rapid response, unlike most other industries, the bitcoin mining operations can curtail their energy consumption or increase usage in seconds based on the needs of the energy grid. Driving sustainable investment in renewable energy: Clean, renewable energy requires significant capital investment in large-scale projects. Without a clear return on investment, these projects have been limited to a few geographies only often supported by government subsidies. For instance, Africa owns 40% of the globe’s potential for solar power yet it only inhabits less than 2% of the total global capacity for electricity generation of solar energy (IRENA “Renewable Capacity Statistics”, 2021). Bitcoin mining is already being powered by solar and wind energy in different parts of the world. It provides an economically viable option to invest in solar and other renewable energy sources at an industrial scale with systems that are deployable in rugged conditions and remote locations. Reducing harmful gas flaring and using stranded energy: The Global Gas Flaring Research tracker (GGFR), a leading global and independent indicator of gas flaring, estimated that in 2022 gas flaring released 42 million tons in the form of methane. Methane, the primary component of natural gas, is a potent but short-lived greenhouse gas, with a warming potential much higher than carbon dioxide. Gas flaring is an extraordinary waste of economic value (as much as USD 55 billion per year at a price of USD 10 per MBtu) alongside its negative impacts on climate change and human health. Reducing flaring through Bitcoin mining reduces carbon emissions while capturing the economic value, without any additional energy consumption.\n\nBitcoin 3.0 is not a distant dream or a utopian vision for an idealistic technology. It is already happening in various forms across the world. For this to succeed further, Bitcoin mining silicon, software and system solutions need to be designed from the ground up for rapid energy demand response and be deployable in remote locations and harsh conditions at scale.\n\nAs Bitcoin 3.0 evolves, it will become more integrated and aligned with the energy and financial ecosystems, creating a more efficient, inclusive, and sustainable world.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLWxpdHRsZS1jaGFuZ2VkLW1hcmtldC0wMTQ4MDk2MzEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 31 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether drop in Asia afternoon trading amid DeFi hack reports; most other leading tokens decline - Yahoo Finance",
        "content": "Bitcoin and Ether prices fell in early Tuesday afternoon trading in Asia, with Bitcoin losing support at US$29,000, amid concern about the hack of the popular decentralized finance platform Curve Finance over the weekend that saw an estimated US$41 million stolen and raised concerns about a DeFi contagion. The hack has been linked to a flaw in a programming language. These concerns increased as reports surfaced on Tuesday of an attack on the LeetSwap exchange running on Coinbase. Solana and Matic led the top 10 losers mid Tuesday. Litecoin also gave up gains ahead of its halving event on Wednesday.\n\nBitcoin, Ether hold steady\n\nBitcoin fell 1.8% in the last 24 hours to US$28,872 as of 12:50 p.m. in Hong Kong, according to data from CoinMarketCap.\n\nThe world’s largest cryptocurrency fell under the US$30,000 support floor in the latter weeks of July and has fluctuated around US$29,000 since then, unable to find buying support for a breakout in the so-called summer doldrums when trading in many capital markets slows.\n\nHowever, drama came over the weekend when decentralized stablecoin exchange Curve Finance reported a security issue in older versions of Vyper, the programming language used for smart contracts.\n\nAccording to data from smart contract auditing firm BlockSec, hackers drained an estimated US$41 million in cryptocurrencies from the platform as a result of the malfunction, raising concerns about possible problems at other DeFi platforms.\n\nCurve Finance is the third largest decentralized financial exchange (DEX) by 7-day trading volume, according to DeFi data tracker DefiLlama.\n\nBitcoin and Ether lost ground as CoinDesk reported that LeetSwap said its working with on-chain security experts to recover 340 Ether after PeckShield tweeted the exchange on Coinbase’s Layer 2 blockchain had been attacked.\n\nIn earlier comments related to the Curve hack, Justin d’Anethan at Hong Kong-based crypto market maker Keyrock said Bitcoin had held up well considering.\n\nStory continues\n\n“Indeed, after the Vyper hacks that affected a number of pools in Curve and pushed prices of CRV, CVX and FXS along with other yield protocols down, BTC and ETH held steady,” he said before reports of the LeetSwap exploit.\n\nLackluster trading and caution is seen elsewhere in crypto asset investment products, which saw minor outflows of US$21 million last week, 93% of which were from long-Bitcoin investment products, according to an emailed report from European alternative asset manager CoinShares.\n\n“This suggests investors have been taking profits in recent weeks, with the sentiment for the asset overall remaining supportive,” the CoinShares report said.\n\nNigel Green, the CEO and founder of the deVere investment advisory group, said summer typically ushers in reduced market activity, which in turn can create price inefficiencies and increased volatility.\n\n“When used effectively and efficiently, volatility can be an extremely powerful investment tool as you can enhance your portfolios with high quality assets at lower entry points,” Green said in email comments.\n\n“Not only does Bitcoin remain one of the best performing asset classes of the decade, I believe its performance will further strengthen. Both institutional and retail investors are increasingly seeing the value of a digital, global, borderless and tamper-proof currency and store of value.\n\n“This trend will increase as adoption picks up further and as confidence grows again in the global economy.”\n\nEther, the second largest crypto token by market cap, fell 2.10% to US$1,825 early Tuesday afternoon after trading flat in the morning.\n\nAll other top 10 non-stablecoin cryptocurrencies fell Tuesday morning. Solana led the losers, dipping 4.6% to US$23.31, while Matic was close behind with a drop of 4.1% to US$0.67.\n\nLitecoin fell 3.5% to US$89.83, barely holding a gain of 1% for the last week ahead of its halving event on Wednesday.\n\nThe halving is expected to cut the mining reward for each successfully minted Litecoin block from 12.50 LTC to 6.25 LTC, increasing its scarcity and potentially triggering a rise in the token’s price. Litecoin is up about 31% year to date.\n\nThe total crypto market capitalization fell 1.8% in the past 24 hours to US$1.16 trillion, while trading volume rose 17.6% to US$30.83 billion.\n\nNFT 500 ends July in red\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe Forkast 500 NFT index fell 1.19% in the past 24 hours to 2,516.20 as of 7:45 a.m. in Hong Kong, resulting in a drop of 5.37% for the week and 10.70% for the month.\n\nForkast’s Ethereum, Solana and Cardano NFT market indexes all logged losses, while the index measuring the performance of Polygon’s NFT market edged up a slight 0.18%.\n\nTotal NFT trading volume fell 2.93% in the past 24 hours to US$17.65 million, according to data from CryptoSlam. Volume on Ethereum, the largest NFT network, declined 10.17% to US$11.68 million.\n\nTrading volumes on Polygon jumped 87.67% to US$1.14 million to take second spot in Cryptoslam’s rankings. Solana and BNB networks also saw increases in NFT volumes.\n\nNFT trading volume on the Bitcoin network dropped 20.08% to US$479,775. “An ecosystem that many, myself included, had predicted to one day flip Ethereum is showing its limitations,” said Yehudah Petscher, NFT Strategist at Forkast Labs.\n\n“With no avenues right now for utility, traders are finding few reasons to collect these assets that promise nothing more than small jpegs to collect. We’ll need to see some innovation or more premium art on Bitcoin if we want to see its ecosystem turn around.”\n\nBy NFT collections, Ethereum-based Bored Ape Yacht Club (BAYC) saw the largest 24-hour trading volume, gaining 26.26% to US$1.12 million. DMarket and Gods Unchained Cards, which are both in-game NFT items, ranked second and third.\n\nU.S. equities finish July strong\n\nImage: Getty Images\n\nU.S. stock futures gained as of 10:50 a.m. in Hong Kong, after the three major U.S. stock indexes ended July with strong gains of between 3% to 4%.\n\nIn Asia, the main stock indexes rose on Tuesday morning, with the exception of China’s Shanghai Composite after manufacturing data missed expectations. Private research firm Caixin Insight Group’s China General Manufacturing PMI for July released Tuesday dropped for the first time since April, missing market estimates and hitting its lowest point in six months.\n\n“China’s economic recovery in the first quarter exceeded expectations, but the momentum weakened in the second,” wrote Wang Zhe, senior economist at Caixin. “Although the data for industrial production and investment in June showed some signs of recovery, macroeconomic growth remained sluggish, and considerable downward pressure on the economy persisted.”\n\nZhe added: “guaranteeing employment, stabilizing expectations and increasing household income” should remain the top priorities of Chinese policymakers.\n\nJapan’s Nikkei 225 gained as the country’s unemployment rate edged lower in June as forecasted, marking the country’s lowest jobless rate since January.\n\nIn the U.S., second quarter earnings season continues with reports from Apple, Amazon, Pfizer and others through the week, plus more economic indicators. The S&P Global’s U.S. manufacturing purchasing manager’s index (PMI) will be out Tuesday and the July employment report on Friday.\n\nOn interest rates, the Federal Reserve next meets on Sept. 19 and 20 after raising a quarter of a point in July. Rates are now between 5.25% to 5.50%, the highest since January 2001.\n\nFed Chair Jerome Powell last week reiterated the bank takes a data-driven approach to decide interest rate policy and Fed economists said the likelihood of a recession in the U.S. has diminished, indicating to some analysts the Fed may leave rates unchanged next month.\n\nThe CME FedWatch Tool predicts a 82.5% chance the Fed will keep rates as is in September, and a 17.5% chance for another 25-basis-point increase.\n\n(Updates with equity section)"
    }
]