[
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMipQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tdXBkYXRlLWJpdGNvaW4tZHJvcHMtYmVsb3ctMjZrLW1hcmstYmlnZ2VzdC13ZWVrbHktZHJvcC1zaW5jZS1mdHgtY3Jhc2gtaW4tbm92LTIwMjIvdmlkZW9zaG93LzEwMjk0ODgwNS5jbXPSAakBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXVwZGF0ZS1iaXRjb2luLWRyb3BzLWJlbG93LTI2ay1tYXJrLWJpZ2dlc3Qtd2Vla2x5LWRyb3Atc2luY2UtZnR4LWNyYXNoLWluLW5vdi0yMDIyL2FtcF92aWRlb3Nob3cvMTAyOTQ4ODA1LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "Crypto update: Bitcoin drops below $26K mark; biggest weekly drop since FTX crash in Nov 2022 - The Economic Times",
        "content": "The sudden sell-off in major cryptocurrencies over the past few days has rattled Indian crypto investors, with Bitcoin seeing its most significant weekly drop since the November 2022 FTX crash. \"Bitcoin's fall below $26,000 last week was the biggest decline for BTC in almost over a year,\" said Siddhartha Gupta, SVP, business and strategic alliances, CoinDCX."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTA4LTIyL2phY29iaS1iaXRjb2luLWV0Zi1tZXQtd2l0aC1zb2NpYWwtbWVkaWEtc2hydWdzLXRoaW4tdHJhZGluZy1iY29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "Jacobi Bitcoin ETF Met With Social-Media Shrugs, Thin Trading (BCOIN) - Bloomberg",
        "content": "In this issue of the Bloomberg Crypto newsletter, Tanzeel Akhtar explains why a Bitcoin “first” failed to excite:\n\nThe topic that transfixed the crypto world this summer wasn’t some new invention, scandal or meme-coin rally (or wipeout). Rather, all eyes were on the SEC — and more precisely, whether the US securities regulator-turned-crypto bogeyman would finally approve an exchange-traded fund tied to the spot price of Bitcoin. After all, one of the applicants was none other than the mighty BlackRock."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vd3d3LmZ0LmNvbS92aWRlby9kMWRmNmZkOS01ZTI2LTQwODQtOGI4Zi0wNThmYjYyYjc2NzXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin mines could be used for energy storage | FT Tech - Financial Times",
        "content": "You can enable subtitles (captions) in the video player\n\nIt's shaken up the financial industry and inspired legions of devotees. But Bitcoin mining is extremely energy intensive, requiring powerful computers to run for days on end, solving complex mathematical problems in order to keep the Bitcoin system running. Researchers at the University of Cambridge have found the electricity consumption of the Bitcoin network is roughly equivalent to that of countries like Sweden, Norway, and Pakistan.\n\nAnd while Bitcoin bashers have labelled the digital currency a climate villain, one novel strategy being looked at is using crypto mining as a form of energy storage by converting stranded renewable energy into Bitcoin. Wind and solar energy can be unpredictable, with supply often exceeding immediate demand. As a result, grid-connected renewable energy sources often have to pause operations if they're producing too much energy, energy which can't be stored.\n\nOthers are not as convinced. Regulators in Sweden said even if Bitcoin could run on renewable energy, the country needs those energy sources for essential services. But Bitcoiners contend wind and solar farms are often located in remote locations, and electricity does not transmit efficiently over long distances. Bitcoin mines, however, can be located close to renewable projects.\n\nBitcoin mines could also tap into the wind, solar, and battery projects that are ready to produce energy but are still waiting to be connected to power grids. That's 1,300 gigawatts in the United States alone. Bitcoin is already being used to offset excess energy produced by several global fossil-fuel energy producers. US-based ConocoPhillips is selling stranded gas into Bitcoin miners in the Bakken, an oil-abundant region in the United States, while Exxon has agreed to redirect gas that would otherwise be wasted to mobile Bitcoin mines. TEPCO, Japan's biggest electric power company, is the first major player to send excess renewable energy into Bitcoin mining.\n\nCrypto miners also stand to benefit from arrangements like these, as pressure to lower their energy consumption grows. In 2022, New York State imposed a moratorium on fossil fuel-powered Bitcoin mines, and an ongoing regulatory crackdown on digital assets poses fresh challenges to the industry. Last year, President Biden also signed an executive order on digital assets and said the United States must take strong steps to reduce the risks they create when it comes to climate change and pollution. Another reason why major crypto miners are keen to find greener energy sources for their operations and lower their carbon footprint."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wbHVuZ2UtZ2l2ZXMtaW5kaWFuLWludmVzdG9ycy10aGUtaml0dGVycy9hcnRpY2xlc2hvdy8xMDI5MTc3OTkuY21z0gGBAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wbHVuZ2UtZ2l2ZXMtaW5kaWFuLWludmVzdG9ycy10aGUtaml0dGVycy9hbXBfYXJ0aWNsZXNob3cvMTAyOTE3Nzk5LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "Crypto plunge gives Indian investors the jitters - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nMumbai: The sudden sell-off in major cryptocurrencies over the past few days has rattled Indian crypto investors, with Bitcoin seeing its most significant weekly drop since the November 2022 FTX crash In the past week, Bitcoin declined 11.5%, hitting $26,023.3, according to CoinGecko's data as of 5.30 pm on Monday. Similarly, significant alternative cryptocurrencies like Ethereum fell 9.7%, Ripple lost 16.9%, Solana crashed 13.3%, and memecoins such as Dogecoin and Shiba Inu declined nearly 16%.The broader market was already in a bear phase, but Bitcoin faced an 8% plunge on August 18 as Elon Musk's SpaceX reportedly divested its Bitcoin holdings, akin to Tesla.SpaceX had accumulated $373 million in Bitcoin during 2021-2022.\"Bitcoin's fall below $26,000 last week was the biggest decline for BTC in almost over a year,\" said Siddhartha Gupta, SVP, business and strategic alliances, CoinDCX.Simultaneously, investor concerns were heightened by the US Federal Reserve's July minutes suggesting possible interest rate hikes. Moreover, large Bitcoin holders selling off their investments in the futures market and China's second-largest property developer, China Evergrande, filing for US bankruptcy, added to the uncertainty to the economic landscape.\"Market sentiments changed very quickly after the Tesla news and then there was a bunch of negative news which just kept adding to the prevailing uncertainty. It looks like bearish sentiment will remain until there is more regulatory clarity,\" said Vishal Gupta, a Noida-based crypto investor.Many Indian cryptocurrency investors have halted their investments following a 30% tax on crypto earnings enforced by the government. Nonetheless, a minority continues to retain their holdings, though sudden market downturns are compounding the prevailing pessimism.\"Due to unfriendly policies of the government, I have sold most of all the crypto I held. It's not looking good for crypto or any risk asset that is non-productive, does not produce cash flow. Rising interest rates will hit speculative assets the hardest,\" said Ashwin Nadar, an avid Mumbai-based crypto tracker.Dhruvil Shah-SVP of technology, Liminal, a wallet infrastructure and custody solutions platform, said the regulatory uncertainty dampens the enthusiasm within the digital asset community and results in a liquidity crunch in the market.\"The second half of 2023 has been a phase of price correction across digital assets, including Bitcoin. The short-term outlook for BTC looks bearish as BTC can correct even further into the 20-25k range in the short term. We can expect some green shoots by the end of September or the beginning of October this year,\" said Shivam Thakral, CEO of BuyUcoin, India's second longest-running digital asset exchange.Despite the prevailing circumstances, a modest level of trading persisted on Indian crypto exchanges throughout the past week."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzNjYTExY2Q0LTRkZTQtNDM1NC1iNzM1LTczZGI3NDNhODAzY9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 22 Aug 2023 07:00:00 GMT",
        "title": "European crypto ETP inflows rise after BlackRock bitcoin filing - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Exchange traded funds myFT Digest -- delivered directly to your inbox.\n\nLatest news on ETFs Visit our ETF Hub to find out more and to explore our in-depth data and comparison tools\n\nEuropean crypto-related exchange traded products have seen a boost in flows after BlackRock applied to launch a bitcoin fund in the US.\n\nEurope-domiciled ETPs with crypto-related names had net inflows of €150mn in June, their best month since March 2022, Morningstar data shows.\n\nThe inflows came after €100mn of outflows in May and were followed by a further €60mn of inflows in July.\n\nThis followed a similar trend globally, with inflows totalling $610mn (€560mn) in June and July, according to CoinShares data.\n\nThis article was previously published by Ignites Europe, a title owned by the FT Group.\n\nBlackRock filed an application with the US regulator to launch a spot bitcoin exchange traded fund in June, sparking a flurry of similar applications from firms including Fidelity, Invesco and WisdomTree.\n\nA spot ETF would directly track the price of bitcoin, as opposed to ETFs tracking the price of bitcoin futures contracts, a number of which have received US regulatory approval.\n\nHector McNeil, founder and co-chief executive officer of HANetf, said BlackRock’s application had had a “very positive” impact on bitcoin ETP flows and the price of bitcoin.\n\n“[This is] mainly because of the anticipation of the demand that would be generated [by the launch],” he said.\n\n“But most importantly, it has helped move the asset class into the mainstream, when the world’s largest asset manager, who has previously been negative, moves to raise their hand that they have changed their minds.\n\n“Other asset managers have and will follow, as will more investor types,” McNeil added.\n\nMartin Bednall, chief executive of Jacobi Asset Management, said he had “never seen” such anticipation for regulatory approval of ETFs.\n\n“Whether the SEC is close to approving [BlackRock’s application] is conjecture,” McNeil said.\n\n“However, it does seem bizarre to approve a bitcoin futures ETF and not a spot [ETF].”\n\nGlobally, crypto ETPs posted nine straight weeks of net outflows before the news of BlackRock’s application, totalling $400mn, according to CoinShares.\n\nBut the outflows were offset by the inflows after BlackRock announced its application.\n\nJames Butterfill, head of research at CoinShares, which manages digital assets ETPs, said the previous outflows were “largely driven by negative sentiment stemming from US regulatory posturing”.\n\n“The mere announcement of BlackRock’s desire to initiate a bitcoin ETF has already bolstered confidence, with the implicit signal that the world’s largest asset manager endorses bitcoin,” he said.\n\n“If BlackRock were to launch an ETF, it could dispel much of the lingering negativity surrounding crypto, potentially resulting in significant new investments as other investors follow their lead,” Butterfill added.\n\nHowever, Manan Agarwal, quantitative analyst at Morningstar, said there was no reason to believe that the apparent optimism for cryptocurrencies would be sustained for long.\n\n“It is important to keep in mind that similar products [to BlackRock’s application] were also launched in other countries, including Canada, Brazil and Dubai,” he said.\n\nLatest news on ETFs Visit the ETF Hub to find out more and to explore our in-depth data and comparison tools helping you to understand everything from performance to ESG ratings\n\n“Optimism, when products are launched followed by a period of dull growth and poor performance, has been the common trend across all such products.”\n\nAgarwal added that the ratio of open interest in bitcoin perpetual futures, the number of outstanding derivative contracts that have not been settled, to bitcoin’s market cap is well below the highs seen in September last year.\n\n“A stagnant ratio indicates money has been slow to flow into the market despite the bitcoin price rise,” he said.\n\n*Ignites Europe is a news service published by FT Specialist for professionals working in the asset management industry. Trials and subscriptions are available at igniteseurope.com.\n\n\n\n"
    }
]