[
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTMxL2JpdGNvaW4tcmFsbHktcG9pc2VkLXRvLXRlc3Qtb2xkLWFkYWdlLW9mLWRvbi10LWZpZ2h0LXRoZS1mZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Is About to Test the Adage 'Don't Fight the Fed' - Bloomberg",
        "content": "This year’s 40% rally in Bitcoin is heading toward a potentially big test in the shape of the upcoming Federal Reserve policy decision.\n\nCrypto, stocks and bonds have jumped in the new year on expectations of a Fed pivot to slower interest-rate hikes and eventual cuts as high inflation cools. While the Fed appears set to downshift to a quarter-point increase Wednesday, Chair Jerome Powell may stress policy will stay restrictive to damp prices."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTAxL2JpdGNvaW4tb3JkaW5hbC1uZnRzLXB1c2gtdHJhbnNhY3Rpb24tZmVlcy10by1oaWdoZXN0LWluLW92ZXItYS15ZWFy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Feb 2023 08:00:00 GMT",
        "title": "Ordinal Bitcoin NFTs Push Blockchain Transaction Fees to 12-Month High (BTC) - Bloomberg",
        "content": "Fees for transactions on the Bitcoin blockchain are rising as people start minting hundreds of nonfungible tokens on the network for the first time.\n\nOrdinals, a protocol created recently by Bitcoin developer Casey Rodarmor, has helped to allow people to mint NFTs or inscriptions, directly on the Bitcoin network since last month. Most NFTs, including the popular Bored Ape and CryptoPunks collections, have primarily been issued on Ethereum, making it the most commercially important blockchain."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTAxL2Fyay1zdGlja3Mtd2l0aC0xLW1pbGxpb24tYml0Y29pbi1mb3JlY2FzdC1hZnRlci1ob3Jyb3IteWVhctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Feb 2023 08:00:00 GMT",
        "title": "Cathie Wood Sticks With $1 Million Bitcoin Forecast Even After Horror Year - Bloomberg",
        "content": "Even after a horrific 2022 for Bitcoin, Cathie Wood ’s firm is sticking to one of its boldest predictions yet: that the price of the cryptocurrency will exceed $1 million in the next decade.\n\n“Bitcoin’s long-term opportunity is strengthening,” strategists led by Yassine Elmandjra wrote in ARK Investment Management’s annual Big Ideas paper published Monday. “Despite a turbulent year, Bitcoin has not skipped a beat. Its network fundamentals have strengthened and its holder base has become more long-term focused.”"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTAxL3RleGFzLWJpdGNvaW4tbWluZXJzLWZhY2UtZGFtYWdlcy1oaWdoZXItcG93ZXItY29zdHMtZnJvbS1pY2Utc3Rvcm1z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Feb 2023 08:00:00 GMT",
        "title": "Texas Bitcoin Miners Face Damage, Higher Power Costs From Ice Storms - Bloomberg",
        "content": "Bitcoin miners in Texas are suffering from yet another storm as they scale back operations due to spiking electricity costs while facing damages on their machines from the extreme weather.\n\nA winter storm dumping ice across parts of the state left more than a quarter million power consumers in the dark on Wednesday, boosting energy prices over the last few days. That has led some Bitcoin miners to switch off their machines and send electricity back to the local power grid. Last year, they took similar measures during the historic heat wave in Texas and a winter storm across North America."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDIvMDEvYXJrLWludmVzdHMtY2F0aGllLXdvb2Qtc3RpbGwtc2Vlcy1iaXRjb2luLWdvaW5nLXRvLTUwMDAwMC0uaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Feb 2023 08:00:00 GMT",
        "title": "Ark Invest's Cathie Wood still sees bitcoin going to $500000 - CNBC",
        "content": "Despite bitcoin's strong January, the cryptocurrency just suffered one of its biggest and longest drawdowns in its history. Ark Invest CEO and Chief Investment Officer Cathie Wood is still bullish on the cryptocurrency, however, and continues betting its price will eventually reach $500,000, she told CNBC's \"Squawk Box\" on Wednesday. Her outlook is even \"a little higher than that.\" \"Starting with [the financial crisis of] 2008-2009, which is when bitcoin really debuted, and even more so after the crypto fallout this past year [and] the collapse in many companies, this idea of transparency and decentralization is taking hold, and Bitcoin and Ethereum are the two best manifestations of that in the crypto world,\" Wood said. Wood also said that Sam Bankman-Fried, CEO of fallen crypto exchange FTX, whose alleged fraud has shaken investors, \"didn't like bitcoin\" and that his views were at odds with the crypto pillars of decentralization and transparency. \"What companies went under? They were the highly centralized, nontransparent, opaque companies: FTX, Celsius, Three Arrows Capital,\" Wood said. Whereas \"if you look at what happened to Bitcoin, the network, and Ethereum, the network, they really didn't skip a beat at all. Transactions were completed. All smart contracts opened and closed.\" Wood is also a big investor in the Grayscale Bitcoin Trust , known by its ticker GBTC, through the ARK Next Generation Internet ETF (ARKW) . Investors have grown concerned about the harm GBTC could do to shareholders, with the shares trading at a growing discount to net asset value and the structure of the trust being such that shares can't be redeemed. \"There's a huge discount there that will close at some point,\" Wood said. \"I have no idea how the lawsuit's going to play out. I do think it's good that this discussion is taking place.\" Last year, Grayscale sued the Securities and Exchange Commission over its decision to block the conversion of its Grayscale Bitcoin Trust to an exchange-traded fund. The D.C. Court of Appeals has scheduled oral arguments for March 7. \"The SEC has dragged its feet in terms of a bitcoin ETF, while approving a bitcoin futures ETF — it just doesn't make any sense to us,\" Wood added. \"This discussion is going to be a very good one and the news around the trial is going to be very good for bitcoin generally, as more and more people begin to understand bitcoin itself and GBTC particularly.\" Wood just posted her best month ever as her beaten-down favorite stocks staged a big comeback in the new year. Her flagship Ark Innovation ETF (ARKK) jumped 3.7% on Tuesday, bringing its January return to 27.8% and marking its strongest month since its inception in 2014."
    }
]