[
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDEvMTMvYml0Y29pbi1zZWMtZ2VtaW5pLWdlbmVzaXMtdW5yZWdpc3RlcmVkLXNlY3VyaXRpZXMtY25iYy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin hits $19,000, and SEC alleges Gemini, Genesis sold unregistered securities - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin hits $19,000, and SEC alleges Gemini, Genesis sold unregistered securities: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Kimberly Grauer of Chainalysis discusses data showing that crypto crime hit a record of more than $20 billion in 2022 as transactions involving companies targeted by U.S. sanctions soared."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTEzL2dyYXlzY2FsZS1iaXRjb2luLXRydXN0LWNoYWxsZW5nZWQtYW5ldy1ieS1vc3ByZXktb3ZlcmhhdWwtcGxhbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Jan 2023 08:00:00 GMT",
        "title": "Grayscale Bitcoin Trust Challenged Anew by Osprey Overhaul Plan - Bloomberg",
        "content": "Crypto asset manager Osprey Funds is the latest to call out Barry Silbert ’s Grayscale Investments over its Bitcoin trust’s deep discount, announcing that it asked to be installed by its bigger rival as the sponsor of the beleaguered product in order to spur changes that could help narrow that gap.\n\nOsprey, writing Friday in an open letter to Silbert, said it would reduce the management fee of the $12 billion Grayscale Bitcoin Trust (GBTC) to 0.49% from its current 2%, which has been a sore point with some of its investors. The Fairfield, Connecticut-based company also said it would look to implement a redemption program to help narrow the discount that’s plagued the fund since early 2021, and would pursue a listing on the New York Stock Exchange."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMivAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMDQtamFudWFyeS0yMDIyL2FydGljbGVzaG93Lzk2OTYxMTA1LmNtc9IBwAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMDQtamFudWFyeS0yMDIyL2FtcF9hcnRpY2xlc2hvdy85Njk2MTEwNS5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin above $18,800; crypto market cap crosses $900 billion - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency market traded higher on Friday after US Consumer Price Index (CPI) data showed signs of cooling off inflation. Bitcoin gained 3.9% to trade above $18,800 level, whereas Ethereum rose nearly 1% to trade at $1409.\"The crypto market's current momentum got a big boost after US Consumer Price Index (CPI) data showed signs of inflation cooling down. Bitcoin saw the biggest jump in 2 months after it breached the $19,000 mark for a short period. Bitcoin already broke major resistances of $17,000 and $18,000 and it is expected to test $20,000 in the coming days. If the macroeconomic factors continue to remain favourable, we can expect the momentum to sustain in the coming weeks,\" Shivam Thakral, CEO of BuyUcoin said.BTC volume in the last 24 hours stood at approximately $31 billion, which is a jump of 32.37% in the last 24 hours.Other top crypto tokens were also trading higher on Friday. Solana rose 4.1%. Polygon, Dogecoin, Polkadot and Tron were also trading with gains.The global cryptocurrency market cap was trading higher around $904.04 billion, increasing 2.1% in the last 24 hours.The total volume in DeFi is currently $3.89 billion, 6.87% of the total crypto market 24-hour volume. The volume of all stablecoins is now $51.71 billion, which is 91.28% of the total crypto market 24-hour volume.The price of Bitcoin, the world's largest cryptocurrency, hovered around $362.8 billion, with a dominance of about 40.07%, an increase of 0.63% over the day, according to CoinMarketCap.\"The total market cap of cryptos has risen over 3% in the past 24 hours. This increase is driven primarily by a small number of select coins, such as ETH. This is evident from the market breadth indicator, which assesses the number of significant cryptocurrencies trading above the 200-day simple moving average (SMA). Cryptos, including ETH, APE, ATOM, BNB, DOGE, LDO, etc., were above the 200-day SMA,\" Edul Patel, CEO and Co-Founder of Mudrex said.Meanwhile, Parth Chaturvedi, Crypto Ecosystem Lead, CoinSwitch stated that several crypto-specific risks remain lurking, with the biggest ones surrounding the financial health of the industry cornerstones.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.35 hours, IST on January 13, 2023)Bitcoin $18,857.19 3.9%Ethereum $1,411 0.85%Tether $1 0.01%USD Coin $1 0.01%BNB $289.12 1.47%XRP $0.3765 1.09%Dogecoin 0.08051 1.81%Cardano $0.3291 1.34%Polygon $0.9128 2.91%Polkadot $5.25 2.71%Tron $0.05653 2.81%Litecoin $84.82 1.06%Shiba Inu $0.000009498 2.94%Solana $17 4.43%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of Economic Times)"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8xNS1jb3VudHJpZXMtd2hlcmUtYml0Y29pbi1sZWdhbC0xMzUxNDg3NzUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Jan 2023 08:00:00 GMT",
        "title": "15 Countries Where Bitcoin is Legal and Illegal - Yahoo Finance",
        "content": "In this piece, we will take a look at 15 countries where bitcoin is legal and illegal. For more countries, head on over to 5 Countries Where Bitcoin is Legal and Illegal.\n\n2022 has been a rough year for businesses, hedge funds, and the stock market but all these have not suffered as much as the cryptocurrency sector. Heralded at one time as the end of traditional fiat money, cryptocurrencies have taken a beating this year as rising interest rates and a souring economic sentiment led investors to flee from the highly speculative market to safe haven investments such as the U.S. dollar and bonds. As an example, Bitcoin, which is the world's leading cryptocurrency, is down by a studding 65% year to date as it nears levels before the pandemic crypto rush that saw capital flow to it from falling stock markets and stimulus checks.\n\nAt the same time, as cryptocurrencies surged, global momentum to make government let businesses accept them as a mode of payment and even as a legal tender grew alongside. However, government warnings about the risk of cryptocurrencies were also proven right just last month when the collapse of the cryptocurrency exchange FTX Trading Ltd. led to billions of dollars in losses for its customers. While initially portrayed as an 'honest mistake', charges filed by the Securities and Exchange Commission (SEC) against the firm's founder and former chief executive officer Sam Bankman-Fried claim otherwise. According to a Reuters report, the main reason FTX collapsed was that, allegedly, Bankman-Fried and associates made changes to its algorithm which allowed the exchange's partner hedge fund Alameda Research to continue borrowing from it to make speculative investments even if Alameda's investments and its collateral dropped in value. The vicious cycle that bankrupted the firm started when Alameda's FTT tokens, issued by FTX, collapsed in value after Coinbase sold its holdings. This shattered consumer confidence in FTX and led to a massive withdrawal of consumer funds. However, since FTX had lent this money to Alameda for the investments, it was unable to cough up the cash, which then led to its demise.\n\nStory continues\n\nThe collapse of FTX also knocked the wind out of Bitcoin. After dropping from this year's peak of ~$47,000 to a ~$20,000 level that most analysts thought was the proverbial floor since it cost roughly the same to mine a Bitcoin, the currency would take another beating soon. The drama erupted on November 6th, when Coinbase announced its decision to sell the FTT holdings. Within the next three days as FTX's customers fled, Bitcoin also dropped from $20,905 to $15,757 - a level it was at during November 2022 - effectively wiping out two years of gains and profits for anyone who had entered trading during this time period. Since that fateful day, the currency is up by less than a thousand dollars, with Bitcoin currently worth $16,456 at the time of writing (see best bitcoin stocks to buy).\n\n15 Countries Where Bitcoin is Legal and Illegal\n\nBitcoins\n\nOur Methodology\n\nFor this piece, we have divided the countries into two groups - where Bitcoin is implicitly legal and sometimes also a legal tender, and where it is absolutely banned. The countries where it is banned are listed first. Additionally, the legal frameworks of all countries analyzed for the piece do not differentiate between Bitcoin and other cryptocurrencies, except for those countries that have made Bitcoin a legal tender.\n\n15 Countries Where Bitcoin is Legal and Illegal\n\n15. People's Republic of China\n\nBitcoin Legal or Illegal: Illegal\n\nThe People's Republic of China is the world's largest economy by one measure and was one of the most popular regions for Bitcoin mining companies this decade due to the widespread adoption of technology. However, spurred into action due to the high environmental costs of mining and illicit activity, the Chinese government banned all cryptocurrency transactions in the country in 2021 when it forbade banks and other institutions from providing services such as clearing and exchange and made mining in the country illegal. However, such was the Bitcoin craze back then that the market simply shrugged off the announcement, and Bitcoin price continued to rise. Yet even though cryptocurrency trading is banned, the holding of it as an asset is protected by Chinese law according to a lawyer.\n\n14. State of Qatar\n\nBitcoin Legal or Illegal: Illegal\n\nThe state of Qatar is a Western Asian country located in the Middle East. Bitcoin and other cryptocurrencies are completely banned in the country's Qatar Financial Center (QFC). Qatar states that the reason behind the ban is weak compliance with know your customer (KYC) and anti money laundering (AML) regulations. These regulations are enforced globally by the Financial Action Task Force (FATF) and they require banks and other financial services providers to verify their customer profiles and determine the source of funds that they are transferring inside and outside the country. In fact, the Qatari Central Bank was quick to warn citizens in May 2022 about dealing with any unregulated financial firm after CoinMENA, a Muslim law compliant exchange launched in the country. Qatar is a Muslim country and follows the Sharia Law.\n\n13. Kingdom of Belgium\n\nBitcoin Legal or Illegal: Legal\n\nThe Kingdom of Belgium is a Northern European country with a relatively high GDP per capita. Cryptocurrencies are not outlawed by Belgium and there are no significant barriers to either mining Bitcoin or others or using them for transactions. However, Bitcoin is not a legal tender in the country. Gains resulting from the trading of Bitcoin and other cryptocurrencies are taxed under Belgium law, and authorities have often warned people about their speculative nature.\n\n12. Republic of Ireland\n\nBitcoin Legal or Illegal: Legal\n\nThe Republic of Ireland is a sovereign state in Europe with a high income and one that is often criticized for its loose tax laws. There is no ban against either Bitcoin or other cryptocurrencies in the country, and the only regulations covering Bitcoin are those that are in place in the entire European Union. Taxes on Bitcoin are subject to the nature of the transaction, and the rates vary if it is regularly used or if rarely used.\n\n11. New Zealand\n\nBitcoin Legal or Illegal: Legal\n\nNew Zealand is an island nation in the Pacific Ocean. There is no specific legislation that bans the mining or trading of Bitcoin in the country. However, like others, New Zealand also taxes cryptocurrency transactions. Exchanges and other businesses must obtain a license from the government before providing services, and taxes are paid for selling Bitcoin if the intent behind the sale and the preceding purchase was to sell the currency and not hold it.\n\n10. Commonwealth of Australia\n\nBitcoin Legal or Illegal: Legal\n\nThe Commonwealth of Australia is an Oceanic country that is rich in natural resources. There are no laws against either mining or transacting in Bitcoin or other cryptocurrencies in Australia. However, Bitcoin is not equal to money in the country. Instead, the law treats Bitcoin as an asset that is held, and for companies, this includes taxation if the Bitcoin is part of daily operations or has been bought with the intention of making a profit.\n\n9. Netherlands\n\nBitcoin Legal or Illegal: Legal\n\nThe Netherlands is a Northern European country that is one of the most prosperous regions in the world. The country does not have any specific laws to regulate cryptocurrency, and Bitcoin along with others generally has to follow the same regulatory framework for other financial products. The Dutch government also requires that Bitcoins should be disclosed on the annual tax returns and that a capital gains tax will be applied to them. Additionally, companies are required to convert their cryptocurrency payments into the Euro and declare them on the income statement.\n\n8. Swiss Confederation\n\nBitcoin Legal or Illegal: Legal\n\nThe Swiss Confederation, commonly known as Switzerland is a landlocked European country with a high standard of living. Cryptocurrencies are classified as intangible assets in Swiss law, are not legal tender, and have no specific laws against in. On the individual level, Switzerland does not tax cryptocurrencies on any capital gains. However, for tax assessment, they must be converted to the Swiss Franc at the year's end at a rate provided by the government.\n\n7. Federal Republic of Germany\n\nBitcoin Legal or Illegal: Legal\n\nThe Federal Republic of Germany is a European nation with the largest economy on the continent. Germany requires a license for companies to deal in Bitcoin, and its regulators have called for a global framework to deal with cryptocurrencies as prices plunge globally and more links to established financial institutions are made. Germany also treats Bitcoin as private money, and banks in the country can also store and sell Bitcoin.\n\n6. United Kingdom of Great Britain and Northern Ireland\n\nBitcoin Legal or Illegal: Legal\n\nThe United Kingdom of Great Britain and Northern Ireland is a European country located just off of the coast. There is no special regulatory framework for Bitcoin in the country, and the buying and selling of cryptocurrencies by individuals is subject to a capital gains tax which is payable on any gains that are made on disposal. For corporations, Bitcoin taxation in the U.K. depends on the nature of the transactions and whether they are one off or part of daily activity.\n\nClick to continue reading and see 5 Countries Where Bitcoin is Legal and Illegal.\n\nSuggested Articles:\n\nDisclosure: None. 15 Countries Where Bitcoin is Legal and Illegal is originally published on Insider Monkey."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8xNS1jb3VudHJpZXMtd2hlcmUtYml0Y29pbi1sZWdhbC0xMzUxNDg3NzUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Jan 2023 08:00:00 GMT",
        "title": "15 Countries Where Bitcoin is Legal and Illegal - Yahoo Finance",
        "content": "In this piece, we will take a look at 15 countries where bitcoin is legal and illegal. For more countries, head on over to 5 Countries Where Bitcoin is Legal and Illegal.\n\n2022 has been a rough year for businesses, hedge funds, and the stock market but all these have not suffered as much as the cryptocurrency sector. Heralded at one time as the end of traditional fiat money, cryptocurrencies have taken a beating this year as rising interest rates and a souring economic sentiment led investors to flee from the highly speculative market to safe haven investments such as the U.S. dollar and bonds. As an example, Bitcoin, which is the world's leading cryptocurrency, is down by a studding 65% year to date as it nears levels before the pandemic crypto rush that saw capital flow to it from falling stock markets and stimulus checks.\n\nAt the same time, as cryptocurrencies surged, global momentum to make government let businesses accept them as a mode of payment and even as a legal tender grew alongside. However, government warnings about the risk of cryptocurrencies were also proven right just last month when the collapse of the cryptocurrency exchange FTX Trading Ltd. led to billions of dollars in losses for its customers. While initially portrayed as an 'honest mistake', charges filed by the Securities and Exchange Commission (SEC) against the firm's founder and former chief executive officer Sam Bankman-Fried claim otherwise. According to a Reuters report, the main reason FTX collapsed was that, allegedly, Bankman-Fried and associates made changes to its algorithm which allowed the exchange's partner hedge fund Alameda Research to continue borrowing from it to make speculative investments even if Alameda's investments and its collateral dropped in value. The vicious cycle that bankrupted the firm started when Alameda's FTT tokens, issued by FTX, collapsed in value after Coinbase sold its holdings. This shattered consumer confidence in FTX and led to a massive withdrawal of consumer funds. However, since FTX had lent this money to Alameda for the investments, it was unable to cough up the cash, which then led to its demise.\n\nStory continues\n\nThe collapse of FTX also knocked the wind out of Bitcoin. After dropping from this year's peak of ~$47,000 to a ~$20,000 level that most analysts thought was the proverbial floor since it cost roughly the same to mine a Bitcoin, the currency would take another beating soon. The drama erupted on November 6th, when Coinbase announced its decision to sell the FTT holdings. Within the next three days as FTX's customers fled, Bitcoin also dropped from $20,905 to $15,757 - a level it was at during November 2022 - effectively wiping out two years of gains and profits for anyone who had entered trading during this time period. Since that fateful day, the currency is up by less than a thousand dollars, with Bitcoin currently worth $16,456 at the time of writing (see best bitcoin stocks to buy).\n\n15 Countries Where Bitcoin is Legal and Illegal\n\nBitcoins\n\nOur Methodology\n\nFor this piece, we have divided the countries into two groups - where Bitcoin is implicitly legal and sometimes also a legal tender, and where it is absolutely banned. The countries where it is banned are listed first. Additionally, the legal frameworks of all countries analyzed for the piece do not differentiate between Bitcoin and other cryptocurrencies, except for those countries that have made Bitcoin a legal tender.\n\n15 Countries Where Bitcoin is Legal and Illegal\n\n15. People's Republic of China\n\nBitcoin Legal or Illegal: Illegal\n\nThe People's Republic of China is the world's largest economy by one measure and was one of the most popular regions for Bitcoin mining companies this decade due to the widespread adoption of technology. However, spurred into action due to the high environmental costs of mining and illicit activity, the Chinese government banned all cryptocurrency transactions in the country in 2021 when it forbade banks and other institutions from providing services such as clearing and exchange and made mining in the country illegal. However, such was the Bitcoin craze back then that the market simply shrugged off the announcement, and Bitcoin price continued to rise. Yet even though cryptocurrency trading is banned, the holding of it as an asset is protected by Chinese law according to a lawyer.\n\n14. State of Qatar\n\nBitcoin Legal or Illegal: Illegal\n\nThe state of Qatar is a Western Asian country located in the Middle East. Bitcoin and other cryptocurrencies are completely banned in the country's Qatar Financial Center (QFC). Qatar states that the reason behind the ban is weak compliance with know your customer (KYC) and anti money laundering (AML) regulations. These regulations are enforced globally by the Financial Action Task Force (FATF) and they require banks and other financial services providers to verify their customer profiles and determine the source of funds that they are transferring inside and outside the country. In fact, the Qatari Central Bank was quick to warn citizens in May 2022 about dealing with any unregulated financial firm after CoinMENA, a Muslim law compliant exchange launched in the country. Qatar is a Muslim country and follows the Sharia Law.\n\n13. Kingdom of Belgium\n\nBitcoin Legal or Illegal: Legal\n\nThe Kingdom of Belgium is a Northern European country with a relatively high GDP per capita. Cryptocurrencies are not outlawed by Belgium and there are no significant barriers to either mining Bitcoin or others or using them for transactions. However, Bitcoin is not a legal tender in the country. Gains resulting from the trading of Bitcoin and other cryptocurrencies are taxed under Belgium law, and authorities have often warned people about their speculative nature.\n\n12. Republic of Ireland\n\nBitcoin Legal or Illegal: Legal\n\nThe Republic of Ireland is a sovereign state in Europe with a high income and one that is often criticized for its loose tax laws. There is no ban against either Bitcoin or other cryptocurrencies in the country, and the only regulations covering Bitcoin are those that are in place in the entire European Union. Taxes on Bitcoin are subject to the nature of the transaction, and the rates vary if it is regularly used or if rarely used.\n\n11. New Zealand\n\nBitcoin Legal or Illegal: Legal\n\nNew Zealand is an island nation in the Pacific Ocean. There is no specific legislation that bans the mining or trading of Bitcoin in the country. However, like others, New Zealand also taxes cryptocurrency transactions. Exchanges and other businesses must obtain a license from the government before providing services, and taxes are paid for selling Bitcoin if the intent behind the sale and the preceding purchase was to sell the currency and not hold it.\n\n10. Commonwealth of Australia\n\nBitcoin Legal or Illegal: Legal\n\nThe Commonwealth of Australia is an Oceanic country that is rich in natural resources. There are no laws against either mining or transacting in Bitcoin or other cryptocurrencies in Australia. However, Bitcoin is not equal to money in the country. Instead, the law treats Bitcoin as an asset that is held, and for companies, this includes taxation if the Bitcoin is part of daily operations or has been bought with the intention of making a profit.\n\n9. Netherlands\n\nBitcoin Legal or Illegal: Legal\n\nThe Netherlands is a Northern European country that is one of the most prosperous regions in the world. The country does not have any specific laws to regulate cryptocurrency, and Bitcoin along with others generally has to follow the same regulatory framework for other financial products. The Dutch government also requires that Bitcoins should be disclosed on the annual tax returns and that a capital gains tax will be applied to them. Additionally, companies are required to convert their cryptocurrency payments into the Euro and declare them on the income statement.\n\n8. Swiss Confederation\n\nBitcoin Legal or Illegal: Legal\n\nThe Swiss Confederation, commonly known as Switzerland is a landlocked European country with a high standard of living. Cryptocurrencies are classified as intangible assets in Swiss law, are not legal tender, and have no specific laws against in. On the individual level, Switzerland does not tax cryptocurrencies on any capital gains. However, for tax assessment, they must be converted to the Swiss Franc at the year's end at a rate provided by the government.\n\n7. Federal Republic of Germany\n\nBitcoin Legal or Illegal: Legal\n\nThe Federal Republic of Germany is a European nation with the largest economy on the continent. Germany requires a license for companies to deal in Bitcoin, and its regulators have called for a global framework to deal with cryptocurrencies as prices plunge globally and more links to established financial institutions are made. Germany also treats Bitcoin as private money, and banks in the country can also store and sell Bitcoin.\n\n6. United Kingdom of Great Britain and Northern Ireland\n\nBitcoin Legal or Illegal: Legal\n\nThe United Kingdom of Great Britain and Northern Ireland is a European country located just off of the coast. There is no special regulatory framework for Bitcoin in the country, and the buying and selling of cryptocurrencies by individuals is subject to a capital gains tax which is payable on any gains that are made on disposal. For corporations, Bitcoin taxation in the U.K. depends on the nature of the transactions and whether they are one off or part of daily activity.\n\nClick to continue reading and see 5 Countries Where Bitcoin is Legal and Illegal.\n\nSuggested Articles:\n\nDisclosure: None. 15 Countries Where Bitcoin is Legal and Illegal is originally published on Insider Monkey."
    }
]