[
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyZXVtLW9wdGlvbnMtd29ydGgtNC0xMzMzNTQxNzAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Options Worth $4.5 Billion Set To Expire Today - Yahoo Finance",
        "content": "Bitcoin and Ethereum Options Worth $4.5 Billion Set To Expire Today\n\nThe crypto options market is facing a major event today that could lead to increased volatility and shifting prices for major cryptocurrencies like Bitcoin and Ethereum.\n\nAccording to data from Deribit, over $4.5 billion worth of options contracts in Bitcoin and Ethereum are set to expire at 8:00 UTC on Friday, October 27.\n\nOptions give buyers the right but not the obligation to buy or sell an asset at a predetermined price on or before a specific expiration date. As these options reach their expiration date, holders will have to decide whether to exercise their contracts or let them expire worthless.\n\nThis could lead to a spike in trading volume and volatility around the expiration time as market participants react to whether large options positions are exercised or not. CoinDesk reported the current open interest in contract terms has increased to $20.64, significantly higher than in November 2021 when BTC was around $66,000.\n\nThe impending options expiration comes after a period of positive price movement for top cryptocurrencies. Bitcoin rose from around $26,000 to over $34,000 in recent weeks. This market activity led to increased options trading.\n\nTraders and investors will be closely watching the impact of this historic options expiration as it unfolds today. The $4.5 billion in contracts set to expire represents the scale of the crypto options market today, and how it can drive price action and volatility in underlying assets."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvMy1idXktcmF0ZWQtY3J5cHRvLXN0b2Nrcy10by1jb25zaWRlci1hcy1iaXRjb2luLXByaWNlcy1icmVhay1vdXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "3 Buy-Rated Crypto Stocks to Consider as Bitcoin Prices Break Out - Nasdaq",
        "content": "Bitcoin (BTCUSD) prices have been on a wild ride lately, with the digital currency surging to its highest levels since May 2022 on growing hopes that the U.S. Securities and Exchange Commission (SEC) might finally give the green light to a spot Bitcoin ETF. Bitcoin has now doubled in value on a year-to-date basis, and is hovering right around $34,000 at last check.\n\nCoinbase (COIN), which is a big player in the crypto world, seems pretty confident that this ETF is on the horizon - but shares of the online exchange have shed more than 21% in the last three months while BTC has broken out, and analysts have a tepid consensus rating of “hold” on COIN. However, with asset management heavyweights like BlackRock (BLK) getting ready to cash in on regulatory clearance for BTC-based ETFs, it's worth taking a look at some investing opportunities among cryptocurrency and blockchain stocks.\n\nHere, we'll highlight three top-rated crypto stocks, all priced under $10 per share, that have been moving higher with BTC as the market braces for a potentially massive new wave of institutional investing dollars.\n\nBITF: Riding the Bitcoin Wave\n\nBitfarms Ltd. (BITF) is a Canadian Bitcoin mining company offering analytics and engineering services. In August 2023, Bitfarms reported mining a cool 383 new bitcoins - down from August 2022, but up sequentially from July's numbers. Plus, BTC mined through the first eight months of 2023 were higher YOY.\n\nLike most other miners, BITF is in the Bitcoin business - so when BTC prices are up, so is BITF's stock. The stock is up 162.5% YTD to trade around $1.15, and has a market cap of $243 million.\n\nwww.barchart.com\n\nAll four analysts covering BITF are giving it the green light, with three shouting \"strong buy,\" and one rating the stock a \"moderate buy.\" The average target price for BITF is $3.19, hinting at potential 177% upside from current levels.\n\nwww.barchart.com\n\nCIFR: Mining for Profits in the Bitcoin Boom\n\nCipher Mining Inc. (CIFR), a New York-based Bitcoin miner, is outperforming broader BTC prices this year. The company has a market cap of $883 million, and CIFR currently trades right around $3.33 per share.\n\nSince the start of 2023, CIFR's stock has rocketed by 492%, leaving BTC's 105% gain in the dust.\n\nwww.barchart.com\n\nPlus, all seven analysts tracking CIFR rank it a strong buy overall. Five are shouting \"strong buy,\" one's going with a \"moderate buy,\" and one suggests a \"hold.\"\n\nThe mean target price for CIFR is $5.00 is also interesting, given the stock's major rally already this year. That target indicates an expected upside of more than 50% from current levels, suggesting plenty more gains ahead.\n\nwww.barchart.com\n\nRIOT: Capitalizing on the Crypto Craze\n\nColorado-based Riot Platforms Inc. (RIOT) might have renamed itself from Riot Blockchain, but the company's primary business is still focused on Bitcoin mining and infrastructure. So, when Bitcoin's up, RIOT's stock is on the rise too.\n\nRIOT's got a relatively hefty market cap of $1.945 billion, and trades just below $10 per share. On a year-to-date basis, RIOT has outpaced BTC prices by gaining 193% - and Wall Street sees more upside ahead.\n\nwww.barchart.com\n\nOut of the 8 analysts following the shares, 6 call RIOT a “strong buy,” 1 suggests a “moderate buy,” and only 1 is daring to go against the grain with a “strong sell.” The mean target price for RIOT is $16.67, which represents a healthy premium of 68.5% to current levels.\n\nwww.barchart.com\n\nThe Future of Crypto Stocks Amid Bitcoin's Breakout\n\nIn conclusion, as Bitcoin continues to flex its muscles and break out, these three buy-rated crypto stocks look intriguing. They've been riding the Bitcoin wave, and with favorable analyst ratings, they're catching the attention of investors.\n\nBut here's the kicker: the crypto market can be an extremely volatile space. CIFR has a beta of 2.50, BITF has a beta of 3.28, and RIOT's beta is 4.31 - indicating all three stocks are considerably more volatile than the S&P 500 Index ($SPX), and are best suited for those investors with a healthy risk appetite. So while the potential upside is appealing, the heightened volatility and continuing regulatory overhang are worth keeping in mind here.\n\nOn the date of publication, Ebube Jones did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policy here.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc3BvdC1iaXRjb2luLWV0Zi1jb3VsZC1zcGFyay10aGVzZS1jcnlwdG8tZXRmc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Spot Bitcoin ETF Could Spark these Crypto ETFs - Nasdaq",
        "content": "Bitcoin, the largest cryptocurrency by market value, is on a torrid pace of late, surging more than 16% over the past week amid speculation that the Securities and Exchange Commission (SEC) could finally sign off on a spot bitcoin exchange traded fund.\n\nSome experts believe such approval, which amounts to one of the most widely anticipated events in ETF industry is history, is just months away. It remains to be seen if this is a buy the rumor, sell the news type of event, but some things aren’t up for debate. First, a spot bitcoin ETF would clearly – it already is – benefit the digital currency’s price.\n\nSecond, such a product in the U.S. would likely bring a slew of new participants into the crypto market because some retail investors have been reluctant to embrace crypto due to technological concerns. Said another way, a spot bitcoin ETF could democratize the asset class and there’s precedent for happening – one set by god ETFs.\n\nWhile crypto enthusiasts and ordinary investors wait on word from the SEC, some of the following ETFs could be worth considering.\n\nBitwise Crypto Industry Innovators ETF (BITQ)\n\nThe Bitwise Crypto Industry Innovators ETF (BITQ) is an equity-based fund, but it’s chock full of stocks that fit the bill as “crypto-correlated.” BITQ, which follows the Bitwise Crypto Innovators 30 Index, is proving as much as highlighted by a gain of 9.28% over the past week.\n\nAs Bitwise itself notes, BITQ’s roster consists of “picks and shovels” players in the crypto space, including the likes of Microstrategy (MSTR) and crypto exchange operator Coinbase (COIN). Much of the rest of the ETF’s lineup consists of crypto miners – a group highly tethered to bitcoin’s price action. But there’s more to the story. A recent report by JPMorgan indicates some bitcoin miners are making strides in the artificial intelligence (AI) due to native supercomputing capabilities.\n\n“In these beta tests, miners are reporting high profitability per unit of power consumption, much above the profitability from bitcoin mining. With bitcoin miners having already secured more than 100MW of long-term contracts with their power grids, if the profitability reported in beta tests is able to be repeated in large scale it would overshadow in the future the revenues coming from bitcoin mining at the moment,” noted the bank.\n\nProShares Bitcoin Strategy ETF (BITO)\n\nOne of the original futures-backed bitcoin ETFs, the ProShares Bitcoin Strategy ETF (BITO) remains pertinent today because bitcoin futures are, of course, levered to the underlying asset’s price movements. To its credit, BITO, which turned two years old last week, has done a solid job of tracking spot bitcoin prices since inception.\n\nIt goes without saying that BITO would benefit (it already is) from approval of a spot bitcoin ETF, but there are more chapters in this book. Importantly, recent data indicate bitcoin’s correlation to stock is declining, but its correlation to gold is increasing. That fortifies the “digital gold” thesis.\n\n“We [view]bitcoin as an investment being a non-sovereign store of value which had potential exposure to economic and internet growth, whilst being largely uncorrelated to other asset classes,” according to CoinShares. “We also find that in the context of a portfolio, it behaves in a similar manner to other alternative assets in providing diversification, with the exception that its portfolio diversification benefits are far greater than its competitors.”\n\nVanEck Ethereum Strategy ETF (EFUT)\n\nAs its name implies, the newly minted VanEck Ethereum Strategy ETF (EFUT) isn’t a bitcoin ETF. Rather, it’s focused on ethereum, the second-largest cryptocurrency behind bitcoin. EFUT is one of several new futures-based ethereum ETFs that recently came to market, indicating regulators are warming to non-bitcoin crypto fare in the ETF wrapper.\n\nThat could be one sign that if a spot bitcoin ETF is approve, there could be trickle-down effects to fund such as EFUT. Even if that scenario doesn’t come to fruition, ethereum offers investors an attractive fundamental story unto itself.\n\n“Ethereum’s limited space is managed through fees charged to users for conducting business and value exchange,” according to VanEck research. “This software is globally hosted and utilizes a protocol to establish a unified understanding of ownership, commercial activity, and business logic. It enables users to conduct commerce without the need for trust in participants or counterparts. Essentially, Ethereum’s core business revolves around selling secure, immutable blockspace that powers internet commerce.”\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvaXMtdGhlLWJpdGNvaW4tZXRmLW92ZXJoeXBlZC1uby1idXQtY3J5cHRvLXdpbnRlci1pc250LW92ZXIteWV00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "Is the Bitcoin ETF Overhyped? No – but Crypto Winter Isn't Over Yet - Nasdaq",
        "content": "By James Edwards\n\nThe industry still has some major hurdles to clear before Bitcoin can reach a new all-time-high\n\nThis week Bitcoin rallied to a 17-month high of $35,000 off the back of speculation that a Bitcoin spot ETF is imminent.\n\nInterest in crypto has seemingly done a 180, with institutional investors and retail traders returning to the fold.\n\nBut this euphoria could be short lived, as the industry still has quite a few hurdles to clear before another bull run can take off in earnest.\n\nHere's what you need to know before you jump back into the market.\n\nBinance is on thin ice\n\nSpeak to anyone with their ear to the ground in crypto, and they'll tell you the elephant in the room isn't the Sam Bankman-Fired trial or the SEC, but Binance.\n\nThe world's largest exchange by trade volume is currently facing a crisis on several fronts.\n\nOn October 17, Binance US disabled US dollar withdrawals after the SEC asked a court to freeze the companies assets.\n\nThis action is part of an on-going lawsuit which alleges Binance violated a number of securities laws.\n\nAmong the charges are illegal securities offerings of BNB and BUSD, the comingling of users funds, failure to register as an exchange, and falsifying trading volumes.\n\nThis isn't Binance's only battle in the U.S. either. An earlier lawsuit from the CTFC in March that alleges the company \"willfully evaded\" securities laws and by targeting and onboarding US to its derivatives platform.\n\nBoth lawsuits target not just Binance, but also accuse its CEO, Changpeng Zhao (CZ), of breaking the law.\n\nThe pausing of US dollar withdrawals follows similar actions in Europe and Australia, where EUR and AUD payment partners have abandoned the firm, with no replacements to be found.\n\nJust months before AUD withdrawals were frozen, its Australian CEO Leigh Travers quit the firm as the Australian Securities and Investments Commission investigated Binance and closed its derivatives business by revoking its license.\n\nThings aren't much better across the pond either, with Binance losing its head of UK operations, ​​Jonathan Farnell, earlier this week.\n\nOn October 16, Binance restricted services for customers in the UK as a result of new Financial Conduct Authority (FCA) rules.\n\nThis is the latest in a series of departures, which saw Binance's Chief Strategy Officer, Senior Director of Investigations, and SVP for Compliance all depart in July.\n\nElsewhere, Binance is facing heat from regulators in Germany for violating securities laws and in both Japan and Singapore for operating without a license.\n\nFor their part, Binance continue to largely dismiss the claims against them, and have filed a request in court to have the SEC lawsuit thrown out.\n\nThe concern now is that Binance could face a liquidity crisis, similar to that of FTX and other defunct exchanges before it.\n\nIf users are forced to withdraw funds en masse, or simply panic, then it's unclear whether Binance would be able to meet demand.\n\nIt's no secret that Binance has built a sprawling web of financial services, which include all sorts of lending facilities, staking, funding deals, and trading activities.\n\nAny sudden capital flight could easily shock the system, and have flow-on effects throughout the industry.\n\nNo one quite knows if Binance is operating with integrity, but the concern is very real.\n\nThe Sam Bankman-Fried trial and FTX bankruptcy are still unresolved\n\nThe criminal trial against Sam Bankman-Fried (SBF) is now in its 4th week, and won't conclude until November 9th at the earliest.\n\nA core line of inquiry has been FTX's sprawling empire and business dealings. These include hundreds of investments in crypto projects, its hedge fund Alameda and even millions of dollars of political donations.\n\nAs further evidence of illegal conduct is revealed, there's concern around what impact this will have on the wider industry – which is only just recovering.\n\nFor instance, FTX and its sister firm, Alameda, invested $5.3 billion in 473 companies via their venture capital efforts.\n\nOf this, approximately $3.2 billion was invested across 250 different crypto projects in return for tokens, or token IOUs.\n\nThe list includes major names like Polygon (MATIC), Near (NEAR) and Lido (LDO), as well as 200 or so lesser known projects.\n\nAs FTX administrators look to recoup customer assets, it’s possible that these tokens will be sold off in order to reimburse creditors.\n\nThe latest proposal from FTX's administrators looks to settle bankruptcy proceedings and return funds to creditors by July 2023.\n\nSo any major sell-offs should be expected before this date, and could potentially dampen any fuel added to Bitcoin's rocket by an ETF approval.\n\nThis wouldn't just dampen token prices either.\n\nMost projects rely on the value of their token to fund their on-going development. A sudden devaluation of their treasury would place the future of many projects in peril.\n\nA new lawsuit: Gemini, Genesis and Digital Currency Group sued by New York AG\n\nOn October 19, the New York Attorney General, Letita James, filed a lawsuit against Gemini Trust, Genesis Global Capital and Digital Currency Group (DCG).\n\nThe lawsuit revolves around Gemini's Earn programme, with the three companies accused of defrauding more than 230,000 customers of $1.1 billion.\n\nGemini loaned user funds to Genesis, which is owned by DCG. Genesis then lent these to firms such as Alameda (of FTX fame) and Three Arrows Capital, which later collapsed, leaving $1.1 billion of bad debt that Gemini has been blaming Gensis for ever since.\n\nThe suit alleges that all parties \"falsely claimed\" they had the necessary licenses to operate in New York.\n\nGemini has worked hard to position itself as the victim in this case, with its owners, the Winklevoss Twins, accusing DCG owner Barry Silbert publicly via forums like X (twitter).\n\nThe New York AG is seeking to have Gemini, Genesis and DCG banned from operating in New York and is seeking compensation for the 29,000 New Yorkers affected – approximately 12.5% of the total users.\n\nIf forced to repay this portion of the $1.1 billion owed, DCG may be forced to sell off part of its portfolio of companies.\n\nThese include wholly owned entities like Grayscale Investments, CoinDesk and the Luno exchange. Then there is equity in another 200+ crypto related companies of all shapes and sizes, many of which play critical roles in the wider crypto economy.\n\nIn February this year, there were reports that DCG was forced to sell parts of its portfolio at a steep discount, in order to help fund the hole left by Genesis.\n\nWhile DCG has since sought bankruptcy for Gensis to try and stem the bleeding, the new suite by the NY AG may force DCG to sell off even more of its portfolio and disrupt markets further.\n\nStill a while to go\n\nDespite the excitement around a spot crypto ETF potentially being approved soon in the U.S., cryptocurrency markets still have a lot of skeletons in the closet and hurdles that need to be cleared before the next bull market can take off.\n\nInvestors will want to be wary of unbridled euphoria this time around, and make sure to analyze the bigger picture before going all in on one of the most volatile asset classes in history.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzcwNGZiMmE3LTAwZTktNDY5Yi04ODkyLTgxMTc1MzRjYjhmM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Oct 2023 07:00:00 GMT",
        "title": "CryptoFinance: Cultures clash as bitcoin ETF turns rebellion into money - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Cryptocurrencies myFT Digest -- delivered directly to your inbox.\n\nHello and welcome to the latest edition of the FT’s Cryptofinance newsletter.\n\n“The Times 03/Jan/2009: Chancellor on brink of second bailout for banks.”\n\nIn the early days of 2009, bitcoin’s pseudonymous creator Satoshi Nakamoto etched that headline into the first batch of bitcoin transactions ever processed.\n\nThe message was a nod to bitcoin’s intended purpose, as laid down in the initial white paper: a form of electronic cash that offered people the chance to separate their financial lives from the control of powerful intermediaries such as banks, regulators or the government.\n\nCrypto’s confident, scornful and punky start came to mind this week for some when bitcoin surged to roughly $35,000. It was a small but meaningful moment: all those losses sustained after the Terra stablecoin collapsed and sent a whole heap of trouble pulsing through the market were erased.\n\nBut what triggered the gains was, well, nothing very much.\n\nThe market is on tenterhooks so much because BlackRock, the world’s largest asset manager, may soon receive regulatory approval in the US to launch a cash bitcoin exchange traded fund, something that invests directly in bitcoin and can be traded as easily on the New York Stock Exchange as Apple.\n\nBut this has been the case for months and the approvals may not come until next year. What seemed to have got bitcoin enthusiasts excited was BlackRock’s ETF added to a list of eligible assets that are held at the US securities clearing house.\n\nThis is the equivalent of a harried waiter in a crowded restaurant clearing a table, before ushering you over; a necessary step but it doesn’t mean you’re going to eat imminently.\n\nNor was the spike an isolated incident. Last week bitcoin leapt 8 per cent on a false rumour that BlackRock had indeed secured regulatory approval.\n\nThe assumption is that approval will inspire a new wave of inflows into a market that has long struggled with next to no liquidity.\n\nAs Jeremy Senderowicz of law firm Vedder Price told me: “To have an ETF launch necessarily represents the maturation of an asset class: it’s a sign that it has arrived in the format that anyone can access . . . you would think that could only be a good thing for crypto.”\n\nBut good news for Wall Street’s crypto-curious is not being welcomed everywhere. Crypto’s longtime believers, who have followed bitcoin’s development since the early days, tell me a financial revolution is being traded in for a spot on Wall Street.\n\n“It’s a maddening betrayal of crypto’s foundational principles, a sellout to traditional finance and a surrender of our ideals,” said Charles Storry, head of growth at crypto index platform Phuture.\n\n“Satoshi Nakamoto’s vision of a permissionless liberation from government now lies in the hands of the world’s largest establishment, asking America’s regulators to approve something that makes bitcoin just like any other asset class,” he added.\n\nSome still fight the good fight. Last month Erik Voorhees, founder of crypto platform ShapeShift and ardent crypto-libertarian, tried to rally the faithful:\n\n“Before crypto, all movement of funds required someone’s permission . . . try moving ten thousand dollars across a border and you’ll be swiftly reminded of the permissions that are imposed on you . . . so thank God a permissionless form of money was invented.”\n\nBut the excitement around BlackRock illustrates how the narrative on crypto has moved on as the reality of life intrudes. There is an argument that crypto should take what it can get: ETF approvals would be rare wins for a world whose former figurehead is on trial for fraud in New York, and whose biggest surviving companies are facing lawsuits for violating securities laws and illegally accessing US customers.\n\nIt’s also easy to imagine that a successful BlackRock application would send the price of bitcoin flying.\n\n“A BlackRock approval can open the tap for a lot of wealth managers and asset managers to take even a small position on bitcoin, it can potentially be a game-changer,” added Javier Rodriguez-Alarcon, chief commercial officer at XBTO, a digital assets platform.\n\nBut not even a potential bull run for bitcoin can shake off the sense of capitulation for the industry’s die-hards.\n\nOnly El Salvador and the Central African Republic adopted bitcoin as legal tender, nor did it really bank the unbanked, or seriously provide a financial lifeline to those living under an authoritarian regime.\n\nInstead Wall Street has executed its own takeover. Satoshi envisaged a unfluctuating world, where records are immutable and there are a finite number of bitcoins, 21mn. An ETF is a securitised version of bitcoin but it can be replicated, scaled and traded to match demand.\n\nAs Matthew Cloete, head of marketing at Ryze, a London crypto trading firm, notes:\n\n“Most people think that the ETF is going to be the catalyst for the next bull market, which just goes to show how far we have strayed from the original vision, almost as if we’re throwing in the towel.”\n\nWhat’s your take on crypto’s hopes for a BlackRock ETF? As always, email me at scott.chipolina@ft.com.\n\nFTX trial latest\n\nThe trial of Sam Bankman-Fried took another turn when the disgraced former FTX kingpin decided he would testify in his own defence.\n\nDefence lawyers don’t usually advise this course of action to clients but observers say the prosecution has put forward a powerful case. Plus, it’s no surprise to anyone who has followed Bankman-Fried closely that he would want to tell his version of events.\n\nBankman-Fried’s defence got off to an unusual start: the judge sent the jury home while he decided what evidence can be repeated in front of jurors when they return today.\n\nHis lawyers have already publicly laid out the plan: SBF was following legal advice in many of his actions and lawyers help draft many of the policies, such as data retention (or lack of it) and how customer money intended for FTX ended up in his Alameda Research trading arm.\n\nSoundbite of the week: Senator Lummis turns up the heat\n\nThe wind has changed direction on crypto in Washington after Hamas’s attack on Israel this month. Last week, I reported that Israeli law enforcement authorities ordered the closure of more than 100 Binance accounts, and Tether had frozen 32 addresses linked to “terrorism and warfare” in Israel and Ukraine.\n\n\n\nNow senator Cynthia Lummis and representative French Hill have urged the Department of Justice to speed up investigations into crypto’s two largest players: the Binance exchange and Tether, the stablecoin provider.\n\n“We urge the Department of Justice to carefully evaluate the extent to which Binance and Tether are providing material support and resources to support terrorism through violations of applicable sanctions laws and the Bank Secrecy Act. To that end, we strongly support swift action by the Department of Justice against Binance and Tether to choke off sources of funding to the terrorists currently targeting Israel.”\n\nData mining: A final word on BlackRock and bitcoin\n\nThe importance of the US regulator to a bitcoin ETF approval is underscored by location of bitcoin assets under management. The US is far ahead of the rest of the world, as figures from CCData show. Moreover the total value of bitcoin under management has increased by almost $3bn this month, to the highest point since June.\n\nFT Cryptofinance is edited by Philip Stafford. Please send any thoughts and feedback to cryptofinance@ft.com."
    }
]