[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMTEvMTYvdGVjaG5vbG9neS9jcnlwdG9jdXJyZW5jeS1iaXRjb2luLWV0Zi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Cryptocurrency Prices Surge, Driven by a Potential Bitcoin Fund - The New York Times",
        "content": "In a Manhattan courtroom this month, the cryptocurrency industry faced a reckoning as its onetime star, Sam Bankman-Fried, was convicted of fraud in a trial that put the industry’s excesses on vivid display.\n\nBut the ever-volatile crypto markets were already moving on.\n\nShortly before Mr. Bankman-Fried’s verdict landed on Nov. 2, the price of Bitcoin surpassed $35,000, its highest level since an industry meltdown in 2022. Last week, Ether, the second-most-popular digital currency, surged 10 percent to around $2,100, its best performance in months. Some investors rushed to declare the end of the so-called crypto winter of falling prices and financial scandals that have plagued the industry for the last 18 months.\n\nDriving the renewed euphoria? A potential new fund.\n\nCrypto investors are growing optimistic that the Securities and Exchange Commission will approve an exchange-traded fund, or E.T.F., that tracks the price of Bitcoin, analysts said. The fund would trade on traditional stock exchanges and offer an easy way for people to invest in cryptocurrencies, potentially bringing a wave of money into the industry.\n\nSome proponents have hailed the possibility of this new investment vehicle, known as a spot Bitcoin E.T.F., as crypto’s “salvation.” In August, Grayscale Investments, a crypto asset manager, scored a legal victory over the S.E.C. that seemed to pave the way for it to offer the Bitcoin product. And last week, BlackRock, a giant money manager, filed paperwork to establish a similar E.T.F. to track the price of Ether."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yZXBvcnQtc2NhbW1lZC1iaXRjb2luLWV4cGFuZHMtc2VydmljZXMtMTEzNDQzNjA0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Report Scammed Bitcoin Expands Services to Aid Crypto Trading Victims in Recovering Lost Assets - Yahoo Finance",
        "content": "New York, NY, United States --News Direct-- King Newswire\n\nReport Scammed Bitcoin, a crypto recovery services provider, has announced the extension of its services by assisting individuals who have fallen victim to unethical practices in crypto trading. Report Scammed Bitcoin (RSB) has offered costless consultations, guidance, and support and connects affected parties with reputable third-party crypto recovery companies that may charge a fee for their services.\n\nWith the recent updates, RSB has empowered cryptocurrency enthusiasts to make informed decisions and hold unethical brokers accountable. The company bolsters to build a community of informed investors who can protect themselves from hidden fees and market manipulation by sharing experiences, knowledge, and insights.\n\nRSB has the ability to create customized recovery plans tailored to individual cases. Whether serving as an advisor to management or offering hands-on coaching, RSB's team of experts can adapt strategies to address specific complaints and unique circumstances.\n\nRSB has emphasized taking the initial step by filing a complaint on the RSB website and their customer service representatives are available 24 hours a day to provide clients with the assistance and support they need.\n\nTo learn more about Report Scammed Bitcoin's expanded services and how they can assist users in recovering lost digital assets, please visit their website.\n\nAbout Report Scammed Bitcoin:\n\nReport Scammed Bitcoin (RSB) is a crypto recovery services provider with over two decades of experience in the industry. RSB is committed to helping individuals recover their lost digital assets and empowering cryptocurrency enthusiasts to make informed decisions. Their team of experts offers customized recovery plans and free consultations, and they connect affected parties with reputable third-party crypto recovery companies.\n\nContact Details\n\nReport Scammed Bitcoin (RSB)\n\nZella\n\nsupport@reportscammedbitcoin.com\n\nStory continues\n\nCompany Website\n\nhttps://reportscammedbitcoin.com\n\nView source version on newsdirect.com: https://newsdirect.com/news/report-scammed-bitcoin-expands-services-to-aid-crypto-trading-victims-in-recovering-lost-assets-724794097"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTEvMTcveW91LWNvdWxkLW93ZS0wcGVyY2VudC1jYXBpdGFsLWdhaW5zLXRheC1mb3ItY3J5cHRvY3VycmVuY3ktaW4tMjAyMy5odG1s0gFsaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMTEvMTcveW91LWNvdWxkLW93ZS0wcGVyY2VudC1jYXBpdGFsLWdhaW5zLXRheC1mb3ItY3J5cHRvY3VycmVuY3ktaW4tMjAyMy5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "You could owe 0% capital gains tax for cryptocurrency in 2023. Here's what crypto investors need to know - CNBC",
        "content": "After a more than 80% jump in bitcoin's price in the first half of 2023, crypto market watchers gave CNBC their expectations for how the cryptocurrency will perform in the latter half of the year. STR | NurPhoto via Getty Images\n\nAs investors weigh year-end tax moves, there may be a lesser-known savings opportunity for certain cryptocurrency investors, experts say. After the crypto industry lost nearly $1.4 trillion in 2022, many investors leveraged tax loss harvesting, which uses losses to offset profits. But after a rally in 2023, you may consider strategically selling profitable crypto held in brokerage accounts, known as \"tax gain harvesting.\" The strategy works for investors in the 0% long-term capital gains bracket who have owned digital assets for more than one year, according to certified public accountant Tom Wheelwright, CEO of WealthAbility.\n\nLoading chart...\n\nAs of November 17, the price of bitcoin has more than doubled since the beginning of 2023, and some investors now have \"built-in gains,\" Wheelwright said. Those in the 0% long-term capital gains bracket can \"sell it, recognize the gain and buy it back immediately\" because there's no so-called wash sale rule for gains, he said. You calculate gains by subtracting the asset's sales price from the \"basis\" or original cost. But when you repurchase the currency, the basis adjusts to the new purchase price, known as a \"step-up in basis.\" If prices continue to climb and you sell the asset again later, the higher basis means future profits will be smaller. Investors \"really ought to be paying attention\" to tax-free opportunities to harvest crypto gains, according to Wheelwright. Of course, the decision to repurchase crypto depends on your risk tolerance and goals.\n\nWhy it's a 'wiser strategy' to harvest gains\n\nIf you fall into the 0% bracket, crypto tax-gain harvesting is a \"wiser strategy\" than harvesting losses, especially when immediately buying back the asset, explained Andrew Gordon, tax attorney, CPA and president of Gordon Law Group. Tax-loss harvesting has been popular among crypto investors because of a wash sale loophole. The IRS disallows a loss for other assets if investors buy a \"substantially identical\" asset within the 30-day window before or after the sale. The wash sale rule doesn't apply to crypto losses or gains for any asset. Still, the tax gain strategy allows you to sell at a gain and pay no tax, whereas \"tax loss harvesting defers future tax,\" Gordon said.\n\nwatch now\n\nHow to know your capital gains bracket\n\nFor 2023, you may fall into the 0% long-term capital gains rate with taxable income of $44,625 or less for single filers and $89,250 or less for married couples filing jointly. That's based on \"taxable income,\" which is significantly lower than gross earnings. You calculate taxable income by subtracting the greater of the standard or itemized deductions from your adjusted gross income."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc29yYS1zdW1taXQtMjAyMyUzQS11bnZlaWxpbmctdGhlLWZ1dHVyZS1vZi1iaXRjb2luLWluLXRhaXBladIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "Sora Summit 2023: Unveiling the Future of Bitcoin in Taipei - Nasdaq",
        "content": "In a dynamic intersection of technology, finance, and innovation, Sora Summit 2023 is set to unfold on December 16 at the Songshan Cultural and Creative Park in Taipei. This eagerly anticipated event, organized by Sora Ventures, a digital asset venture capital firm, promises to be the pinnacle of Taipei Blockchain Week.\n\nA Legacy of Collaboration and Excellence\n\nSora Summit made its debut in 2018 in Macau, attracting over 1,000 participants and featuring more than 100 speakers from globally recognized entities such as Pantera Capital and Binance Labs. The summit has since evolved into a benchmark for quality information, distinguished speakers, and high-profile attendees, setting the stage for collaborative efforts within the Bitcoin community.\n\n“The development of bitcoin utility will be far more relevant tobitcoin pricethan anyone can imagine. Historically, utility has been the core factor to price increase on any blockchain,” said Jason Fang, Managing Partner and Co-Founder at Sora Ventures. “Sora’s investment team feels very strongly about this trend and we are eager to share our knowledge and resources through Sora Summit.”\n\nFour Pillars of Focus\n\nThis year, Sora Summit returns with a renewed commitment to fostering collaboration and exploring the latest trends in the Bitcoin space. The event will revolve around four key sectors, each crucial to the evolution of Bitcoin and digital assets:\n\nBitcoin Ecosystem: Delving into the recent surge in Bitcoin's utility and value, the summit aims to unravel the intricacies of the Bitcoin ecosystem with insights from industry leaders.\n\nDecentralized Science: As the future of open-sourced scientific research takes center stage, the summit will facilitate discussions on the transformative potential of decentralized science.\n\nCryptography & Encryption: Tackling the pressing challenges of data privacy, experts will converge to propose innovative solutions within the realm of cryptography and encryption.\n\nOrdinals: Exploring the next phase for greater adoption, Sora Summit will shed light on the evolving landscape of Ordinals, Inscriptions and their expanding utilities and use cases.\n\nDistinguished Speakers Shaping the Dialogue\n\nThis year's summit boasts an impressive lineup of speakers representing prominent organizations within the Bitcoin ecosystem. Notable figures include Casey Rodarmor, the Creator of the Ordinals Protocol, Danny Yang, CEO at Metagood and OnChainMonkey, David Bailey, CEO at Bitcoin Magazine, and Domo, the Creator of BRC-20 standard and the token ORDI. These speakers bring a wealth of experience and expertise, ensuring diverse perspectives on the critical issues facing the Bitcoin industry today.\n\nTaipei: A Pivotal Hub for Blockchain Innovation\n\nFang highlighted the significance of choosing Taipei as the host city. He emphasized Taipei's unique position in bridging the East and West in the Bitcoin landscape, citing the city's immense potential to contribute to the industry ecosystem. “A lot of people in our industry have heard about Ordinals and decentralized science, but not many people actually understand what the technology does,” explained Fang. “This is why we’re hosting Sora Summit, so we can fill the knowledge gap for those who are keen to hear about the future narratives in Bitcoin.” By partnering with Taipei Blockchain Week, Sora Summit aims to underscore Taipei's importance within the global blockchain community, providing an unparalleled platform for participants to learn, network, and collaborate.\n\nA Confluence of Minds and Technologies\n\nAs Sora Summit 2023 prepares to unfold in Taipei, the anticipation is palpable. With a focus on the Bitcoin ecosystem and a diverse array of sectors critical to the future of digital commerce, the summit promises to be a melting pot of ideas, collaboration, and innovation. The distinguished speakers will undoubtedly play a pivotal role in shaping the discourse and steering the Bitcoin industry toward new horizons. As the world eagerly awaits the insights and collaborations that will emerge, Sora Summit 2023 stands as a testament to the continued evolution and maturation of the Bitcoin ecosystem.\n\nFor more information and to register for Sora Summit 2023, click here.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1pbmluZy1kb2VzLTE1NDkyODUwNS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Nov 2023 08:00:00 GMT",
        "title": "What is Bitcoin mining and how does it work? - Yahoo Finance",
        "content": "Bitcoin mining is the process of creating new bitcoins by solving extremely complicated math problems that verify transactions in the currency. When a bitcoin is successfully mined, the miner receives a predetermined amount of bitcoin.\n\nBitcoin is a cryptocurrency that’s gained a wide following due to its wild price swings and surging value since it was first created in 2009.\n\nAs prices of cryptocurrencies and Bitcoin in particular have skyrocketed in recent years, it’s understandable that interest in mining has picked up as well. But for most people, the prospects for Bitcoin mining are not good due to its complex nature and high costs. Here are the basics on how Bitcoin mining works and some key risks to be aware of.\n\nBitcoin mining statistics\n\nDollar Coin\n\nA miner currently earns 6.25 Bitcoin (about $227,500 as of November 2023) for successfully validating a new block on the Bitcoin blockchain.\n\nCreating Bitcoin consumes 147 terawatt-hours of electricity each year, more than is used by the Netherlands or the Philippines, according to the Cambridge Bitcoin Electricity Consumption Index.\n\nIt would take nine years of household-equivalent electricity to mine a single bitcoin as of August 2021.\n\nThe price of Bitcoin has been extremely volatile over time. In 2020, it traded as low as $4,107 and reached an all-time high of $68,790 in November 2021. As of November 2023, it traded for about $36,400.\n\nWhile it depends on your computing power and that of other miners, the odds of a modestly powered solo miner solving a Bitcoin hash were about 1 in 26.9 million in January 2023.\n\nThe United States (37.4 percent), Mainland China (18.1 percent) and Kazakhstan (14.0 percent) were the largest bitcoin miners as of January 2022, according to the Cambridge Electricity Consumption Index.\n\nUnderstanding Bitcoin\n\nBitcoin is one of the most popular types of cryptocurrencies, which are digital mediums of exchange that exist solely online. Bitcoin runs on a decentralized computer network or distributed ledger that tracks transactions in the cryptocurrency. When computers on the network verify and process transactions, new bitcoins are created, or mined. These networked computers, or miners, process the transaction in exchange for a payment in Bitcoin.\n\nStory continues\n\nBitcoin is powered by blockchain, which is the technology that powers many cryptocurrencies. A blockchain is a decentralized ledger of all the transactions across a network. Groups of approved transactions together form a block and are joined to create a chain. Think of it as a long public record that functions almost like a long running receipt. Bitcoin mining is the process of adding a block to the chain.\n\nHow Bitcoin mining works\n\nIn order to successfully add a block, Bitcoin miners compete to solve extremely complex math problems that require the use of expensive computers and enormous amounts of electricity. To complete the mining process, miners must be first to arrive at the correct or closest answer to the question. The process of guessing the correct number (hash) is known as proof of work. Miners guess the target hash by randomly making as many guesses as quickly as they can, which requires major computing power. The difficulty only increases as more miners join the network.\n\nThe computer hardware required is known as application-specific integrated circuits, or ASICs, and can cost up to $10,000. ASICs consume huge amounts of electricity, which has drawn criticism from environmental groups and limits the profitability of miners.\n\nIf a miner is able to successfully add a block to the blockchain, they will receive 6.25 bitcoins as a reward. The reward amount is cut in half roughly every four years, or every 210,000 blocks. As of November 2023, Bitcoin traded at around $36,400, making 6.25 bitcoins worth $227,500.\n\nIs Bitcoin mining profitable?\n\nIt depends. Even if Bitcoin miners are successful, it’s not clear that their efforts will end up being profitable due to the high upfront costs of equipment and the ongoing electricity costs. The electricity for one ASIC can use the same amount of electricity as half a million PlayStation 3 devices, according to a 2019 report from the Congressional Research Service.\n\nAs the difficulty and complexity of Bitcoin mining has increased, the computing power required has also gone up. Bitcoin mining consumes about 147 terawatt-hours of electricity each year, more than most countries, according to the Cambridge Bitcoin Electricity Consumption Index. You’d need 9 years’ worth of the typical U.S. household’s electricity to mine just one bitcoin as of August 2021.\n\nSource: Cambridge Bitcoin Electricity Consumption Index\n\nOne way to share some of the high costs of mining is by joining a mining pool. Pools allow miners to share resources and add more capability, but shared resources mean shared rewards, so the potential payout is less when working through a pool. The volatility of Bitcoin’s price also makes it difficult to know exactly how much you’re working for.\n\nHow do you start Bitcoin mining?\n\nHere are the basics you’ll need to start mining Bitcoin:\n\nWallet. This is where any Bitcoin you earn as a result of your mining efforts will be stored. A wallet is an encrypted online account that allows you to store, transfer and accept Bitcoin or other cryptocurrencies. Companies such as Coinbase, Trezor and Exodus all offer wallet options for cryptocurrency.\n\nMining software. There are a number of different providers of mining software, many of which are free to download and can run on Windows and Mac computers. Once the software is connected to the necessary hardware, you’ll be able to mine Bitcoin.\n\nComputer equipment. The most cost-prohibitive aspect of Bitcoin mining involves the hardware. You’ll need a powerful computer that uses an enormous amount of electricity in order to successfully mine Bitcoin. It’s not uncommon for the hardware costs to run around $10,000 or more.\n\nRisks of Bitcoin mining\n\nPrice volatility. Bitcoin’s price has varied widely since it was introduced in 2009. Since just November 2021, Bitcoin has traded for less than $20,000 and nearly as high as $69,000. This kind of volatility makes it difficult for miners to know if their reward will outweigh the high costs of mining.\n\nRegulation. Very few governments have embraced cryptocurrencies such as Bitcoin, and many are more likely to view them skeptically because the currencies operate outside government control. There is always the risk that governments could outlaw the mining of Bitcoin or cryptocurrencies altogether as China did in 2021, citing financial risks and increased speculative trading.\n\nTaxes on Bitcoin mining\n\nIt’s important to remember the impact that taxes can have on Bitcoin mining. The IRS has been looking to crack down on owners and traders of cryptocurrencies as the asset prices have ballooned in recent years. Here are the key tax considerations to keep in mind for Bitcoin mining.\n\nAre you a business? If Bitcoin mining is your business, you may be able to deduct expenses you incur for tax purposes. Revenue would be the value of the bitcoins you earn. But if mining is a hobby for you, it’s not likely you’ll be able to deduct expenses.\n\nMined bitcoin is income. If you’re successfully able to mine Bitcoin or other cryptocurrencies, the fair market value of the currencies at the time of receipt will be taxed at ordinary income rates.\n\nCapital gains. If you sell bitcoins at a price above where you received them, that qualifies as a capital gain, which would be taxed the same way it would for traditional assets such as stocks or bonds.\n\nCheck out Bankrate’s cryptocurrency tax guide to learn about basic tax rules for Bitcoin, Ethereum and more.\n\nBottom line\n\nWhile Bitcoin mining sounds appealing, the reality is that it’s difficult and expensive to actually do profitably. The extreme volatility of Bitcoin’s price adds more uncertainty to the equation.\n\nKeep in mind that Bitcoin itself is a speculative asset with no intrinsic value, which means it won’t produce anything for its owner and isn’t pegged to something like gold. Your return is based on selling it to someone else for a higher price, and that price may not be high enough for you to turn a profit."
    }
]