[
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jb2luYmFzZS1ob2xkcy01LXBlcmNlbnQtb2YtYml0Y29pbi1kYXRh0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Coinbase holds 5% of all Bitcoin in existence: Data - Cointelegraph",
        "content": "Blockchain intelligence platform Arkham recently identified that crypto exchange Coinbase holds almost 1 million Bitcoin (BTC) in its wallets. The coins are worth more than $25 billion at current market prices for BTC.\n\nAccording to Arkham, the exchange’s holdings amount to almost 5% of all existing Bitcoin. Arkham said that Coinbase holds a total of 947,755 BTC. At the moment, Bitcoin’s circulating supply is around 19,493,537, according to coin information website CoinGecko.\n\nArkham has now identified $25B of Coinbase Bitcoin reserves (~1M BTC) on chain.\n\n\n\nThis makes Coinbase the largest Bitcoin entity in the world on Arkham, with almost 5% of all BTC in existence - about as much as Satoshi Nakamoto. pic.twitter.com/7sDOczS7WT — Arkham (@ArkhamIntel) September 22, 2023\n\nFurthermore, Arkham also noted that it tagged and identified 36 million Bitcoin deposit and holding addresses used by the exchange. According to Arkham, Coinbase’s largest cold wallet holds around 10,000 BTC. Based on the exchange’s financial reports, the intelligence company believes that Coinbase has more Bitcoin that are not yet labeled and could not be identified.\n\nWhile Coinbase holds over $25 billion in BTC in its wallets, the exchange only owns around 10,000 of all the Bitcoin it holds, which is worth roughly $200 million, according to recent data.\n\nRelated: Bitcoin mining can help reduce up to 8% of global emissions: Report\n\nMeanwhile, community members expressed varying reactions to the news about the amount of Bitcoin the centralized exchange holds. Some believe it’s a sign to withdraw their BTC from exchanges, warning holders not to wait until exchanges start to halt withdrawals. Others say that since there are legitimate concerns over cold wallets, there’s no good way to store their assets.\n\nWhen it comes to Bitcoin ownership by companies, business intelligence firm MicroStrategy still owns the most BTC. In earnings results posted on Aug. 1, the firm’s co-founder Michael Saylor declared that the company owns 152,800 BTC, worth over $4 billion at the time of writing.\n\nMagazine: How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLW1vc3QtY3J5cHRvcy10cmFkZWQtc2lkZXdheXMtZm9sbG93aW5nLWZlZC1jaGFpcnMtaGF3a2lzaC1jb21tZW50cy9hcnRpY2xlc2hvdy8xMDM4ODUxMDcuY21z0gGbAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2JpdGNvaW4tbW9zdC1jcnlwdG9zLXRyYWRlZC1zaWRld2F5cy1mb2xsb3dpbmctZmVkLWNoYWlycy1oYXdraXNoLWNvbW1lbnRzL2FtcF9hcnRpY2xlc2hvdy8xMDM4ODUxMDcuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, most cryptos traded sideways following Fed Chair’s hawkish comments - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nOver the past week, the crypto market displayed a sideways trend, influenced by various industry developments and macroeconomic factors. Bitcoin started trading at the $26,000 mark and briefly surged above $27,000. However, it faced resistance around the $27,500 level, leading to a subsequent downward movement. Presently, BTC is trading at approximately $26,600. If BTC continues its decline, it may retest the support zone at $25,400. Despite experiencing a 60% decline from its all-time high, BTC has posted a 2.34% gain month-to-date and a remarkable 60% increase year-to-date.Additionally, this week the U.S. Federal Reserve convened for a meeting to discuss interest rate hikes. Fed Chair Jerome Powell indicated that the central bank would consider additional rate hikes if the economy continues to outperform expectations. The benchmark interest rate presently remains in the range of 5.25% to 5.50%. Concurrently, market participants are reacting to the U.S. benchmark 10-year note yields reaching 4.490%, the highest level since November 2007. These events have induced a bit of bearish sentiments in the markets.Similarly, Ethereum (ETH) has mirrored BTC's movements. ETH encountered bearish momentum below the $1,600 level. A breakthrough above the $1,620 resistance could propel its price toward $1,650, while a failure to clear immediate support may lead to a decline towards the $1,565 level.In an interesting turn of events, Germany's largest lender, Deutsche Bank, announced a collaboration with Swiss startup Taurus to establish digital asset custody and tokenization services, highlighting the growing involvement of traditional financial institutions in the crypto space.On a different note, Nomura, a prominent Japanese investment bank, introduced a Bitcoin-based fund catering to institutional investors. Meanwhile, Grayscale, a notable player in the crypto investment space, has submitted an application to the U.S. SEC for a new Ethereum Futures ETF, further demonstrating the continued evolution of the crypto market and its integration with traditional finance.Coming to the price action, among the top 100 cryptos by market cap, here are the best and worst-performing cryptos over the past week:As per prices on Friday.1. Immutable is up by 32%2. Toncoin is up by 20%3. Aave is up by 16%4. GMX is up by 11%5. Terra Classic is by 8%1. IOTA is down by 10%2. Gala is down by 9%3. Klaytm is down by 8%4. Axie Infinity is down by 6%5. Rocket Pool is down by 6%"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLW1vc3QtY3J5cHRvcy10cmFkZWQtc2lkZXdheXMtZm9sbG93aW5nLWZlZC1jaGFpcnMtaGF3a2lzaC1jb21tZW50cy9hcnRpY2xlc2hvdy8xMDM4ODUxMDcuY21z0gGbAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2JpdGNvaW4tbW9zdC1jcnlwdG9zLXRyYWRlZC1zaWRld2F5cy1mb2xsb3dpbmctZmVkLWNoYWlycy1oYXdraXNoLWNvbW1lbnRzL2FtcF9hcnRpY2xlc2hvdy8xMDM4ODUxMDcuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, most cryptos traded sideways following Fed Chair’s hawkish comments - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nOver the past week, the crypto market displayed a sideways trend, influenced by various industry developments and macroeconomic factors. Bitcoin started trading at the $26,000 mark and briefly surged above $27,000. However, it faced resistance around the $27,500 level, leading to a subsequent downward movement. Presently, BTC is trading at approximately $26,600. If BTC continues its decline, it may retest the support zone at $25,400. Despite experiencing a 60% decline from its all-time high, BTC has posted a 2.34% gain month-to-date and a remarkable 60% increase year-to-date.Additionally, this week the U.S. Federal Reserve convened for a meeting to discuss interest rate hikes. Fed Chair Jerome Powell indicated that the central bank would consider additional rate hikes if the economy continues to outperform expectations. The benchmark interest rate presently remains in the range of 5.25% to 5.50%. Concurrently, market participants are reacting to the U.S. benchmark 10-year note yields reaching 4.490%, the highest level since November 2007. These events have induced a bit of bearish sentiments in the markets.Similarly, Ethereum (ETH) has mirrored BTC's movements. ETH encountered bearish momentum below the $1,600 level. A breakthrough above the $1,620 resistance could propel its price toward $1,650, while a failure to clear immediate support may lead to a decline towards the $1,565 level.In an interesting turn of events, Germany's largest lender, Deutsche Bank, announced a collaboration with Swiss startup Taurus to establish digital asset custody and tokenization services, highlighting the growing involvement of traditional financial institutions in the crypto space.On a different note, Nomura, a prominent Japanese investment bank, introduced a Bitcoin-based fund catering to institutional investors. Meanwhile, Grayscale, a notable player in the crypto investment space, has submitted an application to the U.S. SEC for a new Ethereum Futures ETF, further demonstrating the continued evolution of the crypto market and its integration with traditional finance.Coming to the price action, among the top 100 cryptos by market cap, here are the best and worst-performing cryptos over the past week:As per prices on Friday.1. Immutable is up by 32%2. Toncoin is up by 20%3. Aave is up by 16%4. GMX is up by 11%5. Terra Classic is by 8%1. IOTA is down by 10%2. Gala is down by 9%3. Klaytm is down by 8%4. Axie Infinity is down by 6%5. Rocket Pool is down by 6%"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOS8yMy90cmFkZXItc2F5cy1kb2dlY29pbi1yaXZhbC1oYXMtYWRkaXRpb25hbC11cHNpZGUtcG90ZW50aWFsLXVwZGF0ZXMtb3V0bG9vay1vbi1iaXRjb2luLWFuZC13b3JsZGNvaW4v0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA5LzIzL3RyYWRlci1zYXlzLWRvZ2Vjb2luLXJpdmFsLWhhcy1hZGRpdGlvbmFsLXVwc2lkZS1wb3RlbnRpYWwtdXBkYXRlcy1vdXRsb29rLW9uLWJpdGNvaW4tYW5kLXdvcmxkY29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Trader Says Dogecoin Rival Has Additional Upside Potential, Updates Outlook on Bitcoin and Worldcoin - The Daily Hodl",
        "content": "Widely followed pseudonymous trader Altcoin Sherpa says one Dogecoin (DOGE) rival could make a bigger move to the upside.\n\nAltcoin Sherpa tells his 196,400 followers on the social media platform X that after breaking through a key resistance level, memecoin Pepe (PEPE) may not be done rallying.\n\n“PEPE: nice move today, I didn’t really see this one coming. The volume profile shows three significant resistance areas, with the first one getting broken now. I highly doubt this is a full reversal, but a bit more upside may be in store. Would be cautious with this one overall.”\n\nLooking at his chart, the next resistance level appears to be between the price range of $0.00000078 to $0.000000820.\n\nPepe is trading for $0.000000716 at time of writing, up 16.9% in the last 24 hours.\n\nNext, the trader weighs in on Bitcoin (BTC) and says the market remains unclear as key exponential moving averages (EMAs) converge just above the crypto king’s price, acting as resistance.\n\n“BTC one-day thoughts: overall market structure hasn’t changed much IMO (in my opinion). We’re still either forming some sort of weird higher low OR consolidating for the next leg down. The cluster of one-day EMAs all acting as resistance for now, but no clear change.”\n\nThe trader predicts Bitcoin will decline to finish out the year.\n\n“I don’t personally have a super strong opinion in regards to where price goes. Gut says we move up to $28,000 in the mid-term, but I don’t really know. The last recent high established in mid-July was an equal high from before and not truly a higher high IMO.\n\nI think we’re still in an overall chop fest similar to 2019, where we saw a big move up and we’ll see a slow grind down for the rest of 2023. Probably slow grind down IMO and then we have some good times in December/January as always.”\n\nBitcoin is trading for $26,595 at time of writing, up 0.1% in the last 24 hours.\n\nLastly, the trader says he’s keeping an eye on the AI-based altcoin Worldcoin (WLD). According to Altcoin Sherpa, WLD might be in a position to witness a price dip after a brief rally as it now trades close to a key resistance level.\n\n“WLD: Total shitcoin, but I think that this one makes a lower high. I’m in since $1.42ish.”\n\nWorldcoin is trading for $1.62 at time of writing, up 7.5% in the last 24 hours.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmVycy1mb2N1cy1vbi1lZmZpY2llbmN5LXJlbmV3YWJsZS1lbmVyZ3ktYXQtd29ybGQtZGlnaXRhbC1taW5pbmctc3VtbWl00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin miners double down on efficiency and renewable energy at the World Digital Mining Summit - Cointelegraph",
        "content": "Bitmain rolled out its next-generation Antminer S21 and S21 Hydro ASIC miners at the World Digital Mining Summit (WDMS) in Hong Kong on Sept. 22, revealing the crucial performance stats the entire industry has been waiting for. The S21 has a hash rate of 200 terahashes per second (TH/s) and an efficiency of 17.5 joules per terahash (J/T), while the S21 hydro hashes at 335 TH/s and 16 J/T, which is notable given that until recently, most Bitcoin ASICS were operating above the 20 J/T level.\n\nWith electricity costs continuing to rise year-over-year and the Bitcoin halving projected to occur in April 2024, ASIC efficiency is quickly becoming the paramount focus of miners, and many are also pivoting toward folding in renewable energy sources as a core component of their operations.\n\nBitcoin miners focus on efficiency and renewable energy\n\nSustainable development in the mining industry was a core theme discussed in a majority of the panels at the WDMS. In the opening roundtable, team members from Terrawulf, Core Scientific, CleanSpark and Iris Energy shared their perspectives on how further integration of renewable energy sources will become a critical strategy to implement for many miners after the April 2024 Bitcoin supply halving.\n\nBitmain World Digital Mining Summit. Source: Cointelegraph\n\nAccording to Nazar Khan, Terrawulf’s chief operating officer:\n\n“There’s a significant transition going on in the supply side of the generation process; there’s a concerted effort to decarbonize the entire supply stack, and so when we talk about Bitcoin miners consuming more renewable energy, that’s part of a broader theme that’s happening across the United States without Bitcoin mining as well. The role that we play is locating our Bitcoin mining loads in places where that’s happening and how do we facilitate that decarbonization process.“\n\nOne impact of the upcoming supply halving is that miners will maintain the same capital and operational costs, plus the need to pay down any revolving debts, while essentially seeing their block reward distribution cut in half.\n\nFor this reason, miners will either need to increase the percentage of their hash rate derived from sustainable energy sources or make efficiency adjustments to their ASIC fleet to maintain or increase their profitability.\n\nRegarding the rollout of the Antminer S21 and its potential impact on the mining industry, BMC founder Justin Kramer said:\n\n“The S21, if reliable, fairly priced and readily available — and yes, that’s a lot of ifs with Bitmain’s history — could revolutionize the crypto mining landscape with its efficiency. It is basically packing the power of two S19 100T miners into one unit. Despite this, the burgeoning aftermarket firmware market, coupled with hydro/immersion systems, give miners more tools to keep older generation miners, such as the S19, profitable also. Thus, while the S21 represents a notable advancement, it may not render sub 110 TH/s miners entirely obsolete.”\n\nWhen asked about what else caught this eye from the S21 release, Kramer noted that:\n\n“I like that Bitmain is rewarding environmentally friendly mining farms with better pricing and advanced delivery with their new Carbon Neutral Certificate. But, I’ll add that, it was a little surprising when I noticed that both new S21 models offer 33% more hash rate (S21 200T versus 151T on S19j XP; S21 hydro is 335T versus the S19 XP Hydro at 257T). Is this a coincidence? I’m doubtful, and it likely signals more of the same systematic model releases from Bitmain where a slight tweak to the firmware and maybe a few other items that are adjusted results in a moderate increase in hash rate and a brand-new miner.”\n\nBitcoin is en route to becoming an ESG asset\n\nA theme of the past few years has been an increase in Bitcoin miners and BTC advocates pushing back against the assertion that Bitcoin mining is bad for the environment, and that the industry’s reliance on carbon-based energy production accelerates emissions.\n\nCountering this perspective, Hong Kong Sustaintech Foundation professor in accounting and finance, Haitian Lu, bluntly announced that:\n\n“Bitcoin mining is promoting renewable energy adoption in many areas.”\n\nLu explained that “over the years, Bitcoin mining has become more efficient and is also using cleaner energy. History tells us that human development from an agricultural society to industrialization to the future of a digitalized economy goes with every increasing energy consumption per capita. What makes the difference is human’s ability to use renewable energy increases, thus achieving sustainable development.”\n\nLike the perspectives shared by other panelists, Lu said that Bitcoin miners’ participation in demand response agreements with power producers and distributors leads to energy grid efficiency, and they “provide an economic incentive for the development of renewable energy “promotion and development of renewable energy projects.”\n\nIn addition to Bitcoin mining tapping into stranded energy, encouraging the development of renewable energy projects and helping to balance electric grids, the efficiency advancements of next-generation ASICs like the Antminer S21 reduce miners’ energy consumption while also allowing them to boost their profits."
    }
]