[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTI5L2dhbGF4eS1zLW5vdm9ncmF0ei1zZWVzLWJpdGNvaW4tYnRjLXJlYWNoaW5nLW9sZC1oaWdocy13aXRoLWV0Zi1hcHByb3ZhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Will Reach Its Old Highs With ETF Approval, Galaxy's Novogratz Predicts - Bloomberg",
        "content": "Michael Novogratz predicts that Bitcoin is poised to reach its former peak a year from now, as anticipation builds over the likelihood that the US Securities and Exchange Commission will approve the first American exchange-traded fund to directly hold Bitcoin.\n\n“Could we go to old highs by this time next year?” Novogratz, the founder and chief executive officer of Galaxy Digital Holdings Ltd., said during on interview on Bloomberg TV on Wednesday. “Of course.”"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvb25lLWluLWZvdXItYW1lcmljYW5zLW93bi1iaXRjb2luJTNBLXVuY2hhaW5lZC1zdHVkedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "One in Four Americans Own Bitcoin: Unchained Study - Nasdaq",
        "content": "Unchained, a prominent Bitcoin financial services provider, released a new report today showcasing an interesting surge in bitcoin ownership among Americans. According to their findings, a one in four Americans and 55% of surveyed investors, defined by Unchained as those with at least one investment account between the ages of 18 and 78, own bitcoin.\n\nThe study, which surveyed 402 US investors, revealed that 95% of current BTC owners are considering increasing their holdings in 2024. Remarkably, almost half of non-BTC owners expressed a strong inclination towards purchasing bitcoin within the upcoming year.\n\nKey drivers influencing potential BTC purchases in 2024 include increased regulatory clarity around digital assets, with 42% of current BTC owners and 35% of non-owners highlighting this factor. Other influential elements identified were the potential approval of a bitcoin spot Exchange-Traded Fund (ETF) by the Securities and Exchange Commission (SEC) and the anticipation of a US economic recession.\n\nDespite BTC's price being down over 50% from its peak, 79% of investors foresee BTC surpassing its all-time high of $69,000. More optimistically, over half of the surveyed investors (55%) predict a new all-time high for BTC in 2024, with a third believing BTC will outperform cash, gold, and the S&P 500.\n\nUnchained's survey also foresees a significant rise in bitcoin allocation within retirement portfolios. Nearly half of current BTC owners have BTC in their retirement accounts, and an additional 35% are considering adding it in 2024. Among non-BTC owners open to investing in the asset, 23% expressed interest in including BTC in their retirement accounts.\n\n“At Unchained, we are seeing an influx of bitcoin newcomers who now understand that the asset has longevity,” stated Joe Kelly, co-founder and CEO of Unchained. “As reflected in both Unchained’s survey results and the activity of our clients, US investors are eager to gain or expand bitcoin exposure — especially through tax-advantaged vehicles like Unchained’s bitcoin IRA. As more investors look to open or grow their bitcoin positions, Unchained looks forward to serving them whether it be through collaborative custody, the Unchained IRA, our trading desk, or our inheritance solutions.”\n\nWith an estimated 158 million Americans owning investment accounts, Unchained's survey provides valuable insights, representing the US investor population with a 5% margin of error at a 95% confidence level. The survey, conducted digitally from October 26 to 28, 2023, during a period when the price of bitcoin ranged from $33,610 to $34,977, offers a compelling outlook on BTC sentiment and expectations for 2024.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvMS10b3AtY3J5cHRvLXN0b2NrLXRvLWJ1eS1mb3ItYml0Y29pbi1leHBvc3VyZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "1 Top Crypto Stock to Buy for Bitcoin Exposure - Nasdaq",
        "content": "Investing in cryptocurrencies, such as Bitcoin (BTCUSD), has helped investors derive game-changing returns over the past decade. Bitcoin prices have surged 120x in the last eight years, 7x in the last five years, and more than doubled in 2023. Despite these market-thumping returns, Bitcoin is also down 40% from all-time highs, allowing investors to buy the dip.\n\nBitcoin is a decentralized cryptocurrency, which means it is not governed by any regulatory authority such as a central bank. It uses peer-to-peer technology and blockchain technology to record transactions - effectively, a distributed public ledger that can be verified or accessed by anyone. Miners verify and process these transactions and are rewarded with a set amount of BTC, as well as transaction fees.\n\nBitcoin was created 15 years ago, and the first block was mined in January 2009. The total supply of BTC is limited to 21 million, making it deflationary in nature. More than 19 million BTC have already been mined and are in circulation.\n\nInvestors can gain exposure to this alternate asset class by purchasing Bitcoin and other cryptocurrencies on exchanges such as Coinbase (COIN). Further, you can buy shares of Coinbase and other crypto-related stocks to gain exposure to digital assets by proxy.\n\nAnother way is to buy shares of MicroStrategy (MSTR), which acts as a Bitcoin holding company. Let’s see why.\n\nwww.barchart.com\n\nMicroStrategy Goes Big on Bitcoin\n\nValued at $7.34 billion by market cap, MicroStrategy provides enterprise-facing analytics software and services. In Q3 of 2023, MicroStrategy reported revenue of $129.5 million, an increase of 3.3% year over year.\n\nWhile it is involved in the enterprise software segment, the CEO of MicroStrategy, Michael Saylor, is quite bullish on Bitcoin, and has famously allocated significant company resources to purchase BTC over the years. While MSTR has $45 million in cash, it also holds 140,000 Bitcoin worth over $4.4 billion at current prices.\n\nMicroStrategy is among the largest institutional holders of Bitcoin, and first began purchasing the digital asset as a hedge against inflation back in August 2020. In fact, MicroStrategy has also raised debt to fund its BTC purchases, and now owns 0.75% of the total Bitcoin circulating supply.\n\nWill Bitcoin Prices Keep Rising In 2024?\n\nIt's evident that the price of MSTR stock will be tied to the performance of Bitcoin. For instance, BTC prices have risen 129% year-to-date, while MSTR is up 259% in 2023.\n\nThere are two key drivers for BTC in the near term. First is the possible launch of multiple spot Bitcoin ETFs by institutions such as BlackRock (BLK), Invesco (IVZ), and Ark Invest. With trillions of dollars in assets under management, there is a good chance for Bitcoin demand to move higher once the ETFs are approved, possibly within the next six months.\n\nAnother positive catalyst for BTC prices is the upcoming halving event. Every four years, the amount of BTC that can be mined is reduced by 50%, resulting in an extended bull run due to the supply-demand economics.\n\nHere's a look at how Bitcoin has performed over the last three halving cycles.\n\nBitcoin prices surged over 5,000% between November 2011 and November 2013\n\nBitcoin prices again surged by over 5,000% between November 2015 and December 2017\n\nBitcoin prices rose 600% between November 2019 and November 2021\n\nIf you're bullish on Bitcoin, it makes sense to buy MSTR right now. Each of the four analysts tracking MicroStrategy stock has a “strong buy” recommendation. The average price target for MSTR is $516, which is only about 1% higher than the current trading price. However, BTIG sees about 10% upside, and called MSTR the best vehicle for institutional investors to gain BTC exposure in a recent note.\n\nwww.barchart.com\n\nOn the date of publication, Aditya Raghunath did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policy here.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy91bmNoYWluZWQtc3R1ZHktcmV2ZWFscy1vbmUtZm91ci0yMDI4MDAzNzQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Unchained Study Reveals One in Four Americans Own Bitcoin - Yahoo Finance",
        "content": "Unchained study estimates that 86M Americans own bitcoin, 26% of the total population\n\n55% of US investors surveyed by Unchained report owning bitcoin\n\nNew regulation, bitcoin spot ETF approval, and a US recession are the factors most likely to make US investors buy BTC next year\n\nOne-third of US investors expect bitcoin to outperform gold, cash, and the S&P 500 in 2024\n\nAUSTIN, Texas, November 29, 2023--(BUSINESS WIRE)--Unchained, the leading bitcoin financial services provider, today published a report with findings from a survey of US investors on bitcoin (BTC) sentiment and outlook for 2024. Chief among the findings is that one in four Americans and 55% of investors surveyed by unchained — defined by Unchained as having at least one investment account — report owning bitcoin, and 95% of this group say they would buy or strongly consider buying more of it in 2024. Of the 45% of respondents who do not own bitcoin, nearly half say they would strongly consider buying it in 2024.\n\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20231129165815/en/\n\n55% of US investors surveyed by Unchained report owning bitcoin. Nearly all (95%) of this group say they'd consider buying more BTC in 2024. (Graphic: Business Wire)\n\nRegulation is poised to be the top catalyst for both bitcoin owners and non-owners in the year ahead. When asked which factor is most likely to make them buy or strongly consider buying bitcoin in 2024, 42% of BTC owners and 35% of non-owners said increased US regulatory clarity around digital assets. Other popular factors include:\n\nSEC approval of a bitcoin spot ETF — 29% of BTC owners; 13% of non-owners\n\nUS economic recession — 18% of BTC owners; 12% of non-owners\n\nGuidance from a financial advisor — 6% of BTC owners; 26% of non-owners\n\nNotably, US investors are largely optimistic about bitcoin’s future performance, regardless of whether they own the asset. Most (79%) expect BTC to eventually pass its all-time high of $69,000, despite the asset’s price being down over 50%1 from this during the survey. Over half (55%) of investors predict BTC will reach a new all-time high in 2024, with 28% believing it will be H1 and 26% saying H2 2024. Further, one-third of investors (34%) think BTC will outperform cash, gold, and the S&P 500 in 2024.\n\nStory continues\n\nThe next year is likely to see a rise of bitcoin allocation in retirement portfolios, according to Unchained’s survey results. While nearly half of US bitcoin owners report already having BTC in their retirement account, an additional third (35%) say they would consider adding it to their 401(k), IRA, or other plan in 2024. Among non-bitcoin owners who are open to investing in the asset, 23% say they would consider adding BTC to their retirement account next year.\n\n\"At Unchained, we are seeing an influx of bitcoin newcomers who now understand that the asset has longevity,\" said Joe Kelly, co-founder and CEO of Unchained. \"As reflected in both Unchained’s survey results and the activity of our clients, US investors are eager to gain or expand bitcoin exposure — especially through tax-advantaged vehicles like Unchained’s bitcoin IRA. As more investors look to open or grow their bitcoin positions, Unchained looks forward to serving them whether it be through collaborative custody, the Unchained IRA, our trading desk, or our inheritance solutions.\"\n\nWith an estimated 158 million Americans owning some type of investment account2, Unchained’s \"US Investor Outlook for BTC in 2024\" survey sample size of 402 individuals is representative of the US investor population with a 5% margin of error at a 95% confidence level. To qualify for this survey, respondents were required to be permanent residents of the US between the ages of 18 and 78 and self-report as having one or more current financial investment(s). The survey was conducted digitally from October 26 to 28, 2023, during which time the price of bitcoin ranged from $33,610 to $34,9771.\n\nRead the full report on Unchained’s survey of US investor bitcoin sentiment and outlook for 2024 here.\n\nFor more information on Unchained, please visit www.unchained.com.\n\nAbout Unchained\n\nFounded in 2016, Unchained is a top 10 bitcoin platform by assets secured and has helped thousands of individuals and businesses truly own their wealth by holding bitcoin keys. Unchained's collaborative custody model allows clients to access financial services while continuing to have the benefits of self-custody, the ultimate consumer protection in these uncertain times. For more information on Unchained, please visit www.unchained.com.\n\nThese survey results do not represent the opinions or advice of Unchained Capital, Inc. or its affiliates (collectively \"Unchained\"), any employees of Unchained, or of any qualified investment advisor. Survey respondents were not qualified investment advisors. No representations are made that any survey methods are accurate or correspond with relevant industry practice. Do not make financial decisions based upon the results of this survey, and instead consult with a qualified investment advisor of your choice.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20231129165815/en/\n\nContacts\n\nLarissa Bundziak\n\nlarissa@unchained.com"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1idGMtY2FuLWhlYWQtaGlnaGVyLWluLTIwMjQuLWhlcmVzLXdoedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Can Head Higher in 2024. Here's Why - Nasdaq",
        "content": "What a difference a year can make. Last year, Bitcoin (BTC-USD) lost nearly two-thirds of its value, and skeptics were ready to leave it for dead. This year, Bitcoin has come roaring back with a torrid gain of 128% in 2023. While 2023 has been a momentous year for the largest cryptocurrency by market cap, it can head even higher next year based on two potential catalysts that could both occur in early 2024: its upcoming halving and the potential for the approval of a spot Bitcoin ETF. I'm bullish on BTC.\n\nGet Ready for The Halving\n\nBitcoin’s next halving event is expected to occur in April 2024. What does the halving entail?\n\nHalvings are scheduled events that take place every four years, in which the reward for mining a new block of Bitcoin is cut in half. Right now, Bitcoin miners receive a reward of 6.25 new Bitcoins for each block that they mine. After the halving, this reward will be reduced to 3.125 BTC.\n\nThere are only 21 million Bitcoins that will ever exist, and this fixed supply is one of Bitcoin's primary selling points. Unlike fiat currencies, which governments and central banks can always print more of, Bitcoin is a finite resource. The halving helps to curb Bitcoin’s inflation rate and ensures that Bitcoin becomes increasingly scarce over time, which should theoretically increase its value over time.\n\nTo be clear, nothing is guaranteed, but past halvings have typically ushered in significant bull markets for Bitcoin. During the first Bitcoin halving in 2012, the block reward decreased from 50 BTC to 25 BTC, and the price of Bitcoin increased from about $12 before the halving to over $960 one year later.\n\nDuring the second Bitcoin halving in 2016, the reward decreased from 25 BTC to 12.5 BTC, and the price of Bitcoin nearly quadrupled one year later, from $663 to about $2,500.\n\nLastly, during the most recent halving, which occurred in 2020, the block reward decreased from 12.5 BTC to 6.25 BTC, and the price of Bitcoin went parabolic, rising from about $8,500 before the halving to an all-time high of around $69,000 in November of 2021.\n\nThe price of Bitcoin came down considerably from this all-time high, and past results are no guarantee of future results. However, this illustrates the effect that past halvings have had on the price of Bitcoin. Based on these results, it’s easy to see why crypto market participants are enthusiastic about the next halving.\n\nImpact of a Potential Spot Bitcoin ETF Approval\n\nIt’s not just the halving that could serve as a catalyst for Bitcoin in 2024. Some market observers believe that the approval of a spot Bitcoin ETF by the SEC is becoming increasingly likely and that it will come in early 2024.\n\nBlackRock (NYSE:BLK) kicked off the excitement this summer with its spot Bitcoin ETF filing and was soon followed by a mix of traditional finance giants like Fidelity and Invesco (NYSE:IVZ), tech-centric ARK Invest, and Grayscale Bitcoin Trust (OTC:GBTC), which is seeking to convert its trust into an ETF. Bloomberg ETF analysts Eric Balchunas and James Seyffart have forecasted a 90% likelihood that a spot Bitcoin ETF will be approved for trading by January 2024.\n\nBalchunas has noted that ARK Invest, BlackRock, and others are updating their S1 filings, which could be a good sign, as it means that these issuers are getting their applications in shape for approval. Balchunas and other observers have also noted that BlackRock and others have been meeting with the SEC to hash out details and that this dialogue is another good sign.\n\nIt should be pointed out that this is all speculation at this point, but the developments do seem encouraging.\n\nTo be clear, speculation and excitement about the possibility of such an ETF has already driven the price of Bitcoin higher in 2024. The current Bitcoin rally really kicked into overdrive this summer after news of BlackRock's filing broke.\n\nWhile this could potentially make an approval a \"buy the rumor, sell the news\" event in the short term, over the long term, a spot Bitcoin ETF would usher in a new era for Bitcoin.\n\nMillions of U.S. investors would be able to gain direct exposure to Bitcoin through their brokerage or retirement accounts for the first time, making the process of gaining Bitcoin exposure as simple as buying a stock or an ETF.\n\nThis would open up access to Bitcoin to investors who are interested in it or bullish on its long-term potential but who don’t want to manage their own Bitcoin wallet or open up a dedicated crypto brokerage account with Coinbase (NASDAQ:COIN) or another provider. These ETFs could also bring more institutional investors into Bitcoin.\n\nFurthermore, ETFs from recognizable and trusted blue-chip names in the traditional finance world, like BlackRock, Fidelity, and others who have filed, would make many investors feel more comfortable with Bitcoin and boost its credibility with mainstream, non-crypto investors.\n\nLooking Ahead to 2024\n\nBitcoin has had an epic run in 2023, but 2024 could see it add to these gains based on two major potential catalysts: the Bitcoin halving, which has historically led to bullish price action for Bitcoin, and the possibility of the launch of a spot Bitcoin ETF, which would potentially open Bitcoin up to a whole new pool of investors and bring it even further into the mainstream.\n\nBitcoin and other cryptocurrencies can be risky and volatile investments, so they are not for the faint of heart. I own Bitcoin and am bullish on it. For long-term, risk-tolerant investors, I like the idea of adding some diversification to portfolios by adding some Bitcoin ahead of these events.\n\nDisclosure\n\n\n\n\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]