[
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTE3L2NyeXB0by1zLWRlcmliaXQtdG8tb2ZmZXItZnV0dXJlcy1mb3ItYml0Y29pbi12b2xhdGlsaXR5LXRyYWRpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Crypto's Deribit to Offer Futures for Bitcoin Volatility Trading - Bloomberg",
        "content": "Deribit, the largest Bitcoin and Ether options exchange, plans to launch futures contracts to facilitate Bitcoin volatility trading.\n\nThe BTC DVOL futures will be built on the Deribit Bitcoin Volatility Index, a measure of implied volatility in the market for the biggest digital asset, the company said in a statement earlier this week."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTE3L2JpdGNvaW4tYnRjLWJlbGlldmVycy1yZXZlbC1pbi10b2xkLXlvdS1zby1tb21lbnQtYmlnLXJhbGx5LWFzLWJhbmtzLWNydW1ibGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Believers Revel in Told-You-So Moment, Big Rally as Banks Crumble - Bloomberg",
        "content": "As members of the media lingered near the entrance of the headquarters of Silicon Valley Bank this week, a Bitcoin true believer seized on an opportunity.\n\nHe drove a Budget moving van directly in front of the building’s entrance, so all could see the message plastered on the side: “BE YOUR OWN BANK,” it read, between a doctored image of Federal Reserve Chair Jerome Powell holding a “Buy Bitcoin” sign and the orange logo for the original cryptocurrency. A video of the made-for-social-media stunt, set to Pink Floyd’s “Money” as soundtrack, was tweeted by an account with the handle @cryptograffiti, with text that said “btc>svb.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDMvMTcvY3J5cHRvLXJhbGxpZXMtYml0Y29pbi1oZWFkcy1mb3ItaXRzLWJlc3Qtd2Vlay1zaW5jZS1qYW51YXJ5LTIwMjEuaHRtbNIBamh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzAzLzE3L2NyeXB0by1yYWxsaWVzLWJpdGNvaW4taGVhZHMtZm9yLWl0cy1iZXN0LXdlZWstc2luY2UtamFudWFyeS0yMDIxLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Crypto rallies into weekend, bitcoin posts its best week since early 2021 - CNBC",
        "content": "Cryptocurrencies resumed their rally on Friday, climbing above the $26,000 for the second time this week.\n\nBitcoin ended higher by 7.46% at $26,868.39, according to Coin Metrics. It posted a weekly gain of 34.13%, and its best week since January 2021, which was right before the first bull run that year.\n\nEther rose 3.87% to $1,745.57. For the week, it ended up 22.88%, its best weekly gain since August 2021.\n\nPrices climbed even as stocks fell Friday, as traders digested the future of Credit Suisse. The bank's fate continued to weigh on investors even after the embattled lender said it will borrow up to 50 billion Swiss francs ($54 billion) from the Swiss National Bank.\n\n\"Bitcoin is highly sensitive to liquidity and the liquidity outlook has improved,\" said Dessislava Aubert, an analyst at crypto data provider Kaiko. \"Data showed yesterday that the Fed's assets have risen by roughly $300 billion... While the new BTFP facility is not a direct QE, the Fed is essentially injecting liquidity into the banking system, lending more than the collateral pledged is worth in market terms.\"\n\n\"China is also adding liquidity by lowering its reserve ratio for banks,\" she added. \"So essentially it's a sentiment driven move.\""
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzgwYjEzMTA4LWMzYTYtNDljOC04YjY4LTc5ZTNlZmU5ZjY4ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin hits nine-month high as traders shift away from banks - Financial Times",
        "content": "Print this page\n\nRoula Khalaf, Editor of the FT, selects her favourite stories in this weekly newsletter.\n\nBitcoin hit its highest level in nine months on Friday as crypto traders shifted funds away from banks and warmed to rapidly shifting interest rate expectations.\n\nThe dollar-denominated price of the original and biggest crypto coin has surged more than 30 per cent this week to more than $27,000, its highest point since the onset of the crisis of confidence that engulfed the market last summer. The second-largest token, ether, has risen a fifth in the same period.\n\nBuyers have emerged after a week of acute turbulence for the world’s banking industry on both sides of the Atlantic as investors fret over the valuations of smaller banks’ bond portfolios and business models.\n\nThe US government and large banks stepped in to steady the system while the Swiss central bank provided a $54bn emergency backstop for lender Credit Suisse. The uncertainty has prompted speculation that the Federal Reserve and European Central Bank will pause their plans to raise interest rates aggressively to curb lingering inflation.\n\nFor the past 18 months the price of bitcoin, once touted as a hedge against inflation, has often been correlated with traditional stock indices such as the S&P 500 and the Nasdaq Composite, and sensitive to traders’ expectations on interest rates.\n\nTraders point out that when investors have fears over crypto prices, they move funds into bank deposits and stablecoins. When there are concerns over banks, they rapidly move to purchasing tokens.\n\n“Fears over the stability of the banking system, along with declining real interest rates, creates a good environment for bitcoin to rebound because it is seen by some investors as a hedge against systemic risks,” said Ilan Solot, co-head of digital assets at London broker Marex.\n\nThe market recovery has also been bolstered after reassurances from US authorities that deposits at the failed Silicon Valley Bank would be protected.\n\nCircle, operator of the crypto market’s second largest stablecoin USDC, admitted it had $3.3bn trapped at SVB, triggering a temporary decline in the value of the stablecoin to 88 cents.\n\nStablecoins act as a conduit between crypto and sovereign money and are supposed to maintain their value one-for-one against the dollar at all times.\n\nDespite a short-term recovery for digital assets, turbulence in the banking sector casts doubt over the crypto industry’s long-term footprint in the US.\n\nTogether with Silvergate and Signature, SVB was one of a tripartite of crypto-friendly banks that met their demise in recent days. Their failures have sparked fears among industry supporters that the US is de-banking the crypto industry.\n\nRepublican congressman Tom Emmer on Wednesday wrote a letter to the Federal Deposit Insurance Corporation, arguing that the regulator was purposely seeking to limit the banking industry’s exposure to crypto markets.\n\n“A lot of people already understand the industry is rotating away from the United States, so in many ways, America’s crypto clampdown has been priced in by the market,” Solot said."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvd2h5LWJpdGNvaW4tbWluZXItc3RvY2tzLXNvYXJlZC10aGlzLXdlZWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 17 Mar 2023 07:00:00 GMT",
        "title": "Why Bitcoin Miner Stocks Soared This Week - Nasdaq",
        "content": "What happened\n\nCryptocurrencies soared this week. According to data from S&P Global Market Intelligence, Bitcoin (CRYPTO: BTC) led the way, with a 22.2% price gain from the stock market's closing bell last Friday to the same time this Thursday.\n\nOver the same period, that price surge powered an even stronger updraft under the stocks of leading Bitcoin mining specialists:\n\nSo what\n\nBitcoin and friends saw a couple of distinct jumps in the last week.\n\nFirst, several banks with close ties to the crypto sector were shut down by Californian regulators late last week; this was followed by a federal promise to allow customers to access any funds they had deposited in the failing banks. The Federal Reserve's guarantee of billions of dollars that help power the trading systems behind Bitcoin and other cryptocurrencies resulted in a price surge over the weekend.\n\nThen, traders put their thinking caps on and started pondering what the bank closures might mean for the American economy at large. By Tuesday morning, many investors agreed that the Federal Reserve's inflation-fighting interest rate hikes had gone too far. Therefore, what at first looked like a threat to the entire crypto market should actually inspire the central bank to lighten up its anti-inflation measures, and let banks breathe more freely with lower interest rates on federal funds. That's seen as a positive development for Bitcoin, ahead of next week's scheduled rate-setting conference.\n\nAnd as Bitcoin goes, so do the miners -- though their stock-price moves tend to amplify whatever the cryptocurrency's chart is doing. These miners are not just holding a bunch of Bitcoin on their balance sheets; they also strive to make and buy more of the digital currency over time. This strategy adds to their value when Bitcoin prices are rising, but also increases the risk involved in running their businesses.\n\nBitcoin mining rigs are not cheap, and they draw an incredible amount of electric power. Marathon Digital Holdings (NASDAQ: MARA), Hut 8 Mining (NASDAQ: HUT), and Riot Platforms (NASDAQ: RIOT) run their business operations with bottom-line margins deep in red-ink territory, keeping the lights on by taking on debt and selling more stock on the open market.\n\nSo these companies rely on Bitcoin gaining value in the long run, while also building out their crypto-mining rigs as fast as they dare. But a few management missteps or a too-harsh crypto winter could puncture the whole business model, leaving shareholders penniless.\n\nThat combination of long-term financial gains above and beyond Bitcoin's price development, plus the constant threat of financial collapse, adds up to massive volatility. So the miners outperformed Bitcoin in this week's surge, and they're doing great in 2023 overall. Bitcoin's price is up 51% year to date, while all three of the miners above more than doubled in value.\n\nNow what\n\nThe pricing trends play out on longer time scales, too. For example, Bitcoin is down by 36% in 52 weeks, but the Bitcoin miners have taken haircuts ranging from 57% to 69% over the same span. On a chart of the last year, the deep price drops and giant leaps of recent weeks are just another little divot in the larger trend line:\n\nIt's always fun to see your stocks and cryptocurrencies do well, but you also need to keep those inflated risks in mind. It may sound strange, but buying Bitcoin directly is a much safer and more conservative option than investing in any of the miner stocks. Be careful out there, dear investor.\n\n10 stocks we like better than Marathon Digital\n\nWhen our award-winning analyst team has a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, Motley Fool Stock Advisor, has tripled the market.*\n\nThey just revealed what they believe are the ten best stocks for investors to buy right now... and Marathon Digital wasn't one of them! That's right -- they think these 10 stocks are even better buys.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of March 8, 2023\n\nAnders Bylund has positions in Bitcoin. The Motley Fool has positions in and recommends Bitcoin. The Motley Fool has a disclosure policy.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]