[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTExL3NlYy1kZWxheXMtbWFraW5nLWEtZGVjaXNpb24tb24tYXJrLTIxc2hhcmVzLWJpdGNvaW4tZXRmLWZpbGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "ARK 21Shares Bitcoin ETF Decision Delayed by US SEC - Bloomberg",
        "content": "The US Securities and Exchange Commission has not yet come to a decision on whether to approve the ARK 21Shares Bitcoin ETF application, delivering another delay for the long-awaited product.\n\nThe issuer had originally filed in April and regulators had until Aug. 13 to say whether they would approve, reject or delay on coming to a decision."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTExL3NlYy1kZWxheXMtbWFraW5nLWEtZGVjaXNpb24tb24tYXJrLTIxc2hhcmVzLWJpdGNvaW4tZXRmLWZpbGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "ARK 21Shares Bitcoin ETF Decision Delayed by US SEC - Bloomberg",
        "content": "The US Securities and Exchange Commission has not yet come to a decision on whether to approve the ARK 21Shares Bitcoin ETF application, delivering another delay for the long-awaited product.\n\nThe issuer had originally filed in April and regulators had until Aug. 13 to say whether they would approve, reject or delay on coming to a decision."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDgvMTEvc2VjLWRlbGF5cy1kZWNpc2lvbi1vbi1iaXRjb2luLWV0Zi1mcm9tLWNhdGhpZS13b29kcy1hcmstaW52ZXN0Lmh0bWzSAWhodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wOC8xMS9zZWMtZGVsYXlzLWRlY2lzaW9uLW9uLWJpdGNvaW4tZXRmLWZyb20tY2F0aGllLXdvb2RzLWFyay1pbnZlc3QuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "SEC delays decision on bitcoin ETF from Cathie Wood's Ark Invest - CNBC",
        "content": "SEC Chair Gary Gensler participates in a meeting of the Financial Stability Oversight Council at the U.S. Treasury in Washington, D.C., July 28, 2023.\n\nThe U.S. Securities and Exchange Commission has delayed a decision on the Ark 21Shares Bitcoin ETF, the latest roadblock in a years-long fight to trade crypto assets directly on traditional U.S. financial exchanges.\n\nThe deadline for the SEC to make some sort of decision on the fund was Aug. 13. The regulator said in a filing Friday that it is seeking public comment on one of the amendments in the application for the exchange-traded fund, effectively pushing out the date a decision is needed for approval. The process may now stretch into 2024.\n\nThe Ark 21Shares fund is seen as the first in line for a potential bitcoin ETF launch, though the SEC could choose to approve many funds at roughly the same time if it does decide to allow them. Ark Invest CEO Cathie Wood told Bloomberg News earlier this week that she expected the SEC to make a decision on multiple funds at once.\n\nApplications from other major organizations, including BlackRock and WisdomTree, have already been filed. Crypto investment firm Grayscale is still awaiting a court decision after the SEC repeatedly rejected its proposal to convert the Grayscale Bitcoin Trust into an ETF.\n\nThe Cboe BZX exchange filed with the SEC for a rule change in April that would allow the listing of the Ark21 spot bitcoin fund. The filing has since been amended several times and now includes a surveillance-sharing provision that was introduced in BlackRock's filing for a bitcoin fund.\n\nThe SEC has rejected dozens of prior applications to create a spot bitcoin ETF, and SEC Chair Gary Gensler appeared to be leading a crackdown against the crypto industry earlier this year.\n\nBut there are signs that momentum is shifting toward the crypto industry, including a partial legal victory for Ripple that cast doubt on the SEC's efforts to classify most crypto assets as securities.\n\nThe SEC has already allowed the launch of several bitcoin futures ETFs.\n\nThe price of bitcoin was little changed Friday, trading above $29,000.\n\n\n\n\n\n\n\n"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDgvMTEvc2VjLWRlbGF5cy1kZWNpc2lvbi1vbi1iaXRjb2luLWV0Zi1mcm9tLWNhdGhpZS13b29kcy1hcmstaW52ZXN0Lmh0bWzSAWhodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wOC8xMS9zZWMtZGVsYXlzLWRlY2lzaW9uLW9uLWJpdGNvaW4tZXRmLWZyb20tY2F0aGllLXdvb2RzLWFyay1pbnZlc3QuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "SEC delays decision on bitcoin ETF from Cathie Wood's Ark Invest - CNBC",
        "content": "SEC Chair Gary Gensler participates in a meeting of the Financial Stability Oversight Council at the U.S. Treasury in Washington, D.C., July 28, 2023.\n\nThe U.S. Securities and Exchange Commission has delayed a decision on the Ark 21Shares Bitcoin ETF, the latest roadblock in a years-long fight to trade crypto assets directly on traditional U.S. financial exchanges.\n\nThe deadline for the SEC to make some sort of decision on the fund was Aug. 13. The regulator said in a filing Friday that it is seeking public comment on one of the amendments in the application for the exchange-traded fund, effectively pushing out the date a decision is needed for approval. The process may now stretch into 2024.\n\nThe Ark 21Shares fund is seen as the first in line for a potential bitcoin ETF launch, though the SEC could choose to approve many funds at roughly the same time if it does decide to allow them. Ark Invest CEO Cathie Wood told Bloomberg News earlier this week that she expected the SEC to make a decision on multiple funds at once.\n\nApplications from other major organizations, including BlackRock and WisdomTree, have already been filed. Crypto investment firm Grayscale is still awaiting a court decision after the SEC repeatedly rejected its proposal to convert the Grayscale Bitcoin Trust into an ETF.\n\nThe Cboe BZX exchange filed with the SEC for a rule change in April that would allow the listing of the Ark21 spot bitcoin fund. The filing has since been amended several times and now includes a surveillance-sharing provision that was introduced in BlackRock's filing for a bitcoin fund.\n\nThe SEC has rejected dozens of prior applications to create a spot bitcoin ETF, and SEC Chair Gary Gensler appeared to be leading a crackdown against the crypto industry earlier this year.\n\nBut there are signs that momentum is shifting toward the crypto industry, including a partial legal victory for Ripple that cast doubt on the SEC's efforts to classify most crypto assets as securities.\n\nThe SEC has already allowed the launch of several bitcoin futures ETFs.\n\nThe price of bitcoin was little changed Friday, trading above $29,000.\n\n\n\n\n\n\n\n"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vc2VjLWRlbGF5cy1kZWNpc2lvbi1hcmstaW52ZXN0LWJpdGNvaW4tZXRmLTc2NDI1MznSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 11 Aug 2023 07:00:00 GMT",
        "title": "SEC Delays Decision on ARK Invest's Bitcoin ETF To Gather More Public Comments - Investopedia",
        "content": "The U.S. Securities and Exchange Commission (SEC), sought comments on a rule change that will allow it to decide the fate of spot Bitcoin (BTCUSD) exchange-traded funds (ETFs), effectively delaying the call on approving Ark Invest's Ark21Shares Bitcoin ETF.\n\nKey Takeaways The SEC has delayed a decision on the Ark21 Shares Bitcoin ETF, as the regulatory agency gathers more public comments regarding one of the amendments in the application.\n\nThis delay could push a decision on the Bitcoin spot ETF into 2024.\n\nWhile a number of bitcoin ETFs based around futures products already exist, a large number of spot-based bitcoin ETF applications were recently submitted following a new proposal from BlackRock.\n\nThe SEC's Decision to Delay\n\nThe SEC has invited public comments on the Ark21 Shares Bitcoin ETF proposal, a joint project from ARK Invest and 21 Shares. Specifically, the SEC would like interested parties to share their views on whether a spot bitcoin ETF may be susceptible to manipulation and whether the levels of liquidity and transparency in the bitcoin market are sufficient to avoid potential manipulation.\n\nThe SEC's original deadline for a decision on the spot bitcoin ETF application was August 13. Now, a final decision may get kicked into 2024. The SEC has previously rejected several spot Bitcoin ETF applications; however, several bitcoin ETFs based on futures contracts already exist.\n\n\n\nThe Ark21Shares Bitcoin ETF would track the performance of bitcoin as measured by the S&P Bitcoin Index, which uses data from several crypto exchanges. The fund would hold bitcoin directly and be listed on the Cboe BZX Exchange.\n\nEarlier this month, ARK Invest CEO Cathie Wood predicted that her firm and 21 Shares's proposal would be delayed by the SEC in an interview with Bloomberg. Additionally, Wood predicted several spot bitcoin ETFs would eventually be approved simultaneously.\n\nAll Eyes on Blackrock's Bitcoin ETF Application\n\nA slew of spot bitcoin ETF proposals were made in June after Blackrock (BLK) entered the fray for the first time with their proposal. Many market commentators saw BlackRock's entry into the spot bitcoin ETF market as a sign that approval from the SEC could be around the corner due to their pivotal role in the U.S. financial system.\n\nEarlier this week, Galaxy Digital CEO Mike Novogratz claimed his contacts at BlackRock indicated they expected approval on their spot bitcoin ETF proposal within six months.\n\nWhile the SEC has taken a more critical approach to the crypto industry this year, bitcoin has mostly remained immune to the crackdown, as it is the only crypto asset that current chair Gary Gensler has clearly stated is not a security."
    }
]