[
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2JpdGNvaW4tbmVhci0xMy1tb250aC1oaWdoLWFzLWludmVzdG9ycy13ZWxjb21lLXJpcHBsZS1ydWxpbmcvYXJ0aWNsZXNob3cvMTAxNzYzNTk0LmNtc9IBhwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2JpdGNvaW4tbmVhci0xMy1tb250aC1oaWdoLWFzLWludmVzdG9ycy13ZWxjb21lLXJpcHBsZS1ydWxpbmcvYW1wX2FydGljbGVzaG93LzEwMTc2MzU5NC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin near 13-month high as investors welcome Ripple ruling - The Economic Times",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTQtanVseS0yMDIzL2FydGljbGVzaG93LzEwMTc1NjEwNC5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTE0LWp1bHktMjAyMy9hbXBfYXJ0aWNsZXNob3cvMTAxNzU2MTA0LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin surges above $31,000; XRP skyrockets over 68% on court ruling - The Economic Times",
        "content": "(What's moving Sensex and Nifty Track latest market news stock tips and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nDownload The Economic Times News App to get Daily Market Updates & Live Business News.\n\nSubscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXR1bWJsZXMtYmVsb3ctMzBrLWNyeXB0by0xODU2MjM1OTAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Tumbles Below $30K, Crypto Prices Buckle After Altcoin Frenzy on XRP Ruling - Yahoo Finance",
        "content": "Cryptocurrency prices cooled off Friday afternoon after Thursday's major rally on the apparent court victory for Ripple Labs and its XRP token.\n\nBitcoin (BTC), the largest cryptocurrency by market capitalization, fell below $30,000, down more than 5% from a high of about $31,800 at one point on Thursday.\n\nEther (ETH) also sagged from its rousing Thursday to change hands at $1,900, a 4% decline. The second largest crypto in market value had previously soared past $2,000 to hit a three-month high.\n\nXRP was trading at about $0.69, or down 25% from a peak of $0.93 hit yesterday. The token briefly toppled Binance’s BNB as the fourth largest cryptocurrency by market cap, but slipped back to fifth in the ranking after today's price drop.\n\nOther major altcoins were mostly lower, including ADA and MATIC – the tokens of smart contracts platforms Cardano and Polygon, respectively – each off more than 5% Friday afternoon, though still higher over the last two days. The CoinDesk Market Index, a measure of crypto markets performance, was down about 4% over the past 24 hours.\n\n“[Bitcoin is] still trading like an instrument in consolidation,” wrote Craig Erlam, senior market analyst for foreign exchange market maker Oanda, in an email to CoinDesk. The break above $31,000, he said, doesn't seem \"particularly convincing at this stage.\"\n\nThe sudden drop in prices caught traders who bet on higher prices off-guard, with $155 million of long positions liquidated, according to CoinGlass data. This was the largest long liquidation in a month.\n\nUPDATE (Jul. 14, 19:20 UTC): Updated prices through the story. Added liquidation data."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2lucy1jcnlwdG8tbWFya2V0LWRvbWluYW5jZS1zbGlkZXMtMTA0ODE5NTM2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin's Crypto Market Dominance Slides by Most in 13 Months as XRP Court Ruling Spurs 'Alt Season' Talk - Yahoo Finance",
        "content": "Bitcoin's (BTC) share of the total crypto market, known as its dominance, tanked Thursday after a U.S. court complicated the Securities and Exchange Commission's (SEC) plan to regulate digital assets and spurred hopes for a sustained outperformance of alternative cryptocurrencies, often called the \"alt season.\"\n\nIn a highly anticipated ruling in the SEC's case against Ripple Labs for violating securities law through XRP sales, the District Court for the Southern District of New York ruled that XRP is not a security when offered to individuals through centralized exchanges, but is one when sold directly to institutions.\n\nThe distinction in the ruling essentially threw a spanner in SEC's plan to paint all altcoins with the same brush and subject them to stringent oversight by categorizing them as securities.\n\nBitcoin's dominance rate fell 2.6% to 50.14% after the court ruling, the biggest one-day decline since June 13, 2022, according to data from charting platform TradingView. Altcoins like XRP, SOL, MATIC and ADA chalked out double-digit gains, outshining bitcoin by a big margin.\n\nSome observers foresee potential for a continue outperformance of altcoins over the near term.\n\n\"Alt season may be upon us following the Ripple news as indicators collectively suggest risk appetite is funneling down the risk continuum,\" Decentral Park Capital said in a market update published Thursday. \"With the U.S. dollar breaking down and the inflation battle nearing the end, it appears to be game on for investors.\"\n\nIn contrast, Noelle Acheson, author of the Crypto Is Macro Now newsletter, said the ruling could help Coinbase in its legal tussle with the SEC, but cautioned against predicting an outsized altcoin rally.\n\nEarly last month, the SEC charged cryptocurrency exchange Coinbase and its offshore rival Binance for offering unregistered securities, a move that injected uncertainty into the market.\n\n\"The ruling should be enough to reawaken greater interest in the shifting market narrative, which itself could be enough to bring in new flows,\" Acheson told CoinDesk.\n\nStory continues\n\n\"However, it's premature to assume that a 'win' is in the bag – the SEC will likely appeal the decision, and given some of the inconsistencies, it might win. At best, the uncertainty will drag on for longer. So, it feels too soon for alt season; that will probably wait until we get greater clarity on the Coinbase case,\" Acheson said.\n\nIn a note to clients on Friday, analysts at K33 Research voiced a similar opinion, saying, \"the ruling will be appealed and might even be reversed, so we expect the ongoing battle to continue.\"\n\nThe court also found Ripple violated securities law when selling XRP directly to institutions. So institutions that bought XRP can come under the regulatory scanner, injecting further uncertainty into the market.\n\n\"It is important to note that institutional investors who purchased directly from Ripple may find themselves subject to class-action litigation as potential underwriters. This is an area to watch closely, especially if big-name venture capitalists were involved,\" CoinShares’ head of product, Townsend Lansing, said. \"The legal landscape continues to change, and we urge all parties to stay informed of these important developments.\""
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy94cnAtbGVhZHMtZ2FpbnMtdG9wLTEwLTEwMTQ1MDMyMi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "XRP leads gains as Bitcoin, top 10 cryptos rally after Ripple's win against U.S. SEC - Yahoo Finance",
        "content": "Bitcoin and all other top 10 non-stablecoin cryptocurrencies gained in Friday afternoon trading in Asia. The gains come after Ripple Labs achieved a partial victory on Thursday when a U.S. court ruled that Ripple Labs’ programmatic sales of the XRP cryptocurrency did not qualify as the offer and sale of investment contracts. The U.S. Securities and Exchange Commission (SEC) in 2020 accused Ripple of offering XRP as an unregistered security. The judgment marks a significant milestone in the three-year legal tussle between the San Francisco-based payments firm and the U.S. regulator. XRP rallied over 62% in the past 24 hours.\n\nSee related article: What is XRP and what is Ripple?\n\nXRP leads crypto market rally\n\nBitcoin, the world’s largest cryptocurrency by market capitalization, gained 2.46% to US$31,115 in 24 hours to 4 p.m. in Hong Kong, and increased 3.69% on the week, according to CoinMarketCap data. Ether strengthened 6.46% to US$1,991 and rose 7.26% in the last seven days.\n\nBoosted by the ruling on the SEC-Ripple case, XRP led a rally in the crypto market on Friday, rising 62.71% to US$0.7674 and bringing its weekly gains to 65.47%.\n\nIn a summary judgment on Thursday, New York Southern District Court Judge Analisa Torres ruled that Ripple’s programmatic sales of the XRP token on public exchanges do not constitute securities, but the verdict also said that Ripple’s XRP sales to institutional investors violated securities laws.\n\nThe SEC first sued the San Francisco-based financial technology firm in 2020 on the grounds that XRP constituted a security.\n\nRipple’s chief legal officer Stuart Alderoty called the judgment “a huge win” in a tweet on Friday. “The only thing the Court found constitutes an investment contract is past direct XRP sales to institutional clients. There will be further court proceedings only on these institutional sales per the Court’s order,” Alderoty said.\n\nMaybe we can now start a rational conversation about crypto regulation in this country. — Stuart Alderoty (@s_alderoty) July 13, 2023\n\nCoinbase, the largest crypto exchange in the U.S., said in a tweet that it is reopening trading of XRP. Other crypto exchanges like Crypto.com also tweeted that it is enabling XRP trading, while Kraken Pro said on Twitter that XRP is “back in full-trading mode” on its platform.\n\nStory continues\n\n“This can be considered a win because XRP is one of the more centralized foundations, with a prominent figurehead who offered standard sales via exchanges, and formal distribution programs. If XRP is not considered a security, nearly nothing sold via exchanges is,” Vincent Chok, CEO of Hong Kong-based consultancy First Digital, told Forkast in an emailed response.\n\n“If the court states that XRP is not a security, it strengthens the case for many other tokens that the SEC considers a security. The SEC has tried the regulation by enforcement tactic, but this ruling might make it think twice about its past approach,” Chok added.\n\nHowever, according to Ben Caselin, vice president and chief strategy officer at Dubai-based crypto trading platform MaskEX, the court’s ruling might be cause for some relief among investors, but this tug-of-war is far from over.\n\n“Due to their peer-to-peer and digital native nature, cryptocurrencies do not easily allow for regulation in the traditional sense, but, going forward, if projects and companies who issue tokens want to deal with the general public and institutional investors, they might want to practice more caution compared to a few years ago,” Caselin told Forkast in an emailed response.\n\nXRP’s 24-hour trading volume soared 1,743.38% to US$13.27 billion, while its market capitalization strengthened 64.52% to US$40.85 billion.\n\nThe verdict on the Ripple vs. SEC lawsuit also boosted prices of all top 10 non-stablecoin cryptocurrencies.\n\nCardano’s ADA token gained 22.88% to US$0.3526, bringing its weekly gains to 25.91%. Solana increased 31.98% to US$28.75 and is up 47.96% on the week. Polygon’s Matic token strengthened 17.96% to US$0.8555 in 24 hours and 29.4% on the week.\n\nThe three cryptocurrencies saw double-digit losses in early June when the SEC labeled the tokens as financial securities in its lawsuits against crypto exchanges Coinbase and Binance.US.\n\n“The resolution of the lawsuit could lead to increased investor and market confidence in XRP [which] could attract new investors and drive greater liquidity and trading volume for XRP,” Minal Thukral, executive vice-president of growth and strategy at CoinDCX, India’s first crypto unicorn, said in an emailed statement on Friday.\n\nThe total crypto market capitalization rose 5.59% to US$1.25 trillion, while market volume increased 131.39% to US$70.53 billion in the past 24 hours.\n\nForkast 500 NFT index gains\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the main Forkast 500 NFT index edged up 0.27% to 2,706.85 in 24 hours to 6.45 p.m. in Hong Kong.\n\nForkast’s Ethereum and Solana indices also gained in the same period.\n\nTotal NFT sales volume on Ethereum blockchain gained 8.95% in the past 24 hours to US$17.07 million, according to data from CryptoSlam.\n\nBy collections, Ethereum-based Bored Ape Yacht Club recorded the highest 24-hour sales volume, rising 2.76% to US$2.09 million.\n\nNFT sales volume on the Bitcoin network declined 22.49% in 24 hours to US$2.68 million. Bitcoin’s $FRAM BRC-20 NFTs ranked the second-highest among collections.\n\n“CryptoPunks are gaining traction after Twitter users started speculating that a new cryptocurrency would be launched by an influencer named Pauly, who has been active in the Phunks community,” according to Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\nI AM creating a token.\n\n\n\nThere is no next $pepe.\n\n\n\nBe early. You will thank me later. pic.twitter.com/bCUE7Sh6bJ — PAULY (@Pauly0x) July 9, 2023\n\n“Pauly is known as a co-defendant in the Yuga Labs vs Ryder Rips BAYC collection lawsuit, and also as potentially a co-creator of Yuga Labs’ $APE Coin,” Petscher added.\n\nEthereum-based CryptoPunks gained 9.01% in sales volume to US$927,929 in the past 24 hours, ranking it the fourth biggest collection.\n\nAsian equities, U.S. futures gain; European bourses mixed\n\nImage: Envato Elements\n\nAsian stock markets mostly rose on Friday after the People’s Bank of China deputy governor Liu Guoqiang said that China’s central bank will step up “countercyclical adjustments” to aid recovery of the world’s second-largest economy. The central bank would use monetary policy tools such as the reserve requirement ratio, medium-term lending facility, and open market operations to boost economic growth.\n\nChina’s Shanghai Composite, Hong Kong’s Hang Seng, South Korea’s Kospi strengthened while Japan’s Nikkei dropped.\n\nIndia’s annual wholesale price index-based inflation declined for the third straight month to 4.12% in June compared to 3.48% in May. The decline was mainly due to lower prices of food products, mineral oils, crude petroleum and natural gas.\n\nIndia’s Sensex index at the Bombay Stock Exchange gained 0.77% at the close of trading hours on Friday.\n\nEarlier this month, Goldman Sachs said the world’s most populous country would become the world’s second largest economy by 2075, surpassing not only Japan and Germany but also the U.S.\n\nAs India’s population of 1.4 billion people becomes the world’s largest, its GDP is forecast to expand dramatically. Goldman Sachs Research projects India will have the world’s second-largest economy by 2075. https://t.co/CFFM0JsmEL pic.twitter.com/xHruyuSFex — Goldman Sachs (@GoldmanSachs) July 6, 2023\n\nU.S. stock futures strengthened as of 8 p.m. in Hong Kong, with the Dow Jones Industrial Average futures, the S&P 500 futures, and the Nasdaq 100 Futures all in the green.\n\nThe U.S. producer price index (PPI) released Thursday recorded a 0.1% year-on-year rise for June, down from 0.9% in May. The June figure is the smallest increase since August 2020. The data is also well below analyst expectations of a 0.4% annual increase.\n\nThe latest U.S. consumer price index, a key inflation indicator, slowed to 3% in June, beating market expectations of 3.1%. It was also the smallest annual increase since March 2021, and brought inflation rates closer to the Federal Reserve’s target of 2%.\n\nJeff Feng, co-founder of Sei Labs – a contributor to the Sei blockchain focused on trading – and a former Goldman Sachs analyst said that cooling inflation will be a boost to crypto markets.\n\n“This economic thaw doesn’t merely spell relief from the spiraling prices but is also poised to breed bullish sentiment across markets, especially for risk-on assets like cryptocurrencies. As the fear of inflation recedes, investors, buoyed by the healthier economic outlook, may be more inclined to channel their resources toward such assets,” Feng wrote.\n\nThe Federal Reserve meets on July 26 to discuss its next move on interest rates which are currently between 5% and 5.25%.\n\n“We will still see a rate hike in July. The debate will intensify though, and we do not expect a move in September,” Keith Wade, chief economist and strategist at Schroders, said in an emailed statement on Friday.\n\n“The next move should prove to be the last hike in this cycle with cuts following thereafter,” Wade added.\n\nEuropean bourses traded mixed on Friday as the benchmark STOXX 600 gained while Germany’s DAX 40 dropped during Friday afternoon trading hours in Europe.\n\n(updates with equities section.)"
    }
]