[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS9tYXJrZXRzL2JsYWNrcm9jay1maWxlcy1iaXRjb2luLWV0Zi1zZWPSAUdodHRwczovL3d3dy5mb3hidXNpbmVzcy5jb20vbWFya2V0cy9ibGFja3JvY2stZmlsZXMtYml0Y29pbi1ldGYtc2VjLmFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "Blackrock files for bitcoin ETF with SEC - Fox Business",
        "content": "With digital assets entangled in regulation scrutiny, BlackRock filed for a bitcoin exchange-traded fund (ETF) on Thursday to expose more investors to cryptocurrency.\n\nAccording to a filing with the Securities and Exchange Commission (SEC) and despite the U.S. regulator not approving any applications for spot bitcoin ETFs to date, BlackRock's iShares Bitcoin Trust will use Coinbase Custody as its custodian.\n\nBITCOIN SLIDES TO $25K AFTER FED MEETING\n\nThe firm, run by CEO Larry Fink, is one of the world's largest asset managers with about $9 trillion in assets under management.\n\nETFS TO PLAY AROUND THE DEBT DEFAULT RISK\n\nMeanwhile, the price of bitcoin dipped as low as the $25,000 level, while other digital assets tumbled after the Federal Reserve announced Wednesday that additional interest rate hikes were coming.\n\nEarlier this month, the SEC sued major exchanges Coinbase and Binance in high-profile lawsuits that reverberated throughout the digital assets industry.\n\nTicker Security Last Change Change % COIN COINBASE GLOBAL INC. 251.73 -4.41 -1.72%\n\nProponents say an ETF would give investors exposure to bitcoin without directly buying it, while a spot bitcoin ETF would track bitcoin's underlying market price.\n\nSAM BANKMAN-FRIED JUDGE WEIGHING TWO SEPARATE TRIALS FOR FTX FOUNDER\n\nThe SEC rejected Grayscale Investment LLC’s application last year to convert its flagship spot Grayscale Bitcoin Trust (GBTC.PK) into an ETF.\n\nGrayscale sued the SEC in response, claiming that the regulator was acting arbitrarily in rejecting applications for spot bitcoin ETFs when it had previously approved bitcoin futures ETFs.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nTicker Security Last Change Change % CBOE CBOE GLOBAL MARKETS INC. 183.50 +1.80 +0.99%\n\nThe SEC has also rejected proposals for spot bitcoin ETFs from firms including Fidelity, Cboe Global Markets and NYDIG.\n\nReuters contributed to this report."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aGF0LW5leHQtYXMtYml0Y29pbi1hbmQtZXF1aXRpZXMtaGVhZC1pbi1vcHBvc2l0ZS1kaXJlY3Rpb25zL9IBWGh0dHBzOi8vYW1iY3J5cHRvLmNvbS93aGF0LW5leHQtYXMtYml0Y29pbi1hbmQtZXF1aXRpZXMtaGVhZC1pbi1vcHBvc2l0ZS1kaXJlY3Rpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, equities head in opposite directions and that means… - AMBCrypto News",
        "content": "The decoupling became even more pronounced in Q2 2023 as the price trajectories diverged.\n\nBitcoin’s volatility increased following the recent legal actions on crypto behemoths.\n\nBitcoin [BTC] formed an inverse relationship with tech stocks as sentiment around virtual assets and equities diverged lately.\n\nIs your portfolio green? Check out the Bitcoin Profit Calculator\n\nA Twitter user, citing data from on-chain analytics firm IntoTheBlock, said that Bitcoin’s 30-day correlation coefficient with popular indices like Nasdaq and S&P 500 turned negative. In essence, this meant that when the price of BTC goes up, the price of the equities will fall and vice versa.\n\n? Look out folks, something's changing! Stocks and crypto are now mostly negatively correlated, meaning as one thrives, the other dives. Data from @intotheblock https://t.co/THDanxmnii pic.twitter.com/lXl7eHOhvt — Elite ?? (@eliteXBT) June 16, 2023\n\n“Digital gold” is finally here\n\nProponents of Bitcoin have long positioned it as the “safe-haven asset,” or an investment whose value is expected to be steady or even rise during economic downturns, similar to precious metals like Gold.\n\nTo be seen as an inflation hedge by investors, an asset must display significant decoupling from traditional markets. However, with the growing mainstream adoption of cryptocurrencies, Bitcoin and other altcoins became more and more influenced by the geo-political and macroeconomic triggers that affect the mainstream market.\n\nBut this has started to change. The spate of banking collapses in March led investors to put their funds in the crypto market. Following this, the world’s largest crypto by market cap, Bitcoin soared 52% until hitting its yearly peak in April, as per IntoTheBlock. On the other hand, equity indices were largely flat until that point.\n\nThe decoupling became even more pronounced in Q2 2023, as the crypto market in general and Bitcoin in particular entered a consolidation phase. The king coin fell even more as regulators in the United States became increasingly hostile.\n\nHowever, the tech stocks went the other way, resulting in a clear divergence in the growth trajectories of the two assets.\n\nIt’s not only the equity markets with which BTC started to insulate itself. In recent months, the “digital gold” has shown increased decoupling from its real-world counterpart, Gold [XAU] as well. Bitcoin grew faster in value than the precious metal since the banking crisis of March.\n\nHow much are 1,10,100 BTCs worth today?\n\nVolatility starts to rise\n\nBTC exchanged hands at $26,561.18 at the time of writing. The coin gained nearly 4% in the last 24 hours, as per Santiment. Interestingly, after witnessing a protracted period of low volatility, BTC began to live up to its image of an unpredictable asset lately. The volatility increased following the recent legal actions on crypto behemoths by regulators."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tdHJhZGluZy1pbi0yMDIzLTEwLXRpcHMtdG8tZ2V0LXlvdS1zdGFydGVkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Trading in 2023: 10 Tips to Get You Started - Analytics Insight",
        "content": "If you’re new to crypto and seeking to learn Bitcoin trading in 2023, check out this article for some helpful tips.\n\nBitcoin has become a key participant in digital money and has experienced substantial growth in popularity. It’s critical to comprehend the fundamentals and start correctly as more people and businesses express interest in this decentralized digital currency. We’ve prepared ten recommendations to assist you in navigating this fascinating and potentially lucrative space, whether you’re a beginner to Bitcoin or trying to increase your understanding. These pointers will give you a strong starting point for your exploration of the Bitcoin world, from comprehending the principles of the currency to protecting your digital possessions. Let’s dig in and learn how to use security and confidence to start your Bitcoin trading in 2023\n\n1.Gain Knowledge- Before starting Bitcoin trading, it’s essential to gain a thorough grasp of the cryptocurrency industry, blockchain technology, and the variables affecting the price of Bitcoin. Spend time exploring and learning from reliable sources to create a solid knowledge base.\n\n2.Utilize sample accounts to practice- Use the demo accounts that some exchanges offer if you’re new to trading or want to test your methods without putting real money at risk. You can practice and improve your crypto trading methods using these to imitate real-market situations before using actual money.\n\n3.Begin with Small Investments- Beginners should start with modest investment sums. With this strategy, you can learn and experience things without taking on a lot of debt. As you gain self-assurance and ease, you can invest big.\n\n4.Clarify Your Objectives and Risk Tolerance- Establish your trading objectives and decide the level of risk you are willing to accept. You may make wise trading selections and manage your positions successfully by establishing clear objectives and being aware of your risk tolerance.\n\n5.Create a Trading Strategy- To succeed in the Bitcoin market, you must have a clearly defined trading strategy. Decide whether day trading, swing trading, or long-term investment is your preferred trading style, and create a strategy that includes risk management and entry/exit criteria.\n\n6.Select a Trustworthy Exchange- A trustworthy and safe cryptocurrency exchange is essential for trading Bitcoin. Find exchanges with a proven track record, strong security protocols, reasonable fees, and a user-friendly interface that meets your trading requirements.\n\n7.Utilize Technical Analysis- Technical analysis examines charts, patterns, and indicators to detect future price trends and trading opportunities. For more educated trades, please become familiar with the fundamentals of technical analysis and incorporate them into your decision-making process.\n\n8.Adopt a Long-Term Outlook- Bitcoin’s volatility can cause sudden changes in price. But for lasting success, adopting a long-term perspective is frequently advised. Keep your attention on the technology’s promise, exercise patience during market turbulence, and refrain from acting rashly in response to recent market noise.\n\n9.Keep Up to Date- Keep abreast of news, market developments, and legislative changes that may affect the Bitcoin market. To remain current on price changes and market sentiment, pay attention to reliable sources, get involved in cryptocurrency networks, and think about employing alert tools.\n\n10.Bring risk management strategies into practice- Trading bitcoins requires effective risk management. Establish stop-loss orders to cut down on potential losses, diversify your holdings, and avoid investing more money than you can afford to lose. By implementing risk management principles, you can protect your money and reduce potential risks.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvZ2FyeS1nZW5zbGVycy1qb2ItYXQtcmlzay1ibGFja3JvY2tzLWZpcnN0LXNwb3QtYml0Y29pbi1ldGYtaG9kbGVycy1kaWdlc3QtanVuZS0xMS0xNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "Gary Gensler's job at risk, BlackRock's first spot Bitcoin ETF... - Cointelegraph",
        "content": "Top Stories This Week\n\nUS lawmakers file ‘SEC Stabilization Act’ to fire Gary Gensler\n\nUnited States Representative Warren Davidson has introduced the “SEC Stabilization Act” into the House of Representatives. One of the bill’s main provisions is to fire Securities and Exchange Commission (SEC) Chair Gary Gensler. The bill would remove Gensler from office and redistribute power between the SEC chair and commissioners. It would also add a sixth commissioner to the agency, disallow any party from holding a majority on the commission and create an executive director position. The SEC declined to comment on the matter.\n\nBlackRock applies for spot Bitcoin ETF — a US first if approved\n\nBlackRock, the world’s largest investment company, has filed an application for a Bitcoin spot exchange traded fund (ETF). It would be the first crypto spot ETF in the United States, if it receives approval. According to the filing, Coinbase Custody Trust Company would be the custodian of the fund and Bank of New York Mellon would custody its fiat. The SEC has not approved a spot Bitcoin ETF so far despite numerous applicants. The world’s first spot traded Bitcoin ETF was Canada’s Purpose Bitcoin ETF, set up in early 2021.\n\nBinance CEO Changpeng Zhao denies rumors of selling Bitcoin to bolster BNB\n\nBinance CEO Changpeng “CZ” Zhao has refuted accusations that Binance has been secretly selling Bitcoin (BTC) to artificially stabilize the price of its BNB token. The rumors have come from several market commentators in the past days, accusing the exchange of intentionally manipulating the market to artificially inflate the value of BNB. CZ said that Binance had not sold any of its BTC or BNB, adding that the crypto exchange still held “a bag” of FTX Token — the native token of the now-defunct crypto exchange FTX.\n\nSEC’s Gensler says BTC, ETH ‘not securities’ in a newly surfaced video\n\nA newly surfaced video from 2018 featuring Gary Gensler has made the rounds on social media, showing the now-chair of the U.S. securities regulator again stating that multiple cryptocurrencies are not securities. “Over 70% of the crypto market is Bitcoin, Ether, Litecoin, Bitcoin Cash. Why did I name those four? They’re not securities,” Gensler says in the video, which is understood to come from a 2018 event hosted by Bloomberg for institutional investors. At the time, Gensler was a professor at the Massachusetts Institute of Technology. The video contrasts with his more recent actions as the chair of the SEC.\n\nBinance​.US hires former SEC enforcement official amid lawsuit\n\nFormer SEC enforcement official George Canellos has reportedly been hired by Binance.US as part of the legal team defending the company against allegations of operating as an unregistered securities exchange. In response to the SEC’s action on June 5, Binance.US announced the suspension of U.S. dollar deposits and the potential pausing of fiat withdrawals, citing “extremely aggressive and intimidating tactics” from regulators. On Twitter, a former SEC chief said the exchange is “clearly preparing for a criminal prosecution and continuing to hire the best defense attorneys in the world.”\n\nWinners and Losers\n\nAt the end of the week, Bitcoin (BTC) is at $26,349, Ether (ETH) at $1,716 and XRP at $0.47. The total market cap is at $1.06 trillion, according to CoinMarketCap.\n\nAmong the biggest 100 cryptocurrencies, the top three altcoin gainers of the week are KuCoin Token (KCS) at 9.75%, Maker (MKR) at 8.08% and Quant (QNT) at 4.10%.\n\nThe top three altcoin losers of the week are EOS (EOS) at -29.88%, ApeCoin (APE) at -26.07% and Flow (FLOW) at -25.93%.\n\n\n\nFor more info on crypto prices, make sure to read Cointelegraph’s market analysis.\n\nMost Memorable Quotations\n\n\n\n“Inflation is moving in the right direction but the comments from Jerome Powell signify that rates could stay higher for longer, which would put Bitcoin on the back foot.”\n\nJosh Gilbert, market analyst at eToro\n\n“Requiring a DEX to register in the same way as a national securities exchange is impossible.”\n\nPaul Grewal, chief legal officer of Coinbase\n\n“U.S. capital markets must be protected from a tyrannical Chairman, including the current one. It’s time for real reform and to fire Gary Gensler as Chair of the SEC.”\n\nWarren Davidson, United States Representative\n\n“The addressable market for digitizing the world’s assets and transferring value safely across the internet is greater than the sum of all the value of all existing assets.”\n\nEmin Gün Sirer, CEO of Ava Labs\n\n“The banking system is failing. The legacy financial system is failing. […] Nothing works. Only Bitcoin works.”\n\nSamson Mow, CEO of Jan3\n\n“Over 70% of the crypto market is Bitcoin, Ether, Litecoin, Bitcoin Cash. Why did I name those four? They’re not securities.”\n\nGary Gensler, chair of the U.S. Securities and Exchange Commission\n\nPrediction of the Week\n\nBitcoin price eases downside as traders demand $24.5K support holds\n\nBitcoin recovered some lost ground by the end of the week as markets shook off mixed United States macro signals.\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD circling $26,000 on June 16 after bouncing over $1,000 from the previous day’s lows when it fell below $25,000 for the first time in three months. The 4% plunge came as the Federal Reserve pressed a pause on interest rates but suggesting more hikes would come later this year.\n\nOn short timeframes for BTC/USD, traders are remaining cautious amid the risk of further downside to come. “Still in the area of interest, but need to sustain above $24.5K to avoid a cascade to $23k,” wrote Michaël van de Poppe, founder and CEO of trading firm Eight.\n\nFUD of the Week\n\nCurve pool imbalance triggers USDT depeg concerns, Tether CTO calls it FUD\n\nThe Tether (USDT) stablecoin slightly deviated from its U.S dollar peg on June 15 due to an imbalance in Curve’s 3pool. The price of USDT fell by 0.3% to around 0.997 as its weightage in the Curve 3pool increased to over 70% from the usual 33.1%. A significant rise in the weightage of a stablecoin in the pool indicates heavy selling of that asset. Tether’s chief technology officer, Paolo Ardoino, took to Twitter to assure that the depeg is nothing to worry about and it is ready to redeem any amount.\n\nBoard member Yat Siu answers community concerns on ApeCoin DAO salary payouts\n\nLeaders of the decentralized autonomous organization governing the ApeCoin ecosystem have been criticized by community members for what they described as “insane” salaries. An organizational chart showed salaries ranging from $7,000 to $75,000 per month, shocking some community members and prompting a slew of inquiries from others. According to a board member, the compensation corresponds to the “responsibility and liability of the role.”\n\n‘Who the hell’ is Prometheum and what did it say to Congress about SEC compliance?\n\nThe relatively under-the-radar crypto company Prometheum has been thrust into the spotlight after a recent testimony from its co-founder, Aaron Kaplan, before a U.S. House Committee discussing crypto regulatory clarity. Kaplan’s testimony advocated for regulating crypto under current securities laws — a view also shared by the SEC. He argued that multiple frameworks provided by the SEC have “clearly laid out” a “compliant path forward for crypto,” adding that those arguing for new crypto-specific laws are “simply not willing to comply.”\n\nBest Cointelegraph Features\n\n‘Holy shit, I’ve seen that!’ — Coldie’s Snoop Dogg, Vitalik and McAfee NFTs: NFT Creator\n\nNFT art pioneer Coldie creates crypto culture time capsules about Buffett, Buterin and McAfee — and writes lyrics for Snoop Dogg.\n\nReal Bedford is the “Bitcoin” soccer team that’s made headlines and united BTC evangelists.\n\nAI Eye: Is AI a nuke-level threat? Why AI fields all advance at once, dumb pic puns\n\nIs AI an existential threat like nuclear weapons, or as likely to kill us as a toaster? Why all AI fields advance at once, and dumb pic puns."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LnRoZWF0bGFudGljLmNvbS9pZGVhcy9hcmNoaXZlLzIwMjMvMDYvY3J5cHRvLWRvd24tb3ItaXQtZGVhZC82NzQ0NDIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 17 Jun 2023 07:00:00 GMT",
        "title": "Is Crypto Dead? - The Atlantic",
        "content": "Last week, the Securities and Exchange Commission filed 13 charges against Binance, the world’s largest crypto exchange, accusing it of mishandling customer funds and a litany of other white-collar crimes. It also charged Coinbase, a public company and the biggest U.S. crypto business, with failing to register as a broker-dealer.\n\nThe government actions did not move the price of bitcoin much, nor did they crater Coinbase stock; traders and investors had been expecting the enforcement actions for months. And both firms vowed to fight the charges and remain operational. Binance “should not be the subject of an SEC enforcement action, let alone on an emergency basis,” the firm said in a statement. “We are very confident in the way we run our business—the same business we presented to the SEC in order for us to become a public company,” Paul Grewal, Coinbase’s chief legal officer, said in response.\n\nEven before the SEC announcements, crypto was in trouble. Dozens of firms had failed, millions of individual investors had plunged into the red or cashed out, and billions of dollars of institutional investment had moved on. Beset by long-standing problems of its own invention, the industry now faces not just a regulatory crisis but an existential one too: Is crypto down, or is it dead?\n\nIt is definitely down, written off by thousands of individual and institutional investors. The most obvious issue: scams. In the world of crypto, big firms are scams. Little firms are scams. Stable coins are scams; exchanges are scams; NFT schemes are scams; initial coin offerings are scams; tokens are scams. Firms run by self-proclaimed altruists are scams. Firms run by the shadiest dudes you can possibly imagine are scams. “There have been a lot of putatively decentralized Web3 companies that were really just three guys and a pair of servers in a pump-and-dump coin scheme,” Will Wilkinson, the head of policy at TBD, a bitcoin-focused subsidiary of the fintech giant Block, told me. And even simple, legitimate crypto activity remains prone to fraud. Hackers purloined nearly $4 billion of bitcoin and other cryptocurrencies last year alone, according to the research group Chainalysis.\n\nThe industry also has a complexity problem. Fourteen years since the advent of bitcoin, people still struggle to comprehend how the blockchain works, what Web3 is, and what tokens and coins and NFTs are. Many folks also struggle to figure out how to buy crypto assets and manage their investments. (Why do you need a weird series of letters and numbers to secure your bitcoin, again?)\n\n“A mature market is one that shouldn’t make you afraid to put your money in. You shouldn’t be turning off a bunch of folks with greed and theft,” Yesha Yadav, an expert in financial-market regulation at Vanderbilt University’s law school, told me. “Equally, it should be one in which folks feel comfortable in understanding the technicalities.”\n\nWhat is the point of doing all of this, anyway? Boosters have for years described crypto as a revolutionary technology—disempowering central banks, empowering private individuals, and perhaps even ushering in an era of world peace. But revolutionary for whom and in what way? That’s hard to say. Most crypto users are just making speculative bets; most crypto firms are just making or facilitating speculative bets themselves. Crypto is a casino, for the most part, and one without the free drinks.\n\nThese digital assets are “pretty much only good for illegal activities, like money laundering, narco-terrorism, and tax evasion,” Dennis Kelleher, a co-founder of Better Markets, a nonprofit advocating for financial regulation, told me. “Is there social or public interest in enabling a financial product like that?”\n\nThen there are the volatility and the bubbles. Financial assets go up in price. They go down in price. This is their nature. But few things go up and down quite like crypto. NFTs came out of nowhere, sucked up billions of dollars, and collapsed. Initial coin offerings came out of nowhere, sucked up billions of dollars, and disappeared.\n\nEven bitcoin—the most stalwart and liquid part of the industry—still sees wild swings in price. Two years ago, the internet and the airwaves were awash with advertisements painting crypto as an investment for the brave, a down payment on the future. These ads targeted everyone, especially Black investors historically shunned by Main Street financial institutions. “I want to ensure that communities like the one I come from are not left behind,” LeBron James said, announcing a multiyear deal with Crypto.com. It was a pump-and-dump on a multibillion-dollar scale. “Dumb money” got in to get smart money out. Black money got in to get white money out. The price of bitcoin quintupled. Then it crumbled.\n\nWealthy investors might be able to tolerate these kinds of losses. High-risk investors might be able to tolerate this kind of volatility. So too might crypto true believers, for whom HODL, or “Hold on for dear life,” is a common refrain. But most people don’t want to hold on for dear life.\n\nIf these were the only issues, the crypto winter might just be that—a season. The price of bitcoin and ether would recover, as they already are. People would forget about the brazen frauds and the sweaty ads and the endless hacks. New businesses would start; new promises would be made; new money would flow in.\n\nBut for Uncle Sam. From the very beginning, many crypto businesses have been engaged in something called “regulatory entrepreneurship.” It’s “ask forgiveness, not permission” as a business model: Start-up founders create a company in probable violation of American law, argue that the law should not apply to them, grow “too big to ban,” lobby intensively, and hope for the best. It might sound delusional, but it’s a common strategy in Silicon Valley, one that has worked out for Airbnb, Uber, Lyft, and DraftKings, among others.\n\nFor years, crypto companies argued that American financial regulations do not apply to them because, well, because. They pushed Congress to “clarify” the laws. And while Congress debated whether and how to do so, those firms allowed individual customers to buy, trade, and leverage their newfangled assets. Still, American financial companies abiding by American financial law largely avoided pouring money into or building products with crypto, because of the legal and regulatory risk. Goldman Sachs didn’t start packaging ether into derivatives; Bank of America would not let you pay your mortgage in bitcoin.\n\nThis weird status quo protected the broader American financial system from the fraud and chaos of the crypto markets. But it left individual crypto investors exposed to that fraud and chaos. “What makes my blood boil is the fact that actual people have been losing their shirts,” Yadav told me, “while we are over here stroking our chins about what exactly these asset classes represent.”\n\nThe collapse in November of FTX, Sam Bankman-Fried’s Bahamian crypto mega-exchange-slash-alleged-Ponzi-scheme, did not destabilize the financial system. But it did kill off the chances of Congress passing crypto-friendly legislation. And while Congress delayed, debated, and walked away, the SEC forged ahead, insisting that most crypto assets are securities, arguing that crypto companies have failed to register their businesses and structure them properly, and promising to force them into compliance. Coinbase and Binance are just the biggest and latest companies targeted; there have been dozens of enforcement actions in the past few years.\n\nCrypto firms complain that this is innovation-stifling “regulation by enforcement”: Congress needs to clarify the rules before the SEC can administer them. “Imagine if more than a century ago regulators had cut Ford and General Motors off from banking services because they considered automobiles too risky,” Katie Haun, a prominent crypto investor, wrote in The Wall Street Journal in March. “Major U.S. policy decisions should be made by Congress and state legislatures, not by unelected officials.”\n\nBut many financial experts argue that the SEC’s authority is obvious. Most crypto assets are securities: “an investment of money in a common enterprise with profits to come solely from the efforts of others,” as defined in a 1946 Supreme Court case. (Bitcoin, notably, is not a security: Nobody is profiting from the efforts of bitcoin’s leadership, because bitcoin has no leaders.) “The SEC is trying to enforce the most basic investor protections we have,” Kelleher told me. “Truthfully, these are not aggressive cases. These aren’t close calls.”\n\nTo the crypto industry, they might be devastating, though. Many crypto firms do not have a business model that nets out if standard financial regulations apply—that’s the essence of regulatory entrepreneurship. Coinbase, the SEC alleges, is a jumble of conflicts of interest, one providing insufficient protections and disclosures to its customers and performing shoddy bookkeeping. Were it to restructure, it would likely be a smaller company with higher costs and narrower or even obliterated margins. (The company was profitable before the crypto collapse and is now operating in the red.) Binance is functionally a criminal enterprise, SEC Chair Gary Gensler argues—“an extensive web of deception” purposefully evading American law. (The SEC complaint includes a message that Binance’s chief compliance officer sent to a colleague, making Gensler’s case for him: “We are operating as a fking unlicensed securities exchange in the USA bro.”)\n\nThe risks to those two firms mirror the risks to the crypto industry as a whole. “It seems like this is just the beginning,” Edward Moya, a crypto analyst, wrote in a note to clients last week, adding that the “regulatory hammer” is swinging and predicting that traders would abandon positions, pull assets off exchanges, and dump speculative investments.\n\nDoes this mean crypto is dead? Yes and no. Crypto boosters’ grandest vision—of digital currencies changing everything, putting the Federal Reserve out of business, supplanting Wall Street and Main Street, and remaking the web as Web3—does seem over. Crypto is a trillion-dollar global asset class. Crypto is also a fringe industry that is offshoring and shrinking and growing more fringe, not one innovating alongside and outcompeting Big Finance.\n\nBut bitcoin and the blockchain are going to stick around, the former a popular alternative investment and a preferred currency of criminals, the latter a curious general-use technology. “The potential is the same,” Jerry Brito, the executive director of Coin Center, a crypto think tank and advocacy group, told me. Wilkinson, for his part, noted how helpful bitcoin had proved to be in getting money to people without access to strong and stable banking networks: human-rights activists in Ukraine, refugees fleeing climate disasters, families receiving remittances in Ghana and Kenya. Both said they believe the industry would benefit from having the scammy, scummy actors and cheap-and-easy money flushed out. “Some of these projects are potentially revolutionary,” Brito told me. “But I think a large portion of the ecosystem was completely cynical. That’s not helpful.”\n\nI am still not sure whether many crypto projects are useful, yet alone revolutionary. Surely some use cases are out there waiting to be discovered, but good luck to crypto companies trying to persuade Americans to adopt them going forward. A recent CNBC survey found that 8 percent of adults have a positive view of crypto. A recent Pew survey found that just 2 percent of adults familiar with crypto are “extremely” confident in its safety and reliability. The past two years of price crashes, Ponzi schemes, and stolen funds have not just soured the government on crypto. They have soured the public too."
    }
]