[
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWF0bS1vcGVyYXRvci1jb2luLWNsb3VkLTE2MzkzNzAwMy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin ATM Operator Coin Cloud Files for Bankruptcy With Liabilities of $100M-$500M - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nCoin Cloud, which operates more than 4,000 bitcoin ATMs across the U.S. and Brazil, has filed for bankruptcy protection with estimated liabilities of between $100 million and $500 million.\n\nThe Las Vegas-based firm has assets of between $50 million and $100 million and as many as 10,000 creditors, according to a filing in the U.S. Bankruptcy Court for the District of Nevada dated Feb. 7.\n\nThe company's largest creditor is Genesis Global Trading, which has an unsecured loan of just over $100 million. Genesis is a subsidiary of Digital Currency Group, which is also the parent company of CoinDesk. Genesis also discussed injecting equity into the ATM operator, Bloomberg reported in November.\n\nCoin Cloud hired legendary filmmaker Spike Lee to direct a commercial for it in 2021.\n\nRead more: Bankrupt Lender Genesis and Parent DCG Reach Initial Agreement With Main Creditors: Source\n\n\n\n\n\n\n\n"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWF0bS1vcGVyYXRvci1jb2luLWNsb3VkLTE2MzkzNzAwMy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin ATM Operator Coin Cloud Files for Bankruptcy With Liabilities of $100M-$500M - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nCoin Cloud, which operates more than 4,000 bitcoin ATMs across the U.S. and Brazil, has filed for bankruptcy protection with estimated liabilities of between $100 million and $500 million.\n\nThe Las Vegas-based firm has assets of between $50 million and $100 million and as many as 10,000 creditors, according to a filing in the U.S. Bankruptcy Court for the District of Nevada dated Feb. 7.\n\nThe company's largest creditor is Genesis Global Trading, which has an unsecured loan of just over $100 million. Genesis is a subsidiary of Digital Currency Group, which is also the parent company of CoinDesk. Genesis also discussed injecting equity into the ATM operator, Bloomberg reported in November.\n\nCoin Cloud hired legendary filmmaker Spike Lee to direct a commercial for it in 2021.\n\nRead more: Bankrupt Lender Genesis and Parent DCG Reach Initial Agreement With Main Creditors: Source\n\n\n\n\n\n\n\n"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTA4L2NyeXB0by1tYXJrZXQtcmFsbHktaXMtYS1nb29kLXNpZ24tZm9yLTIwMjMtYml0Y29pbi1taW5lcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Crypto Market Rally Is A Good Sign For 2023 Bitcoin Miners - Bloomberg",
        "content": "Listen to Bloomberg Crypto on the iHeartRadio App, Apple Podcasts or Spotify.\n\nCryptocurrencies, Bitcoin in particular, are having a strong start to 2023. That’s resulted in a couple of interesting consequences for some of the most important players in the market: Bitcoin miners.\n\n\n\nThis year has also seen a lot of significant weather events affecting the US, including recent winter storms in Texas that have left hundreds of thousands of people without power. Energy is one of the most important costs that Bitcoin miners must absorb -- they just can’t run all those machines in their data centers without electricity.\n\n\n\nRecently, we discussed the challenging conditions that Bitcoin miners in the US and around the world have been facing. On this episode we discuss how some miners have been able to adapt and take advantage of current market conditions to try to put themselves on slightly more stable financial footing. Bloomberg reporter David Pan follows Bitcoin mining and joins this episode."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTA4L2NyeXB0by1tYXJrZXQtcmFsbHktaXMtYS1nb29kLXNpZ24tZm9yLTIwMjMtYml0Y29pbi1taW5lcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Crypto Market Rally Is A Good Sign For 2023 Bitcoin Miners - Bloomberg",
        "content": "Listen to Bloomberg Crypto on the iHeartRadio App, Apple Podcasts or Spotify.\n\nCryptocurrencies, Bitcoin in particular, are having a strong start to 2023. That’s resulted in a couple of interesting consequences for some of the most important players in the market: Bitcoin miners.\n\n\n\nThis year has also seen a lot of significant weather events affecting the US, including recent winter storms in Texas that have left hundreds of thousands of people without power. Energy is one of the most important costs that Bitcoin miners must absorb -- they just can’t run all those machines in their data centers without electricity.\n\n\n\nRecently, we discussed the challenging conditions that Bitcoin miners in the US and around the world have been facing. On this episode we discuss how some miners have been able to adapt and take advantage of current market conditions to try to put themselves on slightly more stable financial footing. Bloomberg reporter David Pan follows Bitcoin mining and joins this episode."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vbGliZXJ0eXN0cmVldGVjb25vbWljcy5uZXd5b3JrZmVkLm9yZy8yMDIzLzAyL2lzLXRoZXJlLWEtYml0Y29pbi1tYWNyby1kaXNjb25uZWN0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Is There a Bitcoin–Macro Disconnect? - Liberty Street Economics - Liberty Street Economics -",
        "content": "Gianluca Benigno and Carlo Rosa\n\nCryptocurrencies’ market capitalization has grown rapidly in recent years. This blog post analyzes the role of macro factors as possible drivers of cryptocurrency prices. We take a high-frequency perspective, and we focus on Bitcoin since its market capitalization dwarfs that of all other cryptocurrencies combined. The key finding is that, unlike other asset classes, Bitcoin has not responded significantly to U.S. macro and monetary policy news. This disconnect is puzzling, as unexpected changes in discount rates should, in principle, affect the price of Bitcoin.\n\nBackground\n\nPrior to its recent decline, the market value of cryptocurrencies reached a staggering $2.5 trillion, with Bitcoin crossing the $1 trillion mark. In addition, Bitcoin represents the lion’s share—between 50 percent (nowadays) and 90 percent (in 2016)—of the overall capitalization of the digital currency market.\n\nMarket Capitalization of Bitcoin and Other Cryptocurrencies\n\nSource: Authors’ calculations.\n\nNotes: The chart plots the market capitalizations of Bitcoin and twenty-two other cryptocurrencies (Aave, BinanceCoin, Cardano, ChainLink, Cosmos, CyrptocomCoin, Dogecoin, EOS, Ethereum, Iota, Litecoin, Monero, NEM, Polkadot, Solana, Stellar, Tether, Tron, Uniswap, USDCoin, WrappedBitcoin, and XRP). Market capitalization is calculated by multiplying the total number of coins in circulation by their price.\n\nGiven their growing relevance, it is natural to study the drivers of cryptocurrency prices. This blog post focuses on macroeconomic news and monetary policy surprises. We interpret cryptocurrencies as assets whose current price should depend on the expected discounted value of future values. This characterization implies that, from a macroeconomic point of view, developments that influence current and future interest rates, whether directly (news about monetary policy) or indirectly (news about macroeconomic conditions), should affect the value of cryptocurrencies.\n\nWe use a novel and comprehensive intraday data set to identify the effects of this news. By relying on high-frequency data in a short enough window around a macro announcement, the data release is (most likely) the only information systematically hitting the market. Hence, by looking at the response of asset prices in that time window around various announcements, this blog post conducts the empirical finance version of a natural experiment.\n\nAs an example, the chart below shows the response of several U.S. asset prices around two types of news releases: news about the real economy, such as the Bureau of Labor Statistics’ Employment Situation report (left panel), and news about monetary policy, specifically the FOMC meeting (right panel). The June 2016 labor market report contained a lower-than-expected nonfarm payrolls figure, as compared to the Bloomberg consensus. Consequently, the dollar immediately depreciated against the euro by about 1 percent, stock prices declined by about 0.5 percent, and gold prices increased by 2 percent. Bitcoin, on the other hand, moved sideways. At the June 2021 Fed meeting, the FOMC signaled that interest rates needed to rise sooner and faster than market participants had anticipated. Again, the dollar, gold, and stock prices immediately responded to the release, but Bitcoin did not respond in a systematic manner.\n\nResponse of U.S. Asset Prices to Macroeconomic and Monetary Policy News\n\nSource: Authors’ calculations.\n\nNotes: Responses are normalized at zero at the time of the news release. The horizontal axis displays the hours before/after the release. EUR/USD refers to the euro/dollar exchange rate, defined as the amount of U.S. dollars needed to buy one euro.\n\nAnalysis and Results\n\nWe systematically analyze the response of the EUR/USD exchange rate, gold, the S&P 500, and Bitcoin to ten sets of macro announcements that have been singled out as important in the academic literature. In studying the responses of selected asset prices to macroeconomic and monetary policy news, we focus on the 2000-2022 period for all assets except Bitcoin, for which we chose a restricted (more meaningful) sample starting from 2017. (For more details on the analysis, see our related Staff Report on the topic.) We collect different pieces of macro news, covering the real economy and inflation, as well as monetary policy surprises. For monetary policy news, we consider three distinct dimensions. The first indicator, Target, captures unanticipated changes in the current federal funds rate target. The second indicator, Path, captures unanticipated changes in the future path of policy. The third indicator, LSAP, captures unanticipated announcements of future large‐scale asset purchases.\n\nOur priors are based on a simple asset pricing model for Bitcoin. We model Bitcoin as an asset with no intrinsic value whose current value depends on the discounted value of its future price (for our beloved wonks, a “stochastic bubble”). We also accommodate the possibility of the asset having no value with a probability that depends positively on current and future interest rates. Since monetary policy news affects both current and future interest rates, it should be associated with Bitcoin valuation, while macroeconomic news has an indirect impact through the monetary policy reaction function.\n\nBy relying on the regressions’ estimates, we can test to what extent the response of an asset price to a given macroeconomic announcement is systematic. The table below reports the relationship between assets (columns) and selected macroeconomic and monetary news (rows). The shading indicates whether the response is systematic, with darker colors corresponding to more statistically significant effects. The symbol inside each cell indicates the sign of the correlation between asset returns and news. We find that the EUR/USD exchange rate, gold, and the S&P 500 significantly react to most macro and monetary news. In stark contrast, the response of Bitcoin is muted, and never significant at the 1 percent level even when we focus on just monetary policy news.\n\nComparing Asset Price Responses to News Events\n\nConclusions\n\nSo… is macroeconomic news driving Bitcoin? In this post, we conduct a systematic analysis of the impact of macroeconomic and monetary policy news on Bitcoin’s price. In contrast to exchange rates and stocks, Bitcoin is largely unresponsive to macro news. More puzzling is the result that Bitcoin does not also react to monetary policy surprises. At face value, our study casts some doubts on the role of discount rates in pricing Bitcoin. Given the short sample used in the analysis, the jury is still out on this one, and more evidence is needed to put the case to rest.\n\nHow to cite this post:\n\nGianluca Benigno and Carlo Rosa, “Is There a Bitcoin–Macro Disconnect?,” Federal Reserve Bank of New York Liberty Street Economics, February 8, 2023, https://libertystreeteconomics.newyorkfed.org/2023/02/is-there-a-bitcoin-macro-disconnect/.\n\nDisclaimer\n\nThe views expressed in this post are those of the author(s) and do not necessarily reflect the position of the Federal Reserve Bank of New York or the Federal Reserve System. Any errors or omissions are the responsibility of the author(s)."
    }
]