[
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTE0L2JpdGNvaW4tYm91bmNlcy1vZmYtbG93cy1hcy1jb3JyZWxhdGlvbi13aXRoLXN0b2Nrcy1zdHJlbmd0aGVuc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Moves Up to $22,000 as SEC Regulation Fears Ease - Bloomberg",
        "content": "Bitcoin hovered near $22,000 amid a bout of stability in crypto markets following a selloff sparked by worries about a US clampdown.\n\nThe largest token dipped less than 1% as of 1:10 p.m. Wednesday in Singapore. Smaller coins such as Ether , Cardano and Binance Coin were also little changed."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS90ZWNobm9sb2d5LzIwMjMvZmViLzE0L2ZjYS1hbmQtd2VzdC15b3Jrc2hpcmUtcG9saWNlLXJhaWQtY3J5cHRvLW9wZXJhdG9ycy1pbi11ay1maXJzdNIBcmh0dHBzOi8vYW1wLnRoZWd1YXJkaWFuLmNvbS90ZWNobm9sb2d5LzIwMjMvZmViLzE0L2ZjYS1hbmQtd2VzdC15b3Jrc2hpcmUtcG9saWNlLXJhaWQtY3J5cHRvLW9wZXJhdG9ycy1pbi11ay1maXJzdA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Feb 2023 08:00:00 GMT",
        "title": "Watchdog and West Yorkshire police raid crypto ATM operators in UK first - The Guardian",
        "content": "Authorities have raided several sites around Leeds as part of what is believed to be the UK’s first crackdown on illegally operated crypto ATMs.\n\nEvidence was gathered from multiple sites around the city that were suspected to be hosting machines allowing customers to buy or convert traditional currencies into cryptoassets including bitcoin.\n\nThe raids follow a joint investigation between the Financial Conduct Authority and the West Yorkshire police force’s digital intelligence and investigation unit. “The FCA will review evidence gathered during these visits and consider further potential enforcement action,” the regulator said.\n\nWhile the FCA does not regulate cryptoassets, it does require all firms dealing in crypto to register and prove they have effective anti-money laundering and terrorist financing controls.\n\nThere are no crypto ATMs registered with the FCA, meaning any crypto ATM operating in the UK is doing so illegally.\n\nDS Lindsey Brants of the cyber team at West Yorkshire police said the force issued a warning letter to operators, telling them to stop using the ATMs or risk being investigated under the UK’s money laundering regulations. The force then shared its findings with the FCA.\n\n“We are pleased to be able to work in partnership with the FCA in what we believe is a national first here in West Yorkshire,” Brants said.\n\nThe FCA said it was working with “multiple law enforcement partners”, including other local police forces as it continues to investigate other sites that may be hosting illegal crypto ATMs.\n\n“We will continue to identify and disrupt unregistered crypto businesses operating in the UK,” Mark Steward, the FCA’s director in charge of enforcement and market oversight, said.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\n“Crypto businesses operating in the UK need to be registered with the FCA for anti-money laundering purposes. However, crypto products themselves are currently unregulated and high-risk, and you should be prepared to lose all your money if you invest in them.”"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wMi0xNC9iaXRjb2luLW1pbmVycy11cy1iaXRjb2luLWFuZC1odXQtOC1tZXJnZS12aWRlb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Feb 2023 08:00:00 GMT",
        "title": "Watch Bitcoin Miners US Bitcoin and Hut 8 Merge - Bloomberg",
        "content": "00:00\n\nJamie, what do you think of this latest development in in that approach? I think it is what we expected to see it is. It's unfortunate. We had eight where a minor of an area and certainly would have would have liked to see it continue as a group work network. Mike, Mike, what do you think of the S.E.C.? Is deal with crack and the idea that staking as a service they see as a security? Echo that sentiment and the proof of stake allows concentration of larger funds just buying up simply the coin and having an influence on the networks, grassroots work is truly democratized. You have a network of miners globally contributing to networks and securing how the how of the platform performs. I'd love to double down on that with you, Jamie, because you would just kind of mention this idea where you had mined theorem as well. You know, what's the path forward? It was interesting to see a theory and prices really rebound. Even with that looming threat of greater regulatory oversight or crackdown, if you will. So what's the road ahead for assets outside of Bitcoin? I think it's really it's really difficult to say, and certainly clarity is something that the industry desperately needs in order for it to chart a more solid path forward. And you know, Michael, on that note as well to, you know, what does it do now that the book, both of your companies are put together in an industry that was so sorely bruised after last year, you are seeing this kind of price increase this year? What is that price increase in Bitcoin itself mean for the merger of both of your companies? We have a ton of synergies. We always held cuts the highest regard and with Jamie at the helm. Being able to be so disciplined throughout the bull markets, whereas the rest of the public peers were bought into the hysteria and bought very expensive hardware. The companies that come out as true winners are built in the bear markets. It's it's its it's maintaining that balance sheet and knowing how to be agile and navigate the downturns. What's your approach, Mike, to the energy usage debate? I know Jamie has long been a champion of greener mining at Hot 8. How do you approach this problem? Absolutely, it is shown within the sites that we operate out in New York. We're right at Niagara Falls, where over 90 percent hydro in Texas, we have sites that are behind the meter directly on the sites of the energy generation at the solar farms, out of wind farms. We partner with the energy companies, renewable energy companies. So, Jamie, in terms of your business, you've long benefited from the fact that you're not in the United States of America. And we just heard from Michael Shalom saying he's worried that the kind of regulation we're going to get post RTX is going to push businesses out. How do you view that in light of this combination? I think geographic diversity is is really important. We've long been exclusively in Canada really looking for the right entry point into the into the US and we believe we found the perfect partner in U.S. pick to do that. Jamie, do you think that after this merger there are more opportunities for consolidation? You know, a lot of the issues of last year was the unwillingness of capital markets to really open up to the crypto sector. A lot of nervousness around the mining sector. But you did see very interesting deals pop up. You saw interesting rescue financings. What are the capital markets and merger environments look like for you now as a bigger company? Yeah, I think we were expecting to see consolidation in this space. It was a little bit late to come, but we have seen some really interesting deals in mining in the last few months. And I think we're going to continue to see more eminent activity during the balance in 2023. Well, what about for you? I mean, is there anything that you could do to either raise more money or buy more assets as you've seen so many other companies struggle? I think our focus right now is entirely on getting this deal closed and bringing the companies together. But certainly I've been I've been on a growth trajectory and I don't see that as something that will change in a new hot post closing of the."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wMi0xNC9iaXRjb2luLW1pbmVycy11cy1iaXRjb2luLWFuZC1odXQtOC1tZXJnZS12aWRlb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Feb 2023 08:00:00 GMT",
        "title": "Watch Bitcoin Miners US Bitcoin and Hut 8 Merge - Bloomberg",
        "content": "00:00\n\nJamie, what do you think of this latest development in in that approach? I think it is what we expected to see it is. It's unfortunate. We had eight where a minor of an area and certainly would have would have liked to see it continue as a group work network. Mike, Mike, what do you think of the S.E.C.? Is deal with crack and the idea that staking as a service they see as a security? Echo that sentiment and the proof of stake allows concentration of larger funds just buying up simply the coin and having an influence on the networks, grassroots work is truly democratized. You have a network of miners globally contributing to networks and securing how the how of the platform performs. I'd love to double down on that with you, Jamie, because you would just kind of mention this idea where you had mined theorem as well. You know, what's the path forward? It was interesting to see a theory and prices really rebound. Even with that looming threat of greater regulatory oversight or crackdown, if you will. So what's the road ahead for assets outside of Bitcoin? I think it's really it's really difficult to say, and certainly clarity is something that the industry desperately needs in order for it to chart a more solid path forward. And you know, Michael, on that note as well to, you know, what does it do now that the book, both of your companies are put together in an industry that was so sorely bruised after last year, you are seeing this kind of price increase this year? What is that price increase in Bitcoin itself mean for the merger of both of your companies? We have a ton of synergies. We always held cuts the highest regard and with Jamie at the helm. Being able to be so disciplined throughout the bull markets, whereas the rest of the public peers were bought into the hysteria and bought very expensive hardware. The companies that come out as true winners are built in the bear markets. It's it's its it's maintaining that balance sheet and knowing how to be agile and navigate the downturns. What's your approach, Mike, to the energy usage debate? I know Jamie has long been a champion of greener mining at Hot 8. How do you approach this problem? Absolutely, it is shown within the sites that we operate out in New York. We're right at Niagara Falls, where over 90 percent hydro in Texas, we have sites that are behind the meter directly on the sites of the energy generation at the solar farms, out of wind farms. We partner with the energy companies, renewable energy companies. So, Jamie, in terms of your business, you've long benefited from the fact that you're not in the United States of America. And we just heard from Michael Shalom saying he's worried that the kind of regulation we're going to get post RTX is going to push businesses out. How do you view that in light of this combination? I think geographic diversity is is really important. We've long been exclusively in Canada really looking for the right entry point into the into the US and we believe we found the perfect partner in U.S. pick to do that. Jamie, do you think that after this merger there are more opportunities for consolidation? You know, a lot of the issues of last year was the unwillingness of capital markets to really open up to the crypto sector. A lot of nervousness around the mining sector. But you did see very interesting deals pop up. You saw interesting rescue financings. What are the capital markets and merger environments look like for you now as a bigger company? Yeah, I think we were expecting to see consolidation in this space. It was a little bit late to come, but we have seen some really interesting deals in mining in the last few months. And I think we're going to continue to see more eminent activity during the balance in 2023. Well, what about for you? I mean, is there anything that you could do to either raise more money or buy more assets as you've seen so many other companies struggle? I think our focus right now is entirely on getting this deal closed and bringing the companies together. But certainly I've been I've been on a growth trajectory and I don't see that as something that will change in a new hot post closing of the."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2lua2l0ZS1iaXRjb2luLWhhcmR3YXJlLXdhbGxldC1sb29rcy0xOTI3MjMyNDkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 14 Feb 2023 08:00:00 GMT",
        "title": "Coinkite's New Bitcoin Hardware Wallet Looks Like BlackBerry, Takes AAA Batteries - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nCanadian crypto hardware manufacturer Coinkite has designed a bitcoin hardware wallet reminiscent of an old-school BlackBerry phone straight out of the 2000s.\n\nBut the company says its new design reflects forward thinking on the tightest possible security measures and user-friendly features gleaned from customer feedback.\n\nThe soon-to-be-released device, dubbed Coldcard Q1, became available for pre-ordering on Feb. 9 and comes with a full keyboard, an LCD screen and an LED-illuminated QR code scanner.\n\nThe waffle-phone-style QWERTY keyboard gives off strong 2002 BlackBerry vibes and is supposed to cut down on so-called fat-finger errors when entering sensitive passwords, PINs and passphrases.\n\nRead more: Wasabi Wallet Will Pay You to 'Crack' a Bitcoin Wallet\n\nCoinkite added a battery compartment on the Q1’s rear side that fits three AAA batteries, so there’s no need for a tethered power supply, although a USB-C port is available for customers who prefer using a power cord.\n\nIt’s the company’s fifth iteration of a bitcoin hardware wallet, following the introduction of the MK line starting in 2018. The most-recent model, the Coldcard MK4, was released in February 2022.\n\nThe company aims to crack into the market-leadership ranks of hardware wallet makers, currently dominated by big names including Trezor and Ledger. But the overall market may be growing as more crypto investors seek out hardware wallets as an alternative to simply leaving coins on exchanges.\n\nOutsiders may scoff at the Q1’s bulky, throwback user interface or UX, but Coinkite says it intentionally came up with that anachronistic design after consultations with users of its smaller, slimmer MK4.\n\nWay more ppl than I expected like the bulky-QWERTY-non-pocketable mountain-man-devices like we do. 😆 — NVK ⚡️🌞 @nvk@nvk.org (@nvk) February 11, 2023\n\nThe exact size, weight and price of the Q1 will be confirmed in the near future, but eager users can already reserve the device with a $199 deposit. The retail price is not expected to be much higher than the deposit amount.\n\nStory continues\n\n“The Q1 was built mainly to help less advanced users,” Celia Cherif, a Coinkite business development representative, told CoinDesk in an interview. “We gathered their feedback from the MK4 and made everything more UX friendly for them in the Q1.”\n\nGrowing market for hardware wallets\n\nCoinkite’s roots in the Bitcoin space go all the way back to 2011, when co-founders Rodolfo\n\nNovak and Peter Gray stumbled across the Bitcoin white paper and later built a rudimentary bitcoin hardware wallet. The pair eventually incorporated as Coinkite, and the firm now produces and sells a suite of hardware and software Bitcoin products, including the MK4, which Cherif says is Coinkite’s best-selling product.\n\n“Coldcard sales have been higher than expected,” Novak wrote in a tweet. Coinkite declined to provide CoinDesk with official sales data.\n\nLast year’s implosion of Sam Bankman-Fried’s FTX crypto exchange triggered an exodus of customers from centralized exchanges to self-custody devices.\n\nOne crypto publication reported that two of the largest players in the hardware wallet space – Trezor and Ledger – captured a significant share of those spooked customers in November. According to the publication, Trezor reported a 300% increase in week-over-week sales while Ledger saw a six-fold increase in account creations for Ledger Live, the firm’s wallet management software.\n\nCoinkite also saw an uptick in sales, although it’s not clear by how much. “Bitcoiners are so resolute on bitcoin and so many are getting off exchanges,” Novak tweeted. “In all my years, I've never seen so much activity.”\n\nConvenience and 'air-gapping'\n\nThe Q1’s design revolves around convenience and security, especially “air-gapping,” which means isolating the device from potentially unsecured networks like Wi-Fi or Bluetooth.\n\nCherif says that some less-tech-savvy customers reported difficulties using the MK4. Many customers were fumbling to enter sensitive passphrases, struggling to scan bitcoin address QR codes, dealing with the hassle of connecting power cords and switching back and forth between microSD cards.\n\nWith that backdrop, Coinkite designed the Q1 to include two microSD slots for saving wallet seed phrases – a series of 12 to 24 random words used to “recover” or regain private keys in the case of accidental loss. The double microSD slots offer more secure data transfer than traditional USB-A connections (more commonly referred to as simply “USB”), which Cherif says are vulnerable to all sorts of sophisticated cyberattacks.\n\n“There’s a lot of vulnerabilities with USB data connectivity,” Cherif explained. “There's a website created just to monitor all the known vulnerabilities. The list is never-ending. These are vulnerabilities that are being actively exploited by malicious actors.”\n\nThe firm’s engineers included both AAA batteries and the USB-C port as power sources for the Q1. Cherif also emphasized that the Q1’s USB-C port is strictly reserved for power transmission and not data transfer.\n\n“If you choose to plug the USB-C cable into an Internet-connected device, it remains a much safer option than a USB cable because it doesn't have any data lines connected, only power,” Cherif said.\n\nCoinkite added a flashlight to the Q1 so users can easily scan Bitcoin QR codes (encoded Bitcoin addresses) in dim lighting.\n\nThe wallet has an LED QR code scanner instead of a video camera-based version. Coinkite says the choice was deliberate because cameras, being more technologically complex, are more prone to malicious hacks.\n\n“The thing is, the camera is an attack vector,” Cherif explained.\n\nA few Twitter users perusing details of the new device wondered out loud if the Q1’s large color LCD screen is able to display Ordinals, a new type of on-chain Bitcoin non-fungible token (NFT).\n\nOrdinals will look great on that big screen. — Mike In Space! (@mikeinspace) February 9, 2023\n\nFor now, the answer is “no,” although Coinkite is collaborating with Ordinals creator Casey Rodarmor on a project that uses a different Coinkite product – the Satschip – for Ordinals provenance (using a Bitcoin private key to prove ownership of an Ordinals NFT).\n\nRead more: Bitcoin Community Erupts in Existential Debate Over NFT Project Ordinals"
    }
]