[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMTcvYml0Y29pbi1kaXBzLWJlbG93LTMwMDAwLWFzLWludmVzdG9ycy1hd2FpdC1iYW5rLWVhcm5pbmdzLmh0bWzSAWJodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNC8xNy9iaXRjb2luLWRpcHMtYmVsb3ctMzAwMDAtYXMtaW52ZXN0b3JzLWF3YWl0LWJhbmstZWFybmluZ3MuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin dips below $30,000 to start the week as crypto investors refocus on economic concerns - CNBC",
        "content": "Standard Chartered predicts bitcoin could fall to $5,000 in 2023 as part of its research on potential market surprises next year.\n\nCryptocurrencies fell on Monday as investors put excitement from Ethereum's \"Shapella\" upgrade behind them and refocused on upcoming bank earnings and recession concerns.\n\nBitcoin fell more than 3.3% to $29,478.54, according to Coin Metrics, falling below the key $30,000 it hit last week for the first time since June. Meanwhile, ether was lower by 2.4% but maintained the $2,000 it broke through last week.\n\nCrypto is coming off a winning week in which prices were boosted by optimism around Ethereum's latest tech upgrade, dubbed \"Shapella\" (also known as \"Shanghai\"). The update is meant to bring greater liquidity to the network by allowing \"locked up\" ether to be withdrawn and ultimately draw in more institutional interest in the long term. Bitcoin and ether advanced 8% and 12%, respectively, for the week.\n\nThis week, it wouldn't be surprising to see a small correction in prices, according to Yuya Hasegawa, crypto market analyst at Japanese bitcoin exchange Bitbank, and there could be some selling pressure as some investors may want to take profits from the previous week.\n\nWhile crypto was rallying, \"Friday's U.S. stock market showed unstable movements as stronger-than-expected consumer sentiment and Fed's Waller's speech strengthened the possibility of another rate hike in May,\" Hasegawa said. \"Nevertheless, the Fed Funds futures market has already priced in more than 80% chance of a 25bp hike in May, so pressures from macro factors on the price of bitcoin is expected to be limited.\"\n\nCrypto investors are watching bank earnings this week for more insight about the health of the sector and possibility of a coming recession. Several Fed officials are scheduled to speak this week too.\n\n\"We haven't seen crypto perform in a high-rate, slowing growth environment until now,\" said Callie Cox, analyst at investing company eToro. \"It's anyone's guess how crypto acts during a recession.\"\n\nFor this week, any downside potential \"should not be severe\" or keep bitcoin from continuing on its uptrend, Hasegawa said."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMTcvYml0Y29pbnMtY2hhcnQtaGFzLXNvbWUtZWVyaWUtcGFyYWxsZWxzLXRvLWdvbGQtaW4tdGhlLTE5NzBzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's chart has some eerie parallels to gold in the 1970s - CNBC",
        "content": "Many investors have dismissed the notion that bitcoin could be a type of digital gold since the cryptocurrency has been trading like a speculative risk asset for much of the past two years. But about 50 years ago, gold did the same thing, Morgan Stanley said in a recent note. If bitcoin's current moves continue to follow those of gold in the 1970s, the cryptocurrency could be in for some tough times ahead. In 1971, individuals could no longer convert U.S. dollars to a specified amount of gold. Since 2008, governments have become more reliant on central banks creating new fiat currency — money that isn't backed by a commodity — to provide support in times of crisis, according to Morgan Stanley's note. That's different from bitcoin, which has a limited supply. In the '70s, \"gold was tracking the rising rate of consumer price inflation (CPI), which was largely a result of the recent explosion of fiat money supply,\" said Sheena Shah, a strategist at Morgan Stanley and a coauthor of the note. \"Bitcoin, on a logarithmic scale, has so far followed a similar path to the price speculation of gold in the 1970s, which also seemed to follow a four year cycle.\" Starting in 1971, gold prices quadrupled within four years as the U.S. dollar money supply grew rapidly, the strategist said. \"That wasn't the height of the speculation, however: from August 1976 to January 1980, the price of gold rose eightfold from $102 to $850.\" \"As the gold price was still managed for the first few years, the similarities may be a statistical coincidence … more likely, in our view, is that both were driven by similar speculation cycles,\" she added. Bitcoin fans have long highlighted its potential to act as a \"digital gold\" because it's divisible, scarce and doesn't rely on a central issuer. They also once argued that bitcoin offered a hedge against equities, but last year's market havoc threw cold water on that idea as the cryptocurrency's correlation with stocks hit an all-time high . At the end of March, that correlation fell to its lowest since 2021 , while bitcoin's correlation with gold has been climbing. After the Federal Reserve loosened monetary policy to support the economy at the start of the Covid pandemic, bitcoin outperformed gold 2.9x over the three-and-a-half-year period, Bernstein recently noted. This year, banking crisis fears in the U.S. helped push bitcoin to even greater gains. —CNBC's Michael Bloom and Gabriel Cortes contributed reporting"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLW90aGVyLWNyeXB0by1mYWxsLTA0MTczODg1My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether, other crypto fall as SEC waves big stick; Dogecoin gains; U.S. equity futures flat - Yahoo Finance",
        "content": "Bitcoin fell in Tuesday morning trading in Asia, but held above the US$29,000 mark. Ether and most other top 10 non-stablecoin cryptocurrencies dipped amid concern the regulatory crackdown by the U.S. Securities and Exchange Commission (SEC) is spreading after it sued crypto exchange Bittrex on Monday. Despite the concern, Dogecoin, Polkadot and Litecoin gained. U.S. equity futures traded flat in Asia after Wall Street moved higher on Monday. China’s GDP for the first quarter out Tuesday beat expectations with growth of 4.5% on year, compared with forecasts for a 4% gain, but stock markets in the region showed little response.\n\nSee related article: US SEC investigates crypto exchange Bittrex for potential regulatory violation: WSJ\n\nBitcoin fell 1.61% to US$29,376 in the 24 hours to 09:00 a.m. in Hong Kong, posting a loss of 1.84% over the past seven days, according to CoinMarketCap data.\n\nEther dipped 0.38% to US$2,074, but is up 8% on the week following a run of buying related to the Ethereum blockchain upgrade last Wednesday to enable the withdrawal of staked Ether.\n\nDogecoin shrugged off the overall down market, gaining 2.96% to US$0.0913 and adding 7.61% for the week. Sentiment around the memecoin got a lift as Twitter – led by Dogecoin fan Elon Musk – officially enabled stock and cryptocurrency trading on the platform on Monday in a partnership with multi-asset investment firm eToro.\n\nSolana dropped 2.02% to US$24.41, but is holding a gain of 16.56% for the week. U.S.-based digital currency asset manager Grayscale Investments opened Grayscale Solana Trust on Monday for public trading on OTC Markets under the symbol: GSOL. The Trust offers investors exposure to the price movement of Solana without holding the asset directly.\n\nThe crypto market was hit by renewed regulatory concerns, as the U.S. SEC charged Bittrex and its co-founder William Shihara for violation of securities laws. Other crypto firms including Kraken, Coinbase, Paxos and Binance have also been targeted by U.S. regulators this year.\n\nSEC Chair Gary Gensler will speak before Congress on Tuesday on his approach to regulating digital assets. U.S. Representative Warren Davidson has said the SEC needs to be restructured and is reported to be planning legislation that would include removing Gensler from his role as chairman.\n\nSEC member Hester Peirce on Friday criticized her agency’s proposal to expand the definition of an “exchange” to decentralized platforms that trade cryptocurrencies, calling it an effort to stymie development of new technology in a statement titled “Rendering Innovation Kaput.”\n\nThe total crypto market capitalization dropped 1.03% in the past 24 hours to US$1.25 trillion. The total trading volume over the last 24 hours rose 13.65% to US$44.43 billion.\n\nIn the NFT market, the Forkast 500 NFT index inched up 0.11% to 4,052.59 in the 24 hours to 09:00 a.m. in Hong Kong, a gain of 2.84% for the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day. It is managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nU.S. stock futures traded flat as of 9:00 a.m. in Hong Kong. The Dow Jones Industrial Average dipped 0.03%. The S&P 500 futures inched 0.05% lower. The Nasdaq Composite Index dropped 0.12%.\n\nThe three U.S. equity indexes edged higher on Monday on mixed economic data and generally better than expected bank earnings, after logging gains the past week. Equity investors have more earning reports this week – Bank of America, Goldman Sachs, Tesla, IBM and Netflix – for a gauge of the state of the U.S. economy and how that may influence the Federal Reserve policy on raising interest rates."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zcGhlcmUtM2QtY29ycC1wcm92aWRlcy1iaXRjb2luLTExMzAwMDYxNS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Sphere 3D Corp. Provides Bitcoin Production and Mining Updates for March 2023 - Yahoo Finance",
        "content": "Production grew month over month at 37.35 bitcoin\n\nOperations achieved 91.0 BTC/EH efficiency\n\nUptime was 94 % For March 2023\n\nBitcoin produced 1Q23 were 110.25\n\nToronto, Ontario--(Newsfile Corp. - April 17, 2023) - Sphere 3D Corp. (NASDAQ: ANY) (\"Sphere 3D\" or the \"Company\"), dedicated to becoming the leading carbon-neutral Bitcoin mining company operating at an industrial scale, provides results of its Bitcoin mining operation for the month ended March 31, 2023.\n\nCEO Comments\n\n\"We produced bitcoin at a steady rate during March. We are proud to announce a partnership with Rebel Mining who will be taking a large portion of our fleet. Their depth and breath of experience make them a perfect partner to deploy the rest of our fleet. With the miners currently being deployed to Missouri in March and April, our fleet will be fully homed, and upon energization, we will be at approximately 1.5EH/s. We believe we will have a significant portion of this EH/s energized by end of May.\" Said Patricia Trompeter, CEO of Sphere 3D. \"We are looking forward to working with Rebel as we install and energize the remainder of our Fleet.\"\n\n\"Rebel Mining Company has state of the art facilities managed by a world class leadership team. We are excited to partner with Sphere 3D who will deploy in our Missouri and Texas facilities over the next 30 - 60 days. We look forward to getting them energized and bringing our depth of crypto mining knowledge to Sphere. Our commitment to our customers and a high operational standard sets us apart in this industry and we are looking forward to working together.\" Said Neil Galloway, COO Rebel Mining.\n\nCompute North Update\n\nWe continue to work with Compute North and their bankruptcy lawyers for the return of our deposit through the Chapter 11 process. As previously disclosed, we filed our financial claim with the US Bankruptcy Court in February 2023, and must wait for the process to continue.\n\nMiner Delivery Update\n\nWe have begun deployment to several hosting partners for May energization. We are currently deploying miners to a facility in Missouri for anticipated energization in May. In addition, we expect to deploy the remaining fleet to an existing hoster be hashing in the next 60 days. With deployments above, we will have successfully placed the majority of our fleet.\n\nStory continues\n\nCore Scientific Update\n\nAs previously disclosed by the Company, Sphere 3D filed an arbitration request against Core Scientific (\"Core\") on its claim for the non-refunded portion of the Company's advanced deposits. Core subsequently filed for restructuring under Chapter 11 on December 21, 2022, citing burdensome debt obligations as a result of rising energy prices and the decline in the price of bitcoin. We continue to work with the US Bankruptcy court to monitor the progress. Sphere 3D has engaged counsel and is vigorously pursuing every available option to recover its funds.\n\nBitcoin Production and Holdings Update\n\nIn March 2023, Sphere 3D produced 37.35 Bitcoin, or 1.20 per day. Sphere 3D's mining fleet operated at 91.0 BTC/EH efficiency.\n\nDuring March 2023, the Company employed a Hybrid strategy of liquidating during bitcoin price upswings and HODL for the remainder of its holdings. The Company used approximately 28.33 Bitcoin during the month to fund working capital, and prepaid hosting deposits for our S19J Pros.\n\nBitcoin held by the Company represents a fair market value of approximately $0.6 million based on the Bitcoin price of $28,489 on March 31, 2023. As of March 31, 2023, the Company was operating approximately 4,330 S19j Pros miners delivering a production capacity of approximately 446 PH/s.\n\n\n\n\n\n\n\n\n\nFigure 1\n\n\n\nTo view an enhanced version of this graphic, please visit:\n\nhttps://images.newsfilecorp.com/files/1705/162628_sphere_fig1.jpg\n\nCEO Closing Remarks\n\n\"We continue to make progress as we deploy the rest of our fleet. When fully energized we increase our production to 1.5 EH/s. We focused on execution in March to prepare ourselves for a strong second quarter. I am excited to get all 1.5EH/s up and going in second quarter, and our efforts in the first quarter made this possible!\"\n\nAbout Sphere 3D\n\nSphere 3D Corp. (NASDAQ: ANY) is a net carbon-neutral cryptocurrency miner with decades of proven enterprise data-services expertise. The Company is growing its industrial-scale mining operation through the capital-efficient procurement of next-generation mining equipment and partnering with best-in-class data center operators. Sphere 3D is dedicated to growing shareholder value while honoring its commitment to strict environmental, social, and governance standards. For more information about the Company, please visit Sphere3D.com.\n\nForward-Looking Statements\n\nThis communication contains forward-looking statements within the meaning of Section 27A of the Securities Act, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements generally related to future events including the timing of the proposed transaction and other information related proposed transaction. In some cases, you can identify forward-looking statements because they contain words such as \"may,\" \"will,\" \"should,\" \"experts,\" \"plans,\" \"anticipates,\" \"could,\" \"intends,\" \"target,\" \"project,\" \"contemplates,\" \"believes,\" \"believes,\" \"estimates,\" \"predicts,\" \"potential,\" or \"continue\" or the negative of these words or other similar terms or expressions. Expectations and beliefs regarding matters discussed herein may not materialize, and actual results in future periods are subject to risks and uncertainties that could cause actual results to differ materially from the projected. The forward-looking statements contained in this communication are also subject other risks and uncertainties, including those more fully described in filings with the SEC, including Sphere 3D's reports filed on Form 10-K and Form 8-K and in other filings made by Sphere 3D with the Sec from time to time and available at www.sec.gov. These forward-looking statements are based on current expectations, which are subject to change.\n\nSphere 3D Contacts\n\nKurt Kalbfleisch CFO, Sphere 3D\n\nInvestor.relations@sphere3d.com\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/162628"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9tZWV0LXBlb3BsZS1nZXR0aW5nLXJpY2gtYml0Y29pbi0xODE2NTA0NTEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Apr 2023 07:00:00 GMT",
        "title": "Meet 4 regular people who got rich from bitcoin - Yahoo Finance",
        "content": "For Eddy Zillan’s bar mitzvah in 2012, his parents gave him $5,000 to start an investment fund. They expected him to start dabbling in stocks. Instead, he began buying cryptocurrencies like bitcoin and ethereum.\n\nEddy saved up another $7,000 from summers spent working at a tennis club and other jobs, adding that to his investment fund for a total $12,000 in principal.\n\nAnybody who has been following cryptocurrencies knows where this story is going: Eddy’s $12,000 investment is now worth well over $500,000, a return exceeding 4,100% in just a few years.\n\n“I don’t know if he’s a prodigy, but he’s close,” says Eddy’s father, Gary Zillan. Eddy, now 18, is a high school senior in Orange, Ohio, near Cleveland. He hopes to study dentistry next year at Case Western Reserve University. But if that doesn’t work out, he has a Plan B, since he just launched a company that provides tutorials and insights on cryptocurrencies. “Hopefully he’ll be a multimillionaire by the time he’s my age,” says his father, who is 46.\n\nEddy Zillan, 18, of Orange, Ohio, has amassed well over $500,000 worth of bitcoin and other cryptocurrencies. (Photo courtesy of Eddy Zillan)\n\nBitcoin and other cryptocurrencies are suddenly the hottest investment since the dot-com bubble, after a stunning surge in value during the last year.\n\nThe price of bitcoin, the most well-known cryptocurrency, has soared by more than 700% in 2017. Ethereum is up a mind-boggling 3,900% — and early purchasers are suddenly watching the zeroes multiply on their accounts. Many crypto investors are reluctant to talk about their holdings, since alt-currencies are still associated with illicit activity, and they tend to appeal to non-traditionalists in the first place. But we found some willing to tell us their experiences. There are also plenty of detractors who insist cryptocurrencies are Ponzi schemes or worse. Yet regulators may soon bestow validity on cryptocurrencies by allowing broader investments, such as exchange-traded funds (ETFs), to track their value.\n\nThe origins of bitcoin\n\nBitcoin is a digital payment system launched in 2009 by a person or group using the name Satoshi Nakamoto. A network of coders with powerful computers has slowly “mined” more bitcoin since then by running complex computations that adhere to a set of founding principles, making bitcoin a kind of crowd-sourced currency. The market value of all bitcoin in the world is around $132 billion at current prices, roughly comparable to the current value of McDonald’s (MCD).\n\nStory continues\n\nOther cryptocurrencies, sometimes referred to as “altcoins,” have emerged as well, including ether, the token of the blockchain network ethereum ($32 billion in market cap), ripple ($9 billion), litecoin ($3.7 billion) and dash ($3.3 billion).\n\nIn a recent Yahoo Finance survey, 77% of respondents told us they have never purchased bitcoin — but of those, 11% said they’re planning to, and 38% said they’re thinking about it. As more people buy in, that interest alone could send the crypto rally even higher.\n\n[See the full results of our bitcoin survey, conducted online Nov. 10-13.]\n\nOrdinary people can buy cryptocurrencies through services like Coinbase, SpectroCoin or Kraken, usually by linking a bank account or credit card and following simple instructions. (Disclosure: I own a small amount of bitcoin.)\n\nOf 1,011 poll respondents saying they’ve purchased Bitcoin, 71% have made money. Source: Yahoo Finance survey conducted via SurveyMonkey\n\nCritics such as JPMorgan Chase CEO Jamie Dimon and hedge-fund titan Ray Dalio see cryptocurrencies as a craze that will eventually implode, akin to tulips or Enron. But Bill Gates, Richard Branson, and Mark Cuban are believers, and many investors think bitcoin and other digital currencies are like the Internet in 1995 — a transformative technology about to erupt.\n\nThe money is certainly real.\n\nBitcoin as currency\n\nPeter Saddington of Atlanta first read about bitcoin in 2011, and bought some for less than $3 per coin. With bitcoin now trading at around $7,500, the return on those early investments is around 250,000%. “I’ve never seen anything like this,” says Saddington, 35, an entrepreneur who has a bachelor’s degree in computer science and three master’s degrees. “What solidified my confidence that this is worth investing in is that the code is based on math. It can’t really be turned off.”\n\n[Had a wild experience with cryptocurrencies? Let us know! Email us at rickjnewman@yahoo.com.]\n\nIn October, Saddington cashed out 45 bitcoins to buy a 2015 Lamborghini Huracán, for the equivalent of about $238,000. He and the seller made the transaction in bitcoin, without using a traditional bank. The transaction fees totaled $7.50.\n\nSaddington, who runs a cryptocurrency social network called TheBitcoin.pub, deliberately sought a supercar he could purchase with bitcoin in order to tout the credibility of the currency. “Buying the Lambo with bitcoin is proof it can be used for real transactions, buying really cool stuff,” he says. “It’s not only used by criminals.”\n\nAs for how much bitcoin he still holds, he says: “That’s for me to know and you to wonder about.”\n\nPeter Saddington of Atlanta, 35, in front of the Lamborghini Huracán he bought in October for 45 Bitcoin, or $238,000.\n\nA California wine executive we interviewed also tried to buy a fancy car with bitcoin — and he’s grateful the transaction fell through.\n\nThe 55-year-old saw a friend ask about bitcoin in a Facebook post a few years ago. He researched it and began buying a few coins per month, at prices ranging from $225 to $800, until he accumulated about 80 bitcoins. The wine executive had always wanted an Audi A8L, and in 2016 he saw a slightly used model advertised for $50,000. Since bitcoin had fallen to around $600, that was almost exactly how much bitcoin he had. He sold all his coins to finance the car.\n\nThe owner, however, refused to make any concession on price, which scotched the deal. So, what to do with the $50,000? He decided to put it back into bitcoin, even though the price had risen to $900 by then. At that price, he ended up with just 60 bitcoins — but that’s now worth more than $450,000.\n\n“I’m more than $120,000 short because I wanted that stupid car,” the wine executive says. “But by not buying that car, I made almost half a million in profit.”\n\n[Editor's note: This story originally identified the wine executive. We removed identifying information in April 2023 after he received threats and demands to turn over his bitcoin to a criminal enterprise.]\n\nOthers have invested in cryptocurrencies far more aggressively — with some paying a steep price. When the Mt. Gox digital exchange collapsed in 2014, more than 24,000 customers lost essentially all their holdings. Some customers had dozens or hundreds of bitcoin stored at Mt. Gox, with losses approaching $1 million or more at today’s value.\n\nMore than half of the respondents to our survey think bitcoin is currently overvalued. Source: Yahoo Finance survey conducted via SurveyMonkey\n\nIn our Yahoo Finance survey, 71% of bitcoin buyers said they’ve made money on their investment. But 8% said they had lost money. The median amount of the loss was $500, but some listed five- and six-digit losses. Of those who have made money on bitcoin, the median gain was $3,000, with a few reporting seven-figure hauls.\n\nThe obvious question now is whether the value of bitcoin will continue going up, or whether a speculative bubble is about to burst.\n\nCounting on bitcoin\n\nMany early buyers think bitcoin is only getting started, and at some point will become a mainstream currency used routinely. “It’s like the early 1990s, when people were asking, ‘where is this internet thing going to go?’” says a New York bitcoin investor who asked we identify him by his nickname, Duke. “We’re still in the early lunatic adopter phase, slowly shifting to the early adopter phase.”\n\nDuke, who teaches technology at a high school, first tried to buy bitcoin in 2011, but a snafu with a PayPal transaction prevented the transaction. The 30-year-old figured he’d get to it later, but the price jumped to more than $1,000 per coin and he assumed he missed the boat. The price came back down, however, and he eventually bought 21 bitcoins, at prices as low as $200.\n\nAt one point, he spent an entire paycheck buying bitcoin.\n\nNow, with a portfolio worth nearly $160,000, he’s reluctant to cash out even a tiny fraction of coin, for fear of missing out on even bigger gains in the future. “A lot of bitcoin holders are kind of afraid to spend it,” he says. “You could end up spending the equivalent of $2 million on a couple of pizzas. Twenty or thirty years from now, if I have grandkids, maybe I’ll be able to pay for their colleges.”\n\nBy then, maybe schools will even accept tuition payments in bitcoin.\n\nRead more:\n\nRick Newman is the author of four books, including Rebounders: How Winners Pivot from Setback to Success. Follow him on Twitter: @rickjnewman"
    }
]