[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTI4L2EtY2F0aGllLXdvb2QtZXRmLWp1c3Qtb3ZlcmhhdWxlZC1pdHMtYml0Y29pbi1yZWxhdGVkLWhvbGRpbmdz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "A Cathie Wood ETF Just Overhauled Its Bitcoin-Related (BTC) Holdings - Bloomberg",
        "content": "One of Cathie Wood ’s funds has executed a massive shake-up to its Bitcoin-related holdings, selling off its remaining position in the Grayscale Bitcoin Trust because of uncertainty over whether it will be able to successfully convert into an exchange-traded fund.\n\nThe ARK Next Generation Internet ETF sold all of its remaining 2.25 million shares of the Grayscale Bitcoin Trust on Wednesday, according to data compiled by Bloomberg. The same day, it bought 4.32 million shares of the ProShares Bitcoin Strategy ETF, which invests in Bitcoin futures, according to the investment firm’s daily data, making it the second-biggest holder of the fund."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vYml0Y29pbi1taW5lcnMtZXhwYW5kLW9wZXJhdGlvbnMtcGVuZGluZy0xNDU2NTA2NzAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin miners expand operations on pending spot bitcoin ETF - Yahoo Finance",
        "content": "Shares of crypto mining operators Riot Blockchain (RIOT) and Marathon Digital Holdings (MARA) are popping off on the prospects of Securities and Exchange Commission (SEC) regulators approving a spot bitcoin ETF (BTC-USD).\n\nYahoo Finance Reporter Madison Mills joins the Live show to discuss bitcoin miners' plans to expand operations on this pending news and how their stocks have exponentially outperformed bitcoin and other digital asset companies in 2023.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nVideo Transcript\n\n[VIDEO LOGO]\n\nBRAD SMITH: Investors are trying to cash in to the crypto rush ahead of a possible Spot Bitcoin ETF approval next month by buying into Bitcoin mining stocks. So much so that miners are outperforming crypto exchanges and Bitcoin this year. For more on this, we've got Yahoo Finance's Madison Mills here. Maddie, what do we know about this and why this move is taking place right now?\n\nMADISON MILLS: Yeah, guys. I remember a few years ago, Dan Ives explaining to me that during a gold rush, you don't want to buy the gold. You want to buy the picks and shovels. And that's exactly what we're seeing in this Bitcoin miner stock outperformance. These gains are just remarkable here. You've got Marathon Digital Holdings up 800%, Riot Platforms up 400% year-to-date. Both of those obviously outperforming those digital currencies themselves given some of the gains there. Bitcoin itself having 160% increase in 2023.\n\nNow, what's interesting is this is an energy intensive process. It involves a lot of specialized computers. So miners are expanding their operations to boost Bitcoin production. That's of course, in anticipation of that regulatory approval of the Spot Bitcoin ETF, which could lead to a lot more demand for that Bitcoin itself.\n\nAnd as you can see here, a lot of firms on the street awaiting that approval. So these firms are anticipating that, and especially Marathon Digital and Riot anticipating that. And they're investing in the technology that would be needed to support that increase in demand so that they're ready when the time comes.\n\nStory continues\n\nBRIAN SOZZI: And this may not be an end of January thing or end of February in terms of the Spot Bitcoin ETF approval. I mean, we're getting ready to head out to the World Economic Forum in Davos. And a lot of folks that we're talking to in the lead up think this could happen within two weeks, Brad.\n\nBRAD SMITH: And I think the other thing is what could take place in April of 2024, which is the halving. And one of the huge things that I've been tracking is for all of these miners right now, the halving is going to create even more costs for them because you essentially look at the computing power. If you're looking at a reward that gets cut in half for the operation of mining, then you're essentially doubling the costs for mining.\n\nAnd so for a lot of these operators out there, there could be another inkling of a thought out there within the markets of which one of these miners looks most apt to be acquired by a larger player out there, perhaps a major bank, perhaps one of the firms that's applied for, a Spot ETF, Bitcoin ETF as well because then that would increase the number that they actually have in their own holdings as well here.\n\nSo I think that's one other thought that might be permeating out there or at least rumbling out there in the market as of right now, especially going into that halving that set to take place or expected in April of 2024 marathon, as you were mentioning then, as we were talking about them. They just made an acquisition about $179 million worth of Bitcoin mining operations. So that is one particular thought that struck me this morning that could come forward as well here that's perhaps pushing this play.\n\nBRIAN SOZZI: And if there's any positive here besides the obvious, at least this is being driven by a potential catalyst. This is not the broader stock market taking off trading at record highs on hopes for rate cuts, and that's dragging in like the likes of cryptocurrencies. There's some real potential here to unlock a lot of value with these names if that ETF is approved.\n\nMADISON MILLS: That's a great point. It's one of the only names that we've talked about this morning that's not going to be driven by what Jay Powell does, which can be an important thing for investors to think about in their portfolio mix."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy80LXN0b2Nrcy13YXRjaC1iaXRjb2luLWxvb2tzLTEzMTIwMDkwNS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "4 Stocks to Watch as Bitcoin Looks Poised for a 2024 Rally - Yahoo Finance",
        "content": "The cryptocurrency market has been on a rally this year, further accelerating over the past two months. Investors' sentiments are high on hopes that the Federal Reserve will soon end its monetary tightening campaign, which is expected to boost the cryptocurrency market further.\n\nOn Dec 26, Bitcoin (BTC), the world’s most prominent and popular cryptocurrency, rallied above $43,000 after hitting $44,000 earlier this month. Other major cryptocurrencies like Ethereum (ETH), Cardano (ADA) and Dogecoin (DOGE) have also been on a rally.\n\nYear to date, Bitcoin, Ethereum, Cardano and Dogecoin have returned 157.2%, 86.5%, 146.7% and 31%, respectively.\n\nThis year has been full of positive news for the crypto market, although prices were rangebound for a couple of months as investors failed to gauge the Fed’s next move with its interest rates.\n\nHowever, the Federal Reserve hasn’t hiked interest rates in its past three policy meetings after raising rates by 525 basis points as inflation has shown signs of steep decline over the past year.\n\nThis has raised hopes that the Federal Reserve will soon end its interest rate hiking policy. The central bank has also hinted at multiple rate cuts in 2024, which could be as many as three.\n\nHigher interest rates negatively impact growth-oriented sectors, which include technology, consumer discretionary industries and cryptocurrencies.\n\nBesides, investors are confident about an imminent approval from the Securities and Exchange Commission (SEC) for a Bitcoin exchange-traded fund (ETF). The approval is expected to wield a substantial impact, bolstering the cryptocurrency market.\n\nStocks to Watch\n\nCoinbase Global, Inc. COIN offers financial infrastructure and technology to support the global cryptocurrency economy. COIN provides a main financial account for consumers in the crypto space, a marketplace with liquidity for institutional crypto asset transactions, and technology and services for developers to build crypto-based applications and accept cryptocurrencies securely as payment.\n\nStory continues\n\nCoinbase Global’s expected earnings growth rate for next year is 30.5%. The Zacks Consensus Estimate for current-year earnings has improved 45.7% over the last 60 days. Coinbase currently carries a Zacks Rank #2 (Buy).\n\nBlock Inc. SQ is an online digital and mobile payment platform for consumers and merchants and is the parent company of Square and Cash App. The users of Cash App can buy, sell, send and receive Bitcoin. In addition, SQ’s decentralized tbd platform allows developers to build decentralized finance applications to run on programmable blockchains. SQ is also one of the largest Bitcoin investors.\n\nBlock has an expected earnings growth rate of 53.7% for next year. The Zacks Consensus Estimate for current-year earnings has improved 16.6% over the last 60 days. SQ currently carries a Zacks Rank #2.\n\nNVIDIA Corporation NVDA is a major player in the semiconductor industry and has been one of the standout success stories of 2023. As a leading designer of graphic processing units (GPUs), the value of the NVDA stock tends to surge in a thriving crypto market. This is primarily due to the crucial role that GPUs play in data centers, artificial intelligence, and the mining or production of cryptocurrencies.\n\nNVIDIA’s expected earnings growth rate for next year is 61.5%. The Zacks Consensus Estimate for current-year earnings has improved 14.4% over the last 60 days. Currently, NVIDIA has a Zacks Rank #2. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here\n\nInteractive Brokers Group, Inc. IBKR is a global automated electronic broker. IBKR executes, processes and trades in cryptocurrencies. IBKR’s commodities futures trading desk also offers customers a chance to trade cryptocurrency futures.\n\nInteractive Brokers Group has an expected earnings growth rate of 5.1% for next year. The Zacks Consensus Estimate for current-year earnings has improved 0.5% over the last 60 days. IBKR currently has a Zacks Rank #3 (Hold).\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nInteractive Brokers Group, Inc. (IBKR) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nBlock, Inc. (SQ) : Free Stock Analysis Report\n\nCoinbase Global, Inc. (COIN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ncmF5c2NhbGUtY2VvLWZvcmVzZWVzLWJpdGNvaW4tcHJpY2UtMTUwMDAwNjQ3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Grayscale CEO Foresees Bitcoin Price Surging to $55k, Ethereum and Everlodge Poised for Substantial Growth - Yahoo Finance",
        "content": "News Direct NYC --News Direct-- Everlodge\n\nThe future for crypto still looks bright. Allied Market Research released a report that the cryptocurrency market value is about to triple by 2030, hitting a whopping $4.94 billion. What's fueling this crypto rocket? According to Allied, it's the focus of cryptocurrency on remittances and global payments taking the lead – put in one word, utility.\n\nFrom all indications, cryptocurrency is gearing up to be a big player in the future of global finance; but that's 7 years away from now according to the AMR. However, in the near term, investors are eager to know what lies ahead in 2024.\n\nNotably, Bitcoin (BTC), Ethereum (ETH), and the recently emerged presale utility-focused gem, Everlodge, have all demonstrated the potential for substantial returns. While the reasons behind their promising prospects are quite evident, let’s take a quick dive to see why these projects rank among the best crypto investments to consider ahead of 2024.\n\nGrayscale CEO Optimistic on Bitcoin While Crypto Wizard Target Remains $55,000 for Bitcoin in Q1 2024\n\nGrayscale CEO Michael Sonnenshein is seeing big potential for Bitcoin (BTC) once the U.S. Securities and Exchange Commission (SEC) gives the thumbs up to a spot market BTC exchange-traded fund (ETF).\n\nIn a recent CNBC interview, Sonnenshein, though not one to throw around price predictions, emphasizes the prevailing optimism in the market. According to him, a substantial number of investors are jumping on the Bitcoin bandwagon and integrating it into their portfolios. As we anticipate the potential approval of the ETF, he believes it will be a game-changer, unlocking opportunities for a significant portion of the investment community.\n\nAs per price predictions, analyst Crypto Wizard posted on X, talking about a potential dip in Bitcoin price below the $40k threshold in the weeks ahead. They note that in the event of any deviation from this prediction, a decisive break above $46k for Bitcoin would be the game-changer. Despite these short-term fluctuations, their overall target stands firm at $55k for Bitcoin price by the first quarter of 2024.\n\nStory continues\n\nEthereum Looks Bullish for 2024\n\nThe immense popularity of the Ethereum (ETH) network has positioned it among the leading altcoins in today's market. Its widespread appeal is not the only factor contributing to its positive sentiment; Ethereum also benefits from a history of resilience and market dominance.\n\nWith a current price of $2,230, Ethereum has experienced significant growth in the past month, reaching a peak of around $2,367 to mark the highest point of the year. While the overall bullish momentum in the cryptocurrency market may be waning, Ethereum price has managed to remain relatively stable, with a nearly 2% increase over the past week.\n\nHowever, considering the recent drop of over $100 from its peak, investors should be prepared for a potential further correction. Yet, given Ethereum's historical price resilience and strong market presence, it is reasonable to expect a more stable price trajectory leading up to the new year.\n\nEverlodge Has Lofty Plans To Take Charge in Q1 2024\n\nEverlodge (ELDG) emerged as a revolutionary force in the real estate realm, positioned to revolutionize the $280 trillion industry by tackling long-standing challenges. Traditionally, the prohibitively high entry costs, often reaching millions of dollars, combined with a lack of transparency and liquidity, have created barriers for numerous potential investors.\n\nEverlodge's DeFi property marketplace directly confronts these challenges within the travel property sector. Through the innovative approach of listing properties as NFTs on its platform, Everlodge introduces fractionalized ownership, allowing investors to purchase NFT fractions representing a percentage of a property. Imagine owning 25% of a property generating $6,000 monthly, resulting in a $1,500 passive income.\n\nIn essence, Everlodge not only breaks down barriers but also provides investors with the opportunity to access equity in some of the world's most luxurious travel properties and you can join in for only $0.027.\n\nFurthermore, industry experts predict a potential 10X surge in Everlodge's project valuation if the company successfully achieves crucial milestones. This projection highlights the anticipation surrounding Everlodge's transformative initiatives and underscores the potential for significant growth, positioning it as one of the best crypto investments leading up to 2024.\n\nLooking ahead, the probability of a positive upturn in cryptocurrency in 2024 is very much palpable and projects like Bitcoin, Ethereum, and Everlodge have everything to fight for to become the best coins to invest in 2024.\n\nFor more information about the ongoing Everlodge (ELDG) Presale, please visit their website.\n\nEverlodge provides you with a seamless approach to fractional investing in vacation rentals, eliminating the complexities associated with traditional real estate investment. Our innovative platform revolutionizes the way people invest in second homes.\n\nDigital currencies may be unregulated in your jurisdiction. The value of digital currencies may go down as well as up. Profits may be subject to capital gains or other taxes applicable in your jurisdiction.\n\nContact Details\n\nEverlodge group\n\nBrett Brown\n\nadmin@everlodge.io\n\nCompany Website\n\nhttps://everlodge.io/\n\nView source version on newsdirect.com: https://newsdirect.com/news/grayscale-ceo-foresees-bitcoin-price-surging-to-55k-ethereum-and-everlodge-poised-for-substantial-growth-871929946"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0xMi0yOC9jYXRoaWUtd29vZC1vbi1iaXRjb2luLWhvbGRpbmdzLXRlc2xhLTIwMjQtb3V0bG9vay12aWRlb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 28 Dec 2023 08:00:00 GMT",
        "title": "Cathie Wood on Bitcoin Holdings, Tesla, AI, 2024 Outlook - Bloomberg",
        "content": "00:00\n\nWe're as optimistic about Bitcoin as we ever have been. But there were there are a few regulatory and tax uncertainties, and we had been waiting for the discount between BTC and NAV two to narrow. It was as high as 50% at one point last year when there was great uncertainty around all of the turmoil in crypto generally and now it's single digit and there are no other products out there that we can use to gain exposure to Bitcoin in this moment. And it's just a moment of uncertainty between now we think, and January, January 8th to 10th, somewhere in that range perhaps. But we will, out of an abundance of caution, didn't want to take any risk. And I mean, let's get a little bit specific here because we're talking about the ARK next generation Internet ETF. The ticker there is Ark W And I think what caught a lot of people's attention is that you completely sold down your remaining stake of the grayscale Bitcoin trust. Instead, on the same day you bought into the ProShares Bitcoin Strategy ETF, of course, that tracks Bitcoin futures. It doesn't actually hold the physical Bitcoin. Can you explain that shuffle? What was the thinking there? Sure. A couple of things. First of all, Bitto the ProShares is already approved. There's no regulatory uncertainty having to do with it. So we chose to maintain our exposure through BITTO for the time being. And as I mentioned before, there are some tax and regulatory uncertainties still as part of this process. We don't know exactly who's going to be approved and and whether they've met all the criteria that the SEC has put before us. We know we have, but we don't know if others, including Gbtc, have. We just we just don't know. So so again, out of an abundance of caution and Djibouti's discount again, it was as much as 50% relative to NAV. So not only have we enjoyed this year the run in bitcoin itself, but we've had the nice closing of that discount. So it's been, you know, double good news for us. Well, you've talked about January ten, Cathie. I think in another report. Is that possible, whether it's you or somebody else in terms of the first spot, Bitcoin ETF actually getting approval? Well, we think the probabilities have gone up because the SEC has been highly engaged compared to what was happening before. Before it was just denying approval, denying approval. And we just kept putting our filing in again, you know, try, try, try, you know, how good and determined. And so here we are. We think we're we're first in line. And that's why there is this January 10th deadline. But we like the idea that the SEC has been so engaged. And it's not just with us, it's others as well. We think a number of a number of funds could be approved at the same time. And they've been asking not only one set of questions, but follow up questions. And again, that's a very good sign. Well, speaking of engaged. Oh, go ahead, please. No, no, no. The last few questions have been very technical and and so more de rigueur. And, you know, you'd expect them to be asking these questions as we head toward an approval. No, it's not 100% certain. And so we want to make that clear as well. This is the SEC, and we never know, you know, what might happen along the way. Regulators can be tricky, that's for sure. Hey, listen, you mentioned engagement. Let's talk about engagement with your funds overall, and especially the Ark Innovation Fund, up 72% year to date, easily outperforming some of the major market benchmarks, still down 65% from the high back in February of 2021. For you, though, a lot of critics, we bring up your name, we bring up Ark, and you have a lot of fans and you have a lot of critics. Is a lot of discussion. Does it feel, though, a little bit like a victory lap this year? Well, you know, we are very happy that a couple of things have happened, that this idea that interest rates, we're going to continue moving higher has been proven incorrect. And I think even the Fed, while there is that small possibility, even the Fed is now starting to talk about the other side of the interest rate move. And so I do believe all we've seen so far is a reaction to that macro phenomenon or judgment call. We went through our flagship strategy and all of our strategies. Went through a very difficult time from February 21 through December of 22, as interest rates, first of all, were presumed to move up or forecasted to move up. And then when they did move up, so it was almost like a double discounting. And so we've seen the first installment of the the the correction there to the upside for our funds with this notion. And it's again, the forecast that interest rates will come down. And we would presume that if they do come down for the reasons we think they're going to come down, the most important one being deflation, then our funds will be in good shape because we are very our companies thrive on deflation. Technologically enabled innovation is deflationary. So, Cathie, a very good morning to you. It's madness. First time we've met on. So we're going to move to a deflationary environment. We'll come back to the big macro call in a moment. Just let let's squared away before I talk to you about the flows in the funds, which is how much interest rate cuts do you presume are you forecasting leave the forecast of everybody else aside? What what do you what do you presume will happen next year? Well, we put up a chart in one of our in the in the nose, which is a YouTube video that I do every every month. Employment Friday. And in that chart you will find a ratio it's the metals to gold ratio. So metals price to gold price. And there has been an extremely tight correlation between that ratio and long term interest rates. In October we we published it or early November. And what you will see is that there was a very wide gap that had developed the metals to gold ratio was near its low for the past 1215 years and interest rates were at their highs 5%. The correlation, if you just eyeballed that chart, the correlations suggested that rate should go to 2%. Now maybe they will go all the way to 2%. But we think that long term interest rates are way above where they're going to and because of deflation. Okay. Well, let's we'll come back to that and see whether we get to the 2% level. I've got to ask you about the flows into the funds, which is obviously, you know, is kind of just edgy. You've got a bit of a victory lap going on at the moment, but this is the first year of outflows. Have those outflows stopped? You've had a great performance in the back part of this year. Have the outflows stopped and has that bleed stopped? Yes. Well, we were very gratified at our asset retention in 21 and 22. In fact, we had net inflows. If you combine both years of more than 8 billion and this year one might expect that those who average down into the very steep declines that we were seeing in 22 especially might take some profit. So we have had I know for our flagship strategy, it's roughly $500 million in outflows, maybe for all of our strategies, 1.8 million. So maybe 10% of the inflows that we enjoyed during 21 and 22. So again, we're very gratified and grateful to our our clients for the support that we continue to receive. So has has the outflows stopped? We have had days of on balance very recently. Yes. And I think part of this is many people do tax management towards the end of the year. And so some of the outflows might have been associated with with clients who got in at a high cost base and we're just harvesting some tax losses, but I think we're through that. Do you find it a little surprising, though, Cathie, considering the run up or do you I'm curious about the conversations you do have with investors considering the year that you're having and then to see those flows, It's got to be a little disheartening. Yeah. Oh, no, no, no, no, not at all. Actually, we put out a piece for Resolute, our distributor, who and we basically showed them if you rebalance our strategy when there have been big moves one way or the other, if you rebalance regularly or based on a rule like when when the fund's up 15% relative to everything else, take some profits. And what it showed that studies showed that if you are disciplined that way, that over any rolling five year period, it is highly. Likely almost 100%. I'm not quite sure if it's quite that high, but that that it will beat the market. Meaning, as measured by the Nasdaq or the S & P over a rolling five year period. And so a lot of our funds are with advisors who are very sophisticated and responded somewhat, perhaps in this tech tax management part of the year to that message. I feel like we can't talk. We have to talk about Tesla and Elon Musk. I know you just had a conversation on Twitter X. This has been, I think from day one, right. In terms of you starting out that you've had this investment in Tesla. And I remember when we first talked and you were getting started, you talked about him being the next Thomas Edison and how his vehicles would turn the US economy upside down. Having said that, there's an evolution and the world has changed. How are you thinking? It's still a top holding? How are you thinking about the Tesla story right now? Well, first of all, Carol, thank you very much for letting me interview that time. That was nearly ten years ago. And Target is about to celebrate its 10th year anniversary. And you gave us that opportunity. So thank you. The world is evolving, actually, I think, even more closely to what we expected because we expected a lot of traditional auto manufacturers to see the writing on the wall and rush as quickly as they could into scaling big time into electric vehicles. And what has happened recently, both GM and Ford have said we're stepping back. We're not going to do this until it's profitable. The problem with that is in order to be profitable, they need to scale. That's how this works. These are learning curves that they are writing down and those are expressed in cost declines. So the fact that they're pulling back means they're more there's more share for Tesla and others who choose to go for it. And Kathy, I want to keep the conversation going on, Elon Musk, but I want to bring it to the Ark Venture Fund. Of course, it's not an ETF. You invest in private companies, etc., in there. And you take a look at the portfolio, you have Space X in there and you also have X formerly known as Twitter. And in July you had told the Wall Street Journal that you had written down your Twitter stake by 47%. Fill us in on the past couple of months. Have you written it down further or how is that changed? No, I think it's still there. You know, we have to be very careful. This is an interim fund. It is a 40 act fund, and we have to mark to market every day. The good news is our clients can get in and have access to these amazing companies for just $500 and they get quarterly liquidity. So so that's the good news. The markdowns are simply, you know, if we see in the secondary market employee stock trading at a steep discount, we have to take that into account. If we see others in the more traditional asset management world like Fidelity and others marking their holdings down, we need to take that into consideration during our daily mark to market. So it's an abundance of caution. We have a five year investment time horizon. Do we think that's where X belongs in terms of valuations? Absolutely not. Absolutely not. A roughly $20 billion valuation for what we believe truly will become the everything app. Think WeChat pay. Elon started his entrepreneurial career in the payments industry and he's been thinking about this for a long time. He now has money transmitter licenses in more than half of all of the states, which we learned on Twitter spaces or on X spaces, I should say the other day when we had our interview with him. So that's exciting. He's going for it. He's going for it. We'll see if that one lands. But let's talk a little bit more about the private markets, because obviously the private credit market has gotten a lot of attention right now. You're looking at the private markets through this interval fund that you have. When you think about the opportunities there on that five year horizon that you have, do you see more so in the public markets or in the private markets right now? Well, now that we've had this very nice run this year, we think the answer to that question is in the private markets, they're close. They're close. What's fascinating to us is that the public markets have been leading the private markets for the past three years as our funds were were falling in 21. Private evaluations were going through all time highs, along with the Nasdaq. They were taking their cues, I suppose, from the Nasdaq, but. Real innovation, if you looked at our portfolios, was starting to revalued to the downside and even more so in 2022. We are still seeing major down rounds taking place in the private markets. And I'm always surprised at this sort of thing because you would think that the private markets lead the public markets. That has not been the case in the last few years. Hey, Cathie, I got to be honest with you. I think whenever we think about Elon Musk, brilliant but also erratic, and I'm curious how you think about Elon, the individuals versus Elon, the companies he's creating, the things he's doing, because I think that there is time. Any other CEO of a major publicly held company would, I think it's safe to say, not be able to get away with a lot of what he has done. So help us educate us how you make sense of it if someone you have followed talked with for many years. Well, first of all, very often we just look at what he does, not exactly what he's saying, which can often be a distraction or it can be an advertisement for his cars or for X or or for space X and so forth. So. But we have a scoring system as we are evaluating companies and their founders and their management teams and their six metrics. And one of them is moat and barriers to entry. And I think Elon is a maestro of raising barriers to entry with innovation, which that is so much faster than anyone else. Why? Because he's so first principles physics driven in his analysis of how to approach a new idea, a big idea. So tell me this then, Cathie. I mean, if you look at the cohort of years of CEOs that you backed, Brian Armstrong, does he hit that bar? Does he is he above Elon or is he at the money? You've got Elon, you've got Brian, you've got Tony Wood at Rocco. Does anybody come close to Elon or is Brian Armstrong maybe even at the money with Elan or above? Well, we don't actually look at the world that way, one relative to the other. In terms of management teams, we do look from our scoring system at the scores, which include most management people and culture execution, a valuation that might surprise people and product and service leadership and thesis risk closer to six scores and both but but well, all three of them score very highly which one scores the highest? They are actually very close to one another, to be honest. They're very close to one another. So I mean, obviously Coinbase is one of your key holdings. We've talked a little bit about that. The other the other feature that we want to talk about is a I, I'm curious to know an open air, the valuations have ranged between 80 billion to 100 billion. Will you take a position in open air? Is that going to be part of your holdings as you explore the next development of AI in your holdings? Well, in our private portfolios, we are already exposed to anthrax traffic, which has been a major beneficiary of the drama around open air that we all witnessed a few months ago. But if you look at GPT four, which is the latest large language model that that open air has published, it is way above others in terms of performance. So there you have it, the pros and the cons. So we can't tell you what we're going to do in that portfolio. But we are so impressed at how open air has led the industry. We're also impressed, however, at the open source models and and we'd like to encourage more of that movement. We know that Metal platforms has helped with Lomita and it's working on others. It is moving very quickly and making great strides. So for much lower cost, open source is free. Companies can get close not not, not at GP 84, but close. So we want to see the open source movement in in the venture fund. We also own Cathie. We've got to it. Oh, sorry. No, no, no. We never have enough time with you. Can I ask you a really quick question? 5 seconds. Any new ETFs coming our way from you guys next year? Well, real quickly, as you may know, we bought a company in London. Yeah, they have some very interesting funds."
    }
]