[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEyLzE4L2JpdGNvaW4tZGlwcy11bmRlci00MWstdG8tYmVnaW4tdGhlLXdlZWstaW4tcmVkLWFzLW1lbWVjb2luLW9yZGluYWxzLWZyZW56eS1jbG9ncy11cC1ibG9ja2NoYWlucy_SAZEBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMi8xOC9iaXRjb2luLWRpcHMtdW5kZXItNDFrLXRvLWJlZ2luLXRoZS13ZWVrLWluLXJlZC1hcy1tZW1lY29pbi1vcmRpbmFscy1mcmVuenktY2xvZ3MtdXAtYmxvY2tjaGFpbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Hovers Over $41K as Memecoin, Ordinals Frenzy Clogs up Blockchains - CoinDesk",
        "content": "“Spot bitcoin ETFs will be approved, and collectively will be the most successful ETF launch of all time,\" Bitwise also predicted . \"Coinbase’s revenue will double, beating Wall Street expectations by at least 10x.\""
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmJ1c2luZXNzLXN0YW5kYXJkLmNvbS9vcGluaW9uL2VkaXRvcmlhbC9iaXRjb2luLWdhaW5zLWFjY2VwdGFuY2UtMTIzMTIxNzAwODc2XzEuaHRtbNIBZGh0dHBzOi8vd3d3LmJ1c2luZXNzLXN0YW5kYXJkLmNvbS9hbXAvb3Bpbmlvbi9lZGl0b3JpYWwvYml0Y29pbi1nYWlucy1hY2NlcHRhbmNlLTEyMzEyMTcwMDg3Nl8xLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin gains acceptance - Business Standard",
        "content": "Bitcoin, and more broadly cryptocurrencies, is edging closer to becoming a “mainstream alternative financial asset” as it becomes more easily available via traditional financial (or TradFi) instruments. The government of El Salvador (which uses Bitcoin as an alternative currency) has completed the formalities for launching a Bitcoin “volcano” bond. A proposal to list a spot Bitcoin exchange-traded fund (ETF) from one of global finance’s most marquee firms, BlackRock, awaits approval from the United States’ markets regulator, the Securities and Exchange Commission (SEC). This is in addition to the Nasdaq listing of several companies focused on cryptomining.\n\nGiven such developments, India needs"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZlZXMtMjAtbW9udGgtaGlnaC1taW5lci1yZXZlbnVlcy1tYXRjaC02OWstYnRjLXByaWNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin fees hit 20-month high as miner revenues match $69K BTC price - Cointelegraph",
        "content": "Bitcoin (BTC) on-chain transaction fees are dividing opinion as the cost of sending BTC skyrockets.\n\nData from the statistics resource BitInfoCharts puts the average transaction fee at nearly $40 as of Dec. 17.\n\nCommentators: High Bitcoin fees are inevitable\n\nThe latest wave of Bitcoin Ordinals inscriptions has resulted in elevated transaction fees for all network users — but some believe that they are here to stay.\n\nPer BitInfoCharts, it currently costs just over $37 to send BTC on-chain — the highest average figure since April 2021.\n\nBitcoin average on-chain transaction fee chart (screenshot). Source: BitInfoCharts\n\nAdditional figures from Mempool.space show that Bitcoin’s mempool — the size of the unconfirmed on-chain transaction backlog — is vast, resulting in transactions with an attached fee of even $2 having no on-chain priority.\n\nAlmost 350,000 transactions are waiting to be confirmed at the time of writing.\n\nBitcoin mempool data (screenshot). Source: Mempool.space\n\nAs casual on-chain spending becomes unviable for many smaller investors, a heated debate among Bitcoin proponents continues.\n\nWhile many are angry at the impact of Ordinals on fees, popular Bitcoin figures argue that double-digit transaction costs are merely a taste of things to come. Those wanting to shield themselves need to embrace so-called layer-2 solutions such as the Lightning Network, which is specifically designed to cater to mass adoption.\n\n“Fees are currently artificially and temporarily high due to JPEG clownery, but it is nothing more than a glimpse into the future. Scaling doesn’t happen on L1,” popular commentator Hodlonaut wrote in one of many posts on the topic on X (formerly Twitter) on Dec. 16.\n\nContinuing, Hodlonaut argued that demanding low fees for “Level 1” transactions is “not just ignorant, it feeds into an attack on bitcoin.”\n\nThis reflects on the very composition of Bitcoin itself as a competition-based network gaining value over time as proof-of-work intends. Keeping fees low is contradictory, and as hard forks of the Bitcoin network specifically intended to offer that benefit have shown, does not attract value.\n\n“Why is it critical to onboard someone to L1 with sub $1 fees, if they can’t afford to move the funds in five years anyway? Go to bcash or another centralized pipe dream already,” Hodlonaut added, referring to one such offshoot, Bitcoin Cash (BCH).\n\nMiners enjoy best USD revenues in two years\n\nElsewhere, well-known commentator Beautyon reiterated that despite the fees, Bitcoin continues to function as intended.\n\nRelated: Navigating this bull market and securing profit will be tougher than it seems\n\n“If Ordinals bring the high on chain world to everyone earlier than expected, it will act like a scythe cutting down everyone who did not accept a Layer 2 solution to the network fee problem,” part of a recent X post stated.\n\n“Many users will be confused, upset and ready to abandon Bitcoin. There will be no recourse for them, obviously, because there is no one to blame, no one to seek compensation from; after all this is the normal state of the network. The rules are being followed, and those are the rules you agreed to, Bored Apes!”\n\nThat perspective is shared by Bitcoin veteran Adam Back, co-founder of Bitcoin and blockchain technology firm Blockstream.\n\nFor him, the answer likewise lies in expanding layer-2 capabilities instead of relying on anything beyond miner fee incentives.\n\n“You can’t stop JPEGs on bitcoin,” he concluded.\n\n“Complaining will only make them do it more. Trying to stop them and they’ll do it in worse ways. The high fees drive adoption of layer2 and force innovation. So relax and build things.”\n\nBitcoin miner revenue chart (screenshot). Source: Blockchain.com\n\nData from Blockchain.com shows miners’ revenue — the sum total of block subsidies and fees in USD — hitting levels last seen when Bitcoin hit its current $69,000 all-time high in November 2021.\n\nBTC/USD traded at around $42,000 toward the Dec. 17 weekly close, per data from Cointelegraph Markets Pro and TradingView.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEyLzE3L2NhdGhpZS13b29kLXRoaW5rcy1iaXRjb2luLWNvdWxkLXNreXJvY2tldC0zMzU2LWJ5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Cathie Wood Thinks Bitcoin Could Skyrocket 3,356% By 2030. Is She Right? - The Motley Fool",
        "content": "Ark Invest CEO Cathie Wood is known for her wild price targets. In 2018, she famously predicted that Tesla would hit a pre-split price target of $4,000, representing more than a 1,000% gain at the time, and that prediction came true.\n\nNow, Wood has caught the attention of Bitcoin (BTC -6.47%) bulls with a splashy price target on the leading cryptocurrency. The renowned disruptive growth investor sees Bitcoin hitting $1.48 million per token by 2030 in her bull case for the cryptocurrency, or a gain of 33,557% as of Wednesday afternoon. In other words, $1,000 invested in Bitcoin today would be worth $34,557 by 2030, according to Wood.\n\nThat would be an astronomical return, but early Bitcoin holders have already experienced such gains. Can Bitcoin deliver those kinds of returns again? Let's take a closer look at Wood's bull case for Bitcoin.\n\nCathie Wood's Bitcoin thesis\n\nWood has long been bullish on crypto. Coinbase currently makes up the biggest holding of Ark Invest's flagship Ark Innovation ETF, and its Ark Next Generation Internet ETF also offers exposure to Bitcoin through its ownership of Grayscale Bitcoin Investment Trust.\n\nAs far as her Bitcoin target, Wood has argued that a number of different factors will drive the price higher. First, she sees institutional adoption pushing Bitcoin's price higher and expects it to be the latest new asset class to gain adoption the way emerging markets and real estate have earlier. She also sees it as an obvious hedge against inflation. It makes more sense for corporations to hold Bitcoin on their balance sheets, rather than holding cash, which loses its purchasing power over time.\n\nAs far as utility, Wood expects remittances to be a major market for Bitcoin as well, arguing that sending money across borders with Bitcoin would protect populations from currency swings and hyperinflation.\n\nIs Cathie Wood right about Bitcoin?\n\nWood's arguments sound logical, but there are a few things investors should remember before jumping on the bandwagon here. Bitcoin has been around for nearly 15 years, created in early 2009 by the anonymous Satoshi Nakamoto.\n\nThere are plenty of innovations that are roughly as old as Bitcoin or younger that have been much more disruptive than it has. Those include the iPhone, Airbnb-style home-sharing, ride-sharing platforms like Uber, new social media apps like Instagram and TikTok, and electric vehicles, led by Tesla. Most of those had a noticeable effect within just a few years. Despite all the hype around Bitcoin, its adoption around the world as something more than a speculative asset to hold and trade has been mostly negligible.\n\nNo country more fully embraced Bitcoin than El Salvador, which has long used U.S. dollars in place of its own currency and made the cryptocurrency legal tender in 2021. However, adoption has been slow in the small Central American country, impeded by limited internet access and a lack of enthusiasm among Salvadorians. Even remittances, Wood's primary use case of Bitcoin, have not gained traction. Through the first six months of 2023, only around 1% of remittances were received via Bitcoin, according to the country's central bank.\n\nSimilarly, Remitly CEO Matt Oppenheimer said in a 2022 interview that his company, which processed over $10 billion in remittances in its most recent quarter, could facilitate transfers in Bitcoin or another cryptocurrency but \"we're not seeing customer demand for it.\" Oppenheimer noted problems like \"[t]he volatility, the lack of trust, and the lack of security\" that have stood in the way of Bitcoin adoption for remittances.\n\nRegarding Wood's other arguments, institutional adoption seems far from a foregone conclusion. Few mainstream corporations are now holding Bitcoin, and some of the world's most admired financiers have repeatedly trashed it. Warren Buffett, for example, has called it \"rat poison squared,\" and JPMorgan Chase CEO Jamie Dimon said recently he'd \"close it down\" if he were the government, arguing that the only true use case for crypto is \"criminals, drug traffickers, money laundering, tax avoidance.\"\n\nFinally, the argument that Bitcoin is a good hedge against inflation simply has not been borne out. In fact, the opposite has been true. Inflation, according to the Consumer Price Index, peaked last June at 9% -- yet Bitcoin crashed in 2022 along with the stock market. Historically, Bitcoin has traded like a high-beta risk asset, rather than a safe haven from inflation, the way gold traditionally has. Without fundamentals, Bitcoin trades mostly on momentum, which explains much of its recent gains, as well as hopes for a Bitcoin exchange-traded fund (ETF).\n\nWill Bitcoin reach $1 million?\n\nWood's price target would translate into huge gains for Bitcoin, but the idea of having a reachable price target on a cryptocurrency is a bit illogical. Even price targets on stocks, which represent the earnings and valuations of a real business, are rarely accurate, and predicting movements in cryptocurrency is even more difficult.\n\nAnything could happen with the leading cryptocurrency, and adoption could increase, but at this point, Bitcoin is already a household name. It's reached 100% brand awareness and has had that for several years. Most people have concluded that it doesn't have any utility for them.\n\nBitcoin bulls like Wood, therefore, need to ask themselves what new opportunities are going to arise for the cryptocurrency that it hasn't had previously. Institutions are largely ignoring it. Immigrants aren't interested in sending money with it, and it's not treated like an inflation hedge the way you would expect \"digital gold\" to be. El Salvador's experiment with Bitcoin has hardly been encouraging.\n\nAt this point, the most likely change seems to be increased regulation, including the Digital Asset Anti-Money Laundering Act, which is now going through Congress. That is unlikely to be bullish for Bitcoin or the rest of the cryptocurrency universe.\n\nIt's easy to cheer outlandish price targets like Wood's, but even Bitcoin bulls should be clear-eyed about the obstacles standing in the way of further gains."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEyLzE3L2NhdGhpZS13b29kLXRoaW5rcy1iaXRjb2luLWNvdWxkLXNreXJvY2tldC0zMzU2LWJ5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Cathie Wood Thinks Bitcoin Could Skyrocket 3,356% By 2030. Is She Right? - The Motley Fool",
        "content": "Ark Invest CEO Cathie Wood is known for her wild price targets. In 2018, she famously predicted that Tesla would hit a pre-split price target of $4,000, representing more than a 1,000% gain at the time, and that prediction came true.\n\nNow, Wood has caught the attention of Bitcoin (BTC -6.47%) bulls with a splashy price target on the leading cryptocurrency. The renowned disruptive growth investor sees Bitcoin hitting $1.48 million per token by 2030 in her bull case for the cryptocurrency, or a gain of 33,557% as of Wednesday afternoon. In other words, $1,000 invested in Bitcoin today would be worth $34,557 by 2030, according to Wood.\n\nThat would be an astronomical return, but early Bitcoin holders have already experienced such gains. Can Bitcoin deliver those kinds of returns again? Let's take a closer look at Wood's bull case for Bitcoin.\n\nCathie Wood's Bitcoin thesis\n\nWood has long been bullish on crypto. Coinbase currently makes up the biggest holding of Ark Invest's flagship Ark Innovation ETF, and its Ark Next Generation Internet ETF also offers exposure to Bitcoin through its ownership of Grayscale Bitcoin Investment Trust.\n\nAs far as her Bitcoin target, Wood has argued that a number of different factors will drive the price higher. First, she sees institutional adoption pushing Bitcoin's price higher and expects it to be the latest new asset class to gain adoption the way emerging markets and real estate have earlier. She also sees it as an obvious hedge against inflation. It makes more sense for corporations to hold Bitcoin on their balance sheets, rather than holding cash, which loses its purchasing power over time.\n\nAs far as utility, Wood expects remittances to be a major market for Bitcoin as well, arguing that sending money across borders with Bitcoin would protect populations from currency swings and hyperinflation.\n\nIs Cathie Wood right about Bitcoin?\n\nWood's arguments sound logical, but there are a few things investors should remember before jumping on the bandwagon here. Bitcoin has been around for nearly 15 years, created in early 2009 by the anonymous Satoshi Nakamoto.\n\nThere are plenty of innovations that are roughly as old as Bitcoin or younger that have been much more disruptive than it has. Those include the iPhone, Airbnb-style home-sharing, ride-sharing platforms like Uber, new social media apps like Instagram and TikTok, and electric vehicles, led by Tesla. Most of those had a noticeable effect within just a few years. Despite all the hype around Bitcoin, its adoption around the world as something more than a speculative asset to hold and trade has been mostly negligible.\n\nNo country more fully embraced Bitcoin than El Salvador, which has long used U.S. dollars in place of its own currency and made the cryptocurrency legal tender in 2021. However, adoption has been slow in the small Central American country, impeded by limited internet access and a lack of enthusiasm among Salvadorians. Even remittances, Wood's primary use case of Bitcoin, have not gained traction. Through the first six months of 2023, only around 1% of remittances were received via Bitcoin, according to the country's central bank.\n\nSimilarly, Remitly CEO Matt Oppenheimer said in a 2022 interview that his company, which processed over $10 billion in remittances in its most recent quarter, could facilitate transfers in Bitcoin or another cryptocurrency but \"we're not seeing customer demand for it.\" Oppenheimer noted problems like \"[t]he volatility, the lack of trust, and the lack of security\" that have stood in the way of Bitcoin adoption for remittances.\n\nRegarding Wood's other arguments, institutional adoption seems far from a foregone conclusion. Few mainstream corporations are now holding Bitcoin, and some of the world's most admired financiers have repeatedly trashed it. Warren Buffett, for example, has called it \"rat poison squared,\" and JPMorgan Chase CEO Jamie Dimon said recently he'd \"close it down\" if he were the government, arguing that the only true use case for crypto is \"criminals, drug traffickers, money laundering, tax avoidance.\"\n\nFinally, the argument that Bitcoin is a good hedge against inflation simply has not been borne out. In fact, the opposite has been true. Inflation, according to the Consumer Price Index, peaked last June at 9% -- yet Bitcoin crashed in 2022 along with the stock market. Historically, Bitcoin has traded like a high-beta risk asset, rather than a safe haven from inflation, the way gold traditionally has. Without fundamentals, Bitcoin trades mostly on momentum, which explains much of its recent gains, as well as hopes for a Bitcoin exchange-traded fund (ETF).\n\nWill Bitcoin reach $1 million?\n\nWood's price target would translate into huge gains for Bitcoin, but the idea of having a reachable price target on a cryptocurrency is a bit illogical. Even price targets on stocks, which represent the earnings and valuations of a real business, are rarely accurate, and predicting movements in cryptocurrency is even more difficult.\n\nAnything could happen with the leading cryptocurrency, and adoption could increase, but at this point, Bitcoin is already a household name. It's reached 100% brand awareness and has had that for several years. Most people have concluded that it doesn't have any utility for them.\n\nBitcoin bulls like Wood, therefore, need to ask themselves what new opportunities are going to arise for the cryptocurrency that it hasn't had previously. Institutions are largely ignoring it. Immigrants aren't interested in sending money with it, and it's not treated like an inflation hedge the way you would expect \"digital gold\" to be. El Salvador's experiment with Bitcoin has hardly been encouraging.\n\nAt this point, the most likely change seems to be increased regulation, including the Digital Asset Anti-Money Laundering Act, which is now going through Congress. That is unlikely to be bullish for Bitcoin or the rest of the cryptocurrency universe.\n\nIt's easy to cheer outlandish price targets like Wood's, but even Bitcoin bulls should be clear-eyed about the obstacles standing in the way of further gains."
    }
]