[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL29waW5pb24vYXJ0aWNsZXMvMjAyMy0xMi0yMy9jcnlwdG8tYmVsaWV2ZXJzLXZpbmRpY2F0ZWQtYXMtYml0Y29pbi1nb2VzLXVwLWV4Y2hhbmdlcy1mYWxsLWRvd24tbHFpMml1MWfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Crypto Believers Vindicated as Bitcoin Goes Up, Exchanges Fall Down - Bloomberg",
        "content": "This is the Weekend Edition of Bloomberg Opinion Today, a roundup of the most popular stories Bloomberg Opinion publishes each week based on web readership. New subscribers can sign up here .\n\nRead the whole thing."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL29waW5pb24vYXJ0aWNsZXMvMjAyMy0xMi0yMy9jcnlwdG8tYmVsaWV2ZXJzLXZpbmRpY2F0ZWQtYXMtYml0Y29pbi1nb2VzLXVwLWV4Y2hhbmdlcy1mYWxsLWRvd24tbHFpMml1MWfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Crypto Believers Vindicated as Bitcoin Goes Up, Exchanges Fall Down - Bloomberg",
        "content": "This is the Weekend Edition of Bloomberg Opinion Today, a roundup of the most popular stories Bloomberg Opinion publishes each week based on web readership. New subscribers can sign up here .\n\nRead the whole thing."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvaWYtaGlzdG9yeS1yZXBlYXRzLWl0c2VsZi1pLWV4cGVjdC1iaXRjb2luLXRvLXN1cmdlLWV2ZW4taGlnaGVyLWluLTIwMjQuLWhlcmVzLXdoeS7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "If History Repeats Itself, I Expect Bitcoin to Surge Even Higher in 2024. Here's Why. - Nasdaq",
        "content": "Looking back at 2023, a key development has been the resurgence of the cryptocurrency market. The industry's current valuation of over $1.6 trillion is about 100% higher than it was nearly 12 months ago.\n\nUnsurprisingly, the most valuable digital asset, Bitcoin (CRYPTO: BTC), has also benefited tremendously. But bigger gains could be on the horizon.\n\nEven though Bitcoin has climbed 154% in 2023 (as of Dec. 20), I expect this top cryptocurrency to surge even higher in 2024. Here's why.\n\nA major catalyst for Bitcoin on the horizon\n\nUnlike Ethereum, Bitcoin operates what is known as a proof-of-work consensus mechanism. This means that so-called miners must expend computational power and electricity (the \"work\") to win the right to approve transactions to the blockchain. For this effort, miners receive a reward in the form of newly created Bitcoin.\n\nAbout every four years, the reward that miners get for doing this essential task gets cut in half, in an event known as a \"halving.\" Bitcoin and crypto observers are likely aware that the next halving event is slated to take place in April 2024. After this point, miners will get 3.125 new coins each time they approve transactions.\n\nWhy is this so important for Bitcoin? Well, if history is any indication, Bitcoin's price is poised to continue soaring in the next 12 months and perhaps even longer.\n\nThe last Bitcoin halving took place in May 2020. In the two months before, the crypto's price rose 65%. And in the 18 months after, Bitcoin skyrocketed 616% to reach its all-time high of under $69,000 in November 2021. A similar situation played out around the halving events in 2016 and 2012.\n\nConceptually, it makes sense why this has typically been a bullish situation. Over the past decade, demand for Bitcoin has increased. This is due to it becoming more widely adopted as a store of value. The fact that Bitcoin is also getting recognition as a legitimate financial asset from incumbent institutions, corporations, and governments also helps.\n\nAt the same time that demand rises, new Bitcoin entering the market has decreased every four or so years. Restricting supply is the other key ingredient, and maybe the more important one, that drives up the digital asset's price. The Bitcoin halving is a key aspect of the blockchain network, and it supports the enforcement of there ever only being 21 million coins in circulation.\n\nInvestors should maintain a long-term mindset\n\nBefore you rush to buy Bitcoin in the hopes of generating outsized returns in 2024, it's worth mentioning that investors should still maintain a long-term perspective. This is an asset that deserves a 10-year mental outlook, not a 12-month one.\n\nBitcoin will continue to be volatile, even though it has historically done a fantastic job of rewarding investors. By staying focused on the next several years, you can have the conviction needed to avoid selling at the wrong times, and consequently hurting your portfolio's potential returns.\n\nThe economic backdrop also can't be ignored, as things are still very uncertain. While the Federal Reserve might feel confident enough to cut rates in 2024, the U.S. could still experience a harsh recession. I honestly don't think anyone has any clue what the economic situation will look like next year. If things go south, Bitcoin could be negatively affected as capital flees to what people view as safer and less risky assets.\n\nThese points are only made to help investors temper expectations. Nonetheless, now might be one of the best times to buy Bitcoin.\n\nShould you invest $1,000 in Bitcoin right now?\n\nBefore you buy stock in Bitcoin, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Bitcoin wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of the S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of December 18, 2023\n\nNeil Patel and his clients have positions in Bitcoin. The Motley Fool has positions in and recommends Bitcoin and Ethereum. The Motley Fool has a disclosure policy.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvaWYtaGlzdG9yeS1yZXBlYXRzLWl0c2VsZi1pLWV4cGVjdC1iaXRjb2luLXRvLXN1cmdlLWV2ZW4taGlnaGVyLWluLTIwMjQuLWhlcmVzLXdoeS7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "If History Repeats Itself, I Expect Bitcoin to Surge Even Higher in 2024. Here's Why. - Nasdaq",
        "content": "Looking back at 2023, a key development has been the resurgence of the cryptocurrency market. The industry's current valuation of over $1.6 trillion is about 100% higher than it was nearly 12 months ago.\n\nUnsurprisingly, the most valuable digital asset, Bitcoin (CRYPTO: BTC), has also benefited tremendously. But bigger gains could be on the horizon.\n\nEven though Bitcoin has climbed 154% in 2023 (as of Dec. 20), I expect this top cryptocurrency to surge even higher in 2024. Here's why.\n\nA major catalyst for Bitcoin on the horizon\n\nUnlike Ethereum, Bitcoin operates what is known as a proof-of-work consensus mechanism. This means that so-called miners must expend computational power and electricity (the \"work\") to win the right to approve transactions to the blockchain. For this effort, miners receive a reward in the form of newly created Bitcoin.\n\nAbout every four years, the reward that miners get for doing this essential task gets cut in half, in an event known as a \"halving.\" Bitcoin and crypto observers are likely aware that the next halving event is slated to take place in April 2024. After this point, miners will get 3.125 new coins each time they approve transactions.\n\nWhy is this so important for Bitcoin? Well, if history is any indication, Bitcoin's price is poised to continue soaring in the next 12 months and perhaps even longer.\n\nThe last Bitcoin halving took place in May 2020. In the two months before, the crypto's price rose 65%. And in the 18 months after, Bitcoin skyrocketed 616% to reach its all-time high of under $69,000 in November 2021. A similar situation played out around the halving events in 2016 and 2012.\n\nConceptually, it makes sense why this has typically been a bullish situation. Over the past decade, demand for Bitcoin has increased. This is due to it becoming more widely adopted as a store of value. The fact that Bitcoin is also getting recognition as a legitimate financial asset from incumbent institutions, corporations, and governments also helps.\n\nAt the same time that demand rises, new Bitcoin entering the market has decreased every four or so years. Restricting supply is the other key ingredient, and maybe the more important one, that drives up the digital asset's price. The Bitcoin halving is a key aspect of the blockchain network, and it supports the enforcement of there ever only being 21 million coins in circulation.\n\nInvestors should maintain a long-term mindset\n\nBefore you rush to buy Bitcoin in the hopes of generating outsized returns in 2024, it's worth mentioning that investors should still maintain a long-term perspective. This is an asset that deserves a 10-year mental outlook, not a 12-month one.\n\nBitcoin will continue to be volatile, even though it has historically done a fantastic job of rewarding investors. By staying focused on the next several years, you can have the conviction needed to avoid selling at the wrong times, and consequently hurting your portfolio's potential returns.\n\nThe economic backdrop also can't be ignored, as things are still very uncertain. While the Federal Reserve might feel confident enough to cut rates in 2024, the U.S. could still experience a harsh recession. I honestly don't think anyone has any clue what the economic situation will look like next year. If things go south, Bitcoin could be negatively affected as capital flees to what people view as safer and less risky assets.\n\nThese points are only made to help investors temper expectations. Nonetheless, now might be one of the best times to buy Bitcoin.\n\nShould you invest $1,000 in Bitcoin right now?\n\nBefore you buy stock in Bitcoin, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Bitcoin wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of the S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of December 18, 2023\n\nNeil Patel and his clients have positions in Bitcoin. The Motley Fool has positions in and recommends Bitcoin and Ethereum. The Motley Fool has a disclosure policy.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzVhNWZkZWIxLTEzZmMtNDdmYS05ZGYwLTRmM2Y1ZGZlOTBhYtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 23 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin miners splash out $600mn in race to squeeze out rivals - Financial Times",
        "content": "Print this page\n\nCryptocurrency miners are spending heavily on the newest technology to earn more bitcoins, trying to gain market share and squeeze out rivals ahead of a halving of their rewards in around four months’ time.\n\nMiners listed on the world’s stock exchanges have this month committed to spending around $600mn on buying new chips and servers that are the keystone of the digital ledger underlying bitcoin, according to The Miner Mag, an industry data provider. The December amount is nearly half of the $1.3bn total committed for the year.\n\nThe burst of spending comes despite miners having suffered heavy losses in the 2022 crypto market crash. They are now trying to profit from the soaring price of bitcoin, which has surged to an 18-month high of more than $44,000.\n\nThe splurge also comes before a scheduled plan in April to halve the incentive scheme that verifies all bitcoin deals. Optimists hope the so-called “halving” — a once every four year event to slow the circulation of bitcoins — will support further gains for the cryptocurrency next year but the move also threatens to undercut miners’ shaky profitability.\n\n“Buying equipment is not just an action in the bull market,” said Juri Bulovic, head of mining at Foundry. Miners are “realising that refreshing the fleet is what would keep them in business post-halving.”\n\nMiners play a crucial role in bitcoin’s operation, racing each other to verify new blocks of deals for its blockchain and taking on the role of deal guarantor. In return, the winner is rewarded with new tokens.\n\nHowever, the process has been heavily criticised for the huge carbon footprint it creates. According to Cambridge university, bitcoin’s energy consumption is today roughly equivalent to that of Poland or Malaysia.\n\nThe halving is expected to reshape industry economics, which have been deeply strained in the last two years by the high cost of energy and the falling price of coins. Now companies are spending big on new equipment, hoping to leave rivals on older machines struggling.\n\nNevada-based CleanSpark, a bitcoin mining firm that has committed roughly $280mn to mining equipment this year, is one prepared to accept a smaller financial reward in exchange for a larger slice of the market.\n\n“It won’t be dissimilar to when China banned mining [in 2021], everybody unplugged, and the percentage rewards skyrocketed for the miners that were still standing,” said Matthew Schultz, executive chair at CleanSpark. “The companies that have made these investments [in new equipment] are likely the ones that survive,” he added.\n\nBitcoin miners have already been pushed to their limits. Many invested during the bull run of 2020 and 2021, using debt and low interest rates to finance their expansion as the price of bitcoin soared to more than $69,000.\n\nHowever they were hit hard when bitcoin lost three-quarters of its value and energy prices soared. Companies including Core Scientific and Computer North filed for bankruptcy while others were forced to temporarily shut down operations or were paid by some US states not to mine bitcoin, in an effort to conserve energy.\n\nAnother, Marathon Digital, became a focus for short sellers after paying its former chief executive Merrick Okamoto just under $220mn in stock and missing its earnings targets.\n\nBitcoin’s rebound this year as market speculation intensifies that US regulators will approve a spot bitcoin exchange traded fund.\n\nSupporters say approval would potentially unlock billions of dollars worth of capital from major Wall Street players like BlackRock and Fidelity and send the price of bitcoin much higher.\n\nEnthusiasts also note that the last halving, in May 2020, pushed bitcoin’s price up by roughly 460 per cent over the subsequent 12 months.\n\nBitcoin miners share prices have responded to bitcoin’s rising price: Riot Platforms is up 424 per cent this year and Marathon Digital is up 681 per cent. In Toronto, Bitfarms has risen 607 per cent this year and Hive Digital Technologies 232 per cent. In contrast, over the course of 2022 Riot and Marathon share prices fell by around 85 per cent and 90 per cent, respectively, while Bitfarms and Hive saw their share price decline by 91 per cent and 88 per cent.\n\n“The enthusiasm over the potential of a bitcoin ETF all of a sudden has opened up the ability to raise capital to upgrade equipment, so you’ve seen this huge bulk buying spree,” said Frank Holmes, executive chair of Hive, which itself committed $9mn to new equipment this month.\n\nBut hopes for a resurgence are still contingent on bitcoin’s recent rally persisting. The SEC has given no indication it will approve an ETF, and end its decade-long policy of refusing all applications.\n\nMoreover miners are still plagued by real-world costs, notably energy.\n\nLatest figures pin the median cost to mine one bitcoin at around $17,000, but that could rise to as high as $34,000, according to The Miner Mag. It “doesn’t leave much room” for miners if bitcoin remains at its current price of roughly $42,000, said Wolfie Zhao, its head of research.\n\nBut some see it as a risk worth taking. Among them is Bitfarms, a Canadian-listed group, which this month set aside $95mn for new equipment.\n\n“As our market share goes up, and we get more bitcoins on a daily basis, our revenues and our cash flow should work out as well [as] if not better than in the status quo,” said Geoffrey Morphy, Bitfarms chief executive.\n\n“We’re not maintaining [our market share], we’re leapfrogging,” he added."
    }
]