[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTYvYml0Y29pbi1qdW1wcy10by1uZWFyLTI4ay1hcy1idWxscy1iZXQtb24tZXRmLWFwcHJvdmFsL9IBZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTYvYml0Y29pbi1qdW1wcy10by1uZWFyLTI4ay1hcy1idWxscy1iZXQtb24tZXRmLWFwcHJvdmFsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Jumps to Near $28K as Bulls Bet on ETF Approval - CoinDesk",
        "content": "\"The news in the U.S. over Grayscale’s ETF application has potentially very significant ramifications for the bitcoin market. The story of spot price ETF approval has been a dominant narrative in the bitcoin market for several months now,\" said Simon Peters, market analyst at eToro, in a note to CoinDesk."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjU2NTM4L2xhdGVzdC1iaXRjb2luLWV0Zi1wcm9zcGVjdHVzLWNoYW5nZXMtc3VnZ2VzdC1hcHByb3ZhbC1pcy1nZXR0aW5nLWNsb3Nlci1zYXktYW5hbHlzdHPSAX1odHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNTY1MzgvbGF0ZXN0LWJpdGNvaW4tZXRmLXByb3NwZWN0dXMtY2hhbmdlcy1zdWdnZXN0LWFwcHJvdmFsLWlzLWdldHRpbmctY2xvc2VyLXNheS1hbmFseXN0cw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "Latest bitcoin ETF prospectus changes suggest approval is getting closer, say analysts - The Block",
        "content": "Communication between fund managers and the Securities and Exchange Commission regarding spot bitcoin ETFs is becoming more constructive, according to Bloomberg analysts James Seyffart and Eric Balchunas.\n\n\"A recent update to the spot bitcoin ETF prospectus from Ark and 21SHares adds at least five pages of new text, signaling a constructive conversation with the SEC, and a step that typically only occurs when a fund is on its way to being approved,\" Seyffart and Balchunas noted.\n\nSEC opts against appealing Grayscale ruling\n\nAccording to a Bloomberg report on Saturday, Seyffart added that dialog between Grayscale and the SEC \"is going to open up\" following the U.S. regulator's decision not to appeal a high-profile ruling involving Grayscale Investments. On Friday, Reuters reported the SEC opted against appealing an August court ruling that said its rejection of Grayscale's ETF proposal was \"arbitrary and capricious.\" The move could have broad implications for future SEC spot bitcoin ETF decisions.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nSpeaking about the next step in the process between fund managers and the SEC, Sayffart said, “We’ll get more information next week and then we’ll know what happens next.\" He added that the regulator still has the option to file an appeal with the U.S. Supreme Court, though he said this is unlikely to happen.\n\nBitcoin BTC -2.67% gave a muted response to the SEC's decision to forego an appeal. This is in contrast to the positive market movement immediately after late August's court ruling that sided with Grayscale, when the digital asset rallied 7%.\n\nThe world's largest digital asset by market capitalization is down almost 4% in the past week. Bitcoin was changing hands for $26,865 at 8:00 a.m. ET, down 0.1% in the past hour, according to CoinGecko."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5ldXJvbmV3cy5jb20vbmV4dC8yMDIzLzA3LzEyL2Nhbi1pLXBheS1teS10YXhlcy13aXRoLWJpdGNvaW4tdGhpcy1pcy10aGUtc3dpc3MtY2FudG9uLWZyb20td2hpY2gtY3J5cHRvLWlzLWxhbmRpbmctaW4tZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "This is the Swiss canton from which crypto is landing in Europe - Euronews",
        "content": "Cryptocurrency has been talked about for years. You might even know someone who has invested in Bitcoin or one of the thousands of other ‘cryptos’ that exist. But has cryptocurrency and its blockchain technology fully landed in Europe?\n\nADVERTISEMENT\n\nZug, a small Swiss canton nestled by a shimmering lake and framed by the Alps, is famous for its traditional cherry pie - which was particularly loved by actress Audrey Hepburn - and for its blockchain start-up hub.\n\nThere you may not be able to pay for your coffee in Bitcoin just yet, but you'll find yourself surrounded by folks working in crypto - who are actually able to pay their taxes in Bitcoin.\n\nIn this new episode of the Euronews Tech Talks podcast, we visit Zug, the heart of Europe's so-called \"Crypto Valley\", talk about trust in decentralised banking systems, and see how renewable energy sources are changing Bitcoin mining in Europe.\n\nCryptocurrency and blockchain companies have spread very quickly in the European area between Switzerland, Liechtenstein and northern Italy.\n\nAccording to recent research by CV VC, a Zug-based venture capital firm, there are more than 1,100 blockchain-related entities thriving between Switzerland, Liechtenstein and northern Italy.\n\nThese companies employ nearly 6,000 people and are worth a combined $185 billion, as of December 2022. That's more than the GDP of countries like Kuwait or Morocco.\n\nYet blockchain, the technology that underpins it, remains widely misunderstood and distrusted by Europeans.\n\nOver the next three episodes, the Euronews Tech Talks team will explore the world of blockchain from a European perspective to find answers to these questions: how is blockchain already impacting life in Europe? And will crypto ever become mainstream?\n\nBitcoin, the visible face of cryptocurrencies\n\nBitcoin, ether, tether, Dogecoin, Cardano. None of these terms existed before 2008, but over a decade later, cryptocurrencies and blockchain technology are radically disrupting the world of finance.\n\nBitcoin is the most recognisable among them. It was created in 2009 by Satoshi Nakamoto. The name is a pseudonym for the mysterious person or persons who developed it. Blockchain, the technology behind cryptocurrency, has its roots as far back as 1991, when two scientists Stewart Haber and Scott Tanita, proposed a system to protect timestamps on documents from being interfered with.\n\nUnlike traditional currencies issued by central banks, Bitcoin is not controlled by any government or financial institution. It allows for peer-to-peer transactions without the need for intermediaries.\n\nBut blockchain technology goes beyond Bitcoin and crypto. In our next episode, we’ll feature a conversation between two experts who will tell us how it works with web3, smart contracts and NFTs.\n\nEuronews Tech Talks Podcast: Unravelling Europe's Digital Landscape\n\nIn our previous episodes, we delved into the world of generative AI from a European perspective.\n\nDo you want to know if software such as ChatGPT or Dall-e are already replacing the workforce in Europe or if we are facing a nuclear winter or a robotic paradise? You can listen to it here."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzE1L3Nob3VsZC15b3UtYnV5LWJpdGNvaW4td2hpbGUtaXRzLWJlbG93LTMwMDAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "Should You Buy Bitcoin While It's Below $30,000? - The Motley Fool",
        "content": "While Bitcoin (BTC -2.89%) has soared more than 60% in value in 2023, it's still also more than 60% below its all-time high from November 2021. The current price sits at just around $26,750, pressured by higher interest rates and uncertain economic backdrop.\n\nWith this top cryptocurrency trading below $30,000 for the past 2 1/2 months, investors might be smart to take a closer look at adding Bitcoin to their portfolios. Here are some compelling reasons that's a good move.\n\nNear-term catalysts\n\nLooking out even 12 months from now, it's possible that Bitcoin's price will be significantly higher than today, which means buying it for less than $30,000 would look like a real steal in hindsight. Some powerful potential catalysts are on the horizon in the near term.\n\nEvery four or so years, Bitcoin undergoes what's called a halving. This is when the amount miners are rewarded for processing transactions gets cut in half, essentially reducing the rate at which new coins are created. Looking at past halving cycles shows us that Bitcoin could see major bullish sentiment. Between the last halving on May 11, 2020, to Bitcoin's all-time high, the price skyrocketed 661%.\n\nBasic economic theory can explain what's going on. If Bitcoin's supply of new issuance gets cut in half but demand remains steady or even rises, there is support for a higher price. The next halving is scheduled for April of next year.\n\nThe biggest news coming from the world of Bitcoin in the past several months has been that huge asset management firms have filed applications with the Securities and Exchange Commission (SEC) to approve spot Bitcoin exchange-traded funds. While the SEC hasn't made any decisions yet, instead pushing back its deadlines, there is a lot of enthusiasm that these financial products will get approved.\n\nThe belief is that if this happens, the floodgates will open, introducing fresh capital -- and lots of it -- with a regulated, accessible, liquid, and easy way to gain exposure to Bitcoin. Should this happen, it could be viewed as a major milestone for Bitcoin, transforming it into a legitimate financial asset. And again, with higher demand, the price could soar.\n\nAnother catalyst, the most unpredictable, is the Federal Reserve's monetary policy. Since March 2022, the central bank has been on an aggressive path of hiking interest rates with the sole intention of getting inflation back to its 2% target. There might be one more rate hike before 2023 ends.\n\nHowever, I have the view that interest rates will have to come down sooner rather than later, mainly due to how much debt the government carries. Unless the government wants interest payments to keep taking up a sizable chunk of public spending, a looser monetary policy, characterized by lower interest rates, will need to happen.\n\nA more accommodative Fed is usually the key ingredient for a very favorable backdrop for risky assets, Bitcoin included. Investors will go further down the risk curve to achieve better returns. And this, again, can be a boon for Bitcoin's price.\n\nPatience is key\n\nThese near-term catalysts could be powerful price drivers for Bitcoin, but their potential positive impact is far from a sure thing. I'm always skeptical of price targets any Wall Street analyst, economist, or strategist comes up with. The world is inherently uncertain, with a million different variables that can affect the prices of financial assets.\n\nLet me be clear. If you are indeed bullish on Bitcoin, do not buy it hoping that it shoots up in value in 12 months. Instead, add it to your portfolio with the intention of owning it for the next decade. There's a good chance your patience will be rewarded."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzE1L2NhdGhpZS13b29kcy1sYXRlc3QtYml0Y29pbi1pbnNpZ2h0cy1pcy1ub3ctdGhlLXRpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 15 Oct 2023 07:00:00 GMT",
        "title": "Cathie Wood's Latest Bitcoin Insights: Is Now the Time to Buy? - The Motley Fool",
        "content": "Ark Invest, led by the visionary Chief Executive Officer Cathie Wood, has risen to prominence in recent years due to its innovation-centric investment strategies. Its priorities on assets with disruptive potential such as DNA sequencing, artificial intelligence (AI), and blockchain technology make the firm a natural fan and notable advocate of Bitcoin (BTC -2.89%) thanks to its status as the most decentralized, secure, and valuable cryptocurrency.\n\nTo shed more light on Bitcoin, Ark publishes a comprehensive report every month delving into blockchain-based metrics, investor behavior trends, and macroeconomic factors, providing valuable context on the crypto's status and potential trajectory. In the firm's most recent report, for the month of September, several crucial insights and trends were highlighted, suggesting the path Bitcoin might take in the coming months.\n\nLong-term holders: A steadfast base\n\nOne of the key indicators emphasized in Ark's report is the remarkable rise in the percentage of long-term holders. Now at an all-time high, 76% of Bitcoin's total available supply hasn't moved in more than 155 days, the point at which short-term holders change to long term.\n\nThis time frame might seem arbitrary, but analytics firm Glassnode has found it to be a statistically significant benchmark as those who hold past 155 days are more likely to be smart-money investors and can provide insight into market sentiment.\n\nArk's analysts point out that this trend of an increasing number of long-term holders aligns with other transitional periods in Bitcoin's history, suggesting that this bear market might not be fundamentally different from previous ones.\n\nTypically, long-term holders enter the market in droves and pick up coins on the cheap, creating an accumulation phase usually associated with post-bear markets and early stages of bull markets. Moreover, the increase in long-term holders further reduces the digital currency's already scarce supply, potentially setting the stage for a significant price surge should a bull market return.\n\nMetrics suggest oversold conditions\n\nArk's embrace of innovation and admiration for Bitcoin extends beyond just an anecdotal report. The firm also creates unique metrics and indicators to assess its current position relative to past cycles. The latest report highlighted two specific statistics supporting Ark's stance that the cryptocurrency is currently trading at a relative discount.\n\nThe profit/loss ratio, comparing the number of coins transacted at a profit to those at a loss, currently hovers just above 1, indicating a decline in investor \"exuberance\" compared to earlier in the year, when Bitcoin's price jumped more than 80% in just five months. When reaching these levels in the past, the crypto was either in the depths of a bear market or clawing its way back into a bull market. Ark sees it as the latter.\n\nArk highlighted another crucial metric, the realized-profits-to-realized-cap ratio, which is currently at its lowest point since the beginning of the year, further indicating oversold conditions. This ratio measures profit-taking among Bitcoin investors against its realized cap, rather than the more commonly used market cap. Since realized cap is calculated by multiplying the last price at which every Bitcoin was transacted instead of valuing every coin at its current price, it offers a more sensitive and less misleading assessment than market cap.\n\nBy quantifying the amount of realized profits against Bitcoin's realized cap, Ark is able to measure buying and selling activity more clearly. Considering Bitcoin has historically entered the oversold territory of this ratio only seven times in its history, today could be an opportune moment for investors.\n\nThe macroeconomic landscape: Challenges and optimism\n\nArk's report doesn't shy away from acknowledging current unfavorable macroeconomic conditions and the potential challenges they pose to Bitcoin's bull market return. The prolonged interest rate hikes and tighter liquidity anticipated in markets globally could present hurdles for cryptocurrencies since typically these assets have thrived in environments with liquidity surpluses.\n\nHowever, despite short-term challenges, Ark remains bullish on Bitcoin in the long run. Its analysis suggests that the cryptocurrency's resiliency and favorable developments of on-chain metrics such as the number of active owners and mining difficulty, put it in a potentially lucrative position as it navigates the fine line between bear and bull markets."
    }
]