[
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2lucy1idGMtbWlkLXRlcm0tcmVjb3ZlcnktZGVwZW5kcy1vbi10aGVzZS1icmVhay1ldmVuLWFyZWFzL9IBW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2lucy1idGMtbWlkLXRlcm0tcmVjb3ZlcnktZGVwZW5kcy1vbi10aGVzZS1icmVhay1ldmVuLWFyZWFzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin’s [BTC] mid-term recovery depends on these break-even areas - AMBCrypto News",
        "content": "Bitcoin’s MVRV ratio showed intense bullish potential for the long term.\n\nThe average cost basis revealed that a price jump was not there yet.\n\nBitcoin [BTC], despite having a positive Year-To-Date (YTD) performance, still has a massive potential for growth in the long term. This was the opinion of pseudonymous on-chain analyst Crazzyblockk.\n\nIs your portfolio green? Check the Bitcoin Profit Calculator\n\nShort-term holders can’t dream now\n\nCrazzyblockk, who posts regularly about the market sentiment on CryptoQuant, pointed to the Market Value to Realized Value (MVRV) ratio as grounds for his opinion. The MVRV ratio is calculated as the ratio of an asset’s market capitalization versus its realized cap.\n\nBy comparing these two metrics, the metric can be used to get a sense of when the price is above or below “fair value”, and to assess market profitability.\n\nFrom the chart above, and as confirmed by Crazzyblockk, the MVRV ratio was above 1. Explaining how the metric relates to the price and market cap, Crazzyblockk concluded:\n\n“We are still above level 1 of the MVRV Ratio, and based on the Holders’ Cost basis, Realized Cap< Market cap.”\n\nHowever, the analyst mentioned that the bullish long-term picture does not apply to short-term holders. In addressing this part, Crazzyblockk explained that there was little to no confidence in the market that could change the sentiment, saying that short-term holders were at a “huge disadvantage.”\n\nWatch out for $27,500\n\nBut for the mid-term, the analyst mentioned that there was hope for relief. He also added that Bitcoin’s potential to rise above $30,000 would depend on the $27,500 to $29,000 break-even zone.\n\nTo arrive at this conclusion, Crazzyblockk analyzed the state of the Bitcoin realized price. The realized price gives the average cost basis at which all Bitcoins were purchased. This is done by considering the value of all BTC at the price they were last transacted on-chain, divided by the number of bitcoins in circulation. So, the analyst wrote,\n\n“If we look at the average realized price of these holders or the amount of money they have paid for each bitcoin, the price levels of 27.5k-29k is the break-even area of these holders’ pockets.”\n\nRead Bitcoin’s [BTC] Price Prediction 2023-2024\n\nIn the interim, Crazzyblockk gave a strong warning. According to him, BTC remaining lower than the aforementioned realized prices poses a great risk to the mid-term project. He opined that the longer Bitcoin stays lower than $27,500 the longer it might take to recover. He explained that."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmdvYmFua2luZ3JhdGVzLmNvbS9pbnZlc3RpbmcvY3J5cHRvL3dhcnJlbi1idWZmZXR0LXdvdWxkbnQtYnV5LWFsbC1iaXRjb2luLWZvci0yNS_SAWJodHRwczovL3d3dy5nb2JhbmtpbmdyYXRlcy5jb20vaW52ZXN0aW5nL2NyeXB0by93YXJyZW4tYnVmZmV0dC13b3VsZG50LWJ1eS1hbGwtYml0Y29pbi1mb3ItMjUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Warren Buffett: \"I Wouldn't Buy All of Bitcoin for $25\" - GOBankingRates",
        "content": "Warren Buffett, the renowned investor and CEO of Berkshire Hathaway, has never been shy about expressing his opinions on various investments. And when it comes to bitcoin, he has made his views abundantly clear.\n\nAt the 2022 Berkshire Hathaway Annual Meeting, Buffett compared bitcoin to farmland and apartment complexes, stating, “If the people in this room owned all the farmland and you said for a 1% interest in all the farmland in the United States, pay us the bargain price, $25 billion dollars, I’d write you a check for $25 billion. If you did the same with all the apartment complexes in the United States for bargain price, I’d write you a check. Now if you told me you owned all the bitcoin in the world and you offered it to me for $25, I wouldn’t take it because what would I do with it?”\n\nBuffett’s reasoning behind this statement is based on the fundamental value of assets. Farmland and apartments produce tangible value in the form of food and rental income, respectively. Bitcoin, on the other hand, does not have any inherent productive value. As Buffett pointed out, “The apartments are going to produce rental, and the farmland is going to produce food, and if I’ve got all the bitcoin, it’s a mystery.”\n\nBuffett further expressed skepticism about the long-term prospects of bitcoin, saying, “Whether it goes up or down in the next year or five or ten years, the one thing I’m pretty sure of is it doesn’t multiply. There’s a magic to it, and people attach magic to lots of things.”\n\nInvesting for Everyone\n\nBuffett is not alone in his skepticism about bitcoin. His longtime business partner, Charlie Munger, has also expressed his negative views on the cryptocurrency. At the same annual meeting, Munger stated, “In my life I try to avoid things that are stupid, and evil, and make me look bad in comparison to somebody else… well bitcoin does all three. First, it’s stupid because it’s very likely to go to zero, second, it’s evil because it compromises the federal reserve system and the Nation Currency system. And lastly, China banned it, so we look more dumb then them.”\n\nBoth Buffett and Munger have long been proponents of investing in businesses that produce tangible value over the long term. Their skepticism about bitcoin stems from the fact that it does not have any inherent productive value and its future prospects are highly uncertain.\n\nWhile some investors view bitcoin as a potential store of value or a hedge against inflation, Warren Buffett and Charlie Munger see it as a speculative investment with no inherent productive value. Their comments at the 2022 Berkshire Hathaway Annual Meeting highlight their belief in investing in assets that produce tangible value over the long term, and their skepticism about the long-term prospects of bitcoin. Whether you agree with their views or not, it’s always important to consider multiple perspectives before making investment decisions.\n\nEditor's note: This article was produced via automated technology and then fine-tuned and verified for accuracy by a member of GOBankingRates' editorial team.\n\nInvesting for Everyone\n\nMore From GOBankingRates"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZGVjcnlwdC5jby8xOTc0NDEvYml0Y29pbi1tZXRhdmVyc2UtdG9rZW4tY29taW5nLWZyb20tYW5pbW9jYS1nYW1lLXN0dWRpb9IBV2h0dHBzOi8vZGVjcnlwdC5jby8xOTc0NDEvYml0Y29pbi1tZXRhdmVyc2UtdG9rZW4tY29taW5nLWZyb20tYW5pbW9jYS1nYW1lLXN0dWRpbz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Metaverse Token Coming From Animoca Game Studio - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nCrypto gaming and metaverse investment giant Animoca Brands has unveiled plans this week through one of its subsidiary companies to launch a first-of-its-kind metaverse ecosystem token on Bitcoin via the Ordinals protocol.\n\nGame studio Darewise Entertainment (aka Life Beyond Studios), an Animoca subsidiary, aims to create an all-encompassing metaverse ecosystem built around Bitcoin Ordinals—a protocol that lets users inscribe NFT-like assets to the blockchain and create BRC-20 tokens on Bitcoin.\n\nThe studio’s metaverse plan includes gaming, brand integrations, real-world experiences, and more. Darewise is the studio behind Life Beyond, an upcoming metaverse game with NFTs. It will be the first game to implement the newly announced Bitcoin-based metaverse token for in-game assets, virtual lands, and more.\n\nAD\n\nAD\n\nWe have exciting news! 🎉@darewise Entertainment , the builders of Life Beyond have just revealed its strategic engagement with @HorizenLabs to launch the first metaverse ecosystem token on #Bitcoin📷. @animocabrands Full details: https://t.co/pXJu7ysDpv — Life Beyond (@LifeBeyond) September 14, 2023\n\nTo create the upcoming Bitcoin token, Darewise will collaborate with Horizen Labs, the company that helped develop the smart contract and token strategy for ApeCoin (APE)—the Ethereum-based token tied to the Bored Ape Yacht Club NFT project. Life Beyond has previously released gaming NFTs on Ethereum scaling network Polygon.\n\n“I'm very excited for our Life Beyond Studios to be pioneering the use of Bitcoin Ordinals,” Animoca Brands CEO Robby Yung told Decrypt.\n\nYung added that continuous innovation is a hallmark of the Web3 industry, and with the emergence of Ordinals on the scene this year, it's only fitting that Animoca would try to push the envelope in their application.\n\nOrdinal inscriptions are digital assets that are digitally archived to a single satoshi, the smallest denomination of a Bitcoin (1/100,000,000 BTC). Although trading activity around these virtual artifacts is down in recent months, new products are continuously surfacing including a social graph and another planned Bitcoin metaverse ecosystem.\n\nAD\n\nAD\n\n“We're still in the early innings, but the potential for Bitcoin to become more than just a store of value is immense,” said Benjamin Charbit, co-founder and CEO of Darewise Entertainment, in a statement.\n\nAnimoca Brands is a major player in the metaverse space and has invested in hundreds of companies and projects, netting a $5.9 billion valuation as of September 2022.\n\nThe company also publishes various NFT-based games, including the Ethereum metaverse game The Sandbox. Animoca recently raised $20 million in funding for its new metaverse project, The Mocaverse, one of many such gaming initiatives under its umbrella.\n\nYung clarified to Decrypt that the Bitcoin metaverse token is “separate from the Mocaverse, although Life Beyond Studios are a part of the project.” He added there will be further “collaborations between the AAA universe they're building and the wider Mocaverse.”"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZGVjcnlwdC5jby8xOTc0MjkvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tc3RlYWR5LWV0aGVyZXVtLWludmxhdGlvbmFyeS10b25jb2luLXJpc2Vz0gFlaHR0cHM6Ly9kZWNyeXB0LmNvLzE5NzQyOS90aGlzLXdlZWstaW4tY29pbnMtYml0Y29pbi1zdGVhZHktZXRoZXJldW0taW52bGF0aW9uYXJ5LXRvbmNvaW4tcmlzZXM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "This Week in Coins: Steady Week for Bitcoin and Ethereum, Toncoin Balloons 23% - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nIt was another week of fairly stable prices for leading cryptocurrencies. Bitcoin (BTC) grew 3% over the seven days and started Saturday trading at $26,564, while Ethereum (ETH) remains more or less at the same price it was seven days ago at $1,636.\n\n​​\n\nAD\n\nAD\n\nEthereum’s growth may have been hobbled by reports that its supply recently turned inflationary (meaning more Ether is issued than burned) in one of few such periods since the Merge in September 2022. Last week, Ethereum’s supply increased by 4,092 ETH tokens worth around $6.6 million, per Ultrasound.money data.\n\nThe leading cryptocurrencies traded sideways all week, even after the U.S. Bureau of Labor Statistics’ (BLS) latest Consumer Price Index (CPI) on Wednesday revealed that inflation had risen a fraction above economists’ projections last month due to rising gasoline prices.\n\nOnly three cryptocurrencies posted any notable price movement this week. Two tokens rallied: Bitcoin Cash (BCH) grew 11.5% to $213.79, while Toncoin (TON) blew up 23% to trade at $2.20.\n\nTON’s explosive price movement this week was catalyzed by news on Wednesday that its parent company—Telegram—has integrated The Open Network blockchain’s Web3 wallet into its messaging app, bringing easy access to TON for the app’s 800 million users.\n\nThe move represents a symbolic win for Telegram. Technically, the company withdrew from involvement in TON in 2020 after litigation by the U.S. Securities and Exchange Commission. Telegram was accused of offering unregistered securities in the form of a token called Gram. It settled with the SEC by paying a fine of $18.5 million and returning unspent funds to investors.\n\nOne cryptocurrency notably depreciated over the week: Stellar (XLM) fell 9.3% to trade at $0.118263 at the time of writing. Its poor performance this week appears to be a correction from last week, when XLM rallied 10% off the back of a tweet that promised “something cool” in ten days.\n\nAD\n\nAD\n\nWas it a major network overhaul? Nope, it was a big-budget commercial with Idris Elba.\n\nIn the news: adoption!\n\nThere were more encouraging signs of crypto adoption throughout the global north this week.\n\nOn Monday, Sony subsidiary Sony Network Communications announced it was developing a blockchain network in collaboration with crypto tech firm Startale Labs. The Singapore-based joint venture will be known as Sony Network Communications Labs Pte. Ltd. It remains unclear what Sony may use the platform for.\n\nAmerican payments giant PayPal launched crypto to USD off-ramps on Tuesday. The move came after PayPal launched a crypto On Ramp integration last month, enabling direct crypto purchases to MetaMask and Ledger users. Undoubtedly, the company’s biggest move in the space this year was the announcement of its own in-house greenback-pegged stablecoin PayPal USD.\n\nFinally, on Wednesday, Taurus–a Swiss crypto fintech firm—announced an agreement with Deutsche Bank. Deutsche Bank will also use Taurus’ infrastructure to offer custody and tokenization services for its customers, according to a press release shared with Decrypt."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2NvaW50ZWxlZ3JhcGguY29tL21hZ2F6aW5lL3BheG9zLTUwMGstYml0Y29pbi1mZWUtZnR4LXRva2Vucy1zYWxlcy1zZXQtdG8tYmVnaW4tYW5kLW90aGVyLW5ld3MtaG9kbGVycy1kaWdlc3Qtc2VwdC0xMC0xNi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Sep 2023 07:00:00 GMT",
        "title": "Paxos' $500K Bitcoin fee, FTX tokens sales set to begin and other news: Hodler's Digest, Sept. 10-16 - Cointelegraph",
        "content": "Top Stories This Week\n\nPaxos confirms it’s responsible for paying a $500K Bitcoin transaction fee\n\nThe Bitcoin miner who received 19.8 BTC in fees from blockchain infrastructure firm Paxos has returned the funds following Paxos’ claim that it made a mistake in paying over $500,000 in transfer fees. On Sept. 10, Paxos paid the six-figure fee to move $2,000, with the average network fee typically being around $2. The company later acknowledged the mistake, confirming the transfer came from its servers. Almost a day after Paxos’ claims, the Bitcoin miner who received the funds went on X (formerly Twitter) to express frustrations after agreeing to refund the amount to Paxos. The funds were returned on Sept. 15.\n\nCourt approves sale of FTX digital assets\n\nA bankruptcy court has approved the sale of FTX digital assets in weekly batches through an investment adviser and under preestablished guidelines. The sale does not include Bitcoin, Ether and “certain insider-affiliated tokens,” which can be sold through a separate decision by FTX after 10 days’ notice. FTX sales are not expected to have a heavy impact on markets. According to a recent shareholder update, the bankrupt exchange has $833 million worth of Bitcoin and Ether. A total of $3.4 billion is held in Digital Assets A — the top 10 assets the company holds — which include Solana, Bitcoin, Ether, Aptos and others.\n\nGemini Earn users could recover all funds in new DCG remuneration scheme\n\nDigital Currency Group has proposed a new agreement plan for the creditors of the now-bankrupt Genesis Global. The plan estimates unsecured creditors will receive “a 70–90% recovery with a meaningful portion of the recovery in digital currencies.” Additionally, the remuneration plan says the recovery of claims for Gemini Earn users would be projected at “approximately 95–110%” without any contribution from Gemini. According to the filing: “If Gemini were to agree to provide $100 million to Gemini Earn users under the Proposed Agreement, as it previously did, there would be little doubt Gemini Earn users would receive more than full recovery.”\n\nFranklin Templeton files for spot Bitcoin ETF\n\nAsset manager Franklin Templeton applied with the United States Securities and Exchange Commission to launch a spot Bitcoin exchange-traded fund (ETF). According to the application, the fund would be structured as a trust. Coinbase would custody the BTC, and The Bank of New York Mellon would be the cash custodian and administrator. Franklin Templeton has $1.5 trillion in assets under management and joins a long list of asset managers waiting for regulatory approval. The SEC recently delayed decisions on spot ETF applications from WisdomTree, Valkyrie, Fidelity, VanEck, Bitwise and Invesco on Aug. 31.\n\nTwo more top executives depart Binance.US amid layoffs, SEC action\n\nThe exodus of executives from crypto exchange Binance has reached the firm’s offshoot in the United States, as at least three top employees left Binance.US over the past few days. This week’s departures included the exchange’s CEO, Brian Shroder, alongside legal head Krishna Juvvadi and chief risk officer Sidney Majalya. The mass exit is believed to be tied to the ongoing U.S. investigation into Binance and Binance.US. The SEC sued Binance.US, Binance and CEO Changpeng Zhao in June for allegedly engaging in unregistered securities operations and other improprieties. On Aug. 28, the agency requested to file sealed documents in the case, fueling concerns about a criminal probe by the U.S. Department of Justice.\n\nWinners and Losers\n\nAt the end of the week, Bitcoin (BTC) is at $26,465, Ether (ETH) at $1,628 and XRP at $0.50. The total market cap is at $1.05 trillion, according to CoinMarketCap.\n\nAmong the biggest 100 cryptocurrencies, the top three altcoin gainers of the week are Toncoin (TON) at 21.30%, VeChain (VET) at 11.94% and Bitcoin Cash (BCH) at 11.36%.\n\nThe top three altcoin losers of the week are ApeCoin (APE) at -16.82%, Astar (ASTR) at 14.47% and Flare (FLR) at 12.61%.\n\n\n\nFor more info on crypto prices, make sure to read Cointelegraph’s market analysis.\n\nMost Memorable Quotations\n\n\n\n“I think my generation and younger than me are the ones that are really going to change that narrative for investing, whether it’s in cryptocurrency or other investments moving forward.”\n\nScotty James, Australian snowboarder\n\n“The only country I would not encourage you to start a company right now is in the U.S.”\n\nBrad Garlinghouse, CEO of Ripple\n\n“We’re still in the fax era of global payments.”\n\nDavid Marcus, former PayPal executive and co-founder Lightspark\n\n“I don’t think everybody in D.C. actually fully realizes how powerful the crypto voting community block is.”\n\nBrian Armstrong, CEO of Coinbase\n\n“You cannot get 100% transparency and 100% privacy.”\n\nAlex Svanevik, CEO of Nansen\n\n“Climate change is still a systemic threat to our species. I think as a society, we kind of owe it to ourselves to do anything that we can.”\n\nMarek Olszewski, CEO of Celo\n\nPrediction of the Week\n\nBitcoin price all-time high will precede 2024 halving — New prediction\n\nBitcoin has a $250,000 target for after its next block subsidy halving — but new all-time highs will come sooner, according to the latest BTC price prediction from BitQuant, a popular social media commentator who sees a rosy future for the largest cryptocurrency.\n\nOn Sept. 15, the pseudonymous “central banker and Bitcoiner” revealed a pre-halving target above $69,000. “No, Bitcoin is not going to top before the halving,” he wrote in part of the commentary.\n\nBitcoin has just over six months before the halving, the event that cuts miner rewards earned per block by 50% every four years. “No, BTC is not going to $160K because the magnitude of every pullback is large,” he wrote, adding that “this means it will peak after the halving, in 2024. And yes, the target price is around $250K.”\n\nFUD of the Week\n\nSEC charges company behind Stoner Cats NFT series with unregistered securities sale\n\nStoner Cats 2 LLC (SC2), the company behind the Stoner Cats animated web series, has agreed to a cease-and-desist order and other measures imposed by the U.S. Securities and Exchange Commission after being charged with conducting an unregistered offering of crypto-asset securities in the form of nonfungible tokens (NFTs). According to the SEC, SC2 sold more than 10,000 NFTs for about $800 apiece. The sale took 35 minutes and occurred on July 27, 2021, and the proceeds were used to fund the series. Besides agreeing to the cease-and-desist order, SC2 will pay a civil penalty of $1 million.\n\nOneCoin co-founder Greenwood gets 20 years in US jail for fraud, money laundering\n\nKarl Greenwood, co-founder of OneCoin with Ruja Ignatova, was sentenced in the United States to 20 years in prison and ordered to pay $300 million on Sept. 20. Ignatova remains at large. Greenwood, who is a citizen of the United Kingdom and Sweden, was sentenced in a court in New York. In a statement by the Justice Department, U.S. Attorney Damian Williams called OneCoin “one of the largest fraud schemes ever perpetrated.” The multilevel marketing and Ponzi scheme reaped $4 billion from 3.5 million victims, the statement said. Ignatova has not been seen since October 2017 and is on the U.S. Federal Bureau of Investigation’s Ten Most Wanted List.\n\nNorth Korea’s Lazarus Group responsible for $55M CoinEx hack\n\nThe attack on crypto exchange CoinEx, which drained at least $55 million, was carried out by the North Korean hacker group Lazarus, according to blockchain security firm SlowMist and pseudonymous on-chain investigator ZachXBT. The hacker group was identified after it inadvertently exposed its address, which was the same one used in the recent Stake and Optimism hacks. On Sept. 12, CoinEx saw large outflows of funds to an address without any prior history. Security experts immediately suspected that the exchange was breached, with initial estimates reaching approximately $27 million.\n\nAre DAOs overhyped and unworkable? Lessons from the front lines\n\nMany contend that DAOs have failed to deliver on their promises, but developers are coming up with novel solutions.\n\n6 Questions for Kei Oda: From Goldman Sachs to cryptocurrency\n\nKei Oda spent 16 years trading bonds for Goldman Sachs — a life that eventually bored him. That was when he turned to cryptocurrency.\n\nWeb3 Gamer: PUBG devs’ Web3 project, Animoca’s $20M raise, Shardbound review\n\nThe company behind PUBG announces a new Web3 platform, monetization in Web3 and more."
    }
]