[
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXRoZXNpcy1iZWNvbWVzLWFtYXpvbi1iZXN0LTIzNDQ0MDQ5My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Thesis Becomes Amazon Best Seller - Yahoo Finance",
        "content": "For many readers, a graduate thesis doesn’t sound like a page-turner, but a lengthy academic paper on Bitcoin written by a U.S. Space Force major has emerged as a popular pick on Amazon.\n\n“Softwar” asserts that Bitcoin has the potential to play a major role on the world’s geopolitical stage as a military-grade solution for securing information—far different than the monetary use Bitcoin’s network has today.\n\nWritten by Jason Lowery, the report represents the culmination of academic research he conducted at the Massachusetts Institute of Technology during a 6-month fellowship sponsored by the Department of Defense. The full title of the piece is “Softwar: A Novel Theory on Power Projection and the National Strategic Significance of Bitcoin.”\n\nLowrey's brief biography on Amazon claims that he has advised several senior U.S. officials on Bitcoin-related policy in offices related to the president, Secretary of Defense, and the Joint Chiefs of Staff.\n\nThough “Softwar” doesn’t place within the top 500 books on Amazon’s store, Lowery’s exploration of Bitcoin has hovered around the number one spot in Amazon’s digital currencies category and is currently ranked second in both books on technology and engineering.\n\nDARPA Is Bankrolling Research Into Crypto and National Security\n\nThe more than 350-page tome draws on knowledge from various fields, such as anthropology and computer science, to establish and explore Lowery’s “Power Projection Theory.”\n\nEssentially, Lowery posits that the proof-of-work system underlying Bitcoin transaction verification can be leveraged by military powers to impose restrictions on bad actors in a non-lethal through a steep amount of physical work in the form of crunching numbers.\n\n“The bottom line is that Bitcoin could represent a ‘softwar’ or electro cyber-defense protocol, not merely a peer-to-peer electronic cash system,” the book states. “While most software can only logically constrain computers, Bitcoin can physically constrain computers.”\n\nStory continues\n\nThe book’s acknowledgments section gives a nod to some of Bitcoin’s most faithful, including MicroStrategy’s Michael Saylor and Peter McCormack.\n\nIn his paper, Lowrey also writes that insufficient reserves of Bitcoin held on behalf of the U.S. government could pose a threat to the nation’s national security if the network becomes utilized as a cyber-security tool.\n\n“If the U.S. does not consider stockpiling strategic Bitcoin reserves, or at the very least encouraging Bitcoin adoption,” he said, “The U.S. could forfeit a strategically vital power [...] and set itself back in global power dominance.”\n\nCoin Center Says RESTRICT Act Could Be Used to Ban Bitcoin\n\nGiven that Lowrey’s thesis was published in February and the U.S. announced that it sold $215 million in seized Bitcoin last month, perhaps not every Fed is on the same page.\n\nThe book also includes a disclosure that states the paper is not reflective of any official position held by the DoD, Air Force, or MIT.\n\nOut of the more than 200 ratings “Softwar” has received on Amazon, a majority gave the book five stars.\n\nBut a few reviews say that Lowrey’s text is lacking due to “too much wishful thinking,” “arguments based on opinion,” and quotes from “The Matrix” that “detract from the seriousness of the topic.”"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXRoZXNpcy1iZWNvbWVzLWFtYXpvbi1iZXN0LTIzNDQ0MDQ5My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Thesis Becomes Amazon Best Seller - Yahoo Finance",
        "content": "For many readers, a graduate thesis doesn’t sound like a page-turner, but a lengthy academic paper on Bitcoin written by a U.S. Space Force major has emerged as a popular pick on Amazon.\n\n“Softwar” asserts that Bitcoin has the potential to play a major role on the world’s geopolitical stage as a military-grade solution for securing information—far different than the monetary use Bitcoin’s network has today.\n\nWritten by Jason Lowery, the report represents the culmination of academic research he conducted at the Massachusetts Institute of Technology during a 6-month fellowship sponsored by the Department of Defense. The full title of the piece is “Softwar: A Novel Theory on Power Projection and the National Strategic Significance of Bitcoin.”\n\nLowrey's brief biography on Amazon claims that he has advised several senior U.S. officials on Bitcoin-related policy in offices related to the president, Secretary of Defense, and the Joint Chiefs of Staff.\n\nThough “Softwar” doesn’t place within the top 500 books on Amazon’s store, Lowery’s exploration of Bitcoin has hovered around the number one spot in Amazon’s digital currencies category and is currently ranked second in both books on technology and engineering.\n\nDARPA Is Bankrolling Research Into Crypto and National Security\n\nThe more than 350-page tome draws on knowledge from various fields, such as anthropology and computer science, to establish and explore Lowery’s “Power Projection Theory.”\n\nEssentially, Lowery posits that the proof-of-work system underlying Bitcoin transaction verification can be leveraged by military powers to impose restrictions on bad actors in a non-lethal through a steep amount of physical work in the form of crunching numbers.\n\n“The bottom line is that Bitcoin could represent a ‘softwar’ or electro cyber-defense protocol, not merely a peer-to-peer electronic cash system,” the book states. “While most software can only logically constrain computers, Bitcoin can physically constrain computers.”\n\nStory continues\n\nThe book’s acknowledgments section gives a nod to some of Bitcoin’s most faithful, including MicroStrategy’s Michael Saylor and Peter McCormack.\n\nIn his paper, Lowrey also writes that insufficient reserves of Bitcoin held on behalf of the U.S. government could pose a threat to the nation’s national security if the network becomes utilized as a cyber-security tool.\n\n“If the U.S. does not consider stockpiling strategic Bitcoin reserves, or at the very least encouraging Bitcoin adoption,” he said, “The U.S. could forfeit a strategically vital power [...] and set itself back in global power dominance.”\n\nCoin Center Says RESTRICT Act Could Be Used to Ban Bitcoin\n\nGiven that Lowrey’s thesis was published in February and the U.S. announced that it sold $215 million in seized Bitcoin last month, perhaps not every Fed is on the same page.\n\nThe book also includes a disclosure that states the paper is not reflective of any official position held by the DoD, Air Force, or MIT.\n\nOut of the more than 200 ratings “Softwar” has received on Amazon, a majority gave the book five stars.\n\nBut a few reviews say that Lowrey’s text is lacking due to “too much wishful thinking,” “arguments based on opinion,” and quotes from “The Matrix” that “detract from the seriousness of the topic.”"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL2VuZ2xpc2guZWxwYWlzLmNvbS9pbnRlcm5hdGlvbmFsLzIwMjMtMDQtMDIvY3J5cHRvLWV2YW5nZWxpc3RzLWVudGVyLXRoZS1idWtlbGUtZ292ZXJubWVudC10aGUtZGFyay1idXNpbmVzcy1vZi1iaXRjb2luLWluLWVsLXNhbHZhZG9yLmh0bWzSAaIBaHR0cHM6Ly9lbmdsaXNoLmVscGFpcy5jb20vaW50ZXJuYXRpb25hbC8yMDIzLTA0LTAyL2NyeXB0by1ldmFuZ2VsaXN0cy1lbnRlci10aGUtYnVrZWxlLWdvdmVybm1lbnQtdGhlLWRhcmstYnVzaW5lc3Mtb2YtYml0Y29pbi1pbi1lbC1zYWx2YWRvci5odG1sP291dHB1dFR5cGU9YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "Crypto evangelists enter the Bukele government: The dark business of bitcoin in El Salvador - EL PAÍS USA",
        "content": "American crypto evangelist Max Keizer has compared Salvadoran President Nayib Bukele to John F. Kennedy and El Salvador to the kingdom of Camelot, describing it as a kind of promised land for bitcoin where taxes and central banks are sleighed like dragons. Until a few months ago, Keizer — an American former stockbroker and reporter close to Russian propaganda sites — was just another one of the many outlandish characters who began to arrive in the country in 2021, after Bukele announced that El Salvador would be the first in the world to accept bitcoin as legal currency.\n\nMany of those characters — a mix of anarcho-capitalists, cyber-utopians and plain old opportunists — left El Salvador as enthusiasm for the bitcoin project began to wane. Only 14% of the country’s businesses have ever used bitcoin, according to official figures. But those characters who are still in the country have gone in all the way — people like Keizer and his wife, Stacy Herbert. Since the end of last year, Keizer and Hebert have been in charge of the country’s National Bitcoin Office. El Salvador, one of the smallest and poorest countries in the region, has crypto evangelists within the government.\n\nMax Keizer waves a Salvadoran flag at a cryptocurrency conference in Miami on April 7, 2022. Rebecca Blackwell (AP)\n\nThe creation of the National Bitcoin Office, like the rest of Bukele’s crypto project and much of his government’s management, is shrouded in secrecy. The only figures that have been made public are the $200 million that was spent on the infrastructure to launch the digital currency, such as bitcoin ATMs and a cellphone app. Beyond what Bukele has announced on Twitter, it also not known much the country has invested in bitcoin. Like Bukele, Keiser and Herbet are also active on social media, with more than 700,000 followers. Their YouTube shows and podcasts are the main source of information on El Salvador’s bitcoin policies.\n\nStacy Herbert at a cryptocurrency conference in Dublin, Ireland, on June 12, 2018. Stephen McCarthy (Getty Images)\n\nKeiser and Herbert both present themselves as some kind of crypto police or crypto judges. They are authorized to investigate possible fraud, and they are the ones who decide which investor is allowed in and which is not. “We do not receive any salary for this. We do it for President Bukele,” Herbert often says, while her husband calls their work “an act of love.” Leaving aside their alleged altruism, the couple owns Heisenberg Capital, a fund belonging to Bitfinex, one of the world’s largest platforms for buying and selling bitcoin. And they also own El Zonte Capital, another fund dedicated exclusively to digital investments in El Salvador.\n\nPropaganda and corporate diplomacy\n\nRicardo Valencia, professor of Political Economy at California State University, argues that for Keiser and Herbert, “the true value of the office is not monetary, but for propaganda and corporate diplomacy.” The National Bitcoin Office is attached to the Presidency of the Republic and has the power to establish international relations. Valencia, who is also a specialist in communication, points out that “it has the ability to design public policies that are mandatory for other ministries in the country and grants Keizer and Herbert official titles to inaugurate bitcoin embassies in Europe and the United States.”\n\nTexas and Switzerland have already welcomed Salvadoran bitcoin embassies, which work in parallel to official diplomacy channels. “A network of apocryphal diplomats is being built that will serve to spread official and corporate propaganda. It is an exchange of favors within the patrimonial use of the state. In El Salvador, there is no difference between Bukele’s personal deposits and public finances,” adds Valencia. Given the risks involved with bitcoin, such as its great volatility and lack of transparency, Bukele’s decision to make the cryptocurrency legal tender has sparked sharp rebuke from the International Monetary Fund (IMF), ratings agencies and even the U.S. government.\n\nFarmers demonstrate against the adoption of Bitcoin as legal currency on the Pan-American highway, in September 2021. Salvador Melendez (AP)\n\nBitcoin City\n\nIn June 2021, Bukele announced that bitcoin would be the official currency in his country, along with the dollar. He made the announcement during the Bitcoin Conference in Miami, a large-scale event with concerts, sumo wrestlers, televangelist-style presentations and slogans such as “death to the dollar” and “everyone against the Federal Reserve.” Crypto evangelists criticize the state because they consider it the enemy of what they call “individual sovereignty.” For them, neither Elon Musk nor Mark Zuckerberg are disruptive enough. They understand life in society as a jungle or a casino, where practically the only law is the direct exchange of digital money.\n\nBukele also shares this messianic tone and flashy exhibitionism. At the end of 2021, Bukele hosted Bitcoin Week in El Salvador — an event that tried to emulate the vibe of the Miami conference. At the party to celebrate the end of the event, Bukele took to the main stage, at the foot of the beach, while a giant screen projected in neon blue letters: “The President.” Laser lights, smoke cannons and fireworks went off as the president took the microphone: “When Alexander the Great was conquering the world, he decided to establish 20 Alexandrias throughout his empire. These cities were beacons of hope for the rest of the planet. We must establish our first Alexandria here, in El Salvador. Let’s build Bitcoin City.”\n\nBukele announces Bitcoin City, on November 20, 2021. Salvador Melendez (AP)\n\nBukele said his Bitcoin City would be powered by geothermal energy from a nearby volcano, and that the money to set up schools, hospitals and the rest of the services needed would come from so-called volcano bonds or bitcoin bonds: new Salvadoran public debt securities backed by bitcoin. A year and a half after the announcement, El Salvador — turning a deaf ear to the IMF’s warnings — has prepared a law that will allow it to raise $1 billion via bitcoin-backed bonds. Keizer and Herbert have played a key role in this process. According to an investigation by The Wall Street Journal, Bitfinex — the parent company of their two funds — will provide not only the technological platform for the bonds, but will also request a license to operate as a trader.\n\nBut Keizer and Herbert are not the only influential figures from the crypto world who have collaborated in implementing El Salvador’s bitcoin transition. Jack Mallers, a 27-year-old who created an application for instant money transfers via bitcoin, was one of the president’s closest advisers in drafting the law that formally introduced the currency to the country. Like Keizer and Herbert, he also had a vested interest in El Salvador’s bitcoin project: he was hoping his application would be able to gain ground in the country’s remittance market. Some 20% of El Salvador’s gross domestic product (GDP) comes from money that is sent by Salvadorians living abroad, especially in the U.S. But the project did not work out, and according to sources close to Mallers, he has not set foot in the country again.\n\nA scale model of Bitcoin City shared by Bukele on social media. Nayib Bukele via Twitter\n\nOnly 2% of remittances are transferred via bitcoin, according to data from the Central Bank. And around 70% of Salvadorans do not even have a bank account. “Financial inclusion was one of the objectives of the bitcoin project. But there is no public policy that develops these objectives,” says economist Tatiana Marroquín. “The other goals were to promote the country’s brand image and the reception of tourists. But with everything that has happened with bitcoin in recent months —falling prices, financial fraud — El Salvador’s financial profile has fallen instead of rising.”\n\nBitcoin has lost 40% of its value in the past year. And since Bukele announced that it would be legal tender, the IMF has been issuing more and more warnings. The last warning was in response to the imminent issuance of the so-called volcano bonds. In a statement last month, the international institution stressed: “Given the legal risks, fiscal fragility and largely speculative nature of crypto markets, the authorities should reconsider their plans to expand government exposures to Bitcoin, including by issuing tokenized bonds.”\n\nSign up for our weekly newsletter to get more English-language news coverage from EL PAÍS USA Edition\n\n\n\n"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9maXJzdC1tb3Zlci1hc2lhLWJpdGNvaW4taG9sZHMtMDEzNjIyNjQ3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Holds Above $28K as Investors Await Fresh Productivity, Jobs Data - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nGood morning. Here’s what’s happening:\n\nPrices: What turmoil? Bitcoin holds its perch above $28K. Other major cryptos mostly fall in weekend trading.\n\nInsights: Decentralized-focused tokens soared during the quarter. Their gains came as U.S. regulators zeroed in on centralized exchanges.\n\nPrices\n\nCoinDesk Market Index (CMI)\n\n1,208\n\n−13.8 ▼ 1.1%\n\nBitcoin (BTC)\n\n$28,045\n\n−377.2 ▼ 1.3%\n\nEthereum (ETH)\n\n$1,788\n\n−28.9 ▼ 1.6%\n\nS&P 500\n\n4,109.31\n\n+58.5 ▲ 1.4%\n\nGold\n\n$1,979\n\n+9.6 ▲ 0.5%\n\nNikkei 225\n\n28,041.48\n\n+258.5 ▲ 0.9%\n\nBTC/ETH prices per CoinDesk Indices, as of 7 a.m. ET (11 a.m. UTC)\n\nBitcoin Investors Continue Their Watchful Waiting\n\nWill April bring showers or more sunshine for bitcoin?\n\nThe weekend offered few clues as the largest cryptocurrency by market capitalization kicked off the new month holding at late March levels as investors weighed recent events – bank failures, inflation and crypto-focused regulatory actions – that could push prices higher or drag them down.\n\nBTC was recently trading at $28,045, down 1.3% over the past 24 hours. It rose roughly 21% in March, despite a turbulent last two weeks in which markets teetered at times but always seemed to snap back above the $28,000 threshold.\n\n\"Bitcoin has remained resilient over the last week or so, resulting in a general improvement in market sentiment,\" Joe DiPasquale, CEO of crypto asset manager BitBull Capital, wrote in an email to CoinDesk.\n\nDiPasquale noted that bitcoin was trading above its 200-day moving average, \"historically a strong indicator of bullish price action.\"\n\nBut he also reflected uncertainty about BTC's path forward, calling \"the $32K to $36K range ... an area of interest on the upside while $18K to $20K ... a strong range on the downside.\"\n\nEther was also slightly up from the previous day to change hands at $1,788, down 1.6% but well within its range of the past two weeks. Ethereum developers now await the Shanghai upgrade, which is scheduled to occur April 12 and will mark Ethereum’s full transition to a proof-of-stake (PoS) network, enabling staked ETH withdrawals. Other cryptos in the top 25 by market value were largely in the red.\n\nStory continues\n\nARB, the token of layer 2 blockchain Arbitrum, recently fell 7.4% to trade at $1.19. The decline came amid an uproar in the Arbitrum community over how the Arbitrum Foundation – a centralized company charged with promoting Arbitrum's claimed decentralized ecosystem – held a \"ratification\" vote over decisions it had already implemented, including sending nearly $1 billion in tokens to itself. On Sunday, the foundation said would break up its controversial governance package into a series of separate votes, bending to community pressure.\n\nPopular meme coins DOGE and SHIB were recently off 5.5% and 4.8%, respectively. The CoinDesk Market Index, a measure of crypto markets overall performance was recently down 1.2%.\n\nEquity markets closed an eventful, largely upbeat first quarter on a high with the tech-focused Nasdaq climbing 1.7% and the S&P 500 and the Dow Jones Industrial Average (DJIA) rising 1.2% and 1.4%, respectively.\n\nThis week, investors will have a fresh set of employment and productivity data to gauge whether the U.S. economy is continuing to contract as recent signs have suggested or powering forward. The U.S. Census Bureau will release February durable goods orders on Tuesday, with expectations for a 1% month-over-month decline, and on Friday the U.S. Labor Department will announce March's nonfarm payrolls, with expectations for a 225,000-job spike, and the monthly unemployment rate, which is expected to remain at its current 3.6%. A hot jobs market has figured prominently in central bankers' contemplations about the ongoing strength of the economy, which historically leads to higher inflation readings.\n\nIn an interview with CoinDesk TV, Marc Chandler, Bannockburn Global Forex managing director and chief market strategist, said that \"the financial stress that we saw earlier this month is receding.\"\n\n\"This is allowing the market to focus on two things, which was before the banking stress,\" he said, adding a note of caution. \"One is that the labor market remains fairly robust. And inflation is too high for the Federal Reserve.\"\n\nBiggest Gainers\n\nAsset Ticker Returns DACS Sector XRP XRP +3.0% Currency Decentraland MANA +1.9% Entertainment\n\nBiggest Losers\n\nInsights\n\nA Banner Quarter for Decentralized-Focused Tokens\n\nA growing fear that centralized crypto infrastructure will be the target of U.S. regulators has driven tokens that provide decentralized alternatives to be some of the best performers this past quarter.\n\n(CoinMarketCap)\n\nCoinMarketCap data shows that tokens for protocols LidoDAO (LDO), dYdX (DYDX), and GMX (GMX) were some of the best performers over the last 90 days.\n\nLDO surged in February when the Securities and Exchange Commission (SEC) ordered Kraken to shut down its staking service and continued to rally when Coinbase’s CEO Brian Armstrong said a blanket staking ban was coming alongside a securities classification – a scarlet letter for any sort of crypto with U.S. exposure.\n\nAs for DYDX and GMX, the demise of FTX gave the market a renewed interest in decentralized derivatives exchanges.\n\n“FTX and [sister company] Alameda, as far as we know, were incredibly centralized, controlled by a single person. These things metastasize because of human error,” Dan Gunsberg, creator of Solana-based derivatives exchange Hxro, said to CoinDesk in December.\n\nLike staking, there’s also significant regulatory interest in derivatives. Binance was recently sued by the U.S. Commodity Futures Trading Commission (CFTC) and its derivatives trading desk was front-and-center in the suit. Traders are looking for decentralized alternatives, which they feel are beyond the big-guns of American regulators and outside the crypto war conflict zone.\n\nBut decentralized derivative exchanges also have their problems too. As CoinDesk recently reported, many are struggling with liquidity and a lack of available open interest means that they cannot sustain big orders. While not all decentralized derivative exchanges suffer from this problem, it does cast some doubt on how well the idea scales.\n\nWhile decentralization was a theme for the quarter’s best performers, the actual token that took first place was Conflux (CFX), up a whopping 1,622%, according to CoinMarketCap data.\n\nIt’s not entirely clear what’s driving such an outsized gain. Sure, Conflux’s Blockchain SIM card has attracted some interest from investors, but right now its all theoretical and still in a trial phase. On-chain data shows that the number of transactions on the CFX chain are lower than what they were a year ago.\n\nBut, this is crypto. And sometimes there’s not discernable data behind a token that pumps.\n\nImportant events\n\n9:00 a.m. HKT/SGT(1:00 UTC) Australia TD Securities Inflation (YoY/March)\n\n3:55 p.m. HKT/SGT(7:55 UTC) Germany S&P Global/BME Manufacturing PMI (March)\n\n10:00 p.m. HKT/SGT(14:00 UTC) United States ISM Manufacturing PMI (March)\n\nCoinDesk TV\n\nIn case you missed it, here is the most recent episode of \"First Mover\" on CoinDesk TV:\n\nBitcoin Slips as Fed's Preferred Inflation Gauge Rose 0.3% in February; What's Next for Binance?\n\nBitcoin (BTC) was hovering around $28,000 as the PCE price index increased 0.3 percent in February. Bannockburn Global Forex chief market strategist Marc Chandler shared his crypto markets analysis. Plus, DappRadar head of research and analytics Pedro Herrera discussed decentralized finance's performance and the rise of interest in Arbitrum in the first quarter.\n\nHeadlines\n\nArbitrum’s First Governance Proposal Turns Messy With $1B ARB Tokens at Stake: The Arbitrum Foundation would get to side-step community governance when issuing “special grants.”\n\nOver 7,000 Players Successfully Converged in Yuga Labs' Otherside Metaverse 'Second Trip': Thousands of non-fungible token holders joined the gamified experience last weekend, showing glimpses of what’s to come from the virtual world launching later this year.\n\nTUSD Stablecoin Daily Trading Volume Surpasses $1B After Binance Boost: The surge follows Binance’s decision a week ago to eliminate the zero-fee trading discount on the platform except for the BTC-TUSD pair.\n\nInvestors Pour Money Into Crypto Investments for 4th Straight Month: Assets under management for digital-asset products climbed to $13.4 billion in March, up 60% from their 2022 low in November, according to CryptoCompare.\n\nU.S. Government Sold $216M of Seized Silk Road Bitcoin This Month: The government will sell the remaining 41,490 BTC in four tranches this year."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9maXJzdC1tb3Zlci1hc2lhLWJpdGNvaW4taG9sZHMtMDEzNjIyNjQ3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Holds Above $28K as Investors Await Fresh Productivity, Jobs Data - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nGood morning. Here’s what’s happening:\n\nPrices: What turmoil? Bitcoin holds its perch above $28K. Other major cryptos mostly fall in weekend trading.\n\nInsights: Decentralized-focused tokens soared during the quarter. Their gains came as U.S. regulators zeroed in on centralized exchanges.\n\nPrices\n\nCoinDesk Market Index (CMI)\n\n1,208\n\n−13.8 ▼ 1.1%\n\nBitcoin (BTC)\n\n$28,045\n\n−377.2 ▼ 1.3%\n\nEthereum (ETH)\n\n$1,788\n\n−28.9 ▼ 1.6%\n\nS&P 500\n\n4,109.31\n\n+58.5 ▲ 1.4%\n\nGold\n\n$1,979\n\n+9.6 ▲ 0.5%\n\nNikkei 225\n\n28,041.48\n\n+258.5 ▲ 0.9%\n\nBTC/ETH prices per CoinDesk Indices, as of 7 a.m. ET (11 a.m. UTC)\n\nBitcoin Investors Continue Their Watchful Waiting\n\nWill April bring showers or more sunshine for bitcoin?\n\nThe weekend offered few clues as the largest cryptocurrency by market capitalization kicked off the new month holding at late March levels as investors weighed recent events – bank failures, inflation and crypto-focused regulatory actions – that could push prices higher or drag them down.\n\nBTC was recently trading at $28,045, down 1.3% over the past 24 hours. It rose roughly 21% in March, despite a turbulent last two weeks in which markets teetered at times but always seemed to snap back above the $28,000 threshold.\n\n\"Bitcoin has remained resilient over the last week or so, resulting in a general improvement in market sentiment,\" Joe DiPasquale, CEO of crypto asset manager BitBull Capital, wrote in an email to CoinDesk.\n\nDiPasquale noted that bitcoin was trading above its 200-day moving average, \"historically a strong indicator of bullish price action.\"\n\nBut he also reflected uncertainty about BTC's path forward, calling \"the $32K to $36K range ... an area of interest on the upside while $18K to $20K ... a strong range on the downside.\"\n\nEther was also slightly up from the previous day to change hands at $1,788, down 1.6% but well within its range of the past two weeks. Ethereum developers now await the Shanghai upgrade, which is scheduled to occur April 12 and will mark Ethereum’s full transition to a proof-of-stake (PoS) network, enabling staked ETH withdrawals. Other cryptos in the top 25 by market value were largely in the red.\n\nStory continues\n\nARB, the token of layer 2 blockchain Arbitrum, recently fell 7.4% to trade at $1.19. The decline came amid an uproar in the Arbitrum community over how the Arbitrum Foundation – a centralized company charged with promoting Arbitrum's claimed decentralized ecosystem – held a \"ratification\" vote over decisions it had already implemented, including sending nearly $1 billion in tokens to itself. On Sunday, the foundation said would break up its controversial governance package into a series of separate votes, bending to community pressure.\n\nPopular meme coins DOGE and SHIB were recently off 5.5% and 4.8%, respectively. The CoinDesk Market Index, a measure of crypto markets overall performance was recently down 1.2%.\n\nEquity markets closed an eventful, largely upbeat first quarter on a high with the tech-focused Nasdaq climbing 1.7% and the S&P 500 and the Dow Jones Industrial Average (DJIA) rising 1.2% and 1.4%, respectively.\n\nThis week, investors will have a fresh set of employment and productivity data to gauge whether the U.S. economy is continuing to contract as recent signs have suggested or powering forward. The U.S. Census Bureau will release February durable goods orders on Tuesday, with expectations for a 1% month-over-month decline, and on Friday the U.S. Labor Department will announce March's nonfarm payrolls, with expectations for a 225,000-job spike, and the monthly unemployment rate, which is expected to remain at its current 3.6%. A hot jobs market has figured prominently in central bankers' contemplations about the ongoing strength of the economy, which historically leads to higher inflation readings.\n\nIn an interview with CoinDesk TV, Marc Chandler, Bannockburn Global Forex managing director and chief market strategist, said that \"the financial stress that we saw earlier this month is receding.\"\n\n\"This is allowing the market to focus on two things, which was before the banking stress,\" he said, adding a note of caution. \"One is that the labor market remains fairly robust. And inflation is too high for the Federal Reserve.\"\n\nBiggest Gainers\n\nAsset Ticker Returns DACS Sector XRP XRP +3.0% Currency Decentraland MANA +1.9% Entertainment\n\nBiggest Losers\n\nInsights\n\nA Banner Quarter for Decentralized-Focused Tokens\n\nA growing fear that centralized crypto infrastructure will be the target of U.S. regulators has driven tokens that provide decentralized alternatives to be some of the best performers this past quarter.\n\n(CoinMarketCap)\n\nCoinMarketCap data shows that tokens for protocols LidoDAO (LDO), dYdX (DYDX), and GMX (GMX) were some of the best performers over the last 90 days.\n\nLDO surged in February when the Securities and Exchange Commission (SEC) ordered Kraken to shut down its staking service and continued to rally when Coinbase’s CEO Brian Armstrong said a blanket staking ban was coming alongside a securities classification – a scarlet letter for any sort of crypto with U.S. exposure.\n\nAs for DYDX and GMX, the demise of FTX gave the market a renewed interest in decentralized derivatives exchanges.\n\n“FTX and [sister company] Alameda, as far as we know, were incredibly centralized, controlled by a single person. These things metastasize because of human error,” Dan Gunsberg, creator of Solana-based derivatives exchange Hxro, said to CoinDesk in December.\n\nLike staking, there’s also significant regulatory interest in derivatives. Binance was recently sued by the U.S. Commodity Futures Trading Commission (CFTC) and its derivatives trading desk was front-and-center in the suit. Traders are looking for decentralized alternatives, which they feel are beyond the big-guns of American regulators and outside the crypto war conflict zone.\n\nBut decentralized derivative exchanges also have their problems too. As CoinDesk recently reported, many are struggling with liquidity and a lack of available open interest means that they cannot sustain big orders. While not all decentralized derivative exchanges suffer from this problem, it does cast some doubt on how well the idea scales.\n\nWhile decentralization was a theme for the quarter’s best performers, the actual token that took first place was Conflux (CFX), up a whopping 1,622%, according to CoinMarketCap data.\n\nIt’s not entirely clear what’s driving such an outsized gain. Sure, Conflux’s Blockchain SIM card has attracted some interest from investors, but right now its all theoretical and still in a trial phase. On-chain data shows that the number of transactions on the CFX chain are lower than what they were a year ago.\n\nBut, this is crypto. And sometimes there’s not discernable data behind a token that pumps.\n\nImportant events\n\n9:00 a.m. HKT/SGT(1:00 UTC) Australia TD Securities Inflation (YoY/March)\n\n3:55 p.m. HKT/SGT(7:55 UTC) Germany S&P Global/BME Manufacturing PMI (March)\n\n10:00 p.m. HKT/SGT(14:00 UTC) United States ISM Manufacturing PMI (March)\n\nCoinDesk TV\n\nIn case you missed it, here is the most recent episode of \"First Mover\" on CoinDesk TV:\n\nBitcoin Slips as Fed's Preferred Inflation Gauge Rose 0.3% in February; What's Next for Binance?\n\nBitcoin (BTC) was hovering around $28,000 as the PCE price index increased 0.3 percent in February. Bannockburn Global Forex chief market strategist Marc Chandler shared his crypto markets analysis. Plus, DappRadar head of research and analytics Pedro Herrera discussed decentralized finance's performance and the rise of interest in Arbitrum in the first quarter.\n\nHeadlines\n\nArbitrum’s First Governance Proposal Turns Messy With $1B ARB Tokens at Stake: The Arbitrum Foundation would get to side-step community governance when issuing “special grants.”\n\nOver 7,000 Players Successfully Converged in Yuga Labs' Otherside Metaverse 'Second Trip': Thousands of non-fungible token holders joined the gamified experience last weekend, showing glimpses of what’s to come from the virtual world launching later this year.\n\nTUSD Stablecoin Daily Trading Volume Surpasses $1B After Binance Boost: The surge follows Binance’s decision a week ago to eliminate the zero-fee trading discount on the platform except for the BTC-TUSD pair.\n\nInvestors Pour Money Into Crypto Investments for 4th Straight Month: Assets under management for digital-asset products climbed to $13.4 billion in March, up 60% from their 2022 low in November, according to CryptoCompare.\n\nU.S. Government Sold $216M of Seized Silk Road Bitcoin This Month: The government will sell the remaining 41,490 BTC in four tranches this year."
    }
]