[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDgvMTQvcHJvLWJpdGNvaW4tY2FuZGlkYXRlLWphdmllci1taWxlaS11bmV4cGVjdGVkbHktbGVhZHMtaW4tcHJlc2lkZW50aWFsLXZvdGluZy1pbi1hcmdlbnRpbmEv0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOC8xNC9wcm8tYml0Y29pbi1jYW5kaWRhdGUtamF2aWVyLW1pbGVpLXVuZXhwZWN0ZWRseS1sZWFkcy1pbi1wcmVzaWRlbnRpYWwtdm90aW5nLWluLWFyZ2VudGluYS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Pro-Bitcoin Candidate Javier Milei Snags Primary Presidential Elections in Argentina - CoinDesk",
        "content": "With no candidate likely to obtain more than 45% in today’s polling, a general election among the winner for each party will be held in October. If no one receives 45% in that vote, a final runoff vote will be held in November."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDgvMTQvc2VjLWRlbGF5cy1kZWNpc2lvbi1vbi1hcmstMjFzaGFyZXMtc3BvdC1iaXRjb2luLWV0Zi1jbmJjLWNyeXB0by13b3JsZC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "SEC delays decision on ARK 21Shares spot bitcoin ETF - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nSEC delays decision on ARK 21Shares spot bitcoin ETF: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Puneet Singhvi of Citi discusses how institutions are making use of crypto and blockchain technology in their portfolios and businesses."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmdyZWVucGVhY2Uub3JnL3VzYS9ibGFja3JvY2tzLWJpdGNvaW4tYmV0cy1hcmUtYmFkLWZvci10aGUtcGxhbmV0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "BlackRock’s Bitcoin Bets Are Bad For The Planet - greenpeace.org",
        "content": "BlackRock’s Bitcoin Bets Are Bad For The Planet\n\nBlackRock, the world’s largest asset manager, is placing a big bet on Bitcoin that could drive up the digital asset’s price and its climate-damaging pollution. Despite pledges to reduce carbon emissions and acknowledgement that climate risks are investment risks, BlackRock is investing in dirty Bitcoin without acknowledging its energy intensity or carbon emissions. This is bad news for the planet.\n\nIn June 2023, BlackRock applied for an exchange-traded fund (ETF) tied to the price of Bitcoin. This first-of-its-kind product made headlines and was followed by a spike in the price of bitcoin.\n\nAn ETF is basically a way for investors to bet on Bitcoin’s value without having to actually buy and hold bitcoin, which can be tricky as well as risky. A Bitcoin ETF managed by a large company like BlackRock could attract many more mainstream investors. But the potential profits for BlackRock and investors would come at a sharp cost to the climate and the rest of society. When Bitcoin’s price and trading volume goes up, so does its energy consumption and carbon emissions. With Bitcoin’s annual carbon emissions already at the scale of a mid-sized industrial country, the world simply can’t afford to support Bitcoin’s price growth.\n\nBlackRock’s ETF proposal builds on other products and services the company offers that enable investing in Bitcoin. In 2022, the company launched a private bitcoin trust that would let institutional investors bet on the price of Bitcoin. This was part of a larger effort to make it more convenient for investors to manage Bitcoin alongside their standard portfolios of stocks and bonds. BlackRock partnered with Coinbase, the crypto exchange company, to integrate Bitcoin into the Coinbases popular investment management platform called Aladdin which would let clients track their bitcoin holdings and trade bitcoin via Coinbase’s exchange.\n\nBlackRock is also putting some of its massive assets into Bitcoin mining companies – the facilities that create Bitcoin’s large carbon footprint. Greenpeace USA research finds that BlackRock controls nearly $600 million worth of shares in Bitcoin mining companies and has shares in most of the large publicly traded miners. These investments are vital for mining companies to access funding for their energy-intensive facilities. For example, BlackRock controlled over 28 million shares valued at $300 million in Riot Platforms, which owns the most energy-intensive U.S. crypto mine in Rockdale, Texas that uses as much electricity as the nearest 300,000 homes. And nearly all that energy is supplied by fossil fuels.\n\nBlackRock also has ties to Bitcoin miners keeping dirty coal power plants alive. The company owns $2.8 million worth of bonds in Marathon Digital whose mining facility helped keep the coal-fired Hardin Generating Station in Hardin, MT operating past its planned closure in 2018. In 2021, this led to 755,700 tons of CO2 emissions and local air pollution with 304 tons of sulfur dioxide and 245 tons of nitrogen oxides. BlackRock also controls a nearly 6% share in Greenidge Generation Holdings, a company that converted a closed coal plant to fossil gas in upstate New York to power a Bitcoin mine. Regulators and the public have scrutinized the facility for its pollution.\n\nAnd when mining companies struggle financially, BlackRock has helped them stay afloat. When Core Scientific filed for bankruptcy in 2022, BlackRock joined a group of creditors that lent the company around $500 million, chipping in $38 million, and contributing another $17 million loan to help Core Scientific operate during bankruptcy.\n\nYet, BlackRock could turn its resources, expertise, and clout towards transforming Bitcoin and mobilizing stakeholders to work on innovative solutions that slash Bitcoin’s carbon footprint while maintaining its key features. Cryptocurrencies don’t have to use massive amounts of electricity. Most don’t, and they can change. Now is the time for BlackRock to acknowledge Bitcoin’s pollution and help solve the problem."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXRyYWRpbmctc2lkZXdheXMtbmZ0LXRyYW5zYWN0aW9ucy0wMjE4NTUwMDQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin trading sideways; NFT transactions soar; Nvidia leads Wall Street rally - Yahoo Finance",
        "content": "Bitcoin edged higher on Tuesday morning in Asia but failed to breach the US$29,500 resistance level. Ether also edged up, while other top 10 non-stablecoin cryptocurrencies traded flat to higher. Solana’s SOL led the winners. As risk sentiment improved in the wake of weak U.S. inflation data, last week saw an inflow for digital asset investment products after three consecutive weeks of outflows. Meanwhile, the Forkast 500 NFT index moved up after the NFT market logged the largest weekly total transactions since February 2022. U.S. stock futures traded mixed after Wall Street closed higher Monday on the back of a rally led by chipmaker Nvidia.\n\nA blessing in disguise\n\nBitcoin edged up 0.35% in the last 24 hours to US$29,408.45 as of 07:30 a.m. in Hong Kong, and logged a weekly gain of 0.91%, according to CoinMarketCap data. The world’s leading cryptocurrency reached a high of US$29,660.25 early Tuesday morning.\n\nBitcoin’s price has remained largely within the $29,000 to $30,600 range for the past seven weeks, causing frustration among investors seeking higher rewards. However, low volatility could be a blessing in disguise, Nigel Green, founder and chief executive officer of financial management group deVere, said in an emailed statement.\n\n“This newfound stability attracts institutional investors, who have been historically wary of entering the market due to its extreme price swings,” Green said.\n\n“This stability is also a boon for businesses and consumers looking for a reliable store of value or medium of exchange,” he added.\n\nMatteo Greco, research analyst at Canada-based digital asset investment firm Fineqia International, said in an emailed note that low volatility does not necessarily mean low investor interest in the coin.\n\nGreco pointed to the Bitcoin long-term holder level — a metric that measures the percentage of Bitcoin holders who have held the coin for over 155 days —which reached its highest ever level over the first week of August.\n\nStory continues\n\n“The data shows how the vast majority of BTC holders did not execute trades in the last few months, as the low volumes and the almost inexistent volatility recorded in the last two months suggest,” said Greco.\n\n“These numbers are also typical to be observed during the summer months, especially July and August, and do not reflect a decrease in investors’ interest towards the digital asset market,” he added.\n\nMeanwhile, digital asset investment products saw an inflow of US$29 million in the week ending August 11. That followed three consecutive weeks of outflows totalling around US$144 million, according to a Monday report by European alternative asset manager CoinShares. Bitcoin saw an inflow of US$27 million — roughly 93% of the total inflows.\n\nThe inflows to digital asset investment products are “likely due to the recent U.S. inflation data, which was slightly below expectations, signifying that a September rate hike is less likely,” CoinShares wrote in the report.\n\nAlong with Bitcoin, Ether gained 0.22% to US$1,844.14 and added 1.05% for the past seven days. Other top 10 non-stablecoin cryptocurrencies all traded higher with the exception of Dogecoin, which inched 0.06% lower to US$0.07477 but gained 2.05% for the week.\n\nSolana’s SOL led the winners, rising 3.50% to US$25.17 for a 9.42% weekly gain.\n\nSynesis One, an artificial intelligence (AI) data crowdsourcing platform based on the Solana blockchain, launched its new train-to-earn application “Workspace by Synesis” on Monday.\n\nThe app allows users to train AIs as data providers while earning cryptocurrencies as rewards. This process, Synesis One claims, will result in a “fully traceable and auditable” data supply chain.\n\nWe are proud to announce the launch of the Synesis One AI data crowdsourcing app on @solana Mainnet! 🎉🎉https://t.co/L4Bjq5upgT\n\n\n\nMore information in the 🧵below! pic.twitter.com/eyd4wtBHYD — Synesis One (@synesis_one) August 14, 2023\n\nOutside the top 10 cryptos, HBAR, the utility token of distributed ledger technology platform Hedera Hashgraph, saw its price surge 13.59% in the past 24 hours to US$0.06666. That contributed to a weekly jump of 12.89%.\n\nHBAR received a boost after Dropp, a Hedera-based micropayments application, was added to the U.S. Federal Reserve’s instant payments platform FedNow. The Fed-run service allows merchants to “accept small-value purchases digitally without paying large transaction fees” following its launch in July.\n\nThe total crypto market capitalization moved up 0.40% in the past 24 hours to US$1.17 trillion, while trading volume rose 47.95% to US$28.52 billion.\n\nWeekly NFT transactions hit year-long high\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe main Forkast 500 NFT index moved up 0.39% in the past 24 hours to 2,486.89 as of 09:50 a.m. in Hong Kong, and notched a 0.27% gain for the week. Forkast’s Ethereum and Polygon NFT indexes also logged gains, while the indexes for Solana and Cardano dropped.\n\nTotal NFT trading volume rose 22.88% in the past 24 hours to over US$16.48 million, according to data from CryptoSlam. Volumes on the Ethereum, Solana, Polygon, and Cardano blockchains all logged gains, while volume on the Bitcoin blockchain dipped.\n\nIn the week ending August 13, NFT sales topped US$101 million after sitting short of US$100 million for three consecutive weeks. Meanwhile, NFT transactions for the week totaled more than 2.80 million, a high not seen since February 2022.\n\nYehudah Petscher, NFT Strategist at Forkast Labs, commenting on the past week’s surge in NFT sales, said that he saw the emergence of low-priced collections as key to a sustained potential uptick in the market.\n\n“We’re getting a glimpse of the future of NFTs. More affordable prices, higher volume, likely big brands and this is what we’re seeing in DraftKings, DMarket, Gods Unchained, and Sorare,” said Petscher.\n\nCombined, Petscher noted, those three collections alone notched 872,185 transactions — nearly a third of the week’s total transactions.\n\n“The question is, is this sustainable? I think it is, and that’s exactly why this will be the future. Traders haven’t really left NFT, they just ran out of liquidity since there’s no profits. But they can afford NFTs that are priced at just a few dollars,” Petscher added.\n\nAmong NFT collections, Ethereum-based DeGods saw the largest 24-hour sales volume. The collection surged 144.25% to over US$2.21 million after the project launched its “Season 3” digital art collection on Sunday.\n\nRather than introducing new NFTs, Season 3 allows its holders to upgrade their original DeGods NFT and receive four generative artworks.\n\nMythos Chain-based DMarket and ImmutableX-based Gods Unchained — two video game-adjacent collections — came in second and third place in terms of 24-hour sales volume.\n\nMeanwhile, global beverage giant Coca-Cola Company introduced its “Masterpiece” NFT collection on Monday. The collection combines classic and contemporary art pieces with virtual coca-cola bottles, the company said.\n\nCheck out the link below to see the full Masterpiece collection https://t.co/PQoKJCmUWe — Coca-Cola (@CocaCola) August 13, 2023\n\nThe collection is issued on the Base blockchain, an Ethereum layer-2 network recently launched by crypto exchange Coinbase.\n\nNvidia leads US equities rally\n\nNvidia headquarters in Santa Clara, California|Image: Getty Images\n\nU.S. stock futures traded higher as of 11:20 a.m. in Hong Kong following gains at the close of trading Monday. The tech-heavy Nasdaq led the gains with a rise of 0.34%.\n\nIn Asia, the main stock indexes traded mixed on Tuesday morning. China’s Shanghai Composite, Hong Kong’s Hang Seng and South Korea’s Kospi all logged losses, while Japan’s Nikkei moved higher.\n\nArtificial intelligence (AI) chipmaker Nvidia Corporation posted a rise of 7.09% on Monday, its highest daily rise since May. That jump followed a note from multinational investment bank Morgan Stanley that described the U.S. tech giant as its “top pick” amid a “massive shift in spending towards AI.”\n\nNvidia’s highly anticipated quarterly earnings report is due for release next week.\n\n“It’s the first day in a while that tech has really significantly outperformed,” Jay Hatfield, CEO of U.S.-based investment advisor Infrastructure Capital Advisors, told Reuters.\n\n“That’s indicative of the fact that you have this blockbuster Nvidia report coming up and that could support the tech market pretty substantially,” Hatfield added.\n\nU.S. investors now await the release of retail sales data on Tuesday, followed by the U.S. Federal Reserve’s July meeting minutes on Wednesday, for further insight on the health of the U.S. economy and the Fed’s future monetary policies.\n\nThe Fed meets on Sep. 19 to make its next move on interest rates, which are now between 5.25% to 5.50%, the highest level since January 2001. Analysts at the CME FedWatch Tool predict a 88.5% chance there will be no interest rate hike in September.\n\nElsewhere, China’s central bank unexpectedly lowered the rate of its medium-term lending facility (MLF) by 15 basis points to 2.5% on Tuesday, only two months after the previous rate cut in June.\n\n“The slightly earlier timing and a larger than expected 15 basis point rate cut of MLF show that Beijing feels the urgency to take more policy easing actions to stabilize expectations and growth,” Xiaojia Zhi, chief China economist at international banking group Credit Agricole, told Bloomberg.\n\nZhi added that China could see more monetary easing in the coming months.\n\nThe decision was announced shortly before China’s National Bureau of Statistics reported disappointing economic data for July. That data included a rise in the urban unemployment rate, as well as decelerated and smaller-than-expected growth in retail sales and industrial production, according to the Wall Street Journal.\n\n(Updates with equities section.)"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXRyYWRpbmctc2lkZXdheXMtbmZ0LXRyYW5zYWN0aW9ucy0wMjE4NTUwMDQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin trading sideways; NFT transactions soar; Nvidia leads Wall Street rally - Yahoo Finance",
        "content": "Bitcoin edged higher on Tuesday morning in Asia but failed to breach the US$29,500 resistance level. Ether also edged up, while other top 10 non-stablecoin cryptocurrencies traded flat to higher. Solana’s SOL led the winners. As risk sentiment improved in the wake of weak U.S. inflation data, last week saw an inflow for digital asset investment products after three consecutive weeks of outflows. Meanwhile, the Forkast 500 NFT index moved up after the NFT market logged the largest weekly total transactions since February 2022. U.S. stock futures traded mixed after Wall Street closed higher Monday on the back of a rally led by chipmaker Nvidia.\n\nA blessing in disguise\n\nBitcoin edged up 0.35% in the last 24 hours to US$29,408.45 as of 07:30 a.m. in Hong Kong, and logged a weekly gain of 0.91%, according to CoinMarketCap data. The world’s leading cryptocurrency reached a high of US$29,660.25 early Tuesday morning.\n\nBitcoin’s price has remained largely within the $29,000 to $30,600 range for the past seven weeks, causing frustration among investors seeking higher rewards. However, low volatility could be a blessing in disguise, Nigel Green, founder and chief executive officer of financial management group deVere, said in an emailed statement.\n\n“This newfound stability attracts institutional investors, who have been historically wary of entering the market due to its extreme price swings,” Green said.\n\n“This stability is also a boon for businesses and consumers looking for a reliable store of value or medium of exchange,” he added.\n\nMatteo Greco, research analyst at Canada-based digital asset investment firm Fineqia International, said in an emailed note that low volatility does not necessarily mean low investor interest in the coin.\n\nGreco pointed to the Bitcoin long-term holder level — a metric that measures the percentage of Bitcoin holders who have held the coin for over 155 days —which reached its highest ever level over the first week of August.\n\nStory continues\n\n“The data shows how the vast majority of BTC holders did not execute trades in the last few months, as the low volumes and the almost inexistent volatility recorded in the last two months suggest,” said Greco.\n\n“These numbers are also typical to be observed during the summer months, especially July and August, and do not reflect a decrease in investors’ interest towards the digital asset market,” he added.\n\nMeanwhile, digital asset investment products saw an inflow of US$29 million in the week ending August 11. That followed three consecutive weeks of outflows totalling around US$144 million, according to a Monday report by European alternative asset manager CoinShares. Bitcoin saw an inflow of US$27 million — roughly 93% of the total inflows.\n\nThe inflows to digital asset investment products are “likely due to the recent U.S. inflation data, which was slightly below expectations, signifying that a September rate hike is less likely,” CoinShares wrote in the report.\n\nAlong with Bitcoin, Ether gained 0.22% to US$1,844.14 and added 1.05% for the past seven days. Other top 10 non-stablecoin cryptocurrencies all traded higher with the exception of Dogecoin, which inched 0.06% lower to US$0.07477 but gained 2.05% for the week.\n\nSolana’s SOL led the winners, rising 3.50% to US$25.17 for a 9.42% weekly gain.\n\nSynesis One, an artificial intelligence (AI) data crowdsourcing platform based on the Solana blockchain, launched its new train-to-earn application “Workspace by Synesis” on Monday.\n\nThe app allows users to train AIs as data providers while earning cryptocurrencies as rewards. This process, Synesis One claims, will result in a “fully traceable and auditable” data supply chain.\n\nWe are proud to announce the launch of the Synesis One AI data crowdsourcing app on @solana Mainnet! 🎉🎉https://t.co/L4Bjq5upgT\n\n\n\nMore information in the 🧵below! pic.twitter.com/eyd4wtBHYD — Synesis One (@synesis_one) August 14, 2023\n\nOutside the top 10 cryptos, HBAR, the utility token of distributed ledger technology platform Hedera Hashgraph, saw its price surge 13.59% in the past 24 hours to US$0.06666. That contributed to a weekly jump of 12.89%.\n\nHBAR received a boost after Dropp, a Hedera-based micropayments application, was added to the U.S. Federal Reserve’s instant payments platform FedNow. The Fed-run service allows merchants to “accept small-value purchases digitally without paying large transaction fees” following its launch in July.\n\nThe total crypto market capitalization moved up 0.40% in the past 24 hours to US$1.17 trillion, while trading volume rose 47.95% to US$28.52 billion.\n\nWeekly NFT transactions hit year-long high\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe main Forkast 500 NFT index moved up 0.39% in the past 24 hours to 2,486.89 as of 09:50 a.m. in Hong Kong, and notched a 0.27% gain for the week. Forkast’s Ethereum and Polygon NFT indexes also logged gains, while the indexes for Solana and Cardano dropped.\n\nTotal NFT trading volume rose 22.88% in the past 24 hours to over US$16.48 million, according to data from CryptoSlam. Volumes on the Ethereum, Solana, Polygon, and Cardano blockchains all logged gains, while volume on the Bitcoin blockchain dipped.\n\nIn the week ending August 13, NFT sales topped US$101 million after sitting short of US$100 million for three consecutive weeks. Meanwhile, NFT transactions for the week totaled more than 2.80 million, a high not seen since February 2022.\n\nYehudah Petscher, NFT Strategist at Forkast Labs, commenting on the past week’s surge in NFT sales, said that he saw the emergence of low-priced collections as key to a sustained potential uptick in the market.\n\n“We’re getting a glimpse of the future of NFTs. More affordable prices, higher volume, likely big brands and this is what we’re seeing in DraftKings, DMarket, Gods Unchained, and Sorare,” said Petscher.\n\nCombined, Petscher noted, those three collections alone notched 872,185 transactions — nearly a third of the week’s total transactions.\n\n“The question is, is this sustainable? I think it is, and that’s exactly why this will be the future. Traders haven’t really left NFT, they just ran out of liquidity since there’s no profits. But they can afford NFTs that are priced at just a few dollars,” Petscher added.\n\nAmong NFT collections, Ethereum-based DeGods saw the largest 24-hour sales volume. The collection surged 144.25% to over US$2.21 million after the project launched its “Season 3” digital art collection on Sunday.\n\nRather than introducing new NFTs, Season 3 allows its holders to upgrade their original DeGods NFT and receive four generative artworks.\n\nMythos Chain-based DMarket and ImmutableX-based Gods Unchained — two video game-adjacent collections — came in second and third place in terms of 24-hour sales volume.\n\nMeanwhile, global beverage giant Coca-Cola Company introduced its “Masterpiece” NFT collection on Monday. The collection combines classic and contemporary art pieces with virtual coca-cola bottles, the company said.\n\nCheck out the link below to see the full Masterpiece collection https://t.co/PQoKJCmUWe — Coca-Cola (@CocaCola) August 13, 2023\n\nThe collection is issued on the Base blockchain, an Ethereum layer-2 network recently launched by crypto exchange Coinbase.\n\nNvidia leads US equities rally\n\nNvidia headquarters in Santa Clara, California|Image: Getty Images\n\nU.S. stock futures traded higher as of 11:20 a.m. in Hong Kong following gains at the close of trading Monday. The tech-heavy Nasdaq led the gains with a rise of 0.34%.\n\nIn Asia, the main stock indexes traded mixed on Tuesday morning. China’s Shanghai Composite, Hong Kong’s Hang Seng and South Korea’s Kospi all logged losses, while Japan’s Nikkei moved higher.\n\nArtificial intelligence (AI) chipmaker Nvidia Corporation posted a rise of 7.09% on Monday, its highest daily rise since May. That jump followed a note from multinational investment bank Morgan Stanley that described the U.S. tech giant as its “top pick” amid a “massive shift in spending towards AI.”\n\nNvidia’s highly anticipated quarterly earnings report is due for release next week.\n\n“It’s the first day in a while that tech has really significantly outperformed,” Jay Hatfield, CEO of U.S.-based investment advisor Infrastructure Capital Advisors, told Reuters.\n\n“That’s indicative of the fact that you have this blockbuster Nvidia report coming up and that could support the tech market pretty substantially,” Hatfield added.\n\nU.S. investors now await the release of retail sales data on Tuesday, followed by the U.S. Federal Reserve’s July meeting minutes on Wednesday, for further insight on the health of the U.S. economy and the Fed’s future monetary policies.\n\nThe Fed meets on Sep. 19 to make its next move on interest rates, which are now between 5.25% to 5.50%, the highest level since January 2001. Analysts at the CME FedWatch Tool predict a 88.5% chance there will be no interest rate hike in September.\n\nElsewhere, China’s central bank unexpectedly lowered the rate of its medium-term lending facility (MLF) by 15 basis points to 2.5% on Tuesday, only two months after the previous rate cut in June.\n\n“The slightly earlier timing and a larger than expected 15 basis point rate cut of MLF show that Beijing feels the urgency to take more policy easing actions to stabilize expectations and growth,” Xiaojia Zhi, chief China economist at international banking group Credit Agricole, told Bloomberg.\n\nZhi added that China could see more monetary easing in the coming months.\n\nThe decision was announced shortly before China’s National Bureau of Statistics reported disappointing economic data for July. That data included a rise in the urban unemployment rate, as well as decelerated and smaller-than-expected growth in retail sales and industrial production, according to the Wall Street Journal.\n\n(Updates with equities section.)"
    }
]