[
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTI1L2JpdGNvaW4tZXllcy1maXJzdC10d28tZGF5LWRyb3Atb2YtMjAyMy1hcy1taWNyb3NvZnQtZGVudHMtbW9vZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Eyes First Two-Day Drop of 2023 as Microsoft Dents Mood - Bloomberg",
        "content": "Bitcoin is flirting with its first back-to-back drop since the start of the year following a poor revenue outlook from technology bellwether Microsoft Corp. that dented wider investor sentiment.\n\nThe largest token fell as much as 2.5% and was trading at about $22,518 as of 10:281 a.m. in New York. A range of smaller coins, from Ether to Cardano to Avalanche , were also in the red."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTI1L2JpdGNvaW4tb3B0aW9ucy1leGNoYW5nZS1kZXJpYml0LWxvb2tzLXRvLXJlbG9jYXRlLXRvLWR1YmFp0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Options Exchange Deribit Looks to Relocate to Dubai - Bloomberg",
        "content": "Deribit, the world’s biggest Bitcoin and Ether options exchange, is making plans to relocate to Dubai as soon as the third quarter if authorities in the crypto-friendly emirate provide more clarity on regulations.\n\nThe trading platform, which has been based in Panama since 2020, is preparing to open a Dubai office with about 10 people, a mix of core employees and local hires, David Dohmen, chief legal compliance and regulatory officer at Deribit, said in an interview. Some employees will continue to be based in Panama. Deribit’s Netherlands-based parent company and related subsidiaries currently employ 95 people globally, roughly double year-ago levels."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWplc3VzLXJvZ2VyLXZlci1zYXlzLTE4MDQ1MjE1NS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Jan 2023 08:00:00 GMT",
        "title": "'Bitcoin Jesus' Roger Ver Says He Doesn't Have to Pay the $21M He Owes Genesis - Yahoo Finance",
        "content": "Bitcoin evangelist Roger Ver said in a Reddit post yesterday that he has “sufficient funds” to pay now-bankrupt crypto broker Genesis the $21 million he owes, but argued that he doesn’t have to.\n\n“I have sufficient funds on hand to pay Genesis the sums allegedly owed, and I’m happy to pay what I actually owe. However, Genesis was required by our agreement to remain solvent—as Genesis can’t ask its clients to play a “heads clients lose, tails Genesis wins” game,” he wrote in response to a post in the Bitcoin subreddit asking, “Did Roger Ver get rekt?”\n\nVer, who earned the moniker of \"Bitcoin Jesus\" as an early adopter of the technology, responded to the post yesterday, then on Wednesday morning shared a screenshot of his comment on Twitter.\n\nThe allegations against him were revealed in a summons filed in New York State Supreme Court on Monday by GGC International, a unit of Genesis Global. In it, the company says Ver owes the company $20,869,788 for “failure to settle cryptocurrency options transactions” that expired on December 30.\n\nThe Digital Currency Group broker and lending desk filed for bankruptcy on January 20, revealing in court documents that it has more than $150 million to fund its restructuring efforts.\n\nIf any of this sounds familiar, it’s because Ver was involved in a similar spat with CoinFLEX last year. The crypto trading platform halted withdrawals in June, citing liquidity problems. It was a common refrain from companies at the time, who were dealing with the fallout from multiple bankruptcies.\n\nBut CoinFLEX CEO Mark Lamb claimed on Twitter that Ver owes the company $47 million and said he’d already been issued a default notice for failure to pay up.\n\nVer called the claim “blatantly false,” adding that CoinFLEX owed him money, not the other way around.\n\n“Not only do I not have a debt to this counter-party, but this counter-party owes me a substantial sum of money, and I am currently seeking the return of my funds,” he wrote on Twitter."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbiUzQS13aWxsLXRoaXMtcmFsbHktbGFzdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin: Will This Rally Last? - Nasdaq",
        "content": "The price of bitcoin (BTC) has had a healthy increase this month, climbing by about forty percent since the beginning of the month. But that leaves open questions about the durability of this rise and whether or not the price of bitcoin will continue to surge from this point forward.\n\nBitcoin's Price\n\nThe price of Bitcoin has not yet recovered from its precipitous drop after reaching an all-time high of $68,904 in November 2021. The crash in cryptocurrency values was brought about by a variety of factors, including the ultra hawkish-monetary policies of the Federal Reserve and the big failures of cryptocurrency fraud schemes like Celsius. Nevertheless, the BTC price has staged a respectable rebound this month, rising dramatically from last month's low of $16,263 to this month's high of $23,324.\n\nWhy Has There Been Such a Big Jump in Price?\n\nIt is imperative that I first discuss the fundamentals that are the driving force for the present rally before I begin to discuss the resilience of the current rally. The Fed's aggressive monetary policy was the primary factor in the precipitous drop in the price of bitcoin. The Federal Reserve has since shifted its position on monetary policy, going from one that was very hawkish to one that is less aggressive. For instance, it is a near certainty that the Federal Reserve will raise interest rates by just 25 basis points next month. This indicates that the Fed has altered its view despite on inflation as it comes off its peak.\n\nThe risk-on rally is another factor that has contributed to the price of bitcoin being relatively stable. Bitcoin's price has formed a significant positive correlation with the S&P 500 index, which indicates that as the index goes up, we also see an increase in the price of BTC. This suggests that Bitcoin's value will continue to rise in the future as long as the risk-on rally continues.\n\nIn addition, there is a widespread view among traders and investors that Bitcoin has prevailed despite disastrous events such as the collapse of FTX and the domino effect that it triggered as a result. Hodlers have begun to ponder the possibility that crypto winter is over and that we are going to emerge from this predicament unscathed.\n\nWill the Price of Bitcoin Continue to Climb?\n\nThere are two critical aspects of this situation that need close attention. First, there is an influx of money that is being invested for speculative purposes. Everyone is aware that cryptocurrencies have taken a significant hit in prices, and if Bitcoin starts to rise, then there is a strong possibility that other cryptocurrencies will also start to rally. It is quite probable that if the price of bitcoin continues to spike, it will induce more FOMO, which implies that more speculative money will flow into the cryptocurrency industry. This has the potential to drive up the price of BTC.\n\nSecondly, the dollar could weaken if the Fed does start to slow down the process of raising interest rates, as is expected. This has the potential to have two different effects on the price of bitcoin. One is a possibility that the risk-on rally could gain additional momentum, which would be beneficial for bitcoin. The other is that the decline in the value of the dollar index might also lead to an increase in the price of bitcoin.\n\nFrom a technical point of view, there is no doubt that the price of BTC is overbought, as shown by the RSI on a daily time frame. Any reading that is either close to or over 70 suggests that a retracement in prices is probable, while any value that is either close to or below 30 indicates that the price of the asset has been grossly oversold.\n\nTo technical analysts, the $30,000 level is the most significant point of resistance for the price of bitcoin. If the price does not break above this level of resistance, then the bull rally will be in jeopardy. But if BTC breaks through this level and maintains its position above this price point, the likelihood that the price action of BTC will once again attempt to re-test its all-time high will significantly increase.\n\nConclusion\n\nTo summarize, the price of bitcoin has recently begun to attract more attention, but we are not yet out of the woods, and won't be until the price breaks through the $30,000 resistance level and then continues its ascent from that point forward.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbiUzQS13aWxsLXRoaXMtcmFsbHktbGFzdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin: Will This Rally Last? - Nasdaq",
        "content": "The price of bitcoin (BTC) has had a healthy increase this month, climbing by about forty percent since the beginning of the month. But that leaves open questions about the durability of this rise and whether or not the price of bitcoin will continue to surge from this point forward.\n\nBitcoin's Price\n\nThe price of Bitcoin has not yet recovered from its precipitous drop after reaching an all-time high of $68,904 in November 2021. The crash in cryptocurrency values was brought about by a variety of factors, including the ultra hawkish-monetary policies of the Federal Reserve and the big failures of cryptocurrency fraud schemes like Celsius. Nevertheless, the BTC price has staged a respectable rebound this month, rising dramatically from last month's low of $16,263 to this month's high of $23,324.\n\nWhy Has There Been Such a Big Jump in Price?\n\nIt is imperative that I first discuss the fundamentals that are the driving force for the present rally before I begin to discuss the resilience of the current rally. The Fed's aggressive monetary policy was the primary factor in the precipitous drop in the price of bitcoin. The Federal Reserve has since shifted its position on monetary policy, going from one that was very hawkish to one that is less aggressive. For instance, it is a near certainty that the Federal Reserve will raise interest rates by just 25 basis points next month. This indicates that the Fed has altered its view despite on inflation as it comes off its peak.\n\nThe risk-on rally is another factor that has contributed to the price of bitcoin being relatively stable. Bitcoin's price has formed a significant positive correlation with the S&P 500 index, which indicates that as the index goes up, we also see an increase in the price of BTC. This suggests that Bitcoin's value will continue to rise in the future as long as the risk-on rally continues.\n\nIn addition, there is a widespread view among traders and investors that Bitcoin has prevailed despite disastrous events such as the collapse of FTX and the domino effect that it triggered as a result. Hodlers have begun to ponder the possibility that crypto winter is over and that we are going to emerge from this predicament unscathed.\n\nWill the Price of Bitcoin Continue to Climb?\n\nThere are two critical aspects of this situation that need close attention. First, there is an influx of money that is being invested for speculative purposes. Everyone is aware that cryptocurrencies have taken a significant hit in prices, and if Bitcoin starts to rise, then there is a strong possibility that other cryptocurrencies will also start to rally. It is quite probable that if the price of bitcoin continues to spike, it will induce more FOMO, which implies that more speculative money will flow into the cryptocurrency industry. This has the potential to drive up the price of BTC.\n\nSecondly, the dollar could weaken if the Fed does start to slow down the process of raising interest rates, as is expected. This has the potential to have two different effects on the price of bitcoin. One is a possibility that the risk-on rally could gain additional momentum, which would be beneficial for bitcoin. The other is that the decline in the value of the dollar index might also lead to an increase in the price of bitcoin.\n\nFrom a technical point of view, there is no doubt that the price of BTC is overbought, as shown by the RSI on a daily time frame. Any reading that is either close to or over 70 suggests that a retracement in prices is probable, while any value that is either close to or below 30 indicates that the price of the asset has been grossly oversold.\n\nTo technical analysts, the $30,000 level is the most significant point of resistance for the price of bitcoin. If the price does not break above this level of resistance, then the bull rally will be in jeopardy. But if BTC breaks through this level and maintains its position above this price point, the likelihood that the price action of BTC will once again attempt to re-test its all-time high will significantly increase.\n\nConclusion\n\nTo summarize, the price of bitcoin has recently begun to attract more attention, but we are not yet out of the woods, and won't be until the price breaks through the $30,000 resistance level and then continues its ascent from that point forward.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]