[
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYml0Y29pbmlzdC5jb20vaXMtMS1taWxsaW9uLXBvc3NpYmxlLWZvci1iaXRjb2luL9IBPWh0dHBzOi8vYml0Y29pbmlzdC5jb20vaXMtMS1taWxsaW9uLXBvc3NpYmxlLWZvci1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 29 Jan 2023 08:00:00 GMT",
        "title": "Is $1 Million Possible For Bitcoin? Here’s What This Analyst Thinks | Bitcoinist.com - Bitcoinist",
        "content": "Bitcoin is already seeing a drawdown which has sparked speculation that the mini-bull run has come to an end. However, over the long term, there is still a bullish case for the digital asset but how high the price will go remains anyone’s best guess. An analyst has taken to Twitter to share their own forecast, which paints one of the most bullish cases for bitcoin over time.\n\nPlanB Says Bitcoin At $1 Million Is Possible\n\nIn a YouTube video, the pseudonymous analyst known as PlanB on Twitter laid out a chart that showed an expected growth pattern for bitcoin. The chart follows through to the very beginning of bitcoin, presumably to show this growth pattern in action over the years.\n\nThe chart shows an old and new stock-to-flow model, popularly known as the S2F model, as well as the BTC price. It then ties in the movement of these three shows a pattern of progression of each one.\n\nFollowing this pattern, PlanB said the price of bitcoin will likely be above $32,000 in 2024, which is the year of the next BTC halving. On a much longer basis, the model puts the price of bitcoin between $100,000 and $1 million by 2025.\n\nPlanB says $100,000 to $1 million still possible | Source: Twitter\n\n“BTC bottom is in, 2024 halving >$32k, 2025 bull market >$100k” scenario could look like this. Note the $100k-$1m yellow range estimate for 2025,” the analyst said.\n\nNow, this is a wide range but PlanB is not the only one that has presented this $1 million scenario for BTC. ARK Invest’s Cathie Wood has also given this exact prediction for the digital asset, although the CEO puts it on a much longer timeframe (By 2030).\n\nCan BTC Really Reach $1 Million?\n\nThe $1 million figure is one that has been echoed by a number of notable personalities in the space. Others have also given equally bullish forecasts, as in the case of Skybridge Capital’s CEO Anthony Scaramucci, who believes that the price of the digital asset will cross $300,000. Another forecast comes from the CEO of Jan3, Samson Mow, who believes the cryptocurrency will reach $1 million in the next five years.\n\nBTC sees drawdown following upward rally | Source: BTCUSD on TradingView.com\n\nFor most of these predictions, the basis and argument behind them have been the capped supply of bitcoin. And with each halving, the bitcoin supply is reduced, something PlanB also highlights in his own analysis.\n\nBillionaire Tim Draper forecasted that BTC’s price will cross $250,000 but Draper believes that this will come with the adoption of BTC by women. The billionaire notes that women control most of the retail spending power and once they are able to direct that toward BTC by being able to use the digital asset to pay for goods and services, then he expects the cryptocurrency to “blow right through” $250,000.\n\nBitcoin is currently trading at $22,933 at the time of this writing. It is down 2.15% in the last 24 hours."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV5ZXMtMjVrLWFzLWJ0Yy1wcmljZS1uZWFycy1iZXN0LXdlZWtseS1jbG9zZS1pbi01LW1vbnRoc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 29 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin eyes $25K as BTC price nears best weekly close in 5 months - Cointelegraph",
        "content": "Bitcoin (BTC) spiked into key liquidity for a third time on Jan. 29 as the weekly and monthly closes loomed.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nTrader on Bitcoin: $25,000 “in sight”\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD briefly hitting $24,498 on Bitstamp overnight.\n\nAlthough short-lived, the move marked the pair’s third attempt to take sell-side liquidity above $23,400 in recent days.\n\nIn each instance, bulls appeared to lack momentum to reclaim new support levels. At the time of writing, the status quo remained the same, with Bitcoin trading just below liquidity at $23,250.\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\nPrevious order book data from Binance uploaded to Twitter by monitoring resource Material Indicators demonstrated the firepower needed to neutralize bears.\n\nAs of Jan. 27, resistance was stacked at $23,200, $24,500 and $25,000, with the latter nonetheless still on traders’ radar as a potential next target.\n\n“$25,000 target in sight,” a confident Crypto Tony told Twitter followers in comments on the day.\n\nBTC/USD annotated chart. Source: Crypto Tony/ Twitter\n\nCrypto Tony additionally expected a move higher on altcoins, with the overall crypto market cap set for a retest of resistance above the $1 trillion mark.\n\n“I am still looking for a decent move up over the next few weeks, BUT Be cautious when we begin tapping the $1.2 - $1.33 trillion market cap resistance level. This is a significant level and I expect strong resistance here,” he wrote on Jan. 28.\n\nTotal crypto market cap annotated chart. Source: Crypto Tony/ Twitter\n\nLike others, however, Crypto Tony remained cautious on longer timeframes, keeping the door open for a new macro low to appear on Bitcoin and altcoins at some point in 2023.\n\nAmong them is fellow commentator Il Capo of Crypto, who, in an update on the day, avoided technical analysis to state that he remained “short and strong” BTC.\n\n“Interesting week ahead,” he added.\n\nBest January in a decade?\n\nAt current prices, BTC/USD looked set to close the week at its highest levels since mid-August 2022.\n\nRelated: Bitcoin ‘so bullish’ at $23K as analyst reveals new BTC price metrics\n\nWith the ramifications of the FTX meltdown absent from the charts, January gains stood at 39.8% at the time of writing, Bitcoin’s most profitable January since 2013.\n\nBitcoin monthly returns data (screenshot). Source: Coinglass\n\nIn addition to the monthly close, the coming week will see new potential macroeconomic triggers from the United States as the Federal Reserve decides on its latest interest rate hike.\n\nThis and more will feature in the forthcoming edition of the Cointelegraph Markets newsletter, released Jan. 30. Sign up to receive it free below.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2lucy1idGMtaW1taW5lbnQtcHJpY2UtcmV2ZXJzYWwtbWlnaHQtYmUtb24tdGhlLWNhcmRzL9IBVWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2lucy1idGMtaW1taW5lbnQtcHJpY2UtcmV2ZXJzYWwtbWlnaHQtYmUtb24tdGhlLWNhcmRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 29 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin’s [BTC] price reversal might be on the cards? - AMBCrypto News",
        "content": "BTC’s price has rallied by 40% since 1 January.\n\nInvestors have recorded significant gains, and now, a price reversal might follow.\n\nExchanging hands at the $23,200 price mark at press time, the leading coin Bitcoin [BTC], currently trades at levels last seen in August 2022. On a year-to-date basis, BTC’s price has rallied by 40%, per data from CoinMarketCap.\n\nSharing a statistically significant positive correlation with several other assets in the market, the growth in BTC’s price has resulted in the growth in the value of several other crypto assets in the last month.\n\nAccording to data from CoinGecko, global cryptocurrency market capitalization has increased by 21% in the last month.\n\nHow much are 1,10,100 BTCs worth today?\n\nHolders are in profit, but for how long?\n\nBTC’s rally to a five-month high in the last month has led many of its holders to log profits on their BTC holdings. An assessment of the cost basis for short-term and long-term holders revealed this.\n\nThe cost basis for any BTC holder is the average purchase price of the BTC they possess. This considers any variations in BTC’s price at the time of purchase. This cost basis determines capital gains or losses when the BTC is sold.\n\nAccording to Twitter analyst Will Clemente, the cost basis for short-term and long-term BTC holders were $18,900 and $22,300, respectively.\n\nHowever, since BTC’s price has rallied beyond these points, these cohorts of investors were “no longer underwater,” Clemente said.\n\nBitcoin has now reclaimed its long-term holder cost basis ($22.3k) in addition to its short-term holder cost basis ($18.9k) and the aggregated cost basis. Behavioral shift as holders in aggregate are no longer underwater. The last three times this has happened are shown below: pic.twitter.com/8fCSyU5sqk — Will Clemente (@WClementeIII) January 29, 2023\n\nFurther, CryptoQuant analyst Phi Deltalytics assessed BTC’s short-term Spent Output Profit Ratio (SOPR) and found that “sentiment from Bitcoin short-term on-chain participants has reached the greediest level since January 2021.” According to the analyst, the SOPR was positioned well above the bullish threshold of one, indicating an overly stretched market.\n\nIs your portfolio green? Check out the Bitcoin Profit Calculator\n\nDeltalytics noted further that the bullish trend could be short-lived without an increase in stablecoin reserves on spot exchanges.\n\nA look at Crypto Fear & Greed Index confirmed the analyst’s position. At press time, the index showed that greed permeated the cryptocurrency markets.\n\nWhen the index is in the “greed” range, it means that investors have become increasingly confident and optimistic about the market and may be more willing to take on risk.\n\nThis also suggests that prices are becoming overvalued and that a market correction may be imminent.\n\nAn assessment of BTC’s movement on the daily chart confirmed the possibility of a price correction. Since 21 January, the king coin has traded in a tight range.\n\nWhen BTC’s price oscillates within a tight range, it means that the price is not making significant moves in either direction and is staying within a relatively narrow band.\n\nAn analysis of BTC’s Money Flow Index (MFI) and Chaikin Money Flow (CMF) indicators raised more concerns as these technical indicators have been trending downwards since 21 January.\n\nThe tight range of BTC’s price combined with downtrends in the MFI and CMF suggested a lack of buying momentum and potential for increased selling pressure.\n\nThis also showed that the market was likely to break down from the tight range to the downside."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9sdGMtYXZheC1hcHQtYW5kLWZ0bS1wcmVwYXJlLXRvLXJhbGx5LWFzLWJpdGNvaW4tcHJpY2UtdGFyZ2V0cy0yNGvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 29 Jan 2023 08:00:00 GMT",
        "title": "LTC, AVAX, APT and FTM prepare to rally as Bitcoin price targets $24K - Cointelegraph",
        "content": "Bitcoin (BTC) has rallied nearly 40% so far in January, which is the best start to the year since 2013. The sharp up-move has turned several on-chain signals bullish, according to on-chain analyst Cole Garner.\n\nUsually, a sharp recovery from the market lows, driven by the leader, is a sign that strong hands may be buying aggressively. That could be because traders believe the selling may have been overdone in the near term or they found the valuation to be attractive.\n\nCrypto market data daily view. Source: Coin360\n\nAfter the initial runup, a swift correction could be expected, which will shake out the weak hands. The next fall will also confirm whether Bitcoin has formed a bottom or not. If the low is confirmed, several altcoins may start to outperform Bitcoin in the near term.\n\nWhich altcoins are showing promise in the near term? Let’s study the charts of Bitcoin and select altcoins to see which could extend their up-move in the next few days.\n\nBTC/USDT\n\nBitcoin has been trading above $22,800 since Jan. 25, which suggests that bulls are trying to flip the level into support.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe upsloping 20-day exponential moving average ($21,558) indicates that bulls are in command but the relative strength index (RSI) in the overbought territory suggests that the rally may be overextended in the near term.\n\nIf buyers kick the price above $23,816, the BTC/USDT pair could start its northward march toward $25,211. This level may act as a formidable resistance.\n\nOn the downside, the 20-day EMA is an important level for the bulls to defend because if it cracks, the pair may fall to the psychological support at $20,000.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe RSI on the four-hour chart is forming a negative divergence indicating that the buyers may be losing their grip. If bulls want to assert their dominance, they will have to push the price above the $23,816 resistance. That could start the next leg of the up-move.\n\nConversely, if the price turns down from the overhead resistance, the bears will try to yank the pair below the moving averages. There is a minor support at $22,715 but if this level collapses, the pair could retest $21,480.\n\nLTC/USDT\n\nLitecoin (LTC) has been in a strong uptrend for the past several days. After a brief consolidation, buyers propelled the price above the overhead resistance of $92, indicating that the up-move remains intact.\n\nLTC/USDT daily chart. Source: TradingView\n\nThe LTC/USDT pair could rally to the psychological level of $100 where the bears may again try to erect a roadblock. If bulls do not give up much ground from this level, the pair may extend its journey to $107. The upsloping 20-day EMA ($86) and the RSI near the overbought territory indicate advantage to buyers.\n\nThis positive view could invalidate if the price turns down and slips below the 20-day EMA. The pair could then drop to $81 and later to $75.\n\nLTC/USDT 4-hour chart. Source: TradingView\n\nThe break and close above the $92 level suggest that the consolidation resolved in favor of the buyers. If bulls sustain the price above $92, the pair could rise toward the pattern target of $98.\n\nThe bears are likely to have other plans. They will try to drag the price below the breakout level of $92 and trap the aggressive bulls. If they manage to do that, the pair could fall to $86. This is an important level for the bulls to defend because a break below it could shift the advantage in favor of the bears.\n\nAVAX/USDT\n\nAvalanche (AVAX) surged above the resistance line on Jan. 27 and reached the overhead barrier at $22 on Jan. 28.\n\nAVAX/USDT daily chart. Source: TradingView\n\nThe bears are trying to stall the recovery at $22 but the bulls do not seem to be in a hurry to book profits. This increases the likelihood of a break above the overhead hurdle. If that happens, the AVAX/USDT pair could accelerate toward $30. There is a minor resistance at $24 but it is likely to be scaled.\n\nAnother possibility is that the price turns down and retests the resistance line. If the price rebounds off this level, it will suggest that the bulls have flipped it into support. That could enhance the prospects of a break above $22. The bears may gain the upper hand if the price dives below the 20-day EMA ($17).\n\nAVAX/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows the pair has pulled back near the 20-dayEMA. If the price jumps from the current level, the bulls will again attempt to thrust the pair above the overhead obstacle at $22. If this level is scaled, the pair could rally to $24.\n\nThe first sign of weakness will be a break and close below the 20-EMA. That could present an opportunity for the bears to make a comeback. The sellers could gain the upper hand if they pull and sustain the pair below the resistance line.\n\nRelated: South Korea to deploy cryptocurrency tracking system in 2023\n\nAPT/USDT\n\nAptos (APT) has been having a dream run in the past few days. Usually, when an asset picks up momentum, it continues to move in the same direction for some time.\n\nAPT/USDT daily chart. Source: TradingView\n\nThe APT/USDT pair turned down from $20.40 on Jan. 26 but the bulls are trying to arrest the pullback at $16.62. The shallow correction shows that every minor dip is being purchased by the bulls. Buyers will try to drive the price above $20.40 and start the next leg of the uptrend. The pair could then soar to $24.\n\nThe risk to this assumption is that the RSI has been in the overbought territory for the past few days. This increases the risk of a short-term correction. If the price turns down and plummets below $16.60, the pair could slide to $14.57 and then to the 20-day EMA ($12.23).\n\nAPT/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows a negative divergence forming on the RSI. If the price breaks below the 20-EMA, the pair could test the 50-SMA. This is an important support to monitor because if it cracks, the pair could fall to $12.\n\nContrarily, if the price turns up and breaks above $20.40, it will indicate that bulls have reasserted their supremacy. That may invalidate the negative divergence developing on the RSI and resume the uptrend.\n\nFTM/USDT\n\nFantom (FTM) has been in a stupendous run since breaking above the downtrend line. The sharp rally of the past few days suggests aggressive buying by the bulls.\n\nFTM/USDT daily chart. Source: TradingView\n\nThe indicators signal that bulls are firmly in control. During strong up-moves, the corrections are short-lived as bulls buy on every minor dip. The bears are trying to stall the up-move near the psychological resistance at $0.50 but if bulls pierce this level, the FTM/USDT pair could soar to $0.56 and then to $0.63.\n\nSometimes, vertical rallies are followed by sharp declines. Therefore, traders must be careful as a break and close below $0.43 could sink the pair to the 20-day EMA ($0.37). This is the key level to watch out for on the downside because a break below it could signal that the uptrend may have ended in the near term.\n\nFTM/USDT 4-hour chart. Source: TradingView\n\nThe pair turned down from the overhead resistance at $0.50 but found support at the 20-EMA. This indicates that the sentiment remains positive and traders are buying the dips. The bulls will again attempt to clear the overhead hurdle at $0.50 and resume the up-move.\n\nThe bears may have other plans as they will try to pull the price below the 20-EMA. This is an important level to keep an eye on in the short term as a break below it could open the doors for a possible drop to the 50-day simple moving average. If this level also cracks, the next stop could be $0.36.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vdHJ1dGhvdXQub3JnL2FydGljbGVzL2JpdGNvaW4tYXRtLWNvbXBhbmllcy1hcmUtcHJleWluZy1vbi10aGUtcG9vci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 29 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin ATM Companies Are Preying on the Poor - Truthout",
        "content": "There’s a laundromat in a working-class immigrant community on the outskirts of Washington, D.C. that is much more than a place to wash and dry clothes. The store offers alternative financial services — bill payment processing, money orders and check-cashing services — charging for many transactions that most banks perform for customers at no extra cost.\n\nMillions of people in the United States rely on services like those offered by the laundromat because they don’t have enough money to open bank accounts, with the potential for monthly fees to snowball into overdraft fees bleeding their modest income dry. But their reliance on stores like the Hyattsville, Maryland, laundromat leads them to incur up to thousands of dollars in additional costs every year. It’s the result of a phenomenon described by analysts and policy makers as people being either “unbanked” or “underbanked,” and it might be the most clear example of how, as the saying goes, it’s expensive to be poor.\n\nThe situation was supposed to change with the advent of cryptocurrency, according to the industry’s evangelists and their allies on Capitol Hill. They argued that the blockchain technology at the heart of crypto, which enables secure transactions through encrypted record-keeping on a public database, would lower the cost of offering basic services to the underbanked. But a closer look at the laundromat in Hyattsville, which prominently features a cryptocurrency ATM, shows how the industry has been able to fit seamlessly into the existing ecosystem of high-priced financial services used by people struggling to make ends meet.\n\nThe store’s cryptocurrency ATM charges up to 20 percent in exchange fees for Bitcoin purchases without disclosing the cost of the transaction to users, and is the product of a company called Bitcoin Depot, which has exploded in growth over the past few years, targeting low- and middle-income neighborhoods.\n\nTruthout recently visited the laundromat to get a firsthand look at how the kiosk operates. To execute a conversion of $40 into Bitcoin, the company disclosed that it was charging a $3 service fee but didn’t mention that the exchange rate it offered was 20 percent less favorable to buyers than the going market rate. Users must check prices themselves from another source to discern the real cost of the transaction, as numerous run-of-the-mill people have noted in social media complaints.\n\n“I deposited $334 anticipating to pay $3 handling fee,” one Twitter user noted, only to find that $67.40 “evaporated into Bitcoin Depot [sic] pocket … this is worse than loan shark [sic].”\n\n“Do not use @Bitcoin_Depot,” another said, “they say they only take 3% fee but in reality take 23%. It’s total fraud and scam. Fuck @Bitcoin_Depot.”\n\nBitcoin Depot, which controls roughly 20 percent of the crypto ATM market share in the United States, is far from the only one to employ shady practices while hawking their wares to the underbanked. Coin Cloud — number two in size to Bitcoin Depot with 15 percent control of the U.S. crypto ATM market — similarly charged 20 percent for Bitcoin exchanges without disclosing the spread between its price and the going market exchange rate, as verified by Truthout at a kiosk in Northeast Washington, D.C.\n\nAnother major retail crypto provider, Coinme, charges a markup of only about 7 percent, and the firm’s iPhone app alludes to the existence of a market rate with references to recent Bitcoin highs and lows. But in other ways, Coinme has uniquely predatory practices. As a partner of the payment processing giant MoneyGram, Coinme is used by the payday lending and check-cashing company ACE Cash Express to sell cryptocurrency, a highly volatile and scam-ridden asset class, to its clientele. A study published in November by the Bank of International Settlements estimated that roughly three-quarters of all Bitcoin buyers between 2015-2022 lost money on their purchase, and that price spikes tend to attract new buyers only after their likelihood of making money on the asset has decreased.\n\nCoin Cloud also boasts of having a partnership with ACE, though it appears to be based solely on the former placing its kiosks at the latter. The crypto company’s decision to highlight its ties with ACE contrasts sharply with its TV advertisement, released in July 2021, featuring legendary Black film director Spike Lee declaring: “Digital currency is viable for not just people of color, but anybody who has been historically excluded from traditional financial systems.”\n\nBoth MoneyGram and ACE have faced regulatory scrutiny for exploiting those “excluded from traditional financial systems.” The Consumer Financial Protection Bureau (CFPB) has repeatedly gone after each firm with the most recent punishment for each coming last year. In July, the agency sued ACE for allegedly “concealing free repayment plans from struggling borrowers” and racking up $240 million in revenue in the process. The CFPB sued MoneyGram in April for allegedly delaying remittance transfers in violation of federal law. Both companies are owned by private equity firms.\n\nLike Bitcoin Depot, ACE’s partners Coin Cloud and Coinme are also the subject of intense criticism that can be easily found on social media where many ripped-off consumers take their frustration hoping that it will in some way lead to restitution or greater awareness.\n\n“Literally just created a Twitter just so I could warn anyone that thinks of using you guys,” one Twitter user told Coin Cloud. “Never had to wait 3 plus hours w/ any exchange wallet & or pay the outrageous fee.”\n\n“This exchange is the scum of crypto industry,” another user said of Coinme. “Advertise 4-5% fees but you’re really paying 10-12%. Check quoted prices at time if [sic] purchase. They will steal your funds and lick your account for no reason.”\n\nNeither Bitcoin Depot, nor Coin Cloud, nor Coinme responded to requests for comment on this story.\n\nDuring crypto’s most recent boom cycle, the cryptocurrency ATM industry exploded in the United States. The estimated number of cryptocurrency ATMs in the country increased by a factor of almost eight: from 4,203 in January 2020 to 33,385 in January 2023. Growth slowed in the middle of 2022, after the cryptocurrency market started taking a series of nosedives that saw asset-holders lose some $2 trillion, roughly two-thirds of the entire market’s paper value, over the course of seven months, from November 2021 until June 2022.\n\nBut even if speculative efforts pan out for a slim minority of crypto buyers, the ATM industry quietly takes its pound of flesh. Companies typically charge between 6.5 percent and 20 percent in transaction fees buried in exchange rate figures, as observed by Truthout. And whether the companies fully disclose the cost or not, the price is much higher than the service charges imposed by conventional ATMs or even online crypto exchanges, which are fraught with their own problems, as the FTX collapse has demonstrated.\n\nIt’s also been known for years that the crypto ATM industry has had a focus on low-income neighborhoods. The Detroit Free Press reported on the issue in June 2018, and The Atlanta Journal-Constitution followed suit in February 2020. And while most of the interest from Washington has concerned the potential for crypto ATMs to facilitate criminal activity by enabling money laundering and ransomware hacks, regulators appear to be catching up. One report by the U.S. Treasury published in September 2022 cited the Free Press and Journal-Constitution reporting to classify the proliferation of crypto ATMs as an example of financial service companies targeting “vulnerable communities, especially low-income communities and communities of color … using deceptive sales tactics and marketing.”\n\nBitcoin Depot has practically admitted that it employs predatory tactics. The company has disclosed to investors that it relies on “demographic data” to strategically place its machines, and CEO Brandon Mintz has separately said that the company’s clientele is “more in that lower, middle income range. A lot of the people who are underbanked and unbanked prefer to use cash, so we try to focus on those areas.” At the same time, Bitcoin Depot also disclosed to investors that the company itself is somewhat wary of cryptocurrency as an asset class; specifically, that it uses “a sophisticated cryptocurrency management process to reduce our exposure to volatility in cryptocurrency prices by maintaining a relatively low balance of cryptocurrency at any given time.”\n\nIn other words, the company appears to pump cryptocurrency, with a focus on selling in working-class neighborhoods, before dumping whatever leftover crypto it still has on the books. There is legal ambiguity over the “pump” matter because Bitcoin Depot, like many other cryptocurrency ATM companies, denies that it offers investment advice in its fine print disclosures, in an apparent bid to insulate itself from regulatory enforcement actions by the Securities and Exchange Commission (SEC). In disclosures to investors, company executives said that the SEC could effectively shut down their operation “if we were to be deemed an investment company under the Investment Company Act of 1940.”\n\nAlthough none of the cryptocurrency ATM companies mentioned in this article responded to requests for comment, policy makers had more to say in response to Truthout’s findings.\n\n“Many Americans, especially those that have been turned away by banks time and time again, want financial products that work for them,” Sherrod Brown (D-Ohio), chair of the Senate Banking Committee told Truthout. “Unfortunately, as with payday lenders, they have been told that cryptocurrencies are helping build a more inclusive economy — but none of those promises have ever materialized. It is critical that we educate and protect consumers on cryptocurrencies’ risks and I will continue to work with my colleagues to do just that.”\n\nRep. Rashida Tlaib, (D-Michigan), who is on the House Financial Services Committee and has spoken about the impact of predatory crypto industry practices on her Detroit constituents, said she is “deeply concerned by the rise of so-called crypto ATMs.”\n\n“The cryptocurrency industry has spent billions on bullying regulators, lobbying Congress — and inundating my neighbors with advertising for get-rich-quick schemes,” Tlaib told Truthout. “Dressing up dangerous and predatory products in new technology and fancy buzzwords does not give financial companies a free pass to avoid regulation and consumer transparency.”\n\nBoth Brown and Tlaib are urging their fellow congressional representatives to act to protect consumers, echoing calls made on January 24 in an op-ed written by Representatives Chuy Garcia (D-Illinois) and Stephen Lynch (D-Massachusetts). Garcia and Lynch noted that the recent crypto downturn has “disproportionately harmed low-income, Latino, Black, and first-time investors.”\n\nNeither the SEC nor the Commodity Futures Trading Commission responded to a request for comment on general questions about their power over cryptocurrency ATM companies.\n\nThe CFPB declined the opportunity to comment, but highlighted various government agencies’ stated concerns about crypto ATMs being used to facilitate money laundering. The agency also pointed to its own consumer complaint database, a separate CFPB analysis of crypto-asset complaints, and flagged the Treasury Department’s report citing the crypto ATM industry as an example of a financial service provider preying on “vulnerable communities.”\n\nFor two experts who have been closely following cryptocurrency industry practices for years, one term came to mind: predatory inclusion. Brookings Institute fellow Tonantzin Carmona explained that the concept describes marginalized communities being granted new opportunities to better their material conditions, but with greater potential pitfalls than those that come with chances given to their white, upper-class counterparts.\n\n“Coin ATMs are such a great example of predatory inclusion,” Carmona said, with their marketing, their opaque fee structure, and the fact that they dispense high-risk financial assets. The industry ends up “monetizing inequities” rather than creating the low-cost alternative that it promised, she noted.\n\nMark Hays, senior policy analyst with Americans for Financial Reform, said predatory inclusion comes from the overall cryptocurrency market being based on a form of extraction capitalism. The industry has yet to demonstrate a clear use-value, other than facilitating both blue-collar and white-collar crime. Hays described the profitable crypto business model as: “Let’s get people’s cash into this market, pump up liquidity, get what we need and get out. Who cares if it crashes?”\n\nHe told Truthout that policy makers have allowed the situation to continue, in part, because they’ve been wowed by industry claims of novel innovation. “It’s deregulation being done in the name of innovation, which is something we need to be wary of,” Hays added.\n\nAs numerous analysts have noted, similarities between today’s cryptocurrency market and the subprime mortgage crisis have been maddening. Dangerous mortgage products were feted by lawmakers and regulators in the run-up to the Great Recession. In 2005, for example, then-Federal Reserve Chairman Alan Greenspan praised subprime mortgages for granting credit to “once more-marginal applicants.” Greenspan’s fellow travelers on the right would then go on to scapegoat this segment of the market to explain away their ideological failure.\n\n“Why did they make these investments?” Carmona asked rhetorically. “You had folks like Alan Greenspan promoting these things.”\n\nTired of reading the same old news from the same old sources? So are we! That’s why we’re on a mission to shake things up and bring you the stories and perspectives that often go untold in mainstream media. But being a radically, unapologetically independent news site isn’t easy (or cheap), and we rely on reader support to keep the lights on.\n\nIf you like what you’re reading, please consider making a tax-deductible donation today. We’re not asking for a handout, we’re asking for an investment: Invest in a nonprofit news site that’s not afraid to ruffle a few feathers, not afraid to stand up for what’s right, and not afraid to tell it like it is.\n\n\n\nCopyright © Truthout. May not be reprinted without permission."
    }
]