[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTE5L2JpdGNvaW4tYnRjLXRocml2ZXMtaW4tY2hhb3MtYnJlYWtzLWFib3ZlLTI4LTAwMC1mb3ItZmlyc3QtdGltZS1zaW5jZS1qdW5l0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Thrives in Chaos, Breaks Above $28000 For First Time Since June - Bloomberg",
        "content": "Turmoil in the banking sector, hotter-than expected inflation data, and renewed hopes for a dovish Federal Reserve has Bitcoin reaching levels not seen in about nine months.\n\nThe largest digital coin topped $28,000 for the first time since June 2022, trading at around $28,200 at 9:45 a.m in London on Monday. Bitcoin is now up more than 70% since the start of the year. Other tokens have rallied as well, with Ether gaining almost 50% since Dec. 31 and Solana, one of last year’s most beaten-down coins, more than doubling."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9tYXJrLWN1YmFuLWp1c3QtdG9sZC1iaWxsLTE3MDAwMDE0Mi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Mark Cuban told Bill Maher that buying gold is 'dumb' — and he wants bitcoin to plunge so he can buy even more ... - Yahoo Finance",
        "content": "Mark Cuban told Bill Maher that buying gold is ‘dumb’ — and he wants bitcoin to plunge so he can buy even more. These are 3 simple ways to gain crypto exposure\n\nBeing a crypto bull has its challenges. Even though bitcoin has surged in 2023, it's still down more than 60% from its peak of $68,789 reached in November 2021.\n\nBut one billionaire investor still likes the world’s largest cryptocurrency: Mark Cuban.\n\nDon't miss\n\n“I want Bitcoin to go down a lot further so I can buy some more,” Cuban said in a recent episode of Bill Maher’s Club Random podcast.\n\nMaher, who self-claims to be “very anti-bitcoin,” owns gold instead. Cuban, conversely, has no time for the yellow metal.\n\n“If you have gold, you're dumb as f—,” says the Shark Tank star and Dallas Mavericks owner.\n\nMaher argues that gold “is like a hedge against everything else” but Cuban disagrees.\n\n“Gold is not a hedge against anything, right? What it is is a store of value and you don't own the physical gold, do you … Gold is a store of value and so is Bitcoin,” Cuban explains.\n\nHe then points out why gold can’t really protect your wealth in times of crisis.\n\n“You don't own the gold bar, and if everything went to hell in a handbasket and you had a gold bar, you know what would happen? Someone would beat the f— out of you or kill you and take your gold bar.”\n\nIf you share Cuban’s view, here are a few ways to gain exposure to bitcoin.\n\nBuy bitcoin directly\n\nThe first option is the most straightforward: If you want to buy Bitcoin, just buy Bitcoin.\n\nThese days, many platforms allow individual investors to buy and sell crypto. Just be aware that some exchanges charge up to 4% commission fees for each transaction. So look for apps that charge low or even no commissions.\n\nStory continues\n\nWhile Bitcoin commands a five-figure price tag today, there’s no need to buy a whole coin. Most exchanges allow you to start with as much money as you are willing to spend.\n\nRead more: Here's how much money the average middle-class American household makes — how do you stack up?\n\nBitcoin ETFs\n\nExchange-traded funds have risen in popularity in recent years. They trade on stock exchanges, so buying and selling them is very convenient. And now, investors can use them to get a piece of the bitcoin action, too.\n\nFor instance, ProShares Bitcoin Strategy ETF (BITO) started trading on NYSE Arca in October 2021, marking the first U.S. bitcoin-linked ETF on the market. The fund holds bitcoin futures contracts that trade on the Chicago Mercantile Exchange and has an expense ratio of 0.95%.\n\nInvestors can also consider the Valkyrie Bitcoin Strategy ETF (BTF), which made its debut a few days after BITO. This Nasdaq-listed ETF invests in bitcoin futures contracts and charges an expense ratio of 0.95%.\n\nBitcoin stocks\n\nWhen companies tie some of their growth to the crypto market, their shares can often move in tandem with the coins.\n\nFirst, there are bitcoin miners. The computing power doesn’t come cheap and energy costs can be substantial. But if the price of bitcoin goes up, miners like Riot Blockchain (RIOT) and Hut 8 Mining (HUT) are likely to receive increased attention from investors.\n\nThen there are intermediaries like Coinbase Global (COIN) and PayPal (PYPL). When more people buy, sell and use crypto, these platforms stand to benefit.\n\nFinally, there are companies that simply hold a lot of crypto on their balance sheets.\n\nCase in point: enterprise software technologist MicroStrategy (MSTR). It has a market cap of under $3 billion. Yet its bitcoin count reached approximately 132,500 as of Dec. 27, 2022, a stockpile worth around $3.4 billion.\n\nWhat to read next\n\nThis article provides information only and should not be construed as advice. It is provided without warranty of any kind."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWxlYWRzLWNyeXB0by1yYWxseS1jZW50cmFsLTAzMzkxMjQzNC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin leads crypto rally as central banks promise liquidity to stem rising bank risk - Yahoo Finance",
        "content": "Bitcoin jumped over the weekend to briefly breach US$28,000 in a bullish trend that extended into Monday morning trading in Asia and helped send most of the top 10 non-stablecoin cryptocurrencies higher. Bitcoin led the gainers amid growing concern about the state of the global banking industry. Several central banks over the weekend said they would coordinate an effort to pump cash into markets to ensure liquidity. This after Swiss authorities orchestrated an emergency weekend takeover of global investment bank Credit Suisse by UBS, which in turn followed a series of bank failures in the U.S. this month.\n\nSee related article: Weekly Market Wrap: Bitcoin rises above US$26,000, as ‘store of value’ narrative strengthens amid bank failures\n\nBitcoin rose 2.96% in the past 24 hours to US$27,929 at 09:00 a.m. in Hong Kong to post a weekly gain of 23.24%, according to CoinMarketCap data. The world’s largest cryptocurrency has surged more than 66% from the start of the year and briefly traded above US$28,000 at the weekend, breaking that ceiling for the first time since June 12 last year.\n\nThe main driver behind Bitcoin’s gains is concern about the fragile economic landscape in the U.S., Kadan Stadelmann, chief technical officer of blockchain infrastructure development firm Komodo, told Forkast on Friday.\n\n“The Federal Reserve embarked upon a many-trillion dollar quantitative easing program, cut the minimum bank reserves from 10% to 0% on March 26, 2020, and led us into the current bout with inflation, which has led people to seek alternative ways to preserve wealth. Bitcoin has become a prominent option,“ wrote Stadelmann.\n\nEther dipped 0.02% to US$1,777, but is up 9.24% over the past seven days.\n\nXRP rose 2.61% to US$0.3874, up 3.04% for the week. Paul Grewal, chief legal officer at Coinbase, hinted in an interview with Thinking Crypto last Friday that Coinbase might relist XRP.\n\nPolygon’s Matic token fell 2.30% to US$1.16, slashing its gain for the week to just 0.23%, even after Polygon Labs unveiled a partnership with enterprise software giant Salesforce last Thursday to develop NFT-based loyalty programs.\n\nThe bank turmoil dominated moves in capital markets and may force the Federal Reserve to revise its monetary policy of raising interest rates, adding to inflation risks and prompting more investors to see Bitcoin as a safe haven, according to a Bloomberg News report on Monday.\n\nThe total crypto market capitalization rose 1.46% in the past 24 hours to US$1.17 trillion. Total trading volume over the last 24 hours dipped 2.70% to US$65.76 billion.\n\nWorries about the banking industry drove U.S. equities lower on Friday. The Dow Jones Industrial Average dropped 1.19%, the S&P 500 fell 1.10%, and the Nasdaq Composite Index moved 0.74% lower. Shares in First Republic Bank fell 32.80% on Friday despite a US$30 billion injection from major U.S. financial institutions earlier in the week.\n\nThe Federal Reserve on Sunday announced a coordinated move with the central banks of Canada, the U.K., European Union, Japan and Switzerland to make more U.S. dollars available to improve market liquidity.\n\nThe move to pump cash into markets helped U.S. stock futures edge up as of 9:00 a.m. in Hong Kong on Monday. The Dow Jones Industrial Average futures moved up 0.19%. The S&P 500 futures gained 0.28%, while the Nasdaq Composite Index rose 0.41%.\n\nOn the inflation front, the University of Michigan reported on Friday an unexpected drop in the U.S. consumer sentiment index in March, the first decline in four months. The report indicates the Federal Reserve’s higher interest rate policy of the past 12 months is cooling off inflation.\n\nU.S. interest rates are between 4.5% to 4.75%, the highest since October 2007. Analysts at the CME Group expect a 76.8% chance the Fed will raise rates by 25 basis points when the bank meets this week, and a 23.2% chance of no rate hike, an increase from 20.3% on Friday."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWxlYWRzLWNyeXB0by1yYWxseS1jZW50cmFsLTAzMzkxMjQzNC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin leads crypto rally as central banks promise liquidity to stem rising bank risk - Yahoo Finance",
        "content": "Bitcoin jumped over the weekend to briefly breach US$28,000 in a bullish trend that extended into Monday morning trading in Asia and helped send most of the top 10 non-stablecoin cryptocurrencies higher. Bitcoin led the gainers amid growing concern about the state of the global banking industry. Several central banks over the weekend said they would coordinate an effort to pump cash into markets to ensure liquidity. This after Swiss authorities orchestrated an emergency weekend takeover of global investment bank Credit Suisse by UBS, which in turn followed a series of bank failures in the U.S. this month.\n\nSee related article: Weekly Market Wrap: Bitcoin rises above US$26,000, as ‘store of value’ narrative strengthens amid bank failures\n\nBitcoin rose 2.96% in the past 24 hours to US$27,929 at 09:00 a.m. in Hong Kong to post a weekly gain of 23.24%, according to CoinMarketCap data. The world’s largest cryptocurrency has surged more than 66% from the start of the year and briefly traded above US$28,000 at the weekend, breaking that ceiling for the first time since June 12 last year.\n\nThe main driver behind Bitcoin’s gains is concern about the fragile economic landscape in the U.S., Kadan Stadelmann, chief technical officer of blockchain infrastructure development firm Komodo, told Forkast on Friday.\n\n“The Federal Reserve embarked upon a many-trillion dollar quantitative easing program, cut the minimum bank reserves from 10% to 0% on March 26, 2020, and led us into the current bout with inflation, which has led people to seek alternative ways to preserve wealth. Bitcoin has become a prominent option,“ wrote Stadelmann.\n\nEther dipped 0.02% to US$1,777, but is up 9.24% over the past seven days.\n\nXRP rose 2.61% to US$0.3874, up 3.04% for the week. Paul Grewal, chief legal officer at Coinbase, hinted in an interview with Thinking Crypto last Friday that Coinbase might relist XRP.\n\nPolygon’s Matic token fell 2.30% to US$1.16, slashing its gain for the week to just 0.23%, even after Polygon Labs unveiled a partnership with enterprise software giant Salesforce last Thursday to develop NFT-based loyalty programs.\n\nThe bank turmoil dominated moves in capital markets and may force the Federal Reserve to revise its monetary policy of raising interest rates, adding to inflation risks and prompting more investors to see Bitcoin as a safe haven, according to a Bloomberg News report on Monday.\n\nThe total crypto market capitalization rose 1.46% in the past 24 hours to US$1.17 trillion. Total trading volume over the last 24 hours dipped 2.70% to US$65.76 billion.\n\nWorries about the banking industry drove U.S. equities lower on Friday. The Dow Jones Industrial Average dropped 1.19%, the S&P 500 fell 1.10%, and the Nasdaq Composite Index moved 0.74% lower. Shares in First Republic Bank fell 32.80% on Friday despite a US$30 billion injection from major U.S. financial institutions earlier in the week.\n\nThe Federal Reserve on Sunday announced a coordinated move with the central banks of Canada, the U.K., European Union, Japan and Switzerland to make more U.S. dollars available to improve market liquidity.\n\nThe move to pump cash into markets helped U.S. stock futures edge up as of 9:00 a.m. in Hong Kong on Monday. The Dow Jones Industrial Average futures moved up 0.19%. The S&P 500 futures gained 0.28%, while the Nasdaq Composite Index rose 0.41%.\n\nOn the inflation front, the University of Michigan reported on Friday an unexpected drop in the U.S. consumer sentiment index in March, the first decline in four months. The report indicates the Federal Reserve’s higher interest rate policy of the past 12 months is cooling off inflation.\n\nU.S. interest rates are between 4.5% to 4.75%, the highest since October 2007. Analysts at the CME Group expect a 76.8% chance the Fed will raise rates by 25 basis points when the bank meets this week, and a 23.2% chance of no rate hike, an increase from 20.3% on Friday."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yZWFsaXN0aWMtZm9ybWVyLWNvaW5iYXNlLWN0by0yLTIxNTMzOTMxNS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "How Realistic Is Former Coinbase CTO's $2 Million Bitcoin Wager on US Hyperinflation? - Yahoo Finance",
        "content": "Coinbase’s former CTO Balaji Srinivasan wagered on Friday that the price of Bitcoin will benefit from a rapid devaluing of the U.S. dollar in the next three months, skyrocketing to $1 million by June 17.\n\nSrinivasan entered a bet with two individuals that same day, ponying up $1 million with the pseudonymous Twitter pundit James Medlock and another unnamed person. If Bitcoin fails to notch what would be historic gains, the two would receive $1 million in Circle’s USDC stablecoin each.\n\nThe bet is part of Srinivasan’s view that the global economy is teetering on the edge of rapid change, which he dubbed “hyperbitcoinization.” He predicts the U.S. dollar will enter a point of rapid hyperinflation, and the global economy then “redenominates on Bitcoin as digital gold.”\n\nIn this scenario, the market capitalization of Bitcoin—already the largest token—would increase to around $19.3 trillion from about $549 billion today, according to CoinGecko. For comparison, the value of the U.S. stock market was just over $40.5 trillion by the end of last year, according to Siblis Research.\n\nSrinivasan’s prediction comes amid a series of bank failures in the U.S. that’s injected fear and uncertainty into financial markets. And even though Bitcoin’s correlation to stock indexes like the S&P 500 and Nasdaq remains significant, some on Twitter are calling it the “The Great Decoupling” given Bitcoin’s recent surge past $28,000 as Wall Street wavers.\n\nThe bold bet inspired lengthy Twitter threads from some of crypto Twitter’s most prominent voices, including Bitcoin entrepreneur and educator Jimmy Song and venture capitalist Adam Cochran, who delved into how realistic the prediction could be.\n\nReferencing the performance of cryptocurrencies during the onset of the coronavirus pandemic in 2020, Cochran said that Bitcoin would need a catalyst more extreme than that to outdo the 547% rally seen from 2020 to 2022.\n\n3/25 The bet here, is that within 90 days, Bitcoin will reach a price of $1M USD. Or around a 3600% gain within the next 90 days. To put that in perspective, the rally from 2020 - 2022 was only 547% and the 2017 rally at far lower prices was only 1105% gain. pic.twitter.com/7OZZHXNgYX — Adam Cochran (adamscochran.eth) (@adamscochran) March 18, 2023\n\nStory continues\n\nCochran posited that a collapse of the United States and Europe’s banking systems would ultimately overshadow the potential value of Bitcoin as an asset, making bunkers or beans a better use of money than purchasing the world’s largest cryptocurrency.\n\n“Simply put, stores of value or alternative assets do well when we doubt the profitability of an economic system and not the existence of a system,” he told Decrypt via Twitter DM. “If the system doesn’t exist, we shift down the hierarchy of needs, placing value on necessity goods, not valuables.”\n\nCochran said Srinivasan’s wager is a bid for hope in the crypto market after the industry faced tough sledding as crypto winter set in last year, a time when prices plummeted and numerous crypto firms collapsed. He noted that the digital assets industry lost a lot of the excitement and hope that brought people in.\n\n“They are hungry to have that back,” he said. “It’s just disappointing to see it fueled by an unrealistic bet in such a risky macro environment.”\n\nOther voices, such as Song, appeared supportive of ideas expressed Srinivasan’s bet, claiming Bitcoin could have some utility during an existential crisis for the financial system as it’s known today.\n\n“Bitcoin will play a crucial role in mitigating some of the catastrophic effects,” he said. “As a strictly limited currency, Bitcoin offers a much better store of value, dampening the impact of hyperinflation.”\n\n5/🌐 Despite the daunting situation, Bitcoin will play a crucial role in mitigating some of the catastrophic effects. As a strictly limited currency, Bitcoin offers a much better store of value, dampening the impact of hyperinflation. — Jimmy Song (송재준) (@jimmysong) March 19, 2023\n\nBloomberg’s Matt Levine chimed in on Saturday to ask what could be considered a straightforward question: If Srinivasan thinks Bitcoin will reach $1 million in 90 days, why would he use the money to make a bet about it as opposed to just buying Bitcoin?\n\nthe replies are all “no, he’s printing a futures trade way above market to manipulate the price up” which is not better — Matt Levine (@matt_levine) March 18, 2023\n\nLevine said in a subsequent Tweet that Srinivasan’s move could be an attempt to “manipulate the price [of Bitcoin] up” based on the replies he received. Others expressed the idea that Srinivasan could’ve made the bet as a way to bring exposure to himself and Bitcoin.\n\nSrinivasan’s net worth is estimated to be around $150 million, according to Datawallet. He had joined Coinbase after a company he co-founded called Earn.com—which rewarded users with digital assets for completing small tasks—was purchased by Coinbase.\n\nSrinivasan worked at Coinbase for around 14 months before leaving the exchange in May 2019. Among the accomplishments listed on his LinkedIn profile, he was responsible for organizing the “business and technical sides” of Circle’s USDC stablecoin launch.\n\nSrinivasan is not the only person out there who has envisioned a $1 million price per Bitcoin. In January of last year, Cathie Wood’s ARK Invest estimated that Bitcoin could exceed $1 million by 2030, saying the network “is likely to scale as nation-states adopt [Bitcoin] as legal tender.”"
    }
]