[
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTE1L2JpdGNvaW4tanVtcHMtdG8taGlnaGVzdC1zaW5jZS1hdWd1c3QtYXMtcmVndWxhdG9yeS1jb25jZXJuLWViYnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Jumps to Highest Since August as Regulatory Concern Ebbs - Bloomberg",
        "content": "Bitcoin rose to the highest level since August on Wednesday, gaining for a second day as a decrease in risk aversion helps to temper concerns about a widening crackdown by US regulators.\n\nThe largest cryptocurrency by market value jumped by 8.2% to $24,083 as of 4:19 p.m. in New York. The increase is the biggest one-day gain in about a month. Smaller digital tokens such as Ether, Cardano and Polkadot also rallied."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXNvYXJzLXBhc3QtMjRrLXJlYWNoLTIwMzAyMDM4OS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Soars Past $24K to Reach 2-Week High - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nBitcoin bolted past $24,000 for the first time in two weeks after surging more than 8% over the past 24 hours, likely the result of the type of short squeeze that historically has sent prices higher. The percentage increase was the largest since BTC jumped 10.5% on Sept. 9.\n\nThe largest cryptocurrency by market capitalization had dropped below $21,600 at different points in recent days amid growing investor fretfulness about crypto regulation, particularly targeting the stablecoin market, and about future U.S. central bank steps to tame inflation.\n\nBut those concerns seemed to fade quickly as bitcoin surged past $24,100 by the afternoon before retreating slightly.\n\nData from crypto data provider Coinglass showed that traders who bet on price shifts liquidated some $65 million of bitcoin over the past 24 hours, from which about $60 million were in short positions.\n\nCrypto-related stocks also jumped, with both exchange Coinbase (COIN) and bitcoin miner ​​Marathon Digital Holdings (MARA) increasing 15%. Business software company MicroStrategy (MSTR), a major BTC holder, recently rose more than 9%.\n\nEther (ETH) was up 5.5% to recently trade at $1,645. The CoinDesk Market Index spiked 4% for the day.\n\nLucas Outumuro, head of research at blockchain analytics firm IntoTheBlock, said that investors also found reason for optimism in Tuesday's tepid U.S. Consumer Price Index (CPI), which showed inflation declining slightly to 6.4% on an annual basis even as it failed to meet analysts expectations. \"Since the market reaction to the CPI print was positive even if it was higher than expected, I believe this was seen as a sign of strength for the rally to continue in risk assets altogether,\" Outumuro told CoinDesk.\n\nRiyad Carey, research analyst at crypto data firm Kaiko, also said that markets also may have already accounted for concerns about increased regulation tied to stablecoins, including Binance's BUSD token.\n\nStory continues\n\n\"Crypto has had some added catalysts with the BUSD news, which has largely been absorbed and I think today was a reflection of some of the regulatory fears – and immediate fears around BUSD – easing,\" Carey told CoinDesk.\n\nUPDATE (Feb. 15, 2023, 20:41 UTC): Updates headline and adds historical context to the size of bitcoin's 24-hour increase.\n\nUPDATE (Feb. 15, 2023, 20:56 UTC): Updates to reflect latest liquidation of BTC short and other positions.\n\nUPDATE (Feb. 15, 2023, 21:05 UTC): Updates price chart.\n\nUPDATE (Feb. 15, 2023, 22:39 UTC): Adds analysts comments."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1jb250aW51ZXMtY29ycmVsYXRpb24td2l0aC1uYXNkYXEtMTAwLXRodXMtZmFyLWluLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Continues Correlation With Nasdaq 100 Thus Far in 2023 - Nasdaq",
        "content": "Last year, bitcoin moved in tandem with the stock market as well as the bond market as inflation applied downward pressure to most assets. In the recent rally, bitcoin is doing the same, tailing indexes like the Nasdaq 100 as it moves higher amid the anticipation of fewer rate hikes.\n\nThat remains to be seen, however, as the U.S. Federal Reserve could reverse course if it senses that it doesn't quite have inflation under control. If that's the case, more volatility could be ahead for the stock market, which could translate to volatility in the cryptocurrency market.\n\n\"On days when technology stocks trade higher, cryptocurrencies, including bitcoin (BTC) and ether (ETH), are likely to do the same,\" a Coindesk article noted. \"Conversely, a decline in technology stocks could drag the crypto market lower.\"\n\nThat said, macroeconomic catalysts like inflation reports and interest rate decisions are likely to move cryptocurrencies again this year. A peek at the Nasdaq 100 may offer market-watchers an idea of what the cryptocurrency market might be doing.\n\n\"The renewed positive correlation implies increased sensitivity of cryptocurrencies to macroeconomic data releases like the U.S. consumer price index (CPI), which injects volatility into stock markets,\" the article added further. \"The CPI days were among the most volatile for U.S. stocks last year, according to MarketWatch.\"\n\nGet Bitcoin Exposure on a Regulated Exchange\n\nGetting bitcoin exposure doesn't mean that investors must trade digital currencies by opening a separate account on an unregulated cryptocurrency exchange that could potentially open them up to potential risk. That said, investors have options in regulated markets in order to get cryptocurrency exposure to major coins like bitcoin.\n\nExchange traded funds (ETFs) can allow investors to get in on thebitcoin priceaction without investing directly in the digital currency itself. Consider the ProShares Bitcoin Strategy ETF (BITO) and the ProShares Short Bitcoin Strategy ETF (BITI).\n\nFor the bulls, BITO builds capital appreciation through its bitcoin futures contract use, allowing investors to get exposure tobitcoin priceappreciation within the regulatory framework of a traditional financial exchange. For the bears, BITI seeks daily investment results equal to the inverse (-1x) of the daily performance of the S&P CME Bitcoin Futures Index, allowing traders to profit off price declines in bitcoin.\n\nFor more news, information, and analysis, visit the Crypto Channel .\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9vcmRpbmFscy1zdXBwb3J0LWNvbWVzLWJpdGNvaW4tYmFzZWQtMjEyNTQ0NDc4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Ordinals Support Comes to Bitcoin-Based Web Wallet Xverse - Yahoo Finance",
        "content": "Xverse, billed as a “Bitcoin wallet for Web3,” just rolled out support for Ordinals, the newly popularized protocol allowing users to inscribe NFTs onto the Bitcoin blockchain.\n\n\n\n“Today, we’ve launched first class support for Ordinals,” tweeted the wallet team on Wednesday. The company explained that inscribing NFTs through its software involves “no need to run a node, complex software, or anything else,” merely some Bitcoin to pay a transaction fee, which can be bought directly through the app.\n\nInscriptions are made via Gamma.io, a Bitcoin NFT marketplace that rolled out “no-code ordinal inscriptions” last week. According to Xverse, roughly 5% of Bitcoin inscriptions so far have been made using Gamma’s tool.\n\nAfter uploading an image and sending a transaction to their provided Ordinals address, users can find their inscriptions inside their Xverse NFT collection within 20 to 30 minutes—and embedded in the blockchain forever.\n\nOver 100K Ordinals Minted on Bitcoin, Bringing Cheers and Network Congestion\n\nThis comes just a day after Hiro, another Bitcoin focused Web3 wallet, rolled out inscriptions to its testnet on Tuesday. Both wallets interact with Stacks, a “layer 1.5” blockchain with its own NFT economy that settles its transactions on Bitcoin.\n\nXverse, too, lets Bitcoin users interact with Stacks, with plans to introduce instant payments via the lightning network.\n\nBitcoin recently logged its 100,000th Ordinals transaction, continuing a trend of exponential growth. Given that NFTs on Bitcoin were not a feature envisioned by its original developers, their existence has naturally sparked controversy, with many people unsure of whether they will hurt or help the network.\n\nStacks co-creator Muneeb Ali said he welcomes the new protocol, stating that it marks a “new chapter in Bitcoin history” on Tuesday. The following day, he said that Xverse’s Bitcoin wallet now has the “easiest on-ramp to ordinals.”\n\nKen Liao, the founder and CEO of Xverse wallet (aka Secret Key Labs), said that the ability to send out one’s ordinal from the wallet will be available soon. Liao was formerly an engineering parter at Stacks.\n\nStory continues\n\nIts out! The easiest way to inscribe Bitcoin Ordinals and store in your self-custody BTC wallet with a beautiful gallery for all your NFTs. https://t.co/xgEcEJXlX8 — kenliao.btc (@YukanL) February 15, 2023\n\nAccording to Liao, the rise of Ordinals is helping bring builders back into Bitcoin's ecosystem, and showing that the network is capable of more than allowing people to \"just hold Bitcoin.\"\n\n\"You've always been able to put data on the Bitcoin chain, but in a very limited way,\" said Liao, in comments shared with Decrypt via email. \"Ordinals made it easier and created a cultural movement essentially for people to do this.\""
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWJlc3QtYnJhbmQtY3J5cHRvLXdoeS0yMTEyMTQyMTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "'Bitcoin Is the Best Brand in Crypto': Why DeGods NFTs Are Now on Bitcoin - Yahoo Finance",
        "content": "Bitcoin NFTs via Ordinals are the buzziest thing in the space lately, with more than 100,000 such media assets committed to the blockchain in barely two weeks. Surprisingly, that tally includes 535 NFTs from DeGods—the most valuable Solana NFT project.\n\nDeGods revealed the move on Monday as word circulated that the profile pictures (PFPs) had all been inscribed on Bitcoin in a single block. (\"Inscribing\" is the process by which NFT-like assets are created on the Bitcoin blockchain, akin to \"minting\" on Ethereum.) The 535 particular images were originally released via Solana in 2021, but were “burned” (or permanently destroyed) to cut down the supply in the early days of the project.\n\nProject creator Rohun Vora, who goes by the pseudonym Frank, told Decrypt that he and Dust Labs CEO Kevin Henrikson (who simply goes by Kevin) are longtime Bitcoin aficionados who relished the opportunity to bring the project onto the leading cryptocurrency’s network in the early days of Ordinals momentum.\n\nAesthetics matter a lot to my team @DeGodsNFT. It was an honor working with @hash_bender to make sure there was no random trashy Ordinals minted in between all 535 DeGods. All in one block. Simple. Beautiful. Inscribed on the Bitcoin blockchain forever. pic.twitter.com/Yfuvc8IDuT — Frank III (@frankdegods) February 14, 2023\n\n“Bitcoin is the best brand in crypto—just as pristine as it gets,” Frank told Decrypt. “It's the most well known, and truly as simple but powerful as it can get. And the mission statement is it's never been corrupted, right? It's like global sound money. That is so powerful. Aligning ourselves with the best brand in crypto is a no-brainer at any given point in time.”\n\nStory continues\n\nNow those 535 PFPs have gained a second life on Bitcoin with never-before-seen upgraded artwork. DeGods previously provided holders refreshed “DeadGods” artwork last year, and created upgraded artwork for the burned NFTs as well, plotting an eventual revival.\n\nNFT Sales Jump 38% in January as Bored Apes Drive Trading Surge\n\n“We always had this notion of ‘What is dead may never die,’” Kevin explained, echoing the familiar refrain from the HBO series \"Game of Thrones.\" “And it was this idea, like: Holy shit, this is so perfect. We can literally bring these back, mint them as Ordinals on BTC, and it's permanent,” he said.\n\nBack to life\n\nOrdinals is a unique way of inscribing NFT-like media and assets to the Bitcoin blockchain by connecting them with a single Satoshi, or 1/100,000,000th of one BTC. The media is fully stored on-chain and the Ordinal can be transferred, although there’s still a need for a lot more infrastructure and platforms for transacting and handling the assets.\n\nIt has quickly given rise to CryptoPunks clones and playable web games on Bitcoin. OnChain Monkey, an Ethereum project, also put its entire 10,000 NFT original collection into a single inscription. However, Ordinals has also drawn considerable backlash from Bitcoin maximalists, plus it has boosted network congestion—and transaction fees in tandem.\n\nOver 100K Ordinals Minted on Bitcoin, Bringing Cheers and Network Congestion\n\nKevin said that they dove into Ordinals as soon as it started gaining steam. But with the DeGods inscriptions, they didn’t just want to mint them in the typical way and have the inscriptions added to the network across potentially multiple Bitcoin blocks.\n\nInstead, they worked with a Bitcoin miner, Luxor Technologies CEO Nick Hansen, to arrange for all 535 of the NFT inscriptions to be etched onto the blockchain in a single, exclusive block. The block was processed by DMG Blockchain Solutions’ Terra Pool, which claims to be a carbon-neutral mining pool powered by renewable energy solutions.\n\nOver 1 year ago, 535 DeGods were burned. Many have speculated on their return. What is dead may never die. pic.twitter.com/fmP1FhZI6F — Frank III (@frankdegods) February 13, 2023\n\n“It was a deal-breaker for us if we couldn't do it as a custom block, because we had to do something special,” Frank told Decrypt. “It’s the DeGods way, right? You can't just do it in the basic way. You’ve gotta do something that feels really fresh.”\n\nUltimately, to fit the 535 images into a single Bitcoin block, they had to be seriously compressed. Each was resized down to a low-resolution 210x210 pixels—a nod to the total Bitcoin supply of 21 million BTC—and in the .webp file format to conserve space. But now they’re all inscribed on the Bitcoin blockchain for future use.\n\nWhile many NFTs on Ethereum and other platforms store their artwork externally on either centralized servers or decentralized storage solutions (like IPFS), Ordinals fit the artwork or asset entirely within the on-chain block. That proved to be a key part of the appeal for the DeGods team—that these assets will live potentially forever on Bitcoin.\n\n“I've run a [Bitcoin] node, and the idea that every single node on the planet is now verifying and backing up this image is so powerful,” Frank said. “That is what got us really excited.”\n\nNext steps\n\nMeanwhile, the broader DeGods project is already set to be bridged from Solana to Ethereum sometime this quarter, as announced in December—with sister project y00ts bridging from Solana to Polygon.\n\nThat’s still happening for the rest of the project’s 10,000 total NFTs, and Frank tweeted this week that “having a presence on all blockchains is important.” However, these 535 specific DeGods NFTs, which were previously burned on Solana, will only live on Bitcoin via Ordinals.\n\nHow they roll out remains to be seen, however. The official DeGods account tweeted Monday that details on how to mint the Bitcoin NFTs will be announced “in the coming days.”\n\nOn Tuesday, however, Kevin told Decrypt that they’re currently being held in private wallets, and that they’re waiting for more tooling to be deployed to make Ordinals safer to handle and transact. Once that target is hit, Kevin said that they have plenty of ideas on how to launch the NFTs in an effort to “come back to our holders and support the community.”\n\n“We're gonna essentially sit on them,” Kevin said, “until we are comfortable that the tooling will support the proper custody of these for a reasonably sophisticated crypto connoisseur.”"
    }
]