[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTIwL3Nwb3QtYml0Y29pbi1idGMtZXRmLWFwcHJvdmFsLXNlZW4tZHJpdmluZy1tb25leS1tYW5hZ2Vycy10by1jcnlwdG_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Spot-Bitcoin (BTC) ETF Approval Seen Driving Money Managers to Crypto - Bloomberg",
        "content": "It’s touted as crypto’s big breakthrough on Wall Street: The imminent arrival of Bitcoin exchange-traded funds that will kick open digital-currency investing to the institutional and retail masses.\n\nThat’s driving the latest hype cycle in the world’s largest token on bets that the likes of wealth managers and financial advisers will finally start to lavish a small portion of their trillion-dollar portfolios on the crypto promise."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTIwL2NhdGhpZS13b29kLXMtYXJrLTIxc2hhcmVzLXVudmVpbC0wLTgtZmVlLW9uLXBlbmRpbmctc3BvdC1iaXRjb2luLWV0ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Wood's Ark, 21Shares Unveil Fee on Pending Spot Bitcoin ETF - Bloomberg",
        "content": "Cathie Wood ’s ARK Investment Management and digital-asset firm 21Shares just became the first major applicant in the US spot Bitcoin ETF race to list a fee on their planned offering.\n\nThe Ark 21Shares Bitcoin ETF would carry a management fee of 80 basis points, according to an updated filing Bloomberg Terminal Monday. That means if someone invests $100, they would be charged 80 cents. The application for the ETF, which will trade under the ticker ARKB, had previously listed 70 basis points in a placeholder capacity."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW92ZXJ0YWtlcy1ldGhlcmV1bS10cmFuc2FjdGlvbi1mZWVzLTA1NDkyNjg4MS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Overtakes Ethereum in Transaction Fees on the Back of Renewed Ordinals Frenzy - Yahoo Finance",
        "content": "Bitcoin Overtakes Ethereum in Transaction Fees on the Back of Renewed Ordinals Frenzy\n\nBitcoin (BTC) has recently surpassed Ethereum (ETH) in terms of average daily transaction fees, signaling a notable shift in the fee landscape. On November 20, Bitcoin's average daily transaction fee reached $10.34, while Ethereum's average fee stood at $8.43.\n\nThe upswing in Bitcoin transaction fees is a result of heightened activity surrounding the Ordinals Protocol, which enables the creation of NFT-like assets and BRC-20 tokens on the Bitcoin network. After a period of relative dormancy in late September to October, Ordinals-based assets experienced a significant surge in late October, according to Dune Analytics.\n\nSince October 24, over 6 million Ordinal assets have been generated, leading to the redistribution of more than 800 BTC in fees (equivalent to $30 million) to the network. The momentum further escalated when ORDI, the second-largest BRC-20 token by market capitalization, was listed on Binance on November 7. This listing sparked increased buying activity of BRC-20 tokens, resulting in a price surge of slightly over 50% for the ORDI token.\n\nIn addition to the growing popularity of the Ordinals Protocol, the Taproot Wizards project, which is built on the Ordinals protocol, announced a seed funding round of $7.5 million on November 17.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLXJlYXNvbnMtYml0Y29pbnMtbW9tZW50dW0tanVzdC0xNjU1MDAyNjEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "3 Reasons Bitcoin's Momentum is just Beginning - Yahoo Finance",
        "content": "Whether it be a game of pool, a “2-minute drill” for a football team, or the stock market, momentum can play an integral role in technical and fundamental outcomes. On Wall Street, one can trace the heart of price trends to fundamental momentum. For stocks, this usually means increasing earnings expectations, leading to more investor interest. For other assets, it can mean scarcity and a better use case. Either way, all price trends are birthed when buying pressure outweighs selling pressure and momentum picks up. Bitcoin, which is up ~125% year-to-date and is the world’s most popular cryptocurrency, is one such asset class gaining momentum. Below are three reasons the Bitcoin momentum may just be beginning:\n\nInternational Adoption & Real-World Use is on the Rise\n\nLast night, hyperinflation-plagued Argentina shocked the world by electing a wild-haired, chainsaw-wielding Libertarian candidate named Javier Milei. After embracing socialism for years, an inflation rate of more than 100% a year pushed citizens of South America’s second-largest economy to move in a completely different direction and try something new politically. Years of money printing, currency devaluation, and corruption have collectively brought the country to a tipping point, disrupting the delicate balance between money supply and economic output. Investors cheered the news and sent domestic juggernauts like oil juggernaut YPF (YPF) higher by ~34% and the MSCI Argentina ETF (ARGT) higher by more than 10% in volume which tracked 9,800% above average in early trading.\n\nZacks Investment Research\n\n\n\nImage Source: TradingView\n\nAs is the case throughout history, crisis tends to lead to opportunity for investors. In the case of Argentina, the real opportunity may be in Bitcoin. Because Argentina is in such financial trouble, the economic picture remains muddled regardless of who’s in office. However, the election results are bullish for Bitcoin for two main reasons. First, Milei is the second pro-Bitcoin presidential candidate in Latin America to gain office (El Salvador’s Nayib Bukele was the first).\n\nStory continues\n\nBetween the two shocking election outcomes and a wave of US politicians embracing Bitcoin, the momentum is shifting politically on a grand scale. Second, and most importantly, Bitcoin is being used in the real world to stave off inflation. The evidence? Following the election news, Bitcoin hit new highs in three inflation-plagued countries, including Nigeria, Turkey, and, of course, Argentina. The evidence is clear: world citizens are gravitating toward Bitcoin because of its inflation-resistant protocol (there will only ever be 21 million coins, while countries around the world print money endlessly). Year-to-date, Bitcoin is up a robust 351% versus the Argentine Peso.\n\nZacks Investment Research\n\n\n\nImage Source: TradingView\n\nBitcoin Supply is Stagnant\n\nOver the weekend, Bitcoin analyst Will Clemente pointed out that “88% of Bitcoin supply hasn’t moved in at least three months.” In other words, many investors seem to be shifting to a long-term mindset. Because Bitcoin has a fixed supply, as the remaining supply wanes and investor demand increases, Bitcoin should rally further.\n\nZacks Investment Research\n\n\n\nImage Source: Glassnode, Will Clemente\n\nInstitutional Appetite\n\nLong-awaited approval of ETFs will likely mean a quantum leap for the Bitcoin asset class. With juggernauts such as Fidelity and BlackRock (BLK) applying for ETFs, demand will soar from both institutions and retail investors should the ETFs be approved (they likely will be). In the meantime, Bitcoin proxies such as the ProShares Bitcoin ETF (BITO), Coinbase (COIN), and MicroStrategy (MSTR) should benefit dramatically.\n\n\n\n\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nYPF Sociedad Anonima (YPF) : Free Stock Analysis Report\n\nMicroStrategy Incorporated (MSTR) : Free Stock Analysis Report\n\nGlobal X MSCI Argentina ETF (ARGT): ETF Research Reports\n\nCoinbase Global, Inc. (COIN) : Free Stock Analysis Report\n\nProShares Bitcoin Strategy ETF (BITO): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1hbmQtYXVzdHJpYW4tZWNvbm9taWNzJTNBLWluc2lnaHRzLWZyb20tdHV1ci1kZW1lZXN0ZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin And Austrian Economics: Insights From Tuur Demeester - Nasdaq",
        "content": "Bitcoin and Austrian Economics have been subjects of much interest and discussion in recent years. In this article, we will explore the basics of Bitcoin, delve into the principles of Austrian Economics, and examine the unique insights provided by Tuur Demeester, a renowned expert in both fields.\n\nThe Role of Bitcoin in Today's Economy\n\nMoreover, Bitcoin has become a store of value for many individuals who see it as a hedge against fiat currency devaluation. Its decentralized nature and limited supply have led some to view it as digital gold, a safe haven asset in times of economic uncertainty. This perception has been further reinforced by institutional investors and corporations, such as MicroStrategy and Tesla, allocating a portion of their treasury reserves to Bitcoin.\n\nIt is important to note that Bitcoin's impact extends beyond its monetary value. The underlying principles of decentralization, transparency, and censorship resistance have inspired a broader movement for financial sovereignty and individual empowerment. Bitcoin has become a symbol of resistance against centralized authorities and a catalyst for reimagining the future of money.\n\nThe Principles of Austrian Economics\n\nLet us turn our attention to the principles of Austrian Economics. Austrian Economics is a school of economic thought that emphasizes individual freedom, free markets, and limited government intervention. Its origins can be traced back to the works of economists such as Carl Menger, Friedrich Hayek, Murray Rothbard, and Ludwig von Mises.\n\nThe Origin and Evolution of Austrian Economics\n\nAustrian Economics emerged as a reaction to the prevailing economic theories of the time, which focused on mathematical models and central planning. Its proponents argued that economics should be grounded in the study of individuals' actions and choices, rather than abstract aggregates. Over the years, Austrian Economics has evolved and gained prominence, attracting a dedicated following of scholars and practitioners.\n\nKey Tenets of Austrian Economics\n\nAustrian Economics is characterized by several key principles. Firstly, it emphasizes the subjective nature of value, arguing that value is determined by individuals' preferences and choices. Secondly, it highlights the importance of entrepreneurship and market competition in driving economic growth and innovation.\n\nFurthermore, Austrian Economics emphasizes the role of the price mechanism in coordinating economic activity. Prices, according to Austrian economists, communicate crucial information about scarcity and consumer preferences. Finally, Austrian Economics advocates for sound money and opposes inflationary monetary policies.\n\nTuur Demeester: A Brief Introduction\n\nDemeester's Background and Influence\n\nTuur Demeester is an economist and investor who has extensively studied Bitcoin and Austrian Economics. He is the founder of Adamant Capital, an investment firm specializing in Bitcoin research. Demeester's research and analysis have contributed significantly to the understanding of Bitcoin's economic implications and its relation to Austrian Economics.\n\nDemeester's Views on Bitcoin and Austrian Economics\n\nDemeester has highlighted the compatibility between Bitcoin and Austrian Economics. He argues that Bitcoin's decentralized and permissionless nature aligns with the principles of Austrian Economics, which emphasize individual freedom and free markets. Demeester sees Bitcoin as a potential disruptor to traditional financial systems and believes it can empower individuals by providing them with financial sovereignty.\n\nThe Intersection of Bitcoin and Austrian Economics\n\nDemeester's Perspective on Bitcoin as a Free Market\n\nDemeester sees Bitcoin as a manifestation of the free market principles advocated by Austrian Economics. The absence of a centralized authority controlling Bitcoin's issuance and transaction validation aligns with the Austrian belief in spontaneous order and voluntary exchanges. Bitcoin's open-source nature allows anyone to participate and contribute, making it a truly decentralized ecosystem.\n\nThe Role of Bitcoin in Austrian Economic Theory\n\nBitcoin's emergence has sparked debates within the Austrian Economics community. Some argue that Bitcoin represents a digital form of Austrian economics in practice, as it operates outside the control of central banks and governments. Others contend that Bitcoin's lack of intrinsic value and its volatility make it an unsuitable representation of Austrian economic principles.\n\nCriticisms and Counter Arguments\n\nAs with any subject of interest, Bitcoin and Austrian Economics have not been immune to criticisms. Let us examine some common criticisms and explore Demeester's responses.\n\nCommon Criticisms of Bitcoin in Austrian Economics\n\nOne common criticism argues that Bitcoin's price volatility renders it unreliable as a medium of exchange. Critics claim that the constant fluctuation in value undermines its suitability as a store of value and a unit of account. Additionally, concerns have been raised about the environmental impact of Bitcoin mining and its potential energy consumption.\n\nDemeester's Responses to Criticisms\n\nDemeester acknowledges the valid concerns raised regarding Bitcoin's volatility and energy consumption. However, he argues that as Bitcoin matures, its volatility is likely to decrease, making it more suitable for everyday transactions. Furthermore, Demeester highlights the growing adoption of renewable energy sources in Bitcoin mining, mitigating the environmental impact.\n\nIn conclusion, the insights provided by Tuur Demeester shed light on the fascinating intersection of Bitcoin and Austrian Economics. Bitcoin's unique attributes align with the principles of Austrian Economics, opening the door to discussions about the future of money and the role of decentralized systems in our economic landscape.\n\nWeekly Recap (11/13/2023 - 11/17/2023)\n\nGermany’s fourth largest bank Commerzbank granted Bitcoin and Crypto Custody license\n\nU.S. Presidential Candidate Vivek Ramaswamy: ‘The Government is threatened by Bitcoin’. During an interview on Natalie Brunell’s CoinStories podcast Ramaswamy asserted that the government perceives Bitcoin as a potential threat to its control over monetary policy.\n\nBtcoin’s price rose 120% since El Salvador became the first nation to buy 1 bitcoin a day. One year ago today (11/16/2023), El Salvador announced an ambitious plan to begin adding 1 Bitcoin per day to its national treasury.\n\nGrayscale CEO says ‘They’re ready for the main event’, awaiting Spot Bitcoin ETF approval. Bitcoin is up 122% year-to-date on the speculation of the first spot ETF approval in the United States.\n\nHong Kong based Boyaa plans to buy $45 Million worth of Bitcoin as a treasury reserve asset.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]