[
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vbnlwb3N0LmNvbS8yMDIzLzA2LzI0L3RyZW5keS1icm9va2x5bi1iYXRoaG91c2UtcG93ZXJlZC1ieS1iaXRjb2luLW1pbmluZy1kcmF3cy1oZWF0ZWQtcmVzcG9uc2Uv0gFsaHR0cHM6Ly9ueXBvc3QuY29tLzIwMjMvMDYvMjQvdHJlbmR5LWJyb29rbHluLWJhdGhob3VzZS1wb3dlcmVkLWJ5LWJpdGNvaW4tbWluaW5nLWRyYXdzLWhlYXRlZC1yZXNwb25zZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 24 Jun 2023 07:00:00 GMT",
        "title": "Trendy Brooklyn bathhouse powered by Bitcoin mining draws heated response - New York Post",
        "content": "A trendy Brooklyn bathhouse picked up steam this week when it boasted that it uses Bitcoin mining to generate heat for its pools.\n\n“Did you know our pools are heated with byproduct from Bitcoin mining?” Williamsburg’s Bathhouse posted on Instagram, drawing hundreds more comments than usual.\n\nA video explains in a few steps how the futuristic process to mine the virtual currency goes down.\n\n“Step one: mine Bitcoin. Mining uses electricity for computing power and generates heat as a byproduct,” the narrator says.\n\nBitcoin mining involves solving complicated math problems with specialized software that verifies transactions in the currency, according to the financial services company Bankrate.\n\n“Step two: send the heat generated by the miners to heat exchangers and heat our pools. Step three: enjoy hot pool while supporting the Bitcoin network,” the video continues. “The pools absorb the heat and circulate cool liquid back to the miners.”\n\nMining Bitcoin is energy-intensive and critics argue that it is bad for the environment.\n\n“This makes me like Bathhouse less,” commented one user. “Now I’m concerned about who is mining this cryptocurrency, who is profiting from it, and whether I support that.”\n\n“I ain’t supporting that sh-t,” said another.\n\nOthers applauded the innovation.\n\n“This is awesome,” wrote one person. “I pretty much never leave Manhattan but I just booked a massage.”\n\n3 A Brooklyn spa announced on social media that it uses mining from cryptocurrency to hear its pools. Bathhouse/Instagram\n\n3 Pools at Bathhouse in Williamsburg are heated through cryptocurrency mining, the company shared. Bathhouse/Instagram\n\nThe company remains passionate about its business model.\n\n“Instead of using electricity for an electric pool heater, we use electricity to run the miners,” Bathhouse co-founder Jason Goodman told Yahoo’s In The Know.\n\n“The net result is that we are essentially energy-neutral because we are powering the miners with energy we already needed to purchase to heat our pools,” Goodman continued. “Therefore, we are able to use this electricity ‘twice’ in a certain sense … We are able to recover a lot of our energy costs while supporting the Bitcoin network and nerding out on a fun engineering project.”\n\n3 Critics say mining cryptocurrency has a negative toll on the environment. Bathhouse/Instagram\n\nThe company created a new Frequently Asked Questions section on its website to provide some more insight.\n\n“From our perspective, if Bitcoin is able to have even a small percentage of positive impact that we think it might, it would be important to be open minded about it,” Bathhouse explains.\n\nThe old factory-turned-massage-house opened in 2021 and features spa treatments such as massages as scrubs and has a restaurant and bar."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2JpdGNvaW4taGl0cy1tb3JlLXRoYW4tMS15ZWFyLWhpZ2gtYW1pZC1ibGFja3JvY2stZXRmLWV4Y2l0ZW1lbnQvYXJ0aWNsZXNob3cvMTAxMjMwMTQyLmNtc9IBigFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2JpdGNvaW4taGl0cy1tb3JlLXRoYW4tMS15ZWFyLWhpZ2gtYW1pZC1ibGFja3JvY2stZXRmLWV4Y2l0ZW1lbnQvYW1wX2FydGljbGVzaG93LzEwMTIzMDE0Mi5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 24 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin hits more than 1-year high amid BlackRock ETF excitement - The Economic Times",
        "content": "Elevate Your Tech Prowess with High-Value Skill Courses Offering College Course Website Indian School of Business ISB Professional Certificate in Product Management Visit MIT MIT Technology Leadership and Innovation Visit Indian School of Business ISB Product Management Visit\n\nBitcoin, the world's largest cryptocurrency, hit a more than one-year high on Friday, capping a week of gains helped in part by BlackRock's plans to create a bitcoin exchange-traded fund (ETF) despite heightened U.S. regulatory scrutiny on the digital asset sector.BlackRock, the world's biggest asset manager, filed last week to launch iShares Bitcoin Trust, an ETF that would have Coinbase Custody as its custodian as well as offer institutional investors exposure to the cyptocurrency. Crypto exchange EDX Markets, backed by investment firms Charles Schwab, Fidelity and Citadel Securities, also announced earlier this week that it will allow trading on some cryptocurrencies.The moves have revived investor interest in cyptocurrencies, which have been in the doldrums after a series of crypto company meltdowns including the sudden collapse of exchange FTX late last year.Compounding negative sentiment has been increased regulatory scrutiny, including the U.S. Securities and Exchange Commission's move this month to sue crypto giants Coinbase Global and Binance, alleging violation of its rules. The pair deny the allegations.Bitcoin has gained nearly 25% in value since BlackRock's filing. It rose as high as $31,458 on Friday, the highest level since June 7, 2022, and was last up 3.29% at $30,872.\"The dark clouds overshadowing crypto have lifted in recent days amid a burst of institutional interest,\" said Kate Laurence, general partner of Bloccelerate VC, which invests in crypto projects.\"The likes of BlackRock, Charles Schwab, Fidelity and Citadel throwing their hats into the crypto ring is hugely significant because it shows that institutions are very serious about the space - despite the recent regulatory crackdown.\"Investors piled into cryptocurrencies when interest rates were low, pushing the market to a peak value of $3 trillion in 2021. But they turned cautious as rates rose, with the value of the market now standing at around $1.24 trillion, according to CoinGecko data.Ethereum, the world's second-largest cryptocurrency, has risen more than 16% since last week. It was up 1.63% at 1,903.20 on Friday.Some market-watchers said the SEC crackdown may be good for bitcoin, which is generally considered a commodity rather than a security, and therefore beyond the SEC's remit.\"The SEC lawsuit has created opportunities for robust, regulated players, so I'm cautiously optimistic that this BlackRock event will have some sustainability,\" said Doug Schwenk, CEO of Digital Asset Research."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMjQvYml0Y29pbi1yYWxsaWVzLTE3cGVyY2VudC10aGlzLXdlZWstYXMtaW5zdGl0dXRpb25hbC1pbnRlcmVzdC1pbi10aGUtYXNzZXQtcGlja3MtdXAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 24 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin rallies 17% this week as institutional interest in the asset picks up - CNBC",
        "content": "For many crypto investors, this week felt like the beginning of a new era – and ironically, it was driven by the old guard of financial institutions. Bitcoin ended the week up 17.1% at $30,864.67, according to Coin Metrics, for its best week since March 17. At one point on Friday, bitcoin rose to as much as $31,412.72 , its highest level since June 8, 2022. In altcoins: the tokens tied to Solana and Cardano gained roughly 12% this week, while Polygon advanced more than 13%, as of Friday evening. These are the same tokens that were under pressure earlier this month after the Securities and Exchange Commission referred to them as crypto asset securities in lawsuits brought against the biggest exchanges – Binance and Coinbase . Meanwhile, each of the major averages posted their worst weekly performance since March. The S & P 500 and the Nasdaq Composite fell three our of four trading days this week, with the Nasdaq snapping an eight-week winning streak. \"Amid strengthening regulatory scrutiny from the SEC, bitcoin was hoisted above $30k as a number of TradFi [traditional finance] players have followed BlackRock's move to file for spot bitcoin exchange traded funds this week,\" said Yuya Hasegawa, crypto market analyst at Japanese crypto exchange Bitbank. BlackRock filed an application for its spot bitcoin ETF June 15, spurring a flurry of fund filings from other asset managers. In this holiday-shortened week alone, institutions like WisdomTree and Invesco have filed or refreshed bitcoin ETF applications . BTC.CM= 5D mountain Bitcoin this week Meanwhile, an institutional-only crypto exchange called EDX Markets, backed by Fidelity Digital Assets, Charles Schwab and Citadel Securities, announced that it has gone live with bitcoin and ether trading. And finally, JPMorgan confirmed to CNBC's \"Crypto World\" that it began allowing euro-denominated payments for corporate clients to make wholesale payments using its JPM Coin . This week's price action brings bitcoin's year-to-date gains to about 85% and advanced the cryptocurrency nearly 8% for the quarter, as of Friday evening. Still, for crypto, the period since the end of this year's banking crisis has been marked by low trading volume, even as it's moved in a positive direction recently. In the past two weeks, bitcoin's trading volume has increased 0.5% on a week-over-week basis, according to JPMorgan. That contrast could mean bitcoin hasn't attracted new money or investors into the crypto market, according to Owen Lau, an analyst at Oppenheimer. With a lot of good priced in this week, don't be surprised to see a minor pullback in the week ahead, Lau said. There isn't much on the calendar in the coming days, and investors \"may just sell the strength and wait for the next catalyst.\" From a technical point of view, Hasegawa said bitcoin's breakout \"from the two-month long descending channel is a bullish sign, especially since bitcoin's trading volume has noticeably increased, but from a macro perspective, a continued cash inflow may not be likely.\" \"Bitcoin may be able to print another leg up to around $32,000 in the short term due to technical reasons, but it feels like the current recovery has a short expiration date,\" he added."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMjQvYml0Y29pbi1yYWxsaWVzLTE3cGVyY2VudC10aGlzLXdlZWstYXMtaW5zdGl0dXRpb25hbC1pbnRlcmVzdC1pbi10aGUtYXNzZXQtcGlja3MtdXAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 24 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin rallies 17% this week as institutional interest in the asset picks up - CNBC",
        "content": "For many crypto investors, this week felt like the beginning of a new era – and ironically, it was driven by the old guard of financial institutions. Bitcoin ended the week up 17.1% at $30,864.67, according to Coin Metrics, for its best week since March 17. At one point on Friday, bitcoin rose to as much as $31,412.72 , its highest level since June 8, 2022. In altcoins: the tokens tied to Solana and Cardano gained roughly 12% this week, while Polygon advanced more than 13%, as of Friday evening. These are the same tokens that were under pressure earlier this month after the Securities and Exchange Commission referred to them as crypto asset securities in lawsuits brought against the biggest exchanges – Binance and Coinbase . Meanwhile, each of the major averages posted their worst weekly performance since March. The S & P 500 and the Nasdaq Composite fell three our of four trading days this week, with the Nasdaq snapping an eight-week winning streak. \"Amid strengthening regulatory scrutiny from the SEC, bitcoin was hoisted above $30k as a number of TradFi [traditional finance] players have followed BlackRock's move to file for spot bitcoin exchange traded funds this week,\" said Yuya Hasegawa, crypto market analyst at Japanese crypto exchange Bitbank. BlackRock filed an application for its spot bitcoin ETF June 15, spurring a flurry of fund filings from other asset managers. In this holiday-shortened week alone, institutions like WisdomTree and Invesco have filed or refreshed bitcoin ETF applications . BTC.CM= 5D mountain Bitcoin this week Meanwhile, an institutional-only crypto exchange called EDX Markets, backed by Fidelity Digital Assets, Charles Schwab and Citadel Securities, announced that it has gone live with bitcoin and ether trading. And finally, JPMorgan confirmed to CNBC's \"Crypto World\" that it began allowing euro-denominated payments for corporate clients to make wholesale payments using its JPM Coin . This week's price action brings bitcoin's year-to-date gains to about 85% and advanced the cryptocurrency nearly 8% for the quarter, as of Friday evening. Still, for crypto, the period since the end of this year's banking crisis has been marked by low trading volume, even as it's moved in a positive direction recently. In the past two weeks, bitcoin's trading volume has increased 0.5% on a week-over-week basis, according to JPMorgan. That contrast could mean bitcoin hasn't attracted new money or investors into the crypto market, according to Owen Lau, an analyst at Oppenheimer. With a lot of good priced in this week, don't be surprised to see a minor pullback in the week ahead, Lau said. There isn't much on the calendar in the coming days, and investors \"may just sell the strength and wait for the next catalyst.\" From a technical point of view, Hasegawa said bitcoin's breakout \"from the two-month long descending channel is a bullish sign, especially since bitcoin's trading volume has noticeably increased, but from a macro perspective, a continued cash inflow may not be likely.\" \"Bitcoin may be able to print another leg up to around $32,000 in the short term due to technical reasons, but it feels like the current recovery has a short expiration date,\" he added."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2NvaW50ZWxlZ3JhcGguY29tL21hZ2F6aW5lL2JpdGNvaW5zLWdyZWF0LWFjY3VtdWxhdGlvbi1iaW5hbmNlLXVzLXJlc3VtZXMtZmlhdC13aXRoZHJhd2Fscy1hbmQtb3RoZXItbmV3cy1ob2RsZXJzLWRpZ2VzdC1qdW5lLTE4LTI0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 24 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin's 'Great Accumulation,' Binance.US resumes withdrawals... - Cointelegraph",
        "content": "Top Stories This Week\n\n‘The Great Accumulation’ of Bitcoin has begun, says Gemini’s Winklevoss\n\nRecently renewed optimism for an approved Bitcoin spot exchange-traded fund (ETF) is igniting “The Great Accumulation Race” for Bitcoin, according to industry pundits. Over the past week, Fidelity, Invesco, WisdomTree and Valkyrie have followed investment giant BlackRock in applying for a Bitcoin spot ETF with the United States Securities Exchange Commission, which some analysts believe is the reason for Bitcoin’s price surge in the past days.\n\nBinance.US solves USD withdrawal issues but warns it won’t last long\n\nCrypto exchange Binance.US informed customers that it has resolved U.S. dollar withdrawal issues after working with its banking partners, though it warned the relief may not last. The exchange suspended dollar deposits and notified its customers of an incoming pause to fiat withdrawal channels on June 9, amid its ongoing battle with the SEC. Binance.US has encouraged customers that have a failed withdrawal attempt to resubmit their requests. Any remaining USD balances held in customer accounts will be converted into Tether at a future date.\n\nAtomic Wallet users have been left wanting more answers, despite the decentralized wallet provider finally releasing a full “event statement” about the June exploit — which some estimate has run up to $100 million in losses. In the statement, Atomic didn’t point to what exactly led to the exploit, only laying out the four most “probable” causes, including a virus on user devices, an infrastructure breach, a man-in-the-middle attack or malware code injection. According to the company, “less than 0.1%” of app users were affected, but the figure is still rebuffed by many online.\n\nUK government moves forward on financial markets bill for potential regulation of crypto\n\nLawmakers in the United Kingdom are moving forward with legislation that could help support the adoption of crypto in the country. First introduced to the U.K. Parliament in July 2022, the Financial Services and Markets Bill was aimed at ensuring the country maintained its place in the financial world following Brexit, including granting authority on digital asset regulation. The bill went through a third reading in the House of Lords, one of the final stages in passage before considering any additional amendments and being signed into law.\n\nFed sees stablecoin as form of money, wants ‘robust’ role in its oversight, Powell says\n\nThe U.S. Federal Reserve Board sees payment stablecoins as a form of money, Chair Jerome Powell said on June 21 when addressing Congress about the proposed stablecoin bill. Powell took a position that runs contrary to that of SEC chairman Gary Gensler. Last year, Gensler spoke at a Senate Banking Committee hearing saying that stablecoins may require registration and regulation with the SEC. Gensler has also consistently stated that all cryptocurrencies, except Bitcoin, are securities.\n\nWinners and Losers\n\nAt the end of the week, Bitcoin (BTC) is at $30,697, Ether (ETH) at $1,896 and XRP at $0.49. The total market cap is at $1.19 trillion, according to CoinMarketCap.\n\nAmong the biggest 100 cryptocurrencies, the top three altcoin gainers of the week are Bitcoin Cash (BCH) at 83.66%, Pepe (PEPE) at 67.59% and Bitcoin SV (BSV) at 51.87%.\n\nThe top three altcoin losers of the week are KuCoin Token (KCS) at -8.21%, Quant (QNT) at -6.51% and BitTorrent(New) (BTT) at -4.72% .\n\n\n\nFor more info on crypto prices, make sure to read Cointelegraph’s market analysis.\n\nMost Memorable Quotations\n\n\n\n“We do see payment stablecoins as a form of money, and […] it would be appropriate to have quite a robust federal role in what happens in stablecoin going forward.”\n\nJerome Powell, chairman of the U.S. Federal Reserve\n\n“It is becoming very obvious Web3 financial rails are the future.”\n\nLisa Wade, CEO of DigitalX\n\n“BlackRock breathed new life into the [Bitcoin ETF] race.”\n\nEric Balchunas, senior ETF analyst at Bloomberg\n\n“If well designed, CBDCs can strengthen the usability, resilience, and efficiency of payment systems and increase financial inclusion in [Latin America and the Caribbean].”\n\nInternational Monetary Fund\n\n“Crypto will become the native currency of AI.”\n\nRobby Yung, the CEO of Animoca Brands\n\n“The Great Accumulation of bitcoin has begun.”\n\nCameron Winklevoss, co-founder of Gemini\n\nPrediction of the Week\n\nBitcoin ‘parabolic advance’ means BTC price all-time high in 2023 — Trader\n\nBitcoin will hit new all-time highs in 2023, and October is the favored month for it, a popular trader said. In a Twitter update on June 22, pseudonymous trader Credible Crypto argued that the next four months should deliver the bullish BTC price momentum needed to tackle $69,000.\n\n“Whats clear with any parabolic advance is that momentum increases exponentially and peaks at the top. We can see this in both prior impulsive moves from 3k-14k and from 10k-60k,” he explained. This time around, Bitcoin has delivered a successful retest of support on monthly timeframes, with $25,000 now possibly a springboard for a new “parabolic advance.”\n\n“I would expect that once expansion begins (which it looks like it has) we should see monthly moves of > 10k at a time, easily. From current levels to prior ATH is a $40,000 gap. This gap should then, logically, be covered within a few monthly candles if this is a parabolic advance,” he said.\n\nFUD of the Week\n\nPrime Trust can’t honor customer withdrawals, says Nevada regulator\n\nPrime Trust’s financial condition is “critically deficient,” and the crypto custodian has been unable to honor customer withdrawals since June 21, according to Nevada’s business regulator. In a cease and desist order, the regulator claimed Prime Trust’s is in an “unsafe or unsound condition” to continue business. The company now has 30 days to respond to the order and can request an administrative hearing to contest it. The move comes a few days after its subsidiary, Banq, filed for bankruptcy protection in the United States.\n\nApple removes malicious Trezor app from App Store\n\nAn apparent malicious app purporting to be crypto hardware wallet Trezor has been taken off Apple’s App Store, though a quick search has revealed that other copycat apps are still lurking. After a Twitter user warned the tech company, the app was quickly removed. Fake wallet apps on Apple’s App Store are nothing new. In 2021, one user reportedly lost $600,000 in Bitcoin after downloading a malicious Trezor app from the App Store.\n\nTwitter suspends memecoin-linked AI bot after Elon Musk’s ‘scam crypto’ claim\n\nTwitter has suspended the account of the popular memecoin-linked, AI-powered bot “Explain This Bob” after Elon Musk alleged it was a “scam crypto account.” The bot was created by Prabhu Biswal from India and used OpenAI’s GPT-4 model to comprehend and provide responses to tweets by those who tagged the account. It amassed over 400,000 followers before the suspension. The project was also linked to the ERC-20 memecoin Bob Token (BOB), which was launched in April. Since the suspension, the hashtag “FREEBOB” has circulated on Crypto Twitter.\n\nBest Cointelegraph Features\n\nBitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’\n\nBitcoin maximalists have started to rationalize the idea of NFTs and tokens on Bitcoin as being inherently better than those on Ethereum.\n\nCrypto City guide to Sydney: More than just a ‘token’ bridge\n\n“There’s a lot of innovation that’s coming out of this town — much more than you see on a global stage.”\n\nPeter McCormack’s Twitter regrets: ‘I can feel myself being a dick’ — Hall of Flame\n\nBedford’s Monopoly millionaire only cares about Bitcoin, thinks CBDCs “are bullshit,” and has a love/hate relationship with Twitter."
    }
]