[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWFzc2Vzc2luZy13aGV0aGVyLW9yLW5vdC1hLWxvY2FsLWJvdHRvbS1oYXMtYmVlbi1yZWFjaGVkL9IBW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWFzc2Vzc2luZy13aGV0aGVyLW9yLW5vdC1hLWxvY2FsLWJvdHRvbS1oYXMtYmVlbi1yZWFjaGVkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin: Assessing whether or not a local bottom has been reached - AMBCrypto News",
        "content": "CryptoQuant analyst Wedson has opined that a local top has been reached.\n\nOn-chain metrics, however, paint a different picture.\n\nCryptoQuant analyst Joao Wedson has suggested that Bitcoin’s [BTC] price, which saw a 6% decline in the last week, may have hit a local bottom at the $24,000 price mark.\n\nWedson concluded after assessing the 350-day moving average and the 100-day exponential moving average that makes up BTC’s Taker Buy Sell Ratio indicator.\n\nAccording to Wedson, with the Taker Buy Sell Ratio indicator, analysts have found that the 350-day MA and 100-day EMA can identify BTC’s price trend changes.\n\nIs your portfolio green? Check out the Bitcoin Profit Calculator\n\nHe noted further that the 100-day EMA crossing a value line of one could also signal local tops and bottoms, presenting buying or selling opportunities.\n\nIn the current BTC cycle, the rally in BTC’s price since the year began pushed the 100-day EMA above one.\n\nThis, according to Wedson, might have ushered in a bear cycle that might result in a downward trend in BTC’s price.\n\nOn-chain price bottom markers say otherwise\n\nIn terms of identifying local price bottoms for cryptocurrency assets, some on-chain metrics have been effective in that regard. One of the most effective indicators is Age Consumed, which monitors the behavior of previously inactive coins on the blockchain.\n\nA surge in Age Consumed indicates a significant number of inactive tokens have been transferred to new addresses, indicating a sudden and pronounced change in the behavior of long-term holders.\n\nSince long-term holders and experienced traders seldom make impulsive decisions, a renewed activity of dormant coins often corresponds with significant changes in market conditions.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nA look at BTC’s age consumed revealed a spike in its Age Consumed metric on 22 February, when the king coin traded at $23,700. BTC’s price spent the next three days rallying to trade at $24,100, at press time.\n\nThe growth in BTC’s price, which followed the surge in Age Consumed, could be taken to mean that the leading coin bottomed at the $23,700 price point, and further rallies should be anticipated.\n\nAnother indicator that might be useful in this regard is BTC’s Network Profit/Loss ratio (NPL). This metric calculates the mean profit or loss of all coins that are transferred to new addresses on a daily basis.\n\nThis approach is used to identify instances of profit-taking or holder capitulation on the blockchain.\n\nDips in the NPL metric frequently indicate brief periods of capitulation by “weak hands” and the return of “smart money” to the market. This is why these dips often occur concurrently with local rebounds and phases of price recovery.\n\nThis has been the case with BTC in the past few days. Data from Santiment revealed a significant dip in the king coin’s NPL on 22 February, which has since been followed by a surge in its price."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXR1bWJsZXMtdG8tMTAtZGF5LWxvd3MtYXMtbm90b3Jpb3VzLWItaS1kLWtlZXBzLXN1cHBvcnQtYXQtMjItNWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price tumbles to 10-day lows as 'Notorious B.I.D.' keeps support at $22.5K - Cointelegraph",
        "content": "Bitcoin (BTC) threatened to ditch $23,000 as support on Feb. 25 as an ongoing price correction strengthened into the weekend.\n\nBTC/USD 1-day candle chart (Bitstamp). Source: TradingView\n\nBTC price support inches lower\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD attempting to decide the fate of the $23,000 mark on the day.\n\nThe pair had lost almost $1,000 on Feb. 24, ending the week in a limp position along with United States equities while the dollar gained.\n\nWith “out-of-hours” trading now in place until Monday, chances for thinner liquidity to spark more pronounced moves heightened.\n\nAnalyzing the state of the Binance order book, monitoring resource Material Indicators confirmed the continued existence of a major line of bid support informally known as the “Notorious B.I.D.” and “great wall.”\n\nPreviously higher up, the owners of the liquidity had moved it lower during the week.\n\n“If the Notorious B.I.D. wall at $22,250 holds, I expect it to be part of the weekend whale games. I would not be trying to catch knives,” Material Indicators commented.\n\n“Expect BTC to retest lows or potentially move to price discovery before a legit Bull Market Breakout.”\n\nBTC/USD order book data (Binance). Source: Material Indicators/Twitter\n\nTurning to the upcoming weekly close, trader and analyst Rekt Capital meanwhile delineated $23,300 as important to hold to protect bulls’ interests.\n\n“Weekly retest of the confluent area that is the Lower High and Monthly Range High resistance is now in progress,” they wrote in a Twitter update.\n\n“Price needs to hold here for the retest to be successful. However, Weekly Close below this area would be a bearish sign.“\n\nBTC/USD annotated chart. Source: Rekt Capital/Twitter\n\nAn additional post argued that the monthly close would be a key determining factor in the overall trend, this also being just days away.\n\nA failed #BTC Weekly retest of ~$23400 as support would mean that price remains inside the Monthly Macro Range\n\n\n\nLet's see how the Monthly Closes\n\n\n\n1M Close above ~$23400 -> likely range breakout\n\n\n\n1M Close below -> $BTC stays in & range & could dip lower in range#Crypto #Bitcoin pic.twitter.com/xTAqH7pVlm — Rekt Capital (@rektcapital) February 24, 2023\n\nBitcoin difficulty, hash rate stay the course\n\nOthers showed signs of frustration that Bitcoin could not crack $25,000 and reckon with more substantial long-term resistance levels above it.\n\nRelated: Bitcoin 2024 halving will be its ‘most important’ — Interview with Charles Edwards\n\n“Pretty amazing that we couldn’t just get an exit pump above 25K for god-tier short entry,“ Crypto Chase summarized.\n\n“Everyone bullish and euphoric and price just dumps off most obvious resistance.. such a shame. Maybe still get it later on.. idk. Crypto just don’t trade like it used to tbh.“\n\nA subsequent update highlighted $22,700 as a downside level to preserve for another run at $25,000.\n\n$BTC\n\n\n\nGonna want to see 22.7K hold if a real push above 25K for liquidity is still in the cards. Confluence of Daily S/R + 0.618 fib of current leg. pic.twitter.com/ZHShTi9SzT — Crypto Chase (@Crypto_Chase) February 24, 2023\n\nA point of optimism meanwhile came in the form of Bitcoin network fundamentals, with difficulty increasing 9.95% in its latest automated readjustment — the biggest since mid-January.\n\nAs Cointelegraph reported, both difficulty and hash rate continue to surge to new record levels despite the slowdown in price recovery.\n\n“Bitcoin mining became 10% more difficult last night,“ Maartunn, a contributing analyst to on-chain data platform CryptoQuant, responded.\n\nBitcoin network fundamentals overview (screenshot). Source: BTC.com\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXR1bWJsZXMtdG8tMTAtZGF5LWxvd3MtYXMtbm90b3Jpb3VzLWItaS1kLWtlZXBzLXN1cHBvcnQtYXQtMjItNWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price tumbles to 10-day lows as 'Notorious B.I.D.' keeps support at $22.5K - Cointelegraph",
        "content": "Bitcoin (BTC) threatened to ditch $23,000 as support on Feb. 25 as an ongoing price correction strengthened into the weekend.\n\nBTC/USD 1-day candle chart (Bitstamp). Source: TradingView\n\nBTC price support inches lower\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD attempting to decide the fate of the $23,000 mark on the day.\n\nThe pair had lost almost $1,000 on Feb. 24, ending the week in a limp position along with United States equities while the dollar gained.\n\nWith “out-of-hours” trading now in place until Monday, chances for thinner liquidity to spark more pronounced moves heightened.\n\nAnalyzing the state of the Binance order book, monitoring resource Material Indicators confirmed the continued existence of a major line of bid support informally known as the “Notorious B.I.D.” and “great wall.”\n\nPreviously higher up, the owners of the liquidity had moved it lower during the week.\n\n“If the Notorious B.I.D. wall at $22,250 holds, I expect it to be part of the weekend whale games. I would not be trying to catch knives,” Material Indicators commented.\n\n“Expect BTC to retest lows or potentially move to price discovery before a legit Bull Market Breakout.”\n\nBTC/USD order book data (Binance). Source: Material Indicators/Twitter\n\nTurning to the upcoming weekly close, trader and analyst Rekt Capital meanwhile delineated $23,300 as important to hold to protect bulls’ interests.\n\n“Weekly retest of the confluent area that is the Lower High and Monthly Range High resistance is now in progress,” they wrote in a Twitter update.\n\n“Price needs to hold here for the retest to be successful. However, Weekly Close below this area would be a bearish sign.“\n\nBTC/USD annotated chart. Source: Rekt Capital/Twitter\n\nAn additional post argued that the monthly close would be a key determining factor in the overall trend, this also being just days away.\n\nA failed #BTC Weekly retest of ~$23400 as support would mean that price remains inside the Monthly Macro Range\n\n\n\nLet's see how the Monthly Closes\n\n\n\n1M Close above ~$23400 -> likely range breakout\n\n\n\n1M Close below -> $BTC stays in & range & could dip lower in range#Crypto #Bitcoin pic.twitter.com/xTAqH7pVlm — Rekt Capital (@rektcapital) February 24, 2023\n\nBitcoin difficulty, hash rate stay the course\n\nOthers showed signs of frustration that Bitcoin could not crack $25,000 and reckon with more substantial long-term resistance levels above it.\n\nRelated: Bitcoin 2024 halving will be its ‘most important’ — Interview with Charles Edwards\n\n“Pretty amazing that we couldn’t just get an exit pump above 25K for god-tier short entry,“ Crypto Chase summarized.\n\n“Everyone bullish and euphoric and price just dumps off most obvious resistance.. such a shame. Maybe still get it later on.. idk. Crypto just don’t trade like it used to tbh.“\n\nA subsequent update highlighted $22,700 as a downside level to preserve for another run at $25,000.\n\n$BTC\n\n\n\nGonna want to see 22.7K hold if a real push above 25K for liquidity is still in the cards. Confluence of Daily S/R + 0.618 fib of current leg. pic.twitter.com/ZHShTi9SzT — Crypto Chase (@Crypto_Chase) February 24, 2023\n\nA point of optimism meanwhile came in the form of Bitcoin network fundamentals, with difficulty increasing 9.95% in its latest automated readjustment — the biggest since mid-January.\n\nAs Cointelegraph reported, both difficulty and hash rate continue to surge to new record levels despite the slowdown in price recovery.\n\n“Bitcoin mining became 10% more difficult last night,“ Maartunn, a contributing analyst to on-chain data platform CryptoQuant, responded.\n\nBitcoin network fundamentals overview (screenshot). Source: BTC.com\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmlndGhpbmsuY29tL25ldXJvcHN5Y2gvYml0Y29pbi1kYXJrLXBlcnNvbmFsaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "\"Impulsive psychopaths\" are drawn to Bitcoin and other crypto - Big Think",
        "content": "Since the invention of Bitcoin in 2009 the global cryptocurrency market has grown from nothing to a value of around US$2 trillion. From a price of US$1 in 2011, Bitcoin rose to an all-time high of more than US$63,000 in April 2021, and now hovers around the US$42,000 mark.\n\nLarge fluctuations in cryptocurrency prices are common, which makes them a highly speculative investment. What kind of people are willing to take the risk, and what motivates them?\n\nWe conducted a survey to find out. In particular, we wanted to know about the relationship between the so-called “dark tetrad” personality traits and attitudes towards cryptocurrency.\n\nThe dark tetrad\n\nIn psychology, the “dark tetrad” refers to a group of four personality traits. These are Machiavellianism, narcissism, and psychopathy (together known as the “dark triad”), plus sadism.\n\nThey are called “dark” because of their “evil” qualities: extreme selfishness and taking advantage of others without empathy. The dark tetrad are also often related to risk-taking behaviours.\n\nThe appeal of cryptocurrency\n\nWe identified two main areas of appeal. First, the high risks and high potential returns of crypto trading make it attractive to the kind of people who like gambling.\n\nSecond, cryptocurrencies are not issued or backed by governments like traditional or “fiat” currencies. This makes them attractive to people who distrust government.\n\nWhat are the personalities of crypto buyers?\n\nWe asked 566 people to complete online personality surveys as well as answer questions about their attitudes to crypto and whether or not they planned to invest in it. Of our participants, 26% reported they own crypto and 64% showed interest in crypto investing.\n\nWe measured their dark tetrad traits using standard psychological tests. We also measured traits that might connect the dark tetrad to judgements about crypto: fear of missing out(FOMO; the feeling that others are experiencing better things than you are), positivity (the tendency to be positive or optimistic in life), and belief in conspiracy theories.\n\nWhy do people want to buy crypto? It’s not just about making money\n\nA common reason to invest in crypto is the hope of earning high returns. Beyond the desire to build wealth, our research shows dark personality traits also drive crypto buying.\n\nMachiavellianism is named after the Italian political philosophy of Niccolò Machiavelli. People who rate highly on this trait are good at deception and interpersonal manipulation.\n\nMachiavellians take a calculated approach to achieving goals, and avoid impulsive decisions. They are less likely to engage in problem gambling.\n\nMachiavellians also tend to believe strongly in government conspiracies. For example, they often believe politicians usually do not reveal their true motives, and that government agencies closely monitor all citizens.\n\nWe found Machiavellians like crypto primarily because they distrust politicians and government agencies. Many crypto supporters believe governments are corrupt, and crypto avoids government corruption.\n\nOverconfidence and positivity\n\nNarcissism is a self-centred personality trait, characterised by feelings of privilege and predominance over others. Narcissists are overconfident and are more willing to do things like make risky investments in the stock market and gamble.\n\nNarcissists tend to focus on the positive side of life. We found narcissists like crypto because of their great faith in the future, and because of their confidence their own lives will improve.\n\nImpulsive psychopaths like crypto\n\nPsychopathy is a callous, impulsive antisocial personality trait. Psychopathic people often find it difficult to perceive, understand, or address emotions due to a lack of emotional intelligence and empathy.\n\nThe reckless nature of psychopaths makes them more resistant to stress and anxiety. As a result, psychopaths like stimulation-seeking and risk-taking. They are prone to gambling and gambling addiction.\n\nWe found that impulsive psychopaths like crypto, because they fear missing out on investing rewards that others are experiencing.\n\nHow is sadism involved?\n\nEveryday sadism relates to a personality enjoying another’s suffering. Sadists often display aggression and cruel behaviours. For example, sadists troll others on the Internet for enjoyment.\n\nSubscribe for counterintuitive, surprising, and impactful stories delivered to your inbox every Thursday Notice: JavaScript is required for this content.\n\nAt first glance, buying crypto is unlikely to harm others. However, we found sadists like crypto because they do not want to miss out on investment rewards either. To them, perhaps both the pleasure from seeing another’s pain and the fear of missing out are related to selfishness.\n\nUnlike narcissists, we found both psychopaths and sadists lack positivity about their prospects, which cancels out their liking of crypto.\n\nDark tetrad personality traits influence positivity, conspiracy beliefs, and fear of missing out, which in turn influence attitudes to cryptocurrency. (Wes Mountain/The Conversation, CC BY-ND)\n\nA psychological lens\n\nStudying cryptocurrency through the psychological lens of the dark tetrad offers insight into why people want to buy crypto. We are not suggesting that everyone interested in crypto displays dark tetrad traits.\n\nWe studied only a subset of people interested in crypto who do have these traits. If you happen to be a Bitcoin or other crypto holder, you may or may not exhibit them.\n\nIf you want to know how you score for dark tetrad traits, you can do the Dark Triad Personality Test and Sadism Test online.\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vYmlndGhpbmsuY29tL25ldXJvcHN5Y2gvYml0Y29pbi1kYXJrLXBlcnNvbmFsaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 25 Feb 2023 08:00:00 GMT",
        "title": "\"Impulsive psychopaths\" are drawn to Bitcoin and other crypto - Big Think",
        "content": "Since the invention of Bitcoin in 2009 the global cryptocurrency market has grown from nothing to a value of around US$2 trillion. From a price of US$1 in 2011, Bitcoin rose to an all-time high of more than US$63,000 in April 2021, and now hovers around the US$42,000 mark.\n\nLarge fluctuations in cryptocurrency prices are common, which makes them a highly speculative investment. What kind of people are willing to take the risk, and what motivates them?\n\nWe conducted a survey to find out. In particular, we wanted to know about the relationship between the so-called “dark tetrad” personality traits and attitudes towards cryptocurrency.\n\nThe dark tetrad\n\nIn psychology, the “dark tetrad” refers to a group of four personality traits. These are Machiavellianism, narcissism, and psychopathy (together known as the “dark triad”), plus sadism.\n\nThey are called “dark” because of their “evil” qualities: extreme selfishness and taking advantage of others without empathy. The dark tetrad are also often related to risk-taking behaviours.\n\nThe appeal of cryptocurrency\n\nWe identified two main areas of appeal. First, the high risks and high potential returns of crypto trading make it attractive to the kind of people who like gambling.\n\nSecond, cryptocurrencies are not issued or backed by governments like traditional or “fiat” currencies. This makes them attractive to people who distrust government.\n\nWhat are the personalities of crypto buyers?\n\nWe asked 566 people to complete online personality surveys as well as answer questions about their attitudes to crypto and whether or not they planned to invest in it. Of our participants, 26% reported they own crypto and 64% showed interest in crypto investing.\n\nWe measured their dark tetrad traits using standard psychological tests. We also measured traits that might connect the dark tetrad to judgements about crypto: fear of missing out(FOMO; the feeling that others are experiencing better things than you are), positivity (the tendency to be positive or optimistic in life), and belief in conspiracy theories.\n\nWhy do people want to buy crypto? It’s not just about making money\n\nA common reason to invest in crypto is the hope of earning high returns. Beyond the desire to build wealth, our research shows dark personality traits also drive crypto buying.\n\nMachiavellianism is named after the Italian political philosophy of Niccolò Machiavelli. People who rate highly on this trait are good at deception and interpersonal manipulation.\n\nMachiavellians take a calculated approach to achieving goals, and avoid impulsive decisions. They are less likely to engage in problem gambling.\n\nMachiavellians also tend to believe strongly in government conspiracies. For example, they often believe politicians usually do not reveal their true motives, and that government agencies closely monitor all citizens.\n\nWe found Machiavellians like crypto primarily because they distrust politicians and government agencies. Many crypto supporters believe governments are corrupt, and crypto avoids government corruption.\n\nOverconfidence and positivity\n\nNarcissism is a self-centred personality trait, characterised by feelings of privilege and predominance over others. Narcissists are overconfident and are more willing to do things like make risky investments in the stock market and gamble.\n\nNarcissists tend to focus on the positive side of life. We found narcissists like crypto because of their great faith in the future, and because of their confidence their own lives will improve.\n\nImpulsive psychopaths like crypto\n\nPsychopathy is a callous, impulsive antisocial personality trait. Psychopathic people often find it difficult to perceive, understand, or address emotions due to a lack of emotional intelligence and empathy.\n\nThe reckless nature of psychopaths makes them more resistant to stress and anxiety. As a result, psychopaths like stimulation-seeking and risk-taking. They are prone to gambling and gambling addiction.\n\nWe found that impulsive psychopaths like crypto, because they fear missing out on investing rewards that others are experiencing.\n\nHow is sadism involved?\n\nEveryday sadism relates to a personality enjoying another’s suffering. Sadists often display aggression and cruel behaviours. For example, sadists troll others on the Internet for enjoyment.\n\nSubscribe for counterintuitive, surprising, and impactful stories delivered to your inbox every Thursday Notice: JavaScript is required for this content.\n\nAt first glance, buying crypto is unlikely to harm others. However, we found sadists like crypto because they do not want to miss out on investment rewards either. To them, perhaps both the pleasure from seeing another’s pain and the fear of missing out are related to selfishness.\n\nUnlike narcissists, we found both psychopaths and sadists lack positivity about their prospects, which cancels out their liking of crypto.\n\nDark tetrad personality traits influence positivity, conspiracy beliefs, and fear of missing out, which in turn influence attitudes to cryptocurrency. (Wes Mountain/The Conversation, CC BY-ND)\n\nA psychological lens\n\nStudying cryptocurrency through the psychological lens of the dark tetrad offers insight into why people want to buy crypto. We are not suggesting that everyone interested in crypto displays dark tetrad traits.\n\nWe studied only a subset of people interested in crypto who do have these traits. If you happen to be a Bitcoin or other crypto holder, you may or may not exhibit them.\n\nIf you want to know how you score for dark tetrad traits, you can do the Dark Triad Personality Test and Sadism Test online.\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article."
    }
]