[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTA2L2NhdGhpZS13b29kLW9uLWJpdGNvaW4tYnRjLWFzLWRlZmxhdGlvbi1oZWRnZS10ZXNsYS1haS1wb2RjYXN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Cathie Wood on Bitcoin (BTC) as Deflation Hedge, Tesla, AI: Podcast - Bloomberg",
        "content": "Subscribe to Merryn Talks Money on Apple Podcasts\n\nSubscribe to Merryn Talks Money on Spotify\n\nCathie Wood says she would unambiguously bet on Bitcoin — rather than gold or cash — to safeguard against the possibility of deflation in the coming decade. The head of ARK Investment Management joins this week’s Merryn Talks Money podcast and reiterates her view that she expects an era of falling prices, backed by new technologies including artificial intelligence, electric vehicles, robotics, genomic sequencing and blockchain. It’s a view she’s held since 2021."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTA2L2NhdGhpZS13b29kLW9uLWJpdGNvaW4tYnRjLWFzLWRlZmxhdGlvbi1oZWRnZS10ZXNsYS1haS1wb2RjYXN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Cathie Wood on Bitcoin (BTC) as Deflation Hedge, Tesla, AI: Podcast - Bloomberg",
        "content": "Subscribe to Merryn Talks Money on Apple Podcasts\n\nSubscribe to Merryn Talks Money on Spotify\n\nCathie Wood says she would unambiguously bet on Bitcoin — rather than gold or cash — to safeguard against the possibility of deflation in the coming decade. The head of ARK Investment Management joins this week’s Merryn Talks Money podcast and reiterates her view that she expects an era of falling prices, backed by new technologies including artificial intelligence, electric vehicles, robotics, genomic sequencing and blockchain. It’s a view she’s held since 2021."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYXJrLWNlby1jYXRoaWUtd29vZC13b3VsZC1ob2xkLWJpdGNvaW4tbm90LWdvbGQtZm9yLXRoZS1uZXh0LTEwLXllYXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Ark CEO Cathie Wood Would Hold Bitcoin, Not Gold for the Next 10 Years - Nasdaq",
        "content": "Bitcoin bull Cathie Wood believes gold's time has come and gone.\n\nThe CEO of Ark Invest weighed in on the enduring debate between the traditional safe haven asset and digital currency during a recent Bloomberg UK podcast, Merryn Talks Money.\n\nIn a hypothetical scenario where Wood had to choose between holding gold, a cash deposit account, or Bitcoin for a decade, she made her stance clear.\n\n\"It's a hedge against inflation and deflation. It's digital,\" she began, passionately advocating for Bitcoin. Wood acknowledged the time-tested appeal of gold but highlighted a crucial difference. \"Gold already has its demand; it's happened,\" she explained. In contrast, she emphasized that Bitcoin remains a fresh and evolving asset, with institutions only beginning to scratch the surface of its potential.\n\nWood's perspective aligns with the prevailing sentiment among younger investors who increasingly favor Bitcoin over gold. She pointed out that Bitcoin's allure lies in its technological novelty and the rising enthusiasm from millennials and Gen Z, who see it as a more attractive store of value compared to the yellow metal.\n\nIntriguingly, Wood made a notable observation regarding the role of both gold and Bitcoin as hedges against deflation. However, she noted that Bitcoin's recent performance suggests that it has been outshining its traditional counterpart.\n\nIn summary, Wood's sentiment reflects the evolving landscape of investments, with Bitcoin emerging as a powerful contender.\n\nTime will tell if more investors will follow suit as Bitcoin continues its recovery from 2022's brutal bear market.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS90ZWNobm9sb2d5LzIwMjMvbm92LzA1L3dhcy1jcnlwdG8tb24tdHJpYWwtd2l0aC1zYW0tYmFua21hbi1mcmllZNIBXWh0dHBzOi8vYW1wLnRoZWd1YXJkaWFuLmNvbS90ZWNobm9sb2d5LzIwMjMvbm92LzA1L3dhcy1jcnlwdG8tb24tdHJpYWwtd2l0aC1zYW0tYmFua21hbi1mcmllZA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Was crypto on trial with Sam Bankman-Fried? - The Guardian",
        "content": "As the trial of the former crypto star and FTX founder Sam Bankman-Fried began last month, headlines declared cryptocurrency was on trial too.\n\nBut when Bankman-Fried was found guilty on seven counts of wire fraud and money-laundering conspiracy on Thursday evening, after less than five hours of jury deliberations, bitcoin was trading at its highest price in a year.\n\nAs the scene in the courtroom played out, it became clear it wasn’t so much cryptocurrency on trial as the crypto bro himself – both Bankman-Fried and the archetype: the tech dilettante who believes he’s such an all-around genius that he can get rich with no expertise and an unkempt head of Einstein hair.\n\nDuring his three days on the stand, Bankman-Fried admitted to knowing nothing about cryptocurrency. He didn’t know anything about financial regulation, either. He said he believed FTX’s terms of service allowed Alameda Research, its closely associated hedge fund, to use FTX customer funds the way it did, actions prosecutors and the jury called fraud. Asked what he knew about crypto before starting FTX, he answered: “I had absolutely no idea how they worked. I just knew they were things you could trade.”\n\nWhile parts of the trial delved into the technical and financial structure of FTX’s grand scam, the prosecution spent much of its time questioning Bankman-Fried about his public persona. The assistant US attorney Danielle Sassoon wanted to puncture his unkempt boy-genius look, demonstrating to the jury that he used his appearance to woo investors and reassure customers that they were safe in his hands, when in fact they were far from it.\n\nThe prosecution’s vivisection of his image worked. Perhaps we’ve grown weary of the unkempt Mark Zuckerberg school of style. You can read the verdict as such: a hoodie in place of a suit jacket does not mean you are focused on your product to the exclusion of all else; it means you are an amateur. Bankman-Fried admitted during the trial that he was.\n\nThe question after his conviction is whether the entire industry will be found guilty, or just him.\n\nThe trial did not focus extensively on the technological or legal governance of cryptocurrency or blockchain as Bankman-Fried’s means to an end. Rather, the central question was whether the one-time mogul “misappropriated and embezzled” his customers’ money for his own high-flying ends. The crime is as old as banking itself, but it’s being committed with a new and unregulated technology.\n\nDamian Williams, the prosecutor in charge of the southern district of New York, spoke to this when he said to reporters after the conviction: “Sam Bankman-Fried perpetrated one of the biggest financial frauds in American history – a multibillion-dollar scheme designed to make him the king of crypto – but while the cryptocurrency industry might be new and the players like Sam Bankman-Fried might be new, this kind of corruption is as old as time.”\n\nA look at bitcoin today reveals the conflicted state crypto finds itself in. Because of Bankman-Fried, cryptocurrencies’ backers have never looked worse. Still, there are signs that bitcoin will endure: the original cryptocurrency is on the verge of a major regulatory victory in the expected approval of exchange-traded funds, including it.\n\nAlso, to industry insiders, the one-time boy wonder is not the avatar of cryptocurrency. They are not like him, they think. And they may have a point: cryptocurrency is not doomed because Bankman-Fried is. Bitcoin is valuable, especially if you bought some in January of this year: it’s up 110% year-to-date.\n\nskip past newsletter promotion Sign up to First Thing Free daily newsletter Our US morning briefing breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThat bitcoin has such value in spite of some infamous champions – FTX, the Mt Gox exchange, the ever-unwelcome Winklevoss twins – points to a lasting life, perhaps not as the world-changing technology some had hoped for, but as a place to park money. We may trade bitcoin for the foreseeable future, we may trade it as long as we do stocks, and the true blockchain believers will continue to buoy its value. It’s likely to remain a symbol of libertarian rebellion against the financial system.\n\nFor true believers, the trial has simply been a distraction from the good work. Said Wired: “The Crypto World Is Already Sick of SBF’s Trial.” For those who do not belong to that school of thought, Bankman-Fried has irrevocably, irreparably, irresponsibly and irredeemably damaged the reputation of this technology. Said the Financial Times’ opinion pages: “The SBF trial is a reminder that crypto is a rotten business.” After the downfall of FTX, many people would probably take their chances gambling in Las Vegas before putting their money in crypto.\n\nOne lasting legacy of Bankman-Fried’s downfall is that it ushered in an era of crypto crackdowns in the US. The Commodity Futures Trading Commission has sued Binance, the world’s largest crypto exchange; and the Securities and Exchange Commission has charged Coinbase with operating as an unregistered securities exchange, broker and clearing agency. Both companies deny wrongdoing.\n\nIf Bankman-Fried had been found innocent, I might have said definitively that crypto had, in fact, been on trial. The jury would have committed a spectacular act of faith in cryptocurrency in acquitting him.\n\nBankman-Fried might have struck upon a different, unregulated industry ripe for exploitation. Crypto was the one that was available."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWNvdWxkLWhpdC0xNTAtMDAwLTE0NDcxMDQxOS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 06 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Could Hit $150,000 by 2025, According to Bernstein — Here Are 2 Top Bitcoin Miner Stocks to Bet on It - Yahoo Finance",
        "content": "It has been a very good year for bitcoin investors. Against a backdrop of multiple bank collapses, a shaky economic macro and recent geopolitical issues, the leading crypto has more than doubled in value in 2023, with investors increasingly viewing bitcoin as a safe haven asset to lean on in troubled times. Of course, the growing mainstream acceptance represents a big change in attitude toward what was not long ago considered an extremely volatile and risky asset.\n\nBut the good news is that this year’s surge might just be the opening shot in a new bitcoin bull cycle. That is indeed the opinion of Bernstein analyst and digital asset expert Gautam Chhugani, who points out to investors the upcoming catalysts that could propel bitcoin to higher levels.\n\n“You may not like Bitcoin as much as we do, but a dispassionate view of Bitcoin as a commodity, suggests a turn of the cycle,” Chhugani noted. “A good idea is only as good as its timing – SEC approved ETFs by world’s top asset managers (BlackRock, Fidelity et al), seems imminent. Bitcoin ‘halving’ (BTC rewards half every 4 years) is due April ’24.”\n\nSo how high can bitcoin actually go? For the upcoming cycle, by mid-2025, Chhugani anticipates it will climb to a new high of $150,000, almost a 4.5x from current levels.\n\nInvestors looking to get in on the game can buy bitcoin directly but there are other ways to participate. “A winning Bitcoin miner,” implores Chhugani, “is a high-beta way to gain exposure.”\n\nThe bitcoin miners Chhugani refers to constitute the firms with the infrastructure to validate the bitcoin transactions and receive bitcoin as a reward for doing so and Chhugani believes a pair of mining companies are extremely well-positioned to make bank.\n\nBut it’s not only the Bernstein analyst who sees good times ahead for these names. According to the TipRanks database, both are rated as Strong Buys by the analyst consensus, too. Let’s take a closer look and see what makes them so.\n\nStory continues\n\nDon’t miss\n\nRiot Platforms (RIOT)\n\nBitcoin might have more than doubled in value this year but that return actually pales against the gains notched by miner Riot Platforms. The stock is up by 238% year-to-date. Investors have evidently taken to a well-capitalized miner boasting a healthy cash balance of $289 million, minimal debt and a balance sheet that compares favorably to that of other mining companies.\n\nRiot oversees two large-scale Bitcoin mining facilities in Texas and electrical switchgear engineering and fabrication operations in Denver, Colorado. And while it has taken a conservative stance regarding its balance sheet, it has still been focused on growth.\n\nIn June, the company disclosed that it is acquiring 33,280 MicroBT immersion-cooled miners at an approximate cost of $22 per Terra Hash. This addition will increase the mining fleet’s capacity by 7.6 E/Hs, ultimately reaching a total of 20.1 EH/s upon full deployment in 2024. This positioned Riot as one of the leading miners in the industry in terms of hash power. Furthermore, the company holds the option to procure an additional 66,560 miners at the same price, potentially elevating the total hash rate to 35.4 EH/s by 2025.\n\nThe company also makes use of selling electricity back to the grid, for which it sees the benefit of power credits. This has been particularly useful during the summer months, and in August alone, on the back of surging electricity prices in Texas, the company generated $24.2 million from power credits and an additional $7.4 million in demand response credits.\n\nFor Chhugani, it’s the anticipated growth along with the company remaining solely focused on its bitcoin mining endeavors – rather than chasing the shiny new thing as other miners have done – that makes Riot a top pick.\n\n“We like RIOT over any other miner,” he says. “We reckon winning the brutal game of mining is about positioning yourself to win big and being on the right side of the cycle. It is about backing yourself, investing in capacity counter cyclically and then winning big when the BTC price cycle heats up. We think Riot does all of this.”\n\n“What we like about Riot is that it’s also not distracted from chasing a new trend,” Chhugani goes on to add. “So it has stayed away from any pivots into AI computing or high performance computing. It is investing back in building more Bitcoin capacity, being counter cyclical and using the down market to negotiate the best equipment contracts with the mining manufacturers. Thus, it has locked prices for mining machines to expand capacity from 10.7 EH/S today to 35 EH/s by end of 2025. We think this counter cyclical focus on Bitcoin is going to win big.”\n\nThese comments underpin Chhugani’s Outperform (i.e., Buy) rating while his $15.6 price target suggests shares will climb 33% higher in the year ahead. (To watch Chhugani’s track record, click here)\n\nThat stance gets the backing of almost all of Chhugani’s colleagues. Barring one bear, all 7 other recent reviews are positive, providing the stock with a Strong Buy consensus rating. The average target stands at $16.40, suggesting shares will post growth of 40% in the year ahead.\n\nCleanSpark (CLSK)\n\nThe next Bernstein-endorsed miner we’ll look at is Cleanspark, a former microgrid solutions specialist that shifted its focus to bitcoin mining some time ago. The company began exploring mining operations in late 2020 and has since made mining its primary focus.\n\nThat is not the only change that has taken place at CleanSpark. Where once the company’s strategy involved selling much of the bitcoin it mined in order to fund expansion – a game plan that worked, as unlike other firms, it did not have to eventually sell its BTC at a reduced price – the company now prefers HODLing, positioning it well for the upcoming halving event. This event that takes place every 4 years or so, and in the past has been a catalyst for a bitcoin bull market. For instance, in September, CleanSpark mined 643 BTC, selling only 80 of those coins (12%), leaving it with a total of 2,240 bitcoin holdings.\n\nThe company is also boosting capacity at a fast pace and in a recent update said it has exceeded a total hashrate of 10 EH/s. During the last five months alone, the hashrate has risen by nearly 50%, bringing it more than halfway to the intended capacity of 16 EH/s by the end of the year. With the addition of recently purchased 4.4 EH/s of Antminer S21 bitcoin miners that are expected to be delivered early next year, once fully utilized, the company anticipates reaching a total hashrate of over 20 EH/s.\n\nFor Chhugani, all of this makes CleanSpark another excellent choice for investors.\n\n“We like CleanSpark, because it reminds us of Riot, except it’s focused in Georgia state, and has an even lower power cost vs. Riot without the dynamic power credits enjoyed by Riot,” he explained. “It also stays focused on self-mining (Bitcoin over AI), has built strong visibility to double capacity by end of 2023. Again, no use of leverage, healthy liquidity and gains from any shakeout in hashpower.”\n\nQuantifying his stance, Chhugani rates the shares as Outperform (Buy), backed by a $5.3 price target. Should the figure be met, a year from now, the shares will be changing hands for a 14% premium.\n\nCompared to his colleagues, however, Chhugani’s forecast is rather conservative. The average target currently stands at $9.16, making room for 12-month returns of an excellent 97%. All analysts are on board here as CLSK’s Strong Buy consensus rating is based on a unanimous 5 Buys.\n\nTo find good ideas for stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a newly launched tool that unites all of TipRanks’ equity insights.\n\nDisclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment."
    }
]