[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzI3L2JpdGNvaW4tbWluZXItYXJnby1ibG9ja2NoYWluLWZhY2VzLWNsYXNzLWFjdGlvbi1zdWl0LW92ZXItdXMtc2hhcmUtc2FsZS_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMS8yNy9iaXRjb2luLW1pbmVyLWFyZ28tYmxvY2tjaGFpbi1mYWNlcy1jbGFzcy1hY3Rpb24tc3VpdC1vdmVyLXVzLXNoYXJlLXNhbGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Argo Blockchain Faces Class-Action Suit Over US Share Sale - CoinDesk",
        "content": "The sale helped lift Argo's shares, which slumped more than 90% last year. The London-based stock has more than doubled in January, and the U.S. shares, which were at risk of being suspended, have also recovered."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vbGlzdGVuLnNkcGIub3JnL2J1c2luZXNzLWVjb25vbWljcy8yMDIzLTAxLTI3L2hhcmRpbmctY291bnR5LWJpdGNvaW4tbWluaW5nLW9wZXJhdGlvbi1mb2xkc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Harding County Bitcoin mining operation folds | SDPB - SDPB Radio",
        "content": "A crypto mining operation planned for northwest South Dakota is calling it quits and the natural gas wells powering the project are changing hands.\n\nThe new owners of the Harding County wells have a different plan for the sites.\n\nA Texas-based company called Spyglass Cedar Creek drilled dozens of natural gas wells in Harding County in 2006 and the leasing rights to the wells have changed hands multiple times.\n\nHighwire Energy Partners purchased leasing rights to the wells two years ago to extract natural gas to power on-site computers to conduct Bitcoin mining. Bitcoin mining was a lucrative business for the company in their home state of Wyoming.\n\nThe company recently sold leasing rights to South Dakota-based Rushmore Resources.\n\nTreyton Kost-Hillmer is an Oil, Gas, and Minerals Agent for South Dakota. He said an unpredictable market for Bitcoin could have been the reason Highwire sold the leasing rights.\n\n“I’m guessing Rushmore Resources wants to take over the leases from them because they are going bankrupt or their not making enough money to pay their cost,” Kost-Hillmer said.\n\nWhen Highwire began the project two years ago, one Bitcoin was valued around $50 thousand. It’s now less than half that.\n\nTrent Arlent is general manager of Rushmore Resources. He said they’ll use the natural gas for traditional energy, powering and serving their community.\n\n“We feel like that our state is a great state and there’s a lot of benefits and a lot of qualities to the way of life that we want to be able to keep and retain here,” Arlent said.\n\nArlent said it could take up to a year to get their operation going.\n\n"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zdGF0ZS1zZW5hdG9yLXB1c2hlcy1iaWxsLXRvLW1ha2UtYml0Y29pbi1sZWdhbC10ZW5kZXItaW4tYXJpem9uYdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "State senator pushes bill to make Bitcoin legal tender in Arizona - Cointelegraph",
        "content": "Wendy Rogers, an Arizona state senator in the United States, has launched bills concerning cryptocurrency, including one that aims to make Bitcoin (BTC) legal tender in Arizona.\n\nIn a recent tweet, Rogers cited data from investment firm Goldman Sachs that BTC is the best-performing asset in the world and announced that she launched a set of crypto bills.\n\n“Breaking: #Bitcoin is the best performing asset in the world this year according to data from Goldman Sachs.”\n\n\n\nLaunched my #Crypto bills today, as well as Photo Radar Prohibition, which included nearly all my Republican senator colleagues as cosponsors @JeffWeninger @JDMesnard pic.twitter.com/ueUeFSEybo — Wendy Rogers (@WendyRogersAZ) January 25, 2023\n\nOne of the proposed bills focuses on making BTC legal tender in the U.S. state. If passed into law, BTC will have the same status as the U.S. dollar, becoming an accepted medium of exchange for debt payment, public charges, taxes and dues in the state.\n\nIn 2022, the state senator also introduced a similar bill without success. Despite this, Rogers still continues efforts to push BTC forward in the state. In April 2022, Rogers spoke against central banks and voiced her support for Bitcoin. She tweeted:\n\nCentralized digital money controlled by the central bankers is slavery. Decentralized #Bitcoin is freedom. — Wendy Rogers (@WendyRogersAZ) April 2, 2022\n\nApart from this, Rogers also participated in introducing a bill that seeks to make crypto a tax-exempt property. If approved, voters can decide in 2024 if they want tokens that do not represent foreign currencies or the U.S. dollar to be exempt from taxes.\n\nRelated: US Senator Ted Cruz pushes for crypto in Congress ... using snacks\n\nOn Sept. 7, 2021, El Salvador officially made Bitcoin a legal tender in the country. More than a year later, making Bitcoin legal tender in the country proved beneficial. El Salvador experienced increased tourism in 2022, with 1.1 million people visiting the country in the first half of the year.\n\nOn Jan. 22, Brazil and Argentina announced preparations to create a common currency parallel to the Brazilian real and the Argentine peso. Responding to this, Coinbase CEO Brian Armstrong suggested that moving to Bitcoin may be the right “long-term bet” for both countries."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmludmVzdG1lbnRuZXdzLmNvbS9yZWd1bGF0aW9uLWFuZC1sZWdpc2xhdGlvbi9uZXdzL21vcmUtYWR2aXNvcnMtYXJlLWp1bXBpbmctb24tdGhlLWJpdGNvaW4tYmFuZHdhZ29uLTIzMzI2MNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "More advisors are jumping on the bitcoin bandwagon - InvestmentNews",
        "content": "The crypto winter, the term often used to describe the dramatic collapse in cryptocurrency prices over the past year, is apparently having little impact on financial advisors determined to ride the waves in the fast-evolving digital currency space.\n\nEven with bicoin, the best-known cryptocurrency, down nearly 65% from its peak of just over $65,000 in November 2021, the true believers are determined to focus on the long term.\n\nA report out Friday from Bitwise and VettaFi shows 60% of financial advisors are long-term bullish on crypto.\n\nPerhaps what makes the findings so surprising is that the research was conducted prior to the recent rally that’s seen the price of bitcoin jump nearly 40% over the past four weeks.\n\n“I was surprised by the findings; I thought the downturn would have scared off advisors,” said Todd Rosenbluth, director of research at VettaFi.\n\n“Advisors seem to be relatively loyal to the long-term view and potential benefits of crypto,” he added. “Usually when something sells off, people want to tell you they’re concerned. I think that bodes well for future crypto investing.”\n\nIf advisors are starting to show a new interest in crypto it could be, at least in part, to try and keep up with their clients. The survey showed that 14% of advisors say all of their clients are investing in crypto, which compares to 8% last year and 6% two years ago.\n\nForty-five percent of advisors said some of their clients are investing in crypto, which compares to 62% last year and 34% two years ago.\n\nWhen asked if they’re investing in crypto in their personal accounts, 37% of advisors said yes, which compares to 47% last year and 24% two years ago.\n\nWhen it comes to accessing crypto, exchange-traded funds have become the most popular avenue, even though U.S. regulators have not yet permitted funds that invest directly in the digital currency.\n\nWhen asked how they gain exposure for clients, 25% said they use ETFs that invest in crypto companies. The second most popular way of gaining exposure, at 17%, is directly investing in various cryptocurrencies.\n\n“I think ETFs are what advisors are most interested in because that’s what’s available,” said Rosenbluth.\n\nAs an example of the appeal of crypto, Rosenbluth referenced the ProShares Bitcoin Strategy ETF (BITO). At $786 million, BITO is the largest cryptocurrency ETF, and it had $161 million in net inflows last year despite recording a 64% decline. So far this year, the fund is up 41%, essentially tracking the price fluctuations of bitcoin.\n\nExtreme price volatility has become a trademark of cryptocurrencies, and some advisors have kept away for that reason. But after four peak-to-trough cycles over the past 12 years, even some naysayers are taking notice.\n\n“For the first time that I can recall, I came into 2023 being bullish on bitcoin,” said Paul Schatz, president of Heritage Capital.\n\nSchatz said his clients have shown little interest and he thinks the existing ETFs are “flawed and need more regulation,” but he likes the price patterns he sees.\n\n“I saw the downside as $14,000 to $15,000 and the upside to almost $30,000,” he said. “That’s pretty good risk-reward.”\n\nAt around $23,000, bitcoin is still well off its peak but the pattern moving toward the next reduction of the crypto payment awarded to miners of the digital currency in 2024 suggests another upcycle looming.\n\nRic Edelman, founder of the Digital Assets Council of Financial Professionals, said the price of bitcoin has eventually doubled every time the payment to miners has been cut in half, which is why he expects bitcoin’s price to reach $150,000 by the summer of 2025.\n\nOver its short history, since 2010, the price of bitcoin has suffered three negative years. But there have been big declines, including a 58% decline in 2014, a 73% decline in 2018, and a 65% decline in 2022.\n\nThe 11 positive years, meanwhile have ranged from 35% in 2015 to 9,900% in 2010.\n\nWith that in mind, it’s not a surprise that price volatility was listed among the top reasons advisors are avoiding crypto currencies.\n\nAsked about their reasons for not investing in crypto, 65% of advisors listed regulatory issues as a top concern, followed by price volatility at 51%."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vdGhlY29udmVyc2F0aW9uLmNvbS9iaXRjb2luLWhhcy1zaG90LXVwLTUwLXNpbmNlLXRoZS1uZXcteWVhci1idXQtaGVyZXMtd2h5LW5ldy1sb3dzLWFyZS1wcm9iYWJseS1zdGlsbC1haGVhZC0xOTg2ODLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin has shot up 50% since the new year, but here's why new lows are probably still ahead - The Conversation",
        "content": "To the delight of investors across the cryptosphere, the price of bitcoin (BTC) has rallied over 53% since its low of US$15,476 (£12,519) in November. Now trading around US$23,000, there’s much talk that the bottom has finally been reached for the leading cryptocurrency after a year of painful decline – in November 2021, the price peaked at almost US$70,000.\n\nIf so, it’s not only good news for bitcoin but the whole market in cryptocurrencies, since the others broadly move in line with the leader. So is crypto back in business?\n\nDotcom lessons\n\nThe past is littered with various periods of market turmoil, from the global financial crisis of 2007-09 to the COVID-19 collapse in 2020. But neither of these is a particularly good comparison for our purposes because they both saw sharp drops and recoveries, as opposed to the slow unwinding of bitcoin. A better comparison would be the dotcom bubble burst in 2000-02, which you can see in the chart below (the Nasdaq is the index that tracks all tech stocks).\n\nNasdaq 100 index 1995-2005\n\nLook at the bitcoin chart since it peaked in November 2021 and the price action looks fairly similar:\n\nBitcoin bear market price chart 2021-23\n\nBoth charts show that bear markets go through various periods where prices rise but don’t reach the same level as the previous peak – known as “lower highs”. If bitcoin is following a similar trajectory to the early 2000s Nasdaq, it would make sense that the current price will be another lower high and that it will be followed by another lower low.\n\nThis is partly because like the 2000s Nasdaq, bitcoin seems to be following a pattern known as an Elliott Wave. Named after the renowned American stock market analyst Ralph Nelson Elliott, this essentially argues that during a bear phase, investors shift between different emotional states of disappointment and hope, before they finally despair and decide the market will never turn in their favour. This is a final wave of heavy selling known as capitulation.\n\nYou can see this idea on the chart below, where bitcoin is the green and red line and Z is the potential capitulation point at around US$13,000 (click on the chart to make it bigger). The black line is the path that the Nasdaq took in the early 2000s. The blue pointing finger above that line is potentially the equivalent place to where the bitcoin price is now.\n\nBitcoin now vs Nasdaq in the early 2000s\n\nAuthor provided\n\nThe one other thing to note on the chart is the wavy line that’s moving horizontally along the bottom. This is the stochRSI or stochastic relative strength index, which is an indication of when the asset looks overbought (when the line is peaking) or oversold (when it’s bottoming).\n\nA sign of a coming shift is when the stochRSI moves in the opposite direction to where the price is heading: so now the stochRSI is coming down but the price has held up around US$23,000. This too suggests a fall could be imminent.\n\nThe game of wealth transfer\n\nWithin markets, there is often a game that investors from institutions such as banks and hedge funds play with amateur (retail) investors. The aim is to transfer retail investors’ wealth to these institutions.\n\nThis is particularly easy in an unregulated market like bitcoin, because it is easier for institutions to manipulate prices. They can also talk up (or talk down) prices to stir up retail investors’ emotions, and get them to buy at the top and sell at the bottom. This “traps” the irrational investors who buy at higher prices, transferring wealth by giving the institutions an opportunity to convert their holdings into cash.\n\nIt therefore makes sense to compare how the retail and institutional investors have been behaving lately. The following charts compare those crypto wallet addresses that hold 1 BTC or more (mostly retail investors) with those holding upwards of 1,000 BTC (institutional investors). In all three charts, the black line is the bitcoin price and the orange line is the number of wallets in that category.\n\nRetail investor behaviour\n\nInstitutional investor behaviour pt 1\n\nInstitutional investor behaviour pt 2\n\nThis shows that since the FTX scandal back in November, which led to the world’s second-largest crypto exchange collapse, retail investors have been buying bitcoin aggressively, resulting in the highest number of addresses holding at least one BTC ever. On the other hand, the biggest institutional investors have been offloading. This suggests that the institutional investors agree with our analysis.\n\nWhere we’re heading\n\nThere are those who argue that bitcoin is a bubble and that ultimately cryptocurrencies are worthless. That’s a separate debate for another day. If we assume there is a future for blockchains, which are the online ledgers that enable cryptocurrencies, the key question is when bitcoin will reach the accumulation phase that typically ends a bear phase in any market.\n\nKnown as Wyckoff accumulation, this is where the price of the asset repeatedly tests two areas: the upper bound where traders previously sold heavily enough for the price to stop rising (known as resistance), and the lower bound where traders bought heavily enough that the price stopped going down (known as support).\n\nAt the point where institutional investors decide the lower bound has proved to be sufficiently resilient – in other words, they think the price is cheap at that level – they will start buying the asset again. That moment is only likely to come after there has been a capitulation.\n\nOf course, history does not repeat itself exactly. It may be this is the first time that retail investors have outsmarted the large institutions, and that the only way is now up.\n\nMore likely, however, there is more pain on the way. With a recession on the cards, unprecedented job layoffs and weak retail data coming out of the US, it doesn’t point to the kind of optimism that tends to move markets higher. It would therefore make sense to brace yourself for another plunge in the price of bitcoin and the rest of the crypto market."
    }
]