[
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2JpdGNvaW4tbG9ncy1vdmVyLTctbGFraC10cmFuc2FjdGlvbnMtaW4tc2luZ2xlLWRheS1hZnRlci1hbG1vc3QtdHdvLXllYXJzLWRhdGEvYXJ0aWNsZXNob3cvMTAzODE0NjQ3LmNtc9IBmQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2JpdGNvaW4tbG9ncy1vdmVyLTctbGFraC10cmFuc2FjdGlvbnMtaW4tc2luZ2xlLWRheS1hZnRlci1hbG1vc3QtdHdvLXllYXJzLWRhdGEvYW1wX2FydGljbGVzaG93LzEwMzgxNDY0Ny5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin logs over 7 lakh transactions in single day after almost two years: Report - The Economic Times",
        "content": "Find this comment offensive?\n\nChoose your reason below and click on the Report button. This will alert our moderators to take action\n\nName\n\nReason for reporting:\n\nFoul language\n\nSlanderous\n\nInciting hatred against a certain community"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA5LTIwL2Zvcm1lci1iMmMyLWNlby1jYXVnaHQtdXAtaW4tcGFydHlpbmctY2xhaW1zLWF0LWNyeXB0by1jb25mZXJlbmNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "Ex-Crypto CEO Caught Up in Partying Claims at Bitcoin Conference - Bloomberg",
        "content": "A former Wall Street trader who became the head of a major crypto company has been caught up in allegations about drug use and his relationship with a 19-year-old intern at a Bitcoin conference last year as part of a lawsuit filed by a former colleague.\n\nPhillip Gillespie , 40, the former co-chief executive officer of B2C2, was accused of excessive drinking, taking cocaine and hallucinogens, as well as giving the drugs to others, including the intern. The allegations surfaced in a Sept. 1 lawsuit in New Jersey against B2C2 by its former global head of options trading, Bradley Nagela, who said he was fired in retaliation for raising concerns about Gillespie’s behavior."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9qYXBhbi1sYXJnZXN0LWludmVzdG1lbnQtYmFuay1ub211cmEtMDcwODA1NDg1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "Japan's Largest Investment Bank Nomura Launches Bitcoin Adoption Fund - Yahoo Finance",
        "content": "Japan’s Largest Investment Bank Nomura Launches Bitcoin Adoption Fund\n\nNomura Is Launching A Bitcoin Adoption Fund\n\nLaser Digital Asset Management, a subsidiary of the largest Japanese investment bank Nomura, has launched the Bitcoin Adoption Fund, the first in a series of digital adoption investment options. The fund offers \"long-only exposure to Bitcoin (BTC)\" and is a segment of Laser Digital Funds Segregated Portfolio Company. The aim of the fund is to provide institutional investors with a secure path into digital asset investment. Nomura Holdings is a $500 billion financial giant that provides brokerage, investment banking, and asset management services.\n\nThe Bitcoin Adoption Fund is designed to entice institutional investors to invest in Bitcoin. It will allow institutional investors to gain exposure to Bitcoin without having to hold the cryptocurrency directly. The fund is expected to attract a wide range of institutional investors, including pension funds, endowments, and family offices.\n\nNomura's move to launch a Bitcoin Adoption Fund comes as more institutional investors are showing interest in cryptocurrencies. The fund is expected to capitalize on the growing demand for Bitcoin among institutional investors. The launch of the fund is also seen as a significant step towards the mainstream adoption of cryptocurrencies.\n\nThe Bitcoin Adoption Fund is the latest in a series of moves by Nomura to expand its presence in the cryptocurrency market. In 2022, Nomura acquired a stake in a cryptocurrency exchange, and in 2023, it launched a cryptocurrency custody service. The launch of the Bitcoin Adoption Fund is expected to further strengthen Nomura's position in the cryptocurrency market.\n\nLaser Digital has picked Komainu as the fund's regulated custody partner. The Bitcoin Adoption Fund is a mutual fund registered in the Cayman Islands. Nomura has been an active participant in the digital asset ecosystem, establishing a digital asset venture capital arm in 2022 and acquiring a license from Dubai's Virtual Asset Regulatory Authority.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yaXNlcy1hYm92ZS0yNzAwMC1haGVhZC1vZi1mZWQtZGVjaXNpb24tb24tcmF0ZXMvYXJ0aWNsZXNob3cvMTAzODA1MzQwLmNtc9IBnAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yaXNlcy1hYm92ZS0yNzAwMC1haGVhZC1vZi1mZWQtZGVjaXNpb24tb24tcmF0ZXMvYW1wX2FydGljbGVzaG93LzEwMzgwNTM0MC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $27,000 ahead of Fed decision on rates - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe crypto tokens were trading mixed in Wednesday's trade ahead of the US Federal Reserve's interest rate decision. Bitcoin, XRP, Toncoin, Solana and Polygon were trading with gains, while BNB Dogecoin , and Litecoin were trading with cuts.Bitcoin (BTC) rose 0.92% to $27,044, whereas Ethereum (ETH) was above the 1,600 level. Meanwhile, the global cryptocurrency market cap was trading higher, around $1.07 trillion, rising 0.62% in the last 24 hours.\"Bitcoin's price has surged beyond the $27,000 threshold, and this upward trajectory could likely be attributed to Nomura, one of Japan's leading investment banks, unveiling a Bitcoin-based fund designed for institutional investors,\" said Edul Patel, CEO & Co-founder of Mudrex.Market sentiment currently varies from neutral to bullish as market participants await the Federal Reserve's FOMC decision regarding interest rates, set to be announced later today, Edul said.The total volume in DeFi is currently $2.23 billion, 7.94% of the total crypto market 24-hour volume. The volume of all stablecoins is now $25.78 billion, which is 91.89% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $527 billion. Bitcoin's dominance is currently 49.16%, according to CoinMarketCap.Meanwhile, BTC volume stood at approximately $14.5 billion, falling 3.86% in the last 24 hours.Bitcoin recently broke the long-term resistance at $26,800, attributed to the “double top” pattern seen in the 4-hour period. This breach also marked a successful breakout of the previous downtrend line, signaling the potential for a continued bullish trend.A dominant bullish candle on the 4-hour chart suggests strong bullish momentum with an immediate resistance or target around $27,500 and the possibility of testing $27,900 if the momentum holds. A sustained upside run could push Bitcoin to the $28,800 level and beyond.Critical support now lies at $26,800, once a resistance level, with potential secondary support at $26,300. Vigilance at $26,800 is essential; staying above is bullish, while falling below may require caution and consideration of short positions.: Quick Glance (Source: coinmarketcap.com, data as of 11.50 hours, IST on September 20, 2023)Bitcoin $27,044 0.94%Ethereum $1,634 -0.02%Tether $1 0.01%BNB $216 -0.08%XRP $0.5188 2.05%Cardano $0.2536 -0.02%Dogecoin $0.06233 0.13%Toncoin $2.52 3.68%Solana $19.92 0.56%Polygon $0.5399 2.22%Litecoin $66.53 -0.82%Polkadot $4.12 0.21%Tron $0.08438 0.10%Shiba Inu $0.00000738 1.40%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy90b25jb2luLWxlYWRzLXRvcC0xMC1jcnlwdG9zLTEwMDkxMTU3OC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 20 Sep 2023 07:00:00 GMT",
        "title": "Toncoin leads top 10 cryptos with weekly gain of 31%, could Bitcoin rise to US$30,000 by October? - Yahoo Finance",
        "content": "Toncoin led gainers in the top 10 cryptocurrencies by market capitalization, rising over 31% since its Telegram partnership last week. Despite Bitcoin’s short-term corrections, it could return above the US$30,000 support level by October, according to market experts.\n\nSee related article: Weekly Market Wrap: Deutsche Bank’s crypto move propels Bitcoin to US$26,750\n\nTON leads winners, Bitcoin could return to US$30,000 by October\n\nToncoin was the day’s biggest gainer in the top 10 cryptocurrencies, rising 4.36% in the 24 hours leading up to 4:30 p.m. in Hong Kong, to US$2.54. The token rose 31.34% in the past week, having gained significant traction since Telegram announced its partnership with Toncoin last week.\n\nIn the wider crypto market, Bitcoin rose 0.76% in the past 24 hours to US$27,144.\n\n“The crypto market recovery started at the beginning of this year, and Bitcoin, the primary market indicator, is up more than 60% year-to-date. Short-term price fluctuations of Bitcoin do not change the fact it’s been the best-performing asset of the year,” Alex Konanykhin, the chief executive officer and founder of Unicoin, an equity-backed crypto that pays dividends, told Forkast.\n\n“I’m optimistic about its chances of returning to the US$30,000+ territory by October, as many financial executives are now back from their summer vacations and are exploring ways to benefit from the ongoing crypto rally.”\n\nEther, the world’s second-largest cryptocurrency, fell 0.27% to change hands at US$1,635, bringing its weekly gains to 2.69%.\n\nThe total crypto market capitalization over the past 24 hours rose 0.6% to US$1.07 trillion while market volume decreased 3.2% to US$28.73 billion, according to CoinMarketCap data.\n\nGods Unchained Cards lose steam, Mutant Ape Yacht Club sales rise 75%\n\nThe Forkast 500 NFT index rose 0.31% to 2,016.30 points in the 24 hours to 4:30 p.m. in Hong Kong but fell 2.75% during the week.\n\nImmutableX fell to become the sixth-largest blockchain network by 24-hour NFT sales volume, from yesterday’s second place, after sales fell 8.44% to US$988,910. Sales for Gods Unchained Cards also fell 58.73% to US$498,334, becoming the third-largest collection by daily sales across all chains, according to CryptoSlam.\n\nStory continues\n\nEthereum’s 24-hour NFT sales also fell 0.42% to US$5.15 million, as sales for the Bored Ape Yacht Club increased 10% to US$569,402, making it the second-largest NFT collection across all blockchains by 24-hour sales volume. Sales for its twin collection, the Mutant Ape Yacht Club, increased 75.35% to US$405,676\n\n“A large Bored Ape sale hit the blockchain yesterday with BAYC #3149 selling for US$221,000. This just shows that some collectors are still finding value even at high prices in the NFT world,” said Yehudah Petscher, NFT Strategist at Forkast Labs.\n\nMirroring the sales decrease, the Forkast ETH NFT Composite rose 0.06% during the day.\n\nAsian equities decline, U.S. equities rise ahead of Fed interest rate decision\n\nImage: elements.envato\n\nMajor Asian equities fell as of 4:30 p.m. in Hong Kong, including the Shanghai Composite, the Shenzhen Component, Japan’s Nikkei 225 and Hong Kong’s Hang Seng Index that neared a month low.\n\nInvestors remained focused on the U.S. Federal Reserve’s two-day policy meeting that started yesterday. The CME FedWatch Tool predicts a 99% chance the central bank will keep the current rate unchanged in September, up from 96% one week ago. Rates are now at a 22-year high of 5.25%-5.5%.\n\nExpecting a rate hike pause, major U.S. stock futures rose for a third consecutive day, including the S&P 500 futures index, the tech-heavy Nasdaq-100 futures and the Dow Jones Industrial Average futures.\n\nMarkets are also awaiting Fed Chair Jerome Powell’s remarks that will accompany the interest rate decision, which could offer clues on the central bank’s future monetary policy decisions.\n\nOver in Europe, the benchmark STOXX 600 rose 0.61% and Frankfurt’s DAX 40 rose 0.57% during the day, reacting to data that showed German producer prices falling 12.6% in August, the largest decline on record, due to the falling energy prices.\n\nSee related article: Binance.US cuts manpower, FTX liquidates crypto as people throng to TOKEN 2049\n\nUpdates with equities"
    }
]