[
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTI4L2JpdGNvaW4tYnRjLXJhbGx5LWlzLW5lY2Vzc2FyeS1mb3ItY3J5cHRvLW1pbmVycy1wb3N0LTIwMjMtcTHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Rally Is Necessary for Crypto Miners Post 2023 Q1 - Bloomberg",
        "content": "Bitcoin ’s new year rally is resuscitating many crypto-mining companies seeking to escape from near financial ruin after one of the most devastating quarters ever for the nascent industry. Whether they succeed in making a comeback remains in question.\n\nHigh electricity costs, a plunge in digital assets prices and persistent network competition in the fourth quarter slashed mining profit margins and made it difficult for miners to stay afloat. Core Scientific Inc., the largest public Bitcoin mining company by computing power, went bankrupt and multiple major miners warned of liquidity crunches. While struggling miners have garnered some relief from Bitcoin’s 40% rebound this year, they are still under financial pressure."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTI4L2JpdGNvaW4tYnRjLXJhbGx5LWlzLW5lY2Vzc2FyeS1mb3ItY3J5cHRvLW1pbmVycy1wb3N0LTIwMjMtcTHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Rally Is Necessary for Crypto Miners Post 2023 Q1 - Bloomberg",
        "content": "Bitcoin ’s new year rally is resuscitating many crypto-mining companies seeking to escape from near financial ruin after one of the most devastating quarters ever for the nascent industry. Whether they succeed in making a comeback remains in question.\n\nHigh electricity costs, a plunge in digital assets prices and persistent network competition in the fourth quarter slashed mining profit margins and made it difficult for miners to stay afloat. Core Scientific Inc., the largest public Bitcoin mining company by computing power, went bankrupt and multiple major miners warned of liquidity crunches. While struggling miners have garnered some relief from Bitcoin’s 40% rebound this year, they are still under financial pressure."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDIvMjgvYml0Y29pbi1ldGhlci1vbi10cmFjay1mb3ItYS1wb3NpdGl2ZS1mZWJydWFyeS1kZXNwaXRlLWZhZGluZy0yMDIzLXJpc2stcmFsbHkuaHRtbNIBdmh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzAyLzI4L2JpdGNvaW4tZXRoZXItb24tdHJhY2stZm9yLWEtcG9zaXRpdmUtZmVicnVhcnktZGVzcGl0ZS1mYWRpbmctMjAyMy1yaXNrLXJhbGx5Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin, ether on track for a positive February despite mid-month drop and fading 2023 risk rally - CNBC",
        "content": "Bitcoin and ether are on pace for a modest February win, even after suffering a big drop earlier in the month.\n\nBitcoin had eked out a 0.2% gain for the month by 4:15 p.m. ET, according to Coin Metrics. In January bitcoin posted a 38% rise and its best month since 2021. Meanwhile, ether had risen higher by 1.7%, following a January gain of 31%. Unlike traditional markets, the crypto market remains open 24 hours a day, even on weekends and public holidays.\n\nInvestors were spooked earlier in the month after what appeared to be the beginning of a potential regulatory crackdown on crypto businesses in the U.S. — including the Securities and Exchange Commission's enforcement action against Kraken, its Wells Notice of a future settlement against Paxos and the New York State Department of Financial Services' ordering Paxos to stop minting the Binance USD (BUSD) stablecoin.\n\nThat led to a brief sell-off in crypto assets that took bitcoin and ether down about 6% and 8.5%, respectively, in the three-day period ended Feb. 10. Although they quickly recovered those losses the following week, they've been in a bit of a lull since.\n\n\"It's pretty easy to say that the lows are behind us because there really isn't any disparate further selling, but in terms of what actually takes us higher – that's harder,\" said Jeff Dorman, chief investment officer at Arca.\n\n\"Most of the negative news right now is coming out of regulators, but it's just not really having any long-term effect on the market because everything in crypto has perfect substitutes,\" he added, meaning when certain crypto companies in the past have been hit by regulators, traders have always been able to move their activity somewhere else.\n\nWhile regulatory scrutiny is ramping in the U.S., reports that Hong Kong is planning to legalize retail crypto trading as part of a bigger push to become a global crypto hub surfaced this month, with a quiet backing from China. The move has been a positive catalyst for crypto.\n\nIn the U.S., however, investors are on Fed watch, said James Lavish, managing partner at the Bitcoin Opportunity Fund.\n\n\"Bitcoin has been the tip of the spear for risk assets for a long time,\" he said. \"It's what moves first typically when you're talking about either buying or selling risk assets as part of your portfolio allocation and when we do in fact have a Fed pivot I expect that bitcoin is going to sniff that out first. It's going to have a strong move.\""
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDIvMjgvYml0Y29pbi1ldGhlci1vbi10cmFjay1mb3ItYS1wb3NpdGl2ZS1mZWJydWFyeS1kZXNwaXRlLWZhZGluZy0yMDIzLXJpc2stcmFsbHkuaHRtbNIBdmh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzAyLzI4L2JpdGNvaW4tZXRoZXItb24tdHJhY2stZm9yLWEtcG9zaXRpdmUtZmVicnVhcnktZGVzcGl0ZS1mYWRpbmctMjAyMy1yaXNrLXJhbGx5Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin, ether on track for a positive February despite mid-month drop and fading 2023 risk rally - CNBC",
        "content": "Bitcoin and ether are on pace for a modest February win, even after suffering a big drop earlier in the month.\n\nBitcoin had eked out a 0.2% gain for the month by 4:15 p.m. ET, according to Coin Metrics. In January bitcoin posted a 38% rise and its best month since 2021. Meanwhile, ether had risen higher by 1.7%, following a January gain of 31%. Unlike traditional markets, the crypto market remains open 24 hours a day, even on weekends and public holidays.\n\nInvestors were spooked earlier in the month after what appeared to be the beginning of a potential regulatory crackdown on crypto businesses in the U.S. — including the Securities and Exchange Commission's enforcement action against Kraken, its Wells Notice of a future settlement against Paxos and the New York State Department of Financial Services' ordering Paxos to stop minting the Binance USD (BUSD) stablecoin.\n\nThat led to a brief sell-off in crypto assets that took bitcoin and ether down about 6% and 8.5%, respectively, in the three-day period ended Feb. 10. Although they quickly recovered those losses the following week, they've been in a bit of a lull since.\n\n\"It's pretty easy to say that the lows are behind us because there really isn't any disparate further selling, but in terms of what actually takes us higher – that's harder,\" said Jeff Dorman, chief investment officer at Arca.\n\n\"Most of the negative news right now is coming out of regulators, but it's just not really having any long-term effect on the market because everything in crypto has perfect substitutes,\" he added, meaning when certain crypto companies in the past have been hit by regulators, traders have always been able to move their activity somewhere else.\n\nWhile regulatory scrutiny is ramping in the U.S., reports that Hong Kong is planning to legalize retail crypto trading as part of a bigger push to become a global crypto hub surfaced this month, with a quiet backing from China. The move has been a positive catalyst for crypto.\n\nIn the U.S., however, investors are on Fed watch, said James Lavish, managing partner at the Bitcoin Opportunity Fund.\n\n\"Bitcoin has been the tip of the spear for risk assets for a long time,\" he said. \"It's what moves first typically when you're talking about either buying or selling risk assets as part of your portfolio allocation and when we do in fact have a Fed pivot I expect that bitcoin is going to sniff that out first. It's going to have a strong move.\""
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG8tZW5kcy1mZWJydWFyeS1mbGF0LWFzLTIwMjMtcmFsbHktc3RhbGxzLTIzMDAwMTAyNi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Feb 2023 08:00:00 GMT",
        "title": "Crypto ends February flat as 2023 rally stalls - Yahoo Finance",
        "content": "Cryptocurrencies closed out February largely unchanged as an enthusiastic rally to kick off 2023 stalled in the year's second month.\n\nIn February, ether (ETH-USD), the market's second-largest cryptocurrency, outpaced its larger peer bitcoin (BTC-USD) rising 1.6% against bitcoin's more modest 0.4% increase during the month. In January, bitcoin gained nearly 40% to record its best start to a year since 2013.\n\nChristopher Newhouse, a crypto options trader with GSR, said the February action in bitcoin was \"definitely more boring for directional trading than in January.\"\n\nAs Newhouse explained, crypto derivatives trading volume remained high in February but volatility fizzled over the month. Bitcoin is still the most popular cryptocurrency for traders, but in recent weeks those bets \"toward the end of the month have been mixed or slightly bearish.\"\n\nOver the same period, the major U.S. indexes were lower, with the benchmark S&P 500 (^GSPC) falling 2.5% during the month.\n\n\"Only short-term interest in Bitcoin was tepid,\" Michael Safai, co-founder and partner of crypto trading firm, Dexterity Capital told Yahoo Finance. Safai pointed to U.S. regulatory crackdowns over recent weeks as another reason investors may be taking a more cautious approach to cryptocurrencies.\n\nIn an annual report filed Monday afternoon, Robinhood (HOOD) shared the latest regulatory probe, alerting investors that the SEC subpoenaed the company in December to inquire about how it lists and holds cryptocurrencies in custody.\n\n\"There's still optimism that things will start to get figured out in the coming months,\" Safai added, pointing to longer-dated bitcoin call options placed this month with a strike price of $30,000.\n\nSince the beginning of 2023, bitcoin watchers have focused closely on whether bitcoin's price can breach $25,000. Between February 19-20, the level was briefly reached. Bitcoin has since fallen more than 6% and is currently changing hands near $23,200.\n\nStory continues\n\n“Bitcoin is comfortably in a trading range and that might be the case for a while longer,” said Edward Moya, senior analyst with Oanda.\n\nBased on historical data compiled by Yahoo Finance, in March bitcoin has shown a positive return in only three of the past nine years. On average, the coin has shown a loss of approximately 5.3%\n\nA man wears a t-shirt with the logo of Bitcoin as he waits for Sam Bankman-Fried, the founder and former CEO of crypto currency exchange FTX, to attend a hearing at the Magistrate Court building in Nassau, Bahamas December 19, 2022. REUTERS/Marco Bello (Marco Bello / reuters)\n\nMeanwhile, interest in ether over bitcoin (ETH-BTC), which serves as an indicator for general risk-taking within the crypto market, has steadily picked up in recent weeks.\n\nEthereum is also drawing more attention as it nears its next protocol upgrade slated for early April.\n\n\"Generally, Ethereum has underperformed over the last six weeks,\" strategists at Fundstrat said in a note on Monday. \"This looks to be changing.\"\n\nClick here for the latest crypto news, updates, values, prices, and more related to Bitcoin, Ethereum, Dogecoin, DeFi and NFTs\n\nRead the latest financial and business news from Yahoo Finance\n\nDownload the Yahoo Finance app for Apple or Android\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and YouTube"
    }
]