[
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWV5ZXMtMjJrLXJlYm91bmQtd2l0aC1idGMtbWFya2V0LXN0cnVjdHVyZS1ub3QteWV0LWJyb2tlbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price eyes $22K rebound with BTC market structure 'not yet broken' - Cointelegraph",
        "content": "Bitcoin (BTC) edged closer to $22,000 over the weekend as traders and analysts urged caution on overly bearish sentiment.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nAnalyst dismisses “hysterical” crypto sentiment\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD seeing small spurts higher into Feb. 12.\n\nAfter hitting three-week lows the week prior, Bitcoin was a target for opportunistic whales, on-chain analytics resource Material Indicators explained.\n\nUploading a chart from the BTC/USD order book on Binance, Material Indicators captured resistance shifting higher, with the potential uptick in spot price offering a more advantageous selling level for large-volume players.\n\n“FireCharts shows Crypto Weekend whales seem interested in trying to exploit the upside illiquidity in the Bitcoin order book to sell higher. Personally, I’m fine with that,” part of the accompanying comments read.\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\nThe week’s lows meanwhile saw moderate reactions from market participants, some of whom pushed back against calls for a mass capitulation event on short timeframes.\n\n“CT hysterical about bear market when BTC hasn’t retested a major fib or moving average which were busted after 3 waves up,” Filbfilb, co-founder of trading suite DecenTrader, argued on the day.\n\nPopular trader Crypto Tony was similarly cool on current price action.\n\n“I am short as per my updates while we reside below the main resistance zone below $22,400 - $22,600. Overall i could see another tap of the highs if we can hold above $20,300 overall,” he reasoned.\n\n“Market structure is not yet broken to the downside just yet.”\n\nBTC/USD annotated chart. Source: Crypto Tony/ Twitter\n\nCPI leads important macro data week\n\nAhead of the weekly close, others were already focusing on next week’s macroeconomic data as the next potential volatility catalyst.\n\nRelated: Bitcoin is already in its ‘next bull market cycle’ — Pantera Capital\n\nThe Consumer Price Index (CPI) print for January, due on Feb. 14, forms the headline event out of several in the United States this month.\n\n“Big week ahead of us,” Cointelegraph contributor Michaël van de Poppe, founder and CEO of trading firm Eight, summarized, noting retail sales, Empire State Manufacturing Index and Producer Price Index due during the week.\n\n“My thoughts are that we’re likely to see inflation continue to fall and fall steeply. Gas prices have been dropping like a stone also, and this drop -> markets up,” he added.\n\nMaterial Indicators agreed, saying it was “Expecting volatility to continue through Tuesday’s CPI Report.“\n\nConsumer Price Index (CPI) chart. Source: Bureau of Labor Statistics\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wdWJsaWMtbWluZXJzLWluY3JlYXNlZC1iaXRjb2luLXByb2R1Y3Rpb24taGFzaC1yYXRlLWluLWphbnVhcnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Feb 2023 08:00:00 GMT",
        "title": "Public miners increased Bitcoin production, hash rate in January - Cointelegraph",
        "content": "The first production update of 2023 from publicly listed Bitcoin (BTC) mining companies shows a steady increase in hash rate and a surge in BTC production compared to the previous month, according to a new analysis from Hashrate Index.\n\nThe majority of public miners increased their bitcoin production in January, with CleanSpark boosting it by 50%, reaching a record monthly production of 697 Bitcoins. Leading the BTC production, Core Scientific reached 1,527 coins mined in January, followed by Riot, the second-biggest producer, mining 740 Bitcoins in the month.\n\nMarathon and Cipher have seen significant increases in Bitcoin production, reaching 687 and 343 Bitcoins generated, respectively, compared to 475 and 225 in December.\n\nPublic Miners: Monthly Bitcoin Production. Source: Hashrate Index and Luxor\n\nAccording to Bitcoin mining analyst Jaran Mellerud, better weather conditions in January and stable electricity prices helped miners boost production. “In December, a winter storm swept the North American continent and led to surging electricity prices that periodically forced many of these companies to curtail operations. With the weather more benevolent in January, electricity prices stabilized, and miners were able to achieve a higher up-time.”\n\nHash rate increased for most public miners in January, but at a slower pace than expected. The exception is Texas-based Cipher, which boosted its hash rate by more than 50%, with a 4.3 EH/s. “Cipher has been building hard during this bear market, and I expect the company to reach its hashrate goal of 6 EH/s of self-mining capacity by the end of Q1 2023,” wrote Mellerud.\n\nCleanSpark also grew its hash rate to 6.6 EH/s from 6.2 EH/s in December, following a series of acquisitions in late 2022. Hive also recorded growth in January, with its hash rate increasing by nearly 30%, from 2.1 to 2.7 EH/s. “The company keeps replacing its GPU fleet with ASICs, primarily with its in-house designed Buzzminers,” Mellerud said of Hive.\n\nPublic Miners: Self-Mining Hashrate. Source: Hashrate Index and Luxor\n\nCore Scientific also continued growing its hash rate, reaching 17 EH/s in January from 15.7 in December. The figures, however, are expected to be impacted by the company's bankruptcy proceedings, which include a deal with the New York Digital Investment Group (NYDIG) to pay off an outstanding debt of $38.6 million by handing over more than 27,000 mining machines used as collateral - representing 18% of Core Scientific rigs.\n\nCore Scientific filed for Chapter 11 bankruptcy on Dec. 21, seeking to reorganize its debts after months of financial distress due to increased electricity costs and low Bitcoin prices.\n\nMellerud also pointed out that “these companies have, on several occasions, extended the timeline of their lofty hashrate expansion goals. Most of them have plans to drastically increase their operating hashrate by the end of Q2 this year. At the current rate, most of them will likely have to push their expansion plans further into the future.”"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3Lm5mdGN1bHR1cmUuY29tL25mdC1uZXdzL2VtYmxlbS12YXVsdC1iaXRjb2luLW5mdHMtbWFkZS1lYXN5L9IBTmh0dHBzOi8vd3d3Lm5mdGN1bHR1cmUuY29tL25mdC1uZXdzL2VtYmxlbS12YXVsdC1iaXRjb2luLW5mdHMtbWFkZS1lYXN5Lz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Feb 2023 08:00:00 GMT",
        "title": "Emblem Vault: Bitcoin NFTs made easy - NFT Culture",
        "content": "The creation of Emblem Vault in 2020 has opened up a world of possibilities for Bitcoin NFTs, making it easier to trade and build a strong digital portfolio. In this article, we will explore the benefits of using Emblem Vault and why it is set to revolutionize the world of NFTs.\n\nFirst, let’s understand what Emblem Vault is. It is a tokenized multi-asset wallet on the Ethereum blockchain that allows you to trade portfolios of NFTs and cryptocurrencies, including assets from different chains, as a single token. The vault is created as a unique ERC-721 token, and each vault contains a series of blockchain addresses generated from a single secret phrase. This means that you can store various digital assets in each address and only the person with the secret phrase can send assets to other wallets.\n\nBenefits of Emblem Vault for BTC NFTs\n\nOne of the key benefits of Emblem Vault is the ability to create a value-backed digital vault. This means you can store one or more digital assets, along with some cryptocurrency, in a single vault, making it easier to manage your digital assets. This is especially useful for individuals who want to keep their digital assets safe and secure.\n\nAnother benefit of Emblem Vault is the ability to create tradeable portfolios. This allows you to combine multiple assets into a single token, making it easier to trade and manage your portfolio. For example, you can create a portfolio that contains 50% ETH, 40% Bitcoin, and 10% LINK, and trade all these assets as a single ERC-721 NFT. This simplifies the process of managing your digital assets and makes it easier to keep track of your investments.\n\nEmblem Vault also enables you to create portable liquidity pools. This means you can create a vault with multiple pooled tokens to make transferable liquidity pools, as well as transparent funds. You can do this because Emblem Vault enables you to create a vault that is held by a community or other trusted third parties. This can be especially useful for individuals or organizations looking to pool their resources and invest in digital assets together.\n\nIn addition, Emblem Vault works by wrapping digital assets to make them modern ERC-721 NFTs, which can be traded on popular NFT marketplaces like OpenSea. This means that you can buy and sell assets that predate the ERC-721 standard, such as Rare Pepe’s. This opens up a world of possibilities for those looking to invest in NFTs and allows you to trade assets that were previously difficult to buy and sell.\n\nFurthermore, Emblem Vault is user-friendly and easy to use. To create your own vault, simply go to Emblem.Finance, select Create, connect the wallet you would like to use, and then add a name and description. You can also buy and sell Emblem Vault NFTs on popular platforms such as OpenSea, LooksRare, and their official website.\n\nEmblem Vault is set to revolutionize the world of NFTs by making it easier to trade and manage digital assets. With its ability to create value-backed digital vaults, tradeable portfolios, and portable liquidity pools, it offers a range of benefits to individuals and organizations looking to invest in digital assets. Its user-friendly interface and the ability to wrap digital assets to make them tradable on popular NFT marketplaces make it a game-changer in the world of NFTs. If you’re looking to invest in NFTs, it’s definitely worth considering Emblem Vault."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91bmRlcnN0YW5kaW5nLWNyeXB0by1iYWctaG9sZGVycy1hbmQtdGhlaXItbWluZHNldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Feb 2023 08:00:00 GMT",
        "title": "Understanding crypto bag holders and their mindset - Cointelegraph",
        "content": "For the first time in centuries, paper money, or fiat, found its true competition in the internet era. When Bitcoin (BTC) debuted in 2009, the fiat ecosystem was not only challenged with proving its worth in day-to-day transactions but also safekeeping the investment ecosystem it helped build.\n\nOver the years, the crypto ecosystem attracted people from all walks of life, serving their unique financial needs while filling the gaps left wide open by the fiat ecosystem. While most of the world watched from the sidelines — trying to decipher the true potential of cryptocurrencies — the first batch of Bitcoin millionaires swayed investors’ attention toward the budding ecosystem.\n\nThe freedom to stick to what makes the most sense financially sprouted various classes of investors, each distinguished by their intent behind crypto investments. Based on the overall approach taken by investors, there are four main categories of mindsets of crypto bag holders: maximalists, hodlers, fomoers and traders.\n\nMaximalists\n\nFrom the day Bitcoin showcased its cross-border supremacy after being used as a currency on the dark web, numerous investors witnessed a true peer-to-peer monetary system for the first time. What followed was a pledge to stick with Bitcoin and see it overpower the centralized entities, bringing power back into the hands of the people.\n\nThis total support for Bitcoin and the belief that BTC is the only true replacement for the fiat economy gave birth to the term Bitcoin maximalism. Bitcoin maximalists have, time and again, advised the community members to hodl their assets during the bear market. They often recommend buying the dip — a process that involves investing in crypto during the market’s poor performance. And over the last decade, the recommendation checks out.\n\n#Bitcoin is a swarm of cyber hornets serving the goddess of wisdom, feeding on the fire of truth, exponentially growing ever smarter, faster, and stronger behind a wall of encrypted energy. — Michael Saylor⚡️ (@saylor) September 18, 2020\n\nHowever, maximalism is not limited to Bitcoin. It has spread widely across other crypto ecosystems too. Investors and crypto enthusiasts that have committed years to the growth of their preferred blockchains and cryptocurrencies have a belief pattern similar to Bitcoin maxis. Ether (ETH), Dogecoin (DOGE), Shiba Inu (SHIB) and XRP (XRP) are the few leading cryptocurrencies that have garnered loyal maximalists over the years that continue to preach the strength of their respective tokens.\n\nHODLers\n\nHodlers are the type of crypto investors that believe in making long-term investments. This type of investor does not fear the infamous volatile market fluctuations and instead focuses on accumulating cryptocurrency tokens over time.\n\nHodlers can be found across all crypto ecosystems and are known to be the most resilient of the bunch. For new Bitcoiners, the dream behind hodling is to accumulate at least one BTC over time. Through many halving cycles and the resultant scarcity, Bitcoin hodlers envision a future when their investments shell out a return unimaginable in a traditional fiat setting.\n\nThis dream seems more attainable for other cryptocurrencies considering that investors can accumulate a big bag of tokens using comparatively lower funds. Some millennials and generation z’ers prefer purchasing thousands of meme tokens in the hopes of hitting the jackpot during bull markets.\n\nFOMOers\n\nFomoers are a subset of investors that end up making the biggest mistakes in investing. Fomo is an abbreviation of “fear of missing out,” implying a feeling of apprehension related to price movements.\n\nFomoers tend to react adversely to every market condition. When the price of cryptocurrencies goes up, these investors purchase more tokens hoping that the prices will continue to rise. However, this approach does not always yield fruitful results. As a result, they often end up buying the top and selling the bottom.\n\nRelated: Is it possible to achieve financial freedom with Bitcoin?\n\nTo get out of this mindset, one needs to study the market extensively while putting aside the noise of misinformation. Moreover, prominent crypto entrepreneurs often recommend against fomo-ing and ask the general public to focus on the bigger picture.\n\nTraders\n\nThese are the most straightforward investors that primarily focus on day-to-day prices in search of opportunities to earn profits. Traders closely monitor market sentiment, new developments and regulations to gauge how the markets react.\n\nRegardless of the prices going up or down, traders are ready to cash in on the market fluctuations by longing or shorting trades. The need for liquid tokens for trading requires traders to store a significant amount of their assets on crypto exchanges. However, the FTX fiasco of 2022 is a reminder that self-custody is the ideal way of storing cryptocurrencies.\n\nIn reality, every type of crypto holder can potentially make a lot of money buying and selling cryptocurrencies if they know the real strategy. Check out how Cointelegraph Markets Pro members managed to make 120x returns with the help of advanced machine learning algorithms and news indicators for trade opportunities."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vZGFpbHljb2luLmNvbS9taWNyb3N0cmF0ZWd5LWJpdGNvaW5zLXdoaXRlLWtuaWdodC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Feb 2023 08:00:00 GMT",
        "title": "MicroStrategy: Bitcoin's White Knight? - DailyCoin",
        "content": "Before MicroStrategy became one of the world’s biggest Bitcoin bulls, the software company was relatively unknown outside big tech and traditional finance. That changed in 2020 when the Fortune 500 enterprise added Bitcoin holdings to its balance sheet.\n\nMicroStrategy is one of the key players in the cryptocurrency market and the wider blockchain industry. Led by chairman Michael Saylor, they were among the first corporate entities to consider BTC as a store of value. This paved the way for other notable companies, like Tesla, to make their Bitcoin purchases.\n\nWe know MicroStrategy is an avid supporter of digital currency, but what is the company behind the internet fame? Do they hold any other digital assets, like Ethereum or NFTs?\n\nWhat Is MicroStrategy?\n\nFounded by Michael Saylor in 1989, MicroStrategy is a software company that provides powerful analytics and business intelligence tools. MicroStrategy products are used by some of the world’s largest companies and household names, such as Visa and Porsche.\n\nOf course, developing data dashboards can only take a company so far. As part of its expanded offering, MicroStrategy provides cloud computing services.\n\nBut is the relationship between MicroStrategy and Bitcoin?\n\nMicroStrategy in the Crypto Market\n\nAccording to Coingecko (as of Feb 2023), MicroStrategy owns more Bitcoin than any other public company, including some leading exchanges like Coinbase. Unfazed by events like the FTX crash and crypto bear markets, MicroStrategy sees BTC as a long-term investment.\n\nBuying Bitcoin for the First Time\n\nMicroStrategy first expressed interest in Bitcoin in mid-2020 as a hedge against inflation. The United States Dollar (USD) was rapidly losing value following the economic fallout of the pandemic.\n\nIn a June earnings call with the company’s CFO, Phong Le, Saylor mentioned that “it makes sense to shift our treasury assets into some investments that can’t be inflated away…”. By August 2020, MicroStrategy announced they’d acquired 21,454 BTC at a market value of over $250M. The price of BTC at the time was around $11,000.\n\nSince then, MicroStrategy has routinely added to their bitcoin holdings, regardless of the volatility in the crypto market. As of February 2023, the tech giant’s average price of Bitcoin purchases is roughly $30,415 per BTC.\n\nHas MicroStrategy Ever Sold Its Bitcoin?\n\nAfter a challenging year for Bitcoin, mainstream media and crypto news outlets eagerly shared the trending story: MicroStrategy sells. It seemed like following the last year’s crypto winter, Saylor and Co needed to cut their losses.\n\nDespite what the headlines suggested, MicroStrategy explained in an SEC filing that they planned “to carry back the capital losses resulting from this transaction against previous capital gains… which may generate a tax benefit.”\n\nWhile this may have spread brief fear and doubt in the crypto market, MicroStrategy has since repurchased bitcoin. The company’s conviction in digital currency runs deeper than ever. Per a filing with the Securities and Exchange Commission, MicroStrategy plans to sell its other assets to fund further BTC investments.\n\nWhat Is MicroStrategy’s Liquidation Price?\n\nAccording to Binance, MicroStrategy’s Bitcoin investment has been partly funded by Silvergate loans. Additionally, one of the tech firm’s subsidiaries, MacroStrategy, has a leveraged position in Bitcoin.\n\nIn a significant crash, MacroStrategy would need to add additional collateral to its position to avoid liquidation. If the price of bitcoin were to drop to $13,644, Macrostrategy would receive an unwelcome margin call.\n\nWhen will MicroStrategy be forced to sell? Hopefully, not anytime soon. MicroStrategy’s BTC position comes under threat of liquidation at a much lower price of around $3,561.\n\nMicroStrategy’s Other Crypto Holdings\n\nDespite being undoubtedly bullish on BTC and blockchain technology, MicroStrategy does not officially hold any other cryptocurrencies. Altcoins like ETH are not listed on the MicroStrategy balance sheet.\n\nBeing a bitcoin maximalist does have its drawbacks. Ironically, if MicroStrategy had bought Ethereum instead of Bitcoin, they would’ve seen better returns. By purchasing ETH, as opposed to BTC, MicroStrategy would hold 3,540,000 ETH.\n\nMicroStrategy in the Stock Market\n\nAdding Bitcoin to the company’s balance sheet has drawn mixed responses from MicroStrategy (MSTR) investors. Holding BTC has exposed the company’s treasury to greater volatility, which appears to coincide with the performance of the MSTR stock.\n\nBloomberg suggests that MSTR stock hit its lowest price since 2020 following MicroStrategy’s BTC purchases in December 2022. It’s important to note that, at that time, MicroStrategy had lost over one billion USD through its Bitcoin investments.\n\nWhat Is Michael Saylor’s Role at MicroStrategy?\n\nIn August 2021, MicroStrategy co-founder and CEO Michael Saylor stepped down. Saylor remains heavily involved with the company in his new role as executive chairman. The shift gives Saylor greater flexibility to pursue MicroStrategy’s Bitcoin strategy.\n\nSaylor’s position as CEO was replaced by the former CFO and President, Phong Le.\n\nOn the Flipside\n\nWhile some might consider MicroStrategy’s liquidation point impossible, it would surely trigger widespread panic in the crypto market. If MicroStrategy were forced to sell its BTC holdings, it could be a fatal blow to the price of Bitcoin and the reputation of cryptocurrency and blockchain.\n\nWhy You Should Care\n\nMicroStrategy is the largest Bitcoin holder amongst corporate entities. Their belief and support of BTC and the blockchain industry represent the arrival of institutional investment into the crypto space.\n\nThis improves the image of cryptocurrency and Web 3.0 technologies in the view of both traditional finance and the general public. MicroStrategy’s investment is a step toward the mass adoption of bitcoin and blockchain technology.\n\nF.A.Q.S."
    }
]