[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA5LTA5L3Nwb3QtYml0Y29pbi1ldGZzLWJ0Yy13aXRoLTEwMC1iaWxsaW9uLXBvdGVudGlhbC10aHJlYXRlbi1mdXR1cmVzLWV0ZnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Sep 2023 07:00:00 GMT",
        "title": "Spot Bitcoin ETFs (BTC) With $100 Billion Potential Threaten Futures ETFs - Bloomberg",
        "content": "Spot Bitcoin ETFs haven’t even been approved in the US, and yet already some see them as an existential threat to the futures-based funds that came before them.\n\nBlackRock Inc. leads a group of firms awaiting word from regulators on their filings to launch what would be the first US ETFs linked to the spot price of the largest cryptocurrency. Grayscale Investments is also in the mix after scoring a legal victory in its quest to convert its $16 billion Bitcoin trust into an exchange-traded fund. Proponents are optimistic that the heft of the issuers involved and Grayscale’s recent court win may finally tilt the odds in favor of these funds being approved."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA5LTA5L3Nwb3QtYml0Y29pbi1ldGZzLWJ0Yy13aXRoLTEwMC1iaWxsaW9uLXBvdGVudGlhbC10aHJlYXRlbi1mdXR1cmVzLWV0ZnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Sep 2023 07:00:00 GMT",
        "title": "Spot Bitcoin ETFs (BTC) With $100 Billion Potential Threaten Futures ETFs - Bloomberg",
        "content": "Spot Bitcoin ETFs haven’t even been approved in the US, and yet already some see them as an existential threat to the futures-based funds that came before them.\n\nBlackRock Inc. leads a group of firms awaiting word from regulators on their filings to launch what would be the first US ETFs linked to the spot price of the largest cryptocurrency. Grayscale Investments is also in the mix after scoring a legal victory in its quest to convert its $16 billion Bitcoin trust into an exchange-traded fund. Proponents are optimistic that the heft of the issuers involved and Grayscale’s recent court win may finally tilt the odds in favor of these funds being approved."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA5LTA5L3Nwb3QtYml0Y29pbi1ldGZzLWJ0Yy13aXRoLTEwMC1iaWxsaW9uLXBvdGVudGlhbC10aHJlYXRlbi1mdXR1cmVzLWV0ZnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Sep 2023 07:00:00 GMT",
        "title": "Spot Bitcoin ETFs (BTC) With $100 Billion Potential Threaten Futures ETFs - Bloomberg",
        "content": "Spot Bitcoin ETFs haven’t even been approved in the US, and yet already some see them as an existential threat to the futures-based funds that came before them.\n\nBlackRock Inc. leads a group of firms awaiting word from regulators on their filings to launch what would be the first US ETFs linked to the spot price of the largest cryptocurrency. Grayscale Investments is also in the mix after scoring a legal victory in its quest to convert its $16 billion Bitcoin trust into an exchange-traded fund. Proponents are optimistic that the heft of the issuers involved and Grayscale’s recent court win may finally tilt the odds in favor of these funds being approved."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMDkvd2hhdC1pdHMtbGlrZS1pbi1ldXJvcGVzLWNyeXB0by1odWItcG9ydHVnYWwtYXMtdGhlLXVzLWNyYWNrcy1kb3duLmh0bWzSAWtodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wOS8wOS93aGF0LWl0cy1saWtlLWluLWV1cm9wZXMtY3J5cHRvLWh1Yi1wb3J0dWdhbC1hcy10aGUtdXMtY3JhY2tzLWRvd24uaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Sep 2023 07:00:00 GMT",
        "title": "What it's like in Europe's popular crypto haven Portugal as the U.S. cracks down - CNBC",
        "content": "Alexander Spatari | Moment | Getty Images\n\nLISBON, PORTUGAL — Matadors and bitcoin maximalists are regulars at Campo Pequeno, a neo-Moorish bullring in the northernmost reaches of the Portuguese capital city. The two aren't all that different. Both are typically defiant and stubborn, engaged in a seemingly hopeless battle that pits man against beast, where the goal isn't just survival but total domination. Each fights against the status quo — one against the laws of nature, the other against the financial establishment. In the case of the maxis, these rebels don cryptographic code instead of capes, pinning their revolution on the decentralized ledger technology they believe will change the world as we know it. Every month, bitcoin's biggest fans in Lisbon — an eclectic bunch of mostly expat digital nomads — descend on this 19th century arena to sip Licor Beirão, talk shop and extol the virtues of a world run on bitcoin. The storied venue is also a fitting metaphor for the bull run that many of these bitcoiners hold out hope for during crypto winter, the name given to the period of prolonged, depressed pricing in digital assets that can last for years.\n\nSoftware engineer Lorenzo Primiterra has been living mostly in Lisbon for the past two years. CNBC\n\nSoftware engineer Lorenzo Primiterra has been going to the gatherings since they began. He's a Peter Pan-type with black chipped nail polish and small black hoop earrings complimenting the tattoo on his right inner forearm that reads, in all caps, 'WHAT'S MY AGE AGAIN?\" Primiterra hails from Italy but has spent two of his last seven years on the road in Portugal. Sitting at a picnic table adjacent to the 10,000-person capacity arena, he tells CNBC that the inaugural bitcoin gathering took place in this same venue in spring 2022, the weekend after the collapse of Terra Luna — a popular U.S. dollar-pegged stablecoin project that imploded overnight, erasing half a trillion dollars from the sector's market cap in the process. \"A lot of people got burned in that,\" Primiterra said of the stablecoin's failure. \"I guess a lot of people became bitcoiners from that event. They understood the importance of self custody of bitcoin, bitcoin on bitcoin blockchain, not on other chains.\" The cascade of crypto bankruptcies, failed tokens and the revelation that some of the titans of the industry were running allegedly criminal enterprises laid bare to many that bitcoin is king. But Lisbon as a city remains largely blockchain agnostic. Every night of the week, there is some sort of industry gathering — recurring events like Web3 Wednesdays and Crypto Fridays at The Block, a popular clubhouse where industry enthusiasts can rent out co-working space. The city also plays host to major industry conferences like Web Summit and NearCon. \"I remember, two years ago, there was supposed to be an ethereum event here, and then solana organized another event and then they said, 'Well, let's do a blockchain week,' and then it became a blockchain month,\" said Primiterra. \"I went to the other blockchain events during the bull market, because every blockchain was offering drinks, and I'm like, 'Why not?'\" he said.\n\nAerial view shot of the April 25th Bridge and the Tagus River at sunset, Almada, Lisboa Region, Portugal Simonskafar | E+ | Getty Images\n\nCrypto investment firm Greenfield recently named Lisbon the most important crypto hub on the planet, outranking New York, Berlin and Singapore. In the recently released State of European Crypto Report, researchers point to its \"profound DeFi scene\" and the country's tax breaks as two big reasons for its top status. Even as the government looks to roll back aggressive incentives for foreigners, the tax regime is still a lot more favorable than elsewhere on the continent — especially as the collective crypto market cap is nearly 60% off its all-time high. Add perks like the newly launched digital nomad visa and the fact that the city offers lower prices than other Western European hubs, and Lisbon has all the fixings of an ideal expatriate enclave for tech enthusiasts looking to save cash while they talk code. This is a big part of why Primiterra, who has been in roughly 50 countries in seven years, is staying put in Portugal. He bought an apartment during the pandemic in an up-and-coming neighborhood outside the main city center — and has no plans to uproot anytime soon. Another big draw? A community of like-minded people. \"I like tech in general, so even if I know that a project is terribly coded tech wise — I'm like, 'OK, tell me how you plan to solve that double-spend problem,'\" he said. \"I can listen to it, I can counter-argue some of the stuff.\" \"I have friends in the ethereum community, and it's totally fine for me,\" added Primiterra, though he noted that one of his big side projects of the moment is looking to launch a co-working space dedicated to bitcoin.\n\nSunrise over Lisbon, Portugal Alexander Spatari | Moment | Getty Images\n\nThe San Francisco of Europe\n\nA walk through Portugal's capital feels eerily similar to a stroll in San Francisco. Both boast a cityscape defined by steep streets and sudden vistas; hilly terrain sloping down to beaches dotted by kite surfers and sailboats; red, dual-towered suspension bridges marking the edge of the city bounds; and brightly colored old-fashioned trams snaking through narrow streets. The two coastal cities are also honey pots for techies. Jemson Chan is a software tester from Singapore who has been living in Portugal for nine months. Chan is currently working for a company that is not crypto related, but he says his passion firmly lies in bitcoin and decentralized tech. \"I came to Lisbon for the quality of life, the number of tech startups and the very burgeoning tech scene,\" said Chan.\n\nJemson Chan is a software tester from Singapore who has been living in Portugal for nine months. CNBC\n\nGuy Young, the CEO and founder of crypto startup Ethena Labs, says the ambience drew him to Lisbon, calling it one of those ideal cities that strikes a good balance between picturesque architecture, a rich history, top-notch restaurants, great weather — and a solid community of crypto people. Young's anecdotal take on the Iberian Peninsula reflects a common sentiment. In 2022, Portugal ranked sixth on the Global Peace Index, and it tops the list of best countries for expats. The number of foreign residents in Portugal has been on the rise for seven straight years, increasing by more than 40% in the past decade. It also helps that there are clear ground rules on crypto in Europe, thanks to a law known as Markets in Crypto-Assets, or MiCA. While the guidelines aren't Portugal-specific, the comprehensive regulatory framework for digital assets makes it easier to navigate operating a crypto business or investing in virtual tokens in the eurozone. Chan, who has a side hustle hosting his own educational podcast on bitcoin called Orange Pill Uncensored, says Portugal is a far more hospitable backdrop than the U.S. with its regulation-by-enforcement tactics deployed by the Securities and Exchange Commission. \"Ever since the FTX collapse and the current ongoing attacks by especially the U.S. government on centralized exchanges, there have been efforts from the grassroots level to create more decentralized platforms that deal with the on- and off-ramps to fiat,\" added Chan, pointing to decentralized marketplaces like Pocket Bitcoin, RoboSats, Bisque and Peach that allow users to buy and sell bitcoin. Primiterra used to spend his days working to measure global internet censorship as part of his work with a sub-project of the dark web browser, Tor. But nowadays, he volunteers his coding skills to Bitcoin Map, an open-source tool that lets you search for merchants that accept bitcoin anywhere in the world. Lisbon may be crypto-friendly, but businesses don't appear to be all that interested in accepting bitcoin as a form of currency. Primiterra says the list includes a handful of merchants including a ramen place and a dentist.\n\nSeb True is a full-stack engineer who made the move to Lisbon over the summer. CNBC\n\nSeb True is a full-stack engineer who made the move to Lisbon over the summer. The British national initially traveled to Portugal on what was meant to be a short trip to make a presentation at the monthly bitcoin gathering. Soon after his arrival, he was hooked and committed to a three-month sublet. True quit his full-time job so he could focus on traveling the world and teaching people about bitcoin from the perspective of sound money and the philosophy of libertarianism. He has dubbed his educational modules The Bitcoin Student, and he's looking to expand the brand by capitalizing on his engineering background. Lisbon has been a relief for True, who previously ran underground workshops in Egypt where bitcoin is illegal. \"Apparently they throw people in jail for talking about it and just working on it or doing anything with it,\" he said. \"That's actually the first place I started giving presentations on bitcoin.\" He says he knew the risks but ultimately ignored warnings about his safety, because he felt the population could greatly benefit from learning more about decentralized virtual money that existed outside the reach of governments or central banks. \"It's a country that has experienced over 50% inflation just this year, people are suffering, they don't understand why and they don't know who to blame,\" continued True. \"Their view was, 'Oh, bitcoin, someone controls that, too, surely, so it's not going to be any better,'\" he said, adding that it didn't take long to \"orange pill\" them, a phrase used by bitcoiners to describe the process of indoctrinating someone in the ways of bitcoin. True has now shifted his focus to Portugal, describing Lisbon, in particular, as the ideal base to grow his enterprise. \"The people here that I'm meeting are doing things, actually creating content, they're active about making a difference, and they are interested in collaborating,\" True told CNBC. \"I've already had people contacting me asking to make content for me or for my project, not for any money, not for any fame ... but just because they're passionate, because they believe in the mission,\" continued True. \"They believe in the idea, and that's really what's made me think, 'Wow, I should really stay here. This is where the community clearly is.'\"\n\nLisbon's skyline, showing the city's Ponte 25 de Abril spanning the river Tagus. Stephen Knowles Photography | Moment | Getty Images\n\nTax breaks on bitcoin\n\nBefore making the move from Asia to Europe, Chan pored over tax law in the European Union, narrowing down the ideal jurisdiction to either Switzerland or Portugal. \"If you know anything about Switzerland, it's a millionaires' and billionaires' paradise,\" said Chan. \"Looking at me, I don't think I've achieved that level of success yet, so I chose the poor man's Switzerland.\" The tax perks in Portugal are certainly a big draw. The resident-non-habitual (NHR) status is a fiscal regime that in some cases grants expats living in Portugal total exemption from paying taxes on their income for a period of up to 10 years. In addition, unlike the U.S., which treats virtual currency as property, taxing it in a manner similar to stocks or real property, Portugal views cryptocurrencies as a form of payment. That distinction is a game-changer with respect to taxes. Up until the end of 2022, capital gains resulting from crypto transactions, such as cashing out and crypto-to-crypto trades, were not subject to personal income taxes. The government has since added more caveats to its crypto tax breaks, including a requirement that an investor hold a digital asset for more than a year before selling in order to avoid paying taxes on the sale. This means that gains from buying or selling cryptocurrency, as with other fiat currencies, are not taxed if the trader holds on to their coins for at least 12 months. Meanwhile, profits made on crypto held for less than a year is taxed at a rate of 28%. \"This makes Portugal a really attractive place for crypto users to live,\" explained Shehan Chandrasekera, a CPA and head of tax strategy at crypto tax software company CoinTracker.io. The only exception to the country's generous crypto scheme relates to companies registered in Portugal that deal in crypto. These businesses face some taxes under certain circumstances, like if they earn cryptocurrency by providing services in Portugal.\n\nCyclists photographed in Lisbon, Portugal, in October 2018. Kamisoka | Istock Unreleased | Getty Images\n\nExpats tell CNBC the process of establishing residency is relatively smooth. It doesn't require owning any property, and unlike other crypto tax havens, such as Puerto Rico, foreigners aren't required to spend a certain number of days in the country. Citizens of the European Union have the right to permanent residence in Portugal, and for non-EU citizens, it offers expats a few paths to residency, including the golden visa and the D7 Visa (also known as the retirement visa or passive income visa), both of which tend to attract wealthy foreigners. The Portuguese golden visa is given to those who buy property, or invest a certain amount of money in the country. There are also steps that involve getting a tax identification number, opening a bank account and formally applying for residency. Companies such as Plan B Passport streamline the application process for expats. Plan B CEO Katie Ananina tells CNBC the company has helped hundreds of people from countries such as the U.S., the U.K., Australia and Canada obtain a second passport in one of seven countries, including Portugal. Plan B works in tandem with each government's residence- or citizenship-by-investment programs. One drawback to Lisbon's burgeoning popularity: As more crypto fans flood the city, some of the longtime natives are complaining about rising prices, similar to other tech hubs around the world. \"There's been quite a sort of influx of foreigners that have come in recently,\" says Ethena's Young. \"And there's been a bit of pushback around property prices, what's going on with sort of the prices in some of the restaurants and stuff like that. But as a foreigner who's come here, I have no complaints.\"\n\n'It's just paradise'\n\nWout Deley — who has been researching cryptocurrencies and their underlying technology since 2013 — was working as an international sales manager for a galvanization company in Ghent, Belgium, when he decided to sell his house, invest in tokens and hit the road. After a few months traveling through Europe during the early days of the Covid pandemic, he ultimately settled in Portugal. Deley invested two-thirds of the house-sale proceeds in cryptocurrency and then lived off the final third. \"At any given time, I have maybe — at a maximum — 10,000 euros ($11,450) in my bank account,\" said Deley. \"All the rest is always in crypto.\" For Deley, establishing residency in Portugal was a no-brainer. \"Cryptocurrencies in Belgium are massively taxed, and I was looking at seven figures of profit,\" said Deley, who said that he would have faced a tax obligation of close to 40% had he remained in Belgium. \"You want to double your profit? Just move to Portugal,\" he said.\n\nPraça do Comércio is a popular tourist destination in Lisbon's city center. Imazins | Image Bank Film | Getty Images\n\nDeley lives in Lagos in the southwest tip of Portugal. He says that he found a villa available as a long-term rental which was \"very cheap\" and that was enough to establish residency. The living is easy in Portugal, according to Deley, who says the southern coastline of the Algarve offers the perks of Los Angeles — a warm climate and great surf — but without the traffic jams. And there is a solid social scene. \"It's full of expats. It's just paradise,\" continued Deley. He says that he knows of at least three bitcoin billionaires who live nearby — plus another 12 people at least, mostly from the U.K., who are moving to Portugal in the next few months for the crypto tax benefits. Deley doesn't speak Portuguese, but he says that's not a problem because everyone speaks English. He is also surrounded by a lot of like-minded crypto investors. \"Everyone has cryptocurrency here. Everyone knows bitcoin. Everyone has it,\" he said. Deley says the crypto investor migration is good for Portugal, too. \"They have a huge brain drain. Younger people are leaving. So they're trying to be more open to people with capital, digital nomads,\" said Deley. Meanwhile, Didi Taihuttu of the 'Bitcoin Family' wants to disrupt the typical expat experience in Portugal by building a crypto village. The family is currently shopping for real estate. They've narrowed their options down to three different plots of land, one as big as 250,000 acres, in the Algarve. The plan is to run the community in a decentralized fashion, in which the land is divvied up by the square meter and sold as non-fungible tokens, or NFTs, in order to signify ownership. Taihuttu also wants to mine for bitcoin with solar and wind power and then use the heat produced by the rigs to warm houses in the winter, in a sort of closed-loop system. The working plan, for now, is to use a decentralized autonomous organization, or DAO, to govern the community. DAOs run on blockchain technology. \"We want to build a decentralized lifestyle, which is the future,\" he said. In the meantime, the Taihuttus found an abandoned inn and are retrofitting it to be the first web3 hotel in the Algarve that is financed and owned by the community."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMDkvd2hhdC1pdHMtbGlrZS1pbi1ldXJvcGVzLWNyeXB0by1odWItcG9ydHVnYWwtYXMtdGhlLXVzLWNyYWNrcy1kb3duLmh0bWzSAWtodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wOS8wOS93aGF0LWl0cy1saWtlLWluLWV1cm9wZXMtY3J5cHRvLWh1Yi1wb3J0dWdhbC1hcy10aGUtdXMtY3JhY2tzLWRvd24uaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 09 Sep 2023 07:00:00 GMT",
        "title": "What it's like in Europe's popular crypto haven Portugal as the U.S. cracks down - CNBC",
        "content": "Alexander Spatari | Moment | Getty Images\n\nLISBON, PORTUGAL — Matadors and bitcoin maximalists are regulars at Campo Pequeno, a neo-Moorish bullring in the northernmost reaches of the Portuguese capital city. The two aren't all that different. Both are typically defiant and stubborn, engaged in a seemingly hopeless battle that pits man against beast, where the goal isn't just survival but total domination. Each fights against the status quo — one against the laws of nature, the other against the financial establishment. In the case of the maxis, these rebels don cryptographic code instead of capes, pinning their revolution on the decentralized ledger technology they believe will change the world as we know it. Every month, bitcoin's biggest fans in Lisbon — an eclectic bunch of mostly expat digital nomads — descend on this 19th century arena to sip Licor Beirão, talk shop and extol the virtues of a world run on bitcoin. The storied venue is also a fitting metaphor for the bull run that many of these bitcoiners hold out hope for during crypto winter, the name given to the period of prolonged, depressed pricing in digital assets that can last for years.\n\nSoftware engineer Lorenzo Primiterra has been living mostly in Lisbon for the past two years. CNBC\n\nSoftware engineer Lorenzo Primiterra has been going to the gatherings since they began. He's a Peter Pan-type with black chipped nail polish and small black hoop earrings complimenting the tattoo on his right inner forearm that reads, in all caps, 'WHAT'S MY AGE AGAIN?\" Primiterra hails from Italy but has spent two of his last seven years on the road in Portugal. Sitting at a picnic table adjacent to the 10,000-person capacity arena, he tells CNBC that the inaugural bitcoin gathering took place in this same venue in spring 2022, the weekend after the collapse of Terra Luna — a popular U.S. dollar-pegged stablecoin project that imploded overnight, erasing half a trillion dollars from the sector's market cap in the process. \"A lot of people got burned in that,\" Primiterra said of the stablecoin's failure. \"I guess a lot of people became bitcoiners from that event. They understood the importance of self custody of bitcoin, bitcoin on bitcoin blockchain, not on other chains.\" The cascade of crypto bankruptcies, failed tokens and the revelation that some of the titans of the industry were running allegedly criminal enterprises laid bare to many that bitcoin is king. But Lisbon as a city remains largely blockchain agnostic. Every night of the week, there is some sort of industry gathering — recurring events like Web3 Wednesdays and Crypto Fridays at The Block, a popular clubhouse where industry enthusiasts can rent out co-working space. The city also plays host to major industry conferences like Web Summit and NearCon. \"I remember, two years ago, there was supposed to be an ethereum event here, and then solana organized another event and then they said, 'Well, let's do a blockchain week,' and then it became a blockchain month,\" said Primiterra. \"I went to the other blockchain events during the bull market, because every blockchain was offering drinks, and I'm like, 'Why not?'\" he said.\n\nAerial view shot of the April 25th Bridge and the Tagus River at sunset, Almada, Lisboa Region, Portugal Simonskafar | E+ | Getty Images\n\nCrypto investment firm Greenfield recently named Lisbon the most important crypto hub on the planet, outranking New York, Berlin and Singapore. In the recently released State of European Crypto Report, researchers point to its \"profound DeFi scene\" and the country's tax breaks as two big reasons for its top status. Even as the government looks to roll back aggressive incentives for foreigners, the tax regime is still a lot more favorable than elsewhere on the continent — especially as the collective crypto market cap is nearly 60% off its all-time high. Add perks like the newly launched digital nomad visa and the fact that the city offers lower prices than other Western European hubs, and Lisbon has all the fixings of an ideal expatriate enclave for tech enthusiasts looking to save cash while they talk code. This is a big part of why Primiterra, who has been in roughly 50 countries in seven years, is staying put in Portugal. He bought an apartment during the pandemic in an up-and-coming neighborhood outside the main city center — and has no plans to uproot anytime soon. Another big draw? A community of like-minded people. \"I like tech in general, so even if I know that a project is terribly coded tech wise — I'm like, 'OK, tell me how you plan to solve that double-spend problem,'\" he said. \"I can listen to it, I can counter-argue some of the stuff.\" \"I have friends in the ethereum community, and it's totally fine for me,\" added Primiterra, though he noted that one of his big side projects of the moment is looking to launch a co-working space dedicated to bitcoin.\n\nSunrise over Lisbon, Portugal Alexander Spatari | Moment | Getty Images\n\nThe San Francisco of Europe\n\nA walk through Portugal's capital feels eerily similar to a stroll in San Francisco. Both boast a cityscape defined by steep streets and sudden vistas; hilly terrain sloping down to beaches dotted by kite surfers and sailboats; red, dual-towered suspension bridges marking the edge of the city bounds; and brightly colored old-fashioned trams snaking through narrow streets. The two coastal cities are also honey pots for techies. Jemson Chan is a software tester from Singapore who has been living in Portugal for nine months. Chan is currently working for a company that is not crypto related, but he says his passion firmly lies in bitcoin and decentralized tech. \"I came to Lisbon for the quality of life, the number of tech startups and the very burgeoning tech scene,\" said Chan.\n\nJemson Chan is a software tester from Singapore who has been living in Portugal for nine months. CNBC\n\nGuy Young, the CEO and founder of crypto startup Ethena Labs, says the ambience drew him to Lisbon, calling it one of those ideal cities that strikes a good balance between picturesque architecture, a rich history, top-notch restaurants, great weather — and a solid community of crypto people. Young's anecdotal take on the Iberian Peninsula reflects a common sentiment. In 2022, Portugal ranked sixth on the Global Peace Index, and it tops the list of best countries for expats. The number of foreign residents in Portugal has been on the rise for seven straight years, increasing by more than 40% in the past decade. It also helps that there are clear ground rules on crypto in Europe, thanks to a law known as Markets in Crypto-Assets, or MiCA. While the guidelines aren't Portugal-specific, the comprehensive regulatory framework for digital assets makes it easier to navigate operating a crypto business or investing in virtual tokens in the eurozone. Chan, who has a side hustle hosting his own educational podcast on bitcoin called Orange Pill Uncensored, says Portugal is a far more hospitable backdrop than the U.S. with its regulation-by-enforcement tactics deployed by the Securities and Exchange Commission. \"Ever since the FTX collapse and the current ongoing attacks by especially the U.S. government on centralized exchanges, there have been efforts from the grassroots level to create more decentralized platforms that deal with the on- and off-ramps to fiat,\" added Chan, pointing to decentralized marketplaces like Pocket Bitcoin, RoboSats, Bisque and Peach that allow users to buy and sell bitcoin. Primiterra used to spend his days working to measure global internet censorship as part of his work with a sub-project of the dark web browser, Tor. But nowadays, he volunteers his coding skills to Bitcoin Map, an open-source tool that lets you search for merchants that accept bitcoin anywhere in the world. Lisbon may be crypto-friendly, but businesses don't appear to be all that interested in accepting bitcoin as a form of currency. Primiterra says the list includes a handful of merchants including a ramen place and a dentist.\n\nSeb True is a full-stack engineer who made the move to Lisbon over the summer. CNBC\n\nSeb True is a full-stack engineer who made the move to Lisbon over the summer. The British national initially traveled to Portugal on what was meant to be a short trip to make a presentation at the monthly bitcoin gathering. Soon after his arrival, he was hooked and committed to a three-month sublet. True quit his full-time job so he could focus on traveling the world and teaching people about bitcoin from the perspective of sound money and the philosophy of libertarianism. He has dubbed his educational modules The Bitcoin Student, and he's looking to expand the brand by capitalizing on his engineering background. Lisbon has been a relief for True, who previously ran underground workshops in Egypt where bitcoin is illegal. \"Apparently they throw people in jail for talking about it and just working on it or doing anything with it,\" he said. \"That's actually the first place I started giving presentations on bitcoin.\" He says he knew the risks but ultimately ignored warnings about his safety, because he felt the population could greatly benefit from learning more about decentralized virtual money that existed outside the reach of governments or central banks. \"It's a country that has experienced over 50% inflation just this year, people are suffering, they don't understand why and they don't know who to blame,\" continued True. \"Their view was, 'Oh, bitcoin, someone controls that, too, surely, so it's not going to be any better,'\" he said, adding that it didn't take long to \"orange pill\" them, a phrase used by bitcoiners to describe the process of indoctrinating someone in the ways of bitcoin. True has now shifted his focus to Portugal, describing Lisbon, in particular, as the ideal base to grow his enterprise. \"The people here that I'm meeting are doing things, actually creating content, they're active about making a difference, and they are interested in collaborating,\" True told CNBC. \"I've already had people contacting me asking to make content for me or for my project, not for any money, not for any fame ... but just because they're passionate, because they believe in the mission,\" continued True. \"They believe in the idea, and that's really what's made me think, 'Wow, I should really stay here. This is where the community clearly is.'\"\n\nLisbon's skyline, showing the city's Ponte 25 de Abril spanning the river Tagus. Stephen Knowles Photography | Moment | Getty Images\n\nTax breaks on bitcoin\n\nBefore making the move from Asia to Europe, Chan pored over tax law in the European Union, narrowing down the ideal jurisdiction to either Switzerland or Portugal. \"If you know anything about Switzerland, it's a millionaires' and billionaires' paradise,\" said Chan. \"Looking at me, I don't think I've achieved that level of success yet, so I chose the poor man's Switzerland.\" The tax perks in Portugal are certainly a big draw. The resident-non-habitual (NHR) status is a fiscal regime that in some cases grants expats living in Portugal total exemption from paying taxes on their income for a period of up to 10 years. In addition, unlike the U.S., which treats virtual currency as property, taxing it in a manner similar to stocks or real property, Portugal views cryptocurrencies as a form of payment. That distinction is a game-changer with respect to taxes. Up until the end of 2022, capital gains resulting from crypto transactions, such as cashing out and crypto-to-crypto trades, were not subject to personal income taxes. The government has since added more caveats to its crypto tax breaks, including a requirement that an investor hold a digital asset for more than a year before selling in order to avoid paying taxes on the sale. This means that gains from buying or selling cryptocurrency, as with other fiat currencies, are not taxed if the trader holds on to their coins for at least 12 months. Meanwhile, profits made on crypto held for less than a year is taxed at a rate of 28%. \"This makes Portugal a really attractive place for crypto users to live,\" explained Shehan Chandrasekera, a CPA and head of tax strategy at crypto tax software company CoinTracker.io. The only exception to the country's generous crypto scheme relates to companies registered in Portugal that deal in crypto. These businesses face some taxes under certain circumstances, like if they earn cryptocurrency by providing services in Portugal.\n\nCyclists photographed in Lisbon, Portugal, in October 2018. Kamisoka | Istock Unreleased | Getty Images\n\nExpats tell CNBC the process of establishing residency is relatively smooth. It doesn't require owning any property, and unlike other crypto tax havens, such as Puerto Rico, foreigners aren't required to spend a certain number of days in the country. Citizens of the European Union have the right to permanent residence in Portugal, and for non-EU citizens, it offers expats a few paths to residency, including the golden visa and the D7 Visa (also known as the retirement visa or passive income visa), both of which tend to attract wealthy foreigners. The Portuguese golden visa is given to those who buy property, or invest a certain amount of money in the country. There are also steps that involve getting a tax identification number, opening a bank account and formally applying for residency. Companies such as Plan B Passport streamline the application process for expats. Plan B CEO Katie Ananina tells CNBC the company has helped hundreds of people from countries such as the U.S., the U.K., Australia and Canada obtain a second passport in one of seven countries, including Portugal. Plan B works in tandem with each government's residence- or citizenship-by-investment programs. One drawback to Lisbon's burgeoning popularity: As more crypto fans flood the city, some of the longtime natives are complaining about rising prices, similar to other tech hubs around the world. \"There's been quite a sort of influx of foreigners that have come in recently,\" says Ethena's Young. \"And there's been a bit of pushback around property prices, what's going on with sort of the prices in some of the restaurants and stuff like that. But as a foreigner who's come here, I have no complaints.\"\n\n'It's just paradise'\n\nWout Deley — who has been researching cryptocurrencies and their underlying technology since 2013 — was working as an international sales manager for a galvanization company in Ghent, Belgium, when he decided to sell his house, invest in tokens and hit the road. After a few months traveling through Europe during the early days of the Covid pandemic, he ultimately settled in Portugal. Deley invested two-thirds of the house-sale proceeds in cryptocurrency and then lived off the final third. \"At any given time, I have maybe — at a maximum — 10,000 euros ($11,450) in my bank account,\" said Deley. \"All the rest is always in crypto.\" For Deley, establishing residency in Portugal was a no-brainer. \"Cryptocurrencies in Belgium are massively taxed, and I was looking at seven figures of profit,\" said Deley, who said that he would have faced a tax obligation of close to 40% had he remained in Belgium. \"You want to double your profit? Just move to Portugal,\" he said.\n\nPraça do Comércio is a popular tourist destination in Lisbon's city center. Imazins | Image Bank Film | Getty Images\n\nDeley lives in Lagos in the southwest tip of Portugal. He says that he found a villa available as a long-term rental which was \"very cheap\" and that was enough to establish residency. The living is easy in Portugal, according to Deley, who says the southern coastline of the Algarve offers the perks of Los Angeles — a warm climate and great surf — but without the traffic jams. And there is a solid social scene. \"It's full of expats. It's just paradise,\" continued Deley. He says that he knows of at least three bitcoin billionaires who live nearby — plus another 12 people at least, mostly from the U.K., who are moving to Portugal in the next few months for the crypto tax benefits. Deley doesn't speak Portuguese, but he says that's not a problem because everyone speaks English. He is also surrounded by a lot of like-minded crypto investors. \"Everyone has cryptocurrency here. Everyone knows bitcoin. Everyone has it,\" he said. Deley says the crypto investor migration is good for Portugal, too. \"They have a huge brain drain. Younger people are leaving. So they're trying to be more open to people with capital, digital nomads,\" said Deley. Meanwhile, Didi Taihuttu of the 'Bitcoin Family' wants to disrupt the typical expat experience in Portugal by building a crypto village. The family is currently shopping for real estate. They've narrowed their options down to three different plots of land, one as big as 250,000 acres, in the Algarve. The plan is to run the community in a decentralized fashion, in which the land is divvied up by the square meter and sold as non-fungible tokens, or NFTs, in order to signify ownership. Taihuttu also wants to mine for bitcoin with solar and wind power and then use the heat produced by the rigs to warm houses in the winter, in a sort of closed-loop system. The working plan, for now, is to use a decentralized autonomous organization, or DAO, to govern the community. DAOs run on blockchain technology. \"We want to build a decentralized lifestyle, which is the future,\" he said. In the meantime, the Taihuttus found an abandoned inn and are retrofitting it to be the first web3 hotel in the Algarve that is financed and owned by the community."
    }
]