[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0xMC0xNC9ncmF5c2NhbGUtcy1iaXRjb2luLWV0Zi1wdXNoLXdoYXQtcy1uZXh0LWFmdGVyLXNlYy1kb2Vzbi10LWFwcGVhbC1jb3VydC1ydWxpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Grayscale's Bitcoin ETF Push: What's Next After Court Ruling Stands - Bloomberg",
        "content": "With the Securities and Exchange Commission opting against appealing a ruling that paves the way for Grayscale Investments LLC to convert its Bitcoin trust into an exchange-traded fund, analysts are now trying to gauge how the process may unfold from here.\n\nThe crypto asset-manager earlier this year scored a legal victory in federal court in its bid to turn its Grayscale Bitcoin Trust (ticker GBTC) into the first US ETF that would invest directly in the largest digital coin. The SEC faced a Friday deadline to appeal the ruling. The agency is not planning any other appeals in the case, according to a person familiar with the matter, who asked not to be identified discussing the ongoing matter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0xMC0xNC9ncmF5c2NhbGUtcy1iaXRjb2luLWV0Zi1wdXNoLXdoYXQtcy1uZXh0LWFmdGVyLXNlYy1kb2Vzbi10LWFwcGVhbC1jb3VydC1ydWxpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Grayscale's Bitcoin ETF Push: What's Next After Court Ruling Stands - Bloomberg",
        "content": "With the Securities and Exchange Commission opting against appealing a ruling that paves the way for Grayscale Investments LLC to convert its Bitcoin trust into an exchange-traded fund, analysts are now trying to gauge how the process may unfold from here.\n\nThe crypto asset-manager earlier this year scored a legal victory in federal court in its bid to turn its Grayscale Bitcoin Trust (ticker GBTC) into the first US ETF that would invest directly in the largest digital coin. The SEC faced a Friday deadline to appeal the ruling. The agency is not planning any other appeals in the case, according to a person familiar with the matter, who asked not to be identified discussing the ongoing matter."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY2hpbmVzZS1vd25lZC1iaXRjb2luLW1pbmUtaW4td3lvbWluZy1yYWlzZXMtbmF0aW9uYWwtc2VjdXJpdHktY29uY2VybnMtdXMtb2ZmaWNpYWxzLXdhcm460gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Chinese-Owned Bitcoin Mine In Wyoming Raises National Security Concerns, US Officials Warn: NYT - Nasdaq",
        "content": "U.S. Pentagon officials are keeping close tabs on a Wyoming-based Bitcoin (CRYPTO: BTC) operation owned by Chinese interests amid fears of potential national security risks.\n\nThe Bitcoin mine, located opposite a Microsoft Corporation data center and near a military base, sparked concerns due to the owners’ connections with China, according to a report by The New York Times.\n\nThe proximity of the operation to key infrastructure has raised fears that it could enable the Chinese government to undertake intelligence operations aimed at the data center and the Francis E. Warren Air Force Base, which houses Intercontinental Ballistic Missiles, or ICBMs.\n\nSee Also: Trump’s Son-In-Law Jared Kushner Says ‘My Hope And Prayers Are’ For Former President’s Reelection In 2024\n\nThe operation came under the radar of the U.S. government after a team at Microsoft submitted a report to the Committee on Foreign Investment in August 2022, noting potential risks. Despite the absence of direct evidence of harmful activities, Microsoft cautioned about possible threats stemming from the operation’s computing power and the presence of Chinese nationals in close proximity to the data center and the missile base.\n\n“Microsoft has no direct indications of malicious activities by this entity,” Microsoft wrote, as per NYT.\n\n“However, pending further discovery, we suggest the possibility that the computing power of an industrial-level cryptomining operation, along with the presence of an unidentified number of Chinese nationals in direct proximity to Microsoft’s Data Center and one of three strategic-missile bases in the US, provides significant threat vectors.”\n\nThe Bitcoin mine in Cheyenne, Wyoming, is one of several owned by Chinese nationals in the U.S. following China’s ban on Bitcoin mining in 2021. The operation in question is linked to multiple companies, including Bit Origin Ltd, previously a pork-processing company registered in the Cayman Islands.\n\nBit Origin’s president, Li Jiaming, maintained that the proximity to Microsoft’s data center or the military base was not a factor in choosing the location. Rather, it was selected because a local utility company agreed to cooperate with Bit Origin.\n\nRead Next: Trump’s Niece Says Her Uncle, Not Jim Jordan, Was ‘BIG Loser’ After Scalise Nominated As House Speaker\n\nPhoto by AlyoshinE on Shutterstock\n\nEngineered by Benzinga Neuro, Edited by Navdeep Yadav\n\nThe GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY2hpbmVzZS1vd25lZC1iaXRjb2luLW1pbmUtaW4td3lvbWluZy1yYWlzZXMtbmF0aW9uYWwtc2VjdXJpdHktY29uY2VybnMtdXMtb2ZmaWNpYWxzLXdhcm460gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Chinese-Owned Bitcoin Mine In Wyoming Raises National Security Concerns, US Officials Warn: NYT - Nasdaq",
        "content": "U.S. Pentagon officials are keeping close tabs on a Wyoming-based Bitcoin (CRYPTO: BTC) operation owned by Chinese interests amid fears of potential national security risks.\n\nThe Bitcoin mine, located opposite a Microsoft Corporation data center and near a military base, sparked concerns due to the owners’ connections with China, according to a report by The New York Times.\n\nThe proximity of the operation to key infrastructure has raised fears that it could enable the Chinese government to undertake intelligence operations aimed at the data center and the Francis E. Warren Air Force Base, which houses Intercontinental Ballistic Missiles, or ICBMs.\n\nSee Also: Trump’s Son-In-Law Jared Kushner Says ‘My Hope And Prayers Are’ For Former President’s Reelection In 2024\n\nThe operation came under the radar of the U.S. government after a team at Microsoft submitted a report to the Committee on Foreign Investment in August 2022, noting potential risks. Despite the absence of direct evidence of harmful activities, Microsoft cautioned about possible threats stemming from the operation’s computing power and the presence of Chinese nationals in close proximity to the data center and the missile base.\n\n“Microsoft has no direct indications of malicious activities by this entity,” Microsoft wrote, as per NYT.\n\n“However, pending further discovery, we suggest the possibility that the computing power of an industrial-level cryptomining operation, along with the presence of an unidentified number of Chinese nationals in direct proximity to Microsoft’s Data Center and one of three strategic-missile bases in the US, provides significant threat vectors.”\n\nThe Bitcoin mine in Cheyenne, Wyoming, is one of several owned by Chinese nationals in the U.S. following China’s ban on Bitcoin mining in 2021. The operation in question is linked to multiple companies, including Bit Origin Ltd, previously a pork-processing company registered in the Cayman Islands.\n\nBit Origin’s president, Li Jiaming, maintained that the proximity to Microsoft’s data center or the military base was not a factor in choosing the location. Rather, it was selected because a local utility company agreed to cooperate with Bit Origin.\n\nRead Next: Trump’s Niece Says Her Uncle, Not Jim Jordan, Was ‘BIG Loser’ After Scalise Nominated As House Speaker\n\nPhoto by AlyoshinE on Shutterstock\n\nEngineered by Benzinga Neuro, Edited by Navdeep Yadav\n\nThe GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY29pbmtpdGVzLW5ld2VzdC1iaXRjb2luLWRldmljZS1jYW4tc2VydmUtYXMtYS1saWdodG5pbmctd2FsbGV0LWFuZC1ub3N0ci1jbGllbnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Coinkite's Newest Bitcoin Device Can Serve As A Lightning Wallet And Nostr Client - Nasdaq",
        "content": "Satslink looks similar to the Coldcard Q1, but internally it's completely different. Coinkite\n\nCoinkite has announced their latest product, Satslink. The under-production device sits at the intersection of many different areas of communications and mobile hardware, empowering developers to build a whole slew of different applications.\n\nRather than leaning on an opinionated framework, Satslink leverages open and flexible hardware enclosed by the Coldcard Q1’s exterior to bring variety and flexibility to developers. Those in possession of this device can choose what to do with it, and let their builder mentalities run wild on the many different possibilities the piece of hardware can offer.\n\nAt its core, Satslink is a peer-to-peer, hackable multi-purpose device. It features a secure element, as typical of Coinkite products, allowing the user to securely store private keys within the device. While it shares the external design with the Coldcard Q1, the internals are totally different from the company’s latest hardware wallet. Instead of focusing on air gapped security, the Satslink aims to bring secure communications to the day to day in ways that few would’ve considered possible.\n\n“Being dissatisfied with the connected and DIY options, we felt the need to create a better hot platform,” NVK, founder at Coinkite, told Bitcoin Magazine. “Bitcoin is expanding scripting/mpc options and we now have Nostr. Someone had to make a good connected and portable device for developers and enthusiast to create the next generation of freedom functionality.”\n\nSatslink leverages ESP32-S3, a low-power MCU-based system on a chip (SoC) with integrated 2.4 GHz Wi-Fi and Bluetooth Low Energy (Bluetooth LE). It consists of high-performance dual-core microprocessor (Xtensa® 32-bit LX7), a low power coprocessor, a Wi-Fi baseband, a Bluetooth LE baseband, RF module, and numerous peripherals. Satslink is programmed in micropython, with its source fully-available, and it is completely field upgradable with no locked-down ROM areas. Coinkite’s product also features a MicroSD slot for data transfer.\n\nSatslink seems to join together many different fields in bitcoin, technology and communications. Coinkite\n\n“The initial target is developers and enthusiasts,” NVK said. “But, because of the consumer friendly form factor, they will be able to start using anything the community creates. Like hot and sovereign lightning wallets and Nostr clients!”\n\nNostr, the open communications protocol that went viral after Block CEO and Twitter founder Jack Dorsey started endorsing and funding the project, is top of the list of possible use cases for Satslink. Given its peer-to-peer communication capabilities, Satslink can be used as a Nostr client, and since it can also work as a relay, one could send and receive messages as Nostr posts without those ever hitting the internet. Imagine a localized Nostr made up of many Satslink devices talking to each other through a sort of mesh network instead of the open web. That could be possible with this device.\n\nAnother interesting use case that many bitcoiners could relate to is having a sovereign controller for their home-based bitcoin stack. As some bitcoiners run bitcoin nodes and sometimes even self-hosted servers at home, one could program the Satslink to connect to their home stack on demand and perform desired actions remotely and securely given its networking capabilities. Satslink could be used to run a transaction coordinator, for instance, or be used as a whole wallet –– though Coinkite doesn’t recommend using the Satslink as your go-to cold storage solution for large bitcoin amounts.\n\nSatslink’s communication features also boast NFC and a QR code reader, enabling even more use cases for its eventual users. Notably, this combination paired with Satslink’s versatility and programmability could even be used to turn it into a hardware wallet of another manufacturer. Whether that’s desirable or not, truth is it could be possible to turn a Satslink into Blockstream’s JADE wallet or other similar DIY hardware wallets.\n\nWhile the possibilities are endless, what users actually build with this product remains to be seen. Coinkite’s device is currently available to preorder on the company’s website at a $189 price tag, and it is still unclear when the product will start shipping to buyers."
    }
]