[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTMwL2JpdGNvaW4tcy1idGMtZm91ci1tb250aC13aW5uaW5nLXJ1bi1icmluZ3MtMTAwLTAwMC1pbi12aWV3LWlmLWhpc3RvcnktcmlnaHTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin on Course for Longest Streak of Monthly Gains Since 2021 - Bloomberg",
        "content": "Sign up for our new Crypto newsletter and follow @crypto Twitter for the latest news.\n\nBitcoin is set to climb for the fourth month in a row after eking out an April gain, the longest such stretch since a six-month advance through March 2021."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTMwL2JpdGNvaW4tcy1idGMtZm91ci1tb250aC13aW5uaW5nLXJ1bi1icmluZ3MtMTAwLTAwMC1pbi12aWV3LWlmLWhpc3RvcnktcmlnaHTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin on Course for Longest Streak of Monthly Gains Since 2021 - Bloomberg",
        "content": "Sign up for our new Crypto newsletter and follow @crypto Twitter for the latest news.\n\nBitcoin is set to climb for the fourth month in a row after eking out an April gain, the longest such stretch since a six-month advance through March 2021."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTMwL2JpdGNvaW4tcy1idGMtZm91ci1tb250aC13aW5uaW5nLXJ1bi1icmluZ3MtMTAwLTAwMC1pbi12aWV3LWlmLWhpc3RvcnktcmlnaHTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin on Course for Longest Streak of Monthly Gains Since 2021 - Bloomberg",
        "content": "Sign up for our new Crypto newsletter and follow @crypto Twitter for the latest news.\n\nBitcoin is set to climb for the fourth month in a row after eking out an April gain, the longest such stretch since a six-month advance through March 2021."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9vaGlvLW1hbi1zdGVhbHMtNzEyLWJpdGNvaW4tMjExNzA5MDcyLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Apr 2023 07:00:00 GMT",
        "title": "Ohio Man Steals $21M in Bitcoin From Brother, Gets Four Years in Prison - Yahoo Finance",
        "content": "Gary James Harmon of Ohio was sentenced to four years and three months in prison for stealing 712 Bitcoin that belonged to his brother, the U.S. Department of Justice has announced.\n\nHarmon pleaded guilty to criminal charges in January, faced with one count each of wire fraud and obstruction of justice, carrying a maximum sentence of 40 years combined.\n\nThe 712 Bitcoin in question—worth over $21 million at today’s prices—was taken by Harmon after the arrest of his brother in February 2020. According to the Justice Department, the funds were worth around $4.8 million at the time they were taken.\n\nHarmon’s brother, Larry Dean Harmon, was arrested in February 2020 for operating a coin-mixing service called Helix, which processed over 350,000 Bitcoin between 2014 and 2017 and partnered with several darknet markets, the Justice Department said.\n\nFormer Coinbase Manager's Brother Gets 10-Month Sentence for Insider Trading\n\nLarry Dean Harmon later pleaded guilty to a money laundering conspiracy and charges associated with the improper transmission of money in 2021. In addition to criminal charges, Larry Dean Harmon was hit with a $60 million penalty by The Financial Crimes Enforcement Network (FinCEN), the first penalty levied again a Bitcoin mixer.\n\nAs part of that prosecution, law enforcement seized several assets, including a “cryptocurrency storage device” that couldn’t be accessed initially due to certain security features, the Justice Department said.\n\nGary James Harmon was able to “covertly” send himself 712 Bitcoins on the device by recreating Bitcoin wallets with his brother's credentials. Harmon then laundered the assets further, sending the freshly-taken bitcoin to two other online mixing services, authorities said.\n\nWhen he agreed to hand over assets that stemmed from the 712 Bitcoin he took illegally, he agreed to forfeit cryptocurrencies that included 17.4 million Dogecoin, around 647 Bitcoin, and just over 2 Ethereum—altogether valued in excess of $20 million by the Justice Department.\n\nStory continues\n\nFrom 'Bitcoin Billionaires' to SEC Charges: A Brief Crypto History of the Winklevoss Twins\n\nThough advocates of coin mixers have called them necessary tools for maintaining the privacy of crypto transactions, government officials have taken aim at the services, deriding them as crucial to hackers and other bad actors.\n\nCoin mixers obfuscate the source and destination of funds by grouping various transactions together. And last summer, the U.S. Treasury Department announced sanctions against the coin mixer Tornado Cash, essentially banning people in the U.S. from engaging with the application.\n\nThe Treasury Department said Tornado Cash was being used by the North Korean state-sponsored hacking organization, Lazarus Group. The move drew condemnation from politicians like Rep. Tom Emmer and the whistleblower Edward Snowden, who called it a “​​do or die” moment for crypto.\n\nNew ‘Sinbad’ Bitcoin Mixer Unmasked As Formerly Sanctioned Blender\n\nThe crypto policy non-profit Coin Center is currently suing the Treasury Department, accusing it of government overreach in blacklisting the tool. And though his trial is pending, a Dutch court recently ruled that a Tornado Cash developer named Alexey Pertsev could be released on bail after spending nine months in detention.\n\nPertsev noted his freedom on Twitter on Friday, wondering what had gone on in the crypto space since he was arrested last August."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWJhbmstaml0dGVycy1wcmljZS1zcGVjdWxhdGlvbi0wNDQzNTYzNzQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin up on bank jitters, price forecasts; Ether dips, U.S. equity futures flat - Yahoo Finance",
        "content": "Bitcoin edged up on Monday morning in Asia on the first trading day of May to hold above the US$29,000 mark as worries about the U.S. banking system resurfaced and amid bullish price forecasts for the token. Ether dipped below US$1,900, paring its 5% gain in April. Most other top 10 non-stablecoin cryptocurrencies traded lower, though Binance’s BNB gained after the world’s biggest crypto exchange added the Sui blockchain to its Launchpool. Litecoin led the losers. U.S. equity futures traded flat to lower in Asia ahead of the Fed interest rate decision this week. All three major U.S. stock indexes logged gains for April.\n\nSee related article: Weekly Market Wrap: Bitcoin flirts with US$30,000, Ether regains US$1,900\n\nCrypto\n\nImage: Envato Elements\n\nBitcoin inched up 0.48% to US$29,309 in the 24 hours to 09:00 a.m. in Hong Kong, according to CoinMarketCap data, holding a weekly gain of 5.32%, after rising to as high as US$29,952 on Sunday.\n\nThe world’s largest cryptocurrency tested the lower US$27,000 line multiple times in April, but gained more than 4% for the month for the longest streak of monthly gains since March 2021. This could foreshadow a surge in 2023 that could send Bitcoin to US$105,000, according to a Bloomberg analyst report on Sunday.\n\nBitcoin could attract investment from global bond investors due to negative real rates and real returns, according to Jamie Coutts, a senior market structure analyst at Bloomberg Intelligence.\n\nEther dipped 0.81% to US$1,884, but was trading 0.34% higher for the week. The world’s second largest cryptocurrency gained over 5% for the month of April.\n\nBinance’s BNB jumped 5.56% to US$339.09, logging a weekly gain of 2.05%. Binance introduced Sui blockchain’s SUI token to its Launchpool on Monday, allowing Binance users to stake their BNB and TrueUSD (TUSD) to farm the recently launched SUI, whose price jumped over 20% in the past 24 hours.\n\nBNB also received a boost from Binance’s return to Japan. Sakura Exchange BitCoin (SEBC), a regulated crypto exchange platform in Japan that was acquired by Binance in November 2022, will end its domestic services by the end of May and start a new service under the name “Binance Japan” from June 2023, according to a notice by SEBC on Friday.\n\nStory continues\n\nLitecoin led the losers, falling 2.33% to US$88.67 but adding 1.56% for the week.\n\nThe total crypto market capitalization edged up 0.09% in the past 24 hours to US$1.20 trillion. The total trading volume over the last 24 hours rose 33.36% to US$32.79 billion.\n\nNFT\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index edged up 0.37% to 3,757.67 in the 24 hours to 9:00 a.m. in Hong Kong, but remained 0.55% lower for the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts. It is managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nMad Lads, a Solana-based NFT first minted on April 21, logged the largest seven-day sales volume across the market of over US$7.63 million, beating Bored Ape Yacht Club’s (BAYC) US$7.04 million, according to data from CryptoSlam. The floor price of the NFT was 63.75 SOL as of 09:30 a.m. in Hong Kong, almost 10 times higher than the first token minted at 6.9 SOL.\n\nBAYC, one of the biggest NFT collections by market cap, also saw a surge in sales volume in the past 24 hours, jumping 170.22% to US$1.05 million, the largest volume across the NFT market.\n\nEquities\n\nImage: Getty Images\n\nU.S. stock futures traded flat to lower as of 9:00 a.m. in Hong Kong. The Dow Jones Industrial Average futures inched down 0.03%. The S&P 500 futures and the Nasdaq Composite Index both dipped 0.04%.\n\n\n\nThe three indexes closed higher last Friday on strong earnings from Intel Corp. and Exxon Mobil Corp., and logged gains for both the week and the month of April, according to Reuters on Saturday.\n\nHowever, the stock market gains last week were overshadowed by worries about the banking industry. The share price of U.S.-based First Republic Bank plunged 43.20% on Friday after the lender reported a 40.8% drop in deposits, or around US$100 billion, since the start of the year. Regulators are preparing to take over and sell the embattled bank, with multiple large financial institutions having submitted bids, according to the Wall Street Journal on Monday, citing people familiar with the matter.\n\nMeanwhile in China, the world’s second-largest economy, the purchasing managers manufacturing index for April unexpectedly fell to 49.2 on month, missing expectations of a 51.4 gain, pointing to slower growth in the country, according to Reuters on Monday.\n\nThe Federal Reserve’s next move on interest rates is due on May 3. The Fed has repeatedly raised rates over the past year to bring inflation down to its target range of 2%. With U.S. inflation still trending at around 5%, analysts at the CME Group now expect an 85.5% chance the Fed will raise rates by 25 basis points this week.\n\nU.S. interest rates are currently between 4.75% to 5%, the highest since June 2006.\n\nSee related article: Coinbase says SEC’s legal threats punish transparency, undermine public listing process"
    }
]