[
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTAxL2JpdGNvaW4tYm91bmNlcy1vZmYtMzUtMDAwLWFmdGVyLXRvcHBpbmctdGhlLW1vc3QtcmVjZW50LWhpZ2jSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin Bounces Off $35000 After Topping the Most Recent High - Bloomberg",
        "content": "Bitcoin rose back to a more than 17-month high amid hopes the Federal Reserve is done with interest-rate hikes and expectations that a fresh source of demand is brewing in the exchange-traded fund industry.\n\nThe largest digital token added 4% in the past 24 hours and traded at $35,840 as of 10:53 a.m. in Singapore on Thursday. Some smaller coins climbed, including the Solana network’s SOL token, which is up 142% to $42 since mid-September."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTAxL21pY3Jvc3RyYXRlZ3ktbXN0ci1wb3N0cy1hZnRlci10YWtpbmctd3JpdGVkb3duLW9uLWJpdGNvaW4tYnRjLWhvbGRpbmdz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "MicroStrategy (MSTR) Posts After Taking Writedown on Bitcoin (BTC) Holdings - Bloomberg",
        "content": "MicroStrategy Inc., the enterprise-software maker that is the largest publicly-traded holder of Bitcoin, posted a third-quarter loss after taking a writedown because of a decline in the value of the cryptocurrency.\n\nThe Tysons Corner, Virginia-based company’s net loss widened to $143.4 million, or $10.09 a share, from $27 million, or $2.39, in the year-ago period. Revenue from the software business rose about 3% to $129.5 million, above the average forecast of $125.8 million of analysts surveyed by Bloomberg."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTAxL3NheWxvci1zLW1pY3Jvc3RyYXRlZ3ktbXN0ci1xdWVzdGlvbnMtb3duLWJpdGNvaW4tcHJlbWl1bS13aXRoLWV0ZnMtbG9vbWluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin Proxy MicroStrategy Questions Own 'Premium' With ETFs Looming - Bloomberg",
        "content": "MicroStrategy Inc. Chairman Michael Saylor’s strategy of buying Bitcoin may be coming into question as the advent of exchange-traded funds holding the largest cryptocurrency appears imminent.\n\nSaylor has turned the once struggling software company into a Bitcoin proxy for equity investors by accumulating more than $5.5 billion of the cryptocurrency since the middle of 2020. During that time, shares of MicroStrategy have more than tripled as Bitcoin surged in value. The benchmark Standard & Poor’s 500 Index gained about 40% during the same period."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY291bGQteW91LWhhdmUtd29uLTEwMDAwLWJpdGNvaW4tYWxleC1qb25lcy1taXNzZXMtb3V0LW9uLSQzNDRtLXByaXplLWluLW1heC1rZWlzZXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "Could You Have Won 10000 Bitcoin? Alex Jones Misses Out On $344M Prize In Max Keiser's Crypto Quiz - Nasdaq",
        "content": "Infowars host Alex Jones failed to answer any of the questions in a Bitcoin (CRYPTO: BTC) quiz, missing out on a chance to win 10,000 BTC, equivalent to $344 million.\n\nWhat Happened: The quiz, set by Bitcoin maximalist and Orange Pill podcast host Max Keiser, aimed to test Jones’ knowledge about the leading cryptocurrency.\n\nDuring the Bitcoin challenge, Jones failed to provide accurate responses to any of the five questions posed by Max Keiser. The difficulty became apparent from the outset as Jones stumbled through each question.\n\nAfter Jones passed on the first question, Keiser said, “You’ve lost this quiz already; you can’t even get a simpler question than that.”\n\n🔥🔥🔥 @MaxKeiser gives Alex Jones a simple 5 question #Bitcoin quiz for 10,000 #BTC's ($350,000,000 USD) 🤯 pic.twitter.com/3XL6DXJQbk\n\n— Crypto News Alerts 🔥🎙 (@CryptoNewsYes) October 31, 2023\n\nThe questions presented by Keiser during the Bitcoin challenge encompassed key aspects of the cryptocurrency landscape.\n\nThey included questions about the total number of Bitcoins in existence, the frequency of difficulty adjustments, the core hashing algorithm’s name, the average block formation rate, and whether Craig Wright is Satoshi Nakamoto — the pseudonymous creator of Bitcoin.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nSee More: A Stay At The Floating Palace From James Bond's ‘Octopussy\n\nWhy It Matters: Jones disclosed in 2021 that he had lost the laptop containing the generous gift of 10,000 Bitcoins given to him by Keiser. During an appearance on the Flagrant 2 show with Andrew Schulz and Akaash Singh, Jones confessed that Keiser had presented him with the laptop containing 10,000 BTC a decade ago.\n\nEarlier in September, Keiser made critical remarks about crypto influencer Ben Armstrong. “My advice to crypto boy is to get to a shi*coiners Anonymous (SA) meeting and get off the shi*coin crack pipe as soon as you can. It doesn’t get better. If you keep OD’ing on shi*coins your life can only get worse. SHI*COINS ARE POISON. Look what they did to this poor guy.”\n\nPrice Action: At the time of writing, Bitcoin was trading at $34,281 up 0.20% in the last 24 hours, according to Benzinga Pro.\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\nImage created via photos on Shutterstock\n\n© 2023 Benzinga.com. Benzinga does not provideinvestment advice All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLWNyeXB0by1zdG9ja3MtYnV5LXF1aWNrLTE5MTgwMjI4Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 01 Nov 2023 07:00:00 GMT",
        "title": "3 Crypto Stocks to Buy for a Quick Double if Bitcoin Touches $50,000 - Yahoo Finance",
        "content": "With a renewed rally, Bitcoin (BTC-USD) has surged by almost 23% in the last month. This is not unusual, with cryptocurrencies having a reputation for skyrocketing in quick time. Bitcoin is likely to trade above $50,000 in the next few months. Besides exposure to quality cryptocurrencies, consider buying some of the best crypto stocks for robust returns.\n\nThe news of the possibility of a spot ETF for Bitcoin will likely be a key upside catalyst. Additionally, Bitcoin’s halving is due in 2024 and will have a positive impact on the digital asset.\n\nFurther, the rise in geopolitical tensions has supported the flow of funds into Bitcoin. If these factors were insufficient, I would add that potential rate ruts are due next year. A weak dollar is positive for all risky asset classes.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLet’s discuss three crypto stocks to buy at current levels.\n\nCoinbase Global (COIN)\n\nA Bitcoin rests on top of a computer with the Coinbase (COIN) logo and a trading chart.\n\nSource: Nadezda Murmakova / Shutterstock.com\n\nCoinbase (NASDAQ:COIN) stock has already surged by 129% year-to-date. However, the rally from oversold levels does not make COIN stock expensive. I would bet on another 100% returns if Bitcoin touched $50,000.\n\nIt’s worth noting that Coinbase is among the top five centralized exchanges globally. The company stands to benefit if there is a cryptocurrency bull market. Trading and speculation will likely increase, translating into higher income for Coinbase.\n\nIn March 2023, Coinbase initiated an international expansion drive in six continents. This is important to mention as the company has been making steady business progress during the cryptocurrency bear market. Global expansion and the continued addition of new digital assets to the platform are other factors that will boost trading volumes.\n\nCoinbase ended Q2 2023 with cash and equivalents of $5.5 billion. With adjusted EBITDA turning positive, the company has high financial flexibility to make aggressive investments for growth.\n\nStory continues\n\nRiot Platforms (RIOT)\n\nIn this photo illustration, the Riot Platforms (RIOT) logo is displayed on a smartphone screen.\n\nSource: rafapress / Shutterstock.com\n\nRiot Platforms (NASDAQ:RIOT) is possibly the best Bitcoin mining stock to consider at current levels. After touching highs of $20.7 in July, RIOT stock has corrected to $9.8. This presents a good accumulation opportunity. If Bitcoin touches $50,000 in the next few quarters, RIOT stock will likely triple.\n\nFrom a fundamental perspective, Riot is attractive, with $510 million in cash and digital assets. Further, the company has a zero-debt balance sheet that provides high financial flexibility.\n\nRiot also has ambitious expansion plans. As of Q3 2023, the company reported a hash rate capacity of 10.7EH/s. The company expects to expand capacity to 20.1EH/s by Q4 2024 and further to 35.4EH/s in 2025.\n\nThis will likely translate into robust revenue and cash flow upside if Bitcoin remains in an uptrend. As the company’s financial flexibility increases further, there is a strong case for diversification-driven growth.\n\nBitfarms (BITF)\n\nBitcoin and crypto mining farm. Big data center. High tech server computers at work. Bitfarms (BITF) mines crypto.\n\nSource: PHOTOCREO Michal Bednarek / Shutterstock.com\n\nI am also tempted to talk about a penny crypto stock to buy as Bitcoin trends higher. Bitfarms (NASDAQ:BITF) is another attractive Bitcoin miner that seems poised to deliver multibagger returns. On a very conservative basis, BITF stock will double from current levels. However, I would not be surprised with 3x to 5x returns if Bitcoin is at $50,000.\n\nAs of September, Bitfarms reported a mining capacity of 6.1EH/s with a year-on-year growth of 45%. The important point to note is that Bitfarms reported a liquidity buffer of $65 million for Q2 2023. Additionally, the company expects to be debt free by February 2024. Therefore, there is high financial flexibility to pursue aggressive expansion.\n\nAnother positive is that the company is a low-cost Bitcoin miner. For Q2 2023, Bitfarms reported direct cost of production at $15,700 per Bitcoin. Assuming a scenario where Bitcoin trades above $50,000, the company will be positioned to report healthy EBITDA and cash flows. A big rally from current levels, therefore, seems entirely likely.\n\nOn the date of publication, Faisal Humayun did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nFaisal Humayun is a senior research analyst with 12 years of industry experience in the field of credit research, equity research and financial modeling. Faisal has authored over 1,500 stock specific articles with focus on the technology, energy and commodities sector.\n\nMore From InvestorPlace\n\nThe post 3 Crypto Stocks to Buy for a Quick Double if Bitcoin Touches $50,000 appeared first on InvestorPlace."
    }
]