[
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTEwLTI1L3Nob3VsZC15b3UtYnV5LWNyeXB0by1hZnRlci10aGUtYml0Y29pbi1ib3VuY2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Should You Buy Crypto After the Bitcoin Bounce? - Bloomberg",
        "content": "Welcome to Money Distilled. I’m John Stepek. Every week day I look at the biggest stories in markets and economics, and explain what it all means for your money.\n\nA quick scheduling note: I’m out of the office for the next two days, so there won’t be a newsletter tomorrow or Friday. I’ll be back on Monday, ahead of a week in which we get lots of housing market data plus a Bank of England interest rate decision."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTI1L2JpdGNvaW4taGFzLW1vcmUtdGhhbi1kb3VibGVkLXRoaXMteWVhci1pbi11bmZvcmVzZWVuLXJlc3VyZ2VuY2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) More Than Doubled in 2023 in Unforeseen Resurgence - Bloomberg",
        "content": "Bitcoin has now more doubled in value this year in a surprising resurgence from a tumultuous 2022 that had some skeptics predicting the demise of digital assets.\n\nThe largest cryptocurrency by market value rallied for a third day, pushing the price back to around $35,000, the highest level in about 18 months. Bitcoin tumbled 64% last year amid industry scandals and bankruptcies. It reached a record of almost $69,000 in late 2021."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMTAvMjUvYml0Y29pbi1pcy10aGUtbW9zdC1kaXNjaXBsaW5lZC1jZW50cmFsLWJhbmstaW4tdGhlLXdvcmxkLXNheXMtYW50aG9ueS1wb21wbGlhbm8uaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin is 'the most disciplined central bank' in the world, says Anthony Pompliano - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin is 'the most disciplined central bank' in the world, says Anthony Pompliano\n\nAnthony Pompliano, Pomp Investments founder and partner, joins 'Squawk Box' to discuss the state of bitcoin after it crossed $35,000 earlier this week for the first time since 2022, what's behind the latest surge, the status of bitcoin ETF's approval, and more."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLWNyeXB0b2N1cnJlbmNpZXMtZGVzdGluZWQtbmV4dC1iaXRjb2luLTA5NDAwMDAyNi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "3 Cryptocurrencies Destined to Be the Next Bitcoin - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) is a phenomenal success story. The numbers behind it are truly eye-popping. For example, between 2010 and 2022 Bitcoin provided average annual returns of 1,576% and a total return of 18,7912%.\n\nIts market capitalization of $602 billion accounts for approximately 60% of the total capital in the entire cryptocurrency market. Despite some spectacular scams, crypto is here to stay and many incredible projects that will solve real problems are currently being built.\n\nThus, crypto investors are bound to continue to search for “the next Bitcoin.” To find those returns look for utility and integration into the wider financial system. That’s the key.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nQuant (QNT-USD)\n\nThe logo for the Quant cryptocurrency network is displayed in white on a black background.\n\nSource: Zeedign.com / Shutterstock.com\n\nQuant (QNT-USD) has defined utility as the focal point of its development. It is working to facilitate interoperability between multiple blockchains. In essence, Quant connects individual blockchains through decentralized applications (dApps). dApps are Web 3.0 apps in a sense and allow users to interface with blockchains. Quant is facilitating a big idea that’s difficult to fathom completely but remains one that is hugely important nonetheless.\n\nAnother thing to note about Quant and the other cryptos listed below is that all are ISO 20022 compliant. ISO 20022 is a global standardization body that governs commercial and industrial standards. In this case, those related to financial system integration. By 2025, all financial institutions must be able to process ISO compliant payment transactions. Quant is going to be mainstream and investors should realize that and act accordingly.\n\nInteroperability is the name of the game. Cryptocurrency is still in its Wild West phase but ISO 20022 compliance and integration will bring those that meet the standard into the mainstream of finance.\n\nHedera (HBAR-USD)\n\nConcept tokens for Hedera Hashgraph (HBAR) on a black keyboard.\n\nSource: Shutterstock\n\nHedera (HBAR-USD) has established an important first-mover advantage that makes it part of the conversation to identify the next Bitcoin. It has become deeply associated with enterprise utility. Corporations moved into crypto during the pandemic to varying degrees and continue to integrate crypto today. Hedera is among the first names that enterprises will think of as crypto opportunities increase. When it comes time to add functionality, Hedera has that opportunity because it laid the groundwork.\n\nStory continues\n\nIt is also ISO 20022 compliant which only strengthens that narrative. Larger financial institutions are developing crypto businesses in house. Hedera may not have a great opportunity to break into those enterprises. However, SMEs don’t have as many resources as the big banks do. Sooner or later, they’re going to seek crypto integration and functionality en masse. That is among the best reasons to invest in Hedera overall. The project is preparing for fintech opportunities that are being established by the day. Hedera’s ISO 20022 compliance is a crystal clear example of its goals and direction and shouldn’t be ignored.\n\nCardano (ADA-USD)\n\nCardano crypto logo\n\nSource: RuskaDesign / Shutterstock.com\n\nCardano (ADA-USD) has also ticked the ISO 20022 compliance box. Cardano is being developed with the goal of long-term success as its primary purpose. Long-term success means a reliance on computer science and empirical evidence to guide its development. Unsexy stuff at its heart. Perhaps that’s why Cardano doesn’t get much attention overall. It’s the polar opposite of meme coin nonsense and aims to build utility first and foremost.\n\nIt’s easy to imagine that the developers at Cardano understand that the game is really about wider integration. Cardano, and any other long-term winners, are going to win by being part of the evolution of money. That means development ultimately is evolution and integration into the financial system, not a wholesale replacing of the financial system. I’m sure that the empirical evidence draws similar conclusions. Cardano is sure to listen and that’s why it’s got a great chance of winning in the long term.\n\nIt may not exactly fit the ideal frame of “the next Bitcoin” in that Cardano’s value can’t realistically increase to $28k. It currently trades for less than 30 cents. However, it does have the potential to grow over the next decade like Bitcoin did from 2010-2020.\n\nOn the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nAlex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.\n\nMore From InvestorPlace\n\nThe post 3 Cryptocurrencies Destined to Be the Next Bitcoin appeared first on InvestorPlace."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy91cy1zcG90LWJpdGNvaW4tZXRmcy1jcnlwdG8tMDcxMjE1OTM0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 25 Oct 2023 07:00:00 GMT",
        "title": "US spot Bitcoin ETFs — crypto's silver bullet? - Yahoo Finance",
        "content": "One approval and the dominoes will fall. That’s the dogma driving expectations for a U.S. spot Bitcoin exchange-traded fund (ETF). If only the industry’s bogeymen at the U.S. Securities and Exchange Commission (SEC) would approve that one application, approvals will snowball, institutional cash will flood in, and all will be right in the world of the blockchain.\n\nThat goal appeared to edge a step closer Monday. The SEC confirmed it will not contest a court decision in favor of digital asset investment firm Grayscale’s right to convert its GBTC (Grayscale Bitcoin Trust) into a spot Bitcoin ETF. Bitcoin was up over 19% for the past seven days on the back of the news, sitting above the US$34,000 support level as of 2.30 p.m. Wednesday in Hong Kong, according to CoinMarketCap data. The coin briefly broke US$35,000 during Tuesday trading, its highest level since May 2022.\n\nA Grayscale spokesperson said that the company now hopes to “work constructively” with the SEC on its efforts to convert GBTC — currently the world’s largest cryptocurrency fund with US$16.7 billion in assets under management — into a spot Bitcoin ETF. “GBTC is operationally ready, and we intend to move as expeditiously as possible on behalf of our investors,” the spokesperson said.\n\nBut it’s not just Grayscale investors who are waiting for a U.S. spot Bitcoin ETF. The financial instrument — which would allow investors a way to invest in the coin on a traditional exchange — is seen as a way to open up the still marginal world of crypto investment to traditional finance.\n\n“You’re going to have a lot of people getting into crypto by the way of an ETF,” said Jack Jia, head of crypto at payment platform Unlimit. He said the primary benefit of a spot Bitcoin ETF is that it improves the user experience (UX) for would-be crypto investors.\n\n“They won’t need to use account abstraction or a custodial wallet because their UX is their broker,” Jia added. “They’re telling their customers or their clients to buy Bitcoin. So that is going to be the onboarding process, if you will.”\n\nStory continues\n\nOther than Grayscale, a range of institutional investors, from BlackRock to Fidelity to Ark Invest, have applied to the SEC for permission to create a spot Bitcoin ETF in the U.S., the world’s largest economy. The SEC has so far either rejected or delayed making a decision on the applications, citing fears about a lack of liquidity and price manipulation in crypto markets.\n\nBut Vivian Fang, a FinTech expert and professor of finance at Indiana University, said she sees various signs that the SEC is now “warming up” to the idea of approving a spot Bitcoin ETF. She pointed to recent comments coming out of the regulator that it now considers the Bitcoin market to be of a sufficient size to resist market manipulation.\n\nThis, Fang said, has made her feel “cautiously optimistic” that the SEC will approve at least one spot Bitcoin ETF application by the end of this year.\n\nBullish behavior\n\nAccording to research released Oct. 16 by blockchain data firm CryptoQuant, an SEC decision to allow the creation of spot Bitcoin ETFs by the seven largest asset managers with pending applications could bring up to US$155 billion into the Bitcoin market. Based on their analysis of the coin’s past bull run behavior, CryptoQuant calculated that would increase Bitcoin’s market capitalization by US$450 billion to US$900 billion, adding US$1 trillion to the wider crypto market along the way.\n\nThe Next Wave of #Bitcoin Institutional Adoption:\n\nThe Launch of Spot ETFs\n\n\n\n– SPOT ETFS AS THE NEW WAY OF INSTITUTIONAL ADOPTION.\n\n– IMPLICATIONS OF ETF APPROVALS FOR BITCOIN MARKET CAPITALIZATION.\n\n\n\nPrepared by Our Head of Research, @jjcmoreno.\n\n\n\nLink👇https://t.co/dKyd5GJJdT pic.twitter.com/ECEWMpkf0g — CryptoQuant.com (@cryptoquant_com) October 16, 2023\n\nThe crypto market has, over the past week in particular, shown a wholehearted desire to buy into that narrative. Crypto media picked up on a social media post Oct. 16 saying the SEC had approved BlackRock’s spot Bitcoin ETF application. The crypto market blew up. The price of Bitcoin soared nearly 10%, rising to around US$30,000 before falling back down to the US$28,000 range.\n\nThe news, it turned out, was fake. Regardless, there was around US$100 million in BTC liquidations in the first 30 minutes following the story. Cointelegraph, the media organization that first reported on the misleading post, issued a clarification statement apologizing for the error. But the damage — or the improvement, depending on which way you look at it — was done.\n\nWhether or not the original post was a legitimate attempt to manipulate the market or simply a prank gone too far, the fake news attracted a flood of interest and mainstream media attention to the ongoing ETF discussion.\n\nBlackRock Chief Executive Officer Larry Fink, once a vocal skeptic of the crypto industry, appeared on a Fox Business broadcast, saying that the Bitcoin price rally to US$30,000 was more than just investors buying the rumor. Rather, he said, it was “an example of pent-up interest in crypto” trading as a “flight to quality” during a time of geopolitical uncertainty.\n\nOn Monday, Oct. 23, as the market digested the likelihood the SEC would forgo an appeal on the Grayscale decision, an ETF analyst at Bloomberg Intelligence highlighted that BlackRock had listed its spot Bitcoin ETF on the Depository Trust and Clearing Corporation (DTCC) website.\n\nA bullish sign that the ETF could soon see approval from the SEC, Bloomberg Intelligence ETF specialist Eric Balchunas posted to X (formally Twitter) that this was “another step in the process of launching.”\n\nNote: Seeding is typically not a lot of money just enough to get ETF going. So I wouldn't read this as 'omg Blackrock is buying a ton of bitcoin' at all but more the fact they doing it and disclosing it shows another step in the process of launching. — Eric Balchunas (@EricBalchunas) October 23, 2023\n\nRoad bumps\n\nWhile the road ahead for one, if not multiple spot Bitcoin ETF approvals appears to be growing smoother, there are potential road bumps ahead. For Adam Berker, senior legal counsel at global payment platform Mercuryo, the principal obstacle remains the potential for lawsuits against the SEC.\n\n“If the regulator were to accept the ongoing application from BlackRock, it may be criticized in the future over why it gave a green light for a large institutional player from the [traditional finance] sector while raising so much fuss over younger and smaller crypto projects,” Berker said via a note.\n\nThe past 18 months in the crypto industry have been characterized by corporate failures and capital flight resulting in a two-thirds drop off in the value of a once US$3 trillion industry. From the perspective of many crypto advocates, much of those losses were caused by increased scrutiny and so-called “regulation by enforcement” from the SEC and fellow regulator the Commodity Futures Trading Commission (CFTC).\n\nThe two regulators have sued a number of crypto firms throughout that period, including cryptocurrency exchanges Binance and Coinbase, alongside blockchain software firm Ripple. They have also prevented some cryptocurrency-related financial products such as a spot Bitcoin ETF from taking off. Finance professor Fang described the spate of lawsuits as part of an ongoing “turf war” between the two regulators as to who gets to regulate the crypto industry in future.\n\nThe lack of clarity on that issue, Fang said, adds to a number of other uncertainties hanging over crypto and potentially hampering the creation of a spot Bitcoin ETF. Chief among those is the question of whether or not cryptocurrencies are securities.\n\n“If they are, then the SEC must regulate them as it regulates stocks and bonds, but I am not sure the SEC can or has resources to (even if it wants to),” Fang wrote in an email. “For example, can the SEC demand all investors of Bitcoin be registered (the KYC rule)?”\n\nWith regulators unwilling to adopt a particular position on those issues, Fang added, the prospect of a spot Bitcoin ETF appears less like a silver bullet for the crypto industry and more like a stop-gap measure as the different regulators get their houses in order.\n\n“I view a spot Bitcoin ETF as a bone that the SEC is willing to throw to the industry after taking a tough stance against many crypto exchanges,” Fang said."
    }
]