[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzExL2JpdGNvaW4taXMtZnVuZGFtZW50YWxseS1kaWZmZXJlbnQtZnJvbS1vdGhlci1jcnlwdG9jdXJyZW5jaWVzLWZpZGVsaXR5LWRpZ2l0YWwtYXNzZXRzL9IBhwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzExL2JpdGNvaW4taXMtZnVuZGFtZW50YWxseS1kaWZmZXJlbnQtZnJvbS1vdGhlci1jcnlwdG9jdXJyZW5jaWVzLWZpZGVsaXR5LWRpZ2l0YWwtYXNzZXRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Is Fundamentally Different From Other Cryptocurrencies: Fidelity Digital Assets - CoinDesk",
        "content": "“Bitcoin should be considered first and separate from all other digital assets that have followed it,” and it should be viewed as an entry point for traditional allocators looking to gain exposure to the sector, the report added."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTExL2JpdGNvaW4tYnRjLWJyZWFjaGVzLTI3LTAwMC13aXRoLW1pZGRsZS1lYXN0LWNvbmZsaWN0LXdlaWdoaW5nLW9uLXNlbnRpbWVudNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Breaches $27000 With Israel-Hamas War Weighing on Sentiment - Bloomberg",
        "content": "Bitcoin fell a fifth day, dropping below $27,000 for the first time since September, with traders citing the conflict in the Middle East as weighing on investor sentiment.\n\nThe largest digital asset by market value slumped as much as 3.2% to $26,541, the biggest drop in a month. Smaller tokens such as Solana and Polygon declined less."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTExL2JpdGNvaW4tYnRjLWJyZWFjaGVzLTI3LTAwMC13aXRoLW1pZGRsZS1lYXN0LWNvbmZsaWN0LXdlaWdoaW5nLW9uLXNlbnRpbWVudNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Breaches $27000 With Israel-Hamas War Weighing on Sentiment - Bloomberg",
        "content": "Bitcoin fell a fifth day, dropping below $27,000 for the first time since September, with traders citing the conflict in the Middle East as weighing on investor sentiment.\n\nThe largest digital asset by market value slumped as much as 3.2% to $26,541, the biggest drop in a month. Smaller tokens such as Solana and Polygon declined less."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3Lmt3dHguY29tLzIwMjMvMTAvMTIvbWNsZW5uYW4tY291bnR5LXJlc29sdmVzLWJpdGNvaW4tc2V0dGxlbWVudC1hZnRlci1hZG1pdHRpbmctZnVuZHMtc2VpemVkLWVycm9yL9IBfmh0dHBzOi8vd3d3Lmt3dHguY29tLzIwMjMvMTAvMTIvbWNsZW5uYW4tY291bnR5LXJlc29sdmVzLWJpdGNvaW4tc2V0dGxlbWVudC1hZnRlci1hZG1pdHRpbmctZnVuZHMtc2VpemVkLWVycm9yLz9vdXRwdXRUeXBlPWFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "McLennan County resolves Bitcoin settlement after admitting funds seized in ‘error’ - KWTX",
        "content": "WACO, Texas (KWTX) - McLennan County officials have resolved a lawsuit that claimed sheriff’s investigators unlawfully seized funds from a Bitcoin ATM after an 82-year-old Crawford woman reported scammers convinced her to convert $15,000 into Bitcoin cryptocurrency.\n\nLux Vending, which does business as Bitcoin Depot, agreed to dismiss the lawsuit and allow the woman to keep her money after McLennan County Judge Scott Felton admitted that the funds were seized “in error” and that it was premature for the sheriff’s office to have returned the money to her.\n\nLux’s lawsuit against the sheriff’s office alleged investigators violated due process procedures when it obtained a search warrant to seize the money from one of its kiosk machines at a Sunoco store at 7500 Bosque Blvd. The suit also asked a judge to declare Bitcoin Depot the rightful owner of the cash.\n\nMcLennan County Sheriff Parnell McNamara, who said in June that his officers “did everything right” and that Bitcoin Depot officials “can go to hell,” declined comment Wednesday about the dismissal of the lawsuit. He also declined comment when asked about Felton’s comments in a letter to Bitcoin Depot’s chief operating officer that said the funds were seized in error.\n\nScott Buchanan, COO for Bitcoin Depot, said in a statement that the company cully cooperated with McLennan County law enforcement throughout the process. Buchanan reiterated Bitcoin Depot’s “diligence in protecting its customers from illegal activity, cooperating with law enforcement officials to reach a resolution and enacting procedures to help identify and eliminate future bad actors seeking to take advantage of unsuspecting citizens.”\n\nFelton did not respond to messages from KWTX on Wednesday.\n\n“The seizure of the money at that time was an error based on a misunderstanding that the funds belonged solely to the customer, not the company,” Felton wrote in a letter to Bitcoin Depo obtained by KWTX. “…Due to the timing of the communication and the return of the funds happening at the same time, the money was not maintained by law enforcement officials and, instead, was provided to the victim.”\n\nFelton wrote that because of a “misunderstanding and the difficulty in communication,” McLennan County officials were not aware of the company’s terms and conditions. He acknowledged the money no longer legally belonged to the customer at the time the cash was returned.\n\n“The release of the money to the McLennan County resident was based on a good faith belief that there were no competing claims for the legal interest of the money,” Felton wrote. “Officials later determined that it was premature to have distributed the money which was seized for ‘evidentiary purposes.’”\n\nFelton wrote he appreciated the company’s cooperation in trying to identify the scammer.\n\nWaco attorney Mike Dixon, who represents the county, said Bitcoin agreed to dismiss the lawsuit and the woman got to keep her money. The county paid Bitcoin Depot nothing, he said.\n\n“All Bitcoin wanted was a letter showing they weren’t the bad guys here, that they had procedures and warnings in place to try to stop this from happening and that they tell people not to send Bitcoin to wallets the person does not control,” Dixon said. “So it was more about making it clear that Bitcoin Depot wasn’t the scammer. This was a third-party international scammer and Bitcoin Depot was helpful in assisting and trying to locate the scammer.”\n\nThe Crawford woman reported the elaborate scam to the sheriff’s office on April 27, and a detective got a search warrant on May 3 to seize the money from the Bitcoin kiosk.\n\nAccording to the search warrant affidavit, the woman said she was online looking up cooking recipes when she received an email with a link to view a recipe. She clicked the link, which the affidavit said appears to have activated a “Ransomware” computer virus.\n\nShe contacted “customer support” and was transferred to a “fraud investigator,” the affidavit states. She was told all her personal information had been compromised and that the fraud department could help her work through the problem.\n\nThe woman said she should contact her bank and law enforcement but was told it was not necessary because at that point, nothing had happened with her bank account and a “computer virus” was not something law enforcement would respond to, according to the affidavit.\n\nNext, the “fraud investigator” asked if she had written a check for a laptop. She said no, and the “fraud investigator” said a check just cleared the bank that someone wrote to pay for a laptop.\n\n“The ‘fraud investigator’ then told (the woman) he could see where a check was written to a construction company in the amount of $15,000, which had not cleared yet. (The woman) was then given instructions on how to prevent the loss of this amount of money,” the affidavit states.\n\nThe woman was told to drive to her bank, make a $15,000 cash withdrawal and then go to the store and deposit it into the Bitcoin machine. She said she knew nothing about Bitcoin and told the man she was going to call law enforcement.\n\n“(The woman) said the person on the phone stressed that essentially the longer she took to get the money out of the bank the closer the check could be to clearing,” the affidavit says. “(The woman) said she followed the instructions and that the guy stayed on the phone with her the entire time. (The woman) said she deposited $15,000, $100 at a time.”\n\nMcNamara said in June the issue is no different than his agency recovering stolen cars, guns or four-wheelers and returning them to their rightful owners.\n\nCopyright 2023 KWTX. All rights reserved."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vbmV3cy5ibG9vbWJlcmdsYXcuY29tL3VzLWxhdy13ZWVrL3doYXQtZ3JheXNjYWxlcy12aWN0b3J5LWluLWJpdGNvaW4tY2FzZS1tZWFucy1mb3ItY3J5cHRvLW1hcmtldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 11 Oct 2023 07:00:00 GMT",
        "title": "What Grayscale's Victory in Bitcoin Case Means for Crypto Market - Bloomberg Law",
        "content": "The US Court of Appeals for the D.C. Circuit grabbed the attention of legal and crypto communities when it ruled, in Grayscale Investments v. SEC, that the agency had acted unlawfully in denying Grayscale’s application for a Bitcoin exchange-traded fund or ETF.\n\nAlthough the decision was a significant win for Grayscale and the crypto industry, commentators may have missed important nuance. The decision appears to reflect a technical application of standard administrative law doctrine—and perhaps not, as commentators have assumed, a blanket rebuke of the SEC’s reluctance to embrace crypto.\n\nGrayscale Decision\n\nThe case stems from the SEC’s denial of Grayscale’s application to list a spot Bitcoin ETF, versus a Bitcoin futures ETF, on a national exchange. An ETF is an investment vehicle designed to track an asset’s value. While spot ETFs hold the asset itself, other ETFs hold derivates such as futures, which are contracts to buy or sell an asset at a predetermined price on a later date.\n\nThe SEC’s decision teed up a quintessential administrative law issue: whether the agency’s action was “arbitrary and capricious,” and therefore unlawful, under the Administrative Procedure Act or APA.\n\nIn a unanimous opinion, a three-judge panel ruled that the SEC’s action was indeed arbitrary and capricious, as the agency’s denial of Grayscale’s spot Bitcoin ETF couldn’t be squared with the agency’s prior approvals of Bitcoin futures ETFs.\n\nAccording to the panel, the SEC’s inconsistent treatment of the products violated a bedrock principle of administrative law: An agency must treat like cases alike.\n\nAlthough the SEC had attempted to thread the needle between them—noting that Bitcoin futures ETFs enjoy superior market-surveillance and fraud-detection mechanisms compared with spot Bitcoin ETFs—the panel rejected the SEC’s proffered distinctions.\n\nFor both products, the panel observed, the relevant surveillance-sharing agreements were identical and equally likely to detect fraud. The panel also highlighted the SEC’s failure to explain why fraud in the spot Bitcoin market was no obstacle to approving Bitcoin futures ETFs but was a basis to reject spot Bitcoin ETFs.\n\nSignificant But Limited Victory\n\nSoon after, commentators celebrated the Grayscale decision as a resounding rebuke of the SEC’s reluctance to embrace, if not hostility toward, the crypto industry. They particularly emphasized the panel’s unanimity.\n\nThe opinion’s Trump-appointed author, Judge Neomi Rao, had joined an Obama-appointee, Judge Sri Srinivasan, and a Carter appointee, Judge Harry Edwards, to rein in the SEC and safeguard crypto from the agency’s power grab. Reports also seized on the harsh phrase that the panel had repeatedly employed to describe the SEC’s conduct: “arbitrary and capricious.”\n\nThen again, to quote former D.C. Circuit Judge Abner Mikva, “‘arbitrary and capricious’ is a term of art in the hands of a reviewing court and has connotations less pejorative than the plain meaning of the words would suggest.”\n\nThe APA’s arbitrary-and-capricious review, as US Supreme Court Justice Brett Kavanaugh explained, requires a court to “ensure[] that the agency has acted within a zone of reasonableness and, in particular, has reasonably considered the relevant issues and reasonably explained the decision.”\n\nPut simply by former Justice Byron White, the standard’s touchstone is “reasoned decision-making.” Across a broad array of subjects, courts have routinely applied this familiar formula to strike down agency actions as “arbitrary and capricious.”\n\nFrom this perspective, the decision may not represent the resounding legal and political rout that the crypto community has deemed it. The case was technical, narrow, and the latest in a series of decisions reflecting methodical and dispassionate applications of APA arbitrary-and-capricious review.\n\nThe three panelists here—Judges Rao, Srinivasan, and Edwards—are known for their scholarly approaches to appellate judging and deep expertise in administrative law.\n\nWhat Comes Next?\n\nThe SEC may petition for a rehearing with all the D.C. Circuit’s judges. But such en banc review requires a majority vote and is warranted only to “maintain the uniformity of the court’s decisions” or to resolve “questions of exceptional importance.” It’s doubtful the panelists’ peers would view this straightforward case as a worthy candidate.\n\nThe SEC may also petition the Supreme Court for certiorari review. But even assuming that the panel erred, the court isn’t in the business of mere error correction, and the decision—a run-of-the-mill application of the APA—doesn’t appear to raise an issue that would move the court to exercise its jealously guarded certiorari jurisdiction. Nothing is certain, however.\n\nIf the SEC doesn’t appeal the decision, it must comply. Yet the agency has room to maneuver. For example, the SEC could approve all spot Bitcoin ETF applications simultaneously—not only Grayscale’s, but also its competitors’—thus defeating any first-mover advantage.\n\nOr the SEC could deny Grayscale’s application on an alternative ground. The SEC could even backtrack on its prior decision to approve Bitcoin futures ETFs. To comply with the equal-treatment principle, an agency need not equalize up—it may also equalize down.\n\nSome of the Grayscale decision’s biggest winners are conventional investors and their financial advisers.\n\nCompared with Bitcoin futures ETFs, spot Bitcoin ETFs permit investors to avoid roll costs—those generated in a futures market after an investor rolls a short-term contract into a longer-term contract.\n\nAnd compared with directly purchasing Bitcoin, the ability to invest in a spot Bitcoin ETF might assuage investors, and their advisers, who seek exposure to Bitcoin but would find comfort in the familiarity of traditional investing.\n\nThis article does not necessarily reflect the opinion of Bloomberg Industry Group, Inc., the publisher of Bloomberg Law and Bloomberg Tax, or its owners.\n\n\n\nAuthor Information\n\nAndrew L. Schwartz, partner at Kasowitz Benson Torres, defends companies in securities litigation with additional focus on cryptocurrency, blockchain, and distributed ledger technologies.\n\nAmit R. Vora, special counsel at Kasowitz Benson Torres, focuses on appellate litigation and represents companies and individuals in constitutional, administrative, and financial matters.\n\nWrite for Us: Author Guidelines"
    }
]