[
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93ZWVrLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tc2VlLTE4NTExOTE3MC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum See Fourth Flat Week as TRON and Tether Surge - Yahoo Finance",
        "content": "It was the fourth consecutive week of flat prices. A generally slow news cycle meant that market leaders Bitcoin and Ethereum remained where they were last weekend.\n\nBitcoin depreciated a nominal 0.5% and currently trades at $26,815, while Ethereum rose 1% over the seven days and now enters the weekend at $1,829.\n\nOn Monday, an AI-generated photo depicting a fabricated explosion at the Pentagon briefly caused a selloff in stocks and Bitcoin.\n\nMarkets were decidedly flat across the board, with no top thirty cryptocurrency posting significant gains except TRON, which rallied 8% to $0.076778.\n\nTRON’s rally this week appears to have been driven by the climbing market capitalization of the U.S. dollar-pegged stablecoin Tether (USTD), as the latter inches towards overtaking its all-time high of $83.2 billion, set in May last year.\n\nAccording to CoinGecko, Tether may set a new high watermark any day now.\n\nTRON and USDT’s joint rally appears to be linked to the fact that the majority of USDT, approximately $46 billion, is issued on Tron, surpassing the $36 billion on Ethereum. Recent data shows a steep rise in USDT on the TRON network throughout 2023 so far.\n\nThe biggest losses among cryptocurrencies this week were posted by Internet Computer (ICP), which fell 6% to $4.88, and Lido DAO (LDO), which dropped 7.1% to $1.96.\n\nRon DeSantis Banned CBDCs in Florida—These States Could Be Next\n\nCoin politics\n\nCrypto is already a major talking point in Bitcoin-friendly Florida Governor Ron DeSantis’s campaign as he gets ready to run as the GOP’s candidate in next year’s U.S. presidential elections.\n\nDeSantis headlined an otherwise disastrous Twitter Spaces the day he announced his candidacy and told his host, Twitter/Tesla CEO Elon Musk, that Biden’s administration “[has] it out for Bitcoin, and if it continues for another four years, they’ll probably end up killing it.”\n\nOn Tuesday, The International Organization of Securities Commissions (IOSCO) released a report outlining policy recommendations for global crypto regulation as part of the public consultation process.\n\nStory continues\n\nIn a nod to the fall of FTX, the IOSCO recommendations warn regulators about crypto companies \"combining certain functions in a single legal entity or group of affiliated entities,” such as one entity running exchanges, trading firms, and custody businesses under one roof.\n\nOn Thursday, watchdog the European Systemic Risk Board (ESRB) released a report concluding that the industry’s economic impact is minimal, but advising vigilance and policymaking that monitors leveraged trading and the industry’s financial contagion risks.\n\nThat same day, the European Securities and Markets Authority (ESMA) and National Competent Authorities (NCAs) issued a statement saying that cryptocurrencies must be clearly labeled as unregulated and both investors and investment firms should understand the financial risks involved in trading them."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8taGF0ZXItcGV0ZXItc2NoaWZmLXVudmVpbHMtYml0Y29pbi1vcmRpbmFscy1uZnQtcHJvamVjdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Crypto hater Peter Schiff to drop Bitcoin Ordinals NFT art collection - Cointelegraph",
        "content": "In what seems like a parody but isn’t, economist, gold proponent and vocal crypto skeptic Peter Schiff has unveiled a collaborative nonfungible token (NFT) art collection on the Bitcoin network that will soon go up for auction.\n\nThe reaction from the crypto community has been mixed, with people generally baffled, amused or welcoming — especially Ordinals proponents — with some keen to point out the apparent hypocrisy.\n\nits a hack right?\n\n\n\ndid i just teleport to a different timeline?\n\n\n\nim so confused — Deezy (@CryptoDmack) May 26, 2023\n\nFor years, Schiff has actively bashed crypto — especially Bitcoin (BTC) — at any chance, with his arguments revolving around BTC being a Ponzi scheme with no inherent value.\n\nDespite all of that, Schiff unveiled the “Golden Triumph” NFT collection in a May 27 Twitter thread in collaboration with one of his “favorite artists,” who goes by the pseudonym “Market Price.“\n\n“This collaboration features the original painting ‘Golden Triumph’ as well as a series of prints and Ordinals inscribed on the Bitcoin blockchain,” he wrote.\n\nGolden Triumph consists of one physical painting on an oil linen canvas depicting a human hand holding a bar of gold, 50 prints on archival paper depicting the same image, and 50 digital versions inscribed as Ordinal NFTs on Bitcoin.\n\nThe collection will be sold via a two-part auction starting on June 2 and ending on June 9. For the Ordinals, the highest bidder will receive #1 of the collection, with the next 49 highest bidders receiving #2 to #50 in descending order.\n\nIt appears, however, that Schiff hasn’t done a complete turnaround on BTC, but has woken up to a use case for blockchain technology: verifiable ownership of assets such as art via NFTs.\n\nCommenting on Schiff’s tweet, Twitter user LoneStartBitcoin asked: “So... it’s valuable to put your ‘gold’ inscriptions on Bitcoin, but bitcoin [BTC] itself is not valuable?.”\n\n“Correct,” Schiff responded.\n\nRelated: Peter Schiff blames ‘too much gov’t regulation’ for worsening financial crisis\n\nAlongside his disdain for crypto, Schiff has also criticized NFTs on several occasions in the past.\n\nIn a blog post from March 2021, Schiff described NFTs as “fake assets” that offer nothing other than ownership of a digital image that can be “replicated endlessly” online.\n\n“But even as the owner of the image, you won’t be able to control access to it. The file has been copied thousands of times, so anyone with access to the internet can look at it as much as you,” he wrote.\n\nThe sharp change in sentiment follows in a similar vein to former United States President Donald Trump, who has also aggressively slammed crypto on multiple occasions before getting involved with NFTs.\n\nIn December 2022, Trump teased a “major announcement” that supporters thought was politically related before unveiling the Trump Digital Trading Cards collection.\n\nMagazine: NFT Creator: Top 10 crypto artist Trevor Jones on being rich, rekt and rich again"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWhvbGRzLTIwMC13ZWVrLWF2ZXJhZ2UtYXMtdHJhZGVyLXNheXMtaW5mbGVjdGlvbi1wb2ludC1pcy1oZXJl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Bitcoin holds 200-week average as trader says 'inflection point' is here - Cointelegraph",
        "content": "Bitcoin (BTC) held its most recent gains into May 27 as traders called for a change in “bearish” market sentiment.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\nTrader awaits “pretty major move” for BTC price\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it entered the weekend at around $26,700.\n\nThe week’s macroeconomic data from the United States had ended with a surprise, as a new Personal Consumption Expenditures (PCE) index print showed the economy weathering tighter financial conditions much better than expected.\n\nMarkets then began to price in a June interest rate hike from the Federal Reserve, which should form a headwind for risk assets but failed to dampen a BTC price rebound.\n\nDespite the price comeback, however, the mood remained overly cautious for some.\n\n“Retail is so extremely bearish on Bitcoin and Crypto, it’s almost insane,” Michaël van de Poppe, founder and CEO of trading firm Eight, argued.\n\n“People are stuck in the 2022 mindset.”\n\nPopular trader Skew noted Bitcoin’s strong reaction at the 200-week moving average (MA) near $26,000, with more key trend line challenges now in the making.\n\n“Price trying to reclaim 100D MA after nice move up from 200W MA. Price is currently pinned between 4H EMAs & 1D EMAs,” analysis of the 4-hour BTC/USD chart stated the day prior.\n\n“Expecting a pretty major move soon, inflection point is here imo.”\n\nBTC/USD 1-day candle chart on Bitstamp with 100-day, 200-week MA. Source: TradingView\n\nAdditional insights concluded that “froth” had cleared from exchanges, along with over $300 million of open interest on the largest-volume exchange, Binance.\n\n$BTC Binance Open Interest\n\nPrice is hovering around previous breakdown & majority of the OI has been cleared out\n\n\n\n-12K BTC ($320.9M)\n\n\n\na lot less froth in the market meaning whichever way spot moves, probably wouldn't fade it pic.twitter.com/dgb9OW2GnB — Skew Δ (@52kskew) May 27, 2023\n\nSkew is not the only well-known voice calling for a pronounced shift in BTC price behavior next. This week, Checkmate, lead on-chain analyst at Glassnode, predicted: “big moves coming.“\n\nA subsequent overview of some key on-chain metrics presented BTC/USD at a “decision point.“\n\nBitcoin price still “consolidating”\n\nFellow trader and analyst Rekt Capital stated that additional strength was still needed to flip the trajectory in the bulls’ favor.\n\nRelated: $160K at next halving? Model counts down to new Bitcoin all-time high\n\n“BTC still in the middle of the red downtrending channel, just consolidating here with the red resistance area above the crucial one to beat if sentiment is to decisively shift in the short-term,” he wrote, referring to a chart of 1-day timeframes.\n\nBTC/USD annotated chart. Source: Rekt Capital/ Twitter\n\nThat chart also showed the bearish head-and-shoulders pattern, something Rekt Capital previously warned could result in a longer-term bearish phase, including a trip toward $20,000.\n\nMagazine: ‘Moral responsibility’: Can blockchain really improve trust in AI?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2J1c2luZXNzL2Jsb2NrY2hhaW4tYml0Y29pbi1vcmRpbmFscy1hLWxlYXAtZm9yd2FyZC1mb3ItdGhlLWJpdGNvaW4tbmV0d29ya3MtdXRpbGl0eS0zMTAzOTE1L9IBgwFodHRwczovL3d3dy5maW5hbmNpYWxleHByZXNzLmNvbS9idXNpbmVzcy9ibG9ja2NoYWluLWJpdGNvaW4tb3JkaW5hbHMtYS1sZWFwLWZvcndhcmQtZm9yLXRoZS1iaXRjb2luLW5ldHdvcmtzLXV0aWxpdHktMzEwMzkxNS9saXRlLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "Bitcoin Ordinals: A leap forward for the Bitcoin network’s utility - The Financial Express",
        "content": "By Rajagopal Menon\n\nBitcoin, the unrivaled titan of cryptocurrencies, has recently witnessed a burst of energy with the introduction of the ordinals protocol. This groundbreaking development has ignited fervent debate within the Bitcoin community, injecting a fresh dimension into the digital currency. So, what exactly are ordinals? Why are they causing such a stir? And what implications could they hold for the future of Bitcoin?\n\nTo fully grasp the significance of ordinals, let’s start with a basic understanding of Bitcoin’s structure. As most Bitcoin enthusiasts are aware, each Bitcoin is composed of 100 million satoshis, or SATs. Ordinals, however, revolutionise this notion by enabling the individual transmission of SATs with the option to attach supplementary data. This data can take various forms, ranging from text and images to videos. This process of associating data with SATs is known as inscription. Impressively, over 100,000 inscriptions have already been created since the inception of ordinals earlier this week.\n\nThe name “ordinals” stems from the protocol’s unique approach to numbering sets based on the order of their mining. Among these 100,000-plus inscriptions, notable examples include ordinal punks and ordinal penguins. Given the Bitcoin and broader crypto communities’ proclivity for embracing and expanding on novel ideas, it is only reasonable to anticipate an influx of innovative and derivative concepts etched onto SATs. Crucially, these advancements have been made possible by the recent major upgrade to Bitcoin known as Taproot, which was implemented in late 2021.\n\nBut are these ordinals akin to NFTs (non-fungible tokens) on the Ethereum platform? The answer is both yes and no. While some distinctions can be drawn between ordinals and the familiar NFTs, the comparison holds merit. It is worth noting, however, that NFTs rely on smart contracts and often have their underlying assets hosted elsewhere, whereas ordinals are directly inscribed onto individual sets within blocks on the Bitcoin blockchain. In the press release accompanying their launch, as cited in Bitcoin magazine, it was emphasised that “ordinals are fully on-chain and do not require a side chain or separate token. Inscriptions inherit the simplicity, immutability, security, and durability of Bitcoin itself.” Furthermore, Casey Rodimore, the creator of ordinals, elucidated in an interview with Decrypt that “the ordinals protocol is just a system for numbering satoshis, giving individual sets a serial number, and then tracking them across transactions.”\n\nEssentially, ordinals have unveiled a new use case for the Bitcoin network, extending its utility beyond the mere transfer of value. Inscribed sets now compete for block space alongside regular BTC transactions, leading to an increase in network fees. While this might not sound ideal, it is crucial to remember that these fees serve as vital incentives for miners to secure the network. As block rewards diminish over time, network fees will inevitably become the primary reason for committing hash power to Bitcoin. In this context, ordinals contribute additional functionality to Bitcoin.\n\nAccording to Glassnode, ordinals have not only propelled the number of non-zero Bitcoin addresses to a record high of 44 million but have also ushered in a novel and unique chapter in Bitcoin’s history. This innovation generates network activity without necessitating the classical transfer of coin volume for monetary purposes. Consequently, the user base has expanded, exerting upward pressure on the fee market beyond the conventional investment and monetary transfer use cases.\n\nHowever, not everyone in the Bitcoin community agrees with this innovation. Adam Back, CEO of Blockstream and about as OG as they come, sees ordinals as a “frivolous waste of block space” and objects to “the sheer waste and stupidity of an encoding” that does not do anything efficient. This disagreement sums up the divide in the Bitcoin community, with some fervent and non-toxic Maxis like Adam and others believing that Bitcoin’s relative simplicity and limitations to storing and transferring value should be preserved at all costs, while more progressive voices argue that Bitcoin needs to adapt in order to thrive and survive.\n\nThis fundamental argument is unlikely to be resolved anytime soon, but one thing is for sure: ordinals are generating a lot of attention and debate within the Bitcoin community. This is a welcome change from the FUD that has been clouding the industry, and we can expect to hear more about ordinals and their impact on Bitcoin in the months and years to come.\n\nThe author is vice-president, WazirX\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZGVjcnlwdC5jby8xNDI2MzUveW91LWNhbi1lYXJuLWJpdGNvaW4tYnktcGxheWluZy1tb2JpbGUtc29saXRhaXJlLWdhbWVzLWhlcmVzLWhvdy1tdWNo0gFlaHR0cHM6Ly9kZWNyeXB0LmNvLzE0MjYzNS95b3UtY2FuLWVhcm4tYml0Y29pbi1ieS1wbGF5aW5nLW1vYmlsZS1zb2xpdGFpcmUtZ2FtZXMtaGVyZXMtaG93LW11Y2g_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 27 May 2023 07:00:00 GMT",
        "title": "You Can Earn Bitcoin by Playing Mobile Solitaire Games—Here's How Much - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe play-to-earn gaming craze might have faded, but believe it or not, there remains a slew of crypto-infused games out there that let you earn Bitcoin while you play—and you don’t have to buy any NFTs to get started.\n\nSolitaire is one of the most popular games to be injected full of Bitcoin rewards on iOS and Android, with no fewer than three competing takes that let you stack sats (or satoshis, a.k.a. 1/100,000,000 BTC) while stacking digital playing cards: THNDR Games’ Club Bitcoin: Solitaire, Bling Financial’s Bitcoin Solitaire, and Viker’s Solitaire - Card Game 2023.\n\nAll three games are broadly similar, serving up a simple game of digital solitaire that’s chock-full of obnoxious video ads. But all three games also truly do let you earn Bitcoin along the way and then withdraw it to a wallet. Keep your expectations in check, however: we’re talking pennies’ worth of BTC across hours of gameplay.\n\nAD\n\nAD\n\nAnd I’d know, because I played approximately two hours of each game to see how much Bitcoin I could earn from each. Here’s a brief review of each game (played on iPhone), along with a verdict on which Bitcoin solitaire app is most worth your time and attention.\n\nClub Bitcoin: Solitaire\n\nTHNDR Games makes an array of Bitcoin-awarding mobile games, including Tetro Tiles, and its Club Bitcoin: Solitaire (iPhone, Android) is by far the most visually appealing of the bunch. It spruces up this very traditional card game with a little bit of visual panache, and the streamlined interface with one tap to send any card to its rightful pile feels intuitive and responsive.\n\nBut it’s stingy with the sats. You earn tickets while playing, and those are put into prize draws that could earn you large-to-small bundles of satoshis. But after two hours of total gameplay, I’d only earned 59 sats… that’s less than $0.02 worth. Plus, you have to redeem the sats and withdraw them to a wallet within a few days, otherwise they disappear.\n\nClub Bitcoin: Solitaire by THNDR Games. Image: Decrypt\n\nClub Bitcoin was the most enjoyable of the trio in terms of look and feel, but also provided the least amount of rewards. Your mileage may vary, however. No matter how it shakes out, you’ll still have to sit through some truly laborious video ads for scammy-looking mobile games.\n\nBitcoin Solitaire\n\nBling Financial is another publisher with a heap of crypto-tinged mobile games, and Bitcoin Solitaire (iPhone, Android)—created with PlayDay Studios—was by far the most generous game of this trio when it comes to earning satoshis.\n\nAD\n\nAD\n\nGranted, it’s all relative: after two hours of play, I had earned enough “Bling Points” to withdraw 339 satoshis, or about $0.09 worth. That’s still basically nothing, but it’s more than five times the amount of Bitcoin that I earned while playing Club Bitcoin, with a similar amount of obnoxious ads permeating the experience.\n\nBitcoin Solitaire by Bling/PlayDay. Image: Decrypt\n\nBling’s Bitcoin Solitaire has a more spartan design than Club Bitcoin, but the interface is just as responsive and it serves up an enjoyable game of mobile solitaire. I noticed that I won a lot more games in Bitcoin Solitaire than the other two games, though. It feels tuned to go easy on you, but when you’re coasting to victory and racking up sats, it’s tough to complain.\n\nSolitaire - Card Game 2023\n\nThere’s an odd discrepancy between the iPhone and Android versions: the iOS game has the bland title above, while the Android one has “Earn Bitcoin” in the title. But appearances are a bit deceiving here, as both games may ultimately earn you tiny amounts of Bitcoin.\n\nIn this case, Viker’s take on solitaire is solid but not quite as streamlined as the others. A double tap is required on any card to send it to its rightful destination, which makes the flow a bit less speedy than in the other games, and the interface—which includes a banner ad—isn’t nearly as punchy and stylish as in Club Bitcoin.\n\nSolitaire - Card Game 2023 by Viker. Image: Decrypt\n\nAll that said, this is a totally solid game of smartphone solitaire, with just about the same amount of clunky, time-consuming, full-screen video ads as the others. And overall, the payout puts this game right in the middle of the others—I earned 122 satoshis in approximately two hours of gameplay, coming out to just over $0.03 worth of BTC.\n\nWhich should you play?\n\nAfter earning less than $0.15 total for six full hours of gameplay, it’s fair to say that none of these games are likely to grant you any meaningful amount of cryptocurrency. If you care about solitaire gameplay most of all, then you can probably find a mobile rendition with more polish and less-intrusive ads.\n\nBut among games with crypto rewards, Bling’s Bitcoin Solitaire hits the sweet spot. It’s not the most stylish-looking of the bunch, but the gameplay is smooth and enjoyable and I earned the most BTC by far out of any of these games… even if it was barely a dime’s worth."
    }
]