[
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTI1L2JpdGNvaW4tYmVnaW5zLXRvLXRlc3QtaW5mbGVjdGlvbi1wb2ludC13aGlsZS1tb21lbnR1bS1zbG93c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Tests 50-Day Moving Average Inflection Point - Bloomberg",
        "content": "Bitcoin is beginning to test a closely watched level that some analysts suggest could prove to be a key turning point after this year’s surge in prices.\n\nThe largest digital currency is trading around its 50-day moving average, with Paul Hickey of Bespoke Investment Group noting that the level to watch is $27,500. If the level doesn’t hold, prices risk declining."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTI2L2JpdGNvaW4tcmV0YWtlcy0zMC0wMDAtbGV2ZWwtd2l0aC11cy1iYW5raW5nLWNvbmNlcm5zLWxpbmdlcmluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Retakes $30,000 Level as First Republic Bank (FRC) Woes Deepen - Bloomberg",
        "content": "Bitcoin retreated after briefly climbing back above $30,000 for the first time in a week, reminding investors of the volatility that has long been a key attraction for many traders.\n\nThe largest cryptocurrency by market swung between a gain of as much as 7.3% and a loss of around 1% during New York trading hours, before settling in at about $28,100. Around $1 billion worth of open interest on Bitcoin derivatives were liquidated during the price swings, data from Coinalyze show."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMjYvYml0Y29pbi1qdW1wcy1hcy1maXJzdC1yZXB1YmxpYy1wdWxscy1iYW5raW5nLXNlY3Rvci1jb25jZXJucy1iYWNrLWludG8tZm9jdXMuaHRtbNIBdmh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA0LzI2L2JpdGNvaW4tanVtcHMtYXMtZmlyc3QtcmVwdWJsaWMtcHVsbHMtYmFua2luZy1zZWN0b3ItY29uY2VybnMtYmFjay1pbnRvLWZvY3VzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin reverses lower after briefly topping $30,000 again - CNBC",
        "content": "Cryptocurrencies slid into the end of the trading day Wednesday, erasing losses from an earlier rally.\n\nBitcoin ended the day higher by less than 1% at $27,580.88, according to Coin Metrics. Ether fell about 1% to $1,835.88.\n\nEarlier in the day, bitcoin jumped as much as about 8% and briefly reclaimed the $30,000 level. That helped lift ether, which advanced more than 6% at one point to about $1,950.\n\nBitcoin had been trading sideways for several days, with volatility back to its lows of early March, before the banking crisis began and became one of the cryptocurrency's biggest upward catalysts this year. Beginning late Tuesday, troubles at First Republic helped drive the cryptocurrency's price action again, according to Matt Hougan, chief investment officer at Bitwise Asset Management.\n\n\"Crypto rallies during banking crises, and it looks like the banking crisis may not be over,\" Hougan said.\n\nFirst Republic shares fell almost 30% Wednesday, bringing its two-day loss to about 80%, after reporting a massive drop in deposits in the first quarter as customers pulled their money out following the collapse of Silicon Valley Bank. CNBC's David Faber reported that the next few days are crucial for the company, as other banks and federal officials seek to pull together a rescue plan."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS90ZWNobm9sb2d5LzIwMjMvYXByLzI2L2JpdGNvaW4tbWluaW5nLWNsaW1hdGUtY3Jpc2lzLWVudmlyb25tZW50YWwtaW1wYWN00gFlaHR0cHM6Ly9hbXAudGhlZ3VhcmRpYW4uY29tL3RlY2hub2xvZ3kvMjAyMy9hcHIvMjYvYml0Y29pbi1taW5pbmctY2xpbWF0ZS1jcmlzaXMtZW52aXJvbm1lbnRhbC1pbXBhY3Q?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin is terrible for the environment – can it ever go green? - The Guardian",
        "content": "On the corner of New York’s Park Avenue and 52nd Street, curious onlookers recently stopped in front of a giant green skull sitting in the bed of a truck parked outside the office of Fidelity Investments, the global financial management company.\n\nThe “Skull of Satoshi”, named after the pseudonymous bitcoin developer Satoshi Nakamoto, is composed almost entirely of computer circuit boards and fitted with tall smokestacks usually found atop coal power plants.\n\nThe artifact is a project of artist Benjamin Von Wong and is a reference to the massive amounts of carbon emitted from mining the cryptocurrency bitcoin, an endeavor Fidelity is now pursuing.\n\nBitcoin is chiefly known as a wild investment vehicle that – along with many other cryptocurrencies – can seemingly make or lose fortunes overnight in a market where values go up and down quickly and by large margins.\n\nBut what worries environmentalists and others is the huge amount of electricity used in generating bitcoin and other such currencies – energy that often traces back to fossil fuels and so has a corresponding impact on the climate crisis.\n\nAs major financial brands speculate in the cryptocurrency world, environmental campaigners want to make sure they know that they are not just taking a financial gamble; there is also an environmental risk.\n\nSome are hoping that they can persuade those institutions to try to lessen the impact of crypto-mining. “It’s a big step for a financial institution like Fidelity to launch their own crypto platform. So now more than ever, we need their help,” said Rolf Skar, campaign director at Greenpeace USA, a non-profit environmental advocacy organization.\n\nIt is a complex situation. But here is a guide to the key issues.\n\nWhat is bitcoin?\n\nBitcoin is a type of cryptocurrency, a decentralized form of currency that is strictly digital rather than physical – unlike dollars, pounds or euros. It is managed and traded on a public, open ledger known as a “blockchain” that records all bitcoin transactions. Though not commonly done, bitcoin can be used to buy material goods.\n\nHow does bitcoin cause environmental damage?\n\nBecause cryptocurrencies such as bitcoin are not centralized, there is no singular authority or body to verify transactions. Instead, participants in the bitcoin network “mine”, or compete to solve cryptographic puzzles to generate more of the currency. Whoever solves the puzzle the fastest gets to verify transactions for the chance to add the newest batch of them to the blockchain.\n\nThe winner is financially rewarded with new cryptocurrency in this process, referred to as “proof of work” (PoW) – the culprit for greenhouse gas emissions.\n\nThe PoW consensus algorithm used to verify transactions requires large amounts of electricity which is often produced by burning fossil fuels, emitting carbon dioxide and other greenhouse gases that are heating the planet.\n\nA 2022 report, titled Revisiting Bitcoin’s Carbon Footprint, conducted by climate and economics researchers across Europe estimates that “Bitcoin mining may be responsible for 65.4 megatonnes of CO 2 per year … which is comparable to country-level emissions in Greece (56.6 megatonnes in 2019).”\n\nWhat do environmental groups want?\n\nThere is a recent push by some environmentalists to reduce the environmental impact of bitcoin by changing the way it is produced.\n\nView image in fullscreen The Greenidge Generation bitcoin mining facility, in a former coal plant by Seneca Lake in Dresden, New York. Photograph: Ted Shaffrey/AP\n\nSo groups such as Greenpeace are calling out Fidelity and other financial management and payment process companies that have ventured into bitcoin mining. Hence the recent targeting of Fidelity. Skar said that although Fidelity responded to Greenpeace when the group reached out, the response was lackluster.\n\n“[Fidelity] seem not to want to talk about the issue. They declined [our request to speak] so far, but it’s an invitation for them and others to step up and put resources towards solutions to deal with the problem of bitcoin mining globally. We think it can be done,” Skar said.\n\nHow could ‘changing the code’ mitigate environmental damage?\n\nThe solution, Greenpeace argues, is simple: change the computer code that produces bitcoin in order to consume less electricity and reduce its carbon footprint.\n\nThis code is open-source, meaning it is publicly accessible to anyone who wants to see or use it.\n\nskip past newsletter promotion Sign up to TechScape Free weekly newsletter Alex Hern's weekly dive in to how technology is shaping our lives Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nRather than a PoW verification process, which requires vast amounts of energy, climate activists are arguing for a less energy-intensive verification process that isn’t reliant on speed, such as “proof of stake” (PoS), used by ethereum – another cryptocurrency.\n\nHow is this Fidelity’s problem?\n\nSince bitcoin is decentralized, it has no owner and no one to hold to account for problems the cryptocurrency creates, like wreaking havoc on the environment.\n\nThe activists advocating for a code change to bitcoin argue that popular financial services corporations like Fidelity have the clout to incentivize such a change, which would be environmentally transformative.\n\n“[Fidelity] doesn’t have a climate commitment like other asset managers. Fidelity is the focus because they have been one of the biggest traditional financial players involved in the bitcoin space and they refuse to acknowledge that they have a responsibility and the ability to help fix the problem that bitcoin mining is having on the climate. So this is actually an invitation for them,” Skar said.\n\nHe called the code change “a win for bitcoin and for climate and for communities”.\n\nBut would it succeed?\n\nProminent voices in the bitcoin community and some scholars on the topic don’t buy into this solution.\n\nDr Hanna Halaburda is an associate professor of technology, operations and statistics at NYU’s Stern School of Business. Among the classes she teaches are Blockchain and Cryptocurrencies and Foundations of Fintech.\n\nIn reference to a hypothetical bitcoin protocol change, Halaburda said: “I don’t think it’s going to work. Everybody recognizes [bitcoin] is environmentally unhealthy, but any big changes to bitcoin protocol have been very unsuccessful because you need to get all the miners to agree on that.”\n\nAny miners that don’t agree with the protocol change can simply reject the new code and continue running the original code that relies on the energy-intensive PoW.\n\nWould other tactics work?\n\nHalaburda said there might be another solution: renewable energy.\n\n“A lot of [bitcoin] mining companies have set up their contracts with renewable energy companies. The argument is that having these mining facilities as clients means that when there’s an oversupply of energy, it may actually make it more profitable for the renewable energy plants,” she said.\n\nThis means that these energy companies can mine bitcoin during periods of excess production and oversupply. So instead of letting energy go to waste, money can be made and the wealth can be shared between the cryptocurrency mining facilities and the renewable energy companies with which they have a contract.\n\nFidelity did not respond to the Guardian’s request for comment."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWNvdWxkLXNvYXItMTAwLTAwMC0xNTAzMjY2MzcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 26 Apr 2023 07:00:00 GMT",
        "title": "'Bitcoin Could Skyrocket to $100,000,' According to Standard Chartered — Here Are 3 Stocks to Take Advantage - Yahoo Finance",
        "content": "Bitcoin failed to fulfil one of its purposes last year as a hedge against soaring inflation, but it came into its own recently via another original purpose – as a bet against the legacy banking system. Its decentralized and trustless attributes have made the leading crypto one to hold against a backdrop of multiple bank collapses. In fact, delivering gains of 70% though Q1 made it the quarter’s best performing asset.\n\nAnd it has got plenty more room to run, says Geoff Kendrick, head of crypto research at British banking giant Standard Chartered. “We see potential for Bitcoin to reach the $100,000 level by end-2024, as we believe the much-touted ‘crypto winter’ is finally over,” Kendrick noted.\n\nThat’s a gain of 240% from current levels, a surge that will be hard to find elsewhere. For many, though, buying bitcoin directly still represents somewhat of a complicated act but there are ways to get skin in the game without directly purchasing the asset. The stock market presents opportunities with many names operating in the bitcoin ecosystem – miners in particular – and their performance naturally correlates with that of the daddy of crypto. Hence, if bitcoin is set to surge so will many bitcoin-themed stocks.\n\nWith this in mind, we delved into the TipRanks database and pulled up the details on 3 crypto stocks poised to make use of that anticipated run. What’s more, all 3 are rated as Strong Buys by the analyst consensus. Let’s take a closer look.\n\nCleanSpark, Inc. (CLSK)\n\nWe’ll start with CleanSpark, a bitcoin miner that sometime ago decided bitcoin mining was where it’s at. While once the company specialized solely in microgrid solutions, it began dabbling in mining operations toward the end of 2020. However, since then, mining endeavors have become its main priority.\n\nCleanSpark oversees its own mining operations in Atlanta, Georgia and co-locates miners in Massena, NY. Bitcoin is famous for being hugely energy intensive, but the company likes to highlight its credentials as a sustainable player, mining the bulk of its BTC with renewable or low-carbon energy sources. By often selling its mined bitcoin, the company has funded expansion and last year, even as the crypto winter raged, increased its hashrate – the measure of the computational power used to mine the asset – from 2.1 EH/s in January to 6.2 EH/s at the end of the year.\n\nStory continues\n\nThe company has set its sights on bringing that hashrate up to 16.0 EH/s by the end of 2023, and recent purchases will go toward making that goal a reality. The company recently announced a purchase of 45K new Antminer S19 XP machines that when eventually deployed will almost double the current hashrate.\n\nAccording to H.C. Wainwright analyst Mike Colonnese, the company exhibited some canny business nous when securing the deal which comes roughly two months following the company’s purchase of 20,000 Bitmain rigs for a 25% discount.\n\n“CLSK secured the machines for a very attractive $23/TH (before applying coupons), the lowest we’ve seen in the market for these rigs, and 12% below the going rate for high efficiency ASICs (under 25 J/TH), based on Luxor’s Bitcoin ASIC Price Index,” the analyst explained.\n\n“Management has been very opportunistic in acquiring new mining rigs at rock bottom prices over the past year, which we believe will drive significant shareholder value, and with this latest purchase, the company has now secured 99%, or 15.9 EH/s of the miners required to reach its year-end 2023 hash rate target of 16 EH/s… We continue to view the stock as significantly undervalued relative to fundamentals,” Colonnese added.\n\nOverall, CLSK shares have soared 98% year-to-date, but Colonnese sees ample growth ahead. Calling CLSK a ‘top pick,’ the analyst rates the shares a Buy while his $12 price target makes room for 12-month returns of a whooping 194%. (To watch Colonnese’s track record, click here)\n\nThis bitcoin miner has garnered two other recent reviews and both are positive, making the consensus view here a Strong Buy. The $8.33 average target might represent a more modest objective, but could still yield gains of a handsome 104% over the next year. (See CLSK stock forecast)\n\nHIVE Blockchain Technologies (HIVE)\n\nThe next bitcoin miner we’re looking at is HIVE Blockchain Technologies. Fun fact: in 2017, HIVE became the first publicly traded crypto miner. The company actually got its start as a GPU-based miner of Ethereum but in 2020 it also began mining bitcoin and has expanded is operations since then. The company has a commitment to ESG practices and mines its bitcoin using green energy, making use of favorable power costs and renewable energy sources with mining operations in Canada, Iceland, and Sweden.\n\nTouting its BTC credentials, the company aims to foster long-term shareholder value with the OG practice of HODLing – keeping its bitcoin close to its chest.\n\nThat said, HIVE saw a big drop in its revenue stream in the most recent financial report – for its fiscal third quarter (December quarter). Revenue fell by 79% year-over-year to $14.3 million, which can be attributed not only to an increase in global hashrate and reduced cryptocurrency prices but also to Ethereum’s switch to a proof-of-stake model. That said, the company mined 787 bitcoin during the quarter, amounting to a 13% year-over-year increase, while its average cost of production per BTC was $13,599. The current BTC price is more than double that.\n\nThe company also said that in order to maximize profitability, it intentionally pulled back on production and also repurposed some of its GPUs into non-mining endeavors.\n\nLooking at these activities, Canaccord analyst Joseph Vafi likes the way this firm operates. The 5-star analyst writes: “We see the current setup for HIVE as healthy on multiple fronts. We are encouraged by the company’s efficient Bitcoin production, strong balance sheet, steady progress at its facilities, and prudent approach toward repurposing its GPU machines. Perhaps most importantly, at a macro level we believe that digital assets are biased higher in the medium term to long term, and especially Bitcoin, which has handled resistance relatively well in the face of recent market volatility…”\n\nThese comments form the basis for Vafi’s Buy rating on HIVE, which is backed by a $7 price target. Even after posting year-to-date gains of a hefty 119%, investors stand to pocket returns of 134%, should this figure be met. (To watch Vafi’s track record, click here)\n\nElsewhere on the Street, with two additional positive reviews in tow, HIVE claims a Strong Buy consensus rating. The forecast calls for 12-month returns of 57%, considering the average target clocks in at $5.33. (See HIVE stock forecast)\n\nIris Energy (IREN)\n\nBitcoin has its fair share of evangelists and two early adopters convinced in its value are the driving force behind are next BTC-flavored stock. Daniel and Will Roberts are the co-founders and co-CEOs of Sydney, Australia-based Iris Energy and used their background and expertise in renewable energy and traditional mining when setting off on their bitcoin mining activities.\n\nThe company operates in regions that have an abundance of renewable energy – wind, solar, hydro -and their locations are run on 100% renewables. Iris sticks to a simple plan: mine bitcoin, sell it and pay energy bills and overheads.\n\nHowever, the company ran into some issues last year, attempting to scale meaningfully at what turned out to be extremely bad timing. With crypto winter at its peak and the industry rocked by multiple scandals (Terra Luna, Celsius, FTX), bitcoin’s price crashed. Against this backdrop, several mining firms over-leveraged, saw profits drop and were driven into insolvency.\n\nHowever, through prudent business practices, Iris seems to have weathered the storm. And for Compass Point analyst Chase White, the way the company has handled matters informs his bullish take.\n\n“Now that IREN has restructured its balance sheet to eliminate virtually all of its debt, replaced the miners lost to its creditors because of the restructuring with no additional cash outlays, and is almost finished with its capex spend to get to 5.5 EH/s, we believe the company is very well positioned to start generating solid free cash flows at current BTC prices with the opportunity to invest in further growth if BTC prices rise further,” White opined.\n\nIn fact, the lack of debt and the near completion of facility buildouts have “derisked the story significantly,” the analyst said.\n\nIREN shares have benefited immensely from bitcoin’s surge and have posted growth of 260% since the turn of the year. However, White thinks there are plenty more gains in store. Along with a Buy rating, his $11 price target suggests the stock has room for additional growth of 144% in the year ahead. (To watch White’s track record, click here)\n\nWhite’s thesis gets the full backing of his colleagues here. The stock garners Buys only – 4, in total – for a Strong Buy consensus rating. Shares are expected to change hands for ~78% premium a year from now, considering the average target stands at $8. (See IREN stock forecast)\n\nTo find good ideas for crypto stocks trading at attractive valuations, visit TipRanks’ Best Stocks to Buy, a newly launched tool that unites all of TipRanks’ equity insights.\n\nDisclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment."
    }
]