[
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWhvbGRzLWdyb3VuZC1hbWlkLWJpbmFuY2UtMDMwMDU4NTcwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin holds ground amid Binance lawsuit, XRP continues run up, U.S. equities dip - Yahoo Finance",
        "content": "Bitcoin rebounded in Wednesday morning trading in Asia after a slide earlier in the week when U.S. regulators filed a lawsuit against Binance, the world’s biggest cryptocurrency exchange. All other top 10 non-stablecoin cryptocurrencies gained ground. XRP continued to lead the winners, while Cardano followed. U.S. equities moved lower on Tuesday on broader worries about interest rates and the economy and as regulators proposed stricter rules on the U.S. banking industry.\n\nSee related article: Asia leads crypto regulations, innovation may leave the US, says Ripple’s Long\n\nBitcoin edged up 1.29% to US$27,290 in the 24 hours to 9:00 a.m. in Hong Kong, posting a weekly loss of 2.76%, according to CoinMarketCap data. The leading cryptocurrency see-sawed so far this week after the Commodity Futures Trading Commission’s (CFTC) filed a lawsuit against Binance for alleged violation of trading rules. Bitcoin dropped from around US$28,000 to a low of US$26,677 on Tuesday, and bounced back above the US$27,000 mark early Wednesday.\n\nEthereum also regained ground, rising 4.09% to US$1,776, but still down 0.78% for the past seven days.\n\nXRP continued to lead the winners, jumping 10.04% to US$0.5215 for a rise of 12.92% over the seven days. The token continues to gain on expectations that Ripple Labs, whose crypto payment network is powered by XRP, may win a favorable ruling in a lawsuit filed against the company by the U.S. Securities and Exchange Commission. The SEC charged Ripple with selling an unregistered security in the form of XRP.\n\n“The implications for the case are very broad-reaching for the crypto industry because we expect that this decision will ultimately set a precedent for how the U.S. government will look at categorizing crypto assets and regulating them,” Ripple Labs President Monica Long told Forkast.News on Tuesday.\n\nCardano posted the second largest gain among the top 10 non-stablecoin cryptocurrencies, jumping 6.68% to US$0.3678, but is still down 1.06% for the week.\n\nAdding to regulatory tensions, a U.S. judge ordered a hold on Binance’s US$1.3 billion acquisition of bankrupt crypto lender Voyager Digital, as requested by the Department of Justice that appealed an earlier court ruling to approve the sale.\n\nThe total crypto market capitalization rose 1.80% in the past 24 hours to US$1.15 trillion. Total trading volume over the last 24 hours dropped 6.00% to US$39.94 billion.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dropped 0.34% in the past 24 hours to 4,006.47 as of 09:00 a.m. in Hong Kong, moving down 3.26% for the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day. It is managed by Forkast sister company, CryptoSlam.\n\nU.S. equities closed lower on Tuesday. The Dow Jones Industrial Average dipped 0.12%, the S&P 500 edged down 0.16%, and the Nasdaq Composite Index dropped 0.45%.\n\nThe U.S. Congress held a hearing Tuesday on recent bank failures where regulators assured deposits in U.S. banks were safe, but said tighter regulations are required on the banking industry. U.S. President Joe Biden said on Tuesday he was confident the problems in the banking system were being resolved, but his administration would offer additional support as needed.\n\nThe U.S. consumer confidence index rose slightly in March, the Conference Board reported on Tuesday, suggesting more optimism in the economy than thought as the expectation was for a decline.\n\nOn inflation, analysts at the CME Group expect a 57.5% chance the Fed will keep rates between 4.75% to 5% at its next meeting on May 3. The chance of another 25 basis-point hike is at 42.5%, up from 41.7% on Tuesday."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wMy0yOC95b3UtY2FuLXQtZGVzdHJveS1iaXRjb2luLXNheXMtaW5jb21pbmctYml0LWRpZ2l0YWwtY2VvLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "You Can't Destroy Bitcoin, Says Incoming Bit Digital CEO - Bloomberg",
        "content": "00:00\n\nIt speaks to the broader question out there right now, and thank you so much for joining us about after these collapses where crypto companies go to bank, is that still possible in the US? Well, look, regulators have certainly made it more difficult for of native companies to get access to banking. There are other regional banks that are stepping in selectively to fill the void. But the system is much less supportive than it used to be, and many are on the sidelines just waiting to see what happens. The fears around finance are also not helping, and many users are likely moving coins off the exchange and into cold storage was probably explains the lower volume these days. Well, speaking of things, moving is the end result of this just moving off shore. Is that something that digital is pursuing? Well, it's funny you ask. We actually that our entire fleet used to be in China. And we decided to move our entire fleet from China to the United States because we felt that it was just too much jurisdictional risk to stay in China and ask we're moving our fleet midway through. China announced a ban on bitcoin mining. So we just accelerated that entire movement of the fleet into the United States, into the United States, which we felt was a safer place. So we continue to see that the pattern continues. You know, China had a go on bitcoin. Nothing happened. Bitcoin is not something you can destroy. It's a decentralized asset. Banning an entire industry does nothing to Bitcoin. It has no effect. I mean, but we are looking at other jurisdictions now, other countries. And we have to part of our jurisdictional diversification to diversify our risk forces us to look at other countries. Is it possible to get to know jurisdiction? Because it seems like that's what financial is trying to do. And it feels like that's where Bitcoin really belongs, but it doesn't seem possible with all of these governments working together. Look, we're pro regulation, but we want regulation to be well communicated and it can't just be simply carried out by enforcement on ambiguous rules. Bitcoin mining, for example, comprises a point two percent of global energy use and over 60 percent of that is sustainable. But politicians are unfairly painting the entire industry as some sort of dirty energy and are threatening these unwieldy taxes and outright bans. Forcing bitcoin mining out of the United States would simply transport the industry elsewhere. And it would just decrease the US's ability to pollute to be a powerhouse in this new industry. That's not going away. Well, you know, a lot of times people are terrified of things they can't understand. Sam, let me ask you about the price action we've seen, because it's been pretty impressive. You know, even after the collapse of RTX, even with the threat right now, although it's only a civil threat, we want to remind our viewers to buy an ounce, not a criminal threat. Nonetheless, it's not a great look. We still have Bitcoin trading at twenty seven thousand dollars. Is that because of low liquidity? I mean, somebody still has to lift the offer. How do you explain the price action? Yeah. Well, the loss of Silver Gate's exchange network and signatures Signet has certainly reduced the liquidity as market makers use these banks for 24/7 settlement. So there is a technical reason for the volume. However, there is also a logical reason why bitcoin is going up, and that's because Satoshi is thesis about the financial system having too much control and just can censor transactions and just having as you could see, banks are falling apart again. That happened in 2008. That is exactly when Satoshi invented bitcoin because he saw that the financial system had way too many holes and there he wanted to create a system where it was completely decentralized and foolproof. Bitcoin is a fail proof system. And so he invented that in the last banking crisis. And here we are again, another banking crisis. You'll see Bitcoin going up. Eventually, Bitcoin will be seen by a lot of people as digital gold. It's the ultimate way to hedge against macro bets, inflation and this sort of thing that's happening today. Well, and just like gold, it has to be mined. So one final question on Bitcoin miners, many of which we have seen come into pretty serious financial trouble. All right. Is the Bitcoin mining industry through the worst of it? What challenges do you still face? I agree with you. A lot of our peers, unfortunately, drank their their own Kool-Aid and and levered up and took on debt on their balance sheet while Bitcoin was going up through the roof. I think past fifty thousand people were really getting greedy. We did not we did no such thing. We have a very healthy, pristine balance sheet. We have over sixty five dollars on the balance sheet. We have absolutely no debt, but digital has no leverage, no capital commitments. So we ran a pretty conservative and tight ship and we're even in the business of potentially even lending to people in the industry who need the money because we have such a great balance sheet. Having said that, this is a lesson to be learned in the future for there will be another bull run. And you know, the industry needs to to run a business and run a business means you can't just hope on the direction of Bitcoin. You've got to run your business regardless of the direction of where bitcoin is going. All right, so what we do."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9lbC1zYWx2YWRvcnMtYml0Y29pbi1ib29tLXdvcmxkcy0xNTE0MzYyNTguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "El Salvador's Bitcoin Boom: How the World's First Crypto Nation's Big Bet Is Stabilizing Its Economy, Proving Critics ... - Yahoo Finance",
        "content": "When El Salvador President Nayib Bukele made the controversial decision to make Bitcoin legal tender in his country, many people were skeptical and concerned about the potential risks.\n\nBukele announced on Twitter that the country would purchase one Bitcoin (CRYPTO: BTC) each day starting Nov. 18, 2022. How is that going in 2023? The latest news out of El Salvador suggests that the government's bet on cryptocurrency is paying off.\n\nDon’t Miss: This Startup Built the World's First AI Marketing Platform That Can Understand Emotion and Some of the Biggest Companies on the Planet Are Already Using It\n\nAccording to Treasury Minister Alejandro Zelaya, the government has successfully repaid one of two outstanding $800 million bonds. This move is likely to allay concerns about a potential default, which had grown amid the country's adoption of Bitcoin.\n\nZalaya announced the news via Twitter on Jan. 23, highlighting the government's commitment to meeting its debt obligations and proving the skeptics wrong. Bukele tweeted, “Well, we just paid in full 800 million dollars plus interest. But of course, almost no one is covering the story.”\n\nThe government still owes $367 million plus interest on an additional bond set to mature in January 2025, but the successful repayment of the 2023 bond is a positive sign for the country's financial stability.\n\nWhat initially started as a largely controversial might be paying off as Bitcoin and many aspects of the blockchain-based asset market have began to rebound. Gamestop Corp.’s NFT marketplace has seen a considerable boom. Some of the top NFT projects on the platform have seen volume spikes as high as 21,446%.\n\nSimilarly, leading NFT marketplace startup Gameflip recently crossed $900,000 raised from retail investors in their active equity crowdfunding raise. This comes after their announcement of hitting $160 million in lifetime volume on the platform earlier this month and a host of other milestones.\n\nBitcoin as Legal Tender\n\nThe small Central American country made headlines in 2021. The legislation required all businesses within the country to accept Bitcoin as a form of payment for goods and services, granting it the same status as traditional fiat currencies.\n\nStory continues\n\nChivo Wallet, the wallet created by the government of El Salvador, said 2.2 million Salvadorans were onboarded just one month after Bitcoin became the country’s legal tender. To encourage adoption, every user who successfully downloaded the app immediately received $30 in Bitcoin. By early 2022, about half of Salvadorans had downloaded the app.\n\nSee Next: Qnetic Unveils Revolutionary Flywheel Energy Storage System to Accelerate Renewable Energy Adoption\n\nThe “Bitcoin bet” has been met with mixed reactions from international organizations and governments, with many expressing their concerns about potential risks that may arise from the use of cryptocurrency. The International Monetary Fund (IMF) recently issued a statement on El Salvador's decision to accept Bitcoin as legal tender, cautioning against potential risks associated with such adoption.\n\nAlthough there have not been any significant risks thus far following El Salvador's adoption of Bitcoin, they noted it’s important for authorities to be vigilant when providing government exposure to digital assets. According to the statement, crypto markets are still largely speculative and unpredictable in nature and should be approached with caution for El Salvador’s economy to be safeguarded against potential losses.\n\nThe IMF also highlighted the importance of transparency when dealing with cryptocurrency transactions and emphasized that it is crucial for regulators to ensure they remain compliant with anti-money laundering laws and regulations. It advised El Salvador to develop effective regulatory frameworks aimed at mitigating financial stability risks associated with cryptocurrency use.\n\nEl Salvador appears undeterred by the IMF's recommendations. In January, its congress approved a digital securities law, paving the way for the country to raise funds through the issuance of the world's first sovereign blockchain bond. The law allows for the use of blockchain technology in the issuance, trading and clearing of securities, enabling greater efficiency and transparency in the process. The additional step forward for the country could potentially attract investment from tech-savvy investors looking for new opportunities in the cryptocurrency market.\n\nTo stay updated with top startup news & investments, sign up for Benzinga’s Startup Investing & Equity Crowdfunding Newsletter\n\nEl Salvadorian Prosperity in a time of uncertainty\n\nWhile the U.S. market faces uncertainty around banking and a general decline in U.S. equities, El Salvador’s bet looks to be paying off. While El Salvador began buying Bitcoin at a significant premium to the current price, they also announced a purchase of 80 Bitcoin at a price around the $19,000 mark in July of 2022. They have also committed to purchasing one Bitcoin per day, every day since November of 2022. At the time, the price of Bitcoin was below $16,000. Roughly 126 days have passed since then meaning the company is still pouring millions into the digital currency despite the controversy, much of which has been at a steep discount to its current price of over $28,000.\n\nSee more on startups investing from Benzinga.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article El Salvador's Bitcoin Boom: How the World's First Crypto Nation's Big Bet Is Stabilizing Its Economy, Proving Critics Wrong, and Paying Back Its Debt originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9lbC1zYWx2YWRvcnMtYml0Y29pbi1ib29tLXdvcmxkcy0xNTE0MzYyNTguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "El Salvador's Bitcoin Boom: How the World's First Crypto Nation's Big Bet Is Stabilizing Its Economy, Proving Critics ... - Yahoo Finance",
        "content": "When El Salvador President Nayib Bukele made the controversial decision to make Bitcoin legal tender in his country, many people were skeptical and concerned about the potential risks.\n\nBukele announced on Twitter that the country would purchase one Bitcoin (CRYPTO: BTC) each day starting Nov. 18, 2022. How is that going in 2023? The latest news out of El Salvador suggests that the government's bet on cryptocurrency is paying off.\n\nDon’t Miss: This Startup Built the World's First AI Marketing Platform That Can Understand Emotion and Some of the Biggest Companies on the Planet Are Already Using It\n\nAccording to Treasury Minister Alejandro Zelaya, the government has successfully repaid one of two outstanding $800 million bonds. This move is likely to allay concerns about a potential default, which had grown amid the country's adoption of Bitcoin.\n\nZalaya announced the news via Twitter on Jan. 23, highlighting the government's commitment to meeting its debt obligations and proving the skeptics wrong. Bukele tweeted, “Well, we just paid in full 800 million dollars plus interest. But of course, almost no one is covering the story.”\n\nThe government still owes $367 million plus interest on an additional bond set to mature in January 2025, but the successful repayment of the 2023 bond is a positive sign for the country's financial stability.\n\nWhat initially started as a largely controversial might be paying off as Bitcoin and many aspects of the blockchain-based asset market have began to rebound. Gamestop Corp.’s NFT marketplace has seen a considerable boom. Some of the top NFT projects on the platform have seen volume spikes as high as 21,446%.\n\nSimilarly, leading NFT marketplace startup Gameflip recently crossed $900,000 raised from retail investors in their active equity crowdfunding raise. This comes after their announcement of hitting $160 million in lifetime volume on the platform earlier this month and a host of other milestones.\n\nBitcoin as Legal Tender\n\nThe small Central American country made headlines in 2021. The legislation required all businesses within the country to accept Bitcoin as a form of payment for goods and services, granting it the same status as traditional fiat currencies.\n\nStory continues\n\nChivo Wallet, the wallet created by the government of El Salvador, said 2.2 million Salvadorans were onboarded just one month after Bitcoin became the country’s legal tender. To encourage adoption, every user who successfully downloaded the app immediately received $30 in Bitcoin. By early 2022, about half of Salvadorans had downloaded the app.\n\nSee Next: Qnetic Unveils Revolutionary Flywheel Energy Storage System to Accelerate Renewable Energy Adoption\n\nThe “Bitcoin bet” has been met with mixed reactions from international organizations and governments, with many expressing their concerns about potential risks that may arise from the use of cryptocurrency. The International Monetary Fund (IMF) recently issued a statement on El Salvador's decision to accept Bitcoin as legal tender, cautioning against potential risks associated with such adoption.\n\nAlthough there have not been any significant risks thus far following El Salvador's adoption of Bitcoin, they noted it’s important for authorities to be vigilant when providing government exposure to digital assets. According to the statement, crypto markets are still largely speculative and unpredictable in nature and should be approached with caution for El Salvador’s economy to be safeguarded against potential losses.\n\nThe IMF also highlighted the importance of transparency when dealing with cryptocurrency transactions and emphasized that it is crucial for regulators to ensure they remain compliant with anti-money laundering laws and regulations. It advised El Salvador to develop effective regulatory frameworks aimed at mitigating financial stability risks associated with cryptocurrency use.\n\nEl Salvador appears undeterred by the IMF's recommendations. In January, its congress approved a digital securities law, paving the way for the country to raise funds through the issuance of the world's first sovereign blockchain bond. The law allows for the use of blockchain technology in the issuance, trading and clearing of securities, enabling greater efficiency and transparency in the process. The additional step forward for the country could potentially attract investment from tech-savvy investors looking for new opportunities in the cryptocurrency market.\n\nTo stay updated with top startup news & investments, sign up for Benzinga’s Startup Investing & Equity Crowdfunding Newsletter\n\nEl Salvadorian Prosperity in a time of uncertainty\n\nWhile the U.S. market faces uncertainty around banking and a general decline in U.S. equities, El Salvador’s bet looks to be paying off. While El Salvador began buying Bitcoin at a significant premium to the current price, they also announced a purchase of 80 Bitcoin at a price around the $19,000 mark in July of 2022. They have also committed to purchasing one Bitcoin per day, every day since November of 2022. At the time, the price of Bitcoin was below $16,000. Roughly 126 days have passed since then meaning the company is still pouring millions into the digital currency despite the controversy, much of which has been at a steep discount to its current price of over $28,000.\n\nSee more on startups investing from Benzinga.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article El Salvador's Bitcoin Boom: How the World's First Crypto Nation's Big Bet Is Stabilizing Its Economy, Proving Critics Wrong, and Paying Back Its Debt originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXdlbGwtbGF1bmNoZXMtYml0Y29pbi13ZWxsLTEyMDAwMDE2OC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 28 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Well Launches Bitcoin Well Infinite and Expands to USA, With Other Updates - Yahoo Finance",
        "content": "Bitcoin Well\n\nBitcoin Well Infinite\n\nBitcoin Well Infinite\n\nEDMONTON, Alberta, March 28, 2023 (GLOBE NEWSWIRE) -- Bitcoin Well Inc. (“Bitcoin Well” or the “Company”) (TSXV:BTCW; OTCQB:BCNWF), the non-custodial fintech business which future-proofs money by making bitcoin useful to everyday people, today announced the launch of Bitcoin Well Infinite and that it has entered into an agreement to offer its non-custodial bitcoin services in the United States of America.\n\nLaunch of Bitcoin Well Infinite\n\nBitcoin Well Infinite\n\n\n\n\n\nBitcoin Well Infinite is designed as a one-stop-shop for individuals, businesses and family trusts that are looking to work with a knowledgeable bitcoin partner to have convenient access to deep liquidity, convenient payment options and education on how to self custody their bitcoin.\n\n“Bitcoin Well Infinite is a service that is needed now, more than ever” said Adam O’Brien, Founder & CEO of the Company, “while buying and selling bitcoin in large quantities is not a unique product offering, designing a service around self-custody and bitcoin education is something that has been missing. Individuals understand the value in self-custody of bitcoin, and we are ready to close the knowledge gap that is preventing them from doing so.”\n\nA full depth of service can be found at bitcoinwell.com/infinite . Our Bitcoin Well Infinite offering will be available in the USA as part of our USA expansion.\n\nBitcoin Well expands to USA\n\nBitcoin Well has entered into an agreement with a partner to offer its non-custodial bitcoin services to customers in the USA with a target launch date of Q2, 2023. The agreement stipulates that Bitcoin Well will benefit from the partner’s licensing, banking and liquidity relationships to be able to provide a seamless customer experience to buy, sell and eventually use bitcoin in the USA.\n\n“This is an exciting partnership that allows us to expand our company’s reach,” said Adam of the international expansion. “This expansion to the USA comes alongside the launch of Bitcoin Well Infinite . We are taking the 10 years experience of running and scaling a non-custodial bitcoin business in Canada, and bringing that expertise to the USA.”\n\nStory continues\n\nAs always, Bitcoin Well customers in the USA will benefit from non-custodial practices, which ensures they are not exposed to the custodian meltdowns that we have seen with FTX and other custodians this year.\n\nInvestor awareness campaign\n\nBitcoin Well has also commenced an advertising and investor awareness campaign with Dig Media Inc. dba Investing News Network (INN) and Stockhouse Publishing Ltd. dba Stockhouse.\n\nINN and Stockhouse are private companies headquartered in Vancouver, Canada, dedicated to providing independent news and education to investors at www.investingnews.com and www.stockhouse.com . For the 12 month term of these agreements, INN and Stockhouse will help to increase the general awareness of the Company. INN and Stockhouse do not provide Investor Relations or Market Making services. The cost of the INN campaign is CAD $50,000, with $5,000 due now, and the cost of the Stockhouse campaign is CAD $60,000, with $5,000 due now. The balance of these contracts are payable in full on or before September 30, 2023. INN and Stockhouse currently hold no securities in Bitcoin Well, and no shares will be issued as consideration for these contracts. These agreements are subject to Exchange approval.\n\nOther updates\n\nThe Company has also granted stock options (“Options”) to its newest director, Allen Stephen, to purchase up to a total of 328,201 common shares (“Common Shares”) of the Company as compensation, in line with the standard compensation agreement for all Directors. The Options will be granted at an exercise price of $0.06 per Common Share. One half of the options will vest on the first anniversary of the date of grant and one half will vest in quarterly installments over the second year. The Options will expire after five years from March 28, 2023. The grant of Options was made in accordance with the Company’s existing stock option plan and the policies of the TSX Venture Exchange.\n\nLastly, on March 28, 2023, Bitcoin Well issued a secured convertible debenture for up to $0.4 million to refinance a portion of the existing bitcoin denominated debt, allowing Bitcoin Well to further reduce non-cash swings in the financial statements. At the option of the holder, the principal amount of the Convertible Debenture is convertible into common shares of Bitcoin Well (the “Common Shares”) at a conversion price of $0.15 per Common Share, with a required four (4) month hold period, subject to TSXV review and acceptance. Bitcoin Well has the right to require the holder to convert any portion of the principal amount into Common Shares at any time where the Current Market Price of the Common Shares equals or exceeds $0.30 for a period of ten (10) consecutive Trading Days. No finder’s fees are payable related to this issuance. The Convertible Debenture bears interest at a rate of 8% + Bank of Canada policy interest rate per annum and matures on March 28, 2026.\n\n\n\nAbout Bitcoin Well\n\nBitcoin Well is in the business of future-proofing money. We do this by making bitcoin useful to everyday people to give them the convenience of modern banking and the benefits of bitcoin. Our existing Bitcoin ATM and Personal Services business unit drives cash-flow to help fund this mission.\n\nJoin our investor community and follow us on Nostr , LinkedIn , Twitter and YouTube to keep up to date with our business.\n\nBitcoin Well contact information\n\nTo book a virtual meeting with our Founder & CEO Adam O’Brien please use the following link: https://bitcoinwell.com/meet-adam\n\nFor additional investor & media information, please contact:\n\nTel: 1 888 711 3866\n\nir@bitcoinwell.com\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\n\nForward-looking information\n\nCertain statements contained in this news release may constitute forward-looking information. Forward-looking information is often, but not always, identified by the use of words such as \"anticipate\", \"plan\", \"estimate\", \"expect\", \"may\", \"will\", \"intend\", \"should\", or the negative thereof and similar expressions. Forward-looking information involves known and unknown risks, uncertainties and other factors that may cause actual results or events to differ materially from those anticipated in such forward-looking information.\n\nBitcoin Well actual results could differ materially from those anticipated in this forward-looking information as a result of regulatory decisions, competitive factors in the industries in which Bitcoin Well operates, prevailing economic conditions, and other factors, many of which are beyond the control of Bitcoin Well.\n\nBitcoin Well believes that the expectations reflected in the forward-looking information are reasonable, but no assurance can be given that these expectations will prove to be correct and such forward-looking information should not be unduly relied upon.\n\nAny forward-looking information contained in this news release represents Bitcoin Well expectations as of the date hereof, and is subject to change after such date. Bitcoin Well disclaims any intention or obligation to update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by applicable securities legislation.\n\n\n\nFor more information, see the Cautionary Note Regarding Forward Looking Information found in the Bitcoin Well quarterly Management Discussion and Analysis.\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/800d0d8e-1a84-42b7-ad13-d62e1a8fcc93\n\n\n\n"
    }
]