[
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTAyL3doLWlzLWJpdGNvaW4tYnRjLWxpcXVpZGl0eS1kZWNsaW5pbmctaW4tMjAyMy1pbmR1c3RyeS1jaGFvc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Why is Bitcoin (BTC) Liquidity Declining in 2023? Liquidity Problem Offers Clues - Bloomberg",
        "content": "By just about any measure, Bitcoin liquidity remains low, despite the cryptocurrency’s eye-catching upsurge this year.\n\nInvestors have been paying more on trades because of slippage, or the difference between the expected price of a transaction and the price at which it’s fully executed, a sign of worsening liquidity, according to Conor Ryder at Kaiko. The higher the difficulty in trading, the more investors are exposed to potential volatile price swings."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTAyL3doLWlzLWJpdGNvaW4tYnRjLWxpcXVpZGl0eS1kZWNsaW5pbmctaW4tMjAyMy1pbmR1c3RyeS1jaGFvc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Why is Bitcoin (BTC) Liquidity Declining in 2023? Liquidity Problem Offers Clues - Bloomberg",
        "content": "By just about any measure, Bitcoin liquidity remains low, despite the cryptocurrency’s eye-catching upsurge this year.\n\nInvestors have been paying more on trades because of slippage, or the difference between the expected price of a transaction and the price at which it’s fully executed, a sign of worsening liquidity, according to Conor Ryder at Kaiko. The higher the difficulty in trading, the more investors are exposed to potential volatile price swings."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMizAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8taW5mbHVlbmNlcnMvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTMtYXByaWwtMjAyMy9hcnRpY2xlc2hvdy85OTIwNzUxOS5jbXPSAdABaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLWluZmx1ZW5jZXJzL2NyeXB0by1wcmljZXMtdG9kYXktbGl2ZS1uZXdzLWJpdGNvaW4tZG9nZWNvaW4tZXRoZXJldW0tc2hpYmhhLWludS1jcnlwdG9jdXJyZW5jeS1sYXRlc3QtdXBkYXRlcy0zLWFwcmlsLTIwMjMvYW1wX2FydGljbGVzaG93Lzk5MjA3NTE5LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin falls below $28k; Dogecoin, Shiba Inu shed up to 7% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading in the red on Monday. Bitcoin (BTC) fell 2.62% to $27,706, whereas Ethereum (ETH) was below the $1,800 level. BTC volume stood at approximately $13.60 billion, rising 28.72% in the last 24 hours.\"Bitcoin has traded below the US$28,000 zone in the past 24 hours as investors await fresh productivity and jobs data in the US this week. The immediate support lies at the US$27,500 level, while the resistance is at the US$28,100 zone and the trendline,\" Edul Patel, Co-founder and CEO at Mudrex, said.Other top crypto tokens were also trading lower. Dogecoin declined over 7%. Shiba Inu, Solana and BNB were also trading lower. The global cryptocurrency market cap was trading lower around $1.16 trillion, falling 2.27% in the last 24 hours.The total volume in DeFi is currently 3.62 billion, 10.61% of the total crypto market 24-hour volume. The volume of all stablecoins is now $29.78 billion, which is 87.42% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $536.28 billion. Bitcoin’s dominance is currently 46.21%, down 0.16% over the day, according to CoinMarketCap.\"Bitcoin's current price is $27,600 and hovers around a key trading range of $28,200 to $28,900. A definitive breakout from this range will play a significant role in determining the future direction of Bitcoin's price,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.Rajagopal Menon, Vice President at WazirX, said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 62.71, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) indicate a Neutral outlook as well at 69.33 and 38.60 respectively.\"The MACD Level (12, 26), at 1198.04, indicates Sell. The Stochastic RSI Fast (3, 3, 14, 14) and the Williams Percent Range (14) continue to be Neutral at 30.11 and −41.78, respectively,\" Menon added."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWNvcnJlbGF0aW9uLWdvbGQtdGlnaHRlbmVkLW1hcmNoLTE5NTExNjQ5OS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Correlation to Gold Tightened in March Amid TradFi Woes - Yahoo Finance",
        "content": "Bitcoin behaved more like one of the world’s most historic currencies in March, as the largest cryptocurrency by market cap exhibited a strong correlation to gold.\n\nThe value of the two assets moved in similar directions throughout the month, edging higher as a banking crisis reared its head in the U.S. and toppled several institutions like Silicon Valley Bank—which eventually spilled over to shutter European giants like Credit Suisse.\n\nThe correlation between Bitcoin and gold currently stands around 50%, according to blockchain analytics firm Kaiko. It represents the strongest connection between the two assets in more than a year, Kaiko analyst Dessislava Aubert told Decrypt.\n\n“It's a significant shift because over the course of 2022 Bitcoin and gold were mostly uncorrelated,” she said. “So, it was not moving as a safe haven [asset] at all.”\n\nOver the past month, Bitcoin has rallied 25% to around $28,000, notching its third positive month in a row despite regulatory headwinds. Meanwhile, gold has risen over 8% during the past month, nearing an all-time high of`$1,988 per troy ounce on Monday.\n\nBitcoin Is Pumping—But It’s Not Yet 'Decoupling' From Stocks, Analysts Say\n\nCryptocurrencies aren’t typically viewed as a safe haven asset—they’re generally seen as risky investments like stocks. And these risk assets have been hammered over the past year as the Federal Reserve has aggressively raised interest rates to quell inflation.\n\nBut Aubert said it’s possible for Bitcoin’s status as a risk asset to shift somewhat as investors’ perceptions of its strengths as a store of value change.\n\n“For now, people are trying to put Bitcoin in a very traditional framework,” Aubert said. “It’s very hard because it can be a lot of things.”\n\nMeanwhile, the correlation between Bitcoin and the S&P 500—a major index often used to gauge movements in the U.S. stock market—fell significantly in March to 20%, adding on to a trend that’s been building for months, said Aubert.\n\nStory continues\n\n“Bitcoin’s correlation with equities has been going down since December, steadily, and it's now very low,” she said, adding that 20% is essentially negligible.\n\nHowever, Aubert said that Bitcoin will remain influenced by factors that also impact stocks, such as the Fed’s monetary policy. She also noted that Bitcoin is sensitive to changes in liquidity overall.\n\nIs Bitcoin Really Decoupling From Stocks? Experts Weigh In\n\nAs Bitcoin begins to behave more like a safe haven asset and less like a risky one, there are some fundamental similarities between Bitcoin and gold that are notable, CoinShares’ Head of Research James Butterfill told Decrypt.\n\nOne element that the two assets have in common is that a finite supply supports their value, he said. Similar to how there’s a limited amount of accessible gold in the world, Bitcoin’s supply is capped at 21 million—with the last Bitcoin expected to be mined sometime in 2140, according to projections.\n\n“Bitcoin, in fact, is technically a harder asset than gold because it's a finite supply, but [also] a very well-known finite supply,” Butterfill said. “Theoretically, you could go out into the universe and find a ton of gold, bring it back to Earth, and flood the market.”\n\nIn terms of the cultural overlap between Bitcoin and gold, perhaps there is evidence to suggest they are converging on that front as well.\n\nThe California-based rapper Snoop Dogg stepped into the ring at WrestleMania 39 yesterday and was seen sporting a golden hardware wallet like an expensive chain."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jbGVhbnNwYXJrLXJlbGVhc2VzLW1hcmNoLTIwMjMtYml0Y29pbi0xMzAwMDA1OTUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "CleanSpark Releases March 2023 Bitcoin Mining Update - Yahoo Finance",
        "content": "Company mines 598 bitcoin in the month; Ends the first quarter of the calendar year with 1,871 bitcoin mined, up 22% from the prior quarter; 50MW Washington expansion on schedule\n\nExpansion of CleanSpark's Washington, Georgia, Bitcoin Mining Campus is On Schedule\n\nImage of CleanSpark's bitcoin mining facility expansion, currently under construction, in Washington, GA.\n\nExpansion of CleanSpark's Washington, Georgia, Bitcoin Mining Campus is On Schedule\n\nImage of CleanSpark's bitcoin mining facility expansion, currently under construction, in Washington, GA.\n\nLAS VEGAS, April 03, 2023 (GLOBE NEWSWIRE) -- CleanSpark, Inc. (Nasdaq: CLSK), America’s Bitcoin Miner™, today released its unaudited bitcoin mining and operations update for the month ending March 31, 2023.\n\n“Our approach to proprietary mining gives us substantial control and flexibility over our destiny and the progress on our Washington expansion is a perfect example,” said Zach Bradford, CEO. “The 50MW expansion is on schedule. The machines have already been purchased and shipping is expected to commence this month. Once those machines are racked and the expansion is energized, our hashrate is expected to increase to about 8.7 EH/s, giving us substantial progress toward our calendar year-end goal of 16 EH/s.\n\n“In this environment, a miner that is not growing is falling behind. As hashrate grows, we also need to grow. Growth takes substantial capital, just as it does in any commodities-based business, especially in the scaling stage. As we scale, we intend to continue to use all capital levers available to us, including equity and bitcoin, carefully balancing both to provide the highest rate of return for our shareholders. We are making the most of the bear market so that we are in position to take full advantage of the next bull market once it inevitably emerges.”\n\nMarch Bitcoin Mining Update (unaudited)\n\nBitcoin mined in March: 598\n\nCY2023 bitcoin mined: 1,871\n\nTotal BTC holdings as of March 31: 196\n\nTotal BTC converted for operations and growth in March: 502\n\nCurrently deployed fleet of about 67,700 latest-generation bitcoin miners with a hashrate of 6.7 EH/s\n\nThe Company funded growth and operations through the sale of 502 bitcoins in March 2023 at an average of approximately $24,800 per BTC. Sales of BTC equated to proceeds of approximately $12.4 million. March daily BTC mined averaged 19.29 and reached a high of 20.25.\n\nStory continues\n\nOperational Update\n\nWashington Expansion. The Washington expansion is a passively cooled data center consisting of four primary buildings. Once fully complete, the expansion will hold about 15,000 Antminer S19j Pro+ machines. Total capacity in Washington is expected to be 86MW, the majority of which is sourced from low-carbon, on-grid energy. Building 1 is complete and ready for miners. Racks are currently being installed in Building 2. The foundation was recently poured for Building 3, while concrete deliveries are imminent for Building 4. Scott Garrison, vice president of business development, is leading the expansion.\n\n“We are on schedule in Washington,” said Garrison. “One building is completely done and ready for miners, with the other buildings in various stages of construction, each advancing according to schedule. Our teams and partners, which include the utility, city, and various construction firms, are working hand-in-hand for the build. I’m so proud of what we are accomplishing on the ground in Washington as we work to build some of the most efficient bitcoin mining infrastructure in North America.”\n\nAbout CleanSpark\n\nCleanSpark (Nasdaq: CLSK) is America’s Bitcoin Miner™. Since 2014, we’ve helped people achieve energy independence for their homes and businesses. In 2020, we transitioned that expertise to develop sustainable infrastructure for Bitcoin, an essential tool for financial independence and inclusion. We strive to leave the planet better than we found it by sourcing and investing in low-carbon energy, like wind, solar, nuclear, and hydro. We cultivate trust and transparency among our employees, the communities we operate in, and the people around the world who depend on Bitcoin. CleanSpark holds the 44th spot on the Financial Times' 2022 List of the 500 Fastest Growing Companies in the Americas and ranks thirteenth on Deloitte’s Fast 500. For more information about CleanSpark, please visit our website at www.cleanspark.com.\n\nForward-Looking Statements\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding expectations for expansion of the Company’s Washington, Georgia bitcoin mining facility, the resulting anticipated benefits to CleanSpark (including as to anticipated additions to CleanSpark’s hashrate and the timing thereof) and plans to expand the facility. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). All statements other than statements of historical facts contained in this press release may be forward-looking statements. In some cases, you can identify forward-looking statements by terms such as “may,” “will,” “should,” “expects,” “plans,” “anticipates,” “could,” “intends,” “targets,” “projects,” “contemplates,” “believes,” “estimates,” “forecasts,” “predicts,” “potential” or “continue” or the negative of these terms or other similar expressions. Forward-looking statements contained in this press release, but are not limited to statements regarding our future results of operations and financial position, industry and business trends, business strategy, expansion plans, market growth and our objectives for future operations.\n\nThe forward-looking statements in this press release are only predictions. We have based these forward-looking statements largely on our current expectations and projections about future events and financial trends that we believe may affect our business, financial condition and results of operations. Forward-looking statements involve known and unknown risks, uncertainties and other important factors that may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements, including, but not limited to: the anticipated timing of the expansion; the risk that the electrical power available to our facilities does not increase as expected; the success of its digital currency mining activities; the volatile and unpredictable cycles in the emerging and evolving industries in which we operate; increasing difficulty rates for bitcoin mining; bitcoin halving; new or additional governmental regulation; the anticipated delivery dates of new miners; the ability to successfully deploy new miners; the dependency on utility rate structures and government incentive programs; dependency on third-party power providers for expansion efforts; the expectations of future revenue growth may not be realized; and other risks described in the Company's prior press releases and in its filings with the Securities and Exchange Commission (SEC), including under the heading \"Risk Factors\" in the Company's Annual Report on Form 10-K and any subsequent filings with the SEC. The forward-looking statements in this press release are based upon information available to us as of the date of this press release, and while we believe such information forms a reasonable basis for such statements, such information may be limited or incomplete, and our statements should not be read to indicate that we have conducted an exhaustive inquiry into, or review of, all potentially available relevant information. These statements are inherently uncertain and investors are cautioned not to unduly rely upon these statements.\n\nYou should read this press release with the understanding that our actual future results, performance and achievements may be materially different from what we expect. We qualify all of our forward-looking statements by these cautionary statements. These forward-looking statements speak only as of the date of this press release. Except as required by applicable law, we do not plan to publicly update or revise any forward-looking statements contained in this press release, whether as a result of any new information, future events or otherwise.\n\nInvestor Relations Contact\n\nMatt Schultz\n\nir@cleanspark.com\n\nMedia Contacts\n\nIsaac Holyoak\n\npr@cleanspark.com\n\nBlocksBridge Consulting\n\nNishant Sharma\n\ncleanspark@blocksbridge.com\n\nAttachments\n\nCONTACT: Isaac Holyoak CleanSpark Inc. 702-989-7694 pr@cleanspark.com\n\n\n\n"
    }
]