[
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9mZWF0dXJlcy8yMDIzLTEyLTIyL2JpZy10cmFkZXMtb2YtMjAyMy1haS1jaGluYS1iaXRjb2luLWJhbmtzLWVzZy1hbmQtbW9yZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Big Trades of 2023: AI, China, Bitcoin, Banks, ESG and More - Bloomberg",
        "content": "A big AI trade rescued the stock market. A niche bet on Bed Bath & Beyond sank amateur day traders. A buy-China call backfired on investing pros.\n\nA slew of trades around the world, from bank bonds to cryptocurrencies, either blew up or rocketed higher against expectations this year."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9mZWF0dXJlcy8yMDIzLTEyLTIyL2JpZy10cmFkZXMtb2YtMjAyMy1haS1jaGluYS1iaXRjb2luLWJhbmtzLWVzZy1hbmQtbW9yZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Big Trades of 2023: AI, China, Bitcoin, Banks, ESG and More - Bloomberg",
        "content": "A big AI trade rescued the stock market. A niche bet on Bed Bath & Beyond sank amateur day traders. A buy-China call backfired on investing pros.\n\nA slew of trades around the world, from bank bonds to cryptocurrencies, either blew up or rocketed higher against expectations this year."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jaGljYWdvLWF0bGFudGljLWZ1bmRzLW1hcmdvLWJpdGNvaW4tMTg0ODAwNTMxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Chicago Atlantic Funds Margo Bitcoin ATM Network - Yahoo Finance",
        "content": "CHICAGO, December 21, 2023--(BUSINESS WIRE)--Chicago Atlantic announced today the funding of a $16 million senior secured term loan to Margo, a cryptocurrency ATM operator that provides a secure and convenient way to instantly turn cash into digital currency.\n\nChicago Atlantic’s capital investment will help support Margo’s growing kiosk network.\n\n\"Margo is redefining the way consumers interact with digital currency, shaping the future of financial literacy by making cryptocurrency more accessible. We couldn’t think of a company better aligned with our people-first values and our drive to push innovation forward in categories of highest need. It’s an honor to partner with Margo as they expand their reach,\" said Tony Cappell, Founding Partner of Chicago Atlantic.\n\nFounded in 2019 as PowerCoin and rebranded in 2023, Margo’s user-friendly Bitcoin ATMs are featured nationwide in retailers including Royal Farms, H-E-B, Yesway, United Natural Foods Inc. (UNFI) and Ace Cash Express, among others. The company also includes a Private Client Desk, where individuals and institutions can trade $3,000 to $1 million in cryptocurrency per day across Bitcoin (BTC), Ethereum (ETH), USD Coin (USDC), NFTs or other tokens. Margo also helps business entities set up digital currency as a form of payment.\n\n\"Chicago Atlantic brought detailed solutions to the table designed to scale our business with the utmost care and confidence,\" said Austin Haller, CEO of Margo. \"Their experience in our cutting-edge industry will help propel our long-term objectives, and we look forward to empowering secure digital currency investments for years to come.\"\n\nAbout Chicago Atlantic\n\nChicago Atlantic is a private market investment manager combining deep expertise with an entrepreneurial approach to multi-asset class investing. Founding Partners John Mazarakis, Tony Cappell and Andreas Bodmeier established Chicago Atlantic in 2019 and have grown the firm’s private investment strategies to include opportunistic credit, private equity and impact investing. Chicago Atlantic has made over $2 billion in credit and equity investments to date.\n\nStory continues\n\nChicago Atlantic’s opportunistic credit strategy seeks to capitalize on North American investment opportunities that are time-sensitive, complex, or in dislocated markets, where risk is fundamentally mispriced. Focus areas are lending to esoteric industries, growth finance and liquidity solutions.\n\nChicago Atlantic’s team of over 70 professionals has offices in Miami, Florida and Chicago, Illinois. For more information on Chicago Atlantic’s financing products, visit chicagoatlantic.com.\n\nAbout Margo\n\nMargo is a leading cryptocurrency services provider rooted in the belief that financial empowerment should be inclusive and accessible to all. Margo breaks down barriers and offers its users a gateway to new financial possibilities through their network of Bitcoin ATMs. Margo's user-friendly Bitcoin ATMs offer a secure and convenient way to convert cash into digital currency instantly. Whether you're a seasoned cryptocurrency enthusiast or someone exploring the world of crypto, Margo’s mission is to make your journey as seamless as possible. Explore Crypto the Margo Way™ at MargoNetwork.com.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20231221868202/en/\n\nContacts\n\nFinancing Contact for Chicago Atlantic\n\nDavid A. Enright\n\nManaging Director\n\n(513) 725-7299\n\ndenright@chicagoatlantic.com\n\nMedia Contact for Chicago Atlantic\n\nAlise M. Edgcomb\n\nManaging Director, Public Relations\n\n(419) 202 – 3988\n\naedgcomb@chicagoatlantic.com\n\nBusiness Contact for Margo\n\nMichael Tomlinson\n\nChief Revenue Officer\n\n(877) 358-6169\n\nMT@margonetwork.com\n\nMedia Contact for Margo\n\nKirsten Jones\n\nDirector of Growth Marketing\n\n(877) 358-6169\n\npress@margonetwork.com"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMimwFodHRwczovL3d3dy5zcGdsb2JhbC5jb20vbWFya2V0aW50ZWxsaWdlbmNlL2VuL25ld3MtaW5zaWdodHMvbGF0ZXN0LW5ld3MtaGVhZGxpbmVzL2JpdGNvaW4tbWluaW5nLWVuZXJneS11c2UtZG91YmxlZC1pbi0yMDIzLWFzLWNyeXB0by1wcmljZXMtcm9zZS03OTg1NDM4MtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin mining energy use doubled in 2023 as crypto prices rose - S&P Global",
        "content": "Cryptocurrency mining rigs use large amounts of energy to cool and operate.\n\nSource: South_agency/E+ via Getty Images.\n\n\n\n\n\nGlobal energy consumption from bitcoin mining has grown 101% since Jan. 1 to reach 141.2 TWh as of Dec. 20, according to data from Digiconomist, a platform managed by Dutch economist and blockchain expert Alex de Vries.\n\nThe US is one of the largest bitcoin miners in the world, a separate analysis by the University of Cambridge estimated.\n\nThe rise in power demand reflects a rebound in bitcoin prices from a low of $16,611 on Jan. 1 to top $44,000 on Dec. 20. Observers attribute the rise in prices to the Federal Reserve signaling an end to rate increases and investors anticipating a bitcoin exchange-traded fund getting approval from US regulators in 2024, among other things.\n\n\"There's a very direct relationship between prices and electricity consumption,\" de Vries said in an interview. \"The more the value of the resource goes up, the more the miners are paid and the more they mine.\"\n\nAs bitcoin prices continue to move higher by the day, de Vries predicted, the industry's footprint will likely grow even more before the end of the year. But he stressed that the trajectory can change suddenly, if bitcoin's turbulent history is any indication.\n\nThe global crypto mining industry currently consumes as much electricity annually as Ukraine, Digiconomist estimated, and emits 78.7 million metric tons of CO 2 per year, as much as the nation of Oman.\n\nEnvironmental impacts are not limited to the energy the industry consumed from power plants burning fossil fuels. A paper de Vries published in late November in the journal Cell Reports Sustainability analyzed water usage from cooling power plants that produce electricity for bitcoin mining and water used to cool mining datacenters.\n\nAs mining continues to grow, the total US water use in 2023 could reach the equivalent of 27 billion gallons, the study estimated. That is about what Washington, DC, households use in a year, it said.\n\nLawmakers react\n\nBitcoin mining companies use powerful computers housed in sprawling datacenters to verify, process and record cryptocurrency transactions. A single bitcoin transaction using the \"proof-of-work\" process today requires 705 kWh of electricity, according to Digiconomist. By comparison, Ethereum uses 0.02 kWh after switching to a new approach in September 2022 known as \"proof of stake,\" cutting energy use 99%.\n\nNew York in 2022 imposed a two-year moratorium on bitcoin mining over concerns that the industry was using up too much of the state's renewable energy resources. Members of Congress have also voiced concerns over the industry's impact.\n\nA bill reintroduced by Senate Democrats in March called on the US Environmental Protection Agency to issue a rulemaking requiring cryptocurrency mining operations that use more than 5 MW of power annually and emit greenhouse gas emissions exceeding 25,000 metric tons to monitor and report such emissions. The bill never made it out of committee.\n\nThe same month, Rep. Pete Sessions (R-Texas) sponsored an opposite resolution declaring that \"energy development should be a key pillar to the growth of the United States economy, infrastructure, and national security, and Proof-of-Work mining can help develop advancements in all of these sectors.\"\n\nIndustry lobbyists weigh in\n\nBy August, the bitcoin mining industry had established an advocacy group in Washington, the Digital Energy Council, with a message that digital asset mining can help stabilize the electric grid. In October, another trade group, the Digital Power Network, lobbied Congress in support of Sessions' resolution.\n\n\"We met with nearly 40 members of Congress from both sides of the aisle, sharing tangible, real-world examples that underscore how the bitcoin mining industry is playing a pivotal role in advancing America's energy security in four significant ways: grid stability, national security, decarbonization and sustainability,\" Perianne Boring, CEO of the Chamber of Digital Commerce and organizer of the network's lobbying event, said in a release at the time.\n\nThe industry is also pointing to miners that invest in their own renewable energy sources to power datacenters, or that employ underutilized power sources that might otherwise go to waste. In Texas, the epicenter of US bitcoin mining, companies also take advantage of the state's demand response programs to help conserve energy during peak demand.\n\nRiot Platforms Inc., the largest bitcoin miner operating in Texas, collected $49.6 million in power curtailment credits from Texas during the third quarter, more than it made from mining, the company reported.\n\nTo date, however, no independent analysis has shown that the industry is getting greener or shrinking its carbon footprint, de Vries said.\n\nS&P Global Commodity Insights produces content for distribution on S&P Capital IQ Pro."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTIvMjEvYmF0aGhvdXNlLW55Yy1iaXRjb2luLW1pbmluZy1wb29scy_SAU1odHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzEyLzIxL2JhdGhob3VzZS1ueWMtYml0Y29pbi1taW5pbmctcG9vbHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 21 Dec 2023 08:00:00 GMT",
        "title": "An NYC bathhouse is mining Bitcoin to heat its pools—and score a “rebate” on its $20,000-a-month energy bill - Fortune",
        "content": "On the surface, Bathhouse is a classic Brooklyn wellness hangout. The city’s spa-ficionados make the trek to Williamsburg and pay upwards of $45 a day to soak in its pools, relax in its saunas, and socialize with other peak performers.\n\nBut beneath the wellness oasis lies a hidden operation: a dozen Bitcoin mining units are churning away 24/7 to power the spa’s two heated pools.\n\nInside the 11,000-square-foot refurbished factory, Bathhouse began its pre-crypto days in 2019 with three thermal pools (one hot, one tepid, one cold), two saunas, a steam room, and two hammams—heated marble stones for patrons to lay on. The permanently toasty environment translates to a whole lot of energy use.\n\n“Our ConEd bill kind of makes us want to throw up,” Bathhouse cofounder Travis Talmadge recently told Fortune.\n\nBathhouse began mining Bitcoin on its premises in 2021, using miners as “fancy pool heaters” to generate cryptocurrency in addition to heat. Miners now power its two heated pools using residual heat.\n\n“We’re basically in the heat-delivery business, or that’s a big portion of what we do,” Talmadge said. “The ability to pull heat off of mining Bitcoin made all the sense in the world—like we get a rebate for the energy that we buy.”\n\nFrom dingy to designer\n\nTalmadge met his cofounder, Jason Goodman, in 2014 thanks to a serendipitous Airbnb booking. Talmadge was vacationing at a property Goodman owned in Montauk, and the pair struck up a friendship over campfire hangouts on the beach.\n\nGoodman had been going to New York City bathhouses for post-gym recovery for years, and was mulling over starting one of his own. In 2016, Talmadge tagged along on one of his visits—and became an instant convert. “I get it now,” he remembers saying.\n\nGoodman and Talmadge, who have backgrounds in real estate and in institutional brokerage, respectively, loved the communal wellness experience but were frustrated by the “dingy” quality of some bathhouses. They saw an opportunity to update the 5,000-year-old tradition for a modern crowd.\n\n“Nobody was doing it from a place of New York City’s best hospitality standards, and from a place of modern design standards,” Goodman said.\n\nDown the rabbit hole\n\nWhile considering various ways to “trim the fat” of the business—particularly its “staggering” $20,000-per-month energy bill—Goodman and Talmadge each developed an interest in cryptocurrency, which Goodman chased down several YouTube rabbit holes.\n\nIn mid-2021, he came across a video of a man in middle America who had figured out how to heat his pool by mining Bitcoin. He sent the video to Talmadge with no additional context. “Oh my God, this makes the most sense in the world,” Talmadge remembers thinking.\n\nThey started running experiments with two miners made from off-the-shelf parts from Home Depot, PlumbingSupply.com, and DCX. In late 2021, they scaled up the operation to power the two heated pools in Bathhouse’s Williamsburg location using 12 Bitcoin miners that generate about 1,200 terahashes per second.\n\nAt Bathhouse’s location in the Flatiron District that’s set to open in the new year, all four hot pools and three hammams will be heated by 14 bigger, better Bitcoin miners at a 2,600-terahash-per-second rate.\n\nBack to ASICs\n\nBathhouse uses off-the-shelf ASICs (Application Specific Integrated Circuit)—essentially computers designed specifically for Bitcoin mining. “They have a huge problem—they have to dump heat,” Goodman said.\n\nAt Bathhouse, Goodman and Talmadge converted the miners for immersion cooling instead of air-cooling. “We strip the fans off, we put them in a special dielectric fluid,” Talmadge explains. “And so now, instead of that heat going into the air or being hot to touch on your computer, it’s much more powerful than that. It goes and heats the oil around it, and then you pull that heat out eventually on a heat exchanger.”\n\nThe heat exchanger on the tank has four ports: hot oil in, cold oil out, cold water in, and hot water out. The water from the “hot water out” port runs in a loop from the heat exchangers on the mining tanks to the heat exchangers in the pool plumbing, recycling the energy used by the miners to heat the water in the pools.\n\nCourtesy of Bathhouse\n\nBull market\n\nGoodman and Talmadge say Bathhouse’s energy bills have not changed much compared to the pre-crypto days.\n\n“We have to buy this energy anyway,” Talmadge said. “Whereas before, we got just heat out of it. Now we’re getting heat, and we’re getting assets.”\n\nBathhouse does not have any plans to sell the Bitcoin it mines. Instead, proceeds are stored in self-custody as the property of the company.\n\n“We are not trying to recover our energy costs necessarily with Bitcoin,” Goodman said. “We want to treasury the Bitcoin because we’re long-term believers in Bitcoin.”\n\nMoral compass\n\nIn June, Bathhouse posted an Instagram Reel explaining its mining process. Users flocked to the comment section, voicing their concerns about the environmental impact of mining cryptocurrency and asking Bathhouse for more transparency. Bitcoin is estimated to consume 127 terawatt-hours (TWh) of energy a year—more than some countries, including Norway, according to the Rocky Mountain Institute.\n\n“I think this is an important topic,” Goodman said. “Who decides which use of energy is moral, and which use of energy is not moral? Why is a pool heater a moral use of energy and a Bitcoin miner not?”\n\nGoodman and Talmadge pointed to the massive amounts of energy used by internet servers, the stock market, and even mobile phones—and reiterated that Bathhouse is buying the same amount of energy as it did before it began mining Bitcoin.\n\n“I would argue that Bitcoin is a very moral use of energy,” Goodman said. “Because having fair and equitable money is a very important thing for society.”\n\nTo the moon\n\nGoodman and Talmadge hope to see more businesses mine cryptocurrency on their premises. “There’s a lot of use cases for this,” Talmadge said. “You could heat all the domestic hot water in a building with Bitcoin miners. Hotels, anybody with big pools.”\n\nFollowing the opening of its new 36,500-square-foot location in the Flatiron District, where a day pass will cost $70 on weekdays and $85 on weekends, Bathhouse has plans to expand to Chicago and other cities. And yes, they’ll be bringing the Bitcoin miners with them.\n\n“Our plan is to continue building great bathhouses, continue heating our pools by recycling heat from mining operations, continue to treasury that,” said Goodman. “To go along for the ride.”"
    }
]