[
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA5LTI2L3NlYy1kZWZlcnMtZGVjaXNpb24tb24tYXJrLTIxc2hhcmVzLXNwb3QtYml0Y29pbi1ldGYtZmlsaW5nLWJ0Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "SEC Once Again Defers Decision on ARK 21Shares Spot Bitcoin ETF Filing - Bloomberg",
        "content": "The US Securities and Exchange Commission once again delayed making a decision on whether to approve the first US exchange-traded fund that invests directly in Bitcoin.\n\nThe primary US securities regulator deferred on a filing from crypto exchange-traded-products issuer 21Shares and Cathie Wood’s ARK Investment Management, according to documents posted on its website Tuesday."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1pbnN1cmFuY2UtY29tcGFueS1hbmNob3J3YXRjaC1yYWlzZXMtJTI0My1taWxsaW9uLXRvLWJyaW5nLW11bHRpc2lnLW1haW5zdHJlYW3SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin Insurance Company AnchorWatch Raises $3 Million to Bring Multisig Mainstream - Nasdaq",
        "content": "AnchorWatch, a leading insurer specializing in safeguarding Bitcoin holdings for commercial entities, announced a successful $3 million funding round today. The round was led by Ten31, with notable participation from Axiom BTC, Bitcoin Magazine Fund, Timechain, Bitcoin Opportunity Fund, and other investors. The infusion of capital will empower AnchorWatch to fulfill regulatory requirements and capital needs, paving the way for the launch of its Trident Vault software and the sale of insurance policies tailored for Bitcoin holders.\n\nAnchorWatch's Trident Vault software represents an another innovative solution for Bitcoin custody, combining protocol-native custody with high-quality, regulated insurance coverage. This addresses a critical gap in the Bitcoin market, providing greater confidence and security to BTC owners.\n\nTrident Vault is a Bitcoin vault designed exclusively for commercial use. It streamlines remote team workflows, introduces key holder seniority, and features time-locked spending conditions, thereby enhancing compliance and governance on-chain.\n\n“Bitcoin owners are still faced with the binary choice between self-custody and third-party sole custodians,” said Robert Hamilton, cofounder and CEO of AnchorWatch. “In the case of the latter, high-risk trading strategies, or worse, blatant fraudulent activities have resulted in catastrophic losses for customers. Thus, they are hesitant to rely on the commercial key holder to deliver the services promised. AnchorWatch makes owning and holding the bearer asset practical, safe, easy, secure, and verifiable.”\n\nAnchorWatch achieves collaborative custody through two key mechanisms. Firstly, Trident Vault facilitates assisted custody by holding a minority of keys and implementing protocol-level governance and compliance. This method enhances security by dispersing custody across different physical locations and unrelated entities, mitigating risks from events like fires, floods, and theft by internal or external actors.\n\nSecondly, AnchorWatch embeds regulated property insurance directly into Trident Vaults. This insurance ensures that assets are protected in the event of catastrophic incidents through regulated and collateralized property insurance. Thanks to Trident's advanced security, AnchorWatch can provide this insurance at competitive rates.\n\nJonathan Kirkwood, Managing Partner at Ten31, highlighted the significance of AnchorWatch's approach: “AnchorWatch is building both the technical infrastructure to advance bitcoin’s potential as programmable money and the credentialed legal/financial infrastructure for bitcoin to be held by commercial institutions via its insurance offerings. This is a pivotal step that directly aligns with our mission at Ten31 to establish bitcoin as a viable asset for institutions, and investing in the companies at the forefront of innovating in the ecosystem.”\n\nAnchorWatch caters to a diverse range of clients, including family trusts, funds, pensions, family offices, Bitcoin miners, and mining pools. The Trident Vault is especially valuable for estate and inheritance planning purposes, serving estate attorneys, investment advisors, and technical advisors who oversee multiple clients' Bitcoin custody needs.\n\nAnchorWatch's commitment to advancing Bitcoin custody and insurance solutions positions them at the forefront of the Bitcoin industry, ready to provide much-needed security and peace of mind for Bitcoin holders.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLXRyZWFkLXdhdGVyLXUtMDE0NzQ5MTI4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether tread water; U.S. equities slide with mega-cap tech giants leading the declines - Yahoo Finance",
        "content": "Bitcoin dipped on Wednesday morning in Asia to trade range-bound below US$26,300. Ether edged higher but failed to reclaim the US$1,600 mark. Other top 10 non-stablecoin cryptocurrencies traded mixed in the past 24 hours, with Binance’s BNB token leading the winners. The Open Network’s (TON) Toncoin led the losers. U.S. stock futures were up during early morning trading in Asia after Wall Street recorded losses of over 1% on Tuesday. More key inflation data is expected Thursday as investors look out for signs of a U.S. recession and further interest rate hikes. Mega-cap tech giants including Amazon, Apple and Tesla led the Wall Street declines.\n\nBitcoin ‘firm within September trading range’\n\nBitcoin edged 0.28% lower to US$26,209.51 in the 24 hours to 07:40 a.m. in Hong Kong for a weekly loss of 3.70%, according to CoinMarketCap data. The world’s largest cryptocurrency fell to US$26,090.71 on Tuesday evening. But it managed to stay above the US$26,000 support level maintained for the past 14 days.\n\nWith Bitcoin staying “firm within its September trading range,” blockchain analytics firm K33 Research wrote in an emailed note, “a narrowing trading range accompanied by a slow news cycle has provided traders with few reasons to participate actively in the market.”\n\nThe options pricing of Bitcoin derivatives on the CME market “shows a more positive longer term than short-term outlook but has become slightly more bearish in tandem with BTC’s price decline over the last week,” the K33 report added.\n\nEther was also trading flat. It edged up 0.33% to US$1,592.60 over the past 24 hours but lost 3.10% for the week. The token hit US$1,598.10 on Tuesday evening. But it failed to rise above the US$1,600 level it gave up on Sunday.\n\nWhile Ether is trading near a 14-month low against Bitcoin (0.061 BTC per ETH), that trend could be about to change, K33 report.\n\n“We reiterate our stance that rotating towards ETH is a sound play for the coming months, as futures-based ETFs can turn the trend. The first half of October will be pivotal in that regard, as the final deadlines for the ongoing futures ETH ETFs are coming up in this period,” wrote K33.\n\nStory continues\n\nMost other top 10 non-stablecoin cryptocurrencies booked losses for the past 24 hours. The exceptions were Ether, Binance’s BNB and Tron’s TRX. Toncoin continued to lead the losses. It dropped 1.66% in the past 24 hours to US$2.12 for a weekly decline of 17.75%.\n\nBNB, the native token of cryptocurrency exchange Binance Holdings Ltd, led the winners. The coin gained 1.06% to US$212.17, but it recorded a weekly loss of 2.30%.\n\nBNB’s daily rise coincided with the announcement Tuesday that Binance, the world’s largest crypto exchange, is collaborating with Japan’s largest banking group Mitsubishi UFJ Trust and Banking Corporation to issue fiat-pegged stablecoins in 2024.\n\nThe total crypto market capitalization dipped 0.28% in the past 24 hours to US$1.04 trillion, while trading volume dropped 10.02% to US$22.56 billion.\n\nWall Street losses amid recession fears\n\nImage: Getty Images\n\nU.S. stock futures were trading higher as of 09:40 a.m. in Hong Kong. The S&P 500 futures led the gains with a 0.21% increase. Wall Street closed lower Tuesday with all three major indexes booking losses of over 1%. The Nasdaq Composite led the losers with a 1.57% slide.\n\nMajor Asian stock indexes were mixed on Tuesday morning. China’s Shanghai Composite and Hong Kong’s Hang Seng booked gains, while South Korea’s Kospi and Japan’s Nikkei 225 dipped.\n\nU.S. economic data released Tuesday raised fears of recession. The Consumer Confidence Index tracked by the Conference Board dropped to 103.0 in September, lower than the analysts’ expectation of 105.5.\n\nThe data showed that “consumers continued to be preoccupied with rising prices in general, and for groceries and gasoline in particular,” wrote Dana Peterson, chief economist at The Conference Board.\n\n“Consumers also expressed concerns about the political situation and higher interest rates,” Peterson said.\n\nThe Expectations Index, based on consumers’ short-term outlook for income, business, and labor market conditions, declined to 73.7 in September from 83.3 in August. A reading below 80 signals a recession within the next year, according to the Conference Board.\n\n“Consumers may be hearing more bad news about corporate earnings, while job openings are narrowing, and interest rates continue to rise — making big-ticket items more expensive,” wrote Peterson.\n\nMeanwhile, new single-family home sales in the U.S. fell 8.7% to a seasonally adjusted annual rate of 675,000 in August, lower than the analysts’ projection of 698,000. The tight house supply, elevated prices and historically high mortgage rates contributed to the drop in home sales, according to Bloomberg on Wednesday.\n\nThe Federal Reserve in September kept interest rates unchanged between 5.25% and 5.50%, the highest level since early 2001. But the central bank might need to make another 25-basis-point rate hike by the end of 2023, and keep the rates higher for longer, according to remarks from Fed Chair Jerome Powell last Wednesday.\n\nThe Fed meets on Nov. 1 to make its next decision on interest rates. The CME FedWatch Tool predicts a 82.5% chance of no interest rate hike in November, up from 81.5% on Tuesday. It also gives a 65.8% chance of another pause in December, up from 60.9% on Tuesday\n\nOn the corporation front, the U.S. online retail giant Amazon.com, Inc. was among the worst performers on Tuesday. Its share price closed 4.03% lower. The Federal Trade Commission and 17 states sued Amazon Tuesday, claiming the firm wields illegal monopoly power.\n\nThe share prices of technology giants Apple, Inc. and Tesla, Inc. also dropped 2.34% and 1.16 respectively on Tuesday.\n\nInvestors are now waiting for the U.S. second-quarter personal consumption expenditure price index (PCE) on Thursday, which will provide further insights into inflation.\n\nElsewhere, China’s monthly industrial profits in August surprisingly rose 17.2% from a year earlier, reversing a 6.7% annual decline in July. The industrial profit from January to August fell 11.7% from the same period last year. But the drop decelerated compared to a 15.5% slide in the first seven months of the year.\n\n(Updates with equity section.)"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMjYvd2hlcmUtYXJlLWJpdGNvaW4tbWluZXJzLWluLTIwMjMtdGV4YXMuaHRtbNIBT2h0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA5LzI2L3doZXJlLWFyZS1iaXRjb2luLW1pbmVycy1pbi0yMDIzLXRleGFzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin miners beef up Texas operations ahead of extinction-level event, exclusive data shows - CNBC",
        "content": "Foundry's Kevin Zhang with Jihan Wu, the founder and chairman of Bitdeer and a co-founder of Bitmain. Kevin Zhang\n\nCrypto winters don't scare Kevin Zhang, who has been in the business of mining bitcoin for ten years. He's lived through a few bear markets in the last decade, but no matter where he has set up shop — the U.S., Sweden, the Republic of Georgia, and China — he's survived every one. In fact, it is precisely when things look most grim for the sector that Zhang typically doubles down. In 2013, for example, China banned bitcoin for the first time. The world's largest cryptocurrency immediately began to crash, and it was a slow bleed down in price for the next few years. As a wave of Western companies went bankrupt, Zhang decided to jump into mining. \"I saw an opportunity to leverage my Chinese language skills and cultural background to become one of the earliest and largest overseas customers of Chinese ASIC manufacturers,\" said Zhang, who was born in America but spent his early childhood in Beijing and Shenzhen. For the next four years, he sourced gear and institutional knowledge from China, ultimately scaling up a site in Montana to become the largest bitcoin mining facility in North America. Zhang has since brought that same cavalier attitude to Foundry, a mining firm tucked under Barry Silbert's crypto empire. In May 2020, bitcoin miners suffered two big blows: Much of the world shut down as Covid cases spiked and the most recent halving had just slashed the mining reward from 12.5 to 6.25 bitcoin per block mined. Zhang and the team at Foundry shrugged off the double whammy of blackswan events and spent hundreds of millions of dollars on its mining business, deploying tens of thousands of machines. By Nov. 2021, bitcoin hit an all-time peak of nearly $70,000. But the stakes are higher this time around.\n\nBitcoin miners are barreling toward the \"halving\" — a major market-making event that some fear will be a death knell to many in the industry. It happens roughly every four years and refers to an inflation-curbing schedule baked into bitcoin's code where the reward for mining a new block of transactions gets cut in half. Historically, it also coincides with the start of a bull run in the price of cryptocurrencies. Whereas traders eagerly await the halving, hoping for a potential spike in bitcoin's price, it represents a direct hit to revenues for miners, as they will receive 50% less bitcoin for every block they verify. In a capital-intensive industry with already tight margins, the reduced reward has the potential to prove apocalyptic for some operators. \"This is the ultimate test for miners,\" said Zhang, Foundry's senior vice president of business development. \"Some may not make it through; some may. But I feel confident that if they work with us, and work with other strong actors, they may have a good chance to survive this.\" When the halving takes effect in Apr. 2024, the reward for miners will drop to 3.125 bitcoin, or around $83,000. By comparison, the first blocks of bitcoin mined in 2009 carried a reward of 50 bitcoin. Without a commensurate surge in bitcoin's price to counterbalance the diminished block rewards, many mining outfits — especially those burdened by rising energy costs, paying down on machines bought at peak pricing in 2021 — could get obliterated overnight. But rather than seeing the 2024 halving as an extinction-level event, Foundry is expanding its operations — diving into machine sales, on-site deployment, and logistics. FoundryX is a marketplace for buying and selling miners, both new and used — while their recently unveiled logistics arm deals in the deployment and shipment of miners across state lines and international borders. Managed site services is another program newly debuted where, for its U.S. customers, Foundry will help staff and manage miners on-site. \"Foundry is in this for the long haul,\" said Zhang. \"We're taking a long-term bet on bitcoin and on the fact that bitcoin mining will survive and will bounce back even stronger.\" After China launched a fresh campaign against bitcoin mining in 2021, much of the industry migrated west to the U.S. Since then, some states have battled it out to attract mining companies, while others have actively legislated against them. The controversy goes to energy consumption. Mining at-scale involves data centers packed with highly specialized computers that crunch math equations in order to validate transactions and simultaneously create new tokens. It requires expensive equipment, some technical know-how, and a lot of electricity. Whereas places like Texas and Wyoming welcome the trade, New York lawmakers have created rules designed, in part, to keep miners out. A mining pool lets a single miner combine its hashing power with thousands of other miners all over the world. Even though some miners opt to hide their geographic footprint with a virtual private network, pools still function as a useful gauge of the general geographic spread of the mining industry. Foundry opted to show states even with small amounts of hashrate — an industry term used to describe the computing power of all miners in the bitcoin network — to demonstrate that mining is happening across the country on the Foundry USA Pool.\n\nWhinstone CEO Chad Harris takes CNBC on a tour of the largest bitcoin mine in North America.\n\nThe new data also confirms that Texas has cemented its position as the crypto capital of the United States, as miners flock there for abundant clean energy and a permissive regulatory environment. Texas made up 8.43% of the hashrate in the U.S. as of the end of 2021, and that percentage has jumped to 28.50% as of July 27, 2023 — though Foundry notes that the data was aggregated during a period of heavy curtailment in July, so Texas's percentage of actual hashrate is even greater than what's reflected on their latest map. Zhang added that Texas's growth in Foundry's map also had to do with the fact that the firm took on more clients there in the past two years. Given that the U.S. is currently the world leader in terms of its share of the collective hashrate of the bitcoin network, that makes Texas the bitcoin capital of the world. Texas has grown to dominate bitcoin mining partly because of support from local authorities and the operator of the Texas energy grid, ERCOT. ERCOT has historically struggled with fluctuating energy prices and sporadic service, so it strikes deals with flexible energy buyers like bitcoin miners to help keep excess energy online during low-demand cycles, then offers incentives for miners to stop their work, allowing that excess energy to flow back to the grid when demand is high. Research from Castle Island Venture's Nic Carter and a collective of other industry practitioners including Lancium's Shaun Connell and the former interim chief of ERCOT, Brad Jones, found that over the past decade, instances of negative pricing surged considerably, accounting for more than 6% of all hours in 2022 across wholesale markets in the U.S. The research paper went on to note that negative priced power may increase further in Texas, in particular, given that the state is rapidly onboarding wind and solar to its grid. Those conditions are ideal for bitcoin miners.\n\nwatch now\n\n\"All you have to do is pay the miners slightly more than what they would have made mining for bitcoin that hour,\" said bitcoin mining engineer Brandon Arvanaghi, who now runs Meow, a company that enables corporate treasury participation in crypto markets. Arvanaghi calls the setup a \"a win-win.\" For years, Riot has been powering down operations at its Rockdale mine, about an hour from Austin, to help ease the burden on the state's grid. In July, for instance, bitcoin miner Riot Platforms raked in more than $31.7 million to keep its mining operations offline — $24.2 million came from energy sold back to the ERCOT grid and the other $7.4 million came via demand response credits. \"August was a landmark month for Riot in showcasing the benefits of our unique power strategy,\" said Jason Les, CEO of Riot, in a recent press release. \"The effects of these credits significantly lower Riot's cost to mine Bitcoin and are a key element in making Riot one of the lowest cost producers of bitcoin in the industry.\" Even during the bear market, Texas miners are building out, buying new sites and fresh fleets of hardware. Riot Platforms, for example, has aggressive expansion plans in place in other parts of the state, including Navarro and Milam counties. \"Riot's ability to source such a significant expansion opportunity in Texas exemplifies the Company's partnership-driven approach with all stakeholders, including the Company's business partners, ERCOT, and all levels of government, to commit to sustainable economic development,\" Les said of the expansion plan. Bitdeer, which operates its biggest facility four-tenths of a mile down the road Riot's mine in Rockdale, is also in expansion mode. The mining company was spun off from Chinese bitcoin mining giant Bitmain and went public via SPAC earlier this year. Meanwhile, Cipher Mining purchased 11,000 new mining machines for its facility in Odessa, Texas, while Foundry has acquired mining sites from the bankruptcy estate of Compute North in Minden, Nebraska, and Big Spring, Texas.\n\nElsewhere in the U.S., previous leaders in bitcoin mining saw their influence wane. In the last two years, Foundry's dataset shows that Georgia — a miner-friendly state offering competitive pricing on electricity, as well as a mix of renewable power sources including solar and nuclear, has seen its share of the U.S. hashrate plunge from 34.17% to 9.64%. The drop was driven by a combination of factors, including Texas's growth overall and Foundry's expanding operations in particular, as well as by measurement differences — one large miner in the state declined to have their activity included in this year's map. Though its growth was stagnant compared to the previous study, New York's share of the U.S. hashrate declined from 9.53% in 2021 to 8.75%, driven mainly by the state's moratorium against new miners issued in Nov. 2022. Other mining winners that showed notable growth during the period included New Hampshire and Pennsylvania, while Nebraska, North Carolina, Kentucky, Oklahoma and Washington all saw significant drops. Despite the plunge in bitcoin valuations since 2021, as well as increasing regulatory scrutiny from the Securities Exchange Commission and other agencies looking to regulate some cryptocurrencies like securities, the total U.S. hashrate — a proxy for industry competition — has more than doubled since the end of 2021. According to an analyst note from JPMorgan Chase on Sept. 1, the bitcoin network's overall hashrate set a record high for the eighth consecutive month in August. Foundry says the rise is driven in part by institutions entering the space. JP Morgan researchers also note that the mining business has gotten less lucrative — miners make an average of $66,400 per day per exahash of mining capacity, versus nearly $342,000 at bitcoin's peak in Nov. 2021. Meanwhile, the aggregate market cap of the 14 U.S.-listed miners tracked by the bank has plunged below $10 billion. Riot was the biggest loser in August, down 39%, while Bitdeer was the biggest winner, up 30%."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDkvMjYvd2hlcmUtYXJlLWJpdGNvaW4tbWluZXJzLWluLTIwMjMtdGV4YXMuaHRtbNIBT2h0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA5LzI2L3doZXJlLWFyZS1iaXRjb2luLW1pbmVycy1pbi0yMDIzLXRleGFzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 26 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin miners beef up Texas operations ahead of extinction-level event, exclusive data shows - CNBC",
        "content": "Foundry's Kevin Zhang with Jihan Wu, the founder and chairman of Bitdeer and a co-founder of Bitmain. Kevin Zhang\n\nCrypto winters don't scare Kevin Zhang, who has been in the business of mining bitcoin for ten years. He's lived through a few bear markets in the last decade, but no matter where he has set up shop — the U.S., Sweden, the Republic of Georgia, and China — he's survived every one. In fact, it is precisely when things look most grim for the sector that Zhang typically doubles down. In 2013, for example, China banned bitcoin for the first time. The world's largest cryptocurrency immediately began to crash, and it was a slow bleed down in price for the next few years. As a wave of Western companies went bankrupt, Zhang decided to jump into mining. \"I saw an opportunity to leverage my Chinese language skills and cultural background to become one of the earliest and largest overseas customers of Chinese ASIC manufacturers,\" said Zhang, who was born in America but spent his early childhood in Beijing and Shenzhen. For the next four years, he sourced gear and institutional knowledge from China, ultimately scaling up a site in Montana to become the largest bitcoin mining facility in North America. Zhang has since brought that same cavalier attitude to Foundry, a mining firm tucked under Barry Silbert's crypto empire. In May 2020, bitcoin miners suffered two big blows: Much of the world shut down as Covid cases spiked and the most recent halving had just slashed the mining reward from 12.5 to 6.25 bitcoin per block mined. Zhang and the team at Foundry shrugged off the double whammy of blackswan events and spent hundreds of millions of dollars on its mining business, deploying tens of thousands of machines. By Nov. 2021, bitcoin hit an all-time peak of nearly $70,000. But the stakes are higher this time around.\n\nBitcoin miners are barreling toward the \"halving\" — a major market-making event that some fear will be a death knell to many in the industry. It happens roughly every four years and refers to an inflation-curbing schedule baked into bitcoin's code where the reward for mining a new block of transactions gets cut in half. Historically, it also coincides with the start of a bull run in the price of cryptocurrencies. Whereas traders eagerly await the halving, hoping for a potential spike in bitcoin's price, it represents a direct hit to revenues for miners, as they will receive 50% less bitcoin for every block they verify. In a capital-intensive industry with already tight margins, the reduced reward has the potential to prove apocalyptic for some operators. \"This is the ultimate test for miners,\" said Zhang, Foundry's senior vice president of business development. \"Some may not make it through; some may. But I feel confident that if they work with us, and work with other strong actors, they may have a good chance to survive this.\" When the halving takes effect in Apr. 2024, the reward for miners will drop to 3.125 bitcoin, or around $83,000. By comparison, the first blocks of bitcoin mined in 2009 carried a reward of 50 bitcoin. Without a commensurate surge in bitcoin's price to counterbalance the diminished block rewards, many mining outfits — especially those burdened by rising energy costs, paying down on machines bought at peak pricing in 2021 — could get obliterated overnight. But rather than seeing the 2024 halving as an extinction-level event, Foundry is expanding its operations — diving into machine sales, on-site deployment, and logistics. FoundryX is a marketplace for buying and selling miners, both new and used — while their recently unveiled logistics arm deals in the deployment and shipment of miners across state lines and international borders. Managed site services is another program newly debuted where, for its U.S. customers, Foundry will help staff and manage miners on-site. \"Foundry is in this for the long haul,\" said Zhang. \"We're taking a long-term bet on bitcoin and on the fact that bitcoin mining will survive and will bounce back even stronger.\" After China launched a fresh campaign against bitcoin mining in 2021, much of the industry migrated west to the U.S. Since then, some states have battled it out to attract mining companies, while others have actively legislated against them. The controversy goes to energy consumption. Mining at-scale involves data centers packed with highly specialized computers that crunch math equations in order to validate transactions and simultaneously create new tokens. It requires expensive equipment, some technical know-how, and a lot of electricity. Whereas places like Texas and Wyoming welcome the trade, New York lawmakers have created rules designed, in part, to keep miners out. A mining pool lets a single miner combine its hashing power with thousands of other miners all over the world. Even though some miners opt to hide their geographic footprint with a virtual private network, pools still function as a useful gauge of the general geographic spread of the mining industry. Foundry opted to show states even with small amounts of hashrate — an industry term used to describe the computing power of all miners in the bitcoin network — to demonstrate that mining is happening across the country on the Foundry USA Pool.\n\nWhinstone CEO Chad Harris takes CNBC on a tour of the largest bitcoin mine in North America.\n\nThe new data also confirms that Texas has cemented its position as the crypto capital of the United States, as miners flock there for abundant clean energy and a permissive regulatory environment. Texas made up 8.43% of the hashrate in the U.S. as of the end of 2021, and that percentage has jumped to 28.50% as of July 27, 2023 — though Foundry notes that the data was aggregated during a period of heavy curtailment in July, so Texas's percentage of actual hashrate is even greater than what's reflected on their latest map. Zhang added that Texas's growth in Foundry's map also had to do with the fact that the firm took on more clients there in the past two years. Given that the U.S. is currently the world leader in terms of its share of the collective hashrate of the bitcoin network, that makes Texas the bitcoin capital of the world. Texas has grown to dominate bitcoin mining partly because of support from local authorities and the operator of the Texas energy grid, ERCOT. ERCOT has historically struggled with fluctuating energy prices and sporadic service, so it strikes deals with flexible energy buyers like bitcoin miners to help keep excess energy online during low-demand cycles, then offers incentives for miners to stop their work, allowing that excess energy to flow back to the grid when demand is high. Research from Castle Island Venture's Nic Carter and a collective of other industry practitioners including Lancium's Shaun Connell and the former interim chief of ERCOT, Brad Jones, found that over the past decade, instances of negative pricing surged considerably, accounting for more than 6% of all hours in 2022 across wholesale markets in the U.S. The research paper went on to note that negative priced power may increase further in Texas, in particular, given that the state is rapidly onboarding wind and solar to its grid. Those conditions are ideal for bitcoin miners.\n\nwatch now\n\n\"All you have to do is pay the miners slightly more than what they would have made mining for bitcoin that hour,\" said bitcoin mining engineer Brandon Arvanaghi, who now runs Meow, a company that enables corporate treasury participation in crypto markets. Arvanaghi calls the setup a \"a win-win.\" For years, Riot has been powering down operations at its Rockdale mine, about an hour from Austin, to help ease the burden on the state's grid. In July, for instance, bitcoin miner Riot Platforms raked in more than $31.7 million to keep its mining operations offline — $24.2 million came from energy sold back to the ERCOT grid and the other $7.4 million came via demand response credits. \"August was a landmark month for Riot in showcasing the benefits of our unique power strategy,\" said Jason Les, CEO of Riot, in a recent press release. \"The effects of these credits significantly lower Riot's cost to mine Bitcoin and are a key element in making Riot one of the lowest cost producers of bitcoin in the industry.\" Even during the bear market, Texas miners are building out, buying new sites and fresh fleets of hardware. Riot Platforms, for example, has aggressive expansion plans in place in other parts of the state, including Navarro and Milam counties. \"Riot's ability to source such a significant expansion opportunity in Texas exemplifies the Company's partnership-driven approach with all stakeholders, including the Company's business partners, ERCOT, and all levels of government, to commit to sustainable economic development,\" Les said of the expansion plan. Bitdeer, which operates its biggest facility four-tenths of a mile down the road Riot's mine in Rockdale, is also in expansion mode. The mining company was spun off from Chinese bitcoin mining giant Bitmain and went public via SPAC earlier this year. Meanwhile, Cipher Mining purchased 11,000 new mining machines for its facility in Odessa, Texas, while Foundry has acquired mining sites from the bankruptcy estate of Compute North in Minden, Nebraska, and Big Spring, Texas.\n\nElsewhere in the U.S., previous leaders in bitcoin mining saw their influence wane. In the last two years, Foundry's dataset shows that Georgia — a miner-friendly state offering competitive pricing on electricity, as well as a mix of renewable power sources including solar and nuclear, has seen its share of the U.S. hashrate plunge from 34.17% to 9.64%. The drop was driven by a combination of factors, including Texas's growth overall and Foundry's expanding operations in particular, as well as by measurement differences — one large miner in the state declined to have their activity included in this year's map. Though its growth was stagnant compared to the previous study, New York's share of the U.S. hashrate declined from 9.53% in 2021 to 8.75%, driven mainly by the state's moratorium against new miners issued in Nov. 2022. Other mining winners that showed notable growth during the period included New Hampshire and Pennsylvania, while Nebraska, North Carolina, Kentucky, Oklahoma and Washington all saw significant drops. Despite the plunge in bitcoin valuations since 2021, as well as increasing regulatory scrutiny from the Securities Exchange Commission and other agencies looking to regulate some cryptocurrencies like securities, the total U.S. hashrate — a proxy for industry competition — has more than doubled since the end of 2021. According to an analyst note from JPMorgan Chase on Sept. 1, the bitcoin network's overall hashrate set a record high for the eighth consecutive month in August. Foundry says the rise is driven in part by institutions entering the space. JP Morgan researchers also note that the mining business has gotten less lucrative — miners make an average of $66,400 per day per exahash of mining capacity, versus nearly $342,000 at bitcoin's peak in Nov. 2021. Meanwhile, the aggregate market cap of the 14 U.S.-listed miners tracked by the bank has plunged below $10 billion. Riot was the biggest loser in August, down 39%, while Bitdeer was the biggest winner, up 30%."
    }
]