[
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTE5L3doYXQtYXJlLW9yZGluYWxzLWFuZC1jYW4tZG9uYWxkLXRydW1wLW5mdHMtYm9vc3QtYml0Y29pbi1idGMtYmxvY2tjaGFpbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Feb 2023 08:00:00 GMT",
        "title": "What Are Ordinals; Can Donald Trump NFTs Boost Bitcoin (BTC) Blockchain - Bloomberg",
        "content": "Some hard-core Bitcoiners are in an uproar over the prospect of ubiquitous internet memes such as pixelated cats and smoking monkeys clogging up the blockchain.\n\nCasey Rodarmor, the creator of the recently introduced NFT protocol called Ordinals that is at the center of the angst, says not to worry. He sees inscriptions, or the newfangled nonfungible tokens, giving the oldest blockchain a fresh use case that can boost its utility. Detractors argue they’ll crowd out regular transactions with high fees due to the large amounts of data required to inscribe the digital images, GIFs and representations, undermining Bitcoin’s original mission as a peer-to-peer payment network."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTE5L3doYXQtYXJlLW9yZGluYWxzLWFuZC1jYW4tZG9uYWxkLXRydW1wLW5mdHMtYm9vc3QtYml0Y29pbi1idGMtYmxvY2tjaGFpbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Feb 2023 08:00:00 GMT",
        "title": "What Are Ordinals; Can Donald Trump NFTs Boost Bitcoin (BTC) Blockchain - Bloomberg",
        "content": "Some hard-core Bitcoiners are in an uproar over the prospect of ubiquitous internet memes such as pixelated cats and smoking monkeys clogging up the blockchain.\n\nCasey Rodarmor, the creator of the recently introduced NFT protocol called Ordinals that is at the center of the angst, says not to worry. He sees inscriptions, or the newfangled nonfungible tokens, giving the oldest blockchain a fresh use case that can boost its utility. Detractors argue they’ll crowd out regular transactions with high fees due to the large amounts of data required to inscribe the digital images, GIFs and representations, undermining Bitcoin’s original mission as a peer-to-peer payment network."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWNvbnRpbnVlcy10by1taXJyb3ItMjAxNy1hcy13ZWVrZW5kLXNlZXMtdGhpcmQtYXR0YWNrLW9uLTI1a9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin continues to 'mirror' 2017 as weekend sees third attack on $25K - Cointelegraph",
        "content": "Bitcoin (BTC) tapped $25,000 for a third time on Feb. 19 as an all-important weekly close approached.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nAnalysis warns over whale moves\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD hitting $25,038 on Bitstamp.\n\nOut-of-hours trading continued to see bulls pushing for a support-resistance flip of the key level, this marking the start of a major resistance cloud involving several long-term trend lines.\n\nWith everything to play for into the weekly close, the atmosphere among traders was tense.\n\n“Sunday price movement can typically only be trusted towards daily close. Other than that, just gotta hope it stays in current range,\" popular trader Josh Rager acknowledged on Twitter.\n\nAnalyzing Binance order book activity, monitoring resource Material Indicators warned that large-volume players were still manipulating spot price by moving bid and ask levels.\n\n#FireCharts 2.0 (beta) shows \"they\" just cleared a path to $25.2k, but \"they\" also pulled the notorious bid wall and moved it down to ~$23,450.#RiskManagement for the W. pic.twitter.com/RFKTc0CfYT — Material Indicators (@MI_Algos) February 19, 2023\n\n“The notorious BTC buy wall moved AGAIN!” it wrote in a previous update.\n\n“It appears they are trying to push price into their own asks. If they can attract enough buyers to clear $25k there's little friction to $26k and thin air to $30k. No clue how long they can do this. Happy to play along.”\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\nAt the time of writing, volatility continued to edge back into spot markets with still more than six hours remaining until the UTC weekly candle close.\n\n2017 comparison suggests “big move” in coming week\n\nThe longer-term view meanwhile formed cause for calm for trading suite Decentrader on the day.\n\nRelated: Bitcoin faces do-or-die weekly, monthly close with macro bull trend at stake\n\nComparing current price behavior to Bitcoin’s previous four-year halving cycle, the firm argued that in fact, everything was playing out in line with historical norms.\n\n“The recent move from $17k to $23k matches the 2017 move around the 1000 day mark,” it tweeted alongside an explanatory chart.\n\n“Price ranged and moved slightly higher for 30 days and then put in another big move of roughly equal size. If Bitcoin continues to mirror 2017 we could be in for a big move this week.”\n\nBTC price comparative chart. Source: Decentrader/Twitter\n\nDecentrader CEO Filbfilb additionally stated that $180,000 was “the target” for BTC/USD upside.\n\n“I’ll finesse with rational later but this is the short form,” he added.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vbmV3cy51Z2EuZWR1L2JpdGNvaW4tZGVwb3QtdG9wcy0yMDIzLWJ1bGxkb2ctMTAwL9IBPWh0dHBzOi8vbmV3cy51Z2EuZWR1L2JpdGNvaW4tZGVwb3QtdG9wcy0yMDIzLWJ1bGxkb2ctMTAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Feb 2023 08:00:00 GMT",
        "title": "Bulldog 100: Bitcoin Depot named fastest-growing UGA business - University of Georgia",
        "content": "This year's winner, Bitcoin Depot, is the largest cryptocurrency ATM operator in the world. (Submitted photo)\n\nThe University of Georgia Alumni Association recognized the fastest-growing companies owned or led by UGA alumni during the 14th annual Bulldog 100 Celebration on Feb. 18 in the West End Zone of Sanford Stadium.\n\nThe 2023 fastest-growing business, Bitcoin Depot, was founded and is led by Brandon Mintz. Mintz earned a Bachelor’s of Business Administration from the Terry College of Business in 2016.\n\nBitcoin Depot, based in Atlanta, is the largest cryptocurrency ATM operator in the world. They operate more than 7,000 ATMs across the United States and Canada.\n\nRounding out the Bulldog 100 top 10 are:\n\nRoadie, Suwanee, Georgia Ryals Brothers LLC, Gainesville, Georgia Glass & Robson LLC, Atlanta, Georgia LangScapes Athens LLC, Winterville, Georgia BIOLYTE, Marietta, Georgia Rugged Road LLC, Duluth, Georgia enewton Design, Atlanta, Georgia Personality Matters, Atlanta, Georgia Georgia Insulation LLC, Gainesville, Georgia\n\n“It’s our privilege and honor to recognize these alumni, to connect them even more to the greater Bulldog network, and to celebrate the spirit of innovation that every Bulldog carries,” said Meredith Gurley Johnson, executive director of the UGA Alumni Association. “We were thrilled to welcome these Bulldogs back to campus, and we look forward to continuing to celebrate their growing impact in their communities, industries and businesses.”\n\nThe Bulldog 100 companies were ranked, regardless of size, based on their three-year compounded annual growth rates. The Atlanta office of Warren Averett CPAs and Advisors—a Bulldog 100 partner since the program began in 2009—verifies the information submitted by each company and determines the ranked list. On average, companies in the 2023 Bulldog 100 grew by 50 percent each year from 2020-2022.\n\nNominations were accepted from August 2021 to August 2022. UGA received 281 nominations for the 2023 Bulldog 100. Each organization must have been in business since 2019, experienced revenues over $100,000 for the calendar year 2020, and be owned or operated by a former UGA student who owns at least half of the company or is the CEO, president or managing partner.\n\nThe fifth annual Michael J. Bryan Award was presented during the Feb. 18 event. The award, named for the co-founder and managing partner of Vino Venue and Atlanta Wine School who passed away in 2017 after a long battle with cancer, recognizes a returning Bulldog 100 honoree who demonstrates the entrepreneurial spirit and commitment to UGA that was Bryan’s hallmark. This year’s recipient is Biren Patel, founder and president of Biren Patel Engineering, and a 2012 UGA graduate.\n\nTo view the complete list of 2023 Bulldog 100 businesses, visit alumni.uga.edu/b100.\n\nNominations for the 2024 Bulldog 100 are open through July 31."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZGFpbHljb2luLmNvbS9iaXRjb2luLW5mdHMtd2hhdC1tYWtlcy1idGMtanBlZ3MtZXh0cmEtb3JkaW5hbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin NFTs: What Makes BTC JPEGs so Extra-Ordinal? - DailyCoin",
        "content": "Whether you call them Bitcoin NFTs, digital artifacts, or Ordinals, these new JPEGs are brewing up a storm and making waves across the crypto space. With Bitcoin Punks selling for upwards of 1.1 BTC (17.50 ETH), non-fungible tokens on the bitcoin blockchain are not to be ignored.\n\nSince when has the Bitcoin network become the hottest place to trade NFTs? What does this mean for BTC transaction fees, and why is the Bitcoin community against all this newfound interest?\n\nMost importantly, which Bitcoin NFT collection will be the next Bored Apes, and how can I buy these trending digital assets?\n\nWhat Are BTC Ordinals?\n\nThe Ordinal protocol allows users to inscribe data, like an image or file, onto an individual satoshi. In the same way that 100 cents make up one dollar, 100,000,000 satoshis = 1 BTC. Casey Rodarmor, the founder behind the protocol, claims that these digital artifacts “reflect what NFTs should be.”\n\nWhile upgradeable NFT standards and enforceable royalties have become popular on other blockchains, Bitcoin NFTs are truly immutable, permissionless, and censorship-resistant. This leads to some creative use cases, as speculated by the wider Bitcoin community:\n\nBitcoin NFTs are slightly different from their cousins over on Ethereum, Solana, and Avalanche. Ordinal NFTs store the entirety of the inscribed data directly on-chain instead of simply linking a JPEG to a non-fungible token.\n\nAll this was made possible following a loophole Casey Rodarmor discovered in the latest Bitcoin Taproot upgrade. Limited only by block size, data can now be stored on-chain on the world’s most decentralized blockchain. What’s more, the protocol doesn’t really on any smart contracts. While this arguably streamlines the protocol, it complicates future utilities like DeFi integrations.\n\nAre Ordinals the First Bitcoin NFTs?\n\nDespite what the newer generation of cryptocurrency enthusiasts might believe, this isn’t the first time we’ve seen NFTs on the bitcoin network. Crypto veterans will remember NameCoin NFTs, which, while not quite resembling today’s Apes and Punks, are widely considered the first non-fungible tokens.\n\nIn 2015, the Counterparty network hosted NFT trading card games and the now-iconic RarePepe Card Collection. While these early NFTs are technically considered Counterparty NFTs, they used bitcoin network functions to anchor references on the original blockchain, giving them their place in Bitcoin history.\n\nBitcoin Community and JPEGs: More Controversy\n\nLike any revolutionary new technology, Bitcoin NFTs have divided the Bitcoin community into two camps. Bitcoin maximalists have shunned Ordinals from the outset, arguing that BTC is a financial instrument. They believe that adding Ordinal NFTs into the mix only corrupts the network and dilutes the value of the world’s first cryptocurrency.\n\nOn the other hand, Bitcoin NFTs have arguably brought renewed interest to the network and raised the ceiling on potential use cases for Bitcoin blockchain. Ordinals add an additional layer of culture and history to the bitcoin archives, while also benefitting BTC miners thanks to boosted transaction fees. Network congestion leads to limited block space and a spike in BTC gas.\n\nComplications with Bitcoin NFTs\n\nBefore strapping on your FOMO boots and diving into the non-existent Bitcoin Metaverse, there are a few things you need to know. The Ordinal NFT ecosystem is still in its infancy and demands a high level of technical knowledge to navigate effectively.\n\nFirst of all, there is no NFT marketplace on the bitcoin network. All Ordinal NFT trades are completed through trusted peer-to-peer trades in Discord servers and telegram channels. As is often the case, these trading environments attract plenty of scammers and nefarious actors.\n\nIf you’re trading Bitcoin NFTs OTC, do your due diligence and use a reliable middleman or intermediary.\n\nAs if the barrier to entry wasn’t already high enough, things just get more complex. You can’t sell, transfer or trade a native Ordinal NFT unless you’re running a full bitcoin node on your computer. Setting up a node isn’t easy, and syncing it up with the bitcoin network can take up to three days.\n\nFortunately, there is an easier way to create a Bitcoin NFT. Sites like Ordinals.bot and Gamma.io simplify the process but severely limit your BTC transactions. Unless you’re running a node, you still won’t be able to sell or transfer your NFT.\n\nFinally, you can currently only hold one Ordinal NFT per bitcoin wallet. What’s more, if you accidentally send the satoshi that your Bitcoin NFT is inscribed on, you’ll lose it forever, even if you’re sending it to a trusted crypto exchange like Binance.\n\nDiving into the world of Bitcoin NFTs is a bit of a jungle. The high barrier to entry has only added to the scarcity and FOMO surrounding these digital artifacts, which have been exploding on crypto news platforms. Thankfully, there are a few workarounds that make things easier.\n\nHow to Trade BTC Ordinals on Ethereum\n\nThere is a solution if you’re itching to get your hands on a Bitcoin NFT but don’t have the technical knowledge or time to go through the exhausting Ordinal onboarding process.\n\nEmblem Vaults are a unique approach to NFT trading that allows users to package data from other chains like Bitcoin and Dogecoin into an Ethereum NFT. Each Emblem Vault contains private keys for data, like NFTs, that are stored on other blockchains. Emblem Vaults make it possible to trade NFTs from other networks like Bitcoin and Solana as if they were Ethereum NFTs.\n\nOne could argue that this represents peak irony in the crypto space. Even after all these years and all the progress the industry has witnessed, we’re still generating Ethereum-native punk art on other chains. This isn’t a new idea, but this is the first time we’ve started repackaging these outsider punks to resell them on Ethereum.\n\nAs always, buying Emblem Vaults on Opensea carries an element of risk. Because anything can be coded into an Emblem Vault, it’s difficult to know if the vault you’re looking at contains a genuine Bitcoin Punk. Seeing the same Ordinal NFT listed three times in a row undoubtedly raises some red flags.\n\nIt’s recommended to always conduct thorough research before buying any Emblem Vaults claiming to contain Bitcoin NFTs. Otherwise, you find yourself chalking up more capital losses on your crypto taxes.\n\nOn the Flipside\n\nOrdinal NFTs are the latest gold rush in the crypto market; however, the high barrier to entry makes it difficult to navigate and gives scammers and bad actors a platform to take advantage of unaware users.\n\nWhy You Should Care\n\nBitcoin NFTs are increasing network congestion on the Bitcoin network. While this is great for Bitcoin miners, regular users suffer from higher transaction fees and network congestion.\n\nFAQs"
    }
]