[
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2NpdHkvbXVtYmFpLzE4LXlyLW9sZC15b3V0aC1sb3Nlcy0zLTZsLXRvLWJpdGNvaW4tZnJhdWQvYXJ0aWNsZXNob3cvMTAyMDI4NjIwLmNtc9IBeWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2NpdHkvbXVtYmFpLzE4LXlyLW9sZC15b3V0aC1sb3Nlcy0zLTZsLXRvLWJpdGNvaW4tZnJhdWQvYW1wX2FydGljbGVzaG93LzEwMjAyODYyMC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "18-yr-old youth loses Rs 3.6 lakh to Bitcoin fraud - The Times of India",
        "content": "MUMBAI: A group of cyber fraudsters lured an 18-year-old college student to invest in Bitcoin, sent him a link of a fake Bitcoin trading platform and duped him of Rs 3.58 lakh.The Matunga police have booked unknown fraudsters under IPC sections for cheating, forgery, and breach of trust and also under the Information Technology Act. Police said the victim, who studies in a college in Central Mumbai, received a link on Whatsapp on investment in Bitcoin.When he clicked on the link, the message assured him that if he invested a sum of Rs 5,000, he would get Rs 55,000 within 12 hours. Believing the fraud message, the victim invested Rs 5,000 after which he received a scratch card. Once he scratched the card, it showed him a profit of Rs 65,000 in his account. When he tried to withdraw the amount, he couldn’t. He then called on the WhatsApp number to find out what was wrong, but the person who answered told him to invest another Rs 34,500 to withdraw his profit. Over a period of time, the caller convinced him to pay Rs 3.58 lakh and duped him."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpdGNvaW4tbmV3cy9iaXRjb2luLTE3NTAwMC1icmVhay1hYm92ZS1yaXNpbmctY2hhbm5lbC_SAVNodHRwczovL3d3dy5uZXdzYnRjLmNvbS9iaXRjb2luLW5ld3MvYml0Y29pbi0xNzUwMDAtYnJlYWstYWJvdmUtcmlzaW5nLWNoYW5uZWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Will Reach $175,000 If Prices Break Above This Rising Channel, Trader Claims - NewsBTC",
        "content": "Bitcoin’s six-year range inside a rising channel has drawn the attention of a curious but optimistic analyst. Previewing the price chart shows that the coin has been in range over the years, capturing all of its volatility. Despite occasional dumps and pumps, the structure is yet to be broken.\n\nBy the time the screenshot was shared on July 21, Bitcoin was trading in the lower part of the rising channel, skirting the support trend line, an indicator that prices have been generally lower in recent months. The rejection of lower lows and bounce from the support trend line, the analyst says, is bullish and squarely puts back bulls in contention.\n\nBitcoin To $175,000?\n\nAccording to the trader’s assessment, a breakout above the upper resistance level at around $32,000 could potentially trigger a new bull run that may see the world’s most valuable cryptocurrency retest highs of the rising channel at $175,000, a level that upbeat HODLers can mark as a feasible target.\n\nStill, considering the volatility in crypto, this bullish forecast cannot be dismissed. To illustrate, the last bull run drove Bitcoin prices from sub-$10,000 to peaks of $69,000 in less than two years. Therefore, if Bitcoin bulls push above $32,000, a price level that the analyst claim is important, it could be a bullish signal that may be the beginning of another leg up in the resumption of the bullish formation set in motion between 2020 and 2021.\n\nBitcoin is trading below the $30,000 level at spot rates with resistance at $31,800. Despite the general optimism across the board, bulls are yet to breach July 2023 highs as prices consolidate.\n\nHalving And ETF Approval As Tailwinds?\n\nSpecific triggers for the next run are unknown for now. Even so, considering past cycles, the upcoming Bitcoin halving event may provide the impetus for a leg up toward 2021 highs at $69,000. Besides, traders are closely monitoring how the spot Bitcoin exchange-traded fund (ETF) applications in the United States progresses.\n\nThe US Securities and Exchange Commission (SEC) has rejected several spot Bitcoin ETF applications in the past. However, the involvement of BlackRock has been received positively, lifting prices in the past few weeks. BlackRock is the world’s largest asset manager, managing trillions.\n\nThe approval of a Bitcoin ETF would ease institutional investors’ involvement in the sphere, potentially driving demand and lifting prices. Most importantly, a Bitcoin ETF legitimizes Bitcoin as an investment asset. Bitcoin is the most dominant crypto asset, and complex derivatives instruments, including exchange-traded products (ETPs), have been approved and listed in various markets across Canada, Europe, and Brazil.\n\nFeature image from Canva, chart from TradingView\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93ZWVrLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tZGlwLTE3MDgzMDk3My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Dip as Chainlink, XRP, XLM Lead Growth - Yahoo Finance",
        "content": "Illustration by Mitchell Preffer for Decrypt.\n\nLast week’s blistering altcoin rally tapered off this week as Chainlink, XRP, XLM, Stellar and TRX were the only coins to post any notable gains over the last seven days.\n\nBitcoin (BTC) and Ethereum (ETH) entered the weekend slightly lower than they did this time last week.\n\nBitcoin dropped 1.5% to its current price of $29,869, according to CoinGecko. Meanwhile, the world’s second favorite coin, ETH, dropped 2.5% to trade at $1,888 at the time of writing.\n\nThe steepest pullbacks among leading currencies this week were from Solana (SOL), which dropped 9.8% to $25.68, and Avalanche (AVAX), which shed 8.1% to $13.77.\n\nSeveral altcoins appreciated; notably, Toncoin (TON) grew 8.3% to $1.46, Stellar (XLM) blew up 23% to $0.163126, and Chainlink (LINK) rallied 15% to $7.98.\n\nChainlink began its rally on Monday with the launch of its Cross-Chain Interoperability Protocol (CCIP) on its mainnet. The protocol currently supports Avalanche, Ethereum, Optimism and Polygon networks. It is also integrated with DeFi lending protocols Aave and Synthetix. Chainlink says it is as an onramp for TradFi institutions to get into tokenized digital assets.\n\nThe week’s news\n\nOn Monday, G20 watchdog the Financial Stability Board issued nine top-level recommendations for regulators on overseeing crypto companies and markets. It also issued revised recommendations on the oversight of stablecoins.\n\nThe recommendations are designed to prevent crypto crashes on the scale of FTX and Terra incorporate feedback from the FSB’s public consultation on the topic, including calls for cross-border cooperation between regulators, governance requirements for crypto issuers, and mandatory disclosures for the industry.\n\nThe following day, the U.S. Securities and Exchange Commission accepted Valkyrie’s Bitcoin Spot ETF proposal for official review. This is the second spot ETF application that has moved to the next round, following asset manager titan BlackRock’s on July 13.\n\nExchange operator Nasdaq on Wednesday said it was delaying plans to launch a digital assets custodian service. Nasdaq CEO Adena Friedman said, “Considering the shifting business and regulatory environment in the U.S., we’ve made the decision to halt our launch of the U.S. digital assets custodian business and our related efforts to pursue a relevant license.”\n\nStory continues\n\nShe added the company would “remain committed to supporting the evolution of the digital asset ecosystem.”\n\nThat day, a bipartisan group of Senators introduced a bill that would require decentralized finance (DeFi) services to abide by the same compliance rules as financial firms like banks and centralized crypto exchanges, in a bid to reign in “criminals, drug traffickers, and hostile state actors such as North Korea.”\n\nOn Thursday, the UK Treasury rejected a House of Commons Treasury Committee recommendation to classify crypto trading as gambling, stating that it \"firmly disagrees\" with it.\n\nFinally, on Friday, Republican lawmakers in Washington introduced a 212-page bill entitled the Financial Innovation and Technology for the 21st Century Act. The bill aims to bring clarity and a “much-needed regulatory framework.”\n\nThe act includes a pathway for blockchains to be certified as decentralized. The SEC would have an opportunity to push back against assertions made by token issuers that their projects meet the standard outlined in the act. It also seeks to establish a disclosure regime for the transparency and compliance of digital asset issuers."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vZmluYm9sZC5jb20vd2Vla2VuZC10ZWNobmljYWwtYW5hbHlzaXMtZm9yLWJpdGNvaW4taW5jb21pbmctdm9sYXRpbGl0eS1hbmQtcG90ZW50aWFsLXB1bXAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "Weekend technical analysis for Bitcoin: Incoming volatility and potential pump - Finbold - Finance in Bold",
        "content": "Bitcoin (BTC) has once again fallen into familiar territories, trading below the $30,000 mark, with investors closely monitoring its subsequent price trajectory. In the coming weeks, the asset’s valuation could be significantly influenced by upcoming macroeconomic news, such as the Federal Reserve interest rate decision.\n\nIn this line, according to prominent pseudonymous cryptocurrency analyst FieryTrading on TradingView, in a post on July 22, investors should expect increased Bitcoin volatility this weekend. However, he remains optimistic about the long-term bullish sentiment for the leading cryptocurrency.\n\nHe noted that despite Bitcoin’s failure to break through the $31,000 position, the long-term bullish trend remains intact.\n\nBitcoin price analysis chart. Source: TradingView\n\n“Every time that this indicator flashes green (= low volatility), the market will make a big move in the near future. The market switches between two periods: periods of contraction (now) and periods of expansion (volatility),” he said.\n\nHe added that the upcoming Federal Reserve interest rate decision indicates that the market might be awaiting potentially increased volatility, which has also affected traditional financial products.\n\nElsewhere, another analysis posted on July 22 by Tolberti suggested that Bitcoin’s recent price movement point to a possible bullish breakout. According to the analysts, Bitcoin is showing a bullish pennant pattern on the daily chart after a month of consolidation.\n\nHe predicted a potential breakout to around $34,000 based on the 0.618 Fibonacci extension. A pullback may follow, but an uptrend to $39,000 is expected later.\n\nAt the same time, he pointed out that traders should be cautious, as a breakdown could lead to a drop to $21,000, and taking advantage of a possible breakdown with short positions is being considered.\n\nBitcoin price analysis chart. Source: TradingView\n\nFurthermore, he suggested that the bullish stand on Bitcoin emanated from the fact that several altcoins are showing signs of a possible breakout in the coming days.\n\nBitcoin’s recent underperformance\n\nIt is worth noting that Bitcoin’s recent underperformance is concerning for some market participants, especially given the presence of significant catalysts. The cryptocurrency market was initially boosted by the news of financial giants like BlackRock (NYSE: BLK) filing for spot Bitcoin exchange-traded funds (ETFs), which briefly lifted Bitcoin above $30,000 in June.\n\nAdditionally, the pro-crypto ruling in the Ripple case saw Bitcoin reach its highest value of the year. However, despite these positive developments, Bitcoin has struggled to maintain its high prices.\n\nOne of the contributing factors to this struggle is the ongoing regulatory uncertainties surrounding cryptocurrencies, which continue to exert downward pressure on prices. In general, the crypto market has been relatively quiet, indicating a lack of positive momentum.\n\nWhile long-term holders of Bitcoin may remain confident in the cryptocurrency, their influence alone is not enough to sustain high prices.\n\nBitcoin price analysis\n\nCurrently, Bitcoin is striving to maintain its position above the $29,000 level, avoiding a free fall. As of press time, the asset was trading at $29,897, experiencing a decline of over 1% in the past seven days.\n\nBitcoin seven-day price chart. Source: Finbold\n\nAccording to technical analysis, the one-day gauges retrieved from TradingView indicate neutrality. A summary of the gauges recommends a ‘neutral’ sentiment score of 9, while the moving averages indicate a ‘sell’ rating of 6. On the other hand, oscillators also align with the ‘neutral’ sentiment, registering a score of 8.\n\nBitcoin technical analysis. Source: TradingView\n\nOverall, Bitcoin’s current underlying possible trigger is the upcoming Fed policy.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2J1c2luZXNzL2Jsb2NrY2hhaW4taG93LXRoZS1uZXh0LWJpdGNvaW4taGFsdmluZy1taWdodC1hZmZlY3QtdGhlLXByaWNlLWFuZC1taW5lcnMtMzE4MjAzOC_SAYEBaHR0cHM6Ly93d3cuZmluYW5jaWFsZXhwcmVzcy5jb20vYnVzaW5lc3MvYmxvY2tjaGFpbi1ob3ctdGhlLW5leHQtYml0Y29pbi1oYWx2aW5nLW1pZ2h0LWFmZmVjdC10aGUtcHJpY2UtYW5kLW1pbmVycy0zMTgyMDM4L2xpdGUv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Jul 2023 07:00:00 GMT",
        "title": "How the next Bitcoin halving might affect the price and miners? - The Financial Express",
        "content": "By Edul Patel\n\nIn the past few years, Bitcoin has experienced several cycles of price fluctuations, capturing the attention of investors and enthusiasts. Amidst these market movements, a crucial event known as Bitcoin Halving has taken place three times. But what exactly is Bitcoin Halving and what role does it play in the Bitcoin ecosystem?\n\nWhat is Bitcoin Halving?\n\n\n\nBitcoin Halving is a special event that happens about every four years in the Bitcoin system. There will only ever be 21 million Bitcoins in total. Right now, around 19.5 million Bitcoins have been mined so far, of which 4 million has been irreversibly lost. 1.5 million BTC are yet to be mined. During the halving event, the rewards that Bitcoin miners get for their work are cut in half. This event has had an effect on the price of Bitcoin in the past. The next halving is scheduled to take place on 26th April 2024.\n\n\n\nHow does Bitcoin Halving Work?\n\n\n\nIn simple terms, Bitcoin validators are responsible for checking and approving Bitcoin transactions through a process called mining. When they successfully validate a block of transactions, they currently receive a reward of 6.25 BTC (Bitcoins), which is currently worth around $148,000. This acts as a good incentive for miners to continue validating and adding blocks of transactions to the Bitcoin blockchain.\n\n\n\nThese blocks of transactions are added approximately every 10 minutes, and the Bitcoin system has a rule that reduces the mining reward by half after every 210,000 blocks are created. This reduction happens roughly every four years and is often accompanied by increased price changes and unpredictability in the value of Bitcoin.\n\n\n\nAfter the fourth halving event, which is scheduled to happen next year, the mining rewards will decrease to 3.125 BTC per block.\n\n\n\nHistory of Bitcoin Halving and Price\n\n\n\nLooking back at the past, we can see that during previous halving events, the price of Bitcoin increases in anticipation and then after the event it stabilizes. In 2012, the price was $9 on October 26th and rose to $12.35 on the day of the halving on 28th Nov 2012.\n\nSimilarly, in 2016 the price of Bitcoin was $568 on June 28th and on the date of halving on July 9th, the price was $650.53. In 2020, on April 11th the bitcoin price was about $5884 and on the date of halving on 2020 11th May, the price was $8553. These historical patterns show that Bitcoin Halving has often led to a substantial increase in price before and in the following months. This demonstrates the potential impact that the halving event can have on the value of Bitcoin.\n\n\n\nWhy is Bitcoin Halving Important?\n\n\n\nThe reason for reducing the mining reward through Bitcoin Halving is to manage the creation of new Bitcoins and maintain their limited availability in the long run. By lowering the reward, Bitcoin Halving helps control inflation and ensures that the production of new Bitcoins happens at a slower pace. This event has important effects on the supply and potential value of Bitcoin, as well as on the miners who play a vital role in securing the network using their computers. Understanding Bitcoin Halving is crucial for grasping how the Bitcoin market works and the factors that impact its value over time.\n\nHow can Bitcoin Halving Impact the Miners?\n\nThe upcoming Bitcoin halving event will reduce the mining rewards from 6.25 BTC to 3.125 BTC per block next year. This reduction in rewards may make mining less profitable for miners. Consequently, unless there is a significant increase in the price of Bitcoin, miners are likely to pause their investments in new mining hardware for the next few months. In some cases, miners may even shut down less efficient mining hardware because it fails to generate sufficient bitcoins to cover operational expenses.\n\n\n\nIn the short term, the decrease in mining resources is expected to result in a slower rate of Bitcoin creation. However, the Bitcoin network has an automatic mechanism to maintain a relatively constant rate of new bitcoin production. Every two weeks, the network adjusts the difficulty of the mining problem to ensure an average rate of approximately six blocks per hour. If blocks are being produced too slowly, the network lowers the difficulty level to widen the range of winning hash values. Conversely, if blocks are being created too quickly, the network increases the difficulty to make the mining problem more challenging and slow down block creation.\n\n\n\nMiners strive to make profits, and competition among miners helps maintain relatively stable profit margins over time. Therefore, if revenues from Bitcoin mining decrease by half, miners will likely spend approximately half the amount to produce those bitcoins. Since electricity is a major cost in Bitcoin mining, the reduction in block rewards should ultimately lead to a similar reduction in the electricity consumed by mining.\n\n\n\nFurthermore, the halving event indirectly affects mining difficulty. As block rewards decrease, miners may find mining less profitable and decide to stop or reduce their mining activities. This reduction in overall computing power dedicated to mining prompts the network to adjust the difficulty level downwards. The aim is to make it easier to find the solution and maintain the desired rate of block creation.\n\nConclusion\n\n\n\nIndeed, it’s important to note that the impact of the halving event on mining profitability can be offset by higher prices of Bitcoin. When the price of Bitcoin increases, the revenues earned from each block also rise. This, in turn, increases the amount of money miners are willing to invest in mining hardware and the electricity they consume during the process. Therefore, if the price of Bitcoin rises significantly, miners are incentivized to purchase more mining equipment and expand their operations, leading to an increase in electricity usage.\n\nThe author is co-founder and CEO, Mudrex\n\nFollow us on Twitter, Facebook, LinkedIn\n\n\n\n\n\n"
    }
]