[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTE4L2JpdGNvaW4tb3JkaW5hbHMtYmFzZWQtbmZ0cy1jbG9nLWJsb2NrY2hhaW5zLWFzLXNwZWN1bGF0aXZlLWZlcnZvci1zcHJlYWRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Ordinals-Based NFTs Clog Blockchains as Speculative Fervor Spreads - Bloomberg",
        "content": "Inscriptions are a type of nonfungible tokens that first took off earlier this year on the Bitcoin network. Now they are now popping up on more than a dozen other smaller blockchains, pushing up transaction fees and in some cases, bogging down networks.\n\nThe stampede to mint the hybrid tokens is the latest speculative frenzy for seemingly all things crypto this year, from Bitcoin’s remarkable comeback to the eyepopping returns being realized on the most recent dog-themed memecoin on the Solana network."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvcmVhbC1lc3RhdGUtaW52ZXN0b3JzLWFyZS1mbG9ja2luZy10by1iaXRjb2luLWluLXJlY29yZC1udW1iZXJzLXNheXMtc3dpc3MtZXhjaGFuZ2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Real Estate Investors Are Flocking To Bitcoin in Record Numbers, Says Swiss Exchange - Nasdaq",
        "content": "Relai, a Swiss Bitcoin exchange, has disclosed with Bitcoin Magazine that a staggering 75% of its Over-The-Counter (OTC) revenue in the final quarter of 2023 stemmed from private clients diverting proceeds from real estate sales into Bitcoin, showcasing a seismic shift in investment strategies among investors.\n\nThe surge is a response to the real estate market's upheaval, compelling investors to pivot their portfolios toward the better opportunities presented by Bitcoin. Leon Wankum, a Bitcoin expert specializing in real estate, explained, \"Bitcoin, as an emerging asset class, potentially offers much higher growth potential for many investors, while the real estate market is in crisis and demand has died down.\"\n\nThe trend isn't confined to real estate alone, says Relai. Bitcoin is rapidly siphoning capital from traditional assets like securities and bonds, with experts forecasting a similar migration once Bitcoin spot Exchange-Traded Funds (ETFs) gain regulatory approval by the Securities and Exchange Commission in the United States.\n\nRelai's year-over-year OTC volume spike of over 100% underscores this transition. Notably, high-net-worth individuals and companies are driving this surge, with monthly volumes through Relai Private and Relai Business rising 30% during Q3 2023.\n\n\"If this trend continues, we can expect to see a substantial increase in Bitcoin's market capitalization and price in the coming months and years,\" said Relai CEO and co-founder, Julian Liniger. \"Relai is committed to providing investors with the tools and resources they need to navigate this evolving market. We are seeing a growing demand for our services, and we are investing in our platform to meet this demand.\"\n\nThe shift from real estate to Bitcoin is particularly pronounced in Switzerland, where awareness of Bitcoin's distinctive properties is steadily rising. Leon A. Wankum, also the Head of Bitcoin Strategies at oneVest Developments, explained how easy it can be for investors can convert their real estate capital into Bitcoin, stating, \"The process is a lot easier and faster than most people realise, with a service like Relai, such a transaction can take as little as one day.\"\n\nThe migration of investment capital from real estate to Bitcoin represents a potentially monumental shift in financial paradigms. As this trend gains momentum, the Bitcoin industry readies itself in anticipation for wealth from traditional asset classes to move into Bitcoin.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmcy1kaXNjdXNzZWQtbWVldGluZy0yMTAwMTEwNjYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Spot Bitcoin ETFs Discussed In Meeting Between BlackRock And SEC - Yahoo Finance",
        "content": "The Securities and Exchange Commission (SEC) met with BlackRock Inc. on Monday to discuss the proposed rule to allow a spot Bitcoin exchange-traded fund (ETF). The SEC's trading and markets division also met with Grayscale Investments, the leading crypto asset manager, regarding its application.\n\nThe SEC released a memo indicating that they met with BlackRock and Nasdaq Stock Market employees. \"The discussion concerned the NASDAQ Stock Market LLC's proposed rule change to list and trade shares of the iShares Bitcoin Trust under NASDAQ Rule 5711(d),\" the memo states.\n\nBlackRock also included a short presentation outlining two separate models for the ETF. The presentation describes how both an in-kind and in-cash redemption model could work to support the ETF. These smaller details may not impact retail investors, but they are still important to iron out before a final decision is made.\n\nDon't Miss:\n\nThe only currently available Bitcoin ETFs use futures contracts to closely track the price of Bitcoin. While this can provide general exposure, there can be price discrepancies and the management fees are high. A spot Bitcoin ETF would likely be a better alternative and attract investors.\n\nIt is unclear whether the SEC responded positively to the presentations and meetings. There is still plenty of time before a final determination must be made, and the SEC will likely take a while to sort through the details of each application before making a final decision. Many experts anticipate a final decision will be made by early 2024. Specifically, JPMorgan is eyeing Jan. 10 as this is the final day for a decision on several applications.\n\nBloomberg Intelligence ETF analyst James Seyffart wrote in a post on X that several other firms have reportedly met with the SEC in the past week. A dozen or so firms have submitted applications for a spot Bitcoin ETF, such as BlackRock, Grayscale, Fidelity Investments, WisdomTree Inc., Ark Invest and 21Shares. Most of the applications were filed in June, with several amendments submitted in the past few months.\n\nStory continues\n\nSome experts believe that the SEC will allow several ETFs to go live simultaneously once approved because most of the applications are similar, with differences in minor details.\n\nInvestors are patiently awaiting the release of the spot Bitcoin ETFs. When BlackRock submitted its application in June, the price of Bitcoin rose over $5,000 within a week. This hype has carried on throughout the rest of 2023, as Bitcoin recently hit a 52-week high of nearly $40,000 last week, according to CoinMarketCap.\n\nIf you are looking to purchase Bitcoin before the potential release of spot Bitcoin ETFs, Kraken is a great option. It is secure, easy to use, has low transaction fees and 24/7 customer service. It also offers staking, advanced and futures trading, non-fungible tokens (NFTs) and margin.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nThis article Spot Bitcoin ETFs Discussed In Meeting Between BlackRock And SEC originally appeared on Benzinga.com\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmcy1kaXNjdXNzZWQtbWVldGluZy0yMTAwMTEwNjYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Spot Bitcoin ETFs Discussed In Meeting Between BlackRock And SEC - Yahoo Finance",
        "content": "The Securities and Exchange Commission (SEC) met with BlackRock Inc. on Monday to discuss the proposed rule to allow a spot Bitcoin exchange-traded fund (ETF). The SEC's trading and markets division also met with Grayscale Investments, the leading crypto asset manager, regarding its application.\n\nThe SEC released a memo indicating that they met with BlackRock and Nasdaq Stock Market employees. \"The discussion concerned the NASDAQ Stock Market LLC's proposed rule change to list and trade shares of the iShares Bitcoin Trust under NASDAQ Rule 5711(d),\" the memo states.\n\nBlackRock also included a short presentation outlining two separate models for the ETF. The presentation describes how both an in-kind and in-cash redemption model could work to support the ETF. These smaller details may not impact retail investors, but they are still important to iron out before a final decision is made.\n\nDon't Miss:\n\nThe only currently available Bitcoin ETFs use futures contracts to closely track the price of Bitcoin. While this can provide general exposure, there can be price discrepancies and the management fees are high. A spot Bitcoin ETF would likely be a better alternative and attract investors.\n\nIt is unclear whether the SEC responded positively to the presentations and meetings. There is still plenty of time before a final determination must be made, and the SEC will likely take a while to sort through the details of each application before making a final decision. Many experts anticipate a final decision will be made by early 2024. Specifically, JPMorgan is eyeing Jan. 10 as this is the final day for a decision on several applications.\n\nBloomberg Intelligence ETF analyst James Seyffart wrote in a post on X that several other firms have reportedly met with the SEC in the past week. A dozen or so firms have submitted applications for a spot Bitcoin ETF, such as BlackRock, Grayscale, Fidelity Investments, WisdomTree Inc., Ark Invest and 21Shares. Most of the applications were filed in June, with several amendments submitted in the past few months.\n\nStory continues\n\nSome experts believe that the SEC will allow several ETFs to go live simultaneously once approved because most of the applications are similar, with differences in minor details.\n\nInvestors are patiently awaiting the release of the spot Bitcoin ETFs. When BlackRock submitted its application in June, the price of Bitcoin rose over $5,000 within a week. This hype has carried on throughout the rest of 2023, as Bitcoin recently hit a 52-week high of nearly $40,000 last week, according to CoinMarketCap.\n\nIf you are looking to purchase Bitcoin before the potential release of spot Bitcoin ETFs, Kraken is a great option. It is secure, easy to use, has low transaction fees and 24/7 customer service. It also offers staking, advanced and futures trading, non-fungible tokens (NFTs) and margin.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nThis article Spot Bitcoin ETFs Discussed In Meeting Between BlackRock And SEC originally appeared on Benzinga.com\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvaG93LWJpdGNvaW4tZXRmcy1hcmUtcGF2aW5nLXRoZS13YXktZm9yLWluc3RpdHV0aW9uYWwtYWNjZXB0YW5jZS1vZi1jcnlwdG8tb24td2FsbC1zdHJlZXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "How Bitcoin ETFs Are Paving the Way for Institutional Acceptance of Crypto on Wall Street - Nasdaq",
        "content": "With the world's first Bitcoin ETFs set to win SEC approval, could we be looking at one of the biggest breakthroughs in recent years on the path to institutional acceptance of crypto?\n\nFirms like BlackRock, Fidelity, and Valkyrie have all filed requests to launch their own Bitcoin spot exchange-traded funds on Wall Street. Subject to approval from the US Securities and Exchange Commission, the ETFs could pave the way for institutional investors to enter the world of cryptocurrency by taking up a more traditional position, rather than directly owning a currency.\n\nWith SEC approval seemingly just a matter of time, the arrival of a Bitcoin ETF will represent a major hurdle in removing some of the lingering barriers to adoption between institutions and cryptocurrency.\n\nBitcoin ETFs Driving Change for Institutions\n\nWhat changes with the arrival of a Bitcoin ETF? Fundamentally, a cryptocurrency ETF would still have the same functionality as more traditional ETFs. This means that it would be regulated by the SEC and subject to strict reporting protocols.\n\nCrucially, this would bring greater levels of transparency and oversight that institutions may feel are lacking throughout the crypto landscape at present.\n\nIn addition to this, the introduction of a Bitcoin ETF would herald a new era of institutional custody solutions which can help to limit the risk of theft or loss of Bitcoin at a time when concerns surrounding counterparty risk are still fresh in the minds of institutions following the high profile collapse of FTX in 2022.\n\nThe Starter Klaxon for Institutional Adoption?\n\nSEC approval for the world’s first Bitcoin ETFs could be looked back upon as the starter klaxon for more institutional adoption of cryptocurrency, helping to see more inflows into the market in a structured manner.\n\nThe reason that a Bitcoin ETF represents a major step for institutions is because it represents a secure and regulated entry point for investors.\n\nWithout the necessity of dedicated cryptocurrency wallets or crypto exchanges to take their first steps in the ecosystem, the streamlined investment process can attract investors of all levels without the fear of the unknown clouding their judgment.\n\nThe arrival of a spot Bitcoin ETF could also open the door to brand new investment opportunities, such as short-selling which can help institutions to trade cryptocurrency news faster.\n\nAbove all else, the arrival of Bitcoin ETFs provides a gateway for institutional investors to enter the world of crypto and build their confidence before taking their next steps in immersing themselves further.\n\nAccording to data from PwC’s Rebuilding confidence in crypto: 5th Annual Global Crypto Hedge Fund Report (2023), some 46% of hedge funds currently investing in crypto assets intend to add more capital into their holdings by the end of the year, while 37% state that they’re waiting for further market maturity before investing further.\n\nOvercoming Counterparty Risk\n\nThe acceptance of a Bitcoin ETF will be a major stepping stone for a cryptocurrency landscape that’s been contending with counterparty risk for many years.\n\nRegulators continually express concerns about crypto’s vulnerability to market manipulation, a lack of protection for investors, and even the prospect of fraud.\n\nBut the approval of a Bitcoin ETF will help to signify a maturing market that’s been strengthened through better regulated exchanges, more widespread transparency, and more technological innovations geared towards aiding the growth of institutional confidence.\n\nBecause Bitcoin ETFs don’t involve direct ownership of cryptocurrencies, they can be an excellent resource for managing counterparty risk, which occurs when a counterparty default on its obligation causes an institution to lose client funds.\n\nHowever, its arrival coincides with maturing technology that’s geared towards aiding institutions in better managing their counterparty risk when choosing to take their next steps in cryptocurrency trading.\n\nOffering a single point of access to manage trading, position monitoring, and risk management, Skarb’s unique trading terminal leverages client access to a vast range of liquidity venues.\n\nThis means that institutions that are seeking to immerse themselves into the wider world of cryptocurrency trading can tap into an array of exchanges and liquidity pools to execute and monitor trades within a single intuitive user interface.\n\nSkarb’s terminal offers optionality throughout liquidity venues for investors and traders to use asset safeguards like custodial services, which can keep assets securely away from exchanges until it’s time to make a transaction.\n\nWhen it comes to the hunt for “optimal execution,” Skarb’s network of liquidity providers and proprietary tools, like the pre-trade analyzer, allow traders execute their trades with efficiency at the best available price. In addition, proprietary algorithmic trading can pave the way for setting up trades across multiple venues simultaneously, while investors are supported by real-time reporting and trade cost analysis (TCA) tools for a more holistic overview.\n\nSolving Lingering Liquidity Hurdles\n\nOne of the biggest barriers to institutional acceptance of crypto today focuses on a lack of liquidity across the market. Institutional investors generally utilize significantly high levels of liquidity to leverage trades without a more widespread impact on asset prices.\n\nHowever, with the total cryptocurrency market capitalization standing at around $1.6 trillion at the time of writing, crypto is less than one-hundredth the size of the global total stock market capitalization, which is around $112 trillion.\n\nThe introduction of Bitcoin ETFs can aid matters of liquidity and market stability as a whole within the world of crypto. Because these ETFs trade on established stock exchanges with more robust liquidity, they can leverage a more liquid market overall for Bitcoin and make it easier for institutional investors to enter or exit positions without major price ramifications.\n\nIn turn, these greater liquidity levels brought by institutional investors taking their first steps into the crypto landscape can help to create a more stable market, paving the way for more entrants and greater levels of direct investment into the ecosystem.\n\nBitcoin’s Bright Future\n\nSecuring SEC approval for Bitcoin ETFs will invariably aid institutional acceptance of cryptocurrencies as a whole. Aside from providing an excellent entry point for institutions and leveraging more regulatory approval, this increased level of activity will help to increase the value of Bitcoin and improve its functionality.\n\nWith this in mind, the starting klaxon for the age of Bitcoin ETFs will carry a major positive impact on the market, and may well be looked back on as a watershed moment for cryptocurrency acceptance on Wall Street.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]