[
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTI0L2JpdGNvaW4tZHJvcC1kZWVwZW5zLWFzLWJpbmFuY2UtaGFsdHMtc3BvdC10cmFkaW5nLWR1ZS10by1pc3N1ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC/USD) Latest Price Lingers While Binance Hit With Trading Halt - Bloomberg",
        "content": "Bitcoin traded around the $28,000 mark with concern about financial stability fueling bets that major central banks will need to stop increasing rates amid rising recession anxiety.\n\nThe largest cryptocurrency briefly spiked 3% lower earlier, when Binance halted all spot trading on its platform because of a technical glitch. The firm said trading on the exchange would resume around 10 a.m. New York time, after the more than 2-hour halt."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5jbmJjLmNvbS92aWRlby8yMDIzLzAzLzI0L2JpdGNvaW4taXMtYnVpbHQtZm9yLXRoaXMtbW9tZW50LWFzLWdsb2JhbC1iYW5raW5nLWNyZWRpYmlsaXR5LWZhbHRlcnMtcGxhY2Vob2xkZXJzLWNocmlzLWJ1cm5pc2tlLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin is built for this moment as global banking credibility falters: Placeholder's Chris Burniske - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin is built for this moment as global banking credibility falters: Placeholder's Chris Burniske\n\nChris Burniske, Placeholder partner and former head of ARK Invest’s crypto department, joins 'The Exchange' to discuss the broader attitude towards cryptocurrencies, where there could be more regulatory pressure in the crypto space and more."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvbmFzZGFxLWV5ZWluZy1xMi0yMDIzLXJlbGVhc2UtZm9yLWJpdGNvaW4tYW5kLWNyeXB0by1jdXN0b2R5LXBsYXRmb3Jt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Mar 2023 07:00:00 GMT",
        "title": "Nasdaq Eyeing Q2 2023 Release For Bitcoin And Crypto Custody Platform - Nasdaq",
        "content": "The exchange giant is joining Fidelity and BNY Mellon in the pursuit of their own cryptocurrency custody platform.\n\nNasdaq, an American stock exchange based in New York City, is reportedly looking at Q2 2023 for the release of its custody services for Bitcoin and other cryptocurrencies.\n\nIn an interview with Bloomberg, Senior Vice President and Head of Nasdaq Digital Assets Ira Auerbach said that Nasdaq “is pushing ahead to get all the necessary technical infrastructure and regulatory approvals in place.”\n\n\n\nThe report describes an infrastructure that might look similar to that of Fidelity Digital Assets, which quietly opened its operations to the public last week. The first step to bitcoin and cryptocurrency trading on Nasdaq would be the custody service for the assets.\n\n\n\nAccording to the Bloomberg report, “Nasdaq has applied to the New York Department of Financial Services for a limited-purpose trust company charter, which would oversee the new business.”\n\n\n\nLaunching just as several major cryptocurrency firms have collapsed, amidst increasing regulatory tension, the goal is seemingly to offer those customers who now have no platform, a regulated, well-trusted American service for bitcoin.\n\n\n\nIt should be noted that many of the issues surrounding exchanges come from the third-party risks presented by a custodian holding bitcoin for customers. The most secure way to interact with bitcoin is to self-custody it with your own wallet. Although trading platforms do offer the ease of interaction created by custodianship, with the American financial system seeing precarious headlines as of late, it is important to consider these trade offs compared with traditional bitcoin self-custody.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi13YXMtYnVpbHQtZm9yLXRoZS1iYW5raW5nLWNyaXNpc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Was Built For The Banking Crisis - Nasdaq",
        "content": "By Landon Manning\n\nIn the wake of the largest international bank collapses since the 2008 financial crisis, it’s becoming increasingly clear that Bitcoin’s trustless and decentralized nature was created as an antidote to the increasingly unstable banking system, and that these same principles will prove to be an antidote today.\n\nThe first quarter of 2023 has seen a contagious spread of bank collapses, similar to the cascading failures of crypto businesses after FTX’s failure in 2022. Silicon Valley Bank (SVB), an essential component of the burgeoning U.S. tech industry, blossomed to manage billions of dollars as it provided essential liquidity for a variety of tech startups. However, since the COVID-19 pandemic, much of the free-flowing investment capital and low interest rates of the 2010s vanished entirely. Anxiety over a downturn in the tech industry mixed with social media panic to create a bank run that brought the place to its knees, and it wasn’t alone. Signature Bank, in New York City, shuttered two days later and days later the Swiss bank Credit Suisse suffered a similar fate.\n\nThese rapid events have been accompanied by a dramatic rise in the valuation of bitcoin, with BTC rising from around $20,000 to $28,000 in a matter of days following the banking crisis. Although Bitcoin has been on a slow and steady recovery since the fallout of the FTX debacle, this represents the strongest jump bitcoin has seen since then. What’s even more impressive is the remarkable way that this boom for bitcoin has come amid a general downturn for the rest of the crypto industry, marked by Circle’s USD Coin (USDC) losing its peg with the dollar and the U.S. Securities And Exchange Commission (SEC) suggesting many crypto assets could come under more regulatory scrutiny.\n\nThen, the fall of Credit Suisse brought a new dynamic to these bank failures, transforming it into a global concern. The global financial industry spent a decade growing cozy around an infrastructure of easy capital and nonexistent interest rates, and both of those things have now apparently been destroyed. Even if the largest banks have yet to fail, the same economic conditions of failure are everywhere. Many of the most painful lessons of the 2008 collapse have slowly been forgotten, but Bitcoin remembers. As the global economic system moves towards deeper and deeper anxiety, it’s important to remember why so many people bet on bitcoin.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy93ZWVrbHktbWFya2V0LXdyYXAtYml0Y29pbi1ob3ZlcnMtMTQzODI5MTM4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 24 Mar 2023 07:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin hovers around US$28,000 as banking concerns return. Will it hit US$30,000? - Yahoo Finance",
        "content": "Bitcoin, the world’s largest cryptocurrency by market capitalization, rose 4.82% in the week from March 17 to March 24 to trade at US$27,926 at 9:30 p.m. on Friday in Hong Kong. Ether rose 1.65% in the same period to US$1,772.\n\nv ybYOP1XvhlOvdevPwEHXCsFT7Y1ehXiekUBczy4lVTmqUF0DP5LWQ\n\n“Surging activity on the Bitcoin network is causing profitability to recover to levels consistent with the start of previous bullish cycles. The network is still expensive relative to transaction values but less so than at the start of February,” wrote Jamie Douglas Coutts, senior market structure analyst at Bloomberg Intelligence, in a research note shared with Forkast.\n\nMaxwell Goldstein, the co-founder of Freeport, an on-chain fine art investment platform, said that this week’s price action was mainly driven by the U.S. Federal Reserve’s monetary policy decision.\n\nThe Federal Reserve raised its key interest rate by an expected 25 basis points on Wednesday. Bitcoin slid 1.94% to US$27,676 the day after the rate hike, also pressured by market concern of a banking crisis after U.S. Treasury Secretary Janet Yellen said the government is not considering a “blanket insurance” on bank deposits.\n\n“Traders are flocking to Bitcoin and similar assets to diversify their holdings. Recent bank failures have also strengthened the case for investing in Bitcoin, along with murmurs of hyperinflation,” wrote Goldstein, adding that due to looming fears of inflation, “investors are absolutely seeking a safe haven asset and Bitcoin fits the bill.”\n\nThe global crypto market capitalization stood at US$1.17 trillion on Friday at 9:30 p.m. in Hong Kong, up 2.6% from US$1.14 trillion a week ago, according to CoinMarketCap data. Bitcoin’s US$537 billion market cap accounted for 46.3% of the market, while Ether’s US$216 billion accounted for 18.6%.\n\nBanks vs Bitcoin\n\n“The past several months have seen efforts by officials to cut liquidity from the crypto ecosystem, underscoring why Bitcoin matters and how desperate central planners are to keep the fiat credit system from imploding,” wrote Coutts.\n\nStory continues\n\nCoutts was referring to recent black swan events like the liquidation of crypto-focused bank Silvergate, which provided lending services for large crypto companies like Coinbase and Crypto.com.\n\nTwo other crypto-friendly banks, Silicon Valley Bank and Signature Bank, also closed operations in the same week, resulting in market concern that crypto exchanges and companies could go unbanked.\n\nFormer congressman and Signature Bank board member Barney Frank told CNBC on March 13 that the bank’s closure meant that “regulators wanted to send a very strong anti-crypto message.”\n\nThe New York State Department of Financial Services (NYDFS) said the following day that Signature’s closure had nothing to do with crypto and that the decision was “based on the current status of the bank and its ability to do business in a safe and sound manner.”\n\nCoutts disagreed with the regulator, saying that Signature’s shutdown was a deliberate message for the crypto industry.\n\n“The bank [Signature Bank] was still meeting withdrawal requests, and [the bank’s] board member Barney Frank said regulators ‘wanted to send a message to get people away from crypto,'” wrote Coutts.\n\n“The statement by Frank marries with the data,” added Coutts. “Based on the last reported numbers, unrealized losses from held-to-maturity assets for Signature Bank were 27.4% of book value, below the average for the S&P 500 banks industry group at 36.6%.”\n\nKadan Stadelmann, chief technical officer of blockchain infrastructure development firm Komodo, said that Bitcoin has always performed well during tumultuous times.\n\n“It would have been reasonable to assume Bitcoin might behave similarly when three crypto-facing banks – Silvergate, Silicon Valley Bank, and Signature Bank – collapsed one after another,” he said. Instead of a sharp decline in price, Bitcoin slipped and began to rise. “If people can’t trust banks, Bitcoin would be a beneficiary.”\n\n“Investors are scrambling to find safe havens. Gold increased to US$2,000 per ounce. We’ve also seen the world choose Bitcoin as a safe haven,” added Stadelmann.\n\nJonas Betz, a Germany-based crypto analyst, said that Bitcoin was created to hedge against a failing banking system but warned that the closure of crypto banks may lead to a liquidity shortage.\n\n“The recent closure of operations by Silvergate and Signature has resulted in a significant reduction in liquidity in the crypto markets. These banks provided systems (SEN and Signet) that were important for facilitating the entry of fiat currency into the crypto market. With limited options available, the industry is likely to face a liquidity crunch until new banks step in. This leads to increased volatility in crypto prices,” wrote Betz.\n\nSee related article: Centralized intermediaries were cause of crypto failures in 2022, says Voorhees\n\nBiggest gainers: MASK & FLR\n\nMASK, the governance token of Mask Network, a mobile app and browser extension that aims to bridge Web 2.0 with Web 3.0, was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap. The MASK token rose 35.43% to US$6.13 and started picking up momentum on Thursday, after it was listed on CoinMarketCap.\n\nFLR, the utility token of interoperability-focused layer-1 blockchain Flare Network, was the week’s second-biggest gainer in the top 100, rising 15.42% to US$$0.03327. The token started gaining momentum on March 17, after Flare announced the first of 36 monthly airdrops for the community.\n\nSee related article: Bitcoin Fear & Greed index rises to 16-month high as investors seek safe-haven assets\n\nNext week: Bitcoin to US$30,000?\n\n“The 25% rise in Bitcoin’s price from last Friday’s lows has nearly eliminated losses of the previous 12 months for 72.41% of the network’s BTC-holding entities,” wrote Coutts.\n\nAt the start of 2022, some 75% of these entities were profitable. Today, with Bitcoin prices lower than a year ago, the average cost for a Bitcoin entity is lower than price. This has resulted in higher profitability,” wrote Coutts.\n\nSlava Demchuk, the co-founder of AMLBot, a developer of crypto anti-money laundering software, said that investors should monitor the impact of the Fed’s interest rate hike on banks and financial institutions.\n\n“If [banks] continue to struggle, the Fed may persist in reducing interest rates, which would facilitate even more capital into the economy. This scenario would also impact cryptocurrency prices, as they often reflect these changes faster than the other financial assets,” wrote Demchuk.\n\nFreeport’s Goldstein expects more Bitcoin volatility as the banking crisis unfolds.\n\n“Prices will likely not break through the US$30,000 mark unless another major threat to the U.S. banking system comes into play. If the Fed continues to hike interest rates, Bitcoin will face increased downward pressure,” wrote Goldstein.\n\nAlex Reinhardt, the founder of the financial education platform Reinhardt Academy, said that further banking issues could propel Bitcoin above US$30,000.\n\n“Reaching US$30,000 in the next week and US$35,000 in the next 2-3 weeks seems realistic. As we’ve seen in the past, strong growth waves in the crypto market can quickly turn into an avalanche-like movement, triggering both panic sales and panic buying,” wrote Reinhardt.\n\nMarat Minkin, the co-founder of DeFi payment app TONBanking, expects Bitcoin’s safe haven narrative to fuel its rally to above US$30,000.\n\n“Key price level remains at US$28,600-28,750. Bitcoin’s uptrend will continue next week, and the U-turn will be completed at US$32,000 by the end of the next week to close the month with a positive monthly gain,” he wrote.\n\nSee related article: Banks are bringing systemic risks to crypto, says Circle’s Disparte"
    }
]