[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMjIvYml0Y29pbi1jb3JlLWRldmVsb3Blci1tYXJjby1mYWxrZS1zdGVwcy1kb3duLWZyb20tbWFpbnRhaW5lci1yb2xlL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMjIvYml0Y29pbi1jb3JlLWRldmVsb3Blci1tYXJjby1mYWxrZS1zdGVwcy1kb3duLWZyb20tbWFpbnRhaW5lci1yb2xlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Core Developer Marco Falke Steps Down From Maintainer Role - CoinDesk",
        "content": "The storied developer reaffirmed his passion for Bitcoin and said he was “positive about the future,” but that his role was no longer a good fit."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWJhY2stYWJvdmUtdXMtMjQtMDIyMzUzMjg1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin back above US$24,000, Fed releases February minutes - Yahoo Finance",
        "content": "Bitcoin fell in a mixed morning of trading for the top 10 non-stablecoin cryptocurrencies by market capitalization on Thursday in Asia. XRP posted the biggest gains in the list while Solana led losses. The U.S. Federal Reserve released its February meeting minutes on Wednesday, hinting at further interest rate hikes.\n\nSee related article: Coinbase reports growth in Q4 earnings despite decline in users\n\nFast facts\n\nBitcoin fell 1.0% in the last 24 hours to trade at US$24,190 as of 8 a.m. in Hong Kong, after falling to as low as US$23,644 overnight. The world’s leading cryptocurrency was trading down 0.5% over the past week, according to CoinMarketCap. Ethereum fell 0.9% to US$1,643, dropping 1.8% over the past seven days.\n\nXRP rose 0.9% to US$0.39, though the token was still trading down 1.4% for the past seven days. FTX Japan, the Japanese arm of bankrupt cryptocurrency exchange FTX.com, reinstated XRP withdrawals overnight.\n\nSolana dropped 3.1% to trade at US$24.2, while rising 1.2% in the past seven days. Solana Spaces, a startup funded by Solana Foundation that promotes its namesake blockchain with its physical stores in New York and Miami, announced on Tuesday it will shut down its locations by the end of the month.\n\nToncoin, the 26th largest cryptocurrency by market capitalization, rose 5.5% to US$42.47, bringing its weekly gains to 5.6%. The Open Network, a blockchain powered by Toncoin, released a governance platform on Tuesday that allows Toncoin validators to vote on decisions in the network.\n\nThe total crypto market capitalization dropped 1.5% to US$1.08 trillion at 8 a.m. in Hong Kong. The total trading volume over the past 24 hours was down by 4.9% to US$63 billion.\n\nU.S. equities had a mixed day of trading on Wednesday. The Dow Jones Industrial Average fell 0.3% and the S&P 500 Index slipped 0.2% while the Nasdaq Composite Index rose 0.1%.\n\nInvestors reacted with trepidation to the release of the Fed’s meeting minutes on Wednesday, which showed that the central bank recognized that inflation was cooling in the economy, but said labor markets “remained very tight, contributing to continuing upward pressures on wages and prices.“\n\nThe minutes also revealed that there were some members of the Fed that were pushing for a 50 basis point rise in interest rates at the Fed’s previous meeting, when the central bank instead announced a 25 basis point rate hike to a targeted range of 4.5%-4.75%, the highest level since October 2007.\n\nAnalysts at the CME Group predict a roughly 75% chance that the Fed will raise rates by another 25 basis points next month.\n\nThe latest Consumer Price Index data showed inflation was up 6.4% in January from a year ago, down from 6.5% in December and 7.1% in November. The Fed has indicates it is trying to bring inflation down to a target range of 2%.\n\nSee related article: Hong Kong to invest US$6.37 million to spur Web3 growth"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvY29pbnMvYml0Y29pbi12cy1hbHRjb2lucy1jb21wYXJpbmctaW52ZXN0bWVudC1vcHBvcnR1bml0aWVzLWFuZC1yaXNrcy_SAXpodHRwczovL3d3dy5maW5hbmNlbWFnbmF0ZXMuY29tL2NyeXB0b2N1cnJlbmN5L2NvaW5zL2JpdGNvaW4tdnMtYWx0Y29pbnMtY29tcGFyaW5nLWludmVzdG1lbnQtb3Bwb3J0dW5pdGllcy1hbmQtcmlza3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin vs. Altcoins: Comparing Investment Opportunities and Risks - Finance Magnates",
        "content": "Cryptocurrencies have grown in popularity as an investment option in recent years. Although Bitcoin is the most well-known cryptocurrency, there are numerous other digital currencies known as 'altcoins' that provide a variety of investment opportunities and risks.\n\nWe will compare Bitcoin and altcoins in this article to help investors make informed decisions about their crypto investments.\n\nBitcoin Is the Original Cryptocurrency\n\nBitcoin was the first cryptocurrency, created in 2009 by an unknown individual or group of individuals known as Satoshi Nakamoto. Bitcoin is decentralized, which means that no government or financial institution controls it. Transactions are recorded on a public ledger known as the blockchain, which is maintained by a global network of computers.\n\nBitcoin Investment Possibilities\n\nFor years, Bitcoin has been the most popular and well-known cryptocurrency, making it a popular investment option. Bitcoin has steadily increased in value over the years, reaching an all-time high of nearly $65,000 in 2021.\n\nKeep Reading Social Media Reward Coins: A Catalyst for Widespread Crypto Adoption\n\nThe value of Bitcoin is primarily determined by demand, and it is widely accepted as a payment method by many merchants around the world.\n\nRisks\n\nBitcoin is a volatile asset, with rapid fluctuations in value. Aside from market volatility, there are risks associated with technology itself. Because Bitcoin transactions are irreversible, there is no way to recover your funds if you send Bitcoin to the wrong address or fall victim to a scam.\n\nFurthermore, due to the lack of regulation surrounding Bitcoin and other cryptocurrencies, investors have little protection in the event of fraud or hacking.\n\nAltcoins: A Wide Range of Options\n\nAlternative cryptocurrencies, or altcoins, are any digital currencies other than Bitcoin. There are thousands of altcoins, each with its own set of characteristics and applications. Ethereum, Binance Coin, Cardano, and Dogecoin are among the most popular altcoins.\n\nAltcoin Investment Possibilities\n\nAltcoins provide alternative investment opportunities to Bitcoin. Some altcoins are intended to be more efficient or functional than Bitcoin, whereas others are intended for specific applications, such as decentralized finance (DeFi) or non-fungible tokens (NFTs). Some altcoins, such as Ethereum, have seen significant growth in recent years and have the potential for future gains.\n\nRisks\n\nInvesting in altcoins entails the same risks as investing in Bitcoin, such as market volatility and technological risks. Furthermore, because altcoins are not as widely accepted as Bitcoin, there is less liquidity, making it more difficult to buy or sell altcoins at a reasonable price.\n\nFurthermore, because there are so many altcoins to choose from, determining which ones have long-term potential and which are scams or have no real value can be difficult.\n\nBitcoin and Altcoin Comparison\n\nThere are several factors to consider when comparing Bitcoin and altcoins:\n\nAdoption\n\nBitcoin is the most widely used cryptocurrency, with many merchants accepting it and many investors using it as a store of value. While some altcoins have gained popularity, none are as well-known as Bitcoin.\n\nVolatility\n\nAlthough Bitcoin is a volatile asset, some altcoins are even more so. It is critical to be prepared for rapid price fluctuations when investing in altcoins.\n\nCase Studies\n\nThe primary application of Bitcoin is as a store of value and a means of payment. Altcoins have a diverse set of use cases, ranging from DeFi to NFTs, so it is critical to research each altcoin's specific use case and potential.\n\nTechnology\n\nBitcoin is a well-established technology with a large and active developer community. Some altcoins have innovative technologies, but it is critical to investigate the technical details to determine whether they are viable and secure.\n\nShould I Buy Altcoins? Are Altcoins a Safe Investment or Pure Speculation?\n\nMany have wondered if altcoins are a safe investment. Over the past few years, altcoins have come and gone while BTC remains as the 'one true king of cryptocurrencies'.\n\nIn fact, there are many Bitcoin maximalists who believe BTC is the only investment one should have in the crypto universe as it will probably be the only digital currency which we’ll need in the future. However, even if they believe that they might be on the right side of things in the long term, for now, surprisingly, they might be missing the forest for the trees.\n\nThe simple fact is that altcoins can be seen in many different ways and through many different lenses.\n\nEach altcoin has its own underlying projects, its problem that is trying to solve within the cryptocurrency landscape, and so forth.\n\nAs such, one can think of an altcoin as a long-term investment and buy them as an investor who believes in its project, or, as many do, as a short-term speculative investment.\n\nRegardless of your reasons, there are certain elements that you do need to be concerned about.\n\nFirst and foremost, you should define how much of your investment portfolio is going to be allocated to altcoin investment.\n\nFollowing that, it is important to do your own due diligence and thoroughly understand what the project is, what it is trying to do, and who the team is behind accomplishing said goals.\n\nFollowing that reputation risk assessment, it is also important to follow through with a market access risk analysis, meaning that you will want to stay clear of obscure coins which aren’t sold on reputable exchanges.\n\nLastly, it is extremely important that you understand the technical risk behind your potential altcoin investment, namely its code and if it has been audited by a credible third party.\n\nSo, in short, yes, altcoins can present themselves as incredible investment opportunities if approached with care and proper due diligence.\n\nWrapping Up\n\nInvesting in cryptocurrencies, whether Bitcoin or altcoins, entails risks as well as rewards. Because of Bitcoin's dominance as the original cryptocurrency, it is a safer and more stable investment, whereas altcoins offer higher potential returns but at a higher risk.\n\nBefore investing, it is critical to understand the various investment opportunities and risks associated with each cryptocurrency.\n\nOne of the most significant benefits of cryptocurrencies is their decentralization, which means they are not controlled by the government or central banks. However, because they are not backed by tangible assets or government guarantees, they are a more speculative investment.\n\nWhen investing in cryptocurrencies, it's critical to understand the underlying technology and fundamentals that drive their value. It's also critical to stay current on market news and regulatory developments, as these can have a significant impact on cryptocurrency value.\n\nTo summarize, Bitcoin and altcoins provide distinct investment opportunities and risks, and investors should carefully consider their investment objectives and risk tolerance before investing in either.\n\nWhile Bitcoin is a safer and more stable investment, altcoins offer higher potential returns but at a higher risk. Investors can navigate the complex world of cryptocurrencies and potentially reap the benefits with careful research and a long-term investment strategy."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWRlcG90LWNvbXBsZXRlcy1zb2Z0d2FyZS1jb252ZXJzaW9uLTEzMzAwMDc4OC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Depot Completes Software Conversion to Bitaccess Across Full Bitcoin ATM Fleet - Yahoo Finance",
        "content": "GSR II Meteora Acquisition Corp. logo\n\nConversion Vertically Integrates Bitcoin Depot Hardware and Software, Significantly Reduces Operating Cost, Provides Flexibility for New Functionality\n\nBitcoin Depot Kiosk\n\nBitcoin Depot announced today that all of its roughly 7,000 kiosks have been converted to Bitaccess software, the premier software suite for Bitcoin ATM operations.\n\nATLANTA, Feb. 22, 2023 (GLOBE NEWSWIRE) -- Lux Vending, LLC dba Bitcoin Depot® (“Bitcoin Depot” or the “Company”), a U.S.-based Bitcoin ATM operator and leading fintech company, announced today that all of its roughly 7,000 kiosks have been converted to BitAccess Inc. (“Bitaccess”) software, the premier software suite for Bitcoin ATM operations.\n\nBitcoin Depot previously announced in late 2022 its acquisition of a majority equity interest in Bitaccess. The completion of the conversion vertically integrates Bitcoin Depot’s hardware and software, eliminating previous annual software licensing fees which accounted for over $3 million of operating costs during the twelve months ended September 30, 2022. The investment in Bitaccess has also created flexibility for Bitcoin Depot to develop new lines of business involving its kiosks while providing a seamless experience between its app and Bitcoin ATMs. Bitcoin Depot’s majority interest in Bitaccess has enabled Bitcoin Depot to build out its BDCheckout product and its other software and operational capabilities and has expanded its revenue streams into kiosk management software, which includes various compliance systems, transaction processing and cash management capabilities.\n\n“This is the one of the first software conversions of this scale in the industry and a major accomplishment for our company,” said Brandon Mintz, CEO and Founder of Bitcoin Depot. “Our vertical integration strengthens our market position and fortifies our value proposition to customers and investors. We’re thrilled to see the results of this endeavor streamline our operations, reduce costs, and ultimately benefit our customers.”\n\nBitcoin Depot’s VP of BTM Operations, Jason Sacco, and its Head of Product, Bill Knoll, led the project using in-house technical support and various third parties. Prior to joining Bitcoin Depot in 2020, Sacco and Knoll each gained over 15 years of relevant experience with a global cash ATM company, where they orchestrated a number of successful software and hardware conversions.\n\nStory continues\n\n“We streamlined the process to convert Bitcoin Depot’s Bitcoin ATMs to Bitaccess software during a testing phase, which allowed us to reduce the software conversion process in the field,” said Sacco. “By swapping out the existing hard drive with one preloaded with Bitaccess software we quickly completed the software conversion while avoiding certain technical issues that can happen in field conversion projects. We efficiently converted approximately the first 6,000 of Bitcoin Depot’s Bitcoin ATMs in 10 weeks.”\n\nBitaccess offers software support not only for Bitcoin Depot’s Bitcoin ATMs but can also be deployed in other operators’ Bitcoin ATMs. The feature rich software allows operators white label opportunities and the ability to reduce the number of other software-related vendors needed due to its expanded, built-in functionality relative to other products. Additionally, Bitaccess has historically charged a lower software licensing fee to Bitcoin ATM operators based on transaction volume, compared to other software providers, and offers volume discounts.\n\nThis conversion makes Bitcoin Depot one of the first companies in the industry to complete a full software conversion across more than a few hundred Bitcoin ATMs. Based on industry data only a handful of Bitcoin ATM companies are vertically integrated, meaning they own their own software and operate their own Bitcoin ATMs, but there are over 550 Bitcoin ATM operators worldwide as of February 20, 2023, according to Coinatmradar.com.1 There are currently close to 8,000 total Bitcoin ATMs using Bitaccess software, including those operated by Bitcoin Depot, which gives Bitaccess a market share of approximately 21% worldwide as of February 20, 2023, calculated based on data from Coinatmradar.com.2\n\nAbout Bitcoin Depot\n\nBitcoin Depot was founded in 2016 with the mission to connect those who prefer to use cash to the broader, digital financial system. Bitcoin Depot provides its users with simple, efficient and intuitive means of converting cash into Bitcoin, which users can deploy in the payments, spending and investing space. Users can convert cash to Bitcoin at Bitcoin Depot’s kiosks and at thousands of name-brand retail locations through BDCheckout. The company has the largest market share in North America with approximately 7,000 kiosk locations. Learn more at www.bitcoindepot.com.\n\nOn August 24, 2022, Bitcoin Depot and GSR II Meteora Acquisition Corp. (“GSRM”), a special purpose acquisition corporation, entered into a definitive agreement for a business combination that would result in Bitcoin Depot becoming a public company listed on the Nasdaq under the ticker symbol “BTM.”\n\nAbout GSR II Meteora Acquisition Corp.\n\nGSR II Meteora Acquisition Corp. (NASDAQ: GSRM) is blank check company formed for the purpose of effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization or similar business combination with one or more businesses. GSRM’s management team is led by co-CEOs Gus Garcia and Lewis Silberman, President Anantha Ramamurti and CFO Joseph Tonnos. The company was formed in partnership with Meteora Capital, an investment adviser specializing in SPAC-related investments. For additional information, please visit www.gsrmet.com.\n\nNot an Offer\n\nThis communication does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval.\n\nForward-Looking Statements\n\nThe information in this press release includes “forward-looking statements” within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words such as “estimate,” “plan,” “project,” “forecast,” “intend,” “will,” “expect,” “anticipate,” “believe,” “seek,” “target” or other similar expressions that predict or indicate future events or trends or that are not statements of historical matters, although not all forward-looking statements contain such identifying words. These forward-looking statements include, but are not limited to, statements regarding estimates and forecasts of financial and performance metrics and expectations and timing related to potential benefits, terms and timing of the proposed business combination. These statements are based on various assumptions, whether or not identified in this press release, and on the current expectations of Bitcoin Depot’s and GSRM’s management and are not predictions of actual performance. These forward-looking statements are provided for illustrative purposes only and are not intended to serve as, and must not be relied on by any investor as, a guarantee, an assurance, a prediction or a definitive statement of fact or probability. Actual events and circumstances are difficult or impossible to predict and will differ from assumptions. Many actual events and circumstances are beyond the control of Bitcoin Depot and GSRM. These forward-looking statements are subject to a number of risks and uncertainties, including changes in domestic and foreign business, market, financial, political and legal conditions; the inability of the parties to successfully or timely consummate the proposed business combination, including the risk that any required regulatory approvals are not obtained, are delayed or are subject to unanticipated conditions that could adversely affect the combined company or the expected benefits of the proposed business combination or that the approval of the shareholders of GSRM is not obtained; failure to realize the anticipated benefits of the proposed business combination; risks relating to the uncertainty of the projected financial information with respect to Bitcoin Depot; future global, regional or local economic and market conditions; the development, effects and enforcement of laws and regulations; Bitcoin Depot’s ability to manage future growth; Bitcoin Depot’s ability to develop new products and services, bring them to market in a timely manner and make enhancements to its platform; the effects of competition on Bitcoin Depot’s future business; the amount of redemption requests made by GSRM’s public shareholders; the ability of GSRM or the combined company to issue equity or equity-linked securities in connection with the proposed business combination or in the future; the outcome of any potential litigation, government and regulatory proceedings, investigations and inquiries; and those factors described or referenced in GSRM’s final initial public offering prospectus dated February 24, 2022, its most recent Quarterly Report on Form 10-Q for the quarter ended September 30, 2022 and the definitive proxy statement dated February 8, 2023, in each case, under the heading “Risk Factors,” and other documents of GSRM filed, or to be filed, from time to time with the SEC. If any of these risks materialize or GSRM’s and Bitcoin Depot’s assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. There may be additional risks that neither Bitcoin Depot nor GSRM presently know or that Bitcoin Depot and GSRM currently believe are immaterial that could also cause actual results to differ from those contained in the forward-looking statements. In addition, forward-looking statements reflect Bitcoin Depot’s and GSRM’s expectations, plans or forecasts of future events and views as of the date of this press release. Bitcoin Depot and GSRM anticipate that subsequent events and developments will cause Bitcoin Depot’s and GSRM’s assessments to change. However, while Bitcoin Depot and GSRM may elect to update these forward-looking statements at some point in the future, Bitcoin Depot and GSRM specifically disclaim any obligation to do so except as otherwise required by applicable law. These forward-looking statements should not be relied upon as representing Bitcoin Depot’s and GSRM’s assessments as of any date subsequent to the date of this press release. Accordingly, undue reliance should not be placed upon the forward-looking statements.\n\nAdditional Information About the Proposed Business Combination and Where to Find It\n\nThe proposed business combination will be submitted to shareholders of GSRM for their consideration. Copies of the definitive proxy statement (a filing of which has been made with the SEC) were mailed to all GSRM shareholders of record as of February 3, 2023, the record date established for voting on the proposed business combination, beginning on February 8, 2023. GSRM plans to file other documents with the SEC and mail other relevant documents to its shareholders of record as of the record date regarding the proposed business combination. GSRM’s shareholders and other interested persons are advised to read the definitive proxy statement and any amendments or supplements thereto, as well as all other relevant materials filed or that will be filed with the SEC, in connection with GSRM’s solicitation of proxies for its special meeting of shareholders to approve, among other things, the proposed business combination, because these documents will contain important information about GSRM, Bitcoin Depot and the proposed business combination. Shareholders may also obtain a copy of the definitive proxy statement, as well as other documents filed with the SEC regarding the proposed business combination and other documents filed with the SEC by GSRM, without charge, at the SEC’s website located at www.sec.gov or by directing a request to Cody Slach or Alex Kovtun, (949) 574-3860, GSRM@gatewayir.com.\n\nParticipants in the Solicitation\n\nGSRM, Bitcoin Depot and certain of their respective directors, executive officers and other members of management and employees may, under SEC rules, be deemed to be participants in the solicitations of proxies from GSRM’s shareholders in connection with the proposed business combination. Information regarding the persons who may, under SEC rules, be deemed participants in the solicitation GSRM’s shareholders in connection with the proposed business combination is set forth in the definitive proxy statement that has been filed with the SEC. You can find more information about GSRM’s directors and executive officers in GSRM’s final initial public offering prospectus dated February 24, 2022 and filed with the SEC on February 28, 2022. Additional information regarding the participants in the proxy solicitation and a description of their direct and indirect interests are included in the definitive proxy statement and other relevant materials filed with the SEC. Shareholders, potential investors and other interested persons should read the definitive proxy statement carefully before making any voting or investment decisions. You may obtain free copies of these documents from the sources indicated above.\n\nContacts:\n\nInvestors\n\nCody Slach, Alex Kovtun\n\nGateway Group\n\n949-574-3860\n\nGSRM@gatewayir.com\n\nMedia\n\nZach Kadletz, Brenlyn Motlagh, Ryan Deloney\n\nGateway Group\n\n949-574-3860\n\nGSRM@gatewayir.com\n\n1 https://coinatmradar.com/charts/top-operators/\n\n2 https://coinatmradar.com/charts/cryptocurrency-share/\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/f7d7cc19-c701-449e-95f4-ac209c741b72\n\n\n\n\n\n\n\n"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWRlcG90LWNvbXBsZXRlcy1zb2Z0d2FyZS1jb252ZXJzaW9uLTEzMzAwMDc4OC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 22 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Depot Completes Software Conversion to Bitaccess Across Full Bitcoin ATM Fleet - Yahoo Finance",
        "content": "GSR II Meteora Acquisition Corp. logo\n\nConversion Vertically Integrates Bitcoin Depot Hardware and Software, Significantly Reduces Operating Cost, Provides Flexibility for New Functionality\n\nBitcoin Depot Kiosk\n\nBitcoin Depot announced today that all of its roughly 7,000 kiosks have been converted to Bitaccess software, the premier software suite for Bitcoin ATM operations.\n\nATLANTA, Feb. 22, 2023 (GLOBE NEWSWIRE) -- Lux Vending, LLC dba Bitcoin Depot® (“Bitcoin Depot” or the “Company”), a U.S.-based Bitcoin ATM operator and leading fintech company, announced today that all of its roughly 7,000 kiosks have been converted to BitAccess Inc. (“Bitaccess”) software, the premier software suite for Bitcoin ATM operations.\n\nBitcoin Depot previously announced in late 2022 its acquisition of a majority equity interest in Bitaccess. The completion of the conversion vertically integrates Bitcoin Depot’s hardware and software, eliminating previous annual software licensing fees which accounted for over $3 million of operating costs during the twelve months ended September 30, 2022. The investment in Bitaccess has also created flexibility for Bitcoin Depot to develop new lines of business involving its kiosks while providing a seamless experience between its app and Bitcoin ATMs. Bitcoin Depot’s majority interest in Bitaccess has enabled Bitcoin Depot to build out its BDCheckout product and its other software and operational capabilities and has expanded its revenue streams into kiosk management software, which includes various compliance systems, transaction processing and cash management capabilities.\n\n“This is the one of the first software conversions of this scale in the industry and a major accomplishment for our company,” said Brandon Mintz, CEO and Founder of Bitcoin Depot. “Our vertical integration strengthens our market position and fortifies our value proposition to customers and investors. We’re thrilled to see the results of this endeavor streamline our operations, reduce costs, and ultimately benefit our customers.”\n\nBitcoin Depot’s VP of BTM Operations, Jason Sacco, and its Head of Product, Bill Knoll, led the project using in-house technical support and various third parties. Prior to joining Bitcoin Depot in 2020, Sacco and Knoll each gained over 15 years of relevant experience with a global cash ATM company, where they orchestrated a number of successful software and hardware conversions.\n\nStory continues\n\n“We streamlined the process to convert Bitcoin Depot’s Bitcoin ATMs to Bitaccess software during a testing phase, which allowed us to reduce the software conversion process in the field,” said Sacco. “By swapping out the existing hard drive with one preloaded with Bitaccess software we quickly completed the software conversion while avoiding certain technical issues that can happen in field conversion projects. We efficiently converted approximately the first 6,000 of Bitcoin Depot’s Bitcoin ATMs in 10 weeks.”\n\nBitaccess offers software support not only for Bitcoin Depot’s Bitcoin ATMs but can also be deployed in other operators’ Bitcoin ATMs. The feature rich software allows operators white label opportunities and the ability to reduce the number of other software-related vendors needed due to its expanded, built-in functionality relative to other products. Additionally, Bitaccess has historically charged a lower software licensing fee to Bitcoin ATM operators based on transaction volume, compared to other software providers, and offers volume discounts.\n\nThis conversion makes Bitcoin Depot one of the first companies in the industry to complete a full software conversion across more than a few hundred Bitcoin ATMs. Based on industry data only a handful of Bitcoin ATM companies are vertically integrated, meaning they own their own software and operate their own Bitcoin ATMs, but there are over 550 Bitcoin ATM operators worldwide as of February 20, 2023, according to Coinatmradar.com.1 There are currently close to 8,000 total Bitcoin ATMs using Bitaccess software, including those operated by Bitcoin Depot, which gives Bitaccess a market share of approximately 21% worldwide as of February 20, 2023, calculated based on data from Coinatmradar.com.2\n\nAbout Bitcoin Depot\n\nBitcoin Depot was founded in 2016 with the mission to connect those who prefer to use cash to the broader, digital financial system. Bitcoin Depot provides its users with simple, efficient and intuitive means of converting cash into Bitcoin, which users can deploy in the payments, spending and investing space. Users can convert cash to Bitcoin at Bitcoin Depot’s kiosks and at thousands of name-brand retail locations through BDCheckout. The company has the largest market share in North America with approximately 7,000 kiosk locations. Learn more at www.bitcoindepot.com.\n\nOn August 24, 2022, Bitcoin Depot and GSR II Meteora Acquisition Corp. (“GSRM”), a special purpose acquisition corporation, entered into a definitive agreement for a business combination that would result in Bitcoin Depot becoming a public company listed on the Nasdaq under the ticker symbol “BTM.”\n\nAbout GSR II Meteora Acquisition Corp.\n\nGSR II Meteora Acquisition Corp. (NASDAQ: GSRM) is blank check company formed for the purpose of effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization or similar business combination with one or more businesses. GSRM’s management team is led by co-CEOs Gus Garcia and Lewis Silberman, President Anantha Ramamurti and CFO Joseph Tonnos. The company was formed in partnership with Meteora Capital, an investment adviser specializing in SPAC-related investments. For additional information, please visit www.gsrmet.com.\n\nNot an Offer\n\nThis communication does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval.\n\nForward-Looking Statements\n\nThe information in this press release includes “forward-looking statements” within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words such as “estimate,” “plan,” “project,” “forecast,” “intend,” “will,” “expect,” “anticipate,” “believe,” “seek,” “target” or other similar expressions that predict or indicate future events or trends or that are not statements of historical matters, although not all forward-looking statements contain such identifying words. These forward-looking statements include, but are not limited to, statements regarding estimates and forecasts of financial and performance metrics and expectations and timing related to potential benefits, terms and timing of the proposed business combination. These statements are based on various assumptions, whether or not identified in this press release, and on the current expectations of Bitcoin Depot’s and GSRM’s management and are not predictions of actual performance. These forward-looking statements are provided for illustrative purposes only and are not intended to serve as, and must not be relied on by any investor as, a guarantee, an assurance, a prediction or a definitive statement of fact or probability. Actual events and circumstances are difficult or impossible to predict and will differ from assumptions. Many actual events and circumstances are beyond the control of Bitcoin Depot and GSRM. These forward-looking statements are subject to a number of risks and uncertainties, including changes in domestic and foreign business, market, financial, political and legal conditions; the inability of the parties to successfully or timely consummate the proposed business combination, including the risk that any required regulatory approvals are not obtained, are delayed or are subject to unanticipated conditions that could adversely affect the combined company or the expected benefits of the proposed business combination or that the approval of the shareholders of GSRM is not obtained; failure to realize the anticipated benefits of the proposed business combination; risks relating to the uncertainty of the projected financial information with respect to Bitcoin Depot; future global, regional or local economic and market conditions; the development, effects and enforcement of laws and regulations; Bitcoin Depot’s ability to manage future growth; Bitcoin Depot’s ability to develop new products and services, bring them to market in a timely manner and make enhancements to its platform; the effects of competition on Bitcoin Depot’s future business; the amount of redemption requests made by GSRM’s public shareholders; the ability of GSRM or the combined company to issue equity or equity-linked securities in connection with the proposed business combination or in the future; the outcome of any potential litigation, government and regulatory proceedings, investigations and inquiries; and those factors described or referenced in GSRM’s final initial public offering prospectus dated February 24, 2022, its most recent Quarterly Report on Form 10-Q for the quarter ended September 30, 2022 and the definitive proxy statement dated February 8, 2023, in each case, under the heading “Risk Factors,” and other documents of GSRM filed, or to be filed, from time to time with the SEC. If any of these risks materialize or GSRM’s and Bitcoin Depot’s assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. There may be additional risks that neither Bitcoin Depot nor GSRM presently know or that Bitcoin Depot and GSRM currently believe are immaterial that could also cause actual results to differ from those contained in the forward-looking statements. In addition, forward-looking statements reflect Bitcoin Depot’s and GSRM’s expectations, plans or forecasts of future events and views as of the date of this press release. Bitcoin Depot and GSRM anticipate that subsequent events and developments will cause Bitcoin Depot’s and GSRM’s assessments to change. However, while Bitcoin Depot and GSRM may elect to update these forward-looking statements at some point in the future, Bitcoin Depot and GSRM specifically disclaim any obligation to do so except as otherwise required by applicable law. These forward-looking statements should not be relied upon as representing Bitcoin Depot’s and GSRM’s assessments as of any date subsequent to the date of this press release. Accordingly, undue reliance should not be placed upon the forward-looking statements.\n\nAdditional Information About the Proposed Business Combination and Where to Find It\n\nThe proposed business combination will be submitted to shareholders of GSRM for their consideration. Copies of the definitive proxy statement (a filing of which has been made with the SEC) were mailed to all GSRM shareholders of record as of February 3, 2023, the record date established for voting on the proposed business combination, beginning on February 8, 2023. GSRM plans to file other documents with the SEC and mail other relevant documents to its shareholders of record as of the record date regarding the proposed business combination. GSRM’s shareholders and other interested persons are advised to read the definitive proxy statement and any amendments or supplements thereto, as well as all other relevant materials filed or that will be filed with the SEC, in connection with GSRM’s solicitation of proxies for its special meeting of shareholders to approve, among other things, the proposed business combination, because these documents will contain important information about GSRM, Bitcoin Depot and the proposed business combination. Shareholders may also obtain a copy of the definitive proxy statement, as well as other documents filed with the SEC regarding the proposed business combination and other documents filed with the SEC by GSRM, without charge, at the SEC’s website located at www.sec.gov or by directing a request to Cody Slach or Alex Kovtun, (949) 574-3860, GSRM@gatewayir.com.\n\nParticipants in the Solicitation\n\nGSRM, Bitcoin Depot and certain of their respective directors, executive officers and other members of management and employees may, under SEC rules, be deemed to be participants in the solicitations of proxies from GSRM’s shareholders in connection with the proposed business combination. Information regarding the persons who may, under SEC rules, be deemed participants in the solicitation GSRM’s shareholders in connection with the proposed business combination is set forth in the definitive proxy statement that has been filed with the SEC. You can find more information about GSRM’s directors and executive officers in GSRM’s final initial public offering prospectus dated February 24, 2022 and filed with the SEC on February 28, 2022. Additional information regarding the participants in the proxy solicitation and a description of their direct and indirect interests are included in the definitive proxy statement and other relevant materials filed with the SEC. Shareholders, potential investors and other interested persons should read the definitive proxy statement carefully before making any voting or investment decisions. You may obtain free copies of these documents from the sources indicated above.\n\nContacts:\n\nInvestors\n\nCody Slach, Alex Kovtun\n\nGateway Group\n\n949-574-3860\n\nGSRM@gatewayir.com\n\nMedia\n\nZach Kadletz, Brenlyn Motlagh, Ryan Deloney\n\nGateway Group\n\n949-574-3860\n\nGSRM@gatewayir.com\n\n1 https://coinatmradar.com/charts/top-operators/\n\n2 https://coinatmradar.com/charts/cryptocurrency-share/\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/f7d7cc19-c701-449e-95f4-ac209c741b72\n\n\n\n\n\n\n\n"
    }
]