[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTExL2JpdGNvaW4taXMtcmFsbHlpbmctYnV0LWVsLXNhbHZhZG9yLXMtaG9sZGluZ3MtYXJlLXN0aWxsLWRvd24tMjnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Is Rallying But El Salvador's Holdings Are Still Down 29% - Bloomberg",
        "content": "Bitcoin may be at a nine-month high, but El Salvador’s total holdings are still worth 29% less than what the government paid for the world’s largest digital currency.\n\nEl Salvador purchased 2,546 Bitcoin at a cost basis of roughly $108 million, according to calculations by Bloomberg. At Tuesday’s prices, those tokens are worth just $77 million."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTExL2JpdGNvaW4tYnRjLWNsaW1icy10by0zMC0wMDAtZm9yLXRoZS1maXJzdC10aW1lLXNpbmNlLWp1bmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Climbs to $30,000 for First Time Since June in Rally - Bloomberg",
        "content": "Bitcoin climbed above $30,000 for the first time since June, bolstered by bets on easier monetary policies that have made cryptocurrencies standout performers this year.\n\nBitcoin is now up 82% since Dec. 31, handily beating the tech-heavy Nasdaq 100 ’s 19% gain. Gold , another investor favorite this year, has climbed around 10%. Crypto’s rapid ascent has seen Bitcoin vault past where it stood when hedge fund Three Arrows Capital imploded last summer — yet it remains more than 50% below its all-time high in November 2021."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDQvMTEvYnVzaW5lc3MvZGVhbGJvb2svYml0Y29pbi1wcmljZS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Rally Continues, Gaining More Than 80% This Year - The New York Times",
        "content": "Bitcoin is still the market’s runaway success story of the year. The cryptocurrency topped $30,000 on Tuesday for the first time since June.\n\nBitcoin has gained more than 80 percent in price this year, far outperforming many other assets. The Nasdaq 100, an index of the biggest tech stocks, has gained roughly 20 percent in that period — a strong showing but a far cry from Bitcoin’s resurgence.\n\nThe latest Bitcoin rally appears to be partly tied to the Federal Reserve’s monetary policy, which has included nine interest rate increases over the past year. Crypto asset prices sank a year ago as the central bank began to raise rates, but investors are now betting that the Fed will soon pause its rate increases, even though Fed officials have been suggesting the opposite, setting off a big rebound.\n\nBitcoin’s biggest gains also coincide with the turmoil in the banking sector. The cryptocurrency is up more than 45 percent since the collapse of Silicon Valley Bank last month. Industry advocates point to the recent rally as a sign that investors are converting some of their cash into digital currencies, though there is little evidence of that happening."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWNyb3NzZXMtMzAwMDAtZm9yLWZpcnN0LXRpbWUtaW4tMjAyMy0xMjUxMjY3MTYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin crosses $30,000 for first time in 2023 - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) crossed $30,000 Tuesday, reaching the highest level for the world's largest cryptocurrency in 10 months.\n\nIt briefly touched $30,301 around 2:20 AM ET Tuesday before easing later in the morning. By 8:00 AM ET, bitcoin was changing hands at $30,027, up 6.2% for the last 24 hours. The last time the digital currency was this high was June 6, 2022.\n\nThe bitcoin rally buoyed other crypto assets and companies Tuesday, including the stock of cryptocurrency exchange Coinbase Global (COIN) and the price of the world's second-largest cryptocurrency, Ether (ETH-USD), as well as the stocks of bitcoin mining companies Marathon Digital (MARA) and Riot (RIOT).\n\nBitcoin still has a ways to go to reach the heights it scaled during its peak. It still trades 23% below where it stood one year ago.\n\nThe rapid climb of digital currencies is one of this year's big surprises in markets after a crash in 2022 that cost investors billions as higher interest rates and inflation lowered the value and appeal of risky assets. Several crypto players filed for bankruptcy, including FTX in November. FTX's former CEO Sam Bankman-Fried now faces criminal charges that he stole billions of FTX customer funds and misled investors.\n\n\"It's a bounce back from the really poor performance we saw in 2022,\" VettaFi research head Todd Rosenbluth told Yahoo Finance.\n\nWhat gave the market added momentum this year was a banking crisis in March that took down three lenders, including two that specifically served cryptocurrency customers.\n\nSince March 10, the day regulators seized Silicon Valley Bank in the second-largest bank failure of U.S. history, bitcoin has climbed $9,500 higher for a more than 30% rise. Ether (ETH-USD) is up more than 29%. According to Coinmarketcap, the total value for all crypto assets is up more than 24% during that period, as of Tuesday at 8:00 a.m. ET.\n\nSome investors chose to seek out bitcoin as a safe haven from the perceived instability of banking. Others anticipated the Fed might have to cut interest rates in response to the crisis, sparking more flows into alternative risk assets.\n\nStory continues\n\nHowever, the banking crisis also has significantly restrained liquidity in the crypto market according to data collected from Kaiko Research. Because investors now have less banking partners to assist in moving funds from dollars to cryptocurrencies and vice versa, analysts have argued it is much easier to manipulate bitcoin’s price with a large order.\n\nCrypto’s 2023 comeback unfolds even as Washington regulators step up their efforts to rein in the market.\n\nThe Securities and Exchange Commission has issued 11 enforcement actions since the beginning of January against crypto firms and individuals, while serving formal letters to Paxos, DeFi exchange Sushi, and Coinbase Global warning the agency plans to bring an enforcement action. Coinbase is the largest U.S. crypto exchange.\n\nCoinbase shares have rebounded 86% year to date but are still suppressed by two thirds below their value a year ago. Marathon Digital and Riot have both more than doubled since the beginning of 2023 but still trade 60% and 45% below their price a year ago.\n\nAnother regulator, the Commodities and Futures Trading Commission, also has sued crypto exchange Binance and its CEO Changpeng Zhao for allegedly selling derivatives backed by digital assets to U.S. customers despite not being registered to do so.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS90ZWNobm9sb2d5LzIwMjMvYXByLzExL2JpdGNvaW4tcHJpY2UtcmlzZXMtdXNkLWN5cHRvY3VycmVuY3ktdmFsdWXSAV5odHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vdGVjaG5vbG9neS8yMDIzL2Fwci8xMS9iaXRjb2luLXByaWNlLXJpc2VzLXVzZC1jeXB0b2N1cnJlbmN5LXZhbHVl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price rises above $30,000 for first time since June 2022 - The Guardian",
        "content": "A sharp rise in bitcoin prices has pushed the cryptocurrency above $30,000 (£24,118) for the first time since 10 June last year, just before the Celsius crypto lending company froze withdrawals in the run-up to its collapse.\n\nEven given that recovery, the token is still well below its all-time high of $68,000 in November 2021, and far below where it was before the failure of the Terra stablecoin caused the “crypto winter”.\n\nNevertheless, bitcoin’s recent steady increase in value has sparked discussion of another cryptocurrency boom – and reignited fears of widespread manipulation in the market.\n\nThe collapse of Silicon Valley Bank last month and the broader contagion it has sparked across financial markets led some cryptocurrency fans to turn to bitcoin, the original and most valuable token in the sector, as a way of protecting against fears that the entire traditional “fiat” economy would crumble.\n\nThat attitude was typified by the US venture capitalist Balaji Srinivasan, who in March bet $1m that the price of a single bitcoin would top $1m by June this year. His claim was that the US dollar would shortly experience hyperinflation, causing the dollar value of a bitcoin to soar.\n\nQ&A What is bitcoin? Show Bitcoin is a 'cryptocurrency' – a decentralised tradeable digital asset. Invented in 2008, you store your bitcoins in a digital wallet, and transactions are stored in a public ledger known as the bitcoin blockchain, which prevents the digital currency being double-spent. Cryptocurrencies can be used to send transactions between two parties via the use of private and public keys. These transfers can be done with minimal processing cost, allowing users to avoid the fees charged by traditional financial institutions - as well as the oversight and regulation that entails. The lack of any central authority oversight is one of the attractions. This means it has attracted a range of backers, from libertarian monetarists who enjoy the idea of a currency with no inflation and no central bank, to drug dealers who like the fact that it is hard (but not impossible) to trace a bitcoin transaction back to a physical person. The exchange rate has been volatile, with some deeming it a risky investment. In January 2021 the UK's Financial Conduct Authority warned consumers they should be prepared to lose all their money if they invest in schemes promising high returns from digital currencies such as bitcoin. In practice it has been far more important for the dark economy than it has for most legitimate uses. In November 2021 it hit a record high of more than $68,000, as a growing number of investors backed it as an alternative to other assets during the Covid crisis. Bitcoin has been criticised for the vast energy reserves and associated carbon footprint of the system. New bitcoins are created by “mining” coins, which is done by using computers to carry out complex calculations. The more bitcoins that have been \"mined\", the longer it takes to mine new coin, and the more electricity is used in the process. Was this helpful? Thank you for your feedback.\n\n“This is the moment that the world redenominates on bitcoin as digital gold, returning to a model much like before the 20th century,” he tweeted, explaining the bet. “Everything will happen very fast once people check what I’m saying and see that the Federal Reserve has lied about how much money there is in the banks. All dollar holders get destroyed.”\n\nAlex Adelman, the chief executive of the bitcoin rewards app Lolli, said Monday’s rally “did not have a clear catalyst”, but that it was “a bellwether of bitcoin’s newly bullish market conditions and strong investor confidence. Bitcoin’s ongoing strength suggests that bitcoin is emerging from so-called ‘crypto winter’ into a new phase of strength and renewed interest from retail and institutional investors.”\n\nBut the recovery, after bitcoin prices hovered at $28,000 for almost a month before leaping the final $2,000 in a day, has also led to concern about market manipulation.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nQ&A What is a stablecoin? Show A stablecoin, like the name suggests, is a type of cryptocurrency that is supposed to have a stable value, such as US$1 per token. How they achieve that varies: the largest, such as tether and USD Coin, are effectively banks. They hold large reserves in cash, liquid assets, and other investments, and simply use those reserves to maintain a stable price.\n\nOthers, known as \"algorithmic stablecoins\", attempt to do the same thing but without any reserves. They have been criticised as effectively being backed by Ponzi schemes, since they require continuous inflows of cash to ensure they don't collapse.\n\nStablecoins are an important part of the cryptocurrency ecosystem. They provide a safer place for investors to store capital without going through the hassle of cashing out entirely, and allow assets to be denominated in conventional currency, rather than other extremely volatile tokens. Was this helpful? Thank you for your feedback.\n\nA 2022 report published by the US National Bureau of Economic Research found that “wash trading”, the practice of selling cryptocurrencies between related parties to influence the reported price, averaged “over 70% of the reported volume” on 29 unregulated exchanges.\n\nIn June 2022, the US Securities and Exchange Commission (SEC) refused permission to launch a bitcoin-linked exchange traded fund, which would allow investors to buy exposure to the cryptocurrency on the public stock markets, after concluding that it was impossible to prevent fraud and manipulation in the market from affecting the price.\n\nAs well as wash trading, the SEC said the market could be influenced by individuals with a “dominant position” in bitcoin manipulating its pricing, through fraud and manipulation at trading platforms, and through manipulative activity involving stablecoins “including tether”."
    }
]