[
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDUvMTYvYml0Y29pbi1kaXBzLWV1LXN0YXRlcy1hcHByb3ZlLWNvbXByZWhlbnNpdmUtY3J5cHRvLXJ1bGVzLWNuYmMtY3J5cHRvLXdvcmxkLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Bitcoin dips amid low liquidity, and EU states approve comprehensive crypto rules - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin dips amid low liquidity, and EU states approve comprehensive crypto rules: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Sam Callahan, lead analyst at Swan Bitcoin, breaks down the cryptocurrency's performance this year."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWhpc3RvcnktdW5jb3ZlcmVkLWFsbW9zdC1uZnQtMTkzMjU0NTIyLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Bitcoin history shows first financial transaction was almost an NFT - Yahoo Finance",
        "content": "Sometimes the most noteworthy thing in non-fungible tokens isn’t an NFT. A nugget of blockchain history was unearthed this weekend when internet sleuths uncovered the first documented financial transaction on the world’s first blockchain. In January 2010, a user named Sabunir decided to try Bitcoin, and as a test, sold a digital picture for US$1 in Bitcoin.\n\nWas this the world’s first NFT sale? No, but it is a perfect example of the use case of NFTs; preserving the provenance and ownership history of literally anything digital (not just a jpeg).\n\nThis 500 BTC jpeg sale would be worth about US$13.7 million today. Had the image been tokenized as an NFT, it would have gone down as the most significant NFT in history. If the image is recovered in the future, it would hold no value. But if it started as an NFT, the world would know exactly which copy was the original, and one lucky person would have generational wealth from it.\n\nIn the past 30 days, Bitcoin Ordinals and BRC-20s have turned the OG blockchain into the blockchain with the second-highest sales volume in the world. Bitcoin NFTs are just getting started and in the long run, I expect Bitcoin to compete head-to-head with Ethereum’s all-time sales. It may actually exceed them too.\n\nOrdinals\n\nMythos Chain is also doing big numbers, as people are beginning to take notice of the gaming blockchain and their impressive products. I’m a gamer and didn’t know until recently that they have the world’s largest CS:GO skins secondary market along with new hit NFL Rivals, Blankos Block Party and more on the horizon.\n\nFun fact: There is a gaming blockchain doing the 3rd most NFT volume this week.\n\n\n\nMore than Solana, Polygon, Immutable and co.\n\n\n\nFun thing is, all the volume is in CSGO skin sales which are recorded on the blockchain.\n\n\n\nSadly it's not through web3 games (yet) pic.twitter.com/udDeU7clT9 — apix🎮 (@apixtwts) May 13, 2023\n\nAt the time of this writing, three of the top 10 collections in 24 hours are all gaming NFTs, and the biggest game makers like Square Enix, Ubisoft, Konomi and Atari are only just now beginning to touch NFTs.\n\nStory continues\n\nLots are going on outside of the NFT markets. NFT communities and those who build them are preparing to descend on the second annual VeeCon conference this week, as Gary Vaynerchuck again shows the world the pinnacle of Web3. Those who believe NFTs can function as access passes, art, and collectibles all in one are in for a treat when, what I call the State of the NFTs, kicks off at Lucas Oil Stadium on May 18. CryptoSlam will be there shaking hands and filling our brains with all of the latest happenings in NFTs. It’s going to be a special time and we’re hoping to get to meet some of you there!\n\nI’m expecting markets to be slow while many are off networking, but we also know that degens are going to degen. Keep your eyes on cryptoslam.io, the Forkast 500 NFT Index, and our ETH, Solana, Polygon, and Cardano composites to see how the market is affected when many in the space take a break from trading."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zYWktdGVjaC1wYXJ0aWNpcGF0ZS1iaXRjb2luLW1pbmluZy0wODAwMDA3MzguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "SAI.TECH to Participate in the Bitcoin Mining Virtual Conference Presented by Maxim Group LLC and hosted by M-Vest ... - Yahoo Finance",
        "content": "SAI.TECH Global Corporation\n\nSINGAPORE, May 16, 2023 (GLOBE NEWSWIRE) -- SAI.TECH Global Corporation (\"SAI.TECH\" or \"SAI\" or the \"Company\", NASDAQ: SAI), a Sustainable Bitverse Operator, announced today that the Company’s Chief Financial Officer (CFO) Ian Chow, and Director of Strategy and Investments Jack Xie, have been invited to present at the Bitcoin Mining Virtual Conference, presented by Maxim Group LLC and hosted by M-Vest, on Tuesday, May 16th, 2023, at 9:00 a.m. ET.\n\n\n\nJoin us for an exclusive event where Bitcoin mining executives will discuss how they navigate the challenges of the constantly evolving cryptocurrency landscape. During the event, we will delve into the complex world of Bitcoin mining, exploring topics such as hosting facility bankruptcies, the collapse of exchanges, cyber-attacks, and the evolving regulatory landscape. Our expert panel of speakers will share their insights and experiences in navigating these challenges, providing valuable insights for those looking to gain a deeper understanding of the Bitcoin mining industry.\n\nThis conference will be live on M-Vest. To attend, just sign up to become an M-Vest member.\n\nClick Here to Reserve your seat\n\nAbout SAI.TECH\n\nSAI.TECH is a Nasdaq listed (SAI) Sustainable Bitverse Operator, headquartered in Singapore. SAI is dedicated to providing zero-carbon energy system (HEATNUC) based on Small Modular Reactor and heat pump combined power supply technology, providing clean computing services based on liquid cooling and chip waste heat utilization technology (ULTIAAS),and providing decentralized transaction system services based on blockchain and lightning network technology (BOLTBIT).\n\nIn May 2022, SAI became a publicly trading company under the new ticker symbol “SAI” on the Nasdaq Stock Market (NASDAQ) through a merger with TradeUP Global Corporation (\"TradeUP\").\n\nFor more information on SAI.TECH, please visit https://sai.tech/.\n\nForward looking Statements:\n\nThis press release may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. The words “believe”, “expect”, “anticipate”, “project”, “targets”, “optimistic”, “confident that”, “continue to”, “predict”, “intend”, “aim”, “will” or similar expressions are intended to identify forward-looking statements. All statements other than statements of historical fact are statements that may be deemed forward-looking statements. These forward-looking statements including, but not limited to, statements concerning SAI.TECH and the Company’s operations, financial performance and condition are based on current expectations, beliefs and assumptions which are subject to change at any time. SAI.TECH cautions that these statements by their nature involve risks and uncertainties, and actual results may differ materially depending on a variety of important factors such as government and stock exchange regulations, competition, political, economic and social conditions around the world including those discussed in SAI.TECH’s Form 20-F under the headings “Risk Factors”, “Results of Operations” and “Business Overview” and other reports filed with the Securities and Exchange Commission from time to time. All forward-looking statements are applicable only as of the date it is made and SAI.TECH specifically disclaims any obligation to maintain or update the forward-looking information, whether of the nature contained in this release or otherwise, in the future.\n\nStory continues\n\nMedia Contact\n\npr@sai.tech\n\nInvestor Relations Contact\n\nir@sai.tech\n\n\n\n"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zdXN0YWluYWJsZS1iaXRjb2luLXByb3RvY29sLXdlbGNvbWVzLXBldGVyLTEzNTkwMDAyNy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Sustainable Bitcoin Protocol Welcomes Peter Wall, Former Argo Blockchain CEO, as New Senior Advisor - Yahoo Finance",
        "content": "Wall's executive experience in Bitcoin mining set to enhance SBP's climate investing mission\n\nMIAMI, May 16, 2023--(BUSINESS WIRE)--Sustainable Bitcoin Protocol (SBP) proudly announces the appointment of Peter Wall, the former CEO of Argo Blockchain, as its new Senior Advisor. With a deep understanding of the Bitcoin mining sector, Wall is poised to elevate SBP's efforts to unlock Bitcoin’s potential to be one of the most sustainable asset classes and bridge Bitcoin with climate-focused institutional investors.\n\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20230516005432/en/\n\nSustainable Bitcoin Protocol Welcomes Peter Wall, Former Argo Blockchain CEO, as New Senior Advisor (Photo: Business Wire)\n\nPrior to joining SBP, Wall spent the first decade of his career in journalism before transitioning to entrepreneurship. He then joined Argo as their VP of Operations and was eventually promoted to CEO. During his 3-year tenure as Chief Executive, Wall led the company through a period of rapid growth, which included a Nasdaq exchange listing and raising $200 million in capital, all while maintaining a strong vision and a deep commitment to environmental stewardship.\n\n\"We are honored and excited to have Peter Wall join our team as a Senior Advisor. His expertise in the Bitcoin mining sector, combined with his talent for storytelling, will be invaluable to our mission,\" said SBP CEO, Brad van Voorhees. \"We deeply respect Peter's understanding of the pain points and challenges within the industry and believe that he will help us improve the way we articulate the mission of SBP and support miners.\"\n\nAs an advisor, Wall will utilize his extensive experience to assist the SBP team in leveraging data and transparency to highlight Bitcoin's potential as the preferred asset of impact investors. His passion for sustainable practices and belief in Bitcoin's potential align perfectly with SBP's objectives.\n\nStory continues\n\n\"Bitcoin has a unique opportunity to become one of the world's most sustainable asset classes within the Climate Investing space, and I'm thrilled to join the SBP team in helping it reach that potential,\" said Wall. \"Together, we will work to educate the global community on the environmental and social benefits of embracing Bitcoin as a Climate investing asset.\"\n\nSustainable Bitcoin Protocol remains committed to its vision of helping Bitcoin become a preferred investment of sustainable investing. With the addition of Peter Wall as a Senior Advisor, the organization is poised to advance its mission further and help the world recognize the vast potential of Bitcoin as a powerful tool in the clean energy transition.\n\nAbout Sustainable Bitcoin Protocol\n\nSustainable Bitcoin Protocol (SBP) is on a \"mission to unlock Bitcoin’s potential as our planet’s most sustainable and transparent asset class\" and accelerate investment into the renewable energy sector. SBP incentivizes miners to verify their use of renewable and clean energy sources and issues them Sustainable Bitcoin Certificates (SBC) which can be sold to investors. In creating a transparency layer for the Bitcoin mining ecosystem, SBP forms the missing link between climate-conscious investors and the world's most critical monetary technology.\n\nSBP’s investors include BitDeer, Hawksburn Capital, New Layer Capital, BlackPine, Verda Ventures, Bitcoin Frontier Fund, and prominent angels in institutional finance. For more information about SBP or to become a partner, visit https://www.sustainablebtc.org.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20230516005432/en/\n\nContacts\n\nInvestor Relations:\n\nMatthew Twomey\n\nmatt@sustainablebtc.org\n\nMedia:\n\nElena Berkowitz\n\nelena@sustainablebtc.org"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaWctZXllcy1jb2luLXByb2R1Y3QtbGluZXVwLTE3MDcxMDIyOC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 16 May 2023 07:00:00 GMT",
        "title": "Big Eyes Coin's Product Lineup Packs a Punch; to Join Bitcoin and Toncoin on Top - Yahoo Finance",
        "content": "In the world of crypto, success is a uphill battle, where coins like Bitcoin and Toncoin are top dogs. But, Big Eyes Coin (BIG) is carving out a unique path, forging ahead with unwavering determination to establish itself as an exceptional cryptocurrency.\n\nTrue enough, the Cat Crew basked in the warmth of their digital utopia, courtesy of the Big Eyes NFT Lootboxes. Their euphoria soared to greater heights as news of the presale finale on the 3rd of June, accompanied by enticing offers, and a grand launch on the 15th of June, followed suit. Just when the community was awash with contentment and anticipation, Big Eyes Coin sprang yet another surprise — their very own P2E and online casino games.\n\nBIG Dates: 3rd and 15th of June 2023\n\nBig Eyes Coin’s imminent arrival has ignited a palpable excitement in the crypto sphere, as the highly anticipated launch date of 15th June 2023, draws near. With the final presale round of BIG tokens coming to a close on 3rd June 2023, the countdown is truly underway.\n\nAs such, Big Eyes Coin offers an array of enticing promotions to capture the market’s attention. That includes the END300 promo, which gifts users an impressive 300% bonus on every purchase, and the time-limited Double Up promo. The latter guarantees investors that 25% of their total deposit will double up (based on the current price of the stage at the time of ‘doubling’).\n\nNFT Talks: Big Eyes Lootbox Cards and Bitcoin Ordinals\n\nThe NFT (non-fungible token) craze has swept the globe, and Big Eyes Coin has gracefully hopped on the bandwagon with its NFT Lootboxes, available on OpenSea. With a starting price of 0.0675 ETH, these Big Eyes NFTs offer a wide assortment of original artwork, each one a true gem in its own right.\n\nConversely, Bitcoin’s Ordinals, a popular new type of blockchain-native NFT, imbues individual satoshis (the smallest unit of Bitcoin), with unique serial numbers that are assigned according to the order in which they were mined\n\nStory continues\n\nBig Eyes Coin’s NFT Lootboxes are still new in the bustling world of digital collectibles. Yet, hopes are high that this nascent treasure may soon capture the admiration of the market, just as Bitcoin did when it first dropped its Ordinals. This would be made possible through BIG’s dedication and unshakable focus on its roadmap.\n\nBitcoin, Toncoin, and Big Eyes Coin’s GameFi Venture\n\nThe crypto king, Bitcoin, and the Telegram-native crypto, Toncoin, have found success in their foray into the innovative world of GameFi, inspiring Big Eyes Coin to follow suit. With a passionate drive towards exploration, and its sights on an 29th of August launch, Big Eyes Coin will offer an unparalleled P2E and online casino experience, replete with a staggering library of over 4000 games.\n\nA Bullish Future for the Crypto Market\n\nExpectations are high. at the potential bullish market that could reign supreme in the aftermath of popular cryptocurrencies’ — including Bitcoin — halving dates in 2024. Bestowing a tremendous boon on Big Eyes Coin’s pricing potential, the meme token’s value could jump beyond the $0.004 threshold with a $700 million market cap. By 2025, this bullish projection could propel BIG to join the ranks of the top 20 cryptocurrencies, and a formidable competitor against fellow meme assets like Dogecoin, Shiba Inu, and FLOKI.\n\nThey say that the feeling of FOMO is like an insistent whisper, reminding us of the great opportunities that may pass us by — this rings true for Big Eyes Coin.\n\nWith BIG’s final presale and launch date set, the stakes are truly at an all-time high. Those who fail to seize this chance would risk the sharp pang of regret as they watch others bask in the bountiful rewards of their timely decision.\n\nFOMO Can Be Scary, But So Can Regret. Check out the links below to get involved with Big Eyes Coin.\n\nFor All Things About Big Eyes Coin (BIG):\n\nPresale: https://buy1.bigeyes.space/?offercode=END300§ion=buy\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nOpenSea: https://opensea.io/collection/big-eyes-lootbox-cards\n\nTwitter: https://twitter.com/BigEyesCoin"
    }
]