[
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYXVzdHJhbGlhbi1nb3Zlcm5tZW50LXJlbGVhc2VzLWZpcnN0LXN0ZXBzLXRvLXJlZ3VsYXRlLWNyeXB0by1hbmQtYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Australian Government Releases First Steps To Regulate Crypto And Bitcoin - Nasdaq",
        "content": "The first steps of a multi-stage plan to regulate the cryptocurrency industry within Australia have been released.\n\nThe Australian government has announced the first step of what it calls a multi-stage approach to tackling cryptocurrency regulation.\n\nAccording to the announcement, “the multi‑stage approach has three elements: strengthening enforcement, bolstering consumer protection; and establishing a framework for reform.”\n\n\n\nThe first step begins with the Australian Securities & Investments Commission (ASIC) increasing the size of its crypto team and “upping enforcement measures.” These enforcement measures described include taking legal action when cryptocurrencies are marketed without appropriate financial licenses. In addition, the report describes that particular attention will be paid to making sure risks are properly disclosed to consumers.\n\n\n\nThese steps are intended to step up efforts targeting scams, especially those involving cryptocurrencies.\n\n“The Government’s National Anti‑Scams Centre, located within the Australian Competition and Consumer Commission (ACCC), will facilitate real‑time data sharing and the coordinated prevention and disruption of scams,” reads the report, indicating that the collection of data will be a major part of the operations.\n\nIn addition to the steps announced today, the government introduced a token mapping consultation paper addressing “which elements of the crypto ecosystem are sufficiently regulated and which require additional attention.” The paper addresses Bitcoin specifically, describing it as a cryptocurrency network with the intent to operate as a “peer-to-peer payment structure,” as a “new form of currency.” In addition, the use cases of Bitcoin are illustrated, including its use as a store of value, and as a medium of exchange, “particularly in emerging markets.”\n\nThe Australian government's multi-stage approach to cryptocurrency regulation is designed to protect consumers while also providing oversight and regulatory clarity, but it remains to be seen if this regulatory environment will stifle growth and innovation, or fulfill its intended purpose while harboring growth.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYXVzdHJhbGlhbi1nb3Zlcm5tZW50LXJlbGVhc2VzLWZpcnN0LXN0ZXBzLXRvLXJlZ3VsYXRlLWNyeXB0by1hbmQtYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Australian Government Releases First Steps To Regulate Crypto And Bitcoin - Nasdaq",
        "content": "The first steps of a multi-stage plan to regulate the cryptocurrency industry within Australia have been released.\n\nThe Australian government has announced the first step of what it calls a multi-stage approach to tackling cryptocurrency regulation.\n\nAccording to the announcement, “the multi‑stage approach has three elements: strengthening enforcement, bolstering consumer protection; and establishing a framework for reform.”\n\n\n\nThe first step begins with the Australian Securities & Investments Commission (ASIC) increasing the size of its crypto team and “upping enforcement measures.” These enforcement measures described include taking legal action when cryptocurrencies are marketed without appropriate financial licenses. In addition, the report describes that particular attention will be paid to making sure risks are properly disclosed to consumers.\n\n\n\nThese steps are intended to step up efforts targeting scams, especially those involving cryptocurrencies.\n\n“The Government’s National Anti‑Scams Centre, located within the Australian Competition and Consumer Commission (ACCC), will facilitate real‑time data sharing and the coordinated prevention and disruption of scams,” reads the report, indicating that the collection of data will be a major part of the operations.\n\nIn addition to the steps announced today, the government introduced a token mapping consultation paper addressing “which elements of the crypto ecosystem are sufficiently regulated and which require additional attention.” The paper addresses Bitcoin specifically, describing it as a cryptocurrency network with the intent to operate as a “peer-to-peer payment structure,” as a “new form of currency.” In addition, the use cases of Bitcoin are illustrated, including its use as a store of value, and as a medium of exchange, “particularly in emerging markets.”\n\nThe Australian government's multi-stage approach to cryptocurrency regulation is designed to protect consumers while also providing oversight and regulatory clarity, but it remains to be seen if this regulatory environment will stifle growth and innovation, or fulfill its intended purpose while harboring growth.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1hcmtldC1zZW50aW1lbnQtbW9zdC1idWxsaXNoLTEwMDE1ODc3My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Market Sentiment Is Most Bullish in 14 Months With US Jobs Report Due - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nBitcoin (BTC) is currently priced significantly lower than it was in late 2021. Still, the mood in the market is as positive as it was back then.\n\nThat's the message from funding rates, a mechanism that keeps the prices of bitcoin perpetual futures contracts in sync with the spot market price. When perpetual futures are trading above spot, the funding rate is positive and holders of bullish long, or buy, positions pay bearish shorts to keep their trade open. The opposite happens when perpetuals trade below the spot price.\n\nAnalysts track the funding rate to gauge the mood of leverage traders. The higher the funding rate, the more excited traders are about price prospects and the more willing to pay a premium to keep their upside bets open.\n\nAs of Thursday, the annualized bitcoin perpetual funding rates across major exchanges including Binance was 8.491%, the highest since Dec. 3, 2021, according to data tracked by blockchain analytics firm Glassnode.\n\nBack then, one bitcoin was priced around $57,000, or 2.5 times the current market rate of $23,400. The cryptocurrency set a record high of $69,000 in November 2021.\n\nThe funding rate flipped positive in mid-December last year, indicating seller exhaustion. The cryptocurrency picked up a strong bid at the turn of the year and has rallied over 40% since then.\n\n\"There has been a clear shift in market sentiment post-[December) CPI with funding rates well into positive territory and price volatility on the rise,\" Dessislava Laneva, a research analyst at Paris-based crypto data provider Kaiko, said in a tweet referring to the U.S. consumer price index.\n\nThe CPI fell to 6.5% in December, the sixth straight monthly deceleration in price increases. The data convinced markets that the Federal Reserve was likely to pivot to liquidity-boosting interest rate cuts later this year.\n\nEarly this week, Fed Chair Jerome Powell acknowledged the inflation picture and downplayed concerns of a severe tightening-induced economic slowdown, bolstering the pivot hopes.\n\nStory continues\n\nFocus on US nonfarm payrolls\n\nThe U.S. nonfarm payrolls (NFP) report scheduled for release at 13:30 UTC is likely to show the world's biggest economy added 185,000 jobs in January following December's 223,000 increase, according to Reuters estimates sourced from FXStreet.\n\nThe unemployment rate is forecast to tick slightly higher to 3.6% in January, while average hourly earnings, or wage growth, is expected to print at 4.9% year on year following December's 4.6% rise.\n\nA notable increase in average hourly earnings, a proxy for potential inflation, coupled with the headline jobs figure might see investors reconsider the possibility of the Fed keeping interest rates higher for longer and scale back bullish positioning in risk assets, including cryptocurrencies.\n\n\n\n"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1hcmtldC1zZW50aW1lbnQtbW9zdC1idWxsaXNoLTEwMDE1ODc3My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Market Sentiment Is Most Bullish in 14 Months With US Jobs Report Due - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nBitcoin (BTC) is currently priced significantly lower than it was in late 2021. Still, the mood in the market is as positive as it was back then.\n\nThat's the message from funding rates, a mechanism that keeps the prices of bitcoin perpetual futures contracts in sync with the spot market price. When perpetual futures are trading above spot, the funding rate is positive and holders of bullish long, or buy, positions pay bearish shorts to keep their trade open. The opposite happens when perpetuals trade below the spot price.\n\nAnalysts track the funding rate to gauge the mood of leverage traders. The higher the funding rate, the more excited traders are about price prospects and the more willing to pay a premium to keep their upside bets open.\n\nAs of Thursday, the annualized bitcoin perpetual funding rates across major exchanges including Binance was 8.491%, the highest since Dec. 3, 2021, according to data tracked by blockchain analytics firm Glassnode.\n\nBack then, one bitcoin was priced around $57,000, or 2.5 times the current market rate of $23,400. The cryptocurrency set a record high of $69,000 in November 2021.\n\nThe funding rate flipped positive in mid-December last year, indicating seller exhaustion. The cryptocurrency picked up a strong bid at the turn of the year and has rallied over 40% since then.\n\n\"There has been a clear shift in market sentiment post-[December) CPI with funding rates well into positive territory and price volatility on the rise,\" Dessislava Laneva, a research analyst at Paris-based crypto data provider Kaiko, said in a tweet referring to the U.S. consumer price index.\n\nThe CPI fell to 6.5% in December, the sixth straight monthly deceleration in price increases. The data convinced markets that the Federal Reserve was likely to pivot to liquidity-boosting interest rate cuts later this year.\n\nEarly this week, Fed Chair Jerome Powell acknowledged the inflation picture and downplayed concerns of a severe tightening-induced economic slowdown, bolstering the pivot hopes.\n\nStory continues\n\nFocus on US nonfarm payrolls\n\nThe U.S. nonfarm payrolls (NFP) report scheduled for release at 13:30 UTC is likely to show the world's biggest economy added 185,000 jobs in January following December's 223,000 increase, according to Reuters estimates sourced from FXStreet.\n\nThe unemployment rate is forecast to tick slightly higher to 3.6% in January, while average hourly earnings, or wage growth, is expected to print at 4.9% year on year following December's 4.6% rise.\n\nA notable increase in average hourly earnings, a proxy for potential inflation, coupled with the headline jobs figure might see investors reconsider the possibility of the Fed keeping interest rates higher for longer and scale back bullish positioning in risk assets, including cryptocurrencies.\n\n\n\n"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vbmV3LWplcnNleS1tYW4taGl0bWFuLWJpdGNvaW4tdGVlbi1ib3ktY2hpbGQtcG9ybm9ncmFwaHktMjAyMy0y0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "New Jersey Man Tried to Hire Hitman With Bitcoin to Kill 14-Year-Old - Business Insider",
        "content": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nA New Jersey man has admitted he tried to hire a hitman for $20,000 in Bitcoin to kill a 14-year-old boy who was going to testify against him in a child-pornography case, according to the Department of Justice.\n\nJohn Michael Musbach, 31, from Haddonfield, New Jersey, pleaded guilty in federal court to hiring a hitman to carry out a murder, according to a release by the Department of Justice.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nMusbach first encountered the boy in the summer of 2015 when the boy was 13 years old and living in New York with his parents, according to a criminal complaint filed in federal court. The complaint alleges that Musbach and the boy exchanged sexually explicit content with each other online, including videos of themselves masturbating.\n\nThe boy's parents found out and alerted the police, who started investigating Musbach, according to the complaint.\n\nAdvertisement\n\nProsecutors alleged in a court filing that police discovered Musbach had Google searched a variety of alarming queries, like \"child grooming law,\" \"death by chloroform,\" \"where to buy chloroform,\" \"how to buy a gun in NJ,\" and finally, searches on how to erase his search history.\n\nIn March of 2016, authorities arrested Musbach on child pornography charges, prosecutors said in the complaint.\n\nA few months after being arrested, Musbach then \"decided to have the victim killed so that the victim could not testify against him in the pending criminal case,\" the DOJ said in a statement released Thursday. The criminal complaint states that Musbach found a murder-for-hire website on the dark web and arranged to pay $20,000 worth of Bitcoin for the murder of the victim.\n\nThe murder-for-hire service advertised itself on its website, saying \"If you want to kill someone, or to beat the shit out of him, we are the right guys ... No undercover cops here. No risks of getting caught, because we are professional killers,\" according to the complaint.\n\nAdvertisement\n\nWhen Musbach asked if 14 years old was too young for the hit, the site administrator said \"14 years old is acceptable,\" according to the complaint.\n\nAfter paying up $20,000 in Bitcoin, Musbach then repeatedly messaged the service asking when the hit would be carried out, prosecutors said.\n\nEventually, the site administrator revealed that the site was a scam and threatened to turn Musbach in to law enforcement if he didn't turn over more money, according to the DOJ.\n\nMusbach allegedly responded, \"is this a joke?\"\n\nAdvertisement\n\nThe boy was never harmed, and the site did eventually turn Musbach over to authorities, prosecutors said. Musbach pleaded guilty to the murder-for-hire charges in court on Thursday, according to the DOJ.\n\nMusbach's lawyer, Rocco C. Cipparone, told Insider in a statement, \"Mr. Musbach decided to put this matter behind him without a trial, and accepted his responsibility.\"\n\nMusbach faces up to 10 years in prison when he is sentenced in June."
    }
]