[
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8xNTQ2OTUvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tdG9uY29pbi10b24tcG9seWdvbi1tYXRpY9IBXWh0dHBzOi8vZGVjcnlwdC5jby8xNTQ2OTUvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tdG9uY29pbi10b24tcG9seWdvbi1tYXRpYz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Unmoved in Slow Market Week - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nMost of the top thirty cryptocurrencies by market capitalization posted negligible losses or gains over the last seven days.\n\nBitcoin (BTC) starts the weekend at $26,051, pretty much the same level it was at last week.\n\nAD\n\nAD\n\nThe world’s most popular cryptocurrency briefly surged on Tuesday after a judge representing the U.S. Court of Appeals for the D.C. Circuit ordered a review of the Securities and Exchange Commission’s (SEC) denial of crypto asset manager Grayscale’s spot Bitcoin ETF application. The Court said the SEC had failed to provide a “coherent explanation” for the denial.\n\nEthereum (ETH) took inconsequential seven-day losses of 0.4% and now changes hands at $1,646.\n\nVirtually every other leading cryptocurrency is approximately the same price it was last weekend except Toncoin (TON), which blew up 22% to trade at $1.75, and Bitcoin Cash (BCH), which rose 8.6% to $206.87.\n\nToncoin’s bullish momentum can be attributed to the development of the TON ecosystem.\n\nThe TON Foundation, which spun out from Telegram to develop TON, recently released a Telegram-centric Web3 app store and launched a community-driven initiative, Believers.ton, to promote ecosystem development.\n\nBitcoin Cash was one of the fastest risers when the Grayscale/SEC news broke on Tuesday and appears to have sustained the rally into the weekend. Similarly, Coinbase stock soared 15% in the hours following the news.\n\nAD\n\nAD\n\nAny intraweek gains that Bitcoin and Ethereum made were wiped out early on Friday as the industry reacted to news that the SEC needed more time to approve or reject 6 Bitcoin ETF applications.\n\nAll told, it was another excruciatingly slow news cycle this week for those looking to see some sign of growing global crypto adoption. On Thursday, airline Giant Lufthansa launched an NFT-based loyalty program on Polygon. Polygon’s MATIC token didn’t particularly react to the news, though—it ended the week 1.2% higher at a price of around $0.55."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8xNTQ2OTUvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tdG9uY29pbi10b24tcG9seWdvbi1tYXRpY9IBXWh0dHBzOi8vZGVjcnlwdC5jby8xNTQ2OTUvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tdG9uY29pbi10b24tcG9seWdvbi1tYXRpYz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin and Ethereum Unmoved in Slow Market Week - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nMost of the top thirty cryptocurrencies by market capitalization posted negligible losses or gains over the last seven days.\n\nBitcoin (BTC) starts the weekend at $26,051, pretty much the same level it was at last week.\n\nAD\n\nAD\n\nThe world’s most popular cryptocurrency briefly surged on Tuesday after a judge representing the U.S. Court of Appeals for the D.C. Circuit ordered a review of the Securities and Exchange Commission’s (SEC) denial of crypto asset manager Grayscale’s spot Bitcoin ETF application. The Court said the SEC had failed to provide a “coherent explanation” for the denial.\n\nEthereum (ETH) took inconsequential seven-day losses of 0.4% and now changes hands at $1,646.\n\nVirtually every other leading cryptocurrency is approximately the same price it was last weekend except Toncoin (TON), which blew up 22% to trade at $1.75, and Bitcoin Cash (BCH), which rose 8.6% to $206.87.\n\nToncoin’s bullish momentum can be attributed to the development of the TON ecosystem.\n\nThe TON Foundation, which spun out from Telegram to develop TON, recently released a Telegram-centric Web3 app store and launched a community-driven initiative, Believers.ton, to promote ecosystem development.\n\nBitcoin Cash was one of the fastest risers when the Grayscale/SEC news broke on Tuesday and appears to have sustained the rally into the weekend. Similarly, Coinbase stock soared 15% in the hours following the news.\n\nAD\n\nAD\n\nAny intraweek gains that Bitcoin and Ethereum made were wiped out early on Friday as the industry reacted to news that the SEC needed more time to approve or reject 6 Bitcoin ETF applications.\n\nAll told, it was another excruciatingly slow news cycle this week for those looking to see some sign of growing global crypto adoption. On Thursday, airline Giant Lufthansa launched an NFT-based loyalty program on Polygon. Polygon’s MATIC token didn’t particularly react to the news, though—it ended the week 1.2% higher at a price of around $0.55."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2JpdGNvaW4tcHJpY2UtbGlrZWx5LXRvLWZhbGwtMTAtZnJvbS1jdXJyZW50LWxldmVscy10aGlzLXNlcHRlbWJlci1jcnlwdG8tYW5hbHlzdC1zYXlzLTIwMjMwOTAyMDgwONIBlgFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9iaXRjb2luLXByaWNlLWxpa2VseS10by1mYWxsLTEwLWZyb20tY3VycmVudC1sZXZlbHMtdGhpcy1zZXB0ZW1iZXItY3J5cHRvLWFuYWx5c3Qtc2F5cy0yMDIzMDkwMjA4MDg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin price likely to fall 10% from current levels this September, crypto analyst says - FXStreet",
        "content": "Share:\n\nPopular strategy analyst Benjamin Cowen has forecasted a bearish month for Bitcoin this September.\n\nIn his opinion, the month has proven gloomy for BTC historically, characterized by negative averages incomparable to any other month.\n\nWith this, Cowen predicts a 10% slump to test the $23,000 psychological level.\n\nRegarding altcoins, he anticipates a recovery inspired by a confluence of macro tailwinds to steer the market into 2024.\n\nBitcoin (BTC) price has historically hurt traders that take long positions in September, with strategy analyst Benjamin Cowen predicting double-digit losses this month, potentially testing levels last seen in February.\n\nAlso Read: Bitcoin Weekly Forecast: BTC correlation to DJIA hits 2021 peak levels amid ETF hype.\n\nBitcoin could fall 10% in September\n\nBitcoin (BTC) price could fall at least 10% in September, according to Cowen, a strategy analyst who explored the bearish outlook displayed by BTC historically during this month. With the flagship crypto back in the $25,000 range after the US Securities and Exchanges Commission (SEC) delayed decisions on spot BTC Exchange-Traded Funds (ETF) filing, the analyst says:\n\nSeptember just tends to not be a great month for crypto. Bitcoin – you can see – it averages negative in September, by a long shot, much worse than any other month.\n\nThe analyst retraced the “seasonality of Bitcoin,” highlighting that momentum indicators add credence to his analysis. In his opinion, the fact that BTC closed the month of August below the $27,000 psychological level increased the odds for a deep correction to $23,000 in September.\n\nBTC/USDT 1-day chart\n\nWhat about altcoins?\n\nRegarding altcoins, the analyst predicts this class of assets “coming back to life,” possibly driven by a confluence of macro factors that would bode well for the altcoin category in 2024.\n\nCowen’s thesis for altcoins in 2024 sprouts from the Bitcoin halving, expected in early 2024. The halving season is characterized by volatility, which could go higher considering the US Elections, defined by massive market uncertainty. For one, incumbents looking to stay in power are likely to inject political pressure as a campaign strategy to entice voters with less stringent monetary policies, hence volatility.\n\nThe analyst also bases his postulate on the ongoing “rate-hikes,” with the Federal Reserve showing more aggression this cycle than ever.\n\n…at this rate, we are likely to start seeing the labor market show noticeable effects from all these interest rate hikes by the end of this year, early next year.\n\nA weakening labor market coupled with easing inflation as chatter about a recession lingers will likely influence the Fed to pause the rate hikes to help companies stay afloat. This could pave the way for a “quantitative easing return” in the market, possibly allowing altcoins to thrive."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL2VuZ2xpc2guZWxwYWlzLmNvbS9pbnRlcm5hdGlvbmFsLzIwMjMtMDktMDIvdHdvLXllYXJzLW9mLWJpdGNvaW4taW4tYnVrZWxlcy1lbC1zYWx2YWRvci1hbi1vcGFxdWUtZXhwZXJpbWVudC13aXRoLWEtbGl0dGxlLXVzZWQtY3VycmVuY3kuaHRtbNIBpAFodHRwczovL2VuZ2xpc2guZWxwYWlzLmNvbS9pbnRlcm5hdGlvbmFsLzIwMjMtMDktMDIvdHdvLXllYXJzLW9mLWJpdGNvaW4taW4tYnVrZWxlcy1lbC1zYWx2YWRvci1hbi1vcGFxdWUtZXhwZXJpbWVudC13aXRoLWEtbGl0dGxlLXVzZWQtY3VycmVuY3kuaHRtbD9vdXRwdXRUeXBlPWFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Two years of bitcoin in Bukele’s El Salvador: An opaque experiment with a little-used currency - EL PAÍS USA",
        "content": "Two years ago, El Salvador stunned the world by becoming the first country to make bitcoin an official currency. Journalists from around the world traveled to the Central American nation of 6.3 million people, known for its beaches and its diaspora in the United States, to document the new monetary reality. September 7, 2021, when the new cryptocurrency law came into effect, was an atypical moment in which a small country briefly held the attention of the entire world.\n\nInterest has waned, but the experiment continues. It is tempting to classify the Bitcoin Law — the name for the legislative project that made the digital asset legal tender — as a success or a failure. But nothing is so simple in President Nayib Bukele’s El Salvador. The country’s decision to make bitcoin an official currency is difficult to analyze because it is an opaque experiment with several different objectives: financial inclusion, revenue for the public treasury and building the reputation of the president.\n\nThe experiment began with several bitcoin purchases by the Bukele government. The exact amount of bitcoin that El Salvador has in its international reserves is not known, since the government does not keep a public record. The closest thing that exists to a purchase announcement are Bukele’s brief posts on social media. The website nayibtracker.com maintains its own account and estimates that El Salvador has lost 37% of the value of its investments in bitcoin, since the cryptocurrency began to fall in 2021. That’s the equivalent of $45 million. It is estimated that El Salvador currently has $76.5 million worth of bitcoin. As often happens in the crypto world, the website does not include information about the bitcoin owners or who manages the assets.\n\nA protest against bitcoin in El Salvador on June 1. Alex Peña (Getty Images)\n\nWhen introducing the currency to the population, the idea was that it be used in all types of transactions: from buying street food to a property. With this goal in mind, the government opened a digital wallet called Chivo, and gave every citizen the equivalent of $30 in bitcoin. But hundreds of the Chivo accounts were hacked, and the money was stolen along with the account owner’s identity.\n\nThis perhaps scared many in El Salvador. One of the benefits of cryptocurrencies is the speed with which remittances can be sent from abroad — an advantage that was promoted by the Salvadoran government. But so far this year, only 1.3% of remittances have been transferred using digital wallets that use cryptocurrencies, according to the most recent data from the central bank. In comparison, 4% of remittances sent to Mexico are made through cryptocurrencies, according to the specialized firm Chainalysis.\n\nLast week, an investment research firm called Ark Invest made waves on social media when it published a report claiming that bitcoin adoption in Argentina surpasses that of El Salvador. “Understandably, the citizens of El Salvador prefer to transact in USD, which became legal tender in El Salvador in 2001 and has protected purchasing power from the inflation and devaluations that have ravaged other countries in the region,” stated the report signed by analyst David Puell. “In contrast, the price of bitcoin has been quite volatile in the face of growing pains as it endeavors to evolve into a monetary system with increased liquidity and global adoption.”\n\n“This news makes a lot of sense,” said Mónica Taher, vice president at RocketFuel, a global cryptocurrency payment processing company. Until October, Taher was the director of technology and innovation for the Bukele government’s business promotion agency, InvestSV. In addition to the size difference between Argentina and El Salvador, a cluster of technology companies has been growing organically in Argentina for at least two decades, and today are industry leaders, explains Taher.\n\nDuring her time in the government, she was in charge of attracting and guiding companies interested in operating in El Salvador. “An avalanche of companies came — we didn’t know what to do with them all,” recalls the former official. “Everyone was excited, especially the first year, and it was very nice to see a kind of reverse migration: it wasn’t the Salvadorans who were migrating to the United States, now it was foreigners from every country in the world there were who decided to move.”\n\nSeeing the interest of companies in El Salvador, the Central African Republic announced in April 2022 that it would make bitcoin and other cryptocurrencies legal tender. But their experiment failed, and less than a year later Congress reversed the legislation.\n\n“The goal, for me, of using bitcoin in El Salvador is to increase people’s economic freedom so that there are no intermediaries and, within that, to empower women to control their own finances,” said Taher. But “if there is no coherent educational process, mass adoption will take a long time in the country,” she warned.\n\nA few months ago, the Bukele government granted Bitfinix — a company founded in Hong Kong in 2012 — the country’s first license for digital assets, such as equities and bonds. Bitfinix and its sister company, Thether, had to stop operating in New York in February 2021, when the New York Attorney General’s Office declared that they “recklessly and unlawfully covered-up” losses of $850 million. A few months later, U.S. regulators fined Tether Holdings $41 million for making untrue or misleading statements by claiming that its token was a stablecoin, with its value pegged to a fiat currency.\n\nThe move to bitcoin has been an undeniable success for El Salvador, says Andrés Engler, a journalist specialized in cryptocurrencies and former editor for Latin America of the crypto website Coindesk. “In terms of press, it put Bukele in the headlines,” he said. “That is indisputable. With respect to the crypto industry, El Salvador today is a strong figure. If you ask anyone in the industry about El Salvador, they will recognize it and will probably name Bukele straight away. From that point of view, it seems to have been effective.”\n\nSign up for our weekly newsletter to get more English-language news coverage from EL PAÍS USA Edition"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL2VuZ2xpc2guZWxwYWlzLmNvbS9pbnRlcm5hdGlvbmFsLzIwMjMtMDktMDIvdHdvLXllYXJzLW9mLWJpdGNvaW4taW4tYnVrZWxlcy1lbC1zYWx2YWRvci1hbi1vcGFxdWUtZXhwZXJpbWVudC13aXRoLWEtbGl0dGxlLXVzZWQtY3VycmVuY3kuaHRtbNIBpAFodHRwczovL2VuZ2xpc2guZWxwYWlzLmNvbS9pbnRlcm5hdGlvbmFsLzIwMjMtMDktMDIvdHdvLXllYXJzLW9mLWJpdGNvaW4taW4tYnVrZWxlcy1lbC1zYWx2YWRvci1hbi1vcGFxdWUtZXhwZXJpbWVudC13aXRoLWEtbGl0dGxlLXVzZWQtY3VycmVuY3kuaHRtbD9vdXRwdXRUeXBlPWFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Sep 2023 07:00:00 GMT",
        "title": "Two years of bitcoin in Bukele’s El Salvador: An opaque experiment with a little-used currency - EL PAÍS USA",
        "content": "Two years ago, El Salvador stunned the world by becoming the first country to make bitcoin an official currency. Journalists from around the world traveled to the Central American nation of 6.3 million people, known for its beaches and its diaspora in the United States, to document the new monetary reality. September 7, 2021, when the new cryptocurrency law came into effect, was an atypical moment in which a small country briefly held the attention of the entire world.\n\nInterest has waned, but the experiment continues. It is tempting to classify the Bitcoin Law — the name for the legislative project that made the digital asset legal tender — as a success or a failure. But nothing is so simple in President Nayib Bukele’s El Salvador. The country’s decision to make bitcoin an official currency is difficult to analyze because it is an opaque experiment with several different objectives: financial inclusion, revenue for the public treasury and building the reputation of the president.\n\nThe experiment began with several bitcoin purchases by the Bukele government. The exact amount of bitcoin that El Salvador has in its international reserves is not known, since the government does not keep a public record. The closest thing that exists to a purchase announcement are Bukele’s brief posts on social media. The website nayibtracker.com maintains its own account and estimates that El Salvador has lost 37% of the value of its investments in bitcoin, since the cryptocurrency began to fall in 2021. That’s the equivalent of $45 million. It is estimated that El Salvador currently has $76.5 million worth of bitcoin. As often happens in the crypto world, the website does not include information about the bitcoin owners or who manages the assets.\n\nA protest against bitcoin in El Salvador on June 1. Alex Peña (Getty Images)\n\nWhen introducing the currency to the population, the idea was that it be used in all types of transactions: from buying street food to a property. With this goal in mind, the government opened a digital wallet called Chivo, and gave every citizen the equivalent of $30 in bitcoin. But hundreds of the Chivo accounts were hacked, and the money was stolen along with the account owner’s identity.\n\nThis perhaps scared many in El Salvador. One of the benefits of cryptocurrencies is the speed with which remittances can be sent from abroad — an advantage that was promoted by the Salvadoran government. But so far this year, only 1.3% of remittances have been transferred using digital wallets that use cryptocurrencies, according to the most recent data from the central bank. In comparison, 4% of remittances sent to Mexico are made through cryptocurrencies, according to the specialized firm Chainalysis.\n\nLast week, an investment research firm called Ark Invest made waves on social media when it published a report claiming that bitcoin adoption in Argentina surpasses that of El Salvador. “Understandably, the citizens of El Salvador prefer to transact in USD, which became legal tender in El Salvador in 2001 and has protected purchasing power from the inflation and devaluations that have ravaged other countries in the region,” stated the report signed by analyst David Puell. “In contrast, the price of bitcoin has been quite volatile in the face of growing pains as it endeavors to evolve into a monetary system with increased liquidity and global adoption.”\n\n“This news makes a lot of sense,” said Mónica Taher, vice president at RocketFuel, a global cryptocurrency payment processing company. Until October, Taher was the director of technology and innovation for the Bukele government’s business promotion agency, InvestSV. In addition to the size difference between Argentina and El Salvador, a cluster of technology companies has been growing organically in Argentina for at least two decades, and today are industry leaders, explains Taher.\n\nDuring her time in the government, she was in charge of attracting and guiding companies interested in operating in El Salvador. “An avalanche of companies came — we didn’t know what to do with them all,” recalls the former official. “Everyone was excited, especially the first year, and it was very nice to see a kind of reverse migration: it wasn’t the Salvadorans who were migrating to the United States, now it was foreigners from every country in the world there were who decided to move.”\n\nSeeing the interest of companies in El Salvador, the Central African Republic announced in April 2022 that it would make bitcoin and other cryptocurrencies legal tender. But their experiment failed, and less than a year later Congress reversed the legislation.\n\n“The goal, for me, of using bitcoin in El Salvador is to increase people’s economic freedom so that there are no intermediaries and, within that, to empower women to control their own finances,” said Taher. But “if there is no coherent educational process, mass adoption will take a long time in the country,” she warned.\n\nA few months ago, the Bukele government granted Bitfinix — a company founded in Hong Kong in 2012 — the country’s first license for digital assets, such as equities and bonds. Bitfinix and its sister company, Thether, had to stop operating in New York in February 2021, when the New York Attorney General’s Office declared that they “recklessly and unlawfully covered-up” losses of $850 million. A few months later, U.S. regulators fined Tether Holdings $41 million for making untrue or misleading statements by claiming that its token was a stablecoin, with its value pegged to a fiat currency.\n\nThe move to bitcoin has been an undeniable success for El Salvador, says Andrés Engler, a journalist specialized in cryptocurrencies and former editor for Latin America of the crypto website Coindesk. “In terms of press, it put Bukele in the headlines,” he said. “That is indisputable. With respect to the crypto industry, El Salvador today is a strong figure. If you ask anyone in the industry about El Salvador, they will recognize it and will probably name Bukele straight away. From that point of view, it seems to have been effective.”\n\nSign up for our weekly newsletter to get more English-language news coverage from EL PAÍS USA Edition"
    }
]