[
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTI3L21pY3Jvc3RyYXRlZ3ktcGF5cy1vZmYtYml0Y29pbi1iYWNrZWQtbG9hbi1mcm9tLXNpbHZlcmdhdGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "MicroStrategy Pays Off Bitcoin-Backed Loan From Silvergate - Bloomberg",
        "content": "MicroStrategy Inc., the biggest corporate owner of Bitcoin, paid off the remainder of its $205 million Bitcoin-backed loan from Silvergate Bank with proceeds from the sale of shares and purchased about $150 million more of the cryptocurrency.\n\nThe loan from the failed crypto-friendly bank was retired about two years early, releasing about 34,619 coins that were held as collateral, the enterprise-software maker said in a US Securities and Exchange Commission filing on Monday. MicroStategy disclosed that it raised $339.4 million this year through the sale of shares."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTI3L2NyeXB0b2N1cnJlbmNpZXMtZGVjbGluZS1hZnRlci1iaW5hbmNlLWZvdW5kZXItc3VlZC1ieS1jZnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Drops as CFTC Sues Binance Over Regulation Violations - Bloomberg",
        "content": "Bitcoin touched a 10-day low and smaller cryptocurrencies also declined after Binance Holdings Ltd. was sued by the US Commodity Futures Trading Commission for allegedly breaking trading and derivatives rules.\n\nBinance, which exploded onto the crypto scene in 2017 and almost immediately took on and surpassed larger rivals, saw its market share surge after last November’s collapse of FTX. It accounts for about 60% of crypto spot and derivatives trading volume. The company has argued that the global exchange is not subject to US jurisdiction because it has no headquarters."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9taWNyb3N0cmF0ZWd5LXBheXMtb2ZmLXNpbHZlcmdhdGUtbG9hbi0xMjI1NDI2OTYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "MicroStrategy Pays Off Silvergate Loan, Buys More Bitcoin - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nMicroStrategy (MSTR), a software company that was co-founded by crypto advocate Michael Saylor and that holds a large amount of bitcoin (BTC), prepaid the remaining principal on its $205 million loan from failed, crypto-focused Silvergate Bank, according to a filing with the U.S. Securities and Exchange Commission on Friday.\n\nIn addition, MicroStrategy said it purchased another 6,455 bitcoins for roughly $150 million (about $23,238 per coin) over the past five weeks.\n\nThe loan payoff was made last Friday and totaled $161 million. As part of the satisfaction of the loan, 34,619 bitcoins held as collateral were returned to MicroStrategy's custody. The company took out the loan last March.\n\nThe acquisition of another 6,455 bitcoins brings MicroStrategy's holdings up to 138,955 bitcoins purchased at an average price of $29,817 each and worth roughly $3.88 billion at the current bitcoin price of $27,900.\n\nMicroStrategy also disclosed that it has raised $339.4 million this year through the sale of its shares and used the proceeds to pay back the loan from Silvergate.\n\nShares of MicroStrategy were up 0.9% premarket."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDMvMjcvYml0Y29pbi1kcm9wcy1hZnRlci1jZnRjLXN1ZXMtY3J5cHRvLWV4Y2hhbmdlLWJpbmFuY2UtZm9yLWFsbGVnZWRseS1icmVha2luZy10cmFkaW5nLXJ1bGVzLmh0bWzSAYMBaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDMvMjcvYml0Y29pbi1kcm9wcy1hZnRlci1jZnRjLXN1ZXMtY3J5cHRvLWV4Y2hhbmdlLWJpbmFuY2UtZm9yLWFsbGVnZWRseS1icmVha2luZy10cmFkaW5nLXJ1bGVzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin falls after CFTC sues crypto exchange Binance for allegedly breaking trading rules - CNBC",
        "content": "A worsening macroeconomic climate and the collapse of industry giants such as FTX and Terra have weighed on bitcoin's price this year.\n\nCryptocurrencies dropped on Monday morning after the CFTC sued Binance, the biggest crypto exchange in the world, for allegedly violating trading rules.\n\nThe price of bitcoin slid 3% to $26,955.61, according to Coin Metrics. Ether fell 3.5% to $1,704.56.\n\nIn a court filing, the CFTC, or the Commodity Futures and Trading Commission, said Binance violated eight provisions of a commodities trading law \"designed to prevent and detect money laundering and terrorism financing.\" The lawsuit, which was filed Monday in a federal court in Chicago, has the potential to upend the exchange's operations.\n\nDessislava Aubert, an analyst at crypto data provider Kaiko, said although bitcoin's March rally had already started to slow in the last week, the down move Monday was largely driven by the news about Binance. It's \"the largest crypto exchange and any U.S. regulatory action against it will have huge implications for the industry,\" she said.\n\nThe CFTC court filing follows a CNBC report on Binance employees who have worked to subvert the exchange's compliance controls in China. Similarly, CFTC alleges that Binance has instructed its workers and customers to circumvent these controls.\n\n\"Many knew Binance had a bullseye on its back, but this is still unnerving some crypto traders,\" said Ed Moya, an analyst at Oanda. \"Binance's success is needed to ensure a good part of the cryptoverse can grow.\"\n\nCrypto exposed equities suffered from the news too. Coinbase and Microstrategy each fell 10%. Miners Marathon Digital, Hut 8 and Riot Platforms lost about 8% each.\n\nThe losses came in tandem with a surge in bond yields, which pushed the tech-heavy Nasdaq Composite down 0.6%. Rising rates make future profits, like those promised by growth-oriented companies, less attractive."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nZXJtYW4tYmFua3MtYWNjZXNzLWJpdGNvaW4tdHJhZGluZy1wbGF0Zm9ybS0xMjQ2MjYwMjUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 27 Mar 2023 07:00:00 GMT",
        "title": "German banks get access to bitcoin trading platform - Yahoo Finance",
        "content": "A new platform will allow 1,200 German banks the ability to offer bitcoin trading to their customers. Photo: Getty (nantonov via Getty Images)\n\nA new platform has been launched that allows 1,200 German banks to offer bitcoin (BTC-USD) trading to their customers.\n\nDWPBank, a leading Frankfurt-based bank, has announced plans to integrate bitcoin into its banking systems.\n\nThe digital asset platform, called wpNex, will allow 1,200 affiliated German banks to offer their customers the ability to buy and sell bitcoin while carrying out online banking activities, according to DWPBank.\n\nRead more: Crypto live prices\n\n\"DWPBank wants to connect the world of traditional securities business with the world of trading digital assets,\" DWPBank said.\n\n\"To this end, it uses its central position in the German financial market with established interfaces to around 1,200 banks and savings banks and expands its portfolio to include trading and safekeeping of new assets.\"\n\nDWPBank CEO Heiko Beck said the bank planned to expand its range of services by adding other cryptocurrencies, digital assets and tokenised securities to the new platform.\n\nHe said: \"Digitised assets will become increasingly important in the future.\n\n\"That is why we are expanding our range of services in this area and focusing our portfolio more closely on the future opportunities that arise here.\"\n\nThe new digital asset platform was first trialed by MLP Banking AG, a client of DWPBank.\n\nRead more: Bitcoin price falls below $28,000 after Coinbase's SEC notice\n\nHead of account and securities settlement at MLP Banking AG Paul Utzat said: \"In our MLP client portal, it is a logical addition to the existing wealth management offering.\"\n\nGermany has been named one of the world’s most favourable countries for crypto, in a report by Coincub.\n\nIn February, another German bank, DZ Bank, also announced plans to offer bitcoin trading for its customers.\n\nDZ Bank is Germany’s second-largest bank by assets with 8,500 branch offices across the country.\n\nWatch: The reasons why UK banks are blocking crypto exchanges | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    }
]