[
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTIvMjIvc3BvdC1iaXRjb2luLWV0Zi1hcHByb3ZhbC1pcy1hcHByb2FjaGluZy1leHBlcnRzLXNheS13aGF0LXRvLWtub3cuaHRtbNIBamh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzEyLzIyL3Nwb3QtYml0Y29pbi1ldGYtYXBwcm92YWwtaXMtYXBwcm9hY2hpbmctZXhwZXJ0cy1zYXktd2hhdC10by1rbm93Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Spot bitcoin ETF approval by the SEC is approaching, experts say. What that means for investors - CNBC",
        "content": "Bitcoin investors are eagerly waiting for regulators to approve the first U.S. spot bitcoin exchange-traded fund, which could be significant for cryptocurrency investors, experts say.\n\nLast week, the price of bitcoin notched an 18-month high, climbing to $37,970, after BlackRock took first steps toward an ether ETF. The price of bitcoin has more than doubled since the start of 2023, but it's still well below its November 2021 peak.\n\nAt least nine asset management firms — including BlackRock, WisdomTree, Valkyrie and others — are waiting for Securities and Exchange Commission approval to issue a spot bitcoin ETF. Experts say the first approval could come early in 2024.\n\nMore from ETF Strategist:\n\n3 big reasons exchange-traded funds went 'mainstream'\n\nHere's how to use ETFs in 3 popular investing strategies\n\nETFs among top 3 products more popular since 2020\n\n\"For ETF investors, this would be the best product on the market,\" said Bryan Armour, director of passive strategies research for North America at Morningstar. \"All the other options right now have flaws to varying degrees.\"\n\nCurrently, U.S. investors can buy bitcoin futures ETFs, which own bitcoin futures contracts, or agreements to buy or sell the asset later for an agreed-upon price. The long-awaited bitcoin spot ETF would invest in the digital asset directly."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTIvMjIvc3BvdC1iaXRjb2luLWV0Zi1hcHByb3ZhbC1pcy1hcHByb2FjaGluZy1leHBlcnRzLXNheS13aGF0LXRvLWtub3cuaHRtbNIBamh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzEyLzIyL3Nwb3QtYml0Y29pbi1ldGYtYXBwcm92YWwtaXMtYXBwcm9hY2hpbmctZXhwZXJ0cy1zYXktd2hhdC10by1rbm93Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Spot bitcoin ETF approval by the SEC is approaching, experts say. What that means for investors - CNBC",
        "content": "Bitcoin investors are eagerly waiting for regulators to approve the first U.S. spot bitcoin exchange-traded fund, which could be significant for cryptocurrency investors, experts say.\n\nLast week, the price of bitcoin notched an 18-month high, climbing to $37,970, after BlackRock took first steps toward an ether ETF. The price of bitcoin has more than doubled since the start of 2023, but it's still well below its November 2021 peak.\n\nAt least nine asset management firms — including BlackRock, WisdomTree, Valkyrie and others — are waiting for Securities and Exchange Commission approval to issue a spot bitcoin ETF. Experts say the first approval could come early in 2024.\n\nMore from ETF Strategist:\n\n3 big reasons exchange-traded funds went 'mainstream'\n\nHere's how to use ETFs in 3 popular investing strategies\n\nETFs among top 3 products more popular since 2020\n\n\"For ETF investors, this would be the best product on the market,\" said Bryan Armour, director of passive strategies research for North America at Morningstar. \"All the other options right now have flaws to varying degrees.\"\n\nCurrently, U.S. investors can buy bitcoin futures ETFs, which own bitcoin futures contracts, or agreements to buy or sell the asset later for an agreed-upon price. The long-awaited bitcoin spot ETF would invest in the digital asset directly."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9kaXNjb3VudHMtbm9uLWJpdGNvaW4tY3J5cHRvLXRydXN0cy0xNDAwMDA2MzUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Discounts on Non-Bitcoin Crypto Trusts Narrow - Yahoo Finance",
        "content": "The gap between the price of the $23 billion Grayscale Bitcoin Trust (GBTC) and its net asset value narrowed to 11% last week as hopes for a spot bitcoin ETF reached a fever pitch. But GBTC isn’t the only quasi-closed-end cryptocurrency fund seeing its discount drop.\n\nThe competing Osprey Bitcoin Trust (OBTC), which has $100 million in assets under management, is trading only 7% below its net asset value, the smallest discount in over a year.\n\nThe difference between the price of the $6.1 billion Grayscale Ethereum Trust (ETHE) and its NAV is now 16%, down from 60% in December, while the gap between the price of the $227 million Grayscale Ethereum Classic Trust (ETCG) and its NAV is now 44%, down from 77% in December.\n\nMeanwhile, the $106 million Grayscale Litecoin Trust (LTCN) and the $70 million Grayscale Bitcoin Cash Trust (BCHG) are trading with premiums of 5% and 2%, respectively, after sporting discounts of around 60% at the start of the year.\n\nThe fast-disappearing discounts on these trusts is a reflection of investors’ expectations that the launch of a spot bitcoin ETF is imminent.\n\nA successful ETF conversion would open GBTC up to redemptions, instantly bringing its market price in-line with its net asset value.\n\nWhat Comes After Bitcoin?\n\nBut a potential greenlight for spot bitcoin ETFs would have a direct impact only on GBTC. The ability to arbitrage away the discounts on the other trusts would still be lacking.\n\nOf course, investors probably believe that a spot bitcoin ETF would be followed by spot ETFs tied to other cryptocurrencies.\n\nYou can certainly make the case that a spot ether ETF won’t be far behind a spot bitcoin ETF. Ethereum futures trade on the Chicago Mercantile Exchange and the Securities and Exchange Commission recently okayed ETFs tied to those futures contracts. A spot ether ETF isn’t much of a stretch.\n\nWhat is more of a stretch are ETFs tied to other cryptocurrencies, such as litecoin and bitcoin cash. There are no futures contracts on the CME tied to those cryptocurrencies, and so the SEC can—and likely will—make the case that these should be treated differently than bitcoin and ether.\n\nStory continues\n\nIt’s hard to imagine a litecoin, bitcoin cash or dogecoin ETF launching anytime soon.\n\nAnd that’s what makes the price action in LTCN and BCHG ironic. They’ve been acting even better than GBTC and ETHE, even though a conversion of those trusts into ETFs is still far-fetched.\n\n\n\n\n\nPermalink | © Copyright 2023 etf.com. All rights reserved"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY2JvZS10by1sYXVuY2gtbGV2ZXJhZ2VkLWJpdGNvaW4tZnV0dXJlcy10cmFkaW5nLWluLWphbnVhcnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "CBOE to Launch Leveraged Bitcoin Futures Trading in January - Nasdaq",
        "content": "Chicago Board Options Exchange (Cboe) Digital announced today its plans to introduce trading and clearing in margin futures on Bitcoin, commencing January 11, 2024. This move positions Cboe Digital as the first U.S. regulated cryptocurrency native exchange and clearinghouse to facilitate both spot and leveraged derivatives trading on a unified platform, according to the announcement.\n\nInitially offering financially settled margined contracts on Bitcoin, Cboe Digital plans to diversify its product suite to include physically delivered products, pending regulatory approvals. The margin model is designed to enhance capital efficiency, enabling customers to engage in futures trading without the requirement of posting the full collateral upfront.\n\nThe unified spot and derivatives trading platform provided by Cboe Digital aims to streamline customer access to both markets, unlocking opportunities for increased capital and operational efficiencies.\n\nThe upcoming launch of margin futures will be supported by other firms in the cryptocurrency and traditional financial sectors, including B2C2, BlockFills, CQG, Cumberland DRW, Jump Trading Group, Marex, StoneX Financial, Talos, tastytrade, Trading Technologies, and Wedbush.\n\nJohn Palmer, President of Cboe Digital, expressed gratitude for the support from industry partners, stating, \"Our upcoming launch of margin futures represents a significant milestone for Cboe Digital, and we are grateful to have the support of such a remarkable group of industry partners who share our commitment to building trusted and transparent crypto markets. Futures have long served as valuable hedging instruments in the traditional financial markets, and we couldn't be more excited to extend access to this tool further into the digital assets markets and offer margined trading for our customers. We believe derivatives will foster additional liquidity and hedging opportunities in crypto and represent the next critical step in this market's continued growth.\"\n\nThe planned margin futures launch aligns with Cboe Digital's existing offerings of Bitcoin, other cryptocurrencies, and stablecoin trading on its spot crypto market. Contract margin requirements for the new futures will be published daily on Cboe Digital's website, accompanied by standardized portfolio analysis of risk (SPAN) compatible risk parameter files for replicable margin calculations.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvZGlzcnVwdGl2ZS10ZWNoLXRoZW1lLW9mLXRoZS13ZWVrJTNBLXRoZS1iaXRjb2luLWVjb3N5c3RlbdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 13 Nov 2023 08:00:00 GMT",
        "title": "Disruptive Tech Theme of the Week: The Bitcoin Ecosystem - Nasdaq",
        "content": "Some great content has already been published on what’s going on in bitcoin right now on VettaFi’s Crypto Channel, including an insightful article from VettaVoice contributor Jennifer Nash when bitcoin broke $35,000. Here we are, just a brief time later, andbitcoin pricesare now above the $37,000, marking its highest level since May of 2022.\n\nWhat’s Behind Bitcoin’s Move Higher?\n\nThe factors behind its recent price move are multifaceted.\n\nEnd of Rate Hike Cycle - Hopes that the Federal Reserve finishes increasing interest rates sparks a rally in all risk-sensitive assets. Digital Gold – Bitcoin’s price dynamic is somewhat unique in that it also benefits from global instability along with other hard assets like gold. The conflict in the Middle East has sparked a round of “digital gold” trades as a safe-haven, store-of-value play. Tight Supply – The surge in near-term demand comes at a time when bitcoin miners are selling as much as they can mine these days ahead of the so-called “halving” next year, and long-term HODL’ers (Hold on for Dear Lifers) are unwilling to give up their tokens. Top miners sold more tokens than they produced last month, cashing in on October’s price rally, creating a bitcoin liquidation-to-production ratio last month of 104%. April 2024 Halving – April’s “halving,” as the name implies, will reduce the amount of tokens going forward, making the reward less valuable for miners after the halving but more valuable to long-term holders due to a halving of supply. Historically, most of bitcoin’s gains come directly after halvings, which only occur every four years. Spot ETF Filings – Certainly another factor in bitcoin’s recent rise is the increasing likelihood that the SEC will approve a spot version of a U.S. Bitcoin ETF, creating more demand at a time of limited supply. And a U.S. spot ether approval could be in the works as well.\n\nCrypto Spring in the Air?\n\nAll of this has led investors coming out of the Crypto Winter to be hopeful that Crypto “Spring” is in the air. For those unfamiliar with the seasonal analogies, the four phases of cryptocurrency prices correspond to the four seasons of the year. During the period preceding each halving, the price of bitcoin generally recovers from its lowest price point.\n\nMorgan Stanley put out a nice checklist to help investors identify if it is indeed a “growing season”. A 50% price increase from bitcoin’s low is one of those signals that a trough level has been reached, but as mentioned above, there are a lot more dynamics in play here external to seasonality. Over the last year, bitcoin and Ethereum pricing are up considerably, up 98% and 59%, but regulatory uncertainty remains.\n\nWhen Will We Get a Spot Bitcoin ETF?\n\nWe are currently in an eight-day window between November 9-17, where potentially all 12 spot Bitcoin ETF filings could be approved by the SEC, according to Bloomberg ETF analysts James Seyffart and Eric Balchunas, including Grayscale’s conversion of its GBTC trust product. Grayscale has been in talks with the SEC over the conversion since winning its court battle with the SEC on August 29. In a new research note, James Seyffert predicts a 90% chance by January 10 of a spot Bitcoin ETF approval.\n\nETF Plays for Now\n\nDigital Assets\n\nBesides buying bitcoin yourself on an exchange like Coinbase, the easiest way to get direct bitcoin exposure is through futures-based ETF products like the Proshares Bitcoin Strategy ETF (BITO), which has attracted assets of more than $1.2 billion since its launch in October 2021. Since the launch of BITO, other bitcoin futures products have come to market, such as the VanEck Bitcoin Strategy ETF (XBTF) and even a combo ETF strategy, the Valkyrie Bitcoin and Ether Strategy ETF (BTF), which holds both bitcoin and Ether futures.\n\nIn addition to bitcoin and Ethereum “pure plays”, there are multi-asset combinations such as the Amplify Transformational Data Sharing ETF (BLOK) and the Global X Blockchain & Bitcoin Strategy ETF (BITS), which own both blockchain stocks and either non-US listed crypto ETFs and/or futures.\n\nBlockchain ETFs\n\nCrypto is an application on the blockchain, just like e-mail is an application on the Internet. There are many blockchain-focused ETFs as well. In addition to the actively managed BLOK, there is, in order of assets under management, the First Trust Indxx Innovative Transaction & Process ETF (LEGR), the Bitwise Crypto Industry Innovators (BITQ), the Global X Blockchain ETF (BKCH), and the Siren NASDAQ Nex Gen Economy ETF (BLCN), to name a few.\n\nA reminder to new investors in the space: “Blockchain” was not allowed to be used in fund names due to SEC rules around naming conventions when many of these first ETF products launched during crypto’s last “spring phase” in early 2018.\n\nCrypto Mining ETFs\n\nMany of the blockchain-themed ETFs also own crypto mining stocks, but a purer play on that theme is the Invesco Alerian Galaxy Crypto Economy ETF (SATO) based on VettaFi’s CRYPTO Index or the VanEck Digital Transformation ETF (DAPP). Among its top 10 holdings are crypto miners like Bitfarms (BITF), Marathon Digital Holdings (MARA), Riot Platforms (RIOT), Cipher Mining (CIFR), and Hive Digital Technology (HIVE).\n\nAnother top holding in both of these ETFs is MicroStrategy (MSTR), which had a big bet on bitcoin on its balance sheet that appears to have paid off with a $1.2 billion profit. But the company is not taking profits. Under controversial CEO Michael Saylor, the company is buying more.\n\nRegardless of who is right in the short term, the crypto bulls or bears, and/or what crypto season we are in, cryptocurrency as a financial asset appears here to stay for the long-term. It is another disruptive theme for investors to consider, along with technologies like blockchain that support its growing applications and use cases.\n\nFor more news, information, and strategy, visit the Disruptive Technology Channel.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]