[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTAvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLW9wZW5zLXdlZWstZGVmZW5kaW5nLTMway1zdXBwb3J0LWxldmVsL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTAvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLW9wZW5zLXdlZWstZGVmZW5kaW5nLTMway1zdXBwb3J0LWxldmVsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jul 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Opens Week Defending $30K Support Level - CoinDesk",
        "content": "DYdX isn’t a new platform, but there’s renewed interest in it as the Securities and Exchange Commission (SEC) goes after its centralized counterparts. The platform isn’t without its growing pains, and the question at the end of the day will be if its new technology stack is the cure. Its token is down roughly 6% in the last month as the price of ether is up 1.3%, meaning the market is taking a cautious look at this as the exchange prepares for its next chapter."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcnRodXItaGF5ZXMtYml0Y29pbi1haS1uYXRpdmUtMDIyMDM2MTcxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jul 2023 07:00:00 GMT",
        "title": "Arthur Hayes: Bitcoin Will Be AI's Native Currency - Yahoo Finance",
        "content": "Arthur Hayes: Bitcoin Will Be AI’s Native Currency\n\nArthur Hayes Claimed That Bitcoin Is The Best Cryptocurrency For AI\n\nArtificial intelligence (AI) will need a digital, automated and always-on payment system to \"stay alive,\" and Bitcoin will be the most sensible currency for AI to utilize, according to Arthur Hayes, co-founder of BitMEX.\n\nAs the analog banking sector cannot offer the same degree of service, Hayes proposed that a blockchain-based payment system would be necessary to provide the necessary digital infrastructure.\n\nIn order to reduce the chance of deplatforming, he also emphasized the need for a payment rail that is censorship-resistant and has apparent and obvious standards. Because it is censorship-resistant and limited to 21 million coins, which establishes its worth over time, Hayes claimed that Bitcoin is the best cryptocurrency for AI.\n\nStablecoins, on the other hand, can be frozen and censored by their issuer, making them less suitable for AI. Hayes dismissed Ethereum as a contender for AI's currency of choice, arguing that it has other applications, unlike Bitcoin and fiat currency, which are \"just money.\""
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcnRodXItaGF5ZXMtYml0Y29pbi1haS1uYXRpdmUtMDIyMDM2MTcxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jul 2023 07:00:00 GMT",
        "title": "Arthur Hayes: Bitcoin Will Be AI's Native Currency - Yahoo Finance",
        "content": "Arthur Hayes: Bitcoin Will Be AI’s Native Currency\n\nArthur Hayes Claimed That Bitcoin Is The Best Cryptocurrency For AI\n\nArtificial intelligence (AI) will need a digital, automated and always-on payment system to \"stay alive,\" and Bitcoin will be the most sensible currency for AI to utilize, according to Arthur Hayes, co-founder of BitMEX.\n\nAs the analog banking sector cannot offer the same degree of service, Hayes proposed that a blockchain-based payment system would be necessary to provide the necessary digital infrastructure.\n\nIn order to reduce the chance of deplatforming, he also emphasized the need for a payment rail that is censorship-resistant and has apparent and obvious standards. Because it is censorship-resistant and limited to 21 million coins, which establishes its worth over time, Hayes claimed that Bitcoin is the best cryptocurrency for AI.\n\nStablecoins, on the other hand, can be frozen and censored by their issuer, making them less suitable for AI. Hayes dismissed Ethereum as a contender for AI's currency of choice, arguing that it has other applications, unlike Bitcoin and fiat currency, which are \"just money.\""
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ibGFja3JvY2stZXRmLWJpdGNvaW4tdXMtYnV5aW5nLWdldC1vZmYtemVyb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jul 2023 07:00:00 GMT",
        "title": "BlackRock ETF stirs US Bitcoin buying as research says 'get off zero' - Cointelegraph",
        "content": "Bitcoin (BTC) will suck in “all prosperity gains” in future and leave behind those who have no exposure as a result, a new prediction says.\n\nIn a Twitter thread on July 8, investor Luke Broyles delivered a bold vision of how Bitcoin would become “society’s base money.”\n\nInvestor tells would-be Bitcoin buyers: “Get off zero”\n\nWhat started off as a commentary on how artificial intelligence (AI) is welcoming BTC soon became a dramatic outline of how it should end up as the world’s go-to currency.\n\nFor Broyles, Bitcoin’s key attribute — a fixed, immutable supply — makes it unique as a future-proof asset.\n\n“Every innovation (even AI) will rush as quickly as possible to competitively force prices down. Every country will rush as quickly as possible to print currency to force prices up and sustain credit markets. Both of these forces will increase in speed,” he wrote.\n\nBTC, meanwhile, will remain constant in its emission, and as a result, even a tiny exposure is a world away from nothing at all.\n\n“We have less in common with the future than the past... Bitcoin is trading for hundreds of millions of political currency units in many nations already. But the ACTUAL big deal is that all prosperity gains from all future innovations will flow into society's base money- BTC,” Broyles continued.\n\n“This is why it is CRUCIAL for people to ‘get off zero.’ Saying ‘Bitcoin is digital gold’ is like saying a locomotive is an iron horse.”\n\nBitcoin supply dynamics data. Source: Luke Broyles/Twitter\n\nHis perspective chimes with that recently published by Arthur Hayes, former CEO of crypto derivatives exchange, BitMEX.\n\nAs Cointelegraph reported, Hayes believes that AI will instinctively choose BTC as its financial lifeblood, again thanks to its unique qualities compared to other assets, including gold.\n\nAs a result, AI alone could push the BTC price past $750,000 per token.\n\nBTC supply dominance hits “inflection point”\n\nThe race to secure the remaining BTC supply, meanwhile, may have already started.\n\nRelated: BTC price remains ‘undoubtedly bullish’ as $30K Bitcoin buyers emerge\n\nBroyles argued that Bitcoin liquidity in fact peaked during the March 2020 cross-market crash, and will never retrace its steps since.\n\nWhen the world’s largest asset manager, BlackRock, announced a Bitcoin spot-based exchange-traded fund (ETF) filing, meanwhile, U.S. BTC activity rocketed.\n\nAs noted by on-chain analytics firm Glassnode, the U.S. appears to be reassessing its own exposure.\n\n“Following the Blackrock Bitcoin ETF request announcement on June 15th, the share of Bitcoin supply held/traded by US entities has experienced a notable uptick, marking a potential inflection point in supply dominance if the trend is sustained,” it commented on July 8.\n\nAn accompanying chart showed the differences in regional BTC supply ownership change.\n\nBTC Regional Year-over-Year Supply Change annotated chart. Source: Glassnode/Twitter\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXN0YXlzLWFib3ZlLXVzLTMwLTAxNTE0MTQzNS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 09 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin stays above US$30,000; ETF optimism dampens; further rate hikes expected - Yahoo Finance",
        "content": "Bitcoin dipped in Monday morning trading in Asia but held above the US$30,000 support level. Ether edged lower along with most other top 10 non-stablecoin cryptocurrencies, as anticipation of further interest rate hikes in the U.S. reduces appetite for risk across markets. Meanwhile, a JPMorgan report claims that the recent flurry of Bitcoin exchange-traded fund (ETF) applications in the U.S. may not be the game changer that some expect. This is reducing some of the optimism surrounding ongoing Bitcoin ETF applications by major Wall Street names, including BlackRock.\n\nCryptos fall as ETF hype cools\n\nBitcoin dropped 0.32% over the last 24 hours to US$30,157 at 07:40 a.m. in Hong Kong to post a weekly loss of 1.33%, according to data from CoinMarketCap. The world’s leading cryptocurrency traded in the lower US$30,000 range over the weekend.\n\nEther edged 0.09% lower to US$1,862 and lost 3.71% for the week.\n\nMost other top 10 non-stablecoin cryptocurrencies also logged losses in the past 24 hours. The exception was Polygon’s Matic token, which gained 1.15% to US$0.6876. It added 1.07% over the past seven days.\n\nWhile multiple Bitcoin ETF applications in the past month have stirred optimism in the crypto market, their approval may not prove as transformational as some Bitcoin advocates expect, claimed a JP Morgan report on Friday. Similar products have existed in Canada and Europe but received limited inflows, the report suggests.\n\nDespite this element of doubt creeping in, Bitcoin whales remain bullish on the token. Blockchain data tracker Santiment noted in a tweet on Sunday that addresses holding 10 to 10,000 Bitcoin had added a further 71,000 Bitcoin totalling approximately US$2.15 billion since July 17.\n\n🦈🐳 #Bitcoin's sharks and whales aren't showing any signs of slowing down, even with prices beginning to get \"boring\" in this $30k to $31k range. Since June 17th, 10 to 10k $BTC addresses have accumulated 71k more coins, equating to $2.15 billion. https://t.co/poBVnszbZY pic.twitter.com/XxYsHWCFRL — Santiment (@santimentfeed) July 8, 2023\n\n“Investors sentiment seems to — still — be slightly bolstered by Blackrock’s CEO Larry Fink’s comment and the prospect that such an openness to the asset class increases the chances of a spot BTC ETF,” said Justin d’Anethan, head of APAC business development at Belgium-based crypto market-maker Keyrock.\n\nStory continues\n\n“It’s worth noting that while far off, the pile up of ETF applications hints at the fact that, eventually, we will see one and, once we do, other ETFs like an ETH-denominated one might see the light of day,” d’Anethan added.\n\nCrypto exchange BingX announced on Saturday it would support Polygon blockchain’s Indore upgrade, which it said would improve the performance of the Polygon network. The move is likely to take effect from July 11.\n\nFounded in 2018 and headquartered in Singapore, BingX said it provides services in over 100 countries and regions, with over 5 million users, according to the press release.\n\nThe total cryptocurrency market cap was unchanged in the past 24 hours at US$1.18 trillion, while crypto trading volume dipped 0.22% to US$19.74 billion, according to CoinMarketCap data.\n\nDead cat bounce for NFT collections\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe main Forkast 500 NFT index fell 0.73% in the 24 hours to 10:00 a.m. in Hong Kong to 2,756.26, down 0.97% for the week. Forkast’s Ethereum, Polygon and Cardano NFT market indices also logged drops, while Solana’s index inched higher.\n\n“Over the past few days the NFT market buyers and farmers have found some value in NFT collections that had hit all-time low floor prices,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\nThe world’s leading NFT marketplace Blur launched its version 2 trading platform last Thursday. This introduced a new “trait bidding” feature that allows traders to bid on specific NFT traits rather than collections and receive Blur reward points.\n\n“Blur’s new trait offers are possibly taking pressure off of floor NFT farming,” said Petscher. This could potentially lead to more price stability for Ethereum NFT projects, he added.\n\nThe floor prices of major Ethereum-based NFT collections Bored Ape Yacht Club (BAYC), Azuki and HV-MTL have all logged two-digit gains in the past seven days. However, all three are still down at least 25% for the month, according to data from CoinGecko.\n\n“The sentiment in the NFT community is that [a number of collections] likely won’t recover and that this is a dead cat bounce. I expect prices to continue to bleed out until these collections find floors in the low few hundred dollar range,” Petscher said.\n\nTotal NFT trading volume rose 10.37% to US$26.49 million as of 11:10 a.m. in Hong Kong, according to Cryptoslam data. The volume on the Ethereum blockchain edged up 1.39% to US$14.89 million, while Bitcoin volume jumped 87.65% to US$6.76 million.\n\nU.S. equities down amid rate hike concerns\n\nImage: Envato Elements\n\nU.S. stock futures traded lower as of 11:40 a.m. in Hong Kong, according to data from CNN. The three major U.S. indexes also closed lower on regular session trading Friday and logged losses for the week.\n\nMeanwhile, most main stock indexes across Asia are mixed on Monday, with China’s Shanghai Composite Index and Hong Kong’s Hang Seng edging up. South Korea’s Kospi and Japan’s Nikkei posted losses.\n\nThe U.S. employment situation summary by the Labor Department on Friday showed the economy added 209,000 jobs in June. That is the smallest monthly increase in the past two and a half years and lower than Reuters’ expectation of 225,000.\n\nHowever, wage increases and a drop in the unemployment rate indicate that the labor market is still tight. That may pave the way for further monetary tightening from the Federal Reserve within the year.\n\nThe U.S. interest rate currently sits between 5% and 5.25%. However, the CME FedWatch Tool predicts a 92.4% chance for a 25-basis-point rate increase at the Fed’s meeting on July 26. The likelihood the Fed won’t increase is at just 7.6%.\n\nAnalysts also give a 35.2% chance that the Fed will raise the rate by another 25 basis points in November, up from 9.5% a month ago.\n\nAll eyes are now on the U.S. consumer price index (CPI) ahead of its release on Wednesday. The index will give investors more insight into U.S. inflation and the Fed’s future monetary policies.\n\nAnalysts currently expect the annual inflation rate to drop to 3.1% in June, down from 4% in the previous month, as reported by Bloomberg on Sunday.\n\nMeanwhile in China, the country’s own CPI posted no annual increase in June. That is the weakest monthly showing since a drop in February 2021. The results point to a weakening recovery in the country’s post-Covid economy. Further weakening may lead to calls for increased economic stimulus measures.\n\n(Updates with equity section.)"
    }
]