[
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTE3L2xpdGVjb2luLWx0Yy1wcmljZS1yYWxsaWVzLWFmdGVyLWJpdGNvaW4tYnRjLWZlZXMtcmVhY2gtMzDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Litecoin (LTC) Price Rallies After Bitcoin (BTC) Fees Reach $30 - Bloomberg",
        "content": "A digital token launched 12 years ago as a more transaction-friendly version of Bitcoin is drawing the attention of speculators after a meme-token frenzy drove up costs on the largest blockchain.\n\nLitecoin has rallied almost 20% since May 8, when fees on Bitcoin reached a high of $30 per transaction, compared with a decline in an index of cryptocurrencies. The surge in Bitcoin fees has also driven transactions on the Litecoin blockchain to a record as users sought a cheaper alternative — without spawning a similar jump in costs."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTE3L3RldGhlci10by1wdXJjaGFzZS1iaXRjb2luLWFzLXBhcnQtb2YtcmVzZXJ2ZXMtc3RyYXRlZ3nSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Tether (USDT) to Purchase Bitcoin (BTC) in Reserves Strategy Shift - Bloomberg",
        "content": "Tether Holdings Ltd., the operator of the largest stablecoin, will invest as much as 15% of profits on a regular basis in Bitcoin as part of a strategy to diversify its reserves.\n\nStarting this month, all Bitcoin purchased will be considered as additional holdings on top of the minimum assets kept in reserve to back its USDT token and other stablecoins, the British Virgin Islands-based firm said in a statement. Stablecoins are digital tokens that aim to keep a one-to-one value with a less volatile asset like the dollar, typically by maintaining large reserves as segregated collateral."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMTcvbGl0ZWNvaW4teHJwLWFuZC1vdGhlci1hbHRjb2lucy1yaXNlLWJsdWUtY2hpcC1iaXRjb2luLWhpdHMtYS1sdWxsLmh0bWzSAWtodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNS8xNy9saXRlY29pbi14cnAtYW5kLW90aGVyLWFsdGNvaW5zLXJpc2UtYmx1ZS1jaGlwLWJpdGNvaW4taGl0cy1hLWx1bGwuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Litecoin, XRP and other altcoins rise Wednesday as 'blue chip' bitcoin hits a lull - CNBC",
        "content": "While bitcoin and ether were flat on Wednesday, altcoins rose higher.\n\nLitecoin rose 5.67% and XRP added 6%, according to Coin Metrics. The Sandbox token jumped 4%. The price of the Axie Infinity token added about 8%.\n\nAmong the Ethereum competitors, the Solana token gained 2%, Cardano's ada added 3.5% and the Polkadot token jumped 3%.\n\nOn Wednesday Ripple, the global payments company behind XRP, announced its acquisition of Metaco, a Swiss crypto custody services firm. The deal is expected to give Ripple access to clients like Citi and BNP Paribas and expand its overseas presence.\n\nCrypto price action has been relatively subdued for the past month, despite volatility coming back a bit recently due to thin liquidity in the market. Still, realized 30-day volatility for both bitcoin and ether are off their record lows of the year, according to Glassnode.\n\nWith that, some investors have shifted their attention away from bitcoin and toward smaller and newer tokens, or \"altcoins.\" This is a recurring period in the bitcoin cycle known as \"altcoin season.\" In recent months, bitcoin and ether have been regarded by many as so-called \"blue chip\" or \"flight to safety\" assets in crypto.\n\n\"Like macro markets, juggling resilient stock prices with increasingly bleak economic data points, the crypto market is also dealing with duality. There are some signs of frothiness,\" said Noelle Acheson, author of the \"Crypto is Macro Now\" newsletter.\n\nSpecifically, earlier this month ether briefly rallied and the Bitcoin blockchain saw a record high in daily transactions amid a surge in interest around memecoins and NFT-like tokens on the Bitcoin network called ordinals.\n\n\"In spite of these hints of froth, activity is low,\" Acheson added. \"Prices are down more than 10% on the month, and volumes are trending lower.\"\n\nBitcoin and ether continued to hover around the flat line Wednesday at the $27,000 and $1,800 levels, respectively."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMTcvdGV0aGVyLWJ1eXMtMjIyLW1pbGxpb24td29ydGgtb2YtYml0Y29pbi10by1iYWNrLWl0cy11c2R0LXN0YWJsZWNvaW4uaHRtbNIBbWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA1LzE3L3RldGhlci1idXlzLTIyMi1taWxsaW9uLXdvcnRoLW9mLWJpdGNvaW4tdG8tYmFjay1pdHMtdXNkdC1zdGFibGVjb2luLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Tether buys bitcoin with a portion of its net profit to back USDT stablecoin - CNBC",
        "content": "A picture taken in London shows gold-plated souvenir cryptocurrency tether, bitcoin and ethereum coins arranged beside a screen displaying a trading chart, May 8, 2022.\n\nCryptocurrency giant Tether on Wednesday said that it's going to purchase hundreds of millions of dollars' worth of bitcoin to back the world's largest stablecoin.\n\nThe company said it would invest 15% of its net profit into bitcoin to \"diversify\" the reserves that back its USDT token, which aims to stick to a 1-to-1 peg to the U.S. dollar.\n\nThat would amount to roughly $222 million, based on the company's last attestation report, which provides a breakdown of the assets that make up its USDT reserves as well as excess reserves and profits.\n\nA Tether spokesperson clarified the bitcoin it purchases would amount to only a small portion of its overall net profit, with the bulk of excess income being spent on running the business, including bank fees.\n\n\"The aim is to keep the Bitcoin portfolio value well below the size of our total excess reserves that accounted for 2.48B at the end of Q1/2023, while bitcoin holdings accounted for 1.5B,\" the Tether spokesperson said.\n\nUSDT is the largest stablecoin in the market, with a circulating supply of more than $82.8 billion, according to CoinGecko data. It competes with Circle's USD Coin and Binance's BUSD.\n\nStablecoins are used by traders to move in and out of different cryptocurrencies without converting money back into fiat currencies.\n\n\"The decision to invest in Bitcoin, the world's first and largest cryptocurrency, is underpinned by its strength and potential as an investment asset,\" Tether CTO Paolo Ardoino said in a statement.\n\n\"Bitcoin has continually proven its resilience and has emerged as a long-term store of value with substantial growth potential. Its limited supply, decentralized nature, and widespread adoption have positioned Bitcoin as a favored choice among institutional and retail investors alike.\"\n\nThe move would make Tether an even bigger holder of bitcoin — the firm already holds over $1.5 billion worth of bitcoin on its balance sheet — and follows moves from notable investors like Paul Tudor Jones and MicroStrategy boss Michael Saylor to accumulate huge stockpiles, in the belief that the token is immune to the effects of currency depreciation and inflation.\n\nAnalysts and investors have previously told CNBC that bitcoin could get a boost this year due to the influence of so-called \"whales\" — market players with significant financial firepower, which enables them to buy up huge sums of tokens.\n\nTether's methods to maintain a $1 value for its token have drawn controversy in the past because of concerns over the quality of its reserve assets. Previously, the company held a great deal of its reserves in commercial paper — a form of short-term, unsecured debt issued by companies. This is seen as less safer than other forms of debt, such as U.S. Treasury bills.\n\nTether sought to allay investor fears by rotating out of commercial paper and replacing these fund holdings with only U.S. government debt securities.\n\nIn February, the company said it had whittled down its commercial paper holdings to zero.\n\nUSDT and its issuer remain a source of contention in the crypto market. The U.S. Department of Justice is reportedly investigating executives at Tether over possible bank fraud.\n\nStablecoins were already a hot-button issue for regulators, who have been scrambling to figure out how to keep the industry in check after the demise of several notable firms in the space."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1peGVyLW9mZmVycy1zZXJ2aWNlcy1lbmhhbmNpbmctMTg1NTAwMDM3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Bitcoin Mixer Offers Services Enhancing Privacy and Anonymity in Cryptocurrency Transactions - Yahoo Finance",
        "content": "Summary: Bitcoin mixers are an essential tool for individuals who value their privacy and anonymity when conducting Bitcoin transactions.\n\nCALIFORNIA CITY, CA / ACCESSWIRE / May 17, 2023 / With the latest development, Bitcoin Mixer offers services enhancing privacy and anonymity in cryptocurrency transactions. It gives users a way to safeguard their financial information. By using Bitcoin, every transaction that the users make is recorded on the blockchain, which is a public ledger that anyone can access, and their Bitcoin transactions are not entirely anonymous. In addition, their personal information and transaction history could be traced back to the users.\n\nBitcoin Mixer has emerged as a viable solution to enhance privacy and protect users' identities.\n\nBitcoin Mixer, Wednesday, May 17, 2023, Press release picture\n\nBy utilizing the Bitcoin Mixer, transactions are visible to all users of the Bitcoin blockchain, and everybody who wants to protect their privacy uses Bitcoin mixing services. Bitcoin Mixer offers a range of services tools with multiple features that work incredibly and attract users as well, including:\n\nWhirlWind - It is a leading Bitcoin mixer that adheres to a strict no-logs policy, ensuring that once the mixing process is completed, all transaction information is permanently erased.\n\nCryptoMixer - High volume Bitcoin mixer that provides service with highly secure mixing algorithms that ensure users' privacy and anonymity. It ensures the users neither crypto-hackers nor security agencies can keep track of their financial activities.\n\nSinbad - It is a Bitcoin mixer that offers a simple and easy-to-use interface to its users. The platform works efficiently and securely deletes all transaction information within an hour once the session is completed.\n\nCoinomize - Bitcoin mixer that offers a variety of features. It helps to maintain a strict no-logs policy and offers remarkably low and flexible fees as well.\n\nMixtura - During the coin mixing process, it utilizes funds acquired from reputable cryptocurrency exchanges. (Binance & OKEx).\n\nAnonymixer - To enhance anonymity, the platform helps to split the funds received from each user into smaller portions and seamlessly blends them with funds from other clients.\n\nBitcoin Blender - It is emerging as a high-quality Bitcoin mixer that offers a reliable and secure method to protect privacy when making transactions.\n\nYo!Mix - It gives the opportunity that the users can keep their names confidential.\n\nMixero - The platform empowers users to blend their bitcoins with those from fellow users, effectively concealing the origin and destination of funds.\n\nStory continues\n\nFurthermore, Bitcoin mixers mix Bitcoin with other Cryptocurrencies. Bitcoin mixers enable users to change their coins between each other and make it impossible to trace the source of Crypto. The users enter the Destination address, where mixed coins will be sent, and get the Mixer's address, where they should send their own Crypto that needs to increase the level of Anonymization. And then, the users wait for confirmations from the blockchain network before the mixing process can be completed.\n\nAbout Bitcoin Mixer:\n\nBitcoin (BTC) mixers are an essential tool for individuals who value their privacy and anonymity when conducting Bitcoin transactions. It also offers services for mixing Ethereum (ETH Mixer) and Litecoin (LTC Mixer). The variety of mixers provides their users with a wide range of options to suit their specific needs and preferences.\n\nwww.bitcoinmixing.org\n\nContact name: Peter James\n\nCompany name: Bitcoin Mixer Services\n\nEmail: advertise@bitcoinmixing.org\n\nSOURCE: Bitcoin Mixer\n\n\n\n\n\nView source version on accesswire.com:\n\nhttps://www.accesswire.com/755660/Bitcoin-Mixer-Offers-Services-Enhancing-Privacy-and-Anonymity-in-Cryptocurrency-Transactions\n\n\n\n"
    }
]