[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2NyeXB0by93aGF0LWlzLWJpdGNvaW4tdGhlLWRlZmluaXRpdmUtZ3VpZGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "What Is Bitcoin (The Definitive Guide) - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5raW5nNS5jb20vYXJ0aWNsZS9tb25leS9jb25zdW1lci9iYmItd2FybnMtd2FzaGluZ3RvbmlhbnMtb3JlZ29uLWJpdGNvaW4tYnVzaW5lc3MvMjgxLWU0NWE3M2RmLWNhYjEtNDZiZS04MDNlLWM1YTI0M2ZjY2Q1Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "BBB warns Washingtonians about Oregon-based Bitcoin business - KING5.com",
        "content": "Nearly 200 complaints have been filed by consumers in Washington and Oregon after a Bitcoin company allegedly took their money in fraudulent transactions.\n\nExample video title will go here for this video\n\nExample video title will go here for this video\n\nSEATTLE — After paying the fees and receiving confirmation, the Better Business Bureau Great West + Pacific said Bitcoin Bonus never delivers any Bitcoin transfer and stops responding.\n\nThe BBB has now received about 200 complaints from consumers in both Washington state and Oregon. There are also victims outside of the Pacific Northwest, according to the BBB.\n\nThe company - Bitcoin Bonus - has a site that said it's based in Oregon, but the BBB said the business isn't registered with the state. Consumers have reported the company also goes by \"Bitcoin Mining.\"\n\nConsumers have reported to the BBB that they received emails and text messages regarding an accumulated Bitcoin balance that they need to withdraw, but to do so, they are required to pay transaction fees. After paying the fees and receiving confirmation, the BBB said Bitcoin Bonus fails to deliver any Bitcoin transfer and stops responding.\n\nThe BBB said multiple consumers do not recall having an account with Bitcoin Bonus but opt to pay a fee to retrieve their purported funds. Reports outline how the business then goes on to withdraw the same amount multiple times, with the average loss being $70 per person, according to the BBB.\n\n\"If something seems too good to be true, it probably is,\" said Logan Hickle, PR and communications manager for BBB Great West + Pacific.\n\nThe BBB said this alleged fraudulent activity not only causes financial losses for consumers but also creates instability in the crypto market.\n\nBBB recommendation:\n\nConsumers do their research before investing in any cryptocurrency\n\nFind a trustworthy financial professional by checking at FINRA Broker Check and BBB\n\nLook for contact information when engaging with a company online and verify it works\n\nConsumers should also be aware of emails or text messages that promise a large amount of money without risk. The larger the return, the higher the risk\n\nConsumers should never provide personal or financial information to an unknown source\n\nTrack your investments; to receive Bitcoin funds, consumers must have a Bitcoin address from their cryptocurrency exchange or a self-custodial wallet"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2luc3RpdHV0aW9uYWwtYml0Y29pbi1ibGFja3JvY2stb3Rt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Institutional custody of bitcoin could kill it, cautions Hayes - Blockworks",
        "content": "Potential spot bitcoin ETF approval excitement is building in the crypto ecosystem, but Arthur Hayes isn’t convinced such an event is good for bitcoin, or for the people who use it.\n\nThe crypto OG and Maelstrom Fund founder says institutional interest in bitcoin could “herald a situation that we might not actually like in the end.”\n\nSpeaking to Blockworks on the On the Margin podcast (Spotify/Apple), Hayes posits a hypothetical scenario: “Let’s say Larry Fink and his [traditional finance] ilk come in and hoover up a large percentage of the freely traded bitcoin [BTC] in circulation.”\n\nThe same institutional entities could launch bitcoin mining ETFs, he says, adding that “BlackRock is the largest shareholder of some of the largest mining operations.”\n\nAsset managers like BlackRock are effectively “agents of the state,” Hayes cautions. “They act on what the state tells them to do.”\n\nHayes argues that if the state needs its citizens to “sit in the fiat banking system” in order to tax them via inflation to pay back ever-growing debts, it makes sense for institutional entities — who are, by nature, compliant with the state — to hold money in an ETF vehicle.\n\nIn such a system, Hayes argues, “You can’t actually use the bitcoin. It’s a financial asset. It’s not the actual bitcoin itself.”\n\n“You had some fiat, you bought this derivative,” he explains. “The asset manager went and bought some bitcoin and they put it in a custodian and it sits there.”\n\n“If the BlackRock ETF gets too big,” he warns, “it could actually kill bitcoin because it’s just a bunch of immovable bitcoin that’s just sitting there.”\n\nTrading a sugar high today for calamity tomorrow?\n\nAdditionally, Hayes warns that the same entities could increase their grip on the network’s consensus mechanics by holding a large percentage of miners.\n\nCertain upgrades that might be required to ensure bitcoin remains a “rock solid cryptographically hard monetary asset” — particularly regarding encryption and privacy — are not necessarily aligned with traditional finance institutions, he says.\n\nRead more: DeFi is facing a ‘full frontal assault’ from regulators\n\n“So would they support that?” he asks. “Open question. I don’t know, but that’s what happens when you have these large passive investors.”\n\nHayes says bitcoin is the antithesis of statist money “that is here for us, the people, that have the ability to send money around the world.” But he wonders aloud what might happen if most of it winds up in the custody of one or few institutions.\n\nOf course, broader adoption of bitcoin will undoubtedly be great for the price in fiat terms, Hayes says. “But is it actually gonna be great for the usefulness of bitcoin?”\n\n“Are we, you know, gaining a sugar high today to only engender a massive calamity in the future? I don’t know.”\n\nHayes says people need to think longer term about the issue. “Yes, okay, ETF comes, price pumps to whatever it pumps to — but what’s the net result of one institution holding all this crypto?”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vbmV3cy9iaXRjb2luLWhhcy1yZWd1bGF0aW9uLXByb2JsZW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin Has a Regulation Problem - Cryptocurrency - Investopedia",
        "content": "Regulation is among the key factors that affect the bitcoin price. The cryptocurrency’s rise has been arrested every time a government has cracked the policy whip, with countries taking varying approaches to bitcoin regulation.\n\nFor example, in November 2019, bitcoin sank to an all-time low when China accelerated a crackdown on cryptocurrency businesses, mirroring what happened when South Korea also made a move to regulate cryptocurrency trading back in 2017.\n\nConversely, whenever a regulatory \"victory\" emerges, prices surge temporarily. For instance, in October 2023, after years of Bitcoin Spot ETF denials from regulators, rumors of a Bitcoin Spot ETF approval caused a nearly $2,000 price spike and drop within a few hours.\n\nBy their very nature, cryptocurrencies are freewheeling, not beholden to country borders or specific agencies within a government. But this nature presents a problem to policymakers used to dealing with clear-cut definitions for assets. Here are two unresolved questions relating to Bitcoin regulation.\n\nKey Takeaways Bitcoin regulation can vary on both the national and local levels, depending on the country or geographical area.\n\nIn the U.S., the IRS treats cryptocurrency as property, while the CFTC considers it a commodity.\n\nMany cryptocurrency companies have avoided securities laws or requirements by offering utility or transactional tokens instead of security tokens.\n\n\n\nWho Should Regulate Cryptocurrencies?\n\nNothing is more symptomatic of confusion about cryptocurrencies than their classification by U.S. regulatory agencies and updates with former President Donald Trump's tax reform law. The Commodity Futures Trading Commission (CFTC) treats bitcoin as a commodity, while the Internal Revenue Service (IRS) treats it as property.\n\nThere is also a disparity in state and federal responses to cryptocurrency. While states have moved with alacrity and formulated rules for initial coin offerings (ICOSs) and smart contracts, federal responses are generally fueled by interpreting existing laws compared to how the cryptocurrencies are being used. For example, cryptocurrency startups in New York are required to obtain a BitLicense, which has stringent requirements regarding disclosures, before an ICO. Similarly, Arizona recognizes smart contracts. But as of November 2023, Congress hadn't enacted any legislation to guide regulators, although there have been several attempts.\n\nHow Should Cryptocurrencies Be Regulated?\n\nThe unique characteristics and global portability of cryptocurrencies present another problem for regulators.\n\nFor example, there are broadly four different types of tokens being traded on exchanges—transactional, utility, security, and governance tokens. As their name indicates, utility tokens serve an underlying purpose on a platform. For example, Augur, which is a betting platform that uses the Ethereum blockchain—its token, REP, is used on the blockchain as a stake (the bet). Such tokens are not subject to the SEC’s rules unless they are used as a security. On the other hand, security tokens represent equity or a share in a company and automatically fall under SEC purview. Governance tokens allow holders specific rights on a blockchain, and transactional tokens are designed to only be used in financial transactions.\n\nNot surprisingly, several tokens have circumvented existing regulations by declaring themselves utility tokens. Such startups have been publicly rebuked, but that has not stopped tokens with questionable business models from being listed on exchanges outside their native countries.\n\nIn response, international agencies such as the International Monetary Fund (IMF) have called for an international discussion and cooperation among regulators as far as cryptocurrencies are concerned. The EU, which has been welcoming of the cryptocurrency revolution, may possess an advantage over other territories because it controls a 28-member bloc. In June 2023, the EU Markets in Crypto Assets (MiCA) regulation entered into force. MiCA defines cryptocurrency assets and which types are enforceable by regulators. This legislation answers how cryptocurrency should be regulated in the EU, but the U.S. and other countries are still working on solutions. Some countries have placed outright or partial bans on cryptocurrencies.\n\nCreating Regulations for Cryptocurrencies\n\nOn his Twitter page, the former head of blockchain practice at law firm Cooley, Marco Santori, called bitcoin a \"legal platypus,” one that doesn’t fit neatly into established asset categories. However, the platypus may not be such a big problem for taxation or purposes within the United States.\n\nBitcoin and cryptocurrencies are actually no different than cash, stocks, bonds, or other financial instruments—they can represent the same things. In the U.S., regulations already exist that can apply to how an investor, business, or consumer treats them. Creating definitions and applying them to these virtual assets for regulatory purposes, as is already being worked on, might be all that is needed.\n\nRegulators Could Look to Asia for Guidance\n\nSome countries, notably in Asia, are pointers in ways to deal with cryptocurrencies. The clearest indication of future policy for the region regarding regulation may come from Japan, which officially recognized cryptocurrencies as property in its Payments and Services Act and developed a framework in 2017.\n\nNote that El Salvador became the first country (in June 2021) in the world to accept bitcoin as legal tender.\n\nStartups planning an ICO are also required to obtain a license that establishes a minimum set of requirements and disclosures for the offering. Finally, exchanges are also subject to capital requirements, strict IT compliance checks, and regulations about KYC (Know Your Customer). To achieve these changes, Japan amended its Payment Service Act. To be sure, the task is much easier in Japan since the country has only one agency, the Financial Services Agency, to operationalize the changes.\n\nSouth Korea has plans to tax any cryptocurrency profits of more than 2.5 million South Korean won at 20%, a measure which is scheduled to be placed into effect in 2025.\n\nWho Regulates Bitcoin Futures? In the U.S., bitcoin futures are regulated by the Commodity Futures Trading Commission (CFTC).\n\n\n\nWhy Are Wealthy Investors for Regulation for Bitcoin? Sophisticated investors generally support regulation because they want the protection provided by regulatory bodies and transparency.\n\n\n\nWhat Is U.S. Regulation on Bitcoin? Despite engagement by many federal and state regulators in the U.S., there has been little formal rule-making on cryptocurrency.\n\n\n\nThe Bottom Line\n\nBitcoin regulations vary around the globe if they exist at all. But one thing remains certain—developed countries with financial services regulators are likely to develop regulations on cryptocurrency activities to protect the interests of both consumers and governments and to combat illegal activity.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n"
    },
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vbmV3cy9iaXRjb2luLWhhcy1yZWd1bGF0aW9uLXByb2JsZW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 05 Nov 2023 07:00:00 GMT",
        "title": "Bitcoin Has a Regulation Problem - Cryptocurrency - Investopedia",
        "content": "Regulation is among the key factors that affect the bitcoin price. The cryptocurrency’s rise has been arrested every time a government has cracked the policy whip, with countries taking varying approaches to bitcoin regulation.\n\nFor example, in November 2019, bitcoin sank to an all-time low when China accelerated a crackdown on cryptocurrency businesses, mirroring what happened when South Korea also made a move to regulate cryptocurrency trading back in 2017.\n\nConversely, whenever a regulatory \"victory\" emerges, prices surge temporarily. For instance, in October 2023, after years of Bitcoin Spot ETF denials from regulators, rumors of a Bitcoin Spot ETF approval caused a nearly $2,000 price spike and drop within a few hours.\n\nBy their very nature, cryptocurrencies are freewheeling, not beholden to country borders or specific agencies within a government. But this nature presents a problem to policymakers used to dealing with clear-cut definitions for assets. Here are two unresolved questions relating to Bitcoin regulation.\n\nKey Takeaways Bitcoin regulation can vary on both the national and local levels, depending on the country or geographical area.\n\nIn the U.S., the IRS treats cryptocurrency as property, while the CFTC considers it a commodity.\n\nMany cryptocurrency companies have avoided securities laws or requirements by offering utility or transactional tokens instead of security tokens.\n\n\n\nWho Should Regulate Cryptocurrencies?\n\nNothing is more symptomatic of confusion about cryptocurrencies than their classification by U.S. regulatory agencies and updates with former President Donald Trump's tax reform law. The Commodity Futures Trading Commission (CFTC) treats bitcoin as a commodity, while the Internal Revenue Service (IRS) treats it as property.\n\nThere is also a disparity in state and federal responses to cryptocurrency. While states have moved with alacrity and formulated rules for initial coin offerings (ICOSs) and smart contracts, federal responses are generally fueled by interpreting existing laws compared to how the cryptocurrencies are being used. For example, cryptocurrency startups in New York are required to obtain a BitLicense, which has stringent requirements regarding disclosures, before an ICO. Similarly, Arizona recognizes smart contracts. But as of November 2023, Congress hadn't enacted any legislation to guide regulators, although there have been several attempts.\n\nHow Should Cryptocurrencies Be Regulated?\n\nThe unique characteristics and global portability of cryptocurrencies present another problem for regulators.\n\nFor example, there are broadly four different types of tokens being traded on exchanges—transactional, utility, security, and governance tokens. As their name indicates, utility tokens serve an underlying purpose on a platform. For example, Augur, which is a betting platform that uses the Ethereum blockchain—its token, REP, is used on the blockchain as a stake (the bet). Such tokens are not subject to the SEC’s rules unless they are used as a security. On the other hand, security tokens represent equity or a share in a company and automatically fall under SEC purview. Governance tokens allow holders specific rights on a blockchain, and transactional tokens are designed to only be used in financial transactions.\n\nNot surprisingly, several tokens have circumvented existing regulations by declaring themselves utility tokens. Such startups have been publicly rebuked, but that has not stopped tokens with questionable business models from being listed on exchanges outside their native countries.\n\nIn response, international agencies such as the International Monetary Fund (IMF) have called for an international discussion and cooperation among regulators as far as cryptocurrencies are concerned. The EU, which has been welcoming of the cryptocurrency revolution, may possess an advantage over other territories because it controls a 28-member bloc. In June 2023, the EU Markets in Crypto Assets (MiCA) regulation entered into force. MiCA defines cryptocurrency assets and which types are enforceable by regulators. This legislation answers how cryptocurrency should be regulated in the EU, but the U.S. and other countries are still working on solutions. Some countries have placed outright or partial bans on cryptocurrencies.\n\nCreating Regulations for Cryptocurrencies\n\nOn his Twitter page, the former head of blockchain practice at law firm Cooley, Marco Santori, called bitcoin a \"legal platypus,” one that doesn’t fit neatly into established asset categories. However, the platypus may not be such a big problem for taxation or purposes within the United States.\n\nBitcoin and cryptocurrencies are actually no different than cash, stocks, bonds, or other financial instruments—they can represent the same things. In the U.S., regulations already exist that can apply to how an investor, business, or consumer treats them. Creating definitions and applying them to these virtual assets for regulatory purposes, as is already being worked on, might be all that is needed.\n\nRegulators Could Look to Asia for Guidance\n\nSome countries, notably in Asia, are pointers in ways to deal with cryptocurrencies. The clearest indication of future policy for the region regarding regulation may come from Japan, which officially recognized cryptocurrencies as property in its Payments and Services Act and developed a framework in 2017.\n\nNote that El Salvador became the first country (in June 2021) in the world to accept bitcoin as legal tender.\n\nStartups planning an ICO are also required to obtain a license that establishes a minimum set of requirements and disclosures for the offering. Finally, exchanges are also subject to capital requirements, strict IT compliance checks, and regulations about KYC (Know Your Customer). To achieve these changes, Japan amended its Payment Service Act. To be sure, the task is much easier in Japan since the country has only one agency, the Financial Services Agency, to operationalize the changes.\n\nSouth Korea has plans to tax any cryptocurrency profits of more than 2.5 million South Korean won at 20%, a measure which is scheduled to be placed into effect in 2025.\n\nWho Regulates Bitcoin Futures? In the U.S., bitcoin futures are regulated by the Commodity Futures Trading Commission (CFTC).\n\n\n\nWhy Are Wealthy Investors for Regulation for Bitcoin? Sophisticated investors generally support regulation because they want the protection provided by regulatory bodies and transparency.\n\n\n\nWhat Is U.S. Regulation on Bitcoin? Despite engagement by many federal and state regulators in the U.S., there has been little formal rule-making on cryptocurrency.\n\n\n\nThe Bottom Line\n\nBitcoin regulations vary around the globe if they exist at all. But one thing remains certain—developed countries with financial services regulators are likely to develop regulations on cryptocurrency activities to protect the interests of both consumers and governments and to combat illegal activity.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n"
    }
]