[
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9lbC1zYWx2YWRvcnMtYml0Y29pbi1jaXR5LXdpbnMtYW4taW50ZXJuYXRpb25hbC1kZXNpZ24tYXdhcmQtcmVwb3J0L9IBYWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9lbC1zYWx2YWRvcnMtYml0Y29pbi1jaXR5LXdpbnMtYW4taW50ZXJuYXRpb25hbC1kZXNpZ24tYXdhcmQtcmVwb3J0Lz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Jan 2023 08:00:00 GMT",
        "title": "El Salvador’s Bitcoin City Wins an International Design Award (Report) - CryptoPotato",
        "content": "The LOOP Design Awards reportedly recognized the Bitcoin City of El Salvador’s government as one of the most outstanding projects in interior design and architecture.\n\nWhen completed, the metropolis will use the energy released from the Conchagua volcano to power itself and BTC as its currency.\n\nBukele’s Dream City Gets an Award\n\nAccording to recent coverage, El Salvador’s urban project stood out among 700 proposals. The jury outlined its innovative interior style, while the beautiful surrounding nature and the nearby volcanoes also attributed to the success. They also highlighted the work of the Mexican architect Fernando Romero who designed it.\n\nThe Bitcoin City will be built in the southeast of the Latin American country, close to two of the nation’s biggest volcanoes – Conchagua and Tecapa. Romero’s team said the future metropolis will be “efficient and sustainable” and will use geothermal energy from the volcanoes to power itself.\n\nIt will use bitcoin as its currency which could provide certain monetary benefits to the residents. “The new public space will be the culmination of decades of research into what humans need to live well in an anti-inflationary economy,” the architect outlined.\n\nRomero designed the urban area in the shape of a circle so it could represent the logo of bitcoin when looked at from above.\n\nThe President of El Salvador – Nayib Bukele – was the first to present the project in 2021. The local government planned to raise a $1 billion bitcoin-backed bond to finance the construction, which was supposed to mature in 2032. However, the authorities postponed it in March 2022, citing unfavorable market conditions.\n\nBukele shed more light on the design in May last year, showing how the city will look when observed from the air, its modern airport, and its volcano watchtower.\n\nSo Many More Bitcoin Initiatives\n\nApart from becoming the first nation to embrace the primary cryptocurrency as a legal tender, El Salvador’s government has also introduced several projects related to it in the past few years.\n\nIt built a massive vet hospital named Chivo Pets, where treatments are paid in BTC, and opened an education center that provides “free and accessible learning opportunities” surrounding the asset for Salvadorans.\n\nThe authorities have also started accumulating bitcoin on a macroeconomic level, holding approximately $54 million of it (as of now). The amount, though, could be higher since Bukele announced in November that the government will purchase one BTC per day. It remains unknown whether the buying spree goes as promised."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9lbC1zYWx2YWRvcnMtYml0Y29pbi1jaXR5LXdpbnMtYW4taW50ZXJuYXRpb25hbC1kZXNpZ24tYXdhcmQtcmVwb3J0L9IBYWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9lbC1zYWx2YWRvcnMtYml0Y29pbi1jaXR5LXdpbnMtYW4taW50ZXJuYXRpb25hbC1kZXNpZ24tYXdhcmQtcmVwb3J0Lz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Jan 2023 08:00:00 GMT",
        "title": "El Salvador’s Bitcoin City Wins an International Design Award (Report) - CryptoPotato",
        "content": "The LOOP Design Awards reportedly recognized the Bitcoin City of El Salvador’s government as one of the most outstanding projects in interior design and architecture.\n\nWhen completed, the metropolis will use the energy released from the Conchagua volcano to power itself and BTC as its currency.\n\nBukele’s Dream City Gets an Award\n\nAccording to recent coverage, El Salvador’s urban project stood out among 700 proposals. The jury outlined its innovative interior style, while the beautiful surrounding nature and the nearby volcanoes also attributed to the success. They also highlighted the work of the Mexican architect Fernando Romero who designed it.\n\nThe Bitcoin City will be built in the southeast of the Latin American country, close to two of the nation’s biggest volcanoes – Conchagua and Tecapa. Romero’s team said the future metropolis will be “efficient and sustainable” and will use geothermal energy from the volcanoes to power itself.\n\nIt will use bitcoin as its currency which could provide certain monetary benefits to the residents. “The new public space will be the culmination of decades of research into what humans need to live well in an anti-inflationary economy,” the architect outlined.\n\nRomero designed the urban area in the shape of a circle so it could represent the logo of bitcoin when looked at from above.\n\nThe President of El Salvador – Nayib Bukele – was the first to present the project in 2021. The local government planned to raise a $1 billion bitcoin-backed bond to finance the construction, which was supposed to mature in 2032. However, the authorities postponed it in March 2022, citing unfavorable market conditions.\n\nBukele shed more light on the design in May last year, showing how the city will look when observed from the air, its modern airport, and its volcano watchtower.\n\nSo Many More Bitcoin Initiatives\n\nApart from becoming the first nation to embrace the primary cryptocurrency as a legal tender, El Salvador’s government has also introduced several projects related to it in the past few years.\n\nIt built a massive vet hospital named Chivo Pets, where treatments are paid in BTC, and opened an education center that provides “free and accessible learning opportunities” surrounding the asset for Salvadorans.\n\nThe authorities have also started accumulating bitcoin on a macroeconomic level, holding approximately $54 million of it (as of now). The amount, though, could be higher since Bukele announced in November that the government will purchase one BTC per day. It remains unknown whether the buying spree goes as promised."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNvLWJ1bGxpc2gtYXQtMjNrLWFzLWFuYWx5c3QtcmV2ZWFscy1uZXctYnRjLXByaWNlLW1ldHJpY3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin 'so bullish' at $23K as analyst reveals new BTC price metrics - Cointelegraph",
        "content": "Bitcoin (BTC) remains firmly “bullish” at $23,000, according to new on-chain metrics from one of the industry’s best-known names.\n\nIn a preview on Jan. 28, market cyclist and on-chain analyst Cole Garner revealed what he said were “backtested and validated” Bitcoin trading tools.\n\nGarner: BTC price signals should excite bulls\n\nWhile BTC/USD attempts to push through liquidity above $23,000, the debate rages as to whether a significant BTC price correction is due.\n\nFor Garner, who offered a snapshot of several trading signals to Twitter users at the weekend, there is no doubt — the picture is firmly green.\n\n“They are looking so bullish right now,” he summarized in part of accompanying commentary.\n\nOne metric compares the ratio of BTC to stablecoins across exchanges. This has hit multi-year highs, a screenshot appears to show, beating its peaks from any event since early 2020.\n\n“It is rarely ever wrong,” Garner claimed while not providing additional details about its mechanism of action.\n\nTraditionally, high stablecoin liquidity hints at bullish continuation, with funds “waiting in the wings” to enter Bitcoin or other crypto assets.\n\nBTC/USD annotated chart. Source: Cole Garner/ Twitter\n\nGarner presented the ratio of on-chain volume traded in profit, hitting its highest levels in at least three-and-a-half years.\n\n“It generates faster trade signals, with a longer track record. It is so bullish right now,” he reiterated.\n\nBTC/USD annotated chart. Source: Cole Garner/ Twitter\n\nAccording to the latest data from on-chain analytics firm Glassnode, realized profit versus realized loss continues to stage an expected recovery in line with price action.\n\nBitcoin net realized profit/ loss chart. Source: Glassnode\n\nAs Cointelegraph reported, net unrealized profit and loss — the portion of the BTC supply not being transacted — has also transformed this month thanks to Bitcoin’s 40% gains.\n\nMiners get shot at post-capitulation blast-off\n\nFurther optimism focused on a recovery among Bitcoin miners.\n\nRelated: Bitcoin hash rate taps new milestone with miner hodling at 1-year low\n\nAccording to the popular Hash Ribbons metric, the Bitcoin mining sector has recently exited a period of capitulation which ensued as a result of the post-FTX BTC price declines.\n\nHash Ribbons use hash rate to determine periods of miner stress. Such recoveries have historically coincided with BTC price “corrections,” as described by digital asset and global macro investment management firm Wakem Capital Management this week.\n\nTweeting Glassnode data, Wakem highlighted that the last capitulation exit came just before FTX, denying Bitcoin bulls the gains traditionally associated with the event.\n\nBitcoin Hash Ribbons annotated chart. Source: Wakem Capital Management/ Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNvLWJ1bGxpc2gtYXQtMjNrLWFzLWFuYWx5c3QtcmV2ZWFscy1uZXctYnRjLXByaWNlLW1ldHJpY3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin 'so bullish' at $23K as analyst reveals new BTC price metrics - Cointelegraph",
        "content": "Bitcoin (BTC) remains firmly “bullish” at $23,000, according to new on-chain metrics from one of the industry’s best-known names.\n\nIn a preview on Jan. 28, market cyclist and on-chain analyst Cole Garner revealed what he said were “backtested and validated” Bitcoin trading tools.\n\nGarner: BTC price signals should excite bulls\n\nWhile BTC/USD attempts to push through liquidity above $23,000, the debate rages as to whether a significant BTC price correction is due.\n\nFor Garner, who offered a snapshot of several trading signals to Twitter users at the weekend, there is no doubt — the picture is firmly green.\n\n“They are looking so bullish right now,” he summarized in part of accompanying commentary.\n\nOne metric compares the ratio of BTC to stablecoins across exchanges. This has hit multi-year highs, a screenshot appears to show, beating its peaks from any event since early 2020.\n\n“It is rarely ever wrong,” Garner claimed while not providing additional details about its mechanism of action.\n\nTraditionally, high stablecoin liquidity hints at bullish continuation, with funds “waiting in the wings” to enter Bitcoin or other crypto assets.\n\nBTC/USD annotated chart. Source: Cole Garner/ Twitter\n\nGarner presented the ratio of on-chain volume traded in profit, hitting its highest levels in at least three-and-a-half years.\n\n“It generates faster trade signals, with a longer track record. It is so bullish right now,” he reiterated.\n\nBTC/USD annotated chart. Source: Cole Garner/ Twitter\n\nAccording to the latest data from on-chain analytics firm Glassnode, realized profit versus realized loss continues to stage an expected recovery in line with price action.\n\nBitcoin net realized profit/ loss chart. Source: Glassnode\n\nAs Cointelegraph reported, net unrealized profit and loss — the portion of the BTC supply not being transacted — has also transformed this month thanks to Bitcoin’s 40% gains.\n\nMiners get shot at post-capitulation blast-off\n\nFurther optimism focused on a recovery among Bitcoin miners.\n\nRelated: Bitcoin hash rate taps new milestone with miner hodling at 1-year low\n\nAccording to the popular Hash Ribbons metric, the Bitcoin mining sector has recently exited a period of capitulation which ensued as a result of the post-FTX BTC price declines.\n\nHash Ribbons use hash rate to determine periods of miner stress. Such recoveries have historically coincided with BTC price “corrections,” as described by digital asset and global macro investment management firm Wakem Capital Management this week.\n\nTweeting Glassnode data, Wakem highlighted that the last capitulation exit came just before FTX, denying Bitcoin bulls the gains traditionally associated with the event.\n\nBitcoin Hash Ribbons annotated chart. Source: Wakem Capital Management/ Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LnRoaXNpc21vbmV5LmNvLnVrL21vbmV5L21hcmtldHMvYXJ0aWNsZS0xMTY4NjkwNy9UeWNvb24tcGFscy1QcmluY2UtQW5kcmV3LWhpdC1sb3NzZXMtQml0Y29pbi1maXJtLmh0bWzSAXdodHRwczovL3d3dy50aGlzaXNtb25leS5jby51ay9tb25leS9tYXJrZXRzL2FydGljbGUtMTE2ODY5MDcvYW1wL1R5Y29vbi1wYWxzLVByaW5jZS1BbmRyZXctaGl0LWxvc3Nlcy1CaXRjb2luLWZpcm0uaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 28 Jan 2023 08:00:00 GMT",
        "title": "Tycoon pals of Prince Andrew hit by losses in Bitcoin firm - This is Money",
        "content": "Businessman Jonathan Rowland and his father David, who is famous for reportedly bankrolling Prince Andrew, have lost millions on a cryptocurrency venture that has gone to the wall. Jonathan, 47, is winding down much of Mode Global Holdings, a Bitcoin app he founded, after failing to secure the money it needed to survive.\n\nMode Global was the latest in a string of companies set up by the serial entrepreneur, with mixed success.\n\nHis father David, 77, a property tycoon and prominent donor to the Conservative party, had a stake in his son's venture. Rowland senior, who was nicknamed 'Spotty' for his relative youth when he floated his first company on the stock exchange aged 23, has accumulated vast wealth through property and banking.\n\nRoyal links: Jonathan Rowland and his then partner Anya at Princess Eugenie's wedding\n\nJonathan, keen to follow in the paternal footsteps, had grand ambitions for Mode. He wanted to transform it from a payments app to the 'most trusted' crypto company in the world. Christopher Isaac 'Biz' Stone, a US technology investor and co-founder of Twitter, also held shares.\n\nLess than two-and-a-half years since Mode was listed on the London Stock Exchange, those dreams are in tatters.\n\nInvestors have seen their holdings virtually wiped out as the share price nosedived from its 77p peak in February 2021, when Mode was estimated to be worth £62 million, to half a penny last week.\n\nHowever, it is far from the first embarrassment for the father and son duo, including over their relationship with Prince Andrew.\n\nDavid Rowland – a long-time Guernsey resident who has been dubbed the 'tax haven tycoon' – has acted as the Duke of York's financial adviser. He had a front-row seat at his daughter Princess Eugenie's wedding in 2018.\n\nThe year before, Rowland senior reportedly paid off a £1.5 million loan for Andrew through his Luxembourg bank, Banque Havilland. Leaked documents revealed that the Duke of York had also sought a £200,000 loan from Jonathan Rowland, who was at the time chief executive of the bank. On another occasion, David and Jonathan flew to North Korea, widely viewed as a pariah state under dictator Kim Jong Un, to look at an 'investment opportunity'.\n\nDavid owns a palatial estate on Guernsey called Havilland Hall – where in 2005 Prince Andrew unveiled a lifesize bronze statue of Rowland smoking a cigar.\n\nBacker: David Rowland paid off a £1.5 million loan for the Duke of York\n\nJonathan has struggled to emerge from his father's shadow and emulate his success in business. After spending years as a racing driver, he first made headlines in his 20s, when he set up an internet investment company called Jellyworks. Its shares initially surged, and at its peak the firm was valued at £300 million.\n\nBut within six months it disappeared from the stock market amid difficulty raising fresh finance.More recently, he has co-founded a lender for small businesses called Redwood Bank, and was even linked to a bid for crisis-stricken football club Wigan Athletic.\n\nHis personal life has also been eventful. He once revealed he had a stroke while in bed with a woman he 'shouldn't have been with' – but joked that at least she was there to call an ambulance.\n\nJonathan is heir to a fortune believed to run into hundreds of millions of pounds.\n\nHe and his father held around 30 per cent of shares in Mode Global but clearly were unwilling to stake any more family wealth on the venture. Mode will this week start winding up large sections of the business – shutting its app in the coming weeks and closing down subsidiaries Fibere and JGOO.\n\nEarlier this month chief executive Rita Liu resigned.\n\nMode uses open banking to allow customers to transfer cash into their accounts, which they could then use to buy Bitcoin and other cryptocurrencies. It is also a payments app and customers could receive Bitcoin 'cashback' for purchases at its partner brands.\n\nThe group has urged customers to withdraw their cash but it is not clear if there is a deadline or how much money Mode is holding. The Bitcoin itself was held by a company called Bitgo.\n\nMode said that customers' cash and cryptocurrency assets 'will remain safe' and there are no restrictions on withdrawals.\n\nJonathan declined to comment."
    }
]