[
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTA4L2lycy13YW50cy10by10YXgtYW1lcmljYW5zLWZyb3plbi1jcnlwdG8tYml0Y29pbi1idGMtYXNzZXRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "IRS Wants To Tax Americans' Frozen Crypto, Bitcoin (BTC) Assets - Bloomberg",
        "content": "Listen to Bloomberg Crypto on the iHeartRadio App, Apple Podcasts or Spotify.\n\nVoyager. Celsius. Genesis. And of course, FTX. All major crypto companies that went bankrupt last year. All names we’ve talked about a lot on this podcast. But did you know there’s a tax season quirk for US investors with digital tokens tied up in accounts on these platforms? In some cases, even investors who lost access to their funds may have to pay taxes on those assets."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTA4L2lycy13YW50cy10by10YXgtYW1lcmljYW5zLWZyb3plbi1jcnlwdG8tYml0Y29pbi1idGMtYXNzZXRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "IRS Wants To Tax Americans' Frozen Crypto, Bitcoin (BTC) Assets - Bloomberg",
        "content": "Listen to Bloomberg Crypto on the iHeartRadio App, Apple Podcasts or Spotify.\n\nVoyager. Celsius. Genesis. And of course, FTX. All major crypto companies that went bankrupt last year. All names we’ve talked about a lot on this podcast. But did you know there’s a tax season quirk for US investors with digital tokens tied up in accounts on these platforms? In some cases, even investors who lost access to their funds may have to pay taxes on those assets."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jbmJjLmNvbS92aWRlby8yMDIzLzAzLzA4L2JpdGNvaW4tcmVib3VuZHMtYmFua3J1cHRjeS1qdWRnZS1hcHByb3Zlcy12b3lhZ2Vycy1yZXN0cnVjdHVyaW5nLXBsYW4tY25iYy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin rebounds, and bankruptcy judge approves Voyager's restructuring plan - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin rebounds, and bankruptcy judge approves Voyager's restructuring plan: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, John Wu, president of Ava Labs, weighs in on Silvergate's warning it might not be able to stay in business. He also discusses the future of web3 and a new partnership geared toward revolutionizing the gaming industry."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jbmJjLmNvbS92aWRlby8yMDIzLzAzLzA4L2JpdGNvaW4tcmVib3VuZHMtYmFua3J1cHRjeS1qdWRnZS1hcHByb3Zlcy12b3lhZ2Vycy1yZXN0cnVjdHVyaW5nLXBsYW4tY25iYy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Bitcoin rebounds, and bankruptcy judge approves Voyager's restructuring plan - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin rebounds, and bankruptcy judge approves Voyager's restructuring plan: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, John Wu, president of Ava Labs, weighs in on Silvergate's warning it might not be able to stay in business. He also discusses the future of web3 and a new partnership geared toward revolutionizing the gaming industry."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvbmV1dHJvbnBheS1hbmQtYml0Y29pbnZuLXRvLWhvc3QtbGlnaHRuaW5nY29uLXZpZXRuYW0tYXNpYXMtZmlyc3QtYml0Y29pbi1hbmQtbGlnaHRuaW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Mar 2023 08:00:00 GMT",
        "title": "Neutronpay And BitcoinVN To Host Lightningcon Vietnam, Asia's First Bitcoin And Lightning Conference - Nasdaq",
        "content": "In March, Bitcoin and Lightning builders and developers will congregate at a beachside resort in Da Nang, Vietnam.\n\nAsia’s first Bitcoin and Lightning Network conference will take place in Da Nang, Vietnam, March 22-24, 2023 at the beachside Furama Resort, according to a press release sent to Bitcoin Magazine.\n\n\n\nHosts Neutronpay and BitcoinVN will organize the event in the town which some have dubbed “Bitcoin Beach Vietnam.” The two companies, along with Nunchuk, are all Vietnam-based Bitcoin-only companies, and are excited to share what is happening in Asia as it relates to Bitcoin projects, Bitcoin communities and Lightning adoption across the region.\n\nFounder and CEO of Neutronpay Albert Buu, said of the decision that “When we looked around, we noticed that other parts of the world were being represented with Bitcoin and Lightning events, but Asia and more specifically emerging markets in Asia had none and were being completely overlooked considering high bitcoin usage in the region. We’re proud to say that since we announced the event it has been highly talked about and is now on many people's yearly must-hit conference calendars.”\n\n“We’re extremely excited to be putting on the world's first bitcoin & lightning event in Asia,” Malcolm Weed, COO of Neutronpay said, echoing Buu. “Bitcoin adoption is very strong across the region with countries like Vietnam (1), Philippines (2), India (4), Pakistan (6), Thailand (8), and China (10) all being in the top 10 global rankings for bitcoin adoption, making it the world's bitcoin epicenter. With over 4B people in Asia, representing half the world's population, 70% of which are unbanked, it is no wonder bitcoin adoption is so strong.”\n\nStarting on March 22, the event will commence with a beach meet and greet, followed by two days of speakers who will share the latest advancements in the Bitcoin ecosystem. These presentations will cover both the technological and economic aspects of Bitcoin. Companies building on the Lightning Network are also expected to be well-represented and provide updates on the current state of affairs and exciting ongoing projects.\n\nDue to the limited availability of tickets, only 500 attendees will be able to participate. General admission two-day passes are currently priced at $500, but prices will rise again on March 22. Local Vietnamese attendees can access the non-profit event at a discounted rate of $40. The press release strongly encourages local participants to attend and learn about the technology, as well as meet Vietnamese companies that are building on Bitcoin and Lightning.\n\nSoftware developers from Vietnam that are interested in working with the Lightning Network, are encouraged to contact the organizers at info@neutronpay.com, and those interested in speaking, moderating, volunteering or sponsoring are encouraged to reach out to malcolm@neutronpay.com.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]