[
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTExL2JpdGNvaW4tZXRmLWZhbnMtc2Vlcy1vcHRpb25zLXRyYWRpbmctYXBwcm92YWwtYXMtbmV4dC1odXJkbGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Spot ETF Approval Has Wall Street Eyeing Options Trading Next - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjQvMDEvMTEvYnVzaW5lc3MvZGVhbGJvb2svYml0Y29pbi1ldGYtd2FsbC1zdHJlZXQtY3J5cHRvLWludmVzdGluZy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "The Bitcoin E.T.F. Gets Approved — What to Expect Now. - The New York Times",
        "content": "Bitcoin bulls join forces with Wall Street\n\nA new era of crypto trading is expected to begin as soon as today, after the S.E.C. finally approved the creation of new exchange-traded funds that would allow investors to more easily buy and sell Bitcoin.\n\nThe regulator yesterday authorized 11 fund managers — including the Wall Street fund giants BlackRock and VanEck and smaller companies like GrayScale and Valkyrie — to begin offering the new crypto investment products.\n\nIn anticipation of the decision, the companies have been aggressively cutting their management fees to gain an early advantage. “The fundamental change is a whole lot more money is coming into this asset class,” Paul Grewal, the chief legal counsel of the crypto exchange Coinbase, told DealBook. Matthew Sigel, the head of digital asset research at VanEck, called it a “historic” moment.\n\nBitcoin hit a 21-month high this week, as crypto boosters shrugged off a series of high-profile bankruptcies and a sweeping legal crackdown against some of the biggest players in the sector. That said, the cryptocurrency’s price barely budged this morning, trading below $47,000, giving the digital token a market value of roughly $920 billion."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjQvMDEvMTEvdGVjaG5vbG9neS9iaXRjb2luLWV0Zi10cmFkaW5nLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "$4 Billion of New Bitcoin Funds Change Hands in First Trading Day - The New York Times",
        "content": "More than $4 billion of a newly approved investment product tied to Bitcoin changed hands in the first day of trading on Thursday, as cryptocurrency enthusiasts celebrated a watershed moment for the industry.\n\nEleven of the products, known as exchange-traded funds, or E.T.F.s, started trading on popular platforms such as the Nasdaq a day after federal regulators authorized them, creating a simpler way for investors to bet on the cryptocurrency markets. Major financial firms, including asset managers like BlackRock and Fidelity, are offering the E.T.F.s.\n\nThe early volume was impressive, analysts said, comparing favorably with other E.T.F. debuts. But it may take months to gauge the impact on the cryptocurrency industry, which is still reeling from a recent series of market crashes and high-profile corporate bankruptcies. Initial market data did not show how much new investment flowed into the Bitcoin funds; some of the trading activity may have stemmed from investors who bought shares and quickly flipped them.\n\n“It’s not a one-day event,” said Sandy Kaul, who runs the digital asset arm of Franklin Templeton, a firm offering the E.T.F.s. “Six months is a really good moment to understand: Is this a transformational product?”"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMTEvaGVyZXMtd2hhdC1hLWJpdGNvaW4tZXRmLWFjdHVhbGx5LW1lYW5zLWZvci1pbnZlc3RvcnMuaHRtbNIBXmh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDI0LzAxLzExL2hlcmVzLXdoYXQtYS1iaXRjb2luLWV0Zi1hY3R1YWxseS1tZWFucy1mb3ItaW52ZXN0b3JzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Here's what a bitcoin ETF actually means for investors - CNBC",
        "content": "Chesnot | Getty Images\n\nThe U.S. Securities and Exchange Commission just approved the first-ever batch of spot bitcoin exchange-traded funds to come out of the U.S. The agency gave the green light on Wednesday to sponsors of 10 ETFs, including BlackRock, Invesco, Fidelity, Grayscale, and Ark Invest — paving the way for these funds to begin trading as soon as this week. The move was largely expected, even after a social media hacking snag. A false statement saying the regulator had approved a bitcoin ETF was published Tuesday on the SEC's social media account on X, formerly known as Twitter. The agency later clarified that its account had been compromised. The actual approval Wednesday marked a massive step for the cryptocurrency, as it will give investors increased ways to gain exposure to the token — not just from holding it directly, but via existing financial instruments that trade on a regulated stock exchange.\n\nwatch now\n\nBut what does that all mean exactly, and how does it affect investors? CNBC runs through everything you need to know about the bitcoin ETF milestone.\n\nWhat's a bitcoin ETF?\n\nAn ETF is an investment fund that tracks the performance of an underlying asset. That could be stocks, a basket of currencies, a precious metal like gold, or, in this case, bitcoin. It's a way for investors to get exposure to the value of the underlying asset without directly owning it. ETFs trade on traditional stock exchanges, and their value should rise when the underlying asset increases in price, or fall if it decreases. As crypto investors look to assess what the market impact of a bitcoin ETF might be, many are comparing Wednesday's news to the greenlighting of the SPDR Gold Shares ETF — the first-ever spot gold ETF — in 2004. The total gold market capitalization was worth around $1 trillion to $2 trillion before the gold ETF was approved, and this subsequently ballooned to $16 trillion in a few years after, according to Vijay Ayyar, vice president of international markets for Indian crypto exchange CoinDCX. \"Bitcoin's adoption will be much faster and bigger than that,\" Ayyar told CNBC via WhatsApp.\n\nwatch now\n\nAyyar said the story for bitcoin and crypto will \"accelerate\" in 2024, as the approval of a spot bitcoin ETF could spark interest from retail investors who were previously sitting on the sidelines.\n\nWhat does a bitcoin ETF mean for investors?\n\nA bitcoin ETF opens up the audience of people and institutions that can buy and sell bitcoin to those with little experience trading cryptocurrency. \"This ETF has two main impacts: increased distribution in the US (a moderate impact, as there have been ETFs outside of the US for years) and increased credibility of crypto as an 'asset class' (a very high impact),\" Kevin de Patoul, co-founder and CEO of crypto liquidity provider Keyrock, told CNBC. \"There is now a U.S. bitcoin spot ETF, and bitcoin is no longer considered shady or infamous. This significantly changes the perception for the mainstream public.\" It also means that bitcoin could start appearing in mainstream portfolios, where many more retail investors can gain exposure. Big institutional fund managers can add it to their investment funds. Retirement planners can now include it in employer-sponsored 401(k) plans. This makes it much easier to own bitcoin, as you don't have to rely on a vulnerable piece of hardware for storage. Investors don't need to tackle the difference between \"hot\" and \"cold\" wallets, which store digital tokens. Instead, they can just buy an ETF from one of the many regulated asset managers that are set to go live with their own ETFs.\n\nwatch now"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jbmJjLmNvbS8yMDI0LzAxLzExL2JpdGNvaW4tZXRmcy1iZWdpbi10cmFkaW5nLW9uLXVzLWV4Y2hhbmdlcy1wb3N0aW5nLWdhaW5zLW9uLWZpcnN0LWRheS1hcy1jcnlwdG8tcHJpY2VzLXJpc2UuaHRtbNIBhAFodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyNC8wMS8xMS9iaXRjb2luLWV0ZnMtYmVnaW4tdHJhZGluZy1vbi11cy1leGNoYW5nZXMtcG9zdGluZy1nYWlucy1vbi1maXJzdC1kYXktYXMtY3J5cHRvLXByaWNlcy1yaXNlLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 11 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETFs begin trading on U.S. exchanges - CNBC",
        "content": "Those two were among the first of 11 funds that traded on Thursday after the Securities and Exchange Commission approved rule changes for its exchanges on Wednesday. The group combined for billions of dollars worth of trading volume in the first day.\n\nThe Grayscale Bitcoin Trust (GBTC) closed up 0.5%, well off its highs of the day, while the iShares Bitcoin Trust (IBIT) fell more than 4% after initially rising in morning trading. Both funds saw tens millions of shares traded on Thursday.\n\nBitcoin exchange-traded funds saw big swings on their first day of trading on Thursday, mirroring a volatile day for crypto prices more broadly.\n\nThe Grayscale fund is the biggest of the group, as it was converted from an over-the-counter trust that already had more than $28 billion in assets. The Hashdex fund is currently a bitcoin futures product, and while a rule change to list the fund as a spot bitcoin product was approved, the fund's registration statement to convert the fund is still under review with the SEC.\n\nThe moves for the funds came as bitcoin saw volatile trading. The digital currency briefly hit the $49,000 mark Thursday morning before falling back below $47,000, for a gain of about 1%, according to Coin Metrics. Bitcoin trades around the clock, so the first-day moves for the funds could be affected by the exact timing of their launch.\n\nEven given the heavy trading volumes and swings in bitcoin, there appeared to be no major problems with the ETFs in their first day.\n\n\"Trading today went very well, very orderly,\" said Rachel Aguirre, the U.S. head of iShares product.\n\nETFs are an investment vehicle where investors buy shares that represent a claim on the fund's underlying assets. Some of the most popular ETFs are equity index funds, though other funds in the category track bonds, derivatives products and commodities such as gold.\n\nFinancial advisors and institutional investors often use ETFs because of their liquidity and tax advantages compared to mutual funds. Asset managers are betting that bitcoin ETFs will bring new investors to crypto.\n\n\"This is actually what ETFs were made for — to take difficult, complex things and make it simple and compliant to trade. This will mainstream the asset class,\" WisdomTree CEO Jonathan Steinberg said on CNBC's \"Money Movers.\"\n\n\"This will allow a less technology-sophisticated investor to buy bitcoin in a way that they are very comfortable with,\" Steinberg added.\n\nInvestors and financial advisors will be watching closely to see not only how the bitcoin ETFs perform, but also how well they track the price of bitcoin. Wide gaps between the price of a fund and the price of the underlying bitcoin that lasts for multiple days could be a sign of thin trading or structural issues with an ETF and scare off potential buyers, even if the fund is temporarily outperforming spot bitcoin.\n\nTrading volume will also be a key metric for investors, as funds with more trading are seen as more efficient, though first-day trading volumes are not always indicative of a fund's future success.\n\n\"We really wanted to see some day one volume, but we also understand that there's a lot of platforms and gatekeepers and advisors and investors who kind of want to let this breathe a little bit and make sure the fund's doing what it's supposed to,\" David Mann, head of ETF product and capital markets for Franklin Templeton, told CNBC. The Franklin Bitcoin ETF (EZBC) saw more than 2 million shares change hands on Thursday.\n\nThe success of the funds could also be affected by different price points. Several fund issuers cut their proposed fees just below launch, and many are offering temporary waivers that cut their management fee to 0% in the short run.\n\n\n\nDon't miss these stories from CNBC PRO:"
    }
]