[
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAyLTAxL3BvZGNhc3QtYS1maW5hbmNpYWwtYWR2aXNlci1zLXRha2Utb24tdGhlLWZ1dHVyZS1vZi1iaXRjb2luLWV0ZnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Podcast: A Financial Adviser's Take on the Future of Bitcoin ETFs - Bloomberg",
        "content": "Subscribe to Trillions on Apple Podcasts\n\nSubscribe to Trillions on Spotify\n\nThe launch of the first-ever spot Bitcoin exchange-traded funds has dominated the ETF conversation over the last few months. Issuers are jockeying for position in what’s fast-becoming a successful and ultra-competitive category. But who’s the target market for these products? What do advisers think of them? And how are they talking to their clients about them?"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAyLTAxL2JpdGNvaW4tZXRmLXByaWNlLXdhci1pcy10cmlja2xpbmctZG93bi10by1jcnlwdG8tY3VzdG9kaWFuc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin ETF Price War Is Trickling Down to Crypto Custodians - Bloomberg",
        "content": "Less than a month after the debut of spot Bitcoin exchange-traded funds, the asset managers offering the investment vehicles appear to be seeking ways to bolster their own profitability.\n\nValkyrie Investments said Thursday that it’s retaining BitGo as a second custodian to help safeguard customer assets. Coinbase currently dominates the custody role for Bitcoin ETFs, supporting eight out of the 10 issuers, including for the roughly $113 million Valkyrie Bitcoin Fund, which trades under the BRRR ticker."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAyLTAxL2JpdGNvaW4tbWluZXJzLWluLXVzLWNvbnN1bWUtdXAtdG8tMi0zLW9mLW5hdGlvbi1zLWVsZWN0cmljaXR50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Bitcoin Miners in US Consume Up to 2.3% of Nation’s Electricity, EIA Report Says - Bloomberg",
        "content": "Bitcoin miners in the US are consuming the same amount of electricity as the entire state of Utah, among others, according to a new analysis by the US Energy Information Administration. And that’s considered the low end of the range of use.\n\nElectricity usage from mining operations represents 0.6% to 2.3% of all the country’s demand in 2023, according to the report Bloomberg Terminal released Thursday. It is the first time EIA has shared an estimate. The mining activity has generated mounting concerns from policymakers and electric grid planners about straining the grid during periods of peak demand, energy costs and energy-related carbon dioxide emissions."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMivQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMS1mZWJydWFyeS0yMDI0L2FydGljbGVzaG93LzEwNzMxMzQyMC5jbXPSAcEBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTEtZmVicnVhcnktMjAyNC9hbXBfYXJ0aWNsZXNob3cvMTA3MzEzNDIwLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Crypto Price on February 1: Bitcoin drops near $42,000 level after Fed Chair Jerome Powell shoots down Mar - The Economic Times",
        "content": "\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe cryptocurrency market traded in the deep red on Thursday after the US Federal Reserve commentary added to doubts over early rate cuts.The Federal Reserve committee's decision to hold rates at 5.25-5.5% on Wednesday was no surprise, it took a dovish twist by emphasising that rates would not be cut until it had more confidence that inflation was truly beaten.In a media conference, Fed Chair Jerome Powell flatly stated a cut as early as March seemed unlikely, but also conceded that everyone on the committee was looking to ease this year.Meanwhile, the global cryptocurrency market cap declined 2.5% to around $1.69 trillion in the last 24 hours, as per data available on CoinGecko.At 10.16 a.m., Bitcoin was trading 2% lower at $42,093, while Ethereum was down 3.2% at $2,264. Another popular altcoin such as Solana and Avalanche fell over 5% each. While BNB XRP , Cardano, Donecoin, Chainlink, Polygon, and Shiba Inu also declined by 1-3%.Following the US Federal Reserve's decision to maintain interest rates, Bitcoin slipped below the $43,000 mark as investors anticipated a potential rate cut in March, said Edul Patel, CEO of Mudrex.Shivam Thakral, CEO of BuyUcoin, said, \"The Altcoin market also took a downturn which could change unless Ethereum breaches $2500 amid other positive macroeconomic factors.\"The total volume in DeFi is currently $5.91 billion, 14.36% of the total crypto market 24-hour volume. The volume of all stablecoins is now $14.53 billion, which is 35.31% of the total crypto market 24-hour volume, as per data available on CoinMarketCap.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, dropped to $824 billion. Bitcoin's dominance is currently 54.42%, according to CoinMarketCap. BTC volume in the last 24 hours surged 12.7% to $25.73 billion.\"Bitcoin's recent drop below $43,000 followed a hawkish stance by Federal Reserve Chairman Jerome Powell, suggesting a March rate cut is unlikely. However, the broader economic environment favors Bitcoin in 2024 with expectations of a possible Fed rate cut, which traditionally boosts cryptocurrencies,\" said Sathvik Vishwanath, Co-Founder & CEO, Unocoin.\"Additionally, expectations surrounding the April halving of Bitcoin and potential supportive US political and fiscal dynamics add to the bullish outlook. Despite the near-term uncertainty, Bitcoin's price trajectory is set for a potential rally to the low $50,000s, outweighing the prospect of a dip to the low $30,000s in the foreseeable future,\" Sathvik added."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy90ZXNsYS1taXNzZWQtNTAwLW1pbGxpb24tYml0Y29pbi0yMjAwMTIyNzUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 01 Feb 2024 08:00:00 GMT",
        "title": "Tesla Missed $500 Million In Bitcoin Gains: Will It Sell The Remaining 9,700 BTC? - Yahoo Finance",
        "content": "It is well known that Tesla Inc. CEO Elon Musk is a huge cryptocurrency proponent. From allowing customers to buy Tesla cars with Dogecoin (DOGE) to seemingly incessant support on social media, Musk has made his adoration for crypto known over the years. However, Musk and Tesla showed that some actions speak louder than words.\n\nIn February 2021, the company made a landmark investment of $1.5 billion in Bitcoin. The investment was meant to earn extra returns on cash that would have earned little to no interest otherwise. At the time of the announcement, Bitcoin's price was hovering around $37,000. However, the price quickly spiked to over $50,000 on the news.\n\nIn March 2021, Bitcoin rose to a price above $60,000, reaching an all-time high. Because of this, Tesla decided to sell roughly 10% of its Bitcoin holdings for a sizable gain. Specifically, it sold 4,320 Bitcoins to receive net proceeds of over $250 million. Tesla's stock price fell around 20% in the same timeframe.\n\nDon't Miss:\n\nTesla continued to hold nearly 40,000 Bitcoins throughout the rest of 2021 and into 2022. However, in June 2022, it sold a large portion of its holdings. These sales totaled nearly 30,000 Bitcoins or about 75% of its total holdings. According to Musk, the sale was intended to show Bitcoin's liquidity and ability to support large transactions and give Tesla some extra cash in the event of an economic downturn.\n\nThe sale was untimely, as Bitcoin was trading below $20,000, hitting 18-month lows. While the price of Bitcoin continued to fall throughout the rest of 2022, Bitcoin did extremely well in 2023, appreciating nearly 150% and reversing the difficulties seen in 2022.\n\nStory continues\n\nBecause of this, one can't help but wonder how much Tesla's huge Bitcoin portfolio could have been worth if it had not sold. At the beginning of 2024, just before the approval of the spot Bitcoin exchange-traded funds (ETFs), the price of Bitcoin briefly surpassed $47,000. If Tesla had held onto its original investment of 43,200 Bitcoins, it would have been worth just over $2 billion at $47,000 per Bitcoin.\n\nThis means that Tesla missed out on an extra $500 million in profit had it not sold its Bitcoin in March 2021 and June 2022.\n\nTesla still holds 9,720 Bitcoins, worth around $400 million at current prices. It will be interesting to see whether it holds on to the tokens in 2024 or sells. In the past, sales of Bitcoin have come when the price rises to new highs or when Tesla is in a tough spot financially. For the first case, some experts believe that Bitcoin could have a strong 2024 and potentially reach new all-time highs, which could spark a sale of Bitcoin. Conversely, Tesla has not had many issues with cash recently, and a soft landing is looking to be more feasible, giving reason to believe that Tesla could continue holding on to its Bitcoin reserves.\n\nEither way, it will be interesting to see what 2024 has in store for Bitcoin, Tesla and Tesla's Bitcoin holdings.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article Tesla Missed $500 Million In Bitcoin Gains: Will It Sell The Remaining 9,700 BTC? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
]