[
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTI0L2JpdGNvaW4tcy1idGMtcG9zdC1ldGYtc2x1bXAtcGF1c2VzLWFzLWNoYXJ0cy1zaWduYWwtcGl2b3RhbC10ZXN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin's Post-ETF Slump Pauses as Charts Signal Pivotal Test - Bloomberg",
        "content": "Bitcoin paused a retreat that began after US exchange-traded funds for the largest digital asset began trading on Jan. 11 and now faces a pivotal test if key charts are right.\n\nThe token rose as much as 3.4% on Wednesday before paring some of the gain to trade at $40,180 as of 6:55 a.m. in New York. It’s down almost 20% from an intraday peak of $49,021 when the ETFs went live, as fanfare about the products gives way to uncertainty over the eventual scale of demand for them."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTI0L2ZpZGVsaXR5LWFuZC1ibGFja3JvY2stYXJlLWRvbWluYXRpbmctdGhlLWJpdGNvaW4tZXRmLWZsb3ctcmFjZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Spot-ETF Flow Race Dominated by Fidelity, BlackRock (FBTC, IBIT) - Bloomberg",
        "content": "Less than two weeks after US regulators fired the starting gun for ten spot Bitcoin exchange-traded funds, it’s increasingly looking like a two-horse race for new assets.\n\nBlackRock’s iShares Bitcoin Trust (ticker IBIT) and the Fidelity Wise Origin Bitcoin Fund (FBTC) are leading the field with about $1.9 billion and $1.6 billion of inflows, respectively, according the latest available data compiled by Bloomberg. That’s roughly a combined 70% of spot Bitcoin ETF inflows so far Bloomberg Terminal ."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTI0Ly1hbGFtZWRhLWdhcC1rZWVwcy1iaXRjb2luLXZvbGF0aWxlLWV2ZW4td2l0aC1ldGZzLWJvb3N0aW5nLXRyYWRpbmctdm9sdW1l0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin Price (BTC) Stays Volatile Even With Spot ETFs Boosting Trading Volume - Bloomberg",
        "content": "A dearth of liquidity in the digital-asset market continues to roil Bitcoin, even with the first US exchange-traded funds to hold the cryptocurrency logging billions of dollars in trading volume since their debut.\n\nThe ability to easily or quickly buy and sell the digital currency hasn’t improved since the 10 funds began trading Jan. 11, traders say. Liquidity is especially important in a relatively new market such as crypto, where a single large trade can have an outsized impact on an asset price, raising the risk of manipulation."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjQvMDEvMjQvYml0Y29pbi13cmVzdGxlcy13aXRoLTQwMDAwLWFzLWl0LXRyaWVzLXRvLXJlY292ZXItcmVjZW50LWxvc3Nlcy1jbmJjLWNyeXB0by13b3JsZC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin wrestles with $40,000 as it tries to recover recent losses - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin wrestles with $40,000 as it tries to recover recent losses: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Core Scientific CEO Adam Sullivan discusses the company's reorganization and re-listing of shares on the Nasdaq."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nYnRjLXNoZWRzLWFzc2V0cy1yaXZhbC1iaXRjb2luLTIzMzcyOTcwMS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 24 Jan 2024 08:00:00 GMT",
        "title": "GBTC Sheds Assets as Rival Bitcoin ETFs Add Investors - Yahoo Finance",
        "content": "ETF Investing Tools\n\nThis week has continued the dueling spot bitcoin ETF narratives of Grayscale GBTC shedding assets at a fast clip but inflows to nine other products rising.\n\nTuesday outflows of $515 million brought this week’s total to over $1.15 billion. The Grayscale Bitcoin Trust ETF (GBTC) has lost nearly $4 billion in assets in the eight trading days since the Securities and Exchange Commission approved the new products. Its rivals gained $409 million in assets on Tuesday to raise their weekly inflows to $963 million. They have received nearly $5 billion in inflows since their Jan. 11 unveilings. Wednesday totals were unavailable at the time of publication.\n\nStill, Bloomberg Senior ETF Analyst Eric Balchunas struck an optimistic tone about what he has called “The Great GBTC Gouge,” in a post on X/Twitter.\n\n“Total rolling net flows down to +$983m as Nine loses a bit of ground despite $GBTC flows being slightly less bad,” Balchunas wrote, noting that BlackRock’s iShares Bitcoin Trust (IBIT) and the Fidelity Wise Origin Bitcoin Fund (FBTC) inflows continued at a $1 billion per week pace that only Vanguard’s VOO could match.\n\nHe added that both were a “near lock” to reach $2 billion in inflows by the week’s end.\n\n“Also this shows volume and discount (which were really low for GBTC yest) may emerge as best predictors of the flow coming later (vs the transfer number ppl report each morning),” Balchunas wrote.\n\nThe opposing trends have formed quickly since the SEC reversed a decade of objections on Jan. 10 to give a thumbs-up to 11 products based primarily on the spot price of bitcoin, including a Grayscale proposal to convert its GBTC trust into an ETF. Analysts have speculated that many Grayscale customers sold their shares to take profits after investing at a low price during the extended crypto bear market, which began in late 2021, or to move into competing products that charge a lower fee.\n\nGrayscale charges 1.5%, while Bitwise, among others, has waived its fee for the first six months on the first $1 billion of assets. On Monday, GBTC had dropped more than 13% of its outstanding shares. Balchunas and fellow Bloomberg analyst James Seyffart have predicted that the company would lose around 25% of its shares.\n\nStory continues\n\nBitcoin's Price Fade\n\nBitcoin’s was recently trading slightly above $40,100, a roughly 1.7% gain over the past 24 hours. But the price of the largest cryptocurrency by market capitalization has dropped about 20% since the approvals. Bitcoin dipped below $16,500 last January before rallying with a good portion of the gains coming later in the year amid rising hopes for a spot bitcoin ETF approval.\n\n“GBTC continues to bleed assets as investors swap out of the relatively expensive fund into cheaper alternatives,” etf.com analyst Sumit Roy wrote. “Selling by arbitrageurs, who bought the fund at a discount to its net asset value, has also likely contributed to the outflows.”\n\nHe added: “Bulls argue that inflows will pick up once the GBTC outflows are exhausted. A more bearish interpretation would be that most of the money flowing out of GBTC is flowing into these other spot bitcoin ETFs, so the modest $1 billion of net inflows for spot bitcoin ETFs that we’ve seen so far already reflects the true demand for spot bitcoin ETFs.\n\nGrayscale \"Dominating Trading Volume\"\n\nIn a statement emailed to ETF.com, Grayscale’s John Hoffman, Grayscale’s managing director of sales & distribution, wrote that GBTC had “launched as the world’s largest spot Bitcoin ETF,” and “been dominating trading volume.”\n\n“Broadly speaking, large capital markets ETFs are used in a variety of investing strategies, and we anticipate GBTC’s diverse shareholder base will continue to deploy strategies that impact inflows and outflows,” he wrote.\n\n\n\n\n\nPermalink | © Copyright 2024 etf.com. All rights reserved"
    }
]