[
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTIyL2JpdGNvaW4tc2xpcHMtYmFjay10b3dhcmQtNDAtMDAwLWFzLWV0Zi1oeXBlLXNpbW1lcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "(BTC) Bitcoin Price Slips Back Toward $40,000 As ETF Hype Simmers - Bloomberg",
        "content": "Bitcoin fell below $40,000 for the first time since early December as enthusiasm over the launch of exchange traded funds that directly invest in the largest cryptocurrency ebbs.\n\nThe digital currency token fell as much as 5.3% to $39556 as of 2:42 pm in New York on Monday. That’s the lowest since Dec. 4. Smaller tokens like Ether and Solana were down 6.7% and 9.3% respectively."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMjIvYml0Y29pbi1icmllZmx5LWRpcHMtYmVsb3ctNDAwMDAtZm9yLXRoZS1maXJzdC10aW1lLXRoaXMteWVhci0uaHRtbNIBZ2h0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDI0LzAxLzIyL2JpdGNvaW4tYnJpZWZseS1kaXBzLWJlbG93LTQwMDAwLWZvci10aGUtZmlyc3QtdGltZS10aGlzLXllYXItLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin briefly dips below $40,000 for the first time this year - CNBC",
        "content": "Bitcoin extended its losses on Monday, dipping below $40,000 for the first time this year and pulling the rest of the crypto market down with it.\n\nThe price of bitcoin was last lower by 3.9% at $40,052.76, according to Coin Metrics. Earlier, it fell to $39,414.80, its lowest level since Dec. 3. Ether dropped 5% to $2,333.00.\n\nBitcoin is still in its correction phase following the launch of several spot bitcoin exchange-traded funds in the U.S. for the first time ever. In the months leading up to the U.S. Securities and Exchange Commission giving the green light to begin trading, investors bought bitcoin in anticipation of the approval.\n\n\"Today's bitcoin move is wholly expected,\" said Sylvia Jablonski, CEO and chief investment officer at Defiance ETFs. \"It looks like a 'sell-the-news' pullback, before we see the cryptocurrency recapturing its bullish trajectory.\""
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMjIvYml0Y29pbi1pcy1ub3ctYS1nb29kLXRpbWUtdG8taW52ZXN0Lmh0bWzSAU1odHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyNC8wMS8yMi9iaXRjb2luLWlzLW5vdy1hLWdvb2QtdGltZS10by1pbnZlc3QuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin was up 155% in 2023—but should you invest? Here's what experts say - CNBC",
        "content": "Cryptocurrency investors spent much of 2023 waiting for good news. Following the late 2022 collapse of FTX — at the time the world's largest cryptocurrency exchange — popular digital currency bitcoin traded just north of $16,000 to start the year, a far cry from the more than $60,000 it traded for during 2021's crypto boom. Over the last few months, though, things began looking up. Crypto investors became more and more convinced that the SEC would approve a years-long effort from fund companies to bring a spot bitcoin exchange-traded fund to market, a move crypto boosters expected to stoke demand for the popular coin. By the time news broke on Jan. 10 that 11 new bitcoin ETFs would begin trading, crypto investors were taking a victory lap, having bid the coin's price up by 155% in calendar year 2023. So, what now? Are we off to another crypto bull market, or have bitcoin enthusiasts gotten ahead of themselves? \"This is definitely an inflection point,\" says Brian Vendig, president of MJP Wealth Advisors in Westport, Connecticut. Here's what he and other experts say to expect from here.\n\nExpect more demand, and more new funds\n\nThe new wave of bitcoin ETFs makes it easier than ever for investors in more traditional assets, such as stocks and bonds, to dip their toes into crypto. Instead of having to open a separate account to buy crypto — often with high trading fees — investors in the ETFs can hold bitcoin right alongside their other investments in their brokerage accounts. That's just the beginning, says Matthew Sigel, head of digital assets research at VanEck, an investment firm that offers one of the 11 new funds. \"We think it was a huge step forward that will unlock significant demand, given the cost savings for the retail buyer and security available to institutional purchasers,\" he says. The new ETFs will soon allow advisors who deal with high net worth clients and big money institutions to start incorporating crypto into their portfolios, he adds. \"They don't have the ability to put these bitcoin ETFs into client discretionary portfolios, yet,\" Sigel says. \"But we can observe several banks and brokers already preparing these models, which we expect to emerge later this year.\" Expect more new crypto ETFs, too — and in different flavors. \"It seems inevitable that we'll have ETFs tied to ether, as a secondary cryptocurrency for people to invest in,\" says Todd Rosenbluth, head of research at VettaFI. In the meantime, he says, \"the door is now open for a range of ETFs that include bitcoin as well as other assets.\" Experts say these might be as simple as portfolios that combine bitcoin exposure with mainstream investments, such as those in the S&P 500. More complex so-called alternative strategies are likely to emerge as well, such as funds that use a bitcoin holding to hedge against the performance of other investments.\n\nThe outlook for crypto: 'It's all still speculation'"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzU4N2RmNWM2LTQzYjctNDdkZi1iMjgzLTI5NmFjNGEwNGEyNtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "SEC says false bitcoin post came after phone number was switched - Financial Times",
        "content": "Print this page\n\nA false post on the official X social media page of the US Securities and Exchange Commission that prematurely claimed it had approved new bitcoin investment products appeared after a hacker took control of the mobile phone number linked to the account, according to the regulator.\n\nThe widely shared post on January 9 saying that the SEC had given the green light to the first bitcoin exchange traded funds momentarily sent the cryptocurrency sector into a frenzy. It was quickly disavowed by the agency, which announced its bona fide approvals a day later.\n\nThe SEC on Monday said it determined that an unauthorised party had deployed an apparent “SIM swap”, which involves transferring a mobile phone number to a different device without the owner’s permission. The password for the SEC’s account on X was then changed.\n\nThe number transfer occurred via the telecommunications carrier rather than through the agency’s systems, the SEC said. The regulator added it had not found any evidence that the hacker gained access to its systems, devices, data or other social media accounts.\n\nThe agency also disclosed that X in July had disabled multi-factor authentication at the SEC’s request “due to issues accessing the account”. The procedure was reinstated after the page was breached and was enabled for all SEC social media accounts offering such authentication, the regulator said.\n\nThe mishap was an embarrassment for the agency after its chair Gary Gensler made cyber security a pillar of his agenda, adopting rules that require businesses be more vigilant about cyber risks.\n\nWhile the hack was not serious by cyber standards, given that it did not affect the SEC’s own systems, analysts found the absence of two-factor authentication, first disclosed by X, to be an easily avoidable faux pas. “We encourage all users to enable this extra layer of security,” X said the day of the incident.\n\nThe fake post came as Wall Street eagerly awaited SEC authorisation of the first-ever spot bitcoin ETFs, which enable ordinary investors to hold the cryptocurrency in their brokerage accounts. Gensler has expressed scepticism over crypto, calling the markets the “wild west”.\n\nGensler has adopted a tough enforcement stance against crypto and argued that many digital tokens are securities that fall directly within the agency’s purview. The SEC already regulates ETFs.\n\nThe day of the hack, Gensler posted on his own X account 10 minutes after the fake post was published, saying the regulator’s account had been “compromised” and no ETF approvals had been granted.\n\nThe regulator on Monday said it was still co-ordinating with law enforcement as well as federal agencies including the FBI, the Department of Homeland Security, and the Commodity Futures Trading Commission. According to the SEC, the probe’s focus includes how the hacker had the telecoms carrier change the SIM and how they became aware of the account’s number."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzNlOTgwMTM5LWM4MWQtNDk5MS1iMWQ1LTg2MDkxNWI4MjQ1NdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 22 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETF fee war spreads to Europe - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Exchange traded funds myFT Digest -- delivered directly to your inbox.\n\nLatest news on ETFs Visit our ETF Hub to find out more and to explore our in-depth data and comparison tools\n\nInvesco and WisdomTree have slashed fees by more than 60 per cent on European bitcoin products as an “unprecedented” number of new exchange traded funds have become available to US investors.\n\nThe US Securities and Exchange Commission approved spot bitcoin ETFs this month from the likes of BlackRock, Fidelity and Invesco.\n\nThis has led to an “unprecedented supply of new products” for US investors, said Gary Buxton, Invesco head of ETFs for Europe, the Middle East and Africa, and Asia Pacific.\n\nPreviously such investors would have had to look to Canadian or European providers for exchange traded exposure to the cryptocurrency, experts said.\n\nThis article was previously published by Ignites Europe, a title owned by the FT Group.\n\n“Multiple” providers have lowered fees as the US market “worked to find the new equilibrium between supply and demand” and the resulting range of prices is “considerably lower” than existing tracking products in Europe, Buxton said.\n\nArk Investment Management had indicated it would price its US ETF at 0.8 per cent but instead launched with no fees for the first six months or until assets reach $1bn (€920m). After that it will charge 0.21 per cent.\n\nBlackRock investors will pay 0.25 per cent for its product, although early investors can access it at 0.12 per cent for the first year until assets reach $5bn.\n\nThe US “price wars” have settled at a level around 30 basis points, said HanETF chief executive Hector McNeil.\n\nBelow 30 bps, providers “can’t make money” unless they attract “billions” of assets under management, McNeil said. He suspected “most” would not and would therefore close in the “medium term”.\n\nWisdomTree and Invesco have reacted by cutting fees by over 60 per cent on European-listed bitcoin exchange traded products.\n\nFees on the $325mn WisdomTree Physical Bitcoin ETP will fall from 0.95 per cent to 0.35 per cent, while fees on the $137mn Invesco Physical Bitcoin ETP will drop from 0.99 per cent to 0.39 per cent.\n\nBoth changes were announced within days of each other and will come into effect before the end of the month.\n\nInvesco’s US product will waive its fees for six months or when it reaches $5bn, at which point it will charge 0.39 per cent — the same as the newly announced price on its European product.\n\nWisdomTree Europe head Alexis Marinof said the launch of spot bitcoin ETFs in the US had “captured a lot of attention in Europe”.\n\nMany investors “aren’t aware” that they have been able to access the same exposure through physically backed ETPs since 2019, Marinof said.\n\n“The launch of spot bitcoin ETFs in the US is helping the crypto market to evolve as the asset class continues to stake a claim for a place in client portfolios,” he added.\n\nIn Europe virtually all digital assets exchange traded products are structured as exchange traded notes, rather than funds. Investors in ETNs own a debt security, while ETF shareholders owns a portion of a fund’s underlying assets.\n\nLatest news on ETFs Visit the ETF Hub to find out more and to explore our in-depth data and comparison tools helping you to understand everything from performance to ESG ratings\n\nUS-based ETF specialist VanEck has said it plans to be “more aggressive” in marketing its crypto products in Europe following the SEC decision.\n\nMartijn Rozemuller, chief executive of VanEck’s European business, said that as well as boosting investor interest in cryptocurrency, the SEC’s decision had “probably helped” VanEck’s brand in Europe due to the media coverage of its bitcoin ETF.\n\nUS-listed products may be more liquid and therefore attract European investors, said 7IM senior investment manager Peter Sleep. This is because it is a bigger market and is not spread across multiple exchanges like in Europe, he says.\n\nSpreads, tax and custody arrangements are also important considerations, said McNeil.\n\n*Ignites Europe is a news service published by FT Specialist for professionals working in the asset management industry. Trials and subscriptions are available at igniteseurope.com.\n\n\n\n"
    }
]