[
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTA4L2JsYWNrcm9jay1hcmstZmlsZS1hbWVuZGVkLWZvcm1zLWluLWZpbmFsLXB1c2gtZm9yLWJpdGNvaW4tZXRmc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "BlackRock, Ark File Amended Forms in Final Push for Bitcoin ETFs - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjQvMDEvMDgvYXJrLWludmVzdC1jZW8tY2F0aGllLXdvb2Qtb24tc3BvdC1iaXRjb2luLWV0Zi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "ARK Invest CEO Cathie Wood on spot bitcoin ETF - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nARK Invest CEO Cathie Wood on spot bitcoin ETF\n\nARK Invest CEO Cathie Wood joins CNBC's 'Halftime Report' to share her expectations for the spot bitcoin ETF approval and more."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jbmJjLmNvbS92aWRlby8yMDI0LzAxLzA4L2JpdGNvaW4taGl0cy1oaWdoZXN0LWxldmVsLW5lYXJseS10d28teWVhcnMtZGVhZGxpbmUtc3BvdC1ldGYtbG9vbXMtY25iYy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin touches highest level in nearly two years as deadline for spot ETFs looms - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin touches highest level in nearly two years as deadline for spot ETFs looms: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Ben McMillan, CIO of IDX Digital Assets, breaks down what a spot bitcoin ETF in the U.S. could mean for retail investors."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMDgvYml0Y29pbi1jbGltYnMtYmFjay10by00NTAwMC1hcy1pbnZlc3RvcnMtYXdhaXQtZXRmLWRlY2lzaW9uLXRoaXMtd2Vlay5odG1s0gFvaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjQvMDEvMDgvYml0Y29pbi1jbGltYnMtYmFjay10by00NTAwMC1hcy1pbnZlc3RvcnMtYXdhaXQtZXRmLWRlY2lzaW9uLXRoaXMtd2Vlay5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin touches $47,000 for the first time since April 2022 as investors brace for landmark ETF decision - CNBC",
        "content": "Bitcoin rose to a 21-month high to start the week as investors awaited the potential approval of a U.S. bitcoin exchange-traded fund this week.\n\nOn Monday, the cryptocurrency was last higher by more than 6% to $46,924.38, according to Coin Metrics, as BlackRock , Grayscale and other potential bitcoin ETF issuers submitted final updates to the U.S. Securities and Exchange Commission, including key fee disclosures that bolstered investors' confidence that an approval is more likely than not.\n\nEarlier, it rose as high as $47,238.92. The last time it traded over $47,000 was April 2022.\n\n\"It's a price war,\" said Jim Angel, an associate professor specializing in financial market structure at Georgetown University's McDonough School of Business. \"Multiple vendors are coming out of the gate with a nearly identical commoditized product and the only way they can compete is on price.\"\n\nThe SEC is approaching its first deadline to approve or reject one of the ETF applications — that of Ark 21Shares on Wednesday. It is widely expected the agency will approve several applications at once to even the playing field.\n\n\"Approval is inevitable,\" former SEC chair Jay Clayton told CNBC's \"Squawk Box\" on Monday when asked what could happen this week. \"There's nothing left to decide. … This is a big step not just for bitcoin, but for finance generally.\""
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvd2h5LXRoZS1uZXctYml0Y29pbi1ldGYtbWF5LW5vdC1oYXZlLXRoZS1pbXBhY3QtdGhlLW1hcmtldC1pcy1hc3N1bWluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 08 Jan 2024 08:00:00 GMT",
        "title": "Why the New Bitcoin ETF May Not Have the Impact the Market Is Assuming - Nasdaq",
        "content": "This week, the SEC is expected to give their decision on a proposed spot bitcoin ETF and, according to some analysts, approval is just about guaranteed. Crypto traders have believed that for some time, resulting in big gains in BTC/USD in the last couple of months of last year taking bitcoin (BTC) up to around $45k. That has had one interesting effect: The people who said, once again, that BTC was going to zero earlier last year when it had dropped to around $20k have disappeared for some reason, just as they have every time it has jumped.\n\nYou would think after being so wrong so many times, these bears would have learned that BTC is here to stay, but it seems not. Ironically, now that the permabears are in hiding, this might actually be a good time to be at least somewhat bearish.\n\nIt is not that a spot ETF won’t have a positive impact on demand for bitcoin. It obviously will, given that the fund will have to own the asset to back it, but the massive gains in BTC/USD that we have seen look overdone, and a “buy the rumor, sell the fact” pattern shortly after the approval is announced this week is starting to look very likely. It is funny how a reversal in direction in any market for any reason can be an “Emperor has no clothes!” moment for traders and investors, so if a post-announcement drop does come, it could easily prompt a rethink about the beliefs underpinning the run up.\n\nThe problem is that the doubling in BTC/USD rests largely on one major, but possibly flawed assumption: that it will result in a big increase in institutional investment in bitcoin. However, there are reasons to doubt that.\n\nFirst, unlike when I first started writing about bitcoin in 2014, ownership of crypto is now not a fringe thing limited only to a few computer nerds and some like me who just found the idea of a trustless, peer to peer, currency a fascinating concept. Nor is it still something that requires jumping through some pretty daunting, and to be honest, shady hoops to achieve these days. Accessible wallets and exchanges are commonplace, making bitcoin no more difficult to own and trade than other, more conventional currencies.\n\nMajor U.S. institutions have therefore been involved in trading and owning crypto for a few years now, leaving no reason why an ETF will prompt a huge jump in institutional ownership. That is especially true given the other factor that seems to be being overlooked.\n\nOne of the things that I have observed in my forty years or so in and around markets is that every institutional trader understands the cumulative negative impact of fees on an investment. They are happy to charge them to retail investors like you and me, but will go out of their way to avoid paying them themselves. So, even though Grayscale announced that they were reducing their proposed annual management fee on the fund to 1.5% from 2%, that is still a significant convenience charge for institutions that could set up their own bitcoin trading and storage account without that much more fuss.\n\nNone of this means that BTC/USD won’t greet the news with a pop, assuming the SEC does what everyone expects and approves the ETF this week. It almost certainly will pop, but the question is how long that bullish sentiment will last. If profit taking prompts a post-news dip before long, that could easily turn into a significant correction as the assumptions behind the 100% or so gains in BTC start to be questioned.\n\nThen there is the fact that crypto has become such a polarizing thing in the investment world. It is a love it or hate it thing. Those that love it almost certainly already own it, and those that hate it probably never will. It seems unlikely that there is a big pool of money controlled by people without an opinion that will suddenly be invested in crypto just because there is a spot ETF available.\n\nThere is one other thing worth saying here, though. If there is a drop in BTC/USD on a “buy the rumor, sell the fact” effect following the news this week, it will set up an opportunity for longer-term investors, as the second thing that has been driving recent buying will have a positive impact. Bitcoin’s original white paper created regular “halving” events, where mining becomes exponentially more difficult at certain points, restricting supply. We have seen in the past that those events do give the price of bitcoin a sustained boost, and one is expected in April of this year.\n\nI am not a hater who sees every move up in bitcoin as a movement led by a confederacy of dunces, but nor am I a fanatical libertarian anarchist who believes in it as a way of challenging the very idea of government. I don’t believe that the asset is inevitably headed to a million dollars, nor do I believe it is worthless and headed to zero. I am just an everyday trader and investor who believes that the democratization of money is potentially a good thing, and for whom the potential to make money is paramount. That allows me to see that bitcoin is probably overvalued at current levels and take a bearish view over the next few weeks, but still see the long-term bullish influences that will see it recover to at least these levels, or probably even higher, by the middle of the year.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    }
]