[
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMjYvYml0Y29pbi10cmllcy1mb3ItYS13aW5uaW5nLXdlZWstYXMtaW52ZXN0b3Itd29ycmllcy1hYm91dC1nYnRjLXNlbGwtcHJlc3N1cmUtc3Vic2lkZS5odG1s0gF-aHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjQvMDEvMjYvYml0Y29pbi10cmllcy1mb3ItYS13aW5uaW5nLXdlZWstYXMtaW52ZXN0b3Itd29ycmllcy1hYm91dC1nYnRjLXNlbGwtcHJlc3N1cmUtc3Vic2lkZS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin turns positive for the week as investor worries about GBTC sell pressure subside - CNBC",
        "content": "Jonathan Raa | Nurphoto | Getty Images\n\nBitcoin climbed higher to end the week as investors took some comfort in the idea that outflows from the Grayscale Bitcoin ETF (GBTC) could be starting to taper off. The price of the cryptocurrency climbed nearly 6% to $42,131.57 according to Coin Metrics, pushing its weekly gains into the green. Ether was up 2%, trading at $2,264.73. It's on pace to post a 9% decline for the week.\n\nStock Chart Icon Stock chart icon Bitcoin pulls out of the red for the week"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjQvMDEvMjYvY3J5cHRvLXByaWNlcy1lZmZvcnQtbGF0ZS1zdGFnZS1jb21lYmFjay1jbG9zZS1vdXQtd2Vlay1jbmJjLWNyeXB0by13b3JsZC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Crypto prices effort a comeback as bitcoin soars 5% to close out the week - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nCrypto prices effort a comeback as bitcoin soars 5% to close out the week: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Andy Bromberg, the CEO of the crypto wallet Beam, explains why he thinks spot bitcoin ETFs move away from the original ideals of crypto. He also discusses his company's new acquisition of an app that allows people to pay for online purchases using stablecoins."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ibGFja3JvY2stYml0Y29pbi1ldGYtZmlyc3QtcmVhY2gtMTc0MzEwNDc0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "BlackRock's Bitcoin ETF First to Reach $2B in AUM - Yahoo Finance",
        "content": "The BlackRock iShares Bitcoin ETF (IBIT) on Friday became the first of the recently launched spot bitcoin products to reach $2 billion in assets under management (AUM). This doesn't include Grayscale's GBTC, which had nearly $30 billion in AUM at the time of its conversion from a closed-end fund to a spot ETF.\n\nInvestors added about $170 million to IBIT on Thursday, with the fund purchasing nearly another 4,300 bitcoin {{BTC}}, pushing total tokens held to 49,952. With the price of bitcoin rising well above the $40,000 level early Friday, that brought AUM to above $2 billion.\n\nNow with over $2 billion in AUM, the fund ranks third in asset gathering among all of the more than 600 ETFs that launched in the past year, noted ETF Store president Nate Geraci , who believes IBIT could soon take over the crown as number one.\n\nThe next fund to cross the $2 billion mark is likely to be Fidelity's Wise Origin Bitcoin Fund (FBTC), which held just shy of 44,000 bitcoin as of Jan. 25."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vYml0Y29pbi1ub3RjaGVzLWFib3ZlLTQxay1jb2luYmFzZS0xNTE5MjI2OTUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin notches above $41K, Coinbase upgrade: Crypto news - Yahoo Finance",
        "content": "Shares of cryptocurrency exchange Coinbase (COIN) are trending higher Friday morning following an upgrade from Oppenheimer. The firm upgraded Coinbase's stock from Perform to Outperform, setting a price target of $160 per share.\n\nBitcoin (BTC-USD) is rebounding above $41,000 following a dip a week after spot bitcoin ETFs were approved\n\nYahoo Finance's Seana Smith and Brad Smith break down the details.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Angel Smith\n\nVideo Transcript\n\nBRAD SMITH: Coinbase shares are getting a boost with Oppenheimer upgrading the stock to outperform from perform. And initiating its price target at $160 per share. The analyst behind the call citing Coinbase as a stronger than many people-- has stronger than many people realize. Excuse me. There you're taking a look at the price target $160 here. We were taking a look at the shares a moment ago.\n\nAnd this is actually a lift for the broader kind of crypto and the crypto trading names out there as well. We were tracking Marathon. That's one of the top trending tickers on the \"Yahoo Finance\" platform right now this morning. Pre-market, with about six minutes until the start of trade, and Bitcoin, as well. Perhaps, we can take a quick look at that just to see how things are faring there. Because, ultimately, over the course of this week, there was a lot of concern about whether or not we'd be able to keep this 40,000 level. We eventually got back up to. And now, have exceeded it. We're up by about 3% for Bitcoin here today too.\n\nSEANA SMITH: Yeah. Certainly, we are seeing some optimism creep back into the markets. Again, putting this in perspective, Bitcoin had been under a tremendous amount of pressure ever since we did get that decision from the SEC. A lot of that thought, though, some of that optimism of an approval already baked into the price. So we did see a bit of cooling. And you can see that a bit reflected in that stock chart that we have up there on the screen right now.\n\nSo we are above that 41,000 level now. Question is, how much higher can we climb? Can we get back to that 46,000, 47,000 level that we saw not too long ago. And again, because we're seeing the price of Bitcoin rise here, obviously, other names like Coinbase among the big leaders in today's market action.\n\nBut Oppenheimer here in this upgrade of Coinbase calling out a number of catalysts here. One, the prospect of stronger earnings, and also improving fundamentals. Because of that, they're raising the price target to 160. About $40 higher than where it's trading today."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzllOWZhZmQ4LWM4NmQtNDg4OS04OTdhLTY5MDM4MGNkYjViY9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 26 Jan 2024 08:00:00 GMT",
        "title": "The bitcoin ETF market's single point of failure - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Cryptocurrencies myFT Digest -- delivered directly to your inbox.\n\nHello and welcome to the latest edition of the FT’s Cryptofinance newsletter. This week, we’re looking at Coinbase’s role in the industry’s newly approved bitcoin ETFs.\n\nAfter two weeks of life, there are some things we know about the string of bitcoin exchange traded funds that have proliferated on US stock markets.\n\nThe largest, Grayscale Bitcoin Investment Trust, is experiencing a huge outflow of assets. The regulatory approval that opened the door for more investors to get exposure to bitcoin can also be the passage to leave a service you’re unhappy with, or simply exit the market altogether.\n\nWe also know that sometimes it’s better to travel than arrive. Since approval was confirmed bitcoin is down about 15 per cent.\n\nBut an important point has thus far flown under the radar: the safety and security of the bitcoins on which the ETFs are built.\n\nLegally speaking the ETF sponsors such as BlackRock, Grayscale, Ark etc hold the bitcoins in a trust; in practice the assets are held by a custodian on behalf of the trust. Eight of the 11 sponsors have chosen Coinbase as their custodian. Fidelity is using its own digital asset custody business.\n\nThis raises eyebrows for two reasons: first, the exchange is being sued by the US Securities and Exchange Commission for allegedly failing to register as a national securities exchange, among other things.\n\nIn one — narrow, legal — sense, that lawsuit focuses “only” on whether Coinbase filled in correct forms or not. It doesn’t pass judgment on Coinbase’s capabilities or business practices. Even if the SEC is successful, the lawsuit won’t necessarily hinder Coinbase’s ability to offer custodial services to clients.\n\nSecondly and more importantly — and I will emphasise this contradiction for as long as the word decentralisation is synonymous with crypto — Coinbase’s dominance of the custody market is a major single point of failure for the new sector.\n\nAnyone who has paid attention to crypto for even five minutes knows the problems this market has always had in holding and protecting other people’s assets.\n\nMt. Gox customers are still waiting for their money after a hack in 2014 caused the infamous exchange to fail. Investors in Celsius and of course, FTX, are still trying to get their money back.\n\nCoinbase is a different entity and says it maintains very strict walls between its operations. Its exchange and custody business shouldn’t be at risk from market volatility.\n\nStill, imagine — hypothetically of course — that Coinbase was hacked or it suddenly collapsed in the manner of many crypto companies before it. What then?\n\n“There is always a risk that a custodian could collapse, and I think the risk is heightened whenever you’re talking about a less mature market, like crypto is,” said Jeremy Senderowicz of law firm Vedder Price.\n\nI reached out to each of the eight firms with Coinbase, and asked them what their Plan B was, as a back up. Only two responded. WisdomTree and Grayscale both said they could choose to change custodian at their own discretion.\n\nBut we’ve seen crypto companies collapse at speed: will the sponsors be fast enough to react? And if not, what happens to the stranded assets?\n\nBlackRock’s prospectus — to take one example — makes things pretty clear.\n\n“There is a risk that customers’ assets — including the Trust’s assets — may be considered the property of the bankruptcy estate of . . . the bitcoin custodian, and customers — including the Trust — may be at risk of being treated as general unsecured creditors of such entities and subject to the risk of total loss or markdowns on value of such assets.”\n\nGrayscale’s risk factors are similarly blunt: “The legal rights of customers with respect to digital assets held on their behalf by a third-party custodian, such as the Custodian, in insolvency proceedings are currently uncertain.”\n\nOuch. It’s not much better if the custodian is hacked.\n\nBlackRock says its bitcoin custodian has insurance coverage “of up to $320mn that covers losses of the digital assets it custodies on behalf of its clients”. That’s not a lot to cover $2bn of assets under management.\n\nIn fairness to Coinbase, it recognises its unique position. “We are committed to sharing and creating transparent industry standards to develop the security capability of industry peers, and welcome the future diversification of custodianship,” Philip Martin, the exchange’s chief security officer, told me.\n\nCompetition for custody business seems to be on its way. Anchorage Digital Bank — which holds a bank charter from the US Office of the Comptroller of the Currency — has designs on the market.\n\n“We’re the natural diversification partner for ETF issuers,” chief executive Nathan McCauley told me on Wednesday. “We’re spending a lot of time, energy and effort to make sure we capture that.”\n\nFrom a risk management perspective, diversification is always handy. But if a crypto Willie Sutton appears, ETF investors large and small have the same minimal safety net that purchasers of cryptocurrencies have.\n\nWhat’s your take on Coinbase’s role as custodian for so many bitcoin ETFs? As always, email me at scott.chipolina@ft.com.\n\nWeekly highlights\n\nWhile we’re on the subject of bitcoin ETFs, don’t miss my story this week on bitcoin losing 15 per cent of its value over the past two weeks. Underwhelming flows into the newly approved league of bitcoin ETFs have — so far — given the lie to the market’s assumption that new investors would be drawn into bitcoin.\n\n\n\nThe Bank of England and HM Treasury on Thursday responded to a public consultation that brings the UK potentially closer to launching a digital pound. Concerns surrounding user privacy were raised last year, but this week the BoE and HMT committed to introduce primary legislation to parliament aimed at protecting the public’s financial privacy should a digital pound be eventually rolled out.\n\nSoundbite of the week: Drawing battle lines\n\nYou may recall the US Office of Foreign Assets Control imposing sanctions on crypto mixing service Tornado Cash, alleging the platform helped launder billions of dollars worth of illicit funds linked to North Korea-backed criminal hackers.\n\nRoman Storm, one of the developers behind the service, also faces a criminal trial to answer charges of money laundering and the violation of sanctions rules. He has pleaded not guilty.\n\nNow he is seeking crowdfunding to pay for his defence.\n\nFolks, I need your help. Whether you’re a passionate developer like me involved with Web 3, or you just care about software and privacy, this legal battle will affect you, so please help contribute to my legal defence because this case will set a major precedent for years to come.”\n\nData Mining: Ether falls with bitcoin\n\nBitcoin went on a four-month surge on expectations that the SEC would finally approve exchange traded funds. The second-largest cryptocurrency, ether, is also on the same regulatory journey — but its price isn’t enjoying the same boost.\n\nLike bitcoin, it has dropped since the SEC approved the first spot crypto exchange traded funds. This week the SEC pushed back the date for approval of an ether ETF again but there’s still several months to go before the regulator runs out of road and has to make a decision.\n\nBut the market seems to have learned an important lesson: the approval of an exchange traded fund doesn’t necessarily mean the price of the underlying asset is going to fly. Who knew?\n\nFT Cryptofinance is edited by Philip Stafford. Please send any thoughts and feedback to cryptofinance@ft.com."
    }
]