[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTE1L2NvaW5iYXNlLWNvaW4tYXQtY2VudGVyLW9mLWJpdGNvaW4tYnRjLWV0Zi1tYWNoaW5lLXJhaXNlcy1jb25jZXJuc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Coinbase (COIN) at Center of Bitcoin (BTC) ETF Machine Raises Concerns - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyNC0wMS0xNS9jb2luYmFzZS1jZm8taGFhcy1vbi1iaXRjb2luLWNyeXB0by1yZWd1bGF0aW9uLWRhdm9zLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Coinbase CFO Haas on Bitcoin, Crypto Regulation: Davos - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjQvMDEvMTUvYW5hbHlzdC1leHBsYWlucy1yZWFzb25zLWJlaGluZC1iaXRjb2luLXNlbGwtb2ZmLWZvbGxvd2luZy1ldGYtbGF1bmNoLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Analyst explains reasons behind Bitcoin sell-off following ETF launch - CNBC",
        "content": "In this video\n\nShare Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nAnalyst explains Bitcoin's sell-off following the ETF launch\n\nMarkus Thielen of 10x Research breaks down the price correction for Bitcoin following the SEC's approval for spot Bitcoin ETFs."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcmdlbnRpbmEtc2Vlcy1maXJzdC1iaXRjb2luLXJlbnRhbC0xMzE5NTA5MjcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "Argentina Sees First Bitcoin Rental Agreement - Yahoo Finance",
        "content": "Argentina Sees First Bitcoin Rental Agreement\n\nIn a first for the country, a rental agreement denominated in Bitcoin was registered in Rosario, Argentina's third most populous city, according to local media reports on January 11, 2024.\n\nThe contract stipulates that the tenant will pay the equivalent of $100 in BTC per month to the landlord. Fiwind, a national cryptocurrency exchange, will be used to determine the exchange rate and execute the payments.\n\nThis type of rental agreement became possible following the executive order issued by President Javier Milei last year, which opened the door for contracts denominated in cryptocurrencies. While Bitcoin has been used in real estate sales before, this appears to be the first instance of its use in an Argentine rental contract.\n\nSpeaking on the executive order last month, Foreign Minister Diana Mondino clarified that lease agreements can now be settled not only in Bitcoin but also other cryptocurrencies and assets. However, the order faces legal challenges and could still be rejected by Congress."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jb2luc2hhcmVzLWJpdGNvaW4taGFsdmluZy1zcXVlZXplLW1pbmVycy0wNDU2MDI4MjguaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 15 Jan 2024 08:00:00 GMT",
        "title": "CoinShares: Bitcoin Halving to Squeeze Miners' Margins - Yahoo Finance",
        "content": "CoinShares: Bitcoin Halving to Squeeze Miners' Margins\n\nAs the next Bitcoin halving event approaches, mining firms are bracing for significant cost increases. CoinShares has analyzed the impact of the halving and identified the companies best positioned to weather the storm in a recent report. The halving event, scheduled for April 2024, will reduce the block reward given to miners by half, slowing down the rate of new Bitcoin creation. This will likely lead to an increase in the cost of production and cash costs for miners.\n\nCoinShares predicts that the average cost of production and cash costs will increase from approximately $16,800 and $25,000 per Bitcoin in the third quarter of2023 to $27,900 and $37,800, respectively. The analysis suggests that Bitcoin mining firms Riot, TeraWulf, and CleanSpark are best positioned to navigate the halving event due to their cost structure and long runways. However, all miners will face challenges if the Bitcoin price falls below $40,000.\n\nCoinShares points out that while most miners are improving their fleet efficiency, the direct cost structure is not improving since they will need to increase their power draw and energy consumed to mine the same amount of Bitcoin. Electricity costs per Bitcoin pre- and post-halving form about 68% and 71% of miners' total cost structure, respectively.\n\nThe analysis also highlights the challenges faced by Core Scientific, which recently closed an oversubscribed $55-million equity financing round in an effort to return to solvency. Overall, the Bitcoin halving event will likely squeeze miners' margins, and only the most efficient and well-positioned firms will be able to remain profitable.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    }
]