[
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2lucy1maXJzdC13YWxsZXQtc2Vlcy0xLTE3LW0taW4tc3VycHJpc2UtdHJhbnNhY3Rpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin's first wallet receives $1.17M in surprise transaction - Cointelegraph",
        "content": "An unidentified Bitcoin user transferred 26.9 Bitcoin (BTC) worth $1.17 million to the genesis wallet — the first ever wallet on the Bitcoin network set up by Satoshi Nakamoto, the pseudonymous creator of Bitcoin.\n\nThe Bitcoin transaction occurred on Jan. 5 at 1:52 am Eastern Time. The amount was sent from an emptied wallet to the genesis wallet, accompanied by a transaction fee of $100, notably higher than the average.\n\nThe wallet’s initial funding involved moving funds from three wallets to 12 others. Most of the funds originated from a wallet associated with Binance on Arkham Intelligence, a blockchain analytics platform.\n\nConor Grogan, a director at Coinbase, posted on X (formerly Twitter) that the transaction is either Nakamoto waking up and depositing BTC from Binance or someone burned over $1 million.\n\nGrogan also suggested that the anonymous transfer could be some weird spot Bitcoin exchange-traded fund marketing scheme.\n\nRelated: Bitcoin ETF approval would be a ‘historic mistake,’ says Better Markets CEO\n\nNo movement of funds from Nakamoto-associated wallets, including the genesis wallet, has occurred since Nakamoto disappeared in December 2010. Nakamoto could still retain the private keys for these wallets and control the funds.\n\nThe genesis wallet initially held the 50 mined Bitcoin when Nakamoto vanished. On Bitcoin’s 14th birthday, Bitcoin users from around the world celebrated in various ways, with some opting to send BTC to the address containing the rewards for mining its genesis block. The gifts increased the wallet’s balance to 72 Bitcoin by late 2023.\n\nThe recent transaction raised the current balance to 99.67 Bitcoin, valued at roughly $4.3 million.\n\nMagazine: Expect ‘records broken’ by Bitcoin ETF: Brett Harrison (ex-FTX US), X Hall of Flame"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjcwNzQ4L3NvbWVvbmUtc2VudC0xLTItbWlsbGlvbi1vZi1iaXRjb2luLXRvLXRoZS1nZW5lc2lzLXdhbGxldC1taW5lZC1ieS1zYXRvc2hpLW5ha2Ftb3Rv0gF7aHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjcwNzQ4L3NvbWVvbmUtc2VudC0xLTItbWlsbGlvbi1vZi1iaXRjb2luLXRvLXRoZS1nZW5lc2lzLXdhbGxldC1taW5lZC1ieS1zYXRvc2hpLW5ha2Ftb3Rv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jan 2024 08:00:00 GMT",
        "title": "Someone sent $1.2 million of bitcoin to the Genesis wallet mined by Satoshi Nakamoto - The Block",
        "content": "An unknown bitcoin user sent 26.9 BTC -7.68% , worth $1.17 million, to the network’s Genesis wallet — the first wallet ever created on the Bitcoin network — funds that they’re unlikely to ever get back.\n\nThe transaction took place on January 5 at 1.52 AM ET. The bitcoin was sent from this wallet, which is now empty, to the Genesis wallet. The fee for the transaction was $100, far above average.\n\nThe wallet was originally funded in a complex transaction that involved funds moving from three wallets to 12 other wallets. The majority of the funds came from a wallet labeled as belonging to Binance on blockchain analytics platform Arkham Intelligence.\n\n\"Either Satoshi woke up, bought 27 bitcoin from Binance, and deposited into their wallet, or someone just burned a million dollars,\" said Conor Grogan, a director at Coinbase, on X.\n\n\n\nWhat is the Genesis wallet?\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nThe Genesis wallet is the first wallet ever created on the Bitcoin network. It was created by the pseudonymous entity known as Satoshi Nakamoto, who created the Bitcoin network. Nakamoto also likely mined a high number of other blocks in the network’s early days but it’s unclear exactly how many.\n\nWhile theoretically, Nakamoto could still be holding onto their private keys to access these wallets and could move or return the funds, the general consensus is that this would be unlikely to happen. This is because funds from wallets associated with Nakamoto, including funds held in the Genesis block, have not moved since Nakamoto’s disappearance in Dec. 2010.\n\nWhen Nakamoto disappeared, the Genesis wallet only contained the 50 bitcoin that was mined when it was created. Over time, more funds were sent to the wallet and its balance rose to 72 bitcoin in late 2023. With the latest transaction, the current balance is now 99.67 bitcoin, worth $4.3 million.\n\nThis is a drop in the bucket for Nakamoto though. Estimates are that they control as much as 1.1 million bitcoin, currently worth $47 billion — on paper, that is."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS9lY29ub215L2JsYWNrcm9jay1sYXlvZmZzLWNvbWluZy1maXJtLW1hdHVyZXMtZXNnLXB1bGxiYWNrLWJpdGNvaW4tZXRmLWFwcHJvdmFs0gFvaHR0cHM6Ly93d3cuZm94YnVzaW5lc3MuY29tL2Vjb25vbXkvYmxhY2tyb2NrLWxheW9mZnMtY29taW5nLWZpcm0tbWF0dXJlcy1lc2ctcHVsbGJhY2stYml0Y29pbi1ldGYtYXBwcm92YWwuYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jan 2024 08:00:00 GMT",
        "title": "BlackRock layoffs coming as firm matures, ESG pullback and Bitcoin ETF approval - Fox Business",
        "content": "BlackRock, the world's largest money management firm, plans to announce layoffs in the coming days of about 3 percent of its global workforce, Fox Business has learned.\n\nThe job cuts of around 600 employees, which have yet to be reported, are being described internally as routine, according to a source familiar. Last year, BlackRock did a similar round of layoffs gauged on employee performance metrics, the source added.\n\nShares of BlackRock rebounded in 2023, up 6 percent after falling 21 percent in 2022. New customer money into BlackRock's solid Exchange Traded Fund business exploded last year with $187 billion of inflows into the products that follow a basket of securities and trade like stocks on major exchanges.\n\nTicker Security Last Change Change % BLK BLACKROCK INC. 809.12 -16.92 -2.05%\n\nOn Wednesday, BlackRock is expecting approval from the Securities and Exchange Commission for its new Bitcoin \"spot\" ETF — the first time a crypto investment product tracking the daily price of the world's most popular digital coin will be approved by securities regulators to trade on a public stock market. Other asset managers are also expecting approval for their ETFs.\n\nBLACKROCK, STATE STREET FACE SUBPOENAS IN HOUSE ESG PROBE\n\nA BlackRock spokesman would not comment on the layoffs. BlackRock is scheduled to announce fourth quarter earnings on Friday.\n\nOne possible impetus for the layoffs is that BlackRock, after years of wild growth in assets under management or AUM, is settling into a more mature phase in its business. Analyst consensus for earnings in its fourth quarter projects a 2.46 percent decline year-over-year to $8.71 a share.\n\nBlackRock finished the third quarter of 2023 with $9 trillion in AUM though the firm has seen significant asset declines since it reached a peak of more than $10 trillion in 2022 amid wobbly financial markets. The decline in assets also came as BlackRock became a political lightning rod over its embrace of Environmental Social Governance investing, or ESG, which directs investment dollars into public companies in the sustainable energy space, or those that are taking steps to reduce their carbon footprint and advocate corporate governance measures such as boardroom diversity.\n\nDECEMBER JOBS BREAKDOWN: WHICH INDUSTRIES HIRED THE MOST WORKERS LAST MONTH?\n\nThe firm has been de-emphasizing its ESG business in the U.S. amid the controversy, Fox Business has learned. U.S. portfolio managers are no longer required to consider ESG metrics when not using ESG funds. In 2023, many so-called green investment funds have seen declines in asset amid weak performance as investments in sustainable energy products fail to produce significant returns.\n\nCompany founder and CEO Larry Fink told Fox Business he won't use the mention of the letters E-S-G any longer because of the controversy it has stirred up in political circles.\n\nUS ECONOMY ADDS 216K JOBS IN DECEMBER, BEATING EXPECTATIONS\n\nAs top Republicans, including several running for the GOP presidential nomination, have attacked BlackRock and ESG, those running pension funds in red states have yanked about $6 billion from BlackRock funds as a form of protest.\n\nNoticeably quiet from the BlackRock bashing is the GOP front-runner, former President Donald Trump. One reason may be because BlackRock once managed Trump's fortune, estimated in the billions of dollars. In 2017, Trump said of Fink: \"Larry did a great job for me. He managed a lot of my money. I have to tell you, he got me great returns.\"\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nPeople close to BlackRock tell Fox Business that savings from the job cuts will be used to expand into growth businesses such as technology investing and investing in so-called alternative products as opposed to stocks and bonds.\n\nESG, meanwhile, remains a big business with BlackRock's foreign customers, including large sovereign wealth funds in Europe and the Middle East. Mark Wiedman, head of BlackRock's client business, speaking at a recent event sponsored by the news outlet Semafor, called ESG \"a demand from clients,\" with around $1 trillion in pure sustainable assets being managed by BlackRock."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzA2L2JldHRlci1idXktYml0Y29pbi1vci1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jan 2024 08:00:00 GMT",
        "title": "Better Buy: Bitcoin or Ethereum? - The Motley Fool",
        "content": "After Bitcoin (BTC -9.11%) soared by more than 150% last year, investors are now looking far and wide for cryptocurrencies that might be able to outperform Bitcoin in 2024. One intriguing candidate is Ethereum (ETH -9.51%), which is still the world's second-most valuable cryptocurrency with a whopping $270 billion market cap.\n\nWhile Ethereum might not get the same hype as Bitcoin, it's certainly worth a closer look, especially if some of the catalysts expected to push Bitcoin higher fail to materialize. Let's take a closer look.\n\nThe spot Bitcoin ETF\n\nJust about everyone agrees that investor anticipation of a new spot Bitcoin ETF is the key factor pushing Bitcoin higher right now. The underlying logic makes sense: A new regulated financial product for investing in Bitcoin should attract money from both retail and institutional investors. If institutional investors with trillions of dollars of assets under management allocate just 1% of their portfolios to Bitcoin, that could result in literally tens of billions of dollars flowing into Bitcoin. That would almost certainly cause the price of Bitcoin to soar.\n\nBut there are several problems with that argument, says JPMorgan Chase (JPM -1.78%). In a December research note to clients, JPMorgan Chase specifically pointed out that much of the hype around the Bitcoin ETF might be undeserved. For one, spot Bitcoin ETF products exist elsewhere in the world (in both Canada and Europe), and they have experienced relatively weak demand. What's to say that the U.S. market will be different?\n\nMoreover, there are other Bitcoin investment products to choose from right now. Popular choices include Grayscale Bitcoin Trust (GBTC -5.76%) and ProShares Bitcoin Strategy ETF (BITO -5.59%). So instead of huge flows of new money into Bitcoin, we might just see a reshuffling of money out of existing Bitcoin investment products and into the new spot Bitcoin ETF. The net impact, in that case, would not be nearly as great as some are now predicting.\n\nThe Bitcoin halving\n\nThe second major catalyst for Bitcoin is the approaching halving event. This event, which occurs only once every four years, is coming up in April, and it's likely to be one of the most talked-about developments in the crypto market this year. In three past halvings, the price of Bitcoin has soared, and many investors are expecting the same to happen again. In fact, some are now predicting that Bitcoin could push through the $100,000 mark by the end of the year.\n\nBut keep in mind that a growing number of influential voices on Wall Street think that much of the Bitcoin halving's impact might already be priced in. If you buy into the efficient market hypothesis, which says that all publicly available information is already factored into prices, then maybe the halving will be a non-event.\n\nAfter all, the entire market knows when the halving is going to take place. There are websites with clocks counting down the seconds. And the entire market has plenty of historical data to work with. Granted, the crypto market may not be as efficient as the equity market at pricing in information, but it's safe to say that every major Wall Street firm is aware of the implications of the Bitcoin halving.\n\nThe case for Ethereum\n\nWhile Ethereum may not have the same kinds of catalysts as Bitcoin, it is working on significant improvements to its overall blockchain architecture. Ethereum has not really delivered on everything it originally promised for The Merge, when it transitioned to a much more energy effective network. This year might be an opportunity to reassure investors that everything is still on track. If these improvements lead to lower fees, faster transaction speeds, and higher overall throughput, it could make Ethereum much more attractive to investors.\n\nMoreover, Ethereum is more likely to benefit from increased development activity in crypto than Bitcoin. That's because Ethereum, unlike Bitcoin, is active in just about every major niche of the blockchain and crypto world, including non-fungible tokens (NFTs), decentralized finance (DeFi), blockchain gaming, the metaverse, and Web3. During the long crypto winter that set in during 2022, many of these areas went into hibernation. But in a crypto spring, they could come back to life.\n\nAnd the better buy is...\n\nI've tried to make a compelling case for Ethereum, but if forced to choose between Bitcoin and Ethereum, I'm still going with Bitcoin. Yes, the new spot Bitcoin ETF might be overhyped. And yes, the Bitcoin halving cycle might be underwhelming this time around. But with so much institutional investor support behind it now, Bitcoin is closer to going mainstream than at any time in its history. If there's just one crypto to buy in 2024, it's Bitcoin."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDI0LzAxLzA2LzItbWFqb3Itcmlza3MtaW52ZXN0b3JzLXNob3VsZC1rbm93LWJlZm9yZS1idXlpbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 06 Jan 2024 08:00:00 GMT",
        "title": "2 Major Risks Investors Should Know Before Buying Bitcoin in 2024 - The Motley Fool",
        "content": "It's hard not to be bullish on Bitcoin (BTC -9.11%) in 2024. Last year, Bitcoin was up more than 150% and soundly outperformed every major market benchmark. At a recent price of $45,000, Bitcoin was trading at its highest level since April 2022. On top of all that, anticipation is growing over the upcoming Bitcoin halving event and what that might mean for the future price of Bitcoin.\n\nBut that doesn't mean an investment in Bitcoin is without risk. In fact, there might be two major risks investors are overlooking.\n\nThe spot Bitcoin ETF\n\nThe first risk involves the imminent launch of the first spot Bitcoin ETF for the U.S. market. Over the final months of 2023, this looked like a slam-dunk certainty, with many expecting the SEC to approve the first spot Bitcoin ETF in early January. After all, more than a dozen Wall Street firms have submitted ETF applications, and they have been carefully updating and amending these applications as needed.\n\nBut the latest word in the crypto markets is that the SEC might delay any approval for a spot Bitcoin ETF until there is a more comprehensive regulatory framework in place for crypto within the United States. Obviously, this would be devastating news for Bitcoin investors, given that much of the recent run-up in price has been driven by anticipation around approval of the spot Bitcoin ETF.\n\nMoreover, even if the SEC approves a spot Bitcoin ETF, there's still the matter of what will happen to the price of Bitcoin. If you believe in efficient markets, then much of the expected price bump that Bitcoin is expected to get after official approval of the first spot Bitcoin ETF may already be priced in. That might be a shock to some investors, who are likely assuming that official SEC approval sometime in January is automatically going to send the price of Bitcoin soaring.\n\nAccording to Cathie Wood of Ark Invest, the price of Bitcoin might actually decline in the short term. That's due to a well-known market phenomenon called \"buy the rumor, sell the news.\" In short, investors buy ahead of anticipated news of a major event. Then, once the event actually occurs, they sell, in order to take profits. So if you're expecting a major bounce in the price of Bitcoin in early 2024, you might want to readjust your expectations.\n\nThe arrival of institutional investors\n\nThe other risk involves the sudden influx of many new institutional investors into crypto at one time. Right now, everyone is focused on the potential tsunami of new money flooding into Bitcoin, which is almost certain to prop up the price of Bitcoin. The basic thinking here is that these institutional investors will be looking to allocate 1% or more of their portfolios to Bitcoin. Given that the largest of these investors manage trillions of dollars in assets, this could result in billions of dollars eventually flowing into Bitcoin.\n\nBut what's actually going to happen to Bitcoin over the long haul? Remember -- Bitcoin is not just a financial asset, it is also a technological innovation that relies on a vibrant blockchain ecosystem. Crypto executive Arthur Hayes, for example, thinks that the entry of large institutional investors into crypto will \"completely destroy Bitcoin.\" As he points out, the biggest institutional investors are in the \"asset accumulation game,\" and their goal will be to acquire as much Bitcoin as possible.\n\nAs Wall Street goes into asset accumulation mode, it could transform Bitcoin from a dynamic, thriving blockchain with multiple use cases into a lifeless blockchain where nothing interesting ever happens. A large percentage of the world's Bitcoin will essentially be locked up in a vault on Wall Street, doing nothing. In a worst-case scenario, Bitcoin miners will simply stop mining Bitcoin because it is no longer profitable, and Bitcoin as we know it, says Hayes, will simply \"vanish.\" The race will then be on to find the next great cryptocurrency after Bitcoin.\n\nYes, Bitcoin, but which way to invest in Bitcoin?\n\nTo make sense of all this, I've been keeping my eye on what the \"smart money\" is doing ahead of the arrival of the new Bitcoin ETFs. Cathie Wood of Ark Invest, for example, appears to be searching for the best investment vehicle for Bitcoin. At year-end, Ark Invest sold shares in Coinbase Global (COIN -7.17%), which is viewed as a Bitcoin proxy stock, and also sold shares in Grayscale Bitcoin Trust (GBTC -5.76%), which is trying to convert into a spot Bitcoin ETF. Ark Invest then bought shares of the ProShares Bitcoin Strategy ETF (BITO -5.59%), which tracks the performance of Bitcoin using futures contracts (and not spot Bitcoin).\n\nThus, the decision of whether or not to invest in Bitcoin is slightly more nuanced than you might assume. It's up to you as an investor to decide (a) if Bitcoin is right for you and, if so, (b) what the best way to invest in it will be going forward. Heading into 2024, the primary choice is shaping up to be one between spot Bitcoin (Bitcoin bought and sold on cryptocurrency exchanges) and a spot Bitcoin ETF."
    }
]