[
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyNC0wMS0wOC9jcnlwdG8tcy1iaXRjb2luLWV0Zi1ob3BlZnVscy13YWl0LWZvci11cy1zZWMtYXBwcm92YWwtYnktamFudWFyeS0xMC1kZWFkbGluZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jan 2024 08:00:00 GMT",
        "title": "Crypto’s Bitcoin ETF Hopefuls Wait for US SEC Approval by January 10 Deadline - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyNC0wMS0wOC9jcnlwdG8tcy1iaXRjb2luLWV0Zi1ob3BlZnVscy13YWl0LWZvci11cy1zZWMtYXBwcm92YWwtYnktamFudWFyeS0xMC1kZWFkbGluZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jan 2024 08:00:00 GMT",
        "title": "Crypto’s Bitcoin ETF Hopefuls Wait for US SEC Approval by January 10 Deadline - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyNC0wMS0wOC9jcnlwdG8tcy1iaXRjb2luLWV0Zi1ob3BlZnVscy13YWl0LWZvci11cy1zZWMtYXBwcm92YWwtYnktamFudWFyeS0xMC1kZWFkbGluZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jan 2024 08:00:00 GMT",
        "title": "Crypto’s Bitcoin ETF Hopefuls Wait for US SEC Approval by January 10 Deadline - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjcwNzg5L2luLXBlcnNvbi1idXNpbmVzc2VzLWFjY2VwdGluZy1iaXRjb2luLW5lYXJseS10cmlwbGVkLWluLTIwMjPSAWVodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNzA3ODkvaW4tcGVyc29uLWJ1c2luZXNzZXMtYWNjZXB0aW5nLWJpdGNvaW4tbmVhcmx5LXRyaXBsZWQtaW4tMjAyMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jan 2024 08:00:00 GMT",
        "title": "In-person businesses accepting bitcoin nearly tripled in 2023 - The Block",
        "content": "Looking for a place to spend your bitcoin in real life? It may be easier than ever, according to BTC Map's crowdsourced data. The project currently lists over 6,300 vendors that accepted bitcoin in the past year, according to user reports.\n\nThat total is nearly three times more than the number of vendors who accepted bitcoin at the end of 2022 — only 2,200, according to BTC Map's data. While some vendors have almost certainly been missed by the volunteers contributing data, the trend seems to indicate that bitcoin adoption is on the rise, despite its volatile swings in price throughout 2023.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nHowever, paying for physical goods with bitcoin could be a risky proposition. The bitcoin used to buy a $20 pizza at the beginning of 2023, for example, would be worth over $50. Infamously, the first purchase made with Bitcoin were two large pizzas for 10,000 bitcoin that would be worth $44 million at today's prices.\n\nBitcoin vendors are located around the world, but appear to be concentrated in Europe, the United States, and especially Latin America. While the Phillippines has hundreds of vendors tagged, East Asia seems to be lagging in adoption, with China's population of over 1.4 billion lacking any vendors, due to the cryptocurrency ban in the country."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9oaXZlLWRpZ2l0YWwtcHJvdmlkZXMtcmVjYXAtY2FsZW5kYXItMDYwMDAwNzkxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 07 Jan 2024 08:00:00 GMT",
        "title": "HIVE Digital Provides Recap of Calendar Year 2023 Mining 3,260 Bitcoin - Yahoo Finance",
        "content": "This news release constitutes a \"designated news release\" for the purposes of the Company's amended and restated prospectus supplement dated August 17, 2023, to its short form base shelf prospectus dated May 1, 2023.\n\nVancouver, British Columbia--(Newsfile Corp. - January 8, 2024) - HIVE Digital Technologies Ltd. (TSXV: HIVE) (NASDAQ: HIVE) (FSE: YO0) (the \"Company\" or \"HIVE\") is pleased to announce the summarized unaudited production figures from the Company's global Bitcoin operations for the 2023 calendar year. Production totaled 3,260 Bitcoin mined, and hashrate increased by 100% in the 2023 calendar year, from 2 Exahash per second (\"EH/s\") at the end of December 2022 to 4 EH/s at the end of December 2023 (all amounts in US dollars, unless otherwise indicated).\n\nHIVE has maintained approximately 1% of the global Bitcoin mining network through 2023, mining an average of approximately 9 Bitcoin per day throughout the calendar year of 2023, by maintaining a growing hashrate over the course of the year, that has generally kept pace with the Bitcoin mining network hashrate growth. With the total daily block rewards of the Bitcoin mining network averaging 900 Bitcoin per day, or 328,500 Bitcoin in a calendar year, HIVE earning 3,260 Bitcoin for calendar 2023 is approximately 1% of the Bitcoin mining network.\n\nThroughout calendar 2023 the Bitcoin mining network continued to attract more efficient ASIC machines to compete for the 900 new Bitcoin mined per day, as HIVE'S network hashrate grew from approximately 2 EH/s from the beginning of 2023 to approximately 4 EH/s at the end of 2023. Accordingly, Mining Difficulty1 also increased approximately 100% year over year, from January 1, 2023 to December 31, 2023, as per www.blockchain.com. This is how HIVE maintained approximately 1% of the total Bitcoin rewards mined in calendar 2023.\n\nHIVE ended the 2023 calendar year with approximately $17 million in cash and a Bitcoin HODL position of 1,704 BTC. As mentioned in the Company's December 19, 2023, news release, the Company's HODL strategy is such that it anticipates to be able to HODL all its Bitcoin until the upcoming Halving which is expected to be in April 2024 after which the number of new Bitcoin mined per day will drop to 450 Bitcoins per day.\n\nStory continues\n\nBitmain S19k Pro Update\n\nHIVE also announces that further to its news releases dated November 14, 2023, and December 4, 2023, all 9,800 of the Bitmain S19k Pro Antminers ordered by the Company have shipped. Currently approximately 70% have been installed, and it is expected that 100% of these machines will be installed before January 2024 month-end. After these miners are installed, it is expected that HIVE will have 4.8 EH/s of ASICs with an average fleet efficiency of 28.7 J/TH.\n\nIn addition, further to its news release dated December 21, 2023, upon the completion of the installation of the 7,000 Bitmain S21 Antminers ordered in December 2023, which will begin in January 2024 and is expected to be completed in June 2024, it is expected that HIVE will have an average fleet efficiency of 25 J/TH and a total of 5.6 EH/s of active mining capacity.\n\nAbout HIVE Digital Technologies Ltd.\n\nHIVE Digital Technologies Ltd. went public in 2017 as the first cryptocurrency mining company listed for trading on the TSX Venture Exchange with a sustainable green or renewable energy focus. HIVE's electricity is sourced from hydro and geothermal facilities in Sweden, Canada and Iceland.\n\nHIVE is a growth-oriented technology stock in the emergent blockchain industry. As a company whose shares trade on major stock exchanges, we are building a bridge between the digital currency and blockchain sector and traditional capital markets. HIVE owns green energy-powered data centre facilities in Canada, Sweden, and Iceland, where we endeavour to source green energy to mine digital assets such as Bitcoin on the cloud. Since the beginning of 2021, HIVE has held in secure storage the majority of its treasury of BTC derived from mining rewards. Our shares provide investors with exposure to the operating margins of digital currency mining, as well as a portfolio of Bitcoin. Because HIVE also owns hard assets such as data centers and advanced multi-use servers, we believe our shares offer investors an attractive way to gain exposure to the cryptocurrency space.\n\nWe encourage you to visit HIVE's YouTube channel here to learn more about HIVE.\n\nFor more information and to register to HIVE's mailing list, please visit www.HIVEdigitaltechnologies.com. Follow @HIVEDigitalTech on Twitter and subscribe to HIVE's YouTube channel.\n\nOn Behalf of HIVE Digital Technologies Ltd.\n\n\"Frank Holmes\"\n\nExecutive Chairman\n\nFor further information please contact:\n\nFrank Holmes\n\nTel: (604) 664-1078\n\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release\n\nForward-Looking Information\n\nExcept for the statements of historical fact, this news release contains \"forward-looking information\" within the meaning of the applicable Canadian and United States securities legislation and regulations that is based on expectations, estimates and projections as at the date of this news release. \"Forward-Looking information\" in this news release includes but is not limited to: business goals and objectives of the Company; the unaudited results of operations for the 2023 calendar year; the acquisition, deployment and optimization of the mining fleet and equipment, in particular the delivery of the 9,800 Bitmain S19k Pro Antminers the Company has ordered and the delivery and installation of the 7,000 Bitmain S21 Antminers; the volatility of global network mining difficulty; the continued viability of its existing Bitcoin mining operations; and other forward-looking information concerning the intentions, plans and future actions of the parties to the transactions described herein and the terms thereon.\n\nFactors that could cause actual results to differ materially from those described in such forward-looking information include, but are not limited to, the volatility of the digital currency market; the volatility of global network mining difficulty; the Company's ability to successfully mine digital currency; the Company may not be able to profitably liquidate its current digital currency inventory as required, or at all; a material decline in digital currency prices may have a significant negative impact on the Company's operations; the regulatory environment for cryptocurrency in Canada, the United States and the countries where our mining facilities are located; economic dependence on regulated terms of service and electricity rates; the speculative and competitive nature of the technology sector; dependency on continued growth in blockchain and cryptocurrency usage; lawsuits and other legal proceedings and challenges; government regulations; the global economic climate; dilution; future capital needs and uncertainty of additional financing, including the Company's ability to utilize the Company's at-the-market equity offering program (the \"ATM Program\") and the prices at which the Company may sell Common Shares in the ATM Program, as well as capital market conditions in general; risks relating to the strategy of maintaining and increasing Bitcoin holdings and the impact of depreciating Bitcoin prices on working capital; the competitive nature of the industry; currency exchange risks; the need for the Company to manage its planned growth and expansion; the effects of product development and need for continued technology change; the ability to maintain reliable and economical sources of power to run its cryptocurrency mining assets; the impact of energy curtailment or regulatory changes in the energy regimes in the jurisdictions in which the Company operates; protection of proprietary rights; the effect of government regulation and compliance on the Company and the industry, the introduction of proposed cryptocurrency regulatory legislation in the United States and other countries; network security risks; the ability of the Company to maintain properly working systems; reliance on key personnel; global economic and financial market deterioration impeding access to capital or increasing the cost of capital; share dilution resulting from the ATM Program, private placements of the Company's securities and from other equity issuances; the construction and operation of facilities may not occur as currently planned, or at all; expansion may not materialize as currently anticipated, or at all; the digital currency market; the ability to successfully mine digital currency; revenue may not increase as currently anticipated, or at all; it may not be possible to profitably liquidate the current digital currency inventory, or at all; a decline in digital currency prices may have a significant negative impact on operations; an increase in network difficulty may have a significant negative impact on operations; the volatility of digital currency prices; the anticipated growth and sustainability of electricity for the purposes of cryptocurrency mining in the applicable jurisdictions; the inability to maintain reliable and economical sources of power for the Company to operate cryptocurrency mining assets; the risks of an increase in the Company's electricity costs, cost of natural gas, changes in currency exchange rates, energy curtailment or regulatory changes in the energy regimes in the jurisdictions in which the Company operates and the adverse impact on the Company's profitability; the ability to complete current and future financings, any regulations or laws that will prevent the Company from operating its business; historical prices of digital currencies and the ability to mine digital currencies that will be consistent with historical prices; an inability to predict and counteract the effects of COVID-19 on the business of the Company, including but not limited to the effects of COVID-19 on the price of digital currencies should there be a resurgence, capital market conditions, restriction on labour and international travel and supply chains; and, the adoption or expansion of any regulation or law that will prevent the Company from operating its business, or make it more costly to do so; and other related risks as more fully set out in the Company's disclosure documents under the Company's filings at www.sec.gov/EDGAR and www.sedarplus.com.\n\nThe forward-looking information in this news release reflects the current expectations, assumptions and/or beliefs of the Company based on information currently available to the Company. In connection with the forward-looking information contained in this news release, the Company has made assumptions about the Company's objectives, goals or future plans, the timing thereof and related matters. The Company has also assumed that no significant events occur outside of the Company's normal course of business. Although the Company believes that the assumptions inherent in the forward-looking information are reasonable, forward-looking information is not a guarantee of future performance and accordingly undue reliance should not be put on such information due to its inherent uncertainty. The Company disclaims any intention or obligation to update or revise any forward-looking information, whether because of new information, future events or otherwise, other than as required by law.\n\n1 Difficulty as defined by Blockchain.com as \"A relative measure of how difficult it is to mine a new block for the blockchain.\"\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/193481"
    }
]