[
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDI0LTAxLTA1L2JpdGNvaW4tYnRjLWV0Zi1pc3N1ZXJzLWNsZWFyLW1ham9yLWh1cmRsZS1mb3Itc2VjLWFwcHJvdmFs0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETF Issuers Clear Major Hurdle on Path to SEC Approval - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMDUvYml0Y29pbi1oYXMtc3VyZ2VkLTY3LXBlcmNlbnQtaW4tdmFsdWUtc2luY2Utc2VwdGVtYmVyLmh0bWzSAV9odHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyNC8wMS8wNS9iaXRjb2luLWhhcy1zdXJnZWQtNjctcGVyY2VudC1pbi12YWx1ZS1zaW5jZS1zZXB0ZW1iZXIuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin has surged 67% in value since September—here's why - CNBC",
        "content": "Bitcoin hit a peak value of around $68,000 in November 2021. But by November 2022, it had lost more than 75% of that value following the collapse of FTX, the largest cryptocurrency exchange at the time. And now, it's bounced back up again.\n\nEven with a regulatory crackdown on cryptocurrency exchanges in the past year, the price of bitcoin rose steadily through most of 2023, and now sits at around $43,610 — a nearly $18,000 increase in value since September.\n\nOther popular cryptocurrencies have followed a similar trajectory in what has been a remarkable turnaround for an industry battered by scandal. But why now?\n\nInvestors have been buying cryptocurrencies ahead of the much-anticipated approval of the first U.S. spot bitcoin exchange-traded fund, which is expected later in January.\n\nPending approval, a slew of investment firms are expected to offer ETFs, most notably Blackrock, the largest asset management firm in the world.\n\nAn ETF is an investment fund that tracks the price of an underlying asset or index — in this case, bitcoin.\n\nThe advantage of a bitcoin or crypto ETF is that it would offer a way for investors to benefit from the price movements of bitcoin without owning the cryptocurrency directly.\n\nIf approved, cryptocurrency ETFs are expected to be traded on traditional SEC-regulated exchanges like the New York Stock Exchange or Nasdaq, according to CoinDesk.\n\nThat would open up the cryptocurrency market to a wider array of buyers who don't use cryptocurrency exchanges already. In anticipation of ETF approval, investors have been piling back into the market, which has driven up the price of bitcoin.\n\n\"It really opens the door for all kinds of demands. And if demand goes up, price goes up,\" says Douglas Boneparth, president of Bone Fide Wealth and a member of CNBC's Financial Advisor Council. Boneparth holds investments in bitcoin and other cryptocurrencies.\n\nThere are other factors at play, too. The Federal Reserve has signaled that its interest rate hike cycle is over, an encouraging sign for the economy as inflation continues to fall. This has made riskier assets like crypto more attractive to investors.\n\nAnother factor is bitcoin's \"halving,\" which is expected in April. Halving is a built-in mechanism related to bitcoin mining that periodically reduces token supply. Decreasing the supply of bitcoin is expected to further stoke demand.\n\nTo break it down, the factors behind the recent surge in bitcoin prices are \"60% bitcoin ETF, 20% halving and 20% economic conditions,\" says Boneparth.\n\nHowever, \"be mindful about the relentless upward [price] movement over the past few months,\" says Owen Lau, executive director at financial services company Oppenheimer & Co. \"A lot of the good news appears to have been priced in.\""
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy80LXN0b2Nrcy13YXRjaC1iaXRjb2luLXJhbGx5LTE0MjgwMDkzNi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "4 Stocks to Watch as Bitcoin Rally Continues Into 2024 - Yahoo Finance",
        "content": "After a solid 2023, cryptocurrencies have started this year on a high. Bitcoin (BTC), the world’s most prominent cryptocurrency, has particularly been on a dream run over the past couple of months and the rally is set to gain pace in the coming months as multiple positive developments have given investors’ sentiment a boost.\n\nBitcoin rallied past $43,000 in December 2023, and on Jan 2, it surged past the $45,000 mark for the first time since April 2022. Although the cryptocurrency retreated from its 21-month high, it hovered around $44,200 on Jan 4.\n\nOver the past three months, Bitcoin has rallied more than 61%. The Federal Reserve didn’t hike interest rates in its last three FOMC meetings in 2023 after raising interest rates by 525 basis points, as its aggressive monetary tightening campaign has seen inflation decline sharply.\n\nCooling inflation has also raised hopes that the Federal Reserve will soon end its monetary tightening campaign and start cutting rates this year, which could be as early as in March. Higher interest rates have adverse effects on growth-focused sectors like technology, consumer discretionary and cryptocurrencies.\n\nAlso, investors are optimistic about the imminent approval of a Bitcoin exchange-traded fund (ETF) by the Securities and Exchange Commission (SEC). This approval is expected to have a significant positive impact, providing strong support to the cryptocurrency market.\n\nInvestors are currently looking forward to the potential approval of a spot Bitcoin ETF by the SEC as early as the first half of 2024.\n\nStocks to Watch\n\nCoinbase Global, Inc. COIN offers financial infrastructure and technology to support the global cryptocurrency economy. COIN provides a main financial account for consumers in the crypto space, a marketplace with liquidity for institutional crypto asset transactions, and technology and services for developers to build crypto-based applications and accept cryptocurrencies securely as payment.\n\nStory continues\n\nCoinbase Global’s expected earnings growth rate for the current year is 92%. The Zacks Consensus Estimate for current-year earnings has improved 16.7% over the last 60 days. Coinbase currently carries a Zacks Rank #2 (Buy).\n\nNVIDIA Corporation NVDA is a major player in the semiconductor industry and has been one of the standout success stories of 2023. As a leading designer of graphic processing units (GPUs), the value of the NVDA stock tends to surge in a thriving crypto market. This is primarily due to the crucial role that GPUs play in data centers, artificial intelligence, and the mining or production of cryptocurrencies.\n\nNVIDIA’s expected earnings growth rate for the current year is 268%. The Zacks Consensus Estimate for current-year earnings has improved 14.4% over the last 60 days. Currently, NVIDIA has a Zacks Rank #2. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nPayPal Holdings, Inc. PYPL provides digital wallet services that enable users to purchase, transfer, and sell various cryptocurrencies, such as Bitcoin, Ethereum, Bitcoin Cash and Litecoin. Through PYPL, users can use cryptocurrencies to pay for goods and services from online merchants. Additionally, PayPal’s mobile wallet platform, Venmo, also allows users to engage in cryptocurrency buying and selling activities.\n\nPayPal Holdings’ expected earnings growth rate for the current year is 20.6%. The Zacks Consensus Estimate for current-year earnings has improved 0.2% over the last 60 days. PYPL currently has a Zacks Rank #3 (Hold).\n\nBlock Inc. SQ is an online digital and mobile payment platform for consumers and merchants and is the parent company of Square and Cash App. The users of Cash App can buy, sell, send and receive Bitcoin. In addition, SQ’s decentralized tbd platform allows developers to build decentralized finance applications to run on programmable blockchains. SQ is also one of the largest Bitcoin investors.\n\nBlock has an expected earnings growth rate of 90% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 3.3% over the last 60 days. SQ currently carries a Zacks Rank #3.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nPayPal Holdings, Inc. (PYPL) : Free Stock Analysis Report\n\nBlock, Inc. (SQ) : Free Stock Analysis Report\n\nCoinbase Global, Inc. (COIN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjQvMDEvMDUvY3J5cHRvY3VycmVuY3ktaW52ZXN0b3JzLWVhZ2VybHktYXdhaXQtc2VjLXJ1bGluZy1vbi1iaXRjb2luLWV0ZnMuaHRtbNIBamh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDI0LzAxLzA1L2NyeXB0b2N1cnJlbmN5LWludmVzdG9ycy1lYWdlcmx5LWF3YWl0LXNlYy1ydWxpbmctb24tYml0Y29pbi1ldGZzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Cryptocurrency investors eagerly awaiting SEC ruling on bitcoin ETFs - CNBC",
        "content": "Crypto investors are eagerly awaiting an imminent ruling from the U.S. Securities and Exchange Commission that will likely approve the trading of a spot bitcoin exchange-traded fund, more than a decade after initial attempts were rejected.\n\n13 companies have filed for a spot bitcoin ETF:\n\nGrayscale Bitcoin Trust\n\nArk/21Shares Bitcoin Trust\n\nBitwise Bitcoin ETF Trust\n\nBlackRock Bitcoin ETF Trust\n\nVanEck Bitcoin Trust\n\nWisdomTree Bitcoin Trust\n\nValkyrie Bitcoin Fund\n\nInvesco Galaxy Bitcoin ETF\n\nFidelity Wise Origin Bitcoin Trust\n\nGlobal X Bitcoin Trust\n\nHashdex Bitcoin ETF\n\nFranklin Templeton Digital Holdings Trust\n\nPando Asset Spot Bitcoin Trust\n\nHow the SEC will proceed\n\nThere are two components to the applications:\n\n1) A 19b-4 filing, which is a form used by exchanges to inform the SEC of a proposed rule change. In this case, a rule change is required under the Securities Exchange Act of 1934 because a spot bitcoin ETF is a new product, and the exchanges — NYSE, Nasdaq and Cboe — must provide rules to explain how the product will trade. The SEC must approve the rule changes before the product can trade. This is the filing that is facing a deadline of Jan. 10 for the Ark/21Shares Bitcoin Trust.\n\n2) Approval of S-1. This is a filing to register a new security with the SEC, in a document that provides information about the specific security. In this case, each company filing for the spot bitcoin ETF has differences in the way the product might be structured. In the case of the Grayscale Bitcoin Trust, an S-3 filing must be approved, which is a simplified security registration form for businesses that have met other reporting requirements.\n\nIt's widely anticipated that once the 19b-4 filings are approved, the SEC will separately approve the S-1 applications of all the ETF applicants at once. However, because the applications are different, that is not a slam dunk. The SEC may decide to approve some, but not all, of the S-1s.\n\nWide spread in fee\n\nWith 13 companies filing for a bitcoin ETF, all of which are similar products, there is substantial interest in what the fee structure will look like.\n\nFidelity's Wise Origin Bitcoin Fund has announced it will charge 39 basis points, or 0.39%. Invesco's Galaxy Bitcoin ETF has set its expense ratio at 59 basis points, which are waived for the initial six months and the first $5 billion in assets. Ark/21Shares and Valkyrie will charge 80 basis points.\n\nGrayscale Bitcoin Trust currently charges 2% but has said it's committed to lowering the fee once its application to convert to a bitcoin ETF is approved.\n\nOther applicants have not yet announced their fee structure.\n\nIt is unclear who the main regulator of the crypto industry is\n\nAll this happens against the backdrop of SEC Chair Gary Gensler's long-running fight with the crypto industry.\n\nGensler has fought several court battles against major crypto players, including a losing battle against Grayscale Bitcoin Trust, which won a case against the SEC last summer. In that case, the U.S. Court of Appeals for the D.C. Circuit ruled that the SEC had already approved a futures-based bitcoin product and that it failed to explain why it had refused to approve a spot-bitcoin product. The court said, in essence, the futures and the spot market are \"like\" products. If the SEC approved one, it logically had to approve the other.\n\nBitcoin has been ruled to be a commodity, but with the exception of ether, there are no such rulings on other cryptocurrencies. In the absence of clear federal rules, the SEC has taken to regulation by enforcement to demonstrate that many cryptocurrencies are securities, and it therefore has regulatory authority over much of the crypto industry.\n\nThere is an outstanding case against Coinbase , the largest U.S. crypto exchange, where the SEC alleges that the company violated rules requiring it to register as an exchange. In that case, the SEC has alleged that some of the crypto assets traded on Coinbase are securities and fall under the SEC's purview.\n\nThe SEC sued Binance and its founder Changpeng Zhao last June, alleging that Binance and Zhao \"engaged in an extensive web of deception, conflicts of interest, lack of disclosure, and calculated evasion of the law,\" according to Gensler.\n\nThe case is ongoing, but in November, the U.S. Department of Justice settled different charges against Binance and Zhao, wherein Zhao pleaded guilty to money laundering violations and agreed to pay a $50 million fine and step down from his role as the company's chief executive. Binance also accepted the appointment of a government monitor to oversee the business.\n\nARK Invest's Cathie Wood will be our guest on \"Halftime Report\" at 12:35 p.m. Monday, and on \"ETF Edge\" on Monday at 1:10 p.m.-1:30 p.m. ET on ETFEdge.cnbc.com."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzIzNTZkMzJkLWY1ZDYtNDAxNy05MTc5LTU3ODdjZWQ2ODExONIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 05 Jan 2024 08:00:00 GMT",
        "title": "Bitcoin ETFs miss the point - Financial Times",
        "content": "Print this page\n\nThe writer is a former investment banker and author of ‘Power Failure: The Rise and Fall of an American Icon’\n\nThe cryptoworld has been abuzz in recent weeks about the likelihood that the Securities and Exchange Commission will soon greenlight a bitcoin exchange-traded fund.\n\nThe idea that such an ETF will soon be offered to hungry, if misguided, US investors has helped provide a year-end kicker to the remarkable rally in bitcoin from the depths of its latest “winter” in late 2022. It became one of the best performing investments of 2023, rising around 160 per cent over the past year to nearly $44,000.\n\nThat is quite a turnaround given the crypto world has been on the ropes reputationally often during the past year or so. Not only has there been the bankruptcy of crypto exchange FTX and the criminal conviction of its founder Sam Bankman-Fried, but also its chief rival Binance agreeing to pay $4.3bn in penalties related to money laundering and breaching international sanctions. That was one of the largest corporate penalties in US history. Binance founder Changpeng Zhao also pleaded guilty to failing to protect against money laundering and resigned from his position.\n\nBut if you think about it, there has already been a way for investors to play the bitcoin rollercoaster for years: by buying, or selling, the stock of enterprise software company MicroStrategy which has hitched its fortunes to bitcoin, rendering its sales of enterprise software somewhat irrelevant to its stock market valuation.\n\nUnder a strategy driven by the company’s 58-year-old, MIT-educated executive chair Michael Saylor, MicroStrategy has been buying bitcoin since 2020. “Due to its limited supply, bitcoin offers the opportunity for appreciation in value if its adoption increases and has the potential to serve as a hedge against inflation in the long term,” it said at the time. MicroStrategy is thought to be the largest listed holder of bitcoin in the world. The company owns 189,150 bitcoins, purchased over the years at an aggregate price of around $5.9bn, as of the end of December.\n\nMicroStrategy’s software operations have brought Saylor into the regulatory spotlight. In 2000, he agreed to pay $8.3mn plus a $350,000 penalty to settle SEC charges of materially overstating software revenues and earnings. But when bitcoin was riding high, say around November 2021, when its price hit $69,000, he drew a lot of attention. He even bedazzled Tucker Carlson for more than an hour about the wisdom of the cryptocurrency before the television anchor was defenestrated from Fox.\n\nSaylor is a true believer, and an articulate one at that. His interviews about bitcoin are lengthy and spellbinding. He speaks in complete paragraphs. You come away from listening to him convinced that bitcoin is the next great innovation in the financial world. And then, you step back, give it a thought or two and remember that Jamie Dimon, CEO of JPMorgan, said of cryptocurrency, “If I was the government, I’d shut it down.”\n\nMicroStrategy executive chair Michael Saylor: ‘We’re kind of like your nonexistent spot ETF’ © Bloomberg\n\nSaylor relinquished the role of the CEO of MicroStrategy in August 2022 to become executive chair after yet another bitcoin plunge. At the time, the company had reported cumulative impairment losses of nearly $2bn on its digital assets since acquisition.\n\nBut thanks to the run-up in the price of bitcoin in 2023, MicroStrategy’s hoard is now worth more than $8bn, giving the company a gain of some $2bn on its investment. Not surprisingly, MicroStrategy’s stock price also outperformed in 2023, up more than 330 per cent for the year. Its market value of around $8.8bn means that investors are valuing its software business at around $800mn. (That is still hefty given MicroStrategy made a small pre-tax profit of around £13mn on revenues of $371mn in the nine months to September 30, after taking into account share-based pay but excluding impairments on its digital holdings.)\n\nSo MicroStrategy is essentially a play on bitcoin and has been for years. In other words, there’s been no need to wait for the SEC to approve a bitcoin ETF, it seems to me. Saylor himself told CNBC: “We’re kind of like your nonexistent spot ETF.”\n\nThe problem with bitcoin isn’t that there hasn’t been a way to speculate on it. The problem with bitcoin is that it’s all about speculation. We don’t need new ways to speculate on the cryptocurrency. What we need, if bitcoin is going to be the saviour its advocates want us to think it is, is a use for bitcoin.\n\nWhen it can be used to buy and sell the things we want, as seamlessly as fiat currency, that’ll be the game changer. The real excitement for bitcoin won’t come from the SEC authorising new ways to speculate on it, but rather when there’s more to it than just speculation.\n\nThis article has been amended to correct the year in which MicroStrategy started buying bitcoin to 2020."
    }
]