[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vdGhlY29udmVyc2F0aW9uLmNvbS9iaXRjb2luLWhhcy1zaG90LXVwLTUwLXNpbmNlLXRoZS1uZXcteWVhci1idXQtaGVyZXMtd2h5LW5ldy1sb3dzLWFyZS1wcm9iYWJseS1zdGlsbC1haGVhZC0xOTg2ODLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin has shot up 50% since the new year, but here's why new lows are probably still ahead - The Conversation Indonesia",
        "content": "To the delight of investors across the cryptosphere, the price of bitcoin (BTC) has rallied over 53% since its low of US$15,476 (£12,519) in November. Now trading around US$23,000, there’s much talk that the bottom has finally been reached for the leading cryptocurrency after a year of painful decline – in November 2021, the price peaked at almost US$70,000.\n\nIf so, it’s not only good news for bitcoin but the whole market in cryptocurrencies, since the others broadly move in line with the leader. So is crypto back in business?\n\nDotcom lessons\n\nThe past is littered with various periods of market turmoil, from the global financial crisis of 2007-09 to the COVID-19 collapse in 2020. But neither of these is a particularly good comparison for our purposes because they both saw sharp drops and recoveries, as opposed to the slow unwinding of bitcoin. A better comparison would be the dotcom bubble burst in 2000-02, which you can see in the chart below (the Nasdaq is the index that tracks all tech stocks).\n\nNasdaq 100 index 1995-2005\n\nLook at the bitcoin chart since it peaked in November 2021 and the price action looks fairly similar:\n\nBitcoin bear market price chart 2021-23\n\nBoth charts show that bear markets go through various periods where prices rise but don’t reach the same level as the previous peak – known as “lower highs”. If bitcoin is following a similar trajectory to the early 2000s Nasdaq, it would make sense that the current price will be another lower high and that it will be followed by another lower low.\n\nThis is partly because like the 2000s Nasdaq, bitcoin seems to be following a pattern known as an Elliott Wave. Named after the renowned American stock market analyst Ralph Nelson Elliott, this essentially argues that during a bear phase, investors shift between different emotional states of disappointment and hope, before they finally despair and decide the market will never turn in their favour. This is a final wave of heavy selling known as capitulation.\n\nYou can see this idea on the chart below, where bitcoin is the green and red line and Z is the potential capitulation point at around US$13,000 (click on the chart to make it bigger). The black line is the path that the Nasdaq took in the early 2000s. The blue pointing finger above that line is potentially the equivalent place to where the bitcoin price is now.\n\nBitcoin now vs Nasdaq in the early 2000s\n\nAuthor provided\n\nThe one other thing to note on the chart is the wavy line that’s moving horizontally along the bottom. This is the stochRSI or stochastic relative strength index, which is an indication of when the asset looks overbought (when the line is peaking) or oversold (when it’s bottoming).\n\nA sign of a coming shift is when the stochRSI moves in the opposite direction to where the price is heading: so now the stochRSI is coming down but the price has held up around US$23,000. This too suggests a fall could be imminent.\n\nThe game of wealth transfer\n\nWithin markets, there is often a game that investors from institutions such as banks and hedge funds play with amateur (retail) investors. The aim is to transfer retail investors’ wealth to these institutions.\n\nThis is particularly easy in an unregulated market like bitcoin, because it is easier for institutions to manipulate prices. They can also talk up (or talk down) prices to stir up retail investors’ emotions, and get them to buy at the top and sell at the bottom. This “traps” the irrational investors who buy at higher prices, transferring wealth by giving the institutions an opportunity to convert their holdings into cash.\n\nIt therefore makes sense to compare how the retail and institutional investors have been behaving lately. The following charts compare those crypto wallet addresses that hold 1 BTC or more (mostly retail investors) with those holding upwards of 1,000 BTC (institutional investors). In all three charts, the black line is the bitcoin price and the orange line is the number of wallets in that category.\n\nRetail investor behaviour\n\nInstitutional investor behaviour pt 1\n\nInstitutional investor behaviour pt 2\n\nThis shows that since the FTX scandal back in November, which led to the world’s second-largest crypto exchange collapse, retail investors have been buying bitcoin aggressively, resulting in the highest number of addresses holding at least one BTC ever. On the other hand, the biggest institutional investors have been offloading. This suggests that the institutional investors agree with our analysis.\n\nWhere we’re heading\n\nThere are those who argue that bitcoin is a bubble and that ultimately cryptocurrencies are worthless. That’s a separate debate for another day. If we assume there is a future for blockchains, which are the online ledgers that enable cryptocurrencies, the key question is when bitcoin will reach the accumulation phase that typically ends a bear phase in any market.\n\nKnown as Wyckoff accumulation, this is where the price of the asset repeatedly tests two areas: the upper bound where traders previously sold heavily enough for the price to stop rising (known as resistance), and the lower bound where traders bought heavily enough that the price stopped going down (known as support).\n\nAt the point where institutional investors decide the lower bound has proved to be sufficiently resilient – in other words, they think the price is cheap at that level – they will start buying the asset again. That moment is only likely to come after there has been a capitulation.\n\nOf course, history does not repeat itself exactly. It may be this is the first time that retail investors have outsmarted the large institutions, and that the only way is now up.\n\nMore likely, however, there is more pain on the way. With a recession on the cards, unprecedented job layoffs and weak retail data coming out of the US, it doesn’t point to the kind of optimism that tends to move markets higher. It would therefore make sense to brace yourself for another plunge in the price of bitcoin and the rest of the crypto market."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vYWJjbmV3cy5nby5jb20vVVMveWVhci1jcnlwdG8tYnJva2UtY3VzdG9tZXJzLWludmVzdG9ycy1sb3N0LW1pbGxpb25zL3N0b3J5P2lkPTk2NjYyMDEw0gFjaHR0cHM6Ly9hYmNuZXdzLmdvLmNvbS9hbXAvVVMveWVhci1jcnlwdG8tYnJva2UtY3VzdG9tZXJzLWludmVzdG9ycy1sb3N0LW1pbGxpb25zL3N0b3J5P2lkPTk2NjYyMDEw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "The year crypto broke: How customers, investors lost millions and what's being done - ABC News",
        "content": "\"Impact x Nightline\" takes a look at the victims of the financial collapse.\n\nThe year crypto broke: How customers, investors lost millions and what's being done\n\nIt seemed like cryptocurrency was having a moment.\n\nAt the start of 2022, the Super Bowl featured celebrities like Tom Brady, Larry David and Matt Damon in commercials for crypto companies. Logos for crypto companies like FTX could be seen plastered on multiple sports arenas and a new wave of crypto influencers emerged, garnering hundreds of thousands of followers. Cryptocurrency was everywhere.\n\nIt was supposed to be an alternative to traditional finance.\n\nInstead of exchanging money through a third party, like a bank, cryptocurrency allows users to transfer digital currency directly. However, unlike traditional forms of currency such as the U.S. dollar, the government does not insure deposits and federal agencies have taken limited steps to regulate the crypto industry.\n\nBut the major crash of the crypto market last year has brought headaches, fear and anger among the millions of people around the world who invested their savings and are left wondering whether they'll ever see their money again.\n\nCurt Dell, a father of three from California, told ABC News' Rebecca Jarvis that he's lost over $200,000 in Bitcoin after the digital crypto lending company Celsius went bankrupt last year.\n\n\"It robbed [my family] of so much potential,\" said Dell, a California resident who works in sales. \"It's such a bad situation.\"\n\nCurt Dell said he lost more than $200,000 worth of Bitcoin after Celsius filed for bankruptcy. ABC News\n\n\"Impact x Nightline\" takes a closer look at the chaos throughout the industry, speaking with executives at some of the biggest crypto companies, top officials at regulatory agencies, and the regular customers who suffered from the collapse. This episode is streaming now on Hulu.\n\n\"Crypto kind of rose out of the 2008 financial crisis,\" David Yaffe-Bellany, a New York Times reporter who covers crypto, told \"Impact.\"\n\n\"That whole catastrophe was an example of the failures of the centralized financial system, and it helped inspire this movement to create a parallel financial system that didn't rely on the types of institutions whose bad behavior had caused a lot of people to suffer.\"\n\nThe crash shook the entire industry - and multiple companies, including Celsius Network, filed for bankruptcy.\n\n\"What the crash did was prompt a kind of run on the bank. People panicked,\" Yaffe-Bellany said. \"They thought that their cryptocurrencies were in danger, and they moved to withdraw everything that they deposited in Celsius, and that's what kind of exposed the kind of shaky foundations of the whole company.\"\n\nAlex Mashinsky, Founder and CEO at Celsius, speaks at the Web Summit 2021 in Lisbon, Portugal. LightRocket via Getty Images, FILE\n\nCelsius was founded by Alex Mashinsky and two partners in 2017. Mashinsky used social media to promote his company and its high-yield crypto earnings.\n\n\"The whole idea of Celsius network was that it was a kind of crypto bank, except better than a bank,\" Yaffe-Bellany said. “You'd deposit your crypto. It would be safe there, but you'd also get these enormous returns on top of that.”\n\nAt its peak, Celsius had 2 million customers and a $3 million valuation. The company filed for bankruptcy in July.\n\nIn early January, New York Attorney General Letitia James sued Mashinsky, accusing him of defrauding investors. He didn't respond to multiple requests by ABC News for an interview or comment.\n\nIt’s too early to know how the Celsius bankruptcy process will play out, and whether customers will get back any of their money.\n\n\"I'd like to stay optimistic and think that I'll get at least a significant portion of it back,\" Dell said of his investment. \"I don't think anybody really knows.\"\n\nCelsius' bankruptcy has also been intertwined with the biggest scandal rocking the crypto industry: the fall of one of the largest cryptocurrency exchanges, FTX.\n\nFormer FTX Chief Executive Sam Bankman-Fried departs Manhattan federal court in New York City, after a hearing, Jan. 3, 2023. Eduardo Munoz/Reuters\n\nSam Bankman-Fried, the founder and CEO of FTX, posted on social media suggesting he might bid to take over Celsius’ assets shortly after the company filed for bankruptcy.\n\nBut that was before FTX found itself in trouble as well.\n\nIn early November, FTX filed for bankruptcy after a series of events exposed a multi-billion-dollar hole in the company’s balance sheet. A little over a month later Bankman-Fried was charged in federal court with eight counts of fraud. He has pleaded not guilty and his trial is slated to begin in October.\n\nThe series of high-profile collapses in the crypto industry has prompted calls for more regulation from the federal government.\n\nFormer FTX Chief Executive Sam Bankman-Fried passes through security on the day of a hearing at Manhattan federal court in New York City, Jan. 3, 2023. Andrew Kelly/Reuters, FILE\n\nThe high-profile crypto collapses have prompted calls from activists, elected officials and others for more regulation from the federal government.\n\nChristy Goldsmith Romero, a commissioner at the Commodity Futures Trading Commission, told \"Impact\" that she agrees that the industry does need more oversight.\n\n\"We need, as regulators, the ability to go in to inspect, to go in and have exams, to set rules. And we need to ensure that there's no commingling of assets,\" she said.\n\nChristy Goldsmith Romero, a commissioner on the Commodity Futures Trading Commission, talks to ABC News about the ongoing problems of cryptocurrencies. ABC News\n\nGary Gensler, the chair of the U.S. Securities and Exchange Commission, told \"Impact\" he is willing to work more with the CFTC to protect consumers from shady crypto investments. In the meantime, he warned consumers to think hard before they invest their money in crypto.\n\n\"Don't get caught up in the FOMO, but you're also at risk of a field that the business model is taking your assets [and] co-mingling them, often in ways that are not allowed by our current laws,\" he said."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmludmVzdG1lbnRuZXdzLmNvbS9yZWd1bGF0aW9uLWFuZC1sZWdpc2xhdGlvbi9uZXdzL21vcmUtYWR2aXNvcnMtYXJlLWp1bXBpbmctb24tdGhlLWJpdGNvaW4tYmFuZHdhZ29uLTIzMzI2MNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "More advisors are jumping on the bitcoin bandwagon - InvestmentNews",
        "content": "The crypto winter, the term often used to describe the dramatic collapse in cryptocurrency prices over the past year, is apparently having little impact on financial advisors determined to ride the waves in the fast-evolving digital currency space.\n\nEven with bicoin, the best-known cryptocurrency, down nearly 65% from its peak of just over $65,000 in November 2021, the true believers are determined to focus on the long term.\n\nA report out Friday from Bitwise and VettaFi shows 60% of financial advisors are long-term bullish on crypto.\n\nPerhaps what makes the findings so surprising is that the research was conducted prior to the recent rally that’s seen the price of bitcoin jump nearly 40% over the past four weeks.\n\n“I was surprised by the findings; I thought the downturn would have scared off advisors,” said Todd Rosenbluth, director of research at VettaFi.\n\n“Advisors seem to be relatively loyal to the long-term view and potential benefits of crypto,” he added. “Usually when something sells off, people want to tell you they’re concerned. I think that bodes well for future crypto investing.”\n\nIf advisors are starting to show a new interest in crypto it could be, at least in part, to try and keep up with their clients. The survey showed that 14% of advisors say all of their clients are investing in crypto, which compares to 8% last year and 6% two years ago.\n\nForty-five percent of advisors said some of their clients are investing in crypto, which compares to 62% last year and 34% two years ago.\n\nWhen asked if they’re investing in crypto in their personal accounts, 37% of advisors said yes, which compares to 47% last year and 24% two years ago.\n\nWhen it comes to accessing crypto, exchange-traded funds have become the most popular avenue, even though U.S. regulators have not yet permitted funds that invest directly in the digital currency.\n\nWhen asked how they gain exposure for clients, 25% said they use ETFs that invest in crypto companies. The second most popular way of gaining exposure, at 17%, is directly investing in various cryptocurrencies.\n\n“I think ETFs are what advisors are most interested in because that’s what’s available,” said Rosenbluth.\n\nAs an example of the appeal of crypto, Rosenbluth referenced the ProShares Bitcoin Strategy ETF (BITO). At $786 million, BITO is the largest cryptocurrency ETF, and it had $161 million in net inflows last year despite recording a 64% decline. So far this year, the fund is up 41%, essentially tracking the price fluctuations of bitcoin.\n\nExtreme price volatility has become a trademark of cryptocurrencies, and some advisors have kept away for that reason. But after four peak-to-trough cycles over the past 12 years, even some naysayers are taking notice.\n\n“For the first time that I can recall, I came into 2023 being bullish on bitcoin,” said Paul Schatz, president of Heritage Capital.\n\nSchatz said his clients have shown little interest and he thinks the existing ETFs are “flawed and need more regulation,” but he likes the price patterns he sees.\n\n“I saw the downside as $14,000 to $15,000 and the upside to almost $30,000,” he said. “That’s pretty good risk-reward.”\n\nAt around $23,000, bitcoin is still well off its peak but the pattern moving toward the next reduction of the crypto payment awarded to miners of the digital currency in 2024 suggests another upcycle looming.\n\nRic Edelman, founder of the Digital Assets Council of Financial Professionals, said the price of bitcoin has eventually doubled every time the payment to miners has been cut in half, which is why he expects bitcoin’s price to reach $150,000 by the summer of 2025.\n\nOver its short history, since 2010, the price of bitcoin has suffered three negative years. But there have been big declines, including a 58% decline in 2014, a 73% decline in 2018, and a 65% decline in 2022.\n\nThe 11 positive years, meanwhile have ranged from 35% in 2015 to 9,900% in 2010.\n\nWith that in mind, it’s not a surprise that price volatility was listed among the top reasons advisors are avoiding crypto currencies.\n\nAsked about their reasons for not investing in crypto, 65% of advisors listed regulatory issues as a top concern, followed by price volatility at 51%."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tbWluaW5nLW51Y2xlYXItZW5lcmd50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Going Nuclear: Bitcoin Mining's Potential Energy Future - Blockworks",
        "content": "Though the prevalence of bitcoin miners using nuclear energy at scale could take years to materialize, several players in the space are bullish on the prospect.\n\nVolatility around bitcoin and the general slow pace of movement in an often risk-averse power industry could serve as barriers though, industry participants said.\n\nBitcoin miner TeraWulf recently revealed it is setting up operations at a nuclear energy-powered data center in Susquehanna, Pennsylvania, as part of a partnership with Talen Energy forged in 2021.\n\nThe company is targeting 50 megawatts (MW) of mining capacity at the site, with a hashrate capacity of about 1.6 exahashes per second (EH/s).\n\nTeraWulf began operations at its other site in upstate New York last March, using hydro and solar power at the facility. It is now set to commence mining at the nuclear plant by the end of the quarter.\n\nNuclear, natural gas and coal provide base load — a minimum level of power on a grid over a period of time. Renewable energy, such wind and solar sources, have intermittent load, meaning they are not continuous.\n\n“Given the significant penetration of renewables, what’s been happening with a lot of these base-load facilities is they’re not running at base load anymore,” Nazar Khan, TeraWulf’s co-founder and chief operating officer, told Blockworks. “They were looking and saying the optimal way to run a nuclear facility is for it to just run.”\n\nKhan added that the set-up allows for a bitcoin miner to be an asset to a system that rarely uses peak demand. While TeraWulf gets a reliable and carbon-free energy source to mine bitcoin, the nuclear plant can guarantee a number of megawatts coming off their generators each day.\n\n“If we could do five more deals like Talen, we would,” he said. “We’ve had discussions with the largest nuclear operators in the country down to folks who have a couple of sites.”\n\nKhan said the conversations are ongoing, declining to share the specific nuclear operators TeraWulf is in talks with.\n\nHow do other miners view nuclear energy sources?\n\nTeraWulf is not the only miner bullish on using nuclear power.\n\nWhile Marathon Digital has not yet made nuclear power a major part of its strategy, it sees the energy source as a potential key part of the future. The company doubled its hashrate in 2022 to 7 EH/s and expects to have 23 EH/s of capacity installed near the middle of 2023.\n\n“When we, and I think a lot of other bitcoin miners, realized how much stranded or wasted wind and solar [energy] there was…that became a pretty good target for bitcoin miners,” said Charlie Schumacher, Marathon’s vice president of corporate communications. “Because you’re looking for stranded, wasted energy; you don’t want to compete with consumers for electricity.\n\n“So I think that was low-hanging fruit initially, but long-term nuclear makes a ton of sense,” he told Blockworks.\n\nUK-based Lake Parime, a company focused on transforming energy into zero-carbon computing power, revealed in November that it launched a site in Ohio using 100% nuclear energy.\n\nThe 20 megawatt (MW) site’s hosting clients are Marathon and TAAL, a company that offers blockchain services and infrastructure.\n\nSchumacher said the Ohio site is a good way for Marathon to “test the waters” about potentially using nuclear energy on a larger scale.\n\n“We’re definitely interested if we can find a site that works for us,” he said. “If you just think of the nuclear sites that exist today, we would be happy to co-locate next to one and serve as a base-load customer for them.”\n\nLili Rhodes, a senior mining analyst at Compass Mining, called nuclear power an ideal power source for bitcoin miners in a September 2021 blog post — noting that it is energy efficient and cheap.\n\nWilliam Foxley, Compass Mining’s director of media and strategy, told Blockworks that Compass Mining has a few mines connected to larger grids partially run on nuclear energy.\n\nThe company secured a 20-year partnership with Oklo, a fission company that had a proposed power plant being reviewed by the US Nuclear Regulatory Commission. But Foxley said Compass Mining’s deal with Oklo is on pause until its partner receives more regulatory clarity.\n\nThe current power strategy of Riot Blockchain, meanwhile, focuses on having a large, flexible load in Texas’s ERCOT grid, according to CEO Jason Les. This includes various emission-free energy sources, including wind, solar and nuclear.\n\nLes did not return a request for further comment.\n\nHive Blockchain, another publicly traded miner, does not use nuclear energy, CEO Aydin Kilic said.\n\n“Our focus has been hydro and geothermal, which do not produce waste,” he told Blockworks. “Nuclear is treated as non-emitting but it is not a renewable green energy source like hydro and geothermal.”\n\nBarriers to overcome\n\nSchumacher called the nuclear energy industry an “intensely regulated space” with few new sites.\n\nRhodes wrote in the 2021 blog post that nuclear power is demonized by the mainstream media and feared by the general public. Many people associate the word nuclear with bomb, Schumacher added, further slowing the pace of adoption.\n\nThe newest reactor to enter service is Tennessee’s Watts Bar Unit 2, which began operation in 2016, according to the US Energy Information Administration (EIA). The next-youngest operating reactor is Watts Bar Unit 1, also in Tennessee, which opened in 1996.\n\nOverall, there were 92 nuclear reactors operating at 54 nuclear power plants in 28 states, as of July 2022, EIA data shows. Nuclear power plants have supplied about 20% of total annual electricity used in the US since 1990.\n\nWhile nuclear energy is a great source of power for bitcoin miners in theory, Schumacher said, it takes two sides to form a partnership.\n\n“I think like many folks in the power industry, they’re risk-averse,” he added. “They think in terms of decades and bitcoin thinks in terms of months or days sometimes.”\n\nJonathan Cobb, senior communication manager at the World Nuclear Association, told Blockworks that bitcoin’s volatility in recent months could pose an issue.\n\nBitcoin’s price is down 66% from its all-time high reached in November 2021, and various miners have struggled to pay back debt it took on to expand during the bull run. Compute North and Core Scientific have filed for bankruptcy in recent months, and industry watchers have said they expect more casualties in the space this year.\n\n“Will bitcoin miners be in a position to agree to supply contracts that would be mutually beneficial?” Cobb said. “This would be less of an issue for other types of data centers with more certain business models.”\n\nKhan said the drastic fluctuating margins of the bitcoin mining industry through market cycles has turned off some nuclear power executives. Others in the power industry aren’t sold on bitcoin as an asset more generally, he added.\n\nStill, Khan said he believes as the bitcoin mining space consolidates and matures, it has a place in the nuclear energy segment.\n\n“We would love for it to be the majority,” he said of nuclear energy as a power source for TeraWulf long term. “It’s a zero-carbon base-load resource, so in terms of how it fits into what we’re doing, it’s a wonderful resource to have.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzI3L2JpdGNvaW4tbWluZXItYXJnby1ibG9ja2NoYWluLWZhY2VzLWNsYXNzLWFjdGlvbi1zdWl0LW92ZXItdXMtc2hhcmUtc2FsZS_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMS8yNy9iaXRjb2luLW1pbmVyLWFyZ28tYmxvY2tjaGFpbi1mYWNlcy1jbGFzcy1hY3Rpb24tc3VpdC1vdmVyLXVzLXNoYXJlLXNhbGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Argo Blockchain Faces Class-Action Suit Over US Share Sale - CoinDesk",
        "content": "\"Argo’s business was less sustainable than Defendants had led investors to believe; accordingly, Argo’s business and financial prospects were overstated,\" according to the filing. The mining firm offered 7.5 million ADS, each representing 10 shares of common stock, on the Nasdaq Global Market in September, 2021. However, 2022 was not kind to Argo, nor to its peers in the bitcoin mining industry. Firms were squeezed between falling crypto valuations and rising electricity costs. The pressures culminated in bankruptcy for one of the industry's biggest miners, Core Scientific."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jaGF0Z3B0LWxlYXJucy1iaXRjb2luLXdpbGwtZW5kLWNlbnRyYWwtYmFua2luZy1hbmQtZmlhdC1jdXJyZW5jedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "ChatGPT learns Bitcoin will end central banking and fiat currency - Cointelegraph",
        "content": "ChatGPT is a powerful new artificial intelligence (AI) tool, capable of problem-solving, advanced coding, answering complicated questions and now spelling out the end of fiat currencies.\n\nParman, a Bitcoin self-custody mentor and writer, taught ChatGPT that Bitcoin (BTC) would bring about the end of government-issued fiat currencies and shared the results in a Twitter thread.\n\nYou're not going to believe this, but I just Orange Pilled #ChapGPT. It is now a Bitcoiner. See this conversation, it's incredible. (Thread) pic.twitter.com/HJOqezmjlG — Parman (public account) Bitcoin Pub Key Whisperer (@Parman_Public) January 26, 2023\n\nParman explained that he “orange-pilled” or convinced the bot about Bitcoin and that the machine learning tool “is now a Bitcoiner.”\n\nThe process was straightforward. First, Parman asked ChatGPT how humanity could end central banking. After all, Bitcoin was created in the shadows of the 2008 financial crisis, and in the genesis block, the words “Chancellor on the brink of second bailout for banks” are etched, perhaps showing founder Satoshi Nakamoto’s aversion to central banking.\n\nChatGPT explains that one way to end central banking could be “decentralized digital currencies,” which sounds a lot like Bitcoin. Parman asks the bot to answer the question in two words, to which it replies, “decentralize finance.” That is to say, DeFi could bring about the end of central banking.\n\nParman, a Bitcoin maximalist, told the bot that DeFi is a “marketing term for what is actually centralized finance to scam people” and asked it to look a little deeper, to which ChatGPT answered, “end fiat.”\n\nIn conversation with Cointelegraph, Parman explained that he was testing ChatGPT and trying to use two-word answers to chivvy along the conversation:\n\n“I wanted to see how ‘smart’ it [ChatGPT] was. If it came up with the answer for two words to end central banking as ‘buy Bitcoin,’ I was going to be blown away.”\n\nParman was satisfied with the response that ending fiat would fell central banking, so he moved on to the how. How can humanity end fiat currency?\n\nChatGPT’s capabilities. Source: chat.openAI\n\nChatGPT listed four options: a return to a gold standard, promoting alternative currencies such as Bitcoin, reducing government spending, and changing government perception. The AI bot was getting close, but Parman is a serial Bitcoin orange-piller and educator and wouldn’t let up. He explained:\n\n“My natural instinct is to orange pill, so I guided it to the right answer.”\n\nThe machine learning tool now understood that crypto adoption could lead to the end of fiat, but crypto, in Parman’s view, is not the answer. “There is only one cryptocurrency that makes this possible, as it is the only one that has no issuer,” he typed.\n\nRelated: 10 ways blockchain developers can use ChatGPT\n\nParman refers to the fact that when Bitcoin was first mined, it was a digital trial, an experiment with a digital token that had no value nor a promise of value. All other cryptocurrencies, Parman explained, “have leadership teams and are, therefore, centralized.”\n\nSo, which one is it: ChatGPT, Bitcoin or crypto? The bot replied: Bitcoin.\n\nParman had successfully convinced a machine learning bot that Bitcoin could bring about the end of fiat currency. But why bother going to all that effort? Parman explained in a conversation with Cointelegraph:\n\n“Importantly, the world needs to know central banking is a scam, and everyone needs to know that Bitcoin is the only thing that can stop it.”\n\nPerhaps with the powerful ChatGPT bot on team Bitcoin, the world may draw a little closer to that realization."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmFhLmNvbS50ci9lbi9hbWVyaWNhcy9hcml6b25hLXN0YXRlLXNlbmF0b3ItaW50cm9kdWNlcy1iaWxsLXRvLW1ha2UtYml0Y29pbi1sZWdhbC10ZW5kZXIvMjc5ODY2NtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Arizona state senator introduces bill to make Bitcoin legal tender - Anadolu Agency | English",
        "content": "Necessary Cookies\n\nThis cookie is used to distinguish between humans and bots. This is beneficial for the web site, in order to make valid reports on the use of their web site.\n\nFunctional Cookies\n\nRemembers the user's selected language version of a website.\n\nPerformance/Analytical Cookies\n\nRegisters a unique ID that is used to generate statistical data on how the visitor uses the website.Used by Google Analytics to throttle request rate.\n\nAccept Reject\n\nAdvertising/Marketing Cookies\n\nThis cookie is used to collect information on consumer behavior, which is sent to Alexa Analytics. (Alexa Analytics is an Amazon company.)"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmNoYWluYWx5c2lzLmNvbS9ibG9nL2NyeXB0by1tb25leS1sYXVuZGVyaW5nLTIwMjIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Four Exchange Deposits Received +$1B in Illicit Funds in 2022 - Chainalysis Blog",
        "content": "Money laundering is crucial to all financially motivated crime because it’s what enables criminals to access the funds they generate from their activities. Otherwise, why commit the crimes in the first place? The same is true in cryptocurrency. The goal of money laundering in cryptocurrency is to move funds to addresses where its original criminal source can’t be detected, and eventually to a service that allows cryptocurrency to be exchanged for cash — usually this means cryptocurrency exchanges. If that weren’t possible, there would be very little incentive to commit crime involving cryptocurrency.\n\nWe’ve written in the past about how money laundering activity is highly concentrated to just a few services, and within those services, concentrated even further to a small number of deposit addresses. That remained true in 2022, though as we’ll explore, with a few new wrinkles. In addition, we’ll examine the rise of underground money laundering services that exist separately from the crypto businesses most are familiar with, and also analyze funds still held by crypto criminals on the blockchain.\n\nIn this report, we cover:\n\n2022 crypto money laundering activity summarized\n\nMoney laundering in cryptocurrency typically involves two types of on-chain entities and services:\n\nIntermediary services and wallets: These can include personal wallets (also known as unhosted wallets), mixers, darknet markets, and other services both legitimate and illicit. Crypto criminals typically use these services to hold funds temporarily, obfuscate their movements of funds, or swap between assets. DeFi protocols are also used by illicit actors in order to convert funds but, as we will discuss, are not an efficient means of obfuscating the flow of funds.\n\nFiat off-ramps: This refers to services that allow for cryptocurrency to be exchanged for fiat. This is the most important part of the money laundering process, as the funds can no longer be traced via blockchain analysis once they hit a service — only the service itself would have visibility into where they go next. Additionally, if the funds are converted into cash, they can only be followed further through traditional financial investigation methods. Most fiat off-ramps are centralized exchanges, but P2P exchanges and other services can also serve this function.\n\nWith that in mind, let’s look at some of the money laundering trends we saw in 2022.\n\nOverall, illicit addresses sent nearly $23.8 billion worth of cryptocurrency in 2022, a 68.0% increase over 2021. As is usually the case, mainstream centralized exchanges were the biggest recipient of illicit cryptocurrency, taking in just under half of all funds sent from illicit addresses. That’s notable not just because those crypto exchanges generally have compliance measures in place to report this suspicious activity and take action against the users in question, but also because those exchanges are fiat off-ramps, where the illicit cryptocurrency can be converted into cash.\n\nMore illicit funds were sent to DeFi protocols than ever before, a continuation of a trend that began in 2020. Cybercriminals send funds to DeFi protocols not because DeFi is useful for obscuring the flow of funds. In fact, quite the opposite is true, as unlike with centralized services, all activity is recorded on-chain. Keep in mind too that DeFi protocols don’t allow for the conversion of cryptocurrency into fiat, so most of those funds likely moved next to other services, including fiat off-ramps. And as we see below, almost all usage of DeFi protocols for money laundering is carried out by one criminal group of hackers stealing cryptocurrency.\n\nHackers holding stolen cryptocurrency are the only criminal category sending the majority of funds to DeFi protocols, at a whopping 57.0%. 2022 was an enormous year for hacking, hence why these cybercriminals were almost single-handedly able to drive the overall increase in the usage of DeFi protocols for money laundering. The fact that DeFi protocols themselves were the biggest target of hacks in 2022 also influences these numbers. In DeFi hacks, attackers often end up with tokens that aren’t listed on other exchanges, so they need to use decentralized exchanges (DEXes) to swap them for more liquid crypto assets. DEXes have historically been used to convert funds to Ether, which can then be sent to Ethereum-based mixers. DEXes have also been used to convert to virtual assets that will be more likely to hold their value, or in the case of stablecoins, to swap to an asset that cannot be frozen by the stablecoin issuer. However, as noted previously, DEXes don’t enable the conversion of funds from virtual currency to fiat currency — this must still be done through a centralized exchange or other fiat off-ramp.\n\nAside from hackers, crypto criminals send the majority of their funds directly to centralized exchanges, but there are some notable exceptions. For instance, darknet market vendors and administrators send most of their funds to other illicit services — primarily other darknet markets, some of whom may offer money laundering services similar to those of the now-shuttered Hydra Market. Darknet market addresses also sent a large share of funds to high-risk exchanges, such as Bitzlato, a Russia-based exchange shut down in an international law enforcement action recently for its money laundering activity. Ransomware attackers are another interesting case. Addresses associated with them send a disproportionately large share of funds to mixers, and also make heavy use of illicit services. Fraud shop vendors and administrators are also notable for their outsized mixer usage.\n\nIn total, we see that over half of funds sent from illicit addresses travel directly to centralized exchanges, both mainstream and high-risk, where they can be exchanged for fiat unless compliance teams take action. However, over 40% of illicit funds move first to intermediary services — primarily mixers and illicit services or DeFi protocols —, with most of those funds coming from ransomware, darknet market, and hacker addresses.\n\nOverall mixer usage falls in 2022, but illicit usage hits all-time high\n\nCrypto mixers are a popular obfuscation service used by crypto criminals, taking in 8.0% of all funds sent from illicit addresses in 2022. Mixers function by taking in cryptocurrency from multiple users, mixing it all together, and sending each user an amount equivalent to what they put in. The result is that each user’s cryptocurrency can now only be traced back to the mixer, rather than to its original source, unless special blockchain analysis techniques are employed. You can learn more about how different types of mixers work here.\n\nThere are many legitimate use cases for mixers, most of which are related to financial privacy. For example, if someone knows your cryptocurrency address, they can see virtually your entire transaction history on the blockchain, so it’s reasonable for users to try and prevent this with mixers. Of course, the financial privacy provided by mixers is also valuable to criminals, hence their popularity as a destination for illicit funds. In May 2022, OFAC sanctioned a mixer for the first time ever when it designated Blender.io for its role in laundering cryptocurrency stolen by North Korean hacking syndicate Lazarus Group. OFAC didn’t waste any time designating its second mixer, Tornado Cash, in August for the same reasons.\n\nThe sanctioning of prominent mixers may have contributed to two trends we observed in 2022: The total amount of cryptocurrency sent to mixers fell significantly, and the funds that did travel to mixers were more likely to come from illicit sources.\n\nMixers processed a total of $7.8 billion in 2022, 24% of which came from illicit addresses, whereas in 2021, they processed $11.5 billion, only 10% of which came from illicit addresses. The data suggests that legitimate users have decreased their use of cryptocurrency mixers, possibly due to law enforcement actions against prominent ones, while criminals have continued to use them. It’s also worth noting that the vast majority of illicit value processed by mixers is made up of stolen funds, the majority of which were stolen by North Korea-linked hackers, who are unlikely to be dissuaded by the threat of U.S. sanctions given they reside in a non-cooperative jurisdiction.\n\n\n\nOther sanctioned entities and darknet markets also accounted for significant shares of value received by mixers in 2022.\n\nMoney laundering concentration at fiat off-ramps\n\nAs we discussed above, fiat off-ramp services like exchanges are crucial for money laundering, as those are the services where criminals can turn crypto into cash, which is likely their ultimate goal. Fiat off-ramps are also among the most heavily regulated cryptocurrency services, and their compliance teams have an important role to play in flagging incoming illicit funds and preventing them from being exchanged for cash. But while there are thousands of cryptocurrency services offering fiat off-ramping, a select few receive most of the illicit funds we observe on-chain.\n\n915 unique fiat off-ramping services received illicit cryptocurrency in 2022, down from 1,124 in 2021. Some of that dropoff is likely due to exchanges going out of business during the bear market. Of the illicit funds received by exchanges, 67.9% went to just five services, all of which are centralized exchanges. This represents an increased concentration compared to 2021, when the top five services received only 56.7% of illicit funds.\n\nBut what about the individual exchange users facilitating this activity? We can assume that many of the criminals sending funds to fiat off-ramps are using an account at the service that they themselves control. But in some cases, criminals work with specialized money laundering service providers, who control the accounts and help criminals convert their cryptocurrency into cash once it arrives at the exchange. Those businesses fall into the category of nested services, meaning services that are built on top of larger exchanges, using those exchanges’ deposit addresses to access their liquidity and trading pairs. Most nested services are legitimate businesses — many prominent over-the-counter (OTC) brokers, for instance, operate as nested services. However, on-chain data suggests that a small group of nested services facilitate the majority of money laundering, either due to negligence or purposeful catering to crypto criminals.\n\nFor that reason, it’s useful to analyze the specific service deposit addresses that account for the majority of money laundering activity, as we can generally attribute the activity of a given deposit address to a user at the service whose account is linked to that deposit address. In the graph below, we look at all off-ramp service deposit addresses that received any illicit funds in 2022, bucketed by the range in value of illicit funds received.\n\nThe graph shows that most cryptocurrency money laundering is facilitated by a very small group of people. Four deposit addresses cracked $100 million in illicit cryptocurrency received in 2022, and combined received just over $1.0 billion, while the 1.2 million deposit addresses receiving under $100 in illicit funds account for $38 million in total. Further, 51% of the $6.3 billion in illicit funds received by fiat off-ramp services in 2022 went to a group of just 542 deposit addresses. Those numbers represent a lower level of money laundering concentration at the deposit address level than we saw in 2021, even though 2022 saw a slight uptick in concentration at the service level. One possible reason for this is that continued law enforcement crackdowns against crypto money launderers, such as the shutdown of the exchange Bitzlato, have spooked the biggest money laundering service providers, or encouraged them to spread their operations across more deposit addresses.\n\nWe also see high variance in the degree of money laundering concentration by crime type.\n\nJust 21 deposit addresses account for 50% of all funds sent from ransomware to fiat off-ramps, while the top 21 deposit addresses for funds received from darknet markets account for just 18%.\n\nDespite the drop in overall concentration, 51% of illicit funds moving to just 542 deposit addresses at 83 exchanges still represents a high level of money laundering concentration. If law enforcement and compliance teams were able to disrupt the individuals and groups behind those addresses, it would be much more difficult for criminals to launder cryptocurrency at scale, and go a long way toward making the ecosystem safer.\n\nUnderground money laundering services are a growing concern\n\nAnother money laundering trend we’ve observed is the growth of underground services that aren’t as publicly accessible or well-known as standard mixers, as they are typically accessible only through private messaging apps or the Tor browser, and usually only advertised on darknet forums.\n\nWe’ve written in past Crypto Crime reports about OTC brokers nested on exchanges that launder large quantities of illicit funds – many of which seem to explicitly cater to cybercriminals. While this activity still exists, we’re also seeing the rise of services with brand names and custom infrastructure, which vary in terms of complexity. Some function simply as networks of private wallets, while others are more akin to an instant exchanger or mixer. But generally, what links them is that they typically move cryptocurrency to exchanges on behalf of cybercriminals, exchange them for either fiat currency or clean crypto, then send that back to the cybercriminals. Like the nested OTC services, many of these underground services also use those exchanges for liquidity. We can see one example on the Chainalysis Reactor graph below, though names of relevant illicit organizations have been redacted due to ongoing investigations.\n\nIn this case, the underground laundering service, which functions similarly to a mixer, helped an affiliate for a prominent ransomware strain move funds to a deposit address at a large, centralized exchange. The deposit address is believed to be controlled by the laundering service itself.\n\nAnalysis of underground laundering activity like that shown above isn’t as easy to spot as most activity on public blockchains is by default — identifying these services’ addresses requires extensive investigative work, and untangling their transactions requires advanced blockchain analysis techniques such as demixing. That means it’s difficult to analyze these services’ activity at scale. However, we can estimate their activity by analyzing the activity of all wallets and networks of wallets that meet the following criteria:\n\nReceive large amounts of cryptocurrency from illicit services Send large amounts of cryptocurrency to exchanges and other fiat off-ramps\n\n\n\nThe graph below shows the yearly cryptocurrency value received by wallets that fit those criteria.\n\n\n\nTotal cryptocurrency moving to wallets fitting those criteria has grown over the last few years, and hit $6 billion in 2022. Again, these are estimates — we can’t guarantee that all of the wallets included in this analysis are necessarily underground laundering services, but their on-chain activity suggests that they could be. It’s also possible that usage of underground money laundering services will pick up as high-risk exchanges, which have facilitated this activity in the past, face increased pressure from law enforcement, as we saw with Garantex and Bitzlato.\n\nCriminal balances dropped in 2022\n\nAs we mentioned previously, criminals will often leave funds in a personal wallet, or in a wallet associated with a criminal service for extended periods of time. In some cases, this may be because their crimes have generated enough attention that they don’t feel it’s possible to move the funds without investigators or crypto industry observers calling it out — we see this often with funds stolen in hacks. In other cases, this may reflect an intention to hold cryptocurrency in the expectation its price will rise, or to continue using it for other criminal endeavors. Thanks to the transparency of the blockchain, we can track these criminal balances granularly to know how much confirmed illicit entities are holding at any given time. Below, we’ll take a look at how criminal balances changed in 2022.\n\nTwo things stand out: The first is that criminal balances have plummeted in value in 2022, from $12 billion at the end of 2021 to just $2.9 billion. Price declines in the ongoing bear market and large, successful seizures by law enforcement in 2022 are the most likely causes of this.\n\nSecond, we can see that stolen funds dominate on-chain criminal balances. This is likely due to the fact that the amount of cryptocurrency stolen in hacks has skyrocketed over the last two years, and that these hacks often become huge points of discussion on crypto Twitter and in other industry forums, with many tracking the funds publicly and sharing the addresses holding stolen funds. This can make it difficult for hackers to move stolen funds to a fiat off-ramp, which could be one reason they choose to leave the funds sitting in personal wallets.\n\nCriminal balances are valuable to track as they represent a lower-bound estimate of cryptocurrency that could potentially be seized by law enforcement — the true number for criminal balances is likely much higher, as it includes funds associated with addresses we’ve yet to attribute to criminal entities and funds derived from offline criminal activity and converted to cryptocurrency after the fact.\n\nInvestigative agencies have continued to ramp up their ability to seize cryptocurrency in 2022, with the IRS Criminal Investigation Unit announcing they seized $7 billion worth of digital assets last year, more than double the amount seized in 2021. 2022 saw several other notable stories of cryptocurrency seized from criminals, including:\n\nA record $3.6 billion seized from two individuals accused of laundering funds stolen in the 2016 hack of Bitfinex The November 2021 seizure of $3.36 billion in Bitcoin stolen from darknet market Silk Road, which was later announced publicly in November 2022 The seizure of $30 million worth of cryptocurrency stolen from Axie Infinity’s Ronin Bridge, marking the first successful seizure of cryptocurrency stolen by North Korean hacking syndicate Lazarus Group\n\n\n\nOur data on criminal balances suggests there are still more opportunities for successful seizures, and more generally, illustrates a crucial difference between financial investigations in cryptocurrency versus fiat: In cryptocurrency, criminal holdings can’t be stashed away in opaque networks of banks and shell corporations — almost everything is out in the open.\n\nThis material is for informational purposes only, and is not intended to provide legal, tax, financial, or investment advice. Recipients should consult their own advisors before making these types of decisions. Chainalysis has no responsibility or liability for any decision made or any other acts or omissions in connection with Recipient’s use of this material.\n\nChainalysis does not guarantee or warrant the accuracy, completeness, timeliness, suitability or validity of the information in this report and will not be responsible for any claim attributable to errors, omissions, or other inaccuracies of any part of such material."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAxLTI2L2JpdGNvaW4tZGVjbGluZXMtYXMtcmlzay1jb3JyZWxhdGlvbi1lYXNlcy1hZnRlci1yZWNlbnQtcmFsbHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Declines as Risk Correlation Eases After Recent Rally - Bloomberg",
        "content": "Bitcoin and most other major cryptocurrencies were trading lower, bucking the recent trend of outperforming traditional risk assets such as US stocks during this year’s rebound in prices.\n\nThe largest digital currency by market value fell as much as 3.1% and was trading at about $23,065 as of 4:07 p.m. in New York. A range of coins including Ether were also in the red, though an index of the 100 biggest coins showed gains, rising about 2%. The Nasdaq 100 Index rose 2%."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMS8yNi9zZWMtcmVqZWN0cy1hcmstMjFzaGFyZXMtc3BvdC1iaXRjb2luLWV0Zi1mb3Itc2Vjb25kLXRpbWUv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzAxLzI2L3NlYy1yZWplY3RzLWFyay0yMXNoYXJlcy1zcG90LWJpdGNvaW4tZXRmLWZvci1zZWNvbmQtdGltZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "SEC Rejects Ark 21Shares Spot Bitcoin ETF for Second Time - CoinDesk",
        "content": "One of the firms to have its bid rejected, Grayscale Investments (owned by CoinDesk parent Digital Currency Group) has chosen to take legal action over the SEC's decision, with oral arguments set to commence on March 7."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zdGF0ZS1zZW5hdG9yLXB1c2hlcy1iaWxsLXRvLW1ha2UtYml0Y29pbi1sZWdhbC10ZW5kZXItaW4tYXJpem9uYdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "State senator pushes bill to make Bitcoin legal tender in Arizona - Cointelegraph",
        "content": "Wendy Rogers, an Arizona state senator in the United States, has launched bills concerning cryptocurrency, including one that aims to make Bitcoin (BTC) legal tender in Arizona.\n\nIn a recent tweet, Rogers cited data from investment firm Goldman Sachs that BTC is the best-performing asset in the world and announced that she launched a set of crypto bills.\n\n“Breaking: #Bitcoin is the best performing asset in the world this year according to data from Goldman Sachs.”\n\n\n\nLaunched my #Crypto bills today, as well as Photo Radar Prohibition, which included nearly all my Republican senator colleagues as cosponsors @JeffWeninger @JDMesnard pic.twitter.com/ueUeFSEybo — Wendy Rogers (@WendyRogersAZ) January 25, 2023\n\nOne of the proposed bills focuses on making BTC legal tender in the U.S. state. If passed into law, BTC will have the same status as the U.S. dollar, becoming an accepted medium of exchange for debt payment, public charges, taxes and dues in the state.\n\nIn 2022, the state senator also introduced a similar bill without success. Despite this, Rogers still continues efforts to push BTC forward in the state. In April 2022, Rogers spoke against central banks and voiced her support for Bitcoin. She tweeted:\n\nCentralized digital money controlled by the central bankers is slavery. Decentralized #Bitcoin is freedom. — Wendy Rogers (@WendyRogersAZ) April 2, 2022\n\nApart from this, Rogers also participated in introducing a bill that seeks to make crypto a tax-exempt property. If approved, voters can decide in 2024 if they want tokens that do not represent foreign currencies or the U.S. dollar to be exempt from taxes.\n\nRelated: US Senator Ted Cruz pushes for crypto in Congress ... using snacks\n\nOn Sept. 7, 2021, El Salvador officially made Bitcoin a legal tender in the country. More than a year later, making Bitcoin legal tender in the country proved beneficial. El Salvador experienced increased tourism in 2022, with 1.1 million people visiting the country in the first half of the year.\n\nOn Jan. 22, Brazil and Argentina announced preparations to create a common currency parallel to the Brazilian real and the Argentine peso. Responding to this, Coinbase CEO Brian Armstrong suggested that moving to Bitcoin may be the right “long-term bet” for both countries."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzI2L2NyeXB0by1tYXJrZXRzLWFuYWx5c2lzLWJpdGNvaW4tdHJhZGVzLWZsYXQtYXMtZ2RwLWVtcGxveW1lbnQtZGF0YS1zaWduYWwtbWlsZC1ncm93dGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: Bitcoin Trades Flat as GDP, Employment Data Signal Mild Growth - CoinDesk",
        "content": "Bitcoin, ether and most of the other major cryptocurrencies by market capitalization continued to hold about where they stood on Wednesday, same time. BTC and ETH both inched up a few fractions of a percentage point. BNB, APT and ADT, among others, were in the green. Bitcoin was recently holding steady over $23,000."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzI3L2JpdGNvaW4tbWluZXItZ3J5cGhvbi10by1nby1wdWJsaWMtdmlhLWFsbC1zdG9jay1tZXJnZXItd2l0aC1jYW5uYWJpcy1maXJtLWFrZXJuYS_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDEvMjcvYml0Y29pbi1taW5lci1ncnlwaG9uLXRvLWdvLXB1YmxpYy12aWEtYWxsLXN0b2NrLW1lcmdlci13aXRoLWNhbm5hYmlzLWZpcm0tYWtlcm5hL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Gryphon to Go Public Via All-Stock Merger With Cannabis Firm Akerna - CoinDesk",
        "content": "Gryphon also found itself in the middle of controversy last year after Sphere 3D signed a $1.7 billion deal with unknown mining-rig manufacturer NuMiner. The deal came under serious scrutiny by the mining community after several red flags were raised about the viability of NuMiner."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91cy1pbnN0aXR1dGlvbnMtYWNjb3VudC1mb3ItODUtb2YtYml0Y29pbi1idXlpbmctaW4tdmVyeS1wb3NpdGl2ZS1zaWduLW1hdHJpeHBvcnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "US institutions account for 85% of Bitcoin buying in 'very positive sign' — Matrixport - Cointelegraph",
        "content": "Institutional investors are “not giving up on crypto,” with recent data pointing to as much as 85% of Bitcoin buying being the result of American institutional players, according to Matrixport’s chief strategist.\n\nMarkus Thielen, the head of research and strategy at the financial services firm, told Cointelegraph the evidence shows that institutions are not “giving up on crypto” and is an indicator that we might be entering a new “crypto bull market now.”\n\nThe data was shared in a Jan. 27 report from Matrixport, which suggests that it can be distinguished whether a digital asset is more favorable by retail or institutional investors at any given time based on whether that asset is performing well in the United States or Asian trading hours.\n\nThe report stated that if an asset that trades 24 hours “performs well” during U.S. trading hours, it indicates that U.S. institutions are buying it, while an asset that sees growth during Asian trading hours indicates that Asian retail investors are buying it.\n\nThe report cited that Bitcoin (BTC) is up 40% this year, with 35% of those returns occurring during U.S. trading hours, meaning there is an “85% contribution” associated with U.S.-based investors, indicating that U.S. institutions are buyers of Bitcoin right now.\n\nBitcoin Fear and Greed Index is 55 - Greed\n\nCurrent price: $23,033 pic.twitter.com/OAt0TakkZR — Bitcoin Fear and Greed Index (@BitcoinFear) January 27, 2023\n\nThielen added that previous data shows that institutions typically first start buying Bitcoin before investing in other cryptocurrencies. He noted:\n\n“If history is any guide, then we should see the outperformance of layer 1 and altcoins relative to Bitcoin.”\n\nWhile the report highlighted that news regarding other projects positively impacted token prices such as Lido DAO (LDO) and Aptos (APT), the crypto rally only started once the U.S. inflation data was released on Jan. 12.\n\nIt was also mentioned that Ether (ETH) appears to be performing well during U.S. hours, indicating “institutional flows” into the cryptocurrency, however, APT is doing well around the clock.\n\n“Aptos is seeing a mix of strong returns during U.S. trading hours AND during Asia trading hours.”\n\nThe report concluded that this “should be a very positive sign for Bitcoin” as institutional adoption continues.\n\nRelated: Data shows pro Bitcoin traders want to feel bullish, but the rally to $23K wasn’t enough\n\nIn earlier comments to Cointelegraph, economist Lyn Alden believes that Bitcoin is currently playing “a bit of catch-up,” getting back to where it would have been without the FTX collapse occurring.\n\nAlden warned that there is “considerable danger ahead” for the second half of 2023, citing liquidity conditions being “good right now” partly because of the U.S. as a significant factor.\n\nAlden explained that as the U.S. Treasury is drawing down its cash balance to keep the country’s debt levels low, it pushes “liquidity into the financial system.”\n\nMeanwhile, popular trader and market commentator TechDev posted a Twitter update on Jan. 26 showing the price correlation between Bitcoin and gold, stating that if Bitcoin continues to follow the price of gold, it might even “crack the $50,000 mark.”"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMjcvYml0Y29pbnMtYmVzdC1zdGFydC1zaW5jZS0yMDIwLWxlZC1ieS1idWxsaXNoLXVzLXRyYWRpbmctaG91cnMv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMS8yNy9iaXRjb2lucy1iZXN0LXN0YXJ0LXNpbmNlLTIwMjAtbGVkLWJ5LWJ1bGxpc2gtdXMtdHJhZGluZy1ob3Vycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin on Track for Best January Since 2013, Led by Bullish Trading During US Hours - CoinDesk",
        "content": "Bitcoin on Track for Best January Since 2013, Led by Bullish Trading During US Hours\n\nBitcoin has rallied almost 40% since Jan. 1, on track for its best opening to a year since 2013 when it surged 51%.\n\nBy Omkar Godbole Jan 27, 2023 at 8:50 a.m. UTC"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vbGlzdGVuLnNkcGIub3JnL2J1c2luZXNzLWVjb25vbWljcy8yMDIzLTAxLTI3L2hhcmRpbmctY291bnR5LWJpdGNvaW4tbWluaW5nLW9wZXJhdGlvbi1mb2xkc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Harding County Bitcoin mining operation folds | SDPB - SDPB Radio",
        "content": "A crypto mining operation planned for northwest South Dakota is calling it quits and the natural gas wells powering the project are changing hands.\n\nThe new owners of the Harding County wells have a different plan for the sites.\n\nA Texas-based company called Spyglass Cedar Creek drilled dozens of natural gas wells in Harding County in 2006 and the leasing rights to the wells have changed hands multiple times.\n\nHighwire Energy Partners purchased leasing rights to the wells two years ago to extract natural gas to power on-site computers to conduct Bitcoin mining. Bitcoin mining was a lucrative business for the company in their home state of Wyoming.\n\nThe company recently sold leasing rights to South Dakota-based Rushmore Resources.\n\nTreyton Kost-Hillmer is an Oil, Gas, and Minerals Agent for South Dakota. He said an unpredictable market for Bitcoin could have been the reason Highwire sold the leasing rights.\n\n“I’m guessing Rushmore Resources wants to take over the leases from them because they are going bankrupt or their not making enough money to pay their cost,” Kost-Hillmer said.\n\nWhen Highwire began the project two years ago, one Bitcoin was valued around $50 thousand. It’s now less than half that.\n\nTrent Arlent is general manager of Rushmore Resources. He said they’ll use the natural gas for traditional energy, powering and serving their community.\n\n“We feel like that our state is a great state and there’s a lot of benefits and a lot of qualities to the way of life that we want to be able to keep and retain here,” Arlent said.\n\nArlent said it could take up to a year to get their operation going.\n\n"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWNhbi1zdGlsbC1jcmFjay01MGstaWYtZ29sZC1jb3JyZWxhdGlvbi1jb250aW51ZXMtY2hhcnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin can still crack $50K if gold correlation continues — Chart - Cointelegraph",
        "content": "Bitcoin (BTC) could get sucked toward $50,000 like a magnet if it continues to follow gold, fresh analysis predicts.\n\nIn a Twitter update on Jan. 26, popular trader and market commentator TechDev presented a lofty new BTC price target tied to XAU/USD.\n\nGold, Bitcoin inverse dollar correlation “without question”\n\nAs the debate over how much Bitcoin will compete with gold remains, bullish-price takes are surfacing.\n\nFor TechDev, the outlook is more optimistic than for many — Bitcoin might even crack the $50,000 mark.\n\n“What if Bitcoin continues to follow Gold / DXY ?” he queried.\n\nAn accompanying chart compared BTC/USD to gold versus the U.S. Dollar Index (DXY). The precious metal, TechDev hinted while continuing a previous narrative, may be frontrunning Bitcoin in terms of its recovery.\n\nBTC/USD vs. XAU/DXY annotated chart. Source: TechDev/Twitter\n\nAs Cointelegraph reported, the correlation between gold and Bitcoin is now practically 100%.\n\n“Outside of momentary reactions to geopolitical events... You think gold has been leading bitcoin for 4 years?” a previous Twitter thread asked.\n\nTechDev added that the idea was “not a forecast. A legitimate question.”\n\n“Would be interesting if it does play out. Both assets’ inverse correlation to the dollar is without question,” he concluded.\n\nShould Bitcoin keep chasing gold in relative terms, the outcome could be a game-changer for bulls. XAU/USD is up 6.1% year-to-date — already far below BTC/USD by 39%, per data from Cointelegraph Markets Pro and TradingView.\n\nAccording to TechDev, Bitcoin now has a chance of passing not only $30,000, but even $50,000.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nAnalyst: Gold set for imminent huge trade boost\n\nEven gold bugs, traditionally far from allies of Bitcoin, are eyeing a new halcyon era for the metal’s own fortunes.\n\nRelated: Bitcoin faces ‘considerable danger’ from Fed in 2023 — Lyn Alden\n\nAlasdair Macleod, head of research at Goldmoney, this week brought geopolitics to the fore in his forecast, predicting a major uptick in gold-based trade in Russia, China and across Asia.\n\n“Russia will not make formal announcements about gold standards, because there is no need. Nor will China: instead it might reveal an increase in gold reserves,” part of a Goldmoney article released on Jan. 26 read.\n\nMacleod himself is no Bitcoin fan, with a dedicated article comparing it with gold as money from December flatly predicting that the latter would win out in a crisis.\n\n“To affirm its status as money, bitcoin will have to obey the laws of time preference. In other words, its current relationship with interest rates must change, so that rising interest rates reflecting fiat currencies’ loss of their purchasing power should become reflected in rising values for bitcoin,” he wrote.\n\n“We will not try to guess this future. But we can say confidently that if the debasement of currencies accelerates, gold’s relative value will increase accordingly while that of bitcoin might not.”\n\nOther popular commentators have been more complimentary, with Mike McGlone, senior macro strategist at Bloomberg Intelligence, frequently entertaining Bitcoin outpacing gold in the long term.\n\nXAU/USD 1-day candle chart. Source: TradingView\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctdG8tbWluZS1iaXRjb2luLWF0LWhvbWXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "How to mine Bitcoin at home - Cointelegraph",
        "content": "Bitcoin mining (BTC) is the process of adding transactions to the Bitcoin blockchain, a decentralized public ledger of all Bitcoin transactions. Miners use powerful computers to solve complex mathematical puzzles, known as proof-of-work (PoW), to validate transactions and add them to the blockchain. In return, miners receive newly minted BTC as a reward for their work.\n\nThe process of mining Bitcoin involves solving a complex mathematical puzzle, known as a hash, using specialized software and hardware. The miner that solves the puzzle first is rewarded with new BTC, as well as the transaction fees associated with the transactions included in the block.\n\nMining Bitcoin requires a significant amount of computational power and energy, as the difficulty of the puzzles has soared over time. As the number of miners on the network increases, the difficulty of solving the puzzles also rises, making it more challenging and less profitable for individual miners to participate in the network.\n\nAs the mining difficulty climbs, more advanced equipment, such as application-specific integrated circuits (ASICs), and energy-efficient equipment, such as specialized graphics processing units (GPUs), are being used by miners. Overall, Bitcoin mining is a competitive process and only profitable when the price of BTC is high enough to cover the costs of equipment and electricity and leave a profit.\n\nRelated: What are the different ways to mine cryptocurrency?\n\nThis article will discuss a Bitcoin mining setup for beginners, how to get started with Bitcoin mining at home, the cost of Bitcoin mining, and its future.\n\nWhat do you need to mine Bitcoin at home?\n\nBitcoin mining at home may not be as profitable as it used to be, as the difficulty of mining has increased significantly. One needs to have access to cheap electricity, a reliable internet connection, and a powerful mining rig to mine Bitcoin from home.\n\nThe first step to mining Bitcoin at home is to build or purchase a mining rig. A mining rig is a computer specifically designed for mining cryptocurrencies. It will typically consist of multiple GPUs that are capable of performing complex mathematical calculations at high speeds.\n\nNext, one needs to set up a Bitcoin wallet to store the BTC after mining. There are several options available, including software wallets, hardware wallets and paper wallets. Once a user has their mining rig set up and their wallet ready, they will need to download Bitcoin mining software. There are several options available, including BFGMiner, CGMiner and EasyMiner.\n\nRelated: What are hierarchical deterministic (HD) crypto wallets?\n\nAfter installing the mining software, users will need to join a mining pool. A mining pool is a group of miners who combine their computing power in order to increase their chances of finding a block and earning a reward. Slush Pool, Antpool and BTC.com are a few examples of crypto mining pools.\n\nAfter joining a mining pool, they can start mining Bitcoin. The amount of BTC one can mine will depend on several factors, including the power of their mining rig, the cost of electricity and competition from other miners. So, how hard is Bitcoin mining at home?\n\nBitcoin mining at home can be challenging, as it requires a significant investment in specialized equipment and a high level of technical expertise. Additionally, the difficulty of mining Bitcoin has increased dramatically in recent years, making it difficult for individuals to compete with large-scale mining operations. Furthermore, the cost of electricity can be very high, making investing in buying Bitcoin a more affordable option.\n\nHow much electricity does it cost to mine Bitcoin?\n\nThe cost of electricity to mine Bitcoin can vary greatly depending on several factors, such as the cost of electricity in your area, the efficiency of the mining equipment you are using and the size of your mining operation. On average, it is estimated that the total energy consumption of the Bitcoin network is around 112.5 terawatts-hour per year, which is equivalent to the energy consumption of the entire country of Chile.\n\nHowever, the cost of electricity can be much higher in some areas. For example, in United States, where the majority of Bitcoin mining takes place, electricity prices can be as low as $12.5 per kilowatt-hour. In contrast, in countries like Germany or Denmark, electricity prices can be as high as $37.5 per kWh, making it much more expensive to mine Bitcoin.\n\nFurthermore, the cost of electricity can also vary depending on the efficiency of the mining equipment. Some devices are more energy-efficient than others, and this can greatly impact the overall cost of electricity. It is important to consider the efficiency of the equipment when calculating the cost of electricity for mining Bitcoin.\n\nWhat are the various ways to mine Bitcoin at home?\n\nThere are several ways to mine Bitcoin at home, but they all involve significant capital investment in specialized equipment and a high level of technical know-how. Some of the most common methods include:\n\nUsing a computer with a powerful graphics card: This method involves using a computer with a powerful GPU to solve complex mathematical problems in order to validate Bitcoin transactions and earn new BTC.\n\nUsing an ASIC miner: One can mine BTC, using a specialized mining device called an application-specific integrated circuit miner, which is specifically designed for mining Bitcoin. These devices are much more efficient than a computer with a GPU but also much more expensive.\n\nJoining a mining pool: By joining a group of other miners to combine your resources and increase your chances of earning new BTC, one can begin mining Bitcoin at home. However, the mining pool will divide the rewards among the members according to their contributed mining power.\n\nCloud mining: This method involves renting mining power from a cloud mining service, which will take care of the maintenance and management of the mining equipment.\n\nHow to mine Bitcoin on a PC\n\nTo mine Bitcoin on a PC, one will need to follow these steps:\n\nGet a Bitcoin wallet: One will need a place to store the Bitcoin that they mine, so they’ll need to get a Bitcoin wallet. There are several options available, such as a software wallet, which a user can download to their computer, or a hardware wallet, which is a physical device that they can use to store their BTC offline.\n\nDownload mining software: Users will also need to download mining software that is compatible with their computer’s operating system.\n\nJoin a mining pool: Joining a mining pool will increase one’s chances of earning new BTC, as the mining pool will divide the rewards among its members according to their contributed mining power.\n\nConfigure your mining software: One will need to configure their mining software with their Bitcoin wallet address and the address of the mining pool that they joined. They will also need to set the number of threads and the intensity of the mining.\n\nStart mining: Once a user has configured their mining software, they can start mining. The software will use a user’s computer’s processing power to solve complex mathematical problems in order to validate Bitcoin transactions and earn new BTC.\n\nHow to mine Bitcoin on a smartphone\n\nMining Bitcoin on a smartphone is impractical, as smartphones do not have enough processing power to compete with dedicated mining equipment. Additionally, the high energy consumption of mining can cause a smartphone to overheat, which can damage the device.\n\nAlso, Bitcoin mobile mining apps are usually not real mining, but rather a way to earn small amounts of BTC or other cryptocurrencies by completing small tasks or watching ads. These apps use a phone’s processing power and battery to run the mining process, but the rewards are very low and may not be worth the resources spent on the process.\n\nIf someone still wants to try earning Bitcoin via a mobile mining app, the steps would be as follows:\n\nDownload a mobile mining app: There are several mobile mining apps available on the App Store or Google Play Store. However, the majority of apps are only accessible on third-party cryptocurrency mining websites, whose reliability must be thoroughly checked before use.\n\nCreate an account: The next step is to create an account with the mobile mining app in order to start earning Bitcoin.\n\nComplete tasks or watch ads: The app will give a user the option to complete small tasks or watch ads in exchange for a small amount of Bitcoin or other cryptocurrencies.\n\nWait for rewards: The rewards will be added to a user’s account balance, and they can withdraw them to their Bitcoin wallet when they reach the minimum threshold.\n\nThe future of Bitcoin mining\n\nThe future of Bitcoin mining is uncertain and depends on a variety of factors. One major factor is the price of Bitcoin, as the profitability of mining can vary greatly depending on the value of the cryptocurrency. Another critical aspect is the development of mining technology, as new equipment and methods can make mining more efficient and cost-effective.\n\nFurthermore, the increasing decentralization of the mining network, with larger mining pools controlling a greater share of the network’s hashing power, could also have an impact on the future of mining.\n\nSimilarly, it is essential to consider the energy consumption of Bitcoin mining. As the difficulty of mining increases, more energy is needed to solve the complex mathematical puzzles required to mine new BTC. This has led to concerns about the environmental impact of mining, and some experts predict that regulations or taxes aimed at reducing energy consumption could be implemented in the future.\n\nAnother important point is the increasing Bitcoin mining competition, which might lead to a situation where only big companies will be able to mine profitably, and small miners will not be able to compete. Overall, the future of Bitcoin mining is uncertain, but it’s likely that the industry will continue to evolve and change as technology and market conditions change."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS9tYXJrZXRzL2JpdGNvaW4td29ybGRzLW1vc3QtaGF0ZWQtY3J5cHRvY3VycmVuY3nSAVBodHRwczovL3d3dy5mb3hidXNpbmVzcy5jb20vbWFya2V0cy9iaXRjb2luLXdvcmxkcy1tb3N0LWhhdGVkLWNyeXB0b2N1cnJlbmN5LmFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin world's most hated cryptocurrency - Fox Business",
        "content": "Bitcoin’s precipitous plunge in price helped it become the world’s the most hated virtual currency in 2022, according to a survey by crypto education website Coin Kickoff.\n\nThe world’s largest cryptocurrency by market value was the most disliked coin in 16 countries, led by Canada, Qatar and Finland.\n\nEthereum and solana were the world’s most loved, led by Indonesia, Russia and Uzbekistan.\n\nCoin Kickoff came up with its love/hate ranking by analyzing more than 835,000 Twitter posts with the artificial intelligence algorithm HuggingFace.\n\nBitcoin lost 70% of its value in 2022, causing investors to vent their frustration on social media. Ethereum, crypto’s second-largest currency, fell almost as much, dropping by 67.5%, but was spared the backlash.\n\nCoin Kickoff noted, in contrast to bitcoin, many of ethereum’s projects are based around decentralized finance (DeFi) — which aims to broaden the usage of cryptocurrencies for more complex transactions such as loans.\n\nSolana was also loved, despite losing 94% of its value. Its network suffered over five outages, numerous hacks and fallout from FTX’s bankruptcy with FTX and sister company Alameda Trading holding 10.7% of its tokens, according to Coin Telegraph.\n\nBRUTAL YEAR FOR BITCOIN AND ALMOST $3B IN CRYPTO HACKS MARKED 2022: REPORT\n\nRecent rally\n\nSentiment for bitcoin may improve with its recent price recovery.\n\nIan Wright, the crypto expert behind Coin Kickoff, told FOX Business: \"While it is still 67% down on its all-time high, investors are confident that the current economic climate in the U.S. and bitcoin’s standing as the pre-eminent crypto coin will yield further gains as the year progresses.\"\n\nFxPro senior market analyst Alex Kuptsikevich was more cautious. \"Despite the positive performance of the U.S. stock indices, bitcoin continued its unsuccessful attempts to consolidate above $23,000 on Wednesday. The crypto market has, at least, paused after rallying since the beginning of the year,\" he said.\n\nWright added that investors will look to see whether etherum can hit $5,000 in 2023.\n\n\"Like bitcoin, its value is rallying as a result of economic conditions. It is still highly regarded within the U.S. crypto community because of its long-term potential and the blockchain base for many of the industry’s most exciting prospects,\" he told FOX Business.\n\nSolana is benefiting from bonk, a new coin launched on its blockchain in December. Bonk rocketed 5,000% by early January, but has since fallen back, though it was up 910% year-to-date as of last week.\n\nSurprisingly, bitcoin was not America’s most hated virtual currency.\n\nHOUSE REPUBLICANS LAUNCHING DIGITAL ASSET SUBCOMMITTEE AFTER TROUBLED YEAR FOR CRYPTOCURRENCY INDUSTRY\n\nAmerica’s Top 5 hated by percentage of negative tweets:\n\n1. Axie Infinity (32.34%) lost 90% of its value in 2022. Hackers stole $625 million from its Ronin Network and the player base for its games dwindled due to competition for virtual 3D worlds.\n\n2. 1inch Network (31.59%) saw its value peak in 2021 at almost $7.50 against the dollar. Its performance was much more sluggish in 2022 as a result of the wider turmoil in the crypto market.\n\n3. Terra (27.35%) was one of crypto’s high-profile casualties of 2022. Despite a promising introduction where startup Terraform Labs secured $200 million in funding, the blockchain collapsed in May 2022 — wiping out $45 billion of market capitalization in a week. Its founders Do Kwon and Daniel Shin have been sued in Singapore, Korea and the U.S. for alleged financial irregularities, and authorities in Seoul issued an arrest warrant for Shin in November 2022.\n\n4. Uniswap (22.00%) peaked at $42 against the dollar and has yet to see its value move past the $10 mark.\n\n5. Holochain (21.24%) is billed as a more ethical alternative to the centralized crypto offerings. Holo allows customers to make their own choices and create more transparency around its blockchain technology. However, the coin is still valued at just $0.02 against the dollar.\n\nCRYPTO.COM CUTS 20% OF STAFF, CITING ECONOMIC HURDLES AND FTX COLLAPSE\n\nAmerica’s Top 5 most loved by percentage of positive tweets\n\n1. Stellar (68.72%) partnered with Ukraine’s government in 2021 to develop its digital infrastructure. The coin’s value increased further when Franklin Templeton became the first investment firm to launch a ‘tokenized’ mutual fund in the U.S. using Stellar’s blockchain.\n\n2. EOS (64.29%) gained popularity for its versatility, open-source capability and intuitive user-friendly platform that helps developers and investors. That transparency and accessibility makes it a favorite for investors.\n\n3. Decentraland (53.89%) has the largest metaverse currently online. Many predict that its coin will reach parity with the dollar in 2023. Mainstream interest in the platform from brands including Adidas, Dolce & Gabbana, Samsung, Sothebys, and Tommy Hilfiger make it feel more relatable as a concept for the wider public.\n\n4. NEAR Protocol (53.03%) reached record highs at the start of 2023. Many investors believe it has some of the most reliable technology on the market, with an active developer community and emphasis on security.\n\n5. Ravencoin (51.76%) as a peer-to-peer platform offers more coin versatility than its rivals.\n\nReuters contributed to this report."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctYml0Y29pbi1taW5pbmctc2F2ZWQtYWZyaWNhLXMtb2xkZXN0LW5hdGlvbmFsLXBhcmstZnJvbS1iYW5rcnVwdGN50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "How Bitcoin mining saved Africa's oldest national park from bankruptcy - Cointelegraph",
        "content": "Virunga National Park in the Democratic Republic of the Congo has become the first national park in the world to run a Bitcoin (BTC) mine in an effort to protect its forests and wildlife. Cointelegraph spoke with Sébastien Gouspillou, CEO of Big Block Green Services, and the man who introduced Bitcoin mining to the park.\n\nSpeaking via video call, Gouspillou said with a smile: “Bitcoin mining saved the park from bankruptcy.”\n\nVirunga is Africa's oldest protected park and a symbol of the continent's biodiversity. A report by journalist Adam Popescu, published in MIT Technology Review, explained that the region was plagued by issues prior to Bitcoin mining. From local militias that waged violent attacks on its animals and employees to outbreaks of Ebola to kidnappings, the emblematic national park has struggled for revenue in recent years.\n\nThe COVID-19 pandemic and its subsequent eradication of tourism was almost the nail in the coffin for the park, as visits to see the gorillas, other wildlife and waterfalls dried up. The article explained that tourism represented roughly 40% of the park’s revenue.\n\nFrom left to right, JF Augusti Co-founder of Big Block Green Services, Seb Gouspillou and Emmanuel de Merode. Source: Gouspillou\n\nWhen Gouspillou learned of the park’s strife, he felt compelled to help. He met with Emmanuel De Merode, the park’s director — and a Belgian prince by bloodline — at a chateau in France at the tail end of 2019. Gouspillou explained that he immediately recognized the tremendous opportunity the park presented.\n\nThe park could monetize its abundant and untapped natural resources to preserve its existence. Gouspillou explained to De Merode how Virunga could turn to Bitcoin mining to generate income.\n\nThe conversation in the chateau was non-stop. “It must’ve lasted hours,” Gouspillou explained. The discussion, as well as follow-ups and a visit to Congo, eventually culminated in De Merode setting up the first portions of the mining operation in early 2020, which successfully mined the first coins in September of that year.\n\nBitcoin mines in Virunga set against the park backdrop. Source: Twitter\n\nAlmost three years later, the park earned significant income from Bitcoin. During some months of the 2021 bull run, the park was rewarded upwards of $150,000 a month — almost entirely offsetting lost tourist income.\n\nVirunga's Bitcoin mine is a unique solution to the problem of preserving the park's biodiversity while also generating revenue. Bitcoin mining is a highly energy-intensive process, but Virunga's mine is unique in that it runs on clean energy: It’s green technology surrounded by green rainforest.\n\nThe mine is powered by one of three hydro plants within the park, a sustainable source of electricity that was already being used to power nearby towns. The site has hired nine full-time workers, who work in rotating shifts operating the miners in the jungle, to staff the facility. Fearless rangers protect the site — a story that inspired a Netflix documentary, among other things.\n\nThe facility has 10 shipping containers, with each container holding 250 to 500 rigs. Virunga owns three of these containers, Gouspillou the remaining seven. Gouspillou purchases energy from Virunga as part of the arrangement, while keeping the mined Bitcoin.\n\nPlus, as Gouspillou explains, the existing Bitcoin mining facility is part of a “global plan,” in which there will be further power-generating opportunities. Other power stations will be set up across the park, he explained, to connect local villages to electricity and, of course, mine more Bitcoin.\n\nDe Merode is steadfast that the project will be successful despite the ongoing bear market. Indeed, some Bitcoin miners fell victim to the 2022 bear market, but De Merode occupies a unique position: The park is not speculating on the value of Bitcoin, but generating Bitcoin using surplus energy to monetize something that otherwise has no value.\n\nVirunga National Park is known for its gorillas. Source: Virunga.org\n\nPlus, there is little risk of the Bitcoin (or private keys) disappearing if De Merode is killed in action. Over 200 of the park’s security, or rangers have been killed since 1996 — and De Merode was shot twice while traveling to Goma in 2014, so it’s a tragic but possible outcome that must be prepared for.\n\nThe park’s finance team manages custody of the Bitcoin wallet, and funds generated by the mine are sold regularly to pay for the park’s upkeep. In the MIT Technology Review article, De Merode is quoted as saying:\n\n“It’s unlikely we sit on Bitcoin for more than a few weeks anyway, because we need the money to run the park. So if something happened to me or our CFO lost the password, we’d give him a hard time—but it wouldn’t cost us much.”\n\nSimilar to El Salvador’s treatment in the mainstream media, the “bet” that De Merode made has invited skepticism from experts who wonder what crypto has to do with conservation. Gouspillou explained that it took some time for De Merode to refer to the project as a Bitcoin mining project, preferring to use the term “blockchain mining,” as it’s more PR-friendly.\n\nThe hydroplant and Bitcoin mine are located among the dense rainforest. Source: Gouspillou\n\nFor Gouspillou, he hasn’t been able to find a downside to the story of how a Bitcoin mine has saved a national park:\n\n“It’s really hard to find a negative side to this story. There’s nothing. The energy is clean, even the ASICS — we will transport them to recycling centers at the end of their lifespan.”\n\nASICS, or application-specific integrated circuits, are Bitcoin mining machines. Every 10 minutes, ASICS take part in a digital lottery to guess the next Bitcoin block on the Bitcoin time chain. As Gouspillou explains, these machines will be broken down and recycled, avoiding e-waste. The miners use excess, clean energy, and De Merode uses that funding to protect wildlife.\n\nBuoyed by the success in the Congo, Gouspillou has his eyes on other Bitcoin mining projects in Sub-Saharan Africa. He was part of the delegation that visited the Central African Republic — the second country to adopt Bitcoin as legal tender.\n\nBitcoin mining projects in Africa using untapped and renewable energy appear to be a growing trend. From the mountains of Kenya to the tropical climes of Malawi, Bitcoin mining is cropping up in incongruous areas of the globe.\n\nMagdalena Gronowska, regular Cointelegraph contributor and and Bitcoin mining specialist, explained why:\n\n“Miners are buyers of first resort (always want to run) and last resort for overproducing energy locations to become economically viable. As consumer demand grows in a community, Bitcoin mining can be decreased or removed entirely, but it enabled critical infrastructure to be built out.”\n\nIn essence, if a region offers stranded or abundant, overproduced energy, a Bitcoin mine could be financially appealing.\n\nNonetheless, the park still needs funds and investment. The Congolese government provides just 1% of its operating budget while tourism will remain low while conflicts threaten safety. As Gouspillou explains, Bitcoin mining is one solution to the park’s problems, as it provides a source of revenue that can be used to protect the park and its wildlife for years to come."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMS8yNy9jcnlwdG8tY3VzdG9kaWFuLXByaW1lLXRydXN0LXRvLWNlYXNlLW9wZXJhdGlvbnMtaW4tdGV4YXMtYXQtZW5kLW9mLWphbnVhcnkv0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzAxLzI3L2NyeXB0by1jdXN0b2RpYW4tcHJpbWUtdHJ1c3QtdG8tY2Vhc2Utb3BlcmF0aW9ucy1pbi10ZXhhcy1hdC1lbmQtb2YtamFudWFyeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Crypto Custodian Prime Trust to Cease Operations in Texas at End of January - CoinDesk",
        "content": "According to Prime Trust's notice, users who try to open a new account from Texas will receive an error message, and further contributions to accounts in the state are blocked. Disbursements are not blocked, and the company says it will work with customers to close down accounts."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXdpbGwtaGl0LTIwMGstYmVmb3JlLTcway1iZWFyLW1hcmtldC1uZXh0LWN5Y2xlLWZvcmVjYXN00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin will hit $200K before $70K 'bear market' next cycle — Forecast - Cointelegraph",
        "content": "Bitcoin (BTC) has “well-formed” evidence, which suggests that its next all-time high will top out at $200,000, one analyst says.\n\nIn a tweet on Jan. 27, popular Twitter commentator Trader Tardigrade, also known as Alan, also revealed $70,000 as the next potential bear market bottom.\n\nStochastic indicator offers Bitcoin bulls historical firepower\n\nFor many, BTC price action is still bound by Bitcoin’s four-year halving cycles. The resulting price pattern offers one “all time high year” in every four, with 2025 next in line.\n\nBitcoin’s block subsidy halving will occur a year prior, and from then on, Alan argues, the path will be open to a giant $200,000.\n\nThat price tag came about from an analysis of Bitcoin’s stochastic oscillator, which syncs with cycle highs and lows in BTC/USD. Currently, the indicator is printing its latest trough, and if history is a guide, price behavior will do likewise.\n\nThe stochastic oscillator is a volatility tool, which compares closing prices to historical averages.\n\n“Bitcoin well-formed structure with stochastic behavior indicates that the next ATH will be at 200K and next floor will be at 70K,” Alan summarized alongside an illustrative chart.\n\nBTC/USD annotated chart. Source: Trader Tardigrade/Twitter\n\nResponses to the post revealed a familiar divergence in opinions when it comes to Bitcoin’s future potential in U.S. dollar terms.\n\nNonetheless, $200,000 may seem modest for some long-time market participants, that level being a mere 189% higher than the existing all-time high from November 2021.\n\nConsensus believes that the scope of BTC investment returns will diminish in percentage terms over time, with long-term volatility cooling each cycle.\n\nPlanB eyes $32,000 BTC price next\n\nEqually optimistic in the current environment, meanwhile, is PlanB, the analyst responsible for the controversial Stock-to-Flow family of BTC price models.\n\nRelated: Bitcoin can still crack $50K if gold correlation continues — Chart\n\nBitcoin’s behavior in January has been a decisive turning point, he believes, pointing to various on-chain metrics as proof of the recovery.\n\nAmong the latest is realized return, which tracks aggregate profitability of spent coins.\n\n“Realized return just popped positive! Sellers are now taking profit (green) instead of cutting losses (blue) .. big difference,” PlanB commented on a chart.\n\nPlanB added this week that Bitcoin’s next short-term target should be $32,000, also based on realized price data.\n\nBitcoin realized return chart. Source: PlanB/Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oZXJlLXMtd2h5LWJpdGNvaW4tcHJpY2UtY291bGQtY29ycmVjdC1hZnRlci10aGUtdXMtZ292ZXJubWVudC1yZXNvbHZlcy10aGUtZGVidC1saW1pdC1pbXBhc3Nl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Here's why Bitcoin price could correct after the US government resolves the debt limit impasse - Cointelegraph",
        "content": "For much of 2022, the crypto market focused on the United States Federal Reserve’s actions. The central bank created a bearish environment for risk-on assets like stocks and cryptocurrencies by increasing the interest rates on borrowing.\n\nToward the end of 2022, positive economic data, healthy employment numbers and a decreasing inflation rate provided hope that a much-awaited slowdown in the rate of interest rate hikes would occur. Currently, the market expects that rate hikes will reduce from 50 basis points (bps) to 25 bps before the complete end of the hiking regime by mid-2023.\n\nFrom the perspective of the Fed’s goal of constraining liquidity and providing headwinds to an overheated economy and stock market, things are starting to improve. It appears that the Fed’s plan of a soft-landing by quantitative tightening to curb inflation without throwing the economy into a deep recession might be working. The recent rally in stock markets and Bitcoin can be attributed to the market's trust in the above narrative.\n\nHowever, another essential American agency, the U.S. Treasury, poses significant risks to the global economy. While the Fed has been draining liquidity from the markets, the Treasury provided a countermeasure by draining its cash balance and negating some of the Fed's efforts. This situation may be coming to an end.\n\nIt invokes risks of constrained liquidity conditions with the possibility of an adverse economic shock. For this reason, analysts warn that the second half of 2023 may see excess volatility.\n\nBackdoor liquidity injections negate the Fed’s quantitative tightening\n\nThe Fed started its quantitative tightening in April by increasing the interest rates on its borrowings. The aim was to reduce inflation by constraining the market's liquidity. Its balance sheet shrank by $476 billion during this period, which is a positive sign considering that inflation dropped and employment levels stayed healthy.\n\nU.S. Fed Balance sheet. Source: U.S. Federal Reserve\n\nHowever, during the same time, the U.S. Treasury used its Treasury General Account (TGA) to inject liquidity into the market. Typically, the Treasury would sell bonds to raise additional cash to meet its obligations. However, since the nation’s debt was close to its debt ceiling level, the federal department used its cash to fund the deficit.\n\nU.S. Treasury General Account Balance. Source: MacroMicro\n\nEffectively, it’s a backdoor liquidity injection. The TGA is a net liability of the Fed’s balance sheet. The Treasury had drained $542 million from its TGA account since April 2022, when the Fed began rate hikes. Independent macro market analyst Lyn Alden told Cointelegraph:\n\n“U.S. Treasury is drawing down its cash balance to avoid going over the debt ceiling, which is adding liquidity into the system. So, the Treasury has been offsetting some of the QT that the Fed is doing. Once the debt ceiling issue gets resolved, the Treasury will be refilling its cash account, which pulls liquidity out of the system.”\n\nDebt ceiling issue and potential economic fallout\n\nThe U.S. Treasury’s debt totaled approximately $31.45 trillion as of Jan. 23. The number represents the total outstanding of the U.S. government accumulated over the nation’s history. It is crucial because it has reached the Treasury’s debt ceiling.\n\nThe debt ceiling is an arbitrary number set by the U.S. government that limits the amount of Treasury bonds sold to the Federal Reserve. Hitting it means that the government can no longer take on additional debts.\n\nCurrently, the U.S. has to pay interest on its national debt of $31.4 trillion and spend on the welfare and development of the country. These expenditures include salaries of public medical practitioners, educational institutions and pension beneficiaries.\n\nNeedless to say, the U.S. government spends more than it makes. Thus, if it can’t raise debt, there’ll have to be a cut in either interest rate payments or government expenditures. The first scenario means a default in U.S. government bonds, which opens a big can of worms, starting with a loss of trust in the world’s largest economy. The second scenario poses uncertain but real risks as failure to meet public goods payment can induce political instability in the country.\n\nBut, the limit is not set in stone; the U.S. Congress votes on the debt ceiling and has changed it many times. The U.S. Treasury Department notes that “since 1960, Congress has acted 78 separate times to permanently raise, temporarily extend, or revise the definition of the debt limit — 49 times under Republican presidents and 29 times under Democratic presidents.”\n\nIf history is any indication, lawmakers are more likely to resolve those issues by raising the debt ceiling before any real damage is done. However, in that case, the Treasury would be inclined to increase its TGA balance again; the department’s target is $700 billion by 2023 end.\n\nEither by draining out its liquidity completely by June or with the help of a debt ceiling amendment, the backdoor liquidity injections into the economy would come to a close. It threatens to create a challenging situation for risk-on assets.\n\nBitcoin’s correlation with stock markets remains strong\n\nBitcoin’s correlation with the U.S. stock market indexes, especially the Nasdaq 100, remains near all-time highs. Alden noted that FTX’s collapse suppressed the crypto market in Q4 2022 when the equities rallied on slower rate hike expectations. And while Congress delays its decision on the debt ceiling, favorable liquidity conditions have allowed Bitcoin’s price to rise.\n\nBTC/USD price chart with Bitcoin-Nasdaq correlation coefficient. Source: TradingView\n\nHowever, the correlation with the stock markets is still strong, and movements in S&P 500 and Nasdaq 100 will likely continue influencing Bitcoin’s price. Nik Bhatia, a financial researcher, wrote about the importance of the stock market’s direction for Bitcoin. He said,\n\n“…in the short term, market prices can be very wrong. But over the more intermediate term, we have to take trends and trend reversals seriously.”\n\nWith the risks from the ongoing Fed’s quantitative tightening and stoppage of Treasury liquidity injections, the markets are expected to stay vulnerable through the second half of 2023.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWhhc2gtcmF0ZS10YXBzLW5ldy1taWxlc3RvbmUtd2l0aC1taW5lci1ob2RsaW5nLWF0LTEteWVhci1sb3fSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin hash rate taps new milestone with miner hodling at 1-year low - Cointelegraph",
        "content": "Bitcoin (BTC) is seeing new records in network activity as volatility sends BTC price action to fresh five-month highs.\n\nData from resources including MiningPoolStats confirms that Bitcoin’s hash rate hit new all-time highs on Jan. 26.\n\nHash rate passes 300 EH/s threshold\n\nIn another example of Bitcoin’s blitz recovery from the pits of post-FTX woes, network hashing power is now bigger than ever.\n\nHash rate, which is an expression of the processing power dedicated to the network by miners, is currently at 321 exahashes-per-second (EH/s), according to MiningPoolStats raw data.\n\nBitcoin hash rate raw data chart (screenshot). Source: MiningPoolStats\n\nDespite being only an estimate and impossible to measure entirely accurately, the latest readings are quite the feat, having never crossed the 300 EH/s level before.\n\nMining firm Braiins likewise confirmed the numbers in its live reporting feed.\n\nOther trackers from BTC.com and Blockchain.com have slightly lower estimates, both being around 275 EH/s on the day. The latter shows hash rate hitting an all-time high of 276.8 EH/s on Jan. 20.\n\nBitcoin hash rate chart (screenshot). Source: Blockchain\n\n“Your wealth is more secure than ever!” popular commentator BTC Archive wrote in part of a Twitter response to the data, indicative of improving sentiment across the Bitcoin space.\n\nHash rate is a key component of Bitcoin security and significant drawdowns result in network difficulty rising to entice more miners to participate.\n\nNetwork difficulty is also set to reach levels never seen before this week in a nod to fierce competition in the mining sector.\n\nAccording to data from BTC.com, the next automated readjustment will send difficulty an estimated 2.75% higher to 38.62 trillion.\n\nThe previous readjustment delivered a 10.26% increase, Bitcoin’s largest since October 2022 and only the second double-digit hike since mid-2021.\n\nBitcoin network fundamentals overview (screenshot). Source: BTC.com\n\nMiners get chance to balance books\n\nAnalyzing the climate, CoinLupin, a contributor at on-chain data platform CryptoQuant, warned that miners are still selling their BTC reserves, possibly to shore up capital in the event of a market reversal.\n\nRelated: Bitcoin faces ‘considerable danger’ from Fed in 2023 — Lyn Alden\n\n“Now they have improved profitability for the first time in a while, and mining costs are lower than Bitcoin prices. Normally, more active mining and holding could occur, but now they seem to see it as an opportunity to secure cash,” he wrote in a blog post, describing reserves as “declining at a rapid” pace.\n\n“One day price adjustment could happen in the section where they get enough cash and start collecting Bitcoin again. They constantly reduce their Bitcoin holdings during the rise.”\n\nCryptoQuant’s miner position index, which measures BTC outflows to exchanges from miner wallets relative to their one-year moving average, has captured several withdrawal spikes since Jan. 14.\n\nBitcoin miner position index chart. Source: CryptoQuant\n\nAt 1,837,138 BTC, miners’ reserves currently stand at their lowest since December 2021.\n\nBitcoin miner reserve chart. Source: CryptoQuant\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLXJlYm91bmRzLWFib3ZlLTIzMDAwLWNhbi1tYWludGFpbi1tb21lbnR1bS_SAV9odHRwczovL2Zvcmthc3QubmV3cy93ZWVrbHktbWFya2V0LXdyYXAtYml0Y29pbi1yZWJvdW5kcy1hYm92ZS0yMzAwMC1jYW4tbWFpbnRhaW4tbW9tZW50dW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin rebounds above $23,000. Can it maintain momentum? - Forkast News",
        "content": "Bitcoin, the world’s largest cryptocurrency by market capitalization, rose 9.89% from Jan. 20 to Jan. 27, to US$23,003 at 4:30 p.m. on Friday afternoon in Hong Kong. Ether gained 2.26% in the same timeframe, to change hands at US$1,582.\n\n“The rally is driven by a broader sentiment in the financial markets. The belief is that inflation has peaked and the economic slowdown will force the Fed to soften its stance on interest rates. This might result in 1 or 2 quarters without any rate hike and help the general available liquidity in the market,” Dinesh Goel, founder of play-to-earn ecosystem One World Nation told Forkast in a LinkedIn message.\n\n“This, however, is coupled with a looming fear of an impending recession. The mixed signals are prompting investors to divert a part of their wealth to gold or Bitcoin,” said Goel, adding that Bitcoin’s rally is also driven by investors who see it as a store of wealth.\n\nBonnie Cheung, head of strategy at Web3 communications protocol Sending Labs, attributes the crypto price rally this year to both macroeconomic factors and the removal of what she called crypto tourists.\n\n“Aside from the macros, where inflation fearmongers seem to have taken a backseat, don’t forget that while the “crypto tourists” have disappeared largely as a result of all the fallouts from centralized crypto finance players, the builders never stopped building,“ Cheung said in an email.\n\nKasper Vandeloock, the chief executive officer of quantitative trading firm Musca Capital, says the Bitcoin rally is due to short positions being liquidated and the industry recovering from FTX’s collapse.\n\n“As you can see in the screenshot linked below, there have been quite some large liquidations and open interest wipes. Besides that, tech [equities] has been having some slight recoveries which has a strong correlation to crypto,” wrote Vandeloock.\n\nPolygon’s MATIC was the week’s biggest gainer among the 10 largest non-stablecoin cryptocurrencies, up 14.4% on the weekly chart, trading at US$1.08.\n\nThe global crypto market cap stood at US$1.05 trillion on Friday at 4:30 p.m. in Hong Kong, up 7.58% from US$976 billion a week ago, according to CoinMarketCap data. Bitcoin’s US$443 billion represented 42.37% of the market, while Ether took up 17.9%.\n\nSmart contract blockchains gain\n\nThe Threshold (T) token was this week’s biggest gainer among the top 100 coins by market cap listed on CoinMarketCap, having rallied 129% to trade at US$0.050 after Coinbase added the token to its listings roadmap.\n\nAptos’ APT token was this week’s second biggest gainer, having rallied 118% to trade at US$17.69. Fantom’s FTM had the third-best performance, up 53.5% to change hands at US$0.46.\n\n“Aptos has been doing a great job of speed-building a vibrant community and playing catch-up to early comers such as Solana, perhaps even replacing it as the new Ethereum killer,” wrote Cheung.\n\n“However, if you have successfully rode through the last two crypto market cycles, you know the two things you will look at first are the market capital vs fully diluted valuation (currently at 15.86%, meaning ~85% of APT tokens are still locked up), and the most active exchanges where the token is traded, which for APT is surprisingly not Binance but Upbit, one of Korea’s largest exchanges. These two factors will help you gauge if the pump has a second act.”\n\nVandeloock said it’s unclear what triggered Aptos’ rally, “but it later got a lot of traction from traders looking for volatility. Tens of millions of shorts also got liquidated in this leg up,” said Vandeloock, referring to the screenshot below that he shared with Forkast.\n\nSee related article: Cold comfort: Is Crypto Winter the right time to invest in Web3?\n\nWhat’s in store next week?\n\nBitcoin’s relative strength index (RSI), a popular technical indicator for market analysts, reached 80 on the weekly chart, signaling that Bitcoin is “overbought.” One World Nation’s Goel said that investors should be mindful of this metric and that “we should expect price correction within the next 2 weeks.”\n\nVandeloock wasn’t quite on board with that view, saying that RSI is based on historical volatility and “at a moment of low volatility it adds little value to the overall events.” He said he does expect a downward move in the short term, but remains bullish in the mid to long term.\n\nGoel said that investors should be mindful of the Federal Open Market Committee’s (FOMC) meeting at the end of January.\n\nSee related article: World Economic Forum’s digital asset head expects real-world blockchain adoption in 2023\n\n“The trajectory of interest rates will govern the movement in the crypto market to a large extent. How the US government handles the FTX scam and the impending allegations against Binance will also play a crucial role in the overall market sentiment,“ Goel wrote.\n\nSending Labs’ Cheung said that the crypto market is entering the accumulation stage of the four-year Bitcoin halving cycle.\n\n“We’re hitting that up-ramp part of the four-year halving cycle. In the past, around 18 months ahead of the halving is when price starts to build out the bottom. This time, the 18-month period started in September 2022, when it was trading around 19K-20K,” Cheung said.\n\n(Updates to change Bitcoin price comparison period in deck.)"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zZWMtcmVqZWN0cy1hbm90aGVyLXNwb3QtYml0Y29pbi0yMTExMjc5NzcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "SEC Rejects Another Spot Bitcoin ETF Bid by ARK and 21Shares - Yahoo Finance",
        "content": "Another day, another refusal by the Securities and Exchange Commission (SEC) to allow a Bitcoin spot ETF to launch in the United States.\n\nThe latest rejected proposal came from Cathie Wood’s ARK Invest and global crypto ETF provider 21Shares, which for a second time joined forces in an attempt to launch the ARK 21Shares Bitcoin ETF. It was initially filed last year on May 13, a month after Ark’s first attempt to list the product on BZX was turned down.\n\nAn ETF—short for “exchange-traded fund”—is an investment vehicle offering indirect exposure to an underlying asset. This can be useful for investing in items that are difficult to own and store by oneself, such as gold, or for many, cryptocurrency.\n\nThe SEC’s rationale for the decision is the same as last time: Ark has failed to demonstrate that the rules of its exchange are adequate to protect the investing public from “fraudulent and manipulative acts and practices.”\n\nGrayscale: SEC Argument for Blocking Bitcoin Spot ETF 'Illogical'\n\n“An exchange that lists bitcoin-based ETPs can meet its obligations under Exchange Act Section 6(b)(5) by demonstrating that the exchange has a comprehensive surveillance-sharing agreement with a regulated market of significant size related to the underlying or reference bitcoin assets,” explained the SEC in its rejection.\n\nETFs would also give institutions a green light to effectively buy Bitcoin when they are otherwise barred from doing so by internal charter. This has made crypto bulls thirsty for such a product to hit the U.S. market—but so far, no dice.\n\nProShares Launches First ETF to Short Bitcoin\n\nBy contrast, the SEC willingly permitted multiple futures Bitcoin ETFs to launch beginning in October 2021. The ProShares Bitcoin Strategy ETF, which hit the market first, had one of the most active opening days in NYSE history.\n\nUnlike spot ETFs, futures ETFs are backed by Bitcoin futures contracts—promises to purchase Bitcoin for a set price at a later date. Unlike the Bitcoin spot market, the Bitcoin futures market is a regulated market in which an ETF can have a surveillance sharing agreement, such as the CME Bitcoin futures market.\n\nIn its own filing for a similar product, Grayscale argued that it could enter a surveillance-sharing agreement with the same market when launching a Bitcoin spot ETF. The SEC did not recognize CME Bitcoin Futures as adequately “related to spot Bitcoin.”"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtb25jZS1hZ2Fpbi1yZWplY3RzLWFyay0yMXNoYXJlcy1iaXRjb2luLWV0Zi1saXN0aW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "SEC once again rejects ARK 21Shares Bitcoin ETF listing - Cointelegraph",
        "content": "The United States Securities and Exchange Commission has once again rejected a proposal to list the ARK 21 Shares Bitcoin ETF on equities exchange Cboe BZX, according to Jan. 26 statement from the SEC, which rejected a similar proposal in April.\n\nThe SEC has just now once again rejected ARK's and 21Shares spot bitcoin, $BTC ETF listing. — unusual_whales (@unusual_whales) January 26, 2023\n\nThe proposed exchange-traded fund would have been managed jointly by Cathie Wood’s ARK Investment Management and 21Shares if it had been approved. The purpose of the proposed fund was to allow investors to gain exposure to Bitcoin’s price within the confines of the regulated stock market.\n\nThe Cboe BZX Exchange had originally asked to list the ETF in June 2021. After the first application was rejected in 2022, it reapplied and made new legal arguments in an attempt to get the fund approved.\n\nIn its second application back in May, the Cboe BZX Equities Exchange argued that it has a “comprehensive surveillance-sharing agreement with a regulated market of significant size” that can prevent manipulation of prices. The ARK 21Shares Bitcoin ETF should therefore be allowed to be listed, the exchange argued. According to the application, this surveillance sharing agreement is with the Chicago Mercantile Exchange (CME), where Bitcoin futures contracts are traded.\n\nThe application also argued that most currency and commodity spot markets are unregulated, but this does not usually mean that an application will be rejected for that reason alone.\n\nRelated: SEC’s ‘one-dimensional’ approach is slowing progress: Grayscale CEO\n\nIn its response, the SEC rejected these arguments. It stated that the surveillance sharing agreement between Cboe BZX Equities Exchange and the CME does not apply to spot Bitcoin, since only Bitcoin futures contracts are traded at CME.\n\nThe SEC also claimed that having a surveillance sharing agreement is not always necessary, but if such an agreement does not exist, then the exchange must “establish that other means to prevent fraudulent and manipulative acts and practices will be sufficient.” It said that the exchange has not demonstrated this point, so it is not allowing the ETF to be listed.\n\nThe SEC has so far not approved any spot Bitcoin ETF to be listed on an exchange. Grayscale Investment Trust is seeking to convert its Bitcoin Trust into a spot Bitcoin ETF, and it has sued the SEC for rejecting its proposal. Oral arguments are scheduled to be heard for the Grayscale case in March."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzI3L2NyeXB0by1tYXJrZXRzLXRvZGF5LWJpdGNvaW4taG9sZHMtc3RlYWR5LWFib3ZlLTIzay13aGl0ZS1ob3VzZS11cmdlcy1jb25ncmVzcy10by1zdGVwLXVwLWNyeXB0by1yZWd1bGF0aW9uL9IBnAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzI3L2NyeXB0by1tYXJrZXRzLXRvZGF5LWJpdGNvaW4taG9sZHMtc3RlYWR5LWFib3ZlLTIzay13aGl0ZS1ob3VzZS11cmdlcy1jb25ncmVzcy10by1zdGVwLXVwLWNyeXB0by1yZWd1bGF0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Today: Bitcoin Holds Steady Above $23K, White House Urges Congress to 'Step Up' Crypto Regulation - CoinDesk",
        "content": "The SSR measures the ratio between the supplies of bitcoin and stablecoins. As stablecoins represent buying power, a reduction in the SSR implies that investors are sending stablecoins to exchanges, likely for the purpose of buying bitcoin. Since Jan. 11, the SSR has increased 32%. So while BTC’s price has risen, investors do not appear to be sending stablecoins to exchanges en masse to add to long positions."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1ldGhlci11cC1hZGEtcG9zdHMtbW9zdC1nYWlucy1hbW9uZy10b3AtMTAtY3J5cHRvcy_SAVxodHRwczovL2Zvcmthc3QubmV3cy9tYXJrZXRzLWJpdGNvaW4tZXRoZXItdXAtYWRhLXBvc3RzLW1vc3QtZ2FpbnMtYW1vbmctdG9wLTEwLWNyeXB0b3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Markets: Bitcoin, Ether up; ADA posts most gains among top 10 cryptos - Forkast News",
        "content": "Bitcoin and Ether were up during Asia trading hours on Thursday afternoon as many markets in Asia returned from the Lunar New Year break. Cardano’s ADA led the rally among top 10 non-stablecoin cryptocurrencies by market capitalization.\n\nSee related article: A series of events: Crypto’s 2022 timeline\n\nFast facts\n\nBitcoin was up 1.21% in the past 24 hours, to trade at US$23,005 by 4 p.m. in Hong Kong. Ether gained 3.31% to change hands at US$1,606, according to CoinMarketCap data.\n\nBitcoin’s rally this week displayed some correlation to the Nasdaq-100, a tech-heavy index, which is on pace to have its best month since July 2022.\n\nCardano surged 4.84% to trade at US$0.37, and Solana had the second biggest gain with a 4.69% jump to US$24.39.\n\nThe global cryptocurrency market capitalization increased by 1.89% to US$1.05 trillion in the 24 hours to 4 p.m. in Hong Kong. The total crypto market trading volume increased by 9.25% to US$62.70 billion.\n\nTraders returned from the Lunar New Year holidays in various Asian markets, where equities were up despite Wall Street’s overnight slide. Hong Kong’s Hang Seng Index inched up by 2.19%, its highest close in almost two years.\n\nJapan’s Nikkei 225 slid by 0.12% while South Korea’s latest economic data showed its GDP fell by 0.4% in the last quarter of 2022 from the third quarter, marking the first time its economy had contracted in two and a half years.\n\nMembers of the Fed are scheduled to meet next week to decide the next move on interest rates. Analysts from CME Group predict a 99.8% chance of an increase of 25 basis points.\n\n(Update: adds Bitcoin correlation to tech stocks in the second bullet.)\n\nSee related article: Are VCs looking for the next big crypto star in 2023?"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjIvMTIvMTIvYnVzaW5lc3MvZnR4LXNhbS1iYW5rbWFuLWZyaWVkLWJhaGFtYXMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Sam Bankman-Fried Arrested in the Bahamas After US Prosecutors File Charges - The New York Times",
        "content": "Follow our live coverage of the arrest of FTX founder Sam Bankman-Fried.\n\nSam Bankman-Fried, the disgraced founder of the collapsed cryptocurrency exchange FTX, was arrested in the Bahamas on Monday after U.S. prosecutors filed criminal charges.\n\n“S.B.F.’s arrest followed receipt of formal notification from the United States that it has filed criminal charges against S.B.F. and is likely to request his extradition,” the government of the Bahamas said in a statement.\n\nThe arrest was the latest stunning development in one of the most dramatic falls from grace in recent corporate history. Mr. Bankman-Fried, 30, was scheduled to testify in Congress on Tuesday about the collapse of FTX, which was one of the most powerful firms in the emerging crypto industry until it imploded virtually overnight last month after a run on deposits exposed an $8 billion hole in its accounts.\n\nProsecutors for the Southern District of New York confirmed that Mr. Bankman-Fried had been charged and said an indictment would be unsealed on Tuesday. Separately, the Securities and Exchange Commission said in a statement that it had authorized charges “relating to Mr. Bankman-Fried’s violations of our securities laws.”\n\n\n\nThe criminal charges against Mr. Bankman-Fried included wire fraud, wire fraud conspiracy, securities fraud, securities fraud conspiracy and money laundering, said a person with knowledge of the matter."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzI3L3VrLW1hbi1zZW50ZW5jZWQtdG8tNC15ZWFycy1pbi1qYWlsLWZvci1zdGVhbGluZy0yNW0taW4tY3J5cHRvL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzI3L3VrLW1hbi1zZW50ZW5jZWQtdG8tNC15ZWFycy1pbi1qYWlsLWZvci1zdGVhbGluZy0yNW0taW4tY3J5cHRvL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "UK Man Sentenced to 4-1/2 Years in Jail for Stealing $2.5M in Crypto - CoinDesk",
        "content": "Helene is a New York-based reporter covering Wall Street, the rise of the spot bitcoin ETFs and crypto exchanges. She is also the co-host of CoinDesk's Markets Daily show. Helene is a graduate of New York University's business and economic reporting program and has appeared on CBS News, YahooFinance and Nasdaq TradeTalks. She holds BTC and ETH."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmVyLWh1dC04LXRha2VzLXN0b3VzaC13aXRoLW9udGFyaW8tcG93ZXItc3VwcGxpZXItdG8tY291cnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin miner Hut 8 takes stoush with Ontario power supplier to court - Cointelegraph",
        "content": "Canada-based Bitcoin (BTC) miner Hut 8 Mining Corporation has ramped up its ongoing fight with its power supplier for one of its mining sites, filing a lawsuit in a Canadian court.\n\nHut 8 said on Jan. 26 that it had filed a Statement of Claim in the Superior Court of Justice of Ontario against Validus Power, an energy supplier for a Hut 8 mining facility in North Bay, Ontario.\n\nThe firms have been in an ongoing dispute since early November due to what Hut 8 alleges is a failure by Validus to “meet its contractual obligations” for the power purchase agreement.\n\nIn its new lawsuit, Hut 8 is seeking “monetary damages incurred as a result of the dispute” and enforcement of certain provisions as per the agreement signed by the two companies.\n\nHut 8 and Validus started working together in late 2021, with Validus initially set to provide 35 megawatts (MW) of power to North Bay, a figure set to increase to around 100 MW by the end of 2021. The site was operating at 20 MW by July 2022 according to Hut 8.\n\nA June photo from the North Bay facility showing multiple ASIC crypto miners. Source: Hut 8\n\nOn Nov. 9, Hut 8 issued a notice of default to Validus, alleging it failed to achieve milestones by the dates outlined in the power purchase agreement and claiming that the firm demanded Hut 8 pay for energy at a higher price than the agreement called for.\n\nAn update from Hut 8 later that month revealed Validus suspended the delivery of energy to its North Bay site. Validus fired back with its own default notice alleging that Hut 8 failed to pay for its power charges, a claim Hut 8 denies.\n\nTo this date, operations at the site remain suspended. Hut 8 said it is exploring alternatives to mitigate the impact of the dispute, including through “organic and inorganic growth opportunities.”\n\nRelated: Bitcoin miners’ worst days may have passed, but a few key hurdles remain\n\nBefore it was taken offline, the North Bay site had 8,800 crypto mining rigs and a hash rate capacity of 0.84 exahashes per second (EH/s), accounting for over one-fourth of its total production capacity, according to a December investor deck.\n\nCointelegraph contacted Validus for comment but did not receive an immediate response."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xMjAwODcvc2VjLXJlamVjdHMtYW5vdGhlci1zcG90LWJpdGNvaW4tZXRmLWJpZC1ieS1hcmstYW5kLTIxc2hhcmVz0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMDA4Ny9zZWMtcmVqZWN0cy1hbm90aGVyLXNwb3QtYml0Y29pbi1ldGYtYmlkLWJ5LWFyay1hbmQtMjFzaGFyZXM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "SEC Rejects Another Spot Bitcoin ETF Bid by ARK and 21Shares - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAnother day, another refusal by the Securities and Exchange Commission (SEC) to allow a Bitcoin spot ETF to launch in the United States.\n\nThe latest rejected proposal came from Cathie Wood’s ARK Invest and global crypto ETF provider 21Shares, which for a second time joined forces in an attempt to launch the ARK 21Shares Bitcoin ETF. It was initially filed last year on May 13, a month after Ark’s first attempt to list the product on BZX was turned down.\n\nAn ETF—short for “exchange-traded fund”—is an investment vehicle offering indirect exposure to an underlying asset. This can be useful for investing in items that are difficult to own and store by oneself, such as gold, or for many, cryptocurrency.\n\nAD\n\nAD\n\nThe SEC’s rationale for the decision is the same as last time: Ark has failed to demonstrate that the rules of its exchange are adequate to protect the investing public from “fraudulent and manipulative acts and practices.”\n\n“An exchange that lists bitcoin-based ETPs can meet its obligations under Exchange Act Section 6(b)(5) by demonstrating that the exchange has a comprehensive surveillance-sharing agreement with a regulated market of significant size related to the underlying or reference bitcoin assets,” explained the SEC in its rejection.\n\nETFs would also give institutions a green light to effectively buy Bitcoin when they are otherwise barred from doing so by internal charter. This has made crypto bulls thirsty for such a product to hit the U.S. market—but so far, no dice.\n\nBy contrast, the SEC willingly permitted multiple futures Bitcoin ETFs to launch beginning in October 2021. The ProShares Bitcoin Strategy ETF, which hit the market first, had one of the most active opening days in NYSE history.\n\nUnlike spot ETFs, futures ETFs are backed by Bitcoin futures contracts—promises to purchase Bitcoin for a set price at a later date. Unlike the Bitcoin spot market, the Bitcoin futures market is a regulated market in which an ETF can have a surveillance sharing agreement, such as the CME Bitcoin futures market.\n\nAD\n\nAD\n\nIn its own filing for a similar product, Grayscale argued that it could enter a surveillance-sharing agreement with the same market when launching a Bitcoin spot ETF. The SEC did not recognize CME Bitcoin Futures as adequately “related to spot Bitcoin.”"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0cGF5LWFubm91bmNlcy1wYXJ0bmVyc2hpcC13aXRoLW1vb25wYXktcmVtb3Zlcy1iaXRjb2luLXRyYWRpbmctZmVlcy1mb3ItbGltaXRlZC10aW1l0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "BitPay Announces Partnership With MoonPay, Removes Bitcoin Trading Fees For Limited Time - Nasdaq",
        "content": "BitPay’s partnership with MoonPay is set to offer a superior buyer experience for those looking to purchase cryptocurrencies on the BitPay platform.\n\nBitPay and MoonPay, leading bitcoin and cryptocurrency payments infrastructure providers, have partnered “to provide BitPay users with significantly increased ways to buy cryptocurrency instantly, and at great rates.”\n\n“BitPay’s unique marketplace experience also presents multiple rates for buyers, ensuring they receive the best possible price for their cryptocurrency purchases,” the press release states. “Additional benefits of the integration include fast delivery to any owned wallet address, as well as the ability for buyers to pay with their preferred method, including credit card, debit card, Apple Pay, Google Pay or a variety of local bank transfer methods.”\n\nThe announcement also states that for a limited time, BitPay users will be able to purchase bitcoin with no fees. Those seeking to access the MoonPay integration can do so at BitPay.com or on the BitPay Wallet app.\n\nBill Zielke, CMO of BitPay, said in the press release that, “BitPay’s partnership with MoonPay brings together two leaders of the crypto payments space to give BitPay users near-instant access to cryptocurrency.”\n\nEchoing that statement, Harry Peatson, partner account manager at MoonPay, explained that, \"This partnership will provide users with a greater variety of ways to buy cryptocurrencies, allowing them to use their preferred buying methods, and with much greater speed of delivery than previously.\"\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90b3RhbC1jcnlwdG8tbWFya2V0LWNhcC1yaXNlcy1hYm92ZS0xdC1hbmQtZGF0YS1zdWdnZXN0cy1tb3JlLXVwc2lkZS1pcy1pbi1zdG9yZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Total crypto market cap rises above $1T — data suggests more upside is in store - Cointelegraph",
        "content": "Despite the recent negative crypto and macroeconomic newsflow, the total cryptocurrency market capitalization broke above $1 trillion on Jan. 21. An encouraging sign is that derivatives metrics are not showing increased demand from bearish traders at the moment.\n\nTotal crypto market cap in USD, 1-day. Source: TradingView\n\nBitcoin (BTC) price gained 8% this week, stabilizing near the $23,100 level at 18:00 UTC on Jan. 27 as the markets weighed the potential impact of Genesis Global Capital’s bankruptcy on Jan. 19.\n\nOne area of concern is Genesis Capital’s largest debtor, the Digital Currency Group, its parent company. Consequently, Grayscale funds management could be at risk, with investors unsure if Grayscale Bitcoin Trust assets could face liquidation. The investment vehicle currently holds over $14 billion worth of Bitcoin positions for its holders.\n\nA United States appeals court is set to hear the arguments relating to Grayscale Investment’s lawsuit against the Securities and Exchange Commission (SEC) on March 8. The fund manager questioned the SEC’s decision to deny their asset-backed exchange-traded fund launch.\n\nRegulatory concerns also negatively impacted the markets after South Korean prosecutors requested an arrest warrant for Bithumb exchange owner Kang Jong-Hyun. On Jan. 25, the Financial Investigation 2nd Division of the Seoul Southern District Prosecutor's Office sentenced Kang and two Bithumb executives on charges of conducting fraudulent illegal transactions.\n\nThe 7% weekly increase in total market capitalization was held back by Ether’s (ETH) 0.3% negative price move. Still, the bullish sentiment significantly impacted altcoins, with 11 of the top 80 coins gaining 18% or more in the period.\n\nWeekly winners and losers among the top 80 coins. Source: Messari\n\nAptos (APT) gained 91% after the smart contract network total value locked reached a record-high $58 million, fueled by the PancakeSwap decentralized exchange.\n\nFantom (FTM) rallied 50% after the announcement of its new database system, Carmen and a new Fantom Virtual Machine, Tosca.\n\nOptimism (OP) saw 21% gains after a sharp increase in transaction volumes during a nonfungible token incentive program called Optimism Quest.\n\nLeverage demand slightly favors bulls\n\nPerpetual contracts, also known as inverse swaps, have an embedded rate usually charged every eight hours. Exchanges use this fee to avoid exchange risk imbalances.\n\nA positive funding rate indicates that longs (buyers) demand more leverage. However, the opposite situation occurs when shorts (sellers) require additional leverage, causing the funding rate to turn negative.\n\nPerpetual futures accumulated 7-day funding rate on Jan. 27. Source: Coinglass\n\nThe 7-day funding rate was positive for Bitcoin and Ethereum, meaning the data points to slightly higher demand for leverage longs (buyers) versus shorts (sellers). Still, a 0.25% weekly funding cost is not enough to discourage leverage buyers.\n\nInterestingly, Aptos was the only exception as the altcoin presented a negative 0.6% weekly funding cost, with short sellers paying to keep their positions open. This movement can be explained by the 91% rally in seven days and it suggests that sellers expect some sort of technical correction.\n\nThe options put/call ratio shows no signs of fear\n\nTraders can gauge the market’s overall sentiment by measuring whether more activity is going through call (buy) options or put (sell) options. Generally speaking, call options are used for bullish strategies, whereas put options are for bearish ones.\n\nA 0.70 put-to-call ratio indicates that put options open interest lag the more bullish calls by 30% and is therefore bullish. In contrast, a 1.40 indicator favors put options by 40%, which can be deemed bearish.\n\nBTC options volume put-to-call ratio. Source: laevitas.ch\n\nEven though Bitcoin’s price failed to break the $23,300 resistance, the demand for bullish call options has exceeded the neutral-to-bear puts since Jan. 6.\n\nPresently, the put-to-call volume ratio stands near 0.50 as the options market is more strongly populated by neutral-to-bullish strategies, favoring call (buy) options by 50%.\n\nRelated: Bitcoin will hit $200K before $70K ‘bear market’ next cycle — Forecast\n\nDerivatives markets point to further upside potential\n\nAfter the third consecutive week of gains, which totals 40% year-to-date when excluding stablecoins, there are no signs of demand from short sellers. More importantly, leverage indicators show bulls are not using excessive leverage.\n\nDerivatives markets point to further upside potential. Even if the market revisits the $950 billion market capitalization from Jan. 18, there is no reason for panic. Currently, Bitcoin option markets show whales and market makers favoring the neutral-to-bullish strategies.\n\nUltimately, the odds favor those betting that the $1 trillion total market cap will hold, opening room for further gains.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1iZWFycy1pbi1kaXNiZWxpZWYtYXMtYnRjLXRhcmdldHMtMjgwMDAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin bears in disbelief as BTC targets $28,000 - Finbold - Finance in Bold",
        "content": "Bitcoin (BTC) has reclaimed the $23,000 position after acting as a major resistance hurdle recently. As the asset attempts to build on its upward trajectory, investors are wondering if this new position signals a sustained rally or is just a temporary bull run.\n\nIn this line, crypto trader and analyst by the Twitter pseudonym of Thescalpingpro, on January 26 stated that Bitcoin hitting $28,000 remains in play, but the digital asset faces heavy resistance ahead.\n\nFollowing the rally, the analyst suggested that Bitcoin bears remain in disbelief as they continue to short the cryptocurrency. However, he pointed out that the zone of $23,500 and $24,500 remain key areas to watch, as he believes breaching this area will push Bitcoin to $28,100.\n\n“Bitcoin price is near the range high, the entire $23.5k ~ $24.5k is a heavy resistance area. Bears are still shorting it and are in disbelief, won’t be surprised if it breaks out & it goes straight to $28.1k (without any HTF pullback),” he said.\n\nBitcoin price analysis chart. Source: Thescalpingpro\n\nWhat next for Bitcoin?\n\nAlthough Bitcoin has mainly traded in the green zone, the asset and the overall market continue to face uncertainty, as the sector is operating in almost similar conditions that characterized the 2022 bear phase.\n\nIn terms of Bitcoin’s current trend, some analysts have pointed out that bullish sentiments might be prevailing for the maiden crypto. A Finbold report indicates that the asset is poised to realize the golden cross formation pattern. Under this pattern, Bitcoin’s 50-day moving average (MA) approaches crossing above the 200-day MA.\n\nAt the same time, analysts have also pointed out that Bitcoin is staring at a possible first-ever death cross on the one week chart, which spells a bearish sentiment. Interestingly, Thescalpingpro had observed that Bitcoin’s current price movement mirrors the 2015 trajectory, where BTC pumped 214% just before a death cross was about to be realized.\n\nBitcoin price analysis\n\nBy press time, Bitcoin was valued at $23,154, having rallied over 11% in the last seven days.\n\nBitcoin seven-day price chart. Source: Finbold.\n\nWith Bitcoin remaining one of the biggest gainers of the year, the asset has witnessed sustained buying pressure, culminating in a market cap of about $444.10 billion.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5iYXNlLmNvbS9pbnN0aXR1dGlvbmFsL3Jlc2VhcmNoLWluc2lnaHRzL3Jlc2VhcmNoL21hcmtldC1pbnRlbGxpZ2VuY2UvYml0Y29pbi1oYXNocmF0ZS10cmVuZHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin hashrate trends - Coinbase",
        "content": "Following 2021 — a period of rapid capacity expansion and profitability growth for bitcoin miners — 2022 quickly became a comparatively tumultuous year for many operators, particularly those located in North America. A confluence of headwinds, both macroeconomic and crypto-specific, severely impacted the profitability of certain mining operators over the past twelve months, forcing many to restructure their balance sheets or even enter bankruptcy. Notably, however, the hashrate of the bitcoin network — a measure of the aggregate computing power competing to successfully mine the next block of bitcoin transactions — has maintained its upward trajectory amidst these headwinds and is currently near all-time-highs. In this report, we explore the cyclical nature of bitcoin mining and the competitive forces driving aggregate network hashrate ever-higher, despite challenging economics for miners and meaningful distress observed in the public markets. While the divergence between bitcoin price and network hashrate observed since late 2021 has caused some pain for certain mining operators, the persistence of network hashrate growth can be an indicator of the heightening security of the bitcoin network and a reflection of the increasing demand for bitcoin mining. The increasing demand for bitcoin mining globally, combined with its industrialization through the growth of public market miners in North America, has the potential to continue to support the upward trajectory of network hashrate in the year ahead. While higher aggregate hashrate may dampen the profitability of smaller scale or less well-capitalized operators (as larger, more well-capitalized players consolidate market share), the current trajectory is objectively a positive outcome for the broader security of the bitcoin network. Chart 1. Bitcoin price and hashrate with key events\n\nInherent cyclicality Given the historical volatility and cyclical nature of bitcoin’s price — in part driven by the supply side impact of new issuance halving every four years — it is reasonable to suggest that the business of bitcoin mining would be subject to some amount of cyclicality. Indeed, the market dynamics which characterize the bitcoin mining industry are directionally similar to the production cycles for traditional commodities, such as gold. As demand for the underlying commodity increases, the competition among market participants to establish or expand their operational footprint intensifies and the various inputs associated with building incremental capacity become more expensive. Ultimately, this operational response to an increase in demand of the underlying asset naturally materializes on a lagged basis, expanding up until the point where the demand growth for the underlying asset slows and the cycle begins to turn. Chart 2. ASIC hardware prices per model With respect to bitcoin mining, Application-Specific Integrated Circuit, or ASIC, machines can be viewed as the primary “picks and shovels” of the industry. We can establish the timeline of this most recent mining cycle by looking at the trajectory of price fluctuations for ASICs over the past few years. Beginning in late 2020, ASIC prices began a rapid ascent in response to the acceleration in the price of bitcoin. While ASIC prices are a decent real-time indicator of increased demand for bitcoin mining, the deployment of ASICs can take anywhere from 3 to 12 months (or even longer given pandemic-induced supply chain issues), meaning that the eventual impact on network hashrate and difficulty occurs on a lagged basis. From late 2020 to early 2022, many mining operators in North America sought to expand their operations to take advantage of the increased profitability of mining, given the rising bitcoin price. This intent to deploy hashrate in the region was accelerated by the Chinese hashrate migration stemming from China’s mining ban in mid 2021, which added to the backlog of hardware awaiting deployment in North America. As operators rushed to acquire ASICs, build infrastructure and deploy hashrate, many took on excessive debt, often collateralized by their bitcoin holdings or ASIC hardware. In hindsight, it is clear that many of these loans did not appropriately account for the possibility of a meaningful decline in the price of bitcoin. Further, once the price of bitcoin began to decline in earnest in March/April 2022, the mounting pressure on miner economics was compounded by factors exogenous to crypto such as rising energy costs and tighter credit conditions. The situation became particularly worrisome for operators who had entered variable rate agreements on either their power contracts or loans, or had failed to appropriately hedge their power costs. This amalgamation of headwinds forced many operators into distress, while those that had more conservatively managed their balance sheets were positioned to capture incremental market share.\n\nPublic miner overview Despite the prevalence of privately held operators in the industry (~177 exahashes (EH)/s or ~75% of aggregate hashrate as of October 2022), publicly traded bitcoin miners represent a rapidly growing segment of the global market for hashrate. The business of bitcoin mining has become increasingly industrialized in recent years as more operators are looking to take advantage of greater access to equity and debt financing available in developed capital markets. Despite a difficult 2022, many of the mining operators in North America are forecasting extensive capacity expansion plans for 2023. Due to the enhanced transparency of these public entities that are required to issue audited financials to shareholders, they can serve as a useful barometer for the health of the mining industry. It should be noted, however, that miners in North America face relatively difficult conditions compared to the global market for hashrate. While they certainly benefit from relative regulatory clarity and developed capital markets, they’ve had to endure rising energy costs , as well as an increasing cost of capital stemming from interest rate hikes. Further, given the influx of hashrate migrating to North America over the past few years, miners in the region may have felt compelled to aggressively expand their operations. Effectively, if a particular operator's share of network hashrate is not growing commensurate with the growth of the aggregate network, their market share is being diluted. A cohort of the top 15 public miners in North America that we will reference throughout this section had a combined hashrate of ~58 EH/s at the end of 2022, representing ~21.9% of aggregate network hashrate. Over the course of 2022, the bitcoin network’s hashrate increased by ~50% and the cohort of public miners detailed in Chart 3 grew their aggregate hashrate by ~109%, thus increasing their relative share of the network (from ~15.7% at the start of the year to ~21.9% by year-end). As shown below, certain miners were able to grow commensurate with (or even beyond) the aggregate growth of network hashrate (>50%), while others lost relative market share within the past year. Those operators that grew their hashrate by greater than ~109% took relative share within this cohort of public miners. Chart 3. Hashrate growth of top public miners in 2022 Hashrate growth, however, does not paint the full picture for this cohort of miners. Certain miners pushed aggressively to expand their hashrate at the expense of the health of their balance sheets. Leverage in the form of ASIC-backed loans became increasingly problematic in early 2022 as the price of ASICs began to plummet. Core Scientific, which filed for bankruptcy in December, raised a total of ~$366M over the past two years from six creditors, collateralized by their hardware (representing 8.9 EH/s of their 15.7 EH/s of total hashrate reported at year-end). Accordingly, the fair market value of the collateral backing these loans (which are now being restructured through bankruptcy) has fallen dramatically (in the range of ~50-70%). Interestingly, the creditors which supplied these ASIC-backed loans to miners are also in a precarious position, as their recourse options include becoming mining operators themselves (taking possession of the ASICs), liquidating the ASICs into a relatively illiquid and declining market, or working with borrowers to restructure the debt. For many creditors, the third option is actually the path of least resistance. While some mining operators are better positioned than others (i.e. those that were more conservative with debt financing and appropriately hedged power costs), it should not be entirely surprising that the most distressed mining operators happen to be located in North America, given the circumstances. Rising input costs, excessive leverage and an environment of increased competition all contributed to the current positioning of this cohort of operators. Chart 4 depicts the total debt levels across this cohort of miners (per EH/s of hashrate), as well as their amount of bitcoin reserves held at year-end. The total debt of this cohort of miners as of their last public filings is approximately US$2.4B in aggregate and they held a combined ~33k BTC (~US$760M) in their reserves at year-end. These metrics provide some insight into the financial positioning of these firms in the context of their go-forward ability to generate and accumulate new bitcoin. Firms like Hut8 and Riot have been able to amass large BTC reserves with relatively little debt. Chart 4. Total debt (per EH/s of hashrate) and bitcoin reserves of top public miners (as of Dec. 31, 2022)\n\nOne miner’s distress is another’s opportunity While mining conditions remain stressed for many operators, the theoretical decline in network hashrate resulting from ASICs being unplugged in North America has largely been offset by incremental sources of hashrate coming online. While data on the scale of some of these new operations and their precise origins is relatively sparse, there are a handful of plausible sources of incremental hashrate being deployed over the past twelve months, namely: Well-capitalized operators in North America : Firms like Riot, Cleanspark and Bit Digital were more conservative with regard to leverage than their peers prior to credit conditions tightening and were able to grow their share of network hashrate over the course of 2022. Further, many of the mining operators in North America have provided forward guidance suggesting meaningful capacity expansion in 2023. It is also worth noting that Foundry, a privately held bitcoin mining pool operator domiciled in the US (a subsidiary of Digital Currency Group), nearly quadrupled its hashrate over the past year (~86 EH/s at current) and is now the largest bitcoin mining pool in the world.\n\n: Firms like Riot, Cleanspark and Bit Digital were more conservative with regard to leverage than their peers prior to credit conditions tightening and were able to grow their share of network hashrate over the course of 2022. Further, many of the mining operators in North America have provided forward guidance suggesting meaningful capacity expansion in 2023. It is also worth noting that Foundry, a privately held bitcoin mining pool operator domiciled in the US (a subsidiary of Digital Currency Group), nearly quadrupled its hashrate over the past year (~86 EH/s at current) and is now the largest bitcoin mining pool in the world. Private or state-owned operators in regions with access to low-to-zero cost energy : Areas such as Russia , the Middle East , Africa and South America have seen increased demand for bitcoin mining leading to meaningful investments to build out mining capacity, typically taking advantage of cheap or otherwise stranded energy sources. Further, this mining cycle may differ from past cycles in that there are more incentives to engage in bitcoin mining, outside of pure speculation on the price of bitcoin. Increasingly, market participants are leveraging the bitcoin network for more specialized use cases, including: The geography-agnostic monetization of stranded energy sources that would otherwise be wasted or are uneconomical to transport to a grid/population : Natural gas flare capture represents a form of bitcoin mining that is actually a net positive in terms of emissions, as it converts otherwise flared methane into carbon dioxide, a much less dense form of carbon emissions. Large energy companies including Shell and Exxon have begun to engage with bitcoin mining, as they can bolster the profitability of their existing operations by monetizing otherwise stranded energy, while also reducing their net emissions.\n\n: Natural gas flare capture represents a form of bitcoin mining that is actually a net positive in terms of emissions, as it converts otherwise flared methane into carbon dioxide, a much less dense form of carbon emissions. Large energy companies including Shell and Exxon have begun to engage with bitcoin mining, as they can bolster the profitability of their existing operations by monetizing otherwise stranded energy, while also reducing their net emissions. Demand response programs aimed at stabilizing isolated energy grids : Bitcoin miners represent a very unique buyer of energy that has the ability to curtail their consumption at any time (known as an interruptible energy load), while most large industrial consumers of energy are unable to economically interrupt their operations. The two main forms of “demand response” being implemented by mining operators include: (1) negotiating with energy providers/utility companies to lock in a static low cost of electricity for a certain period of time (typically below market rates), under the condition that they will curtail (turn off) when demand from the grid spikes (periods of peak demand). Miners engaging in this form of demand response will ensure that the benefits of mining at a lower static cost will outweigh the potential downtime expected during periods of peak demand. Alternatively, (2) miners will sell power (i.e. turn off machines) back to the market at spot rates. In this arrangement, miners aren’t necessarily forced to curtail in response to peak demand, but instead are directly monetarily incentivized to do so. They will only engage in this form of demand response if the spot rates afforded to them by the market outweigh the profits they would have otherwise generated by mining bitcoin. This method is most prominently implemented by miners operating within the Texas/ERCOT grid.\n\n: Bitcoin miners represent a very unique buyer of energy that has the ability to curtail their consumption at any time (known as an interruptible energy load), while most large industrial consumers of energy are unable to economically interrupt their operations. The two main forms of “demand response” being implemented by mining operators include: (1) negotiating with energy providers/utility companies to lock in a static low cost of electricity for a certain period of time (typically below market rates), under the condition that they will curtail (turn off) when demand from the grid spikes (periods of peak demand). Miners engaging in this form of demand response will ensure that the benefits of mining at a lower static cost will outweigh the potential downtime expected during periods of peak demand. Alternatively, (2) miners will sell power (i.e. turn off machines) back to the market at spot rates. In this arrangement, miners aren’t necessarily forced to curtail in response to peak demand, but instead are directly monetarily incentivized to do so. They will only engage in this form of demand response if the spot rates afforded to them by the market outweigh the profits they would have otherwise generated by mining bitcoin. This method is most prominently implemented by miners operating within the Texas/ERCOT grid. Bootstrapping renewable (and intermittent) energy sources : The largest impediment for wind and solar capacity to effectively support populations at scale is the near-term profitability of those operators. The intermittent nature of wind and solar, combined with the imbalance of excess capacity versus what can actually be transported to grids for use, means that early-stage wind and solar projects are often producing energy that goes unused. Bitcoin mining can complement the build-out of this capacity by offering a profitable means of energy usage during times of off-peak demand (i.e. smoothing out the intermittency). A joint venture between Tesla, Block, and Blockstream announced last year plans to employ this concept in West Texas, creating a financial incentive to construct solar capacity through mining bitcoin. These incentive-based sources of incremental hashrate are not necessarily dependent on the operators’ desire to accumulate bitcoin, as is traditionally the case for mining operators. Instead, bitcoin mining is being used as a tool to directly monetize energy sources that would otherwise be stranded or uneconomical to transport to a grid or population."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xMjAwNDQvdGVzbGEtcmVwb3J0cy0zNG0taW1wYWlybWVudC1jaGFyZ2UtYml0Y29pbi1ob2xkaW5ncy1xNC0yMDIy0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMDA0NC90ZXNsYS1yZXBvcnRzLTM0bS1pbXBhaXJtZW50LWNoYXJnZS1iaXRjb2luLWhvbGRpbmdzLXE0LTIwMjI_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Tesla Reports $34M Impairment Charge on Bitcoin Holdings in Q4 2022 - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIn its latest earnings report released Wednesday, Tesla revealed it had neither bought nor sold any Bitcoin in the final quarter of 2022.\n\nThe electric car manufacturer, however, reported $34 million in impairment charges as the value of its Bitcoin holdings declined to $184 million from $218 million in Q3 2022.\n\nIn the world of accounting, an impairment charge is the reduction of an asset's value below its carrying amount or the acquisition cost of an asset. In the context of Tesla’s Bitcoin holdings, this means that while the company still holds the same amount of BTC in its balance sheet, the market value of the stash has dropped compared to the previous quarter.\n\nAD\n\nAD\n\nBitcoin traded just under $20,000 at the end of September 2022, before falling below $16,000 by the end of the year, according to CoinGecko.\n\nTesla and Bitcoin\n\nTesla joined the ranks of corporations holding the leading cryptocurrency when it revealed a $1.5 billion investment in Bitcoin in February 2021, with the news pushing the price of BTC to new record highs at the time.\n\nThe firm sold 10% of its Bitcoin holdings in Q1 2021 \"to prove liquidity of Bitcoin as an alternative to holding cash on balance sheet,\" with the next significant sale coming in the second quarter of 2022 when Tesla revealed that it had sold 75% of its Bitcoin holdings.\n\nAt the time, the company’s balance sheet showed sales from digital assets amounting to $936 million, with Musk pointing to uncertainty surrounding Covid lockdowns in China and the need to maximize the company’s cash to justify the sale.\n\nThe sell-off left Tesla with 10,725 BTC in its portfolio. The company—despite all the turmoil in the markets—continued to hold the stash throughout the second half of 2022.\n\nAD\n\nAD\n\nThis makes Tesla the fifth-largest public company with Bitcoin on its balance sheet.\n\nMichael Saylor’s Microstrategy still tops the ranks with 132,500 BTC worth over $3 billion in today’s prices, per Buybitcoinworldwide."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNpdHlhbS5jb20vd2h5LWktdGhpbmstYml0Y29pbi1jb3VsZC1iZS1hLWtleS10by1zYXZpbmctdGhlLWVudmlyb25tZW50L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Why I think Bitcoin could be a key to saving the environment - CityAM - City A.M.",
        "content": "Why I think Bitcoin could be a key to saving the environment\n\nby Susie Violet Ward\n\nMost people have heard about Bitcoin but they are unsure about what it is. Its magic internet money, only used by criminals and has no intrinsic value are some of the common misconceptions. Even governments, traditional fund managers and journalists do not yet understand this new technology. The FUD (fear, uncertainty and doubt) in the media is often misinformed or downright dangerous.\n\n\n\nWhat is Bitcoin?\n\nBitcoin is a peer-to-peer electronic cash system that allows money to cross borders without a 3rd party within milliseconds, 24 hours a day and for pennies. It solves a multitude of issues we have with our current financial system including fraud and trust. All transactions are recorded on an open-source blockchain. Since Bitcoin’s inception on January 3 2009, it has never been hacked.\n\nThere is a capped supply of 21 million and each bitcoin is divisible into 100,000,000 Satoshis. With the Lightning Network, it has the potential to be divided into smaller increments, giving it the potential to be used as a world reserve currency. The Lightning Network is a payment protocol layered on top of the bitcoin blockchain to facilitate faster transactions and is enabling bitcoin to scale.\n\nIts hard-capped supply means it cannot be inflated and no more can be made, thus making this the ‘hardest money’ known to humanity. It means that in the future your bitcoin is mathematically programmed to go up and not down, unlike the fiat money we use today.\n\nBitcoin is decentralised, meaning it’s operated by a global community of miners and nodes, instead of a central authority. Its rules are programmed into code and cannot easily be changed. Sounds amazing, right? So why are there only a select few who have taken the time to learn about this revolutionary ‘new’ blockchain technology?\n\nWho created Bitcoin?\n\nSatoshi Nakamoto created Bitcoin and the first widespread application of blockchain technology. This name is a pseudonym to disguise the person or team who developed Bitcoin. Satoshi was active in the development of Bitcoin up until December 2010, then they withdrew from the project and handed it over to developers who have continued to work on the mission. Many people have claimed to be Satoshi Nakamoto but, in truth, no one knows who he/she/they is/are.\n\nBitcoin’s development started in 2007 and its release coincided with the 2008 Financial Crisis. A few weeks after the bankruptcy of Lehman Brothers and the Merrill Lynch bailout, Satoshi published the Bitcoin White Paper and hid a message in the genesis block, which was mined on 3 January 2009. Satoshi wrote of the failure and injustice of central banking and our fiat system.\n\nHe also wrote : “We have proposed a system for electronic transactions without relying on trust.”\n\nThe birth of Bitcoin would eventually lead to us rethinking the existing global financial models and systems currently in place.\n\nMyth busting\n\nMyth 1 – Bitcoin has no Intrinsic Value\n\nAs mentioned above, there will only ever be 21 million Bitcoin and this scarcity is a major driver of its value. In addition to this supply cap, the amount of new Bitcoin being mined is declining over time. An event called a “halving” takes place every four years, and the result is block rewards paid to miners in the network are cut in half. This ensures the supply is always reducing which, by the basic economic principle of scarcity, has worked to keep the price of Bitcoin gradually trending upwards over the long term.\n\nBitcoin also provides value from the work the computers on the network contribute via a process called mining. Powerful computers all over the world supply a vast amount of processing power towards the work of validating and securing every transaction and in exchange, they are rewarded with new Bitcoin. This is called ‘proof-of-work’ and is essential to the security of the network. I’ll come on to this in more detail later.\n\nMyth 2 – Bitcoin will be replaced by a competitor\n\nThere are about 22,000 cryptocurrencies and some are direct copies of the original Bitcoin white paper; however, Bitcoin currently makes up approximately 60% of the total cryptocurrency market cap. The transparency and virtue of its task as a decentralised and open currency make it unrivalled to date. Cryptocurrencies are technologies trying to solve different problems and there are others with smart contract capabilities however, these are not all decentralised and do not all use proof-of-work (PoW), more on this later.\n\nMyth 3 – Not secure\n\nIt’s probably one of the only systems on earth that has not yet been hacked. Satoshi’s genius was to make it so it was easier to join the movement and mine Bitcoin than to try and hack it. It simply moves too fast for it to be hackable. It has been up (online) 99.9% of the time since 2009. The amount of computing power it takes to secure the network is large, however it is still relatively small in comparison to the current financial system. The miners that power the network are located around the globe in over 100 countries. The more miners and nodes the stronger the system becomes as there is no single point of failure. In a nutshell, this is the benefit of Proof of Work.\n\nMyth 4 – Bitcoin is a bubble\n\nBitcoin has gone through multiple price cycles throughout its 14-year history, each time the price has recovered to achieve new highs. As this is a new technology, boom and bust cycles are to be expected. As adoption increases, Bitcoin’s volatility will subside and it will settle into relative stability.\n\nMyth 5 – Bitcoin has no real life uses\n\nBitcoin can make payments to anyone in the world without a bank or payment processor, all for a fraction of the cost of traditional banking. The disruptive nature of this technology has the potential to make banks and companies such as Mastercard and Visa obsolete as these payment systems have not changed since the beginning of the 20th Century. In addition to this, nearly every human being on the planet has a mobile phone but not everyone has a bank account. This improves accessibility for all. I’d say this has real value.\n\nMyth 6 – It is a speculative asset\n\nIt could be considered speculative depending on your vantage point. As this new technology is adopted by institutions, I would argue we are coming out of the speculative phase. I would also argue that Bitcoin has held up better against more traditional equities and gold in the past 6 months.\n\nThis leads me to the most important myth:\n\nMyth 7 – Bitcoin is bad for the environment\n\nI am not disputing that mining Bitcoin is energy intensive but so are all aspects of the digital world and economy we now live in. The current banking system is nearly 10 x more energy-hungry if we look at the global system of processing transactions, running banks and powering offices. Moving away from traditional banking and into DeFi (Decentralised Finance) would be a benefit to the environment.\n\nExtract from Bitcoin Magazine.\n\nBitcoin’s Energy Use Compared To Other Major Industries\n\nThe amount of energy used by the Bitcoin network is inconsequential compared to other industries. Most industries round off the amount of global energy used by 1-2% and Bitcoin uses approximately 0.002% of the Global Energy in terawatt hours, which is less than a rounding error.\n\nData sources will vary and the Cambridge Bitcoin Electrical Consumption Index shows a slightly higher consumption rate with the caveat that the exact proportion is dependent on fuel type and power plant efficiency. Regardless of where you get the data, consumption in comparison to other industries is low.\n\nCambridge Bitcoin Electricity Consumption Index researchers concluded: “Bitcoin’s environmental footprint currently remains marginal at best.” The economic incentives fundamental to Bitcoin i.e. finding the cheapest source of energy to mine from, are helping to drive renewable innovation. They need cheap, renewable energy to make mining economically viable.\n\nThe FUD around this industry falls in line with history when any change is implemented which disrupts. What you often read in the news is centralised misinformation. It is found constantly in the writing on this subject and some journalists are often reporting false and misleading information.\n\nEmail was demonised initially and this new technology was considered too energy intensive and the post service was deemed more efficient. The same narrative to the internet, again it consumes too much energy. The energy argument is used ad-nauseum to demonise a switch from an analogue system to a digital system. These narratives just prove one thing; we are early.\n\nStudies have already concluded that running Bitcoin is more efficient than the current system. In fact, due to the FUD around Bitcoin mining, it has driven the industry to find ingenious ways to run mining equipment from stranded and renewable energy.\n\nBitcoin is even mined from the geothermal energy of volcanoes. According to the Bitcoin Mining Council, 59.5% of all energy used is green. They are working to make it 100% renewable. In addition, the Bitcoin Network could reduce global temperatures via the direct reduction of greenhouse gases. This can be made possible with the use and curtailment of methane from landfill and agriculture and much more.\n\nTroy Cross and Michael Saylor say it best…\n\nTroy Cross on Twitter: “Once they see how mining balances grids… Once they see how mining incentivizes renewables and nuclear… Once they see how mining replaces fossil-powered heating… Once they see how bitcoin substitutes for more carbon-intensive equities…” / Twitter\n\nMichael Saylor on the Bitcoin Environment Argument\n\nHow Bitcoin is helping the environment\n\nIf we can turn excess and stranded energy into a store of value then the renewables industry will become more cost-effective and economically viable. It would provide money to invest and regenerate, making the industry and its companies even more sustainable by providing investment for the future and consuming stranded energy.\n\nExcess natural gas and geothermal are also being utilised. Some renewable plants need to switch off production when there is a chance of overloading the grid. By switching this excess power over to Bitcoin mining it could help stabilise the grid. Bitcoin provides a solution for using this excess energy while creating value.\n\nBitcoin promotes energy independence and this benefit cannot be overstated. Eventually, mining could become a matter of National Security. Countries that produce cheap energy will be independent because they want to mine cheaply and sustainably. The countries that understand the technology, mathematics and engineering behind this will have a geopolitical advantage. A world with more localised energy production is a more robust world.\n\nMining Bitcoin can assist with our climate goals. There are many projects already up and running. Initiatives such as Gridless Compute work in Africa to mine bitcoin while stabilising grids to prevent brown-outs from excess renewable energy. Vespene Energy is using micro-turbines for harnessing waste methane from multiple landfill sites, preventing the methane from being released into the atmosphere. In Texas, Bitcoin miners have returned energy to the grid when additional electricity is required in extreme hot and cold temperatures. These are just a small number of examples.\n\nIf these enterprises were understood and embraced by politicians and businesses, we could be heading towards carbon-negative energy and the potential of decarbonising and stabilising grids using Bitcoin mining; making the grid greener. This is not a proof of concept; it’s happening.\n\nThis Margot Paez quote sums up the current situation beautifully:\n\n“Using Bitcoin as a tool for fighting for a habitable future is undoubtedly a kind of Hail Mary pass for the climate, but we are running out of time and mass demonstrations and a failing representative democracy are not doing enough.”\n\nOur rampant consumerism is the environment’s worst enemy. If we can create an economy that provides a good store of value available to all it could steer us away from the debt cycle and debasing currencies.\n\nIf you thought your Bitcoin would be worth more in the future you may think twice about what you are purchasing today. This is quite a meaty subject in itself which I’ll save for another day.\n\nEnvironmental, Social and Governance – ESG\n\nWikipedia describes ESG as ‘Environmental, social, and corporate governance is an approach to evaluating the extent to which a corporation works on behalf of social goals that go beyond the role of a corporation to maximise profits on behalf of the corporation’s shareholders.’\n\nIt sounds great and is exactly the information we need to make informed decisions. The ethos is good but the execution needs improvement. It’s difficult to audit and open to fraud. It’s another industry innovation, like carbon offsetting which often means very little when you dig into the detail.\n\nThat said, if managed correctly, the ideology has a lot of potential. For example, if a company were to reinvest its ESG credits into renewables, they could be used to incentivise further investment. The billions of dollars of ESG budgets that have been set aside could be redirected to support the mining industry and the work it does to support renewables. If you offset the infrastructure that supports mining, you’ll get a return. It’s the most ESG-friendly technology that has existed.\n\nProof-of-work vs proof-of-stake\n\nThe difference between the two methods is quite involved. To provide a summary, proof-of-stake (POS) uses randomly selected miners to validate transactions, resulting in those with the most wealth/stake enjoying the most control. Proof-of-work (PoW) uses a competitive validation method to confirm transactions and add new blocks to the blockchain. PoW, therefore, provides the best security and without this, Bitcoin would not be fully decentralised and the fundamentals would be compromised.\n\nIf you remove the PoW consensus accounting technology you remove the innovation. Bitcoin would essentially revert to the old legacy system where the people that control the books and records can control the network and change the code. The innovation is the consensus mechanism that does not rely on trust; an immutable accounting ledger with a self-auditing network.\n\nGreenpeace is championing a ‘change the code, not the climate’ campaign, partnered with a ‘rival’ protocol called Ripple. Ripple paid Greenpeace $5,000,000 to promote a ‘greener Bitcoin’. If Greenpeace understood Bitcoin and its potential they would be an advocate for the Bitcoin Mining Council instead. What is clear is that the corporate side of Greenpeace is driven by funding which often leads to questionable focus.\n\nIf moving to PoS was possible for Bitcoin, it would remove all the greenhouse-gas-reducing benefits that PoW unlocks. PoS is almost a replica of our current system which prevents a new way of reducing greenhouse gases.\n\nChris Bendiksen of Coinshare put it best when he said ‘’I’d put the chance of Bitcoin ever moving to proof-of-stake at exactly 0%. There is no appetite among Bitcoiners to destroy the security of the protocol by making such a move.”\n\nGreenpeace and Ripple understand their campaign will be fruitless, in the meantime, environmentalists will have to work harder to undo the damage caused.\n\nA more detailed explanation can be found here: Proof of Work vs. Proof of Stake: Beginner’s Guide\n\nConclusion\n\nThis is a monetary, environmental, and social revolution. We are at the beginning of the adoption curve and the potential and possibilities are vast.\n\nThe downside is that we are fighting against an old establishment. The potential of Bitcoin’s disruptive technology could upend the existing financial system. I truly believe that early adopters will reap the rewards and those fighting against the revolution will fall behind in the same way that countries late to adopting the gold standard did.\n\nIf we can think of Bitcoin as digital energy and work mining into our renewable energy innovation, we will be on to a winner. There is now a global system in place that can send value across borders in seconds and for pennies. The unbanked can now be a part of the system.\n\nTo understand Bitcoins’ value, you need to understand the technology, the philosophy and the potential. It’s a global collateral that can be sent to anyone on the planet, with a smart phone, for pennies and received in seconds. Now throw in its green credentials and you have a game changer.\n\nBitcoin the open global network is here to stay and more and more people hold and transact with its BTC token. It is being intimately threaded into our energy grids at the base level and the benefits it brings are finally being recognised. From overbuilding renewables to reducing bills for customers.\n\nNot many industries can take a potent greenhouse gas like methane and convert that into work that both secures a global network and drives down CO2. Bitcoin does this and more. A glimpse of the world weaned off throwaway consumerism and an open landscape where we can see precisely what our money costs us. It should not cost us the world and its ecosystem.\n\nIt’s hard to unlearn what we have always known. We are at a point in history where we can explore, embrace and become empowered by this new technology or become late adopters and fall behind those that had the foresight to investigate and learn. I know which side of history I’d rather be on."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvYnV5LXNoaWJhLWludS1zYXlzLWVhcmx5LWJpdGNvaW4taW52ZXN0b3ItZGF2aW5jaS1qZXJlbWll0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "'Buy Shiba Inu', Says Early Bitcoin Investor Davinci Jeremie - Watcher Guru",
        "content": "Davinci Jeremie is well-known in the cryptocurrency circles for urging investors to buy Bitcoin back in 2013. He published a video on YouTube on May 9, 2013, asking investors to buy a minimum of $1 worth of BTC. 10 years later, the early Bitcoin adopter is possibly hinting that investors should pay attention to Shiba Inu.\n\nJeremie predicted 10 years ago that buying Bitcoin would change people’s fortunes and deliver them life-changing gains. His prediction, of course, turned out to be true as BTC touched $69,000 in 2021.\n\nJeremie’s remark on Shiba Inu came as a response to a user who asked “Which Altcoin should I spend my USDT on?”. The early Bitcoin adopter swiftly replied, “Umm SHIB”.\n\nAlso Read: How Long Will Shiba Inu Take To Reach $0.01? Let’s Do the Math\n\nHowever, Jeremie’s response is short and vague with no further explanation on why he believes people should invest in SHIB.\n\nAlso Read: Exclusive: ‘Here’s What I’ll Do When Shiba Inu Reaches $0.01′\n\nWatcher Guru has reached out to Davinci Jeremie for a comment on why he believes investors should buy Shiba Inu. We are yet to receive a response at the time of publication and will update the story accordingly.\n\nMoreover, the SHIB community is thrilled with Jeremie’s response and is now vouching for it to be a power horse.\n\nYou can watch Jeremie’s video urging investors to buy a minimum of $1 worth of Bitcoin in 2013 below: “Look for the price of lotto ticket you can hold bitcoin for 10 years and become a millionaire,” he said.\n\nAlso Read: Shytoshi Is Right, People Will Not Celebrate When Shibarium Launches\n\nShiba Inu & Bitcoin\n\nSource: Wallpaperflare.com\n\nBitcoin and Shiba Inu are poles apart in terms of price but share similar popularity in the crypto sphere. Both have a larger-than-life following and investors believe the respective cryptocurrencies can generate massive wealth.\n\nHowever, whether Shiba Inu can move in price as Bitcoin did previously, is a question we’ll have to wait and watch for another 10 years to know the answer."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmF0bW1hcmtldHBsYWNlLmNvbS9hcnRpY2xlcy9iaXRzdG9wLXNoYWtlcy11cC1iaXRjb2luLWF0bS1zcGFjZS13aXRoLWdlbmVzaXMtY29pbi1hY3F1aXNpdGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 27 Jan 2023 08:00:00 GMT",
        "title": "Bitstop shakes up bitcoin ATM space with Genesis Coin acquisition - ATM Marketplace",
        "content": "The ATM industry is no stranger to high profile acquisitions and the bitcoin side of the industry has joined the trend. Bitstop, a bitcoin ATM provider, has acquired Genesis Coin, which powers more than 12,000 bitcoin ATMs in the U.S., and accounts for 31.9% of all such machines worldwide.\n\nThe ATM industry is no stranger to high profile acquisitions and the bitcoin side of the industry has joined the trend.\n\nOn Jan. 24, Bitstop, a bitcoin ATM provider, acquired Genesis Coin, which powers more than 12,000 bitcoin ATMs in the U.S., and accounts for 31.9% of all such machines worldwide, according to Coin ATM Radar.\n\nAndrew Barnard and Doug Carrillo, co-founders of Bitstop will take over as CEO and chief strategy officer respectively. Evan Rose, founder CEO of Genesis Coin, will transition as a technical advisor and current board member.\n\n\"Genesis Coin gave birth to the bitcoin ATM industry,\" Barnard said in a press release. \"It's the first and largest bitcoin ATM software platform in the world. Evan built a platform trusted by some of the largest bitcoin ATM operators in our industry, both domestically and internationally, including the Chivo network in partnership with the government of El Salvador.\"\n\nTo learn more about what the acquisition means for the industry, ATM Marketplace reached out to Andrew Barnard, co-founder and CEO of Bitstop, via an email interview.\n\nQ. Can you give a little background on the acquisition?\n\nA. Evan, Doug and I have known of each other since the beginning of the industry. We have been building this industry separately and now we are building it together. We explored a potential partnership in the past, but it was a little too early. We recently got together again to talk about the future at a high-level. The timing was right. The vision alignment felt good. The energy was all there. It felt natural. It came together effortlessly.\n\nQ. What does the geographic reach of the two companies look like?\n\nA.Bitstop and Genesis Coin both have robust coverage in the United States. Genesis Coin has more international presence especially in Latin America with Athena and the Chivo partnership with the government of El Salvador. Bitstop is beginning to establish international operations with strategic partners. We have operators in Europe, Australia and Asia. We plan to focus a lot more on international growth with the added resources we have and some of the partners we are talking to.\n\nQ. How will this improve bitcoin ATM services?\n\nA.Both companies will continue to build out a team. Genesis Coin is beginning to make key hires and grow its team. We believe in efficiency and running lean, but it's also important to make sure there is redundancy, continuity and legacy. You need a team to give operators a strong stable foundation if you want them to build bigger and scale without fear. That's the goal.\n\nIn the short-term we will continue to optimize and enhance current service. Over the long-term, we will evaluate technical synergies and make important strategic decisions about long-term infrastructure investments that support our plans for future growth.\n\nQ. What excites you the most about this acquisition?\n\nA. The opportunity is massive for Genesis Coin and Bitstop. We're the only major United States-based private and white-label platforms remaining that continue to remain independent and neutral. We do not operate machines. We have no operator ownership. We avoid conflicts of interest. We hyper-focus on building the best and most reliable software and supporting our operators' needs so they can deliver maximum value to their customers. We're working with the best operators worldwide both privately owned and publicly traded. Any organic M&A activity happening in this space almost exclusively happens on the Genesis Coin and Bitstop platforms for a reason. We have created a standard for the industry. The future is bright.\n\nQ. Can you share anything about your future plans with Genesis Coin?\n\nA. We can't say too much and we have some more exciting news coming. For now we can say we are evaluating technical synergies between both platforms. We want to help our operators become as hyper efficient as possible while making it easy to scale. There's still many pain points when it comes to operating which lead to excessive overhead. When you look at the traditional ATM space, many operators are still running up to five times the body count compared to a traditional ATM operation. We want to lower that inefficiency difference for Genesis Coin operators by at least 50% within the next two years. We have many ideas on how to accomplish this and believe that this will be a winning formula long-term."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LnRoZWFzc2V0LmNvbS9hcnRpY2xlLzQ4NTA2L2JpdGNvaW4tZm9yZWNhc3QtdG8tcGVhay1hdC11cy0yOS0wOTUtaW4tMjAyM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 26 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin forecast to peak at US$29095 in 2023 - The Asset",
        "content": "Bitcoin (BTC), the bellwether of the cryptocurrency market, will peak at US$29,095 in 2023 before dropping to US$26,844 by the end of the year, a new report forecasts.\n\nBut the price of BTC, currently around US$23,000, will jump to US$77,492 in 2025 and US$188,451 in 2030, according to a panel of 56 crypto and fintech specialists gathered by Finder.com, a comparison website for products and services.\n\nSeasonal Tokens creator and founder Ruadhan O thinks bitcoin’s price is still suppressed by worries about the financial health of centralized businesses in the industry.\n\n“The price is low because possible imminent catastrophes are being priced in,” he says. “By the end of the year, market sentiment will have changed, and after the fear goes away, the market will rediscover the scarcity of bitcoin.”\n\nAs it is, 65% of panellists, including FxPro senior market analyst Alexander Kuptsikevich, believe that BTC is underpriced. Only 20% say it’s priced fairly, while the remaining 16% say it’s overpriced.\n\n“The phase of the most active cryptocurrency sell-off is over. 2023 will be a year of careful price recovery. However, a real FOMO (fear of missing out) market is unlikely to come until 2024-2025,” Kuptsikevich says.\n\nBitcoin needs two things to rebound: the return of bullishness on Wall Street and the Federal Reserve’s exit from its rate-tightening policy, asserts Finance Magnates senior analyst and editor Damian Chmiel.\n\n“The former will not happen without the latter, and we are left to wait patiently for now. In the long term, however, I believe bitcoin will become a popular choice among traders,” Chmiel says.\n\nUniversity of Canberra senior lecturer John Hawkins is more bearish, predicting that BTC will close the year at US$10,000, before dropping to US$5,000 in 2025 and US$500 in 2030.\n\nHawkins believes that bitcoin has no useful role as an asset after it’s been “spruiked as a payments instrument, safe haven, inflation hedge and diversification asset”.\n\n“In the short term, more of the crypto companies that are shedding staff and restricting withdrawals, and no longer have FTX to bail them out, will fail, putting downward pressure on the bitcoin price,” he adds.\n\nWhile BTC is currently rallying above US$20,000, the panel expects it to drop to US$13,067 at some point in 2023 – the lowest it’s been since October 2020.\n\nFollowing the recent market crash and FTX collapse, a fifth (21%) of Finder’s panel believe institutional investors will leave the crypto market for other asset classes this year. However, the majority (75%) think otherwise, while the remaining 4% are unsure.\n\nAskTraders senior cryptocurrency and forex analyst Nick Ranga is one of those who believe that institutional investors will leave crypto this year. Commenting on BTC specifically, he says: “With inflation still uncomfortably high and recession risk looming, overall market sentiment remains risk-off. US interest rates are expected to peak at around 5% in the first half of 2023 so we could see investors return to riskier assets later in the year. In the short term, there could still be more downside.”\n\nRouge International managing director Desmond Marshall is part of the majority who think institutional investors are here to stay: “Unless there are more sudden surprises like FTX, the market is now undergoing a clean-up of scammy and faulty exchanges and companies. After this clean-up and with the Fed interest continuing to hike, and with the BTC upcoming halving in 2024, there should be stronger support during H2 of 2023.”\n\nOverall 50% of Finder’s panel say now is the time to buy BTC, 37% hold, and 13% sell."
    }
]