[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzI5L2JpdGNvaW4tYnV5ZXItcXVpZXRseS1hY2N1bXVsYXRlcy00MjRtLW9mLWJ0Yy1pbi10aHJlZS13ZWVrcy_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8yOS9iaXRjb2luLWJ1eWVyLXF1aWV0bHktYWNjdW11bGF0ZXMtNDI0bS1vZi1idGMtaW4tdGhyZWUtd2Vla3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Buyer Quietly Accumulates $424M of BTC in 3 Weeks - CoinDesk",
        "content": "There's been some online speculation that the wallet could be tied to one of a number of U.S. asset management giants hoping to soon be granted regulatory permission to launch a spot bitcoin ETF, though it's not clear if such \"frontrunning\" is even allowed."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5ldXJvbmV3cy5jb20vbmV4dC8yMDIzLzExLzI5L2p1c3Qtb25lLWJpdGNvaW4tdHJhbnNhY3Rpb24tY29uc3VtZXMtdGhlLXNhbWUtYW1vdW50LW9mLXdhdGVyLXVzZWQtdG8tZmlsbC1hLXN3aW1taW5nLXBvb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "A Bitcoin transaction uses the same amount of water as a swimming pool - Euronews",
        "content": "Bitcoin could make a change to make the cryptocurrency more environmentally friendly.\n\nADVERTISEMENT\n\nA single Bitcoin transaction could use the same amount of water needed to fill a garden swimming pool, according to a new study on the world’s most popular cryptocurrency.\n\nIt estimates that in 2021 Bitcoin mining, used in part to create new Bitcoins, consumed over 1,600 gigalitres of water worldwide with each Bitcoin transaction using 16,000 litres of water on average.\n\nThe sheer scale of Bitcoin mining’s water consumption could impact drinking water if it continues to operate without regulation, especially in countries that are already battling water scarcity, including the United States, the study published in the journal Cell Reports Sustainability on Wednesday argued.\n\nMining Bitcoin requires huge computing power to solve mathematical equations on the Internet. Correct answers are then rewarded with a share of Bitcoin’s value.\n\nWater, which is evaporated, is used to cool the computers at large data centres and also to lower the temperature of coal-and-gas-fired power plants that also power Bitcoin mining computers.\n\n“It's just one backyard swimming pool going, going up in the air, literally evaporating on average per Bitcoin transaction,” said Alex de Vries, the study’s author and Ph.D. student at Vrije Universiteit Amsterdam.\n\nThe environmental impact of mining Bitcoin has been widely documented, with the latest data from the United Nations University, showing that the crypto’s energy consumption for the year 2020 was more than the total energy consumption of a country like Pakistan for the same period.\n\nHowever, how much water a Bitcoin transaction uses has been scarcely reported and is likely to increase.\n\nWith the rise in Bitcoin’s price to over $38,000 (€34,600), up almost five per cent in a week, de Vries said he expected Bitcoin’s water consumption to also increase to 2,300 gigalitres, up more than 40 per cent compared to 2021.\n\nThe report argues this will be a problem for countries in Central Asia, such as Bitcoin mining hub Kazakhstan, where the dry climate is putting pressure on freshwater supplies.\n\nThe US also uses a lot of water for Bitcoin mining, which is responsible for consuming as much water as 300,000 US households or a city like Washington, DC, the study estimated.\n\nThe real solution and the losing game\n\nDe Vries argues that using renewable energy instead of electricity would not be a solution to reducing Bitcoin’s carbon footprint.\n\n“Do you really want to spend wind and solar power for crypto? In many countries, including the US, the amount of renewable energy is limited. Surely you can move some of these renewable energy sources to crypto, but that means something else will be powered with fossil fuels,” he said.\n\nBy the year 2040, the last Bitcoin will be mined and then there's not going to be any money going to these miners. Alex de Vries Author of the study\n\nBut he argues if Bitcoin changed its technology to be more environmentally friendly, the crypto’s environmental damage would reverse overnight.\n\nBitcoin uses the Proof of Work model, which works like a competitive numeric guessing game and the first person to solve the puzzle is awarded a fixed amount of cryptocurrency.\n\nIt requires a global network of computers to run at the same time when a transaction takes place and therefore a lot of energy.\n\nBut in the Proof of Stake system, you do not need the energy-consuming hardware as you acquire coins, which are put up as collateral in the staking process and there is then a random selection through the software.\n\nHow powerful your machine is does not increase your chance of winning and being able to create the next block for the blockchain. The only thing that increases your chance of winning is just getting more coins.\n\nADVERTISEMENT\n\nThe second-largest crypto Ethereum made the change to Proof of Stake in 2022 and remains just as popular today.\n\nBitcoin could make the same change but de Vries argues Bitcoin miners are more traditional and do not want to rock the boat to keep their investment.\n\n“Not changing stuff is what gives Bitcoin value, even though actually not changing stuff is probably the riskiest thing they can do,” he said.\n\n“The amount of coins being mined just keeps decreasing. And by the year 2040, the last Bitcoin will be mined and then there's not going to be any money going to these miners.\n\n“So in the long run, they're kind of playing this losing game”."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3N1c3RhaW5hYmlsaXR5L2ZlYXR1cmUvVGhlLWVudmlyb25tZW50YWwtaW1wYWN0LW9mLWJpdGNvaW4tbWluaW5nLWV4cGxhaW5lZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "The environmental impact of bitcoin mining explained - TechTarget",
        "content": "For those who chase innovation or who are looking for a new way to make money, cryptocurrencies such as bitcoin may seem like an exciting but innocuous new tech. For those assessing the environmental impact of cryptocurrencies, however, the technologies are far from benign.\n\nIndeed, mining for bitcoin and other cryptocurrencies is antithetical to climate progress. This is due to the technologies' massive energy needs and resulting pollution. Understanding these issues and why activists and legislators are pushing for change is important for anyone concerned with ensuring a livable planet.\n\nThe number of bitcoin owners is just 3.4% of the worldwide population, or 267 million people as of June 2023, according to Crypto.com, a cryptocurrency exchange company based in Singapore.\n\nYet the currency has an outsized impact on the environment.\n\nHow does bitcoin mining and cryptomining work? To understand the environmental impact of cryptocurrency mining, particularly bitcoin mining, requires first understanding what cryptocurrency is and how the mining process works. A cryptocurrency -- such as bitcoin -- is a type of decentralized digital currency that can support international transactions, micropayments and peer-to-peer transactions. Some businesses and individuals accept cryptocurrency as a form of payment for goods and services, among other benefits and challenges. The underlying technology relies on blockchain, which is a digital record-keeping system simultaneously available in multiple locations, called nodes, within the network. Cryptocurrencies, like Bitcoin, don't rely on a central authority to oversee or regulate transactions. Instead, they use complex encryption techniques called cryptomining to secure and verify transactions and control the creation of new units. The environmental impact of cryptocurrency mining -- and Bitcoin mining, in particular -- is largely due to the main cryptomining approach in use called proof of work (PoW). The process requires a massive amount of computing power, as miners use complex algorithms and energy-intensive hardware and software to confirm transactions. To solve bitcoin's PoW system, miners compete to solve an encrypted puzzle within each block. The miners use specialized software to solve for the mathematical puzzle via trial and error, guessing until they get it right. Bitcoin miners are awarded a certain number of bitcoin for solving these puzzles, essentially being paid to do the validation work that enables the whole system. The PoW structure rewards miners who have the most powerful computers, since they can make more attempts in a shorter amount of time, making them more likely to solve the puzzle and earn bitcoin as a reward. A less-frequently used cryptomining approach is also in use. Proof of stake (PoS) requires significantly less energy and computing power than the PoW approach, largely in its limitation of participants. PoS means that the miner must provide a minimum deposit, or stake, to confirm the transaction.\n\nHow does bitcoin mining and cryptomining affect the environment? The cryptomining process has drawn criticism from sustainability advocates as well as some government officials and business leaders who fault the technology for its intense energy requirements, greenhouse gas emissions and significant hardware needs. Cryptocurrencies also generate emissions and have other environmental impacts along their production supply chain and during disposal, generating e-waste at their end of life. \"Proof of work is a huge competition across computers, and that race to find a solution takes a lot of power,\" said Marc Lijour, a member of the IEEE and CEO at Creative Emergy. \"It's very inefficient.\" The Cambridge Bitcoin Electricity Consumption Index (CBECI) compares bitcoin's energy needs to other activities, showing bitcoin requires nearly as much energy as powering all the lights and TVs in the U.S. Bitcoin mining has a presence in 58 countries, with most miners operating in the U.S. At 37.84%, the U.S. has the most energy-intensive bitcoin mining activity in the world, according to data from the CBECI. But the tech's environmental impact goes far beyond U.S. borders. Bitcoin's global electricity consumption of 173.42 TWh from 2020 to 2021 exceeds that of some countries, according to a study published by the journal Earth's Future. For example, that amount of power exceeds the combined electricity consumption of Argentina and the Philippines. That intense energy translates to massive levels of greenhouse gases. Bitcoin mining processes produced 85.89 MTCO2E, or metric tons of carbon dioxide equivalent, from 2020 to 2021, according to the study. This figure is comparable to 9,665 gallons of gasoline consumed by passenger vehicles, or 96,210 pounds of coal burned in one year, according to the U.S. Environmental Protection Agency's Greenhouse Gas Equivalencies Calculator. The environmental impact of bitcoin mining has environmental activists, governments and business leaders voicing concerns and questioning how to rein in its effects. Although there are over 10,000 cryptocurrencies in circulation, bitcoin is the most well-known. Ninety-five percent of cryptocurrency owners and people curious about ownership have heard of bitcoin, according to a 2021 report from cryptocurrency exchange company Gemini.\n\nBitcoin is the worst environmental offender The White House points to the fact that Bitcoin requires more energy than all other cryptocurrencies combined, according to the September 2022 report, \"Climate and Energy Implications of Crypto-Assets in the United States,\" published by the White House Office of Science and Technology Policy. Bitcoin accounted for 60% to 77% of total global crypto-asset electricity use as of 2022, according to the report. The second highest user, the Ethereum network, accounted for 20% to 39%. Bitcoin's energy consumption is reliant on primarily non-renewable sources. Researchers estimated that 62% of the electricity used for bitcoin mining globally in 2022 came from fossil fuels, with coal-generated power being the largest single source, according to data from the CBECI. The numbers for renewable energy resources remain low for bitcoin's energy demands. It's estimated that 26% of the electricity powering bitcoin mining came from renewables, while the remaining 12% came from nuclear energy, according to data from the CBECI. As a result, bitcoin's electricity requirements produce a significant amount of greenhouse gas emissions. Bitcoin's estimated greenhouse gas emissions were about 68.02 MTCO2E in 2022, according to data from Climate Watch, a digital platform managed by the World Resources Institute, a nonprofit organization based in Washington, D.C. In comparison, Singapore's greenhouse gas emissions were estimated to be about 67.3 MTCO2E in 2022, according to Climate Watch. The greenhouse gas emissions of Belarus were estimated at 65.3 MTCO2E in 2022. Although bitcoin's energy requirements and its corresponding greenhouse gas emission numbers draw the most scrutiny, experts said bitcoin impacts the environment in other ways. \"There are issues of concern beyond energy consumption,\" said David Boswell, senior director of community architecture at the Linux Foundation, a nonprofit organization headquartered in San Francisco. To start, bitcoin mining produces significant amounts of heat from the participating nodes. The production and disposal of hardware specifically for bitcoin mining is also a critical issue. \"Bitcoin miners cycle through a growing amount of short-lived hardware that could exacerbate the growth in global electronic waste,\" said Alex de Vries, founder of Digiconomist, and Christian Stoll, research affiliate at the Center for Energy Markets of the Technical University of Munich, in their September 2021 article \"Bitcoin's growing e-waste problem\" published by academic journal Resources, Conservation and Recycling. \"E-waste represents a growing threat to our environment, from toxic chemicals and heavy metals leaching into soils, to air and water pollutions caused by improper recycling.\" Bitcoin's e-waste adds up to 30.7 metric kilotons annually, which is comparable to the amount of IT and telecommunication equipment waste produced by the Netherlands, according to de Vries and Stoll. The amount of e-waste generated by bitcoin mining alone could surpass current global estimates. Bitcoin's annual amount of e-waste \"may grow beyond 64.4 metric kilotons\" while global e-waste is expected to grow by 70% from 2016 to 2050, according to de Vries and Stoll.\n\nIs sustainable cryptomining realistic? Some researchers have put the environmental impact of bitcoin mining on par with two other major industries with outsized negative climate impacts -- beef and crude oil. That's according to the September 2022 report, \"Economic estimation of Bitcoin mining's climate damages demonstrates closer resemblance to digital crude than digital gold,\" published by Scientific Reports. The report calculated that for each dollar in bitcoin value produced, the process resulted in 35 cents in global climate damages. Industry watchers are taking notice. Pressure is building to address the environmental concerns raised around bitcoin, blockchain and other Web3 technologies, said Joe Davey, partner at West Monroe, a digital services firm headquartered in Chicago. The concern is not coming only from environmentalists but from businesses, too, as many have set sustainability targets and net-zero goals and are questioning whether bitcoin's environmental track record can fit with their corporate objectives. \"The energy consumption issue comes up as a question,\" Davey said. Such concerns are prompting some changes in the Web3 space. According to some experts, the most notable change comes from the Ethereum blockchain network, which shifted from a PoW system to the more energy efficient PoS mechanism in September 2022. The shift -- known as the Merge -- cut energy requirements by more than 99%. Experts continue to debate whether bitcoin could transition toward more energy-efficient methods. \"For bitcoin to change, you'd need a consensus among a large group,\" Davey said. \"And you'd have forks in bitcoin and that's probably what it's going to take -- a fork [of miners] moving to proof of stake.\" For bitcoin users, such a move would present several challenges. \"There's so much sunk costs, with the equipment around the mining rigs, just because bitcoin is the oldest network out there,\" Boswell said. Still, experts said some efforts to make bitcoin more sustainable could happen, such as getting a higher percentage of its electricity from renewable sources and recycling its heat -- both of which are happening in some places."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vd3d3LndpcmVkLmNvbS9zdG9yeS9iaXRjb2luLWV0Zi1jcnlwdG8taW52ZXN0bWVudHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Fresh Bitcoin Hype Shows Crypto Just Can't Help Itself - WIRED",
        "content": "The prospect that US residents may soon be able to invest in bitcoin through their brokerage, as if it were a regular stock, has prompted a fresh round of hype in crypto circles—and a surge in crypto prices.\n\nSeveral investment firms, including heavy-hitters like BlackRock and Fidelity, are queuing up to launch a spot bitcoin exchange-traded fund (ETF) in the US. These funds would track the price of bitcoin, making them the closest thing to investing in the crypto token directly without dealing with a crypto exchange or storing crypto manually, a process fraught with risk.\n\nAfter a bruising 18 months in which crypto prices buckled, high-profile businesses collapsed, and two crypto figureheads were convicted of crimes in the US, the crypto industry is supposed to be cleaning up its act. That the US Securities and Exchange Commission (SEC) appears to be entertaining a spot bitcoin ETF after years of resistance is seen by some as a signal that crypto is moving beyond its free-wheeling years.\n\nThe arrival of such a fund in the US—by far the world’s largest ETF market—“is a significant milestone,” says Samson Mow, a prominent bitcoin evangelist and CEO of bitcoin-centric technology firm JAN3, as it will allow investors to hold bitcoin through a conventional financial product for the first time.\n\nWhile there is broad consensus around the likelihood of an ETF approval among analysts, the idea that it would be symbolic of the industry’s coming of age is contradicted by the frenzy of speculation around what will happen to the price of bitcoin.\n\nOn X, crypto influencers with hundreds of thousands of followers are predicting an ETF will send the price of bitcoin soaring, in posts peppered with the rocket ship emoji. The arrival of a spot bitcoin ETF, claims Mow, will unlock a wave of pent-up demand and lead a “torrent of capital” to “pour into bitcoin.” Institutions and other investors that either cannot or choose not to invest in unregulated financial products will seize the opportunity to invest, he says, driving the price far beyond its previous heights."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGVybXMvZy9nZW5lc2lzLWJsb2NrLmFzcNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Genesis Block: Bitcoin Definition, Mysteries, and Secret Message - Investopedia",
        "content": "What Is a Genesis Block?\n\nA Genesis Block is the first block in a cryptocurrency blockchain. A blockchain consists of a series of blocks that are used to store information related to transactions that occur on a blockchain network. Each block contains a unique header, and each such block is individually identified by its block header hash.\n\nThese blocks are chained together by their encrypted headers, with the Genesis Block being the foundation—and they grow in number. A block's number is referred to as its height on the blockchain. So, the Genesis Block has a height of zero, the following block has a height of one, and so on. The chained information in each block is one of the things that makes a blockchain so secure.\n\nBitcoin's Genesis Block was the first instance of a proof-of-work blockchain system and is the template for all other blocks in its blockchain. In 2009, Bitcoin's anonymous developer, Satoshi Nakamoto, created the Genesis Block, which launched the cryptocurrency and blockchain boom.\n\nKey Takeaways A Genesis Block is the first block on a cryptocurrency blockchain.\n\nIn 2009, a developer named Satoshi Nakamoto created the Genesis Block on the Bitcoin blockchain.\n\nThe information from the Genesis Block is present in all blocks in a blockchain because of how information is encrypted and used in the following blocks.\n\nUnderstanding the Genesis Block\n\nBlocks are effectively digital containers where data pertaining to the transactions on a network are permanently recorded. A block records as many of the most recent Bitcoin transactions it can hold that have not yet entered any prior blocks. Thus, a block is like a ledger or a record book page. Each time a block is \"completed,\" it gives way to the next block in the blockchain. A closed block is thus a permanent store of records that, once confirmed, cannot be altered or removed.\n\nThe Genesis Block, also known as Block 0, is the very first block upon which additional blocks in a blockchain are added. It is effectively the ancestor that every other block can trace its lineage back to since every block references the one preceding it. This began the process of validating bitcoin transactions and introducing new bitcoins into existence.\n\nThe next block, Block 1, wasn't mined until five days after the Genesis Block. This is considered odd as the average timestamp gap between blocks is intended to be 10 minutes.\n\nThere are a few theories regarding the delay of five days between the first two blocks: Some have theorized that Nakamoto spent five days mining the original block to test out the Bitcoin system to make sure it was stable (then backdated the timestamp), while more cultish followers believe Satoshi intended to recreate the story of God's rest after creating the world in six days—even though the recorded difference is only five days.\n\nBitcoin Basics\n\nBitcoin is a type of cryptocurrency developed by Satoshi Nakamoto. Bitcoin (with a capital b) refers to the blockchain and network, and \"bitcoin\"—with a small \"b\"—refers to the virtual coinage that is used. There are no actual coins, hence the \"bit\"—or binary digit, the most basic unit of data in computing—before \"coin.\"\n\nIn the world of virtual currency, blocks are files where data about the Bitcoin network and its transactions are permanently recorded. Each time a block is completed—that is, when a miner guesses the solution—the block is closed, giving way to the next block in the blockchain. The only way to release new cryptocurrency into circulation is to mine it (receive it as a reward for doing work for the blockchain). So, to \"mine bitcoin\" is to \"mint currency.\"\n\nLike gold, Bitcoin cannot be created arbitrarily. Gold must be mined out of the ground, and bitcoin (BTC) must be mined via digital means.\n\nMoreover, Bitcoin's founder stipulated that, like gold, the supply of bitcoin should be limited and finite. Only 21 million BTC can be mined in total. When miners have unlocked this many bitcoin, the supply will be tapped out unless someone changes Bitcoin's protocol to allow for a larger supply.\n\nMysteries of the Genesis Block\n\nBeginning with the fact that the name \"Satoshi Nakamoto\" itself is a pseudonym, the Genesis Block and the founding of Bitcoin remain riddled with mystery. Shortly after Bitcoin's launch, the person calling themselves \"Satoshi Nakamoto\" vanished from the face of the earth, leaving barely a trace.\n\nThe First 50 BTC Could Not be Spent\n\nThe Genesis Block's beginnings were shrouded in the debate about a fine point of its creation: Was the code that rendered the Genesis Block effectively untradeable an intention or a mistake on the part of Nakamoto?\n\nAlthough the Genesis Block points to a web address—written into the Genesis Block's code—that link displayed an error message when activated. The system could not find the first transaction of 50 BTC in its database, and the spending transaction was rejected. So, the Genesis Block's transaction is not considered a \"real transaction\" by the original Bitcoin client.\n\nBut why? Did Nakamoto mean for the first bitcoin to be non-tradeable? Or was it a mistake? This became the subject of much debate among Bitcoin fans and insiders. Because of the precision of this developer, however, most believe it was hardly an error. Nakamoto likely wrote the code for the Genesis Block exactly the way he wanted it. We will never know why, as the quirk was not discovered until after Nakamoto disappeared.\n\nCurrent versions of the Bitcoin system handle the block/transaction databases differently from the original system, so the Genesis Block's transaction is now just a weird special case in the code.\n\nBitcoin's Genesis Block Message\n\nAnother puzzling aspect of the Genesis Block is the message that Nakamoto instilled within the Block's raw data: \"The Times 03/Jan/2009 Chancellor on brink of second bailout for banks.\"\n\nAlthough Nakamoto never commented on the meaning of this text, most believe that it serves as a mission statement for Bitcoin itself.\n\nThe text is a headline for an article in the Jan. 3, 2009 edition of The [London] Times about the British government's failure to stimulate the economy following the 2007–08 financial crisis. Nakamoto spoke out against the idea of financial institutions that were too big to fail and wanted Bitcoin to be different. Most people think that Nakamoto's reference to the article in the Genesis Block's code was a hint as to how Bitcoin is different from the big investment banks that needed government bailouts in 2008.\n\nThe True Legacy of the Genesis Block\n\nBitcoin cannot be bailed out because its process eliminates the intermediary; no third party or corporate entity exists between BTC and the consumer.\n\nThe Bitcoin network checks and double-checks itself continuously using encryption, validation, and automated general consensus. Another failsafe is that because all transactions cannot be altered, the actions of miners can always be traced back to their wallet addresses, which makes it impossible to hide any evidence of wrongdoing. However, unless the owner of the wallet address makes their identity known, there is no way to know who it is.\n\nIn November 2013, early protegees of Nakamoto formed the Satoshi Nakamoto Institute (SNI) to educate the public about the history and vision of Bitcoin's creation. Among other interesting details, the SNI houses one of the biggest remnants of Nakamoto's online existence: An extensive list of forum posts, broken into subject categories, that the Bitcoin creator penned while still working on the project.\n\nSome Bitcoin fans hold the Genesis Block in a kind of cult-like reverence, as they do its anonymous creator. Fans are drawn to Bitcoin's arcane construct and idiosyncratic vocabulary with the fervor of one obsessed with a sophisticated arcade game.\n\nBitcoin devotees have been donating small amounts of BTC to the Genesis Block as a tribute to Satoshi Nakamoto. This is seen as a kind of sacrifice because once a coin is moved into the Genesis Block, it can never be used again—sort of like throwing a quarter into a bottomless fountain.\n\nIs Genesis Block 0 or 1? The first block on the Bitcoin blockchain is the Genesis Block, which has a block height of zero.\n\nWhy Is the Genesis Block Important? The Genesis Block is actually not that important unless you view it as a historical occasion. It is simply the first block that contains the first transaction, but it has been hyped as something special by fans.\n\nWhen Was the First Bitcoin Block? The first Bitcoin block is believed to have been mined on Jan. 3, 2009, as it contains a message with that date, and the blockchain recorded it as such.\n\nThe Bottom Line\n\nThe Genesis Block is the first block on the Bitcoin blockchain, but it is also a term that can be used to refer to the first block on any blockchain. It is special to cryptocurrency fans because it signifies an attempt to transition away from the current financial system, which is full of third parties chipping away at people's finances and causing widespread problems through corrupt practices.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n\n\n"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm5ld3NjaWVudGlzdC5jb20vYXJ0aWNsZS8yNDA0MjE5LWEtc2luZ2xlLWJpdGNvaW4tdHJhbnNhY3Rpb24tdXNlcy1lbm91Z2gtd2F0ZXItdG8tZmlsbC1hLXN3aW1taW5nLXBvb2wv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "A single bitcoin transaction uses enough water to fill a swimming pool - New Scientist",
        "content": "The environmental impact of bitcoin and other cryptocurrencies is increasingly being scrutinised, due to the vast amounts of electricity they consume. Now it seems that water use is also a big problem\n\nThe water consumed by a single bitcoin transaction could fill a small swimming pool Radharc Images / Alamy\n\nBuying or selling bitcoin uses 16,000 litres of clean water for every single transaction, which could exacerbate existing droughts around the world. While the energy consumption and carbon emissions produced by bitcoin and other cryptocurrencies have been well studied, this is the first assessment of its water use and wider environmental impact.\n\nAlex de Vries at the VU Amsterdam School of Business and Economics in the Netherlands has calculated that mining – the computational process that secures the bitcoin network – uses between 8.6 and 35.1 billion litres of water per year in the US alone. He says that bitcoin used 1.6 trillion litres of water globally in 2021, and expects this to rise to 2.3 trillion litres this year. Broken down per transaction, that means a single bitcoin trade consumes 16,000 litres of water – enough to fill a small swimming pool. This is “increasingly hard to defend”, says de Vries.\n\nAdvertisement\n\nThe majority of the water consumption comes from electricity production, such as in coal and gas plants, or throughput in hydroelectric power stations, says de Vries. He used data on the electricity mix at locations where bitcoin mining occurs to calculate the totals, but also factored in that water is also used directly in data centres to cool the powerful hardware used by miners.\n\nWhile bitcoin’s water consumption is a huge environmental problem, it pales in comparison with its energy demands, says de Vries. “The mining devices are effectively just generating random numbers all day long, and they just throw them all away and nothing – nothing – useful comes out,” he says.\n\nAnd while competing cryptocurrency Ethereum has introduced changes which slashed its energy use by 99.99 per cent, which would also reduce water consumption, bitcoin has been reluctant to follow suit – which is partly due to a lack of centralised control to push such decisions through.\n\nSign up to our The Daily newsletter The latest science news delivered to your inbox, every day. Sign up to newsletter\n\n“The software solution is available. It’s just that you are dealing with a community that is fundamentally against any type of changes to their software,” says de Vries. “If you make the change you cut the majority of everything: the carbon emissions, water footprint, electronic waste, it all goes out the window overnight. Literally, the moment you make the software change, it’s all gone. Bitcoin is responsible for half a per cent of global electricity consumption, [and] we could cut this by tomorrow.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTEvMzAvc2VjLW1lZXRzLXdpdGgtZ3JheXNjYWxlLWJsYWNrcm9jay1hYm91dC1wb3RlbnRpYWwtYml0Y29pbi1ldGZzLmh0bWzSAWhodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8xMS8zMC9zZWMtbWVldHMtd2l0aC1ncmF5c2NhbGUtYmxhY2tyb2NrLWFib3V0LXBvdGVudGlhbC1iaXRjb2luLWV0ZnMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "SEC meets with Grayscale, BlackRock about potential bitcoin ETFs - CNBC",
        "content": "The U.S. Securities and Exchange Commission is formally engaging with asset managers ahead of a much anticipated decision on whether the regulator will approve a bitcoin exchange-traded fund, according to memos published this week.\n\nThe regulator said in a memo that it met with Grayscale on Thursday about the potential conversion of the Grayscale Bitcoin Trust into an ETF. The SEC had previously blocked this move, but Grayscale challenged that decision in court and won.\n\nSEC officials also met with representatives from BlackRock and the Nasdaq on Wednesday, according to a separate memo. BlackRock filed for a bitcoin ETF in June, followed shortly by a handful of other asset management firms.\n\nWhile the SEC could still decide to block crypto ETFs, many industry experts expect that such funds will launch in the U.S. early next year. The regulator has delayed decisions on several bitcoin funds in recent months and may choose to approve or deny all applications at around the same time.\n\nSEC Chair Gary Gensler has been a vocal critic of crypto but has said in recent public appearances that he would listen to his staff's input on a potential bitcoin ETF.\n\nGrayscale also recently hired John Hoffman, a longtime Invesco ETF executive, as a managing director. Hoffman will serve as the head of distribution and strategic partnerships for Grayscale, a sign that the crypto asset manager is gearing up to launch the fund if approved.\n\nThe growing confidence in the market that a bitcoin ETF will eventually be approved appears to have boosted the price of bitcoin. The cryptocurrency was trading above $37,000 on Thursday after falling to about $26,000 late this summer.\n\nDon't miss these stories from CNBC PRO:"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDIzLzExLzI5LzIzOTc5ODU4L2JpdGNvaW4tbWluZS1jcnlwdG9jdXJyZW5jeS13YXRlci11c2UtYW5hbHlzaXMtZW5lcmd50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "It's not just electricity — Bitcoin mines burn through a lot of water, too - The Verge",
        "content": "Bitcoin mines aren’t just energy-hungry, it turns out they’re thirsty, too. The water consumption tied to a single Bitcoin transaction, on average, could be enough to fill a small backyard pool, according to a new analysis. Bitcoin mines are essentially big data centers, which have become notorious for how much electricity and water they use.\n\nBitcoin’s water footprint is growing, according to the analysis published today in a commentary in the journal Cell Reports Sustainability. That’s an issue to watch as the price of Bitcoin recovers from a spiraling crypto winter.\n\nBitcoin mines are essentially big data centers, which have become notorious for how much electricity and water they use.\n\nThe study was conducted by Alex de Vries, a PhD candidate at Vrije Universiteit Amsterdam whose previous research has tracked cryptocurrencies’ electricity consumption and greenhouse gas emissions. Those issues have moved legislators to push for more oversight of crypto mines’ environmental impact. But until recently, most of that attention has been on whether energy-intensive cryptocurrencies like Bitcoin might throw off countries’ climate goals.\n\nBitcoin mining also has the potential to stress water resources in drought-prone areas. Miners use specialized computers to solve puzzles around the clock to validate transactions and earn Bitcoin in return. All that computing power burns through a lot of energy. And like other data centers, many crypto mines also end up using a good deal of water in their cooling systems to keep machines from overheating.\n\n“It’s sort of hard to surprise me, given how I’ve already worked on this topic I’m kind of used to big numbers popping up. But then again, the numbers are still mind blowing even to me every time I look at it,” de Vries told The Verge.\n\nTo conduct his analysis, de Vries estimated the direct water use from Bitcoin mines’ cooling systems. He also added their indirect water consumption associated with electricity generation, since power plants also use water in cooling systems. All in all, he found that cryptocurrency mining used about 1,600 gigaliters of water in 2021 when the price of Bitcoin peaked at over $65,000. That comes out to a small swimming pool’s worth of water (16,000 liters), on average, for each transaction. It’s about 6.2 million times more water than a credit card swipe, according to de Vries.\n\nOf course, everything dipped in 2022 as the price of Bitcoin plunged and mining slowed. But the price has climbed back up since last year, rising from less than $20,000 to around $38,000 today. The higher the price, the more incentive there is to ramp up mining. That’s why de Vries expects the cryptocurrency’s water consumption to rise to a new high of 2,300 gigaliters worldwide this year. In the US, the biggest hub for Bitcoin mining in the world, Bitcoin mining uses about as much annually as a city the size of Washington, DC.\n\nThese numbers are estimates based on the assumption that the Bitcoin mines run on water-dependent cooling systems typical in large data centers. However, some data centers and crypto mines use a different system that keeps computers cool and cuts down water consumption by immersing them in a non-conductive liquid.\n\nThere’s another way to get the cryptocurrency to use a fraction of the water and electricity it eats up now and slash greenhouse gas emissions: get rid of the mining process altogether and find a new way to validate transactions. That’s what the next biggest cryptocurrency network, Ethereum, accomplished last year."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy91bmNoYWluZWQtc3R1ZHktcmV2ZWFscy1vbmUtZm91ci0yMDI4MDAzNzQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Unchained Study Reveals One in Four Americans Own Bitcoin - Yahoo Finance",
        "content": "Unchained study estimates that 86M Americans own bitcoin, 26% of the total population\n\n55% of US investors surveyed by Unchained report owning bitcoin\n\nNew regulation, bitcoin spot ETF approval, and a US recession are the factors most likely to make US investors buy BTC next year\n\nOne-third of US investors expect bitcoin to outperform gold, cash, and the S&P 500 in 2024\n\nAUSTIN, Texas, November 29, 2023--(BUSINESS WIRE)--Unchained, the leading bitcoin financial services provider, today published a report with findings from a survey of US investors on bitcoin (BTC) sentiment and outlook for 2024. Chief among the findings is that one in four Americans and 55% of investors surveyed by unchained — defined by Unchained as having at least one investment account — report owning bitcoin, and 95% of this group say they would buy or strongly consider buying more of it in 2024. Of the 45% of respondents who do not own bitcoin, nearly half say they would strongly consider buying it in 2024.\n\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20231129165815/en/\n\n55% of US investors surveyed by Unchained report owning bitcoin. Nearly all (95%) of this group say they'd consider buying more BTC in 2024. (Graphic: Business Wire)\n\nRegulation is poised to be the top catalyst for both bitcoin owners and non-owners in the year ahead. When asked which factor is most likely to make them buy or strongly consider buying bitcoin in 2024, 42% of BTC owners and 35% of non-owners said increased US regulatory clarity around digital assets. Other popular factors include:\n\nSEC approval of a bitcoin spot ETF — 29% of BTC owners; 13% of non-owners\n\nUS economic recession — 18% of BTC owners; 12% of non-owners\n\nGuidance from a financial advisor — 6% of BTC owners; 26% of non-owners\n\nNotably, US investors are largely optimistic about bitcoin’s future performance, regardless of whether they own the asset. Most (79%) expect BTC to eventually pass its all-time high of $69,000, despite the asset’s price being down over 50%1 from this during the survey. Over half (55%) of investors predict BTC will reach a new all-time high in 2024, with 28% believing it will be H1 and 26% saying H2 2024. Further, one-third of investors (34%) think BTC will outperform cash, gold, and the S&P 500 in 2024.\n\nStory continues\n\nThe next year is likely to see a rise of bitcoin allocation in retirement portfolios, according to Unchained’s survey results. While nearly half of US bitcoin owners report already having BTC in their retirement account, an additional third (35%) say they would consider adding it to their 401(k), IRA, or other plan in 2024. Among non-bitcoin owners who are open to investing in the asset, 23% say they would consider adding BTC to their retirement account next year.\n\n\"At Unchained, we are seeing an influx of bitcoin newcomers who now understand that the asset has longevity,\" said Joe Kelly, co-founder and CEO of Unchained. \"As reflected in both Unchained’s survey results and the activity of our clients, US investors are eager to gain or expand bitcoin exposure — especially through tax-advantaged vehicles like Unchained’s bitcoin IRA. As more investors look to open or grow their bitcoin positions, Unchained looks forward to serving them whether it be through collaborative custody, the Unchained IRA, our trading desk, or our inheritance solutions.\"\n\nWith an estimated 158 million Americans owning some type of investment account2, Unchained’s \"US Investor Outlook for BTC in 2024\" survey sample size of 402 individuals is representative of the US investor population with a 5% margin of error at a 95% confidence level. To qualify for this survey, respondents were required to be permanent residents of the US between the ages of 18 and 78 and self-report as having one or more current financial investment(s). The survey was conducted digitally from October 26 to 28, 2023, during which time the price of bitcoin ranged from $33,610 to $34,9771.\n\nRead the full report on Unchained’s survey of US investor bitcoin sentiment and outlook for 2024 here.\n\nFor more information on Unchained, please visit www.unchained.com.\n\nAbout Unchained\n\nFounded in 2016, Unchained is a top 10 bitcoin platform by assets secured and has helped thousands of individuals and businesses truly own their wealth by holding bitcoin keys. Unchained's collaborative custody model allows clients to access financial services while continuing to have the benefits of self-custody, the ultimate consumer protection in these uncertain times. For more information on Unchained, please visit www.unchained.com.\n\nThese survey results do not represent the opinions or advice of Unchained Capital, Inc. or its affiliates (collectively \"Unchained\"), any employees of Unchained, or of any qualified investment advisor. Survey respondents were not qualified investment advisors. No representations are made that any survey methods are accurate or correspond with relevant industry practice. Do not make financial decisions based upon the results of this survey, and instead consult with a qualified investment advisor of your choice.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20231129165815/en/\n\nContacts\n\nLarissa Bundziak\n\nlarissa@unchained.com"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTI5L2dhbGF4eS1zLW5vdm9ncmF0ei1zZWVzLWJpdGNvaW4tYnRjLXJlYWNoaW5nLW9sZC1oaWdocy13aXRoLWV0Zi1hcHByb3ZhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Will Reach Its Old Highs With ETF Approval, Galaxy's Novogratz Predicts - Bloomberg",
        "content": "Michael Novogratz predicts that Bitcoin is poised to reach its former peak a year from now, as anticipation builds over the likelihood that the US Securities and Exchange Commission will approve the first American exchange-traded fund to directly hold Bitcoin.\n\n“Could we go to old highs by this time next year?” Novogratz, the founder and chief executive officer of Galaxy Digital Holdings Ltd., said during on interview on Bloomberg TV on Wednesday. “Of course.”"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvMS10b3AtY3J5cHRvLXN0b2NrLXRvLWJ1eS1mb3ItYml0Y29pbi1leHBvc3VyZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "1 Top Crypto Stock to Buy for Bitcoin Exposure - Nasdaq",
        "content": "Investing in cryptocurrencies, such as Bitcoin (BTCUSD), has helped investors derive game-changing returns over the past decade. Bitcoin prices have surged 120x in the last eight years, 7x in the last five years, and more than doubled in 2023. Despite these market-thumping returns, Bitcoin is also down 40% from all-time highs, allowing investors to buy the dip.\n\nBitcoin is a decentralized cryptocurrency, which means it is not governed by any regulatory authority such as a central bank. It uses peer-to-peer technology and blockchain technology to record transactions - effectively, a distributed public ledger that can be verified or accessed by anyone. Miners verify and process these transactions and are rewarded with a set amount of BTC, as well as transaction fees.\n\nBitcoin was created 15 years ago, and the first block was mined in January 2009. The total supply of BTC is limited to 21 million, making it deflationary in nature. More than 19 million BTC have already been mined and are in circulation.\n\nInvestors can gain exposure to this alternate asset class by purchasing Bitcoin and other cryptocurrencies on exchanges such as Coinbase (COIN). Further, you can buy shares of Coinbase and other crypto-related stocks to gain exposure to digital assets by proxy.\n\nAnother way is to buy shares of MicroStrategy (MSTR), which acts as a Bitcoin holding company. Let’s see why.\n\nwww.barchart.com\n\nMicroStrategy Goes Big on Bitcoin\n\nValued at $7.34 billion by market cap, MicroStrategy provides enterprise-facing analytics software and services. In Q3 of 2023, MicroStrategy reported revenue of $129.5 million, an increase of 3.3% year over year.\n\nWhile it is involved in the enterprise software segment, the CEO of MicroStrategy, Michael Saylor, is quite bullish on Bitcoin, and has famously allocated significant company resources to purchase BTC over the years. While MSTR has $45 million in cash, it also holds 140,000 Bitcoin worth over $4.4 billion at current prices.\n\nMicroStrategy is among the largest institutional holders of Bitcoin, and first began purchasing the digital asset as a hedge against inflation back in August 2020. In fact, MicroStrategy has also raised debt to fund its BTC purchases, and now owns 0.75% of the total Bitcoin circulating supply.\n\nWill Bitcoin Prices Keep Rising In 2024?\n\nIt's evident that the price of MSTR stock will be tied to the performance of Bitcoin. For instance, BTC prices have risen 129% year-to-date, while MSTR is up 259% in 2023.\n\nThere are two key drivers for BTC in the near term. First is the possible launch of multiple spot Bitcoin ETFs by institutions such as BlackRock (BLK), Invesco (IVZ), and Ark Invest. With trillions of dollars in assets under management, there is a good chance for Bitcoin demand to move higher once the ETFs are approved, possibly within the next six months.\n\nAnother positive catalyst for BTC prices is the upcoming halving event. Every four years, the amount of BTC that can be mined is reduced by 50%, resulting in an extended bull run due to the supply-demand economics.\n\nHere's a look at how Bitcoin has performed over the last three halving cycles.\n\nBitcoin prices surged over 5,000% between November 2011 and November 2013\n\nBitcoin prices again surged by over 5,000% between November 2015 and December 2017\n\nBitcoin prices rose 600% between November 2019 and November 2021\n\nIf you're bullish on Bitcoin, it makes sense to buy MSTR right now. Each of the four analysts tracking MicroStrategy stock has a “strong buy” recommendation. The average price target for MSTR is $516, which is only about 1% higher than the current trading price. However, BTIG sees about 10% upside, and called MSTR the best vehicle for institutional investors to gain BTC exposure in a recent note.\n\nwww.barchart.com\n\nOn the date of publication, Aditya Raghunath did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policy here.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMDEvYml0Y29pbi1leWVzLTQway1hcy0xYi1pbi1idGMtd2l0aGRyYXdhbHMtc3VnZ2VzdHMtYnVsbGlzaC1tb29kL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMDEvYml0Y29pbi1leWVzLTQway1hcy0xYi1pbi1idGMtd2l0aGRyYXdhbHMtc3VnZ2VzdHMtYnVsbGlzaC1tb29kL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Eyes $40K as $1B in BTC Withdrawals Suggests Bullish Mood - CoinDesk",
        "content": "\"We are potentially entering in 2024 an opportunity for a net positive liquidity for the markets. Bitcoin is a pure reflection of net liquidity in the markets, and we would need to see positive liquidity to support any substantial bullish activity,\" Rousseau added."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTMwL3NheWxvci1zLW1pY3Jvc3RyYXRlZ3ktbXN0ci1idXlzLWFsbW9zdC02MDAtbWlsbGlvbi1vZi1iaXRjb2luLWJ0Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Saylor’s MicroStrategy (MSTR) Buys Almost $600 Million of Bitcoin (BTC) - Bloomberg",
        "content": "MicroStrategy Inc. chairman and co-founder Michael Saylor placed one of his biggest bets yet, with the enterprise-software maker turned Bitcoin investment-fund proxy purchasing $593.3 million more of the largest cryptocurrency.\n\nThe Tysons Corner, Virginia-based firm said in a filing Thursday that it bought 16,130 Bitcoin in November, raising its holdings to roughly $6.5 billion. It was the company’s biggest purchase since it bought 19,452 Bitcoin for just over $1 billion in February 2021."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvb25lLWluLWZvdXItYW1lcmljYW5zLW93bi1iaXRjb2luJTNBLXVuY2hhaW5lZC1zdHVkedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "One in Four Americans Own Bitcoin: Unchained Study - Nasdaq",
        "content": "Unchained, a prominent Bitcoin financial services provider, released a new report today showcasing an interesting surge in bitcoin ownership among Americans. According to their findings, a one in four Americans and 55% of surveyed investors, defined by Unchained as those with at least one investment account between the ages of 18 and 78, own bitcoin.\n\nThe study, which surveyed 402 US investors, revealed that 95% of current BTC owners are considering increasing their holdings in 2024. Remarkably, almost half of non-BTC owners expressed a strong inclination towards purchasing bitcoin within the upcoming year.\n\nKey drivers influencing potential BTC purchases in 2024 include increased regulatory clarity around digital assets, with 42% of current BTC owners and 35% of non-owners highlighting this factor. Other influential elements identified were the potential approval of a bitcoin spot Exchange-Traded Fund (ETF) by the Securities and Exchange Commission (SEC) and the anticipation of a US economic recession.\n\nDespite BTC's price being down over 50% from its peak, 79% of investors foresee BTC surpassing its all-time high of $69,000. More optimistically, over half of the surveyed investors (55%) predict a new all-time high for BTC in 2024, with a third believing BTC will outperform cash, gold, and the S&P 500.\n\nUnchained's survey also foresees a significant rise in bitcoin allocation within retirement portfolios. Nearly half of current BTC owners have BTC in their retirement accounts, and an additional 35% are considering adding it in 2024. Among non-BTC owners open to investing in the asset, 23% expressed interest in including BTC in their retirement accounts.\n\n“At Unchained, we are seeing an influx of bitcoin newcomers who now understand that the asset has longevity,” stated Joe Kelly, co-founder and CEO of Unchained. “As reflected in both Unchained’s survey results and the activity of our clients, US investors are eager to gain or expand bitcoin exposure — especially through tax-advantaged vehicles like Unchained’s bitcoin IRA. As more investors look to open or grow their bitcoin positions, Unchained looks forward to serving them whether it be through collaborative custody, the Unchained IRA, our trading desk, or our inheritance solutions.”\n\nWith an estimated 158 million Americans owning investment accounts, Unchained's survey provides valuable insights, representing the US investor population with a 5% margin of error at a 95% confidence level. The survey, conducted digitally from October 26 to 28, 2023, during a period when the price of bitcoin ranged from $33,610 to $34,977, offers a compelling outlook on BTC sentiment and expectations for 2024.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTEvMzAvYml0Y29pbi1taW5lci1hbnRwb29sLXRvLXJlZnVuZC1yZWNvcmQtM20tYnRjLXRyYW5zYWN0aW9uLWZlZS_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzExLzMwL2JpdGNvaW4tbWluZXItYW50cG9vbC10by1yZWZ1bmQtcmVjb3JkLTNtLWJ0Yy10cmFuc2FjdGlvbi1mZWUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Miner AntPool to Refund Record $3M BTC Transaction Fee - CoinDesk",
        "content": "Last Thursday, AntPool received the standard 6.25 bitcoin (BTC) as well as 85.2163 BTC in fees for all transactions included in that erroneous transaction, on-chain data shows. The sender's wallet was set up just minutes before the transfer, and the recipient received only 55.78 BTC of the original 139.42 BTC that was sent."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3LnNwaWNld29ya3MuY29tL3RlY2gvdGVjaC1nZW5lcmFsL2FydGljbGVzL3doYXQtaXMtYml0Y29pbi1taW5pbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Exploring Bitcoin Mining, Its Process, and Software | Spiceworks - Spiceworks News and Insights",
        "content": "Bitcoin mining is defined as a process that secures and validates transactions on the Bitcoin network while introducing new bitcoins into circulation.\n\nThis process involves solving complex mathematical puzzles through computational power, and it plays a critical role in maintaining the decentralized nature of the Bitcoin system.\n\nIn this article, we explore the intricacies of Bitcoin mining, examining its operations, associated expenses, challenges, and recommended best practices.\n\nWhat Is Bitcoin Mining?\n\nBitcoin mining is a process that secures and validates transactions on the Bitcoin network while introducing new bitcoins into circulation. This process involves solving complex mathematical puzzles through computational power, and it plays a critical role in maintaining the decentralized nature of the Bitcoin system.\n\nAt its core, Bitcoin mining involves adding new blocks to the blockchain — a public and immutable ledger that records all Bitcoin transactions. Each block contains a group of transactions, and miners compete to create new blocks and append them to the existing chain. This is achieved through a consensus mechanism called proof of work (PoW).\n\nIn PoW, miners must find a special number called a “nonce.” They combine this nonce with transaction information and the previous block’s code to create a new code (hash) that must start with a specific number of zeros. The challenge lies in finding the right nonce that meets this requirement.\n\nTo keep the system running smoothly, the difficulty of finding this nonce is adjusted regularly. This adjustment ensures that, on average, a new block is mined every 10 minutes, no matter how much computing power is added to the network. It helps maintain a steady and predictable pace for creating new blocks in the blockchain.\n\nMining begins when a miner selects a set of unconfirmed transactions from the Bitcoin mempool (or memory pool) — a pool of pending transactions. The miner assembles these transactions into a block and starts working on finding the correct nonce. Since the process is computationally intensive, miners use specialized hardware, such as application-specific integrated circuits (ASICs), to perform trillions of calculations per second.\n\nThe first miner to find the correct nonce broadcasts the new block to the network, along with the solution to the PoW puzzle. Other miners then verify the block’s validity before accepting it into their copy of the blockchain. This verification ensures that the transactions within the block are legitimate and that the PoW solution is correct.\n\nOnce a block is accepted, it is linked to the previous block through its hash, forming an unbroken chain of blocks — the blockchain. The winning miner is rewarded with a fixed number of newly minted bitcoins, known as the “block reward,” and any transaction fees users pay to include their transactions in the block.\n\nHowever, as more miners join the network and computational power increases, the difficulty of finding the correct nonce rises. This is to maintain the 10-minute block time and ensure a controlled issuance of new bitcoins. The block reward is also halved approximately every four years through “halving.” This halving is programmed into the Bitcoin protocol and aims to limit the total Bitcoin supply to 21 million, making it a deflationary digital currency.\n\nMining also serves as a fundamental security mechanism for the Bitcoin network. The decentralized nature of mining prevents any single entity from controlling most of the network’s computational power. If a malicious actor were to gain control of over 50% of the network’s mining power, they could potentially manipulate transactions, double-spend coins, and undermine the system’s integrity. This is known as a “51% attack” and is a significant concern for any blockchain relying on PoW.\n\nSee More: Blockchain Engineer: Job Description, Key Skills, and Salary in 2022\n\nPrerequisites of Mining Bitcoin\n\nMining plays a pivotal role in the entire lifecycle of cryptocurrencies, encompassing transaction creation, transmission, and verification. This vital process ensures the digital currency’s smooth and secure movement from one party to another. However, the mining operation requires several key prerequisites. Let’s understand them in detail.\n\n1. Hardware requirements\n\nMining device : To mine efficiently, you need specialized hardware, preferably ASICs or graphics processing units (GPUs). ASICs are specifically designed for mining Bitcoin, while GPUs can also be used for other cryptocurrencies.\n\nProcessing power : The more processing power your mining hardware has, the higher your chances of successfully mining a block and earning rewards. Mining hardware is measured in hash rate, indicating the number of hashes it can calculate per second.\n\n2. Bitcoin wallet\n\nA Bitcoin wallet is essential to store the bitcoins you mine. Technically, a Bitcoin wallet contains private keys that allow you to access and control your Bitcoin holdings. You need a secure and reliable wallet to protect your earnings.\n\n3. Bitcoin mining software\n\nMining software connects your mining hardware to the Bitcoin network and enables you to participate in the mining process. The software receives and validates transactions, performs the PoW calculations, and communicates with the Bitcoin network. CGMiner, BFGMiner, and Easyminer are well-known mining software choices widely used in the mining community.\n\n4. Internet connectivity\n\nA stable and reliable internet connection is required to communicate with the Bitcoin network and other miners. Mining hardware must transmit blocks and receive new transactions and information from other nodes in real-time.\n\n5. Electricity and power costs\n\nMining is power-intensive, and electricity costs can significantly impact the profitability of mining operations. As mining hardware runs 24/7, you must consider the electricity consumption and the cost of electricity in your area.\n\n6. Cooling system\n\nMining hardware generates substantial heat; without proper cooling, it can overheat and fail. A cooling system, such as fans or liquid cooling, is necessary to keep the hardware at optimal operating temperatures.\n\n7. Knowledge and technical skills\n\nMining Bitcoin requires a certain level of technical expertise. You should understand computer hardware, software, networking, and troubleshooting well. You must be able to configure and optimize your mining hardware and software for maximum efficiency and stability.\n\n8. Joining a mining pool (optional)\n\nWhile it is possible to mine Bitcoin solo, the difficulty of mining has become so high that individual miners may take a long time to find a block. Joining a mining pool allows you to combine your hashing power with other miners, increasing the chances of earning regular rewards.\n\nMining pool members share the block rewards based on their contributed computing power.\n\n9. Secure environment\n\nMining hardware represents a significant investment, so it’s crucial to ensure a secure physical environment to protect it from theft and damage.\n\n10. Compliance and legal considerations\n\nDepending on your location, there might be legal and regulatory requirements related to cryptocurrency mining. Ensure you comply with local laws and tax regulations concerning cryptocurrency activities.\n\nRemember that the mining landscape evolves rapidly, and profitability can change due to factors like Bitcoin’s price, network difficulty, and the emergence of new, more efficient mining hardware. Therefore, staying informed and continually adapting your mining setup is crucial to remain competitive.\n\nSee More: What Is Computer Architecture? Components, Types, and Examples\n\nHow Does Bitcoin Mining Work?\n\nThe cryptocurrency mining market is experiencing substantial growth, driven by advanced distributed ledger technologies and increased electronic venture capital investments. As per a January 2023 report by Precedence Research, the global cryptocurrency mining market size reached $1.92 billion in 2022 and is projected to reach approximately $7 billion by 2032.\n\nAs we operate in this era of cryptocurrencies, it becomes crucial for industries to grasp the fundamental principles and mechanisms that facilitate Bitcoin mining. This can empower industries to make informed decisions and leverage the opportunities this evolving landscape presents.\n\nHere’s a step-by-step explanation of how Bitcoin mining works:\n\nTransaction collection : Users initiate Bitcoin transactions by sending and receiving bitcoins. These transactions are broadcast to the Bitcoin network and collected in a pool called the “mempool,” where they wait to be confirmed by miners. Block creation : Miners select a set of unconfirmed transactions from the mempool to include in a new block. Transactions are chosen based on transaction fees, with higher fees often prioritized to incentivize miners to include them in their blocks. Block header preparation : The selected transactions, along with the hash of the previous block, are combined to form the block header. The block header contains critical information that miners will modify to find a valid hash. Nonce finding : Miners attempt to find a specific numerical value known as a “nonce” by changing it in the block header. The nonce is an arbitrary number that miners can alter to generate different block header hashes. Proof of Work (PoW) : To create a valid block, miners must find a nonce that, when combined with the block header data, produces a hash that starts with a certain number of leading zeros (a hash with a specific difficulty level). This is the PoW puzzle that miners must solve. Hashing : Miners use the SHA-256 (Secure Hash Algorithm 256-bit) cryptographic hash function to compute the hash of the block header with the modified nonce. Since the hash function is deterministic, the same data and nonce will always produce the same hash. Difficulty adjustment : The difficulty of the PoW puzzle is adjusted every 2,016 blocks (approximately every two weeks) to ensure that new blocks are mined approximately every 10 minutes. If miners collectively find blocks too quickly or too slowly, the difficulty is adjusted up or down respectively. Finding the solution : Miners repeatedly change the nonce and hash the block header until they find a valid hash that meets the current difficulty requirement. This process requires substantial computational power to be completed successfully. Block broadcasting : Once a miner finds a valid hash, they broadcast the new block to the rest of the network. Other nodes and miners verify the validity of the block before accepting it. Block confirmation : As other nodes verify the validity of the new block, they add it to their copy of the blockchain. This process confirms the included transactions and ensures consensus across the network. Block reward : The miner who successfully mined the new block is rewarded with a fixed number of newly minted bitcoins, called the block reward. Currently, this reward is 6.25 bitcoins per block, but it halves approximately every four years through a process called halving. Transaction fees : In addition to the block reward, miners also collect transaction fees paid by users for including their transactions in the block. These fees serve as an incentive for miners to include transactions with higher fees in their blocks. Rinse and repeat : The mining process continues indefinitely as long as there are new transactions to process, and miners compete to find the next valid block and claim the block reward.\n\nIn summary, Bitcoin mining involves selecting transactions, creating a block, finding a nonce that results in a valid hash, and then broadcasting the new block to the network. The process requires significant computational power and serves as the foundation for securing the Bitcoin network and validating transactions.\n\nSee More: What Is Clickjacking? Definition, Methods, and Prevention Best Practices for 2022\n\nCosts and Challenges of Bitcoin Mining\n\nBitcoin mining operates as a business venture where profitability hinges on investing in various inputs. Three primary costs are associated with Bitcoin mining:\n\n1. Electricity\n\nRunning mining systems 24/7 incurs substantial electricity expenses, considering the energy consumption of the mining process, akin to that of certain countries. Additionally, cooling the mining rigs is essential due to the significant heat generated, leading to additional costs for air conditioning.\n\nIn May 2023, Statista reported that the annual global electricity consumption of Bitcoin mining reached around 95.58 terawatt-hours for that month alone.\n\n2. Mining systems\n\nWhile regular computers and gaming systems can be used for mining in a pool, the returns are limited due to shared rewards based on individual contributions. To be competitive, dedicated ASIC mining machines are necessary, each costing between $4,000 to $12,000. The mining speed and the number of rigs purchased determine the overall expenditure.\n\n3. Network infrastructure\n\nWhile network speed has minimal impact, low latency is crucial for efficient communication with the Bitcoin network. Mining farms need several internal connections, linking mining rigs to a central router or server for internet access. However, additional bandwidth is usually unnecessary for smaller operations using gaming rigs in a pool, with low latency being sufficient.\n\nFor profitability, the total costs of these inputs must be lower than the output, represented by the bitcoin price. The fluctuating nature of bitcoin prices adds complexity to the equation, making the venture uncertain. Despite the allure of minting one’s cryptocurrency, the economic challenges of Bitcoin mining might lead to lower profits and a longer breakeven time for those entering this lottery-like environment.\n\nChallenges of Bitcoin mining\n\nInvesting in Bitcoin cryptocurrency through mining is considered highly profitable. As per the Cambridge Digital Assets Program’s (CDAP) May 2022 report, the United States is the largest Bitcoin mining industry worldwide, contributing to over 38% of the global Bitcoin network’s hash rate.\n\nHowever, it has not been immune to challenges, and even today, Bitcoin mining companies encounter various issues. Here are some of the primary challenges that Bitcoin mining confronts:\n\nBitcoin Mining Challenges\n\n1. Shortage of skilled personnel\n\nLike most economic sectors, cryptocurrency also faces a scarcity of skilled personnel. As a relatively new technology, finding individuals proficient in machine operation and mining techniques is difficult. To address this, some Bitcoin mining firms invest in training new hires. However, this process is time-consuming and costly, resulting in slower mining operations and reduced revenue due to insufficient skilled personnel.\n\n2. Upfront initial costs\n\nThe initial costs involved in Bitcoin mining pose a significant challenge. In traditional manufacturing businesses, these costs are often referred to as production costs, but in Bitcoin mining, they are considered operational costs. Successful cryptocurrency mining now requires high-end supercomputers, unlike the early days when personal computers sufficed.\n\nWith increased participation in the mining venture, competition has intensified, driving the need for more powerful computers. However, without such robust equipment, mining agencies struggle to generate profits. Acquiring these powerful supercomputers requires a substantial capital investment, making it difficult for several organizations to fund their Bitcoin mining processes adequately and maintain network operations.\n\nThe higher initial costs have forced various mining companies out of business, leading to a scarcity of available Bitcoins. They have also prolonged the time needed to recover these initial investments and achieve significant growth. If the mining machines were more affordable, it would attract more participants, resulting in increased mining and more coins generated.\n\n3. Volatility in Price\n\nThe cryptocurrency sector is known for its unpredictable price variations, which pose a major drawback. Even traders on certified crypto exchanges like Immediate Edge struggle to navigate these fluctuations. Available data indicates that Bitcoin prices reached their peak in November 2021, surpassing $60,000. However, since January 2022, the prices have significantly declined. As of the time this article was written, the Bitcoin price is hovering around $37,000.\n\nThe price volatility presents a considerable threat to Bitcoin mining investors as it can result in unprecedented losses. When Bitcoin prices rise, miners can earn substantial income, but profits decrease considerably during price declines. The fluctuations in cryptocurrency prices will continue to be a key challenge for investors until the industry stabilizes.\n\n4. Escalating operational expenses\n\nHigh operational costs present a significant challenge in any business, as they directly impact the return on investment (ROI). For Bitcoin mining, operational expenses, especially electricity bills, account for a substantial portion of the revenue, ranging between 30 to 40 percent. This allocation of resources limits the ability to invest in newer and improved mining equipment or to maintain existing ones. As a result, achieving significant profits becomes difficult, posing a hindrance to the growth and efficiency of mining operations.\n\n5. Government regulations\n\nGovernment regulations play a pivotal role in the Bitcoin landscape. While certain countries have embraced Bitcoin and its use within their borders, many others have yet to follow suit. Some nations view cryptocurrencies as risky and have even deemed them illegal, creating barriers for aspiring Bitcoin mining investors in those regions.\n\nNotably, China has banned Bitcoin mining due to its substantial electricity consumption. Similarly, in January 2022, Kosovo took measures to address its energy crisis resulting from surging global prices by imposing a ban on cryptocurrency mining that contributed to increased electricity consumption in the region.\n\nThe future of mining holds promise as the global adoption of cryptocurrencies continues to grow. Once more countries fully embrace this digital currency revolution, mining will likely become more seamless and profitable globally.\n\nSee More: Top 10 Antivirus Software in 2022\n\nTop 4 Bitcoin Mining Software\n\nPresently, numerous industries view Bitcoin as a promising future for commerce. In 2022, a considerable majority of small and mid-sized businesses, approximately 75%, expressed intentions to incorporate cryptocurrency as a payment method within the next two years, according to a Deloitte survey. This trend also extends to larger businesses and organizations, with prominent names like Starbucks and Lamborghini adopting cryptocurrency.\n\nThough Bitcoin can be acquired through cash purchases, mining it using specialized hardware and software is the more prevalent approach. In this regard, let’s explore the top four Bitcoin mining software options currently available.\n\n1. CGMiner\n\nCGMiner, created by Con Kolivas in 2011, is a highly acclaimed open-source Bitcoin mining software known for its user-friendly interface and compatibility across various platforms and hardware. Utilizing a command-line interface, CGMiner allows remote mining and grants users direct control over settings like fan speeds. The software also excels in swiftly detecting new blocks and easily scaling up hashing power without delays.\n\nWhile Linux-based, CGMiner can run on Mac and Windows computers, offering cross-platform compatibility. Additionally, it supports a wide range of mining hardware, including FPGAs, GPUs, and CPUs, apart from ASICs. However, its lack of a graphical user interface might be more suitable for advanced users. Installing challenges have also been observed on Windows 10 systems due to conflicts with antivirus software like Windows Defender. CGMiner is freely available for download and use on GitHub.\n\n2. BFGMiner\n\nBFGMiner, introduced in 2012 by Luke Dashjr, is a highly favored mining software, ranking second to CGMiner in popularity. It stands out for its robust customization options, enabling users to monitor hardware temperature, manage rigs remotely, and even detect and initiate idle threads.\n\nOriginally designed to add FPGA support to a popular GPU miner, BFGMiner is compatible exclusively with FPGA and ASIC hardware. Written in C, the software runs on Linux, Mac, and Windows and can even be installed on Raspberry Pi. Notably, BFGMiner supports simultaneous mining of multiple cryptocurrencies, allowing users to hedge and diversify their risk across various mining algorithms like Scrypt and SHA256d.\n\nBFGMiner’s command-line interface, featuring customizable hotkeys, makes it user-friendly for advanced users, but its lack of a GUI may present challenges for beginners. Nonetheless, the software is freely available for download and use, making it a desirable choice for those seeking a powerful and flexible mining solution.\n\n3. MultiMiner\n\nMultiMiner, developed in 2013 by Nate Woolls, the creator of BFGMiner, offers a user-friendly experience with its intuitive GUI and quick-start mining features, making it a top choice for ease of use. Unlike many mining software requiring coding skills, MultiMiner caters to novices by guiding them through installation and automatically scanning hardware details, including average hashing power and linked pools.\n\nThe software further simplifies pool connection setup and provides remote access to mining rigs. It allows users to choose their mining strategy and automatically mine the most profitable or lowest-difficulty cryptocurrency, with estimated profits displayed.\n\nTargeted at Windows users, MultiMiner necessitates supplementary software for installation on Mac and Linux systems; however, the provided instructions simplify this procedure. Additionally, the software enables seamless transitioning between mining rigs, supporting GPUs, ASICs, and FPGAs. Novices appreciate the user-friendly interface, while advanced users can access more sophisticated features such as API settings and engine arguments. MultiMiner is available for free download and use, making it a valuable and accessible mining solution for both newcomers and experienced miners.\n\n4. Awesome Miner\n\nDeveloped by IntelliBreeze in 2014, Awesome Miner is a Windows-based cryptocurrency mining management application known for its centralized management capabilities, allowing users to efficiently handle multiple mining engines and pools through its user-friendly dashboard.\n\nThis powerful software supports various mining hardware types, including ASICs and FPGAs, and is compatible with over 50 mining engines and popular mining algorithms like SHA-256, Scrypt, X11, Ethereum, and Zcash. Users can effortlessly add, switch, and manage multiple miner pools with one-click convenience, streamlining the mining setup process. Awesome Miner’s comprehensive dashboard also provides crucial hardware information, such as fan speed and temperature. Moreover, miners can leverage the built-in C# script engine to create custom triggers and actions, enhancing mining control and optimization.\n\nWhile primarily designed for Windows and Linux, Awesome Miner offers web access through any computer or browser, ensuring convenient management from various devices. As a free-to-use solution, Awesome Miner proves to be a valuable asset for maximizing profits and minimizing downtime in large-scale cryptocurrency mining operations.\n\nSee More: What Is a Software Engine? Types, Applications, and Importance\n\nBest Practices for Mining Bitcoin\n\nNow that you have a grasp of the intricacies of Bitcoin mining, let’s delve into five essential best practices to optimize your Bitcoin mining endeavors:\n\n1. Research and planning\n\nBefore diving into Bitcoin mining, conduct thorough research to understand the process, hardware requirements, and potential profitability. Create a well-thought-out mining plan that includes factors like initial investment, energy costs, and expected returns. Stay updated with the latest developments in the mining industry.\n\n2. Invest in quality hardware\n\nBitcoin mining requires specialized hardware known as ASICs. Invest in high-quality and efficient ASIC miners to optimize your mining performance and increase profitability. Regular consumer-grade computers or GPUs are not suitable for competitive Bitcoin mining.\n\n3. Join a mining pool\n\nBitcoin mining has become highly competitive, and mining solo may not yield consistent rewards. Joining a mining pool allows you to combine your computational power with other miners, increasing the chances of finding blocks and receiving regular rewards. Choose a reputable and reliable mining pool with a fair reward distribution system.\n\n4. Monitor and optimize\n\nRegularly monitor your mining operation’s performance, including hash rate, hardware temperature, and power consumption. Optimize your mining setup to ensure maximum efficiency and reduce energy costs. Consider adjusting mining strategies based on market conditions and network difficulty.\n\n5. Secure and backup your wallet\n\nSet up a secure Bitcoin wallet to store your mined Bitcoins. Choose hardware or trusted software wallets with robust security features to protect your earnings from potential hacks or cyber threats. Regularly back up your wallet keys and critical data to prevent data loss.\n\nFollowing these best practices can enhance your Bitcoin mining experience and increase your chances of running a successful and profitable mining operation. Remember that mining Bitcoin requires dedication, continuous monitoring, and adapting to changing market conditions.\n\nSee More: What Is Jenkins? Working, Uses, Pipelines, and Features\n\nTakeaway\n\nThe future of Bitcoin mining looks promising but is also evolving with various challenges. As more individuals and institutions adopt cryptocurrencies, the demand for mining is expected to rise. However, the mining process’s energy consumption and environmental impact have raised concerns, leading to the exploration of more sustainable solutions.\n\nTo address the energy issue, there is a growing interest in renewable energy sources for mining operations. Additionally, mining hardware and software advancements will likely improve efficiency and reduce costs.\n\nAs the Bitcoin network matures, further regulatory developments and increased government oversight may impact mining operations in different regions. Overall, Bitcoin mining is poised for growth and innovation, but it will require continuous adaptation to remain sustainable in an evolving landscape.\n\nDid this article help you understand Bitcoin mining better? Comment below or let us know on FacebookOpens a new window , XOpens a new window , or LinkedInOpens a new window . We’d love to hear from you!\n\nImage source: Shutterstock"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LmJ1c2luZXNzLmNvbS9hcnRpY2xlcy9yZWFzb25zLXJlc3RhdXJhbnRzLWFjY2VwdC1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Pros and Cons of Accepting Bitcoin in Restaurants - Business.com",
        "content": "While cryptocurrency isn’t as commonplace as emerging payment methods like mobile wallets and other digital payment forms, its use has become more widespread in recent years – and small business owners are taking note.\n\nBitcoin is the most popular cryptocurrency working its way into the mainstream. If you own a restaurant, you might think about accepting Bitcoin as a payment form to attract more customers to your restaurant and increase your restaurant’s profits. However, you may also be wary of Bitcoin’s price volatility and how it integrates with restaurant accounting systems.\n\nWe’ll explore Bitcoin and how it works and examine the benefits and challenges of accepting Bitcoin as a restaurant payment option.\n\nEditor’s Note: Considering a POS system? We can help you choose the one that’s right for you. Use the questionnaire below to have our sister site, BuyerZone, provide you with information from a variety of vendors for free:\n\nWhat is Bitcoin? Bitcoin was created in 2009, making it the first modern cryptocurrency. It is an all-digital currency that relies on peer-to-peer blockchain technology for tracking and trading. No centralized system, bank or government backs Bitcoin. Although Bitcoin was primarily designed as a payment form, most people currently use Bitcoin and its cryptocurrency cousins for investment purposes. Still, Bitcoin is by far the most common cryptocurrency businesses accept as payment. In 2021, Pew Research found that 16% of Americans (and 31% of Americans between 18 and 29) have invested in Bitcoin and other cryptocurrencies, and over 15,000 companies around the world accept Bitcoin, according to Zippia. FYI Did you know If your personal Bitcoin holdings increase in value, the IRS considers that a taxable event, and you’ll pay up to 37% on your profits. Consider hiring a CPA well-versed in crypto to stay compliant.\n\nHow does Bitcoin work? To accept Bitcoin in your restaurant, you’ll need to sign up for a Bitcoin merchant wallet account via an online platform like Confirmo, BitPay, or CoinGate. Many of these crypto wallets integrate with the best POS systems, as well as shopping cart and commerce platforms. Some of the best credit card processors accept cryptocurrency payments, making it easier for merchants to support Bitcoin payments. A typical restaurant payment transaction with Bitcoin would go something like this: The restaurant shows the Bitcoin-paying customer a QR code. The customer scans the QR code; their personal crypto wallet reads the virtual address where it should send the payment. This address is usually a one-time destination code. The customer enters their private key, which is like a password, to verify the transaction. Depending on your restaurant’s POS software or accounting software, you may be able to convert the Bitcoin payment into U.S. dollars for easy accounting and tax keeping. Did You Know? Did you know When a business accepts credit cards, transaction approval or denial is immediate. With Bitcoin, it can take up to an hour. Most Bitcoin merchants wait for the sixth blockchain confirmation before deeming a transaction successful.\n\nShould your restaurant accept bitcoin? There are several compelling reasons why your restaurant should accept cryptocurrency, but you’ll need to seriously weigh the downsides before making a decision. Here are some upsides of accepting Bitcoin in your restaurant: Lower transaction fees. Merchant service providers charge up to 4% per transaction – or even more if your diner is from overseas. Crypto fees can be 1% or less – but watch out for transaction fees called gas fees, particularly with Ethereum.\n\nMerchant service providers charge up to 4% per transaction – or even more if your diner is from overseas. Crypto fees can be 1% or less – but watch out for transaction fees called gas fees, particularly with Ethereum. Better cash flow. You might wait days to receive the cash from your merchant services provider for customer payments via credit card. With Bitcoin, you’ll receive it within the hour.\n\nYou might wait days to receive the cash from your merchant services provider for customer payments via credit card. With Bitcoin, you’ll receive it within the hour. No PCI compliance is required. PCI compliance doesn’t apply to Bitcoin transactions. However, this perk doesn’t count for much if you still take debit and credit card payments alongside Bitcoin payments.\n\nPCI compliance doesn’t apply to Bitcoin transactions. However, this perk doesn’t count for much if you still take debit and credit card payments alongside Bitcoin payments. Business from Bitcoin believers. Many Bitcoin holders are enthusiastic about cryptocurrency and its perceived ability to improve the financial system. If you accept Bitcoin, these individuals may seek you out to support your restaurant. “For marketing-savvy businesses, it is definitely a differentiator to be able to accept Bitcoins, and if you are trying to attract an audience that uses Bitcoin, you may be perceived as a techno-savvy restaurant or establishment,” according to technology futurist and podcast host Ian Khan.\n\nMany Bitcoin holders are enthusiastic about cryptocurrency and its perceived ability to improve the financial system. If you accept Bitcoin, these individuals may seek you out to support your restaurant. “For marketing-savvy businesses, it is definitely a differentiator to be able to accept Bitcoins, and if you are trying to attract an audience that uses Bitcoin, you may be perceived as a techno-savvy restaurant or establishment,” according to technology futurist and podcast host Ian Khan. No chargebacks. Accepting Bitcoin means you can avoid chargebacks. Unlike standard credit and debit cards, consumers can’t contact Bitcoin to have a transaction reversed. The only way you’ll ever reimburse a customer is if you choose to do so. Here are the downsides of accepting Bitcoin in your restaurant: Price volatility. Cryptocurrency exchange rate swings tend to be much more severe in both directions than traditional currency. Here’s an example of Bitcoin’s price volatility and how it might affect your restaurant: Let’s say your restaurant hosts a party of Cambodian citizens celebrating their country’s independence day on November 9, 2021. They spend $1,000. If you took that money in U.S. dollars, it would lose some value through inflation. Bitcoin’s value on that day was $66,938, but on June 18, 2022, it was worth $18,948.80 – a drop of 71.7%. If you accept Bitcoin, you’re also accepting its volatility.\n\nCryptocurrency exchange rate swings tend to be much more severe in both directions than traditional currency. Here’s an example of Bitcoin’s price volatility and how it might affect your restaurant: Let’s say your restaurant hosts a party of Cambodian citizens celebrating their country’s independence day on November 9, 2021. They spend $1,000. If you took that money in U.S. dollars, it would lose some value through inflation. Bitcoin’s value on that day was $66,938, but on June 18, 2022, it was worth $18,948.80 – a drop of 71.7%. If you accept Bitcoin, you’re also accepting its volatility. Wallet security. You may lose all your cryptocurrency if you choose a fake crypto exchange or if your legitimate provider goes under. In financial terms, crypto is still the Wild West compared to standard financial products.\n\nYou may lose all your cryptocurrency if you choose a fake crypto exchange or if your legitimate provider goes under. In financial terms, crypto is still the Wild West compared to standard financial products. Future regulation is a distinct possibility. Future regulations are possible if Bitcoin continues to grow in popularity and use. Regulations will likely make handling crypto more difficult and expensive.\n\nFuture regulations are possible if Bitcoin continues to grow in popularity and use. Regulations will likely make handling crypto more difficult and expensive. Accounting may be more challenging. Most cloud-based accounting packages aren’t set up to handle Bitcoin transactions. This will make bookkeeping more challenging, especially if you’re regularly converting from dollar to Bitcoin and vice versa. Tip Bottom line If you decide to accept Bitcoin, share the news via social media posts and signage in your restaurant. Consider promoting your restaurant by registering with websites like Coinmap.org and SpendBitcoins to draw in crypto users."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMzAvbXlzdGVyaW91cy1hZGRyZXNzLXRoYXQtYWRkZWQtMTBrLWJpdGNvaW4taXMtanVzdC1hLW5ldy1iaXRtZXgtd2FsbGV0L9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMzAvbXlzdGVyaW91cy1hZGRyZXNzLXRoYXQtYWRkZWQtMTBrLWJpdGNvaW4taXMtanVzdC1hLW5ldy1iaXRtZXgtd2FsbGV0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "'Mysterious' Address That Added 10K Bitcoin Is Just a New BitMEX Wallet - CoinDesk",
        "content": "BitMEX was probably conducting an internal transfer because it is migrating most of its bitcoin holdings from the 3BMEX format to addresses with format bc1qmex, the firm said. There are also Bitcoin addresses that start with “bc1q” that support SegWit, a type of bitcoin transaction, natively, allowing more efficient transactions that can pay lower fees."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGVybXMvYi9ibG9jay10aW1lLWNyeXB0b2N1cnJlbmN5LmFzcNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "What Is Block Time? What It Measures, Verification, and Example - Investopedia",
        "content": "What Is Block Time?\n\nBlock time measures the time it takes the miners or validators within a network to verify transactions within one block and produce a new block in that blockchain.\n\nBlockchains were first popularized by Bitcoin when it was introduced in 2009. The technology has grown as more cryptocurrencies are created, each of which can use a different or identical blockchain, validation methods, and techniques for creating new blocks.\n\nKey Takeaways Block time is the time it takes to process a block in a cryptocurrency blockchain.\n\nOn the Bitcoin blockchain, a block is verified by miners, who compete against each other to verify the transactions and solve the hash, which creates another block.\n\nOn the Ethereum blockchain, a block is validated by randomly selected nodes, which is must faster because there is no competition.\n\nOther chains might use different mechanisms, which would affect their block times.\n\nUnderstanding Block Time\n\nA blockchain is a distributed database that records all transactions within a cryptocurrency network. You can think of a block within the database as a cell in a spreadsheet where transaction information is stored. Bitcoin miners verify the transactions, which takes time because finding the solution to the encryption problem requires the computers to make a vast number of trial-and-error attempts.\n\nOn the Bitcoin blockchain, this is called hashing—generating random hexadecimal numbers to try and find one that is less than or equal to one set by the network. When the block solution is found or otherwise validated, a new block is opened. The amount of time it takes to find the solution and create a new block is the block time.\n\n\n\nHere are a few key points to remember if you're trying to understand block time:\n\nA block is a record of the most recent cryptocurrency transactions, similar to a cell in a table of columns and rows.\n\nEach block contains the information from the block that preceded it in hashed form (that's why it is theoretically impossible to alter cryptocurrency).\n\nOn the Bitcoin blockchain, cryptocurrency \"miners\" race against each other to generate a random hash plus the nonce that is less than or equal to the target hash. The winner receives a reward.\n\nEthereum validators use a different consensus mechanism, which makes the block times shorter.\n\nBlockchains that use other mechanisms may have shorter or longer block times.\n\nWhy Block Times Differ\n\nConsensus mechanisms are what allow a network of participants to agree that a transaction is valid. Cryptocurrencies can use different consensus mechanisms, which, among other factors, affect the time it takes to verify transactions and create new blocks.\n\nProof-of-work and proof-of-stake are two types of consensus mechanisms that use different transaction verification methods. Each blockchain has a different block time because of the way their mechanisms work—Bitcoin averages about 10 minutes, while Ethereum only takes around 12 seconds.\n\nThe exact amount of time it takes for block generation on the Bitcoin proof-of-work blockchain is governed by the difficulty level, which changes with network traffic and the number of miners on the network to keep block times at 10 minutes.\n\nEthereum uses proof-of-stake, which is much faster because there is no competition for a reward—participants with staked ether are randomly selected to validate the transactions and receive network fees.\n\nBlock Time vs. Confirmation Time\n\nSometimes confused with each other, block times and confirmation times are two different measurements on a blockchain. Confirmation time is the amount of time it takes a blockchain to confirm a transaction.\n\nIt's often thought that a transaction needs six confirmations before it goes through; however, this is a misunderstanding. When a transaction makes it into a block, and the block is closed, the transaction has one confirmation and concludes. The number six comes from the belief that a transaction that was confirmed six times (included in six closed blocks) is secure from any network attacks.\n\nA block may be opened every 10 minutes on the Bitcoin blockchain, but not all transactions that occur within that period can be sent to the current block to be mined and confirmed. Confirmation can take up to several hours on the Bitcoin blockchain because transactions are sent to a mempool, where they are queued in order of the amount of fees paid.\n\nUsers who want their transactions placed in front of others pay more than the average, while those who pay average or below-average fees must wait their turn to be sent to a block, verified, and confirmed at least once.\n\n\n\nHow Many Bitcoins Will Ever Be Created? Bitcoin has a limit of 21 million. There are over 19 million Bitcoins in circulation, and the number of Bitcoins created yearly halves every four years. This slows down Bitcoin creation over time.\n\nHow Many Ethereum Will Ever Be Created? Ethereum, unlike Bitcoin, doesn't have an upper limit on the number of coins that will be created.\n\nHow Do I Get a Bitcoin Block? You never actually receive a Bitcoin block since it is part of Bitcoin's framework. Instead, you receive a reward of bitcoin when your miner solves the hash and creates another block.\n\nThe Bottom Line\n\nBlocks are one of the structures used in a blockchain that store information. The time it takes to open a new block on a chain is that chain's block time. Block times differ from confirmation times, which can take several hours or days to complete.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n\n\n"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMinwFodHRwczovL3d3dy5iZWFjb25qb3VybmFsLmNvbS9zdG9yeS9uZXdzL2xvY2FsLzIwMjMvMTEvMzAvYml0Y29pbi1jcnlwdG9jdXJyZW5jeS1jcnlwdG8tbWluaW5nLWNvbXBhbnktY2hpbmEtYWtyb24tb2hpby1oZWFkcXVhcnRlcnMtbmVhci1nb29keWVhci83MTQ3MzU2MDAwNy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin cryptocurrency mining company operating in Akron, Ohio - Akron Beacon Journal",
        "content": "No commitment required. Cancel anytime.\n\n*Offer available to new customers only. All savings based off the regular rate.\n\nRead the full Subscription Terms and Conditions."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMzAvbWljcm9zdHJhdGVneS1ib3VnaHQtNjAwbS1vZi1idGMtaW4tbm92ZW1iZXItaW5jcmVhc2VkLWhvbGRpbmdzLWJ5LTEwL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMzAvbWljcm9zdHJhdGVneS1ib3VnaHQtNjAwbS1vZi1idGMtaW4tbm92ZW1iZXItaW5jcmVhc2VkLWhvbGRpbmdzLWJ5LTEwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "MicroStrategy Bought $600M of BTC in November, Increased Holdings by 10% - CoinDesk",
        "content": "The Michael Saylor-founded software developer bought the bitcoin for around $593.3 million in cash at an average price of about $36,785 apiece, according to a regulatory filing on Thursday. It now holds 174,530 BTC bought at an average of about $30,252 per coin."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9taWNoYWVsLXNheWxvcnMtbWljcm9zdHJhdGVneS1tYWtlcy1iaWdnZXN0LTIwMjMwOTAwOS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Michael Saylor's MicroStrategy makes its biggest bitcoin purchase in years as Wall Street grows more bullish - Yahoo Finance",
        "content": "MicroStrategy's Michael Saylor Joe Raedle/Getty Images\n\nMicroStrategy bought $593.3 million of bitcoin through November, its latest filing shows.\n\nThat's its largest purchase since a $1 billion acquisition in February 2021.\n\nChairman Michael Saylor is pursuing a strategy of acquiring as much bitcoin as possible.\n\nMicroStrategy bought $593.3 million worth of bitcoin this month, marking the firm's largest purchase in nearly three years.\n\nA Thursday filing disclosed that the company added 16,130 tokens to its holdings in November, purchased at an average price of $36,785 per bitcoin. MicroStrategy's total trove of bitcoins is now valued around $6.5 billion.\n\nThis month's bitcoin spree was the firm's biggest since February 2021, when MicroStrategy spent $1 billion to add 19,452 tokens, Bloomberg reported.\n\nIt comes as the asset is attracting renewed attention, amid growing confidence that a bitcoin spot ETF is soon to be approved by federal regulators.\n\nThe bullishness is seen in recent forecasts, which put the price at $100,000 by the end of next year, more than doubling after it already jumped 127% this year to $37,788.\n\nMicroStrategy's November purchase is also in line with Chairman Michael Saylor's plan to acquire as much of the cryptocurrency as possible on expectations that the token's market dominance would escalate aggressively.\n\n\"I think that the public is beginning to realize that bitcoin is the next bitcoin,\" he said in August. \"The next logical step is for bitcoin to 10x from here and then 10x again.\"\n\nEarlier bitcoin purchases also saw MicroStrategy sell shares to buy bitcoin, including a $150 million purchase between August and September.\n\nThe latest filing also disclosed that MicroStrategy entered an agreement for a possible $750 million sale of class A common stock.\n\nGiven the enormity of its bitcoin trove, MicroStrategy's stock performance has mirrored the token's surge in 2023, with shares up 174.68% this year.\n\nRead the original article on Business Insider"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1idGMtY2FuLWhlYWQtaGlnaGVyLWluLTIwMjQuLWhlcmVzLXdoedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Can Head Higher in 2024. Here's Why - Nasdaq",
        "content": "What a difference a year can make. Last year, Bitcoin (BTC-USD) lost nearly two-thirds of its value, and skeptics were ready to leave it for dead. This year, Bitcoin has come roaring back with a torrid gain of 128% in 2023. While 2023 has been a momentous year for the largest cryptocurrency by market cap, it can head even higher next year based on two potential catalysts that could both occur in early 2024: its upcoming halving and the potential for the approval of a spot Bitcoin ETF. I'm bullish on BTC.\n\nGet Ready for The Halving\n\nBitcoin’s next halving event is expected to occur in April 2024. What does the halving entail?\n\nHalvings are scheduled events that take place every four years, in which the reward for mining a new block of Bitcoin is cut in half. Right now, Bitcoin miners receive a reward of 6.25 new Bitcoins for each block that they mine. After the halving, this reward will be reduced to 3.125 BTC.\n\nThere are only 21 million Bitcoins that will ever exist, and this fixed supply is one of Bitcoin's primary selling points. Unlike fiat currencies, which governments and central banks can always print more of, Bitcoin is a finite resource. The halving helps to curb Bitcoin’s inflation rate and ensures that Bitcoin becomes increasingly scarce over time, which should theoretically increase its value over time.\n\nTo be clear, nothing is guaranteed, but past halvings have typically ushered in significant bull markets for Bitcoin. During the first Bitcoin halving in 2012, the block reward decreased from 50 BTC to 25 BTC, and the price of Bitcoin increased from about $12 before the halving to over $960 one year later.\n\nDuring the second Bitcoin halving in 2016, the reward decreased from 25 BTC to 12.5 BTC, and the price of Bitcoin nearly quadrupled one year later, from $663 to about $2,500.\n\nLastly, during the most recent halving, which occurred in 2020, the block reward decreased from 12.5 BTC to 6.25 BTC, and the price of Bitcoin went parabolic, rising from about $8,500 before the halving to an all-time high of around $69,000 in November of 2021.\n\nThe price of Bitcoin came down considerably from this all-time high, and past results are no guarantee of future results. However, this illustrates the effect that past halvings have had on the price of Bitcoin. Based on these results, it’s easy to see why crypto market participants are enthusiastic about the next halving.\n\nImpact of a Potential Spot Bitcoin ETF Approval\n\nIt’s not just the halving that could serve as a catalyst for Bitcoin in 2024. Some market observers believe that the approval of a spot Bitcoin ETF by the SEC is becoming increasingly likely and that it will come in early 2024.\n\nBlackRock (NYSE:BLK) kicked off the excitement this summer with its spot Bitcoin ETF filing and was soon followed by a mix of traditional finance giants like Fidelity and Invesco (NYSE:IVZ), tech-centric ARK Invest, and Grayscale Bitcoin Trust (OTC:GBTC), which is seeking to convert its trust into an ETF. Bloomberg ETF analysts Eric Balchunas and James Seyffart have forecasted a 90% likelihood that a spot Bitcoin ETF will be approved for trading by January 2024.\n\nBalchunas has noted that ARK Invest, BlackRock, and others are updating their S1 filings, which could be a good sign, as it means that these issuers are getting their applications in shape for approval. Balchunas and other observers have also noted that BlackRock and others have been meeting with the SEC to hash out details and that this dialogue is another good sign.\n\nIt should be pointed out that this is all speculation at this point, but the developments do seem encouraging.\n\nTo be clear, speculation and excitement about the possibility of such an ETF has already driven the price of Bitcoin higher in 2024. The current Bitcoin rally really kicked into overdrive this summer after news of BlackRock's filing broke.\n\nWhile this could potentially make an approval a \"buy the rumor, sell the news\" event in the short term, over the long term, a spot Bitcoin ETF would usher in a new era for Bitcoin.\n\nMillions of U.S. investors would be able to gain direct exposure to Bitcoin through their brokerage or retirement accounts for the first time, making the process of gaining Bitcoin exposure as simple as buying a stock or an ETF.\n\nThis would open up access to Bitcoin to investors who are interested in it or bullish on its long-term potential but who don’t want to manage their own Bitcoin wallet or open up a dedicated crypto brokerage account with Coinbase (NASDAQ:COIN) or another provider. These ETFs could also bring more institutional investors into Bitcoin.\n\nFurthermore, ETFs from recognizable and trusted blue-chip names in the traditional finance world, like BlackRock, Fidelity, and others who have filed, would make many investors feel more comfortable with Bitcoin and boost its credibility with mainstream, non-crypto investors.\n\nLooking Ahead to 2024\n\nBitcoin has had an epic run in 2023, but 2024 could see it add to these gains based on two major potential catalysts: the Bitcoin halving, which has historically led to bullish price action for Bitcoin, and the possibility of the launch of a spot Bitcoin ETF, which would potentially open Bitcoin up to a whole new pool of investors and bring it even further into the mainstream.\n\nBitcoin and other cryptocurrencies can be risky and volatile investments, so they are not for the faint of heart. I own Bitcoin and am bullish on it. For long-term, risk-tolerant investors, I like the idea of adding some diversification to portfolios by adding some Bitcoin ahead of these events.\n\nDisclosure\n\n\n\n\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jbmJjLmNvbS92aWRlby8yMDIzLzExLzI5L2JpdGNvaW4tYnJpZWZseS1jcm9zc2VzLTM4MDAwLW1hcmstZGVzcGl0ZS1tb3JlLWZhbGxvdXQtZnJvbS1iaW5hbmNlLWNoYXJnZXMtY25iYy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin briefly crosses $38,000 mark despite more fallout from Binance charges - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin briefly crosses $38,000 mark despite more fallout from Binance charges: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Professor Yesha Yadav of Vanderbilt University Law School discusses crypto regulation and what's next for the industry following Binance's historic settlement with U.S. government officials."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jbGlja29ybGFuZG8uY29tL2dldHRpbmctcmVzdWx0cy8yMDIzLzExLzMwL3VzLXNlY3JldC1zZXJ2aWNlLWxhdW5jaGVzLWNlbnRyYWwtZmxvcmlkYS1iaXRjb2luLWF0bS13YXJuaW5nLWNhbXBhaWduL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "US Secret Service launches Central Florida bitcoin ATM warning campaign - WKMG News 6 & ClickOrlando",
        "content": "ORLANDO, Fla. – The U.S. Secret Service Cyber Task Force began a seven-county Central Florida campaign Thursday to post warning signs at 433 identified ATM bitcoin hubs used in schemes across the state.\n\nFederal agents tell News 6 that conmen use scare tactics to convince victims to move their money to the digital accounts and the machines allow complete control once the money is transferred from cash to cryptocurrency.\n\nAn Orange County woman recently lost $21,000 when she transferred money to bitcoin accounts.\n\nThe victim told News 6 that imposters claiming to be with Bank America provided QR codes to transfer.\n\n[EXCLUSIVE: Become a News 6 Insider (it’s FREE) | PINIT! Share your photos]\n\nU.S. Secret Service Special Agent-in-charge Caroline O’Brien-Buster said the financial fallout in cryptocurrency scams has been overwhelming, with some victims pumping their life savings into bitcoin accounts set up by thieves.\n\nAccording to the Federal Trade Commission, Americans reported losses of more than $1 billion to cryptocurrency and bitcoin schemes between January and September of this year.\n\nFind more reports from our News 6 Investigators on YouTube:\n\nThe warning signs will posted on store windows and next to cryptocurrency ATMs.\n\n“The fliers we’re putting up focus on six of our highest types of (crypto) fraud‚” Obrien-Buster told News 6. “We’re hoping that by putting these up at the bitcoin ATMs or the windows at these different establishments, that a victim who’s fallen for one of these will think twice about putting their money into a bitcoin ATM.”\n\n[STORY CONTINUES BELOW IMAGE]\n\nBe on the lookout for these scams.\n\nTask force members from the Secret Service Orlando office, Seminole County Sheriff’s Office as well as officers from Lake Mary and Casselberry police departments delivered warning posters to roughly 70 ATM locations identified as bitcoin hubs in Seminole county.\n\nThe U.S. Secret Service has already run similar door-to-door poster campaigns at businesses in Washington D.C. and Tennessee with great success.\n\nNews 6 accompanied task force members and found merchants were completely cooperative, allowing agents to display the warning posters without reservation.\n\nSpecial Agent Matthew Roberts said the posters make clear “what could happen.”\n\n“Merchants have been very cooperative they want to work with law enforcement,” Roberts told News 6. “They understand the scams that have been going on but sometimes they don’t and we have to explain to them the machines have some good purposes but they can also be used in a scam.”\n\nO’Brien-Buster said the cyber task force will post warning signs at the remaining identified ATM bitcoin locations over the next few months.\n\nThose counties include Citrus, Lake, Sumter, Orange, Osceola and Brevard.\n\nIf you have been duped in a cryptocurrency ATM scheme, call the Secret Service Orlando office at 407-648-6333.\n\nOr you can email makeendsmeet@wkmg.com or text the words “make ends meet” along with your name and issue to 407-676-7428.\n\nGet today’s headlines in minutes with Your Florida Daily:"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1MTg3L2JpdGNvaW4tcHJpY2Utc3Bpa2VzLWNhdXNlLTI5LW1pbGxpb24taW4tc2hvcnQtbGlxdWlkYXRpb25z0gFjaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjY1MTg3L2JpdGNvaW4tcHJpY2Utc3Bpa2VzLWNhdXNlLTI5LW1pbGxpb24taW4tc2hvcnQtbGlxdWlkYXRpb25z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin price spikes cause $29 million in short liquidations - The Block",
        "content": "Bitcoin BTC -3.26% 's sudden upward price trajectory in the past 24 hours has caused almost $30 million in bitcoin short liquidations.\n\nOver the past 24 hours there were over $119 million liquidations in the cryptocurrency market. Of these liquidations, the vast majority, $73 million, were short positions. Bitcoin short positions took the largest share of the damage, with over $29 million in short liquidations in the past 24 hours, according to Coinglass data.\n\nThe wipe out of short position came as bitcoin broke through the $38,000 mark earlier today before retracing its steps. The largest digital asset by market capitalization reached a high of $38,246 in the past 24 hours. It is now changing hands for $37,690, at 11:50 p.m. ET, according to The Block's Price Page.\n\nA battle of bulls and bears\n\nRELATED INDICES See crypto indices\n\nBitfinex analysts said that one of the fundamental factors behind the recent price appreciation for the world's largest digital asset by market cap, \"includes the anticipation of a pause in the Fed's interest rate hikes.\"\n\n\"Such a pause is expected to maintain or lower the benchmark overnight interest rate, which is one of the highest in US history. This situation could make risk assets like bitcoin more attractive to investors seeking higher returns in a lower interest rate environment,\" Bitfinex analysts told The Block.\n\nHowever, the analysts added that other narratives are at play. \"Long-term bitcoin supply has continued to remain dormant while the lower timeframes currently show aggressive market participants chasing price, market buying, above the crucial $37,500 level. This resilience might also be reflecting in ether's performance, along with bitcoin steadily trading above $37,500.\" the analysts said."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTI5L2dyYXlzY2FsZS10cnVzdC1iZWNvbWVzLWxpdmUtYmV0dGluZy1saW5lLWZvci1zcG90LWJpdGNvaW4tZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Grayscale Trust Becomes 'Live Betting Line' for Spot Bitcoin ETF - Bloomberg",
        "content": "Traders betting that regulators will approve a US spot Bitcoin exchange-traded fund sooner rather than later have all but evaporated a once-gargantuan discount on the world’s biggest crypto fund.\n\nThe $24 billion Grayscale Bitcoin Trust (ticker GBTC) is currently trading at a roughly 8% discount to its underlying Bitcoin holdings, the narrowest dislocation in over two years, data compiled by Bloomberg show. GBTC entered 2023 with a record discount of nearly 50%."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5ncmVlbnBlYWNlLm9yZy91c2EvbmV3cy9pbXBhY3RlZC1jb21tdW5pdGllcy1hbmQtZW52aXJvLWFkdm9jYXRlcy1yZWFjdC10by1uZXctcmVwb3J0LXNob3dpbmctY3J5cHRvbWluaW5ncy1tYXNzaXZlLXdhdGVyLWNvbnN1bXB0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Impacted Communities and Enviro Advocates React to New Report Showing Cryptomining’s Massive Water ... - greenpeace.org",
        "content": "Impacted Communities and Enviro Advocates React to New Report Showing Cryptomining’s Massive Water Consumption\n\nWashington, DC (November 30, 2023) – On Thursday, environmental advocates from across the country held a press conference following a groundbreaking report outlining the astounding volume of water used to mine Bitcoin. Published by Alex de Vries in the peer-reviewed Cell Reports Sustainability journal, the report is the first comprehensive estimate of total water consumption in the global Bitcoinindustry.de Vries joined national environmental advocates and local community members from New York, Texas, Pennsylvania, and Kentucky to address the concerning impact of nearby Bitcoin mining operations on water supplies and community health. Bitcoin mining’s significant water usage poses a pressing concern amid the global water crisis, with potential for even faster growth in water demand. The report warns that the sheer scale of Bitcoin mining’s water usage could impact drinking water supplies if it continues to operate without constraints, especially in countries that are already battling water scarcity, including the United States.\n\nNot only are Bitcoin mining plants using massive amounts of water to operate, they also often discharge the water back into local water supplies or wastewater treatment facilities. This thermal pollution endangers health and wildlife habitability, including but not limited to potential harmful algal blooms, fish deaths, biodiversity loss and migration, oxygen depletion, direct thermal shock, and changes in dissolved oxygen.\n\nWatch the virtual press conference here.\n\nProof-of-work cryptocurrency mining is an energy-intensive process that requires a massive fleet of single-purpose machines to operate around the clock in a race to guess numbers. A large amount of water is used to cool the computers at large data centers. In addition to cooling computers, coal and gas-fired power plants that generate electricity to power the mining must also use water to manage the temperature.\n\nThe recent report found the following:\n\nIn 2021, Bitcoin mining consumed over 1,600 gigaliters (GL) of water worldwide\n\nIn the United States, Bitcoin mining consumes about 93 GL to 120 GL of water every year, equivalent to the average water consumption of 300,000 U.S. households or a city like Washington, D.C.\n\nEach transaction on the Bitcoin blockchain uses 16,000 liters of water on average, about 6.2 million times more than a credit card swipe, or enough to fill a backyard swimming pool.\n\nThe water footprint of Bitcoin in 2021 significantly increased by 166% compared with 2020, from 591.2 to 1,573.7 GL, and it is only expected to increase to 2,300 GL in 2023.\n\nAlex deVries, the paper’s author and a Ph.D. student at Vrije Universiteit Amsterdam said, “Bitcoin is now responsible for consuming more water than the entire traditional financial system (bank notes + bank branches + ATMs + cashless transactions) combined. On average a backyard swimming pool worth of fresh water (over 16000 liters) goes up in smoke for every single transaction processed on the Bitcoin blockchain. This is about 6.2 million times more than the amount of water consumed for a regular credit card swipe. Many parts of the world are experiencing droughts, and fresh water is becoming an increasingly scarce resource. If we continue to use this valuable resource for making useless computations, I think that reality is really painful.”\n\nErik Kojola, Greenpeace USA Senior Researcher said, “This groundbreaking report underscores the widespread environmental impacts of Bitcoin mining. Bitcoin mining’s alarming water consumption is a stark reminder that the unbridled growth of this industry poses a direct threat to global water resources and necessitates immediate action. Furthermore, the disheartening contradiction of financial institutions, including BlackRock, Chase, Fidelity, and others, investing in Bitcoin mining despite their professed ESG goals raises serious concerns. The finance industry needs to accelerate action to address the environmental damage from its investment decisions – and it can start by engaging with us to clean up Bitcoin by transitioning away from the energy-intensive Proof-of-Work system.”\n\nMandy DeRoche, Deputy Managing Attorney at Earthjustice said, “For decades, fossil fuel power plants have been significant sources of water pollution, and energy-intensive cryptocurrency mining only prolongs this pollution. Examples like the Fortistar gas plant in North Tonawanda, New York, the Stronghold waste coal plants in Pennsylvania, and the Merom coal plant in Indiana all demonstrate the urgent need for regulatory oversight to mitigate environmental harms caused by these operations and to protect nearby communities.”\n\nAbi Buddington, member of Seneca Lake Guardian and Secretary of the Committee to Preserve the Finger Lakes said, “The Finger Lakes region, my home, faces peril from the escalating cryptomining industry, exemplified by the Greenidge Generation plant situated a mile from my property since 2020. With its massive water withdrawals from Seneca Lake and discharge into Keuka Lake Outlet, their extensive pollution, including harmful elements like arsenic and magnesium, imperils our precious ecosystem. As local New Yorkers devoted to safeguarding our natural heritage, we demand accountability for the environmental havoc caused by this industry. Seneca Lake’s splendor, and its surrounding community, deserve greater protection and respect.”\n\nJackie Sawicky of the Texas Coalition Against Cryptomining said,“Navarro County in particular, and Texas in general have serious drought issues. In the era of climate change and worsening drought, we should be exceedingly discerning with every drop of water we use. We have real industries that produce real products here and the Riot Platforms bitcoin “mine” will use more water per day than all of them. For what? To guess and throw away numbers in a digital lottery that most Texans want nothing to do with.”\n\nContact: Gujari Singh, Greenpeace USA Senior Communications Specialist, [email protected], (631) 404-9977; Ana Hall, Pythia Public, [email protected], 914-874-9288\n\nGreenpeace USA is part of a global network of independent campaigning organizations that use peaceful protest and creative communication to expose global environmental problems and promote solutions that are essential to a green and peaceful future. Greenpeace USA is committed to transforming the country’s unjust social, environmental, and economic systems from the ground up to address the climate crisis, advance racial justice, and build an economy that puts people first. Learn more at www.greenpeace.org/usa."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmRlbnRhbGVjb25vbWljcy5jb20vbW9uZXkvYXJ0aWNsZS8xNDI5OTc2NS9iaXRjb2luLWluLWRlbnRpc3RyeS10aGUtZnV0dXJlLW9mLW1vbmV50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin in dentistry: The future of money - Dental Economics",
        "content": "In an age when technological advancements are redefining every profession, dentistry isn’t untouched. Artificial intelligence (AI), digital radiography, teledentistry, and intraoral scanners are just a few examples. But beyond dentistry-specific technology, there’s a financial revolution that every dentist—in fact, every professional—should be aware of: Bitcoin.\n\nWhat is Bitcoin?\n\nBitcoin is a digital currency that operates without a central authority or single administrator. Instead, it allows users to send money directly to each other through its own peer-to-peer network. This network uses cryptography to verify transactions, which are then recorded on a public digital ledger known as a blockchain.\n\nRelated reading:\n\nFunctions of money\n\nTo understand Bitcoin, it’s important to understand money. Money serves several key functions and has some specific properties:\n\nMedium of exchange: Money facilitates transactions by providing a universally accepted asset. Bitcoin, accepted globally, fills this role, cutting across traditional banking barriers.\n\nStore of value: Money retains value over time, allowing individuals to save for the future. With its limited supply, Bitcoin can potentially be an excellent store of value, similar to gold.\n\nUnit of account: Prices of goods and services are represented in terms of money, giving it a standard metric. Bitcoin’s increasing adoption makes it a growing metric for digital transactions.\n\nProperties of money\n\nDurability: Money should withstand wear and tear. Physical currencies, such as paper bills, have a life span, while digital ones don’t degrade.\n\nPortability: Money should be easily transported. Coins and notes have been handy, but digital currency takes portability to a new dimension. Imagine trying to transport large amounts of gold!\n\nDivisibility: Money should be easily divided. Just as a dollar can be broken down into cents, one Bitcoin can be split into 100 million smaller units called satoshis.\n\nFungibility: Every unit of money should be the same as every other unit. Every Bitcoin holds the same value as every other Bitcoin.\n\nLimited supply: To maintain its value, money should be somewhat scarce. Bitcoin is capped at 21 million coins, ensuring a fixed supply. Compare this to the current monetary supply which has no upper limit.\n\nAcceptability: People must accept money for it to have value. More and more merchants and individuals accept Bitcoin.\n\nBitcoin: digital gold\n\nFor centuries, gold has been a trusted store of value. Its scarcity, luster, and nonreactivity have made it a preferred asset. But in the digital age, Bitcoin is frequently referred to as “digital gold.” Here’s why:\n\nScarcity: Just as there’s a finite amount of gold on Earth, there’s a cap on Bitcoin—21 million coins.\n\nDecentralization: Gold isn’t governed by a single entity or country, and similarly, Bitcoin operates on a decentralized network, free from governmental controls.\n\nStore of value: Historically, in times of economic uncertainty, people flock to gold to preserve wealth. Bitcoin, with its noncorrelation to traditional financial markets, offers a similar haven in the digital world.\n\nPortability: While gold is heavy and challenging to transport, Bitcoin can be sent anywhere globally with an internet connection, making cross-border transfers seamless.\n\nWhy should we care?\n\nGlobal payments: Bitcoin can make transactions quicker and often cheaper, eliminating traditional banking and conversion fees.\n\nInvestment: Diversification is the key to a balanced investment portfolio. Including digital assets like Bitcoin can potentially hedge against inflation or economic downturns.\n\nFuture preparedness: As more patients become familiar with and begin to use cryptocurrencies, offering payment options in Bitcoin can make your dental practice more inclusive and tech-forward.\n\nBitcoin, with its unique properties aligning closely with the fundamental aspects of money, is reshaping the financial landscape. While its comparison to gold offers a touchpoint to its potential as a store of value, its digital nature gives it unparalleled advantages in a connected world.\n\nFor dental professionals, understanding and embracing Bitcoin not only offers novel financial avenues, but can position a practice at the forefront of modern, patient-centric services.\n\nJust as we’ve embraced technology in treatments and patient management, it may be time to do the same with money.\n\nEditor's note: This article appeared in the November 2023 print edition of Dental Economics magazine. Dentists in North America are eligible for a complimentary print subscription. Sign up here.\n\nRyan Wilson, DDS, is a general dental practitioner with more than 20 years of experience. He graduated with a degree in biology from Alma College before attending the University of Detroit Mercy Dental School. Alongside his wife, also a dentist, he serves the Rockford, Michigan, community with dedication and clinical excellence. When he’s not practicing dentistry, Dr. Wilson enjoys outdoor activities with his wife, son, and two dogs. Contact him at [email protected]."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tcHJpY2UtbWlycm9ycy0yMDEyLWhhbHZpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin flirts with breakout, price mirrors lead-up to 2012 halving - Blockworks",
        "content": "Bitcoin is eyeing a price breakout after clearing $38,200 earlier today, reaching its highest point in 17 months.\n\nThat puts bitcoin up 130% this year, far more than almost all other top-25 cryptocurrencies.\n\nBTC only trails bitcoin cash (BCH), chainlink (LINK) and solana (SOL), which were up 133%, 163% and 508%, respectively, as of 5am ET.\n\nFor scale, bitcoin’s year-to-date gains are in line with Tesla stock and double Intel and Microsoft.\n\nChipmaker Nvidia is meanwhile up more than 230% on the back of artificial intelligence hype, which made it the ninth company in history to reach trillion-dollar market value. Crypto’s overall market cap is now close to $1.5 trillion, with bitcoin making up more than half of that total.\n\nNailing down the exact catalyst for bitcoin’s recent growth is difficult, however.\n\nClick the swatches to toggle lines on the chart\n\nThe pending suite of applications for spot bitcoin ETFs from Wall Street mega giant BlackRock and nearly a dozen other firms is one theory. “Spot bitcoin” means they’ll have to actually buy bitcoin when they issue new shares to meet investor demand, which may or may not pick up, depending on which analyst you ask.\n\nBitcoin indeed jumped by nearly a quarter — from $25,500 to $31,500 — days after BlackRock filed in June. Low liquidity led BTC to quickly drop, and by the middle of August had practically given up all those gains.\n\nBTC has popped by half since then. Almost all of that came directly after a fake news headline suggested that BlackRock’s application had been approved (it hasn’t).\n\nOne month later, a phony story about an XRP ETF briefly pumped the fifth-largest crypto by 10%. XRP immediately corrected once the news was debunked.\n\nBitcoin price is correlating with 2012 halving\n\nMarkets are clearly ready to bounce on any good news — like the upcoming halving.\n\nSometime around April 19, 2024, Bitcoin miners will suddenly earn 50% fewer coins for each block they find, dropping from 6.25 BTC ($238,000) to 3,125 BTC ($119,000).\n\nBitcoin’s next halving will be its fourth ever. To some, halvings are magic: Previous events — in 2012, 2016 and 2020 — all preceded monumental bull markets.\n\nHit the log button for a clearer view\n\nAt one year after each halving, Bitcoin had rallied:\n\n8,900% after its first halving ($12 to $1,100).\n\n285% after its second ($670 to $2,500).\n\n540% after its third ($8,700 to $55,900).\n\nBitcoin even went up in the 200 days leading up to all three occasions — so no matter how you cut it, BTC’s price has gone up around halvings.\n\nThis time around is even somewhat unique: demand could go up due to a spot ETF just as supply is slashed in half.\n\nStill, buying bitcoin around the halvings is much like buying the rumor with no intention to sell the news. The sample size is incredibly small, leaving little room for reliable analysis of how the halving in April might impact bitcoin’s price.\n\nBitcoin’s performance is so far in line with what happened before the 2012 event\n\nBitcoin miners, no doubt, hope the next halving mirrors the others. Axing issuance is expected to crush their profit margins, especially those without extremely cheap access to power (or even their own power stations).\n\nRecent estimates suggest the most efficient bitcoin miners pay $15,100 to mine each coin. That number doubles after the halving, “which would likely put the majority of the mining market into severe income stress,” according to data unit Glassnode.\n\nAll this means bitcoin had better stay above $30,000 after the next halving, which is 141 days away. So far, so good.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yZWFsbHktc3BvdC1iaXRjb2luLWV0Zi0xNDAwMDAyMTAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Do We Really Need a Spot Bitcoin ETF? - Yahoo Finance",
        "content": "The potential approval of a spot bitcoin ETF by the Securities and Exchange Commission has been one of the most talked about investing topics in 2023. Will they approve? If so, when? Will the approval be for one issuer at first, or several at once? And is the recent rise in bitcoin’s price due in large part to anticipation of a spot bitcoin exchange-traded fund approval?\n\nThese questions have many corners of the financial markets buzzing. But here’s another take on it: While the ETF industry would benefit from having a spot bitcoin ETF, and investors would finally be able to buy the cryptocurrency at nearly the spot price, are the current products so bad?\n\nThe push for ETFs to track the spot price of bitcoin, as well as other cryptocurrencies, has led the crypto industry to the brink of victory, with many expecting an approval by early next year. But when we look at the return history of existing bitcoin-related ETFs, it does make a case for leaving well enough alone.\n\nThe Case for Grayscale Bitcoin Trust\n\nThe Grayscale Bitcoin Trust (GBTC), a closed-end unit trust, is the first exchange-traded product that attempted to track the price of bitcoin. It debuted back in 2014, well ahead of most others. That early adopter move has helped it reach $23 billion in assets and trade at a daily average volume of $135 million.\n\nBut GBTC has trailed the spot price of bitcoin badly. The margin over the past 36 months has been 120% to 50%. That does not qualify as a tracking ETF to many. Yet the assets have ballooned. That one case argues for a spot bitcoin ETF to be available immediately. But wait, there’s more to the story.\n\nThe Case for Futures-Based Bitcoin ETFs\n\nA trio of lesser-known ETFs, the Proshares Bitcoin Strategy ETF (BITO), the VanEck Bitcoin Strategy ETF (XBTF) and the Valkyrie Bitcoin and Ether Strategy ETF (BTF), use futures to track the price of bitcoin. BITO has $1.4 billion in assets, but the other two combined have only about $100 million. All three have been around since at least November 16, 2021, long enough to assess how closely they correlate to spot bitcoin itself. It also includes a series of rallies and drops for bitcoin, which helps make this a stronger stress test.\n\nStory continues\n\nThe results are compelling. In that period of just over two years, BTC is down 41%. All three of the ETFs mentioned are down 39%-40%. There have been short periods of time where the ETFs have outperformed the spot price of BTC and vice versa. But all things considered, if an investor wants to own something that correlates with bitcoin’s spot price, these three have done a very good job.\n\nSpot Bitcoin ETF vs. GBTC\n\nOne of the main reasons ETFs have grown in popularity over the years is that investors know what they are getting. If an ETF aims to track an index, it tracks that index closely. So, until there is a spot bitcoin ETF, there’s no direct tracking of bitcoin. But we do currently have some ways for investors to track the intermediate term path of bitcoin closely, albeit with some tracking error along the way.\n\nInvestors have flocked to the GBTC, the bitcoin-tracking ETF that correlates to the spot price of BTC at a rate of more than 25-1 in terms of assets. GBTC has had a monster run in 2023, up about twice what spot bitcoin is, helping it make up its previous lagging performance. But no doubt there are bitcoin ETFs for investors to choose from if the goal is to get a piece of the cryptocurrency’s potential upside, whether we have a spot ETF or not.\n\n\n\n\n\nPermalink | © Copyright 2023 etf.com. All rights reserved"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWJlc3Qtbm92ZW1iZXItc2luY2UtMjAyMC1wY2UtYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin eyes best November since 2020 as PCE fails to move BTC price - Cointelegraph",
        "content": "Bitcoin (BTC) brushed off fresh United States macro data into the Nov. 30 Wall Street open as traders focused on the monthly close.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nPCE keeps Fed pivot pressure alive\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price movements sticking to a narrow intraday range below $38,000.\n\nAfter a failed breakout the day prior, hopes were high that the Federal Reserve’s “preferred” inflation metric, the Personal Consumption Expenditures (PCE) Index, would help fuel volatility.\n\nThis, however, had not come to pass at the time of writing, with November’s final Wall Street open still to come.\n\nPCE came in broadly in line with expectations — a boost for the Fed’s monetary tightening and reinforcement of declining inflation.\n\nQuerying whether interest rates might now begin to fall — the key takeaway for risk assets — financial commentary resource The Kobeissi Letter nonetheless stayed cautious.\n\n“Another sign inflation is falling but still above the Fed’s 2% target. Can the Fed really pivot now?” it queried on X (formerly Twitter) after the PCE results.\n\nKobeissi once again alluded to words from Bill Ackman, founder and CEO of hedge fund Pershing Square Capital Management, who earlier in the week predicted rate cuts beginning as soon as Q1, 2024.\n\n“It’s important to note that the effects of monetary policy lag. However, does the Fed really want to risk jumping the gun and cutting rates too soon?” it continued.\n\n“We believe calls for rate cuts in Q1 2024 are too ambitious.”\n\nFed target rate probabilities chart. Source: CME Group\n\nPCE did not manage to dent market expectations of Fed policy, with data from CME Group’s FedWatch Tool still showing almost unanimous expectations of a rate hike pause continuing next month.\n\nNovember BTC price gains near 10%\n\nFor Bitcoin market participants, however, the monthly close was of more interest.\n\nRelated: Bitcoin ETF will drive 165% BTC price gain in 2024 — Standard Chartered\n\nBTC/USD was up nearly 10% in November at the time of writing, making it the first “green” 11th month of the year since 2020. Above $37,660, the close would become its highest since May 2022.\n\nIn November 2021 and 2022, Bitcoin fell 7.1% and 16.2%, respectively, per data from statistics resource CoinGlass.\n\nBTC/USD monthly returns (screenshot). Source: CoinGlass\n\nAnalyzing the current chart setup, popular trader Jelle saw reasons to be bullish in Bitcoin’s relative strength index (RSI) readings.\n\n“After spending the past month building up a giant hidden bullish divergence, Bitcoin has breached its RSI downtrend!” he told X subscribers earlier on the day.\n\nAn accompanying chart showed the required area for bulls to secure.\n\n“If price can hold the grey box, I think this starts moving higher soon. All eyes on the monthly close,” Jelle added.\n\nBTC/USD chart with RSI. Source: Jelle/X\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS9idXNpbmVzcy8yMDIzL25vdi8yOS9jaGFybGllLW11bmdlci1hcGhvcmlzbS1iaXRjb2luLXNhZ2Utd2FycmVuLWJ1ZmZldHTSAWRodHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vYnVzaW5lc3MvMjAyMy9ub3YvMjkvY2hhcmxpZS1tdW5nZXItYXBob3Jpc20tYml0Y29pbi1zYWdlLXdhcnJlbi1idWZmZXR0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Charlie Munger: the aphorism-loving, bitcoin-hating sage behind Warren Buffett - The Guardian",
        "content": "“If people weren’t so often wrong, we wouldn’t be so rich,” Charlie Munger, the right-hand man of the billionaire stock picker Warren Buffett, once said of rival investors.\n\nIt was that humour, paired with decades of investment successes, that endeared Munger to a global business community now in mourning after news of his death at the age of 99 on Tuesday night.\n\nBest known for serving as vice-chair of the textile manufacturer turned $785bn (£619bn) investment conglomerate Berkshire Hathaway, Munger was credited with shifting Buffett’s strategy from buying up cheap, undervalued assets, towards selecting quality stocks such as Apple. The change made multibillionaires of both men.\n\nBut in his 50 years working alongside his business partner, Munger also garnered fans for his quick wit and no-holds-barred comments that led Buffett to write in 2000: “Miss Manners clearly would need to do a lot of work on Charlie.”\n\nMunger’s comedic targets were wide-ranging, spanning graduate schools that he claimed taught poor investment strategies to the US government for failing to crack down on cryptocurrencies, and bankers whom, after the 2008 financial crisis, he likened to “heroin addicts” struggling to control their habit.\n\nMunger, who married twice and had seven children, refused to entertain new accounting methods such as Ebitda, which, rather than presenting bottom-line profits, shows a business’s earnings before a series of costs: interest, taxes, depreciation, and amortisation. “I think you would understand any presentation using the word Ebitda if every time you saw that word you just substituted the phrase ‘bullshit earnings’,” he once said.\n\nHe similarly hit out at the valuation of investment products such as derivatives, which are contracts linked to the expected future price of assets like gold, oil or company stocks. “To say that derivative accounting in America is sewage is an insult to sewage,” the billionaire once quipped.\n\nBorn on New Year’s Day in 1924 to Florence and Alfred Munger, he grew up a few blocks down from Buffett in Omaha, Nebraska, but he would only meet his future business partner decades later, in 1959.\n\nMunger studied mathematics before dropping out of the University of Michigan and later joining the US army air corps. While in the military he was sent to study meteorology at the California Institute of Technology, and he later attended Harvard law school in 1948. He would go on to form the law firm Munger, Tolles & Olson in 1962, the same year he launched the hedge fund Wheeler, Munger & Co.\n\nThree years earlier, Munger, then 35, had met Buffett, then 29. The two Omahans hit it off and stayed in touch for more than two decades before finally formalising their business relationship when Munger joined Berkshire Hathaway’s board in 1978.\n\nBuffett, known as the Sage of Omaha, spoke warmly of his longtime colleague, saying in 2018 that the two “never had an argument in the entire time we’ve known each other”.\n\nHe said: “Charlie has given me the ultimate gift that a person can give to somebody else. He’s made me a better person than I would have otherwise been … He’s given me a lot of good advice over time ... I’ve lived a better life because of Charlie.”\n\nThe duo’s comedic chemistry was palpable, often drawing laughs and applause from investors who regularly made the pilgrimage to Berkshire Hathaway’s annual meeting held in the pair’s home town each May.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nMunger did not pull punches, most recently airing open disdain for artificial intelligence and cryptocurrencies. “I am personally sceptical of some of the hype that has gone into artificial intelligence. I think old-fashioned intelligence works pretty well,” he told investors at this year’s meeting.\n\nHowever, he reserved more cutting comments for traders taking a punt on crypto assets such as bitcoin, saying: “It’s like somebody else trading turds and you decide I can’t be left out.”\n\nIn 2021, he added: “I hate the bitcoin success and I don’t welcome a currency that’s useful to kidnappers and extortionists and so forth.”\n\nMunger, whom Forbes estimated to be worth $2.6bn, regularly doled out aphorisms that would be collected for books and video compilations by adoring fans. They included: “Capitalism without failure is like religion without hell”; “Without the method of learning, you’re like a one-legged man in an ass-kicking contest”; and “The best armour of old age is a well-spent life preceding it”.\n\nOf late, the billionaire was realistic about the prospects for the next generation of investors, saying: “There is so much money now in the hands of so many smart people all trying to outsmart one another. It’s a radically different world from the world we started in.”"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzI5L2Nhbi1iaXRjb2luLXJlYWNoLTEwMDAwMC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Can Bitcoin Reach $100,000? - The Motley Fool",
        "content": "Cryptocurrency is an exciting frontier that's still new. Bitcoin (BTC -3.38%) has only been around since 2009, and crypto as a whole has been relevant for just the past decade or so.\n\nSometimes, timing is everything. Two years ago, Bitcoin traded at more than $60,000. Had I asked whether the coin could climb to $100,000, you might have said it was going to the moon. Today, you might answer differently. Bitcoin has since plummeted, falling as much as 75% from its peak.\n\nNow, trading at just under $40,000... can Bitcoin reach $100,000? Here is why you should be optimistic.\n\nBitcoin's volatility is normal\n\nBitcoin has proven volatile over the years. It's suffered several drops from its high of more than 60%. Why? Bitcoin and crypto as a whole is a unique asset. Stocks represent underlying businesses, and governments assign value to fiat money. All these assets trade on markets, but Bitcoin depends solely on what buyers and sellers are willing to pay.\n\nGiven its decentralized nature, it makes sense that Bitcoin could see higher prices when markets are feeling good and lower prices when markets are afraid. In other words, the volatility is normal.\n\nThe key, of course, is where prices go over time. Bitcoin is also a unique asset because there is a finite supply. If more people use and want Bitcoin in the future, higher demand should create higher prices. This is the central investment thesis for holding Bitcoin.\n\nShedding crypto's bad actors\n\nThere are both pros and cons to a decentralized asset like cryptocurrency. Unfortunately, the lack of guardrails in the industry attracted bad actors, scammers, and criminals. This goes far beyond the occasional sketchy crypto project where the developers abandon the investors (a rug pull).\n\nThe world's top two largest cryptocurrency exchanges have been mired in controversy. Sam Bankman-Fried was recently found guilty of fraud and conspiracy. He founded and grew his cryptocurrency exchange, FTX, which collapsed during a liquidity crisis after he misappropriated customer and investor money.\n\nMeanwhile, Binance, the world's largest crypto exchange, recently settled with the U.S. government on money laundering charges. Its founder and CEO, Changpeng Zhao, has stepped down.\n\nThese are tremendous, ground-shaking events for the industry. Could one imagine what would happen if it turned out Bank of America was running a fraud and collapsed? On the other hand, this could be healthy for the crypto space in the long run. Getting the bad apples out of the basket could build trust in crypto, ultimately advancing it.\n\nCan Bitcoin reach $100,000?\n\nThere's no doubt that Bitcoin can reach $100,000, but the real question is... will it? Personally, I think it will eventually. The collapse of these huge, fraudulent crypto exchanges may seem damaging, but cleaning it up could create a healthier crypto industry.\n\nA healthier industry could help Bitcoin go to new levels because the central thesis of Bitcoin remains intact. It's an asset with a limited supply, so increased adoption of and demand for Bitcoin will naturally increase what the market is willing to pay.\n\nOf course, investors should keep their portfolios diversified across asset classes, including crypto, stocks, and bonds. If you're holding Bitcoin, don't make it a higher percentage of your total portfolio than you would any other stock. Bitcoin isn't a get-rich-quick scheme, but an emerging asset that must prove itself over the coming years."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1Mzk3L2JpdGNvaW4tbG9uZy1mdXR1cmVzLW9wZW4taW50ZXJlc3QtaGVsZC1ieS1hc3NldC1tYW5hZ2Vycy1oaXRzLWFsbC10aW1lLWhpZ2jSAXRodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNjUzOTcvYml0Y29pbi1sb25nLWZ1dHVyZXMtb3Blbi1pbnRlcmVzdC1oZWxkLWJ5LWFzc2V0LW1hbmFnZXJzLWhpdHMtYWxsLXRpbWUtaGlnaA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin long futures open interest held by asset managers hits all-time high - The Block",
        "content": "The open interest in bitcoin long futures held by asset managers on the Chicago Mercantile Exchange (CME), has reached an all-time high.\n\nOpen interest of CME bitcoin long futures by asset managers increased from $1.04 billion at the end of October, to a current value of $1.98 billion, according to The Block's Data Dashboard.\n\nThe current value of the contracts held by asset managers eclipsed the former all-time high. When bitcoin's price reached an all-time high in November 2021 of $68,000, the CME bitcoin long futures open interest held by asset managers at the time went only as high as $1.67 billion.\n\nThe uptick in open futures contracts suggests asset managers are anticipating bitcoin price appreciation by the time the current contracts expire on the last Friday of December.\n\nThe open interest from hedge funds going long on bitcoin futures on the CME is also at a high point. Currently, there's $680 million of open interest from hedge funds going long, which remains below the all-time high of $960 million.\n\nThat said, hedge funds are also responsible for the majority of open interest for short positions for bitcoin futures on the CME. Such hedge funds are responsible for more than $2 billion of open interest in this direction.\n\nRELATED INDICES See crypto indices\n\nOverall, asset managers have a net long position that's $1.97 billion in size, while hedge funds have a net short position, worth $1.36 billion, according to The Block's Data Dashboard.\n\nOn November 10, CME bitcoin futures flipped Binance’s BTC -3.49% futures markets in terms of size, showing increased demand from institutional investors. According to data from Coinglass, the total open interest on the CME for bitcoin futures is now $4.15 billion, compared to $4.08 billion on the Binance futures market.\n\nData from The Block's Data Dashboard also shows an all-time high for large open interest holders of CME bitcoin futures, for both long and short positions. The uptick in open interest for positions involving at least 25 bitcoin shows increased activity in the derivatives market by participants with large holdings. This would suggest market activity is leaning towards trades by more sophisticated, experienced investors."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LnRoZXJlZ2lzdGVyLmNvbS8yMDIzLzExLzMwL2JpdGNvaW5fbWluaW5nX3dhdGVyX2NvbnN1bXB0aW9uL9IBTGh0dHBzOi8vd3d3LnRoZXJlZ2lzdGVyLmNvbS9BTVAvMjAyMy8xMS8zMC9iaXRjb2luX21pbmluZ193YXRlcl9jb25zdW1wdGlvbi8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin's thirst for water is just as troubling as its energy appetite - The Register",
        "content": "It probably won't come as a shock to those aware of the electricity usage of the Bitcoin network, but the world's most popular cryptocurrency also uses tons of water to keep itself running.\n\nAccording to Digiconomist founder and Vrije University data science PhD candidate Alex de Vries, the Bitcoin network may be using as much as 2,237 gigaliters of water in 2023, which equates to around 590 billion US gallons, or 492 billion imperial gallons, De Vries concluded in a paper published yesterday.\n\nTo put that in perspective, let's look at just the US alone, where around a third of the world's Bitcoin mining takes place. In the course of a year, US Bitcoin mining operations chug somewhere between 39 and 120 gigaliters of water, De Vries estimates, which is equivalent to the water consumption of 300,000 US households, or a city the size of Washington DC.\n\nBitcoin mining is the process of solving cryptographic problems to validate entries on the blockchain. It's an incredibly energy intensive process incentivized by paying miners in newly minted Bitcoin; the higher the price the more miners participate, and the more energy is burned to solve a transaction.\n\nThe price of Bitcoin crashed last year, leading to a comparable drop in electricity and water consumption, but a rebound this year led to an all-time high in energy consumption in March 2023, De Vries said in his paper. March's annualized energy usage amounted to around 141.9 terawatt-hours – a 35 percent increase compared to energy usage in 2021.\n\nWith the price of Bitcoin continuing to climb over the course of 2023, \"water consumption is probably at an all-time high right now too,\" De Vries told The Register – even higher than earlier this year.\n\nMuch of the reporting on Bitcoin's environmental impact has centered on its carbon footprint and electricity usage, which De Vries has maintained a record of on Digiconomist since founding the site in 2014. Water usage has been far less reported; Cell Reports, where De Vries' paper was published, says his research is the first comprehensive look at Bitcoin's water use.\n\nTalk about Bitcoin liquidity\n\n\"The most painful thing about cryptocurrency mining is that it uses so much computational power and so much resources, but these resources are not going into creating some kind of model, like artificial intelligence, that you can then use for something else. It's just making useless computations,\" De Vries said.\n\nAgain, to put things into perspective, De Vries cites estimates from 2021, when global Bitcoin mining operations used around 1,600 GL of water, which amounts to around 16,000 liters of water per Bitcoin transaction – 6.2 million times more than the amount of water used for a single credit card swipe. Keep in mind the estimated water usage is even higher this year.\n\nWith such an environmental impact, is there anything that can be done to reduce Bitcoin's water footprint? Yes, but whether it'll happen is another thing altogether.\n\n\"What you can do technically is a completely different story from what will likely happen,\" De Vries told us, citing Ethereum's transition to proof-of-stake, a blockchain consensus mechanism that uses far less energy to validate transactions. \"It's not an exaggeration to say this could all be solved tomorrow,\" De Vries added.\n\nIt's the Bitcoin community that De Vries sees as the biggest hurdle to jump in making its digicoin of choice more environmentally friendly. \"The Bitcoin community is extremely conservative and doesn't want to change anything about Bitcoin – its mechanism, transaction cap – anything,\" De Vries said. Bitcoiners, De Vries added, see their coin as a stable store of value because it isn't prone to making such drastic changes as switching its mechanism, \"and that's a sticking point.\"\n\nDe Vries cited recent EU cryptocurrency regulations that require disclosure of environmental impact as a way to lead to greater awareness of what it costs to keep the Bitcoin blockchain running, which he notes in the paper could spell serious problems for the world amid growing water scarcity.\n\nIn Kazakhstan, which became a large source of Bitcoin mining after China banned the practice, water shortages are already becoming a crisis, with climate change-exacerbated water shortages predicted to leave the country's capital 75 GL short of water by 2030. In 2021, Kazakhstani Bitcoin mining consumed around 1,000 GL of water, De Vries said.\n\n\"There's no obvious evidence that this is a concern within the BTC community,\" De Vries told us. ®"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWhpdHMtMTgtbW9udGgtaGlnaC0xNDQwMTU5OTQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin hits 18-month high as traders bet on improving macro picture and bullish forecasts push crypto higher - Yahoo Finance",
        "content": "Bitcoin. Getty Images\n\nBitcoin climbed above $38,161 on Wednesday, its highest mark in 18 months.\n\nIn a bullish signal for investors, market expectations have ramped up for Federal Reserve interest rate cuts in 2024.\n\nStandard Chartered forecasted bitcoin could reach $100,000 by the end of next year.\n\nBitcoin rose 1% on Wednesday to reach $38,168, its highest level since April and May 2022, when prices were collapsing amid a brutal bear market.\n\nThe world's largest cryptocurrency by market capitalization has climbed more than 10% in November, supported by market expectations for the Federal Reserve to begin cutting rates in 2024.\n\nEasing monetary policy should be more a bullish tailwind for digital assets, as investors typically pull back from riskier investments when interest rates climb.\n\nIn 2023 so far, bitcoin is up about 130%, and Wall Street is bullish that more big gains are on the way.\n\nStandard Chartered said Tuesday that bitcoin is on track to hit $100,000 by the end of 2024, reiterating an earlier forecast. Meanwhile, technical analyst Katie Stockton said bitcoin could be poised for another surge in the coming weeks.\n\n\"Bitcoin would resolve its consolidation phase higher with a move above $38,000, which would act as a catalyst for a test of $42,200 resistance,\" Stockton told clients earlier this week.\n\nCrypto traders are also still hoping to see the Securities and Exchange Commission approve a spot bitcoin exchange-traded fund. Institutional players including Fidelity and BlackRock have lined up for the regulatory greenlight, while Grayscale earlier this year won a key legal battle against the SEC.\n\nAnother bullish event on the horizon is the April 2024 halving, which is when the amount of bitcoin produced via mining is cut in half.\n\nIn the 12 months following the prior three halvings in 2012, 2016, and 2020, bitcoin skyrocketed 8,069%, 284%, and 559%, respectively.\n\nRead the original article on Business Insider"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8yOS9ncmF5c2NhbGUtZ2VhcnMtdXAtZm9yLWV0Zi11cGRhdGluZy10cnVzdC1hZ3JlZW1lbnQtZm9yLXNha2Utb2Ytb3BlcmF0aW9uYWwtZWZmaWNpZW5jaWVzL9IBigFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8yOS9ncmF5c2NhbGUtZ2VhcnMtdXAtZm9yLWV0Zi11cGRhdGluZy10cnVzdC1hZ3JlZW1lbnQtZm9yLXNha2Utb2Ytb3BlcmF0aW9uYWwtZWZmaWNpZW5jaWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Grayscale Gears Up for Spot Bitcoin ETF, Updating Trust Agreement for Sake of ‘Operational Efficiencies’ - CoinDesk",
        "content": "The first allows fees – which had been collected by Grayscale on a monthly basis – to be payable daily. This is a structural tweak and not part of any type of fee reduction – something Grayscale has committed to, but which has not been finalized as of yet, a company spokeswoman said."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzMwL3dvcmxkcy1sYXJnZXN0LWJpdGNvaW4tZnV0dXJlcy1ldGYtYnJlYWtzLTIwMjEtcmVjb3JkLWhpZ2hzLWZvci1hc3NldHMtdW5kZXItbWFuYWdlbWVudC_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8zMC93b3JsZHMtbGFyZ2VzdC1iaXRjb2luLWZ1dHVyZXMtZXRmLWJyZWFrcy0yMDIxLXJlY29yZC1oaWdocy1mb3ItYXNzZXRzLXVuZGVyLW1hbmFnZW1lbnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "World's Largest Bitcoin Futures ETF Breaks 2021 Record Highs for Assets Under Management - CoinDesk",
        "content": "Unlike some other bitcoin futures ETFs, BITO closely tracks the asset's spot prices, which has likely added to its allure among traders. In June, investors poured in more than $65 million in a single week, making it the largest inflow in a year and breaking a previous 2023 high of just over $40 million in April."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9taWNyb3N0cmF0ZWd5LWJ1eXMtNjAwbS1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin for Christmas: MicroStrategy buys another $600M - Cointelegraph",
        "content": "Business intelligence firm MicroStrategy purchased 16,130 Bitcoin (BTC) in November, bringing its total holdings to more than $6 billion.\n\nIn a Nov. 30 announcement, MicroStrategy co-founder Michael Saylor said the company acquired the BTC for roughly $593.3 million — a price of $36,785 per Bitcoin. As of Nov. 29, MicroStrategy reported it held 174,530 BTC — worth roughly $6.6 billion at the time of publication — at a price of $37,726.\n\nMicroStrategy has acquired an additional 16,130 BTC for ~$593.3 million at an average price of $36,785 per #bitcoin. As of 11/29/23, @MicroStrategy now hodls 174,530 $BTC acquired for ~$5.28 billion at an average price of $30,252 per bitcoin. $MSTR https://t.co/3XHhpIvsuA — Michael Saylor⚡️ (@saylor) November 30, 2023\n\nThe business intelligence firm has consistently purchased large volumes of Bitcoin since announcing it would adopt the cryptocurrency as its treasury reserve asset in August 2020. Saylor’s last announcement was in September, reporting MicroStrategy bought 5,445 BTC for roughly $147 million.\n\nRelated: MicroStrategy’s Bitcoin stash back in profit with BTC price above $30K\n\nMicroStrategy’s Bitcoin purchase announcement followed as the cryptocurrency price rose roughly 10% in November. The firm reported a gain of $900 million for its Bitcoin holdings in the third quarter of 2023, with CEO Phong Le hinting at the time that the company would continue to make consistent purchases.\n\nMagazine: How to protect your crypto in a volatile market: Bitcoin OGs and experts weigh in"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1NDY3L21pY3Jvc3RyYXRlZ3ktYnV5cy01OTMtMy1taWxsaW9uLWluLWJpdGNvaW4tbWF5LXJhaXNlLXVwLXRvLTc1MC1taWxsaW9uLWluLW5ldy1zdG9jay1zYWxl0gGBAWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI2NTQ2Ny9taWNyb3N0cmF0ZWd5LWJ1eXMtNTkzLTMtbWlsbGlvbi1pbi1iaXRjb2luLW1heS1yYWlzZS11cC10by03NTAtbWlsbGlvbi1pbi1uZXctc3RvY2stc2FsZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "MicroStrategy buys $593.3 million in bitcoin, may raise up to $750 million in new stock sale - The Block",
        "content": "MicroStrategy, a software firm best known for its bitcoin holdings, has purchased more of the digital asset and may raise additional funds through the sale of new shares.\n\nBetween Nov. 1 and Nov. 29, it purchased an additional 16,130 bitcoin for $593.3 million, with an average price of $36,785 per token, the company said in a filing. Founder and Chairman Michael Saylor said in a post on X that the company now \"hodls\" 174,540 bitcoin that was acquired at an average price of $30,252 each.\n\nThe company said it may raise up to $750 million through the sale of new Class A common stock shares.\n\nRELATED INDICES See crypto indices\n\nBitcoin BTC -3.49% was mostly flat on Thursday, trading at $37,652 at 11:35 a.m. ET, according to The Block data. The world's largest digital asset by market capitalization is up 10% over the past month and 122.8% over the past year."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTExLTMwL2NtZS1iaXRjb2luLWZ1dHVyZXMtYWJvdW5kLW9uLWV0Zi1ob3Blcy1hbmQtYW54aWV0edIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "CME Bitcoin Futures Abound on ETF Hopes and Anxiety - Bloomberg",
        "content": "In this issue of the Bloomberg Crypto newsletter, Olga Kharif sizes up the surge in open interest for CME Bitcoin futures.\n\nWhen traders load up on derivatives, it can often be hard to know if they are preparing for good or bad news."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9qcG1vcmdhbi1wb3RlbnRpYWwtMi03LWJpbGxpb24tMTYxMTE1NjYxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "JPMorgan: Potential For $2.7 Billion In Outflows From Grayscale Bitcoin Trust (GBTC) - Yahoo Finance",
        "content": "Grayscale recently met with the Securities and Exchange Commission (SEC) to discuss its application for a spot Bitcoin exchange-traded fund (ETF). As the date for a decision on the application draws closer, many are beginning to wonder what will happen if spot Bitcoin ETFs are allowed.\n\nBecause Jan. 10 is the final day for a previously delayed decision on the Ark and 21Shares ETFs, JPMorgan has said it is also a date to watch for a potential announcement on spot Bitcoin ETFs.\n\nJPMorgan is also looking ahead to what may happen after the Grayscale Bitcoin Trust is converted into a spot Bitcoin ETF. It predicts there could be outflows totaling more than $2.7 billion because the current ETF — GBTC — is trading below net asset value (NAV).\n\nDon’t Miss:\n\nWhether you have $10 or $10,000, you can start trading crypto today.\n\nThe VC firm that backed Apple before its IPO in 1980 is focusing on AI — Here's how you can do the same with $1,000.\n\nThis is significant because if Grayscale's spot Bitcoin ETF is approved, the ETF will be converted from the current Bitcoin Trust into a spot Bitcoin ETF. If it is approved and converted, speculative traders will be able to pocket the difference between the current price and NAV.\n\n“To proxy the buying flow into [the Grayscale Bitcoin Trust] since the beginning of the year, we cumulate the daily signed dollar volume, i.e., the daily volume in thousands of shares times the price times the sign of the price change, positive if the price had increased over that day and negative if the price had decreased,” JPMorgan analysts led by Nikolaos Panigirtzoglou wrote in a report on Nov. 16.\n\nPanigirtzoglou went on to say that “this methodology produces an estimate of around $2.5 billion for the net cumulative flow into [the Grayscale Bitcoin Trust] since the beginning of the year. This number increases to close to $2.7 billion if one also adds the covering of the short interest since the beginning of the year.”\n\nStory continues\n\nTrending: All Time Best Crypto Brokers To Start Trading Right Now\n\nJPMorgan also said that the outflows could be even greater if the fees for the spot Bitcoin ETF are above the level of their competitors.\n\n\"We envisage a more intense competition with the average fee for Bitcoin ETFs converging towards that of Gold ETFs, which currently stands at around 50 basis points,\" according to the report.\n\nIf traders are indifferent between the several applications for spot Bitcoin ETFs, they will likely go to the one with the lowest fees. This could result in outflows exceeding the $2.7 billion that JPMorgan discussed.\n\nIf you are looking to buy Bitcoin before the potential spot Bitcoin ETFs go live, Kraken is the place to do so. It offers trading features for beginners and seasoned traders. Offering over 200 cryptocurrencies, it is also one of the most comprehensive platforms in the space. It is especially well-known for its security, liquidity and ease of use. You can get started today with just $10.\n\nRead Next:\n\nWith returns as high as 300%, it’s no wonder this asset is the investment choice of many billionaires. Uncover the secret.\n\nThis brokerage offers custom rewards for users to switch – the biggest reward so far for 1 user is $19,977.48. Will yours beat it?\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nThis article JPMorgan: Potential For $2.7 Billion In Outflows From Grayscale Bitcoin Trust (GBTC) originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5mb3JiZXNpbmRpYS5jb20vYXJ0aWNsZS9jcnlwdG9jdXJyZW5jeS9zdGFuZGFyZC1jaGFydGVyZWQtcmVpdGVyYXRlcy1pdHMtcHJlZGljdGlvbi1vbi1iaXRjb2lucy1wcm9qZWN0ZWQtc3VyZ2UtdG8tMTAwMDAwLWJ5LTIwMjQvOTAwNjMvMdIBmQFodHRwczovL3d3dy5mb3JiZXNpbmRpYS5jb20vYW1wL2FydGljbGUvY3J5cHRvY3VycmVuY3kvc3RhbmRhcmQtY2hhcnRlcmVkLXJlaXRlcmF0ZXMtaXRzLXByZWRpY3Rpb24tb24tYml0Y29pbnMtcHJvamVjdGVkLXN1cmdlLXRvLTEwMDAwMC1ieS0yMDI0LzkwMDYzLzE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Standard Chartered reiterates its prediction on Bitcoin's projected surge to $100,000 by 2024 - Forbes India",
        "content": "\n\n\n\nThe British multinational bank Standard Chartered has predicted that Bitcoin will reach a value of $100,000 by the end of 2024. The bank noted that Bitcoin has seen a massive resurgence this year, and the ‘crypto spring’ has already begun.\n\n\n\nThe prediction is a reiteration of the bank’s forecast in April of this year. The April report noted that the crypto winter is finally over, and several factors that could drive Bicoin’s climb to $100,000 are already at play. One such factor the report highlighted was the turmoil in the banking sector in March this year that helped to “re-establish Bitcoin’s use as a decentralised scarce digital asset.”\n\nAccording to the latest statements by the bank, the new catalyst to support the Bitcoin price rise would be the approval of spot Bitcoin exchange-traded funds (ETFs) by the United States Securities and Exchange Commission (SEC).\n\n\n\n\n\nThe Standard Chartered team and the head of crypto strategy and emerging markets FX at Standard Chartered, Geoff Kendrick, believe the ETF approvals “are likely to come sooner than expected.” “We think a number of spot ETFs will now be approved in Q1 2024 for both BTC and ETH, paving the way for institutional investment,” they said.\n\n\n\n\n\nThe team also claimed that the upcoming Bitcoin halving event in 2024 will be another source for the price surge. They believe so because past Bitcoin halving events were almost always followed by a crypto bull run.\n\n\n\n\n\nBitcoin halving is an event where rewards for mining new bitcoins are cut in half roughly every four years. This event is designed to reduce the rate at which new bitcoins are created through mining. With a finite supply of only 21 million coins, Bitcoin halvings help control the supply of Bitcoin.\n\n\n\n\n\nStandard Chartered’s Bitcoin price surge prediction has already been reinforced, with Bitcoin soaring 130 percent in 2023. “Put simply, everything is working as expected,” the bank said. “BTC’s dominance remains intact – its share of overall digital assets market cap has increased to 50 percent from 45 percent in April.”\n\n\n\n\n\nThe bank also suggested that there is a chance for Bitcoin to climb the $100,000 mark before the end of the year. They said, “We now expect more price upside to materialise before the halving than we previously did, specifically via the earlier-than-expected introduction of the US spot ETFs. This suggests a risk that the USD 100,000 level could be reached before the end of 2024.”\n\n\n\n\n\nThe bank’s prediction has already been reinforced by Bitcoin’s strong performance this year. Whether the prediction will genuinely be realised can only be seen when the time comes.\n\n\n\n\n\nThe writer is the founder at yMedia. He ventured into crypto in 2013 and is an ETH maximalist. Twitter: @bhardwajshash"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vYml0Y29pbi1kZXJpdmF0aXZlcy10cmFkZXJzLWFyZS1vbi10aGUtbW92ZS1pcy00MGstdGhlaXItbmV4dC10YXJnZXQv0gFjaHR0cHM6Ly9lbmcuYW1iY3J5cHRvLmNvbS9iaXRjb2luLWRlcml2YXRpdmVzLXRyYWRlcnMtYXJlLW9uLXRoZS1tb3ZlLWlzLTQway10aGVpci1uZXh0LXRhcmdldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin derivatives traders are on the move – Is $40K their next target? - AMBCrypto English",
        "content": "Derivatives traders were attempting a breakout from the $37,000-$38,000 region.\n\nThe OI in BTC futures on CME surpassed that of Binance in November.\n\nBitcoin [BTC] gained back its bullish strength in the last 24 hours, rising by 2.47% to revisit the $38,000-mark, AMBCrypto learned using CoinMarketCap’s data.\n\nProfit-taking by weak hands dragged the king coin back to $37,912 as of press time, but odds of a breakout were getting stronger.\n\nBitcoin derivatives traders in action\n\nThe price rise was matched by a spike in speculative bets taken for the world’s largest cryptocurrency.\n\nThe Open Interest (OI) in BTC futures and perpetual futures contracts rose by 4.22% over the last 24 hours, Coinalyze data accessed by AMBCrypto showed.\n\nTypically, a rise in Open Interest coming alongside a rise in price indicates growing bullish sentiment. Popular on-chain analyst Maartunn echoed similar thoughts in a post on X, adding that derivatives traders were attempting a breakout from the $37,000-$38,000 region.\n\nThe speculative interest wasn’t just restricted to retail traders. The OI in BTC futures on global derivatives giant Chicago Mercantile Exchange (CME) bounced nearly 21% in November, as per crypto market data provider CCData.\n\nWith the latest flourish, CME surpassed Binance to become the largest Bitcoin futures exchange.\n\nCME’s standard Bitcoin futures contract is worth five BTC and is a barometer of institutional interest in digital assets. Needless to say, the expectation of a spot Bitcoin ETF approval was catalyzing the growth.\n\nWhales make a splash\n\nGrowing institutional interest was also reflected in the steady increase in the number of BTC whales. According to AMBCrypto’s examination of Glassnode’s data, addresses having at least $1,000 worth of coins increased by 11% since the rally began in mid-October.\n\nWhales, who usually trade in large blocks of assets, exert significant influence on the price movements. The strong buying pressure was therefore a bullish driver for BTC.\n\nIs your portfolio green? Check out the BTC Profit Calculator\n\nWhales’ optimism on BTC was also seen in the long positions taken by them. According to Hyblock Capital’s Whale vs Retail Delta indicator, whales had higher long exposure than the retail investors at press time.\n\nIn fact, AMBCrypto observed a similar pattern in most of the trading days since the rally began. This was a clear endorsement for Bitcoin from whales."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTEvMzAvbWlrZS1ub3ZvZ3JhdHotZ2FsYXh5LWRpZ2l0YWwtYml0Y29pbi1hbGwtdGltZS1oaWdoLXNwb3QtZXRmcy_SAWhodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzExLzMwL21pa2Utbm92b2dyYXR6LWdhbGF4eS1kaWdpdGFsLWJpdGNvaW4tYWxsLXRpbWUtaGlnaC1zcG90LWV0ZnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Galaxy Digital CEO Mike Novogratz says Bitcoin will rebound to its all-time high by next year in wake of ETF approvals - Fortune",
        "content": "Billionaire crypto investor and Galaxy Digital CEO Mike Novogratz is betting that by this time next year Bitcoin will be back at its highest levels ever.\n\nAnalysts at Bloomberg predict that the first U.S. spot Bitcoin ETF could be approved by Jan. 10, and Novogratz said that could drive billions of dollars into the sector, causing Bitcoin to skyrocket.\n\n“Could we go to old highs by this time next year?” Novogratz said during a Bloomberg TV interview on Wednesday. “Of course.”\n\nBitcoin has been on a tear since September, shooting up 45%, to about $37,600, as of Wednesday, but the coin is still down from its all-time high of $69,000. Bitcoin reached that peak in November 2021 before falling below $16,000 a year later, according to data compiled by CoinGecko.\n\nNovogratz said making it easier to invest in cryptocurrencies via ETFs will help attract a fresh set of retail investors. Galaxy Digital is working with the investment management company Invesco to introduce a spot Bitcoin ETF.\n\n“Prices are set on the margin, so that’s all new money,” Novogratz said. “We will see a pretty successful shift of psychology when the government says you are allowed to buy Bitcoin.”\n\nThe SEC has still not approved a spot Bitcoin ETF in the U.S. and has continually delayed making a decision on several applications. Earlier this year, the agency faced a setback on a lawsuit against crypto asset manager Grayscale regarding its application to create a spot Bitcoin ETF. The regulator chose not to appeal the ruling.\n\nStill, other high-profile leaders in traditional finance and the crypto space have recently renewed their optimism that Bitcoin will have a resurgence.\n\nOn Thursday, MicroStrategy founder Michael Saylor wrote in a post on X that the company had purchased an additional $593.3 million worth of Bitcoin at an average price of $36,785. MicroStrategy has now spent more than $5 billion on Bitcoin since 2020.\n\nMicroStrategy has acquired an additional 16,130 BTC for ~$593.3 million at an average price of $36,785 per #bitcoin. As of 11/29/23, @MicroStrategy now hodls 174,530 $BTC acquired for ~$5.28 billion at an average price of $30,252 per bitcoin. $MSTR https://t.co/3XHhpIvsuA — Michael Saylor⚡️ (@saylor) November 30, 2023\n\nIn the traditional financial world, BlackRock’s Larry Fink has also compared Bitcoin to digital gold and called it an “international asset.” His comments pushed the coin to a 14-month high in July."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9iaXRjb2luLXJlYWNoaW5nLWRvbGxhcjEwMGstYnktZW5kLW9mLTIwMjQtbm90LW91dC1vZi10aGUtcmVhbG0tdGFjdGl2ZS13ZWFsdGgtYWR2aXNvci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Reaching $100K By End of 2024 'Not Out of the Realm': Tactive Wealth Advisor - CoinDesk",
        "content": "It seemed like it was only yesterday that Bitcoin was trading at $36,000 in change. Oh, wait, that's right because it was almost, yeah, it was just yesterday now. It's over 38,000. Why is that? Is it a little bit of dovishness? Let's find out joining us now to discuss the crypto markets is tact of wealth Advisor Eddie Gifford. Welcome back, Eddie. Hey guys, thanks for having me. Glad to see you again. So, uh 38,000 here, a little bit of bullishness. A lot of bit of bullishness. Why I, I would almost think that it has something to do more with, uh, the, the potential for some, I don't know, easy money flowing around and sloshing around that market more so than even the ETF, what do you think? Yeah. You know, anytime that the fed hints at rate cuts in general, what that's doing, that's, that's unleashing liquidity into the system. And when that happens, we see risk assets tend to just creep up or even explode to the upside and, and uh, we're seeing a little bit of that in Bitcoin. We're also seeing uh a lot of that in some of the alt coins. Uh, the, the, the interesting thing about it though is I've been watching it, especially over the last week is that on the days that the markets are up, Bitcoin is, uh, tended to be flat, but on the days where the markets are flat and we see gold kind of pushing up. We're seeing Bitcoin go up, just go up by more. So I'm looking at this as kind of like a double edged sword. This could be like, hey, Liquidity is awesome. Let's let's go get some Bitcoin because uh you know, that's gonna push the value up. But then at the same time, uh the way it's kind of mimicking the behavior of gold, it makes me wonder is this kind of a warning of like, hey, maybe Bitcoin is now the safe haven trade, at least for the under forties, right? So, uh we, we're definitely watching this very closely. II I have no doubt that if we're looking at like salon or avalanche or link that uh that's, that's just pure uh speculation or just looking straight for growth. But Bitcoin, I'm not so sure anymore. I think Bitcoin might be establishing itself more as kind of like a reserve uh type scenario. It's just a reserve scenario that can double in a year like this. So uh it's not a bad spot to be, that's for sure. Well, we, we, we'll get to those results in a second. But, uh, kind of about the macro situation and you mentioned the idea that, uh, uh Bitcoin is serving as digital gold for, for folks who were, uh, uh, you know, born a little too late for, um, you know, uh listening to the Arris. So, um, I generally, uh, do you think that it's a situation that the, the, what Bill Ackman is saying now? And, and Chris Waller is, as we just discussed the fed governor saying that, oh, you know what, maybe, maybe the, this whole rate hike thing is, is just about done. Uh Or do you think that perhaps that the other fed governors might have it in them to say? Yeah, let's give it a couple of more here. Uh We, you know, we saw some issues now with selling bonds uh in, in the market, uh the, the, the, the treasury trying to sell bonds and having a tough time finding buyers that of course, brings up interest rates because fewer buyers of bonds means that the yields go up. It does this, uh do we have more rate hikes ahead or, or do the doves have it? Uh Have you have the upper hand here? I don't think we have more rate hikes ahead unless we see some real surprise to the upside with inflation. I mean, gas has fallen like 60 days straight. So we've seen inflation come down. Uh Of course, that's relative because it's still higher than uh prices are still higher than they were a year ago. But, uh, the rate has slowed. Uh, so I, I don't necessarily see any hikes. Uh, do I expect a cut, you know, in the next month? No, II, I think that they're gonna try to hold steady for as long as they can. The fact that they're even mentioning potential cuts or the fact that everybody is, is calling for cuts. A lot of those people are, are, are, are like the big guys and, and you know what that tells me is they're seeing something that they think is broken in the system because usually you don't get cuts until something's until something breaks. It's, it's very, very rare. I don't think it's actually, I don't think it's ever happened where the fed is actually cut before something bad happens. So, uh, that's kind of the thing that we're concerned about is, hey, wait, there's certain top cuts but where markets are near all time highs, like what's, what's gonna give here, what's, what's going on? And, and so, um, I think that the, the, the doves are, are there because they're scared of something and, and, uh, I don't know what that is but, uh, usually it has something to do with the credit event. So, uh, we'll see how that shakes out. Let's, let's turn now to some of those ALTs. I know you're watching Soul Avax and Link. There's been some interesting movement with all three of those alt coins in the last little while. What are you seeing? Well, we just really pay attention to trend strength and the amount of momentum behind the coins when we're looking at, at this, we, we've, we, we, we still primarily trade uh rather than own when it comes to all coins. And so what we're seeing is, uh we, we, we've seen a lot of going on behind Seoul for a long time. Uh We just saw avalanche overtake link uh last night actually and executed a buy signal. And so, you know, if we've learned anything this year from anything, it's that take the stuff with the wind behind it. I mean, that doesn't mean if we're, it doesn't matter if we're talking about Bitcoin, if we're talking about alt coins, if we're talking about NVIDIA, if we're talking about A I, all these things that couldn't possibly go higher because they were, they were so high, you know, shot to, to new highs like uh and, and not just a little bit a lot. Uh So what we've been trying to focus on is finding, hey, where's the money flowing? How, how strong the trend, how strong is the trend behind it? And let's, you know, it's OK to get in and, and write it up a little bit further uh and just be disciplined with your trading strategy. Speaking of things, shooting to new highs, you know, we love a good prediction on this Show and Standard Chartered recently said that they believe Bitcoin could hit $100,000 by the end of 2024. What do you think? Do you think that could happen? I don't think it's out of the realm, especially if we end up getting the approval in the first quarter for the spot. ETF, which just so happens to coincide with the having. Uh and then, you know, we've already seen it. There's a lot of uh uh uh there's a lot higher adoption now. It's so funny. I have like reviews with clients and I'm like, ok, so let's just take an inventory of this stuff that, that uh maybe you've accumulated and everybody seems to have some Bitcoin now and I'm like, I never thought you would own Bitcoin. But, ok. No, that's great. Uh You know, the, the, the only thing that could really like derail that is if something does break next year, if we do see some type of Black Swan crash type event, I think other than that, if things kind of continue on the trajectory that they are, uh you know, 80 to 100,000 is definitely not unreasonable by the end of next year. Some economists have been calling for that Black Swan event. Do you think we're going to see one next year? It sounds like maybe there's definitely cracks under the surface. I think that, you know what the, what the administration has shown us though? Is, they're really good at kicking the can down the road. So, ideally, I think if something breaks, they want it to break after the new guy gets in. Uh, so, so after the election, uh, whether it's a new guy or the same guy or whatever, but they want it, they, they wanna blame it on whoever is in next. They don't want it to, they don't want it to have to do anything with what's happened over the last four years. So, uh so, uh I think that that they're gonna do everything in their power to make sure that if anything happens, it happens after the fact. Now the reality is sometimes these waves just swell up so big and they just destroy everything no matter what, even if, even if they are trying to kick it down the road, uh we're not seeing, uh we're not, we're not seeing anything breaking yet but the cracks on the service are there. The consumer is stretched that there's still a lot of demand, but a lot of that is going on the on the credit card and you know, when you have higher interest rates and the higher credit card balances and higher auto payments and higher mortgage payments like that stuff stacks and it makes it harder and harder to pay your bills. So we could be developing into some type of waterfall event that you know is gonna be like, oh, it was so easy to see in hindsight, but um I don't know when it's gonna happen, but I definitely think that it is gonna happen, unfortunately. All right, Eddie, we are gonna have to leave it there. Thank you very much for joining us this morning. Always a pleasure hearing your insights. Appreciate it. Thank you. That was Tact of Wealth Advisor, Eddie Gifford."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9qYWNrLWRvcnNleS1yYWlzZS1kZWNlbnRyYWxpemXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Jack Dorsey wants to decentralize Bitcoin mining with new investment - Cointelegraph",
        "content": "Twitter (now X) co-founder and Bitcoin (BTC) advocate Jack Dorsey is backing a new BTC mining pool to help miners regain control of block rewards and transaction fees.\n\nDorsey has led a $6.2 million seed round for Mummolin, the parent company of the new decentralization Bitcoin mining pool called Ocean, according to an announcement on Nov. 29.\n\nThe seed funding will support the launch of Ocean, which is designed to decentralize and reshape the process of Bitcoin mining. The mining pool specifically aims to provide more mining process transparency and enable miners to receive block rewards directly from Bitcoin rather than from BTC mining pools.\n\nIan Northon, co-founder and chief legal officer at Mummolin, told Cointelegraph that the raised money will be used for general corporate purposes. “Our cap table is private, but we are proud to have several OG Bitcoiners and other Bitcoin thought leaders back the project,” Northon said, adding:\n\n“Our payout system TIDES is an abbreviation for Transparent Index of Distinct Extended Shares, which we believe is an upgrade and improvement on PPLNS and vastly better than FPPS, especially over miner's transaction fee revenue.”\n\nLuke Dashjr, Mummolin co-founder and long-time Bitcoin Core developer, believes that the role of mining pools must change for Bitcoin to exist as a truly decentralized currency.\n\n“Ocean is a new type of pool that enables miners to be truly miners again. We are launching as the most transparent pool and also the only noncustodial pool where miners are the recipients of new block rewards directly from Bitcoin,” Dashjr stated.\n\nRelated: Bitcoin user pays $3.1M transaction fee for 139 BTC transfer\n\nMummolin co-founder and president Mark Artymko stressed that traditional BTC mining pools take exclusive custody of block rewards and transaction fees before distributing them among miners. “This gives them the ability to withhold payment from individual miners, whether by their own choice or by legal requirement,” Artymko said, adding:\n\n“OCEAN’s non-custodial payouts directly to miners from the block reward remove this risk and the pool’s undue influence over miners.”\n\nCommitted Ocean supporter Dorsey is confident that the platform will solve the problem of further centralization of pools and mining pools that could plague Bitcoin. He noted:\n\n“When I see a project that is good for Bitcoin broadly, and that’s also good for me and my companies personally, it becomes a simple decision for me and I’m happy to be a part of it.”\n\nThe launch of Ocean was announced at the Future of Bitcoin Mining Conference in the shadows of Barefoot Mining’s 150-year-old hydroelectric dam in rural South Carolina. Barefoot Mining, the first client of Ocean, has fully repurposed the dam, converting excess energy to Bitcoin mining at scale.\n\nOcean’s launch is 139 days before Bitcoin’s fourth halving event, which is expected on April 17, 2024. After the halving, the current 6.25 BTC mining reward per block will drop to 3.125 BTC, significantly decreasing incentives for Bitcoin miners.\n\nMagazine: Real AI use cases in crypto, No. 2: AIs can run DAOs"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8td2ludGVyLXRoYXdzLXRoZS1kYXduLW9mLWJpdGNvaW4tZXRmcy1sZWQtYnktYmxhY2tyb2NrL2FydGljbGVzaG93LzEwNTU4MTI0Mi5jbXPSAY4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXdpbnRlci10aGF3cy10aGUtZGF3bi1vZi1iaXRjb2luLWV0ZnMtbGVkLWJ5LWJsYWNrcm9jay9hbXBfYXJ0aWNsZXNob3cvMTA1NTgxMjQyLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Crypto Winter Thaws: The dawn of Bitcoin ETFs led by BlackRock - The Economic Times",
        "content": "(What's moving Sensex and Nifty Track latest market news stock tips and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nDownload The Economic Times News App to get Daily Market Updates & Live Business News.\n\nSubscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzMwL2JpdGNvaW4tZ29pbmctZnJvbS1ib2lsaW5nLXRoZS1vY2VhbnMtdG8tZHJhaW5pbmctdGhlbS1hY2NvcmRpbmctdG8tY3JpdGljL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzMwL2JpdGNvaW4tZ29pbmctZnJvbS1ib2lsaW5nLXRoZS1vY2VhbnMtdG8tZHJhaW5pbmctdGhlbS1hY2NvcmRpbmctdG8tY3JpdGljL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Going From Boiling the Oceans to Draining Them, According to Critic - CoinDesk",
        "content": "Bitcoin Going From Boiling the Oceans to Draining Them, According to Critic\n\nA data scientist for the Dutch National Bank, Alex De Vries, claims every bitcoin transaction uses enough water to fill a swimming pool.\n\nBy Jamie Crawley Nov 30, 2023 at 8:03 p.m. UTC"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1NDA4L3RydXN0LXdhbGxldC1iaXRjb2luLXRyYW5zYWN0aW9uc9IBSWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI2NTQwOC90cnVzdC13YWxsZXQtYml0Y29pbi10cmFuc2FjdGlvbnM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Trust Wallet says Bitcoin node issue is causing missing, failed transactions - The Block",
        "content": "Binance-owned Trust Wallet has reported experiencing a Bitcoin node issue, leading to users experiencing failed or delayed transactions and missing transactional history in the wallet app.\n\nThe non-custodial wallet provider attributed the issue to a recent surge in Bitcoin transactions. “Increased transactions per block in the Bitcoin network are putting pressure on nodes, causing instability across providers,” the team posted on X.\n\nTrust Wallet said it was closely monitoring the situation, but “users may experience missing transaction history for the Bitcoin-blockbook chain, up to six hours, and failed transactions.” Bitcoin Blockbook, initially developed to support Trezor wallets, is a blockchain indexer and backend solution for cryptocurrency wallets, enabling efficient queries for specific information, like transaction history or wallet balances.\n\nIn response to the post, some users complained the issue had already been ongoing for several hours. Trust Wallet said it was working diligently to address the issue. However, there had been no update since yesterday at the time of publication.\n\nTrust Wallet later updated users on the issue, stating it had implemented a fix. \"We found that an address with extremely high volumes and frequency caused issues when interacting with our system,\" Trust Wallet said, assuring users all funds were and continue to be safe.\n\nBitcoin transactions on the rise\n\nThe seven-day moving average of transactions on the Bitcoin network reached a record high of over 600,000 this week, according to The Block’s data dashboard.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nThe rise is mainly attributed to the latest surge in Bitcoin Ordinals inscriptions, frequently hitting 300,000 to 400,000 daily transactions over the last week, according to a Dune Analytics dashboard.\n\nAverage Bitcoin transaction fees also recently spiked to around $14 amid the surge, far higher than the usual $1 to $2 range but significantly less than the record average fees of over $50 in April 2021.\n\nUpdated with Trust Wallet's response."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmLWphbnVhcnktYXBwcm92YWxzLXBvc3NpYmxlLWFuYWx5c3Rz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "'Clear runway' opens for all Bitcoin ETF approvals in Jan — Analysts - Cointelegraph",
        "content": "Bitcoin (BTC) spot exchange-traded funds (ETFs) in the United States now have a “clear runway” to potential simultaneous approvals after an advanced decision to delay the bids of Franklin Templeton and Hashdex ETFs, according to analysts.\n\nIn a Nov. 28 X (formerly Twitter) post, Bloomberg ETF analyst James Seyffart said the United States Securities and Exchange Commission (SEC) delayed its decision on the applications 34 days earlier than the Jan. 1, 2024, decision deadline.\n\nThe SEC requested comments on forms by Franklin Templeton and Hashdex that are necessary for the ETFs to eventually be listed and start trading. The comment and rebuttal period will last 35 days.\n\nSeyffart and his colleague Eric Balchunas had placed 90% odds on spot Bitcoin ETF approvals by Jan. 10, 2024, and the twin delays “all but confirms for me that this was likely a move to line every applicant up for potential approval by the Jan 10, 2024 deadline,” Seyffart said.\n\nBalchunas agreed, posting to X that the SEC was “prob looking to get them out of the way, clear runway.”\n\nProb looking to get them out of the way, clear runway — Eric Balchunas (@EricBalchunas) November 28, 2023\n\nCommercial litigator Joe Carlasare thinks the delays increase the probability of a March 2024 approval, as the comment period for Franklin’s ETF bid was extended until Jan. 3, 2024, and the SEC typically takes a maximum of three weeks to review comments.\n\nThe Franklin BItcoin spot ETF comment period now extends until January 3rd.\n\n\n\nThe SEC typically reviews comments for at least 2-3 weeks. Therefore, although it’s not guaranteed, this increases the probability of a March approval.\n\n\n\nJanuary is still likely the favorite though. — Joe Carlasare (@JoeCarlasare) November 28, 2023\n\n“January is still likely the favorite though,” he added, later estimating it to happen on Jan. 5 or Jan. 8.\n\nRelated: Futures will be the best crypto game in town even after a Bitcoin spot ETF\n\nOn Nov. 28, Franklin also submitted an updated Form S-1 for its ETF — a document registering securities with the SEC — after Seyffart had earlier highlighted that it was the only bidder yet to submit an updated prospectus.\n\nReacting to the filing, Balchunas said while he’s in favor of letting all ETFs launch simultaneously, it “seems kinda unfair” that Franklin might be allowed to launch its ETF the same day as other providers despite submitting the form months later.\n\nWhile I'm generally in favor in letting them launch at same time, Franklin jumped in sooo late vs others, like 5mo after ARK filed and yet they may be able to launch the same day.. seems kinda unfair... but i suppose SEC can't really draw any lines here — Eric Balchunas (@EricBalchunas) November 28, 2023\n\nThere are currently 12 spot Bitcoin ETFs before the SEC, including bids from Grayscale and BlackRock. Most have final decision dates in March, besides ARK Invest’s bid, which the SEC must approve or deny by Jan. 10, 2024.\n\nMagazine: Beyond crypto — Zero-knowledge proofs show potential from voting to finance"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzI5L2phY2stZG9yc2V5LWFpbXMtdG8tY3JlYXRlLWFudGktY2Vuc29yc2hpcC1iaXRjb2luLW1pbmluZy1wb29sLXdpdGgtbmV3LXN0YXJ0dXAv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzI5L2phY2stZG9yc2V5LWFpbXMtdG8tY3JlYXRlLWFudGktY2Vuc29yc2hpcC1iaXRjb2luLW1pbmluZy1wb29sLXdpdGgtbmV3LXN0YXJ0dXAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Jack Dorsey Aims to Create Anti-Censorship Bitcoin Mining Pool With New Startup - CoinDesk",
        "content": "The capital will support the start of a decentralized mining pool - OCEAN. The new non-custodial pool will be the first of its kind as it will pay the miners their block rewards directly, without meddling by a centralized entity, unlike some of the existing pools, according to a statement."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0Zi0xNjUtYnRjLXByaWNlLWdhaW4tMjAyNC1zdGFuZGFyZC1jaGFydGVyZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin ETF will drive 165% BTC price gain in 2024 — Standard Chartered - Cointelegraph",
        "content": "Bitcoin (BTC) may hit $100,000 in one year’s time thanks to “earlier than expected” exchange-traded funds (ETF) launching, says Standard Chartered.\n\nIn a research note issued on Nov. 28 quoted by sources including Business Insider, the banking giant doubled down on its bullish BTC price targets.\n\nStandard Chartered still expects six-figure BTC price\n\nBitcoin is in line to trade at six figures by the end of 2024, the latest forecast from Standard Chartered concludes.\n\nThanks to the United States potentially approving Bitcoin spot price ETFs, BTC/USD has the ability to almost treble from its current $37,700 over the coming 12 months.\n\n“We now expect more price upside to materialize before the halving than we previously did, specifically via the earlier-than-expected introduction of US spot ETFs,” Geoff Kenrick, Standard Chartered’s head of EM FX Research, West and Crypto Research, wrote.\n\n“This suggests a risk that the USD 100,000 level could be reached before end-2024.”\n\nThe figure continues the consumer banking giant’s already optimistic vision of how Bitcoin will grow in the coming years.\n\nIn July, research eyed the declining availability of the BTC supply as a reason to believe that much higher prices were in store. Specifically, Kenrick said at the time that $50,000 was on the cards by the end of 2023.\n\nHe also suggested that miners would begin hoarding more of their own BTC stocks amid increasing hash rate and the upcoming block subsidy halving decreasing BTC earned per block by 50%.\n\n“Increased miner profitability per BTC (bitcoin) mined means they can sell less while maintaining cash inflows, reducing net BTC supply and pushing BTC prices higher,” he summarized.\n\nSpot Bitcoin ETF: Counting down the weeks\n\nThe ETF narrative is firmly in the spotlight this month as derivatives premiums shoot higher and buzz around a potential approval in January heightens.\n\nRelated: Spot Bitcoin ETF: Why this time is different\n\nBTC price trajectory has been sensitive to related news. Earlier in November, the market gained rapidly over anticipation of a possible approval coming from U.S. regulators before the January window.\n\nSpot Bitcoin ETF application data. Source: James Seyffart/X\n\nAt the same time, concerns linger over large-volume investors selling off once the greenlight appears — in what would constitute a “buy the rumor, sell the news” event, which could leave latecomers at a loss.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5ud2l0aW1lcy5jb20vYnJhbmRhdmVzdHVkaW9zL2Rpc3NlY3RpbmctYml0Y29pbnMtcHJpY2UtZmx1Y3R1YXRpb25zLWtleS1mYWN0b3JzLWV4cGxvcmVkL2FydGljbGVfMjY4NmJhOGItZGY2OC01NTRiLTlkMzctYTVkYzI5OWIzYzIwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Dissecting Bitcoin's price fluctuations: Key factors explored - The Times of Northwest Indiana",
        "content": "Bitcoin is the world's most popular cryptocurrency, and it has seen a wave of price fluctuations over the years. At times, Bitcoin's value has soared to unprecedented heights. However, it has also seen significant drops in value, leaving investors cautious and wondering about the critical factors behind these fluctuations. Throughout this article, we will explore these Bitcoin price fluctuations in detail, providing investors in Indiana and beyond a better understanding of what makes the cryptocurrency tick.\n\nAnalyzing Bitcoin's market sentiment\n\nMarket sentiment is one of the driving forces behind Bitcoin price fluctuations. For example, when investors are optimistic about Bitcoin and the cryptocurrency market, the Bitcoin price in USD tends to increase in value. On the other hand, when there is negative market sentiment from investors or the public, the cost of Bitcoin tends to fall. But what factors influence market sentiment? News reports, social media posts from prominent figures, market trends, and regulatory changes can affect cryptocurrency.\n\nDecoding Bitcoin's regulatory shifts\n\nGovernment's outlook on cryptocurrencies is an ever-changing landscape, with countries worldwide having opposing views on digital currencies, and this can have massive implications on the price fluctuations of Bitcoin. For example, in 2021, China banned cryptocurrency trading and mining, leading to a drop in Bitcoin's price; this stance has been kept up in 2023 with Beijing-based social media app Weibo removing 80 popular crypto influencers from its platform. However, other countries have a more positive outlook on Bitcoin and cryptocurrencies. For example, El Salvador became the first country to recognize Bitcoin as a legal tender, driving its price up.\n\nBitcoin's vulnerability to market manipulation\n\nBitcoin and the cryptocurrency market to which it belongs are vulnerable to market manipulation. For example, some investors and traders use tactics like pump and dumps and spoofing and wash trading schemes to manipulate the price of Bitcoin and other cryptocurrencies. Unfortunately, this can lead to sudden drops and spikes in Bitcoin's price, harming the general opinion of cryptocurrencies and Bitcoin.\n\nUnderstanding Bitcoin's market rivals\n\nAnother critical factor to discuss and understand when exploring Bitcoin's price fluctuations is its competition from other cryptocurrencies. For example, Bitcoin faces stiff competition from other emerging cryptocurrencies like Ethereum, Binance Coin, and Cardano, which offer different benefits and features. This can lead to investors choosing other cryptocurrencies over Bitcoin as their sole market investments, leading to Bitcoin's price decline.\n\nEconomic drivers in Bitcoin's market\n\nBitcoin's price fluctuations are also affected by the economy as a whole in the United States. For example, inflation and global economic conditions like recessions and interest rates can all affect Bitcoin's price. These factors can make investors change their focus to markets that are more traditional and other investments, hurting Bitcoin's price. Nevertheless, Bitcoin did see a remarkable rise in its price during 2020, when there was a global pandemic, US-China tensions, and Brexit in the United Kingdom. These are all factors that would usually make investors wary.\n\nEnvironmental concerns in Bitcoin mining\n\nFurthermore, concerns have been raised over the energy consumed during Bitcoin mining and its environmental impact. For example, environmental groups such as Greenpeace have called out financial management and payment process companies that have ventured into Bitcoin mining. This has led to more people opting out of investing in Bitcoin due to their ecological beliefs and the scrutiny they may face for supporting it, which, in turn, has led to a decline in Bitcoin's price.\n\nSummarizing Bitcoin's price fluctuations\n\nIn conclusion, Bitcoin's price is affected by environmental concerns in Bitcoin mining, economic drivers like inflation, cryptocurrency market rivals, market manipulation, regulatory shifts from governments, and market sentiment. This makes it crucial for investors to watch the latest news reports and trends regarding cryptocurrencies and Bitcoin to make more informed investment decisions.\n\nInformation is intended for educational purposes only and is not to be used as investment advice. As with all investments, there is risk and the past performance of a particular asset class does not guarantee any future performance.\n\nThis provided content was produced by Lee Enterprises. The news and editorial departments had no role in its creation or display."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1MTIwL2phY2stZG9yc2V5LXNlZWQtcm91bmQtZGVjZW50cmFsaXplZC1iaXRjb2luLW1pbmluZy1wb29sLW9jZWFu0gFmaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjY1MTIwL2phY2stZG9yc2V5LXNlZWQtcm91bmQtZGVjZW50cmFsaXplZC1iaXRjb2luLW1pbmluZy1wb29sLW9jZWFu?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Jack Dorsey leads $6.2 million seed round for Bitcoin mining pool OCEAN - The Block",
        "content": "Mummolin, Inc. has raised a $6.2 million seed funding round led by Block CEO Jack Dorsey to support the launch of OCEAN — a decentralized Bitcoin mining pool — and other mining decentralization projects.\n\nAccomplice, Barefoot Bitcoin Fund, MoonKite, NewLayer Capital and the Bitcoin Opportunity Fund also participated in the round, according to a statement.\n\nOCEAN announced the raise at the Future of Bitcoin Mining Conference yesterday, set against the backdrop of a 150-year-old repurposed hydroelectric dam in rural South Carolina, which utilizes excess energy for Bitcoin mining.\n\nOCEAN aims to help miners regain autonomy and decision-making power over more complex processes in mining operations, and is designed to be non-custodial, transparent and permissionless.\n\n\"The intention is to disintermediate to the greatest extent possible. Pools have become trusted third parties whose permission we have required for activating soft forks and deciding what gets into the blockchain in addition to taking custody of all newly generated coins,\" OCEAN's Global Head of Sales, pseudonymous Bitcoin Mechanic, said. \"By offering transparency and a mechanism for miners to be paid directly by Bitcoin itself, we make the network radically more robust.\"\n\nSolving Bitcoin mining pool centralization\n\nMummolin was co-founded by long-time Bitcoin Core developer Luke Dashjr. The Wyoming-based company is the successor to the Eligius Bitcoin mining pool Dashjr founded — a popular zero-fee mining pool that operated from 2010-2017.\n\n\"The role of mining pools must change for Bitcoin to exist as a truly decentralized currency,\" Dashjr said in the statement. \"OCEAN is a new type of pool that enables miners to be truly miners again. We are launching as the most transparent pool and also the only non-custodial pool where miners are the recipients of new block rewards directly from Bitcoin.\"\n\n\"OCEAN is solving a problem for Bitcoiners that I think all of us feel — further centralization of mining pools that could plague Bitcoin, and how that risks a bunch of Bitcoin attributes that we hold dear,” Dorsey added.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\n\"When I see a project that is good for Bitcoin broadly, and that's also good for me and my companies personally, it becomes a simple decision for me and I'm happy to be a part of it,\" Dorsey said.\n\nBarefoot Mining, OCEAN's first customer, said the new pool would bring some badly needed diversity to Bitcoin mining. \"In my opinion, this is the most significant new company announcement in the Bitcoin world over the past few years,” Barefoot Mining CEO Bob Burnett said. “The new pool will bring new features and some badly needed diversity to the mining world.\"\n\nAntPool and Foundry USA dominance\n\nTwo centralized Bitcoin mining pools, AntPool and Foundry USA, currently dominate hashrate distribution, with an estimated combined market share of over 55% of the total Bitcoin hashrate, according to Blockchain.com.\n\nHowever, it is important to note that these pools are made up of numerous geographically dispersed Bitcoin miners with the flexibility to redirect their mining power to different pools at any time.\n\nOn Monday, Bitcoin mining firm DEMAND launched the first Bitcoin mining pool that operates on Stratum v2 — another initiative designed to bolster the decentralization of the Bitcoin mining ecosystem.\n\nOCEAN said it plans to introduce additional Bitcoin mining decentralization improvements in 2024."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9yZXNlYXJjaC10aGUtZHluYW1pY3Mtb2YtbWFya2V0LW1hbmlwdWxhdGlvbi1iZWZvcmUteW91LWp1bXAtaW4tYml0Y29pbi1ldGZz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Research the dynamics of market manipulation before you jump in Bitcoin ETFs - Cointelegraph",
        "content": "Investors are eagerly anticipating the potential approval of a spot bitcoin exchange-traded fund (ETF) by the United States Securities and Exchange Commission (SEC). The excitement began in early June when the investment giant BlackRock submitted a filing for the product and gained further momentum after a court decision mandated the SEC reconsider its rejection of Grayscale's proposal to transform its Bitcoin Trust (GBTC) into a spot ETF.\n\nThe SEC’s objection to ETFs is related to the fact that Bitcoin (BTC) is traded in unregulated venues around the world, which poses a challenge in preventing fraud and price manipulation.\n\nOne attempt to address the issue has included surveillance-sharing agreements (SSA) with some cryptocurrency exchanges. In theory, this would allow the identification of bad actors who attempt to manipulate the market. Critics question the efficacy of these SSAs given they cannot cover the entire market. ETFs are based on precedent decisions that allowed spot commodity ETFs based on the relevance of the underlying commodity futures markets.\n\nRelated: With Bitcoin’s halving months away, it may be time to go risk-on\n\nThe SEC has established that the futures should lead the spot in price formation in order to be considered a “regulated market of significant size.” In other words, information from the futures market takes precedence over the spot market in the price discovery process. Yet, even if price discovery is led by the futures market, there are still some cases where manipulation in the spot markets can spread to the ETF. The devil is in the details, and more specifically, in the price source for the net asset value (NAV) calculation and in the creations and redemptions method (in-cash or in-kind).\n\nConsider a scenario where a manipulator successfully drives the underlying commodity price down by 5% in unregulated spot markets.\n\nA 2019 Bitwise report on using volume-weighted median price to protect against manipulation of the NAV. Source: Bitwise\n\nIf the creations and redemptions are in-kind, there is a straightforward arbitrage that acts like communicating vessels between the ETF and the unregulated spot markets. In this example, the arbitrageur can exploit it by simply buying underpriced spot commodity and selling the corresponding amount of the ETF, and then using the bought commodity to create new ETF units and cover the short ETF position. The profitability of this trade will last until there is a substantial convergence of the spot commodity price and the equivalent amount of the ETF. How much each price will move toward the convergence depends on their liquidity, but some of the adjustment will come from the ETF price, meaning that the manipulation in the spot market spreads to the ETF, at least in part.\n\nIn a case where the creations and redemptions are in cash and the NAV is calculated with commodity prices derived from the unregulated spot markets, a very similar arbitrage is possible. The arbitrageur buys underpriced spot commodity and sells the ETF, uses cash to create ETF units to cover the short position and sells the commodity trying to replicate the pricing methodology used in the NAV calculation (which determines the price paid for the creations). Apart from worse capital efficiency (due to cash disbursement for creation) and a small execution risk when replicating the NAV price, the trade is basically the same as with in-kind creation and the consequences are similar.\n\nRelated: Futures will be the best crypto game in town even after a Bitcoin spot ETF\n\nIs there a setup that effectively shields the ETF from manipulation? The use of spot prices derived from the futures curve for calculating NAV, coupled with in-cash creations and redemptions, emerges as the most promising alternative. If an arbitrageur attempts to apply the same method as in the previous case, there is no guarantee of selling the commodity at a price similar to that used in NAV calculation, especially in the presence of a manipulator in the spot market. The trade is no longer an arbitrage. The pipes connecting the spot price and the ETF price are obstructed.\n\nOn the flip side, this setup facilitates a straightforward arbitrage path between the ETF and futures. Whenever the ETF price diverges from the spot price implied by the futures curve, an arbitrageur can execute a trade in the opposite position with perfect hedging on futures, establishing a robust link between the ETF and the futures market. It is reasonable to believe that an ETF with such characteristics would be as resistant to manipulation in unregulated spot markets as the futures contracts or a futures ETF.\n\nBoth academics and practitioners have already found some robust evidence supporting the idea that CME Bitcoin Futures are dominant in Bitcoin’s price discovery. Undoubtedly, a spot Bitcoin ETF in the U.S. would be a good development for the traditional markets and the crypto industry. As the American pastor Chuck Swindoll once said, \"The difference between something good and something great is attention to detail.\" By keeping the devils away, a Bitcoin ETF has the potential to be truly great for investors.\n\nJoão Marco Braga da Cunha is the portfolio manager at Hashdex. He obtained a master of science in economics from Fundação Getulio Vargas before obtaining a doctorate in electrical and electronics engineering from the Pontifical Catholic University of Rio de Janeiro.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvbWljcm9zdHJhdGVneS1idXlzLWFuLWFkZGl0aW9uYWwtMTYxMzAtYml0Y29pbi1mb3ItJDU5My1taWxsaW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "MicroStrategy Buys An Additional 16130 Bitcoin For $593 Million - Nasdaq",
        "content": "MicroStrategy, a leading business intelligence and software company, has continued its steadfast commitment to Bitcoin by purchasing an additional 16,130 BTC at a total cost of $593.3 million, Founder & Chairman Michael Saylor announced today. The purchase came as Bitcoin's price has been experiencing upward momentum, reaching a recent yearly high of over $38,300.\n\nThe company initially entered the Bitcoin market in August 2020, making a significant initial investment of $250 million into BTC. Since then, they have consistently added to their Bitcoin holdings, creating a treasury reserve strategy that has garnered over 174,530 bitcoin worth more than $6.59 billion at the time of writing.\n\n“On November 30, 2023, MicroStrategy announced that, during the period between November 1, 2023 and November 29, 2023, MicroStrategy, together with its subsidiaries, acquired approximately 16,130 bitcoins for approximately $593.3 million in cash, at an average price of approximately $36,785 per bitcoin, inclusive of fees and expenses,” MicroStrategy stated. “As of November 29, 2023, MicroStrategy, together with its subsidiaries, held an aggregate of approximately 174,530 bitcoins, which were acquired at an aggregate purchase price of approximately $5.280 billion and an average purchase price of approximately $30,252 per bitcoin, inclusive of fees and expenses.”\n\nAs the fourth Bitcoin halving quickly approaches and the first spot Bitcoin ETF approval by the SEC seems imminent, MicroStrategy continues its aggressive bitcoin investment strategy with no signs of slowing down.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tc3Rvcmllcy1jaGFybGllLXNocmVtLXRlbGxzLWhvdy1iZWNhbWUtYml0Y29pbi1taWxsaW9uYWlyZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Crypto Stories: Charlie Shrem tells how he became a Bitcoin millionaire - Cointelegraph",
        "content": "Charlie Shrem went from running a small online business to becoming a Bitcoin (BTC) millionaire and making the cover of Forbes magazine. And then he went to prison.\n\nIn the latest episode of Cointelegraph’s Crypto Stories, Shrem tells the story of how he founded BitInstant, grew it into a multimillion-dollar Bitcoin empire, and then was arrested for his role in it.\n\nShrem’s first business was an e-commerce site that only charged $5 shipping per item. The idea was his cousin’s, but Shrem used his coding skills to create the actual site. The business sold lights, toothbrushes, razors and other assorted items.\n\nIn his free time, Shrem hung out on online message boards. That’s where he found out about Bitcoin. At the time, the only way to buy Bitcoin was to wire transfer large amounts of funds to Mt. Gox, and it took a week for the deposit to clear within the banking system. A customer who wanted to buy smaller amounts or wanted to buy instantly had no way of doing so.\n\nShrem met up with a person in one of these forums named “Gareth,” and the two started a business that would allow people to buy or sell Bitcoin instantly. Their company was called BitInstant. To allow for instant purchases, the company deposited money into Mt. Gox and purchased Bitcoin with it. They then sold this Bitcoin off in smaller amounts to various customers.\n\nBut Shrem and his partner ran into a problem. As their transaction volume grew, they needed more and more cash to deposit into Mt. Gox, and their capital was running out quickly, as Shrem explained:\n\n“It always needed more money because we were growing in transaction size. So, in a way that an ATM needs money to sit in the machine all day, we needed money to sit in the exchanges for a week, [be]cause it would take up to a week to top up again. It was a cycle, so we always needed seven to eight times our transaction volume.”\n\nThe two entrepreneurs met Roger Ver, who helped them with a $100,000 capital injection to continue scaling the business. Ver also suggested the team hire Erik Voorhees. Later, Voorhees and Shrem ran across David Azar at a tech convention, who invested more. Finally, during his honeymoon, Azar met Cameron and Tyler Winklevoss on a beach and convinced them to invest in the company, which provided enough cash to allow the company to overcome its scaling difficulties.\n\nRelated: Erik Voorhees lashes ‘disgusting’ behavior of Bitcoin maxis\n\nBitInstant grew so fast that it eventually became responsible for 30% of all transactions on the Bitcoin blockchain. Meanwhile, Shrem was struggling in his relationships with his family and the Jewish community he belonged to. Shrem began to feel that his religious community was stifling, especially after he fell in love with a person who was not Jewish. This frustration eventually reached a peak, and Shrem decided to leave the Jewish community.\n\nThen, while attempting to disembark from a plane in New York, Shrem was arrested and charged with money laundering for his role in BitInstant. Authorities claimed that some BitInstant customers had used the Bitcoin they purchased from the company for illicit purposes, including criminal transactions on the Silk Road dark web marketplace.\n\nWhen released on bail, Shrem was placed under house arrest and forced to live with his strict Jewish parents, who believed that his arrest was a punishment from God in response to him leaving the community. “They thought I deserved what was coming to me,” Shrem said. “They were excited to see me go to jail because they felt that I hurt them so hard.”\n\nThat’s all for Part 1 of Charlie Shrem’s crypto story. There is more to come in Part 2.\n\nFollow the full story: The Untold Story of Charlie Shrem."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wYW5kby1zcG90LWJpdGNvaW4tZXRmLWJsYWNrcm9jay1yZXZpc2VzLWV0ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin ETF race gets 13th entrant, BlackRock revises ETF model - Cointelegraph",
        "content": "Swiss asset manager Pando Asset has become an unexpected late entrant into the spot Bitcoin (BTC) exchange-traded fund (ETF) race in the United States.\n\nOn the same day, investment giant BlackRock met with the country’s securities regulator to pitch an updated ETF model based on the agency’s feedback.\n\nOn Nov. 29, Pando submitted a Form S-1 to the U.S. Securities and Exchange Commission (SEC) — used to register securities with the agency — for the Pando Asset Spot Bitcoin Trust.\n\nLike other ETF bids, the trust aims to track Bitcoin’s price with the custody arm of the crypto exchange Coinbase to hold Bitcoin on behalf of the trust.\n\nPando is the 13th applicant for an approved spot Bitcoin ETF in the U.S. and joins the race with a dozen others, including BlackRock, ARK Invest and Grayscale.\n\nIn a Nov. 29 X (formerly Twitter) post, Bloomberg ETF analyst Eric Balchunas said he has “more questions than answers” about Pando’s filing, questioning why it came so late.\n\nmore questions than answers: where have they been for last 3mo? why bother at this point? if they make Jan 10 crew what does that say about fair play and even society as we know it? And what exactly is a Pando? — Eric Balchunas (@EricBalchunas) November 29, 2023\n\nBalchunas also raised concern about the implications should Pando’s ETF be among the Bitcoin ETF filings he predicts will be approved on Jan. 10.\n\n“What does that say about fair play and even society as we know it?” he added.\n\nBalchunas and fellow Bloomberg ETF analyst James Seyffart have put their money on Jan. 10 as the day all spot Bitcoin ETFs would be approved at once, as it’s the deadline for the SEC to deny or approve ARK Invest’s application.\n\nHowever, Seyffart told his followers on X that he doubts Pando’s ETF “is ready to go on [the] first day with the others but crazier things have happened I guess.”\n\nBlackRock meets with SEC to discuss ETF bid\n\nMeanwhile, the SEC met with BlackRock and Invesco executives on Nov. 28 to discuss their ETF bids, according to agency documents.\n\nBlackRock pitched a revision to its redemption model to address the SEC’s concerns from an earlier meeting on balance sheet impacts and risks to U.S. broker-dealers dealing with offshore crypto entities.\n\nRelated: ‘Buy the rumor, sell the news’ — Bitcoin ETF may spark TradFi sell-off\n\nBalchunas explained the revision sees the offshore entity getting Bitcoin from Coinbase and pre-paying the U.S. registered broker-dealer in cash, which cannot directly handle Bitcoin.\n\nHere's the original vs revised in-kind model, look like the new thing is STEP 4, which is the offshore entity market maker getting bitcoin from Coinbase and then pre-paying in cash to the US registered broker dealer (who is not allowed to touch bitcoin). pic.twitter.com/bDgYAnufWA — Eric Balchunas (@EricBalchunas) November 29, 2023\n\nBalchunas explained in a Nov. 17 X post that broker-dealers can’t deal in Bitcoin, and the SEC was asking ETFs to have redemption models that “puts [the] onus on issuers to transact in Bitcoin and keeps broker-dealers from having to use unregistered subsidiaries or third party firms to deal [with] the BTC.”\n\nMagazine: Crypto City Guide to Helsinki: 5,050 Bitcoin for $5 in 2009 is Helsinki’s claim to crypto fame"
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1Mzg3L2FudHBvb2wtYWdyZWVzLXRvLXJlZnVuZC1yZWNvcmQtMy1taWxsaW9uLWJpdGNvaW4tdHJhbnNhY3Rpb24tZmVl0gFpaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjY1Mzg3L2FudHBvb2wtYWdyZWVzLXRvLXJlZnVuZC1yZWNvcmQtMy1taWxsaW9uLWJpdGNvaW4tdHJhbnNhY3Rpb24tZmVl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "AntPool agrees to refund record $3 million Bitcoin transaction fee - The Block",
        "content": "Bitcoin BTC -3.54% mining pool AntPool has agreed to refund the record-breaking $3 million transaction fee it mined last week, pending owner verification.\n\n“On November 23rd, some user submitted 83 BTC as a gas fee,” AntPool wrote in the announcement. “The risk control system of AntPool temporarily froze the fee when packaging the transaction. Please contact us before 00:00 (UTC+8) on December 10, 2023 and verify personal identity. After verification, AntPool will refund the fee.”\n\nAntPool requested the original owner of the funds to prepare a signing tool, such as Electrum or Bitcoin Core — the most widely used software implementation of the Bitcoin protocol — using the private key of the address that sent the transaction to sign the message “AntPool”, then send the signed text to its support email address.\n\nRecord-breaking $3 million fee\n\nLast week, a Bitcoin user appeared to have accidentally paid the transaction fee of over $3 million last week, setting a new record in U.S. dollar terms for a single Bitcoin transaction.\n\nThe transaction paid 83.65 BTC ($3.1 million) to transfer 55.77 BTC ($2.1 million). The pre-transaction balance was 139.42 BTC ($5.2 million), with the user overpaying by 120,528 times, according to Bitcoin explorer Mempool.\n\nThe transaction was mined by AntPool in block 818,087 but it had not publicly commented on the matter until now. The previous record $500,000 fee paid in September was subsequently identified as a “fat finger” overpayment by the crypto services provider Paxos. F2Pool, the miner facilitating that transaction, agreed to reimburse the fee to Paxos.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nHack claim\n\nThe incident was followed by a Bitcoin user claiming to be the victim of the $3 million transaction fee, stating that it was their wallet that paid the fee and that they had been hacked.\n\n“I created a new cold wallet, transferred 139 BTC to it and it got transferred out to another wallet immediately,” the user “83_5BTC” posted on X. “I can only imagine that someone was running a script on that wallet and that the script had a weird fee calculation. 55 BTC gone forever. 83.5 BTC to be decided.”\n\nThe same user had signed a message appearing to demonstrate ownership of the key that made the transaction, verified by Mononaut, the pseudonymous developer behind the Bitcoin explorer Mempool. However, if the wallet was compromised, it could also have been signed by an attacker. This means AntPool would need another method to verify the victim’s identity, Mononaut added. It is unclear whether AntPool intends to do this.\n\nAccording to Mononaut, the likely cause of a hack was the use of a low-entropy wallet, possibly a brainwallet, meaning it was created with insufficient randomness, making it vulnerable to attacks. The transaction was quickly fee-bumped using replace-by-fee (RBF) — a Bitcoin protocol feature that allows a sender to increase the transaction fee on an unconfirmed transaction, enabling quicker network processing. If it was indeed a low-entropy wallet, multiple attackers could have been competing to steal the funds, Mononaut suggested. This would explain the high fee, with scripts configured to spend a significant portion of the transaction to hinder competitors.\n\nAntPool did not immediately return a request for comment from The Block."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY1Mzc2L2JpdGNvaW4tY2FwaXRhbC1pbmZsb3ctZmVkLXJhdGUtcGF1c2UtZGVjZW1iZXLSAVZodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNjUzNzYvYml0Y29pbi1jYXBpdGFsLWluZmxvdy1mZWQtcmF0ZS1wYXVzZS1kZWNlbWJlcg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin capital inflow may rise with expected Fed rate pause in December - The Block",
        "content": "Bitcoin BTC -3.54% could see more capital inflow if the U.S. Federal Reserve pauses rates at its next meeting on Dec. 13, according to analysts.\n\n\"There is anticipation of a pause in the Fed's interest rate hikes, as indicated by Federal Reserve Governor Christopher Waller's recent statements,\" Bitfinex analysts told The Block, adding: \"An interest rate pause could lead to more capital flowing into risk assets like bitcoin.\"\n\nThe Bitfinex analysis referenced a speech by Federal Reserve Governor Chris Waller earlier this week. In the speech, Waller mentioned that the easing of the U.S. economy's pace was an encouraging sign, indicating that the current monetary policy aligns with the Fed's 2% inflation goal. \"Data for October indicated an easing in economic activity, and forecasts for the fourth quarter show the kind of moderation that is more in keeping with progress on lowering inflation,\" Waller said in a speech on Tuesday.\n\nHigh probability of a rate pause\n\nWaller added that he is confident current monetary policy is \"well positioned to slow the economy and get inflation back to 2%.\" His comments — combined with CME FedWatch's 95% probability of a rate pause at the next Federal Open Market Committee meeting in December — are fostering optimism among analysts.\n\nThe Fed official was encouraged by the consumer price index inflation reading for October. \"This is what I want to see,\" he said. \"For the month, there was no inflation, prices were virtually flat, and unlike earlier moments where improvements were concentrated in some goods and services, the moderation in inflation was broadly distributed,\" he added.\n\nRELATED INDICES See crypto indices\n\nHowever, Bitfinex analysts stressed that it is important to note that Waller also cautioned that inflation is still high. There is uncertainty about whether the slowing trend will be sustained. \"Therefore, while a rate pause might boost bitcoin and other cryptocurrencies in the short term, the long-term impact would depend on a range of economic factors and the overall direction of monetary policy,\" Bitfinex analysts said.\n\nThe potential of Fed rate cuts in 2024\n\nInvestors are looking forward to the next Federal Reserve rate announcement with anticipation. Particular attention will be given to the nuances in Fed Chair Jerome Powell's post-announcement press conference and any signals about possible rate cuts in 2024.\n\nBitfinex analysts pointed to signals that indicate the market anticipates the U.S. central bank will commence cutting rates in the spring of 2024. \"The anticipation of such a pause has already influenced bond yields and trader expectations, with rate cuts being priced in starting from May 2024,\" Bitfinex analysts said.\n\n\"We believe part of the current price action and long-term holder positioning for a sustained long-term price increase is part of this effect. This shift in monetary policy, if it occurs, could create a more favorable environment for investment in risk assets, including cryptocurrencies,\" the analysts added."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zYW50YW5kZXItYXBwb2ludHMtY3J5cHRvLWN1c3RvZGlhbi10YXVydXMtc2FmZWd1YXJkLWJpdGNvaW4tZXRoZXItcmVwb3J00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Santander appoints crypto custodian Taurus to safeguard Bitcoin, Ether: Report - Cointelegraph",
        "content": "Spanish financial services giant Banco Santander has reportedly selected digital asset management firm Taurus to safeguard its Swiss clients’ Bitcoin (BTC) and Ether (ETH).\n\nOn Nov. 20, Santander Private Banking International’s Swiss private banking unit rolled out a new Bitcoin and Ether trading service for clients with Swiss accounts. According to an internal announcement seen by Cointelegraph, Santander clients will get access to crypto investment services only after requesting it through relationship managers.\n\nA CoinDesk report citing “a person familiar with the arrangement” stated that the bank had appointed crypto custody firm Taurus to implement a self-custody model for digital assets. Cointelegraph reached out for confirmation from Santander, which declined to comment, saying:\n\n“Unfortunately, it’s a no comment. We don’t comment on providers or possible providers.”\n\nOn Sept. 14, Taurus partnered with German banking giant Deutsche Bank to provide cryptocurrency custody options to its customers.\n\nTaurus did not immediately respond to Cointelegraph’s request for comment.\n\nRelated: JPMorgan, Apollo plan for enterprise mainnet, execs reveal\n\nWhile some banks tap into existing players for custodial needs, DZ Bank — the third largest bank in Germany by asset size — launched its own digital assets custody platform built on blockchain.\n\nHolger Meffert, head of securities services and digital custody at DZ, expressed the bank’s interest in distributed ledger technology. The bank also hopes to offer institutional investors and private customers the facility to buy cryptocurrencies, “such as Bitcoin,” in the future.\n\nMagazine: Real AI use cases in crypto, No. 2: AIs can run DAOs"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW5mdC1tYXJrZXRwbGFjZS1iaW9uaXEtY29uZ2VzdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin NFT marketplace Bioniq eyes lofty goal of alleviating network congestion - Cointelegraph",
        "content": "A new Bitcoin nonfungible token (NFT) marketplace aims to reduce network fees associated with the advent of Bitcoin Ordinals inscriptions by tapping into the Internet Computer Protocol (ICP).\n\nDeveloped off the back of the creation of Bitcoin Ordinals in early 2023, Bioniq operates on the ICP and taps into its native Bitcoin integration to power the trade of Bitcoin-based Ordinals inscriptions.\n\nSpeaking to Cointelegraph on the eve of the platform’s launch, Bioniq CEO and co-founder Bob Bodily said the project has been in development since February 2023. The team has built a marketplace featuring Ordinals smart contracts auctions on the ICP, a complete cross-chain wallet between Bitcoin and the ICP, as well as an inscription tool.\n\n“It had only been two weeks after Casey Rodarmor released Ord 0.4.0, and I knew Ordinals were going to be absolutely massive.”\n\nThe Bioniq team highlighted the growth in the market capitalization of BRC-20 tokens since their inception in Jan. 2023. The market cap now exceeds $3 billion, with over 42.6 million Ordinals minted to date. This has directly affected Bitcoin network congestion, leading to a spike in Bitcoin (BTC) transaction fees last seen since 2021.\n\nBitcoin transaction fees showed significant spikes in 2023 following the advent of Bitcoin Ordinals and BRC-20 tokens. Source: Blockchain.com\n\nBioniq’s platform features a smart wallet for users to manage private keys using Web3Auth. This allows users to log into the platform using conventional Web2 Google accounts while maintaining noncustodial control of their wallets and assets.\n\nThe platform also uses partially signed Bitcoin transactions (PSBTs) through the ICP’s Bitcoin network integration. This unlocks smart contract capabilities for Bitcoin, removing the need for users to use centralized cross-chain bridges.\n\nICP is a “fantastic Bitcoin sidechain”\n\nBuilding on ICP also allows Bioniq to claim transaction finality times below two seconds, as well as zero gas or network fees. Its architecture provides optimized storage costs, averaging around $5 per gigabyte of data stored annually.\n\nBodily added that Toniq, the studio behind Bioniq, has been developing on the ICP since May 2021 and has extensive experience building smart contract wallets, marketplaces, NFT launchpads and collateralized NFT lending protocols:\n\n“ICP is a fantastic Bitcoin sidechain right now because it has wonderful Bitcoin primitives at the protocol layer.”\n\nBodily explains that ICP operates a Bitcoin light node running fully on-chain, which facilitates reading the Bitcoin blockchain via native smart contract calls. The ICP also has a threshold digital signature algorithm, known as an Elliptic Curve Digital Signature Algorithm. The implementation allows ICP smart contracts to sign layer-1 Bitcoin transactions and broadcast them to the mempool.\n\n“These protocol primitives also enabled us to build an Ordinals wrapper entirely at the application layer; we didn’t have to touch the consensus layer of the protocol at all. So it is very fast to build Bitcoin tech on ICP right now,” Bodily added.\n\nBitcoin users and trust assumptions\n\nCointelegraph also inquired whether Bioniq’s wrapping process could be a potential barrier to entry for users. Bodily admits that while the process is largely automated by the Bioniq wallet and only requires BTC, there are two considerations that are pertinent for more discerning users.\n\n“Wrapping requires a Bitcoin transaction. This means you have to pay in order to wrap. This is a significant barrier. One way we are addressing the problem is by integrating open Nostr PSBT listings into Bioniq,” Bodily explained.\n\nThis integration means that PSBT listings stored on Nostr through decentralized Ordinals marketplaces OpenOrdex or Deezy Place will be accessible on Bioniq. He added that it removes the need to wrap Bitcoin transactions, as users could list directly on Bioniq using open PSBTs.\n\nPerhaps more importantly, Bodily explained that the wrapping process requires “trust assumptions” on both protocols:\n\n“Wrapping over to ICP means in addition to trusting Bitcoin, you are now trusting the Internet Computer Protocol. Some Bitcoin users won’t want the counterparty risk of bridging assets to another chain.”\n\nBodily adds that Bioniq is focusing on developing user experience ahead of inheriting Bitcoin’s security, which is ensured by the finality of layer-1 transactions. However, he envisions a “nice decentralization path” for applications like Bioniq.\n\nThis would involve the evolution from being built on a sidechain with additional trust assumptions to “becoming a Bitcoin sovereign rollup on ICP that is trust minimized.” The final step would see Bioniq becoming a Bitcoin zero-knowledge rollup (ZK-rollup) on the ICP with no additional trust assumptions, inheriting the full security and decentralization of Bitcoin.\n\n“ICP fits perfectly into this plan as well because ICP can provide a replicated execution environment (decentralized sequencer) or validium (extra off-Bitcoin storage for rollups).”\n\nBanking on Bitcoin’s value proposition\n\nA number of NFT marketplaces already offer Bitcoin Ordinals auctions and trading, which begs the question of what an exclusively Ordinals platform will bring to the ecosystem.\n\nBodily believes that existing offerings that featured “softer pivots” to Ordinals on their platforms were hamstrung by confusing user experiences. Developing a “dedicated Bitcoin Ordinals marketplace, built for Bitcoin users natively” hinges on developing a native cross-chain, BTC-ICP wallet.\n\nIn addition, Bitcoin’s unchallenged position as the preeminent and largest cryptocurrency by market cap remains another drawcard for the continued interest in Bitcoin NFTs into the future.\n\n“If you look at the numbers, 89% of people in the world have heard about Bitcoin, Bitcoin accounts for around 50% of the total crypto market cap, and Ordinals have done over $500 million in volume this year — so there is massive demand.”\n\nBioniq joins the likes of Ordinals Market as a Bitcoin-only Ordinals marketplace. Gamma is another Ordinals marketplace that directly mints to Bitcoin’s layer-1 chain. Ordswap was an early Ordinals marketplace that has since closed down after losing control of its website to hackers. Meanwhile, multichain platforms like Magic Eden prominently list Bitcoin Ordinals NFTs.\n\nMagazine: Recursive inscriptions: Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXdoYWxlLWdhbWVzLXdhcm5pbmctYnRjLXByaWNlLTQway11cy1kYXRh0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin gets 'whale games' warning as BTC price eyes $40K into US data - Cointelegraph",
        "content": "Bitcoin (BTC) held momentum at $38,000 on Nov. 29 as analysis warned over market corrections.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin meets macro data, Fed’s Powell at key price point\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price trajectory continuing to aim for new 18-month highs.\n\nAfter matching current highs the day prior, the largest cryptocurrency surprised by keeping a grip on higher levels as futures markets hit $39,000.\n\nAlready a topic of debate, the excitement on derivatives led some to caution that large-volume traders could still leave late long positions stranded at the top.\n\nIn commentary overnight, Keith Alan, co-founder of monitoring resource Material Indicators, told traders to be wary of these “whale games.”\n\n“Earlier today, some ask liquidity at $38k was pulled to open the door to $38.5k. Don’t allow yourself to think that was a friendly whale giving you boost. That was a Killer Whale trying to FOMO you in,” he wrote about the initial trip past $38,000.\n\nAlan continued that words due Dec. 1 from Jerome Powell, chair of the United States Federal Reserve, may provide an external BTC price catalyst that could even bring $40,000 into play.\n\nWhales, however, would be spying on a key level at which to sell off.\n\n“My assumption is that they will continue to do so until there is enough to dump into,” he forecast.\n\n“That doesn’t mean that # JPow’s speech can’t be the catalyst that sends price past $40k, especially as we see bid liquidity coming in above $37.5k, but if you aren’t prepared to sweep the local lows between now and then you haven’t been paying attention to how these Whale Games tend to play out.”\n\nBTC/USDT order book liquidity. Source: Keith Alan/X\n\nAn accompanying chart showed order book sell-side liquidity concentrated at $38,500 — a level yet to be challenged at the time of writing.\n\nOthers remained confident that further short-term upside was possible and even likely.\n\nAnalyzing current market composition, popular trader Skew concluded that volume was all that was missing for a breakout toward the $40,000 watershed.\n\n$BTC 4H Update\n\nTrend still respected & clean HL exactly where I expected it to occur ($36.7K)\n\n\n\nJust need the HH now & volume supported break of $38K - $40K resistance https://t.co/iPPGzVIbFF pic.twitter.com/SQtKwvBdz0 — Skew Δ (@52kskew) November 29, 2023\n\nAckman bets on Q1 Fed rate cut\n\nAs Cointelegraph reported, prior to Powell’s speech, key U.S. macro data will lend extra weight to Fed policy.\n\nRelated: Bitcoin metric that ‘looks into future’ eyes $48K BTC price around ETF\n\nThis comes in the form of Q3 GDP and the October print of the Personal Consumption Expenditures Index on Nov. 29 and Nov. 30, respectively.\n\nPreviously, inflation abating faster than expectations led markets to assume that no further interest rate hikes would occur at the December meeting of the Federal Open Market Committee.\n\nSpeaking to Bloomberg on Nov. 28, Bill Ackman, CEO and founder of hedge fund Pershing Square Capital Management, stated that the Fed might have no choice but to pivot on rates at the start of 2024.\n\n“I think they’re going to cut rates; I think they’re going to cut rates sooner than people expect,” he said.\n\nAckman continued that not cutting rates “pretty soon” would increase the risk of a so-called hard landing for the U.S. economy as inflation tails off.\n\n“I think the market expects sometime in the middle of next year; I think it’s more likely, probably, as early as Q1,” he predicted.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtcHVibGljLWNvbW1lbnRzLXJlcXVlc3QtZnJhbmtsaW4tdGVtcGxldG9uLWhhc2hkZXgtYml0Y29pbi1idGMtZXRmc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "SEC seeks public input on Franklin Templeton, Hashdex Bitcoin ETFs - Cointelegraph",
        "content": "The United States Securities and Exchange Commission has announced the next steps in its consideration of the proposed Franklin Templeton and Hashdex spot Bitcoin (BTC) exchange-traded fund (ETF) bids.\n\nThe agency has requested written comments on both proposals to approve or deny the applicants’ Forms 19b-4.\n\nSEC Form 19b-4 is a public disclosure approved by the SEC Trading and Markets Division separately from Form S-1, the offering prospectus subject to Corporate Finance Division approval. The SEC’s requests have an open period of 35 days from their publication in the Federal Register for both comments and responses to comments.\n\nThe SEC release on the Franklin Templeton Bitcoin ETF. Source: SEC\n\nThe proposed rule changes — effectively applications — that would allow the trading of the ETFs were filed in late September. The Hashdex ETF would be traded on the New York Stock Exchange Arca and Franklin Templeton’s on Cboe BZX. On Nov. 15, the SEC extended its deadline for deciding on the applications.\n\nRelated: Binance, CZ settlement with US DOJ ‘bullish for Bitcoin ETF,’ crypto community says\n\nThe questions address issues related to potential ETF approval. Commenters are invited to assess the funds’ susceptibility to manipulation and whether or not the exchanges that will host them are of significant size.\n\nFranklin Templeton commenters are further asked to consider price manipulation on the BTC market, the company’s surveillance sharing agreement with Coinbase, which would aid in price discovery and supplement efforts to detect manipulation and fraud, and correlation between BTC spot and futures prices.\n\nSEC extends comment window for Franklin Templeton and Hashdex #Bitcoin ETFs pic.twitter.com/aEYTa5Yg1n — Daniela (@DeFinanzasYT) November 28, 2023\n\nHashdex’s proposed fund structure is more complex than Franklin Templeton’s. Its proposed Hashdex Bitcoin ETF would be structured as a futures ETF that holds spot BTC. Rather than depending on a Coinbase surveillance sharing agreement, Hashdex would acquire BTC from other exchanges on the CME and rely solely on that mechanism for pricing.\n\nThe SEC asked whether the CME has significant size in light of the fund structure and whether sufficient liquidity will be available. Finally, commenters are asked about sponsor Toroso Investments’ calculations to determine the relationship between the BTC price on the CME and on unregulated exchanges. The sponsor manages and controls the fund.\n\nMagazine: Bitcoin ETF optimist and Worldcoin skeptic Gracy Chen: Hall of Flame"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZGVjcnlwdC5jby8yMDgxNjUvbXlzdGVyaW91cy1iaXRjb2luLXdoYWxlLW1pbGxpb25zLWJ0Y9IBRWh0dHBzOi8vZGVjcnlwdC5jby8yMDgxNjUvbXlzdGVyaW91cy1iaXRjb2luLXdoYWxlLW1pbGxpb25zLWJ0Yz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "'Mysterious Whale' Is Accumulating Millions in Bitcoin—Or Is It? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe mystery of a large, unlabelled Bitcoin address has the cryptocurrency space buzzing with questions about who the “whale” holding over $450 million in Bitcoin might be.\n\nThe “bc1qc” Bitcoin address holds a balance of 12,070 BTC, worth around $455,616,665 at current prices, according to blockchain analytics sites Arkham Intelligence and Blockchair. The address has received tens of millions of dollars worth of Bitcoin in the last several weeks, mostly in large batches. But it might not be a whale at all, according to the various experts who spoke with Decrypt.\n\nA “whale” refers to an investor who hoards large amounts of cryptocurrency. So the idea of a single entity loading up on Bitcoin, at a time when market sentiment is turning bullish, would be an encouraging sign to holders, to say the least.\n\nAD\n\nAD\n\nIt’s no wonder that Crypto Twitter influencers, such as author and investor Jason Williams and Wealth Mastery founder Lark Davis, are pushing this narrative to their collective millions of followers.\n\nBREAKING 🚨 NEWS : A mystery whale keeps up its daily buying streak, acquiring 539 #Bitcoin this morning, following the accumulation of 1,178 #BTC yesterday 👀 Over the past 28 days, they have amassed a total of 10.3K #Bitcoin , propelling them to number 73 on the #BTC rich… — Jason A. Williams (@GoingParabolic) November 28, 2023\n\n“A mystery whale keeps up its daily buying streak, acquiring 539 [Bitcoin] this morning, following the accumulation of 1,178 [BTC] yesterday,” Williams tweeted two days ago. “Seems like institutional investors are trying to front-run the spot Bitcoin ETF approval,” Davis followed up today, referring to the rumors that an SEC approval for a long-anticipated Bitcoin ETF is imminent.\n\nA mystery whale has been accumulating large amounts of $BTC recently. Over the last 4 weeks, they have accumulated 10.3K $BTC. Seems like Institutional investors are trying to front-run the Spot Bitcoin ETF approval. pic.twitter.com/cTlSMIzSAK — Lark Davis (@TheCryptoLark) November 30, 2023\n\nThe chatter also found its way to Reddit, with a Redditor commenting on a since-removed, but highly upvoted r/Bitcoin post: “Mystery new Bitcoin whale buys another 612.5 BTC, acquiring a total of 11,005.82 Bitcoin in just 29 days!”\n\nAD\n\nAD\n\nBut blockchain analysts are raining on the BTC-pumpin’ parade. It’s much more likely that the wallet belongs to an exchange, moving funds into cold storage (i.e. an offline hardware wallet)\n\n“We cannot say with 100% certainty but its on-chain behavior suggests that it is most likely part of cold storage infrastructure for an exchange,” a Chainalysis investigator told Decrypt in an email. That’s partly because the address only shows incoming transactions, with none going out.\n\nAmberdata Director of Research Chris Martin concurred.\n\n“It's not 100% certain that it's an individual or an exchange, but there is a very strong connection with BitMEX,” Martin told Decrypt. “Almost all of the funding sources were BitMEX hot wallets, but the address doesn't follow their normal address schema (having BMEX, or qmex in the address).”\n\nMartin speculated, though, that the transactions are an exchange consolidating into a single wallet but left open the idea that it may be a whale after all.\n\n“There's an off-chance it could be a large BitMEX whale leaving the platform,” he said. BitMEX did not immediately respond to Decrypt’s request for comment.\n\nConsolidating wallets is not unusual in the cryptocurrency space. Both individuals and companies can have multiple, sometimes hundreds of addresses and consolidating them into a single address makes the management of digital assets more accessible. Even still, accounts moving large sums of Bitcoin will always draw attention.\n\nIn April, a wallet created in the early days of Bitcoin moved 400 BTC, around $11 million, after being dormant for 12 years. Another wallet moved 279 BTC, around $8 million at the time, that same month. In June, another wallet moved $1.2 million after 13 years of inactivity.\n\nAD\n\nAD\n\nSo long as blockchains are pseudonymous, and unmarked entities are moving large sums of digital money around, people will continue to speculate about the motives behind the moves."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMivgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjktbm92ZW1iZXItMjAyMy9hcnRpY2xlc2hvdy8xMDU1ODUzMTcuY21z0gHCAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZXMtdG9kYXktbGl2ZS1uZXdzLWJpdGNvaW4tZG9nZWNvaW4tZXRoZXJldW0tc2hpYmhhLWludS1jcnlwdG9jdXJyZW5jeS1sYXRlc3QtdXBkYXRlcy0yOS1ub3ZlbWJlci0yMDIzL2FtcF9hcnRpY2xlc2hvdy8xMDU1ODUzMTcuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin crosses $38,000; Solana, Dogecoin rise up to 7% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nSnapping a two-day losing streak, major cryptocurrencies traded higher on Wednesday, led by gains in Bitcoin, Ethereum and Solana.Meanwhile, the global cryptocurrency market cap surged 2.2% to around $1.43 trillion in the last 24 hours.At 11.56 a.m., BTC was trading 2.85% higher at $38,031, while the second most popular token, Ethereum, was up 2.4% at $2,051. Solana also surged over 7% to $58.32.Positive sentiments prevailed in the market as Bitcoin breached the $37,800 threshold. This price movement could reflect that market participants have now absorbed the news about the recent leadership change at Binance, restoring bullish confidence in their investments, said Edul Patel, CEO of Mudrex.Other popular altcoins, such as Dogecoin , Chainlink, and Avalanche, surged 4-5%. Also, BNB XRP , Cardano, Tron, Polygon, Litecoin , and Shiba Inu rose 2-3%.The total volume in DeFi is currently $4.74 billion, 9.19% of the total crypto market 24-hour volume. The volume of all stablecoins is now $46.95 billion, which is 90.96% of the total crypto market 24-hour volume.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, fell to $743 billion. Bitcoin's dominance is currently 51.99%, according to CoinMarketCap. BTC volume in the last 24 hours surged 18.3% to $22.4 billion.Bitcoin, in the last 24 hours, has showcased a bullish momentum again and went on to surpass the $38k psychological resistance. While the path to $41k may not have a lot of resistance now, traders may begin to undergo bearish sentiments. However, from a historical lens, the last bull run also started during November-December after showing a negligible pullback for 6 months in a row, said CoinSwitch Markets Desk.The 4-hour chart reflects a delicate balance between bullish and bearish sentiment, with the $36,950 pivot point that Bitcoin has tentatively breached, indicating a potential market move.Immediate resistance levels lie at $37,986, $38,429 and the more ambitious $39,066, while support is at $36,399 and $35,722. The chart shows an ascending channel formation, indicating a steady uptrend along the lower support trendline. Given the RSI and EMA, there is cautious optimism for continued upward momentum.Overall, the trend is bullish and short-term forecasts call for a resistance test at $37,986. Holding support above the pivot and 50 EMA could pave the way for a challenge of higher resistance zones, especially the $38,000 level, which will attract further buying interest towards $39,000.(You can now subscribe to our ETMarkets WhatsApp channel (Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of Economic Times)"
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYm90YW5peC1sYWJzLWxhdW5jaGVzLWZpcnN0LWV2bS1lcXVpdmFsZW50LWxheWVyLTItdGVzdG5ldC1vbi1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Botanix Labs Launches First EVM-Equivalent Layer 2 Testnet on Bitcoin - Nasdaq",
        "content": "Botanix Labs has officially launched the first-ever fully decentralized Ethereum Virtual Machine (EVM) equivalent Layer 2 on Bitcoin, according to a press release sent to Bitcoin Magazine. This represents over a year of dedicated research and development by the team, with a focus on enhancing user experience.\n\n\"We want to make it as easy as possible to start building on Bitcoin,\" said Willem Schroe, the Founder and CEO of Botanix. The initiative stems from the team's ambition to propel Bitcoin beyond its status as the pinnacle of digital currency and position it as the cornerstone of a novel decentralized financial ecosystem.\n\nAt the core of this initiative is Spiderchain, a decentralized network of multisigs empowering anyone to operate a full Botanix node and participate in the network. Introducing forward security, a concept derived from encryption systems, Spiderchain facilitates low-cost, swift transactions for Bitcoin deployments.\n\nThe innovative aspect of Botanix's Spiderchain is its seamless compatibility with Ethereum's EVM smart contracts. This compatibility enables developers to effortlessly replicate and deploy any EVM smart contract onto the Botanix testnet using Bitcoin.\n\nCasa's co-founder & CTO Jameson Lopp, in his analysis of the Spiderchain's whitepaper, highlighted its implementation on Bitcoin without necessitating any protocol alterations at the base layer. “While there are a variety of proposals being discussed for enhancing Bitcoin's Layer 2 capabilities…one distinction with spiderchains is that they can be implemented on Bitcoin today without any protocol changes to the base layer,” he said.\n\nBotanix Labs is now forging ahead to incubate the first-ever Bitcoin-enabled DeFi and NFT ecosystem. The testnet encompasses a Signet Bitcoin faucet, a bridge, and AvocadoSwap, akin to PancakeSwap, facilitating token swaps.\n\nMoreover, Botanix is launching the \"Botanix Testnet Accelerator,\" inviting 10 startups for enhanced BD support, co-marketing, and development resources ahead of the mainnet launch slated for early next year. Selection criteria encompass the product's development, transaction activity, and business potential.\n\nThe Botanix testnet is available for trial, inviting feedback from users at here.\n\nDisclaimer: UTXO Management is an investor in Botanix. UTXO's parent company, BTC Inc., is also the parent company of Bitcoin Magazine.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZGVjcnlwdC5jby8yMDgxMTQvbWljcm9zdHJhdGVneS1ib3VnaHQtNTkzLW1pbGxpb24tbW9yZS1iaXRjb2luLWluLW5vdmVtYmVy0gFZaHR0cHM6Ly9kZWNyeXB0LmNvLzIwODExNC9taWNyb3N0cmF0ZWd5LWJvdWdodC01OTMtbWlsbGlvbi1tb3JlLWJpdGNvaW4taW4tbm92ZW1iZXI_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "MicroStrategy Bought $593 Million More Bitcoin in November - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nTech company MicroStrategy has bought even more Bitcoin—bringing its holdings to 174,530 BTC. As of Thursday morning, its Bitcoin stash is worth approximately $6.6 billion.\n\nIn a Thursday tweet, MicroStrategy founder and chairman Michael Saylor said that his firm, which provides software solutions for companies wanting to analyze their data, had this week bought an extra 16,130 BTC for a price of $593.3 million.\n\nThe company, based in Tyson, Virginia, has now spent a total of $5.28 billion on the cryptocurrency, according to Saylor's announcement.\n\nAD\n\nAD\n\nIt is the largest corporate holder of the digital asset by far.\n\nMicroStrategy first bought Bitcoin back in August 2020 during the COVID-19 pandemic. A bull run followed soon after.\n\nSaylor—who was CEO of the company at the time—argued that the asset was a hedge against inflation and would be the best strategy for getting maximum returns for shareholders as the business was sitting on so much cash.\n\nMicroStrategy has acquired an additional 16,130 BTC for ~$593.3 million at an average price of $36,785 per #bitcoin. As of 11/29/23, @MicroStrategy now hodls 174,530 $BTC acquired for ~$5.28 billion at an average price of $30,252 per bitcoin. $MSTR https://t.co/hSEZyzGBsr — Michael Saylor⚡️ (@saylor) November 30, 2023\n\nAnd his plan appears to be working: MicroStrategy stock is up 238% since the company adopted its \"Bitcoin standard.\" Saylor has argued that buying shares in the company is a way investors can get exposure to cryptocurrency.\n\nAD\n\nAD\n\nMicroStrategy stock—MSTR on the Nasdaq—is currently priced at $493.15 a share. That's a 17% gain in the past month, but shares are down 2% from yesterday's close.\n\nSaylor has repeatedly spoken about how Bitcoin is a superior asset to real estate and gold and a \"dependable store of value and an attractive investment asset with more long-term appreciation potential than holding cash.\"\n\nOther companies have since followed suit—most notably electric car company, Tesla. The clean energy company headed up by the world's richest man, Elon Musk, holds 9,720 BTC, or $366 million in digital coins.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmVyLXBob2VuaXgtaXBvLWxhdW5jaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin mining firm Phoenix Group delays share listing - Cointelegraph",
        "content": "Cryptocurrency mining firm Phoenix Group is preparing for its public trading launch after seeing a significant oversubscription during the pre-market sale on Nov. 21.\n\nPhoenix’s public trading launch will be delayed as the firm has revised the date for its forthcoming initial public offering (IPO) on the Abu Dhabi Securities Exchange (ADX).\n\nAccording to an announcement on Nov. 28, the crypto mining firm expects to list its shares on Dec. 5 instead of Dec. 4, 2023, due to public holidays declared for the United Arab Emirates National Day.\n\nCelebrated on Dec. 2, the UAE National Day commemorates the formation of the UAE. The Ministry of Human Resources and Emiratization marks Dec. 2, 3 and 4 as public holidays for the private sector.\n\n“To honor this occasion and ensure comprehensive participation in the IPO, Phoenix Group has rescheduled its listing date to December 5th, 2023,” the announcement states.\n\nAs previously announced, Phoenix Group successfully closed its IPO with an oversubscription of 33 times on Nov. 18, reporting that its offer of 907,323,529 shares saw “overwhelming demand.” Phoenix said retail investors oversubscribed the offering 180 times, while professional investors contributed to a 22-fold oversubscription.\n\nPhoenix is a UAE-based mining operator that is developing one of the largest mining facilities in the Middle East. The company has reportedly been discussing the IPO launch in the UAE since at least July 2023.\n\nRelated: Bithumb plans to be first crypto exchange listed on Korea stock market: Report\n\nThe UAE has emerged as one of the most crypto-friendly jurisdictions in the world, launching various initiatives, including multiple Web3-focused economic free zones to support crypto development.\n\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in"
    },
    {
        "id": 88,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWZhaWxzLTM4LTUtay1icmVha291dC11cy1nZHAtZmVkLWhhcmQtbGFuZGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin price fails $38.5K breakout as US GDP fuels Fed hard-landing woes - Cointelegraph",
        "content": "Bitcoin (BTC) shrank back from resistance after the Nov. 29 Wall Street open as United States gross domestic product (GDP) figures beat expectations.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nGDP sets tone for macro-sensitive crypto\n\nData from Cointelegraph Markets Pro and TradingView followed a familiar BTC price retracement on short timeframes.\n\nBitcoin bulls had managed to propel the market above $38,000 the day prior, only to flip-flop around that level before ultimately dropping as U.S. macro data hit.\n\nThis showed Q3 GDP accelerating beyond anticipated levels, coming in at 5.2% versus 4.9%.\n\nThis renewed concerns over how the United States Federal Reserve might handle policy ahead of an interest rates decision in mid-December.\n\n“5.2% is the final reading, it will mark the highest GDP growth since Q4 2022,” financial commentary resource The Kobeissi Letter wrote in part of a reaction on X (formerly Twitter.)\n\n“Can the Fed achieve a soft landing?”\n\nU.S. GDP percentage change chart (screenshot). Source: U.S. Bureau of Economic Analysis\n\nKobeissi referenced words from Bill Ackman, founder and CEO and founder of hedge fund Pershing Square Capital Management, who the day prior had gone on record to predict a Fed rate pivot as soon as Q1, 2024.\n\n“Yesterday, Bill Ackman bet on a hard landing with rate cuts beginning in Q1. Currently, futures don’t see rate cuts beginning until June 2024,” it continued.\n\nData from CME Group’s FedWatch Tool showed marginally increasing bets on a further hike in December following the GDP release, with further key data due on Nov. 30. The odds of a hike stood at 4.2% at the time of writing versus 0.5% previously.\n\nFed target rate probabilities chart. Source: CME Group\n\nAnalyst: Bitcoin is a buy below $35,000\n\nBitcoin, meanwhile, continued acting in a familiar style from recent days.\n\nRelated: ‘Buy the rumor, sell the news’ — Bitcoin ETF may spark TradFi sell-off\n\nBulls still failed to crack a key resistance zone beginning at $38,500, despite some being confident that an assault on $40,000 would ultimately result.\n\n“No HH or breakout confirmation yet, eyeing a sweep of $37.3K area & HL setup for the HH,” popular trader Skew told X followers, referring to a “higher high” being required.\n\n$BTC 4H\n\nNo HH or breakout confirmation yet, eyeing a sweep of $37.3K area & HL setup for the HH https://t.co/VDSl43g7Hh pic.twitter.com/wwGTTegxlM — Skew Δ (@52kskew) November 29, 2023\n\nFellow trader Daan Crypto Trades suggested that a period of flatter BTC price performance could now enter before a fresh bout of upside volatility.\n\n“Price took out some liquidity above and below,” he commented about the day’s events.\n\n“Would not surprise me to see some more sideways chop for both sides to build up more positions before the next bigger move.”\n\nBTC/USDT liquidity map for Binance. Source: Daan Crypto Trades/X\n\nAn accompanying chart showed liquidity for the BTC/USDT pair on Binance, the largest global exchange.\n\nEyeing potential downside opportunities, Michaël van de Poppe, founder and CEO of trading firm MN Trading, flagged a range between $33,000 and $35,000 — already a popular zone based on liquidity.\n\n“Markets are consolidating. Giving opportunities, still no breakout of Bitcoin above $38K,” his latest X analysis read.\n\n“If we continue to make higher lows, higher highs, a breakout seems to be happening soon. Structure lost? Buying at $33-35K.”\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzI5L3RlcnJhcy11c3RjLWdhaW5zLTMwMC1hcy1iaXRjb2luLWZvY3VzZWQtY29tZWJhY2stcGxhbi1iaW5hbmNlLXBlcnBldHVhbHMtbGlzdGluZy1mdWVsLXNwZWN1bGF0aXZlLWZyZW56eS_SAZoBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8yOS90ZXJyYXMtdXN0Yy1nYWlucy0zMDAtYXMtYml0Y29pbi1mb2N1c2VkLWNvbWViYWNrLXBsYW4tYmluYW5jZS1wZXJwZXR1YWxzLWxpc3RpbmctZnVlbC1zcGVjdWxhdGl2ZS1mcmVuenkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Terra's USTC Gains 300% as Bitcoin-Focused Comeback Plan, Binance Perpetuals Listing Fuel Speculative Frenzy - CoinDesk",
        "content": "Terra luna classic (LUNC) and USTC are remnants of the sister tokens that underpinned the once-huge, failed Terra ecosystem, developed by Terraform Labs and helmed by co-founder Do Kwon, who was arrested earlier this year. USTC was an algorithmic stablecoin, while LUNC – then named LUNA – was used to balance the stablecoin at a $1 peg. The design proved to be unsustainable and the tokens fell into a hyperinflationary death spiral last May, collapsing the whole multibillion-dollar Terra ecosystem in spectacular fashion."
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZGVjcnlwdC5jby8yMDc4MjQvYml0Y29pbi1taW5pbmctY291bGQtbWl0aWdhdGUtY2xpbWF0ZS1jaGFuZ2UtY29ybmVsbC1zdHVkedIBWmh0dHBzOi8vZGVjcnlwdC5jby8yMDc4MjQvYml0Y29pbi1taW5pbmctY291bGQtbWl0aWdhdGUtY2xpbWF0ZS1jaGFuZ2UtY29ybmVsbC1zdHVkeT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Mining Could 'Mitigate' Climate Change: Cornell Study - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nA new study by researchers at Cornell University found that Bitcoin mining could mitigate against climate change by accelerating the shift to renewable energy.\n\nThe study, “From Mining to Mitigation: How Bitcoin Can Support Renewable Energy Development and Climate Action,” investigated planned renewable energy projects in the U.S., calculating the potential profit from Bitcoin mining during the precommercial development phase.\n\nDuring this phase, wind and solar farms generate energy but are not yet connected to the grid; the study found that this surplus energy could generate millions of dollars in Bitcoin, which \"could be invested in future renewable energy projects.\"\n\nAD\n\nAD\n\nAccording to a press release accompanying the study, Texas alone could generate combined profits of $47 million across 32 planned renewable energy projects, with the 250-megawatt Aktina Solar and Roseland Solar projects generating a potential profit of $3.23 million apiece. The 367-megawatt Western Trail Wind project could account for a further $2.65 million, the study indicated.\n\nThe states of California, Colorado, Illinois, Iowa, Nevada and Virginia also house renewables projects that could potentially profit from Bitcoin mining during the precommercial development phase, according to the study.\n\nThe researchers behind the study recommended providing economic incentives for environmentally friendly crypto mining, such as carbon credits for avoided emissions.\n\n\"These rewards can act as an incentive for miners to adopt clean energy sources, which can lead to combined positive effects on climate change mitigation, improved renewable power capacity and additional profits during precommercial operation of wind or solar farms,\" said co-author Apoorv Lal.\n\nLal also recommended that mining operations be incentivized to return some of their profits to renewable infrastructure developement. \"This would help create a self-sustaining cycle for renewable energy expansion.\"\n\nAD\n\nAD\n\nBitcoin mining and energy consumption\n\nBitcoin has previously come in for criticism of its energy consumption, with the Cambridge University’s Centre for Alternative Energy making headlines in 2021 when it claimed that Bitcoin consumes more energy in a year than Argentina.\n\nMore recently, the University updated its Bitcoin Electricity Consumption Index (CBECI) model, revealing that its earlier power consumption estimates were substantially overstated—with Bitcoin’s 2021 electricity consumption figures reduced by 14% under its new model.\n\nA June 2023 report by crypto intelligence firm Coin Metrics revised Bitcoin mining's energy consumption down further using ASIC model \"fingerprints\" to provide a more granular view of miners' efficiency.\n\nA September 2023 research note by Bloomberg Intelligence analyst Jamie Coutts concluded that the Bitcoin mining industry is now using more than 50% green energy, though the researcher who provided much of Bloomberg's data told Decrypt that the claim is only \"partially correct.\" A combination of more off-grid renewable miners, miners transitioning to sustainable sources, more mining using the Texas grid, and less mining in Kazakhstan have contributed to Bitcoin mining's reduced emissions intensity, they said.\n\nMeanwhile, an academic paper published in August 2023 found that crypto mining using renewables could \"potentially drive a net-decarbonizing effect on energy grids,\" by helping to absorb surplus power generated by wind and solar facilities.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZGVjcnlwdC5jby8yMDc4MjMvYml0Y29pbi1vcmRpbmFscy1tYXJrZXRwbGFjZS1iaW9uaXEtbGF1bmNoZXMtaW50ZXJuZXQtY29tcHV0ZXLSAV5odHRwczovL2RlY3J5cHQuY28vMjA3ODIzL2JpdGNvaW4tb3JkaW5hbHMtbWFya2V0cGxhY2UtYmlvbmlxLWxhdW5jaGVzLWludGVybmV0LWNvbXB1dGVyP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Ordinals Marketplace Bioniq Launches—On Internet Computer - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Ordinals protocol—which enables the inscription of NFT-like assets on the Bitcoin blockchain—commanded the attention of the crypto world at the start of the year, and the space has continued to grow and evolve since. And here’s a new twist: The latest Bitcoin Ordinals marketplace isn’t even built on Bitcoin.\n\nBioniq, which is backed by Polychain Capital and officially opens Wednesday, is instead built on Internet Computer (ICP), the layer-1 blockchain developed by Dfinity that offers integrations with Bitcoin. In this case, Bioniq treats Internet Computer like a layer-2 scaling network of sorts, claiming that it offers various benefits over other Ordinals marketplaces.\n\nIt’s billed as the “world’s fastest” Ordinals marketplace, offers a built-in wallet with optional Google login via Web3Auth, and doesn’t charge network transaction or gas fees to traders.\n\nAD\n\nAD\n\nIt works via a token wrapping process on Internet Computer. Bitcoiners who want to use Bioniq can transfer their Bitcoin and Ordinals assets into the marketplace’s wallet. They can then choose to wrap the Ordinals asset by sending it to a specified Bitcoin wallet address for safekeeping, and then an identical NFT is generated on the Internet Computer network.\n\nFrom there, assets can be traded on the speedier ICP network without gas or transaction fees. While there are extra steps involved to do so, Bioniq believes that this process is ultimately preferable to what most Ordinals marketplaces do, which is utilize partially signed Bitcoin transactions” (PSBTs) to handle transactions on the slower Bitcoin network.\n\n“Even in high Bitcoin fee environments, everything that is wrapped can be transacted at the speed and cost of ICP rather than the speed and cost of Bitcoin, giving users a more reliable (faster and smoother) experience regardless of the fee spikes on Bitcoin,” Bioniq CEO and co-founder Bob Bodily told Decrypt.\n\nBioniq also offers functionality that it claims other Ordinals marketplaces lack, such as allowing for “easily adjustable” offers and enabling English auctions with a set reserve price.\n\nBodily and team also have big plans ahead for the marketplace, with ambitions to build a launchpad for newly minted collections, add a way for users to borrow crypto with their Ordinals assets held as collateral, and enable collection offers made with the intent of buying any asset in a particular desired project.\n\nAD\n\nAD"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2RlY2xpbmUtaW4tZXRoYnRjLXJhdGlvLXNob3dzLWJpdGNvaW5zLXJpc2luZy1tYXJrZXQtZG9taW5hbmNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 30 Nov 2023 08:00:00 GMT",
        "title": "Decline in ETH/BTC ratio shows Bitcoin's rising market dominance - CryptoSlate",
        "content": "What is CryptoSlate Alpha? A web3 membership designed to empower you with cutting-edge insights and knowledge, powered by Access Protocol. Learn more ›\n\nConnected to Alpha Welcome! 👋 You are connected to CryptoSlate Alpha. To manage your wallet connection, click the button below.\n\nImportant: You must lock a minimum of 20,000 ACS If you don't have enough, buy ACS on the following exchanges: Coinbase Kucoin Orca\n\nConnect via Access Protocol Access Protocol is a web3 monetization paywall. When users stake ACS, they can access paywalled content. Learn more ›\n\nDisclaimer: By choosing to lock your ACS tokens with CryptoSlate, you accept and recognize that you will be bound by the terms and conditions of your third-party digital wallet provider, as well as any applicable terms and conditions of the Access Foundation. CryptoSlate shall have no responsibility or liability with regard to the provision, access, use, locking, security, integrity, value, or legal status of your ACS Tokens or your digital wallet, including any losses associated with your ACS tokens. It is solely your responsibility to assume the risks associated with locking your ACS tokens with CryptoSlate. For more information, visit our terms page."
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vaW50ZXJlc3RpbmdlbmdpbmVlcmluZy5jb20vc2NpZW5jZS9iaXRjb2lucy13YXRlci1mb290cHJpbnQtc3VzdGFpbmFiaWxpdHktY2hhbGxlbmdl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin mining could dry up the world of its water bodies - Interesting Engineering",
        "content": "Bitcoin, the most popular cryptocurrency, consumes not only a huge amount of electricity but also a lot of water, according to a new study. The study, published in the journal Cell Reports Sustainability, estimates that Bitcoin mining uses over 1,600 gigaliters (GL) of water per year globally, enough to fill 640,000 Olympic-sized swimming pools. This water is used primarily to cool down the computers that run the complex calculations to generate new Bitcoins."
    },
    {
        "id": 95,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZGVjcnlwdC5jby8yMDc4OTUvY2hhcmxpZS1tdW5nZXItbWVtZS1jb2luLXB1bXBzLTMxMDAwLWJpdGNvaW4taGF0ZXJzLWRlYXRo0gFZaHR0cHM6Ly9kZWNyeXB0LmNvLzIwNzg5NS9jaGFybGllLW11bmdlci1tZW1lLWNvaW4tcHVtcHMtMzEwMDAtYml0Y29pbi1oYXRlcnMtZGVhdGg_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 29 Nov 2023 08:00:00 GMT",
        "title": "Charlie Munger Meme Coin Pumps 31,000% After Bitcoin Hater's Death - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIt didn’t take long for degens to dance on the grave of longtime crypto hater and Warren Buffett consigliere Charlie Munger, who died yesterday at the age of 99.\n\nIn fact, It took less than 15 minutes after Berkshire Hathaway announced its vice chairman’s passing for a Munger memecoin (MUNGER) to debut on decentralized exchange Uniswap. Those intrepid degen reflexes appear to have paid off: The Ethereum-based token is up 409% in the last 24 hours, according to GeckoTerminal. Shortly after its launch, the token was up over 31,500%.\n\n\n\nTo be clear, MUNGER is still six decimal spots shy of being worth more than a penny—it’s sitting at just $0.00000001884 as of this writing. It’s also highly volatile, and is already down 34% in the last hour. But that hasn’t stopped irony-poisoned meme coin traders from pumping the token with $3.57 million in trading volume since yesterday. The coin currently sits at a market capitalization just north of $132,000—though that figure, too, is already falling.\n\nAD\n\nAD\n\nHow would the late Munger take the news that his passing lined the pockets of at least a few “shitcoin” aficionados? Probably not very kindly.\n\nCharlie Munger meme coin up 31,500% in the last hour God would he hate this pic.twitter.com/9sU5BCSZB2 — Michael McQuaid (@michaelgmcquaid) November 28, 2023\n\n\"I'm not proud of my country for allowing this crypto shit,\" Munger said earlier this year. \"It's worthless, it's no good.\"\n\nThe year prior Munger compared crypto to a venereal disease, skewering the entire industry as \"beneath contempt.\"\n\n\"I just think the whole damn development is disgusting and contrary to the interests of civilization,\" he said at the time.\n\nAD\n\nAD\n\nAnd that’s not even to get into Bitcoin specifically, which he routinely referred to as “rat poison.”\n\nMeme coins have a rich and storied history of capitalizing on breaking news to pump highly speculative tokens of questionable origin. Just last week, a freshly-minted CZ token, created in the immediate aftermath of Changpeng Zhao’s shocking resignation as Binance’s CEO, pumped 18,000%.\n\nThat price movement comes with a hefty price tag, however: Meme coins like MUNGER are routinely “rug-pulled” by their anonymous creators, who withdraw liquidity and leave investors holding the bag.\n\nSuch moves could be condemned as “massively stupid,” “evil,” “no good,” or “very dangerous.” But that’s nothing Munger hasn’t said already.\n\nEdited by Andrew Hayward"
    }
]