[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmdyZWVucGVhY2Uub3JnL3VzYS9ibGFja3JvY2tzLWJpdGNvaW4tYmV0cy1hcmUtYmFkLWZvci10aGUtcGxhbmV0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "BlackRock’s Bitcoin Bets Are Bad For The Planet - greenpeace.org",
        "content": "BlackRock’s Bitcoin Bets Are Bad For The Planet\n\nBlackRock, the world’s largest asset manager, is placing a big bet on Bitcoin that could drive up the digital asset’s price and its climate-damaging pollution. Despite pledges to reduce carbon emissions and acknowledgement that climate risks are investment risks, BlackRock is investing in dirty Bitcoin without acknowledging its energy intensity or carbon emissions. This is bad news for the planet.\n\nIn June 2023, BlackRock applied for an exchange-traded fund (ETF) tied to the price of Bitcoin. This first-of-its-kind product made headlines and was followed by a spike in the price of bitcoin.\n\nAn ETF is basically a way for investors to bet on Bitcoin’s value without having to actually buy and hold bitcoin, which can be tricky as well as risky. A Bitcoin ETF managed by a large company like BlackRock could attract many more mainstream investors. But the potential profits for BlackRock and investors would come at a sharp cost to the climate and the rest of society. When Bitcoin’s price and trading volume goes up, so does its energy consumption and carbon emissions. With Bitcoin’s annual carbon emissions already at the scale of a mid-sized industrial country, the world simply can’t afford to support Bitcoin’s price growth.\n\nBlackRock’s ETF proposal builds on other products and services the company offers that enable investing in Bitcoin. In 2022, the company launched a private bitcoin trust that would let institutional investors bet on the price of Bitcoin. This was part of a larger effort to make it more convenient for investors to manage Bitcoin alongside their standard portfolios of stocks and bonds. BlackRock partnered with Coinbase, the crypto exchange company, to integrate Bitcoin into the Coinbases popular investment management platform called Aladdin which would let clients track their bitcoin holdings and trade bitcoin via Coinbase’s exchange.\n\nBlackRock is also putting some of its massive assets into Bitcoin mining companies – the facilities that create Bitcoin’s large carbon footprint. Greenpeace USA research finds that BlackRock controls nearly $600 million worth of shares in Bitcoin mining companies and has shares in most of the large publicly traded miners. These investments are vital for mining companies to access funding for their energy-intensive facilities. For example, BlackRock controlled over 28 million shares valued at $300 million in Riot Platforms, which owns the most energy-intensive U.S. crypto mine in Rockdale, Texas that uses as much electricity as the nearest 300,000 homes. And nearly all that energy is supplied by fossil fuels.\n\nBlackRock also has ties to Bitcoin miners keeping dirty coal power plants alive. The company owns $2.8 million worth of bonds in Marathon Digital whose mining facility helped keep the coal-fired Hardin Generating Station in Hardin, MT operating past its planned closure in 2018. In 2021, this led to 755,700 tons of CO2 emissions and local air pollution with 304 tons of sulfur dioxide and 245 tons of nitrogen oxides. BlackRock also controls a nearly 6% share in Greenidge Generation Holdings, a company that converted a closed coal plant to fossil gas in upstate New York to power a Bitcoin mine. Regulators and the public have scrutinized the facility for its pollution.\n\nAnd when mining companies struggle financially, BlackRock has helped them stay afloat. When Core Scientific filed for bankruptcy in 2022, BlackRock joined a group of creditors that lent the company around $500 million, chipping in $38 million, and contributing another $17 million loan to help Core Scientific operate during bankruptcy.\n\nYet, BlackRock could turn its resources, expertise, and clout towards transforming Bitcoin and mobilizing stakeholders to work on innovative solutions that slash Bitcoin’s carbon footprint while maintaining its key features. Cryptocurrencies don’t have to use massive amounts of electricity. Most don’t, and they can change. Now is the time for BlackRock to acknowledge Bitcoin’s pollution and help solve the problem."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDgvMTQvcHJvLWJpdGNvaW4tY2FuZGlkYXRlLWphdmllci1taWxlaS11bmV4cGVjdGVkbHktbGVhZHMtaW4tcHJlc2lkZW50aWFsLXZvdGluZy1pbi1hcmdlbnRpbmEv0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOC8xNC9wcm8tYml0Y29pbi1jYW5kaWRhdGUtamF2aWVyLW1pbGVpLXVuZXhwZWN0ZWRseS1sZWFkcy1pbi1wcmVzaWRlbnRpYWwtdm90aW5nLWluLWFyZ2VudGluYS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Pro-Bitcoin Candidate Javier Milei Snags Primary Presidential Elections in Argentina - CoinDesk",
        "content": "With no candidate likely to obtain more than 45% in today’s polling, a general election among the winner for each party will be held in October. If no one receives 45% in that vote, a final runoff vote will be held in November."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMDgvMTQvc2VjLWRlbGF5cy1kZWNpc2lvbi1vbi1hcmstMjFzaGFyZXMtc3BvdC1iaXRjb2luLWV0Zi1jbmJjLWNyeXB0by13b3JsZC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "SEC delays decision on ARK 21Shares spot bitcoin ETF - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nSEC delays decision on ARK 21Shares spot bitcoin ETF: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Puneet Singhvi of Citi discusses how institutions are making use of crypto and blockchain technology in their portfolios and businesses."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vam91cm5hbHJlY29yZC5jb20vMjAyMy8wOC8xNC93YWxsLXN0cmVldC1sb29rcy1yZWFkeS1mb3ItYml0Y29pbi1kZXNwaXRlLXNlYy11bmNlcnRhaW50eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Wall+Street+looks+ready+for+Bitcoin%2C+despite+SEC+uncertainty - Journal Record",
        "content": "Listen to this article Listen to this article\n\nOnce the pariah of the financial world, Bitcoin’s staying power has won over Wall Street. Asset managers now are racing to bring the world’s first and largest cryptocurrency to millions of Americans.\n\nBlackRock is leading the charge in a new spate of filings to launch a Bitcoin (BTC) spot price ETF. Invesco, VanEck and WisdomTree are in hot pursuit of their proposed funds.\n\nYet the Securities and Exchange Commission has been on a regulatory tirade against crypto this year, launching investigations into Coinbase and Binance and threatening to freeze their access to the U.S. banking system.\n\nWhere is Wall Street and the US government’s clash over crypto headed?\n\nSpot ETFs aren’t the only thing that is happening. Newcomer crypto exchange EDX Markets, funded by finance titans like Charles Schwab and Fidelity Digital Assets, opened trading for BTC and ether (ETH) last month.\n\nThe institutional adoption of crypto is wider than the US too. Across the pond in Europe, Deutsche Bank also revealed it had applied for a digital asset custody license in Germany.\n\nThe news has triggered a price pump for Bitcoin that recently went north of $31,000, reaching new 14-month highs. Yet the regulatory chess game is far from over. The industry is sitting tight as it awaits the SEC’s next move.\n\nGoing mainstream?\n\nWhile Wall Street is keen to bring BTC into the financial big league, regulators in Washington still need to be ready to give it an entry pass. On June 30, the SEC claimed BlackRock and Fidelity’s filings were insufficient and lacked clarity. However, that has yet to deter BlackRock, and the world’s largest asset manager served up a refreshed filing just days later.\n\nThe direction of travel seems toward greater adoption, and some financial advisors see the asset’s time has come.\n\n“Wall Street will prevail, just a matter of when, not if,” says Bryan Courchesne, CEO of Digital Asset Investment Management (DAIM). “BlackRock and Fidelity aren’t going to waste their time with repeated filings. They must feel like there is a high likelihood of succeeding in the near future. Maybe they have to amend small details and refile, but we think that within eight months, there will be at least one spot BTC ETF available to investors.”\n\nIf it does hit the market, the question for investors interested in crypto then becomes whether to buy up this unique ETF vs. mutual funds that offer exposure to blockchain technologies. And if so, whether to trade on short-term fluctuations in price or go long and hold on for good (or to “hold” as it is known in the crypto community).\n\nDespite its relatively short history, investors who have invested in actual Bitcoin typically have a long-term horizon. On-chain analysis from February this year shows the average time that Bitcoin (BTC) stays in an address before being transferred is 3.8 years (or around 45 months), a testament to the confidence in the asset’s long-term prospects. Age is another factor; crypto investing is also particularly prevalent among younger investors.\n\nA 2022 survey from Investopedia shows millennials are the most bullish on crypto, with 38% owning some form of cryptocurrency investment. They were followed by Gen X and Gen Z investors, with 28% and 23% holding crypto assets, respectively.\n\nNot all crypto assets are made equal, and investors should be aware of the fundamentals behind the quirky names and shiny logos of new de-fi projects. Courchesne warns crypto investors to avoid altcoins – a term for non-Bitcoin cryptocurrencies.\n\nThey are controlled by entities that need naive investors to provide liquidity so that they can dump their coins and make money,” he adds. “If you are going to invest in crypto, we highly recommend sticking to BTC and ETH for now,” Courchesne says. “We would weight a portfolio more to Bitcoin since it is still relatively safer than ETH.”\n\nOthers extend a cautious word of warning for any form of blockchain-based coin.\n\n“We advise against clients holding any portion of their portfolio in cryptocurrency,” Caleb Vering, associate wealth adviser at Farnam Financial. “We consider any crypto to be an extremely volatile and highly speculative asset unsuitable for most investors.”\n\nBitcoin is broadly used as a hedging asset and, similarly to gold, as a digital store of value. Some experts see BTC may have already achieved that state.\n\n“To some extent, Bitcoin is already in the past,” says Chris Chen, CFP and wealth strategist at Insight Financial Strategists. “It has already achieved a status analogous to gold as a safe haven.”\n\nYet can it serve as an international reserve currency like the gold standard did before the end of the Bretton Woods system? BlackRock’s Larry Fink may consider it a new “international asset,” yet Bitcoin is unique among cryptocurrencies for its resilience and longevity, its relationship to nationalized fiat currencies is more dubious.\n\nA major disrupter could be the arrival of state-backed stablecoins that function on blockchain technology but remain run by government authorities. Depending on adoption, stablecoins could undermine Bitcoin’s utility and puncture a hole in its market value.\n\nChen says the US government is unlikely to cede the power it gains from the greenback to a decentralized currency that is out of its hands. “It is much more plausible that our government will introduce its own blockchain-based currency that it will control,” he adds. “The Chinese yuan is already partially on blockchain … many other major currencies are exploring blockchain applications. While the future of currency is likely to be associated with blockchain implementations, they are going to be controlled by governments as they are today.”\n\nThe arrival of a BTC-based ETF simplifies crypto investing and enables retail investors to easily add exposure to Bitcoin in retirement plans and brokerage accounts as they would gold or oil futures, potentially rocketing adoption levels to new heights. Yet the cryptocurrency’s long-term value will be determined by whether it can fulfill its promise as a form of digital gold in the global financial system.\n\nUltimately, the value of crypto will be determined by regulations and the success of the government’s efforts to produce a state-centric clone that would once again kick Bitcoin to the sidelines of the global financial system. In any case, the “digital gold” saga has a long way to go yet."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL2ZvcnR1bmUuY29tL3ZpZGVvcy93YXRjaC90aGUtdWx0aW1hdGUtZ3VpZGUtdG8tYnV5aW5nLWJpdGNvaW4tc2FmZWx5JTNBLXRpcHMtdG8tYXZvaWQtZ2V0dGluZy1zY2FtbWVkLzViYzZiNzkzLWEyZWItNDY3OS1iNTY0LTQ2MjY4YmIxYjc2ZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "The ultimate guide to buying Bitcoin safely: Tips to avoid getting scammed - Fortune",
        "content": "Coinbase, Binance, Kraken, and other exchanges have made buying and selling Bitcoin simpler over time, but it’s still a very unregulated space full of traps. Here’s how to buy and sell Bitcoin safely."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjQ0NTk3L3NlYy1iaXRjb2luLWV0Zi1qb2huLXJlZWQtc3RhcmvSAUdodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNDQ1OTcvc2VjLWJpdGNvaW4tZXRmLWpvaG4tcmVlZC1zdGFyaw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Current SEC won't approve a spot Bitcoin ETF, former office chief says - The Block",
        "content": "The U.S. Securities and Exchange Commission will not approve a spot Bitcoin exchange-traded fund — at least, that's the opinion of the agency's former Office of Internet Enforcement chief, John Reed Stark.\n\n\"My take is that the current SEC will NOT approve a bitcoin spot ETF application for a range of compelling reasons,\" Stark wrote today on X (formerly Twitter).\n\nHowever, Stark shared that if a Republican wins the White House in 2024, the SEC will likely decrease its crypto-enforcement efforts and \"become far more receptive to approving a bitcoin spot ETF and far more likely to take other significant crypto-friendly regulatory actions.\"\n\nStark also claims that if the next President is a Republican, current SEC chair Gary Gensler \"would likely resign,\" and Hester Peirce — known as \"Crypto Mom\" in the industry — could become acting chair, and \"crypto-related SEC disruption would grind to a screeching halt.\"\n\nSEC vs. crypto\n\nRELATED INDICES See crypto indices\n\nThe SEC has, in recent history, stepped up crypto-enforcement efforts.\n\nEarlier this week, crypto exchange Bittrex settled with the agency for $24 million after being charged for operating as an unregistered exchange in April.\n\nThe SEC also filed a letter with the Southern District of New York on Wednesday seeking leave for an interlocutory appeal in the summary judgment order in the Ripple Labs case — widely seen as a partial defeat for the agency.\n\nTo date, the SEC has approved no spot Bitcoin ETF after years of attempts."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXRyYWRpbmctc2lkZXdheXMtbmZ0LXRyYW5zYWN0aW9ucy0wMjE4NTUwMDQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin trading sideways; NFT transactions soar; Nvidia leads Wall Street rally - Yahoo Finance",
        "content": "Bitcoin edged higher on Tuesday morning in Asia but failed to breach the US$29,500 resistance level. Ether also edged up, while other top 10 non-stablecoin cryptocurrencies traded flat to higher. Solana’s SOL led the winners. As risk sentiment improved in the wake of weak U.S. inflation data, last week saw an inflow for digital asset investment products after three consecutive weeks of outflows. Meanwhile, the Forkast 500 NFT index moved up after the NFT market logged the largest weekly total transactions since February 2022. U.S. stock futures traded mixed after Wall Street closed higher Monday on the back of a rally led by chipmaker Nvidia.\n\nA blessing in disguise\n\nBitcoin edged up 0.35% in the last 24 hours to US$29,408.45 as of 07:30 a.m. in Hong Kong, and logged a weekly gain of 0.91%, according to CoinMarketCap data. The world’s leading cryptocurrency reached a high of US$29,660.25 early Tuesday morning.\n\nBitcoin’s price has remained largely within the $29,000 to $30,600 range for the past seven weeks, causing frustration among investors seeking higher rewards. However, low volatility could be a blessing in disguise, Nigel Green, founder and chief executive officer of financial management group deVere, said in an emailed statement.\n\n“This newfound stability attracts institutional investors, who have been historically wary of entering the market due to its extreme price swings,” Green said.\n\n“This stability is also a boon for businesses and consumers looking for a reliable store of value or medium of exchange,” he added.\n\nMatteo Greco, research analyst at Canada-based digital asset investment firm Fineqia International, said in an emailed note that low volatility does not necessarily mean low investor interest in the coin.\n\nGreco pointed to the Bitcoin long-term holder level — a metric that measures the percentage of Bitcoin holders who have held the coin for over 155 days —which reached its highest ever level over the first week of August.\n\nStory continues\n\n“The data shows how the vast majority of BTC holders did not execute trades in the last few months, as the low volumes and the almost inexistent volatility recorded in the last two months suggest,” said Greco.\n\n“These numbers are also typical to be observed during the summer months, especially July and August, and do not reflect a decrease in investors’ interest towards the digital asset market,” he added.\n\nMeanwhile, digital asset investment products saw an inflow of US$29 million in the week ending August 11. That followed three consecutive weeks of outflows totalling around US$144 million, according to a Monday report by European alternative asset manager CoinShares. Bitcoin saw an inflow of US$27 million — roughly 93% of the total inflows.\n\nThe inflows to digital asset investment products are “likely due to the recent U.S. inflation data, which was slightly below expectations, signifying that a September rate hike is less likely,” CoinShares wrote in the report.\n\nAlong with Bitcoin, Ether gained 0.22% to US$1,844.14 and added 1.05% for the past seven days. Other top 10 non-stablecoin cryptocurrencies all traded higher with the exception of Dogecoin, which inched 0.06% lower to US$0.07477 but gained 2.05% for the week.\n\nSolana’s SOL led the winners, rising 3.50% to US$25.17 for a 9.42% weekly gain.\n\nSynesis One, an artificial intelligence (AI) data crowdsourcing platform based on the Solana blockchain, launched its new train-to-earn application “Workspace by Synesis” on Monday.\n\nThe app allows users to train AIs as data providers while earning cryptocurrencies as rewards. This process, Synesis One claims, will result in a “fully traceable and auditable” data supply chain.\n\nWe are proud to announce the launch of the Synesis One AI data crowdsourcing app on @solana Mainnet! 🎉🎉https://t.co/L4Bjq5upgT\n\n\n\nMore information in the 🧵below! pic.twitter.com/eyd4wtBHYD — Synesis One (@synesis_one) August 14, 2023\n\nOutside the top 10 cryptos, HBAR, the utility token of distributed ledger technology platform Hedera Hashgraph, saw its price surge 13.59% in the past 24 hours to US$0.06666. That contributed to a weekly jump of 12.89%.\n\nHBAR received a boost after Dropp, a Hedera-based micropayments application, was added to the U.S. Federal Reserve’s instant payments platform FedNow. The Fed-run service allows merchants to “accept small-value purchases digitally without paying large transaction fees” following its launch in July.\n\nThe total crypto market capitalization moved up 0.40% in the past 24 hours to US$1.17 trillion, while trading volume rose 47.95% to US$28.52 billion.\n\nWeekly NFT transactions hit year-long high\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe main Forkast 500 NFT index moved up 0.39% in the past 24 hours to 2,486.89 as of 09:50 a.m. in Hong Kong, and notched a 0.27% gain for the week. Forkast’s Ethereum and Polygon NFT indexes also logged gains, while the indexes for Solana and Cardano dropped.\n\nTotal NFT trading volume rose 22.88% in the past 24 hours to over US$16.48 million, according to data from CryptoSlam. Volumes on the Ethereum, Solana, Polygon, and Cardano blockchains all logged gains, while volume on the Bitcoin blockchain dipped.\n\nIn the week ending August 13, NFT sales topped US$101 million after sitting short of US$100 million for three consecutive weeks. Meanwhile, NFT transactions for the week totaled more than 2.80 million, a high not seen since February 2022.\n\nYehudah Petscher, NFT Strategist at Forkast Labs, commenting on the past week’s surge in NFT sales, said that he saw the emergence of low-priced collections as key to a sustained potential uptick in the market.\n\n“We’re getting a glimpse of the future of NFTs. More affordable prices, higher volume, likely big brands and this is what we’re seeing in DraftKings, DMarket, Gods Unchained, and Sorare,” said Petscher.\n\nCombined, Petscher noted, those three collections alone notched 872,185 transactions — nearly a third of the week’s total transactions.\n\n“The question is, is this sustainable? I think it is, and that’s exactly why this will be the future. Traders haven’t really left NFT, they just ran out of liquidity since there’s no profits. But they can afford NFTs that are priced at just a few dollars,” Petscher added.\n\nAmong NFT collections, Ethereum-based DeGods saw the largest 24-hour sales volume. The collection surged 144.25% to over US$2.21 million after the project launched its “Season 3” digital art collection on Sunday.\n\nRather than introducing new NFTs, Season 3 allows its holders to upgrade their original DeGods NFT and receive four generative artworks.\n\nMythos Chain-based DMarket and ImmutableX-based Gods Unchained — two video game-adjacent collections — came in second and third place in terms of 24-hour sales volume.\n\nMeanwhile, global beverage giant Coca-Cola Company introduced its “Masterpiece” NFT collection on Monday. The collection combines classic and contemporary art pieces with virtual coca-cola bottles, the company said.\n\nCheck out the link below to see the full Masterpiece collection https://t.co/PQoKJCmUWe — Coca-Cola (@CocaCola) August 13, 2023\n\nThe collection is issued on the Base blockchain, an Ethereum layer-2 network recently launched by crypto exchange Coinbase.\n\nNvidia leads US equities rally\n\nNvidia headquarters in Santa Clara, California|Image: Getty Images\n\nU.S. stock futures traded higher as of 11:20 a.m. in Hong Kong following gains at the close of trading Monday. The tech-heavy Nasdaq led the gains with a rise of 0.34%.\n\nIn Asia, the main stock indexes traded mixed on Tuesday morning. China’s Shanghai Composite, Hong Kong’s Hang Seng and South Korea’s Kospi all logged losses, while Japan’s Nikkei moved higher.\n\nArtificial intelligence (AI) chipmaker Nvidia Corporation posted a rise of 7.09% on Monday, its highest daily rise since May. That jump followed a note from multinational investment bank Morgan Stanley that described the U.S. tech giant as its “top pick” amid a “massive shift in spending towards AI.”\n\nNvidia’s highly anticipated quarterly earnings report is due for release next week.\n\n“It’s the first day in a while that tech has really significantly outperformed,” Jay Hatfield, CEO of U.S.-based investment advisor Infrastructure Capital Advisors, told Reuters.\n\n“That’s indicative of the fact that you have this blockbuster Nvidia report coming up and that could support the tech market pretty substantially,” Hatfield added.\n\nU.S. investors now await the release of retail sales data on Tuesday, followed by the U.S. Federal Reserve’s July meeting minutes on Wednesday, for further insight on the health of the U.S. economy and the Fed’s future monetary policies.\n\nThe Fed meets on Sep. 19 to make its next move on interest rates, which are now between 5.25% to 5.50%, the highest level since January 2001. Analysts at the CME FedWatch Tool predict a 88.5% chance there will be no interest rate hike in September.\n\nElsewhere, China’s central bank unexpectedly lowered the rate of its medium-term lending facility (MLF) by 15 basis points to 2.5% on Tuesday, only two months after the previous rate cut in June.\n\n“The slightly earlier timing and a larger than expected 15 basis point rate cut of MLF show that Beijing feels the urgency to take more policy easing actions to stabilize expectations and growth,” Xiaojia Zhi, chief China economist at international banking group Credit Agricole, told Bloomberg.\n\nZhi added that China could see more monetary easing in the coming months.\n\nThe decision was announced shortly before China’s National Bureau of Statistics reported disappointing economic data for July. That data included a rise in the urban unemployment rate, as well as decelerated and smaller-than-expected growth in retail sales and industrial production, according to the Wall Street Journal.\n\n(Updates with equities section.)"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGYtcmV2b2x1dGlvbi1iaXRjb2luLWNyeXB0b2N1cnJlbmNpZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "An ETF will bring a revolution for Bitcoin and other cryptocurrencies - Cointelegraph",
        "content": "But not everyone’s on board with the crypto ETF train. Critics argue that Bitcoin-linked ETFs could be even worse than centralized exchanges for the crypto market. Their main beef? There’s zero possibility of withdrawing the underlying instrument. This means the holders are never able to take advantage of the single most important feature of Bitcoin: the ability to control their funds without a need to trust anyone.\n\nAnd it’s not just talk. The potential of these investment vehicles is already being realized in markets like Canada. The Purpose Bitcoin ETF, for example, raked in over $400 million in assets under management within just two days of its launch. It’s no longer a question of whether crypto is an asset class.\n\nIt’s like a starter pistol has been fired, and the institutional investors are off to the races, setting the stage for a seismic shift in the financial landscape, with crypto ETFs as the starting block.\n\nCrypto ETFs unleash a domino effect\n\nETFs are a huge business. BlackRock alone managed circa $3 trillion in client assets in ETFs at the end of March 2023 across a range of stocks, bonds and commodities.\n\nThe approval of crypto ETFs indicates more than just mainstream acceptance — it can drive market maturity, establish price stability and foster innovation, leading to the creation of ETFs for a broader range of digital assets and decentralized finance (DeFi) tokens, similar to how the approval of the first ETF in 1993 led to a diverse range of ETFs today.\n\nRelated: BlackRock’s misguided effort to create ‘Crypto for Dummies’\n\nBut not everyone’s on board with the crypto ETF train. Critics argue that Bitcoin-linked ETFs could be even worse than centralized exchanges for the crypto market. Their main beef? There’s zero possibility of withdrawing the underlying instrument. This means the holders are never able to take advantage of the single most important feature of Bitcoin: the ability to control their funds without a need to trust anyone.\n\nWith the potential to become as mainstream as their stock or bond counterparts, crypto ETFs could usher in a diverse range of investors. But the real disruptive element? Institutional-grade custody.\n\nRace for crypto ETFs fuels the impetus for institutional custody\n\nTo be clear, it’s not just the custody technology that is disruptive but also the investor protection standards imposed on licensed custodians. As traditional financial institutions take the plunge and launch crypto-related trading products in the United States, the demand for institutional-grade custody solutions is skyrocketing. Early August alone saw six major asset managers file applications to launch Ether (ETH) futures ETFs to U.S. customers.\n\nBlackRock’s expansion into crypto this past year has been bolstered by its partnership with Coinbase, which, according to filings, would be in charge of safekeeping the Bitcoin in the BlackRock ETF and provide market surveillance to reduce fraud and market manipulation.\n\nThe crypto custody market itself is expanding rapidly. According to Markets and Markets, the crypto custody market was worth an estimated $223 billion in January 2022, up from $32 billion in January 2019. And it’s not slowing down anytime soon, with estimates predicting a compound annual growth rate of 26.7% through 2028.\n\nRelated: Bitcoin ETFs: Even worse for crypto than central exchanges\n\nThe complexity and risk associated with a broader range of digital assets necessitate robust custodial services. As we transition into Custody 3.0 — an era characterized by active participation in the decentralized economy — these services are evolving to include connectivity to on-chain services and DeFi applications. The key for digital asset custodians is to build on existing infrastructure and offer comprehensive services to monetize digital assets within a high-standard operational framework.\n\nIn this context, fully licensed digital asset custodians become trusted partners, enabling financial institutions to integrate digital assets into their business operations in a safe, scalable, compliant manner.\n\nRegulatory hurdles and triumphs\n\nIt’s been a brutal stretch for the crypto industry since the market peak in late 2021, but the frenzy of crypto ETF filings from Wall Street’s biggest names has shown that this corner of the market is generating attention.\n\nRegulation remains the biggest hurdle in the United States. Various fund companies have been trying for years to get crypto ETFs approved, only to be rejected over concerns of fraud and market manipulation.\n\nBut it’s not all gloom on the regulatory front. Outside of the U.S., we’re seeing a global trend toward clearer regulatory frameworks for digital assets. It’s like a regulatory domino effect, paving the way for the creation of strategic digital asset hubs in locations such as Singapore, Hong Kong, the United Arab Emirates and Europe. The implementation of these frameworks will not only accommodate the growth and diversity of the crypto market but also increase transparency and investor protection, benefiting both the industry and its participants. And as they become more robust, they’re laying the groundwork for investment vehicles like crypto ETFs, further fuelling institutional demand.\n\nWith Hong Kong recently debuting retail crypto trading via licensed exchanges, it may not be long before we see the first spot crypto ETF in Asia.\n\nGradually, then suddenly\n\nThe domino effect triggered by crypto ETFs is not just a shift — it’s a revolution. It’s an impending transformation that will redefine the financial landscape. And it’s not just about money. It’s about the potential for a more inclusive, transparent and efficient financial system that paves the way for broader market access.\n\nSo, the question is not whether to embrace the crypto revolution to get ahead but rather how to do so effectively or risk getting left behind. The dominos are falling. The time to act is now.\n\nCalvin Shen has more than 10 years of financial services and investment experience across fintech startups and asset management. As the managing director at Hex Trust, Shen works closely with clients globally to provide bespoke blockchain and custody solutions to help them bridge the worlds of digital assets and traditional finance. Prior to joining Hex Trust, Calvin held numerous roles across institutional sales and business development at leading firms such as PIMCO, Figure Technologies, Deloitte and BNY Mellon. He holds an MBA from Columbia Business School and a BA in economics from UC San Diego, and is a CFA and CAIA charterholder.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vYml0Y29pbi12cy1jYXJkYW5vL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Vs. Cardano - What's the Difference? - Securities.io",
        "content": "It's common for traders to compare Bitcoin and Cardano as both projects have a strong reputation and have been in operation for years. These networks share some features in common, but their overall functionality, options, and purpose are different. Learning these differences is a crucial first step to understanding which project best fits your trading strategy.\n\nWhat is Bitcoin?\n\nBitcoin is the world's first successful cryptocurrency. This coin changed the world forever when Satoshi Nakamoto, the project's anonymous founder posted its whitepaper in 2008. The following year, Bitcoin was released as an open-source project to the world. The token was unique to its predecessors in many ways.\n\nFor one, Bitcoin was the first decentralized currency to operate properly. It conquered the double-spend issue which had plagued all previous crypto attempts. The double send issue refers to how early digital currencies could be sent, and then another transaction could be sent before the first one cleared. Nakamoto changed the game when he added a timestamp to transactions which made this hack impossible.\n\nThere is a lot of speculation as to why Bitcoin was created. However, Nakamoto never clearly expresses any direct reasoning only technical goals such as making the network “a digital peer-to-peer electronic cash system.” However, he did place some information in the genesis block that refers to another bank bailout.\n\nWhat is Cardano?\n\nCardano was created in 2015 by Charles Hoskinson – a former Ethereum co-founder. Charles Hoskinson wanted to build a programmable blockchain network that was more secure and faster than competitors. The main goal of the project was to create a decentralized network that leveraged the scientific method and academic processes during creation.\n\nToday, Cardano still has a strong integration into academic systems. Interestingly, the network is sprinkled with clues to its overall academic goals. For example, the name Cardano comes from the famous Renaissance mathematician, Gerolamo Cardano,\n\nWhat Problems Was Bitcoin Built to Alleviate?\n\nBitcoin helped to usher in a new age of decentralized finance. The token has enabled millions of people to escape the skewed financial system. The decentralized nature of the token and its unique characteristics have made it an excellent store of value and are a far more transparent option compared to fiat currencies.\n\nBitcoin eliminated the need for a central bank and made it possible for the community to conduct secure transactions. The coin is much cheaper to send internationally and can be transmitted in a permissionless manner thanks to the technical characteristics of PoW blockchain networks. Users can send Bitcoin anywhere in the world without worrying about censorship. Additionally, anyone can hold and save Bitcoin. The network is set up to support non-custodial wallets, which means that you are the only one who can ever access your crypto.\n\nWhat Problems Was Cardano Built to Alleviate?\n\nCardano was built with a more forward-looking stance than Bitcoin as it had the advantage of entering the market long after. When Cardano entered the market, the crypto sector had already evolved considerably. As a third-generation cryptocurrency, Cardano supports the creation of blockchain assets, networks, and Dapps.\n\nCardano was built with sustainability in mind. The network uses just a fraction of the energy required to keep Bitcoin valid. This environmentally friendly approach was part of the team’s long-term strategy to make Cardano the ideal programmable blockchain infrastructure provider for the academic sector.\n\nCardano also improved transaction throughput when compared to Bitcoin or Ethereum. Scalability concerns have long been an issue in the blockchain sector. Cardano was designed to provide more scalability, reduce network congestion, and provide a smart alternative to other programmable networks a the time such as Ethereum.\n\nHow Does Bitcoin Work?\n\nBitcoin uses blockchain technology to remain valid. The system is designed to place blocks of transactions in order based on their timestamps. The network eliminates centralized groups like banks and replaces these groups with network nodes.\n\nThe Bitcoin network nodes go by the name miners. In the Bitcoin consensus mechanism, these groups compete against each other to be the first to answer a complex mathematical equation. The first node to complete the equitation qualifies for the reward.\n\nThis reward is the only time that new Bitcoin enters the market. This strategy gives the token a predictive issuance. When you couple this issuance schedule with the limited supply of 21M tokens, it’s easy to see why Bitcoin has gained value due to scarcity since its launch.\n\nBTC\n\nBitcoin is the cryptocurrency for the Bitcoin network. This cryptocurrency can be sent internationally and is censorship resistant. Notably, as the world’s first cryptocurrency, the Bitcoin network is limited in its functionality. However, recent add-ons like the off-chain protocol, the Lightning Network, have helped the coin remain competitive in the face of newer more capable options. In addition, Bitcoin is one of the very few digital assets to have been granted some level of regulatory clarity.\n\nHow Does Cardano Work?\n\nCardano leverages a Proof-of-Stake consensus mechanism. This system varies from the PoW miners needed to keep Bitcoin valid. In the Cardano ecosystem, users can stake their tokens to secure returns. Staking is the process of locking your tokens into a smart contract for a predetermined time.\n\nStaking networks are faster, more efficient, and provide better opportunities to their users. The main reason why is that they don’t require mining rigs or technical skills to join and secure rewards. Another major reason why Cardano is so popular is that the network has a seamless upgrade process. There is no need to conduct hard forks to upgrade the network which keeps the system nodes in sync.\n\nADA\n\nEven Cardano’s token has an academic twist. The token ADA is named after the 19th-century mathematician Ada Lovelace. Lovelace is generally regarded as the first computer programmer. ADA can be used to pay fees, access features, and send value internationally.\n\nHow to Buy Bitcoin (BTC) and Cardano (ADA)\n\nCurrently, Bitcoin (BTC) and Cardano (ADA) are each available for purchase on the following exchanges:\n\nUphold – This is one of the top exchanges for United States & UK residents that offers a wide range of cryptocurrencies. Germany & Netherlands are prohibited.\n\nUphold Disclaimer: Terms Apply. Cryptoassets are highly volatile. Your capital is at risk. Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment, and you should not expect to be protected if something goes wrong..\n\nKraken – Founded in 2011, Kraken is one of the most trusted names in the industry with over 9,000,000 users, and over $207 billion in quarterly trading volume.\n\nThe Kraken exchange offers trading access to over 190 countries including Australia, Canada, Europe, and is a top exchange for USA residents. (Excluding New York & Washington state).\n\nBitcoin vs. Cardano – Two Great Options in the Market\n\nWhen you look at these projects separately, you can see that they both have long-term potential and strong followings. When compared, Cardano has Bitcoin beat in terms of sustainability and efficiency. However, Bitcoin still commands more value and has a much larger following due to its scarcity, reliability, network strength, and increasing functionality. The main thing to understand is that both of these projects have the potential to stand the test of time. You can learn more about Bitcoin here and Cardano here."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vd3d3LmNjbi5jb20vYW5hbHlzaXMvYml0Y29pbi10by1oaXQtMTEwMDAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Price Moving Sideways: BTC Could Fall to $11000 - CCN.com",
        "content": "Key Takeaways\n\nBitcoin has been moving sideways since July 24\n\nIf the level holds a move to $35,200 could be seen\n\nBut if the level breaks, it could signal a larger downtrend to $11,000\n\nThe price of Bitcoin has been moving sideways since July 24, when it fell to $29,000. It has been hovering around $30,000 with low volume and volatility and formed a horizontal range.\n\nWith its July 13 high of $31,730 being the yearly high, could this sideways movement be interpreted as redistribution before a significant move? And if so, where is Bitcoin likely headed?\n\nBitcoin Price Analysis\n\nFrom November 21 when the price fell to $15,500, we have seen the start of an uptrend that recovered it by 105% measured to its highest point in July. An ascending channel formed, which is typical for an uptrend.\n\nFrom June 14 it retested the ascending channels support level and bounced from it once more at $24,820 making another higher high. July high was only a minor one with a 4.5% difference from the prior one made in mid-April.\n\nSome cryptocurrencies didn’t make a new higher high in July compared to April’s, like Ethereum, Binance coin, Cardano, and so on.\n\nThis minor difference shows us that momentum is slowing down as with each push, buyers have less strength, and taking into account that generally speaking, the market as a whole (total cryptocurrency market capitalization) hasn’t reached a new yearly high in July, we can definitely conclude the diminishing momentum.\n\nThe sideways range from July 24, came after the price made a dip below the $30,000 mark and now we are seeing yet another interaction with the ascending channel support level.\n\nIf a breakout occurs to the downside, which looks highly likely, that could be an early signal of the starting downtrend.\n\nBitcoin Price Prediction\n\nIn some of our previous analyses, we have pointed out that the price of Bitcoin has two scenarios in play – a bullish one and a bearish one. In a bullish case, the price is going to make a final attempt to continue its uptrend resulting in another higher high and is then headed for its first major correction to $20,000.\n\nAlternatively, according to a bearish scenario, July high marked the completion of a bear market correction and is now headed to a new bear market low of potentially $11,000.\n\nConsidering the negative context we are currently in let’s revisit the bearish scenario.\n\nOn the daily log chart above from Coinbase, we can see that the price made a corrective Elliott Wave count of 3 waves until November 21, from mid-April 2021. The main difference between a bullish and a bearish scenario is whether or not the bear market ended in November as an ABC correction of the highest degree. Looking at the sub-waves the possibility of we are in wave 4 from the higher degree wave C on the rise from June 18, 2022, is high.\n\n\n\nThis is so because from June 18 there was some positive price action but it resulted in a lower low in November, and the wave structure from August to November doesn’t appear to have been the ending bear market wave.\n\nInstead, according to this count, the rise from November until now is the third sub-wave of the ABC correction from June 18, 2022.\n\nIf this is true, then a larger descending move could now lead the price of Bitcoin to a final bear market low.\n\nSince Bitcoin already fell below its previous bull market ATH, it is likely to continue down to its next significant support point on the expected downfall which is around $11,000.\n\nConclusion\n\nAs stated, there is also a bullish case to be made, in which the price started its bull cycle on November 21. If that scenario is in play, the price should now make a final higher high to $35,200 before falling back down to $20,000 on its first major correction.\n\nThis is why the currently seen interaction with the ascending channel support level is going to be important.\n\nIf the level gets broken and the price starts falling down, then the likelihood of a bearish scenario increases. But if the level holds and we see a bounce, the price will likely be headed toward the $35,000 zone."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMTQvYml0Y29pbi1zcG90LWV0Zi1hcHByb3ZhbC1jb3VsZC1oZWxwLXBvd2VyLXVwLWEtbmV3LWNyeXB0by1jeWNsZS1iZXJuc3RlaW4v0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOC8xNC9iaXRjb2luLXNwb3QtZXRmLWFwcHJvdmFsLWNvdWxkLWhlbHAtcG93ZXItdXAtYS1uZXctY3J5cHRvLWN5Y2xlLWJlcm5zdGVpbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Spot ETF Approval Could Help Power up a New Crypto Cycle: Bernstein - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vYml0Y29pbi12cy1zb2xhbmEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin vs. Solana - What's the Difference? - Securities.io",
        "content": "There are a lot of reasons why so many people seek to learn the crucial differences between Bitcoin and Solana. These networks are among the top options for traders with both being listed on major CEXs and having a strong following. So how does the world's first cryptocurrency stack up against a third-gen powerhouse? Here's some valuable insight into Bitcoin vs. Solana.\n\nWhat is Bitcoin?\n\nBitcoin was the first successful attempt at making a reliable and secure decentralized currency. The network changed the world forever when Satoshi Nakamoto published the now-famous Whitepaper in 2008. The paper described how a network of nodes could act as the validation system rather than leveraging a central group like a bank.\n\nBitcoin filled a need in the market for a permissionless electronic peer-to-peer cash system. Now, Bitcoin has seen its use-case shift from day-to-day spending to include store-of-value purposes. The network has seen considerable growth with an all-time high of over $68,000.\n\nToday, Bitcoin has started to regain some of its day-to-day currency capabilities thanks to new technologies such as the lightning network. This off-chain protocol enables Bitcoiners to cheaply send up to 1,000,000 tps – which is significantly faster than the mainnet. This development has helped Bitcoin stay relevant in a market with increasingly capable competitors.\n\nWhat is Solana?\n\nSolana is a third-generation programmable blockchain. The network is the brainchild of Anatoly Yakovenko who founded Solana in 2017. At that time, the focus on the market was to introduce a programmable blockchain that could outperform Ethereum and provide more scalability.\n\nSolana entered the market to fulfill these goals. The platform was a hit with developers due to its open infrastructure. Additionally, traders enjoyed its low fees and high performance. Today, Solana is a vibrant blockchain community that features a combination of DEXs, DeFi, and Dapps.\n\nWhat Problems Was Bitcoin Built to Alleviate?\n\nGiven that no one knows the Bitcoin founder directly, one can only speculate on Bitcoin's true purpose. In the coin's whitepaper, Nakamoto states that the protocol would operate as a peer-to-peer electronic cash system. Aside from its technical purpose, there are some higher levels of purpose that Bitcoin fulfills.\n\nNakamoto hints at some of the coin's goals such as providing a more transparent and fair option to the market. In the Bitcoin genesis block, which is the first block of its blockchain, Nakamoto embeds a reference to the Bank of England receiving a massive bailout. This reference can be seen as a clue as to one of the reasons why Nakamoto created this game-changing invention.\n\nBitcoin opens the world for a global economy using digital currency. The expansion of the internet has made this concept even more possible than ever before. Bitcoin remains a pioneer in terms of freedom and openness in the market. Its community still holds the torch regarding fulfilling Nakamoto's dream of a fair economy for all.\n\nWhat Problems Was Solana Built to Alleviate?\n\nWhen Solana entered the market scalability concerns were wreaking havoc on networks. Ethereum and Bitcoin were suffering from crushing congestion that made both networks nearly unusable. There were instances when it cost more to send these tokens than the actual amount you were trying to send.\n\nThis congestion left Dapp developers and users in search of more scalable alternatives. This is the time when Solana entered the market. Cryptocurrencies were in a breakout year with the introduction of the ERC-20 token standard and the ICO (Initial Coin Offering) craze. Solana entered the market to fill a need for a high-performance programmable network.\n\nThe network integrated a new consensus mechanism that improved its performance considerably compared to Bitcoin. Bitcoin can handle around 7 tps on its mainnet. In comparison, Solana has been bench tested to 29,171 tps. Part of this performance comes from the improved block times. Bitcoin has a 10min block approval time. Solana approves blocks every 2.34 seconds. Additionally, the developers were sure to leave room for the network to scale vertically in the future to meet growing demands.\n\nHow Does Bitcoin Work?\n\nBitcoin uses a Proof-of-Work (PoW) consensus algorithm to operate. This system eliminates central groups and replaces them with network nodes called miners. These participants are responsible for approving blocks of transactions every ten minutes. Once approved, these blocks get added to the chain of transactions to form the blockchain.\n\nWhile all miners approve transactions, only one receives the rewards. The reward is given to the miner that is the first to figure out a complex mathematical equation called SHA-256. This equation is so difficult that your computer concludes it's easier to make random guesses than do the actual computations.\n\nWhen you hear about Bitcoin miners, these are devices that are built to complete this equation faster. Today's Bitcoin network miners use advanced ASIC (Application Specific Integrated Chips) that are thousands of times better at solving the SHA-256 equation versus your PC.\n\nBTC\n\nBTC is a cryptocurrency that operates on the Bitcoin network. As the first cryptocurrency, BTCs first technical purpose was to act as digital money. Consequently, it's limited in its technical capabilities versus today's advanced networks. Notably, there are only 21M Bitcoin slated for issuance.\n\nHow Does Solana Work?\n\nSolana is a third-generation blockchain that employs a Proof-of-Stake (PoS) consensus system to remain valid. This style of blockchain does away with miners and replaces them with stakers. Stakers agree to lock their tokens in a smart contract to participate in the approval process.\n\nThe advantage of this approach is that it's more environmentally sustainable, doesn’t require expensive equipment, and is designed to be more democratic. Anyone can use their tokens to secure rewards. The downside of staking networks is that they are not as proven as PoW networks like Bitcoin, which have over a decade of secure operations, and are known to suffer from outages.\n\nSolana integrates an additional timestamp into its blocks of transactions which improves referencing. The cryptographic clock means that nodes don’t have to approve the entire state of the blockchain every time. They can leverage these snapshots to improve performance, which acts as another layer of validation.\n\nSOL\n\nSOL is the main utility token for the Solana network. This advanced token serves multiple roles in the ecosystem. For one, it's used to pay transactions and smart contract execution fees. It can also be used to send value globally. Token holders can stake SOL to gain passive rewards.\n\nHow to Buy Bitcoin (BTC) and Solana (SOL)\n\nCurrently, Bitcoin (BTC) and Solana (SOL) are each available for purchase on the following exchanges.\n\nUphold – This is one of the top exchanges for United States & UK residents that offers a wide range of cryptocurrencies. Germany & Netherlands are prohibited.\n\nUphold Disclaimer: Terms Apply. Cryptoassets are highly volatile. Your capital is at risk. Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment, and you should not expect to be protected if something goes wrong..\n\nKraken – Founded in 2011, Kraken is one of the most trusted names in the industry with over 9,000,000 users, and over $207 billion in quarterly trading volume.\n\nThe Kraken exchange offers trading access to over 190 countries including Australia, Canada, Europe, and is a top exchange for USA residents. (Excluding New York & Washington state).\n\nBitcoin vs. Solana\n\nNow that you have more insight into the Bitcoin vs. Solana discussion, you're more informed and prepared to make your decision. Both networks have strong followings and a bright future. Bitcoin has proven to be the industry leader with a secure network, but Solana has its mainnet beat in terms of capabilities and performance. For these reasons, both networks are a smart addition to your portfolio. You can learn more about Bitcoin and Solana via the links."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9iaXRjb2luLXByaWNlLXN0ZWFkeS1hcm91bmQtZG9sbGFyMjkzay1hcy1zYmYtZ29lcy1iYWNrLXRvLWphaWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Price Steady Around $29.3K as SBF Goes Back to Jail - CoinDesk",
        "content": "Bitcoin and Ether are trading pretty flat after a relatively uneventful weekend for crypto. Joining us now to discuss this is Athena head of research and data Connor, writer, welcome Connor. Hey Lawrence, thanks for having me. Glad to have you on. So, uh we haven't seen much movement in the majors and Bitcoin. You see a potential here for the ALTs. Are we seeing that necessarily in market dominance? What's going on uh for the ALTs the like? So she knows some of these uh uh you know, more meme coins, things like that. Yeah. Well, look for, yeah, we're seeing kind of open interest for eyes for she, but we're seeing a bit of interest start to pick up. But as far as all coins are concerned, really, I think if we're going to see any movement in all coins, we really need to see a Bitcoin or Ethereum led rally to start with. Um and I think we're a while away from that. Obviously, there's a lot of old coins that kind of have securities regulatory risk overhanging them. Um But yeah, as I said, we're going to need to kind of see a Bitcoin or Ethereum price move, which we just have an ad over the last two or three weeks. There's actually been remarkable lack of volatility really in markets, which is, which is pretty crazy for crypto assets to be honest. But um I think what we're seeing is kind of investor apathy starting to seek to seep into markets right now. Investors are kind of looking around for that next catalyst, whatever that may be. Um Otherwise they'll kind of keep their money on the sidelines. We're seeing that just in like retail volumes in July was the lowest um in terms of monthly volume we've seen since November 2020. Um last Friday, in fact was a, was a low for Bitcoin volume this year daily volume. And so yeah, we're kind of seeing that a bit into markets right now and there's a handful of catalysts that could lift us out of this. But otherwise we're kind of, yeah, we're expecting, I guess more subdued markets in the near term until one of those catalysts hits. So some of the catalyst, you know, we keep talking about a potential Bitcoin ETF for for a few weeks away from knowing whether or not that will happen. But we're also seeing in the process, um the adoption of stable coins by paypal. Uh are those, are those two things that can coexist or does one kind of take the thunder from the other? In other words, if we see paypal adopt stable coins does that sort of take away this interest and excitement around a, um, Cryptocurrency that can be used across borders? I mean, here you have paypal that would create a, or, you know, basically sponsor a, a stable coin that could be used to cross borders. I, you know, I guess, I guess the question is, does the paypal News offset? Actually the ETF news, does it actually have a little bit of a, an injury to it rather than a uh a help? I don't think so. I think the two can coexist pretty easily. Um And basically because I think they target two different sectors of really crypto markets. And if we take the paypal first, that I think is really great for like retail adoption, right? That's been talked about obviously ad nauseum for the last few days, but paypal has over 400 million users that all those users are getting on boarded into the, right. It's tough to remember a bigger kind of on board moment for crypto. Um And if you were to ask for like a web two centralized issuer that would back a stable coin and put their name behind. But paypal is arguably one of the better ones to, to do they obviously payments as their bread and butter stable coins have long had issues with having access to kind of payment rails, right? So usually stable coins and crypto are kind of used for buying other crypto assets on exchanges whereas now we're actually seeing a new kind of market being opened for stable coins as payments, right? So um if you take ebay, for example, 70% of ebay transactions use paypal. So now all of a sudden, you've got about 70% of ebay transactions have the option to use stable coins. And so that's and then obviously you have the on and off around the capabilities of paypal. Crypto is also long struggled. And especially lately with fiat and off ramps, we've seen particularly some us exchanges struggle um to kind of and we've seen them temporarily suspend us d deposits and withdrawals. Now this hopefully solves a large portion of that those issues. Um So that's the kind of paypal side of things and that's really great for retail adoption. I have other views on whether or not the staple coin actually moves the needle itself um in terms of kind of centralization worries. But then if you take this O ETF, that's kind of targeting a whole another sector of the market, in my opinion, really, it's targeting investment funds institutions that currently so basically what we have now is futures. ETF S and futures ETF S essentially is a good way to kind of light your money on fire in terms of paying fees, paying fees to middle men. And the average kind of essentially when you have expiring futures like these futures. ETF S are built upon, you have to roll into a new contract once that expires and there's historically been premium and that's paid for essentially in fees. So you're looking at about 10 to 12% fees for futures ETF S and compared to actually holding the actual spot ETF itself, so there'd be a big improvement for the institutions there. And that should see a kind of new wave of, of, of institutional money coming in. And if you look at the kind of futures ETF S right now, they just underperform Bitcoin. So year to date the top um Bitcoin Futures ETF is pro shares and they, the year to date their performance being 45% compare that to Bitcoin 75%. So we're near, we're nearly seeing them by 30% under performance there with futures ETF S. So no institution really, that's where their money is happy about investing in that futures. ETF whereas the spot TF will see them kind of their interest peaked, I guess so. No, to go back to your original question to me, they kind of they're responsible for two different sectors of the market. One is great for kind of retail adoption and one should be really good for institutional adoption as well. Connor, thank you very much for joining the show this morning. Happy Monday. Thank you guys. Thanks for having me. That was Athena's head of research and Data Conor Rider."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMTMvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLXN0ZWFkeS1iZWxvdy0zMGstYXMtc2JmLWdvZXMtYmFjay10by1qYWlsL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMTMvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLXN0ZWFkeS1iZWxvdy0zMGstYXMtc2JmLWdvZXMtYmFjay10by1qYWlsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Steady Below $30K as SBF Goes Back to Jail - CoinDesk",
        "content": "The immediate trigger for today’s hearing in the courtroom of District Judge Lewis A. Kaplan was Bankman-Fried’s sharing of the private diary of Caroline Ellison, who Bankman-Fried installed as nominal CEO of FTX and later allegedly ordered to engage in fraud. Prosecutors claim the goal of the leak was to discredit or intimidate Ellison ahead of the trial, when she is expected to testify as a cooperating witness."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWNlbnRyYWxpemVkLWNvcnBvcmF0ZS1mZWFyZWQtbWljaGFlbC1zYXlsb3LSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin bought by corporate giants should not be feared — Michael Saylor - Cointelegraph",
        "content": "During a recent podcast interview, MicroStrategy’s Michael Saylor expressed the opinion that large corporations purchasing and holding Bitcoin (BTC) in their custody should not be a cause for concern.\n\nWhile speaking to Natalie Brunell on the Coin Stories podcast, released on Aug. 7, Saylor emphasized the inevitability of third-party and corporate participation growing in the Bitcoin space.\n\nHowever, he suggested that while Bitcoin enthusiasts may desire total self-control, or sovereignty, over their Bitcoin, it might not be the only answer, as people will be using Bitcoin for diverse purposes.\n\n“We need to be prepared for Bitcoin to infuse everything,” Saylor stated, explaining that as Bitcoin becomes more integrated into society, it will have many use cases, and there will not be a one-size-fits-all model.\n\n“There are different types of wrappers. Some people will always be self-custody, some will be multisig, some will need a layer-3 custodian. There will be a need for political or utility or functionality purposes.”\n\nSaylor speaking to Coin Stories host Brunell. Source: Coin Stories\n\nSaylor outlined three main reasons underpinning the need for custodians: technical, political and natural.\n\nFrom a political standpoint, relying on a third party might be the only course of action.\n\n“The mayor of New York is still the mayor of New York. Unless you get rid of New York City, California or Iceland, the country, political reasons will mean the need for custodians.”\n\nRelated: Saylor’s MicroStrategy plans $750M stock sale, possibly buying more Bitcoin\n\nOn the technical side, there will be people that will want to transact in crypto with their mobile phones, so trusting layer-3 third parties, such as Bank of America and Apple, will be unavoidable, Saylor said.\n\n“Bitcoin is going to be a base layer. There is going to be layer 2’s like lightning to make things fast. Then there is going to be layer 3’s like Bank of America and Apple. Custodial layer 3 is going to exist to provide functionality.”\n\nSaylor speaking on the Coin Stories podcast. Source: Coin Stories\n\nAs for natural reasons, Saylor suggested the possibility that it is safer for certain people to entrust their assets to others.\n\nHe gave the example of an 85-year-old grappling with Alzheimer’s or the desire to secure holdings for a yet-to-be-born grandchild.\n\n“I didn’t complain that my mother and father had the car keys when I was twelve years old, and I didn’t get the car key,” Saylor stated.\n\nSaylor stated that the optimal blend of Bitcoin integrations will be determined by the market.\n\n“We shouldn’t be afraid of all the different ways people integrate, wrap, embed or execute with Bitcoin, there is no one right answer; the marketplace will determine the right mix of integrations of Bitcoin.“\n\nMagazine: Why Coin Stories’ Natalie Brunell doesn’t want a Bitcoin ATH anytime soon: Hall of Flame"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wOC0xMy9tb3JlLWJpdGNvaW4tYnRjLWV0Zi1kZWNpc2lvbnMtYXJlLWFscmVhZHktbG9vbWluZy1hZnRlci1zZWMtcGFzc2VzLW9uLXJ1bGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "More Bitcoin ETF Decisions Are Already Looming After SEC Declines to Rule - Bloomberg",
        "content": "Sign up for our Crypto newsletter and follow @crypto Twitter for the latest news.\n\nBitcoin ETF candidates got another dose of disappointment when US regulators on Friday punted on making a decision on such a product. But the next time they hear from them might be just a few weeks away."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL2J1ZmZhbG9uZXdzLmNvbS9uZXdzL2xvY2FsL25vcnRoLXRvbmF3YW5kYS13ZWxjb21lZC1iaXRjb2luLW1pbmVycy1zb21lLXJlc2lkZW50cy1yZWdyZXQtaXQvYXJ0aWNsZV8wZjRlYjZlNi0zNmYyLTExZWUtODViYy05YmU1ZDE3YTRkYTAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Residents regret welcoming Bitcoin miners in North Tonawanda - Buffalo News",
        "content": "In August 2021, a Los Angeles man named Alec Amar pitched state regulators a seductive vision for the future of North Tonawanda:\n\nWhat if the city could anchor a booming new industry, flush with global investment and high-paying jobs?\n\nThat nascent industry – cryptocurrency mining – had already made small, quiet forays into Western New York, thanks to the region’s cheap electricity and real estate costs. But Amar, then in his mid-20s, hoped to expand his existing operation by acquiring the old Fortistar power generating plant and using it to fuel a fleet of the specialized computers needed to “mine” Bitcoin and other virtual tokens.\n\nIf the state approved the sale, Amar wrote in a letter to the Public Service Commission, his company would retrofit the gas-burning plant with groundbreaking, state-of-the-art technologies that would allow it to run without producing greenhouse gas emissions. The project would also, he said, bring stable tech jobs and “billion-dollar international companies” to the region.\n\nState regulators have since granted Amar’s company – Digihost International Inc. – permission to buy the power plant.\n\nBut two years later, Amar’s other visions have not yet come to pass.\n\nInstead, some North Tonawanda residents say, the Digihost cryptocurrency facility on Erie Avenue has become a persistent nuisance and environmental hazard – overseen by a mysterious, out-of-town firm that has hired few local workers and shared little about its plans for the future.\n\n“We don’t want this to turn into a Love Canal situation,” said Karen Hance, who lives 600 feet from Fortistar.\n\nIn July, more than two dozen residents and 60 environmental groups appealed to Gov. Kathy Hochul, asking her to accelerate a pending review of the facility’s air pollution permit. The “resurrection” of fossil-fuel plants to mine cryptocurrency has dramatically increased greenhouse emissions, water pollution and noise pollution, they said.\n\nNeither Amar nor his father, Michel, responded to several interview requests, and denied – through another Digihost executive, Luke Marchiori – a reporter’s request to visit, citing ongoing construction.\n\nThe case forms part of a growing national backlash against cryptocurrency mining, still seen by some as a boon to small, post-industrial communities. At least five crypto facilities have located in Erie and Niagara counties.\n\nTechnologists have championed such projects, and cryptocurrencies like Bitcoin, as revolutionary “disruptors” that could support the development of new renewable energy sources and forever change the financial system. But volatility and fraud in the cryptocurrency market – as well as persistent concerns about the industry’s energy needs – have fueled calls for greater oversight, particularly of miners that seek to revive or retrofit fossil fuel power plants.\n\nIn November, New York became the first state to temporarily ban these types of operations, pending an environmental review. Regulators greenlit Digihost’s North Tonawanda cryptomine before the ban, however.\n\nEnvironmentalists argue that timing should not save the project.\n\n“Purchasing an entire gas plant to run all the time, 24/7, is fundamentally inconsistent” with state climate law, said Mandy DeRoche, a deputy managing attorney with the national environmental advocacy group Earthjustice, which has sued to block Digihost.\n\nAn ideal target\n\nLike other Bitcoin mining operations, Digihost came to Buffalo in pursuit of cheap power. Amassing new coins requires lots of it. The virtual currency is created, or “mined,” by solving complex computational puzzles with banks of specialized computers. In addition to the electricity needed to power the computers themselves, mining facilities also require energy for industrial cooling systems and network equipment – making electricity the largest operating cost for many mining firms, and a prime target for crypto-entrepreneurs looking to grow their margins.\n\nAlec Amar and Brian Yang were two such entrepreneurs, according to a lawsuit that Yang later filed against his former business partner. In 2017, the two men incorporated a new Bitcoin mining firm in California and chose to locate their first cryptomine in Buffalo.\n\nYang, then an engineer at Google, created the software that ran the mining computers. Amar and his father Michel, a French-American fashion executive, provided $36,000 of upfront investment.\n\nThe young company then developed a 60,000-square-foot data center in the former American Axle plant on East Delavan Avenue before transferring it in 2020 to Digihost, where Alec serves as president and Michel as chief executive. Yang alleges that the two men mishandled corporate funds and shut him out of the business, which the Amars dispute; the case is ongoing in Los Angeles Superior Court.\n\nAs the price of Bitcoin climbed past $60,000 in 2021, and as Digihost amassed more than 11,000 computers, the Amars began looking for other sources of electricity. They found it in Fortistar, an old natural-gas-burning plant that the company said could power as many as 1.3 quintillion – or 1.3 billion billion – attempts to solve a Bitcoin puzzle every second.\n\n“We are extremely excited to have achieved this milestone in the evolution of our Company,” Alec Amar said in a March 2021 news release, which estimated that the plant would give Digihost the capacity to mine roughly $11.8 million of Bitcoin per month, at current valuations.\n\nThe project represented a major shift for the 30-year-old Fortistar facility, a so-called “peaker plant” that had previously kicked in only to supply the grid only at times of urgent demand. Digihost planned to continue those operations while also installing Bitcoin miners that ran 24 hours per day in as many as 40 small structures on the grounds, powering them with electricity from the Fortistar plant.\n\nAt a North Tonawanda City Council meeting in August 2021, Michel Amar pitched the venture as an economic boon that would create at least 20 to 30 high-paid Digihost jobs in Western New York and make the region a center of financial technology and green energy innovation. Digihost prided itself on being “very green and socially responsible,” he said.\n\n“We are trying to do the right thing for the community … we are here to work with you,” he said.\n\nOne slide in his presentation addressed a specific concern that had dogged other crypto enterprises: “NO NOISE WILL BE HEARD ANYWHERE OUTSIDE THE PREMISES,” it read.\n\nBenefits unclear\n\nBut noise is heard outside the premises, neighbors say: a dull, pitchless, intermittent roar like Thruway traffic or Niagara Falls. Even after Digihost installed a 26-foot sound barrier and $100,000 in trees and shrubs, the sound of the industrial fans used to cool its computers drifted into nearby residential areas.\n\nIn May and June, Jack Kanack – a meteorologist and trained noise-meter reader – set out to quantify the low rumbles around the plant. On several occasions, according to records he shared with The Buffalo News, he found it emitting high levels of low-frequency noises that spiked higher when the wind blew in his direction.\n\n“This used to be like living in a park,” Hance said of her wide, well-gardened backyard, which has emptied of the possums, raccoons and other wildlife it once attracted.\n\n“Seriously, it has come to the point where my family is considering moving out of the City. We can no longer relax in the quiet of our own home,” wrote Kevin O’Connor, a homeowner half a mile to the northwest, in a May email to North Tonawanda lawmakers.\n\nCritics say Digihost has not delivered on its economic promises, either. As of December 2022, the company directly employed 11 full-time staff in the U.S., according to corporate records filed with the Securities and Exchange Commission. While that figure does not include employees hired through subcontractors or subsidiaries, North Tonawanda Mayor Austin Tylec also said he did not believe the cryptomine had generated new local jobs besides a few security positions.\n\nNiagara County reassessed the value of the Fortistar plant this year to just over $77,000 to account for the new mining venture, from roughly $49,000 last year, according to the county property tax office. Digihost has not received assistance from the Niagara County Industrial Development Agency, though the company has told investors it receives a discounted rate on electricity from the state.\n\nTylec, who as a City Council member lobbied for a temporary moratorium on cryptomining facilities, faulted his predecessors for failing to better scrutinize Digihost and its impact on the surrounding community. Local staff members at the Fortistar plant have worked closely with the city to address noise complaints and “be a good neighbor,” the mayor said.\n\n“It was not Digihost’s responsibility when they first came here to make sure North Tonawanda had the right zoning codes in place,” Tylec said. “It was up to city officials to make sure that was done before approval ... and they unfortunately didn’t do that.”\n\nCosts to the community will soon grow steeper, neighbors and environmentalists predict.\n\nThe Fortistar plant still primarily operates to supplement the grid – a practice that yielded between 11,000 and 18,000 metric tons of carbon dioxide each year between 2017 and 2019, according to data filed with state regulators.\n\nThose emissions could spike dramatically, however, if Digihost runs the plant more frequently to power its on-site miners. In an environmental audit submitted to the state last September, plant operators wrote that they now “anticipate” generating more than 300,000 metric tons of carbon dioxide each year – equivalent to the emissions from more than 66,000 motor vehicles.\n\n“It’s a huge increase in greenhouse gas emissions at a time when you can see all the impacts that climate change is having,” said Deb Gondek, the former director of sustainability for Rich Products and a North Tonawanda resident who opposes the Digihost project. “Why are we allowing all these additional emissions for an industry that benefits just a few people? We have to rethink that.”\n\nAn ‘evolving’ space\n\nA 2022 peer-reviewed study published in the journal Scientific Reports calculated that Bitcoin miners cause 35 cents worth of climate damage for every $1 of Bitcoin they unlock.\n\nBut Digihost sees itself as part of the climate solution, not the problem, said Marchiori, the company’s chief renewable energy officer. Marchiori – who lives in Western New York and serves an “advisory” role at Digihost – met the Amars when his energy marketing company began supplying power to their East Side project.\n\nSince then, he said, that cryptomine has become the anchor subscriber for a community solar farm in the Genesee County Town of LeRoy, and signed on to a number of statewide programs that reward major power-consumers for cutting their use during peak-demand periods.\n\nCryptomining operations, with their steady, consistent need for power, can also help drive demand for green energy projects and technologies, he said. In the coming months, Marchiori said Digihost will transition the Fortistar facility to run on a mix of conventional and “renewable” natural gas, an equivalent fuel derived from the decomposition of organic matter, like food waste and animal manure.\n\nMarchiori also said Digihost looks to blend hydrogen with natural gas to reduce carbon emissions, echoing a proposal Alec Amar made to the Public Service Commission in 2021.\n\n“The plant … will undergo upgrades at the end of 2023 to install and use hydrogen power,” he wrote.\n\nCritics raise significant questions about the feasibility and benefits of both technologies, which some researchers and environmental advocates have panned as “greenwashing.” Renewable and conventional natural gas leak similar amounts of methane, for instance – a potent greenhouse gas that contributes to climate change.\n\nThe Environmental Protection Agency also has no record of a renewable natural gas producer in Pavilion, where Marchiori said Digihost planned to source much of its fuel. He declined to provide further details about the producer.\n\nMeanwhile, New York has no pipeline infrastructure to transport hydrogen – and most hydrogen in use today is extracted from natural gas.\n\nIn their September 2022 environmental audit, Fortistar’s operators wrote that “there are numerous technological hurdles that need to be overcome before [hydrogen] can function as a viable alternative fuel for utility power generation.” Marchiori acknowledged that hydrogen power “is definitely an emerging technology.”\n\n“I think you could have a windfall of new investment and development of renewables because you have this baseline” energy demand, he told The News. “It’s an interesting space – it’s evolving, it’s maturing.”\n\nThe same might be said for Digihost itself, which has operated for only three years in its current form. The company continues to signal interest in making green infrastructure investments in North Tonawanda, Tylec said, and has been in contact with the Mayor’s Office about potentially installing electric vehicle chargers in the city – though “nothing is set in stone.”\n\nSome residents say they are no longer taking Digihost at its word. While local and state utility regulators have already approved the North Tonawanda project, Digihost must now renew a mandatory air pollution permit for the Fortistar plant with the state Department of Environmental Conservation. Gondek, Hance and O’Connor were among the more than 80 residents and environmental groups who recently asked Gov. Kathy Hochul to speed up that review.\n\nA denial would, pending a likely appeal, shut down the Fortistar plant. In June, the state agency requested more information about how the facility plans to minimize emissions and other community impacts.\n\nEarthjustice is also appealing a lawsuit it filed against the Public Service Commission on behalf of two local environmental groups in January, arguing that the agency should have weighed New York’s sweeping 2019 climate law when it approved the transfer of Fortistar. A judge dismissed the case in March.\n\nEven if New York continues its crackdown on cryptomining, history suggests the industry will regroup somewhere with more lenient regulations. Cryptomining exploded in the U.S. after China cracked down in 2021, citing – among other concerns – a desire to help the country meet its carbon reduction targets.\n\nDigihost has also acquired new facilities in Alabama and North Carolina during the past 18 months, announcing in July 2022 that it does not plan further expansion in New York.\n\n“It’s a game of whack-a-mole right now,” said Bridge Rauch, the environmental justice organizer with the Clean Air Coalition of Western New York."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXZzLWdvbGQtYXJlLW1hcmtldC1jYXAtYW5kLW90aGVyLWNvbXBhcmlzb25zLWFjdHVhbGx5LXJlbGV2YW50LWZvci1pbnZlc3RvcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin vs. gold: Are market cap and other comparisons actually relevant for investors? - Cointelegraph",
        "content": "The connection between Bitcoin and gold goes back to Bitcoin’s origin. While it is not mentioned in the Bitcoin white paper, Satoshi Nakamoto actually referred to gold’s rarity in a Bitcointalk forum post when introducing the first version of Bitcoin (BTC) in 2009. This was to emphasize the importance of a limited supply of 21 million coins.\n\nBitcoin’s market value is frequently matched up against gold, which boasts a total worth of $12.8 trillion, and many crypto pundits often point to the approval of a gold exchange-traded fund (ETF) in 2004 as the catalyst for the asset’s price appreciation.\n\nCurrently, Bitcoin encounters resistance at the $30,000 mark, and its inability to surpass this level could lie in how institutional investors perceive the comparison of BTC and gold as stores of value.\n\nBitcoin’s present market cap of $570 billion outshines traditional giants like Visa, Taiwan Semiconductor and JPMorgan Chase. However, it’s still 55% behind silver and significantly trails the world’s foremost tradable asset, gold.\n\nThis raises a crucial question: How closely are the prices of these two assets linked? In simpler terms, do their prices actually have a noticeable connection?\n\nGold prices in USD and correlation vs. Bitcoin (orange). Source: TradingView\n\nThe explanation becomes clear when considering Bitcoin's heightened volatility. For example, the 30-day correlation indicator can shift from positive to negative within a matter of weeks. This lack of consistent price connection can be attributed to Bitcoin’s relatively modest adoption and the uncertainty that investors still grapple with concerning its potential and practical applications.\n\nInvestors and analysts continue to debate whether Bitcoin’s decentralized nature and limited supply validate its role as a financial reserve, while others counter that its price instability hinders its viability as a medium of exchange. Nonetheless, there’s no barrier to evaluating Bitcoin’s market cap alongside major global stocks and other commodities.\n\nBitcoin’s market capitalization relative to gold. Source: TradingView and Cointelegraph\n\nExamining Bitcoin’s market cap in comparison to gold unveils an interesting trend, highlighting resistance levels at 10% and 4.5%, which could potentially explain the $30,000 resistance.\n\nBitcoin investment products vs. gold ETF\n\nAccording to CryptoCompare, investment vehicles linked to Bitcoin amassed a total of $24 billion in July. This encompasses products like the Grayscale Bitcoin Trust and exchange-traded notes from various providers. This translates to about 4.2% of Bitcoin’s current market cap of $570 billion. Even considering the more generous estimate of 1.66 million BTC reportedly held by institutional investors, that’s still only 8.5% of the total market cap.\n\nComparatively, gold-backed ETF products were valued at $215 billion in June, a mere 1.7% of gold’s market cap. However, for a fair assessment against Bitcoin, it is worth considering physical gold holdings, which are favored by governments and banks. At the same time, regulations often push fund managers toward exchange-listed BTC products, causing this discrepancy.\n\nFor instance, central banks and the International Monetary Fund hold a hefty 46,603 tonnes of gold, equivalent to $2.84 trillion. Private investments in bars and coins add 45,000 tonnes, worth an extra $2.74 trillion. In total, investors hold $5.8 trillion in gold, accounting for 45.2% of its market cap.\n\nThis analysis implies Bitcoin’s adoption as a store of value among institutional investors is around 81% smaller than gold. This partly explains why Bitcoin’s market cap of $570 billion is a substantial 95.5% lower than that of gold, the dominant precious metal.\n\nRelated: PayPal to roll out Cryptocurrencies Hub for select users\n\nBitcoin could succeed regardless of its use as a store of value\n\nBitcoin’s market cap could potentially multiply fivefold, reaching $2.9 trillion, even without complete adoption as an institutional store of value. This surge might stem from the escalating demand for decentralized digital trading. With conventional financial systems encountering hurdles, Bitcoin’s role as a global, censorship-resistant transaction medium gains prominence.\n\nMoreover, its increasing integration into e-commerce and online markets could amplify transaction volumes. As individuals seek alternatives to traditional payments, Bitcoin’s scarcity and utility might establish a self-reinforcing value cycle. This distinctive blend of factors implies that Bitcoin’s price surge may not exclusively hinge on institutional adoption as a store of value.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90ZXJhd3VsZi1pbmNyZWFzZXMtbWluZWQtYml0Y29pbi13aXRoLW1vcmUtY2FwYWNpdHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "TeraWulf increases self-mined BTC in Q2, while Hut 8 looks to USBTC merger - Cointelegraph",
        "content": "Bitcoin (BTC) mining firm TeraWulf has seen a drastic increase in BTC rewards since increasing its mining capacity in the first half of 2023.\n\nAccording to the company’s latest quarterly filing with the United States Securities and Exchange Commission, TeraWulf mined a total of 1,441 BTC through the first half of the year. 508 BTC was mined in Q1, while the firm added another 375 self-mined BTC to its balance sheet in Q2.\n\nThe increase in hash rate and mined BTC also led to an uptick in quarterly revenue for the company, up from $11.5 million to $15.5 million in Q2. The company pointed to its increased hash rate and the recovering market value of Bitcoin as primary reasons for its improved quarterly financials.\n\nRelated: TeraWulf goes nuclear: 8,000 rigs spool up in Nautilus mining facility\n\nThe firm now has over 50,000 new-generation Bitcoin miners, which it operates across its Lake Mariner site in New York and its Pennsylvania nuclear-powered Nautilus operation. TeraWulf’s operational hash rate sits at 5.5 exahashes per second (EH/s), while it has 160 megawatts (MW) of capacity for miners at the two sites.\n\nTeraWulf's nuclear-powered Nautilus mining location.\n\nThe company also confirmed that it plans to expand its operation at Lake Mariner by another 43 MW by the end of 2023. The new building in New York is set to host 18,500 new generation S19j XP miners from Chinese manufacturer Bitmain.\n\nTeraWulf estimated that its additional capacity at Lake Mariner will increase its self-mining hash rate by a further 58%, from 5.0 EH/s to 7.9 EH/s.\n\nMeanwhile, Hut8 announced that it had seen a decrease in hash rate and self-mined Bitcoin in Q2 of 2023, as reflected in its mid-year results. The company mined 399 BTC in Q2, noting a 58% decrease compared with Q2 2022.\n\nHut 8 attributed the drop in mined BTC to three factors: the overall increase in Bitcoin mining difficulty, the suspension of operations at the firm’s North Bay Facility and ongoing electrical issues at its Drumheller site.\n\nRelated: Bitcoin hash rate spikes as analysts say miners coming back online\n\nHut 8 is also diversifying the use of its infrastructure away from solely mining Bitcoin. Its high-performance computing operation continues to generate an average of $4 million per quarter, with this number expected to grow once its five-year deal as a computing infrastructure provider to Interior Health begins toward the end of 2023.\n\nHut 8 added that its Drumheller site had been hamstrung by high energy input levels that had led some of its mining equipment to fail. The firm said 20% of its installed hash rate had been affected as a result.\n\nThe firm’s self-mined Bitcoin balance sits at 9,136 BTC, currently valued at $368.7 million. The company sold 396 of the 399 BTC it mined through Q2, resulting in $14.7 million in revenue. Hut 8 expects to increase its hash rate capacity once a planned merger with US Bitcoin is complete.\n\nMagazine: Deposit risk: What do crypto exchanges really do with your money?"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luZXItamF2aWVyLW1pbGVpLXdpbnMtYXJnZW50aW5hLXByZXNpZGVudGlhbC1wcmltYXJ50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin-friendly Javier Milei wins most votes in Argentina primary election - Cointelegraph",
        "content": "An Argentine politician, who has previously spoken positively about Bitcoin (BTC) and called for the abolishment of his country’s central bank, has taken the lead in the country’s presidential open primary elections.\n\nWith over 90% of the votes counted, libertarian pro-Bitcoin candidate Javier Milei is leading with nearly 32%. He is trailed by the conservative Together for Change (Juntos por el Cambio) party, with just under 30%, according to Bloomberg data.\n\nMeanwhile, the left-wing Union for the Homeland (Unión por la Patria) coalition — the incumbent government’s group — is third with just over 28.5% of the vote.\n\nThe primary elections determine the final candidates for a presidential ballot which is set for October. The results can be seen as an early gauge ahead of the general election.\n\nLibertarian and pro-#bitcoin candidate, Javier Milei, has taken a commanding lead in the Argentinian primary elections. pic.twitter.com/65XQeIVJth — Peter McCormack‍☠️ (@PeterMcCormack) August 14, 2023\n\nMilei founded and leads the Liberty Advances (La Libertad Avanza) coalition, whose views have been described as anywhere between libertarian and far-right.\n\nMilei calls himself an anarcho-capitalist, has rallied for Argentina’s central bank to be abolished, calling it a scam, and has said human organ sales are “just another market.”\n\nRelated: Argentine agency opens investigation into Worldcoin over biometric data\n\nHe has said Bitcoin is a reaction against “central bank scammers” and claimed fiat currency allows politicians to scam Argentines with inflation.\n\nJavier Milei is running for President of Argentina.\n\n\n\nHe appears to understand money, and that inflation is an unfair mechanism that advantages elites over the people and slowly robs people of their means of survival. pic.twitter.com/tj0KEztUzI — Alex Stanczyk ∞/21m (@alexstanczyk) January 5, 2023\n\nSuch rhetoric has proven popular with Argentina’s voters, who face an annual inflation rate of 116% — the worst in over three decades, adding to the country’s cost of living crisis.\n\nArgentina’s general presidential election will be held on Oct. 22. If no candidate secures at least 45% of votes, a run-off election will be held in November.\n\nUpdate (Aug. 14, 11:02 pm UTC): This article has been updated to add an explainer of the primary election, and a more accurate description of Javier Milei's stance towards Bitcoin.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9maXJzdC1tb3Zlci1hc2lhLWJpdGNvaW4tc3RlYWR5LTIyMTcwMTgyMy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Steady Below $30K as SBF Goes Back to Jail - Yahoo Finance",
        "content": "Good morning. Here’s what’s happening:\n\nPrices: Bitcoin was holding steady just below $30,000.\n\nInsights: The sad saga of Sam Bankman-Fried continues with a judge on Friday revoking the former FTX CEO's bail. CoinDesk columnist David Morris explained why the decision was almost inevitable.\n\nUpdate: Judge Lewis Kaplan has now revoked Sam Bankman-Fried's bail and returned him to jail.\n\nPrices\n\nCoinDesk Market Index (CMI)\n\n1,226\n\n−0.1 ▼ 0.0%\n\nBitcoin (BTC)\n\n$29,347\n\n−59.3 ▼ 0.2%\n\nEthereum (ETH)\n\n$1,847\n\n−1.3 ▼ 0.1%\n\nS&P 500\n\n4,464.05\n\n−4.8 ▼ 0.1%\n\nGold\n\n$1,946\n\n+31.3 ▲ 1.6%\n\nNikkei 225\n\n32,473.65\n\n+269.3 ▲ 0.8%\n\nBTC/ETH prices per CoinDesk Indices, as of 7 a.m. ET (11 a.m. UTC)\n\nBitcoin (BTC) was holding steady just below $30,000.\n\n\"The price stability is a positive sign, indicating consolidation around these levels that can potentially support another leg up,\" Joe DiPasquale, CEO of the crypto hedge fund BitBull Capital, told CoinDesk in an email on Sunday.\n\nDiPasquale said was still digesting last week's announcement by PayPal of its own new stablecoin linked to the U.S. dollar.\n\n\"This is a major set forward since it’s the first issuance of its kind by a traditional, global payments service with hundreds of millions of users,\" DiPasquale said. \"We believe such developments are likely to shape the market behavior moving forward, even if the general response is relatively muted at this point.\"\n\nInsights\n\nSam Bankman-Fried's Almost Unavoidable Return to Jail\n\nThis story by CoinDesk columnist David Morris was published shortly before Judge Lewis Kaplan revoked Sam Bankman-Fried's bail and returned him to jail.\n\nStory continues\n\nSam Bankman-Fried spent 2021 and much of 2022 talking himself into the role of a cryptocurrency mogul. A court hearing today will decide whether he has now talked himself from cushy house arrest back into a concrete and steel jail cell.\n\nLatest News: FTX Founder Sam Bankman-Fried Jailed Ahead of Trial\n\nThe immediate trigger for today’s hearing in the courtroom of District Judge Lewis A. Kaplan was Bankman-Fried’s sharing of the private diary of Caroline Ellison, who Bankman-Fried installed as nominal CEO of FTX and later allegedly ordered to engage in fraud. Prosecutors claim the goal of the leak was to discredit or intimidate Ellison ahead of the trial, when she is expected to testify as a cooperating witness.\n\nBut this is merely the straw that broke the camel’s back: Sam Bankman-Fried has been using deceptive public arguments and back-door private communications to manipulate his trial since the moment of FTX’s collapse.\n\nHe gave seemingly innumerable interviews and public appearances in the weeks before his arrest. During his house arrest, he has continued to give interviews proclaiming his innocence, though lower-profile. Well before releasing Ellison’s diary, he also allegedly reached out to many of those expected to testify against him.\n\nFind the full story here: Sam Bankman-Fried Could Go Back to Jail Thanks to His Big Fat Mouth\n\nImportant events.\n\n2 p.m. HKT/SGT(6 a.m. UTC): Germany wholesale price index (July/MoM/YoY)\n\nCoinDesk TV\n\nIn case you missed it, here is the most recent episode of \"First Mover\" on CoinDesk TV:\n\nGreed and Fear Index Signals Bull Revival in Bitcoin; Could FTX's Sam Bankman-Fried Go to Jail\n\nFTX founder Sam Bankman-Fried was slated to attend a court hearing today. Matrixport's Bitcoin Greed and Fear Index, which has a solid track record of marking trend reversals, is signaling a bull revival in bitcoin. Innovating Capital general partner Anthony Georgiades shared his crypto markets outlook. Bakkt CEO Gavin Michael discussed the crypto trading firm's latest quarterly results. Smart Token Labs chief strategy officer Mathew Sweezey also joins the conversation.\n\nHeadlines\n\nA Bitcoin Warning Signal Blares From Surging Interest in Shiba Inu: Open interest or the dollar amount locked in open SHIB futures contracts has topped $100 million for the first time since February.\n\nSam Bankman-Fried Jailed Ahead of Trial: Bankman-Fried was accused of leaking former Alameda Research CEO Caroline Ellison's diary to the New York Times.\n\nCathie Wood's Ark 21Shares Bitcoin ETF Application Decision Pushed Out by SEC: The regulator is reviewing more than a dozen spot bitcoin and ether future ETF applications."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiKWh0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vYml0Y29pbi12cy14cnAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Vs. Ripple (2024 Edition) - Securities.io",
        "content": "The crypto market is full of exciting investments that offer you a chance to participate in the decentralized economy. As you journey deeper down the rabbit hole, you are sure to encounter Ripple (XRP). Understanding the differences between Bitcoin vs Ripple (XRP) can help you to become a better investor, as both cryptocurrencies serve very different purposes and clientele.\n\nWhat is Bitcoin?\n\nBitcoin, the world’s first cryptocurrency, was built to function as a “peer-to-peer electronic cash system” per Satoshi Nakamoto's whitepaper. This coin was built to serve the needs of the people and provide a viable alternative to the centralized banking system.\n\nWhat is Ripple?\n\nIn comparison, Ripple was designed to provide banks with decentralized financial services. The developers wanted to utilize a decentralized ledger to streamline payment settlement and asset exchanges for the traditional banking sector. While people often use the terms Ripple and XRP interchangeably, they are actually different as Ripple Labs is the company that developed the XRP cryptocurrency, its digital payment network, and protocol. The platform currently operates as a real-time gross settlement system, currency exchange, and remittance network. XRP facilitates these transactions.\n\nRippleNet\n\nRipple Labs is a member of RippleNet. RippleNet is a network of institutional payment providers located around the globe. This network has seen considerable expansion since its inception. By 2018, the network had secured over 100 banks. These banks seek to utilize Ripple to streamline their international money transfers.\n\nBitcoin Uses Cases\n\nBitcoin has two main use cases. The first is as a form of digital currency. People can send Bitcoin globally. It's borderless and immutable. There's no central organization to block or charge back your transactions. The second use case for Bitcoin is as a store of value (SoV). In its current state, Bitcoin is serving as an excellent SoV. The world's first cryptocurrency is valued at over $50,000.\n\nHowever, scalability issues have left Bitcoiners paying high fees to complete normal transactions. In this way, the coin is still seeking ways to fulfill its original purpose. Advancements, such as the off-chain protocol, the Lightning Network has helped Bitcoin better fill its role as such a system.\n\nRipple Use Cases\n\nRipple has three main use cases. Like Bitcoin, Ripple is designed to function as a payment settlement system. Ripple achieves this functionality better than Bitcoin in terms of efficiency and speed. XRP transactions complete in under a minute. Additionally, they have very little cost.\n\nIn comparison, it can take 30 minutes to hours for a Bitcoin transaction to complete. The fees you pay for the transaction will be dependent on the level of congestion on the network. Bitcoin is designed to increase its fees as more network congestion occurs. This protocol was meant to eliminate spam but recently has resulted in record-high network fees.\n\nAsset Exchange\n\nAs a second-generation cryptocurrency, Ripple has more technical functionality than Bitcoin. The network is designed to operate as a low-commission currency exchange. The protocol allows users to facilitate quick conversions between different currencies.\n\nFor example, a bank could send $1 million in USD to China without any conversion losses using RippleNet and XRP as a medium. The USD would be converted to XRP first. Then, it would be sent to China where it could then be converted into yuan. The process is faster, more secure, and cheaper than the traditional monetary system.\n\nBitcoin Consensus\n\nAnyone familiar with Bitcoin knows the network requires an enormous amount of electricity to secure. Bitcoin's energy consumption can be attributed to its Proof-of-Work consensus mechanism. Consensus mechanisms are how decentralized networks verify the state of the blockchain. In Bitcoin's PoW protocol, network nodes (miners) compete against each other to correctly answer a complex mathematical equation.\n\nThe first miner to answer the problem correctly gets to add the next block of transactions to the blockchain. They receive a reward for their efforts. The reward is currently 6.5 Bitcoin. Notably, this is the only time that Bitcoins are ever minted. This process occurs roughly every ten minutes. In this way, Bitcoin has a highly predictive monetary issuance.\n\nRipple Protocol Consensus Algorithm (RPCA)\n\nRipple utilizes a distributed ledger technology, but it’s not blockchain. As such, it requires a different method to secure this network. The RPCA is a unique distributed consensus mechanism that provides Ripple with its fast transaction speeds. Instead of having all nodes approve transactions, only a select few handle this task within Ripple's decentralized ledger.\n\nParticipating nodes verify the authenticity of a transaction by conducting a poll. Since fewer nodes are required to confirm transactions, they complete much faster. Ripple is known to complete almost instant confirmations. Transactions are not affected by their size or destination either. In this way, Ripple is far more scalable than Bitcoin currently.\n\nMining\n\nXRP is pre-mined and uses a less complicated method of mining that isn't available to all users. The developers intend to release 100,000,000,000 XRP manually over the life of the project. There are around 46 billion XRP in circulation at this time. XRP operates similarly to a bank in that it can issue tokens as it deems fit. In comparison, Bitcoin pursued a more democratic and decentralized approach to coin distribution. Bitcoin's creator only pre-mined 1 million Bitcoin before opening the network to the public.\n\nBank Support\n\nSince Ripple was built to service the banking community, it obviously has far more support in the sector than Bitcoin. RippleNet brings their financial institutions together and allows them to save on their normal business practices. RippleNet has already conducted transactions on multiple banking networks. These establishments include some well-known institutions such as Santander, Axis, Bank, Yes Bank, Westpac, Union Credit, NBAD, and UBS.\n\nDisadvantages\n\nRipple has Bitcoin beat in many technical aspects. However, it lacks in other categories. For one, Ripple is highly centralized. The firm makes its development decisions at its sole discretion. Additionally, Ripple Labs own 61% of the total XRP supply. The platform's developers can decide when and how much to release.\n\nBitcoin introduces community governance in the form of miner consensus. The community debates when deciding on the future of the protocol. This approach provides regular users with more control over their investments. It also helps to prevent rug pulls.\n\nCensorship\n\nAnother concern Ripple investors must be aware of is censorship. Ripple is a privately-owned corporation. The firm has the capability to freeze, refund, or reject your transactions. In one instance, these powers were flexed on Jed McCaleb, the founder of Ripple Labs. In the occurrence, McCaleb had his sale of one million+ XRP reversed.\n\nHow Do Ripple and Bitcoin Work?\n\nBoth Bitcoin and Ripple operate distributed open-source protocols. Bitcoin leverages a blockchain to provide its services whereas, Ripple introduces a decentralized ledger that serves as an intermediate mechanism of exchange between two currencies or networks. Notably, Ripple was one of the first cryptocurrencies to enter the market without a Blockchain. The RippleNet is managed by a network of independent servers which compare their transaction records.\n\nXRP\n\nXRP officially launched in 2012. It functions as the main utility token for the Ripple Network. It was purpose-built to support tokens representing fiat currency, cryptocurrency, commodities, or other units of value. The developers choose to pre-mine 1 billion XRP. This decision was seen as controversial as it provided the developers with the majority of tokens in the market. They have gradually released the funds into the market over time, but the majority still remains in the hands of early investors and developers.\n\nRipple vs Bitcoin Company\n\nRipple is a privately owned company. The goal of the project is to secure a profit and expand its network. In comparison, Bitcoin is simply a decentralized protocol. There is no Bitcoin office or CEO to contact. In this way, Bitcoin is insulated better from regulatory pushback and scrutiny.\n\nHistory of Ripple\n\nRipple (XRP) is the brainchild of Jed McCaleb. McCaleb is best known as the founder of Mt.Gox. Notably, he had already sold his shares in the exchange prior to the now infamous hack. He also co-founded several crypto startups. These firms include Stellar, eDonkey, and Overnet.\n\nMcCaleb built Ripple with the help of Arthur Britto and David Schwartz. Originally, the firm launched with the goal of providing a peer-to-peer trust network. In 2012, the team partnered with another developer by the name of Fugger. At the time, he had a project called OpenCoin which would eventually roll into Ripple. Ripple remained OpenCoin until September 2013, when it rebranded back to its original title.\n\nBy December 2014, Ripple Labs had started to secure major partnerships in the market. The firm began working with global payments service Earthport to provide a streamlined payment service to users. The RippleNet has seen rapid expansion ever since.\n\nSEC Issues\n\nNotably, in December 2020, Ripple Labs and two of its executives were sued by the U.S. Securities and Exchange Commission (SEC). The SEC alleged that Ripple had participated in the unregistered sale of unlicensed securities during its ICO. The trial is still ongoing in court.\n\nWhat's the Best Investment?\n\nBoth Ripple and Bitcoin offer high ROI potential. If you review past charts, it’s easy to see that Bitcoin has consistently outperformed XRP in terms of ROI. However, given the growing size of Ripple's Network, there is still a possibility for major growth with this project in the coming months as well. To date, both coins are up considerably from their launch.\n\nHow to Buy Bitcoin (BTC) and Ripple (XRP)\n\nThese are two of the most popular cryptocurrencies in the world. The exchanges below enable the purchase of both of these digital assets.\n\nUphold – This is one of the top exchanges for United States & UK residents that offers a wide range of cryptocurrencies. Germany & Netherlands are prohibited.\n\nUphold Disclaimer: Terms Apply. Cryptoassets are highly volatile. Your capital is at risk. Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment, and you should not expect to be protected if something goes wrong..\n\nKraken – Founded in 2011, Kraken is one of the most trusted names in the industry with over 9,000,000 users, and over $207 billion in quarterly trading volume.\n\nThe Kraken exchange offers trading access to over 190 countries including Australia, Canada, Europe, and is a top exchange for USA residents. (Excluding New York & Washington state).\n\nBitcoin Vs Ripple – Two Sides of the Coin\n\nNow that you understand the key differences between Bitcoin vs Ripple, it’s easy to see why both of these projects can coexist in the market. Investors will find that Bitcoin offers an excellent SoV and Ripple is a project that has a strong following in the market. For these reasons, it’s not a bad decision to participate in both networks to some degree.\n\nTo learn more, make sure to visit our Investing in Bitcoin and Investing in Ripple guides."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDgvMTQvZGlzYXBwZWFyYW5jZS1vZi05MDBrLXB1dHMtZm9jdXMtb24tdmludGFnZS1iaXRjb2luLXByb2plY3QtbGliYml0Y29pbi_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA4LzE0L2Rpc2FwcGVhcmFuY2Utb2YtOTAway1wdXRzLWZvY3VzLW9uLXZpbnRhZ2UtYml0Y29pbi1wcm9qZWN0LWxpYmJpdGNvaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Disappearance of $900K Puts Focus on Vintage Bitcoin Project Libbitcoin - CoinDesk",
        "content": "Eric Voskuil, BX’s lead developer, admitted that the seed generator was indeed insecure, but insisted there was no bug in the software, arguing that the bx seed text command had been misused. He tweeted a screenshot of the application’s GitHub documentation that warns developers of the vulnerability."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXMtc2lkZXdheXMtcHJpY2UtYWN0aW9uLWxlYWRzLXRyYWRlcnMtdG8tZm9jdXMtb24tc2hpYi11bmktbWtyLWFuZC14ZGPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 13 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin's sideways price action leads traders to focus on SHIB, UNI, MKR and XDC - Cointelegraph",
        "content": "Bitcoin (BTC) is on track to form two successive Doji candlestick patterns on the weekly charts but a positive sign is that the price is sustaining above the 20-week exponential moving average ($28,072). This suggests that the bulls have not lost their grip.\n\nPopular pseudonymous trader TechDev used the three-week timeframe to show that Bitcoin’s compression above the 20-period moving average was approaching values seen only four times since Bitcoin’s creation. Interestingly, on all three previous occasions, the expansions happened to the upside, suggesting that history favors the bulls.\n\nCrypto market data daily view. Source: Coin360\n\nHowever, in the near term, the lack of volatility has pulled Bitcoin futures trading volumes to their lowest levels since December 2022. Cointelegraph contributor Marcel Pechman believes this shows that traders may have shifted to other markets or may be avoiding making moves at the current levels.\n\nWhile several altcoins are looking to Bitcoin for direction, some have outperformed in the near term. Let’s study the charts of the top-five cryptocurrencies that are looking positive over the next few days.\n\nBitcoin price analysis\n\nBitcoin has been trading near the 20-day EMA ($29,447) for the past two days, signaling indecision between the bulls and the bears.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe flattish moving averages and the relative strength index (RSI) near the midpoint do not give a clear advantage either to the bulls or the bears. That could keep the BTC/USDT pair stuck inside the $28,585-to-$30,150 range for a while.\n\nThe next trending move is likely to begin after the price escapes this range. If the price dives below $28,585, the selling could pick up momentum and the pair may dump to $26,000.\n\nOn the upside, a break and close above $30,150 may attract buyers. The pair could then surge to the $31,804-to-$32,400 resistance zone.\n\nBTC/USDT four-hour chart. Source: TradingView\n\nThe four-hour chart shows that the price is stuck between the moving averages, suggesting uncertainty about the next trending move. If the price closes below the 50-day simple moving average, the short-term advantage will tilt in favor of the bears. That could drag the price toward $29,000 and then to $28,585.\n\nIf the price turns up and breaks above the 20-day EMA, it will suggest that the bulls are trying to seize control. The pair may first rise to $29,738, and if this hurdle is cleared, the rally could reach the overhead resistance at $30,350.\n\nShiba Inu price analysis\n\nShiba Inu (SHIB) is in a strong recovery, but buyers are facing resistance near the overhead resistance at $0.000012.\n\nSHIB/USDT daily chart. Source: TradingView\n\nThe upsloping 20-day EMA ($0.000009) and the RSI near the overbought zone indicate that bulls are in command. If buyers do not give up much ground from the overhead resistance, it will enhance the prospects of a rally above $0.000012. If that happens, the SHIB/USDT pair could soar to $0.000014 and then to $0.000016.\n\nContrarily, if the price slumps below $0.000010, the pair may extend its pullback to the 20-day EMA. This remains the key level to watch out for because a break below it may signal that the recovery may be over.\n\nSHIB/USDT four-hour chart. Source: TradingView\n\nThe four-hour chart shows that the price has corrected to the 20-day EMA. The bulls are expected to protect the level with vigor. If they do that, the pair may again attempt to break and sustain above the overhead resistance at $0.000011.\n\nIf the price skids and sustains below the 20-day EMA, it will suggest that the bulls are losing their grip. The pair may then tumble to the next major support at the 50-day SMA. This level may witness aggressive buying by the bulls.\n\nUniswap price analysis\n\nUniswap (UNI) rebounded off the 50-day SMA ($5.79) on Aug. 7 and rose above the 20-day EMA ($6.09) on Aug. 8. This shows that buyers are active at lower levels.\n\nUNI/USDT daily chart. Source: TradingView\n\nThe UNI/USDT pair is witnessing a tough battle near the 20-day EMA, indicating that the bears have not yet given up. If the price sustains below the 20-day EMA, the selling could intensify and the pair may drop to the 50-day SMA.\n\nInstead, if the price rebounds off the 20-day EMA, it will indicate that the bulls are trying to flip this level into support. If they manage to do that, the pair may rise above the immediate resistance at $6.35 and reach $6.70.\n\nUNI/USDT four-hour chart. Source: TradingView\n\nBoth moving averages have flattened out on the four-hour chart. This suggests a balance between supply and demand. If the price dips below the 50-day SMA, the advantage will tilt in favor of the bears. The pair may then plunge to $5.80.\n\nAlternatively, if the price rebounds off the 50-day SMA and rises above the 20-day EMA, it will suggest buying on dips. The pair could then rise to $6.35. Buyers will have to surmount this resistance to come out on top. The pair may then soar to $6.70.\n\nRelated: Voyager’s token transfer to Coinbase sparks sell-off suspicions\n\nMaker price analysis\n\nMaker (MKR) has been trading above the breakout level of $1,200 for the past few days, indicating that the bulls are attempting to flip the level into support.\n\nMKR/USDT daily chart. Source: TradingView\n\nThe 20-day EMA ($1,204) is sloping up gradually and the RSI is in the positive territory, suggesting that the bulls have the edge. Buyers will try to propel the price above the immediate resistance of $1,284 and challenge the local high at $1,370. A break and close above this level could signal the start of a new uptrend.\n\nIf bears want to prevent the uptrend, they will have to quickly yank the price back below the breakout level of $1,200. That could open the gates for a decline to the 50-day SMA ($1,041).\n\nMKR/USDT four-hour chart. Source: TradingView\n\nThe 20-day EMA on the four-hour chart has flattened out, and the RSI is just above the midpoint. The price action has formed a symmetrical triangle pattern, indicating indecision among the bulls and the bears.\n\nIf buyers drive the price above the triangle, the MKR/USDT pair may start an up-move toward the pattern target of $1,463. On the other hand, a break below the triangle could signal that bears are back in the game. The pattern target on the downside is $986.\n\nXDC Network price analysis\n\nXDC Network (XDC) has pulled back to the 20-day EMA ($0.062), which is an important support to watch out for.\n\nXDC/USDT daily chart. Source: TradingView\n\nThe 20-day EMA is flattening out and the RSI is just above the midpoint, indicating that the bullish momentum may be weakening. If buyers want to gain control, they will have to propel the price above the overhead resistance at $0.073. That could start an up-move to $0.082.\n\nOn the contrary, a break and close below the 20-day EMA could sink the pair to the 61.8% Fibonacci retracement level of $0.056. Such a move could delay the start of the next leg of the uptrend.\n\nXDC/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows a descending triangle formation, which will complete on a break and close below $0.061. If that happens, the pair could start a downward move to $0.054 and, thereafter, to the pattern target of $0.040.\n\nContrary to this assumption, if the price continues higher from the current level and breaks above the downtrend line, it will invalidate the bearish setup. The failure of a negative setup is a positive sign. That could open the doors for a potential rally to $0.082.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4taW5jaGVzLXVwLWRvZ2Vjb2luLXNvbGFuYS1sZWFkLWxvc3Nlcy_SAUdodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWluY2hlcy11cC1kb2dlY29pbi1zb2xhbmEtbGVhZC1sb3NzZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin inches up; Dogecoin, Solana lead losses - Forkast News",
        "content": "Bitcoin inched up in Monday afternoon trade in Asia and continued to hover around the US$29,000 mark. Ethereum and most other top 10 non-stablecoin cryptocurrencies by market capitalization were little changed, except Dogecoin and Solana. Most Asian stock markets fell on China’s economic recovery concerns. U.S. stock futures dropped while European bourses traded mixed.\n\nSee related article: FTX founder Sam Bankman-Fried jailed for witness interference\n\nBitcoin prices may struggle until Sept.\n\nBitcoin inched up 0.04% in the last 24 hours to US$29,393 at 4 p.m. in Hong Kong, bringing its weekly gains to 1.24%, according to CoinMarketCap data. At the same time, the world’s largest cryptocurrency’s market capitalization dropped 0.03% to US$571.67 billion.\n\n“Bitcoin prices have been pinned at US$29,000 for three weeks, refusing to decline, despite the correction in some large-cap technology stocks – Apple, Nvidia, and Microsoft,” Markus Thielen, head of research and strategy at digital asset service platform Matrixport, said in an emailed statement on Thursday.\n\n“Two significant catalysts are supporting Bitcoin and Ethereum prices into year-end: the potential SEC approval for a U.S.-listed physical Bitcoin ETF and Ethereum’s EIP-4844 upgrade, which is expected in Q4 2023,” Thielen added.\n\nEthereum, the second-largest cryptocurrency, dropped 0.02% to US$1,848 in the past 24 hours.\n\nEthereum’s EIP-4844 upgrade, with the introduction of ‘blobs’ of data – a new transaction type – is expected to reduce transaction fees and increase transaction throughput.\n\nIn June, BlackRock and a number of major U.S. financial institutions filed applications with the U.S. Securities and Exchange Commission (SEC) to create spot Bitcoin ETFs. The SEC was expected to announce its decision on Ark Investment’s spot Bitcoin ETF application on Aug. 13. However, the regulator said in a Friday filing that it will solicit public comment on the ETF proposal, effectively pushing back the deadline.\n\n“More SEC responses will also be expected during the first week of September, when seven other Bitcoin ETF filings are required to receive a response from the SEC. The possibility is high that several Bitcoin ETFs would be approved in short order, igniting the next leg higher in Bitcoin prices as those ETF providers would spend considerable marketing expenses to draw in retail and institutional capital,” Thielen added.\n\nHowever, Bitcoin prices could decline by September to about US$26,000 to US$27,000 as the summer lull ends, Thielen cautioned, adding that this could be an attractive buying opportunity for the seasonal rally in the fourth quarter.\n\n“Bitcoin prices would struggle until September before they start their ascent again. This is happening, and our inclination of being very cautious in managing our positions in the short term but we are eying another perfect buying opportunity to prepare for the year-end rally and the expectations for a strong 2024,” he added.\n\nBitcoin’s next halving event is expected in April 2024, when the amount of new Bitcoin issued is cut in half, increasing its scarcity and pushing up the token’s price.\n\nDogecoin led losers in the past 24 hours, followed by Solana, although both posted gains on the week. Dogecoin lost 1.90% to US$0.07491 in the last 24 hours but gained 0.32% on the week. At the same time, Solana dropped 1.44% to US$24.39 while gaining 5.59% in the past seven days.\n\nThe total crypto market capitalization dropped 0.03% to US$1.17 trillion while market volume gained 47.04% to US$23.76 billion in the past 24 hours.\n\nDeGods tops NFT collections after ‘Season 3’ launch\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe main Forkast 500 NFT index fell 0.48% to 2,479.89 in 24 hours to 7.30 p.m. in Hong Kong, but has gained 0.71% in the past seven days.\n\nForkast’s Ethereum NFT Index, and the indexes measuring the Polygon and Solana NFTs all declined.\n\nTotal NFT sales volumes gained 1.45% to US$14,492,874 in the past 24 hours, according to data from CryptoSlam.\n\nSales volumes on Ethereum, the largest NFT network, rose 5.51% to US$9.03 million, while Solana, which was second in CryptoSlam’s NFT rankings by sales volume, dropped 7.89% to US$1.09 million in the last 24 hours.\n\nAmong NFT collections, Ethereum-based DeGods topped rankings, surging 67.67% in the last 24 hours to US$$948,014. DeGods has launched its “Season 3” digital art collection, which features a more simplistic, pop-art inspired style.\n\n5. After receiving a lot of valuable feedback we have decided to postpone Female DeGods.\n\n\n\nLooking forward to re-approaching that project by getting more feedback from the women in our community.\n\n\n\nWe'll start reaching out shortly. — DeGods (@DeGodsNFT) August 13, 2023\n\nEthereum-based NFT staple Bored Ape Yacht Club ranked third among collections, dropping 11.24% in the past 24 hours to US$671,890.\n\nMost Asian markets, U.S. futures fall; European bourses mixed\n\nImage: Envato Elements\n\nAsian equity markets were mostly down on Monday. China’s Shenzhen Component, Hong Kong’s Hang Seng, Japan’s Nikkei, and South Korea’s Kospi dropped at the end of trading hours, on investor concern after data showed that new bank loans in China fell 89% in July compared to June, the lowest since late 2009.\n\n“It is a big disappointment, proving the fragile status of the recovery in China,” Kiyong Seong, lead Asia macro strategist at Societe Generale, told Bloomberg.\n\nInvestors now await China’s national retail sales and industrial output data — set for release Tuesday — for further indicators of potential deflation.\n\nIndia’s Sensex index at the Bombay Stock Exchange gained 0.12% on Monday after annual retail inflation in the world’s most populous nation jumped to 7.44% in July, higher than market forecasts of 6.5%, primarily due to a surge in food prices.\n\nU.S. stock futures dropped as of 8.50 p.m. in Hong Kong with the Dow Jones Industrial Average futures, the S&P 500 futures, and the Nasdaq 100 futures all in the red.\n\nFriday’s release of the latest producer price index (PPI) data in the U.S. — a key inflation indicator that monitors selling prices received by domestic producers of goods and services — strengthened for July, with the 0.3% gain slightly higher than the 0.2% forecast by analysts.\n\n“We’re now starting to see the drag effects on the U.S. economy with households and businesses becoming considerably more prudent. In addition, investors are becoming more and more concerned that additional hikes [in interest rates] could steer the U.S. economy into a major recession,” Nigel Green, the CEO and founder of the deVere investment advisory group, said in emailed comments on Thursday.\n\nThe Federal Reserve, the U.S. central bank, meets next on Sept. 19 to decide on interest rates and direction of the economy. Currently, interest rates in the world’s largest economy are between 5.25% to 5.50%, the highest in 22 years.\n\nEuropean bourses were mixed on Monday, with the benchmark STOXX 600 falling while Germany’s DAX 40 strengthened during afternoon trading hours in Europe.\n\n(updates with equities section.)"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA4LzE0L2F1cmFkaW5lLTgxLW1pbGxpb24tZnVuZGluZy1iaXRjb2luLWNoaXAtbWFrZXItaGFyZHdhcmUtc3RhcnR1cHMtY2VsZXN0YS1jYXBpdGFsLW1heWZpZWxkL9IBhAFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA4LzE0L2F1cmFkaW5lLTgxLW1pbGxpb24tZnVuZGluZy1iaXRjb2luLWNoaXAtbWFrZXItaGFyZHdhcmUtc3RhcnR1cHMtY2VsZXN0YS1jYXBpdGFsLW1heWZpZWxkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "How a crypto startup raised $81 million with no product, no customers, and just a pitch deck - Fortune",
        "content": "In May, the crypto startup Auradine announced it had raised $81 million, an attention-grabbing sum for a firm’s first fundraise, especially in a crypto bear market and especially for a company that said it’s making “disruptive infrastructure solutions leveraging cutting-edge technologies” but declined to provide details about what any of that actually was.\n\n“Even in the hardware sector, where capital intensity is very high, this is pretty eye-opening,” Tom Walton-Pocock, founder of deep-tech venture capital firm Geometry, told Fortune. “It’s a pretty gigantic raise.”\n\nAlso surprising, and what no other publication has reported, was that the founders of Auradine—Rajiv Khemani, Barun Kar, and Patrick Xu—had raised $81 million with no product and no customers. A pitch deck had been enough for investors to throw tens of millions of dollars at the trio.\n\nOnly recently did Auradine unveil its first product: a Bitcoin chip and mining system called Teraflux. So how did Khemani, Kar, and Xu raise $81 million seemingly out of thin air?\n\nOld kids on the block\n\nKhemani, now the CEO of Auradine, is not a fresh-out-of-college founder.\n\nAfter studying computer science and engineering in Delhi, he worked his way up the corporate ladder to become general manager and director of marketing at Intel. Then, after more than a decade in corporate tech, he caught the startup bug and guided a semiconductor company to an initial public offering, founded his own early-stage venture capital outfit, and, in 2021, sold a cloud-computing startup for more than $1 billion.\n\nIn late 2021, Kar and Xu, then vice presidents at cybersecurity firm Palo Alto Networks, told Khemani they had an idea for a company and that the two were already in talks with Marathon, a publicly traded Bitcoin miner, about their planned startup.\n\n“We recognized early on that this was a very large opportunity,” Sriram Viswanathan, a founding managing partner at Celesta Capital who had invested in Khemani’s last company, told Fortune. (Celesta and Mayfield were the two lead investors in Auradine.) He decided to back the new venture, but he stipulated that Khemani, who initially was just advising Kar and Xu, become CEO.\n\nKhemani agreed, and in May 2022, just as the crypto market was entering freefall after the collapse of the fraudulent Terra stablecoin, the team finalized an $81 million raise to develop hardware for specialized computations—Bitcoin mining, advanced cryptography, and A.I. They named their company Auradine, combining the Latin word for gold—aurum—with the unit of force—dyne.\n\nCashing out chips\n\nStartups that aim to manufacture hardware aren’t the same as those that spin up a simple iPhone app, and the capital costs of making computer chips are much higher.\n\nBy the time a company “does get to the point that it’s decided to produce a chip, you are talking about an outlay of tens of millions of dollars,” Walton-Pocock of Geometry told Fortune.\n\nThat’s why, he said, many Silicon Valley investors just won’t touch hardware. “But on the flip side,” he added, “I think that also means that the reward to getting hardware semiconductors right can be exceptional, as long as you’re backing the right founders.”\n\nViswanathan of Celesta Capital, which regularly backs semiconductor companies, reiterated how financially intensive it is for startups that build products, not just apps. “The app doesn’t cost a lot of money to build if you actually think about it,” he said.\n\nBut hardware does, and so the bets—and potential risks—are bigger. “It’s not unusual for companies to raise $40 [million] to $50 million, if not more, in the semiconductor area,” Viswanathan added.\n\nWhile the $81 million figure Auradine raised is initially eye-popping, it’s important to note that the figure includes $71 million in equity funding and a $10 million loan. And the raise came in two tranches, according to Khemani, the CEO, with the first allotment in the first half of 2022, and the second—only once established goals and checkpoints were met—later that year.\n\nA Bitcoin chip—and then what?\n\nIn July, Auradine unveiled its Bitcoin mining system. It was, the startup said, the first to develop a four-nanometers-in-length silicon transistor built specifically for Bitcoin mining—the process by which computers validate transactions on the Bitcoin blockchain and receive Bitcoin in exchange. (Other rigs in production use a five-nanometer chip.)\n\nTransistors are the electrical on-and-off switches that compose computer processors. If they’re smaller, more can be added to a processor, and that processor becomes more powerful. A Bitcoin mining system that uses a smaller transistor could substantially increase a miner’s daily winnings, which is why Marathon, the publicly traded Bitcoin miner, was so interested in Auradine from the outset.\n\nHowever, the startup, which plans to ship its Bitcoin mining system to early-access customers in the third quarter of 2023, has branded itself as something more than just a Bitcoin chipmaker; it’s a company, per its website, that is “reimagining blockchain, A.I., and privacy.”\n\nWhat that means in practice is ambiguous, as Auradine remains tight-lipped. “You don’t want copycats to come up,” Navin Chaddha, managing partner of Mayfield, said in reference to the startup’s reticence.\n\nIn the meantime, after securing its first raise, Auradine is receiving “inbound interest for a follow-on round of funding,” Khemani said. While he declined to tell Fortune how much Auradine is planning to drum up, what is clear is that, this time around, he, Kar, and Xu will present investors with more than just a pitch deck."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmRpZy1pbi5jb20vbmV3cy9iaXRjb2luLWRlbm9taW5hdGVkLWxpZmUtaW5zdXJhbmNlLW1lYW53aGlsZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin-denominated life insurance Meanwhile - Digital Insurance",
        "content": "Startup life insurer Meanwhile is betting that a target market of high-net worth individuals will respond to its bitcoin-denominated policies and premiums for coverage.\n\nCo-founder and CEO Zac Townsend believes so strongly in the value proposition for bitcoin-based life insurance that Meanwhile's balance sheet, its financials and its operations are all conducted in bitcoin. He says Meanwhile's policies are meant to pass on intergenerational wealth, rather than the traditional life insurance function of protecting beneficiaries against loss.\n\nZac Townsend, co-founder and CEO, Meanwhile.\n\n\"We're not out there trying to sell bitcoin life insurance to your average life insurance user,\" he said. \"We're going to people who have already bought into bitcoin and the crypto economy. We're not trying to convince people to buy crypto if they don't have crypto.\"\n\nTownsend and co-founder Max Gasner, Meanwhile's CTO, started the company in 2021 and got its first funding round in January 2022. In June 2023, Meanwhile announced $19 million in new funding from two seed rounds including investments by Sam Altman, CEO of OpenAI; angel investor Lachy Groom, formerly head of Stripe Issuing; and Gradient Ventures, Google's venture capital arm.\n\nTownsend asserts that bitcoin is a better way to store value in life insurance and for beneficiaries. \"Bitcoin is the oldest and most mature cryptocurrency. Life insurance is about potentially you dying and passing something on to your beneficiaries,\" he said. \"For bitcoin, its narrative is very much around the store of value, and it's very much around, for some people, intergenerational wealth accumulation.\"\n\nTownsend calls the bitcoin denomination of Meanwhile's balance sheet and its policies a hedge against volatility. He asserted that a recognized government-backed currency such as Swiss francs can also fluctuate, and while bitcoin's fluctuations can be greater, having all the operations in bitcoin means the reserves, capital, assets and liabilities hold at steady amounts.\n\nWhile accounting balance sheets can be presented differently depending on the standard or principles being used (such as GAAP), denominating a balance sheet in bitcoin raises concerns, according to John Keddy, senior principal at consultancy Datos Group.\n\n\"There's different types of assets that you need to hold for reserves. And they have different risk factors or weights,\" Keddy said. \"Let's say for sake of argument, someone said, 'We're gonna sell a whole bunch of life policies, or a whole bunch of annuities. And the reserves are 100% bitcoin.' Most would have a lot of questions about that, because that would be rated as a relatively high risk asset class.\"\n\nMeanwhile's Townsend said the company is licensed by the Bermuda Monetary Authority to operate using a bitcoin denomination. Meanwhile spent about 18 months building a regulatory framework and getting regulatory approvals, he added, noting that in May 2022, Jim Cristallo, a 20-year veteran executive at New York Life, joined as chief insurance officer, and in January, Annie Tay, a risk solutions and actuarial expert since 2010 with previous experience at MetLife and A.M. Best, joined as chief risk officer.\n\nTownsend sees Meanwhile's target market as cryptocurrency investors who are aging into their 30s and beginning to think about life insurance and wealth transfer. \"It's a very hard pitch to say to those folks, you should really be thinking about this complicated variable universal life policy,\" he said. \"The narratives of life insurance don't necessarily resonate with younger people. Having the hook of bitcoin and crypto allows us to engage in those conversations. Because our product is new and the space is new, we've deliberately come to market with a very straightforward, easy to understand product. And that resonates with younger users more easily.\""
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmludGVjaC5nbG9iYWwvMjAyMy8wOC8xNC9ob25nLWtvbmdzLWJpdGNvaW4td2ViMy13YWxsZXQteHZlcnNlLXB1bGxzLWluLTVtLXJhaXNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Hong Kong's Bitcoin Web3 wallet Xverse pulls in $5m raise - FinTech Global",
        "content": "Xverse, a Bitcoin Web3 wallet, including NFTs through a method called Ordinals, has secured significant backing in its latest seed round.\n\nThe company raised $5m in a seed round that was led by prominent industry investor Jump Crypto.\n\nOther participants in the round included RockawayX, Sfermion, Alliance, NGC Ventures, V3ntures, Old Fashion Research, 2140 Bitcoin Ecosystem Fund, Bitcoin Frontier Fund, Newman Capital, Franklin Templeton, New Layer Capital, Miton C, Gossamer Capital, Daxos Capital, Sora Ventures, Tyhke Block Ventures, IOBC Capital and Despread, among others.\n\nXverse offers a unique Bitcoin Web3 wallet, providing users with an extensive range of advanced features related to decentralized finance (DeFi), Stacks, Lightning, and other Bitcoin scaling solutions. The company also supports Ordinals, a cutting-edge method of generating NFTs on the Bitcoin blockchain, which has been making headlines in recent months.\n\nThe new funding will enable Xverse to accelerate the development of its advanced features, particularly in areas related to DeFi and Bitcoin scaling solutions such as Stacks and Lightning.\n\nLast month, Ordinals, the method of generating NFTs supported by Xverse, received considerable attention after daily new inscriptions reached a staggering 350,000. The Xverse wallet is available on iOS, Android, and also through a Chrome extension.\n\nKeep up with all the latest FinTech news here.\n\nCopyright © 2023 FinTech Global"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy93aWxsLWFyZ2VudGluYS1mb2xsb3ctZWwtc2FsdmFkb3Itc3RlcHMtcHJvLWJpdGNvaW4tamF2aWVyLW1pbGVpLXdpbnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "WIll Argentina Follow El Salvador Steps -- Pro-Bitcoin Javier Milei Wins - CCN.com",
        "content": "Key Takeaways\n\nBitcoin Advocate Javier Milei wins the primary election in Argentina\n\nThe youth, fed up with inflation, resound with Milei’s win as it rejects traditional politicians\n\nArgentina’s economy and the world at large may change as a result of Milei’s Bitcoin position and Central Bank recommendation\n\nIn the open primary elections for the country’s presidency, an Argentine politician Javier Milei who favors Bitcoin and advocates for the abolition of his nation’s central bank is now in the lead .\n\nLibertarian and pro-Bitcoin candidate Javier Milei is in the lead with approximately 32% of the votes thus far. According to data , he is being trailed by the conservative Together for Change (Juntos por el Cambio) party, which has just under 30% of the vote.\n\nDifferent Argentina Impossible With Same Old Things\n\nWith little more than 28.5% of the vote, the coalition representing the current administration, the left-leaning Union for the Homeland (Unión por la Patria), is in third place.\n\nLibertarian and pro-#bitcoin candidate, Javier Milei, has taken a commanding lead in the Argentinian primary elections. pic.twitter.com/65XQeIVJth — Peter McCormack🏴‍☠️ (@PeterMcCormack) August 14, 2023\n\nMilei established and is the leader of the alliance Liberty Advances (La Libertad Avanza), whose ideologies range from libertarian to far-right.\n\nIn his dramatic post-election speech, Milei said : “We are the true opposition. A different Argentina is impossible with the same old things that have always failed.”\n\nMilei, who describes himself as an anarcho-capitalist, has advocated for the abolition of Argentina’s central bank and described the sale of human organs as “just another market.”\n\nAccording to him, Bitcoin is a response to “central bank scammers” and fiat money enables governments to defraud Argentineans through inflation.\n\nJavier Milei is running for President of Argentina. He appears to understand money, and that inflation is an unfair mechanism that advantages elites over the people and slowly robs people of their means of survival. pic.twitter.com/tj0KEztUzI — Alex Stanczyk ∞/21m (@alexstanczyk) January 5, 2023\n\nFor him, Bitcoin represents liberty and financial freedom. In his estimation of Bitcoin’s potential, “Bitcoin represents the return of money to its original creator: the private sector.”\n\nHe said :\n\n“Bitcoin is the natural reaction against Central Bank scammers, and to make money private again.”\n\nCentral Bank Banning Digital Wallets\n\nWith an annual inflation rate of 116%, the worst in over three decades, and a crisis in the cost of living, such rhetoric has found favor with Argentina’s voters.\n\nMilei labeled his previous promise to “blow it up ,” which he made last year in an effort to defraud “good people” through inflationary taxation, a hoax.\n\nAlthough the Central Bank of the nation recently banned digital wallets , little has changed in the booming crypto industry, which, according to Chainalysis , places Argentina’s use of cryptocurrencies at 13th globally.\n\nThe latest judgment states that digital wallets in Argentina are not permitted to “carry out or facilitate operations with digital assets, including crypto assets.” The “mitigating the risks” to the general public and the financial system was the central bank’s justification for its choice.\n\nThe country’s top digital wallet, Mercado Pago, is projected to be most impacted by the rule. A similar product had already been launched in Brazil by Mercado Libre’s digital bank and rival Nubank, both of which swiftly attracted one million subscribers.\n\nThe general presidential election in Argentina will take place on October 22. A run-off election will be place in November if no candidate receives at least 45% of the vote.\n\nPonzi Schemes, Milei, and the Central Bank\n\nMilei was brought up in court for allegedly endorsing Coinx , an Argentinean Ponzi scam that is accused of taking at least $800,000 in pesos.\n\nMilei then insisted that the business operated just like a bank and denied any misconduct.\n\nAlthough some in the cryptocurrency community are hoping Milei will advocate for a Bitcoin standard akin to El Salvador or other such pro-crypto policies, the eccentric presidential candidate might not be that willing.\n\nFor instance, he declared his plans to “dollarize” the Argentine economy just last month."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LnNlY3VyaXRpZXMuaW8vYml0Y29pbi12cy1ldGhlcmV1bS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Vs. Ethereum (2024 Edition) - Securities.io",
        "content": "As an educated crypto investor, it’s crucial you understand the differences between Bitcoin and Ethereum. Both of these coins are titans in the market, albeit for different reasons. Both coins are vital for the market's development at this point. Here's what makes these coins so different but, yet so important in the market.\n\nWhat is Bitcoin?\n\nBitcoin was the world's first successful cryptocurrency. Satoshi Nakamoto changed the world when he introduced his revolutionary protocol. His goal was to create a “peer-to-peer electronic cash system” that was both censorship-resistant and decentralized.\n\nHe succeeded in his mission when he officially launched Bitcoin in 2009. Since that time, Bitcoin has seen tremendous growth both financially and technologically. However, at its core, it still remains accessible to anyone. Bitcoin changed the world forever and inspired a new industry. For these reasons, you can consider Bitcoin the first generation of cryptocurrencies.\n\nNotably, Bitcoin is not stagnant and the protocol continually develops. However, it was built to serve its particular purpose. Consequently, it’s not the best option for features such as smart contracts or other next-gen blockchain functionalities. Notably, the introduction of second-layer protocols such as the Lightning Network expands Bitcoins functionality considerably.\n\nWhat is Ethereum?\n\nEthereum is a distributed, public blockchain. This decentralized network introduced the world to smart contract scripting functionality. These protocols allowed anyone to build decentralized applications and expand the use cases for cryptocurrencies. Today, there are thousands of different cryptos and blockchain projects. However, most utilize some forms of smart contracts to streamline network activities.\n\nNot Exactly A Cryptocurrency\n\nIt’s important you understand that Ethereum isn't a cryptocurrency. Ethereum is the platform that the cryptocurrency Ether functions within. This network functions as a programmable decentralized network for Dapp developers primarily. Additionally, Ether's primary role is to compensate miners for performing EVM (Ethereum Virtual Machine) computations.\n\nEthereum was the first cryptocurrency network built specifically to support Dapp development. Dapps are applications designed to run on decentralized networks. The first Dapps ran on decentralized networks such as Tor networks. These networks are censorship-resistant due to their decentralized nature.\n\nDapps that run on blockchain networks are at the core of the blockchain revolution. In this way, Ethereum represented a fundamental shift in the development and functionality of cryptocurrencies moving forward. For these reasons, Ethereum is considered a second-generation cryptocurrency\n\nSmart Contracts\n\nTo execute smart contracts, Ethereum introduces a unique protocol known as the EVM – the Ethereum Virtual Machine. Each full Ethereum node runs an instant of these virtual stacks. The main advantage of EVMs is that they improve the process of building decentralized applications by improving the programmability and efficiency that the network executes contract byte code.\n\nHistory of Ethereum\n\nOne of Bitcoin's early followers was a computer developer by the name of Vitalik Buterin. In 2013, this advantageous individual decided to build a new cryptocurrency. This new project would share many technical characteristics with Bitcoin. For example, both coins utilize a Proof-of-Work (PoW) algorithm to validate the state of the network.\n\nConsensus\n\nBitcoin utilizes the SHA-256 algorithm. This mathematical equation requires miners to prove their work through advanced calculations. The network automatically adjusts its difficulty to ensure that blocks of transactions only get approved in ten-minute intervals. This approach ensures a predictive monetary issuance strategy until the last Bitcoin gets mined sometime in 2140.\n\nEthereum, like Bitcoin, currently uses a proof-of-work (PoW) consensus protocol. However, Ethereum uses the Ethash algorithm. Buterin decided on this mechanism to help reduce the advantage of specialized ASIC (Application Specific Integrated Circuit) mining rigs. ASIC mining rigs are built from the ground up to solve the SHA-256 algorithm Bitcoin uses. Critics of ASIC miners argue that these high-priced rigs cause centralization in the Bitcoin network.\n\nBlock Times\n\nWhen comparing the transaction thru put of the networks, Ethereum comes out far ahead of Bitcoin. Bitcoin approves blocks every 10 minutes. These blocks hold no more than 1MB of data. Consequently, Bitcoin is only capable of around 7 transactions per second. This low data rate was built into Bitcoin's core coding to ensure that anyone could use the network.\n\nThe Ethereum network is capable of approximately 15 transactions per second. These capabilities are set to improve significantly following the upcoming Ethereum 2.0 update. This upgrade would push Ethereum's capabilities closer to 100,000 transactions per second according to developers.\n\nMining Rewards\n\nThere are different mining rewards paid out to nodes on each network. Bitcoin miners receive a reward of 6.5 BTC if they are the node that completes the SHA-256 equation first and adds the next block to the blockchain. Comparingly, Ethereum miners receive a reward of 2 ETH for their participation in validating blocks of transactions.\n\nTotal Supply – Bitcoin vs Ethereum\n\nBitcoin caps its supply of 21,000,000 coins. This strategy ensures that Bitcoin retains scarcity in the market. Reversely, there is no cap on the amount of Ether (ETH). The network must continue to produce ETH indefinitely to cover gas fees created by developers executing EVMs. Currently, there are 114,467,625.91 ETH in circulation today.\n\nEthereum to go PoS\n\nInterestingly, Ethereum is set to do a major upgrade this year to Ethereum 2.0. This hard fork would place ETH on a new blockchain that runs on a Proof-of-Stake (PoS) algorithm. PoS networks remove miners and rely on coin holders staking their tokens to validate the network's state.\n\nPoS networks are far more energy-efficient and cheaper to maintain. They also provide faster transaction times compared to PoW networks. Best of all, there is no need to purchase expensive mining equipment because all you need is a network wallet to stake your coins on a PoS system.\n\nThe ETH ICO vs Bitcoin's Launch\n\nBitcoin had a quiet launch that was celebrated by only a select few in the cypherpunk and development community taking any notice of this monumental invention. Interestingly, Bitcoin's journey officially began with the genesis block. This is the first block of Bitcoin's blockchain. While no one knows for sure how many Bitcoins Nakamoto mined, estimates put his rewards at 1 million Bitcoin.\n\nIn comparison, Ethereum entered the market with much more fanfare. The Ethereum ICO (Initial Coin Offering) raised $18 million. Ethereum continued this momentum into the launch of the first DAO (Decentralized Autonomous Organization). This event took place in April 2016. The launch of the DAO boosted Ethereum's status and helped the network to secure $150 million in its public ICO. At the time, the DAO was the largest crowdfunding event to take place in the blockchain industry.\n\nApples vs Oranges\n\nNow that you have a better understanding of the differences between Bitcoin vs Ethereum, it’s easy to see why both projects have longevity in the sector. As such, most crypto investors hold both of these coins in their portfolios.\n\nTo learn more, make sure to visit our Investing in Bitcoin and Investing in Ethereum guides.\n\nHow to Buy Bitcoin (BTC) and Ethereum (ETH)\n\nThese are two of the most popular cryptocurrencies in the world. The exchanges below enable the purchase of both of these digital assets."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW5ldy12b2xhdGlsaXR5LWJ0Yy1wcmljZS00LWRheS1oaWdo0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin teases new volatility as BTC price taps 4-day high near $29.6K - Cointelegraph",
        "content": "Bitcoin (BTC) hit multiday highs after the Aug. 14 Wall Street open as modest volatility trickled through to the market.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin traders provide “some action” after flat weekend\n\nData from Cointelegraph Markets Pro and TradingView tracked a trip past $29,500, marking the highest BTC price levels since Aug. 10.\n\nUnusually flat trading conditions, followed by a brief dip to $29,000 support, comprised weekend price action, and this is now appearing to give way to more interesting behavior.\n\nAnalyzing the current setup on exchange order books, popular trader Daan Crypto Trades noted what could be a “spoof” sell wall in place to keep spot price suppressed.\n\n“Quite the wall above price. Supposedly to push price down. Often these big orders are spoof orders and have no intention to actually get filled,” he told X (formerly known as Twitter) followers.\n\n“Does show that there’s some action going on in the books in this price region.”\n\nBTC/USD annotated chart. Source: Daan Crypto Trades/X\n\nBitcoin, nonetheless, stayed below a key resistance zone for bulls to flip, with $29,700 still the line in the sand for continuation.\n\n“BTC will soon challenge the multi-week series of Lower Highs for a breakout attempt,” popular trader and analyst Rekt Capital predicted on the day, referencing weekly timeframes.\n\nBTC/USD annotated chart. Source: Rekt Capital/X\n\nThe latest weekly close was of significance despite the lack of volatility, coming in at just above the key $29,250 level that bulls required.\n\nRekt Capital thus suggested that “a rebound could be near” for BTC/USD.\n\n#BTC has just about Weekly Candle Closed above the ~$29250 level (black)\n\n\n\nAnd already $BTC is showing very early signs of successfully retesting the ~$29250 level as support this week\n\n\n\nCoupled together with the Diamond-Shaped bottom, a rebound could be near#Crypto #Bitcoin pic.twitter.com/AmV2NLiY4Z — Rekt Capital (@rektcapital) August 14, 2023\n\nDollar stalls after 4% rebound\n\nThe week’s macro movements opened with United States equities modestly up, while U.S. dollar strength waned at resistance last seen in July.\n\nRelated: BTC price breakout by end of August? 5 things to know in Bitcoin this week\n\nThe U.S. Dollar Index (DXY) almost matched its July peak above 103.5 on the day before turning lower.\n\nThe past month has seen a significant bounce in DXY from lows of under 100 — something that traditionally acts as a headwind for crypto market performance.\n\nAnalyzing the situation, Caleb Franzen, senior market analyst at Cubic Analytics, forecast a “breakout or rejection incoming.”\n\n”Stock market bulls want a rejection. Stock market bears want a breakout,” part of commentary stated.\n\nU.S. dollar index (DXY) 1-day chart. Source: TradingView\n\nMagazine: Deposit risk: What do crypto exchanges really do with your money?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZyb250aWVyLWZ1bmQtbGF1bmNoZXMtYWNjZWxlcmF0b3ItcHJvZ3JhbS1mb3Itb3JkaW5hbHMtc3RhcnR1cHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Frontier Fund launches accelerator program for Ordinals startups - Cointelegraph",
        "content": "The Bitcoin Frontier Fund, formerly Stacks Ventures, launched what it’s calling the first Bitcoin Ordinals accelerator program on Aug. 14.\n\nProgram Information\n\n\n\nThis program is led by VC @TO & is a 4-month program for builders to raise funding, connect with mentors, & be guided by the best in the industry (sneak peak below).\n\n\n\nIt will help with co-founder relationships, mentors & advisors, fundraising & pitching. pic.twitter.com/MSykk2l7Dl — Bitcoin Frontier Fund (@BTCFrontierFund) August 14, 2023\n\nAccording to the program’s website, the Bitcoin Frontier Fund is offering seed money to startups innovating in the Ordinals space along with access to funding pipelines and mentorship:\n\n“We offer $100k in investment and a badass program and community to take your startup to the next level, in exchange for 2-3% equity in common shares.”\n\nStartups with no “substantial funding” will be required to sign over a 3% equity share in order to receive the funds and join the program. Those who’ve already secured funding in the amount of $600,000 or more within the previous six months will only need to sign over a 2% share.\n\nWhile the exact requirements for acceptance into the program are unclear, the website lists several areas of interest, including infrastructure, proven Web3 use cases, developer tools and accessibility.\n\nRelated: Bitcoin Ordinals team launches nonprofit to grow protocol development\n\nOrdinals are a relatively new development for blockchain and cryptocurrency. They were created by Bitcoin (BTC) developer Casey Rodarmor in January of 2023.\n\nEssentially, Ordinals are just inscriptions made on individual units of a digital asset. They're similar to a painter creating limited edition lithograph prints of a famous piece and then numbering them.\n\nTypically, the lowest numbers would have more perceived value by collectors even though the prints are considered exactly the same. Adding to this collectibility is the fact that data can be “inscribed,” or stored, within a Bitcoin Ordinal, making it function a bit like a nonfungible token.\n\nBitcoin Ordinals are made up of satoshis, the smallest digital asset on the Bitcoin blockchain. They can be inscribed with up to four megabytes of data. This makes it possible to embed text and images in each Ordinal.\n\nDespite having only existed since the end of January, 2023, Ordinals have had a major impact on the blockchain and cryptocurrency communities.\n\nAmong the tech’s supporters is Ethereum creator Vitalik Buterin, who recently said, “Ordinals have revived ‘builder culture’ on Bitcoin.” Many other members of the community, however, have expressed concerns over what’s being perceived as a civil war between those who believe Ordinals are harmful to the Bitcoin network and its spirit, and those who see it as an innovative evolution of existing technology."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvaG93LXRvLWJ1eS1iaXRjb2luLW9yLWNyeXB0by13aXRoLWJhbmNvLWF6dGVjYdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "How to Buy Bitcoin or Crypto with Banco Azteca? - Watcher Guru",
        "content": "How to Buy Bitcoin or Crypto with Banco Azteca? : A Beginner’s Guide\n\nIn recent years, cryptocurrencies have gained significant popularity as an alternative investment option. Bitcoin, the most well-known cryptocurrency, has captured the attention of investors worldwide.\n\nAs interest in Bitcoin continues to grow, more and more people are looking for convenient ways to buy and trade this digital currency.\n\nAlso read: How To Buy Cryptocurrency Using A Prepaid Card?\n\nIn this guide, we will explore how you can buy Bitcoin with Banco Azteca, one of the leading consumer banks in Mexico.\n\nSource: MARCA\n\nWhy Banco Azteca?\n\nBanco Azteca, founded by billionaire Ricardo Salinas Pliego in 2002, is a prominent banking institution in Mexico.\n\nAdditionally, with operations not only in Mexico but also in Panama, Guatemala, Honduras, and Peru, Banco Azteca offers a wide range of financial services, including personal loans, credit cards, and asset-backed loans.\n\nRecognizing the potential of cryptocurrencies, Banco Azteca has expressed its desire to become the first bank in Mexico to accept Bitcoin.\n\nWhat is the easiest way to buy Bitcoin in Mexico?\n\nAs an investor, diversifying your portfolio is crucial to managing risk and maximizing potential returns.\n\nBitcoin provides an excellent opportunity for diversification, given its decentralized nature and potential for growth. Here are some key benefits of buying Bitcoin with Banco Azteca:\n\nDiversification: Adding Bitcoin to your investment portfolio allows you to diversify your holdings and reduce reliance on traditional assets. Future Potential: Bitcoin and other cryptocurrencies have shown tremendous growth potential over the years. By investing in Bitcoin, you can participate in this emerging market and potentially benefit from its future growth. Accessibility: Banco Azteca’s integration of Bitcoin into its services makes it easier for customers to access and invest in this digital currency. This accessibility opens up new opportunities for individuals who may have been hesitant or unfamiliar with cryptocurrencies. Promoting Freedom: Banco Azteca’s commitment to bringing Bitcoin to its clients aligns with the principles of financial freedom and empowerment. By embracing cryptocurrencies, Banco Azteca is offering its customers more choices and expanding the options available in the financial market.\n\nHow to Buy Bitcoin or Crypto with Banco Azteca?\n\nWhile Banco Azteca’s plans to accept Bitcoin are exciting, it’s essential to understand the process of buying Bitcoin with the bank.\n\nFurthermore, Here is a step-by-step guide to help you navigate “How to Buy Bitcoin or Crypto with Banco Azteca?”:\n\nStep 1: Educate Yourself\n\nBefore diving into the world of cryptocurrencies, it’s crucial to educate yourself about Bitcoin and its underlying technology, known as blockchain.\n\nUnderstanding the basics will help you make informed decisions and navigate the market with confidence.\n\nAdditionally, start by reading reputable sources, following industry news, and exploring educational platforms dedicated to cryptocurrencies.\n\nStep 2: Create a Banco Azteca Account\n\nSource: CNBCTV18\n\nIf you don’t already have an account with Banco Azteca, you will need to create one. Visit the bank’s website or visit a local branch to begin the account opening process.\n\nProvide the necessary identification documents and complete any required paperwork. Once your account is set up, you will gain access to Banco Azteca’s services, including the ability to buy Bitcoin.\n\nStep 3: Fund Your Banco Azteca Account\n\nTo buy Bitcoin, you need to have funds in your Banco Azteca account. Transfer the desired amount of money into your account using one of the bank’s accepted funding methods.\n\nBanco Azteca offers various options for depositing funds, such as cash deposits, wire transfers, and credit card payments.\n\nAdditionally, choose the method that suits you best and ensure that your account has sufficient funds to make the Bitcoin purchase.\n\nStep 4: Find a Bitcoin Seller on LocalBitcoins.com\n\nTo facilitate the purchase of Bitcoin, Banco Azteca has partnered with LocalBitcoins.com, a popular peer-to-peer cryptocurrency exchange platform.\n\nVisit the LocalBitcoins.com website and search for Bitcoin sellers who accept Banco Azteca as a payment method.\n\nFurthermore, look for sellers with good ratings and a high number of completed trades to ensure a reliable and secure transaction.\n\nStep 5: Initiate the Bitcoin Purchase\n\nOnce you have identified a reputable Bitcoin seller on LocalBitcoins.com, initiate the purchase by selecting the desired amount of Bitcoin you wish to buy.\n\nThe platform will provide you with the necessary details, including the seller’s payment instructions and the exchange rate.\n\nFollow the instructions provided by the seller and proceed with the payment using your Banco Azteca account.\n\nStep 6: Complete the Transaction\n\nOnce the payment is made, notify the seller through the LocalBitcoins.com platform. The seller will then confirm the receipt of your payment and release the Bitcoin to your designated digital wallet.\n\nIt’s important to have a Bitcoin wallet to store your purchased Bitcoin securely. If you don’t have a wallet, consider setting up one before completing the transaction.\n\nStep 7: Secure and Monitor Your Bitcoin Investment\n\nAfter completing the transaction and receiving your Bitcoin, it’s crucial to prioritize the security of your digital assets.\n\nTransfer your Bitcoin from the exchange platform to your personal wallet, where you have full control over your private keys. Regularly monitor the value of your investment and stay informed about market trends to make informed decisions regarding your Bitcoin holdings.\n\nConclusion: How to Buy Bitcoin or Crypto with Banco Azteca?\n\nSource: Business Today\n\nIn conclusion, Banco Azteca’s commitment to accepting Bitcoin reflects the growing recognition of cryptocurrencies as a legitimate investment option.\n\nAdditionally, by embracing Bitcoin, Banco Azteca aims to offer its customers more choices and promote financial freedom.\n\nFurthermore, if you’re interested in diversifying your investment portfolio and exploring the world of cryptocurrencies, consider buying Bitcoin with Banco Azteca.\n\nRemember to educate yourself, create a Banco Azteca account, fund your account, find a reputable Bitcoin seller, initiate the purchase, complete the transaction, and secure your Bitcoin investment.\n\nWith careful research and strategic decision-making, you can embark on your Bitcoin investment journey with confidence.\n\nRemember, the world of cryptocurrencies is constantly evolving, and it’s essential to stay informed and adapt to changing market conditions.\n\nFurthermore, consult with a financial advisor or seek professional guidance before making any investment decisions.\n\nDisclaimer: The information provided in this article is for informational purposes only and should not be considered investment advice. Cryptocurrency investments are subject to market risk, and individuals should conduct thorough research and exercise caution when investing in cryptocurrencies."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbmdhcGUuY29tL2JpdGNvaW4tcHJpY2UtaW4tcmFuZ2UtdW5kZXItMzBrLW1pbmVyLWFjY3VtdWxhdGlvbi1hbmQtaW1wZW5kaW5nLWJ1bGxpc2gtYnJlYWtvdXQv0gFsaHR0cHM6Ly9jb2luZ2FwZS5jb20vYml0Y29pbi1wcmljZS1pbi1yYW5nZS11bmRlci0zMGstbWluZXItYWNjdW11bGF0aW9uLWFuZC1pbXBlbmRpbmctYnVsbGlzaC1icmVha291dC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Price Consolidating Ahead Of The Next Bullish Breakout - CoinGape",
        "content": "Bitcoin price has been moving lower within the narrow range between $29,000 and $30,000 since last week, with analysts starting to acclimatize to declines stretching to $28,000.\n\nThe most prominent crypto’s commendable stability can be attributed to low volatility, decoupling from the stock market which means limited reaction to economic factors like Thursday’s Consumer Price Index (CPI).\n\nadvertisement\n\nBitcoin Price Prediction: Stable But Ready To Move\n\nBitcoin price is trading at $29,404 after testing and rebounding from support at $29,000. After successfully dealing with resistance at the 50-day Exponential Moving Average (EMA), the path with the least resistance seems to be to the upside, bringing the psychological seller congestion at $30,000 within reach.\n\nDespite the flat movement of the Moving Average Convergence Divergence (MACD), a buy signal is highly likely. Traders seeking new exposure to long positions in BTC should be looking out for the MACD line in blue crossing above the signal line in red.\n\nA bullish rectangle, as observed on the chart implies that Bitcoin price is in the process of breaking out to higher levels.\n\nThe bullish rectangle pattern signifies a strong uptrend that pauses before resuming its upward movement. It forms when the price moves sideways between two parallel horizontal lines, creating a box-like shape.\n\nTraders can capitalize on this pattern by buying when the price breaks above the upper line, indicating a continuation of the bullish trend.\n\nNote that, traders use the height of the rectangle to estimate the target price after the breakout. In this case, buy when Bitcoin has broken above $resistance at $31,450 and consider cashing out at $33,911.\n\nAhead of the rectangle breakout, investors may ride the wave to $31,430 by buying BTC as it recovers above the 50-day EMA (red) at $29,346.\n\nIf range support at $29,000 weakens, the MACD might confirm a sell signal instead, thus forcing Bitcoin to abandon the breakout above $30,000.\n\nMiner Accumulation To Precedes Bitcoin Price Rally\n\nDiscussions around major institutional investors like Blackrock entering the crypto market have continued to heat, especially with the Securities and Exchange Commission (SEC) deliberating approving the first exchange-traded product (SEC).\n\nAccording to on-chain insights from CryptoQuant “… if ‘Token Transferred’ and ‘Velocity speed’ increase along with the price increase, this is likely a precursor to an upward rally.”\n\nMeanwhile, miner activity implies that Bitcoin is consolidating ahead of the next bullish breakout. Past bullish cycles have shown that miners tend to accumulate ahead of the halving.\n\n“Miners were sellers starting in Aug 2022 and finally starting on May 27 this year they started accumulating. Technically speaking, it’s in their best interest economically speaking to start accumulating before the halving which is scheduled for April 2024.”\n\nHowever, there was a noticeable increase in BTC inflows into spot exchanges likely to have dampened the potential momentum from “muted outflows as price hovered in a tight range of 29k-$31k.\n\nRelated Articles"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpdGNvaW4tbmV3cy9iaXRjb2luLW1pbmVyLXJpb3QtaW5jcmVhc2UtYnRjL9IBSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpdGNvaW4tbmV3cy9iaXRjb2luLW1pbmVyLXJpb3QtaW5jcmVhc2UtYnRjL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Winds Of Change: Bitcoin Miner Riot Sees Substantial Increase In BTC Holdings - NewsBTC",
        "content": "Bitcoin mining has been up by a considerable fraction this year, as the blockchain network recorded a new all-time high in hash rate in the second quarter of the year. Mining revenue is also up, as the bitcoin Bitcoin recorded a spike in transaction volume.\n\nAs a result, Riot Blockchain, one of the largest publicly traded Bitcoin mining companies in the US, has recorded an increase in operations in the second quarter. According to its 2023 second-quarter financial results, the mining company recorded a new all-time record hash while ramping up its Bitcoin mining operations.\n\nSolid Second Quarter 2023\n\nAccording to its financial report, Riot has seriously ramped up its Bitcoin mining operations. As a result, the mining company produced 1,775 BTC during the second quarter of 2023, a 27% increase compared to the 1,395 BTC it produced during that same period in 2022.\n\nIn May 2023 alone, the company produced 676 BTC at an average of 21.8 BTC per day. The average cost to mine each bitcoin was $8,389, beating Q2 2022’s average of $11,316.\n\nRiot also witnessed an increase in mining revenue, as Bitcoin miners generated a remarkable total revenue of $2.4 billion. Although the price of Bitcoin during the quarter was 15% less than what it was in Q2 2022, Riot saw a total revenue of $76.7 million, as compared to $72.9 million in Q2 2022. Mining revenue ($49.7 million), engineering revenue ($19.3 million), data hosting revenue ($7.7 million), and power curtailment credits ($13.5 million) were also higher than in Q2 2022.\n\nNot only has RIOT’s revenue from bitcoin mining increased, but their actual bitcoin holdings have also grown substantially. As of June 30, Riot held 7,264 BTC with the price of each BTC at $30,477.\n\nIn total, Riot finished the quarter with $408.4 million in working capital, including $289.2 million in cash on hand and $221.4 million in Bitcoin, while also reducing its net loss to $27.7 million compared to $353.6 million in Q2 2022.\n\nBTC price remains volatile | Source: BTCUSD on Tradingview.com\n\nIncrease In Bitcoin Mining Power\n\nRiot Blockchain also drastically increased its hash rate throughout the quarter, reaching an all-time record hash rate capacity of 10.7 EH/s. However, the company is also looking to enhance its computational power.\n\nDuring the quarter, the company signed a long-term purchase agreement with MicroBT to acquire 33,280 next-generation miners. With an expanded mining fleet and facility, Riot believes it can see its hash rate grow to 20.1 EH/s by the second quarter of 2024.\n\nBitcoin mining is an energy-intensive process. However, Riot’s power strategy contributes to the stability of the energy grid in Texas at times of high demand by selling extra power back to the grid. At the time of writing Riot’s stock is up by 1.53% in a daily timeframe and 158.14% in the past six months.\n\nFeatured image from PYMNTS, chart from Tradingview.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmNtY21hcmtldHMuY29tL2VuLWNhL25ld3MtYW5kLWFuYWx5c2lzL2Jlc3QtY3J5cHRvLW1pbmluZy1zdG9ja3MtYml0Y29pbtIBWGh0dHBzOi8vd3d3LmNtY21hcmtldHMuY29tL2VuLWNhL25ld3MtYW5kLWFuYWx5c2lzL2Jlc3QtY3J5cHRvLW1pbmluZy1zdG9ja3MtYml0Y29pbl9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Best Crypto Mining Stocks & Why They Are Outperforming Bitcoin - CMC Markets",
        "content": "When the major centralised exchange FTX collapsed in late 2022, cryptocurrencies like Bitcoin and Ether saw massive declines in their value as panic selling took over and traders rushed for the exits by dumping their holdings. Since then, the crypto scene has managed to mount a triumphant comeback with Bitcoin and Ether boasting year-to-date (YTD) price appreciation of 77% and 54% respectively. This has caught the attention of many speculators who are looking for assets that can beat benchmark indices like the S&P 500, which has returned about 16% YTD.\n\nOne such asset that has outperformed both Bitcoin and Ether are crypto mining related stocks. These companies effectively provide exposure to the cryptocurrency markets without investors and traders needing to purchase, store or manage their own cryptocurrencies. Keen to find out more about trading and investing in the best crypto mining stocks on the market? Read on as we cover all you need to know about the top crypto mining companies and their performance compared to the broader share market.\n\nWhat Are Crypto Mining Stocks?\n\nCrypto mining stocks represent shares in companies that are involved in the process of crypto mining. Essentially, these companies use powerful computers to solve complex mathematical problems, a process that results in the creation, or \"mining,\" of cryptocurrencies like Bitcoin or Ether. These companies also validate transactions made on the decentralised ledger blockchain, where all cryptocurrency transactions are recorded. Crypto miners earn cryptocurrency as a reward for their efforts in authenticating transactions (AKA mining).\n\nSimply put, traders may consider trading crypto mining stocks like leveraged Bitcoin stocks since they tend to follow the price movements of Bitcoin and deliver amplified returns, whether to the upside or downside. This is evident in how their stock price movements outpace the volatility of the underlying crypto assets being mined. As a company's mining operations become more successful and profitable, so does its stock's value. Thus, investors and traders tap into the potential profits generated from mining operations without engaging in mining or managing their crypto holdings themselves by investing in crypto mining stocks.\n\nFactors Affecting the Price & Value of the Best Crypto Mining Stocks\n\nThe Price of the Mined Cryptocurrency\n\nFirstly, we have the price of the underlying cryptocurrency that the company mines. For example, if a company primarily mines Bitcoin and the cost of Bitcoin increases, the stock price of that company may rise as well. This is because the value of the mined Bitcoin directly impacts the company's revenue and profitability as most crypto mining companies sell off their BTC holdings to continue keeping their operations afloat. Conversely, the opposite is true where the Bitcoin mining stock's value is likely to fall if Bitcoin declines in value.\n\nOperational Efficiency of the Crypto Mining Company\n\nSecondly, the operational efficiency of the mining company plays a crucial role. From ensuring that miners are running at optimal speeds to keeping operating temperatures cool, crypto mining companies have a tight ship to run to get the various components of crypto mining to run optimally. Companies that can mine cryptocurrencies more efficiently and use less energy will have lower operational costs, leading to higher profits. Additionally, companies with access to cheap electricity have a distinct advantage, as electricity is a significant cost factor in crypto mining. According to VisualCapitalist's list of Bitcoin mining costs, Kuwait, Algeria and Sudan top the list regarding Bitcoin mining efficiency.\n\nCrypto Mining Regulations\n\nThirdly, the regulatory landscape surrounding cryptocurrency mining significantly impacts the value and trajectory of crypto mining stocks. Because cryptocurrencies operate in a largely decentralised and unregulated space, they are subject to a high degree of regulatory scrutiny and potential legislative changes. Countries like China have enacted strict regulations on crypto mining, leading to a massive migration of mining operations to countries with more favourable laws. Ultimately, investors and traders of crypto mining stocks must stay abreast of these regulatory changes as they can significantly impact the profitability and viability of crypto mining companies, thereby affecting the valuation of their stocks.\n\nBest Crypto Mining Stocks to Watch\n\nWhile there are plenty of crypto mining stocks to choose from, we're focusing on these top crypto mining stocks with market capitalisations of more than US$500 million. By our definition, we are determining these crypto mining stocks as the best because of their background and growth potential. From the massive scale of Riot Platforms to the renewable energy mining of CleanSpark, here are the top crypto mining companies to add to your watchlist, ranked according to their market capitalisation as of 11th August 2023.\n\nRiot Platforms (NASDAQ: RIOT)\n\nMarket Capitalisation: US$2.82B\n\nRiot Platforms tops our list of best crypto mining stocks because of its huge market capitalisation. With a business model primarily focused on Bitcoin mining, this US-based company operates extensive, state-of-the-art mining facilities that utilise renewable energy sources, aligning with global demands for sustainable practices. Riot's strategic operations have allowed it to gain significant traction in the crypto mining space, demonstrating consistent increases in mined Bitcoin despite market fluctuations. Their success can be attributed to their continual expansion and upgrades of mining hardware, significantly boosting mining efficiency and overall output. Such expansion examples include its Whinstone and Rockdale mining facilities. Recently, Riot employed a power utilisation strategy that took advantage of the massive heat wave in its operating state of Texas. By selling power at market-driven spot prices, Riot was able to reduce its operational costs and improve its balance sheet for its Q2 2023 earnings. This gave Riot an edge against other crypto miners and more cash flow to optimise and refine their mining operations amid the ever-volatile crypto market.\n\nMarathon Digital Holdings (NASDAQ: MARA)\n\nMarket Capitalisation: US$2.59B\n\nMarathon Digital Holdings is another critical player in the crypto mining industry, boasting a robust business model heavily geared towards Bitcoin mining. With its operations in the United States, Marathon Digital Holdings leverages advanced and efficient mining methods to optimise its Bitcoin production. Rather than just focus on energy optimisation and usage of the most affordable energy possible, Marathon takes on an ESG approach by considering renewable energy. This gives their Bitcoin and crypto mining activities a green edge compared to other crypto mining companies. This, combined with its high hash rates for crypto mining, makes Marathon an attractive investment opportunity for those seeking exposure to the crypto mining industry through such stocks. With its latest US$400M Abu Dhabi mining facility announcement, Marathon shows that it's committed to scaling up its mining operations. Hence, it comes out on top compared to the other best crypto mining companies.\n\nCipher Mining Inc (NASDAQ: CIFR)\n\nMarket Capitalisation: US$0.92B\n\nUnlike the two best crypto mining stocks mentioned on this list, Cipher Mining differentiates itself from the competition because of its dedication to making its mining operations profitable. This is thanks to Cipher's Power Purchase Agreement (PPA) with Luminant, which essentially lets Cipher sell energy back to the grid when the current price of electricity is higher than the value of Bitcoins mined. Overall, this gives Cipher a significant cost advantage over its crypto mining competitors as they deliver an overall cost of about US$0.027 per kWh, an average lower than crypto miners like Riot and Hut 8. Cost benefits aside, Cipher recently announced a purchase agreement with Canaan of 11,000 mining machines. This represents an 18% increase in mining machines, estimated to increase mining speeds by about 36% by the end of 2023. With ambitious growth targets and optimised cost cutting, Cipher Mining certainly shows promise regarding growing in the crypto mining market.\n\nCleanSpark (NASDAQ: CLSK)\n\nMarket Capitalisation: US$0.73B\n\nCleanSpark is a crypto mining company that's focused on energy-efficient mining solutions. The company operates advanced microgrids and custom electrical equipment to mine Bitcoin, thus significantly reducing its energy costs and enhancing operational efficiency. Based in the United States, CleanSpark strongly emphasises sustainable practices, using an energy mix that includes renewable sources. Implementing CleanSpark's proprietary mPulse software in its microgrids allows the company to optimise its energy use, thus further reducing costs and minimising its environmental footprint. This is achieved by the software's ability to learn energy usage patterns and dynamically adapt efficient modes of operation to ensure customers optimise their power usage and costs. To assure existing investors of its growth ambitions, CleanSpark announced that it has fully secured funding for its expansion, improving existing mining hash rates by more than 66%. By considering CleanSpark's stock as one of the best crypto mining stocks today, investors and traders are essentially betting on the company's innovative mining methods, sustainability commitments and capacity to navigate the volatile crypto market over time.\n\nHut 8 Mining Corp (NASDAQ: HUT)\n\nMarket Capitalisation: US$0.66B\n\nTo wrap up this list of the best crypto mining stocks, we have to talk about Hut 8 Mining Corp, a Canadian crypto mining company and its controversial Bitcoin accumulation strategy. By subscribing to the BTC Hold On for Dear Life (HODL) mindset, Hut 8 owns more than 9,000 BTC as of March 2023. While crypto bulls and Bitcoin maximalists might applaud this behaviour, holding such large amounts of crypto can prove double-edged for HUT's share price as it buckles under financial duress. As Hut 8 struggles to stay in the black amid headwinds like fluctuating power costs and crypto market volatility, Hut 8 has been forced to dilute its shareholders to stay afloat. This saw management issue more than 70% of new shares in 2021, which puts a dampener on existing shareholders expecting exponential upside to HUT prices as Bitcoin prices appreciate. To ease growth concerns, Hut 8 recently revealed a transaction support agreement to potentially acquire assets of Validus Power Corp, which owns a mining facility in Ontario, Canada.\n\nFuture Outlook of Crypto Mining Stocks\n\nLooking ahead, the best crypto mining stocks offer a unique investment opportunity with significant growth potential. As cryptocurrencies gain wider acceptance, the demand for mining operations is projected to rise, potentially leading to a surge in the value of these stocks. This upward trajectory is further supported by the continual technological advancements in this space, improving the efficiency of mining operations and thus, the profitability of crypto mining companies.\n\nHowever, it's important to note that investing in crypto mining stocks also carries substantial risk. The cryptocurrency market is known for its volatility, with prices fluctuating wildly in short periods. This volatility is transferred to crypto mining stocks, making them a high-risk, high-reward investment. Also, regulatory uncertainties pose a major challenge, as prominent regulators like the SEC can significantly impact mining companies' operations. Therefore, while the future of crypto mining stocks holds promise, prospective investors must consider these risk factors carefully before diving in.\n\nThe Bottom Line\n\nWe hope this guide has helped you better understand whether a particular crypto mining stock suits your portfolio. The best crypto mining stocks ultimately offer investors a leveraged bet on the price of Bitcoin. However, crypto mining involves a significant amount of financial and regulatory risk. High up-front costs that crypto mining companies have to pay for specialised equipment expose them to operational inefficiencies and massive energy consumption and carbon footprint draw significant negative attention. Additionally, the inherently volatile nature of crypto is often magnified in crypto mining stocks. All in all, investors must consider the potential rewards of investing in crypto mining stocks and their associated risks.\n\nKeen on learning more about companies like Riot and Coinbase? Make sure to read our guide to blockchain stocks. So what else are you waiting for? Sign up and begin your trading journey with us today.\n\n\n\nDisclaimer: CMC Markets is an order execution-only service. The material (whether or not it states any opinions) is for general information purposes only, and does not take into account your personal circumstances or objectives. Nothing in this material is (or should be considered to be) financial, investment or other advice on which reliance should be placed. No opinion given in the material constitutes a recommendation by CMC Markets or the author that any particular investment, security, transaction or investment strategy is suitable for any specific person. The material has not been prepared in accordance with legal requirements designed to promote the independence of investment research. Although we are not specifically prevented from dealing before providing this material, we do not seek to take advantage of the material prior to its dissemination."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jaXR5YW0uY29tL2JpdGNvaW4tdm9sYXRpbGl0eS1pbmRleC1kcm9wcy10by1oaXN0b3JpYy1sb3ctYXMtcGF5cGFsLWxhdW5jaGVzLXN0YWJsZWNvaW4td2hpbGUtcmV2b2x1dC1kcm9wcy1jcnlwdG8taW4tdXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 14 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin volatility index drops to historic low as PayPal launches stablecoin while Revolut drops crypto in US - CityAM - City A.M.",
        "content": "Bitcoin volatility index drops to historic low as PayPal launches stablecoin while Revolut drops crypto in US\n\nData from CryptoCompare shows that the price of the flagship cryptocurrency Bitcoin (BTC) moved essentially sideways throughout the week. After starting at $29,000 and moving to test the $30,000 mark, BTC kept on trading around $29,500, before a short dip to $29,400.\n\nEthereum’s Ether, the second-largest digital currency by market capitalisation, moved similarly to BTC throughout the week, starting it at $1,830 and moving up to $1,880 before enduring a slight correction, to now trade at $1,845.\n\nBitcoin’s stability has seen the Bitcoin Volatility Index (BVIN), which measures Bitcoin’s implied volatility via Deribit’s options contracts, drop to an all-time low.\n\nHeadlines in the cryptocurrency space this week partly focused on global payments titan PayPal, which revealed plans to launch its own stablecoin pegged to the US dollar, called PayPal USD (PYUSD).\n\nThe stablecoin is set to be based on the Ethereum network and be backed by short-term US dollar deposits, Treasuries, and other cash equivalents. The offering is meant to facilitate transactions between PayPal and other compatible wallets.\n\nToday, we’re unveiling a new stablecoin, PayPal USD (PYUSD). It’s designed for payments and is backed by highly liquid and secure assets. Starting today and rolling out in the next few weeks, you’ll be able to buy, sell, hold and transfer PYUSD. Learn more https://t.co/53RRBhmNHx pic.twitter.com/53ur2KmjU7 — PayPal (@PayPal) August 7, 2023\n\nCircle, the firm that manages the USDC stablecoin, was revealed to rely on a $1 billion in reserves to handle its growing competition, which now includes PayPal itself. USDC’s circulating supply dropped from $45 billion to $26 billion this year, while leading stablecoin issuer Tether saw its USDT grow.\n\nThe stablecoin sector has seen dwindling investor confidence following a market downturn that was further exacerbated by industry controversies. The total market capitalisation of the stablecoin sector has now been dropping for 16 consecutive months, to hit its lowest level since August 2021, according to CCData’s latest Stablecoins & CBDCs report.\n\nInvestor confidence in the stablecoin sector has been eroding amid a market slump that was further exacerbated by controversies in the industry. The stablecoin market cap has been shrinking for over a year, reaching its lowest point since August 2021, CCData’s latest Stablecoins & CBDCs report reveals.\n\nWhile the private sector is moving forward in the stablecoin ecosystem, the Bank of Russia has revealed it will start testing its central bank digital currency (CBDC) on August 15. The tests will include 13 prominent banks and a select group of their clients in an initial phase.\n\nRevolut to shut down crypto services in US\n\nThe regulatory uncertainty in the United States has pushed digital banking platform Revolut to announce it’s set to shut down its cryptocurrency services for users in the country, in a move that comes after it delisted several assets.\n\nRevolut, along with its US banking partner, will begin the process of suspending access to cryptocurrencies via its platform on September 2. Full termination of crypto services will follow a month later on October 3, according to a spokesperson for the digital bank.\n\nSimilarly, Luxembourg-based cryptocurrency exchange Bitstamp announced this week it’s delisting seven cryptocurrencies for investors in the United States. The tokens being delisted were mentioned in the SEC’s lawsuits filed against Coinbase and Binance as unregistered securities.\n\nMeanwhile, the US Securities and Exchange Commission (SEC) has revealed it wants to file an “interlocutory appeal” against a judge’s recent ruling on Ripple’s programmatic sales of the XRP token.\n\nEarlier this year, a federal judge ruled XRP is not necessarily a security in a blow to the SEC, as Judge Analise Torres only noted Ripple’s direct XRP sales to institutional investors violated securities law. As a result, several exchanges including Coinbase and Kraken relisted XRP\n\nOver the week, cryptocurrency exchange Bittrex agreed to settle with the SEC over allegations it offered US investors access to unregistered securities. The settlement will see the exchange pay a $24 million fine in a move that follows its filing for bankruptcy in May.\n\nEarlier this year, the SEC sued Bittrex, alleging the exchange had effectively operated as a securities exchange, broker, and clearinghouse, without obtaining the necessary registrations from the regulator.\n\nMakerDAO introduces spark protocol for increased DAI yields\n\nOn-chain, leading decentralized stablecoin issuer MakeRDAO launched its Spark Protocol, an innovative lending platform meant to boost MakerDAO’s DAI stablecoin. The protocol’s launch came with a boost to DAI’s yield, from 3% to 8% a year.\n\nNotably, the protocol is blocking access to users accessing it using a virtual private network (VPN) as it attempts to geo-block users from specific countries, including the United States, from accessing it.\n\nMeanwhile, Coinbase’s layer-2 network Base has kept on growing, and this week integrated Chainlink price feeds, in a bid to help decentralized applications, especially those related to financial services, like lending and borrowing, work smoothly and connect with real-world data like asset prices.\n\nFrancisco Memoria is a content creator at CryptoCompare who’s in love with technology and focuses on helping people see the value digital currencies have. His work has been published in numerous reputable industry publications. Francisco holds various cryptocurrencies.\n\nFeatured image via Unsplash."
    }
]