[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTAxL2JpdGNvaW4tcmFsbHktcHVzaGVzLXRva2VuLXRvLWhpZ2hlc3QtbGV2ZWwtb2YtMjAyM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Price Rises to 2023 High - Bloomberg",
        "content": "Bitcoin soared to its highest price so far this year, as investors took on more risk ahead of comments from Federal Reserve Chair Jerome Powell which could give guidance on whether the US is closer to lowering interest rates.\n\nThe world’s largest cryptocurrency rallied as much as 2.87% to a high of $38,834 on Friday. Prices of other digital assets tracked by Bloomberg, such as Ether and Solana, were also up more than 2%. Bitcoin’s jump constitutes the token’s highest value since May 5 last year, just before the collapse of the TerraUSD stablecoin ecosystem rocked the sector and began a steady decline in asset prices."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMTIvMDEvYml0Y29pbi1oaXRzLWhpZ2hlc3QtbGV2ZWwtc2luY2UtbWF5LTIwMjItdG8ta2ljay1vZmYtZGVjZW1iZXItY25iYy1jcnlwdG8td29ybGQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin hits highest level since May 2022 to kick off December - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nBitcoin hits highest level since May 2022 to kick off December: CNBC Crypto World\n\nCNBC Crypto World features the latest news and daily trading updates from the digital currency markets and provides viewers with a look at what's ahead with high-profile interviews, explainers, and unique stories from the ever-changing crypto industry. On today's show, Grayscale Chief Legal Officer Craig Salm discusses what he believes will happen with the asset manager's plans to convert its bitcoin and ethereum trusts into ETFs."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9jYW5hZGEtc3BvdC1iaXRjb2luLWV0Zi1zdXJnZS1wb3J0ZW5kcy1zaW1pbGFyLWJvb20taW4tdXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin ETF's 60% surge in Canada signals what's coming in the US - DLNews",
        "content": "Canada dominates the global spot Bitcoin ETF market and might hint at how big US products will be.\n\nJPMorgan analysts said slow growth of Canadian ETFs shows how overblown the US hype is.\n\nAnalyst Eric Balchunas disagrees, and explains why \"it looks pretty good\" for the US.\n\nCanada stamped itself as a pioneer when it approved the world’s first spot Bitcoin exchange traded fund — the Purpose Bitcoin ETF — back in February 2021.\n\nThere have been hiccups since, but the funds have seen a resurgence in 2023.\n\nThe Canadian ETF explosion can be used as a proxy for what will follow in the “massive” US market, Eric Balchunas, an ETF analyst at Bloomberg Intelligence, told DL News.\n\nAssets under management at the Purpose Bitcoin ETF, the world’s largest spot Bitcoin exchange traded fund, soared 60% to over 947 million Canadian dollars this year, according to Cboe Global Markets’ Canadian arm. In US dollars, that’s almost $700 million.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nBalchunas noted that the US ETF market is 32 times that of Canada’s.\n\n“Based on Canada, if you extrapolate, it looks pretty good,” he said.\n\nCanada’s spot Bitcoin ETF market share sits at 48% of all global spot crypto ETFs, at around $2 billion in assets, according to CoinGecko.\n\nThe global market is worth about $4.2 billion. South of the border, Balchunas has been tracking fund giants BlackRock, Fidelity, Ark Invest and the handful of other firms awaiting spot Bitcoin ETF approval — expected in January.\n\nJoin the community to get our latest stories and updates\n\nOptimism surrounding a Securities and Exchange Commission nod has helped drive Bitcoin 126% higher this year.\n\nETF performance\n\nCanadian spot ETFs were initially predicted to be a game-changer, but when the Purpose Bitcoin ETF launched in 2021, its performance was underwhelming.\n\nExpected to rise to over $1 billion in assets under management within a week, inflows to Purpose in early weeks went slower than anticipated.\n\nBy April 2022, the ETF had amassed a record $1.7 billion in assets, but that figure was quickly washed away by the Terra collapse in May.\n\nLike many crypto markets, ETFs wallowed through 2022 and only started to recover this January.\n\nIn June, JPMorgan said there was “little interest” in Canadian ETFs, using it as an example to why the US ETF hype might be overblown.\n\nOthers reject that analysis — including Balchunas and Canadian regulators.\n\nThe Ontario Securities Commission wrote in a 2023 report that “much of the decline in AUM is due to the declining value of cryptocurrencies, rather than significant fund outflows.”\n\nBalchunas noted that crypto ETF flows accounted for 5% of all flows in Canada this year. The increase in assets under management in the market adds up to 23% organic growth, a number Balchunas said is undeniable.\n\n“The JPMorgan thing baffled me,” Balchunas said.\n\nCanada’s ETF-friendly past\n\nCanada has a history of pushing out ETFs well ahead of the US, as far back as the world’s first ETF, called the TIPs 35 Fund, which launched in 1990.\n\nThe US followed up with the SPY ETF in 1993. Balchunas cites Canada’s first cannabis ETF, launched in 2017, as another example where Canada beat the US to the ETF punch — it took the US nearly four years to approve a similar product.\n\nBalchunas cites “conservative” regulators in the US, compared to Canada’s “more liberal” regime.\n\nStill, Balchunas says, the tendency has been for US approval to follow.\n\n“Once the first ETF in the asset class breaks through, the rest will be approved,” he said.\n\nRoad to SEC approval\n\nPerformance of Canada’s ETFs isn’t the whole story.\n\nThe road to spot ETF approval has not gone smoothly — the SEC has rejected every application to date, and on Tuesday delayed approval of Franklin Templeton’s proposed ETF.\n\nThe SEC has raised concerns that spot ETFs may be vulnerable to market manipulation and fraud. It has asked the public to express its concerns with such issues.\n\nCanada, on the other hand, approved the crypto ETFs in short order, and has arguably stricter regulatory controls — the country rolled out a series of rules in 2022, which saw several major crypto firms exit the country, including leading global exchange Binance.\n\n“The most important difference between Canada and the US right now is regulatory certainty in Canada,” Laure Fouin, partner at Canadian law firm Osler, Hoskin & Harcourt, wrote in an email to DL News.\n\nFouin pointed to explicit crypto-related guidance issued by the Canadian Securities Administrators, which included agency expectations for crypto asset funds.\n\nCrypto firms in the US have long advocated for the SEC to produce explicit guidance for crypto assets.\n\nSEC Chair Gary Gensler has insisted that existing securities regulations are sufficient.\n\nThe SEC has so far only approved Bitcoin-related funds tied to futures contracts.\n\nTyler Pearson is a Researcher at DL News. If you’ve got a tip on Binance or another story, please reach out at ty@dlnews.com.\n\nA previous version of this article incorrectly stated that Osler, Hoskin & Harcourt is based in Calgary."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiqgFodHRwczovL3d3dy5zcGdsb2JhbC5jb20vY29tbW9kaXR5aW5zaWdodHMvZW4vbWFya2V0LWluc2lnaHRzL2xhdGVzdC1uZXdzL2VsZWN0cmljLXBvd2VyLzEyMDEyMy1iaXRjb2luLW1pbmluZy1wcm9maXRhYmlsaXR5LXBsdW5nZXMtYXMtcG93ZXItcHJpY2VzLXJpc2Utb24taGlnaGVyLWRlbWFuZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin mining profitability plunges as power prices rise on higher demand - S&P Global",
        "content": "End of November power demand highest on the year across Europe\n\nBitcoin mining profitability rates plunged across Europe as an end-of-November cold snap pushed day-ahead power prices higher due to rising demand, S&P Global Commodity Insights data showed.\n\nNot registered? Receive daily email alerts, subscriber notes & personalize your experience. Register Now\n\nBitcoin Renewable Quarq Spreads in Germany and France fell to negative Eur90/MWh as French power demand hit 70 GW. Meanwhile in Germany coal and lignite output ramped up to 27 GW to meet the increase in demand, the highest since the last winter.\n\nGermany/Belgium reverted to imports from France during evening peaks, that in turn turned to rare imports from Italy and Switzerland in addition to steady flows from Spain.\n\nBaseload day-ahead power price in Germany and France both averaged around Eur169/MWh Nov. 30. Meanwhile, hourly power prices across the Central Western Europe region spiked to Eur250/MWh during evening peak hours on Nov. 29, the highest since last winter, exchange data showed.\n\nSpanish day-ahead power prices were more resilient over the last week, with prices peaking at Eur107.9/MWh Nov. 27, and settling range bound within Eur80/MWh and Eur100/MWh between Nov. 29 – Dec. 1.\n\nBitcoin Renewable Quarq Spreads have been in-the-money in Norway NO4 and Sweden SE1 from Nov. 22, while profitability rates in Finland have been volatile. In Finland, a bidding error by a market participant on Nov. 23 saw Finland power prices settle at negative Eur500/MWh, which resulted in a Eur315.57/MWh profitability for bitcoin miners, Bitcoin Renewable Quarq Spreads index data showed.\n\nFinland's 1.6-GW Olkiluoto 3 (OL3) nuclear power plant was scheduled to resume power production late Nov. 30 after the new 1.6-GW reactor suffered a second outage this fortnight on Nov. 29.\n\nA shift to colder weather could maintain power prices high in the Nordic countries, which will result in lower bitcoin mining profitability.\n\nPlatts assessed the Bitcoin Energy Consumption Index at 384.04 MWh Nov. 30, down from a peak of 399.48 on Nov. 26.\n\nPlatts is part of S&P Global Commodity Insights. Platts Bitcoin Renewable Quarq Spreads are assessed across 42 locations in Europe and the US."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTIvMDIvZnJhbmtsaW4tdGVtcGxldG9uLWplbm55LWpvaG5zb24tYml0Y29pbi1ldGZzLWNyeXB0by1pbnZlc3RpbmctYmxvY2tjaGFpbi10ZWNobm9sb2d5L9IBf2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTIvMDIvZnJhbmtsaW4tdGVtcGxldG9uLWplbm55LWpvaG5zb24tYml0Y29pbi1ldGZzLWNyeXB0by1pbnZlc3RpbmctYmxvY2tjaGFpbi10ZWNobm9sb2d5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Dec 2023 08:00:00 GMT",
        "title": "Franklin Templeton’s Jenny Johnson on Bitcoin ETFs, investing in crypto, and how her firm is harnessing the blockchain - Fortune",
        "content": "At the Fortune Global Forum Nov. 27–29 in Abu Dhabi, I had a chance to talk with Jenny Johnson, the president and CEO of Franklin Templeton, which has grown from a small brokerage founded in 1947 to a global giant that now manages over $1.3 trillion.\n\nAmong the top financial firms, Franklin Templeton has been at the forefront of exploring blockchain technology. In 2021, it launched the first U.S.-registered mutual fund to use a public blockchain to process and record transactions, as well as crypto-focused separately managed accounts, or SMAs. And in September, the firm filed an application for a Bitcoin ETF.\n\nIn our conversation, Johnson discusses a variety of topics, including the role blockchain will play in her firm’s long-term success and how it will help democratize markets.\n\nThis interview has been edited for length and clarity.\n\nFranklin Templeton has been actively exploring blockchain technology, recently filing an application for its Franklin Bitcoin ETF. Could you elaborate a bit on how blockchain fits into your long-term strategy?\n\nI think it’s important that we differentiate Bitcoin and blockchain. I think that there’s a demand for Bitcoin. It has its own use case, and that’s why you’re seeing these ETFs. What gets me more excited, as I think about the future, you look at blockchain technology, and it’s going to enable access to things like private markets. It’s going to enable the democratization of private markets. Well, why does it do that? This is because the technology takes out the frictional costs associated with processing transactions. And if you can reduce the friction in transactions, then you can more easily securitize or fractionalize ownership of things that would have been operationally too difficult to consider. Instead, you’re able to create and transfer ownership of these hard-to-process assets much easier.\n\nIt’s going to unlock nontraditional, non-correlated types of asset classes that are going to be interesting for our clients. We also think that it’s going to make more efficient the types of products that you have today. ETFs trade all day, but only price twice a day. So, imagine that you build a pooled vehicle on the blockchain. When you transact, you can have the smart contract tell you exactly what the underlying value of those securities is. It’s just a much more efficient way to be able to operate.\n\nAnd when you have atomic settlement or you have immediate settlement, it removes the potential for fraud, it takes out latency in the system. It’s going to be all about efficiency. At Franklin Templeton, we developed a tokenized money-market fund. We built a shareholder recordkeeping system on that. We are a node validator, we actually advise on different portfolios. We have passive portfolios and active portfolios. While these are all in their early stages, they demonstrate that we’re big believers in this space.\n\nWhen do you think the first Bitcoin spot ETF will be approved?\n\nI don’t know. That’s in the hands of the regulators, as they’re trying to figure out the best approach. Their job is to protect the consumers, and I think they’ll do it in time, as appropriate.\n\nHave you seen significant interest from clients for a Bitcoin spot ETF? Do you expect an influx of funds after it is approved?\n\nI think there’s obviously a demand for Bitcoin, and I believe a spot ETF is a better way to access Bitcoin. As long as they trade, the bid-ask is narrow, it should be a better way to do it. It’s a much more convenient way for anybody interested in investing in Bitcoin.\n\nBut I think Bitcoin has some challenges. It’s hard to anchor to any kind of investment thesis. It tends to be a risk-on/risk-off type of asset. You just want to make sure clients are responsible in how they allocate Bitcoin.\n\nHow did you first discover blockchain and crypto?\n\nI ran the technology division years ago at Franklin Templeton. So I’m always staying focused on new technological trends. This was one that I thought initially would take longer to mature, but I’ve been impressed to see the various platforms and how quickly they’ve matured, and the innovation that’s happened in various companies that are being created on these layer-1s. But it was just because I spent about a third of my time on disruptive technologies, and it was one, just like AI, that I paid attention to.\n\nDo you personally invest in cryptocurrency?\n\nI do have some investments. It’s small for my overall portfolio, but I definitely have investments there.\n\nCan you share some of your picks?\n\nWell, I haven’t had more picks. They’re all standard: Ethereum, a little Bitcoin, SushiSwap, Uniswap. I have a couple of different things like that.\n\nLooking ahead, do you plan to launch other blockchain- or crypto-related products? Some other wealth managers have, for example, crypto indexes or retirement plans or futures ETFs.\n\nETFs don’t tend to be big in the retirement channel, but they may. Retirement plans have fiduciaries that make the decision about what investments are on there. So that would be the choice of the fiduciary. Our job is to make the products available.\n\nYou’ve had big success with your U.S. money-market fund, which is tokenized and has inflows of over $ 270 million. Do you plan to tokenize any other funds?\n\nAs I mentioned earlier, I think that technology is a really great opportunity. And as it matures, there’ll be more investment opportunities. I always say, at Franklin Templeton, our expertise is in making active, risk-adjusted investment decisions, and we deliver them in whatever vehicle our clients would like us to deliver them. Blockchain creates one type of vehicle with tokenization, and so, yes, we do see it as a channel to ultimately be able to deliver our expertise.\n\nFranklin Templeton ventured into the world of NFTs by issuing some to attendees of your first Innovation Forum last year. What use cases do you see for NFTs, and how do you feel about them personally?\n\nLook, I think as in anything, there’s mature investments that make a lot of sense. And then there’s a lot that don’t make any sense. I tend to make investments in things that I think are anchored in having financial returns, because I think that you have better chances of success there. There are some things that are like art in an NFT, where if two people love it, they will find a market price for it. And so, there’s going to be opportunities in that space. Not all will be successful, not all will be good, but there will be some that are successful."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tcHJpY2Utbm92ZW1iZXItZGVjZW1iZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin price went up in November — will it go up in December? - Blockworks",
        "content": "Bitcoin is again inching closer to a potential price breakout, even as it hovers at its highest point in 18 months.\n\nMarkets priced bitcoin (BTC) above $38,600 on Friday morning — up 9% over the past month and more than double since this time last year.\n\nNumber-two crypto ether (ETH) is meanwhile playing catch-up. It’s also at its highest point since mid-last year, but trails bitcoin’s returns by nearly half.\n\nThe ETH/BTC ratio (the bitcoin cost of ether) has fallen by one-fifth over the past six months. It’s showing signs of closing the gap, however, having regained almost 4.5% in November.\n\nBitcoin bulls may explain the crypto’s strength with hype around spot bitcoin ETFs — like the one BlackRock wants to launch — which could be approved any day now.\n\nThose ETFs will be forced to buy BTC to meet investor demand, representing perhaps billions in upward pressure. They might even reason that the DOJ’s indictment of Binance and CEO Changpeng Zhao gives a certain clarity to the crypto market that can only be good for prices.\n\nCrypto investors could even feel a little floaty due to arrests of hombres like FTX fraudster Sam Bankman-Fried, Terra ringleader Do Kwon and Celsius rabble-rouser Alex Mashinsky.\n\nSo, the tide went out, took the bad actors with it and now billions in fresh ETF money might wash ashore, bringing the bull market back along with it, some might say.\n\nThe ETH/BTC ratio has even underperformed BNB over the past year\n\nBears would say it’s unclear whether ETFs would actually move the needle, considering the relatively small interest in the three spot funds already available to North American investors via Canadian markets.\n\nA fresh wave of spot ETFs could even be bad for bitcoin’s price, especially if Grayscale Bitcoin Trust (GBTC) loses ground to Wall Street operators like BlackRock and Fidelity.\n\nJPMorgan analyst Nikolaos Panigirtzoglou reckons up to $2.7 billion might flow out of GBTC and potentially be dumped on the market.\n\nStill, by some definitions, the bear market is squarely over. That doesn’t explicitly mean the start of a new bull market.\n\nAlthough momentum does count for something, and if Bitcoin went up in November, could it do the same in December?\n\nIt turns out Bitcoin’s price direction in December has matched November 10 times in its 13 years of existence, with only 2011, 2013, and 2014 not aligning — a 77% strike rate, per TradingView data.\n\nThat’s more common than with months overall: 94 of the 170 months on record, or 56%, have aligned with the previous month’s candle.\n\nAll this is probably statistically insignificant, on par with roulette math, given the small sample size.\n\nBut considering the crypto winter we’ve had, markets will take what they can get.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMDEvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbi1oaXRzLTM4OGstZm9yLWZpcnN0LXRpbWUtaW4tb3Zlci1hLXllYXIv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMi8wMS9maXJzdC1tb3Zlci1hbWVyaWNhcy1iaXRjb2luLWhpdHMtMzg4ay1mb3ItZmlyc3QtdGltZS1pbi1vdmVyLWEteWVhci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Hits $38.8K for First Time in Over a Year - CoinDesk",
        "content": "The Brazilian Senate approved new income-tax regulations that could mean citizens will face paying up to 15% on earnings from cryptocurrencies held on international exchanges, Yahoo Finance reported Thursday. The regulation, if sanctioned by President Luiz Inacio Lula da Silva, could be effective as of Jan. 1. The bill has been approved by the Chamber of Deputies. Those affected will be Brazilians earning more than $1,200 from foreign exchanges and investment funds with a single shareholder. According to Yahoo Finance, the government set a revenue target of $4 billion for these taxes in the new year."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmVhcnRoLmNvbS9uZXdzL29uZS1iaXRjb2luLXRyYW5zYWN0aW9uLXVzZXMtYXMtbXVjaC13YXRlci1hcy1maWxsaW5nLWEtc3dpbW1pbmctcG9vbC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Dec 2023 08:00:00 GMT",
        "title": "One Bitcoin transaction uses as much water as filling a swimming pool - Earth.com",
        "content": "In a recent commentary, financial economist Alex de Vries has raised concerns about the significant amount of water consumed by cryptocurrency mining, particularly Bitcoin. This extensive water usage poses a threat to the global water supply, especially in water-scarce regions.\n\nBitcoin’s water consumption\n\nDe Vries, a PhD student at Vrije Universiteit Amsterdam, highlights the burgeoning issue of Bitcoin’s water footprint. “Many parts of the world are experiencing droughts, and fresh water is becoming an increasing scarce resource,” says de Vries (@Digiconomist). “If we continue to use this valuable resource for making useless computations, I think that reality is really painful.”\n\nHistorically, the focus on cryptocurrency’s environmental impact centered around its electricity consumption. Miners around the world actively compete to solve mathematical equations on the internet when mining Bitcoins, the most popular cryptocurrency. The winners receive a share of Bitcoin’s value.\n\n“The right answer emerges every 10 minutes, and the rest of the data, quintillions of them, are computations that serve no further purpose and are therefore immediately discarded,” de Vries says.\n\nIn the Bitcoin network, miners collectively generate about 350 quintillion guesses every second of the day, equating to 350 followed by 18 zeros. This process consumes a tremendous amount of computing power.\n\nQuantifying the impact\n\nDuring the mining process, large data centers use a significant amount of water to cool their computers. Alex de Vries, drawing on previous research data, estimates that Bitcoin mining in the U.S. consumes about 8.6 to 35.1 gigaliters (GL) of water annually from data centers.\n\nAdditionally, coal- and gas-fired power plants, which supply the electricity for these computers, also utilize water to cool down. This water, once used for cooling, evaporates and becomes unavailable for reuse. Similarly, water that evaporates from hydropower plants contributes to the overall water footprint of Bitcoin’s power requirements.\n\nDe Vries estimates that Bitcoin mining used over 1,600 gigaliters (GL) of water globally in 2021. On average, each transaction on the Bitcoin blockchain consumes 16,000 liters of water, which is about 6.2 million times more than a credit card swipe, or sufficient to fill a backyard swimming pool. De Vries predicts that Bitcoin’s water consumption will rise to 2,300 GL by 2023.\n\n“The price of Bitcoin just increased recently and reached its highest point of the year, despite the recent collapse of several cryptocurrency platforms. This will have serious consequences, because the higher the price, the higher the environmental impact,” de Vries explains.\n\nThe environmental toll is exacerbated by the fact that these resources are not utilized for productive purposes like artificial intelligence but are instead expended on “useless computations.”\n\nRegional implications\n\nCountries like Kazakhstan, a major hub for cryptocurrency mining, are already facing water shortages. In 2021, Bitcoin transactions in Kazakhstan accounted for 997.9 GL of water, adding to the country’s water crisis.\n\nIn the U.S., the annual water consumption for Bitcoin mining, from all sources combined, ranges between 93 GL to 120 GL. This is equivalent to the water usage of 300,000 American households or a city like Washington, D.C.\n\nde Vries says. “The most painful thing about cryptocurrency mining is that it uses so much computational power and so much resources, but these resources are not going into creating some kind of model, like artificial intelligence, that you can then use for something else. It’s just making useless computations.”\n\nAddressing the challenge\n\nDe Vries suggests potential solutions, such as modifying Bitcoin mining’s software to reduce power and water requirements. He also proposes incorporating renewable energy sources like wind and solar to lessen the water footprint. However, he cautions against diverting limited renewable resources to cryptocurrency mining at the expense of other essential uses.\n\n“But do you really want to spend wind and solar power for crypto? In many countries including the U.S., the amount of renewable energy is limited. Sure you can move some of these renewable energy sources to crypto, but that means something else will be powered with fossil fuels. I’m not sure how much you gain,” he says.\n\nWater, Bitcoin, and the future\n\nAs Bitcoin’s value continues to grow, so does its environmental footprint. De Vries predicts that Bitcoin’s water consumption will increase to 2,300 GL by 2023. This growing demand for water in the mining process could further exacerbate the global water crisis, especially in drought-prone areas.\n\nIn summary, the revelation of Bitcoin’s significant water footprint by Alex de Vries serves as a wake-up call to the environmental implications of cryptocurrency mining. As the world grapples with water scarcity, the need for sustainable and responsible use of resources becomes more pressing.\n\nDe Vries’s research underscores the importance of reassessing the environmental costs of emerging technologies like Bitcoin and seeking solutions that align with global sustainability goals.\n\nThe full study was published in the journal Cell Reports Sustainability.\n\n—\n\nLike what you read? Subscribe to our newsletter for engaging articles, exclusive content, and the latest updates.\n\n—\n\nCheck us out on EarthSnap, a free app brought to you by Eric Ralls and Earth.com."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMipAFodHRwczovL2xhY3Jvc3NldHJpYnVuZS5jb20vYnJhbmRhdmVzdHVkaW9zL3VudmVpbGluZy1iaXRjb2lucy1wcmljZS1kcml2ZXJzLWtleS1rbm93bGVkZ2UtZm9yLXdpc2NvbnNpbi1yZXNpZGVudHMvYXJ0aWNsZV9mMjZiMjk3MS1kZDE4LTVhNWEtOTFkMy1mZDFlMTY2NTdkNGUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Unveiling Bitcoin's price drivers: Key knowledge for Wisconsin residents - La Crosse Tribune",
        "content": "Bitcoin (BTC) is the world's most popular digital currency, and in contrast to flat currencies like the dollar, pound, yen, and euro, it isn't issued by any government. So, how is Bitcoin valued? This article will explore the price drivers behind the digital coin, such as supply and demand, regulation, cost of production, and news and competition, highlighting why these factors make Bitcoin a volatile asset for investors in Wisconsin and the United States.\n\nBitcoin price dynamics: supply and demand impact\n\nSupply and demand will be familiar to those with an economic background. However, if this term seems alien to you, this explanation will help you understand how this concept directly affects the price of Bitcoin and the cryptocurrency market. For example, supply and demand work together to determine the quantity of a specific commodity and its market price. As this price increases, the demand for economic goods declines. This means sellers will create more of the commodity or vice-versa. This dynamic holds for Bitcoin and other cryptocurrencies, just like it does for the spot price of commodities (such as oil) that use flat exchange rates, for example, USD to GBP.\n\nImpact of competitive markets and news on Bitcoin\n\nWith cryptocurrencies becoming ever-more popular worldwide, Bitcoin has seen an influx of competition to its throne as the go-to crypto, which affects its price. Altcoins like Ethereum (ETH) and meme coins like Dogecoin (DOGE) have given investors plenty of ways to diversify their cryptocurrency portfolios. For example, any improvements to an altcoin like Ethereum may see Bitcoin's price plummet. Furthermore, media attention can fuel speculation and turn up price volatility. For instance, negative press surrounding cryptocurrencies, specifically Bitcoin, can lead to panic-selling by some Bitcoin owners, ultimately driving its price down. Alternatively, the inverse is also true, and positive news surrounding Bitcoin and cryptocurrencies can move its price upwards.\n\nImpact of accessibility and liquidity on Bitcoin prices\n\nThe accessibility of Bitcoin will significantly influence its price now and in the future. For example, the more widely adopted Bitcoin becomes, the more valuable it will be. For instance, crypto-friendly governments and countries like Switzerland, the first country to offer crypto companies business accounts in 2018, will positively affect Bitcoin's price. Furthermore, liquidity is something to consider when analyzing the price drivers behind Bitcoin. This is because Bitcoin is regarded as the most liquid cryptocurrency currently available to investors; why? Because it can be easily bought and sold on exchanges and converted for cash. While liquidity is often good for price stability, it's important to remember that changes in liquidity can cause Bitcoin prices to swing.\n\nBitcoin price drivers: risks and investing insights\n\nAnother factor that can affect Bitcoin's price is risks that may affect its supply and demand. For example, due to its digital nature, Bitcoin can be prone to events such as cyber-attacks. For instance, individuals' crypto wallets or the exchanges they hold Bitcoin on may get hacked, creating instability in Bitcoin's price. Moreover, regulations surrounding cryptocurrencies and Bitcoin vary in different countries and states in the US. This means there is always a chance that laws may be passed that could nationally and internationally affect the ownership of Bitcoin and its liquidity. However, rules and regulations set by governments can lead to surges in Bitcoin prices; for instance, cryptocurrency groups are expanding in Hong Kong due to the rules and restrictions placed upon digital currencies in mainland China.\n\nFinal notes: unveiling Bitcoin's price drivers\n\nInvestors in Wisconsin and the United States must note that the cryptocurrency market is highly volatile and influenced by government regulations, liquidity, competition between digital currencies, news surrounding cryptocurrencies, and supply and demand. In turn, this makes predicting the exact price movements of Bitcoin challenging; however, improvements in scalability, security, and privacy features may increase confidence in Bitcoin and make it a more appealing investment for a bigger audience in the future.\n\nInformation on this website is intended for educational purposes only and is not to be used as investment advice. As with all investments, there is risk, and the past performance of a particular asset class does not guarantee any future performance.\n\nThis provided content was produced by Lee Enterprises. The news and editorial departments had no role in its creation or display."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jbGlja29ybGFuZG8uY29tL25ld3MvaW52ZXN0aWdhdG9ycy8yMDIzLzEyLzAxL2JhbmstaW1wb3N0ZXJzLXVzZS1iaXRjb2luLWF0bS10by1zdGVhbC0yMWstZnJvbS1vcmFuZ2UtY291bnR5LXdvbWFuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bank imposters use bitcoin ATM to steal $21K from Orange County woman - WKMG News 6 & ClickOrlando",
        "content": "ORLANDO, Fla. – An Orange County woman lost $21,000 in cryptocurrency transactions orchestrated by imposters posing as security investigators with Bank of America.\n\nBarbara, who asked we only use her first name, saved the screenshot of the caller ID that clearly shows Bank of America.\n\nShe told News 6 the imposters claimed her account was being accessed by people she had never heard of and that she needed to withdraw all of the cash from her account and transfer it to bitcoin accounts to protect it.\n\n“They said they were from Bank of America,” Barbara told News 6. “And I have Bank of America logos and everything, everything is showing Bank of America.”\n\nOne of the imposters emailed her four QR codes to be used in bitcoin transactions, each with a Bank of America logo.\n\n“‘There’s a place on Colonial Drive,’ he’s directing me now (Colonial Liquor),” she recalled.\n\nFind more reports from our News 6 Investigators on YouTube:\n\nThe victim admits she had never heard of a bitcoin hub but was convinced this was the only way to protect her money.\n\nAt one point they told her the people trying to access her bank account worked for the bank.\n\nSpecial agent in charge Caroline O’Brien-Buster said the Secret Service Cyber Task Force is launching a seven-county alert from Citrus to Brevard counties to warn potential victims of the tactics used in cryptocurrency schemes.\n\nThe task force will post signs on store windows and near the ATM machines identified at roughly 433 locations.\n\nThis week, the task force posted cryptoscam warnings at roughly 70 locations in Seminole County.\n\n“We just want to bring awareness out to the community,” O’Brien-Buster said. “There’s just so many people being victimized by fraudsters and being told to use bitcoin ATMs.”\n\nThe Federal Trade Commission said between January and September this year, Americans lost more than $1 billion in cryptocurrency scams ranging from bank fraud to romance scams.\n\nThe posters highlight the six common scams used by the conmen including:\n\nWere you encouraged to send cryptocurrency to repair a virus on your computer?\n\nWere you told the only way to protect your money was by making deposits to cryptocurrency ATMs?\n\nDid someone ask you to lie to the bank or keep the reason for your cryptocurrency purchase a secret?\n\nThe poster also advises consumers “scammers may use cryptocurrencies because the transactions are irreversible and hard to trace.”\n\n“This is happening across the country,” Obrien-Buster said. “The reason the Secret Service is so focused on placing these fliers at the different establishments is because the deception is so prolific.”\n\nIn Barbara’s case, Obrien-Buster said the money is likely gone.\n\nIf you have been caught in a bitcoin ATM scam, contact the U.S. Secret Service Orlando Field Office at 407-648-6333.\n\nGet today’s headlines in minutes with Your Florida Daily:"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMDEvYml0Y29pbi1yaXNlcy10by0zODhrLWZvci10aGUtZmlyc3QtdGltZS1zaW5jZS1tYXktMjAyMi_SAWhodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEyLzAxL2JpdGNvaW4tcmlzZXMtdG8tMzg4ay1mb3ItdGhlLWZpcnN0LXRpbWUtc2luY2UtbWF5LTIwMjIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Rises to $38.8K for the First Time Since May 2022 - CoinDesk",
        "content": "“In terms of seasonality, December is considered a relatively neutral month of the year, adding half the time over the past 12 years,” Alex Kuptsikevich, FxPro senior market analyst, said in an email. “The average gain is 30.8%, while the average decline is 12.8%.”"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTAxL2JpdGNvaW4tYnRjLWJyaW5ncy00MC0wMDAtcHJpY2UtaW50by12aWV3LW9uLWV0Zi1mZWQtYmV0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Brings $40,000 Price Into View on ETF, Fed Bets - Bloomberg",
        "content": "Bitcoin ’s chances of hitting $40,000 are top of mind for crypto speculators as they head into the final stretch of a year during which the largest digital asset more than doubled in price.\n\nThe token has rebounded about 130% over the past 11 months from 2022’s crypto rout, outstripping investments like stocks or gold . Hopes for Federal Reserve interest-rate cuts next year, and expectations that the US will allow its first spot Bitcoin exchange-traded funds, together created a potent elixir."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3Bpbm5pbmctZG93bi1iaXRjb2luLWV0Zi1hcHByb3ZhbC1kYXRlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Industry watchers pin down possible bitcoin ETF approval dates - Blockworks",
        "content": "Some industry watchers argue that the approval of spot bitcoin ETFs may occur within a three-day period in January, based on recent moves by the US Securities and Exchange Commission.\n\nBloomberg Intelligence analyst James Seyffart said in a Friday X post the approval of spot bitcoin ETFs — should the SEC choose to change its decade-long stance by greenlighting such products — could come between Jan. 8 and Jan. 10.\n\nLoading Tweet..\n\nThose following spot bitcoin ETF developments have looked ahead to Jan. 10 — the deadline for the SEC to rule on a proposal by Ark Invest and 21Shares.\n\nAn approval order could come before this date. But some believe the SEC would allow a bunch of bitcoin ETFs to launch at once, meaning the regulator could wait for the comment periods for other competing proposals to conclude.\n\nThe SEC is collecting public feedback for the proposed spot bitcoin ETFs by Franklin Templeton and Hashdex until Jan. 5, filings show.\n\nThe regulator said in a Tuesday disclosure it had chosen to “institute proceedings” to determine whether to approve or deny the Franklin Bitcoin ETF. It filed a separate order seeking comments on the Hashdex product the same day.\n\nThese filings to move along the proposal process for these ETFs came earlier than expected.\n\nThe SEC’s “quicker turnaround than usual” indicates it might be looking to line up a bunch of approvals at once, after that period ends on Jan. 5, Van Buren Capital general partner Scott Johnsson said in a Thursday X post.\n\nRead more: SEC should ‘stop picking winners’: VanEck exec\n\nBecause the regulator would not file spot bitcoin ETF approvals on the weekend, Johnsson noted, the timeframe between Jan. 8 and Jan. 10 would make sense.\n\n“[Five] days not a lot of time to review comments,” Johnsson added in a separate post. “There’s a good chance there won’t be any unique comments to work through anyway. And worst case they just get the approval shortly after the first cohort.”\n\nThe SEC could still choose to deny the current swathe of spot bitcoin ETF proposals, which include planned products by BlackRock, Fidelity, Invesco and others.\n\nA spokesperson for the regulator has declined to comment on this matter.\n\nBloomberg Intelligence analysts have said they believe there is a 90% chance the SEC will approve these funds by Jan. 10, citing Grayscale Investments’ August court win against the regulator and issuers’ ongoing dialogue with the agency.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMDEvZ2F1Z2luZy1zcG90LWJpdGNvaW4tZXRmcy1pbXBhY3Qtb24tcHJpY2Utdm9sYXRpbGl0eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Gauging Spot Bitcoin ETF's Impact on Price Volatility - CoinDesk",
        "content": "\"We need a reference price where we audit the fund to calculate the NAV,\" Kssis said in a Telegram interview. \"With in-kind creations, APs purchase assets and deliver them to the issuer. With cash creations, if the issuer manages to buy them cheaper, then it makes a little profit, but if it buys them higher, it coughs up the excess.\""
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEyLzAxL2NvdWxkLWJpdGNvaW4tYmUtd29ydGgtbW9yZS10aGFuLTEtdHJpbGxpb24taW4tMjAyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Could Bitcoin Be Worth More Than $1 Trillion in 2024? - The Motley Fool",
        "content": "With Bitcoin (BTC -3.76%) up more than 125% this year, it's becoming increasingly possible that this high-flying crypto might surge through the $1 trillion valuation mark sometime next year. Given Bitcoin's circulating supply of roughly 20 million coins, a valuation of $1 trillion implies a price of about $50,000. This represents a 30% gain from today's price of almost $38,000.\n\nThat price target certainly seems possible, given that it wouldn't even require Bitcoin to regain its all-time high of almost $69,000. Could Bitcoin rally to $50,000 and top a $1 trillion valuation in the coming months? Let's take a closer look.\n\nThe Bitcoin ETF factor\n\nBitcoin's current rally has been driven, to a large extent, by investor anticipation of the first-ever spot Bitcoin exchange-traded fund (ETF) for the U.S. market. In June, BlackRock led the way with a spot Bitcoin ETF application. Within the span of just a few weeks, a handful of other large institutional investors were also lining up with their own spot Bitcoin ETF applications. The current thinking is that the Securities and Exchange Commission (SEC) could give its final approval for a spot Bitcoin ETF sometime in the first quarter of 2024.\n\nThere are a number of useful back-of-the-envelope calculations that can be used to assess the impact of this approval. The easiest approach is to add up all the assets under management of the large institutional investors applying for these spot Bitcoin ETFs, and apply a scaling factor of, say, 1% to that number. That tells you how much new money might be flowing into Bitcoin. For example, if you assume that institutional investors will allocate just 1% of their $5 trillion in assets under management to Bitcoin, that would result in a new influx of $50 billion into Bitcoin.\n\nAnother approach is to consider Bitcoin from the perspective of a precious metal. Bitcoin is often described as \"digital gold,\" and many investors view it as a store of value, similar to physical gold. Thus, it's not out of the realm of possibility to think that some investors might move their assets out of precious metals and into Bitcoin. Right now, about $120 billion is held in precious metals ETFs. So, if you assume that anywhere from 10% to 20% of that might be reallocated to Bitcoin, that would result in a potential influx of anywhere from $12 billion to $24 billion. This new flow of money, presumably, would help to bid up the price of Bitcoin.\n\nThe global growth factor\n\nYou're probably thinking, \"That sounds great, but hasn't the market already priced in some, if not most, of the impact of a spot Bitcoin ETF?\" If you believe in the efficient market hypothesis, which says that the market has already priced in all known information, then you could be right. Coinbase Global, for example, has already run the numbers and concluded that some of the spot Bitcoin ETF impact might already have been priced in.\n\nThat's why I have a second big reason Bitcoin could rally to $50,000 and beyond in 2024: the global growth factor. In short, Bitcoin is becoming an increasingly important part of the world's financial system, and that is leading to new demand for Bitcoin as an asset.\n\nIn its Big Ideas report for 2023, Ark Invest shared its forecast for several different market segments where it saw Bitcoin building momentum worldwide. By estimating how much of each market segment Bitcoin might command in the future, Cathie Wood of Ark Invest came up with a base, bear, and bull case scenario for Bitcoin for the year 2030.\n\nFor example, Wood calculated that, in a base case scenario, Bitcoin might account for 3% of the M2 money supply of emerging market countries, and 2.5% of the portfolio allocation of institutional investors. All of that led to a base case forecast of $682,800 for Bitcoin. So even if you dial back some of these numbers (such as changing the portfolio allocation percentage from 2.5% to 1%), you're still going to get a huge number. The bear case scenario for Bitcoin, says Wood, calls for a price of $258,500 by the year 2030.\n\nCan Bitcoin reach $50,000?\n\nGiven the above, I don't think $50,000 is an outlandish price target for Bitcoin. Especially given the fact that some analysts are already projecting that Bitcoin could top $100,000 by the end of 2024. Standard Chartered Bank, for example, recently doubled down on a $100,000 price target for Bitcoin.\n\nAt today's prices, a target of $50,000 requires only a 30% rise for Bitcoin. If you consider all the money that could be flowing into Bitcoin as a result of a spot Bitcoin ETF approval, and then layer on top of that the overall growth that Bitcoin is seeing on a global basis, then Bitcoin might actually hit a $1 trillion market valuation in 2024. Just keep in mind, though, that given Bitcoin's historical volatility, that path to $1 trillion is likely to be filled with a bit of turbulence along the way. So buckle up."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jbmJjLmNvbS8yMDIzLzEyLzAxL2JpdGNvaW4tZmluaXNoZXMtbm92ZW1iZXItc3Ryb25nLWFzLWludmVzdG9ycy1lbnRlci1hLXdhaXRpbmctcGVyaW9kLWluLXRoZS1maW5hbC1tb250aC1vZi0yMDIzLS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin finishes November strong as investors enter a waiting period in the final month of 2023 - CNBC",
        "content": "November was perhaps the most significant month of this year for the crypto industry and gave bitcoin a strong setup as investors look toward 2024. Bitcoin ended the month up about 9%, according to Coin Metrics. It was the underperformer, however, compared to ether , which advanced 13%, and Solana's sol token, which jumped 63%. Investors found relief after FTX's disgraced leader Sam Bankman-Fried was found guilty of criminal fraud — just about a year after the short-lived exchange's spectacular collapse — and the CEO of Binance, the largest exchange in the world, pleaded guilty to charges brought by the U.S. Department of Justice. For many, these events allowed them to close a painful chapter of crypto history as it prepares to open a new one. If a spot bitcoin exchange-traded fund gets approved soon, it could bring a wave of new investors into the market who have been sitting on the sidelines waiting for the industry to clean up. BTC.CM= 1M mountain Bitcoin closes November up 9% Now, traders are waiting in earnest. \"It's safe to say that the market is grinding higher in anticipation of a spot bitcoin ETF approval in January,\" said Ryan Rasmussen, research analyst at Bitwise Asset Management. \"There's also the next bitcoin halving set to occur in May 2024, which is a strong catalyst for price that most people are missing as they're hyper-focused on a spot bitcoin ETF.\" \"Some investors will continue trying to front-run the potential spot bitcoin ETF approval, but December is essentially a 'wait and see' period for bitcoin,\" he said. Broad consensus is that an ETF is likely to be approved soon. Part of what's driving that optimism is reports that the U.S. Securities and Exchange Commission, which has long held a reputation for being dismissive or unengaging with the crypto industry, appeared to make greater efforts in November by holding closed-door discussions with several ETF filers, giving them feedback and meeting with them again . November is a historically strong month for bitcoin. This is its seventh positive one out of the 11 since its inception, according to CoinGlass. December's track record isn't as rosy, however. CoinGlass says it has ended in the green in just four of the past 10. This year, however, it may give investors a good opportunity to buy one more dip before key events play out in the beginning of 2024. According to Wolfe Research, \"all signs\" point toward a near-term pullback in bitcoin's price, though there's plenty of upside left for it to run. November gains bring bitcoin up about 127% for 2023. Ether and sol have gained 70% and 482%, respectively, for the year. \"While this is part of a rotation we often see — a bitcoin rally, followed by an Ethereum rally, followed by a rally in altcoins — it's a telling signal for where we are in this next crypto cycle,\" Rasmussen said. \"It tells us that investors are interested in more than just the potential for a spot bitcoin ETF. They're looking ahead to 2024 and focusing on other narratives [and] recognize the potential for crypto to gain a meaningful share of investor attention next year.\""
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZnV0dXJpc20uY29tL3RoZS1ieXRlL2JpdGNvaW4tdHJhbnNhY3Rpb24td2FzdGVzLXN3aW1taW5nLXBvb2wtd2F0ZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "The Average Bitcoin Transaction Wastes a Full Swimming Pool of Water, Scientists Say - Futurism",
        "content": "Yikes.\n\nDown the Drain\n\nEverytime Bitcoin is bought or sold, it wastes enough water to fill an entire swimming pool, new research shows, further evidence of the staggering environmental impact of cryptocurrencies.\n\nThe research, a study published in the journal Cell Reports Sustainability, also found that Bitcoin's water footprint is rapidly escalating, rising by 166 percent between 2020 and 2021.\n\nNow, each transaction is estimated to expend over 16,000 liters of water. According to Alex de Vries from the Vrihe Universiteit Amsterdam, the study's sole author, that's around six million times more than what you use buying something with a credit card.\n\n\"It's sort of hard to surprise me, given how I've already worked on this topic I'm kind of used to big numbers popping up,\" de Vries told The Verge. \"But then again, the numbers are still mind blowing even to me every time I look at it.\"\n\nCool It\n\nGlobally, Bitcoin mining used about 1,600 gigaliters — that's a billion liters times 1,600 — in 2021, and the figure could be upwards of 2,200 gigaliters this year, with the US alone accounting for up to 35 gigaliters of that consumption. The steep increase will likely be driven by Bitcoin's climbing value, which encourages more mining.\n\nAn enormous amount of water is used to cool the tireless computers that mine and process Bitcoin around the clock. It's an intensive process that devours absurd amounts of energy — as much as a small country, in fact.\n\nThat energy bill figures into de Vries's calculations. Most of its water footprint comes from the water used in generating the electricity that Bitcoin burns through, though cooling systems still formed a massive part of the total proportion.\n\nLowering the Stakes\n\nIt doesn't have to be this way, according to de Vries. Most cryptocurrencies including Bitcoin use what's known as \"proof of work\" to validate transactions on the blockchain — the \"work\" being the mining done by those toasty computers — which is wildly inefficient.\n\n\"You have millions of devices around the world, constantly competing with each other in a massive game of what I like to describe as 'guess the number,'\" de Vries told the BBC. \"All of these machines combined are generating 500 quintillion guesses every second of the day, non stop — that is 500 with 18 zeros behind it.\"\n\nThere is at least one major cryptocurrency, however, that works around this: Ethereum, which last year started using \"proof of stake\" instead of work to validate transactions without any mining whatsoever, cutting its energy bill by 99 percent.\n\nShort of ditching crypto entirely, switching them over to more efficient systems could cause \"all the electricity consumption\" and \"associated water consumption\" to \"disappear overnight,\" de Vries told The Verge.\n\nBeyond that, using renewables and switching over to cooling methods that either recycle or don't use water at all could help soften crypto mining's grim environmental toll.\n\nMore on crypto: Execs of Top Meme Coin Charged With Spending Customers' Money on Luxury Cars"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEyLzAxL2F2YWxhbmNoZS1oZWxpdW0tbGVhZC1tb250aGx5LWNyeXB0by1nYWlucy1hcy1idWxsaXNoLWJpdGNvaW4tY29uc29saWRhdGlvbi1zcHVycy1hbHRjb2luLXNlYXNvbi1jYWxsL9IBlgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEyLzAxL2F2YWxhbmNoZS1oZWxpdW0tbGVhZC1tb250aGx5LWNyeXB0by1nYWlucy1hcy1idWxsaXNoLWJpdGNvaW4tY29uc29saWRhdGlvbi1zcHVycy1hbHRjb2luLXNlYXNvbi1jYWxsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Avalanche, Helium Lead Monthly Crypto Gains as Bullish Bitcoin Consolidation Spurs Altcoin Season Call - CoinDesk",
        "content": "The widening breadth of the crypto rally signals that we are in the midst of an \"altcoin season,\" investment advisory firm ByteTree said in a report this week. Market observers refer to altcoin seasons as periods when smaller cryptos outperform bitcoin."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZW5nLmFtYmNyeXB0by5jb20vYml0Y29pbnMtdm9sYXRpbGUtcGVyaW9kLW1heS1oYXZlLWVuZGVkLWhlcmVzLXdoeS_SAVBodHRwczovL2VuZy5hbWJjcnlwdG8uY29tL2JpdGNvaW5zLXZvbGF0aWxlLXBlcmlvZC1tYXktaGF2ZS1lbmRlZC1oZXJlcy13aHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin’s volatile phase may have ended — Here’s why - AMBCrypto English",
        "content": "BTC was down by nearly 1% over the last 24 hours.\n\nSocial metrics were high, but other indicators looked bearish.\n\nBitcoin [BTC] has not been very volatile of late, as its price took a sideways trajectory. As AMBCrypto reported earlier, investors might have to expect a few more slow-moving days, which was further established by the latest datasets.\n\nNotably, Bitcoin’s MACD and Money Flow Index (MFI) looked bearish. But can anything cause a change in the trend in the near term?\n\nBitcoin might not get volatile\n\nIntoTheBlock recently posted a tweet highlighting that the 30-day average intraday move for Bitcoin was going lower than traditional markets. This indicated a period of relatively low volatility for BTC.\n\nMoreover, AMBCrypto found that while BTC’s price went sideways, its Open Interest remained relatively high. High Open Interest generally indicates that the ongoing price trend might continue further.\n\nHas anything changed overnight?\n\nThough BTC did not register much movement, investors continued to accumulate at press time. This was evident from the fact that BTC’s Exchange Outflow spiked in the recent past.\n\nOn top of that, BTC’s Supply on Exchanges remained lower than its Supply outside of Exchanges, suggesting that buying pressure on the coin was higher than selling pressure, reflecting investors’ confidence in the king of cryptos.\n\nThings looked good for BTC on the social front too, as its Social Dominance surged by more than 50% over the last week. But despite the sluggish price movement, Bitcoin’s Market Dominance registered an increase, which looked optimistic.\n\nHowever, a bearish metric was the coin’s AltRank, which increased over the last seven days.\n\nWhen AMBCrypto checked BTC’s daily chart, we found that not much had changed over the last few hours. The MACD continued to show an ongoing tussle between the bulls and the bears at press time.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nThe Bollinger Bands’ data also revealed that the coin’s price was in a less volatile zone.\n\nHowever, the Relative Strength Index (RSI) went sideways, but its Money Flow Index (MFI) looked bullish as it moved up slightly in the recent past. At press time, BTC was trading at $37,787.55, with a market capitalization of over $739 billion."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vbnltYWcuY29tL2ludGVsbGlnZW5jZXIvMjAyMy8xMi9ob3ctdGhlLXdpbmtsZXZpaXMtc2Vjb25kLWFjdC1pbi1iaXRjb2luLXdlbnQtYmFkLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "How the Winklevoss Twins' Bitcoin-Based Second Act Went Bad - New York Magazine",
        "content": "Photo-Illustration: Intelligencer; Photo: Getty\n\nThis article was featured in One Great Story, New York’s reading recommendation newsletter. Sign up here to get it nightly.\n\nIn early June 2019, Cameron and Tyler Winklevoss invited the author Ben Mezrich to a private get-together at the Park Avenue South headquarters of their crypto exchange, Gemini, an office where the money and ambition of the digital currency world were on outlandish display: A giant chrome statue reminiscent of the MTV Moon Man trophy hung from the ceiling; employees were called “astronauts”; the C-suite was referred to as “mission control.” Mezrich, of course, was a key figure in the Winklevosses’ lives. As the author of The Accidental Billionaires: The Founding of Facebook, a Tale of Sex, Money, Genius, and Betrayal — the 2009 book that became The Social Network — he had helped define them, before their 30th birthdays, as spoiled Ivy League monozygotic brats who got rich thanks to their dad’s lawyer. “The Winklevii aren’t suing me for intellectual property theft,” Jesse Eisenberg, playing the Mark Zuckerberg character, says in one of the movie’s key lines. “They are suing me because, for the first time in their lives, things didn’t go exactly the way they were supposed to for them.”\n\nYet, ten years later, Mezrich was hawking his new book, Bitcoin Billionaires: A True Story of Genius, Betrayal, and Redemption, casting the twins as heroes — to their own employees. “That was a weird day,” one onlooker said. Attendance was optional, but the midday event did have pizza, and who doesn’t love pizza, so dozens showed up. The twins seemed relaxed, far from their normally stiff selves, two others said. “I remember them asking what Ben’s process was, and him saying, ’I write books I can turn into movies,’” a fourth attendee said. What was so strange about the whole thing is that Mezrich’s book hardly even mentions Gemini. Then, after it was all over, the twins asked their employees to grab a free copy and form a line, so all three of them — the author and his dual protagonists — could all sign the book.\n\nThe Winklevoss twins have, for the better part of a decade, been trying to convince the world they made a comeback. For anyone who stopped paying attention to them after the Facebook movie came out, here’s the general trajectory: The $65 million settlement from Zuckerberg over their claims to the Facebook idea turned into a major bet on bitcoin, back when the digital currency traded for about $8. (Lately it trades around $38,000.) Gemini, which they started in 2014, was supposed to be their legacy — a highly profitable business that would not only cement their status as serious players in the growing crypto industry. If everything went right, it had the potential to be a $100 billion company of their own. In an often sketchy or even scammy sector plagued by hacks and FBI raids, they branded themselves as rule followers using financial best practices to create a dependable “next generation” exchange that wealthy investors and institutions could rely on as they got involved in crypto investing. They would be the kind of entrepreneurs who would work with government regulators even as much of the rest of the industry tried to avoid oversight. “In the beginning of Gemini’s history, we were very focused on asking permission, and not asking for forgiveness,” a former executive said. “We always acted on the expectation of how regulators would want us to work.”\n\nGemini is, of course, a reference to twins, as well as a NASA space flight — but any astrologer could tell you that geminis have a tendency for saying one thing and doing another. Last month, New York Attorney General Letitia James sued the Winklevosses’ exchange, claiming that it defrauded 290,000 people out of $1.1 billion worth of crypto. The suit presented a company that was not only willing to overlook its own internal concerns about a partner firm that was holding a huge chunk of its customers’ deposits but to continue representing to those customers that their money was secure even as the board was privately comparing this partner to Lehman Brothers in 2008. Interviews with nine sources, together with court records, reveal a company that began taking larger and larger risks as it attempted to keep up with competitors like FTX and Binance, both of which later ran spectacularly afoul of law. (None of the sources are being named since they continue to work in the industry and fear getting sued for talking about the companies.) That frantic chase is said to have led Gemini to stray from the rule-following conservatism that was the original cornerstone of the brand. Now that they’ve been accused of lying to their customers — and their exchange has fallen out of the top 100 by global trading volume — the twins are facing the most consequential test to their credibility yet.\n\nAfter their famous Facebook settlement, the Winklevosses made some questionable investments. There was Treats!, a porn magazine, in 2014. There was Hukkster, an online retailer, soon after. Cameron co-founded “Guest of a Guest,” a “Page Six” knockoff. But their bitcoin bet was an unqualified jackpot. As Mezrich describes in his more recent book, it began at an Ibiza foam party called F@@k Me I’m Famous. A man they’d never met buttonholed them about “the oldest social network on earth.” He was talking about money, specifically in the form of the digital currency, and the twins were hooked. They bought up about 1 percent of all the bitcoin in the world. At first, they tried to turn their investment into a kind of company of its own, the world’s first exchange-traded fund for bitcoins. This would give the investing public an easy way to make the digital currency part of their 401(k)s — all for a small fee — but their applications were repeatedly denied by federal regulators.\n\nStill, Gemini was their biggest idea. Following the 2014 debacle of Mt. Gox — the largest bitcoin exchange in the world until it was hacked and robbed — there was a strong appetite for reliable crypto companies. “It was super exciting,” an early executive said of Gemini’s formative years. “I was working my ass off and I loved it.” Early on, the twins went out of their way to involve the New York Department of Financial Services, a historically nosy Wall Street regulator, and by 2015 would be one of the first to get a charter allowing it to operate in the state.\n\nThe business plan was to be one step ahead of Wall Street. As the hedge funds and Goldman Sachses of the world discovered crypto, the thinking went, Gemini would already be there, an inviting gateway into this new realm. Gemini was scrupulous about following the rules, employees said. In addition to working with New York regulators, the Winklevoss brothers would fly to Europe to meet with the financial authorities there. Gemini’s ad campaigns had taglines like “Crypto Without Chaos” and “The Revolution Needs Rules.” Whenever Gemini wanted to list a new digital currency for customers to trade, it informed the Department of Financial Services ahead of time, giving the regulators the chance to register an objection. Most times, DFS officials would either approve the request or decline to act against them — which, in effect, was seen to be the same thing, according to people familiar with the inner workings of the company. Generally, this plan worked. By 2019, Gemini had captured about 5 percent of the U.S. crypto exchange market — a small, but valuable, slice of a rich new industry.\n\nIn a wonderful twist of irony, Gemini nearly captured the business of a certain blockbuster client: Zuckerberg. Starting in 2018, the Facebook founder wanted to launch his own cryptocurrency, called Libra. At one point, according to three people directly familiar with the plans, Libra’s parent company was preparing to issue the digital currency through Gemini. Gemini employees had figured that DFS regulators were fine with it after hearing nothing back from a proposal. “It technically was approved,” said one person. The PR value of the plan would have been hard to overstate — here were the twins, getting back into business with their onetime nemesis, letting bygones go on a grand quest to get insanely rich. It was only after informing regulators again — extra safe, by the rules — that they raised concerns about the launch. Libra encountered further regulatory scrutiny after that, particularly on concerns that Facebook was too big, and was quietly euthanized in 2022.\n\nIn the months preceding the pandemic, ex-employees told me, something began to change. Their market share was not growing. Their biggest U.S. competitor, Coinbase, was becoming the go-to exchange. “We felt like we were missing out,” one ex-employee said. Abroad, the growth was even bigger. Binance, which had no headquarters (and thus no obvious regulatory obligations), had cemented itself as the world’s largest exchange. Sam Bankman-Fried’s FTX was also growing rapidly from its offshore outpost in Hong Kong, before relocating to an even friendlier jurisdiction in the Bahamas (where it would commit its epic $14 billion fraud). Inside Gemini, the bet on institutional customers appeared to be going nowhere. Goldman wasn’t giving them real business, and they were getting as much as they’d hoped from hedge funds, insiders said.\n\nIn 2020, the twins decided it was time for a pivot. They no longer wanted Gemini to be just an exchange where customers traded crypto. Instead, it would look more like a consumer bank, selling lots of financial products — credit cards, bank accounts, maybe even mortgages, one ex-employee said. At the center of that was a top-secret project called Earn, which would basically act like a high-yield checking account, except for crypto holdings instead of cash. “We would have this savings-like account. That’s how we viewed it internally, even though we never ever say that publicly anywhere, because we knew that we weren’t allowed to say that,” one person directly involved with the program said. It was an aggressive move to offer the general public a brand new interest-bearing product without clear regulatory approval — and this time Gemini didn’t ask the Department of Financial Services for permission ahead of time, according to two people familiar with the approval process. To knowledgeable observers in the crypto world, the logic of the Winklevosses’ strategy shift toward riskier and more aggressive product offerings was obvious enough. “They were hemorrhaging market share,” said Cory Klippsten, the CEO of Swan Bitcoin, a digital currency financial services company. “In an effort to stay alive, they basically did exactly what SBF did, which was go after retail deposits.”\n\nEarn worked by, essentially, connecting Gemini’s generally conservative customers and some of crypto’s wildest risk-takers. Gemini depositors could opt to put their crypto (say, their bitcoin or ethereum) in a special account that would pay them interest — as much as an 8 percent annualized — on the balance. For many depositors, it seemed like an easy way to make a little extra income while they waited for their crypto bags to moon. But, of course, the yield had to come from somewhere. At a traditional bank, a checking account yield comes from the bank lending out those same funds at a higher rate of interest. In the case of Earn, Gemini would lend out their customers’ crypto to other players in the industry (with crypto speculation at a fever pitch, there was a strong institutional demand to borrow crypto for trading) for a higher rate of interest than it ultimately paid to its customers. If everything went smoothly, it was win-win.\n\nInside Gemini, people involved said, the whole process of setting up the program took nearly a year, and involved intense debates about what kind of interest rates they should offer and whether they should lend out the crypto to multiple partners or only one. Gemini’s product managers considered partnering with a handful of lenders, including two companies that were successful doing what Earn aimed to do, paying retail investors interest on their crypto holdings by lending them other institutions. One was BlockFi, a firm that the twins had already invested in. The other was Celsius, a competitor. While the two firms appeared to be doing very well during the crypto bull market of 2020 and 2021, both would collapse in 2022 with their customers losing everything they had deposited. (Celsius’s founder, Alex Mashinsky, has since been charged with criminal fraud, and his trial is set for September 2024.)\n\nWhen Earn was publicly announced in February 2021, Gemini’s press release did not mention any lending partner and instead touted its own safety and reliability “on par with those offered by top financial institutions,” the company said. The company it chose as a partner was Genesis Trading, a big institutional player in the crypto space. Like Gemini, it was based in New York City and a related entity, Genesis Capital, was regulated by state watchdogs. Genesis was also a subsidiary of one of the companies that helped create the crypto industry, Digital Currency Group. The parent company was sitting on the world’s largest bitcoin horde (over 600,000 of them, held as part of a lucrative publicly tradable product called the Grayscale Bitcoin Trust). Because Genesis was overseen by such a big moneymaker — DCG booked more than $1 billion in revenue in 2021 — it was considered about as creditworthy as you could get in the crypto business.\n\nEarn was a surprise hit and quickly became the Winklevoss twins’ biggest product. In the first two weeks, according to internal metrics, it brought in $500 million in deposits; a month later, Gemini had made $1 million in fees. By June, the internal data showed, 73 percent of the customers had 99 percent of their money in Earn. Gemini depositors loved it because they earn high interest rates for doing basically nothing, all while working with the “crypto without the chaos” company. “Gemini has always had a reputation for being a trustworthy and secure platform,” said one Earn depositor, Glen, who asked to have his full name withheld for security reasons and because his family doesn’t know. “I trusted Gemini and assumed that any partnerships they had would be equally trustworthy.” On the back of that success and a booming market generally for all things crypto, Gemini reached a valuation topping $7 billion. The twins made the Forbes billionaires list, with $6 billion between them.\n\nStill, some Gemini employees were concerned. They thought that the crypto industry was too dependent on Genesis remaining stable and managing its risks intelligently. For skeptics, it looked like it could be a systemic point of failure in a larger crypto collapse. “If you didn’t know that Genesis was the counterparty to every interest-bearing crypto product, you were not paying attention,” one former Gemini employee told me. But an executive overseeing the project “would repeatedly say that he thought that their financials were very strong and that they are blue chip or whatever. He seemed to think that they were trustworthy.”\n\nIn the end, Genesis Trading wasn’t trustworthy. Internal records revealed during the criminal trial of Bankman-Fried showed that Genesis didn’t play by anything resembling the rules of a traditional financial firm. For instance, the company routinely approved billions of dollars in loans over Signal chats. One former loan officer said that confidential information was kept unsecured on the company’s servers. “Our credit risk team was a sham. I don’t know what they were doing,” said another ex-employee. “They had no risk reporting at all,” said a third. “There wasn’t a way to look at the portfolio very easily.” By early 2022, Genesis had discovered that about 60 percent of all its loans were concentrated in Bankman-Fried’s hedge fund, Alameda Research – which, of course, would blow up spectacularly before the end of the year.\n\nGemini was not unaware of the risks it was taking by parking a huge chunk of its customers’ funds with Genesis, according to ex-employees and court documents. The attorney general’s office alleged that Gemini’s risk team had downgraded Genesis’s risk level to junk status by February 2022. In the spring of that year, a Genesis employee privately met with Jared Shaw, Gemini’s head of finance, to tell him about how concentrated Genesis was in Alameda. (Shaw hadn’t responded to a request for comment prior to publication. Afterwards, he said “I had no private meetings or met with anyone at Genesis while at Gemini.”)\n\nAs 2022 rolled on, everything was starting to come apart — fast. In May, two of the world’s biggest cryptocurrencies, TerraUSD and Luna, collapsed, instantly evaporating $60 billion from the larger crypto economy. A month later, the hedge fund Three Arrows Capital went under, defaulting on more than $3 billion in obligations — including $2.3 billion in loans from Genesis, according to court records. According to the attorney general’s suit, this nearly led to Genesis’s bankruptcy. DCG, its parent company, issued a promissory note that appeared to plug a $1.1 billion hole in its balance sheet, though no money was actually exchanged. (One former Genesis employee said that the flimsy nature of DCG’s support﻿ was not known among rank-and-file employees at Genesis.)\n\nAt Gemini, the steep decline in crypto markets following the Terra-Luna and Three Arrows debacles only appeared to make the twins more remote. In January 2022, the twins had hired a new chief technology officer, Pravjit Tiwana, from Amazon. Seen internally as a likely candidate to one day run the exchange, Tiwana favored the kind of move-fast-and-break-things model that Silicon Valley ran on, dismantling the company’s quality assurance team, and pushing out several of the most experienced people on the risk team, former employees said. Tiwana was widely unpopular among those who’d helped build the company in its early years, particularly for weekly, companywide presentations where, ex-employees said, he and his lieutenants would grill employees on why they hadn’t hit goals that seemed far out of reach. (Tiwana left the company on November 15.) After laying off 10 percent of Gemini’s workforce in June, the twins went on a band tour, where they would play covers of Rage Against the Machine and Blink-182, among others. In one widely circulated clip of their set, they couldn’t quite remember the words to “Don’t Stop Believin’”:\n\nuh so i saw the winklevoss twins' band? tonight? like, it's really them pic.twitter.com/xVqYwQrztL — maggie ;) (@arch_nem) June 10, 2022\n\nMeanwhile, the problems with Earn were growing more obvious inside the company. Requests from Gemini risk officers for standard disclosures — like who Genesis was loaning money to — went unanswered, two people said. According to the New York attorney general’s lawsuit, Gemini knew that Genesis wouldn’t have the money to pay back its loans if it went under. Cameron said during a board meeting that Genesis was “lying about financials.” A lawsuit that Gemini would later file against the lender claims that Genesis gave them “falsified balance sheets and other financial reports, which falsely indicated that [Genesis] was solvent when in reality it was not.”\n\nOn October 13, Gemini gave Genesis 30 days notice that it would end the Earn program, court documents show. However, according to the attorney general’s suit, Gemini never stopped promoting Earn on its website and continued to funnel money into the soon-to-be bankrupt lender. Before those 30 days were up, Bankman-Fried’s crypto empire collapsed, revealing his extensive criminal fraud and sending crypto markets into freefall. Simultaneously, the true extent of Genesis’s risky lending was exposed. With so many loans concentrated with Alameda, Genesis was insolvent and soon after declared bankruptcy. When it did so, the $900 million in Earn customer funds that it controlled immediately became frozen — as they remain today. (Since those funds are invested in crypto and those markets are up dramatically in 2023, the overall value of the Gemini customer assets trapped with Genesis is now more than $1.1 billion.)\n\nIn the wake of the collapse, the twins tried to come to a settlement with DCG and its founder and CEO, billionaire and longtime crypto-Twitter troll Barry Silbert. During these negotiations, four people who were either inside one of the companies or were briefed on the discussions directly were told that Silbert and the twins discussed paying back customers some portion of their deposits immediately — but less than what they’d deposited. The payments would have taken the form of shares of DCG’s Grayscale Bitcoin Trust — which the twins’ exchange had secured in collateral, according to the suit filed against Genesis by Gemini.\n\nThe talks collapsed in December, and soon after, one of Gemini’s attorneys, Niels Gjertsen, left the company. (Gjertsen declined to comment.) The twins would soon take their fight against Silbert to Twitter, and add to their portfolio of lawsuits when they sued Genesis in Manhattan federal bankruptcy court for more shares of the bitcoin trust. (The U.S. Securities and Exchange Commission filed a civil suit accusing both companies of other financial violations that month.) Silbert’s company has claimed that Gemini’s suit is a “publicity stunt,” while Gemini is accusing its former lending partner of basically stealing from Earn customers. With the dispute playing out in court, Gemini’s Earn customers are still in limbo. Their assets show up in their accounts, but they are unable to access them. The day before Thanksgiving things got even worse: Genesis filed a suit seeking to claw back $689 million from Gemini customers who were able to get their money out before the collapse, making it less clear when or whether the other customers will ever be able to do so. (It’s also unclear whether, should the customers ever get paid back, it would be in current crypto prices, or the dollar amount of assets at the time of the bankruptcy, which were much lower.)\n\nMultiple former Gemini employees expressed frustration at what they saw as a mishandling by the Winklevoss brothers of a situation that didn’t need to leave the exchanges customers stranded and fearful of losing their assets. Among the victims are a 79-year-old grandmother who, according to the attorney general’s suit, invested her husband’s entire $199,000 savings into the program. She “had hoped to use this money to pay for her grandchild’s education. Outside of her Earn investment, she and her husband have little savings,” according to the suit. Glen, the depositor, declined to say how much he put into Earn but said that he’s had to delay a medical procedure because his money is frozen. “As for Gemini, I do believe they bear some responsibility, considering they were the ones offering and promoting the Earn program,” he said. “It seems only fair that they should cover at least a portion of the deposits to help mitigate the losses for users like myself.”\n\nThe twins are fighting the New York State charges against their business. Silbert is doing the same. (While Silbert was named as a defendant in the attorney general’s suit, the Winklevosses were not. Representatives from Gemini and Genesis didn’t respond to requests for comment.) Regardless of the outcome, the Winklevosses’ big opportunity appears to have passed them by. Coinbase, its largest U.S. competitor, saw 42 times more trading volume than Gemini on one recent November day, according to publicly available data. Its CEO, Brian Armstrong, has already cast himself as the most trustworthy major crypto CEO left. “We now have an opportunity to start a new chapter for this industry,” he recently said on X. In fact, the new chapter looks a lot like the vision that the twins first pitched before the last bubble burst.\n\nIn the crypto world, investors are preparing for another boom. Bitcoin has more than doubled off its 2022 lows. BlackRock, the world’s largest asset manager, is on the verge of offering its own bitcoin and ethereum ETFs — the very thing the Winklevosses tried to do a decade ago. JPMorgan Chase, the largest bank in the U.S., plans on issuing its cryptocurrency during the next year or so. Rather than scramble to win back a potential new wave of institutional business, the twins are, at least publicly, lamenting that they ever played by the rules at all. “We spent years doing things the right way, going in the front door, asking permission not forgiveness,” Cameron — or is it Tyler? — said in a June Instagram post. “And honestly, at this point, it’s unclear what good it’s done for us.”\n\nThis story was updated to include a comment from Jared Shaw denying meeting with any Genesis employees, and to clarify the timeline of the Genesis bankruptcy proceedings."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd2VhdGhlci5jb20vbmV3cy9jbGltYXRlL3ZpZGVvL2Etc2luZ2xlLWJpdGNvaW4tdHJhbnNhY3Rpb24tdXNlcy0xMDAtYmF0aHR1YnMtb2Ytd2F0ZXItc3R1ZHktc2hvd3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "A Single Bitcoin Transaction Uses 100 Bathtubs Of Water, Study Shows - Videos from The Weather Channel - The Weather Channel",
        "content": "There’s plenty of data out there showing how much electricity is burned by bitcoin mining – it’s about the same amount each year as the entire country of Poland. New research looks at how that plays into water usage and how many gallons are consumed by a single bitcoin transaction."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGVybXMvcy9zaWxrLXJvYWQuYXNw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "What Was the Silk Road Online? History and Closure by FBI - Investopedia",
        "content": "What Was Silk Road?\n\nSilk Road was a digital black market platform that was popular for hosting money laundering activities and illegal drug transactions using Bitcoin. Silk Road, regarded as the first darknet market, was launched in 2011 and eventually shut down by the FBI in 2013. It was founded by Ross William Ulbricht, who is now serving a life sentence in prison for his role in Silk Road.\n\nSince that time, several other darknet markets have risen.\n\nKey Takeaways The Silk Road was an online black market where buyers and sellers of illegal or unethical items could transact anonymously.\n\nUtilizing privacy techniques such as the Tor network and cryptocurrency transactions, people were able to transact in drugs, hacked passwords, illegal data, and other contraband.\n\nThe FBI shut down Silk Road in 2013, and its founder, Ross Ulbricht, was sentenced to prison for life.\n\nUnderstanding Silk Road\n\nThe digital era has brought many technological innovations to our home fronts and created lifestyles that were unthinkable at the turn of the century. We can now conduct transactions online with ecommerce sites, pay for online transactions using virtual currency, get loans online using social lending sites, operate anonymously on the web using data anonymization technology, and even connect with company recruiters using social media sites. The list of digital technology inventions goes on and ventures into every sector of the world's economy.\n\nWhat Lead to Its Creation?\n\nAn increase in the use of cyber technology like cryptocurrency and ecommerce marketplaces led to an increase in the demand for data privacy. Demand for privacy increased regulation and laws over how data is used; additionally, an increase in technological tools and platforms was created to serve users who prefer to live more anonymously. While the initiation of data anonymization tools helps protect users' personally identifiable information (PII), these tools are also used by entities who intend to conduct illegal and criminal activities. In 2011, the Silk Road was born out of a need to connect illicit drug sellers with interested buyers online while protecting their identities and transactions using anonymization techniques.\n\nThrough a combination of data anonymization technology, a trading platform, and a feedback system, Silk Road created a haven for drug traders. The site was accessible only through a network known as Tor, which exists mainly to anonymize user data and activities online. Tor obfuscates users' addresses so they appear hidden from unwanted parties looking to surveil the users' transactions and activities—in other words, Silk Road, Tor, and cryptocurrency was the ultimate privacy toolkit for illegal operations.\n\nBitcoin is designed to be anonymous, with only the wallet's public address displayed on the blockchain. If the wallet owner doesn't want to be associated with the address, there isn't any way to identify them if they don't reveal themselves some other way. Addresses with questionable transactions are monitored by authorities for activity, which is how many illegal transactions using cryptocurrency are identified.\n\nPrivacy and Feedback\n\nSome Silk Road buyers and sellers brazenly conducted illegal drug transactions without fear because their IP addresses could not be traced back to them. Another reason Silk Road thrived was the buyer feedback system implemented on the platform. Buyers would normally provide feedback on sellers after receiving their goods. The feedback received was then used by the site to weed out fraudulent sellers, while reputable sellers had their products highly sought after. This promoted buyer confidence in the online platform.\n\nAll trades on Silk Road were conducted using the virtual currency known as Bitcoin. Every Bitcoin transaction is recorded on a public ledger, which is easily surveilled by legal and regulatory bodies.\n\nThe Fall of Silk Road\n\nThe Silk Road came to its demise in 2013 after the FBI learned about the existence of the hidden marketplace and colluded with the DEA, IRS, and Customs agents. Although the federal agents admitted that the use of Tor and Bitcoin to obscure addresses were significant obstacles that they encountered, they were still able to crack down on the underground drug market.\n\nThe FBI shut down the site permanently, seized more than 144,000 bitcoins (then valued at $34 million), and arrested several users of the site, including the founder, Ross Ulbricht, who made about $80 million in commissions from transactions carried out within the site. Ulbricht was convicted in 2015 and is currently serving a life sentence without the possibility of parole.\n\nDoes the Silk Road Still Exist Today? The Silk Road, as it was before being taken down in 2013, no longer exists. However, the dark web is still operating, and most things found on Silk Road are available via various venues. Authorities continue to crack down on illegal operations.\n\nWhat Happened to the Bitcoins Seized From Silk Road? More than 144,000 were recovered at the time of the takedown. But in 2022, James Zhong pled guilty and was convicted of wire fraud. IRS special agents recovered more than $3 billion in cryptocurrency from his home, stolen from Silk Road in 2012.\n\nDoes Ross Ulbricht Still Have Bitcoin? Ulbricht is still in prison as of 2023 and no longer has any bitcoin unless it is hidden somewhere and agents did not find it.\n\nThe Bottom Line\n\nSilk Road was the name of a platform used on the dark web to sell illegal goods, providing anonymity for those who required it for their activities. Federal agents took the site down, and the founder was arrested in 2013.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes online. Read our warranty and liability disclaimer for more info.\n\n\n\n"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEyLzAxL2dyYXlzY2FsZS1nZWFycy11cC1mb3ItYml0Y29pbi1ldGYtcmFjZS1ieS1oaXJpbmctaW5kdXN0cnktdmV0ZXJhbi1mcm9tLWludmVzY28v0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEyLzAxL2dyYXlzY2FsZS1nZWFycy11cC1mb3ItYml0Y29pbi1ldGYtcmFjZS1ieS1oaXJpbmctaW5kdXN0cnktdmV0ZXJhbi1mcm9tLWludmVzY28vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Grayscale Setting Up for Bitcoin ETF Race by Hiring Industry Veteran From Invesco - CoinDesk",
        "content": "“The Grayscale team is thrilled to have John Hoffman join us as Managing Director and Head of Distribution and Strategic Partnerships. John has a wealth of industry and ETF expertise, which will be invaluable to our team and clients, especially during this exciting time at Grayscale,” Dave LaValle, Global Head of ETFs at Grayscale said."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJlc3QtbW9udGhseS1jbG9zZS0xOS1tb250aHMtYnRjLXByaWNlLTM4a9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin sees best monthly close in 19 months as BTC price taps $38K - Cointelegraph",
        "content": "Bitcoin (BTC) returned to $38,000 on Dec. 1 after the November monthly close became its best since April 2022.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin bears fail to spark monthly close sell-off\n\nData from Cointelegraph Markets Pro and TradingView tracked impressive overnight BTC price performance, which held key support.\n\nThe close came in at just over $37,700, with bid liquidity preserving the intraday range and avoiding a last-minute sell-off, per order book data from trading resource Material Indicators.\n\nBTC/USDT order book data. Source: Material Indicators/X\n\n“Monthly close looks pretty good closing above $35K,” popular trader Skew reacted on X (formerly Twitter).\n\n“Could see some multi week compression between $35K - $39K.”\n\nBTC/USD 1-month chart. Source: Skew/X\n\nSkew added that major resistance on monthly timeframes now lies higher — at $47,000 and around the 2021 all-time high of $69,000.\n\n“Monthly candle was excellent with a candle body low of $34.5K, this is important in that the lower candle BODY low was higher then the preceding candle BODY high. This is a sign of strength!” fellow trader and chartist JT continued in part of his own summary.\n\n“And lest we forget we closed $3K higher this month than last month, and thats progress!”\n\nJT described the high-timeframe chart outlook as “consistent and constructive.”\n\n$BTC\n\n\n\nBitcoin breaking out on low time frame. pic.twitter.com/MBBXmZ2iBz — The Wolf Of All Streets (@scottmelker) December 1, 2023\n\nThe trip above the $38,000 mark, which came hours after the close, marked Bitcoin’s first noticeable move in the latter half of the week. United States macroeconomic data prints, conversely, failed to attract much of a response.\n\nJerome Powell, chair of the Federal Reserve, was due to speak on the day in what would be the last chance for external volatility to be triggered.\n\nBTC price range has “significant” features\n\nHighlighting the stubborn nature of the current range below $40,000, meanwhile, Material Indicators co-founder Keith Alan argued that clearing it would be highly significant.\n\nRelated: Bitcoin ETF will drive 165% BTC price gain in 2024 — Standard Chartered\n\nAlan referenced the historical resistance/support (R/S) lines in play within the range, which are of similar importance to those already cleared, such as the previous cycle’s 2017 all-time high near $20,000.\n\n“If you think BTC is hovering around an arbitrary price you would be mistaken. There is a significant amount of historical confluence in this little R/S Flip Zone,” he wrote overnight.\n\nAn accompanying chart showed the levels to note on the monthly chart, along with long and short signals from one of Material Indicators’ proprietary trading indicators.\n\nBTC/USD 1-month chart. Source: Material Indicators/X\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3Lm5kdHYuY29tL3NjaWVuY2UvYS1zaW5nbGUtYml0Y29pbi10cmFuc2FjdGlvbi1jb25zdW1lcy1lbm91Z2gtY2xlYW4td2F0ZXItdG8tZmlsbC1hLXN3aW1taW5nLXBvb2wtc3R1ZHktNDYyNDAwMdIBgQFodHRwczovL3d3dy5uZHR2LmNvbS9zY2llbmNlL2Etc2luZ2xlLWJpdGNvaW4tdHJhbnNhY3Rpb24tY29uc3VtZXMtZW5vdWdoLWNsZWFuLXdhdGVyLXRvLWZpbGwtYS1zd2ltbWluZy1wb29sLXN0dWR5LTQ2MjQwMDEvYW1wLzE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "A Single Bitcoin Transaction Consumes Enough Clean Water To Fill A Swimming Pool: Study - NDTV",
        "content": "Bitcoin mining consumed 1.6 trillion litres of water worldwide in 2021.\n\nA single Bitcoin transaction could use the same amount of clean water needed to fill a garden swimming pool, according to a new study on the world's most popular cryptocurrency. According to New Scientist, Alex de Vries at the VU Amsterdam School of Business and Economics in the Netherlands calculated that Bitcoin mining, used in part to create new Bitcoins, consumed 1.6 trillion litres of water worldwide in 2021. Broken down per transaction, that means a single Bitcoin trade consumed approximately 16,000 litres of clean water, which is enough to fill a small swimming pool.\n\nNow, experts believe that the use of clean water in Bitcoin mining will rise to 2.3 trillion litres this year. According to the study published in the journal Cell Reports Sustainability, this sheer scale of Bitcoin mining's water consumption could impact drinking water if it continues to operate without regulation, especially in countries that are already battling water scarcity, including the United States. This is \"increasingly hard to defend,\" said Mr Alex.\n\nAccording to the study, mining Bitcoin requires huge computing power to solve mathematical equations on the internet. Water, which is evaporated, is used to cool the computers at large data centres and also to lower the temperature of coal-and-gas-fired power plants that also power Bitcoin mining computers.\n\n\"The mining devices are effectively just generating random numbers all day long, and they just throw them all away and nothing - nothing - useful comes out,\" Mr Alex wrote in the paper. \"It's just one backyard swimming pool going, going up in the air, literally evaporating on average per Bitcoin transaction,\" he added.\n\nAlso Read | Google DeepMind Discovers \"800 Years' Worth Of Knowledge\"\n\nNotably, according to Euronews, the environmental impact of mining Bitcoin has been widely documented, but this is the first assessment of its water use and wider environmental impact. Study authors believe that with the rise in Bitcoin price, its water consumption will also increase to 2,300 gigalitres, which is more than 40% compared to 2021. Mr Alex argued that using renewable energy instead of electricity would not be a solution to reducing Bitcoin's carbon footprint.\n\nHowever, in the study, he also wrote that if Bitcoin changed its technology to be more environmentally friendly, the crypto's environmental damage would reverse overnight. \"If you make the change you cut the majority of everything: the carbon emissions, water footprint, electronic waste, it all goes out the window overnight. Literally, the moment you make the software change, it's all gone,\" Mr Alex said. \"Bitcoin is responsible for half a per cent of global electricity consumption, [and] we could cut this by tomorrow,\" he added."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZGVjcnlwdC5jby8yMDgzMzIvaXMtYml0Y29pbi1wb2lzZWQtZm9yLWFub3RoZXItYnVsbC1ydW4tZXhwZXJ0cy13ZWlnaC1pbtIBV2h0dHBzOi8vZGVjcnlwdC5jby8yMDgzMzIvaXMtYml0Y29pbi1wb2lzZWQtZm9yLWFub3RoZXItYnVsbC1ydW4tZXhwZXJ0cy13ZWlnaC1pbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Is Bitcoin Poised for Another Bull Run? Experts Weigh In - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin today hit $39,000 per coin for the first time since a brutal digital asset crash in May 2022 that brought with it a long and painful bear market.\n\nThe virtual coin has since made a terrific comeback: at the start of January, it was trading for less than $17,000 per coin; it is now up 128%.\n\nCould this mean we’re seeing the beginning of a bull run? Some experts say it’s only up from here.\n\nAD\n\nAD\n\nA lot has happened in the crypto space since blockchain project Terra collapsed last year, leading to a plunge in every virtual coin and token and lots of bankruptcies—most notably, mega exchange FTX.\n\nChased by a toxic mix of industry failures alongside historically high interest rates and it looked like the crypto would never make it back.\n\nBut institutions—including Wall Street giant BlackRock—have since shown big interest in the crypto sphere: the firm and other prestigious names in finance have applied to the Securities and Exchange Commission for a spot Bitcoin exchange-traded fund (ETF).\n\nAnd the Federal Reserve might just be done with fiscal tightening, which last year caused investors to avoid “risk-on” assets such as equities and crypto.\n\nIn a report Friday, crypto asset manager Grayscale’s research team said that it sees “gradually improving crypto fundamentals”—so long as the central bank “has finished tightening and the U.S. economy can avoid a ‘hard landing’ (recession).”\n\nAD\n\nAD\n\nGrayscale also mentioned next year’s halving, which will see Bitcoin miner rewards slashed in half and lead to more scarcity in the market—and therefore “should be positive for valuations.”\n\nAnd James Butterfill, head of research at digital asset manager CoinShares, told Decrypt that investors are wanting to branch out—and this could be good for Bitcoin.\n\n“The increasing correlation between bonds and equities—now at a record high of 42%, excluding the COVID-19 period—is prompting a search for effective diversification among investors,” he said, adding that “Bitcoin has proven to offer significantly greater diversification compared to other asset classes.”\n\nAs more investors realize this, the higher the price of the asset will go in the new year, he argued.\n\nMeanwhile, Amberdata’s director of derivatives Greg Magadini told Decrypt that the data shows that “option traders are very bullish for BTC spot prices and expect prices to move higher relatively soon.”\n\nIf investors do finally get the Bitcoin ETF the SEC has repeatedly rejected for the better part of a decade, capital could flood the market, analysts at CryptoQuant predicted.\n\nAlthough the future may look bright right now, there are other things to consider.\n\n“There are also headwinds facing Bitcoin’s price,” Sam Callahan from Swan Bitcoin said. “These include the risk of a recession and the potential denial of a Spot Bitcoin ETF,” he continued, adding that a denial from the SEC could lead to a “shock to the market.”\n\nAD\n\nAD\n\nEdited by Ryan Ozawa."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWhpdHMtMzlrLXBvd2VsbC1mZWQtcmF0ZS1oaWtlcy1vdmVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin price hits $39K as Powell stirs bets Fed rate hikes are over - Cointelegraph",
        "content": "Bitcoin (BTC) hit $39,000 for the first time since mid-2022 on Dec. 1 as the United States Federal Reserve boosted hopes of policy easing.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nPowell: Calling end to hikes would be “premature”\n\nData from Cointelegraph Markets Pro and TradingView confirmed a new 19-month BTC price high of $39,000 on Bitstamp.\n\nBitcoin bulls, already in a strong position, beat out resistance as Fed Chair Jerome Powell took to the stage at Spelman College in Atlanta, Georgia for a scheduled appearance.\n\n“The FOMC is strongly committed to bringing inflation down to 2% over time and to keeping policy restrictive until we’re confident that inflation is on a path to that objective,” he said in prepared remarks.\n\n“It would be premature to conclude with confidence that we have achieved a sufficiently restrictive stance, or to speculate on when policy might ease.”\n\nWhile keeping his tone cautious, Powell appeared to boost risk asset sentiment with his comments on the current state of the U.S. economy and progress toward reducing inflation.\n\nReacting, financial commentary resource The Kobeissi Letter was among those with a more sober take on what the Fed might do in the future.\n\n“Their narrative has not changed since last year, but markets continue to call for a Fed pivot,” it wrote in part of a post on X (formerly Twitter).\n\n“As we have stated before, the Fed would rather spark a mild recession than risk a resurgence of inflation. This means that a long PAUSE is still likely.”\n\nBitcoin nonetheless took full advantage of the mood, contrasting with a flat reaction to the week’s earlier U.S. macro data prints.\n\nAs Cointelegraph reported, the next meeting of the Federal Open Market Committee, or FOMC, is due in mid-December, when any changes to interest rates will be announced. Per data from CME Group’s FedWatch Tool, as of Dec. 1, market expectations unilaterally favored a pause in hikes.\n\nFed target rate probabilities chart. Source: CME Group\n\nBTC price targets extend beyond $39,000\n\nTurning to Bitcoin markets, popular trader Daan Crypto Trades revealed the size of the sell-side liquidity involved in the brief trip to $39,000.\n\nRelated: ‘Buy the rumor, sell the news’ — Bitcoin ETF may spark TradFi sell-off\n\nKeith Alan, co-founder of trading resource Material Indicators, meanwhile, uploaded a snapshot of BTC/USDT order book liquidity to X following Powell’s speech.\n\nThis showed $39,000 and $39,200 remaining as significant resistance overhead, while the nearest substantial buyer support lay at $38,000.\n\nBTC/USDT order book liquidity data. Source: Keith Alan/X\n\n“I strongly believe that today we will finally close above $38K. A daily close above $38K is a powerful signal of a god candle,” fellow popular trader BitQuant forecast earlier on the day.\n\nDaan Crypto Trades added that Bitcoin seemed to be “leaving its previous trading range for the time being,” while Crypto Ed, founder of trading and training group CryptoTA, predicted upside taking Bitcoin to “at least” $39,200 next.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZGVjcnlwdC5jby8yMDgyNTIvYml0Y29pbi1ldGYtd2luZG93LXNvb24taGVyZS1hcmUtZGF0ZXMtd2F0Y2jSAUxodHRwczovL2RlY3J5cHQuY28vMjA4MjUyL2JpdGNvaW4tZXRmLXdpbmRvdy1zb29uLWhlcmUtYXJlLWRhdGVzLXdhdGNoP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin ETF Approval Window Opens Soon—Here Are the Dates to Watch - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAs Bitcoin ETF decision deadlines loom, there's growing interest in figuring out when, exactly, the U.S. Securities and Exchange Commission will make its announcement.\n\nThere's a handful of spot Bitcoin ETF applications pending with the regulator. The SEC missed another window for a decision, choosing instead to extend all of its deadlines. But but there's also been word that the SEC has met with Grayscale and BlackRock in the interim to discuss amendments to their applications.\n\nTo be clear, the SEC could still deny any or all of the pending applications. There's mounting optimism from Coinbase CEO Brian Armstrong to JP Morgan analysts, but there's no guarantee that the SEC will give any spot Bitcoin ETF the green light in early 2024. Still, experts who have been tracking the applicants' odds say they've never been better, and they have narrowed down a potential approval window to a handful of days in early January.\n\nAD\n\nAD\n\nBloomberg Intelligence ETF analyst James Seyffart says while the window is technically from January 5 through January 10, the securities regulator is unlikely make an announcement on a Friday and even less likely to drop news about the ETF applicants over the weekend.\n\nSo that shrinks the window to Monday, January 8 through Wednesday, January 10. \"Mark your calendars people,\" he wrote on Twitter.\n\nWindow is officially Jan 5th to Jan 10th. Really this means that any potential approval orders are going to come on either Monday Jan 8, Tuesday Jan 9, or Wednesday Jan 10. Mark your calendars people. https://t.co/8ob8Y6pgU5 — James Seyffart (@JSeyff) December 1, 2023\n\nThe crypto industry has been waiting for a spot Bitcoin ETF to be approved for years.\n\nIn the U.S., regulators have approved Bitcoin futures and even leveraged Bitcoin futures ETFs to trade. But a genuine Bitcoin ETF, one that directly tracks BTC and not just derivatives, has so far eluded investors.\n\nAD\n\nAD\n\nThe idea is this: shares in a Bitcoin ETF would gain and lose value as Bitcoin's price fluctuates, and investments in those shares would allow buyers to gain exposure to BTC without actually buying or holding digital coins.\n\nBecause an ETF makes it easier for traditional investors to jump into crypto, analysts have long predicted that such a product would bring a massive influx of capital into the market. Recently, researchers at blockchain data firm CryptoQuant said they expect an ETF to double Bitcoin's market cap, and potentially increase the overall crypto market by $1 trillion. For context, Apple's market cap sits at a cool $2.9 trillion today.\n\nJust the chance that an ETF might be approved has been incredibly bullish for Bitcoin's price. The world's oldest and largest cryptocurrency by market capitalization has found buoyancy thanks to all the attention from institutions and the upcoming Bitcoin halving, which limits Bitcoin's inflation rate and could further drive up demand.\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZGVjcnlwdC5jby8yMDgyNDcvYml0Y29pbi1oaXRzLTM5ay1hcy1idWxsaXNoLWV0Zi1vcHRpbWlzbS1ib29zdHMtY3J5cHRvLW1hcmtldNIBXWh0dHBzOi8vZGVjcnlwdC5jby8yMDgyNDcvYml0Y29pbi1oaXRzLTM5ay1hcy1idWxsaXNoLWV0Zi1vcHRpbWlzbS1ib29zdHMtY3J5cHRvLW1hcmtldD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Hits $39K as Bullish ETF Optimism Boosts Crypto Market - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin today hit $39,000 per coin for the first time April 2022.\n\nThe biggest digital coin by market capitalization was last sitting at that level before crypto project Terra collapsed in May 2022—which subsequently brought chaos to the digital asset ecosystem by plunging the price of every cryptocurrency and leading to a number of high-profile bankruptcies.\n\nAccording to figures from America's biggest crypto exchange Coinbase, Bitcoin hit $39,000 per coin at 11.30am Eastern Time.\n\nAD\n\nAD\n\nIt has since dipped and is now trading for $38,777, the same data shows.\n\nThe coin is up nearly 3% in the past 24 hours. Over the month, it has risen by more than 12%.\n\nBitcoin has attracted renewed interest from investors because a number high-profile Wall Street firms have applied to the U.S. Securities and Exchange Commission to release a spot Bitcoin exchange-traded fund (ETF).\n\nSuch an investment vehicle would give traditional investors exposure to the cryptocurrency in a safe and regulated way. Because of this, some analysts expect a capital to flood the digital asset market.\n\nBloomberg Intelligence analysts have said they expect the top regulator to approve one of the applications by January 10.\n\nAD\n\nAD\n\nAlso, this week, Federal Reserve governor Christopher J. Waller said that he was \"increasingly confident that policy is currently well positioned to slow the economy and get inflation back to 2 percent\"—leading investors with an appetite for risk-on assets to feel bullish.\n\nAt the start of the year, Bitcoin was trading for less that $17,000 per coin.\n\nBut it is still well below its November 2021 all-time high of $69,044 per coin.\n\nEdited by Stacy Elliott."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8wMi9iaXRjb2lucy0yMDIyLWJlYXItbWFya2V0LWRpZmZlcmVkLWluLW9uZS1jcml0aWNhbC13YXktY29tcGFyZWQtdG8taXRzLTIwMTgtc2x1bXAtY3J5cHRvLWFuYWx5c3QtamFtaWUtY291dHRzL9IBkwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMi8wMi9iaXRjb2lucy0yMDIyLWJlYXItbWFya2V0LWRpZmZlcmVkLWluLW9uZS1jcml0aWNhbC13YXktY29tcGFyZWQtdG8taXRzLTIwMTgtc2x1bXAtY3J5cHRvLWFuYWx5c3QtamFtaWUtY291dHRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin’s 2022 Bear Market Differed in One Critical Way Compared to Its 2018 Slump: Crypto Analyst Jamie Coutts - The Daily Hodl",
        "content": "Former Bloomberg Intelligence analyst Jamie Coutts says one metric shows a key difference between Bitcoin’s (BTC) bearish phases in 2018 and 2022.\n\nCoutts says that the number of BTC accumulation addresses soared in the 2022 bear market, while they decreased in the 2018 BTC market slump.\n\nAccording to Coutts, the increase in accumulation addresses indicates a stronger belief in the future of Bitcoin.\n\n“One of these Bitcoin bear markets is not like the other.\n\nAccumulation addresses (bought twice and never sold):\n\n2018: -20%\n\n2022: +60%\n\nConviction.”\n\nBitcoin is trading for $38,825 at time of writing, up 2.8% in the last 24 hours.\n\nAnother big difference in the crypto space over the past several years, says Coutts, is that there was a massive increase in daily active users (DAUs), which is the number of unique addresses transacting on a blockchain each day.\n\n“Crypto daily active users in layer-1s/layer-2s:\n\n2019: 200,000\n\n2023: 5,000,000\n\nFour-year CAGR (compound annual growth rate): 123%.\n\nLet’s see where this goes.”\n\nCoutts predicts that artificial intelligence (AI) technology will accelerate crypto adoption and help DAU soar to nearly 400 million in 2030.\n\n“Several key drivers are coalescing behind the re-acceleration of blockchain adoption as the technology steadily embeds itself into the fabric of our digital era. The role AI will play in the future of blockchain will be a major swing factor in that adoption arc.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: DALLE3"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9tYXJrZXQvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1zdXJnZXMtMi04Ny10by1pdHMtaGlnaGVzdC1sZXZlbC10aGlzLXllYXItMTE3MDE0MjkwMDU0NzAuaHRtbNIBeWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9tYXJrZXQvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1zdXJnZXMtMi04Ny10by1pdHMtaGlnaGVzdC1sZXZlbC10aGlzLXllYXIvYW1wLTExNzAxNDI5MDA1NDcwLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin surges 2.87% to its highest level this year | Mint - Mint",
        "content": "Bitcoin rallied to its highest price in 2023 as the cryptocurrency jumped 2.87% to a high of $38,834 on Friday. The surge in Bitcoin's value marks its peak since May 2022 just before the disruption of the TerraUSD stablecoin ecosystem, causing a ripple effect in the sector and initiating a gradual decrease in asset values. The second-largest token by market cap Ethereum is also doing well and is trading above the psychological benchmark of $ 2,000 with a price being $2,090.4 on 1 December.\n\nThe rally is seen across the cryptocurrency market with other popular coins like Dogecoin, and Polkadot also reporting gains. The recent rally has infused the investors with fresh confidence as institutional investors have also shown interest in the cryptocurrency. Recently MicroStrategy Inc., the foremost publicly traded corporate entity holding Bitcoin, acquired an additional $593 million worth of the cryptocurrency.\n\n130% rebound this year\n\nThe recent surge in Bitcoin has increased the chances of cryptocurrency hitting $40,000 by the end of December. The year 2023 has been great for Bitcoin as it rebounded about 130% following a challenging period for cryptocurrencies in 2022. As per Bloomberg News, the optimism around potential interest-rate reductions by the Federal Reserve in the coming year, coupled with the anticipation of the US permitting its inaugural spot Bitcoin exchange-traded funds, has contributed to a powerful combination of factors driving this positive trend.\n\n“In order to get to $40,000, we just need that approval for the spot Bitcoin ETF,\" Fiona Cincotta, senior financial markets analyst at City Index Ltd. told Bloomberg.\n\nAlso Read: This New BTC Alternative Is Sparking Interest Among Shiba Inu Holders\n\nAmid the optimistic sentiment around Bitcoin, Bloomberg Intelligence anticipates that a group of spot Bitcoin exchange-traded funds (ETFs) in the United States will secure approval from the Securities and Exchange Commission by January.\n\nMilestone Alert! Livemint tops charts as the fastest growing news website in the world 🌏 Click here to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGVjcnlwdC5jby8yMDgzMjEvZ3JheXNjYWxlLWJpdGNvaW4tZXRmLWFwcHJvdmFsLXdoZW4tbm90LWlm0gFKaHR0cHM6Ly9kZWNyeXB0LmNvLzIwODMyMS9ncmF5c2NhbGUtYml0Y29pbi1ldGYtYXBwcm92YWwtd2hlbi1ub3QtaWY_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Grayscale: Bitcoin ETF Approval Is a 'Matter of When, Not If' - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDigital asset manager Grayscale continues to say it's just a matter of time before a Bitcoin ETF is finally approved.\n\nThat includes the possibility that the digital asset manager will get approval from the U.S. Securities and Exchange Commission to convert its Grayscale Bitcoin Trust (GBTC)—currently an open-ended trust available on the OTCQX Market—into a spot Bitcoin ETF. If converted to an ETF, the firm is aiming to have the fund listed on the NYSE Arca exchange.\n\nAnd to that end, the firm asked Craig Salm, its chief legal officer, and Edward McGee, its chief financial officer, to address some common questions about the potential conversion.\n\nAD\n\nAD\n\n“We believe that regulatory approval of a spot Bitcoin ETF in the U.S. is a matter of ‘when,’ not a matter of ‘if,'\" Salm wrote in a company blog post today. Once approved, Grayscale “would immediately work with our partners to uplist GBTC to NYSE Arca,” he added.\n\nBut for every bullish Bitcoin ETF prediction, there's a caveat. Grayscale did not provide an expected timeline for GBTC’s conversion. “Timelines are inherently uncertain,” Salm said.\n\nSome ETF analysts have offered educated guesses about when the SEC might make a decision on pending applications. Bloomberg Intelligence analyst James Seyffart said he expects to see some movement from the SEC between Monday, January 8 and Wednesday, January 10.\n\nIn 2022, Grayscale filed a lawsuit against the SEC, claiming the Commission had been unfair in refusing to accept an application to convert the Grayscale Bitcoin Trust into an ETF. Being an ETF would allow the fund to perform simultaneous creations and redemptions of shares to trade in line with Bitcoin's real-time price.\n\nThere's been signs that Grayscale has been making progress. For starters, a judge decided in August that the SEC does need to accept the firm's application. In October, it became clear the SEC wasn't going to file an appeal to the decision and was then ordered to officially review the ETF bid.\n\nAD\n\nAD\n\nTo that end, a memo published by the SEC revealed that the SEC met with Grayscale CEO Michael Sonnenshein and McGee last month to discuss \"NYSE Arca, Inc.’s proposed rule change to list and trade shares of the Grayscale Bitcoin Trust (BTC) under NYSE Arca Rule 8.201-E.\"\n\nEven without being a spot ETF, GBTC already accounts for more than 3% of the total BTC supply. It currently trades at an 8% discount to its net asset value. But as Salm pointed out in the Grayscale blog post, converting to an ETF structure would allow Grayscale to “more closely track the price of Bitcoin.\"\n\nEdited by Guillermo Jimenez\n\nDisclaimer The views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMimAFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2JpdGNvaW4tbmVhcmx5LTIxLTAwMC1ibG9ja3MtYXdheS1mcm9tLWZvdXJ0aC1oYWx2aW5nLWJ0Yy1ob2xkZXJzLWF3YWl0LWFwcHJvdmFsLW9mLXNwb3QtZXRmLTIwMjMxMjAxMDYxMtIBnAFodHRwczovL3d3dy5meHN0cmVldC5jb20vYW1wL2NyeXB0b2N1cnJlbmNpZXMvbmV3cy9iaXRjb2luLW5lYXJseS0yMS0wMDAtYmxvY2tzLWF3YXktZnJvbS1mb3VydGgtaGFsdmluZy1idGMtaG9sZGVycy1hd2FpdC1hcHByb3ZhbC1vZi1zcG90LWV0Zi0yMDIzMTIwMTA2MTI?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 01 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin to hit $125,000 in 2024 according to Matrixport research - FXStreet",
        "content": "Halvings are typically considered bullish events as they slash the block reward in half for miners, constricting the supply of the asset. At consistent demand if the supply reduces, the asset’s price climbs. This has been observed in Bitcoin and Litecoin.\n\nMacroeconomic events like the US Federal Reserve’s decision on interest rates influence risk assets like Bitcoin, mainly through the direct impact they have on the US Dollar. An increase in interest rate typically negatively influences Bitcoin and altcoin prices, and vice versa. If the US Dollar index declines, risk assets and associated leverage for trading gets cheaper, in turn driving crypto prices higher.\n\nA hack is an event in which an attacker captures a large volume of the asset from a DeFi bridge or hot wallet of an exchange or any other crypto platform via exploits, bugs or other methods. The exploiter then transfers these tokens out of the exchange platforms to ultimately sell or swap the assets for other cryptocurrencies or stablecoins. Such events often involve an en masse panic triggering a sell-off in the affected assets.\n\nToken launches like Arbitrum’s ARB airdrop and Optimism OP influence demand and adoption among market participants. Listings on crypto exchanges deepen the liquidity for an asset and add new participants to an asset’s network. This is typically bullish for a digital asset.\n\nAlex RTB, analyst behind the X handle @rutradebtc reaffirms Kaleo’s prediction and argued that BTC is likely to hit the $40,000 target this week. The analyst identified an ascending triangle setup in the Bitcoin price chart, a bullish continuation pattern.\n\nMicroStrategy has acquired an additional 16,130 BTC for ~$593.3 million at an average price of $36,785 per #bitcoin . As of 11/29/23, @MicroStrategy now hodls 174,530 $BTC acquired for ~$5.28 billion at an average price of $30,252 per bitcoin. $MSTR https://t.co/hSEZyzGBsr\n\nInformation on these pages contains forward-looking statements that involve risks and uncertainties. Markets and instruments profiled on this page are for informational purposes only and should not in any way come across as a recommendation to buy or sell in these assets. You should do your own thorough research before making any investment decisions. FXStreet does not in any way guarantee that this information is free from mistakes, errors, or material misstatements. It also does not guarantee that this information is of a timely nature. Investing in Open Markets involves a great deal of risk, including the loss of all or a portion of your investment, as well as emotional distress. All risks, losses and costs associated with investing, including total loss of principal, are your responsibility. The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of FXStreet nor its advertisers. The author will not be held responsible for information that is found at the end of links posted on this page.\n\nIf not otherwise explicitly mentioned in the body of the article, at the time of writing, the author has no position in any stock mentioned in this article and no business relationship with any company mentioned. The author has not received compensation for writing this article, other than from FXStreet.\n\nFXStreet and the author do not provide personalized recommendations. The author makes no representations as to the accuracy, completeness, or suitability of this information. FXStreet and the author will not be liable for any errors, omissions or any losses, injuries or damages arising from this information and its display or use. Errors and omissions excepted.\n\nThe author and FXStreet are not registered investment advisors and nothing in this article is intended to be investment advice."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5taWQtZGF5LmNvbS9saWZlc3R5bGUvaW5mb3RhaW5tZW50L2FydGljbGUvYml0Y29pbi1jaXJjdWl0LWNyeXB0by10cmFkaW5nLXBsYXRmb3JtLXJldmlld3MtaXMtYml0Y29pbi1jaXJjdWl0LWxlZ2l0LXRvLXVzLTIzMzIyOTI50gGSAWh0dHBzOi8vd3d3Lm1pZC1kYXkuY29tL2FtcC9saWZlc3R5bGUvaW5mb3RhaW5tZW50L2FydGljbGUvYml0Y29pbi1jaXJjdWl0LWNyeXB0by10cmFkaW5nLXBsYXRmb3JtLXJldmlld3MtaXMtYml0Y29pbi1jaXJjdWl0LWxlZ2l0LXRvLXVzLTIzMzIyOTI5?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Circuit Crypto Trading Platform Reviews - Is Bitcoin Circuit Legit to Use? Read Hidden Truth Here! - mid-day.com",
        "content": "Have you ever heard of auto-rated trading software before? If No, then here in this article, you will get to know about it.\n\nBitcoin\n\nOverview\n\nAre you also knew to a Bitcoin trading platform? The Bitcoin technology was made for users to know the make of some cryptocurrency markets. This ultimately makes profitable trades for users in buying and selling activity. Very little technical is required in using the Bitcoin circuit, as it needs only to inform its users about some of the technology related to the cryptocurrency world. However, the bitcoin circuit is not to experience trading. We will talk about the fascinating facts related to the Bitcoin circuit ahead and read all the given information as soon as possible to share the realities of the cryptocurrency world. Bitcoin circuits have become such an excellent platform to trade together.\n\nADVERTISEMENT\n\nHave you ever heard of auto-rated trading software before? If No, then here in this article, you will get to know about it. The Bitcoin circuit has earned much attention from people in significantly little time. A few times, its craze and standards have risen to the following levels, but you know why and how? We have gathered some of the core information regarding this, which we will deliver beforehand. But before moving forward, knowing about cryptocurrency is very crucial. Have you ever tried to learn about these? If not, then as we know, cryptocurrency is a digital currency, which is a ''decentralized system'' whose work is to check or maintain records and also to do the verification of transactions.\n\nClick Here To Trade With Bitcoin Circuit For Free\n\nCryptocurrency is Digital Currency, too, because we can use it in both manners, as written below.\n\n1As Currency.\n\n2As Virtual Accounting System.\n\nWhat is Bitcoin Circuit?\n\nDo We have first to know what it is? It is used as a trading robot, and it deals with the world of trading. It provides an excellent platform for both types of traders; no matter what, it works for beginners and experts. It is known more because of its high returns policies. There is no other trading platform providing trading services as provided by the Bitcoin circuit.\n\nBeginners who start using it have more excitement levels due to its incredible source of earning in the exchange of some activities. The official website has said that Bitcoin plays a crucial role in the trading process. It helps in automated trading software. You can have a registration form to register for trading sessions; Crypto traders must take trading preferences on the Bitcoin Circuit website. Bitcoin circuit allows its users to go for more profitable deals while ensuring traders are not at a risky stage. The official site of the Bitcoin Circuit gives all the information and experience to start trading. Those trading on the Bitcoin circuit are more familiar with the software. Always try to create a trading account before entering the trading world so you won't have to face any risk. The app takes all the verification process to avoid falling into risk factors.\n\nUsers have also provided customer support on these platforms. Bitcoin circuit is designed to trade to extremely high profits. Once you grow to high levels, there will be many trading opportunities to reach a peak level. The day you start to trade on this platform, all the updates will be delivered through confirmation emails. The Bitcoin circuit doesn't consist of fake parties or brokers. Bitcoin circuit doesn't charge any fee to fool you or make you fall into scams.\n\nBitcoin is playing such a crucial role in making trading more exciting and easier; on the other hand, if we see more about the bitcoin circuit, it doesn't get stuck or freeze your money for a long time; whatever you profited by cash will be transferred to your account safely that is why ''Bitcoin circuit'' is known to be the best trading source. Bitcoin circuit is also can vary, ranging from 10 minutes. Bitcoin circuit also contains international AML and KYC policies.\n\nSome Tips for Trading:\n\nI want to let you know the facts and basics for trading through Bitcoin Circuits. Please read the necessary things written below to avoid the risk of losing money and to have a high rate and standard profit value with cryptocurrency trading. While in the starting trading phase, please ensure the value is less to invest in Bitcoin platforms.\n\n1Do not try to trade at risk or over capacity.\n\n2Always withdraw your profit from the account once you get it.\n\n3Use the stop-loss method.\n\n4Deal with mind and full attention.\n\n5If beginners go for moderate investments.\n\n6Always trade according to cryptocurrency market conditions.\n\nClick Here To Trade With Bitcoin Circuit For Free\n\nReviews of Bitcoin Circuit:\n\nIt is one of the main reasons given to convince new investors that trading with automated cryptosystems, such as Bitcoin Circuit, is best is that the trading robots are more accurate than manual trading systems. It cannot be denied that from a logical perspective, trading robots are much better no matter how we look at the situation. Could you read more things related to Bitcoin circuit trading?\n\nIs it a scam? Well, Bitcoin Circuit is safe technology. However, it is essential to know that it is a trading tool used only for trading purposes, primarily used by people who see the cryptocurrency, and experienced traders also use it.\n\nIf you have yet to use it, you must read ahead to know how it works. Bitcoin circuits show us the exact analysis based on daily investment pay outcomes. The trading platform allows you to trade using a demo account before trading with real money. Bitcoin was created in 2009, but it has ripped the trading levels so high. The trading platform will give you some signals known as trading signals, and you are only required to deposit a minimum value, which you will use when you start to trade on the live account. Many users have earned a considerable amount of money daily using Bitcoin Circuit. The best thing about this is it is a trustable Bitcoin circuit platform.\n\nKnow facts about how the technology works:\n\nThe technology runs with an automated trading system, which performs trades on behalf of the user after analysing the cryptocurrency market.\n\nFirst of all, a good deal is detected, then the technology finishes all the trade by using the money deposited into the account, and by continuing this, the traders grow in such a way.\n\nThe cryptocurrency market is competitive and volatile in the trading world. It is essential to know that only some trades will get the maximum profits. Luckily, Bitcoin Circuit is getting more famous for its effectiveness. Those traders who have used it before now have a good amount of money simply by trading with Bitcoin.\n\nHow much money is it possible to make with the Bitcoin Circuit?\n\nThis is one of the most important, and most asked questions till now: how much can we earn through this Bitcoin circuit? To understand this in more detail, we must depend on the money invested in trading. Users also face live trading to grow in the trading world. You must register to the official Bitcoin circuit account first to start experiencing the Bitcoin circuit trading app. You can use the demo account to buy bitcoins. The Bitcoin Circuit website also has everything you need to know. Bitcoin circuit provides a truly fantastic experience with the crypto industry. Crypto robots are also present in these trading apps to have automated algorithmic programs. The official Bitcoin circuit website allows users to execute trading strategies. Bitcoin circuit takes almost one day in transaction money.\n\nThis is to let you all know that the money you profit with trading time is the ratio of potential profit that can also be activated or generated. Most of the time profits come in some amount for daily basis. It requires various ways of tests to verify its validity. Through this website, the Bitcoin Circuit usually makes trading easy. You will be able to trade and profit.\n\nClick Here To Trade With Bitcoin Circuit For Free\n\nBenefits of using Bitcoin Circuit?\n\nThere are so many benefits of using the Bitcoin circuit in the trading world, and we are reading this article to learn exciting things about it. Some of the genuinely beneficial facts of these are written below:\n\n1It asks for high trading, suitable for experienced users.\n\n2The Bitcoin circuit gives the best investment advice.\n\n3Emotionless or emotion-free trading.\n\n4It also helps in reading the latest trading signals, and it also decides prompts during the time of trading.\n\n5the app is user-friendly; this app includes artificial intelligence to generate or improve qualities. This also helps users in buying and selling.\n\nIt also works in robots' advanced algorithms and has proven to be the best Auto trading platform. It offers the user for fast and high levels of trading. Leverage trading and margin trading are also present in the Bitcoin circuit. It allows users to maintain trading by following two things.\n\n1A loss tool is present in leverage trading.\n\n2Take profit tool is also there.\n\nMost Frequently Asked Questions [FAQs]\n\nQ: Is the Bitcoin circuit safe?\n\nA: All your questions will be answered; most people are scared, but using the Bitcoin circuit is not a scam. If you are a beginner, try to start with less to go high-profit levels.\n\nQ: Can we withdraw the profit?\n\nA: Yes, this allows us to withdraw the money we earned in the trading; it doesn't take much; it takes almost one day or less than 24 hours to start cash to your account once you get profited.\n\nQ: How much profit can I make by using Bitcoin Circuit?\n\nA: The value of profit is directly dependent on the investment you make while starting trading; it is research analysis that you will probably get up to 12% of the profit daily. However, it is not that confirmed or fixed value. Consider starting trade with a lower value so that it slowly grows to up levels.\n\nQ: What is the minimum value of depositing at Bitcoin Circuit?\n\nA: The minimum value we can invest in starting trading on the Bitcoin circuit is $250. However, experienced traders invest a very high amount, but more is needed for new users as it requires some trading experience to get high profits.\n\nClick Here To Trade With Bitcoin Circuit For Free\n\nConclusion:\n\nAs in this article above, we have seen that using Bitcoin is unique in the trading world, and because of it, people are getting help in earning money. Bitcoin Circuit is a trading platform that uses automated trading technology to execute trades for users. It claims to be able to generate returns of up to 12% per day, but this is not guaranteed. The minimum deposit is $250, and users can withdraw their profits anytime. Bitcoin Circuit is a safe and fair trading platform, but it is essential to remember that it is a trading tool and not a get-rich-quick scheme. Also, it is indispensable to keep yourself away from the broker. Bitcoin traders can log in to the official website of the Bitcoin circuit on any device.\n\nDue to Crypto trading, people have become rich. In the world of trading loves to use, Cryptocurrencies also trade Bitcoin. Your profit will come to follow trading strategies. Also, the Bitcoin circuit offers flat currencies, and you can make trading decisions with the parties for high profits.\n\nDisclaimer: The views and opinions expressed in this sponsored article are those of the sponsor/author/agency and do not represent the stand and views of Mid-Day Group.Mid-Day Group disclaims any and all liability to any party, company or product for any direct, indirect, implied, punitive, special, incidental or consequential damages arising directly or indirectly from the use of this content."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYm9sZC5jb20vYnJlYWtpbmctZG93bi10aGUtYnVsbGlzaC1hbmQtYmVhcmlzaC1jYXNlcy1mb3ItYml0Y29pbi1pbi0yMDI0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 02 Dec 2023 08:00:00 GMT",
        "title": "Breaking down the bullish and bearish cases for Bitcoin in 2024 - Finbold - Finance in Bold",
        "content": "In anticipation of a potential bull market, investors often become engrossed in a narrative, sometimes overlooking the importance of considering alternative scenarios.\n\nThe 90% chance of spot Bitcoin exchange-traded funds (ETF) approval in January, according to Bloomberg analysts, and the halving event have been major points of discussion within the crypto community. However, short-term pullback and a price correction of BTC are also possible scenarios to consider.\n\nBullish case\n\nBTC has “left behind depression and disbelief to enter the next stage: Hope,” the second stage of the halving cycle according to renowned crypto investor CryptoCon.\n\n“After a long period of despair, [BTC] price starts to show some signs of making a turnaround,” he added on X.\n\nBitcoin’s protocol reduces the reward for mining new blocks by half approximately every four years, an event known as “halving.” This reduction in new supply tends to create upward pressure on the price as the rate of new Bitcoin entering the market slows down.\n\nFollowing a halving, the reduced supply often leads to a bull market characterized by rising prices and increased investor interest.\n\nHalving Cycles Theory Sine Waves. Source: CryptoCon\n\nInvestors are currently in the ‘Hope’ phase of the cycle, according to the analyst. This means that people are starting to believe in Bitcoin again after long despair, and the price of Bitcoin has started to show signs of recovery, and it is now trading at fair value, he highlights. The next phase of the cycle is ‘Belief’.\n\nThis is when investors will start believing in Bitcoin, and the price will rise rapidly. This phase is expected to begin in June 2024 and last for about two years. The final phase of the cycle is ‘Red Year’, when the price of Bitcoin will reach its all-time high and then crash. This phase is expected to start in June 2026 and last for about one year, according to the expert.\n\nBearish case\n\nThe halving event has historically triggered a correction in Bitcoin’s price before rallying, highlights a crypto analyst AlanSantana in a TradingView post. As the prices rise, the market can become overextended, leading to a bear market where prices fall and investor sentiment becomes negative.\n\nBitcoin price analysis chart by AlanSantana. Source: TradingView\n\nThe expert also cautioned against the excessive hype surrounding the spot Bitcoin ETF, drawing parallels with past events like the Ethereum Merge. He suggested that intense hype often precedes bearish outcomes.\n\n“They say billions and billions and billions and billions and more will be coming in due to these ETFs, really? Here is the thing, these ETFs, these “conventional trading vehicles” are not going to be selling Bitcoins to their clients; they are going to be selling shares, coupons, digits on a screen or what not. If they need Bitcoins, they are buying it now or bought them long ago to later use as back-up for their customers funds,” wrote AlanSantana\n\nFurthermore, Bitcoin is currently trading at $37,727, which is very close to the upper ‘Bollinger Band’, according to EliteTradingSignals, a prominent crypto trader. This indicates that the pair is overbought and may be due for a pullback.\n\nBitcoin price analysis chart by EliteTradingSignals. Source: TradingView\n\nThe fact that the one-week timeframe (TF) is green is a counter-signal, which indicates that there is a chance that the price could continue to rise in the long term. However, the short-term overbought condition suggests that a pullback is more likely, wrote the expert.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]