[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vbmV3cy93aGF0LXBhdWwta3J1Z21hbnMtcHJvYmxlbS1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "What Is Paul Krugman's Problem With Bitcoin? - Investopedia",
        "content": "Paul Krugman is a Distinguished Professor at the City University of New York Graduate Center and a winner of the Nobel Memorial Prize in Economic Sciences. He is published regularly in the New York Times and is known for his skepticism of cryptocurrency and blockchain.\n\nKey Takeaways Nobel laureate economist Paul Krugman has never been a fan of Bitcoin or cryptocurrency.\n\nKrugman argues that these digital tokens serve no economic purpose and that their valuation is tenuous.\n\nWhether or not Bitcoin is genuinely a bubble remains to be seen, but many prominent thinkers strongly disagree with Krugman's position.\n\nUnderstanding Paul Krugman's Position\n\nPaul Krugman bases his opinions and stance on cryptocurrencies on his years of economics study, teaching, and expertise.\n\nIn a 2018 New York Times op-ed titled \"Transaction Costs and Tethers: Why I'm a Crypto Skeptic,\" crypto-skeptic Paul Krugman wrote:\n\n“What problem does this technology solve? What does it do that other, much cheaper and easier-to-use technologies can’t do just as well or better? I still haven’t heard a clear answer.\"\n\nThe Nobel Prize-winning economist's sentiments haven't changed much since the 2018 op-ed he filed from vacation in Europe, a result of his pondering of bitcoin and blockchain while \"hiking and biking in various parts of Europe.\"\n\n\n\nThat year, he stated that it set the monetary system back by 300 years when gold was the primary form of exchange and that there didn't seem to be a clear upside to this regression. Krugman still made the claim three years later:\n\n\"Because Bitcoin and its relatives haven’t managed to achieve any meaningful economic role, what happens to their value is basically irrelevant to those of us not playing the crypto game.\"\n\nMultiple Strikes Against Bitcoin?\n\nThroughout his published op-eds, Krugman describes why more caution and regulation are needed for Bitcoin and cryptocurrency.\n\nCosts\n\nThe transaction costs for gold are high because it's heavy and bulky and is considerably expensive to store. Fiat currencies incur lower, but still significant, transaction costs because they are paper-based. Subsequent shifts towards checks and credit and debit cards have further decreased the need and costs for paper-based currency.\n\nIn turn, this has led to them being widely adopted by countries around the world. That they are widely accepted provides further impetus for their use. In contrast, bitcoin has significant transaction costs in the form of its energy requirements. It is also not widely accepted, and that further increases the costs required to conduct practical commerce using Bitcoin.\n\nLack of Tethering\n\nBitcoin has a lack of tethering capability. In practical terms, this means there are no real backstops available to it as they are to paper money and gold. Government backing provides credibility to paper money. Gold has practical applications in jewelry and industry, which provide \"a weak but real tether to the real economy.\"\n\nBecause of its digital and stateless nature, bitcoin has neither a physical application nor a central authority to vouch for its status as a medium of exchange. \"If speculators were to have a collective moment of doubt, suddenly fearing that Bitcoins were worthless, well, Bitcoins would become worthless,\" writes Krugman.\n\nIn a June 2021 op-ed, along with the opinion that stablecoins like TerraUSD start as a way to keep third parties out of transactions but eventually end up needing them to operate as a stablecoin, Krugman furthered his stance on a lack of tethering, pointing to TerraUSD's loss of its peg to the dollar and eventual collapse. As it turns out, the only way to truly be stable, pegged, or tethered is to hold an amount of currency (or an equal value of property) equal to the total intended value of the cryptocurrency (such as $1,000 for 1,000 tokens).\n\nIt's a Bubble\n\nTo be sure, Krugman has maintained a steady position against Bitcoin. In 2018, Krugman said that the cryptocurrency was an obvious bubble. He said its prices were rising because \"Early investors in a bubble make a lot of money as new investors are drawn in, and those profits pull in even more people. The process can go on for years before something—a reality check, or simply exhaustion of the pool of potential marks—brings the party to a sudden, painful end.\"\n\nNo Hard Evidence to Oppose His Opinions\n\nHe has argued in a similar manner in more recent op-eds, reiterating his belief that Bitcoin is a scam, bubble, and designed by people who don't understand the fundamentals of a fiat currency system. Many of his opponents respond with, in his words, \"technobabble,\" which doesn't offer any oppositional evidence. Some of his main points over the years are:\n\nPonzi and pyramid schemes excel where there is a strong narrative, and Krugman believes that the \"narrative\" is where crypto \"really excels.\"\n\nBitcoin has turned out not to be inflation-proof.\n\nMost investors buy cryptocurrencies through exchanges, which take their money and hold their keys for them, creating the need for trust in a financial environment designed to dispel the need for trust.\n\nCryptocurrency has only gained its status through association with institutions and individuals playing on their trustworthiness.\n\nWhat Is Paul Krugman's Theory? Paul Krugman won his Nobel Prize for disputing that countries produce different goods due to their different circumstances. He claimed that economies of scale meant similar countries producing similar products dominate world trade.\n\nWhere Did Paul Krugman Go to College? Paul Krugman earned his Ph.D. in economics from MIT and his bachelors from Yale.\n\nWhat Awards Has Paul Krugman Won? Most notably, he has won the Nobel Memorial Prize in Economic Sciences and the John Bates Clark Medal. Other awards include the Adam Smith Award, the Howland Memorial Prize, and the H.C. Recktenwald Prize in Economics from the University of Erlangen-Nuremberg.\n\nThe Bottom Line\n\nPaul Krugman is a well-respected and award-winning economist with a strong stance against Bitcoin and cryptocurrency adoption and use. He makes many excellent and concerning points in his op-eds that are contested by cryptocurrency fans and investors and lauded by other skeptics.\n\n\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info. As of the date this article was written, the author owns small amounts of bitcoin and litecoin."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1jb3VsZC1zb2FyLXRvLXRoaXMtbGV2ZWwtaW4tdGhlLWZpcnN0LXllYXItb2YtaXRzLWJ1bGwtcnVuLWFjY29yZGluZy10by1jcnlwdG_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Could Soar To This Level In The First Year Of Its Bull Run, According To Crypto Analyst Michael Van De Poppe - Nasdaq",
        "content": "Popular cryptocurrency analyst Michaël van de Poppe has updated his outlook on Bitcoin (CRYPTO: BTC) ahead of the expected approval of BlackRock Inc.'s (NYSE:BLK) spot Bitcoin exchange-traded fund (ETF).\n\nWhat Happened: According to van de Poppe, Bitcoin has almost entered its first year of bull run, after spending one year in the bear market territory and one year in the accumulation phase.\n\n\"We've witnessed a one-year bear market. We've witnessed the one-year accumulation. And now we're getting ourselves into the period of the first year of the bull cycle,\" van de Poppe said in his latest note.\n\nSee Also: Bitcoin’s Current Uptick Just The Start, Benzinga Pinpoints 3 Major Catalysts Ahead\n\nBitcoin has surged over 38% in the last month alone, crossing the $37,000 mark, so the question among investors and traders who have missed out on the rally is whether now is a good time to buy Bitcoin.\n\nGoing by van de Poppe's analysis, the Bitcoin rally still has legs — he said that there is still a potential upside of nearly 50% from the existing level of $37,000.\n\n\"Most likely, the high is going to be around $50,000 to $55,000,\" he said.\n\n\"At this point, the confirmation of the bear market to be over is almost close to 100%, especially with the breakout of $28,000 and holding the 200-week EMA (exponential moving average) for Bitcoin,\" he explained.\n\nAccording to van de Poppe's charts, one Bitcoin cycle is spread across four years: one-year bear market, one-year accumulation and a two-year bull run. With the bear and accumulation phases now over, van de Poppe believes there are two years of Bitcoin bull run ahead of us.\n\n\"Coming two years are going to be great,\" van de Poppe said.\n\nMy friends, buy the dips.Coming two years are going to be great.\n\n— Michaël van de Poppe (@CryptoMichNL) November 10, 2023\n\nAnother factor that is playing into the recent strength in the king of crypto is the Bitcoin halving event, anticipated to take place in 2024.\n\nThis will halve the rewards for mining new blocks of Bitcoin, reducing the rate at which new Bitcoins are mined. This will, in turn, create scarcity and lead to a price appreciation.\n\nThe confluence of spot Bitcoin ETFs, Bitcoin halving event and a perceived undervaluation are all pointing at a potential bull run ahead, even though crypto critics like Peter Schiff are not convinced.\n\nRead Next: Welcome To ‘The Acceleration Phase’: Analyst Predicts An 88% Increase For Bitcoin\n\nPhoto by 99Art on Shutterstock\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmZyZWVwLmNvbS9zdG9yeS9tb25leS9idXNpbmVzcy8yMDIzLzExLzExL21pY3Jvc29mdC1yZWFjaGVzLWZyZXNoLWFsbC10aW1lLWhpZ2hzLXBsdXMtYml0Y29pbi1yYWxsaWVzLzcxNTAxMDg3MDA3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Microsoft reaches fresh all-time highs, plus Bitcoin rallies - Detroit Free Press",
        "content": "Benzinga\n\nWall Street's tech giants continued to extend their gains in the week following the Federal Reserve’s November meeting. The Nasdaq 100 once again outperformed other major indices, driven by the Magnificent 7, which includes artificial intelligence winners and tech stocks with the highest market capitalization, such as Apple, Microsoft, Alphabet, Amazon, Meta Platforms, Nvidia and Tesla.\n\nThe Dow's blue-chip stocks stalled, while small caps plummeted, retracing more than half of the previous week's gains. Energy was again the weakest performer among sectors.\n\nMicrosoft hot on Apple's trail\n\nThe tech giant Microsoft reached a new all-time high, surpassing $367 per share on Friday, solidifying its position as a major AI winner. Microsoft’s market capitalization has now reached $2.73 trillion, trailing Apple's by just $150 billion.\n\nBitcoin now worth more than Tesla\n\nBitcoin marked its fourth consecutive week of gains amid reports the SEC has initiated talks with Grayscale regarding its application to transform its GBTC trust product into a spot Bitcoin exchange-traded product. The total value of all outstanding Bitcoin crossed the $750 billion mark, surpassing Tesla’s market capitalization.\n\nBlackRock set to launch Ethereum ETF\n\nThe world's largest asset management firm, BlackRock, signaled interest in launching an Ethereum exchange-traded fund on Thursday, a bullish sign for the digital assets space.\n\nFed's caution snaps stocks' win streak\n\nA relatively hawkish speech from Federal Reserve Chair Jerome Powell on Thursday ended the U.S. stock market's longest daily winning streak in over two years. The setback came when Powell suggested that while the Fed is in no hurry to raise interest rates as inflation cools, he did not rule out another hike. He said there is still a substantial distance to cover to achieve the 2% target.\n\nDueling economic outlooks\n\nNotable investment firms published their economic outlooks for 2024 this past week. While Goldman Sachs still foresees a well-above-consensus growth for the U.S. economy, Wells Fargo presents a rather pessimistic outlook.\n\nWalt Disney's latest quarter results have a bright side\n\nDisney reported fourth-quarter (fiscal year 2023) revenue of $21.24 billion, a 5% year-over-year increase, albeit falling short of Street expectations. The company's earnings per share of 82 cents surpassed the Street consensus estimate of 70 cents per share. Morgan Stanley analyst Benjamin Swinburne reiterated the stock should perform better in the future.\n\nThe week ahead\n\nAll eyes will be on the consumer price index report for October, scheduled for release Tuesday. Economists anticipate that core inflation will hold steady at 4.1% year-on-year.\n\nOn Wednesday, the highlights will include the producer price index and retail sales data. Additionally, several Federal Reserve speakers are expected to provide insights throughout the week.\n\nMore:Lower income workers face a big challenge for retirement. What's keeping them from saving\n\nMore:Apple Pay, Venmo, Google Pay would see more regulation under proposed rule from feds\n\nAmong the mega-cap U.S. companies scheduled to announce earnings next week are Home Depot on Tuesday, Cisco Systems on Wednesday and Walmart and Applied Materials on Thursday.\n\nBenzinga is a financial news and data company headquartered in Detroit."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzExL2Nhbi1iaXRjb2luLXJlYWNoLTEwMDAwMC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Can Bitcoin Reach $100,000? - The Motley Fool",
        "content": "After a disappointing 2022, Bitcoin (BTC -4.31%) is having a remarkable bounce-back year, as its price has skyrocketed 115% in 2023 (as of Nov. 10). Nonetheless, this leading cryptocurrency remains 47% below its all-time high price.\n\nBut with Bitcoin experiencing strong momentum in recent weeks, investors probably have their eyes set on a new milestone. Can this top digital asset reach $100,000, which translates to a roughly 170% return from today's price?\n\nHere's why I think that's a real possibility.\n\nUpcoming catalysts\n\nThe current period is rare in that it's a time when Bitcoin could benefit from three potential catalysts in the near term, all of which could propel its price to new heights. The first one is what's on everyone's mind these days, and that's the pending approvals of spot exchange-traded funds (ETFs). A long list of major asset management firms, like BlackRock, Fidelity, and WisdomTree, among others, have all filed applications with the Securities and Exchange Commission (SEC), with a hard deadline for a decision coming in January 2024.\n\nNot only would this place a stamp of approval on Bitcoin, making it a legitimate financial asset that leading traditional financial companies are involved with, but it would provide a convenient, regulatory-friendly way for many investors to gain exposure to Bitcoin's price without having to directly own the digital asset. It's not hard to see Bitcoin's price surging should the SEC approve these applications.\n\nThe other potential catalyst is a more accommodative central bank. For the last year and a half, the Federal Reserve has aggressively hiked interest rates to combat inflation, and this policy stance might continue. However, should Fed Chair Jay Powell and his team believe that they are making serious progress toward taming inflation, then perhaps they will not only pause rate increases but start to lower them sometime next year.\n\nLooser monetary policy is typically a boon for risky assets like stocks and Bitcoin. With interest rates lower, investors are willing to take on more risk to achieve a certain level of return. And this could draw more capital toward Bitcoin.\n\nWhile these first two catalysts aren't certain to happen, the next one is. Bitcoin's inflation rate gets cut in half roughly every four years. This is called a halving. The next halving is expected to happen in April 2024, at which point Bitcoin's new supply schedule will give it a much lower annual inflation rate than gold. This is important because demand that has trended higher over time, coupled with a reduced supply, should lead to a rising price.\n\nBitcoin's history tells this same story. In the months leading up to a halving, through the months following this event, the digital asset's price has entered a strong bull market. This means now is one of the best times to be a buyer.\n\nEven more impressive, despite its volatility, Bitcoin has always managed to eclipse its previous high to reach a new one. Of course, past results aren't indicative of future returns, but if history is any indication, there's a good chance that Bitcoin could hit $100,000 in the next few years.\n\nSize accordingly\n\nIt's easy to get bullish on Bitcoin, but investors should first assess their own risk tolerance before adding it to their portfolios. A tiny allocation (maybe 1%) might be a good place to start.\n\nThen, over time, the goal should be to continue learning more about Bitcoin and its unique characteristics, and track the catalysts I discussed above. If you become more comfortable and your knowledge expands, then it could be a smart idea to allocate more capital to Bitcoin. Don't forget that it's critical to maintain a long-term mentality."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kZW1hbmQtZm9yLWJpdGNvaW4tZ3Jvdy1ieS0xMC14LW1pY2hhZWwtc2F5bG9y0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Demand for Bitcoin could grow by up to 10x within 12 months: Michael Saylor - Cointelegraph",
        "content": "With the Bitcoin halving just months away, MicroStrategy co-founder and Bitcoin (BTC) bull Michael Saylor thinks that demand for BTC could grow by as much as 10x by the end of 2024.\n\nDuring a speech at the 2023 Australia Crypto Convention on Nov. 10, Saylor was asked to give his outlook for Bitcoin and its ecosystem over the next four to five years.\n\nIn response, Saylor initially gave a rundown on the period between 2020 and 2024, noting that Bitcoin went from being seen as an “offshore unregulated asset” to an “institutionalized mainstream app.”\n\nHoning in on the near term, Saylor said that BTC will become an “adolescent mainstream asset by the end of 2024,” as he highlighted key dynamics surrounding supply and demand that will soon come into play:\n\n“I think that this next 12 months is going to be big. Because demand [on a monthly basis] should double or triple or maybe go up by a factor of 10, anywhere from two to 10. [...] and the supply available for sale will be cut in half in April.”\n\n“So, instead of a billion dollars of Bitcoin available for miners each month, it will be half a billion. It’s pretty unprecedented that you would go from a supply-and-demand balance of maybe $15 billion of organic demand and $12 billion of organic supply. What happens when one doubles and the other one cuts in half? The price is going to adjust up,” he added.\n\nSpeakers at the Melbourne-based event. Source: Australian Crypto Convention\n\nSaylor went on to describe the next 12 months for Bitcoin as its “coming out party” as the asset graduates from “college” and heads out into the real world.\n\nLooking at 2024–2028, Saylor predicted that Bitcoin will continue to be in a high-growth stage as adoption spreads across the big tech industry and mega banks worldwide, with both sectors integrating Bitcoin into their products and services.\n\nSaylor also said he expects to see a lot of competition among companies like Apple and Meta to get their hands on BTC to eventually sell for major profits.\n\n“You’re going to have ferocious competition and will among Wall Streeters to get the most asset share, and you’re going to have crypto exchanges competing, and you’re going to have other tech companies getting involved. [...] That’ll be one check.”\n\n“The other check will be when the big mega banks or Bitcoin custodians with JPMorgan, Morgan Stanley, Goldman Sachs, Bank of America, Deutsche Bank, and, you know [...] when they’re making loans and giving mortgages and customizing it and buying and selling it. I think that’ll be the second check,” he added.\n\nLooking even further into the future, at around 25 years down the road, Saylor outlined some lofty predictions for the future of Bitcoin, as he emphasized that BTC will blow any other high-quality asset out of the water.\n\n“When it hits that terminal growth rate, maybe 20 years out, maybe 25 years, or it’ll be growing twice as fast or compounding twice as fast as the S&P 500 Index, or any other diversified, high-quality portfolio of assets you could buy,” he said, adding:\n\n“So, if you think about it like that, you just say, well [...] now we’re going to double; we’re going to double again; we’re going to double again; and we’re going to double again, that coin is going to continue to progress to a million dollars a coin, $2 million a coin, $5 million a coin, $10 million a coin.”\n\nMicroStrategy currently holds around 158,400 BTC, and the firm was up around $900 million on its investment as of Nov. 2.\n\nMagazine: Recursive inscriptions — Bitcoin ‘supercomputer’ and BTC DeFi coming soon"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYyNzI2L2hhY2tlcnMtY2xhaW0tdG8taGF2ZS1jb21wcm9taXNlZC1iYW5rcnVwdC1iaXRjb2luLWF0bS1maXJtLWNvaW4tY2xvdWQtcmVwb3J00gF1aHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjYyNzI2L2hhY2tlcnMtY2xhaW0tdG8taGF2ZS1jb21wcm9taXNlZC1iYW5rcnVwdC1iaXRjb2luLWF0bS1maXJtLWNvaW4tY2xvdWQtcmVwb3J0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Hackers claim to have compromised bankrupt Bitcoin ATM firm Coin Cloud: Report - The Block",
        "content": "An unidentified hacking group claims to have stolen 70,000 customer selfies and sensitive personal information for 300,000 customers of Coin Cloud, a Bitcoin ATM firm which operated over 4,000 machines in the U.S. and Brazil until its bankruptcy filing this February. The hacking group also claims to have stolen the source code to Coin Cloud's backend system, according to a post on X from cybersecurity expert vx-underground.\n\nThe post includes redacted images, purportedly depicting the customer selfies and personal identifying information the group has accessed, which includes the Social Security numbers of customers along with their name, address, date of birth, occupation, phone number, and more, according to the report.\n\nVx-underground told The Block that the unidentified hacker was sharing the claims in private channels and that the leaked database may be posted online soon. Coin Cloud could not immediately be reached for comment.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nCoin Cloud filed for bankruptcy in February following \"business difficulties and legal problems\" resulted in losses of $40 million over the first nine months of 2022, its former CEO told the Wall Street Journal."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5iYXNlLmNvbS9pbnN0aXR1dGlvbmFsL3Jlc2VhcmNoLWluc2lnaHRzL3Jlc2VhcmNoL21vbnRobHktb3V0bG9vay9tb250aGx5LW91dGxvb2stbm92LTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Why an ETF matters - Coinbase",
        "content": "Introduction Spot bitcoin exchange-traded funds (ETFs) have the potential to widen crypto access to a new class of investors, including registered investment advisors (RIAs), retirement funds and other institutions that have historically been precluded from this asset class. However, we do not think ETFs alone will drive the narrative that defines bitcoin adoption in the long run. ETFs may be the vehicle, but the context matters. Compared to other safe haven assets like gold, for example, bitcoin’s network driven utility and inelastic supply distinguish the token from other assets. These attributes are why bitcoin can help diversify portfolios from a systematic risk perspective. Still, the impact of one or more spot bitcoin ETF approvals are significant, as it will open up a massive opportunity for the wealth management community, which handles over a third of all wealth in the US. These are not market participants that would otherwise buy and custody bitcoin independently, but instead rely on ETFs to build their unique investment strategies. Moreover, we think ETFs can potentially lead to new financial products (like lending and derivatives) that could use regulation- and compliance-friendly ETFs as their underlying. This may redefine the market structure around how crypto assets are bought, sold and/or exchanged. In the long run, this means spot bitcoin ETFs could add billions of dollars to the total crypto market cap as well as spark new potential investments for the asset class. While this will take time, we expect ETFs to lay the foundation for a more regulated environment, greater inclusion and a material growth in demand.\n\n‘Wen’ ETF? In our view, chances have sharply improved that one or more spot bitcoin ETFs may be approved by the US Securities and Exchange Commission (SEC) before the end of 4Q23. ( See footnote 1 .) Typically, the SEC extends its decision window to the furthest extent allowed by its regulatory framework, which in this case would be the final deadline of January 10, 2024 for the ARK-21Shares Bitcoin ETF application. However, the current timeline has been complicated by gridlock in the US House of Representatives. A potential government shutdown on November 17 would furlough over 90% of SEC staff. As a result, we think there is currently an open window for the SEC to be proactive in their decision making. In recent weeks, we’ve seen a number of applicants amend their prospectuses with updated language, suggesting meaningful dialogue between these teams and the SEC. Although this is commonplace for such applications in other asset classes, this is a first for crypto, according to Bloomberg Intelligence . That seems to be driving up market expectations for one or more approvals, boosting investor appetite for bitcoin risk. The conversation around spot bitcoin ETFs in the US has been around since at least 2013, but for years, the SEC has not approved any proposals citing concerns surrounding market manipulation, surveillance-sharing arrangements and liquidity. Two things have changed this year. First, a number of high-profile financial institutions including BlackRock, Invesco and Franklin Templeton launched spot bitcoin ETF applications (see table 1). Second, a federal court sided with investment firm Grayscale after it sued the SEC for rejecting an application to convert its Grayscale Bitcoin Trust (GBTC) to an ETF.\n\nAll that glitters is not gold Spot bitcoin ETFs have the potential to grow the crypto market by reducing the frictions that would otherwise prevent capital from flowing into the asset class. Many users compare the current situation to the gold market and the ostensibly transformative launch of the first gold ETF in the US (see our previous monthly outlook). The SPDR Gold Shares ETF (GLD) was launched in October 2004 and expanded access to the gold market for many US clients who could not easily acquire or store physical gold. Crypto pundits see this as a sympathetic analogue for bitcoin. However, the reality is that North American gold ETFs today represent less than 0.8% of the total gold supply, according to the World Gold Council . ( See footnote 2 .) We think their direct influence on the precious metals market may be somewhat overstated. For example, the GLD ETF attracted over $4.8B in net flows in its first year (inflation-adjusted to 2023 dollars), which is meaningful. But inflows didn’t really take off until during the global financial crisis in 2008 through 2012, during which time GLD’s AUM growth outpaced the rise in the broader gold market cap. We believe that more Americans sought umbrage in gold as a hedge against economic instability compared to residents in other regions, given that the US was the initial focal point for that crisis. By contrast, GLD’s AUM has fallen from its 2020 peak during the post-pandemic era, despite the total gold market cap rising over the same period. We believe this is due to buying from global central banks (ex-US) amid concerns over rising geopolitical tensions and the weaponization of global finance. While the launch of gold ETFs in the US was a significant event that allowed broader adoption of the precious metal, we do not believe that it alone was the defining catalyst that fundamentally changed the gold market. Context matters. Whether it’s gold or bitcoin, granting users access is undeniably important. However, what drives flows are the narratives that reinforce the unique characteristics of these assets in the context of changing market conditions. (See previous month outlook for more details on table 2 above.)\n\nWhat makes bitcoin different An important difference between bitcoin and gold is that bitcoin supply is much less elastic, with a fixed supply schedule. We think this point is underappreciated, as theoretically more gold can be mined to meet demand when prices rise, but the same can't necessarily be said of bitcoin. Moreover, bitcoin is a growth story. The utility of the bitcoin network expands in relation to the number of users using the network, which directly contributes to the value of the token. Comparatively, there are often no growth aspirations for buying gold. Both those factors mean that bitcoin can occupy an altogether distinct role in portfolios from a systematic risk perspective. Consider too that monetary policy in many G10 countries is currently running a greater risk of being driven by fiscal dominance , which could further increase global M2 money supply and support bitcoin performance. Thus, we think relying too heavily on direct comparisons to gold may do digital assets a disservice.\n\nDemand and supply Gold may be incongruous to bitcoin for another reason. Mainstream access to crypto today is arguably more ubiquitous than gold was prior to 2004. In fact, it’s still easier to transact and hold bitcoin than physically buy and custody a commodity like gold, which is typically one of bitcoin’s strengths as a store of value. But if users can already buy bitcoin directly, that begs the question of what purpose a spot bitcoin ETF ultimately serves. Although this critique is not without merit, we believe crypto accessibility is not well understood in the context of the wider investment community. As of 3Q23, US households hold over $154T of wealth (total assets minus total liabilities), of which more than a third is managed by institutional players like wealth advisors, banks and broker-dealers. Many large asset managers do not independently buy and custody bitcoin. Instead, they often rely on ETFs to build their unique investment strategies, which distinguishes spot bitcoin ETFs from alternative means of bitcoin accumulation. The implications of this may be massive for cryptocurrencies, as ETFs can potentially redefine the market structure around how these assets are bought, sold and/or exchanged. ETFs would take bitcoin further into the mainstream, putting it within reach of millions of investors in the broker dealer, registered investment advisor (RIA) and tax advantaged account structures, where such vehicles currently trade in the US. With ETFs, money managers will have a direct channel for including bitcoin in client portfolios based on formal benchmarks. That could potentially lead to new financial products (lending and derivatives, for example) using compliance-friendly ETFs as the underlying, which could then be traded among institutional counterparties. Thus, what an ETF represents for bitcoin adoption extends beyond the immediate inflows into these products, potentially reshaping the market in entirely unprecedented ways. Nevertheless, we think this will take time to unfold. For example, employers may not allow 401k retirement contributions to bitcoin on day 1 of spot bitcoin ETFs launching. In addition, we think banks and broker-dealers (who manage over 80% of the assets in the wealth management industry) represent a major opportunity for this space. This cohort of investors is less likely to own existing futures-linked bitcoin ETFs because these instruments tend to be less capital and tax efficient and potentially more expensive than what may be offered by spot bitcoin ETFs. However, strategic allocations from these sources may be restricted in the short term due to their firms’ unique requirements on AUM thresholds or historical track records. Such obstacles may only be alleviated over time.\n\nForecasting is hard Trying to forecast the size of the potential net inflow into spot bitcoin ETFs can distract market players from the larger transformation taking place in the asset class. Moreover, there are a number of challenges that make this exercise difficult to do with reasonable accuracy. First, this is a new asset class, which makes it hard to gauge potential flows, because it often takes time for demand to percolate, both within the broader population and inside the wealth management community. Second, flows are contingent on the trading regime. Opportunity costs are higher and capital more scarce than they were two years ago, while the current investment environment is unlike any we've previously experienced. That gives us fewer comparables for analyzing flows with respect to previous periods. Third, flows are often path dependent, and there are currently a lot of variables that may affect initial allocations to ETFs. For example, there is already over $22.1B in AUM locked up in Grayscale’s GBTC product, which cannot be redeemed for the underlying bitcoin until GBTC is converted into an ETF. When those conversations are enabled, this may affect flows in both directions depending on market positioning, competitors’ expense ratios and liquidity. Thus, in our view, tracking the flows in the first week that these products launch may be far less useful than thinking about the long-term market impact. Currently, we are witnessing a massive generational transfer of wealth from baby boomers (those aged 57-75 years old) to millennials, who are much more amenable to having crypto exposure in their portfolios. By making bitcoin more easily accessible via traditional vehicles, ETFs have the opportunity to reach new segments of the population and allow adoption to grow at scale."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50L2VjNzU2YmIyLTQ0ZWUtNDAyNC05N2Q2LTllMmYwNGUzNTFjMNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Rebuild or retreat? Crypto faces tough choices after FTX - Financial Times",
        "content": "Print this page\n\nHours after Sam Bankman-Fried, co-founder of FTX and poster child of the crypto industry, was convicted of fraud and money laundering in New York, one of his leading venture capital backers had his say.\n\n“Immediately after FTX collapsed, we extensively reviewed our due diligence process and evaluated our 18-month working relationship with Sam Bankman-Fried,” said Alfred Lin, partner at Sequoia Capital. “We concluded that we had been deliberately misled and lied to.”\n\nCrypto sceptics would argue that Lin was hardly the first to be taken in. Ever since bitcoin was created in 2009, the industry has variously been associated with illicit trading, such as the now defunct Silk Road marketplace, or business failures such as the 2014 collapse of Mt Gox, which at its peak handled almost three-quarters of all bitcoin in circulation.\n\nAt the height of his power, Bankman-Fried was seen as the industry’s most likely route to respectability. Alongside Sequoia, FTX boasted mainstream backers such as Tiger Global, Singapore’s state-owned Temasek and the Ontario Teachers’ Pension Plan.\n\nIn Washington, Bankman-Fried testified before congressional committees, supported more regulation and became a major political donor.\n\nIn the Bahamas, where FTX was based, Prime Minister Philip Davis championed the company as a marquee acquisition as the Caribbean country’s economy sought its next economic boost.\n\nMeanwhile, FTX secured celebrity endorsements and signed sponsorship deals with Major League Baseball, the Miami Heat basketball franchise and the International Cricket Council. It filmed a Super Bowl advertisement with actor and producer Larry David.\n\nA giant screen shows Sam Bankman-Fried at a cryptocurrency conference in the Bahamas © FT montage\n\nBut on November 2, a 12-person New York jury needed less than five hours to reach unanimous agreement that Bankman-Fried was guilty of seven charges.\n\n“Sam Bankman-Fried perpetrated one of the biggest financial frauds in American history,” said US attorney for the Southern District of New York Damian Williams. “This kind of fraud, this kind of corruption is as old as time, and we have no patience for it.”\n\nAs crypto’s former leading light contemplates a possible lengthy jail sentence, the industry he championed could go one of two ways: either it collectively regroups and tries — all over again — to be accepted in the world of mainstream finance, or it falls back on its longstanding image as a niche market for speculators, day traders and those who fervently believe money should remain separate from the state.\n\nFor John Reed Stark, former chief of the Securities and Exchange Commission’s office of internet enforcement, the trial verdict is “a death knell for crypto, Web 3 and blockchain.”\n\n“This is an industry that has run its course,” he says. “If it all went away tomorrow, it wouldn’t impact a single person on the planet other than the speculator.”\n\nBut others believe the industry can recover from the debacle of the Bankman-Fried trial and become a part of mainstream finance.\n\n“Crypto’s public image is at an all-time low, but the industry isn’t done yet,” says Charles Storry, head of growth at crypto futures index platform Phuture.\n\nAn inglorious history\n\nThe ignominious conclusion of Bankman-Fried’s career follows more than a decade of non-compliance with traditional financial rules, run-ins with regulators around the world, and accusations that cryptocurrencies are used to fund terrorism and the proliferation of nuclear weapons. Meanwhile, the computing power needed to “mine” crypto assets like bitcoin generates a carbon footprint roughly equivalent to a country the size of Ukraine.\n\nFTX’s bankruptcy in 2022 capped off a crisis of confidence that resulted in popular digital assets such as bitcoin and ether losing more than half their value. Other once prominent firms like Terraform Labs and Three Arrows Capital also collapsed.\n\nIn response, lawmakers and regulators in multiple jurisdictions stepped up their oversight of the sector to unprecedented levels during 2023. US regulators have issued a blitz of enforcement cases and lawsuits against some of the biggest crypto companies still standing. They include US-listed Coinbase — which is facing an SEC lawsuit after allegedly violating securities laws — and Binance, FTX’s great rival and the world’s largest crypto exchange by some distance.\n\nThe Commodity Futures Trading Commission sued Binance in March, alleging it had illegally accessed US customers and that it knew it facilitated potentially illegal activities.\n\nBinance is now the biggest crypto exchange but the company and its chief executive, Changpeng Zhao, face regulatory action from both the CFTC and SEC © FT montage/Reuters\n\nThree months later, the SEC filed a lawsuit of its own against Binance, alleging that it had mixed customers’ cash with a separate trading firm owned by its chief executive Changpeng Zhao. Both Binance and Coinbase have denied the allegations and said they will fight their respective lawsuits.\n\nIn the wake of the October 7 atrocities, Israeli law enforcement authorities closed more than 100 Binance accounts and identified about 150 crypto donation initiatives affiliated with Hamas, prompting renewed allegations about the industry’s ties to financing terrorism and fresh calls for a crackdown.\n\n“This industry came to prominence after the failure of Mt Gox and the controversy of Silk Road,” says Charley Cooper, a former chief of staff at the CFTC. “Throughout its history, it has had multiple scandals — as a far greater proportion of their market — than any other industry has had.”\n\n“The majority of doctors are not defrauding the healthcare system, the majority of lawyers are not violating court ethics. The Wall Street guys, you can call them greedy, but they’re not breaking the law,” Cooper adds.\n\nYesha Yadav, professor of law at Vanderbilt Law School, describes Bankman-Fried’s conviction as “a monumentally important moment” for the wider crypto sector. “That the jury came back so decisively really highlights how far and how deeply a key symbol of the industry had fallen . . . it’s hard to imagine a bigger reputational hit.”\n\nThose working in the industry are concerned that their career prospects could be damaged as a result. One professional who contacted the Financial Times says he is “a little concerned with how being affiliated with crypto could be perceived for recruiting for traditional industries.”\n\nHe has lost money with FTX as well as Voyager, another crypto company that collapsed last year. “The experience has made me a lot more conservative,” he adds.\n\nCrypto glasnost\n\nAfter FTX filed for bankruptcy last November, influential voices in the sector called for a renewed focus on transparency.\n\nBinance’s Zhao said “all crypto exchanges” should provide proof of reserves and committed his own business to “full transparency”. Days later, rival exchange OKX said it was launching its first proof of reserves “to set a new standard of transparency, risk management and user protection”.\n\nBut according to figures from industry data provider CCData, only about a third of crypto exchanges currently offer proof of reserves or alternatives, such as regularly audited financial statements.\n\nThose exchanges that have offered some form of financial transparency to their customers account for about 81 per cent of the market, but that is down from 86 per cent in March — and about the level it was in November 2022, when FTX went bust.\n\nAccording to Jacob Joseph, research analyst at CCData, this suggests that “proof of reserves might have become less discerning to users compared to the early months after the collapse of FTX”.\n\nJames Newman, co-head of perfORM Due Diligence Services Limited, says the largest and most influential of exchanges “have taken steps to bring additional transparency over the assets they hold”.\n\n“However, there are many that have been slow in adopting proof of reserves,” he adds, saying it is “likely symptomatic of the continued dominance of retail money held on exchanges who do not speak as one voice”.\n\nRetail traders — individuals trading for themselves — have been instrumental in the sector’s growth. But many feel it now needs to widen its appeal. “Crypto’s survival relies on external support and belief from other industries,” says Storry. “Retail is on board, but we now need institutional backing to take the industry to the next level.”\n\nThere are signs this is happening. In the summer, payments giant PayPal became the first major financial institution to launch a US dollar-pegged crypto token. The company has offered trading in the world’s most popular cryptocurrencies since 2020, but the launch of a so-called stablecoin — a crypto asset whose price tracks that of a more recognised asset, often a conventional currency — marked a major boon for a troubled sector.\n\nEven greater hopes for institutional backing rest on BlackRock, the world’s largest asset manager, gaining SEC approval to launch a spot bitcoin exchange traded fund. That would allow investors to speculate on bitcoin within a regulated financial vehicle run by a recognised name.\n\nLast month, as speculation grew over BlackRock’s application possibly being approved, bitcoin’s price surged to $35,000, erasing all the losses it had racked up since the crypto market crisis began in May 2022.\n\nRegulators, including the Securities and Exchange Commission under Gary Gensler, have been wrestling with how to regulate crypto asset trading © FT montage/Bloomberg\n\n“There are signs of entry into this industry if you know where to look: we are talking about BlackRock launching a bitcoin exchange traded fund and PayPal launching a dollar-pegged stablecoin,” says Ilan Solot, co-head of digital assets at financial services firm Marex.\n\nBut nothing is set in stone. The SEC, led by chair Gary Gensler, has so far resisted approving any such applications and may never give BlackRock — or any other candidate — the green light to take bitcoin to the mass market.\n\nLawmakers have also turned more circumspect. Last month, Senator Cynthia Lummis and Representative French Hill urged the Department of Justice to consider criminal charges against Binance and Tether, the largest trading exchange and the largest stablecoin issuer, respectively.\n\nFollowing Hamas’s attack on Israel, more than 100 lawmakers from both major political parties in the US signed a letter urging the Biden administration to outline the steps it is taking to mitigate cryptocurrencies being used as a means of financing terrorism.\n\n“It’s going to be harder to get legislation passed in the US, and there will now be a colder reception in Congress,” says one crypto industry lobbyist in Washington. It remains to be seen in 2024, whether Coinbase and Binance are as willing — or even as able — to lobby regulators and politicians as FTX once was.\n\nBack to first principles\n\nThe irony of crypto’s push for respectability is not lost on Reed Stark, the ex-SEC executive. “All of these crypto guys are now crying out for a bitcoin ETF, but started the bitcoin project because they were upset about the 2008 banking crisis. They were upset about the government being able to surveil their financial transactions,” he points out.\n\n“So what do they do? They rally around one of the biggest financial services companies in the world because there’s nothing left. It’s the ultimate hypocrisy,” he adds.\n\nCustomers protesting outside the offices of Mt Gox’s operator in Tokyo in 2014. The failure of the exchange presaged many of crypto’s current problems © FT montage/Bloomberg\n\nBut while many in the industry have pinned their hopes on a mainstream future, another branch would prefer crypto to go back to its roots.\n\nErik Voorhees, founder of crypto platform ShapeShift and an unabashed libertarian, last month issued a rallying cry to those still faithful to the original crypto cause.\n\n“Why do we accept this world in which we are free to transact only on the conditional approval of strangers?” he asked. “This of course is not freedom. It is subservience, it is serfdom, and that the chains bear lightly down in most cases should not lull us into forgetting that the chains exist.”\n\nInstead of walking head first into an increasingly hostile crowd of regulators and lawmakers, Voorhees and others like him are pushing for the industry to go back to first principles: permissionless finance that stands as an explicit rejection of the establishment, government oversight and unelected regulators.\n\n“What prevents the man of tomorrow from even greater servitude? We do . . . we are building the economic defence of modern society against plunder and restriction by the state, we are saying no to the perpetual encroachment of permissioned existence,” Voorhees added.\n\nBalaji Srinivasan, author, investor and former chief technology officer at Coinbase, launched the Network State conference last month in Amsterdam in a bid to “build the parallel establishment”.\n\nSpeakers including Vitalik Buterin and Anatoly Yakovenko — the minds behind the popular ethereum and solana crypto blockchains, respectively — and the Winklevoss twins — who founded the Gemini crypto exchange — all attended.\n\n“This is a meeting of all the people building the parallel establishment. That’s more than parallel money. It’s parallel media, parallel education, parallel science, parallel construction, even parallel cities,” Srinivasan said.\n\nAfter the scandalous demise of crypto’s former poster boy, the decision to retreat from a losing battle with lawmakers and regulators may be tempting, but it is a decision that risks undermining a market that is already thinly traded.\n\nBalaji Srinivasan, former chief technology officer at Coinbase, and other crypto pioneers are pushing against government regulation © FT montage/Bloomberg\n\nAt the start of 2023, it would have required the purchase of more than 1,400 bitcoins — about $23mn at the time — to move the price of the token by more than one per cent, according to numbers shared by data provider CCData.\n\nBut by the end of April, it would have taken only 462 bitcoins — then worth about $13mn — to achieve the same market movement. This was the lowest point of market depth for bitcoin and tether, the world’s largest stablecoin, since May 2022 when the sector plunged into chaos.\n\nToday’s numbers have improved, but still do not portray a widely traded market with retail momentum and fresh money coming in; it would now take 752 bitcoins, worth about $26mn, to move the price of the coin.\n\n“Bankman-Fried’s guilty verdict has been priced in for a long time, in my view,” says Solot, of Marex.\n\n“But hypothetically, if this proved to be the major fork in the road where crypto adoption slowed down or even failed, the risk . . . is that you would only have internal money sloshing around in the market, and it basically atrophies.”\n\n“There would be no new money, there would be no growth.”\n\nLetter in response to this article:\n\nWhere cryptocurrencies resemble Ponzi schemes / From Jean Jacques Chenier, Paris, France"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1pbmluZy1yZXZlbnVlLWhpdHMteWVhcmx5LTA1NDMyNDAwMC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Mining Revenue Hits Yearly Highs of Over $42.3M - Yahoo Finance",
        "content": "Bitcoin Mining Revenue Hits Yearly Highs of Over $42.3M\n\nOn November 9, Bitcoin mining revenue reached a new yearly peak, totaling $42,386,514.038, surpassing the previous high of $41,744,197.067 in May 2023, as per data from Blockchain.com. This surge coincided with Bitcoin's price spiking to over $37,000 on the same day, driven by heightened expectations surrounding the potential approval of a U.S. spot Bitcoin Exchange-Traded Fund (ETF) by the Securities and Exchange Commission (SEC).\n\nThe upswing in mining revenue is attributed to the combined impact of Bitcoin's price increase and heightened network activity. Lane Kasselman, President of Blockchain.com, pointed out that increased network congestion results in higher transaction fees, contributing to miners' earnings. While network congestion in May was influenced by demand for Ordinals—a concept akin to NFTs—the current surge is primarily linked to the escalating price of Bitcoin.\n\nThe anticipation of U.S. spot Bitcoin ETF approval has played a pivotal role in the recent price rally. The SEC, known for historically rejecting Bitcoin ETF applications, is facing a unique situation with the expiration of deadlines for rebuttal comments on multiple pending ETF applications, potentially leading to the simultaneous approval of 12 Bitcoin ETFs.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2JpdGNvaW4tdnMtZ29sZC12cy11c2QtdGhlLWxhc3QtMTAteWVhcnMvYXJ0aWNsZXNob3cvMTA1MTQwMTY1LmNtc9IBeWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2JpdGNvaW4tdnMtZ29sZC12cy11c2QtdGhlLWxhc3QtMTAteWVhcnMvYW1wX2FydGljbGVzaG93LzEwNTE0MDE2NS5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin vs. Gold vs. USD: The last 10 years - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nOver the recent years, the financial landscape has transformed with rising demand for Bitcoin. While Gold and the US Dollar have long held their positions as stalwart players, Bitcoin has boldly entered the race, establishing itself as an emerging asset class. Each of these three assets possesses distinct characteristics and potential benefits, creating a dynamic landscape reflecting wealth and investment evolving nature. Let’s delve into the comparative study of Bitcoin, USD , and gold over the past decade.Gold, a trusted store of value for centuries, has been a staple in the financial markets since the 1970s. However, the landscape changed significantly with the introduction of the first gold exchange-traded fund (ETF), Gold Bullion Securities . Launched on March 28, 2003, on the Australian Securities Exchange by ETF Securities and its major stakeholder, Graham Tuckwell, this event marked a significant evolution in gold investment.Historically, gold has demonstrated its resilience by serving as a hedge against inflation amid economic uncertainties. This characteristic has established Gold as a preferred choice for investors looking to safeguard their portfolios. Despite encountering short-term fluctuations, Gold has maintained its reputation as a stable investment, particularly appealing to risk-averse investors. The enduring popularity of Gold as an investment option underscores its time-tested role in providing stability amid the dynamic currents of the financial markets.In contrast, Bitcoin debuted in the aftermath of the 2008 recession. Despite being a relatively young player in the financial arena, it has gained a lot of popularity among investors, garnering usage by approximately 4% of the global population. Over the past few years, Bitcoin has witnessed a surge in retail and institutional interest. The submission of Bitcoin spot ETF applications by major corporations such as BlackRock, Fidelity, and Grayscale signals a surge in momentum. Furthermore, the regulatory landscape, once characterized by ambiguity, is gradually evolving to accommodate and address the challenges posed by this innovative digital asset.The US dollar has been the world's primary reserve currency since the conclusion of World War II, making it the most widely utilized currency in international trade. The considerable global demand for dollars not only facilitates the United States in borrowing money at a lower cost but also grants the nation leverage in using its currency strategically as a diplomatic tool. However, this advantageous position is not without its drawbacks.As the world's primary reserve currency, the USD has been a lynchpin in global finance for decades, influenced by many factors, including interest rates, economic growth, and geopolitical events. Despite its pivotal role, the USD is not immune to challenges, as it has witnessed periods of inflation and depreciation, threatening its purchasing power over time. This dynamic nature underscores the need for a nuanced understanding of the complexities and vulnerabilities associated with the world's leading reserve currency.Gold is renowned for its stability and has historically been considered a safe-haven asset. While the price of Gold can fluctuate, it generally experiences less volatility compared to Bitcoin. Investors often turn to gold as a hedge against market turbulence during economic uncertainty.On the other hand, the US Dollar typically experiences lower volatility than Bitcoin but more than Gold. As discussed above, the stability of the USD is influenced by various global economic factors.When we talk about Bitcoin, in comparison with Gold and USD, it is obvious that it has higher volatility, being a nascent and emerging asset class. Over the past decade, the LBMA Gold Index has had an annualized volatility of almost 14%, roughly one-tenth the annualized volatility of Bitcoin. However, the volatility of Bitcoin is reducing drastically; for instance, over the past year, Bitcoin's volatility was only 49%. This highlights that while cryptocurrencies like Bitcoin continue to be riskier investments, the markets are becoming more mature and less risky with time.When considering potential returns, Bitcoin emerges as the clear frontrunner, outpacing Gold and the US Dollar (USD) by a considerable margin. The staggering Compound Annual Growth Rate (CAGR) of Bitcoin stands at an impressive 47% over a past 10 year period, showcasing a remarkable performance that dwarfs the growth rates of Gold and USD. To put this into perspective, Bitcoin's CAGR is nearly six times that of Gold and an astounding fifteen times greater than that of USD over the same period.Given its historical performance, investors seeking opportunities for substantial returns may find Bitcoin an attractive prospect. However, it's crucial to acknowledge that higher returns come with higher risks, and the volatility associated with Bitcoin must be carefully considered in the broader context of one's investment strategy and risk tolerance.In evaluating risk-to-reward ratios, particularly using the Sharpe ratio, Bitcoin's performance closely aligns with that of the USD DXY Index, an index reflecting the value of the US Dollar. In this context, it's intriguing that Gold, as a traditional store of value, boasts the highest Sharpe ratio, standing at a notable 0.5 over the past decade. This outpaces both the USD, with a Sharpe ratio of 0.4, and Bitcoin, which registers a ratio of 0.35 during the same period.Gold's elevated Sharpe ratio suggests a favorable balance between risk and return, making it appealing for investors seeking a stable and efficient asset. On the other hand, both the USD and Bitcoin exhibit slightly lower Sharpe ratios, indicating a comparatively lower efficiency in translating risk into returns. This nuanced perspective on risk and reward emphasizes the importance of diversification in investment portfolios.When comparing Bitcoin, Gold, and the US Dollar (USD) over the last decade, their respective liquidity profiles provide essential insights into their market dynamics.Despite its relatively short existence compared to Gold and the USD, Bitcoin has exhibited a remarkable liquidity increase. The growing acceptance of Bitcoin among institutional investors and the development of cryptocurrency exchanges have significantly enhanced its liquidity. This means that larger transactions can be executed with minimal impact on the asset's market price, making Bitcoin increasingly attractive to retail and institutional investors.Historically considered a highly liquid asset, gold maintains its status as a cornerstone in global financial markets. However, its physical nature introduces certain logistical challenges in large-scale transactions. The process of physically transporting and verifying Gold can be time-consuming, impacting its liquidity compared to digital assets like Bitcoin.The US Dollar, the world's primary reserve currency, boasts unparalleled liquidity. It is widely accepted in global trade and is the standard currency for international transactions. The USD's liquidity is further bolstered by its status as the preferred reserve currency for central banks and financial institutions, ensuring it remains highly liquid across various markets.In conclusion, the comparative analysis of Bitcoin, Gold, and the US Dollar over the past decade reveals a nuanced financial landscape shaped by the interplay of tradition, innovation, and economic forces. Each asset brings its unique set of characteristics and challenges to the table.As investors navigate these diverse options, allocating resources between Bitcoin, Gold, and the USD necessitates carefully considering risk tolerance, investment objectives, and the evolving nature of the global financial landscape. Diversification strategies that balance each asset's unique strengths and challenges may provide a resilient approach to wealth management in an ever-changing economic environment.(The author, Mr Edul Patel, is CEO of Mudrex , a Global Crypto Investment Platform)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGVjaC91c2ItYml0Y29pbi1taW5pbmcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "What Is a USB Bitcoin Miner in Crypto, and How Does It Work? - Investopedia",
        "content": "Bitcoin can be purchased using dollars or other currencies, by selling goods or services and receiving payments via bitcoin or by mining. Bitcoin mining is performed using dedicated electronic devices called miners that have high computing capacity. In the early- to mid-2010s, USB connection type mining devices were developed to allow ease of use, seamless connectivity, and lower power consumption at a lower price. But network hashing rates rose too quickly for these devices to keep up, so they were quickly abandoned by users for faster equipment.\n\nKey Takeaways Bitcoin mining requires a lot of computational power, as your hardware is required to generate trillions of hashes per second.\n\nFor being the first to solve one for the correct hash, you are awarded cryptocurrency.\n\nThese units could be \"stacked\" to achieve greater hashing power, but they still couldn't keep up with the ever-increasing hash rate of the network or ASICs.\n\nHow Do USB Bitcoin Miners Work?\n\nA USB Bitcoin miner, when connected to a computer with suitable software, performs the mining function at a certain hashing speed. To enhance the hashing output, multiple miners could be plugged in together. When they first came out, a stack of six USB miners that offered 335 megahashes per second (MH/s) could generate a cumulative two gigahashes of mining power.\n\nSince a standard computer usually has only two to six USB ports, USB hubs are required to be used to plug in the multiple USB miners. The USB hubs would be connected to a computer with software capable of controlling the USB miners and their mining operations.\n\nInstead of connecting to a standard PC or laptop, the USB Bitcoin miner setup could also be connected to other smaller, low-cost computer devices like Raspberry Pi, which offered suitable capacity to run the miners at the time. However, they were still not fast enough to keep up with other miners.\n\nIn 2023, you can purchase a USB miner that hashes at 220 gigahashes per second. You would need to stack more than 61 of these USB miners (at $198 per unit) to equal the hashing rate of an older Antminer S9 mining at 13.5 terahashes per second (found used on eBay for about $100). And that's only if your USB connection speeds and multiple hubs can handle the amount of information being processed.\n\nHistorical Developments\n\nBitcoin mining started with the standard Central Processing Unit (CPU), an integral part of a standard computer. The mining efficiency was enhanced with the use of comparatively faster Graphic Processing Units (GPUs).\n\nThen came the Field Programmable Gate Arrays (FPGAs), which scored better than both CPUs and GPUs at performing the hashing function, an essential element of blockchain management in cryptocurrency.\n\nFPGAs turned the concept of concentrated mining farms into reality and were also the first kind of mining devices that supported USB connectivity. FPGAs are now superseded by Application-Specific Integrated Circuits (ASICs), which consume less power and offer faster processing speeds compared to the former three.\n\nThe rapidly evolving technology has made Bitcoin mining nearly non-profitable on home computers. However, it is possible to use top-of-the-line graphics cards and processors to net a few dollars per month.\n\nCan You Mine Bitcoin With a USB? A USB miner can be used to assist the network, but these devices barely do enough work to earn rewards in a mining pool.\n\nAre USB Bitcoin Miners Worth It? USB Bitcoin miners do not have the computational capacity to effectively mine or even generate any profit as of November 2023, so they are not worth it if you want to mine for income. If you want to participate in the network and learn more about it, they can be a good purchase, albeit an expensive one.\n\nAre Bitcoin Mining Machines Legal? In many jurisdictions, Bitcoin mining machines are legal, but some countries have made it illegal. There are regulations being discussed globally that might eventually put restraints on the practice because it uses energy extensively when the world is attempting to become more aware of energy use and sources.\n\nThe Bottom Line\n\nWith lower setup costs, USB miners offered an easy and fun way to learn the nuances of cryptocurrency mining. However, it is currently financially unfeasible to use these devices, as it would take several decades to recoup their cost if a computer could even make the entire setup work.\n\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our warranty and liability disclaimer for more info. As of the date this article was written, the author does not own cryptocurrency.\n\n"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wcmUtZXRmLWJ0Yy1wcmljZS1jcmFzaC0xNTBrLTIwMjUtYml0Y29pbi1mb3JlY2FzdHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Pre-ETF BTC price 'crash' or $150K in 2025? Bitcoin forecasts diverge - Cointelegraph",
        "content": "Bitcoin (BTC) will “most likely” see a serious price drawdown before a key date for institutional investors dawns, said gold bug Peter Schiff.\n\nIn recent X activity, the longtime Bitcoin skeptic sounded the alarm over recent BTC price gains.\n\nSchiff bets on a BTC price “crash” before ETF launches\n\nBitcoin is a favorite topic of criticism for Schiff, chief economist and global strategist at asset management firm Euro Pacific Asset Management.\n\nThroughout the years, he has repeatedly insisted that, unlike gold, Bitcoin’s value is destined to return to zero and that no one in fact wishes to hold it except in order to sell higher later on.\n\nNow, with BTC/USD circling 18-month highs, he has turned his attention to what others say will be a watershed moment for cryptocurrency — the launch of the United States’ first Bitcoin spot price exchange-traded fund (ETF).\n\nAn approval is thought to be due in early 2024, while rumors that a green light could come in November are thought to have fueled last week’s ascent past $37,000.\n\nWhile some believe that the announcement will be a “sell the news” event, where investors reduce exposure once certainty over the ETF hits, for Schiff, a BTC price comedown may not even wait for that.\n\nIn an X survey on Nov. 9, he offered two scenarios for a Bitcoin “crash” — before and after the ETF launch. Alternatively, respondents could choose “Buy and HODL till the moon,” which ultimately became the most popular choice with 68% of the nearly 25,000 votes.\n\nDespite this, however, Schiff stood his ground.\n\n“Based on the results my guess is that Bitcoin crashes before the ETF launch,” he responded.\n\n“That why the people who bought the rumor won’t actually profit if they wait for the fact to sell.”\n\nAllianceBernstein: Bitcoin ETF “getting slowly priced in”\n\nAs Cointelegraph reported, the mood in the institutional sphere is lightening as the ETF debate looks increasingly set to end in Bitcoin’s favor.\n\nRelated: Bitcoin ‘Terminal Price’ hints next BTC all-time high is at least $110K\n\nAmong the latest optimistic BTC price forecasts is that of AllianceBernstein, which last week predicted a peak of $150,000 next cycle.\n\n“We believe early flows could be slower and the build up could be more gradual, and post-halving is when ETF flows momentum could build, leading to a cycle peak in 2025 and not 2024,” analysts wrote in a note quoted by MarketWatch and others.\n\n“The current BTC break-out is just simply ETF approval news getting slowly priced in and then the market monitors the initial outflows and likely gets disappointed in the short run.”\n\nAn accompanying chart showed BTC’s past and future price behavior delineated by halving cycles.\n\nBTC/USD cycle phases (screenshot). Source: AllianceBernstein/MarketWatch\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLWV0Zi1leHViZXJhbmNlLWRyaXZlcy00LXdlZWstbm90aGluZy1mb3Itc2FsZS1yYWxseS9hcnRpY2xlc2hvdy8xMDUxNTE4OTQuY21z0gGMAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2JpdGNvaW4tZXRmLWV4dWJlcmFuY2UtZHJpdmVzLTQtd2Vlay1ub3RoaW5nLWZvci1zYWxlLXJhbGx5L2FtcF9hcnRpY2xlc2hvdy8xMDUxNTE4OTQuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 11 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin ETF exuberance drives 4-week ‘nothing for sale’ rally - The Economic Times",
        "content": "(What's moving Sensex and Nifty Track latest market news stock tips and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nDownload The Economic Times News App to get Daily Market Updates & Live Business News.\n\nSubscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvdGFrZS1iaXRjb2luLXByb2ZpdHMtY21lLWJpbmFuY2UtYml0Y29pbi1mdXR1cmVzLWhvZGxlcnMtZGlnZXN0LW5vdi01LTExL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Take Bitcoin profits at $110K, CME tops Binance in BTC futures open interest: Hodler's Digest, Nov. 5-11 - Cointelegraph",
        "content": "Top Stories This Week\n\nCME overtakes Binance to grab largest share of Bitcoin futures open interest\n\nBitcoin’s futures market is showing an interesting shift as global derivatives marketplace the Chicago Mercantile Exchange (CME) has surpassed Binance in terms of Bitcoin futures open interest. This change occurred after Bitcoin exceeded the $37,000 mark for the first time in over 18 months.\n\nHowever, James Seyffart, a research analyst at Bloomberg Intelligence specializing in exchange-traded funds, questioned whether the increasing open interest in Bitcoin futures on CME would address historical concerns of the United States Securities and Exchange Commission regarding the depth of Bitcoin markets and the potential for market manipulation.\n\n“Okay this is interesting… Does this constitute a ‘market of significant size’ now?” Seyffart stated in a post on X (formerly Twitter).\n\nCryptoqueen’s OneCoin legal chief pleads guilty to fraud\n\nThe former head of legal and compliance at OneCoin is looking at a potential 10-year prison term for her involvement in the $4 billion cryptocurrency trading scheme. In Manhattan federal court, the ex-compliance chief of OneCoin, Irinia Dilkinska, pleaded guilty to charges of wire fraud and money laundering.\n\nAccording to a statement from the U.S. Department of Justice, U.S. District Judge Edgardo Ramos accepted Dilkinska’s guilty plea. She admitted to one count of conspiracy to commit wire fraud and one count of conspiracy to commit money laundering. Each charge carries a maximum sentence of five years in prison.\n\nDilkinska is scheduled for sentencing on February 14, 2024, facing a potential maximum sentence of 10 years in prison for her role in the OneCoin scheme.\n\nGenesis seeks court’s approval to reduce Three Arrows Capital claim from $1B to $33M\n\nBankrupt cryptocurrency lender Genesis has asked the court to approve its proposed settlement agreement with the collapsed crypto hedge fund Three Arrows Capital (3AC).\n\nIn a recent court document, Genesis stated that 3AC should be given a claim of $33 million against Genesis. This represents 3.3% of the total claims initially made against Genesis, which amounted to $1 billion.\n\nAccording to Genesis, 3AC’s claims against Genesis were the largest asserted claims in Chapter 11 cases associated with the collapse of the FTX exchange. Genesis stressed that the 3AC debtor was one of Genesis’s largest borrowers from 2020 to 2022, up until the time of its collapse.\n\nSafeMoon CEO bail release goes on hold after Feds cite flight risk\n\nSafeMoon CEO Braden John Karony’s bail release has been delayed by U.S. federal prosecutors, who argue that he may try to leave the country due to his alleged access to funds and connections abroad. The prosecutors expressed concerns that his release could pose a flight risk and be a potential danger to the community.\n\nThe delay comes after a New York District Judge, LaShann DeArcy Hall, decided to put a hold on the bail release order issued on Nov. 8 by a Utah Magistrate judge, who had allowed Karony to be released on a $500,000 bail. However, prosecutors contested this decision, claiming that the release order was made “without consideration of the defendant’s substantial financial means and ability to flee,” and they emphasized that his release could be a “continued danger to the community.”\n\nBinance to terminate Russian ruble deposits next week\n\nBinance users in Russia need to take note: They have a little over two months, until Jan. 31, 2024, to withdraw their rubles from the platform. Binance is wrapping up its operations in Russia and plans to stop accepting deposits in Russian rubles from November 15, 2023.\n\nThis comes after Binance declared its complete exit from Russia by selling its business to a newly established crypto exchange called CommEX in September 2023. However, there’s been limited information about the details of the deal, including the size of the transaction and the founders of CommEX, causing some controversy.\n\nWinners and Losers\n\nAt the end of the week, Bitcoin (BTC) is at $37,249, Ether (ETH) at $2,078 and XRP (XRP) at $0.67. The total market cap is at $1.42 trillion, according to CoinMarketCap.\n\nAmong the biggest 100 cryptocurrencies, the top three altcoin gainers of the week were FTX Token (FTT) at 250.48%, Kaspa (KAS) at 67.23% and Cronos (CRO) at 52.20%.\n\nThe top three altcoin losers of the week are Maker (MKR) at -3.39%, Tether Gold (XAUt) at -2.60% and PAX Gold (PAXG) at -2.51%.\n\nFor more info on crypto prices, make sure to read Cointelegraph’s market analysis.\n\nMost Memorable Quotations\n\nSEC Chair Gensler cannot continue to abuse the powers of his agency to fulfill a political agenda of driving the new and promising digital asset industry offshore.”\n\nTom Emmer, United States Republican congressman\n\nOrdinals help to express the core values of Bitcoin in a much more friendly way than Bitcoin, which is too technical or harsh for some people.”\n\nLugui Tillier, commercial director for Lumx Studios\n\nBinance’s Chief Compliance Officer crudely but succinctly summed up this case when he admitted that Binance was ‘operating as a fking unlicensed securities exchange in the USA bro.’ He was right.”\n\nThe United States Securities and Exchange Commission\n\nAs we have witnessed with cryptocurrency, heavy-handed constraints have hindered the exploration of potentially revolutionary applications.”\n\nMatthew Putman, CEO and co-founder of Nanotronics\n\nIn Web3, it’s not the code that’s king, but the community. Instead of perfecting backend logic, focus on front-end transparency.”\n\nTiago Serôdio, head of community at Partisia Blockchain\n\nI say, ‘Sorry, we are boring.’ But we are one of the oldest projects. We are very big… We are the one who has the most changes on GitHub, and we have not been down for over 2000 days… Boring sometimes is good.”\n\nFrederik Gregaard, Cardano Foundation CEO\n\nPrediction of the week\n\nBitcoin ‘Terminal Price’ hints next BTC all-time high is at least $110K\n\nAs the price of BTC hovers around its highest levels in the past 18 months, analysts are already speculating about the potential upward trajectory it may take in the upcoming months and years. Bitcoin may next be a “sell” at $110,000 as its new bull cycle plays out, a classic on-chain indicator suggests.\n\nAnalyzing its Terminal Price, Look Into Bitcoin creator Philip Swift described its value as a “simple” method of estimating long-term BTC price peaks. Terminal Price is calculated from Bitcoin’s so-called “Transferred Price” — a value derived by dividing “Coin Days Destroyed” by the existing supply. Not every all-time high reaches Terminal Price, but BTC/USD did hit the trendline during its 2017 all-time and initial peak in April 2021. The current all-time high of $69,000, seen in November of that year, fell short.\n\nAs Terminal Price increases with time, $110,000 may ultimately end up a conservative target should the next all-time high occur only later in the next cycle.\n\nFUD of the Week\n\nJPEX scandal: Taiwan determines new suspects in alleged fraud — Report\n\nTaiwanese prosecutors are seeking to detain Chang Tung-ying, the chief partner at JPEX’s Taiwan office, on charges of fraud related to the JPEX cryptocurrency exchange. The situation surrounding the collapsed exchange is unfolding, with the Taipei District Prosecutors Office (TDPO) reportedly identifying new suspects. According to a report from local TV channel TVBS News on November 9, the TDPO has requested the custody of Chang Tung-ying over allegations of fraud.\n\nAs part of the ongoing JPEX investigation, prosecutors in Taipei searched nine locations and summoned Chang along with three other individuals believed to be involved. Chang and JPEX lecturer Shih Yu-sheng (also known as Shi Yu) are considered suspects in the case for violating the Banking Act and the Money Laundering Control Act.\n\nCrypto exchange CoinSpot reportedly suffers $2M hot wallet hack\n\nBlockchain security firm CertiK indicates that the recent $2.4 million theft from Australian cryptocurrency exchange CoinSpot hot wallet likely occurred due to a “private key compromise.” CoinSpot appears to have experienced a hack, involving the probable compromise of a private key in one of its hot wallets.\n\nPseudonymous blockchain investigator ZachXBT highlighted two transactions on Nov. 8 that entered the wallet belonging to the alleged hacker. Subsequently, the wallet’s owner transferred the funds to the Bitcoin network via THORChain and Wan Bridge. CertiK stated that the apparent exploit was likely the result of a “probable private key compromise” on at least one of CoinSpot’s hot wallets.\n\n\n\nAccording to Etherscan data, a transaction of 1,262 Ether, valued at $2.4 million at current prices, originated from a recognized CoinSpot wallet and entered the wallet linked to the alleged hacker.\n\nPoloniex exchange suffers $100M exploit, offers 5% bounty\n\nA crypto wallet linked to the digital exchange Poloniex has experienced suspicious outflows, evident on the blockchain explorer Etherscan. Blockchain security experts suspect a breach, resulting in attackers draining up to $100 million in crypto.\n\n\n\nOn Nov. 10, millions in crypto assets were moved from an account labeled Poloniex 4 on Etherscan. Initially estimated at $60 million, later assessments revealed the loss exceeded $100 million. CertiK, a blockchain security firm, suggests a “private key compromise” as the likely cause and notes that the funds have already been transferred to four externally owned accounts, with some converted into Ether.\n\nTop Magazine Pieces of the Week\n\nExclusive: 2 years after John McAfee’s death, widow Janice is broke and needs answers\n\nTwo years after John McAfee’s death, his wife, Janice, is still unable to get closure. “All I want is to see his body for myself and know that really happened.”\n\n‘$10K JPGs’ scare away gamers, Animoca’s crypto game streaming plans: Web3 Gamer\n\nAnimoca buys Twitch-like platform and Web3 gaming was a major talking point at Binance Blockchain Week.\n\n6 Questions for Lugui Tillier about Bitcoin, Ordinals, and the future of crypto\n\nLugui Tillier is the commercial director for Lumx Studios, one of the top cryptocurrency firms in Rio de Janeiro — a city with a burgeoning crypto industry."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy92ZXQtaW14LWdydC1hbmQtYWxnby1zaG93LWJ1bGxpc2gtc2V0dXAtYXMtYml0Y29pbi10cmFkZXMtYWJvdmUtMzcta9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "VET, IMX, GRT and ALGO show bullish setups as Bitcoin trades above $37K - Cointelegraph",
        "content": "Bitcoin (BTC) is on target to end the week with gains of about 6%, indicating continued demand from the bulls. MicroStrategy co-founder Michael Saylor said during a speech at the 2023 Australia Crypto Convention on Nov. 10 that Bitcoin’s demand on a monthly basis could surge between two to 10 times by the end of 2024. Additionally, the halving will reduce the supply by half. Saylor expects both these events will cause the price “to adjust up.”\n\nWith almost a general consensus that Bitcoin’s price will move higher in 2024, analysts are busy projecting how high the rally could reach. Using its Terminal Price on-chain indicator, Look Into Bitcoin creator Philip Swift said that Bitcoin could hit at least $110,000 in its next bull cycle.\n\nCrypto market data daily view. Source: Coin360\n\nWhile Bitcoin continues to hog the limelight, several major altcoins have been charging higher. The broad-based cryptocurrency rally increases hopes that an altcoin season may be around the corner.\n\nIf the bullish sentiment sustains, altcoins may witness a rotation, wherein the high flyers face some profit booking, and the laggards start moving higher. Let’s look at the charts of the top-5 cryptocurrencies that may outperform in the near term.\n\nBitcoin price analysis\n\nBitcoin has been holding above the ascending channel pattern for the past three days, indicating that the bulls are defending the breakout level.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe bulls will try to thrust the price above $38,000 and start the northward march toward $40,000. While the upsloping moving averages indicate that the bulls are in control, the overbought levels on the RSI warn of a potential correction.\n\nIf the price skids back into the channel, it will suggest that the markets have rejected the higher levels. That could open the doors for a fall to the channel’s support line, which is close to the 20-day exponential moving average ($34,784).\n\nThe bears will have to sink the price below the channel to indicate the start of a solid correction. The BTC/USDT pair may then decline to the $32,400 to $31,000 support zone.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe bulls are buying the dips to the 20-EMA on the 4-hour chart but have failed to resume the uptrend. This suggests a lack of demand at higher levels. The bears will try to utilize this opportunity and drag the price below the 20-EMA. If they do that, the pair may fall to the 50-SMA.\n\nOn the contrary, if the price turns up from the current level, it will suggest that the bulls have flipped the breakout level from the channel into support. That will enhance the prospects of a rally above $38,000.\n\nVeChain price analysis\n\nVeChain (VET) completed a double bottom pattern after bulls pushed the price above the overhead resistance of $0.021 on Nov. 6.\n\nVET/USDT daily chart. Source: TradingView\n\nThe bulls have managed to ward off attempts by the bears to pull the price back below $0.021. This suggests buyers are trying to flip the $0.021 level into support. The bulls will next attempt to propel the price above $0.023 and resume the up-move. If they do that, the VET/USDT pair could rally to the pattern target of $0.028.\n\nContrarily, if the price fails to rise above the $0.023 resistance, the likelihood of a drop to the 20-day EMA ($0.020) increases. A break and close below this support will suggest that the bears are back in the game. The pair may then slump to the 50-day SMA ($0.018).\n\nThe pair has been consolidating above the breakout level of $0.021 for some time. The 20-EMA is flattening out, and the RSI is near the midpoint, indicating a balance between supply and demand.\n\nThis equilibrium will tilt in favor of the buyers if they kick the price above $0.023. That could start the next leg of the uptrend. Instead, if the price turns down and plummets below $0.021, it will indicate that the markets have rejected the higher levels. That could start a fall to $0.020.\n\nImmutable price analysis\n\nImmutable (IMX) has risen sharply in the past few days, indicating that the bulls are attempting a comeback.\n\nIMX/USDT daily chart. Source: TradingView\n\nThe recovery is expected to face a formidable resistance at $1.30. If the price does not give up much ground from this level, it will enhance the prospects of a break above the overhead resistance. The IMX/USDT pair could then start a rally to $1.59.\n\nThe overbought level on the RSI warns of a possible correction or consolidation in the near term. If the price turns down sharply from the current level or $1.30, it will indicate that the bulls are rushing to the exit. That may pull the price down to the 20-day EMA ($0.84).\n\nThe pair is gradually moving toward the overhead resistance of $1.30. The upsloping moving averages indicate that bulls remain in command, but the negative divergence on the RSI suggests that the bullish momentum is weakening.\n\nSellers may mount a vigorous defense at $1.30, but if the price stays above the moving averages during the pullback, it will improve the prospects of a rally above the overhead hurdle. Alternatively, if the price turns down sharply and slides below the 50-SMA, it will indicate the start of a pullback to $0.80.\n\nRelated: FTX files billion-dollar lawsuit against ByBit over asset withdrawals\n\nThe Graph price analysis\n\nThe Graph (GRT) has corrected after a sharp up-move, but a positive sign is that the bulls have managed to keep the price above the 20-day EMA ($0.12).\n\nGRT/USDT daily chart. Source: TradingView\n\nThe GRT/USDT pair has been attempting to resume the up-move, but the bears are posing a strong challenge at $0.14. The upsloping moving averages and the RSI in the positive territory indicate that the path of least resistance is to the upside.\n\nIf bulls overcome the obstacle at $0.16, the pair may resume its uptrend. The pair could thereafter travel to $0.21. Contrary to this assumption, if the price turns down and breaks below the 20-day EMA, it will indicate that the up-move has ended.\n\nThe pair has found support at the 50-SMA on the 4-hour chart, but the bears are trying to halt the recovery near $0.14. If buyers pierce this resistance, the pair could retest the barrier at $0.16. This level may again witness a tough battle between the bulls and the bears.\n\nOn the downside, the 50-SMA remains the key level to keep an eye on. If this level gives way, the pair could tumble to the strong support at $0.12. This level is likely to attract buying by the bulls.\n\nAlgorand price analysis\n\nAlgorand (ALGO) is forming a rounding bottom pattern, which will complete on a break and close above the overhead resistance at $0.14.\n\nALGO/USDT daily chart. Source: TradingView\n\nThe upsloping moving averages and the RSI in the overbought zone indicate that the bulls are at an advantage. If buyers maintain the price above $0.14, it will signal the start of a new up-move. The pattern target of the reversal setup is $0.20. If this level is scaled, the up-move may reach $0.24.\n\nAlternatively, if the price turns down sharply from $0.14, it will suggest that bears continue to defend the level with vigor. The ALGO/USDT pair could then slump to the 20-day EMA ($0.12).\n\nThe bulls are buying the dip to the moving averages, indicating that the sentiment is turning positive. The real test for the bulls is at $0.14. If they shove and sustain the price above this level, the pair is likely to pick up momentum.\n\nOn the downside, the moving averages remain the key level to watch out for. A break below the 20-EMA could pull the price to the 50-SMA. If this level cracks, the pair may start a correction to $0.10.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLXVuZGVyc3RhbmRpbmctdGhlLXJlYXNvbnMtYmVoaW5kLXRoZS1zcGlrZS1pbi1idGMtdHJhbnNhY3Rpb24tZmVlL9IBZGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLXVuZGVyc3RhbmRpbmctdGhlLXJlYXNvbnMtYmVoaW5kLXRoZS1zcGlrZS1pbi1idGMtdHJhbnNhY3Rpb24tZmVlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 12 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin: Understanding the reasons behind the spike in BTC transaction fee - AMBCrypto News",
        "content": "Bitcoin transaction fees climbed to the highest in months, with over $9 million.\n\nBTC breaks beyond the $37,000 price zone.\n\nA recent report indicates a notable increase in Bitcoin’s transaction fees. Although the surge has been attributed to the ETF, various other factors also contributed to this upward trend.\n\nBitcoin transaction fees spikes\n\nAs per a CryptoRank post, Bitcoin has experienced a surge in transaction fees. The upward trend, evident since November, has become more pronounced in recent days.\n\nAccording to Crypto Fees data, transaction fees reached over $9 million on 9th November, marking the highest in four months.\n\nThe fees decreased to over $6 million at press time, indicating a visible decline. Despite this decrease, the fees remain higher than those observed in the preceding months.\n\nPossible reasons for the Bitcoin fee spike\n\nThe recent surge in Bitcoin transaction fees may be attributed, in part, to the recent listing of Ordinals (ORDI), a BRC-20 token.\n\nBinance announced the listing of ORDI paired with USDT on 7th November. Consequently, this led to increased activity in Ordinals transactions, as indicated by a Dune Analytics chart.\n\nThe chart revealed a rise in ordinal inscriptions starting in November, preceding the listing, with the current count exceeding 300,000.\n\nFurthermore, the Dune Analytics chart illustrated a notable increase in Ordinals transaction fees over the past few days.\n\nOn 9 November, the fees reached a peak, surpassing $3 million. This spike in Ordinals transaction fees significantly contributed to the overall transaction fees observed on the Bitcoin network.\n\nAdditionally, an analysis of Bitcoin volume on Santiment further supports the uptrend, showing an increase in volume over recent days. On 9 November, the volume surged to over $38 billion, marking the highest for the month thus far.\n\nAs of this writing, the volume stands at around $22 billion. What these two metrics demonstrated was that the rise in interest in Ordinals and the recent price trend have contributed to the rise in fees.\n\nBTC marching to $40,000?\n\nAs of the closing bell on 10 November, Bitcoin has entered the $37,000 price range, per its daily timeframe chart.\n\nThe chart revealed a 1.71% increase, closing trading at over $37,000. At the time of this update, Bitcoin was experiencing a slight decline of less than 1%. Despite the decline, it continued to trade above the $37,000 mark.\n\nIs your portfolio green? Check out the BTC Profit Calculator\n\nWith the current price movement, the immediate support line had shifted to the $34,000 and $33,000 price ranges.\n\nFurthermore, Bitcoin maintained a position above its short Moving Average (yellow line). Also, this line acted as support in the vicinity of the $30,000 price region."
    }
]