[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTIvMTgvYml0Y29pbi1ldGYtY2FzaC1yZWRlbXB0aW9uLXJlcXVpcmVtZW50LXNlYy_SAVZodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzEyLzE4L2JpdGNvaW4tZXRmLWNhc2gtcmVkZW1wdGlvbi1yZXF1aXJlbWVudC1zZWMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "The SEC attaches a string to Bitcoin ETFs—and investors will be the one to pay for it - Fortune",
        "content": "Bitcoin ETFs are finally coming to the U.S. in 2024 and, by all indictions, the first ones will hit the market sometime in mid- to late-January. But now that the long-standing issues of if and when are resolved, the hot question surrounding Bitcoin ETFs is how exactly they will work—and, for now, the SEC is insisting on a process that doesn’t make a ton of sense and will ultimately result in retail investors paying for added complication. More specifically, the agency wants to bar the would-be ETF issuers from using Bitcoin for in-kind redemptions, and instead carry out these transactions with cash.\n\nTo understand what this means, it’s helpful to know how ETFs work in the first place. Recall that most ETFs hold a basket of shares in different companies, and that the issuer relies on deep-pocketed partners—market makers—to ensure the ETF’s share price reflects the value of the underlying stocks. This occurs through an arbitrage system that lets the market makers turn up with a basket of stocks and redeem them for new shares in the ETF, which they can then sell at a profit. Or conversely, the arbitragers can turn up with shares of the ETF and ask for the underlying securities in return. In both cases, the transactions result in the price of the ETF shares aligning more closely with the underlying asset. It’s a clever system that has made ETFs both inexpensive and widely popular.\n\nUnfortunately, when it comes to the Bitcoin ETFs, the SEC is reportedly insisting that these transactions—the ones where market makers exchange the underlying asset for new shares or vice versa—be in cash and not “in-kind.” This will likewise help ensure the ETF’s share price closely tracks the underlying asset (Bitcoin in this case), but it will also be more expensive.\n\nThis won’t be due to tax implications—as Grayscale gently pointed out to Bloomberg Intelligence following an inaccurate report last week—but because the ETF issuers will have to spend money exchanging Bitcoin for cash and vice versa. It would be simpler, of course, to just let the parties transact in Bitcoin, but here we are. In any case, it will be retail investors who be will paying for the additional transaction costs.\n\nThis is an odd decision by the SEC, especially as in-kind transactions are the norm with other ETFs. Indeed, when it approved a gold ETF in 2014—a novel concept at the time—the SEC issued an explanatory letter describing how the ETF issuer and its partners would conduct in-kind transactions involving bars of gold. This is obviously cheaper and more efficient than requiring a gold ETF issuer to go buy or sell new bars whenever there is a redemption. So why not do the same with Bitcoin, or at least permit both cash and in-kind redemptions? That is reportedly what both Fidelity and BlackRock—not exactly sketchy fly-by-night companies—are asking for.\n\nThe most charitable explanation is that the SEC views Bitcoin as a novel asset that could be cornered, and the agency wants to minimize the opportunities for mischief in the form of self-dealing on the part of market makers and ETF issuers. The chances of such manipulation occurring, however, seem unlikely—recall that a federal appeals court rejected this argument when it forced the SEC to stop blocking Bitcoin ETFs in the first place.\n\nThere is also another potential explanation for the SEC’s move to block in-kind redemptions, one that is rooted in the fact that, in the words of a D.C. insider, that “Chair Gensler hates hates hates to lose.” If that’s the case, it’s possible that the head of the agency—stung by his defeat in court—is going to allow Bitcoin ETFs, but on terms that will make them more expensive and less attractive to buy. That’s an odd position for an agency chairman who claims his top priority is looking out for the little guy.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nCrypto lending is making an unlikely comeback following as the number of companies turning to blockchain-based loans is up 55% in 2023. (Bloomberg)\n\nCoinbase says it will appeal after the SEC finally rejected its petition to create a new framework for digital assets. (Fortune)\n\nA trio of crypto Super PACs has raised $78 million to lobby for the industry in next year's election. (Fortune)\n\nSales of Solana's Saga phone, which was considered a flop, are soaring as speculators are reportedly paying as much as $5,000 for them in hopes of obtaining BONK tokens airdropped to device owners. (CoinDesk)\n\nLast week's slight decline in the price of Bitcoin also saw an overall outflow of new funds for the first time in 11 weeks. (The Block)\n\nMEME O’ THE MOMENT\n\nThe view from Bitcoin land:"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY4Mjc0L2JsYWNrcm9ja3MtcHJvcG9zZWQtc3BvdC1iaXRjb2luLWV0Zi1nZXRzLWEtdGlja2VyLWluLWxhdGVzdC1maWxpbmctd2l0aC1zZWPSAXRodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNjgyNzQvYmxhY2tyb2Nrcy1wcm9wb3NlZC1zcG90LWJpdGNvaW4tZXRmLWdldHMtYS10aWNrZXItaW4tbGF0ZXN0LWZpbGluZy13aXRoLXNlYw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "BlackRock's proposed spot bitcoin ETF gets a ticker in latest filing with SEC - The Block",
        "content": "BlackRock's proposed spot bitcoin ETF was christened with the ticker IBIT, according to an amended S-1 filing on Monday with the Securities and Exchange Commission.\n\nThe updated filing also included new language about the creation and redemption mechanism to be employed by the fund, a topic of recent meetings between BlackRock and SEC officials. The latest update appeared to nod toward a so-called cash redemption model that analysts have said the SEC seems to be favoring, but it left open room for an \"in-kind\" process, subject to approval from regulators.\n\n\"The Trust issues and redeems Baskets on a continuous basis,\" according to the filing. \"These transactions will take place in exchange for cash. Subject to the In-Kind Regulatory Approval, these transactions may also take place in exchange for bitcoin.\"\n\n\"BlackRock has gone cash only,\" Bloomberg Intelligence analyst Eric Balchunas wrote on X. \"That’s basically a wrap. Debate over. In-kind will have to wait. It’s all about getting ducks in row bf holidays. Good sign.\"\n\nRedemption models\n\nBlackRock likely wants to have an \"in-kind\" redemption model that would give the asset manager greater flexibility in managing the portfolio. But the SEC likely favors what is called a cash model that would require BlackRock to move the bitcoin out of storage, sell it right away and then give the cash back to the investor in the event they want to redeem shares.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nMemos show that firms including BlackRock and Fidelity have met with the agency over the past few weeks to go over details about how the redemption process would work for a spot bitcoin ETF.\n\nArk 21Shares and WisdomTree also filed amended S-1 filings with the SEC on Monday for their proposed spot bitcoin funds. The regulator has yet to approve one, although the market has surged amid optimism that a decision could be closer.\n\nBitcoin BTC -5.17% 's price rose 2.9% on Monday to trade at $42,581 at 7:31 p.m. ET, according to The Block data.\n\n(Updates with additional details throughout.)"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmcy1kaXNjdXNzZWQtbWVldGluZy0yMTAwMTEwNjYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Spot Bitcoin ETFs Discussed In Meeting Between BlackRock And SEC - Yahoo Finance",
        "content": "The Securities and Exchange Commission (SEC) met with BlackRock Inc. on Monday to discuss the proposed rule to allow a spot Bitcoin exchange-traded fund (ETF). The SEC's trading and markets division also met with Grayscale Investments, the leading crypto asset manager, regarding its application.\n\nThe SEC released a memo indicating that they met with BlackRock and Nasdaq Stock Market employees. \"The discussion concerned the NASDAQ Stock Market LLC's proposed rule change to list and trade shares of the iShares Bitcoin Trust under NASDAQ Rule 5711(d),\" the memo states.\n\nBlackRock also included a short presentation outlining two separate models for the ETF. The presentation describes how both an in-kind and in-cash redemption model could work to support the ETF. These smaller details may not impact retail investors, but they are still important to iron out before a final decision is made.\n\nDon't Miss:\n\nThe only currently available Bitcoin ETFs use futures contracts to closely track the price of Bitcoin. While this can provide general exposure, there can be price discrepancies and the management fees are high. A spot Bitcoin ETF would likely be a better alternative and attract investors.\n\nIt is unclear whether the SEC responded positively to the presentations and meetings. There is still plenty of time before a final determination must be made, and the SEC will likely take a while to sort through the details of each application before making a final decision. Many experts anticipate a final decision will be made by early 2024. Specifically, JPMorgan is eyeing Jan. 10 as this is the final day for a decision on several applications.\n\nBloomberg Intelligence ETF analyst James Seyffart wrote in a post on X that several other firms have reportedly met with the SEC in the past week. A dozen or so firms have submitted applications for a spot Bitcoin ETF, such as BlackRock, Grayscale, Fidelity Investments, WisdomTree Inc., Ark Invest and 21Shares. Most of the applications were filed in June, with several amendments submitted in the past few months.\n\nStory continues\n\nSome experts believe that the SEC will allow several ETFs to go live simultaneously once approved because most of the applications are similar, with differences in minor details.\n\nInvestors are patiently awaiting the release of the spot Bitcoin ETFs. When BlackRock submitted its application in June, the price of Bitcoin rose over $5,000 within a week. This hype has carried on throughout the rest of 2023, as Bitcoin recently hit a 52-week high of nearly $40,000 last week, according to CoinMarketCap.\n\nIf you are looking to purchase Bitcoin before the potential release of spot Bitcoin ETFs, Kraken is a great option. It is secure, easy to use, has low transaction fees and 24/7 customer service. It also offers staking, advanced and futures trading, non-fungible tokens (NFTs) and margin.\n\nRead Next:\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nThis article Spot Bitcoin ETFs Discussed In Meeting Between BlackRock And SEC originally appeared on Benzinga.com\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNtZWdyb3VwLmNvbS9hcnRpY2xlcy8yMDIzL3doYXQtYXJlLXlvdXItb3B0aW9ucy1mb3ItdGhlLXVwY29taW5nLWJpdGNvaW4tY2F0YWx5c3RzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "What Are Your Options for the Upcoming Bitcoin Catalysts? - CME Group",
        "content": "There are several reasons for the rally, some point to signs that a slate of exchange-traded funds that hold actual bitcoin — known as spot bitcoin ETFs — may soon be approved by the SEC as early as January 10, 2024. If granted, such approval will provide investors with additional products to access bitcoin exposure and may attract participants who may have been sitting on the side-lines.\n\nThe approval of the futures-based ProShares Bitcoin Strategy ETF (BITO) made history in October 2021 as one of the strongest ETF launches, amassing more than $1 billion in assets in just two days, and continuing to attract interest.\n\nAnother popular theory is tied to bitcoin's upcoming \"halving.\" This pre-programmed adjustment to the blockchain cuts in half the reward miners receive for processing transactions as well as the new bitcoin supply from the current 6.25 to 3.125 bitcoin per block. This event occurs after 210,000 blocks are mined or about every four years until the maximum supply (21MM) is reached. The next halving, bitcoin’s fourth, is expected to happen by mid-April 2024.\n\nIn the past, this event and the associated supply reduction has coincided with a strong run-up in bitcoin’s price and could potentially lead to pre- and post-halving volatility. The geopolitical and macro backdrop for the upcoming halving is very different from previous ones and the availability of regulated, robust and liquid Bitcoin futures and options from CME Group means firms have trusted and tested products to hedge their bitcoin price risk or gain exposure."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEyLzE4L2JpdGNvaW4tZmVlcy1zcGlrZS10by0yLXllYXItaGlnaC1hcy1vcmRpbmFscy1ib25hbnphLWdpdmVzLXdpbmRmYWxsLXByb2ZpdC10by1idGMtbWluZXJzL9IBigFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEyLzE4L2JpdGNvaW4tZmVlcy1zcGlrZS10by0yLXllYXItaGlnaC1hcy1vcmRpbmFscy1ib25hbnphLWdpdmVzLXdpbmRmYWxsLXByb2ZpdC10by1idGMtbWluZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Fees Spike to 2-Year High as Ordinals Bonanza Gives Windfall Profit to BTC Miners - CoinDesk",
        "content": "\"Despite bitcoin being range-bound, the BTC mining stocks are still performing well and are on fire with extraordinarily high fees being generated,\" said 10x Research's Markus Thielen, who is also the head of research at Matrixport."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvcmVhbC1lc3RhdGUtaW52ZXN0b3JzLWFyZS1mbG9ja2luZy10by1iaXRjb2luLWluLXJlY29yZC1udW1iZXJzLXNheXMtc3dpc3MtZXhjaGFuZ2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Real Estate Investors Are Flocking To Bitcoin in Record Numbers, Says Swiss Exchange - Nasdaq",
        "content": "Relai, a Swiss Bitcoin exchange, has disclosed with Bitcoin Magazine that a staggering 75% of its Over-The-Counter (OTC) revenue in the final quarter of 2023 stemmed from private clients diverting proceeds from real estate sales into Bitcoin, showcasing a seismic shift in investment strategies among investors.\n\nThe surge is a response to the real estate market's upheaval, compelling investors to pivot their portfolios toward the better opportunities presented by Bitcoin. Leon Wankum, a Bitcoin expert specializing in real estate, explained, \"Bitcoin, as an emerging asset class, potentially offers much higher growth potential for many investors, while the real estate market is in crisis and demand has died down.\"\n\nThe trend isn't confined to real estate alone, says Relai. Bitcoin is rapidly siphoning capital from traditional assets like securities and bonds, with experts forecasting a similar migration once Bitcoin spot Exchange-Traded Funds (ETFs) gain regulatory approval by the Securities and Exchange Commission in the United States.\n\nRelai's year-over-year OTC volume spike of over 100% underscores this transition. Notably, high-net-worth individuals and companies are driving this surge, with monthly volumes through Relai Private and Relai Business rising 30% during Q3 2023.\n\n\"If this trend continues, we can expect to see a substantial increase in Bitcoin's market capitalization and price in the coming months and years,\" said Relai CEO and co-founder, Julian Liniger. \"Relai is committed to providing investors with the tools and resources they need to navigate this evolving market. We are seeing a growing demand for our services, and we are investing in our platform to meet this demand.\"\n\nThe shift from real estate to Bitcoin is particularly pronounced in Switzerland, where awareness of Bitcoin's distinctive properties is steadily rising. Leon A. Wankum, also the Head of Bitcoin Strategies at oneVest Developments, explained how easy it can be for investors can convert their real estate capital into Bitcoin, stating, \"The process is a lot easier and faster than most people realise, with a service like Relai, such a transaction can take as little as one day.\"\n\nThe migration of investment capital from real estate to Bitcoin represents a potentially monumental shift in financial paradigms. As this trend gains momentum, the Bitcoin industry readies itself in anticipation for wealth from traditional asset classes to move into Bitcoin.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEyLzE3L2NhdGhpZS13b29kLXRoaW5rcy1iaXRjb2luLWNvdWxkLXNreXJvY2tldC0zMzU2LWJ5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Cathie Wood Thinks Bitcoin Could Skyrocket 3,356% By 2030. Is She Right? - The Motley Fool",
        "content": "Ark Invest CEO Cathie Wood is known for her wild price targets. In 2018, she famously predicted that Tesla would hit a pre-split price target of $4,000, representing more than a 1,000% gain at the time, and that prediction came true.\n\nNow, Wood has caught the attention of Bitcoin (BTC -6.47%) bulls with a splashy price target on the leading cryptocurrency. The renowned disruptive growth investor sees Bitcoin hitting $1.48 million per token by 2030 in her bull case for the cryptocurrency, or a gain of 33,557% as of Wednesday afternoon. In other words, $1,000 invested in Bitcoin today would be worth $34,557 by 2030, according to Wood.\n\nThat would be an astronomical return, but early Bitcoin holders have already experienced such gains. Can Bitcoin deliver those kinds of returns again? Let's take a closer look at Wood's bull case for Bitcoin.\n\nCathie Wood's Bitcoin thesis\n\nWood has long been bullish on crypto. Coinbase currently makes up the biggest holding of Ark Invest's flagship Ark Innovation ETF, and its Ark Next Generation Internet ETF also offers exposure to Bitcoin through its ownership of Grayscale Bitcoin Investment Trust.\n\nAs far as her Bitcoin target, Wood has argued that a number of different factors will drive the price higher. First, she sees institutional adoption pushing Bitcoin's price higher and expects it to be the latest new asset class to gain adoption the way emerging markets and real estate have earlier. She also sees it as an obvious hedge against inflation. It makes more sense for corporations to hold Bitcoin on their balance sheets, rather than holding cash, which loses its purchasing power over time.\n\nAs far as utility, Wood expects remittances to be a major market for Bitcoin as well, arguing that sending money across borders with Bitcoin would protect populations from currency swings and hyperinflation.\n\nIs Cathie Wood right about Bitcoin?\n\nWood's arguments sound logical, but there are a few things investors should remember before jumping on the bandwagon here. Bitcoin has been around for nearly 15 years, created in early 2009 by the anonymous Satoshi Nakamoto.\n\nThere are plenty of innovations that are roughly as old as Bitcoin or younger that have been much more disruptive than it has. Those include the iPhone, Airbnb-style home-sharing, ride-sharing platforms like Uber, new social media apps like Instagram and TikTok, and electric vehicles, led by Tesla. Most of those had a noticeable effect within just a few years. Despite all the hype around Bitcoin, its adoption around the world as something more than a speculative asset to hold and trade has been mostly negligible.\n\nNo country more fully embraced Bitcoin than El Salvador, which has long used U.S. dollars in place of its own currency and made the cryptocurrency legal tender in 2021. However, adoption has been slow in the small Central American country, impeded by limited internet access and a lack of enthusiasm among Salvadorians. Even remittances, Wood's primary use case of Bitcoin, have not gained traction. Through the first six months of 2023, only around 1% of remittances were received via Bitcoin, according to the country's central bank.\n\nSimilarly, Remitly CEO Matt Oppenheimer said in a 2022 interview that his company, which processed over $10 billion in remittances in its most recent quarter, could facilitate transfers in Bitcoin or another cryptocurrency but \"we're not seeing customer demand for it.\" Oppenheimer noted problems like \"[t]he volatility, the lack of trust, and the lack of security\" that have stood in the way of Bitcoin adoption for remittances.\n\nRegarding Wood's other arguments, institutional adoption seems far from a foregone conclusion. Few mainstream corporations are now holding Bitcoin, and some of the world's most admired financiers have repeatedly trashed it. Warren Buffett, for example, has called it \"rat poison squared,\" and JPMorgan Chase CEO Jamie Dimon said recently he'd \"close it down\" if he were the government, arguing that the only true use case for crypto is \"criminals, drug traffickers, money laundering, tax avoidance.\"\n\nFinally, the argument that Bitcoin is a good hedge against inflation simply has not been borne out. In fact, the opposite has been true. Inflation, according to the Consumer Price Index, peaked last June at 9% -- yet Bitcoin crashed in 2022 along with the stock market. Historically, Bitcoin has traded like a high-beta risk asset, rather than a safe haven from inflation, the way gold traditionally has. Without fundamentals, Bitcoin trades mostly on momentum, which explains much of its recent gains, as well as hopes for a Bitcoin exchange-traded fund (ETF).\n\nWill Bitcoin reach $1 million?\n\nWood's price target would translate into huge gains for Bitcoin, but the idea of having a reachable price target on a cryptocurrency is a bit illogical. Even price targets on stocks, which represent the earnings and valuations of a real business, are rarely accurate, and predicting movements in cryptocurrency is even more difficult.\n\nAnything could happen with the leading cryptocurrency, and adoption could increase, but at this point, Bitcoin is already a household name. It's reached 100% brand awareness and has had that for several years. Most people have concluded that it doesn't have any utility for them.\n\nBitcoin bulls like Wood, therefore, need to ask themselves what new opportunities are going to arise for the cryptocurrency that it hasn't had previously. Institutions are largely ignoring it. Immigrants aren't interested in sending money with it, and it's not treated like an inflation hedge the way you would expect \"digital gold\" to be. El Salvador's experiment with Bitcoin has hardly been encouraging.\n\nAt this point, the most likely change seems to be increased regulation, including the Digital Asset Anti-Money Laundering Act, which is now going through Congress. That is unlikely to be bullish for Bitcoin or the rest of the cryptocurrency universe.\n\nIt's easy to cheer outlandish price targets like Wood's, but even Bitcoin bulls should be clear-eyed about the obstacles standing in the way of further gains."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmLWJsb29kYmF0aC1jZXjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Spot Bitcoin ETF will be 'bloodbath' for crypto exchanges, analyst says - Cointelegraph",
        "content": "While the crypto community eagerly awaits the possible approval of a spot Bitcoin (BTC) exchange-traded fund (ETF) in the United States, some analysts are warning this could potentially trigger unwanted consequences for cryptocurrency exchanges.\n\nSeveral industry observers have predicted that a spot BTC ETF could start trading in early 2024, in an event that, when paired with Bitcoin’s upcoming block reward halving expected in April, Blockstream CEO Adam Back believes could propel BTC to $100,000.\n\nBitcoin proponents such as Jan3 CEO Samson Mow have said that approval of a spot Bitcoin ETF in the U.S. could even drive Bitcoin as high as $1 million in the “days to weeks” following.\n\nBut the forecast isn’t that optimistic for centralized cryptocurrency exchanges, according to ETF Store president Nate Geraci and Bloomberg ETF analyst Eric Balchunas.\n\nOnce approved, a potential spot Bitcoin ETF in the U.S. would be a “bloodbath” for cryptocurrency exchanges, Geraci wrote on X (formerly Twitter) on Dec. 17.\n\nAccording to Geraci, retail spot Bitcoin ETF buyers and sellers will benefit from underlying institutional trade execution and commissions. On the other hand, retail users of crypto exchanges will get “retail trade execution and commissions,” Geraci noted, stressing that those will need to improve to compete with a spot Bitcoin ETF.\n\nGonna be a bloodbath for crypto exchanges… — Nate Geraci (@NateGeraci) December 18, 2023\n\nBloomberg ETF analyst Eric Balchunas emphasized that a spot Bitcoin ETF will cost 0.01% to trade, which is the average fee for ETF trading.\n\nIn contrast, trading costs on exchanges like Coinbase reach 0.6%, depending on the cryptocurrency, transaction size and trading pairs.\n\nOnce approved, a spot Bitcoin ETF will create more price competition in the crypto industry, bringing money back to investors from exchanges that spend massive amounts of cash to advertise their services at events like the Super Bowl, Balchunas believes.\n\nRelated: What happened in crypto this weekend?\n\n“It would be the last ‘Crypto Super Bowl’ if they launch ETFs, because ETFs are such a thin, rough industry and some of these crypto exchanges were sort of selling populism making a ton of money on their really high fees,” he said in an interview with industry journalist Laura Shin in September 2023.\n\nHistorically, Coinbase has earned most of its revenue from transaction fees. In 2022, Coinbase made $2.4 billion in transaction fees from institutional and retail investors, which accounted for 77% of its total net revenue of $3.1 billion. The firm has been working to cut its reliance on fees, though, actively diversifying the revenue streams to other income-earning services such as subscriptions.\n\nMagazine: Lawmakers’ fear and doubt drives proposed crypto regulations in US"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTE4L2JpdGNvaW4tb3JkaW5hbHMtYmFzZWQtbmZ0cy1jbG9nLWJsb2NrY2hhaW5zLWFzLXNwZWN1bGF0aXZlLWZlcnZvci1zcHJlYWRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Ordinals-Based NFTs Clog Blockchains as Speculative Fervor Spreads - Bloomberg",
        "content": "Inscriptions are a type of nonfungible tokens that first took off earlier this year on the Bitcoin network. Now they are now popping up on more than a dozen other smaller blockchains, pushing up transaction fees and in some cases, bogging down networks.\n\nThe stampede to mint the hybrid tokens is the latest speculative frenzy for seemingly all things crypto this year, from Bitcoin’s remarkable comeback to the eyepopping returns being realized on the most recent dog-themed memecoin on the Solana network."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvaG93LWJpdGNvaW4tZXRmcy1hcmUtcGF2aW5nLXRoZS13YXktZm9yLWluc3RpdHV0aW9uYWwtYWNjZXB0YW5jZS1vZi1jcnlwdG8tb24td2FsbC1zdHJlZXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "How Bitcoin ETFs Are Paving the Way for Institutional Acceptance of Crypto on Wall Street - Nasdaq",
        "content": "With the world's first Bitcoin ETFs set to win SEC approval, could we be looking at one of the biggest breakthroughs in recent years on the path to institutional acceptance of crypto?\n\nFirms like BlackRock, Fidelity, and Valkyrie have all filed requests to launch their own Bitcoin spot exchange-traded funds on Wall Street. Subject to approval from the US Securities and Exchange Commission, the ETFs could pave the way for institutional investors to enter the world of cryptocurrency by taking up a more traditional position, rather than directly owning a currency.\n\nWith SEC approval seemingly just a matter of time, the arrival of a Bitcoin ETF will represent a major hurdle in removing some of the lingering barriers to adoption between institutions and cryptocurrency.\n\nBitcoin ETFs Driving Change for Institutions\n\nWhat changes with the arrival of a Bitcoin ETF? Fundamentally, a cryptocurrency ETF would still have the same functionality as more traditional ETFs. This means that it would be regulated by the SEC and subject to strict reporting protocols.\n\nCrucially, this would bring greater levels of transparency and oversight that institutions may feel are lacking throughout the crypto landscape at present.\n\nIn addition to this, the introduction of a Bitcoin ETF would herald a new era of institutional custody solutions which can help to limit the risk of theft or loss of Bitcoin at a time when concerns surrounding counterparty risk are still fresh in the minds of institutions following the high profile collapse of FTX in 2022.\n\nThe Starter Klaxon for Institutional Adoption?\n\nSEC approval for the world’s first Bitcoin ETFs could be looked back upon as the starter klaxon for more institutional adoption of cryptocurrency, helping to see more inflows into the market in a structured manner.\n\nThe reason that a Bitcoin ETF represents a major step for institutions is because it represents a secure and regulated entry point for investors.\n\nWithout the necessity of dedicated cryptocurrency wallets or crypto exchanges to take their first steps in the ecosystem, the streamlined investment process can attract investors of all levels without the fear of the unknown clouding their judgment.\n\nThe arrival of a spot Bitcoin ETF could also open the door to brand new investment opportunities, such as short-selling which can help institutions to trade cryptocurrency news faster.\n\nAbove all else, the arrival of Bitcoin ETFs provides a gateway for institutional investors to enter the world of crypto and build their confidence before taking their next steps in immersing themselves further.\n\nAccording to data from PwC’s Rebuilding confidence in crypto: 5th Annual Global Crypto Hedge Fund Report (2023), some 46% of hedge funds currently investing in crypto assets intend to add more capital into their holdings by the end of the year, while 37% state that they’re waiting for further market maturity before investing further.\n\nOvercoming Counterparty Risk\n\nThe acceptance of a Bitcoin ETF will be a major stepping stone for a cryptocurrency landscape that’s been contending with counterparty risk for many years.\n\nRegulators continually express concerns about crypto’s vulnerability to market manipulation, a lack of protection for investors, and even the prospect of fraud.\n\nBut the approval of a Bitcoin ETF will help to signify a maturing market that’s been strengthened through better regulated exchanges, more widespread transparency, and more technological innovations geared towards aiding the growth of institutional confidence.\n\nBecause Bitcoin ETFs don’t involve direct ownership of cryptocurrencies, they can be an excellent resource for managing counterparty risk, which occurs when a counterparty default on its obligation causes an institution to lose client funds.\n\nHowever, its arrival coincides with maturing technology that’s geared towards aiding institutions in better managing their counterparty risk when choosing to take their next steps in cryptocurrency trading.\n\nOffering a single point of access to manage trading, position monitoring, and risk management, Skarb’s unique trading terminal leverages client access to a vast range of liquidity venues.\n\nThis means that institutions that are seeking to immerse themselves into the wider world of cryptocurrency trading can tap into an array of exchanges and liquidity pools to execute and monitor trades within a single intuitive user interface.\n\nSkarb’s terminal offers optionality throughout liquidity venues for investors and traders to use asset safeguards like custodial services, which can keep assets securely away from exchanges until it’s time to make a transaction.\n\nWhen it comes to the hunt for “optimal execution,” Skarb’s network of liquidity providers and proprietary tools, like the pre-trade analyzer, allow traders execute their trades with efficiency at the best available price. In addition, proprietary algorithmic trading can pave the way for setting up trades across multiple venues simultaneously, while investors are supported by real-time reporting and trade cost analysis (TCA) tools for a more holistic overview.\n\nSolving Lingering Liquidity Hurdles\n\nOne of the biggest barriers to institutional acceptance of crypto today focuses on a lack of liquidity across the market. Institutional investors generally utilize significantly high levels of liquidity to leverage trades without a more widespread impact on asset prices.\n\nHowever, with the total cryptocurrency market capitalization standing at around $1.6 trillion at the time of writing, crypto is less than one-hundredth the size of the global total stock market capitalization, which is around $112 trillion.\n\nThe introduction of Bitcoin ETFs can aid matters of liquidity and market stability as a whole within the world of crypto. Because these ETFs trade on established stock exchanges with more robust liquidity, they can leverage a more liquid market overall for Bitcoin and make it easier for institutional investors to enter or exit positions without major price ramifications.\n\nIn turn, these greater liquidity levels brought by institutional investors taking their first steps into the crypto landscape can help to create a more stable market, paving the way for more entrants and greater levels of direct investment into the ecosystem.\n\nBitcoin’s Bright Future\n\nSecuring SEC approval for Bitcoin ETFs will invariably aid institutional acceptance of cryptocurrencies as a whole. Aside from providing an excellent entry point for institutions and leveraging more regulatory approval, this increased level of activity will help to increase the value of Bitcoin and improve its functionality.\n\nWith this in mind, the starting klaxon for the age of Bitcoin ETFs will carry a major positive impact on the market, and may well be looked back on as a watershed moment for cryptocurrency acceptance on Wall Street.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEyLzE4L2JpdGNvaW4tZGlwcy11bmRlci00MWstdG8tYmVnaW4tdGhlLXdlZWstaW4tcmVkLWFzLW1lbWVjb2luLW9yZGluYWxzLWZyZW56eS1jbG9ncy11cC1ibG9ja2NoYWlucy_SAZEBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMi8xOC9iaXRjb2luLWRpcHMtdW5kZXItNDFrLXRvLWJlZ2luLXRoZS13ZWVrLWluLXJlZC1hcy1tZW1lY29pbi1vcmRpbmFscy1mcmVuenktY2xvZ3MtdXAtYmxvY2tjaGFpbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Hovers Over $41K as Memecoin, Ordinals Frenzy Clogs up Blockchains - CoinDesk",
        "content": "“Spot bitcoin ETFs will be approved, and collectively will be the most successful ETF launch of all time,\" Bitwise also predicted . \"Coinbase’s revenue will double, beating Wall Street expectations by at least 10x.\""
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZlZXMtMjAtbW9udGgtaGlnaC1taW5lci1yZXZlbnVlcy1tYXRjaC02OWstYnRjLXByaWNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin fees hit 20-month high as miner revenues match $69K BTC price - Cointelegraph",
        "content": "Bitcoin (BTC) on-chain transaction fees are dividing opinion as the cost of sending BTC skyrockets.\n\nData from the statistics resource BitInfoCharts puts the average transaction fee at nearly $40 as of Dec. 17.\n\nCommentators: High Bitcoin fees are inevitable\n\nThe latest wave of Bitcoin Ordinals inscriptions has resulted in elevated transaction fees for all network users — but some believe that they are here to stay.\n\nPer BitInfoCharts, it currently costs just over $37 to send BTC on-chain — the highest average figure since April 2021.\n\nBitcoin average on-chain transaction fee chart (screenshot). Source: BitInfoCharts\n\nAdditional figures from Mempool.space show that Bitcoin’s mempool — the size of the unconfirmed on-chain transaction backlog — is vast, resulting in transactions with an attached fee of even $2 having no on-chain priority.\n\nAlmost 350,000 transactions are waiting to be confirmed at the time of writing.\n\nBitcoin mempool data (screenshot). Source: Mempool.space\n\nAs casual on-chain spending becomes unviable for many smaller investors, a heated debate among Bitcoin proponents continues.\n\nWhile many are angry at the impact of Ordinals on fees, popular Bitcoin figures argue that double-digit transaction costs are merely a taste of things to come. Those wanting to shield themselves need to embrace so-called layer-2 solutions such as the Lightning Network, which is specifically designed to cater to mass adoption.\n\n“Fees are currently artificially and temporarily high due to JPEG clownery, but it is nothing more than a glimpse into the future. Scaling doesn’t happen on L1,” popular commentator Hodlonaut wrote in one of many posts on the topic on X (formerly Twitter) on Dec. 16.\n\nContinuing, Hodlonaut argued that demanding low fees for “Level 1” transactions is “not just ignorant, it feeds into an attack on bitcoin.”\n\nThis reflects on the very composition of Bitcoin itself as a competition-based network gaining value over time as proof-of-work intends. Keeping fees low is contradictory, and as hard forks of the Bitcoin network specifically intended to offer that benefit have shown, does not attract value.\n\n“Why is it critical to onboard someone to L1 with sub $1 fees, if they can’t afford to move the funds in five years anyway? Go to bcash or another centralized pipe dream already,” Hodlonaut added, referring to one such offshoot, Bitcoin Cash (BCH).\n\nMiners enjoy best USD revenues in two years\n\nElsewhere, well-known commentator Beautyon reiterated that despite the fees, Bitcoin continues to function as intended.\n\nRelated: Navigating this bull market and securing profit will be tougher than it seems\n\n“If Ordinals bring the high on chain world to everyone earlier than expected, it will act like a scythe cutting down everyone who did not accept a Layer 2 solution to the network fee problem,” part of a recent X post stated.\n\n“Many users will be confused, upset and ready to abandon Bitcoin. There will be no recourse for them, obviously, because there is no one to blame, no one to seek compensation from; after all this is the normal state of the network. The rules are being followed, and those are the rules you agreed to, Bored Apes!”\n\nThat perspective is shared by Bitcoin veteran Adam Back, co-founder of Bitcoin and blockchain technology firm Blockstream.\n\nFor him, the answer likewise lies in expanding layer-2 capabilities instead of relying on anything beyond miner fee incentives.\n\n“You can’t stop JPEGs on bitcoin,” he concluded.\n\n“Complaining will only make them do it more. Trying to stop them and they’ll do it in worse ways. The high fees drive adoption of layer2 and force innovation. So relax and build things.”\n\nBitcoin miner revenue chart (screenshot). Source: Blockchain.com\n\nData from Blockchain.com shows miners’ revenue — the sum total of block subsidies and fees in USD — hitting levels last seen when Bitcoin hit its current $69,000 all-time high in November 2021.\n\nBTC/USD traded at around $42,000 toward the Dec. 17 weekly close, per data from Cointelegraph Markets Pro and TradingView.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEyLzE4L2JpdGNvaW4tZXRmLWFkLXdhci1vZmZpY2lhbGx5LXVuZGVyd2F5LXdpdGgtYml0d2lzZS1jYW1wYWlnbi_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMi8xOC9iaXRjb2luLWV0Zi1hZC13YXItb2ZmaWNpYWxseS11bmRlcndheS13aXRoLWJpdHdpc2UtY2FtcGFpZ24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin ETF Ad War Officially Underway With Bitwise Campaign - CoinDesk",
        "content": "Bitwise is among numerous firms awaiting approval from the U.S. Securities and Exchange Commission (SEC) for launching a spot bitcoin ETF. Unlike larger players like BlackRock, Bitwise has been offering crypto ETF products for several years, a point the ad makes clear at the end, saying \"ETFs backed by crypto specialists.\""
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9pbmhlcmVudGx5LWJlYXJpc2gtYmVsb3ctNDEtNS1rLTUtdGhpbmdzLWJpdGNvaW4tdGhpcy13ZWVr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "'Inherently bearish' below $41.5K — 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) starts a new week in risky territory as sell-offs from whales mark a change in mood.\n\nThe latest weekly close has done little to comfort nervous traders as a pause in “up only” BTC price activity continues.\n\nWith just two weeks to go until the yearly candle concludes, the countdown is on — together with the pressure — across risk assets.\n\nMacro data releases — key short-term volatility catalysts — are set to keep coming for the remainder of December, with United States gross domestic product (GDP) figures due as markets digest last week’s moves by the Federal Reserve.\n\nIt seems as if a “Santa rally” is less and less on the cards for Bitcoin at present. As high fees leave a bitter taste in hodlers’ mouths, commentators suggest refocusing on next month’s potential spot exchange-traded fund (ETF) approval.\n\nA potential silver lining comes from market sentiment, both within crypto and beyond. While greed characterizes the landscape, unsustainable conditions are nowhere to be seen, potentially leaving room for further upside as disbelief plays out.\n\nCointelegraph takes a look at these factors in greater detail as crunch time for yearly BTC price performance nears.\n\nAnalysts line up key BTC price support levels\n\nAt around $41,300, the Dec. 17 weekly close came midway through a local sell-off for BTC/USD.\n\nDownside continued overnight, with Bitcoin hitting $40,800 before reversing during the Asia trading session to return to just above $41,000, data from Cointelegraph Markets Pro and TradingView shows.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nTraders and analysts — already wary of potential further dips based on recent BTC price action — remained cautious.\n\n“The Charts Don’t Lie,” trading resource Material Indicators summarized at the start of one post on X (formerly Twitter) on the day.\n\nMaterial Indicators noted that Bitcoin had lost its 21-day moving average into the new week — an event it says is “inherently bearish.”\n\nIt added that it was “expecting year end profit taking and tax loss harvesting to prevail in the near term.”\n\nContinuing, co-founder Keith Alan flagged an ongoing battle for a key Fibonacci retracement level, which corresponds to the November 2021 all-time high.\n\nIt's too early to say if this December 17th Pattern is going to play out. We can make that determination at the close. For now, but it's safe to say that #BTC bulls need to push price back above .5 Fib to reclaim the Golden Pocket or risk losing the 21-Day Moving Average.… pic.twitter.com/Tjc4lkKEc2 — Keith Alan (@KAProductions) December 17, 2023\n\nPopular trader Skew added some lines in the sand in the form of the 200-period and 300-period exponential moving average (EMA) on 4-hour timeframes, along with the 50-day EMA — all currently around $2,500 below spot price.\n\n“From here there’s two technical levels on 1W/1M,” he continued in commentary on weekly and monthly timeframes.\n\n“$39K - $38K ~ Potential support on HTF, an unsustainable push lower there would be a decent bid. $47K - $48K ~ HTF resistance, unsustainable drive higher higher would be a good area to take profits.”\n\nBTC/USD 1-day chart with 21-day SMA; 200, 300 4-hour EMA; 50-day EMA. Source: TradingView\n\nPCE, GDP due amid increasing belief in Fed “pivot”\n\nThe coming week sees the November print of the Personal Consumption Expenditures (PCE) Index — the Fed’s preferred inflation gauge — leading U.S. macro events.\n\nComing after last week’s multiple key Fed decisions, data must now continue to show inflation abating heading into 2024.\n\nThe next Federal Open Market Committee (FOMC) meeting to decide changes to interest rates is not until the end of January, but since last week, markets have been entertaining the prospect of a pivot becoming reality.\n\nThe market is now pricing a full 25bps rate cut by July 2024 - following today's Fed meeting. pic.twitter.com/zWXiUqx96Q — tedtalksmacro (@tedtalksmacro) December 14, 2023\n\nThe latest data from CME Group’s FedWatch Tool currently puts the odds of a rate cut next meeting at around 10%, with the majority of key macro figures still to come.\n\nFed target rate probabilities chart. Source: CME Group\n\n“Even with stocks up, uncertainty is still everywhere,” trading resource The Kobeissi Letter concluded in an X post outlining the coming week’s prints.\n\nKey Events This Week:\n\n\n\n1. November Building Permits data - Tuesday\n\n\n\n2. Consumer Confidence data - Wednesday\n\n\n\n3. Existing Home Sales data - Wednesday\n\n\n\n4. Q3 2023 GDP data - Thursday\n\n\n\n5. November PCE Inflation data - Friday\n\n\n\n6. New Home Sales data - Friday\n\n\n\nAnother busy week with… — The Kobeissi Letter (@KobeissiLetter) December 17, 2023\n\nIn addition to PCE, jobless claims and revised Q3 GDP will both hit on Dec. 21.\n\nAs Cointelegraph reported, U.S. dollar strength hit multimonth lows around the FOMC in a potential fresh tailwind for crypto markets. Those lows have now faded as the U.S. Dollar Index makes a modest comeback, still down around 1.9% in December.\n\nFees stay elevated\n\nThe heated debate over Bitcoin transaction fees has swelled in recent days, thanks to these hitting their highest levels since April 2021.\n\nWith Ordinals back on the radar, those wishing to transact on-chain faced $40 fees at the weekend, while “OG” commentators argued that the fee market was simply functioning as intended given the competition for block space.\n\nMiner revenues have skyrocketed as a result, hitting levels not witnessed since Bitcoin’s $69,000 all-time high.\n\nInto the new week, however, fees have already fallen considerably, with next-block transactions confirming for under $15 at the time of writing.\n\nCommenting on the situation, popular social media personality Fred Krueger argued that market participants should now turn their attention to the decision on approving the first U.S. spot Bitcoin ETFs due early next month.\n\nNoting that fees were “already falling fast,” he defended Ordinals’ creators’ right to use the blockchain to store their work.\n\n“This debate looks like a nothingburger for now. Back to waiting for the ETF,” he concluded.\n\nOthers, including researcher and software developer Vijay Boyapati, also referenced the transitory nature of the fees debate as it has occurred throughout Bitcoin’s history.\n\n#Bitcoin concern trolls circa 2017: \"Bitcoin's network will not be secure because the block subsidy is shrinking and transaction fees won't be enough!!!\"\n\n\n\nBitcoin concern trolls today: \"transaction fees are too high!!!\" — Vijay Boyapati (@real_vijay) December 17, 2023\n\nCalling for so-called layer-2 solutions to speed up development, reactions to the recent elevated fees underscored that off-chain solutions for regular users — specifically the Lightning Network — already exist.\n\n“L1 fees are incredibly high right now. Seems obvious — even if self-serving — that defaulting most transactions to the Lightning Network is the way to go for all exchanges and wallets,” David Marcus, the former Facebook executive now CEO of co-founder of Lightning startup Lightspark, wrote in part of an X post at the weekend.\n\nPer data from monitoring resource Mempool.space, meanwhile, block space remains in huge demand, with the backlog of unconfirmed transactions still circling 300,000.\n\nBitcoin mempool data (screenshot). Source: Mempool.space\n\nNew addresses pose bull market momentum risk\n\nBitcoin network growth has taken a breather this month — in line with the bull market comeback.\n\nNew data from on-chain analytics firm Glassnode confirms that the number of new BTC addresses has continued its downtrend throughout December.\n\nFor Dec. 17, the latest date for which data is available, around 373,000 addresses appeared in an on-chain transaction for the first time. This is approximately half of the recent local daily high, which Glassnode shows came in early November.\n\nCommenting on the numbers, popular social media analyst Ali described the tailing-off of new addresses as noticeable and a hurdle to BTC price expansion.\n\n“There’s been a noticeable dip in Bitcoin network growth over the past month, casting doubt on the sustainability of $ BTC’s recent move to $44,000,” he wrote.\n\n“For a robust continuation of the bull rally, it’s crucial to see an uptick in the number of new $BTC addresses. This would provide the needed support for sustained bullish momentum.”\n\nBitcoin new addresses chart. Source: Glassnode\n\nDisbelief behind the fear\n\nThe recent cooling in Bitcoin’s latest “up only” phase has delivered a corresponding pause in market greed.\n\nRelated: ‘No excuse’ not to long crypto: Arthur Hayes repeats $1M BTC price bet\n\nAccording to the latest data from the Crypto Fear & Greed Index, most crypto market participants have been given pause for thought over the past week.\n\nCurrently at 65/100, Fear & Greed, which is the go-to sentiment gauge in crypto, still defines the overall mood as greedy, but near its least heated in almost a month.\n\nZooming out, Index scores over 90/100 have corresponded to long-term market tops, as irrational exuberance becomes the average market participant’s mindset. A notable exception, as Cointelegraph reported, was the 2021 $69,000 all-time high, which saw Fear & Greed reach 75/100 before reversing.\n\nCommenting on the current status quo for the traditional market Index, meanwhile, Caleb Franzen, senior analyst at Cubic Analytics, suggested that sentiment was still emerging from the extended Fed tightening cycle that also began in late 2021.\n\n“The Fear & Greed Index is comfortably in the ‘Greed’ range. However, it was just in ‘Fear’ 4 weeks ago and was in ‘Neutral’ to ‘Extreme Fear’ for 2.5 months in September through November,” he told X subscribers on Dec. 14.\n\n“Euphoria? No. This is disbelief.”\n\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXdvbnQtYmUtYmVhdGVuLWRpZ2l0YWwtc3RvcmUtb2YtdmFsdWUtdmFuZWNrLWNlb9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin won't be beaten as digital store of value: VanEck CEO - Cointelegraph",
        "content": "The CEO of investment management firm VanEck says he can’t see a world where Bitcoin (BTC) is overtaken as the leading store of value on the internet.\n\n“I think it’s impossible for me to imagine some other internet store of value [will] leapfrog Bitcoin,” Jan van Eck said in a Dec. 16 interview with CNBC.\n\n“There’s 50 million users of Bitcoin, so it’s got network effects.”\n\nThe CEO — $76.4 billion in assets under management — also crushed accusations that Bitcoin is in a “bubble,” — explaining that no asset has ever been in a bubble that continues to outperform itself every market cycle. He added:\n\n“Bitcoin is the obvious asset that is growing up in front of our eyes.”\n\nMeanwhile, Van Eck expects Bitcoin to see all-time highs in the next 12 months.\n\nVanEck CEO @JanvanEck3 expects Bitcoin all-time-high in the next 12 months. “It’s an asset that’s growing up in front of our eyes.” Also some good notes on the spot Bitcoin ETF effort and macro cycle. pic.twitter.com/02qZOVBPyx — Gabor Gurbacs (@gaborgurbacs) December 16, 2023\n\nThe VanEck CEO said he and his late father, John van Eck — who founded the firm in 1955 — have store of value investing in their DNA and that he sees Bitcoin becoming an accompaniment to gold.\n\nVanEck launched the first gold fund in the United States under John van Eck’s leadership in 1968.\n\nVanEck is one of 13 applicants gunning for an approved spot Bitcoin exchange-traded fund in the United States.\n\nRelated: VanEck files 5th amendment to spot Bitcoin ETF under ‘HODL’\n\nThe firm’s CEO expects all spot Bitcoin exchange-traded fund applications to be approved on the same day.\n\nETF analysts predict the Securities and Exchange Commission will issue a decision on several pending spot Bitcoin ETF applicants sometime between Jan. 5–10, with BlackRock, Grayscale, Bitwise, WisdomTree, Invesco and Galaxy, Fidelity, Hashdex and others also waiting for a final decision by the SEC.\n\nMagazine: BlackRock revises BTC ETF filing, El Salvador’s crypto citizenship trending, and more: Hodler’s Digest, Dec. 10-16"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY4MDMwL2JpdGNvaW4tb3V0Zmxvd3MtY3J5cHRvLWZ1bmRzLTExLXdlZWstc3RyZWFrLWVuZNIBWGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI2ODAzMC9iaXRjb2luLW91dGZsb3dzLWNyeXB0by1mdW5kcy0xMS13ZWVrLXN0cmVhay1lbmQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin sees $33 million in outflows after 11-week inflow streak ends - The Block",
        "content": "Crypto funds at asset managers such as CoinShares, Bitwise, Grayscale, ProShares and 21Shares ended an 11-week run of inflows last week, registering net outflows of $16 million, according to CoinShares’ latest report.\n\nBitcoin BTC -5.54% -based funds dominated, registering $32.8 million in outflows last week, with short Bitcoin investment products also witnessing $0.3 million in outflows. However, trading activity remained above average — totaling $3.6 billion last week compared to the $1.6 billion yearly average.\n\nThe outflows coincide with a decline in the price of Bitcoin over the past week, falling around 5% to end an eight-week streak of consecutive weekly gains. Bitcoin currently trades at 40,925, according to The Block’s price data.\n\nMixed regional flows suggested the turnaround was more about profit-taking than a shift in sentiment toward the asset class, CoinShares Head of Research James Butterfill said. The net flows were mainly driven by the U.S. and German markets, which witnessed $18.3 million and $9.7 million in outflows, respectively. Conversely, Switzerland registered inflows of $9.1 million, and Canada $6.9 million.\n\nRELATED INDICES See crypto indices\n\nEther and Avalanche also witnessed outflows — while Solana, Cardano and XRP bucked the trend\n\nEther and Avalanche AVAX -6.99% -based investment products also witnessed outflows, with $4.3 million and $1 million exiting the funds, respectively.\n\nSolana SOL +8.87% , Cardano and XRP products were the primary beneficiaries, Butterfill said, bucking the trend by registering $10.6 million, $3 million and $2.7 million worth of inflows, respectively. Additionally, Chainlink-based funds witnessed inflows of $2 million.\n\nBlockchain equities also experienced more positive sentiment last week, with inflows totaling $122 million, adding to a nine-week streak of $294 million — the largest run to date."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9hcy1iaXRjb2luLXByaWNlLXN0YWduYXRlcy13aGF0cy1uZXh0LWZvci1pdHMtcHJlZGljdGlvbi_SAVNodHRwczovL2FtYmNyeXB0by5jb20vYXMtYml0Y29pbi1wcmljZS1zdGFnbmF0ZXMtd2hhdHMtbmV4dC1mb3ItaXRzLXByZWRpY3Rpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "As Bitcoin price stagnates, what’s next for its prediction? - AMBCrypto News",
        "content": "Bitcoin sell and buy pressure remained relatively low at press time.\n\nBTC’s price dropped by 4% in the last seven days, and indicators looked bearish.\n\nBitcoin [BTC] has not displayed a remarkable performance over the last week, as its weekly chart was in the red. According to CoinMarketCap, BTC was down by nearly 4% in the last seven days.\n\nAt the time of writing, BTC was trading at $41,909.77 with a market capitalization of over $820 billion.\n\nInvestors are not selling Bitcoin\n\nHowever, despite the bearish price action, investors at large seemed confident in the coin, as shown in their reluctance to sell. Likewise, Willy Woo, a popular crypto analyst, recently posted a tweet highlighting an important metric.\n\n#Bitcoin investors are waiting for higher prices, presently unwilling to sell. SOPR tracks the profit of coins when they sell to new investors. It climbed while price dropped, for this to happen only investors at signficant profit are selling, more recent investors are waiting. pic.twitter.com/Z18W3V36sV — Willy Woo (@woonomic) December 16, 2023\n\nHe used BTC’s SORP, which tracks the profit of coins when they are sold to new investors. As per his analysis, BTC’s investors seemed to be waiting for higher prices, as shown by their unwillingness to sell.\n\nTo double-check whether investors are holding, AMBCrypto examined other metrics.\n\nAs per our analysis, Bitcoin’s Supply on Exchanges and Supply outside of Exchanges were closely knit, meaning that there was neither much selling pressure nor buying pressure at the time of the report.\n\nBitcoin’s velocity also witnessed a drop, meaning that fewer coins had been transferred in a fixed time frame.\n\nOur check on CryptoQuant’s data also revealed that BTC’s Binary CDD was green, which meant that the long-term holders’ movement in the last seven days was lower than average, showing their willingness to hold.\n\nBTC’s daily transactions were also low in the last 24 hours.\n\nWill investors’ confidence reflect on BTC’s chart soon?\n\nAMBCrypto’s look at BTC’s liquidation levels revealed that the coin has not witnessed massive sell-offs beneath its current value in the recent past. Therefore, the possibility of a trend reversal cannot be ruled out yet.\n\nIf it manages to gain bullish momentum, Bitcoin will face a strong resistance near $43,600.\n\nAnother positive metric was Bitcoin’s Fear and Greed Index. As per Glassnode’s chart, BTC’s fear and green index were declining and, at press time, had a value of 67.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nWhen the metric drops, it suggests that it is entering a “fear” phase, which generally hints at a trend reversal.\n\nHowever, the MACD displayed a clear bearish crossover on Bitcoin’s daily chart. Its Money Flow Index (MFI) also registered a downtick, which could result in a further drop in the king of cryptos’ price."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9idGMtZXRoLWxvc2Utb3Zlci10aGUtd2Vla2VuZC13aGF0cy1uZXh0L9IBQ2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9idGMtZXRoLWxvc2Utb3Zlci10aGUtd2Vla2VuZC13aGF0cy1uZXh0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin, Ethereum lose over the weekend: What’s next? - AMBCrypto News",
        "content": "BTC dropped to $41,158 while ETH sank below $2,200 during the weekend.\n\nThe market was expected to go sideways until the year-end.\n\nCrypto trading activity cooled off in the last non-holiday weekend of the year, the first possible sign that the peak of 2023 may have been achieved and that the market will remain sideways until 2024 arrives.\n\nOver the weekend, the world’s largest cryptocurrency, Bitcoin [BTC], dipped below $42,000. The descent accelerated in the last 24 hours with BTC dropping to $41,158 as of this writing, AMBCrypto spotted using CoinMarketCap’s data.\n\nEthereum [ETH], the second-largest digital asset, fell below $2,200, as participants booked profits before retreating for festivities. With losses of more than 2% in 24 hours, ETH was trading at $2,172 at press time.\n\nTrading activity declines\n\nBitcoin has led the broader market rally over the last two months, driven by enthusiasm over the approval of spot ETF applications in the U.S. market.\n\nBullish expectations led investors to stack their portfolios with BTCs, resulting in heightened trading activity.\n\nHowever, over the last week, daily trading volume fell by 60%, as per AMBCrypto’s analysis of Santiment data.\n\nEven the whale investors, who generally use calmer periods for accumulation, stayed away from trading, as evidenced by a sharp drop in large transactions.\n\nThe amount of coins moving to exchanges also revealed a noticeable drop. From 45,269 BTCs a week before, the exchange inflows plunged to 15,675 on the 17th of December, a sure sign of falling trading activity.\n\nDerivatives market also go quiet\n\nSpeculative interest in the king coin also started fading as the year drew to a close. The Open Interest (OI) in BTC futures dropped more than 9% from last week to $16.95 billion at press time, AMBCrypto observed using Coinglass data.\n\nThe drop in OI coinciding with the drop in market price is typically viewed with pessimism by market experts. However, the current situation could just be a year-end blip rather than a long-term trend.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nShivam Thakral, CEO of Indian cryptocurrency exchange BuyUcoin, weighed in on the market situation in a quote shared with AMBCrypto.\n\nHe noted,"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLWRyb3BzLWFnYWluLTQway_SAUdodHRwczovL3d3dy5uZXdzYnRjLmNvbS9hbmFseXNpcy9idGMvYml0Y29pbi1wcmljZS1kcm9wcy1hZ2Fpbi00MGsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Price Drops Again – What Could Trigger A Fresh Increase? - NewsBTC",
        "content": "Bitcoin price failed again to gather pace above the $43,500 resistance level. BTC started a fresh decline and might soon revisit the $40,000 support.\n\nBitcoin is moving lower below the $42,000 support zone.\n\nThe price is trading below $42,000 and the 100 hourly Simple moving average.\n\nThere is a key bearish trend line forming with resistance near $41,800 on the hourly chart of the BTC/USD pair (data feed from Kraken).\n\nThe pair could find strong buying interest near the $40,600 and $40,000 levels.\n\nBitcoin Price Declines Below $42K\n\nBitcoin price attempted more gains above the $43,000 level. However, BTC failed to clear the $43,500 resistance and formed another rejection pattern.\n\nA high was formed near $43,421 and the price started a fresh decline. There was a move below the $42,200 and $42,000 levels. The price declined below the 50% Fib retracement level of the upward move from the $40,605 swing low to the $43,421 high.\n\nBitcoin is now trading below $42,000 and the 100 hourly Simple moving average. There is also a key bearish trend line forming with resistance near $41,800 on the hourly chart of the BTC/USD pair.\n\nSource: BTCUSD on TradingView.com\n\nOn the upside, immediate resistance is near the $41,250 level. The first major resistance is forming near $41,800 and the trend line. A close above the $41,800 resistance might start a steady increase. The next key resistance could be near $42,250, above which BTC could rise toward the $42,800 level. A clear move above the $42,800 level could set the pace for a test of $43,500.\n\nMore Losses In BTC?\n\nIf Bitcoin fails to rise above the $41,800 resistance zone, it could continue to move down. Immediate support on the downside is near the $40,600 level or the last swing low.\n\nThe next major support is near $40,000. It is close to the 1.236 Fib extension level of the upward move from the $40,605 swing low to the $43,421 high, below which the price might test the $39,500 zone. If there is a move below $39,500, there is a risk of more losses. In the stated case, the price could drop toward the $38,400 support in the near term.\n\nTechnical indicators:\n\nHourly MACD – The MACD is now gaining pace in the bearish zone.\n\nHourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 20 level.\n\nMajor Support Levels – $40,600, followed by $40,000.\n\nMajor Resistance Levels – $41,250, $41,800, and $42,250.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmJ1c2luZXNzLXN0YW5kYXJkLmNvbS9vcGluaW9uL2VkaXRvcmlhbC9iaXRjb2luLWdhaW5zLWFjY2VwdGFuY2UtMTIzMTIxNzAwODc2XzEuaHRtbNIBZGh0dHBzOi8vd3d3LmJ1c2luZXNzLXN0YW5kYXJkLmNvbS9hbXAvb3Bpbmlvbi9lZGl0b3JpYWwvYml0Y29pbi1nYWlucy1hY2NlcHRhbmNlLTEyMzEyMTcwMDg3Nl8xLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 17 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin gains acceptance - Business Standard",
        "content": "Bitcoin, and more broadly cryptocurrencies, is edging closer to becoming a “mainstream alternative financial asset” as it becomes more easily available via traditional financial (or TradFi) instruments. The government of El Salvador (which uses Bitcoin as an alternative currency) has completed the formalities for launching a Bitcoin “volcano” bond. A proposal to list a spot Bitcoin exchange-traded fund (ETF) from one of global finance’s most marquee firms, BlackRock, awaits approval from the United States’ markets regulator, the Securities and Exchange Commission (SEC). This is in addition to the Nasdaq listing of several companies focused on cryptomining.\n\nGiven such developments, India needs"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbmdhcGUuY29tL3dlYi1zdG9yaWVzL2tleS1maW5hbmNpYWwtZ2lhbnRzLWZpbGluZy1mb3ItYml0Y29pbi1ldGZzL9IBTmh0dHBzOi8vY29pbmdhcGUuY29tL3dlYi1zdG9yaWVzL2tleS1maW5hbmNpYWwtZ2lhbnRzLWZpbGluZy1mb3ItYml0Y29pbi1ldGZzLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "Key Financial Giants Filing for Bitcoin ETFs - CoinGape",
        "content": "Involved in the filing for a Bitcoin ETF, adding to the list of financial giants."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vd3d3LmZvb2wuY29tLmF1L2RlZmluaXRpb25zL2JpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 18 Dec 2023 08:00:00 GMT",
        "title": "What is Bitcoin? // The Motley Fool Australia - The Motley Fool Australia",
        "content": "Discover how Bitcoin, the oldest and most valuable cryptocurrency, can be used as a speculative investment or a digital medium of exchange.\n\nCryptocurrency has gone genuinely mainstream over the past few years – and no crypto is more ubiquitous than Bitcoin.\n\nSometimes referred to as 'digital gold', Bitcoin is the oldest and most valuable cryptocurrency, with a market capitalisation approaching US$800 billion as of December 2023 (though it has previously topped US$1.23 trillion). However, as with many cryptos, Bitcoin remains a bit of a mystery to many investors.\n\nIn this article, we will explain what Bitcoin is and the technology that makes it possible, so strap yourselves in.\n\nWhat is Bitcoin?\n\nBitcoin (CRYPTO: BTC) is a type of digital asset. It is the first – and still the most widely recognised and traded – cryptocurrency ever created.\n\nLike any traditional currency, Bitcoin can be used as a medium of exchange, although the finance industry more popularly sees it as part of a new and speculative investment class. Unlike fiat currency, Bitcoin is entirely digital, meaning there are no physical notes or coins in circulation.\n\nBitcoin's origins remain mysterious, with its creator's genuine identity still unknown. Apparently, Bitcoin was conceived by a Japanese coder named Satoshi Nakamoto. But no one has been able to confirm any details about Nakamoto, including their real name or whereabouts, and no viable candidates have presented themselves.\n\nWhatever their true identity, someone claiming to be Nakamoto published a paper titled Bitcoin: A Peer-to-Peer Electronic Cash System in October 2008. The paper proposed a new type of digital payment network that would allow users to transact directly with one another without the need for any financial institution like banks.\n\nThis network – now better known as the Bitcoin blockchain – sought to remove central sources of authority from the financial system, such as central banks. It also created the world's first digital currency: Bitcoin.\n\nWhat is a blockchain?\n\nIn the paper, Nakamoto described the proposed network as \"a system for electronic transactions without relying on trust\". Traditional financial systems are opaque. As customers, we invest our trust in banks and other financial services providers to execute our transactions faithfully. However, a blockchain is transparent, removing the need to trust any central authority.\n\nThink of it like this: In a traditional financial system, a customer deposits their money with a bank, and the bank then takes some of this cash and lends it out to borrowers. The bank records both the deposit and the loan on its balance sheet. But the two customers – the depositor and the borrower – are invisible to one another and simply have to trust in the bank's ability to maintain their respective accounts properly.\n\nIn a blockchain, each network user has a 'copy' of the balance sheet, with the entire network taking on the bank's role. The network as a whole must reach a consensus for cryptocurrency transactions to be processed successfully. In other words, all their balance sheets need to match. When a new batch of transactions is successfully processed, it is encoded in a 'block', which is added to an immutable 'chain' of previous transactions.\n\nEach block in the chain is connected by a cryptographic code called a 'hash'. Maintaining the blockchain and developing increasingly complex hash codes requires time and consumes computing power. So, Nakamoto proposed that peers on the network be compensated with a new type of virtual currency – called a 'bitcoin' – in exchange for lending their resources to the blockchain.\n\nComing up with the code and creating new bitcoin tokens is done via a process called 'mining'.\n\nBitcoin mining\n\nMining is how new bitcoins are created and is an essential part of the blockchain. To confirm a new block of transactions and add them to the existing chain, users in the network compete to solve complex computational problems. This is how the cryptographic hash that links the chain together is derived. The first computer, or 'bitcoin miner', to solve the problem creates the hash and is awarded a number of bitcoin tokens. Then the process repeats itself.\n\nBitcoin mining requires a lot of computing power and can be a costly and time-consuming enterprise. However, many investors are drawn to the idea that they can literally mint new bitcoins simply by harnessing the power of their home computers.\n\nReal-world cryptocurrency mining is a bit tougher because solving these computational problems requires incredible processing power. Miners sometimes have to spend thousands of dollars on computer equipment capable of successfully mining bitcoin.\n\nOddly enough, the network's size determines the complexity of these problems rather than the number of transactions in the blockchain.\n\nIn the early days of Bitcoin, when there were fewer users on the network, many home computers had the processing capacity to solve these problems. However, as the network grew in popularity and added more users, the problems developed in complexity, so a larger group of computers wouldn't solve them more rapidly.\n\nThe rationale behind this is stabilising the flow of new bitcoins into circulation and thereby preserving its scarcity. The Bitcoin network aims to add one block to the chain roughly every 10 minutes, adjusting the complexity of the cryptographic problems to maintain that rhythm. This prevents the market from being flooded with new bitcoin tokens, but it also makes crypto mining increasingly expensive – and energy-inefficient.\n\nThe other major downside is that it is mainly down to chance as to which computer on the network will solve the problem – meaning you could invest all that processing power and energy and still get little in return. However, many die-hard miners would still argue that it's worth all the costs for the potential reward: brand-new bitcoins.\n\nBitcoin 'halving'\n\nAs of December 2023, the computer that solves the cryptographic problems the fastest is awarded 6.25 brand-spanking new bitcoins for its efforts. The award changes over time. In 2009, just after Nakamoto proposed the Bitcoin network, the winner was awarded a whopping 50 new bitcoins for their troubles.\n\nA process called 'halving' drives the reduction in the number of bitcoins awarded. Every time an additional 210,000 blocks are mined – roughly every four years – the number of new bitcoins minted through the mining process drops by half. In 2012, it dropped to 25 bitcoins; in 2016, it went down to 12.5; and in 2020, it fell to its current number, 6.25.\n\nIt's worth pointing out that 6.25 bitcoins created every 10 minutes is nothing to scoff at, considering it still translates to about $260,000 based on current market prices. It's potentially so lucrative that many companies focusing solely on bitcoin mining have sprung up across the globe.\n\nWhile it's true that a lot of bitcoin miners have jumped on board over the years, it's not for the faint-hearted. Some have lost part or all of their investments due to recent volatility in the bitcoin price. Specifically, the falling value and rising energy costs have made the undertaking uneconomical for some mining operators.\n\nTheoretically, the halving process is intended to continue until a limit of 21 million bitcoins is reached. At this point, computers on the network will be compensated with other fees for maintaining the fidelity of the blockchain. But we don't have to worry about this until about 2140, when the halving process is estimated to end.\n\nLike the increasing complexity of the cryptographic problems, halving helps preserve Bitcoin's scarcity. For many investors and enthusiasts, this element of scarcity is the thing that gives the cryptocurrency its value. Knowing that only a finite number will ever exist tends to make bitcoins intrinsically more valuable to people – as is the case with gold and other precious metals. For this very reason, many investors refer to Bitcoin as 'digital gold'.\n\nThe recent history of Bitcoin\n\nIn early 2009, shortly after Nakamoto first published the paper, the Bitcoin network was launched. The first ever Bitcoin transaction via the blockchain network happened only a few days later when Nakamoto transferred 10 bitcoins to software programmer Hal Finney.\n\nThe first commercial transaction using Bitcoin didn't occur until 2010 when a Florida computer programmer named Laszlo Hanyecz traded 10,000 bitcoins for two pizzas. The crypto world now commemorates this incidental transaction each year on 22 May under the aptly titled Bitcoin Pizza Day.\n\nFrom these humble beginnings, Bitcoin has grown into an asset with a global market capitalisation approaching US$800 billion. For context, that means by today's standards, Hanyecz would have paid more than US$400 million for those two pizzas. Hope they were worth it!\n\nBitcoin brought about an entirely new digital asset class – cryptocurrency. Other tech entrepreneurs are continuing to build on blockchain technology, with the Ethereum (CRYPTO: ETH) network, in particular, expanding blockchain applications.\n\nKey developments in the evolution of Bitcoin include:\n\nCreation of 'bitcoin cash'\n\nBitcoin cash (CRYPTO: BCH) launched in August 2017, following an event called a 'hard fork'. This is when there is a substantial change in the protocol or rules of a blockchain, such that the newest version of the blockchain no longer accepts the older chain of transactions. You can imagine this as a literal 'fork in the blockchain'. One chain continues under the 'old' rules while a second branches off, obeying an updated set of rules.\n\nIn the case of Bitcoin, the hard fork was a change in protocol that allowed for a larger number of transactions to be stored in each block, speeding up processing times. This hard fork effectively created a new blockchain with different rules and a new native cryptocurrency, dubbed 'bitcoin cash'. The crypto never took off with investors like Bitcoin did and has lost about 95% of its value since launching.\n\nThe latest Bitcoin halving\n\nThe halving process discussed earlier can significantly impact the price of Bitcoin. A reduction in an asset's supply tends to increase its price, which is observed with Bitcoin.\n\nThe Bitcoin price skyrocketed following its most recent halving in May 2020. A similar, though not as dramatic, price surge also occurred around the time of its 2016 halving. Who knows what impact the next halving – due sometime around April 2024 – will have on the Bitcoin price?\n\nBitcoin ETF creation\n\nIn February 2021, the world's first Bitcoin exchange-traded fund (ETF), backed by physically settled bitcoins, launched and became available to investors. The Purpose Bitcoin ETF (TSX: BTCC) was the first to offer access to the world's largest crypto asset using traditional investment vehicles without derivatives.\n\nThis was a big deal as it meant institutional investors and everyday people alike had an easy way to invest in Bitcoin without the arduous process of setting up a digital wallet and buying crypto directly.\n\nAs time has passed, others have joined in on providing various cryptocurrency ETFs. Even Australia witnessed the launch of its first crypto ETFs in April 2022. However, due to an underwhelming reception, one of the providers (Cosmos Asset Management) has since delisted its offering.\n\nBitcoin made legal tender\n\nThe Congress of El Salvador made an unprecedented decision in September 2021 to make Bitcoin legal tender in the country. President Nayib Bukele led the move in a bid to increase foreign investment and improve financial equality.\n\nThe #BitcoinLaw has been approved by a supermajority in the Salvadoran Congress.\n\n\n\n62 out of 84 votes!\n\n\n\nHistory! #Btc🇸🇻 — Nayib Bukele (@nayibbukele) June 9, 2021\n\nUpon implementing the crypto asset as a legally recognised form of payment, people in El Salvador could opt to pay for their coffee with a digital wallet containing bitcoins instead of United States dollars. However, the country still lacks widespread internet access, making the use of a crypto wallet a challenge for some. According to Trading Economics, the percentage of El Salvadorians using the internet in 2020 was 54.6%.\n\nMany have criticised El Salvador's decision, arguing it puts the country's financial stability at risk. In early 2022, the International Monetary Fund (IMF), an international financial institution, urged El Salvador to backtrack its Bitcoin adoption. It warned that it would be difficult to provide a loan to the country in the event of economic distress.\n\nThe Central Republic of Africa followed in El Salvador's footsteps, adopting Bitcoin as legal tender in April 2022. Though, the local parliament repealed the cryptocurrency's newfound status in the country earlier this year.\n\nBitcoin performance so far\n\nDespite its price volatility, Bitcoin has delivered some staggering returns. It's mind-boggling to think that, as recently as 2016, you could buy a bitcoin token for well under US$1,000. The coins are now valued at more than US$40,000 apiece!\n\nHowever, investing in Bitcoin is not for the faint-hearted. Although it has delivered some astounding long-term returns, the price of Bitcoin has been incredibly unstable. Plenty of investors have still lost big by mistiming the market.\n\nIf you choose to invest in Bitcoin, ensure you understand the risks involved. And don't invest any money you can't afford to lose.\n\nAdding Bitcoin to a portfolio\n\nSpeaking of investing in Bitcoin… you might be wondering how someone would go about converting their fiat currency into crypto. Aside from mining, there are several methods for gaining exposure to Bitcoin these days.\n\nOnce upon a time, to facilitate a transaction, people would need to trawl through forums to find someone willing to sell their bitcoins. In the present day, the process is much less tedious, thanks to the proliferation of crypto exchanges. Now a variety of platforms exist where bitcoins can be bought and sold, much like any other asset. Popular exchanges include CoinSpot, CoinJar, Kraken, and Swyftx.\n\nInvestors can also buy into a Bitcoin ETF, such as the Global X 21 Shares Bitcoin ETF, which essentially tracks the price without owning any underlying coins. This option has gained popularity among those who want to add crypto to their portfolio without the complexities of buying and storing it.\n\nOne other method that is still viable is the use of a good old-fashioned automated teller machine (ATM) with a new twist. That's right, Bitcoin ATMs exist… and there isn't just one of them, but 750 scattered throughout the country.\n\nSource: Bitcoinist\n\nHowever, a cryptocurrency exchange is typically the most convenient option for people looking to add Bitcoin to their portfolio.\n\nLet's go through some basic steps to becoming a Bitcoin 'holder'.\n\nHow to buy Bitcoin\n\nThe first point of order in purchasing the original crypto asset via an exchange is to find a reputable source. Research online to find an exchange that has been around for some years. It needs to be well-known among crypto investors with minimal transaction fees.\n\nOnce you have found a suitable platform, the next step is to register an account. This part of the process is similar to what is required when setting up a bank account. You'll need to provide personal details and identification documents for the exchange to fulfil its 'know your customer' obligations.\n\nFrom here, it is as simple as depositing funds into your account using a payment option such as direct deposit, PayID, or linking a debit or credit card. After the funds have landed, it's a matter of finding Bitcoin on the exchange and placing an order.\n\nWhat to do after buying\n\nOnce you have placed your order and successfully purchased your Bitcoin, the next step is to look for a digital wallet to store your new asset.\n\nWhile you can keep your crypto on the exchange, it is much less safe than storing it in your own personal wallet. Cybercriminals often target exchanges, hoping to breach the security of such operations for financial gain.\n\nA few different types of wallets are available, but the two most common are 'hot wallets' and 'cold wallets'. A hot wallet stores your Bitcoin online and is connected to the internet. A cold wallet stores your Bitcoin offline on a USB drive or in a paper wallet.\n\nThe benefit of using a hot wallet, such as MetaMask, is that it is much more convenient for everyday bitcoin payments. This is because you can easily transfer funds in and out of it. However, it is also more vulnerable to hacks because it is connected to the internet.\n\nThis is where a cold wallet comes in handy. It provides an added layer of security by keeping your bitcoins – or, more specifically, your private key – isolated and offline. Popular cold wallet options include those sold by Ledger and Trezor.\n\nExamples of cold wallet options. Image sources: Ledger and Trezor\n\nOnce you have chosen a Bitcoin wallet, you must transfer your bitcoins from the exchange account into your preferred wallet. This is a relatively simple process, but it is essential to check you are moving to the correct wallet address to avoid losing your funds. Double-check and triple-check! There are no intermediaries to reverse a transfer in the crypto world.\n\nYou should now be familiar with Bitcoin, especially if you now own some. Make sure to keep your private key safe. Whoever has access to it will have access to your Bitcoin.\n\nAnd welcome to the world of cryptocurrency!"
    }
]