[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vcmVhc29uLmNvbS8yMDIzLzA0LzA2L3Byb3Bvc2l0aW9uLWJpdGNvaW4taXMtdGhlLWZ1dHVyZS1vZi1mcmVlLWV4Y2hhbmdlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Debate: Bitcoin Is the Future of Free Exchange - Reason",
        "content": "Bitcoin Is an Effective Tool for Liberty\n\nAffirmative: Alex Gladstein\n\nThere was a time when it was fair to question whether bitcoin was an effective tool for liberty. In its first few years, when the digital currency didn't have many users, wasn't worth very much, and lacked global markets, it was more a dream than a lifeline. But those days are long gone. Today, millions of people—especially in dictatorships and collapsing economies—rely on bitcoin to give them liberty that governments and corporations try to steal away.\n\nMost bitcoin users aren't \"freedom fighters\" or \"dissidents\" in the classic sense. Some are: human rights activists in Belarus, investigative journalists in Russia, humanitarians in Ukraine, feminists in Nigeria, pro-democracy organizers in Togo, educators in Taliban-ruled Afghanistan, and even whistleblowers in the West. But the vast majority are simply people finding value in a financial network that can't be devalued, censored, or stopped. One doesn't need to see oneself as a revolutionary to want a digital form of cash that doesn't require ID and doesn't need permission from the state to operate. One might just be trying to escape from a broken fiat system.\n\nIf liberty is freedom and self-sovereignty, then bitcoin is the purest expression of financial liberty. It gives anyone—regardless of birthplace, nationality, age, gender, creed, skin color, education, or wealth—access to the best-performing financial asset of the last decade. It lets anyone with a cellphone send and receive value from anyone else, regardless of what governments think and regardless of borders and political restrictions.\n\nBitcoin is a superb tool for fundraising for human rights groups and journalists at risk. But it's also—much more importantly in terms of global economic volume—a superb tool for merchants accepting payments from customers in a different country, for employers making payments to employees or contractors half a world away, or for laborers sending remittances to families overseas.\n\nFor people in the Global South, bitcoin might be much more valuable than for people in advanced economies. For example, Africa is still divided by more than 45 central banks and 45 different fiat currencies. It is also exploited by colonial currencies like the French CFA franc, and by a neocolonial payment infrastructure where 80 percent of all inter-African payments are processed by American or European companies and where the average fee to send a $200 cross-border payment or remittance from the U.S. or Europe to sub-Saharan Africa is 7 percent.\n\nMaking matters worse, corrupt governments enforce a fake \"official rate\" of exchange in many countries. In Nigeria, the dollar trades for 750 naira on the street but just 450 at regulated institutions. For many companies in Africa, bitcoin is a major upgrade. It allows them to send and receive value at the real exchange rate in seconds from anywhere in the world, colonial boundaries and rent-seeking intermediaries be damned.\n\nBitcoin can also be an important tool for liberty for citizens of the United Kingdom or Japan or the United States. What if they have family living in the Global South, where sending money is a persistent problem? What if they have friends or clients in Palestine or Cuba, where economic barriers make it difficult if not impossible to send money digitally through the legacy system? What if they have upset the administrators of the payment platform du jour—Patreon or PayPal, perhaps—and are no longer able to collect donations from their fans? Then despite their financial privilege, bitcoin can be a big help.\n\nAt its core, bitcoin protects one of the most fundamental liberties—property rights. All it takes is a few minutes of Wi-Fi to download a bitcoin app, back up the seed phrase, and generate an address. Then voila: You now have a way for anyone else in the world to pay you. No one can confiscate your funds without access to your private key. No one can debase your earnings. No one can prevent you from sending value to anyone else. Before Satoshi Nakamoto invented bitcoin in 2009, property rights existed at the pleasure of the state. A group of men with guns enforced them. Today, in the post-bitcoin world, property rights exist regardless of the state. Now they are protected by math.\n\nBitcoin inarguably has room to grow. Its privacy, user interface, and liquidity leave much to be desired—and are constantly improving. These upgrades will be desperately needed as the world edges closer to a place where governments consolidate power over citizens through central bank digital currencies and the elimination of paper cash.\n\nVast strides have been made in each of bitcoin's weak areas in the past five years. For someone living in war-torn Ukraine or drought-stricken Somalia, it's easy enough to receive bitcoin from a donor abroad and to sell it for cash, all in minutes. No passport or bank account or technical expertise is required. In sub-Saharan Africa, it's even possible to use bitcoin (with a few tradeoffs) with no internet whatsoever, through a popular mobile text messaging protocol.\n\nBitcoin's critics have generally never had to deal personally with financial repression. When their bank accounts eventually get frozen, when their payment apps deplatform them, when their wages get devalued, or when their government shows up at their doors asking where a certain bank wire came from, then—finally—they'll understand bitcoin's value proposition.\n\nGold, Not Bitcoin, Is the Most Likely Replacement for Fiat Money\n\nNegative: Lawrence White\n\nI come to praise bitcoin, not to bury it. I certainly don't come to praise government fiat money or central banking, which I've been criticizing in print for my entire career. My first two books, Free Banking in Britain and Competition and Currency, present the case for free and decentralized banking over central banking. I would love it if the world economy were to run on a completely private monetary standard with free banking.\n\nMy forthcoming book, Better Money: Gold, Fiat, or Bitcoin?, argues that gold would be a better monetary standard than bitcoin, and that gold is the standard more likely to emerge bottom-up from free choice by money users. We should appreciate bitcoin for the remarkable thing that it is, not for what it isn't and not for what it isn't likely to become.\n\nBitcoin has succeeded tremendously at creating a valuable new type of asset. As Alex Gladstein has emphasized, it provides a remarkable censorship-resistant value-transfer system. But, sad to say, it hasn't replaced government fiat money as an everyday or commonly accepted medium of exchange, and it isn't getting any closer to doing so. Granted, some people use bitcoin to remit funds across borders, which counts as medium-of-exchange use, but that too is uncommon. There are cheaper routes for ordinary remittances.\n\nLet me unpack the term \"medium of exchange.\" It means a good that is acquired by trading away a good or service, and which is intended to be spent in acquiring a third good or service.\n\nThat's not a common pattern with bitcoin. Few people are paid in bitcoin. Few people routinely buy or sell goods and services for bitcoin. Fewer than 3,000 merchants in the United States publicly accept bitcoin, according to NerdWallet subsidiary Fundera's last count. There are economic reasons for that, most importantly that the purchasing power of bitcoin is highly volatile. It would be a dangerous way to hold your rent money, because its value can drop 10 percent in a few days. Mostly, bitcoin is purchased with fiat (or fiat stablecoins) not to be spent, but to be \"hodled\" (held) as a form of savings or \"store of value,\" in hopes that its price will rise. When unhodled, it is mostly exchanged back into fiat.\n\nBitcoin is not on a trajectory to replace established monies. In the last few years it has actually lost the one niche where it was the leading medium of exchange, namely crypto-asset markets. Bitcoin used to be the main exchange medium used in buying and selling Ether, Dogecoin, Zcash, Monero, and the other coins that constitute the other 58 percent of the total crypto-asset market. No longer. The No. 1 medium of exchange on crypto markets is now USD Tether, followed by other U.S. dollar stablecoins.\n\nFollowing its current trajectory, bitcoin will continue to serve as a savings vehicle and a niche censor-resistant value-transmitting system, and continue to exhibit high price volatility, without ever replacing other monies as a commonly accepted medium of exchange.\n\nMany bitcoin owners are happy with hodling as a way to get rich. To no-coiners they say: \"Have fun staying poor.\" They don't feel the need to insist that bitcoin will supplant established monies. But others want to say that bitcoin is bound to, eventually, take the place of fiat monies, including the dollar, and that it is the future of free exchange.\n\nI can't say it's logically impossible for bitcoin to replace established fiat monies, but bitcoin's built-in volatility makes that unlikely.\n\nOne bitcoiner has proposed an \"inevitability sequence\" in which a growing market cap brings declining price volatility, that encourages wider acceptance of bitcoin as a medium of exchange, and that reinforces declining price volatility, generating a positive feedback loop.\n\nOne problem: There's no evidence of declining price volatility after 13 years.\n\nA second problem: There's no reason to expect it. Demand for bitcoin remains predominantly speculative, and every demand swing is fully reflected in price because the quantity of bitcoin—unlike ordinary commodities—does not respond to changes in demand that change its price. In Econ 101–speak, the bitcoin supply curve is vertical, completely price-inelastic. By contrast, a demand surge that raises the price of toilet paper soon leads to the production of more toilet paper, bringing the price back down. Gold has a slightly elastic supply in the short run, but very elastic supply over the long term.\n\nA single common money emerges spontaneously because of the network property of a medium of exchange. Silver (or salt, or a cowrie shell) is more useful to you as a medium of exchange if a greater number of potential trading partners accept it. An established money therefore has a strong incumbency advantage.\n\nThe 6.4 percent inflation rate of January 2023 (over January 2022), even if it persists, will unfortunately not be sufficient to reverse the U.S. dollar's incumbency advantage. The recent experiences of other countries with high inflation demonstrate that it takes an inflation rate much higher than 6.4 percent to get people to abandon an incumbent currency and start using something else for ordinary exchanges.\n\nWhen a country hyperinflates and people do switch (as in Venezuela and Lebanon in recent years), they predominantly switch to U.S. dollars. But, you might ask, what if all the major government fiat monies were to become nearly as bad as the Venezuelan bolivar? Even in the unlikely event that all the fiats do hit 20 percent inflation or more, the gold standard would be more likely to reemerge than a bitcoin standard. On top of gold's relatively limited volatility, the World Gold Council puts nonbank public ownership at $2.8 trillion in gold coins and bullion, versus the less than $0.5 trillion market cap for bitcoin (with the current price below $25,000). Gold has a larger network.\n\nSubscribers have access to Reason's whole May 2023 issue now. These debates and the rest of the issue will be released throughout the month for everyone else. Consider subscribing today!"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDQvMDcvdGhlLWJpdGNvaW4td2hpdGUtcGFwZXItaGFzLWJlZW4taGlkZGVuLW9uLW1hY3Mtc2luY2UtMjAxOC1oZXJlcy1ob3ctdG8tZmluZC1pdC_SAXpodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA0LzA3L3RoZS1iaXRjb2luLXdoaXRlLXBhcGVyLWhhcy1iZWVuLWhpZGRlbi1vbi1tYWNzLXNpbmNlLTIwMTgtaGVyZXMtaG93LXRvLWZpbmQtaXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "The Bitcoin white paper has been hidden on Macs since 2018. Here’s how to find it - Fortune",
        "content": "On every Mac operating system post 2018, a nine-page PDF is hidden inside a nest of folders. That PDF is none other than the Bitcoin white paper, the famed theoretical outline of the cryptocurrency authored by Satoshi Nakamoto, Bitcoin’s anonymous inventor.\n\nOn Wednesday, Andy Baio, former CTO of Kickstarter, was the first to publicly announce that he had found the squirreled-away PDF after he tried to connect a combination printer-scanner to his MacBook.\n\n“I’ve asked over a dozen Mac-using friends to confirm, and it was there for every one of them,” he wrote on his more than two decades old blog. He thinks the white paper’s inclusion was the work of a single engineer, rather than an Easter egg ordained from on high.\n\nWhile Baio has been a techie for decades, it’s relatively simple to find the same document on your very own Mac. Here’s how:\n\nUsing Terminal\n\nEvery iteration of the Mac operating system has what’s called Terminal, or a way to explore a computer’s file system through text commands. To access Terminal on your Mac, simply go to the Applications folder, then open the Utilities folder, and click on it.\n\nBaio wrote a simple command for Mac users to reveal the hidden Bitcoin white paper. Copy and paste the following code into Terminal once it’s open:\n\nopen /System/Library/Image Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nUsing Finder\n\nThe more time-intensive approach—but one with a technologically lower bar—is to navigate through Finder, a Mac’s file management system.\n\nOpen a Finder window, navigate to the System folder, and prepare yourself for a deluge of clicks.\n\nFrom Systems, go to Library, Image Capture, and then Devices. Once in Devices, right click on VirtualScanner and choose Show Package Contents. That should open up another folder titled Contents, through which you should navigate to Resources, which will reveal a number of files.\n\nClick on simpledoc.pdf, and voilà! You should finally have arrived at your destination: the nine-page outline that detailed the theoretical specifications of Bitcoin, a piece of digital dust that, in aggregate, is worth well over $500 billion as of Friday afternoon."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy93aG8taXMtc2F0b3NoaS1uYWthbW90by1iaXRjb2luLWludmVudG9yLWNyeXB0by1zdGV2ZS1qb2JzLWFwcGxlLTIwMjMtNNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Who Is Satoshi Nakamoto? the Bitcoin Legend Is As Mysterious As Ever. - Markets Insider",
        "content": "Satoshi Nakamoto is said to be the inventor of bitcoin and wrote the token's original white paper in 2008.\n\nCrypto fans this week celebrated Nakamoto's 48th birthday amid new theories as to their true identity.\n\nHere's what to know about the mysterious icon behind the world's largest cryptocurrency.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nSatoshi Nakamoto is the name of the individual or group credited with inventing bitcoin, the world's largest cryptocurrency. Their legend is shrouded in mystery.\n\nThe inventor's identity has never been confirmed, though April 5 marked their 48th birthday, according to information on a profile with The P2P Foundation.\n\nThis week, conspiracy theories connected the figure to the late Steve Jobs, the visionary Apple cofounder, following the revelation that Apple has shipped out Mac computers since 2018 with a copy of the original bitcoin white paper.\n\n\"While trying to fix my printer today, I discovered that a PDF copy of Satoshi Nakamoto's Bitcoin whitepaper apparently shipped with every copy of macOS since Mojave in 2018,\" technologist Andy Baio wrote in an April 5 blog post.\n\nAdvertisement\n\nNakamoto's paper, \"Bitcoin: A Peer-to-Peer Electronic Cash System,\" was published in October 2008. The abstract reads:\n\n\"A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution.\"\n\nSince then, bitcoin has become the largest cryptocurrency, with a market cap of about $540 billion, according to CoinMarketCap data on Friday.\n\nWhat we know about Satoshi Nakamoto\n\nSomeone is behind the name, given that they invented bitcoin's complex source code, authored a white paper, and interacted with users on web forums.\n\nAdvertisement\n\nNakamoto's profile on The P2P Foundation lists their location as Japan. In their posts, however, Nakamoto has used British English spellings and expressions, leading some to assume they are in fact not Japanese, as the inventor claimed. Additionally, some have pointed to the time stamps on Nakamoto's comments as reason to believe they were not located in Japan.\n\nIn 2011, a comment from that account stated that they had \"moved onto other things.\"\n\nThe name is also associated with a number of crypto wallets, presumably owned by Nakamoto. Some estimate that those wallets hold more than 1.1 million bitcoin tokens. When bitcoin peaked in November 2021 at $68,000, those holdings would have been worth about $73 billion, placing Nakamoto among the 15 riches people in the world at the time.\n\nSome have speculated that the chances Nakamoto is one person are low, given the complexity of bitcoin's source code.\n\nAdvertisement\n\n\"Either there's a team of people who worked on this or this guy is a genius,\" Dan Kaminsky, a leading internet-security researcher, told The New Yorker in 2011.\n\nIn his white paper, Nakamoto cited the work of Stuart Haber, a computer scientist credited with helping invent blockchain technology. Haber has echoed Kaminsky's sentiment that the programmer behind bitcoin would have had a \"keen intelligence.\"\n\nOther names that have been connected to Nakamoto\n\nIn 2013, Nick Szabo, a computer scientist who published research in 1998 on \"bit gold,\" a precursor to bitcoin, drew attention for potentially being Nakamoto. He has denied it, and financial writer Dominic Frisby has said no proof exists connecting the two figures.\n\n\"The most convincing evidence pointed to a reclusive American man of Hungarian descent named Nick Szabo,\" journalist Nathaniel Popper wrote in The New York Times in 2015.\n\nAdvertisement\n\nA Newsweek article in 2014 said that Dorian Prentice Satoshi Nakamoto, a Japanese American man living in California, was the elusive inventor of bitcoin. According to the article, he was trained as a physicist and worked on classified defense projects, but he, too, denied the claims.\n\nAfter the article published, Nakamoto's online account revived itself after a five-year hiatus, stating: \"I am not Dorian Nakamoto.\"\n\nThen, in December 2015, Wired posited that Australian researcher Craig Steven Wright \"either invented bitcoin or is a brilliant hoaxer who very badly wants us to believe he did.\"\n\nThe same day, Gizmodo published a story that said Wright, as well as computer scientist Dave Kleiman, together were involved in the invention of bitcoin.\n\nAdvertisement\n\nThen, in May 2016, Wright announced in a blog post that he did create bitcoin, though he was met with prominent crypto figures who said it was false.\n\nThe list of other potential candidates, apart from Apple's Jobs, includes the government, various other computer scientists, and even Elon Musk, who denied he was Nakamoto in a 2017 tweet.\n\nOn Friday, bitcoin hovered around $27,937. It has surged 68% in 2023."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDQvMDYvbWFnaWMtZWRlbi1yb2xscy1vdXQtYml0Y29pbi1vcmRpbmFscy1uZnQtY3JlYXRvci1sYXVuY2hwYWQv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3dlYjMvMjAyMy8wNC8wNi9tYWdpYy1lZGVuLXJvbGxzLW91dC1iaXRjb2luLW9yZGluYWxzLW5mdC1jcmVhdG9yLWxhdW5jaHBhZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Magic Eden Rolls Out Bitcoin Ordinals NFT Creator Launchpad - CoinDesk",
        "content": "\"We're on the ground level listening to what is needed from all of these subgroups of the Ordinals community, and we will look to deliver on those needs,\" said Head of Marketing at Magic Eden, Tiffany Huang. \"We think involvement of our expertise and resources is much needed to continue the growth of Ordinals and encourage a flourishing ecosystem.\""
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcHBsZS1oaWRkZW4tYml0Y29pbi1tYW5pZmVzdG8tZXZlcnktMTI1OTE4ODgwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Apple has hidden a bitcoin manifesto in every Mac since 2018, says a tech blogger who discovered it by accident - Yahoo Finance",
        "content": "Apple CEO Tim Cook attends an Apple store in Shanghai Thomson Reuters\n\nTechnologist Andy Baio wrote in an April 5 blog post that he found a PDF of the original bitcoin white paper on his Macbook.\n\nHe said Apple has seemingly hid the original crypto manifesto in \"every copy of macOS since Mojave in 2018.\"\n\nBaio shared how any users could locate the manifesto on their own Apple computers.\n\nTechnologist Andy Baio says he accidentally discovered a copy of Satoshi Nakamoto's bitcoin white paper on his Apple Mac computer.\n\n\"While trying to fix my printer today, I discovered that a PDF copy of Satoshi Nakamoto's Bitcoin whitepaper apparently shipped with every copy of macOS since Mojave in 2018,\" Baio wrote in an April 5 blog post.\n\nHe said he asked over a dozen of his friends and fellow Mac users to confirm, and the document was there for every single one, the file called \"simpledoc.pdf.\"\n\nTo find it, according to Baio's instructions, users can open the terminal and type the following command:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nFor those using macOS 10.14 or later, the document should immediately open in Preview as a PDF file, he explained.\n\nInsider tested out Baio's instructions and found a copy of the document stored on the computer running the most recent update of macOS.\n\nThe now-famous white paper, titled \"Bitcoin: A Peer-to-Peer Electronic Cash System\", was published in October, 2008 by the pseudonymous Satoshi Nakamoto. In it, the author lays out their thesis for the underlying mechanisms that power what is now the world's largest cryptocurrency by market value. The paper's abstract reads:\n\n\"A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution.\"\n\nBaio added that he found barely any other evidence online save for a lone Twitter thread from November 2020, with a user posting similar screenshots.\n\nStory continues\n\nBaio couldn't figure out why, of all documents, the original bitcoin manifesto was chosen to be included in Apple's operating system.\n\n\"Maybe,\" he wrote, \"it was just a convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.\"\n\nAs for token itself, bitcoin is hovering around $27,925 on Thursday, and has rallied 68% so far in 2023. The crypto has seen nearly 24% of those gains come in March amid broader banking turmoil and uncertainty.\n\nRead the original article on Business Insider"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vbWFzaGFibGUuY29tL2FydGljbGUvYXBwbGUtbWFjb3MtYml0Y29pbi13aGl0ZXBhcGVyLWhpZGRlbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Apple's macOS has a hidden Bitcoin easter egg - Mashable",
        "content": "A copy of the Bitcoin whitepaper, a seminal document authored by pseudonymous author Satoshi Nakamoto, can be found in every copy of Apple's macOS since Mojave.\n\nThe file, unearthed by Waxy, isn't exactly hidden, though it's not very easy to be found unless you know exactly where to look for. To see it, open the Terminal app and paste the following string into it: \"open /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\"\n\nAnother way to see it is to open Finder, click on Macintosh HD at the bottom of the window, then System - Library - Image Capture - Devices. There, right click on VirtualScanner.app and choose \"Show Package Contents.\" Open Resources, and click on \"simpledoc.pdf.\"\n\nIt's there all right. Credit: Stan Schroeder/Mashable/Apple/Satoshi Nakamoto\n\nThe \"simpledoc.pdf\" is a PDF document containing the nine-page Bitcoin whitepaper in its entirety. It appears to have been put there as one of several sample documents, including another PDF called \"numbers.pdf,\" containing only four numbers in very large typeface, as well as a mysterious image called \"cover.jpg,\" which is a photo that appears to have been taken on Treasure Island in San Francisco.\n\nThis image can be found in the same folder as Satoshi's Bitcoin whitepaper. Credit: Stan Schroeder/Mashable/Apple\n\nThe discovery of the image and the Bitcoin whitepaper isn't entirely new; designer Joshua Dickens found them in 2020, though it didn't gain much traction online at the time.\n\nI found the files on my Mac which runs the latest version of macOS Ventura, 13.2.1, and one of my colleagues at Mashable found it on their Mac, running Big Sur 11.7, as well. The files appear to be there in every copy of macOS since Mojave (10.14.0), which was launched in 2018.\n\nIt's unclear why Apple would deliberately choose to include the Bitcoin whitepaper in macOS. The document, titled \"Bitcoin: A Peer-to-Peer Electronic Cash System,\" was originally published by Nakamoto in 2008 and contains a technical overview of the Bitcoin protocol. Apple has never, to my knowledge, publicly endorsed Bitcoin or any other cryptocurrency; in fact, the company has been fairly reserved when it comes to crypto (unlike, say, Samsung, which includes a cryptocurrency wallet software on its Galaxy phones). CEO Tim Cook did say in 2021 that crypto is something the company is \"looking at,\" though he did also say Apple had nothing crypto-related to announce at the time.\n\nFeatured Video For You The solution to bitcoin's massive carbon footprint could be...volcanoes? — Future Blink\n\nA likely explanation is that an Apple engineer tasked with coming up with some sample documents chose the Bitcoin whitepaper and the mysterious image just for fun, though we're sure the internet will quickly come up with conspiracy theories of all sorts in a minute."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnJvdXRlLWZpZnR5LmNvbS9lbWVyZ2luZy10ZWNoLzIwMjMvMDQvdGV4YXMtbWF5LWRpYWwtYmFjay1iaXRjb2luLW1pbmluZy1pbmNlbnRpdmVzLzM4NDk1OC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Texas may dial back bitcoin mining incentives - Route Fifty",
        "content": "Cookie Preferences Cookie List\n\nCookie List\n\nA cookie is a small piece of data (text file) that a website – when visited by a user – asks your browser to store on your device in order to remember information about you, such as your language preference or login information. Those cookies are set by us and called first-party cookies. We also use third-party cookies – which are cookies from a domain different than the domain of the website you are visiting – for our advertising and marketing efforts. More specifically, we use cookies and other tracking technologies for the following purposes:\n\nStrictly Necessary Cookies\n\nWe do not allow you to opt-out of our certain cookies, as they are necessary to ensure the proper functioning of our website (such as prompting our cookie banner and remembering your privacy choices) and/or to monitor site performance. These cookies are not used in a way that constitutes a “sale” of your data under the CCPA. You can set your browser to block or alert you about these cookies, but some parts of the site will not work as intended if you do so. You can usually find these settings in the Options or Preferences menu of your browser. Visit www.allaboutcookies.org to learn more.\n\nFunctional Cookies\n\nWe do not allow you to opt-out of our certain cookies, as they are necessary to ensure the proper functioning of our website (such as prompting our cookie banner and remembering your privacy choices) and/or to monitor site performance. These cookies are not used in a way that constitutes a “sale” of your data under the CCPA. You can set your browser to block or alert you about these cookies, but some parts of the site will not work as intended if you do so. You can usually find these settings in the Options or Preferences menu of your browser. Visit www.allaboutcookies.org to learn more.\n\nPerformance Cookies\n\nWe do not allow you to opt-out of our certain cookies, as they are necessary to ensure the proper functioning of our website (such as prompting our cookie banner and remembering your privacy choices) and/or to monitor site performance. These cookies are not used in a way that constitutes a “sale” of your data under the CCPA. You can set your browser to block or alert you about these cookies, but some parts of the site will not work as intended if you do so. You can usually find these settings in the Options or Preferences menu of your browser. Visit www.allaboutcookies.org to learn more.\n\nSale of Personal Data\n\nWe also use cookies to personalize your experience on our websites, including by determining the most relevant content and advertisements to show you, and to monitor site traffic and performance, so that we may improve our websites and your experience. You may opt out of our use of such cookies (and the associated “sale” of your Personal Information) by using this toggle switch. You will still see some advertising, regardless of your selection. Because we do not track you across different devices, browsers and GEMG properties, your selection will take effect only on this browser, this device and this website.\n\nSocial Media Cookies\n\nWe also use cookies to personalize your experience on our websites, including by determining the most relevant content and advertisements to show you, and to monitor site traffic and performance, so that we may improve our websites and your experience. You may opt out of our use of such cookies (and the associated “sale” of your Personal Information) by using this toggle switch. You will still see some advertising, regardless of your selection. Because we do not track you across different devices, browsers and GEMG properties, your selection will take effect only on this browser, this device and this website.\n\nTargeting Cookies\n\nWe also use cookies to personalize your experience on our websites, including by determining the most relevant content and advertisements to show you, and to monitor site traffic and performance, so that we may improve our websites and your experience. You may opt out of our use of such cookies (and the associated “sale” of your Personal Information) by using this toggle switch. You will still see some advertising, regardless of your selection. Because we do not track you across different devices, browsers and GEMG properties, your selection will take effect only on this browser, this device and this website."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzVlMDZlMjdiLWE0NWQtNDM1Yy04OTdiLTNjOGUwZTFkMmI2ZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "El Salvador hasn't defaulted. Don't thank Bitcoin - Financial Times",
        "content": "Print this page\n\nDid a bitcoin per day keep default away? So El Salvador’s crypto-touting Presidente would have us believe.\n\nSince January, the country has led Citi’s emerging market sovereign bond index as the top outperformer year to date, with returns of 22.2 per cent.\n\nAnd in late January, Nayib Bukele announced (over Twitter, of course) that his country had dodged default. With help from the Central American Bank for Economic Integration (CABEI) and the Development Bank of Latin America (CAF), El Salvador repaid in full an $800mn bond which was set to mature a week later.\n\nThroughout his presidency, Bukele has spooked investors and conventional financiers like the IMF. The prices of its bonds began to tumble in mid 2021, after Bukele did normal dictator-like things, like firing judges and brutal crackdowns. Worse still was Bukele’s face plant into cryptomania. After embracing Bitcoin and buying up plenty (2,381 as of last November), the cryptocurrency selfishly collapsed.\n\nRating agency Fitch said a “default of some sort” was probable downgrading the country’s debt into junk territory. Moody’s did the same. At their nadir in July 2022, El Salvadoran bonds maturing in 2025 and 2027 traded at 26.38 and 25.13 cents on the dollar respectively.\n\nBut times have changed. In February, Moody’s changed its outlook from negative to stable, citing a “decreased risk of a credit event in the near term” and “manageable” repayments on the 2025 bond. Its 2025 and 2027 debts are now trading at 78.39 and 55.92 cents on the dollar.\n\nSo, ¿que pasa?\n\nSaviour complex\n\nAéter settling the bond, Bukele turned his wrath on the media. “[A]lmost every legacy international news outlet said that because of our “#Bitcoin bet”, El Salvador was going to default on its debt by January 2023,” he lamented, claiming there were “[l]iterally, hundreds of articles” that did so (while apparently struggling to find very many of them).\n\nIn the past year, almost every legacy international news outlet said that because of our “#Bitcoin bet”, El Salvador was going to default on its debt by January 2023 (since we had an 800 million dollar bond maturing today).\n\n\n\nLiterally, hundreds of articles https://t.co/rEiK7K13U4 — Nayib Bukele (@nayibbukele) January 24, 2023\n\nBukele has connected his making Bitcoin legal tender in September 2021 with the country’s improved economic fortunes, saying it gave El Salvador an “advantage in the new economic system” and spurred private investment from “people escaping censorship.”\n\nBut was it really Bitcoin that helped El Salvador dodge default? Perhaps the truth is much more mundane.\n\nEl Salvador regained many investors’ graces in July 2022, after announcing a $1.6bn bond buyback using special drawing rights from the IMF and a $200mn loan from the Central American Bank for Economic Integration. Buybacks in September and December reduced the principal for the 2025 bond to $348mn from $800mn.\n\n“The buybacks to some extent fixed their communication issues. They changed from catering to the crypto community back to catering to traditional investors,” says Esteban Tamayo, a Citi economist covering the region.\n\nThe country is even earning something of a reputation for financial prudence.\n\n“When you dig in, while El Salvador has its share of difficulties, the amount of debt is manageable and the budget is under control,” says Aaron Stern, chief investment officer and managing partner at Converium Capital.\n\nAccording to Fitch, the government’s fiscal deficit was 2.7 per cent of GDP in 2022, down from 5.7 per cent in 2021 and 10.1 per cent in 2020 - driven by the post-pandemic economic rebound, subsidy cuts and enhanced tax collection.\n\n“There was a windfall of revenues in 2022, because there was better compliance on income tax collection. If you’re in a somewhat autocratic country, you’re going to be motivated to pay your income taxes,” says Siobhan Morden, managing director Latin America fixed income strategy at Santander Investment Securities.\n\nPublic debt has also decreased to 78 per cent of GDP, down from 82.4 per cent in 2021.\n\nThe IMF says the economy is bound for moderate real GDP growth in 2023, 1.7 per cent, after expanding by 2.8 per cent the previous year. This is in line with its peers in Latin America and the Caribbean, but below its peers in the emerging and developing economies bracket.\n\nWhile Bukele’s anti-crime initiatives have not endeared him to human rights advocates, the “unprecedented reduction in crime” has contributed to robust economic and investment activity, says the IMF. Bukele asked congress to agree to a state of emergency last March, giving him the power to go after the notorious Barrio 18 and MS-13 gangs. However, he is accused of sweeping up and disappearing innocents as well as gang operatives. Less crime means there’s plenty to like for investors, as well as tourist fans of Bitcoin, surfing, and the Miss Universe pageant. Less so for critics of arbitrary detentions and cattle pen prisons.\n\nMeanwhile investors are heartened that the government has some additional levers to pull. In December the government passed a pension system reform bill which imposed a cap of $3,000 per month and gave it the ability to tap into private pension savings as a source of income. While dipping into pension pots would be a bold move for even a popular President, investors are somewhat assured that the option is open.\n\n“There is still budget flexibility… fiscal adjustment could occur under the inertia and spending constraints of dollarisation since you cannot spend what you cannot borrow, ” Santander said in a note.\n\nEl Salvage-ador\n\nIt also looks like Bukele’s bitcoin dalliance hasn’t sunk the ship — for now. Partially, this is because it has bombed. In the concluding statement of its January mission, the IMF said that the “risks have not materialised due to the limited Bitcoin use so far,” — according to the University of Chicago, less than 20 per cent of businesses accept it alongside the greenback. The mooted volcano bonds, meanwhile, are going out with a whimper — “our view is that traditional investors won’t participate – making it less likely that they will try to issue it,” said Tamayo. The experiment flopping has proven a help rather than a hindrance.\n\nBut whether the world’s most online dictator can keep the wheels on is a different question. The current account deficit rose to 8 per cent of GDP in 2022, due to skyrocketing import volumes, with international reserves falling to around two months of imports.\n\n“They’ve been smashing up their reserves, which is never a good plan,” says Stephen Bailey-Smith, a portfolio manager at Global Evolution. “For me they need to further tighten up monetarily, at least in order to maintain the spread with the Federal Reserve funds rate to stem import demand and prevent locals taking money offshore”.\n\nThe same pension reform which gave the government dipping rights also increased entitlements by 30 per cent, likely creating larger liabilities for El Salvador’s treasury.\n\nThe country’s domestic debt stock, 8.75 per cent of GDP, is high too, due to high spending and tax revenue hits during Covid-19. It still has nine international dollar bonds worth $6.4bn, roughly 30 per cent of its gross domestic product.\n\nAccess to international capital markets is a further issue, with Moody’s saying the 2025 bond payments are achievable “so long as multilateral disbursements remain around programmed levels.” An IMF deal also looks elusive.\n\n“If you have a high debt stock you’re not going to be able to reduce that overnight, you have to generate a primary fiscal surplus for several years to work that down,” says Siobhan Morden from Santander Investment Securities.\n\n“The problem that El Salvador has is that there are very limited financing alternatives, they’ve saturated their local markets and they do not get a lot of access to multilateral money, because they do not have an IMF program.”\n\nAnd with an election coming up, investors are fretting about whether Bukele can keep the purse strings tight.\n\n“He’s held expenditure quite flat, which is really encouraging. But can he continue to do that, in the year before the [February 2024] election?” asks Bailey-Smith.\n\nWhile it was Bukele’s crypto capers that captured headlines, his real priorities seem much more pedestrian.\n\nFurther reading\n\nEl Bagholder strikes again"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2NvdWxkLXN0ZXZlLWpvYnMtYmUtYmVoaW5kLWJpdGNvaW4tc2F0b3NoaS1uYWthbW90by1teXN0ZXJ5LWRlZXBlbnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "The Bitcoin Whitepaper may still be secretly stored on your computer - CryptoSlate",
        "content": "The Bitcoin whitepaper was found as a hidden file on Mac computers in 2020, and today rumors have been refueled as the whitepaper is confirmed to still be present on the current Mac OS, sparking speculation that Steve Jobs is Satoshi Nakamoto.\n\nMultiple people have posted to confirm this finding, including the Twitter account Documenting Bitcoin – which showed a video demonstrating the file path to accessing the whitepaper.\n\n“/System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf“\n\nDocumenting Bitcoin added that the file is available on every Mac running Catalina or newer operating systems.\n\nCatalina launched in October 2019, bringing additional new features, including updated security and iPad as a second screen functionality.\n\nIs Steve Jobs the creator of Bitcoin?\n\nThe identity of Satoshi Nakamoto remains clouded in mystery to this day.\n\nThe issue is all the more puzzling, considering the reported 750,000 to 1.1 million Bitcoin fortune that Nakamoto controls remains untouched.\n\nOver the years, the Bitcoin community has put forward several names as likely candidates, including Hal Finney, who was extensively involved in its development before his death. And Nick Szabo, having published a paper on “Bit gold” in 1998 – more than a decade before Bitcoin – which detailed a decentralized, proof-of-work virtual currency.\n\nGiven Jobs’ hand in bringing personal computers to the mass market, the late Apple co-founder has also been linked as the BTC creator – albeit less likely- as he is considered a visionary and business magnate rather than a coder and cryptographer.\n\nSpeculators say Nakamoto is possibly a group of individuals, with one or all having ties to Japan in some capacity, such as living there at some point.\n\nWhat happened to Satoshi?\n\nNakamoto’s last public contact occurred as a post on the bitcointalk.org forum on Dec. 12, 2010.\n\nThe message stated that work was being done to counter Denial of Service attacks. It gave no indication of stepping back from the project. To date, no further communication has been received from that account.\n\n“There’s more work to do on DoS, but I’m doing a quick build of what I have so far in case it’s needed, before venturing into more complex ideas. The build for this is version 0.3.19.”\n\nIn November 2021 (at the market top,) Apple’s current CEO Tim Cook expressed support for holding Bitcoin or Ethereum as part of a diversified portfolio. While he acknowledged a personal interest in cryptocurrency, Cook denied any plans for collaboration or partnership between Apple and the crypto industry.\n\nSteve Jobs died of pancreatic cancer on Oct. 5, 2011."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zMGstYnRjLXByaWNlLXN0YXlzLXZhbGlkLWFzLWJvcmluZy1iaXRjb2luLWhlYWRzLWludG8tdXMtam9icy1kYXRh0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "$30K BTC price target stays valid as 'boring' Bitcoin heads into US jobs data - Cointelegraph",
        "content": "Bitcoin (BTC) stuck to a narrow trading range into April 7 as crypto analysts awaited the week’s main United States macroeconomic data.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\n$30,000 or $25,000 for Bitcoin?\n\nData from Cointelegraph Markets Pro and TradingView confirmed another day ranging around $28,000 for BTC/USD.\n\nThe pair had shunned volatility over most of the week but now faced nonfarm payroll (NFP) numbers as a final potential catalyst for risk assets.\n\n“Expectations are that we’ll be seeing 3.6%, similar to last month. Based on the financial numbers of this week, I’d rather expect 3.7-3.8%,” Michaël van de Poppe, founder and CEO of trading firm Eight, summarized his expectations.\n\n“Result; $DXY down, $BTC unchanged and indices down/up depending on how far the outlier will be.”\n\nA further tweet argued that $30,000 remained on the table should bulls protect current support levels.\n\n“Bitcoin remains in a boring state of mind. Consolidating for weeks, while old altcoins are breaking out,” he continued.\n\n“I’m still looking at support here, through which $27,600 needs to sustain. If that’s lost, $25,000-25,400 seems likely. Holding here through NFP -> $30,000 next.”\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/ Twitter\n\nRelated: $1.12B in Bitcoin options expire this week, and bulls appear to be at a disadvantage\n\nFellow trader Crypto Tony agreed that the current trading range might nonetheless prove sticky.\n\n“I bet we will be staring at this range for awhile. If we do range for awhile and Alts start to run, it only confirms the capital flow is in motion,” he forecast on the day.\n\nBTC/USD annotated chart. Source: Crypto Tony/ Twitter\n\nPopular trader Anbessa showed similar downside targets to Van de Poppe, eyeing $27,940 as an important intraday level to defend.\n\nBollinger Bands portend BTC price volatility\n\nExamining volatility, meanwhile, popular analyst HornHairs commented that Bollinger Bands were offering a telltale sign that calm conditions were about to break.\n\nRelated: Bitcoin ‘faces headwinds’ as US money supply drops most since 1950s\n\n“Bitcoin volatility contraction as tight as its been all year. The games shall begin shortly. Dust off your weapons of choice for the volatility ahead,” he advised.\n\nAn accompanying chart confirmed the Bollinger Bands “squeezing” around spot price, reflecting the current tight range, with the implication that a challenge of the upper or lower band should soon begin.\n\nBTC/USD 1-day candle chart (Bitstamp) with Bollinger Bands. Source: TradingView\n\nAs Cointelegraph reported, 2023 has been a year of contrasting volatility phenomena, with BTC/USD gaining 40% in January but ending February almost exactly at its starting position.\n\nMarch upside totaled 23%, while in April, Bitcoin is currently down 2.3%, according to statistics from Coinglass.\n\nBTC/USD monthly returns chart (screenshot). Source: Coinglass\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3LnBvcHNjaS5jb20vdGVjaG5vbG9neS9iaXRjb2luLXdoaXRlLXBhcGVyLW1hY29zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin white paper hidden in macOS - Popular Science",
        "content": "The copy of the original white paper explaining Bitcoin’s technological, philosophical, and economic underpinnings has been available online since its publication in 2008—but for some reason, a file version is potentially also buried in every Apple product running MacOS. First spotted by the blogger Andy Baio, a simple copy-paste of the following commands entered into Terminal will reveal the cryptocurrency explainer tucked away within macOS systems folders:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nPopSci can also confirm the PDF’s existence on Ventura 13.2.1 after testing out the prompt. As Ars Technica noted on Thursday, the PDF is included within a system app called VirtualScanner.app, which is “almost certainly” related to the “import from iPhone” Continuity Camera feature first rolled out with Mojave.\n\n[Related: A beginner’s guide to how cryptocurrencies work.]\n\nPenned under the pseudonym Satoshi Nakamoto, the Bitcoin white paper’s author (or authors) have never been confirmed, but their impact on global economics has been felt ever since. Designed to be a decentralized alternative form of digital currency, Bitcoin relies on transactions recorded within a globally shared blockchain ledger, and is “mined” over time via users’ computers. As PopSci explained in 2016:\n\n“Every 10 minutes, new Bitcoin enter the system. ‘Miners’ donate spare or dedicated processing power to help validate transactions around the globe. Bitcoin come as rewards for that work. In the early days, you could just do this with a PC. Now the process is complex and requires powerful hardware.”\n\nWhile many Bitcoin and general cryptocurrency enthusiasts abound, critics often point to the monetary system’s extreme volatility. The value of single Bitcoin reached an all-time high of $68,789 on November 10, 2021. Barely a month later, its value sank to $46,164. As of writing, one Bitcoin is worth roughly $28,000.\n\nAccording to his post on Wednesday, Baio accidentally came across the PDF Easter egg while attempting to fix their printer. After double checking with over a dozen Mac-using friends, Baio confirmed the file could be located in every version of macOS they had, stretching all the way back to 2018’s Mojave (10.14.0) update. Any Mac featuring High Sierra or earlier, however, appears to be sans “Satoshi.”\n\nAs to why Nakamoto’s white paper is buried within macOS, it’s anyone’s guess. “ Is there a secret Bitcoin maxi working at Apple?” asks Baio, before surmising, “Maybe it was just a convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.”\n\nIn any case, Baio reveals a “little bird” informed him someone internally flagged the issue almost a year ago, which was subsequently assigned to the same engineer who embedded the whitepaper PDF. Clearly, nothing has happened to it since then, although that could very well change if enough people make a fuss about it.\n\nPopSci has reached out to Apple for comment, and will update accordingly."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcHBsZXMtaGlkZGVuLWJpdGNvaW4td2hpdGUtcGFwZXItMTczMTQ3MDk2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Apple's Hidden Bitcoin White Paper the Latest in a Long List of Easter Eggs - Yahoo Finance",
        "content": "The Bitcoin white paper has been hiding in plain sight on Apple computers.\n\nBlogger Andy Baio recently revealed that an innocuous file, \"simpledoc.pdf,\" included as part of Apple operating system MacOS, contains a copy of the foundational text of Bitcoin, written by pseudonymous founder Satoshi Nakamoto in 2008.\n\n\"While trying to fix my printer today, I discovered that a PDF copy of Satoshi Nakamoto’s Bitcoin white paper apparently shipped with every copy of macOS since Mojave in 2018.\" Baio wrote on his Waxy blog, \"I’ve asked over a dozen Mac-using friends to confirm, and it was there for every one of them.\"\n\nAlthough Baio uncovered the mysterious easter egg on Satoshi Nakamoto's purported 48th birthday, April 5th, 2023, it’s not the first time it’s been sighted. Twitter user Joshua Dickens, a former Apple product designer, first discovered the white paper lurking in MacOS in 2020, but his tweet did not gain much traction.\n\nWeirdly, there's also a PDF of the original Bitcoin white paper: pic.twitter.com/JjPnI4fyzc — Josh D (@schwa23) November 28, 2020\n\nHow to find the Bitcoin white paper on Apple computers\n\nThe Bitcoin white paper can be found on Apple computers running macOS Mojave or later, by entering the following command into Terminal:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nAlternatively, using Finder, navigate to the Macintosh HD -> System -> Library -> Image Capture -> Devices, and open the Contents -> Resources folder, where you’ll find the file “simpledoc.pdf.”\n\nThe white paper appears to be used as a sample document for the image capture device Virtual Scanner II, with Apple site MacRumors suggesting that it could be a sample document for a system for transferring photos from iOS devices to Macs.\n\nStory continues\n\nIn his 2020 Twitter thread, Dickens highlighted another peculiar file, named cover.jpg, in the same folder. This has been confirmed to be a photograph taken by Thomas Hawk named Warning Alarm System, taken on Treasure Island in San Francisco in 2008.\n\nIn 2021, a thread was made on the Apple forum to discuss these findings but, again, gained very little traction. One user even commented, \"I find it hard to believe anyone cares.\"\n\nHow did the Bitcoin white paper end up on Apple computers?\n\nThe Bitcoin white paper, titled \"Bitcoin: A Peer-to-Peer Electronic Cash System,\" sets out the thesis for a decentralized cash based on a public ledger, essentially birthing Bitcoin and cryptocurrency in turn.\n\nIt is unclear why or how the Bitcoin white paper ended up on Apple systems. The company has a long history of including easter eggs in its products, however, including references to “Star Wars” and “Lord of the Rings.\" Earlier versions of the Macintosh operating system had hidden, playable versions of Tetris, Pong, and snake, and its MacOS and mobile application icons have always featured hidden messages or meanings.\n\nThe Bitcoin white paper appears to be the first crypto-related easter egg that has been found buried in Apple software.\n\nBaio himself speculated that the white paper could have been included as an in-joke by a “secret Bitcoin maxi” working at Apple, or simply included as a “convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.\"\n\nEx-App Store Director: 'Apple Had a Problem With Crypto From Day One'\n\nIts inclusion on Apple computers is particularly surprising given that the company’s former App Store director Philip Shoemaker has claimed that the company “had a problem with crypto from day one.” Speaking earlier this year, Shoemaker told Decrypt that Apple leadership considered cryptocurrency to be “a Ponzi scheme” and had maintained an arbitrarily harsh stance against crypto and NFTs.\n\nApple's insistence on imposing its 30% App Store fee on crypto apps prompted many developers to protest its policy, with some calling for a boycott of iOS.\n\nApple CEO Tim Cook Says He Holds Crypto\n\nIn a 2021 interview, Apple CEO Tim Cook said that he owns some crypto, but that the company had no plans to invest in it as an asset class. “I think it’s reasonable to own it as part of a diversified portfolio,” Cook said.\n\nDecrypt has reached out to Apple for comment and will update this article should we receive a response."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzA2L2JpdGNvaW5zLXRpZ2h0LWNvcnJlbGF0aW9uLXdpdGgtbmFzZGFxLXRvLXNwLTUwMC1yYXRpby1tdWRkaWVzLXRoZS1zYWZlLWhhdmVuLW5hcnJhdGl2ZS_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNC8wNi9iaXRjb2lucy10aWdodC1jb3JyZWxhdGlvbi13aXRoLW5hc2RhcS10by1zcC01MDAtcmF0aW8tbXVkZGllcy10aGUtc2FmZS1oYXZlbi1uYXJyYXRpdmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Tight Correlation With Nasdaq-SPX Ratio Muddies Safe-Haven Narrative - CoinDesk",
        "content": "\"BTC is still (and always will be) a risk asset for traditional investors. It is also likely to be regarded as a safe haven,\" Acheson said. \"We are likely to see continued accumulation from longer-term investors interested in its currency debasement hedge properties, while short-term moves are dictated by shifting theories about what monetary liquidity will do.\""
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYXBwbGUtYml0Y29pbi1tYW5pZmVzdG8tc3RldmUtam9icy1zYXRvc2hpLW5ha2Ftb3RvLXdoaXRlLXBhcGVyLWNyeXB0b2N1cnJlbmN5LTIwMjMtNNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Apple's Bitcoin Manifesto Fuels Theories Steve Jobs Was Satoshi Nakamoto - Markets Insider",
        "content": "Technologist Andy Baio wrote this week that he discovered a PDF of the original bitcoin white paper on his Mac.\n\nThe revelation fueled theories connecting Steve Jobs to the mysterious author of the paper, Satoshi Nakamoto.\n\nBaio said Apple appears to have hid the bitcoin document in \"every copy of macOS since Mojave in 2018.\"\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nIn an April 5 blog post, technologist Andy Baio said he accidentally stumbled upon a copy of Satoshi Nakamoto's bitcoin white paper on his Mac computer, with the revelation fueling wild theories across the internet that the mysterious creator of the world's biggest cryptocurrency was Apple co-founder Steve Jobs.\n\n\"While trying to fix my printer today, I discovered that a PDF copy of Satoshi Nakamoto's Bitcoin whitepaper apparently shipped with every copy of macOS since Mojave in 2018,\" Baio wrote.\n\nHis post prompted Twitter users to share screenshots of the same manifesto stored on their Macs. Insider also tested out Baio's instructions and found the white paper on the latest version of macOS.\n\nThe white paper, titled \"Bitcoin: A Peer-to-Peer Electronic Cash System,\" was published in 2008. In it, the author lays out the framework for the underlying mechanisms that power bitcoin and enable transactions without a third party intermediary like a bank or financial institution.\n\nAdvertisement\n\nBaio's revelation fueled fresh speculation that Nakamoto, the mysterious bitcoin inventor who has never been identified, may have been Steve Jobs, the late co-founder of Apple and tech visionary.\n\n\"Was Steve Jobs actually Satoshi Nakamoto the creator of #bitcoin?\" tweeted Lark Davis, a bitcoin investor and blogger with 1.1 million followers. \"Plus Satoshi disappear in December 2010, and then Jobs passed in October 2011. The timelines fit...\"\n\nWhile Nakamoto vanished from the internet around the same time Jobs died, the white paper appeared on Mac computers seven years after the tech icon's death, making it impossible for him to be the one who inserted the document into the OS.\n\nOther users chimed in across Twitter, with some agreeing while others remained skeptical.\n\nAdvertisement\n\nWhile unusual, the presence of the bitcoin white paper on Mac computers isn't evidence of anything.\n\nAs for Jobs himself, while he is credited as the creative force behind many of Apple's most iconic products, he wasn't an expert programmer, according to co-founder, Steve Wozniak.\n\nOthers have also noted that for Jobs to develop the iPhone around the same time as the world's most popular digital asset is more reason to be skeptical.\n\nThe real identity of Nakamoto has never been revealed, and some believe Nakamoto was actually a group of people given the complexity of bitcoin's code. The inventor stated they started writing the code for bitcoin in 2007, and the network launched in 2009.\n\nAdvertisement\n\nThe mysterious figure \"disappeared\" from online appearances on December 12, 2010.\n\nSome estimate that crypto wallets associated with the pseudonym hold more than 1.1 million bitcoin tokens. When the token peaked in November 2021 at about $68,000, those holdings would have been worth roughly $73 billion, putting Nakamoto among the top-15 richest people in the world at the time.\n\nMeanwhile, other Twitter users floated the idea that the white paper was simply a bitcoin enthusiast working at Apple who slipped the document in as an easter egg.\n\nTo locate the white paper, users can open the macOS terminal and enter the following command:\n\nAdvertisement\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nOn Friday, bitcoin hovered around $27,896. The token has rallied roughly 68% in 2023."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmxlZGdlci5jb20vYmxvZy9idWlsZGluZy1hLWJlc3QtaW4tY2xhc3MtaGFyZHdhcmUtYml0Y29pbi1tdWx0aXNpZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Building A Best-In-Class Hardware Wallet For Bitcoin Multisig - Ledger",
        "content": "\n\nThings to know:\n\n\n\n– Since the launch of the Ledger Bitcoin 2.0.0 app, and with various improvements over the past year, one of our core missions has been to improve the security and user experience for multisig wallets.\n\n\n\n– By enabling multisig wallets to be easily and fully verified on the device, Ledger now represents the best-in-class hardware wallet for securing bitcoin in multisig cold storage.\n\n\n\n– All of the new Ledger multisig functionality is available for use with Unchained and certain open-source applications such as Caravan for all Ledger models.\n\n\n\nWhat Is Multisig?\n\nIn a typical single-signature bitcoin wallet, your Ledger secures the only key needed to spend your bitcoin. This makes it easy to transfer your bitcoin around whenever you’d like, but it also means that there is a single point of failure in your bitcoin security. If someone finds your recovery phrase or gains access to your Ledger and somehow learns your PIN, they have everything they need to be able to spend your bitcoin.\n\nIn a multisig bitcoin wallet, multiple keys are used to create the bitcoin wallet, and multiple keys must be used to spend the bitcoin. The most common type of multisig wallet is created from three keys, and two out of three keys must be used to spend the bitcoin. It makes managing your security more complicated, but the trade-off is a significant improvement in security — even if someone gains access to one seed phrase or compromises one of your hardware wallets, they do not have the ability to spend your bitcoin.\n\nWhy multisig wallet is hard\n\nHistorically, hardware wallets across the industry have been optimized for single-signature custody. But as bitcoin matures, multisig is emerging as an increasingly popular option for both individuals and businesses to secure bitcoin for the long term. Unfortunately, hardware wallets generally haven’t kept up, with many continuing to provide multisig users with clunky user experiences and lower levels of on-device transaction verification.\n\nThere are three main challenges with designing a hardware wallet for multisig:\n\nAddress manipulation: During the creation and signing of a multisig wallet, a malicious attacker could try to sneak in additional keys so that they have a majority control of the bitcoin, or try to send transaction change to a very obscure address that is technically part of the multisig wallet but is far removed from standard addresses and is unrecoverable without paying a ransom. Address verification: If all the public key data for the multisig wallet is not registered on the hardware wallet, verifying that you are sending change to the right address is a manual process requiring you to verify the change address on your device or through reconstructing your wallet elsewhere. Not registering the multisig wallet is also a problem when depositing to your multisig wallet. If you can’t verify on your device that you are sending bitcoin to your multisig wallet, you are trusting that your internet-connected computer is not trying to trick you into sending it to an attacker’s address. Information leak: If the multisig wallet is stored on the hardware wallet, it means that an attacker that gains access to your PIN or coerces you to unlock your hardware wallet can now immediately see that the hardware wallet is part of a multisig wallet, which reveals more information about your security set-up than is necessary. Lack of account segregation: If you use the same device/seed to take part in different multisig wallets, it is no longer enough to know that you are spending from one of the wallets you are part of: you also want to know from which of them you’re spending from. The hardware wallet should check that for you.\n\nFinally, one of the biggest challenges is that of minimizing the UX impact: if using multisig wallets is too complicated or cumbersome, users are likely to skip or sloppily apply the necessary security measures. For the majority of users, multisig is only secure if it’s easy!\n\nLedger to the rescue\n\nPreviously, the Ledger bitcoin application could be used for multisig wallets, but it was unable to register all of the keys that were used to build the multisig wallet, and as a result, could not verify with absolute certainty that it was signing for the right multisig wallet and verify that the change was going back to the right place. After our recent update, the Ledger is now the premier multisig hardware wallet by leveraging all of the most recent software advancements in bitcoin.\n\nWe worked closely with Unchained to validate and improve our approach to multisig, in an open-source collaboration. Unchained works day-in-day-out helping thousands of bitcoiners upgrade their bitcoin security with multisig, so they were the perfect partners to help us build the best multisig support possible.\n\nFrom registering your multisig vault on the Ledger device to verifying your multisig addresses and sovereign recovery with other open-source tools, the updated bitcoin application makes Ledger best-in-class for multisig.\n\nVerify everything – Trust Nothing\n\nNow to get a bit technical for those curious. To make all of this work, Ledger implemented a policy registration mechanism based on a HMAC. An HMAC, or hash-based message authentication code, is a specific type of authentication code that confirms the origins and the content of certain information.\n\nWhen a multisig (or, miniscript) wallet policy is registered on the device, and only after the user has inspected it and confirmed it with the secure screen, the device returns a unique HMAC for that policy.\n\nThis HMAC allows the device to confirm that the Ledger is one key in a known multisig wallet that was previously registered and validated on the secure screen. The beauty of using HMACs in this way is that the Ledger doesn’t need to store the entire multisig wallet on the device, which as mentioned above unnecessarily reveals that the Ledger is used in multisig configuration. The HMAC can be stored by the multisig coordination tool (such as Unchained) and is passed to the Ledger during bitcoin transaction signing.\n\nThis allows you to verify all information about a multisig transaction on the device and confirm that nothing about the multisig wallet was changed in the future, without trusting any internet-connected device. In other words, after the one-time registration procedure, you can receive from, and send to a multisig wallet controlled by your Ledger with a user experience that is very similar to the one you are used to for single signature transactions.\n\nThis new functionality is best experienced during multisig wallet setup with Unchained, where once the wallet is generated, Unchained will prompt you to register the wallet on the device. You’ll be given the opportunity to review all of the relevant information about the multisig wallet and confirm with your Ledger. This confirmation is then stored as an HMAC and is used moving forward to remedy all of the primary multisig problems mentioned above.\n\nUpgrade your multisig game now\n\nAll of the new Ledger multisig functionality is available for use with Unchained and certain open-source applications such as Caravan for all Ledger models. We hope that all multisig providers and tools will implement Ledger multisig registration and device address confirmation, improving security and usability for their users. These features are critical for the long-term security of bitcoin, and we are happy to see teams like Unchained implement the new functionality and advance the state-of-the-art of bitcoin security.\n\nRead this article for a technical deep dive."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vYXJzdGVjaG5pY2EuY29tL2dhZGdldHMvMjAyMy8wNC9iaXRjb2luLXdoaXRlcGFwZXItaXMtaGlkZGVuLWF3YXktaW4tbWFjb3NzLXN5c3RlbS1mb2xkZXJzLWZvci1zb21lLXJlYXNvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin white paper is hidden away in macOS's system folder for some reason - Ars Technica",
        "content": "If you're using a Mac and want a refresher on the basics of Bitcoin, good news—blogger Andy Baio has discovered that \"every modern copy of macOS\" has included a copy of Satoshi Nakomoto's original Bitcoin white paper, hidden away in macOS system folders and accessible with an easy Terminal command.\n\nHere's the command you can use to open it on your own Mac:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nWe've confirmed that the document exists on a fully updated Mac running Ventura 13.3, and Baio says the 184KB PDF file appears to date all the way back to 2018's Mojave (it's not present in 2017's High Sierra).\n\nThe file is included in a system app called VirtualScanner.app. This is almost certainly related to the \"import from iPhone\" Continuity Camera feature that lets you insert pictures or documents \"scanned\" with your iPhone or iPad's camera directly into a macOS app. That feature was originally introduced in Mojave, the same macOS version that added the Bitcoin white paper.\n\nAdvertisement\n\nBaio says that \"a little bird\" told him that the presence of the Bitcoin white paper was filed as an issue internally at Apple \"nearly a year ago,\" and that it was assigned to \"the same engineer who put the PDF there in the first place.\" It has apparently gone unremarked upon since then, and the white paper is still there.\n\nThe Bitcoin white paper isn't the only secret document that has been included in macOS. For years, the Pages app included a small \"apple.txt\" file with the full text of the speech from Apple's old \"here's to the crazy ones\" ad, plus former CEO Steve Jobs' 2005 Stanford commencement speech. The document no longer appears to be included in the current version of Pages.\n\nWe've contacted Apple to see if the company has anything to add. Absent a response, the easiest explanation is that the bizarre but ultimately harmless inclusion of the white paper is an Easter egg tucked away by some cryptocurrency enthusiast at Apple, and we'd expect it to vanish in a future update now that it has been noticed."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzA3L2JpdGNvaW4tbWluZXItc3BoZXJlLTNkLXN1ZXMtcGFydG5lci1ncnlwaG9uLWRpZ2l0YWwv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDQvMDcvYml0Y29pbi1taW5lci1zcGhlcmUtM2Qtc3Vlcy1wYXJ0bmVyLWdyeXBob24tZGlnaXRhbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Sphere 3D Sues Partner Gryphon Digital - CoinDesk",
        "content": "“We are aware of the complaint and look forward to defending it vigorously. While we cannot comment on pending litigation, we are confident that our impending response to the complaint - and the documents and other evidence that will come to light in the aftermath - will speak for themselves,\" Gryphon said in statement."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oaXN0b3JpY2FsLWJpdGNvaW4tcHJpY2UtZnJhY3RhbC1oaW50cy1hdC1yYWxseS10b3dhcmQtNTBr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Historical Bitcoin price fractal hints at rally toward $50K - Cointelegraph",
        "content": "Bitcoin (BTC) could rally toward $50,000 in 2023, according to a historical price fractal highlighted by popular market analyst Mags.\n\nBitcoin price trend in 2015 vs. 2023\n\nThe chart fractal highlights the similarities between Bitcoin’s ongoing price trends and those recorded after the completion of the 2013–2015 bear market.\n\nThat includes Bitcoin’s consolidation inside the $200–$300 range between January 2015 and August 2015, which appears identical to its consolidation between the $18,500–$25,000 range after the supposed completion of its 2021–2022 bear market.\n\nBTC/USD price performance comparison between 2015 and 2023. Source: TradingView/Mags\n\nBTC’s price broke above the $16,000–$25,000 range in March 2023, prompting Mags to highlight its resemblance to the breakout above the $200–$300 range in October 2015.\n\nSince this resulted in a rally toward $700 in June 2016, the analyst sees the scenario potentially repeating in 2023, with BTC’s price doubling to $50,000.\n\n“Being bearish here [when Bitcoin’s price is around $28,000] is like being bearish at $350,” Mags added.\n\nLiquidity crunch may spoil Bitcoin price rally\n\nThe bullish argument for Bitcoin comes amid anticipations that the United States Federal Reserve would slow the pace of its interest rate hikes.\n\nDue to lower rate expectations, the yield on the benchmark U.S. 10-year Treasury note has declined. That, in turn, has boosted investors’ appetite for zero-yielding assets, such as Bitcoin and gold.\n\nU.S. 10-year weekly chart versus BTC/USD and XAU/USD. Source: TradingView\n\nIn addition, lower yields have also sapped U.S. dollar demand, with the dollar losing 1.33% in 2023 versus a basket of top foreign currencies. Since Bitcoin’s value is largely denominated in the dollar, it means higher prices for BTC/USD.\n\nRelated: Latest Bitcoin price data suggests double top above $200K in 2025\n\nHowever, Bloomberg analyst Mike McGlone has cautioned about a potential bull trap in the Bitcoin market due to a mounting liquidity crunch.\n\nHe said:\n\n“It may be illogical to expect the stock market, crude oil, copper, and the Bloomberg Galaxy Crypto Index (BGCI) sustain the recent bounces with year-over-year measures of money supply and commercial bank deposits falling around 2%.”\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LnRoZW1vc2Nvd3RpbWVzLmNvbS8yMDIzLzA0LzA3L3J1c3NpYS1iZWNvbWVzLXdvcmxkcy1zZWNvbmQtbGFyZ2VzdC1jcnlwdG8tbWluZXItYTgwNzQ50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Russia Becomes World’s Second-Largest Crypto Miner - The Moscow Times",
        "content": "Russia has become the world’s second-largest cryptocurrency mining country this year, the Kommersant business daily reported Friday, citing Bitriver, Russia’s largest bitcoin mining provider.\n\nWhile the United States remains by far the world's largest crypto miner, boasting 3-4 gigawatts of mining capacity, Russia’s generating capacity reached 1 gigawatt in January-March 2023.\n\nIn taking second place for the first time, Russia took a spot previously occupied by Kazakhstan, which introduced restrictions on crypto mining activities in 2022 and now ranks ninth, Kommersant cited Bitriver as saying.\n\nChina, which banned crypto mining in 2021, did not make Bitriver’s top 10 at all.\n\nBitcoin use is limited in Russia due to restrictive laws on cryptocurrencies including President Vladimir Putin’s 2020 law on digital financial assets, which legalized cryptocurrencies but banned using them to pay for goods and services.\n\nStill, cryptocurrencies have been linked to Russia’s sanctions evasion strategies, with the United States blacklisting a bitcoin and an ether address in February that it said may have been involved in Russian defense equipment sales abroad.\n\nThe European Union imposed a total ban on carrying out cryptocurrency transactions with Russian citizens and anyone resident in the country as part of its eighth round of sanctions introduced last year."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tc3R1Y2stdXMyODAwMC1hbWlkLXNpZ25zLXNsb3dpbmctZWNvbm9taWVzL9IBTGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tc3R1Y2stdXMyODAwMC1hbWlkLXNpZ25zLXNsb3dpbmctZWNvbm9taWVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin stuck at US$28,000 amid signs of slowing economies - Forkast News",
        "content": "Bitcoin, the world’s largest cryptocurrency by market capitalization, fell 0.96% from March 31 to April 7 to trade at US$27,916 at 9:15 p.m. on Friday in Hong Kong. Ether rose 2.54% in the same period to US$1,854.\n\nThis week, worries about bank failures were replaced by concerns about a recession in the U.S. Nonfarm payrolls rose by 236,000 in March, the lowest monthly gain since December 2020 and less than the 239,000 expected by economists polled by Reuters. Pay growth also slowed.\n\nThe stuttering in job growth and pay was linked to weak consumer demand and the rising cost of borrowing. Add to that a forecast by the International Monetary Fund that said global GDP is expected to grow by around 3% over the next five years, the slowest pace in 20 years.\n\nAnother bearish indicator for the U.S. economy released Wednesday was the services purchasing managers’ index (PMI) for March that came in at 51.2%, according to the Institute for Supply Management, also well below expectation of 54.5%. The index is a measure of market conditions, with a lower reading suggesting a contracting economy.\n\nKadan Stadelmann, chief technical officer of blockchain infrastructure development firm Komodo, said Bitcoin is still suffering from bear market blues and price trends are mixed.\n\n“Normally, we see risk on conditions as something that drives up the Bitcoin price. But, over the last month with the banking crisis, we’ve actually seen risk off be positive for Bitcoin. Right now, the price action is telling us the market is undecided,” Stadelmann said in a statement shared with Forkast.\n\nStablecoin reserves on exchanges continued to drop this week, hitting a two-year low of US$18.06 billion, according to data from analytics platform CryptoQuant, hinting that crypto market liquidity is drying up after the shutdown of three major crypto-focused banks in the U.S.\n\nTether’s USDT added more than US$1 billion to its stablecoins-leading market capitalization this week, raising it toUS$80.27 billion. Its market cap is up 11.92% over the past month, while rival USDC’s dropped 25.03% to US$32.41 billion, as BUSD lost 15.91% to US$7.09 billion, according to DefiLlama.\n\nThe global crypto market capitalization stood at US$1.18 trillion on Friday at 9:15 p.m. in Hong Kong, the same value it had a week ago, according to CoinMarketCap data. Bitcoin’s US$539 billion market cap accounted for 45.9% of the market, while Ether’s US$223 billion accounted for 19%.\n\nSee related article: Ethereum’s Shapella upgrade is imminent – and investors are excited\n\nBiggest gainers: INJ & ENJ\n\nINJ, the native governance token of Injective, a layer-1 smart contract blockchain for financial apps, was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap. INJ rose 23.17% during the past week to trade at US$5.77. The token started gaining momentum in early March since launching the ongoing Injective Global Hackathon.\n\nEnjin Coin, the utility token of Enjin, a blockchain platform building non-fungible token solutions, was the week’s second-biggest gainer in the top 100. ENJ rose 19.68% to change hands at US$0.47. The token started its rally on Tuesday, ahead of the release of the upcoming Enjin Platform, which the company teased on social media.\n\nNext week: Will Bitcoin claim US$30,000?\n\nStadelmann said that Bitcoin could break through US$30,000 briefly in the coming week but cautioned that a recession might be looming.\n\nWhen this sinks in, some panic selling will start in Bitcoin, but like during the Covid-19 panic, Bitcoin will rebound rather quickly, he said. “The bank runs we have seen in recent months build the case for Bitcoin. They are why Bitcoin was built.”\n\nMarat Minkin, the co-founder of decentralized finance payment app TONBanking, said that regulatory developments and economic data will continue to dictate the crypto market trend next week.\n\nThe U.S. is scheduled to release key inflation numbers next week. According to Minkin, Bitcoin is a safe haven asset to hedge against inflation and recession.\n\n(Updates to add economic indicators in first section.)\n\nSee related article: Bitcoin trades under US$28,000, Dogecoin biggest loser"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1kcm9wcy11czI4MDAwLWRvZ2Vjb2luLWJpZ2dlc3QtbG9zZXIv0gFOaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvbWFya2V0cy1iaXRjb2luLWRyb3BzLXVzMjgwMDAtZG9nZWNvaW4tYmlnZ2VzdC1sb3Nlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin trades under US$28,000, Dogecoin biggest loser - Forkast News",
        "content": "Bitcoin rose as Ether fell with most of the top 10 non-stablecoin cryptocurrencies by market capitalization during Asian trading hours on Friday. XRP gainned the most, while Dogecoin was the biggest loser. Asian equity markets strengthened following Wall Street’s overnight rally as investors await the release of the U.S. Employment Situation report on Friday.\n\nSee related article: The TradFi vs. DeFi rivalry is hitting a new peak — and that’s bad for everyone\n\nFast facts\n\nBitcoin rose 0.11% to US$27,933 in the 24 hours to 4:30 p.m. in Hong Kong. The world’s first cryptocurrency rose 0.62% during the week.\n\nEther lost 0.99% during the day, to trade at US$1,857, but maintained its weekly 3.64% increase. Ethereum’s Shapella upgrade, or the Shanghai hard fork, is slated for next Wednesday, which will allow the withdrawal of staked ETH for the first time.\n\nXRP token was the day’s biggest winner, as it rose 2.38% to change hands at US$0.51.\n\nDogecoin saw the biggest drop among the top 10 cryptos, as it fell 9.01% to US$0.083 on the day, but maintained a 11.70% weekly rise. Social media platform Twitter reinstated its blue bird logo after briefly changing it to a Shiba Inu dog, the memecoin’s mascot.\n\nThe global cryptocurrency market capitalization decreased by 0.44% to US$1.18 trillion in the 24 hours to 4:30 p.m. in Hong Kong, while total crypto market trading volume decreased by 11.56% to US$36.18 billion.\n\nThe Forkast 500 NFT index fell 0.24% to 3,990.91 points during the day and slid 0.55% during the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day.\n\nAsian equities were up in line with Wall Street’s rally, despite mounting worries about the health of the U.S. economy, after several reports, like jobless claims, indicated tighter financial conditions.\n\nJapan’s Nikkei 225 rose 0.17%, the Shanghai Composite rose 0.45% to close at a one-month high and the Shenzhen Component gained 0.85% during the day. Hong Kong was closed on Friday and will be off next Monday for the Easter holidays.\n\nInvestors await the release of the U.S. Jobs Report later on the day, which includes the monthly change in non-farm payrolls. Strong growth in non-farm payroll data may indicate heating inflation, which investors will analyze to gauge the Federal Reserve’s next monetary decision.\n\nEuropean stock markets will also be closed over the four-day Easter weekend after closing the trading week in the green on Thursday.\n\nGold slid 0.61% to US$2,008 per ounce, after gaining 2% during the week.\n\nSee related article: Local prosecutors say Terra-Luna’s Do Kwon has no identifiable assets in South Korea"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm1hY3J1bW9ycy5jb20vMjAyMy8wNC8wNi9tYWNvcy1pbmNsdWRlcy1iaXRjb2luLXdoaXRlcGFwZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Apple Has Included Bitcoin Whitepaper in Every Version of macOS Since 2018 - MacRumors",
        "content": "In every copy of macOS that has shipped since 2018, Apple has included the original Bitcoin whitepaper by Satoshi Nakamoto, and no-one seems to know why.\n\n\n\nThe baffling discovery (or rediscovery - see below) was recently made by developer and waxy.org writer Andy Baio, who stumbled upon the PDF document while trying to fix a problem with his printer.\n\nAnyone with a Mac running macOS Mojave or later can see the PDF for themselves by typing the following command into Terminal:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nIf you're running macOS 10.14 or later, the 184 KB Bitcoin PDF should immediately open in Preview.\n\nThe document can also be located via Finder: Navigate to Macintosh HD -> System -> Library -> Image Capture -> Devices, then open the Contents -> Resources folder. The whitepaper titled \"simpledoc.pdf\" should be in there.\n\nBaio found that in the macOS Image Capture utility, the Bitcoin whitepaper is used as a sample document for a device called \"Virtual Scanner II,\" which may or may not power Apple's Import from iPhone feature, and is either hidden or not installed for everyone by default.\n\nBaio later discovered that he wasn't the first person to find the Bitcoin document or \"Virtual Scanner II.\" An Apple Community post from 2021 queries its existence in macOS, in addition to a photo taken of a sign at San Francisco Bay's Treasure Island, after designer Joshua Dickens unearthed them in 2020.\n\n\n\nIt's not known why Apple would choose as a sample document Nakamoto's Bitcoin whitepaper. There has been widespread speculation about the identity of the presumed pseudonymous Bitcoin developer, which is only likely to add to the intrigue. What \"Virtual Scanner II\" refers to also remains unclear.\n\nAccording to a source who spoke to Baio, someone filed the Bitcoin paper with Apple as an issue nearly a year ago, and assigned it to the same engineer who put the PDF there in the first place, but that person hasn't taken action or commented on the issue since.\n\nThe mystery continues."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2lucy10aWdodC1jb3JyZWxhdGlvbi1uYXNkYXEtc3B4LTA5NTMwMDA3MS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Tight Correlation With Nasdaq-SPX Ratio Muddies Safe-Haven Narrative - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nBitcoin's (BTC) price rose 23% in March as multiple U.S. banks went bust, bolstering fears that is a recession is coming.\n\nSeveral analysts have called the move higher a safe-haven rally – with the price gain being attributed to investors seeking shelter in the top cryptocurrency amid bank failures.\n\nBitcoin, however, rose in tandem with the Nasdaq to S&P 500, or NDX/SPX, ratio, a sign the rally was partly, if not mainly, driven by improved risk appetite stemming from hopes for an early Federal Reserve pivot in favor of liquidity-boosting rate cuts.\n\nThe NDX/SPX ratio measures the relative difference in valuation between technology stocks represented in the Nasdaq 100 and a basket of broader industry stocks from the S&P 500.\n\nThe ratio rose by 5.65% in March, capping its best monthly performance since February 2009, as banking sector instability saw traders aggressively reinstate bets that the Fed would cut rates later this year. Nasdaq surged nearly 10%, outperforming the S&P 500's 3.5% gain by a big margin.\n\nThe 90-day correlation coefficient between bitcoin and the NDX/SPX ratio rose from 0.81 to 0.90, signaling the strongest positive relationship between the two assets since June 2022. At press time, the correlation coefficient stood at 0.89. The positive correlation means on days when the ratio rises, bitcoin is more likely to do the same and vice versa.\n\n\"BTC is still trading like a risk asset,\" Noelle Acheson, the author of the popular Crypto is Macro Now newsletter, said, referring to the positive correlation between bitcoin and the NDX/SPX ratio. \"The rising NDX/SPX ratio means tech is doing better, which says risk sentiment is strong.\"\n\nTech stocks tend to be more sensitive to interest-rate expectations than the broader market. Thus a rising ratio is often equated with dovish Fed expectations and improved investor risk appetite that often percolates into other assets like cryptocurrencies, as observed in 2020 and early 2021. A falling ratio represents a sentiment against risky assets.\n\nStory continues\n\n\"Much like crypto, growth-style companies, which are expected to provide cash flows, or some form of fundamental value, further out into the future, find their performance more heavily influenced by shifts in interest rates. The Nasdaq 100 index, for example, is comprised of mostly growth-style sectors, such as technology, which are more sensitive to rising or falling rate expectations,\" Gabriel Selby, a research analyst at CF Benchmarks, told CoinDesk in an email.\n\nSelby added that as the NDX/SPX ratio is closely tracking the crypto market, it suggests interest-rate expectations are in the driver's seat and the pricing divergence between equities and crypto markets may not be as wide as initially thought.\n\nBitcoin and the NDX/SPX ratio bottomed out in late 2022. (TradingView/CoinDesk)\n\nThe correlation between bitcoin and the NDX/SPX ratio was consistently positive during the 2022 bear market and between May 2020 and March 2021, when the cryptocurrency rallied nearly tenfold to $60,000.\n\nIf that's not enough, both have been rallying in lockstep since early January. While bitcoin has risen nearly 70% this year, the ratio is up 11.26%.\n\nBitcoin's pause at around $28,000 since March 22 is consistent with the consolidation in the NDX/SPX ratio.\n\nWhile bitcoin's near-term prospects appear tied to gyrations in the NDX/SPX ratio, it could benefit from fears of fiat currency devaluations over time, according to Acheson.\n\n\"BTC is still (and always will be) a risk asset for traditional investors. It is also likely to be regarded as a safe haven,\" Acheson said. \"We are likely to see continued accumulation from longer-term investors interested in its currency debasement hedge properties, while short-term moves are dictated by shifting theories about what monetary liquidity will do.\""
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTA2L2RjZy1zLWJpdGNvaW4tbWluaW5nLWZpcm0tZm91bmRyeS10by1zdG9wLW9mZmVyaW5nLWZyZWUtc2VydmljZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Digital Currency Group (DCG)'s Bitcoin Mining Foundry to Start Charging - Bloomberg",
        "content": "Crypto-mining firm Foundry, which is owned by embattled conglomerate Digital Currency Group, is going to start charging users a fee for its Bitcoin mining services.\n\nFoundry USA will begin levying a pool fee on members between April 19 and April 22, according to a notice it circulated to clients on April 6. The Rochester, New York-based company has provided its services for free since launching the mining pool in 2019."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1ldGhlci1kb3duLXRvcC0xMC1jcnlwdG9zLWpvYnMtcmVwb3J0L9IBT2h0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1ldGhlci1kb3duLXRvcC0xMC1jcnlwdG9zLWpvYnMtcmVwb3J0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether down with top 10 cryptos, most equities fall ahead of US Jobs Report - Forkast News",
        "content": "Bitcoin and Ether fell during afternoon trading hours in Asia on Thursday, along with all other top 10 non-stablecoin cryptocurrencies by market capitalization. Asian and U.S. equities fell as investors remained cautious ahead of the U.S. employment report scheduled for Friday.\n\nSee related article: Bitcoin briefly loses its grip on US$28,000\n\nFast facts\n\nEther fell 1.51% to US$1,882 but maintained a weekly gain of 4.58%. The cryptocurrency is trading near a nine-month high ahead of Ethereum’s Shanghai hard fork scheduled for next Wednesday. The upgrade will allow investors to withdraw their staked ETH for the first time. Nearly 18 million ETH worth around US$33.5 billion has been staked in the network since the blockchain adopted the proof-of-stake consensus mechanism.\n\nBitcoin fell 2.08% to US$27,974 in the 24 hours to 4:30 p.m. in Hong Kong. The world’s first cryptocurrency fell 2.22% on the weekly chart after trading above the US$28,000 mark for most of the week.\n\nDogecoin fell 5.91% to US$0.09 to become the day’s biggest loser but still maintained a 22.18% seven-day gain in a week when Twitter changed its logo to a Shiba Inu dog, the memecoin’s mascot. The XRP token fell 3.83% to US$0.49, as the day’s second-biggest loser.\n\nThe global cryptocurrency market capitalization decreased by 1.97% to US$1.18 trillion in the 24 hours to 4:30 p.m. in Hong Kong, with total crypto market trading volume down by 8.91% to US$40.82 billion.\n\nThe Forkast 500 NFT index slid 0.70% to 4,002.64 points on the day and lost 0.04% on the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day.\n\nMost Asian equities were down on Thursday, with Shanghai Composite sliding 0.010% and the Shenzhen Component Index inching down 0.044%. Japan’s Nikkei 225 fell 1.10%, while Hong Kong’s Hang Seng Index rose 0.012%. Hong Kong’s financial markets will be closed from Friday to next Monday for the Easter holidays.\n\nInvestors await the release of the U.S. Employment Situation report on Friday, which includes the monthly change in non-farm payrolls. Strong growth in non-farm payroll data may indicate heating inflation, which investors will analyze to gauge the Federal Reserve’s next monetary decision. The U.S. stock market will be closed on Good Friday.\n\nEuropean bourses picked up on Thursday, as the pan-European STOXX 600 rose 0.39% and Germany’s DAX 40 gained 0.44%.\n\nGold fell 0.15% to US$2,017 per ounce to stabilize near a one-year high, following a three-day winning streak. The precious metal rose around 2.5% this week to close up on its all-time high of US$2,075 set in August 2022.\n\nInvestors digested new economic data from the U.S., including ADP Research Institute’s National Employment Report and the Job Openings and Labor Turnover Survey, showing that tighter financial conditions are slowing down the economy as investors hope for the Fed to pause rate hikes next month.\n\nSee related article: Ripple exec says innovation is leaving the US."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vOXRvNW1hYy5jb20vMjAyMy8wNC8wNi9tYWNvcy1iaXRjb2luLXdoaXRlcGFwZXItaGlkZGVuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Here's why macOS has the Bitcoin whitepaper hidden in its files - 9to5Mac",
        "content": "It’s not unusual to have a few easter eggs hidden in operating systems, and it’s no different with Apple’s. However, some users recently discovered something intriguing. Every copy of macOS has the original Bitcoin whitepaper hidden in its internal files. While this got attention on social media, the fact that this document is there in macOS probably doesn’t mean much. And here’s why.\n\nThis story is supported by Mosyle, the only Apple Unified Platform. Mosyle is the only solution that fully integrates five different applications on a single Apple-only platform, allowing businesses and schools to easily and automatically deploy, manage, and protect all their Apple devices. Over 38,000 organizations leverage Mosyle solutions to automate the deployment, management, and security of millions of Apple devices daily. Request a FREE account today and discover how you can put your Apple fleet on auto-pilot at a price point that is hard to believe.\n\nYour Mac may have a copy of the original Bitcoin whitepaper\n\nThis isn’t the first time someone has noticed this, but the fact that macOS has the original Bitcoin whitepaper hidden in its internal files has gotten attention once again after developer Andy Baio wrote an article about it this week. According to Baio, he was trying to fix his printer when he found a PDF copy of the whitepaper written by Satoshi Nakamoto, considered to be the person who invented Bitcoin.\n\nThe developer asked other friends to check if the file could also be found on their Macs. To his surprise, they all confirmed that the Bitcoin whitepaper was there in macOS. The file seems to have been added to the system with macOS Mojave, which was released in 2018, and is still present in the latest version of macOS Ventura.\n\nIf your Mac is running one of these macOS versions, you can check the file yourself by running the following command in Terminal:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nBut why is this file there and what does it represent? For people creating theories on the web about Apple and Bitcoin, I’m sorry to say that the existence of this file in macOS has no special meaning.\n\nIt’s just an internal tool from Apple\n\nThe file is part of the Image Capture app, which comes pre-installed on every Mac and lets users scan images from an external scanner. Of course, the app is also related to how macOS handles printers – which is probably why Baio ended up finding the file. And here’s something to keep in mind.\n\nThis file was never intended to be found by normal users. It is located inside a folder with assets used for internal testing by Apple engineers. The same folder also contains other random images and PDF files that are used to simulate the process of scanning and exporting documents and images with the app without actually needing a scanner.\n\nSo why use the original Bitcoin whitepaper? Well, it’s hard to say for sure, but this was probably just an inside joke by Apple engineers working on this tool. Apple’s internal software is full of references and jokes. After all, engineers never expect that users will access these files.\n\nThe most likely explanation is that the engineers didn’t bother to remove this tool from the final macOS build because it doesn’t have any sensitive information in it. But of course, it’s not every day that you find out that Apple hides a file about Bitcoin in its operating system.\n\nBaio says he has heard from a source that the Apple engineers knew the Bitcoin whitepaper was there in macOS and never took action to remove it. But given the repercussions on the web, Apple will probably end up removing it with a future update."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvbWFnaWMtZWRlbi1pbnRyb2R1Y2VzLWxhdW5jaHBhZC1mb3ItYml0Y29pbi1vcmRpbmFscy1jcmVhdG9ycy0zMDE3OTE2OTIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Magic Eden Introduces Launchpad for Bitcoin Ordinals Creators - PR Newswire",
        "content": "Shortly after its marketplace launch for digital artifacts on Bitcoin, Magic Eden turns focus to providing creators with platform to launch collections\n\nSAN FRANCISCO, April 6, 2023 /PRNewswire/ -- Magic Eden (\"The Company\"), the leading cross-chain NFT platform, today announced plans to open a Launchpad for creators looking to inscribe Ordinals on Bitcoin. The first Ordinals launch will happen on April 7, 2023. Now the leading platform facilitating Bitcoin inscriptions transactions, Magic Eden continues adding to its capabilities by providing creators with a safe and secure platform to launch their collections. In an effort to further advance the Ordinals ecosystem, Magic Eden launched a marketplace to facilitate transactions on the side of the user, and now introduces the Launchpad to service creators.\n\nBitcoin inscriptions have seen a major uptick in popularity throughout Q1 2023 and while technology continues to catch up with demand, Magic Eden is stepping in to offer a way for creators to easily launch their collections. The Launchpad will bring together a community of enthusiasts from other native chains and foster the growth of a growing Ordinals society.\n\nSince the launch of its marketplace on March 21, 2023, Magic Eden has become the top marketplace for trading Bitcoin inscriptions. Leading with up to 70% market share, the platform is actively looking to introduce new projects to collectors in a safe and secure way. The Magic Eden Launchpad now supports four blockchains, including Ethereum, Solana, Polygon, and Bitcoin, and is the premier destination for creators to launch their projects. To date, Launchpad has served over 500 creators and raised over $150 million on behalf of creators.\n\nZhuoxun Yin, COO and co-founder of Magic Eden, commented on today's news: \"We're excited to expand our creator capabilities to Bitcoin and offer easy ways for creators to get started and launch. Bitcoin is the grandfather of all blockchains, and we believe it can be the home to pure digital artifacts. With Ordinals, content can be preserved forever, and we're proud to be helping creators and the Ordinals community grow together.\"\n\nA growing Bitcoin Ordinals ecosystem means that digital asset collectors and traders are interested in the value the digital artifacts provide and are looking to experience a smooth and user-friendly encounter when first interacting with inscriptions. Magic Eden looks forward to being the first to provide a Launchpad experience for Bitcoin. Its launch partner, Godjira, an established ETH collection, is scheduled to go live on Magic Eden on April 7 with their (Dead)jira Legacy mint. Additionally, four other creators including Genopets, Lazy Lions, Lil Durk, and Humanoids will be launching Ordinals on the platform within the first week of it being live. Genopets will be the first game to launch Ordinals on the platform.\n\n\"We chose to work with Magic Eden because they are a team of experts who can provide advice and guidance and have a reputation for quality and trustworthiness. We believe this launch is not only beneficial to [our community] but also the entire Ordinals space,\" stated Godjira co-founder. The team aims to educate and raise awareness about Ordinals through its collections to a wider audience.\n\nCreators interested in inscribing ordinals on Bitcoin through the Magic Eden Launchpad should get in touch here .\n\nAbout Magic Eden\n\nMagic Eden is the leading cross-chain NFT platform driving the next billion users to Web3. Led by former crypto, tech, and hospitality leaders, Magic Eden is building a user-friendly platform powered by market-leading minting and trading solutions. Magic Eden brings dynamic cultural moments onto the blockchain, empowering users across thousands of digital communities to create, discover and collect unique NFTs. For more information, please visit www.magiceden.io .\n\nMedia Contact\n\nDillon Arace\n\n[email protected]\n\nSOURCE Magic Eden"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZGVjcnlwdC5jby8xMjU2NDYvY2hhdGdwdC1waWNrcy1nb2xkLW92ZXItYml0Y29pbi1zYXlzLWNyeXB0by1jcml0aWMtcGV0ZXItc2NoaWZm0gFfaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNTY0Ni9jaGF0Z3B0LXBpY2tzLWdvbGQtb3Zlci1iaXRjb2luLXNheXMtY3J5cHRvLWNyaXRpYy1wZXRlci1zY2hpZmY_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "ChatGPT Picks Gold Over Bitcoin, Says Crypto Critic Peter Schiff - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe ChatGPT artificial intelligence tool appears to have picked a side in the long-running debate over the respective worth of gold versus Bitcoin as a sound investment. Financial commentator Peter Schiff has praised the prominent generative text engine for reportedly favoring gold.\n\n“AI is pretty intelligent after all,” he tweeted on Wednesday. “It didn't recommend any allocation to Bitcoin.”\n\nThe investor referenced a report from last week covering ChatGPT’s idea of a “recession-proof” portfolio. The document—published in “Gold IRA Guide”—claimed that ChatGPT recommended a 20% allocation to gold and other precious metals to minimize the impact of any one market downturn.\n\n\n\nThe rest of its hypothetical portfolio was comprised of bonds (40%) “defensive” stocks (30%) and cash (10%)—absent any mention of Bitcoin.\n\nAD\n\nAD\n\nYet the AI bot’s answer may not necessarily be a knock against crypto, nor a promotion of gold. When Decrypt directly asked on April 6 for its opinion on “Gold or Bitcoin,” ChatGPT said the choice of which to buy ultimately depends on your investment goals.\n\n“[Gold] is a tangible asset that is considered a safe-haven investment during times of economic uncertainty,” it stated “Gold is a limited resource and is difficult and expensive to mine, which gives it a certain level of scarcity and intrinsic value.”\n\nThe bot contrasted the historic money with Bitcoin, which “is not backed by any physical asset or government” and is “considered by many to be a speculative investment.”\n\n“Gold may be a better choice for those seeking a stable, long-term investment, while Bitcoin may be more suitable for those looking for a high-risk, high-reward investment opportunity,” it concluded.\n\nIt should also be noted that the corpus of knowledge on which ChatGPT is based is current only through 2021, and likely does not include the significant movements—both up and down—that the price of Bitcoin has seen since.\n\nAD\n\nAD\n\nBoth gold and Bitcoin investors are winning big this year, with each asset respectively up 10% and 68% year to date. The former just crossed a multi-year resistance level at $2,000 per ounce, which Schiff believes could now serve as the “launch pad for a moonshot,” per a tweet on Thursday.\n\nGold and Bitcoin are often compared as forms of money due to their strong monetary properties—particularly scarcity, which theoretically makes them resistant to inflation or monetary debasement like fiat currencies. Both assets surged in March after the Federal Reserve bailed out depositors to Silicon Valley Bank, injecting hundreds of billions of dollars back into the banking system to prevent similar bank failures.\n\nWhile Schiff takes the opportunity to double down on gold, an army of Twitter Bitcoiners continue to disapprove—including his own son.\n\n“Long-term bitcoin is a much better buy than gold,” said Spencer Schiff to Decrypt via DM when asked about gold’s latest gains. “Bitcoin is likely to demonetize gold in the long term. Regarding short term, I have no idea, I’m not a trader I just focus on [the] long term.”"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWRlcml2YXRpdmVzLWZhdm9yLWZ1cnRoZXItYnRjLXByaWNlLXJhbGx5LXRvd2FyZC0zMGvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin derivatives favor further BTC price rally toward $30K - Cointelegraph",
        "content": "Despite regulatory pressure and worsening macroeconomic conditions, Bitcoin (BTC) demonstrated bullishness, holding near $28,000 for the past week. Furthermore, professional traders have maintained leveraged long positions on margin and in futures markets, indicating strength.\n\nOn the regulatory front, on April 4, the Texas Senate Committee on Business and Commerce agreed to move forward and remove incentives for miners operating within the state’s regulatory environment. If passed, Senate Bill 1751 would cap compensation for load reductions on Texas’ power grid during emergencies.\n\nRisk of recession grows against rate hikes\n\nThe risk of a recession in the United States grew after applications for unemployment benefits in the week ending March 25 were revised to 246,000, up 48,000 from the initial report.\n\nFurthermore, Kristalina Georgieva, managing director of the International Monetary Fund (IMF), stated on April 6 that the economies of the U.S. and Europe should continue to struggle as higher interest rates weigh on demand.\n\nRegarding the banking crisis, Georgieva advised central banks to keep raising interest rates, adding, “Concerns remain about vulnerabilities that may be hidden, not just at banks but also non-banks — now is not the time for complacency.“\n\nOn the other hand, on April 6, St. Louis Federal Reserve president James Bullard downplayed concerns about the impact of financial stress on the economy. Bullard stated that the Fed’s reaction to the banking sector’s weakness was “swift and appropriate,” and that “monetary policy can continue to put downward pressure on inflation.“\n\nLet’s look at derivatives’ metrics to better understand how professional traders are positioned in the current market conditions.\n\nBTC price derivatives reflect traders’ neutral sentiment\n\nMargin markets provide insight into how professional traders are positioned because they allow investors to borrow cryptocurrency to leverage their positions.\n\nFor example, one can increase exposure by borrowing stablecoins and buying Bitcoin. On the other hand, borrowers of Bitcoin can only take short bets against BTC/USD.\n\nOKX stablecoin/BTC margin lending ratio. Source: OKX\n\nThe chart above shows that OKX traders’ margin lending ratio has remained near 28x in favor of BTC longs over the last week. If those whales and market makers had perceived increased risks of a price correction, they would have borrowed Bitcoin for shorting, causing the indicator to fall below 20x.\n\nThe top traders’ long-to-short net ratio excludes externalities that might have solely impacted the margin markets. Analysts can better understand whether professional traders are leaning bullish or bearish by aggregating the positions on the spot, perpetual and quarterly futures contracts.\n\nBecause there are some methodological differences between different exchanges, viewers should focus on changes rather than absolute figures.\n\nExchange’s top traders’ long-to-short ratio. Source: Coinglass\n\nBetween April 1 and April 7, the top traders’ long-to-short ratio at Binance slightly declined from 1.17 to 1.09. Meanwhile, at the Huobi exchange, the top traders’ long-to-short ratio has stood near 1.0 since March 18. More precisely, the ratio slid from 1.00 on April 1 to 0.95 on April 7, thus relatively balanced between longs and shorts.\n\nLastly, OKX whales presented a very different pattern as the indicator declined from 1.25 on April 3 to a 0.69 low on April 5, heavily favoring net shorts. Those traders reverted the trend, aggressively buying Bitcoin using leverage for the past two days as the long-to-short ratio returned to 0.97.\n\nAbsence of Bitcoin shorts is a bullish indicator\n\nIn essence, both the Bitcoin margin and futures markets are currently neutral, which should be interpreted positively given that the Bitcoin price rose 41.5% between March 10 and March 20, holding the $28,000 level.\n\nGiven the enormous regulatory uncertainty caused by the SEC’s Wells notice against Coinbase on March 22, the absence of shorts using margin and futures markets currently favors further price appreciation.\n\nUnless the economic crisis unfolds faster than expected, inflation will remain a top concern for investors, and Bitcoin inflows should be enough to keep $28,000 as a resistance level.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXMtd2hpdGVwYXBlci1pcy1hcHBhcmVudGx5LWhpZGluZy1pbi1hcHBsZS1zLW1vZGVybi1tYWNvc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin white paper is apparently hiding in Apple's modern macOS - Cointelegraph",
        "content": "Satoshi Nakamoto’s original white paper laying out the Bitcoin (BTC) network is seemingly hiding within every modern version of the operating system for Apple’s Mac computers.\n\nAn April 5 blog post from technologist Andy Baio revealed that a PDF of the Bitcoin white paper has “apparently shipped with every copy of macOS since Mojave in 2018.”\n\nBaio told Cointelegraph that he was “just trying to fix my printer” and scan a document with a wireless scanner when a device called “Virtual Scanner II” appeared that he’d “never seen before.”\n\nBy default, Virtual Scanner II showed a photo, but when Baio changed the media type from \"Photo\" to \"Document,\" Nakamoto’s white paper appeared.\n\nA screenshot of the Bitcoin white paper appearing within the “Virtual Scanner II” device. Source: Waxy\n\n“I wasn't looking for the Bitcoin paper!” Baio exclaimed. “I was just trying to fix my printer!”\n\nIn his post, Baio said there is “virtually nothing about this online.” He shared a November 2020 Twitter thread from designer Joshua Dickens, who also found the whitepaper, which Baio used to find the file location.\n\nWeirdly, there's also a PDF of the original Bitcoin white paper: pic.twitter.com/JjPnI4fyzc — Josh D (@schwa23) November 28, 2020\n\nBaio created a prompt to use in Terminal, a command line interface for macOS, so others could bring up the whitepaper easily.\n\n“I started asking other Mac-using friends if they could co nfirm it, and all of them could,” he said.\n\nRelated: Bitcoin white paper makes its F1 racing debut on Kraken-sponsored car\n\nThe prompt successfully opened the Bitcoin white paper on three different Apple Mac devices tested by Cointelegraph.\n\nIn his blog post, Baio claimed the file is found on “every version of macOS from Mojave (10.14.0) to the current version (Ventura), but isn’t in High Sierra (10.13) or earlier.”\n\nIt’s unknown why Nakamoto’s white paper is shipped with modern versions of macOS. Baio speculated in his post that it was “just a convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.”\n\nCointelegraph contacted Apple for comment but did not immediately receive a response.\n\nMagazine: Bitcoin in Senegal: Why is this African country using BTC?"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWxlYWRzLWNyeXB0by1tYXJrZXQtcmVjb3ZlcnktYXMtcmVndWxhdG9ycy10dXJuLXVwLWhlYXQtcmVwb3J00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin leads crypto market recovery as regulators turn up heat: Report - Cointelegraph",
        "content": "March has been a turbulent month for the crypto industry. Bitcoin (BTC) recorded its highest weekly close in 10 months and raised hopes among many that the bear market is over. One of the key drivers of this expectation was a series of banking collapses in the United States. This made investors hope for falling interest rates later this year, despite Federal Reserve Chair Jerome Powell’s insistence that lower rates were not part of the base scenario for 2023.\n\nHowever, optimism about the macro environment risks being offset by the regulatory crackdown on the industry in the United States. This mixed environment is markedly different from the typical bull and bear market action that the crypto industry is used to and affects its various areas in different ways.\n\nFor those serious about understanding the crypto space’s various sectors, Cointelegraph Research publishes a monthly Investors Insights Report that dives into venture capital, derivatives, decentralized finance (DeFi), regulation and much more. Compiled by leading experts on these various topics, the monthly reports are an invaluable tool to quickly get a sense of the current state of the blockchain industry.\n\nDownload and purchase this month’s report on the Cointelegraph Research Terminal.\n\nVCs put off by looming stagflation\n\nInvestment activity in the blockchain industry experienced a significant decline in March, according to the latest information from the Cointelegraph Research Venture Capital database, as only 59 individual deals took place, down from 96 in February. This represents a 38.5% decrease in investment activity. The total aggregate capital inflows for March were $504 million, a drop of over 42.7% from February’s figure of $880 million.\n\nVCs require stable and favorable macroeconomic conditions that can support the growth of high-risk ventures. The risk of a long-term stagflationary environment makes it difficult to achieve this, which is why VC investment sentiment has recently tended toward being bearish. Until there is a shift in macroeconomic indicators that turn investors from risk-off to risk-on, there may continue to be a stagnant or decreasing investment sentiment in the blockchain industry.\n\nHowever, there were still some notable investment rounds in March, including $50 million for Ethereum layer-2 solution Scroll, $40 million for surveillance-free internet builder DAO tomi, and a $40-million seed round for CCP Games. Overall, the report rates the investment sentiment for the blockchain industry as 3 out of 5, indicating that VC investment is still being hampered by macro factors. However, VC activity is likely to be a lagging indicator in any future recovery.\n\nMining stocks ahead of the pack\n\nCrypto stocks saw a mixed performance in March. While mining operations boosted their share price due to higher revenues, other types of crypto ventures struggled. This included the likes of Coinbase, Canaan and Block. The latter’s price continued to be impacted by the short-selling attack by Hindenburg Research.\n\nOn the mining front, the highest gains were recorded by Riot Platforms at 60%, Cipher Mining at 53%, and Terwulf, which now runs a nuclear-powered mining facility providing it with cheap electricity, at 47%. These top performers compare favorably to the MoM return on BTC at 23.0% and a 20.4% uptick in mining revenues. However, on aggregate, crypto stocks still significantly underperformed Bitcoin.\n\nThe crypto industry is likely to operate in a more profitable environment with a more benign outlook for interest rates and reduced debt obligations for mining firms in the coming months.\n\nYet the macroeconomic outlook remains shaky, with markets likely to continue a risk-off approach. With new information arriving with Q1 2023 results, investors will be paying close attention to financial reports for any indication of strength or weakness in the crypto industry.\n\nThe Cointelegraph Research team\n\nCointelegraph’s Research department comprises some of the best talents in the blockchain industry. Bringing together academic rigor and filtered through practical, hard-won experience, the researchers on the team are committed to bringing the most accurate, insightful content available on the market.\n\nDemelza Hays, Ph.D., is the director of research at Cointelegraph. Hays has compiled a team of subject matter experts from finance, economics and technology to bring the premier source for industry reports and insightful analysis to the market. The team utilizes APIs from various sources to provide accurate, useful information and analyses.\n\nWith decades of combined experience in traditional finance, business, engineering, technology and research, the Cointelegraph Research team is perfectly positioned to put its combined talents to proper use with the latest Investor Insights Report.\n\nThe opinions expressed in this article are for general informational purposes only and are not intended to provide specific advice or recommendations for any individual or on any specific security or investment product."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZ2l6bW9kby5jb20vYml0Y29pbi1hcHBsZS1tYWMtYml0Y29pbi13aGl0ZS1wYXBlci0xODUwMzA3MDY50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Here's How to Find the Original Bitcoin Manifesto in Your Mac - Gizmodo",
        "content": "An Apple developer left one of the strangest Easter eggs hidden in the macOS, offering a surprising and baffling connection between the Cupertino tech company’s mainline operating system to everybody’s (least) favorite cryptographic digital currency.\n\nThe Biggest Crypto Heists of 2022…So Far CC Share Subtitles Off\n\nEnglish view video The Biggest Crypto Heists of 2022…So Far\n\nOn his Waxy.org blog, tech dev Andy Baio reported Thursday he made a surprise discovery, finding the original bitcoin whitepaper written by the presumed pseudonym Satoshi Nakamoto had been shoved inside every single copy of macOS since 2018. The document, titled Bitcoin: A Peer-to-Peer Electronic Cash System, was first published in 2008 and described how to set up access to and mine the blockchain-based cryptocurrency. Just a year later, the person under the Nakamoto name launched the first version of the bitcoin network.\n\nAdvertisement\n\nAny device running macOS Mojave 10.18 or later can access the document. Users who want to access the document only need to open a macOS terminal and enter:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nAdvertisement\n\nGizmodo confirmed the document popped up on preview on a MacBook Air running macOS 12.5.1 as well as more modern versions of the OS. The document is stuffed deep in the operating system’s resources, requiring the image capture Virtual Scanner II Device. MacRumors suggested it could be a sample document for the system that could power Mac’s feature letting users transfer photos from iPhone or iPads to Macs, though iCloud is a much easier option for data transfer.\n\nThe entire thing is a greater mystery, as back in 2020 Joshua Dickens, a former product designer at Apple, tweeted about the white paper. He also found a strange photo in the resources folder, which California-based photographer Thomas Hawk claimed was a sign from Treasure Island in San Francisco he took back in 2018.\n\nAdvertisement\n\nGizmodo reached out to Apple for comment, but we did not immediately hear back. Users on Apple’s own forums were pointing out the irregularities of the Virtual Scanner II Device back in 2021, though no Apple representative ever commented on it.\n\nAdvertisement\n\nBaio further claimed based on an anonymous source that somebody at Apple had filed the document as an issue close to a year ago, but that the issue was assigned to the same engineer who originally installed the document into the OS. As is plain by the white paper’s continuing existence, nothing’s really changed in that time.\n\nIt certainly makes sense that there could be a developer at Apple who used the bitcoin white paper as a test for one of macOS backend scanning systems, and then just left it in the code where nobody was looking for it. Still, the political environment surrounding cryptocurrencies is not exactly stable, especially as crypto hacks, robberies, and other crimes have expanded even as bitcoin prices dropped precipitously last year compared to 2021 highs.\n\nAdvertisement\n\nThere’s still quite a lot of speculation about if Nakamoto was a real person or, more likely, a pseudonym. Past investigations by Gizmodo and others have pointed to Australian academic and entrepreneur Craig Wright as involved in bitcoin’s creation. Still, some remain highly skeptical that he was behind it all, and instead claim other early bitcoin developers as the real minds behind crypto’s nascent beginnings. And making such proclamations haven’t helped Wright’s wallet either, as he’s had to pay $100 million in compensatory damages to the family of Dave Kleiman, one of bitcoin’s supposed original founders. Kleiman’s brother claimed Wright cheated the developer out of intellectual property rights for bitcoin."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDQvMDYvYml0Y29pbi13aGl0ZS1wYXBlci1raWNrc3RhcnRlci1hcHBsZS1tYWMtb3BlcmF0aW5nLXN5c3RlbS_SAWVodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA0LzA2L2JpdGNvaW4td2hpdGUtcGFwZXIta2lja3N0YXJ0ZXItYXBwbGUtbWFjLW9wZXJhdGluZy1zeXN0ZW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Former Kickstarter CTO finds Bitcoin white paper hidden in Mac operating system - Fortune",
        "content": "The legend of Satoshi Nakamoto, the anonymous creator of Bitcoin, lives on: in an Apple computer near you.\n\nAndy Baio, former CTO of Kickstarter, posted Wednesday on his more than two decades old blog that he’d found the Bitcoin white paper—the nine-page document outlining the design of the world’s first cryptocurrency—squirreled away on his MacBook.\n\n“I’ve asked over a dozen Mac-using friends to confirm, and it was there for every one of them,” he wrote. All versions of Mac’s operating systems created after 2018 had the white paper preloaded, he said.\n\nBaio landed upon the PDF when he was trying to scan documents from a combination printer-scanner onto his computer, he told Fortune. He found the white paper, authored by Nakamoto, after trying to connect the scanner to his MacBook, which wasn’t initially appearing on his laptop. On a recently released MacBook, Fortune was able to independently access the PDF in the same location.\n\nThe discovery is but the latest in popular culture. Beyond die-hard Bitcoiners—Nakamoto’s text is seen by some as a quasi-religious screed—the white paper has shown up on Formula 1 cars and is sold as wallpaper. The author remains an almost mythological figure, whose mysterious origins and unknown identity have spawned reams of speculative journalism. (Even Elon Musk, the embattled CEO of Twitter and Tesla, has guessed at his identity.)\n\nBaio said he believes the inclusion of the white paper in the tech giant’s software wasn’t an explicit decision by the company.\n\n“In its early history, Apple developers used to hide Easter eggs in the operating system,” he told Fortune. “But I get the impression this wasn’t something that management would have approved of—basically the decision of a single engineer.”\n\nHe said an anonymous source told him that someone at Apple flagged the white paper’s inclusion in its operating systems internally, but the task of removing it was assigned to the very same engineer who had initially placed it.\n\n“With this new attention to it,” Baio added, “I’ll be surprised if it isn’t removed in the next beta.”\n\nA spokesperson for Apple didn’t immediately respond to a request for comment."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kby1rd29uLWNvbnZlcnRlZC1zdG9sZW4tZnVuZHMtZnJvbS1sdW5hLXRvLWJpdGNvaW4tcy1rb3JlYW4tcHJvc2VjdXRvcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Do Kwon converted illicit funds from LUNA to Bitcoin: S.Korean prosecutors - Cointelegraph",
        "content": "South Korean prosecutors have identified 414.5 billion won ($314.2 million) in illicit assets associated with Terraform Labs co-founder Do Kwon and his associates. Out of the identified illegal assets, prosecutors have linked about 91.4 billion won ($69 million) of the specified amount directly to Kwon.\n\nAlthough Kwon amassed millions, none of the assets tied to him are recoverable or under the jurisdiction of the South Korean authorities. This is mainly because the now-arrested former CEO reportedly converted most of the illicit funds into Bitcoin (BTC) using overseas crypto exchanges instead of investing in physical assets, per a report published by local media outlet KBS.\n\nEarly investigation into the Terra collapse by the United States Securities and Exchange Commission revealed that Kwon siphoned nearly $100 million worth of Bitcoin from Terra post-collapse. In another report based on an SEC interview with former Terraform Labs, published in South Korean media, Kwon was accused of siphoning $80 million a month before the collapse of the Terra ecosystem.\n\nThe South Korean authorities have requested Binance to halt any withdrawal request associated with Kwon. Binance confirmed to Cointelegraph that they are cooperating with the prosecutors and offering any assistance they need.\n\n“We provided Korean LE authorities with the requested assistance. Since we cannot comment on ongoing LE investigations, for any further comment please reach out to the prosecutors.“\n\nSouth Korean prosecutors are actively tracing properties associated with Terraform Labs executives to recover some illicit funds from the Terra debacle. On April 3, prosecutors seized homes and other assets to stop former Terra employees from selling things that might be tied to legal cases.\n\nIn addition to the residences in Seoul owned by former CEO Shin Hyun-seong and others, the prosecutors also filed foreclosure actions against their foreign-registered vehicles, lands in Hwaseong and Gapyeong in Gyeonggi-do, and Taean in South Chungcheong Province.\n\nRelated: Do Kwon faces fraud charges from US prosecutors hours after arrest\n\nTerra was a booming crypto ecosystem until its $40 billion collapse in May 2022.\n\nWhat was initially thought to be a market-triggered event turned out to be a clear case of fraud, with former CEO Kwon at the epicenter. According to on-chain data, In the 3 weeks leading up to the depeg of the TerraUSD (UST) stablecoin, one entity dumped over $450 million of UST on the open market. Four days after the last sale, UST started collapsing. The entity behind the massive dump was none other than Terraform Labs.\n\nTFL has been perpetrating the narrative that UST was \"attacked\". This is a false flag. In reality, TFL themselves weakened the Curve pool by irresponsibly dumping a massive amount of UST in a short timeframe. This reduced liquidity and severely weakened the peg. — FatMan (@FatManTerra) December 6, 2022\n\nDespite an arrest warrant from South Korean authorities and an Interpol red notice against his name, Kwon continued to evade arrest for nearly a year before getting caught on March 23 in Montenegro."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90YXR0b29pbmctYml0Y29pbi1hZHZvY2F0ZXMtd2Vhci1jcnlwdG9jdXJyZW5jeS1vbi10aGVpci1zbGVldmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Tattooing Bitcoin: Advocates wear cryptocurrency on their sleeve - Cointelegraph",
        "content": "Got Bitcoin ink? Many Bitcoin believers do. But what are the risks? What about privacy? And what happens if — one fateful day — Bitcoin crashes and burns to zero?\n\nCointelegraph spoke with Bitcoin (BTC) advocates to understand why they have permanently etched a Bitcoin logo, motif, equation or slogan onto their skin. They’ve shown permanent solidarity with the decentralized movement, expressing their support for the Bitcoin protocol and the values it represents.\n\nTaihuttu's Bitcoin B tatto. Source Taihuttu.\n\nDidi Taihuttu, father of the “Bitcoin family,” explained that he inked himself the moment he went “all in on Bitcoin as I thought it was a very important step in my life.” A familiar face among the crypto community, Taihuttu sold all of his family’s possessions and slept in a campsite while the price of Bitcoin was in the four-figure territory with the “B” etched on his arm.\n\nHe now travels the world evangelizing Bitcoin, with his forearm on full view:\n\n“Bitcoin changed my way of thinking about the world and decentralizing it.”\n\nAnita Posch, another globetrotting Bitcoin evangelist, has a lightning bolt tattooed on her forearm. In the Human B Bitcoin documentary film, she said she wouldn’t explain that the lightning bolt symbol (a nod to the Lightning Network) on her wrist is Bitcoin-related but added “Bitcoin is my life” in follow-up comments.\n\nTatumTurnUp and Erik Dale have the Bitcoin supply formula on their skin. Source: Tatum\n\nTatumTurnUP (not his real name), the host of the Bitcoin show “Between Two Asics,” explained that he got his tattoo of the BTC supply formula because “It’s what proves scarcity.”\n\n“Monetary scarcity is something we’ve been deprived of until Bitcoin, and the fact I can write down what proves there will only ever be a certain amount of Bitcoin is a pretty big deal.”\n\nThe tattoo on his bicep is a common (but unfortunately not strictly accurate) formula for the supply of Bitcoin. He shared a warning with readers: “The bottom of the Sigma might be the most painful thing I ever experienced. Just a forewarning.”\n\nBut what about OpSec?\n\nHowever, isn’t it risky to advertise one’s love of a digital currency on one’s skin? OpSec, or operational security, is a military term the internet has hijacked. Among the crypto community, it refers to the public sharing of identity or defining features. And a Bitcoin tattoo could put a literal target on one’s back.\n\nErik Dale, whose tattoos are pictured in the above tweet, founded Norway’s “Northern Lightning” conference series. Dale told Cointelegraph he was aware of the implications. His tattoos are “Equations, no logos or tribal markers, for OpSec reasons.”\n\n“Insiders should realize what they are, but not casual observers.”\n\nRikki, of content creators and investigators Bitcoin Explorers, joked, “We are not particularly concerned about bad opsec.” He added another Bitcoin tattoo to his collection during a giveaway in Guatemala.\n\nBad OpSec can lead to doxing or the public reveal of people’s personal data. That’s why some Bitcoin advocates mask their online identities, using anonymous profiles on social media. Not so for Rikki and his partner Laura; they have their Bitcoin support on full view.\n\nRikki and Laura’s tattoos. “Stack Sats” means save Bitcoin. Source: Rikki.\n\nPiero Coen, the co-founder of Guatemala-based Osmo Wallet, told Cointelegraph that Bitcoin is a “counterculture movement, and getting a tattoo related to it is a way to show our commitment to this movement.”\n\n“It’s like a badge of honor, showing that we are part of this group of ‘pirates’ who are challenging the traditional financial system and are convinced we’re going to change the world. “\n\nBesides, for Rikki and Laura, much of their lives already permanently exists on camera. Rikki explained:\n\n“We are Bitcoin content creators, and so we chose to give up our privacy years ago. Besides, there aren’t just the slightly paranoid, scheming, pessimistic, terra plat-prone Bitcoiners — there are also us, the good-looking, nice, fun, cool and sex-loving Bitcoiners!”\n\nMe: Should I be more low profile?\n\n\n\nStill me: FREE BITCOIN TATTOO!!!!!!!! LET’S MAKE TWO AND MAKE A VLOG ABOUT IT!!!!! pic.twitter.com/HdwnAwRx4Z — Laura Bitcoin explorers (@Lorinaura) January 30, 2023\n\nLaura put it even more succinctly in a recent tweet:\n\nFor Tatum, another content creator and a recognizable face in the Bitcoin space, “Value is teaching people about Bitcoin and networking through it, so there’s a constant battle with opsec.”\n\n“At the bottom of it, I am comfortable with my own security and what I do and do not share, but ‘WHY I love Bitcoin’ is always going to be shared.”\n\nTatum walks around Bitcoin conferences wearing a bulletproof vest in a jocular nod to operational security in the Bitcoin space.\n\nTatum interviewing guests in a security vest at Pacific Bitcoin 2022. Source: Tatum\n\nBut what if Bitcoin goes to zero?\n\nUnlike tweets, open letters or company creation, Bitcoin tattoos are tricky to delete. They require commitment.\n\nSo what happens if the currency goes to zero, like many other failed projects from Terra to Celsius? Tatum explained, well, “sucks for me!”\n\n“After I got it, I jokingly said, ‘Now I really hope it doesn’t go to zero or I’ll look like an idiot.’ But in reality, my tattoo is kind of why it never will go to zero. If one person finds value in Bitcoin, there’s only ever going to be so many. So they will have value.”\n\nBillionaire Mike Novogratz’s tattoo of the failed Terra (LUNA) token is an eternal reminder of the headiness and hedonism accompanying crypto bull runs. The tattoo remains on Novogratz’s arm, while LUNA is worth next to nothing, and its creator, Do Kwon, might be facing jail time. Fortunately, Novogratz says he learned from the experience saying investing “requires humility.“\n\nDale explained he’s prepared to live with the tattoos on his wrists even if Bitcoin does fail. He’s committed until the very end: “If I’m wrong about this, I want to carry that reminder every day. And if not, I can’t imagine a prouder badge to wear for the rest of my days.”\n\nRelated: Novogratz says LUNA tattoo is a constant reminder investing ‘requires humility’\n\nFor Taihuttu, it’s important to zoom out and focus on the bigger picture. Bitcoin is a long-term play:\n\n“I believe that people who have tattoos from dollar signs or other fiat have a bigger chance of going to 0.”\n\nHe’s right; famous rappers and celebrities, including singer Kesha and actor Lena Dunham, have been inked with dollar sign tattoos. It’s unlikely that they were asked if the dollar would go to zero prior to sitting in the tattoo artist’s chair.\n\nKesha’s dollar sign tattoo. Source: popstartats.com\n\nOn a sober note, Taihuttu explained that regardless of the Bitcoin movement underway, the large tattoo on his forearm represents “an amazing 10 years of my and my family’s life since 2013, the year that I started mining Bitcoin.” And that’s more than enough reason to get Bitcoin ink."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXJlc3RzLWF0LTI4ay1hcy11cy1qb2JzLWRhdGEtYm9vc3RzLW5ldy1mZWQtcmF0ZS1oaWtlLWJldHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin rests at $28K as US jobs data boosts new Fed rate hike bets - Cointelegraph",
        "content": "Bitcoin (BTC) showed little interest in moving higher at the April 7 Wall Street open as fresh United States macro data boosted bets on further interest rate hikes.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nAnalyst: Fed will keep hiking “until something breaks”\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it drifted around $27,900 on Bitstamp.\n\nU.S. nonfarm payrolls figures, the main macro data focus of the week, came in slightly below expectations, indicating unemployment rising more slowly than predicted.\n\nThis in turn raised market expectations that the Federal Reserve would persist in raising interest rates to combat inflation — at the expense of crypto and risk asset performance.\n\nThe odds of another 25-basis-point rate hike in May topped 70% on the day, according to CME Group’s FedWatch Tool, having previously circled 50%.\n\n“Another strong jobs report. Likely fuels speculation of a 25bps hike in May,” analytics resource Tedtalksmacro reacted on Twitter.\n\nFed target rate probabilities chart. Source: CME Group\n\nCaleb Franzen, senior market analyst at Cubic Analytics, concluded that this and other recent employment data showed that there were not “any major holes in the labor market data (yet).”\n\n“They’re going to keep going until something breaks,” he continued about Fed policy in part of a follow-up analysis on Twitter.\n\n“So far, the banks are chilling & intervention has worked. Depositors aren’t worried. The labor market is still too resilient and inflation is too high, though it’s decelerating. Disinflation is fully underway, but the Fed is bound by their own handcuffs.”\n\nRelated: Crypto winter can take a toll on hodlers’ mental health\n\nJust ahead of the report, monitoring resource Material Indicators uploaded order book data from Binance, which showed strengthening liquidity nearer the spot price.\n\nThis, as Cointelegraph reported the day prior, was apt to further “dampen” volatility.\n\nBTC/USD order book data (Binance). Source: Material Indicators/Twitter\n\nDollar bounces with stocks\n\nElsewhere, U.S. equities traded up on the day, with the S&P 500 and Nasdaq Composite Index gaining 0.4% and 0.8%, respectively, at the open.\n\nRelated: Bitcoin ‘faces headwinds’ as US money supply drops most since 1950s\n\nThe U.S. dollar managed an uncharacteristic copycat bounce, meanwhile, heading back above the 102 mark to hit its highest levels in several days.\n\n“$USD strength still showing up fresh higher-high after the NFP report,” analyst James Stanley wrote in part of a Twitter response.\n\n“$DXY reacting with strength to data that isn’t necessarily all that strong.”\n\nU.S. dollar index (DXY) 1-hour candle chart. Source: TradingView\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vZGVjcnlwdC5jby8xMjU2MTIvYXBwbGVzLWhpZGRlbi1iaXRjb2luLXdoaXRlcGFwZXItdGhlLWxhdGVzdC1pbi1hLWxvbmctbGlzdC1vZi1lYXN0ZXItZWdnc9IBaWh0dHBzOi8vZGVjcnlwdC5jby8xMjU2MTIvYXBwbGVzLWhpZGRlbi1iaXRjb2luLXdoaXRlcGFwZXItdGhlLWxhdGVzdC1pbi1hLWxvbmctbGlzdC1vZi1lYXN0ZXItZWdncz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Apple's Hidden Bitcoin White Paper the Latest in a Long List of Easter Eggs - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Bitcoin white paper has been hiding in plain sight on Apple computers.\n\nBlogger Andy Baio recently revealed that an innocuous file, \"simpledoc.pdf,\" included as part of Apple operating system MacOS, contains a copy of the foundational text of Bitcoin, written by pseudonymous founder Satoshi Nakamoto in 2008.\n\n\"While trying to fix my printer today, I discovered that a PDF copy of Satoshi Nakamoto’s Bitcoin white paper apparently shipped with every copy of macOS since Mojave in 2018.\" Baio wrote on his Waxy blog, \"I’ve asked over a dozen Mac-using friends to confirm, and it was there for every one of them.\"\n\nAD\n\nAD\n\nAlthough Baio uncovered the mysterious easter egg on Satoshi Nakamoto's purported 48th birthday, April 5th, 2023, it’s not the first time it’s been sighted. Twitter user Joshua Dickens, a former Apple product designer, first discovered the white paper lurking in MacOS in 2020, but his tweet did not gain much traction.\n\nWeirdly, there's also a PDF of the original Bitcoin white paper: pic.twitter.com/JjPnI4fyzc — Josh D (@schwa23) November 28, 2020\n\nHow to find the Bitcoin white paper on Apple computers\n\nThe Bitcoin white paper can be found on Apple computers running macOS Mojave or later, by entering the following command into Terminal:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nAlternatively, using Finder, navigate to the Macintosh HD -> System -> Library -> Image Capture -> Devices, and open the Contents -> Resources folder, where you’ll find the file “simpledoc.pdf.”\n\nAD\n\nAD\n\nThe white paper appears to be used as a sample document for the image capture device Virtual Scanner II, with Apple site MacRumors suggesting that it could be a sample document for a system for transferring photos from iOS devices to Macs.\n\nIn his 2020 Twitter thread, Dickens highlighted another peculiar file, named cover.jpg, in the same folder. This has been confirmed to be a photograph taken by Thomas Hawk named Warning Alarm System, taken on Treasure Island in San Francisco in 2008.\n\nIn 2021, a thread was made on the Apple forum to discuss these findings but, again, gained very little traction. One user even commented, \"I find it hard to believe anyone cares.\"\n\nHow did the Bitcoin white paper end up on Apple computers?\n\nThe Bitcoin white paper, titled \"Bitcoin: A Peer-to-Peer Electronic Cash System,\" sets out the thesis for a decentralized cash based on a public ledger, essentially birthing Bitcoin and cryptocurrency in turn.\n\nIt is unclear why or how the Bitcoin white paper ended up on Apple systems. The company has a long history of including easter eggs in its products, however, including references to “Star Wars” and “Lord of the Rings.\" Earlier versions of the Macintosh operating system had hidden, playable versions of Tetris, Pong, and snake, and its MacOS and mobile application icons have always featured hidden messages or meanings.\n\nThe Bitcoin white paper appears to be the first crypto-related easter egg that has been found buried in Apple software.\n\nBaio himself speculated that the white paper could have been included as an in-joke by a “secret Bitcoin maxi” working at Apple, or simply included as a “convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.\"\n\nIts inclusion on Apple computers is particularly surprising given that the company’s former App Store director Philip Shoemaker has claimed that the company “had a problem with crypto from day one.” Speaking earlier this year, Shoemaker told Decrypt that Apple leadership considered cryptocurrency to be “a Ponzi scheme” and had maintained an arbitrarily harsh stance against crypto and NFTs.\n\nAD\n\nAD\n\nApple's insistence on imposing its 30% App Store fee on crypto apps prompted many developers to protest its policy, with some calling for a boycott of iOS.\n\nIn a 2021 interview, Apple CEO Tim Cook said that he owns some crypto, but that the company had no plans to invest in it as an asset class. “I think it’s reasonable to own it as part of a diversified portfolio,” Cook said.\n\nDecrypt has reached out to Apple for comment and will update this article should we receive a response."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5kYWlseW1haWwuY28udWsvbmV3cy9hcnRpY2xlLTExOTQ2OTE1L0V2ZXJ5LU1hYy1jb250YWlucy1ISURERU4tQml0Y29pbi1tYW5pZmVzdG8td3JpdHRlbi1mYXRoZXItY3J5cHRvY3VycmVuY3kuaHRtbNIBhAFodHRwczovL3d3dy5kYWlseW1haWwuY28udWsvbmV3cy9hcnRpY2xlLTExOTQ2OTE1L2FtcC9FdmVyeS1NYWMtY29udGFpbnMtSElEREVOLUJpdGNvaW4tbWFuaWZlc3RvLXdyaXR0ZW4tZmF0aGVyLWNyeXB0b2N1cnJlbmN5Lmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Every Mac contains a HIDDEN Bitcoin manifesto written by 'the father of cryptocurrency - Daily Mail",
        "content": "Every Apple Mac computer sold since 2018 contains the original Bitcoin manifesto - prompting experts to question whether the tech firms are secretly collaborating.\n\nA white paper by the elusive 'Father of Bitcoin' Satoshi Nakamoto which lays out the value of the digital currency can be found as a PDF on the devices.\n\nThe discovery was made by tech blogger Andy Baio who asked whether there was a 'secret Bitcoin maxi' working for Apple.\n\nThe term 'Bitcoin maxi' refers to those who devotedly believe Bitcoin is the most superior digital currency.\n\nOthers pointed out that it was strange given Apple temporarily banned Bitcoin from its app store in 2014 amid concern over volatile cryptocurrencies.\n\nA copy of the 2008 Bitcoin manifesto is hidden on every Apple MacOS sold since 2018, expert discovers\n\nThe discovery was made by tech blogger Andy Baio who asked whether there was a 'secret Bitcoin maxi' working for Apple\n\nBitcoin was founded in 2008 by Namatoko and was the first ever cryptocurrency to exist\n\nBaio was attempting to fix his printer when he found the 184 kilobyte document which was built in as a sample on the Image Capture function.\n\nHe asked 'over a dozen' of his friends who confirmed the text was also hidden in their devices under the filename 'simpledoc.pdf.'\n\nThe paper - titled 'Bitcoin: A peer-to-peer electronic cash system' outlines the case for implementing digital currencies globally.\n\nIt was first published by Nakamoto in October 2008 when the world was reeling from the financial crisis.\n\nThe founder - whose identity remains a mystery - argued the way stop future collapses was through a digital currency which allowed people to make payments online 'without going through a financial institution.'\n\nHow to find the Bitcoin manifesto on YOUR laptop If you’re on a Mac, open a Terminal via the spotlight search. Do this by clicking on the small magnifying glass icon in the menu bar and typing in 'terminal.app.' From there type in the following command: open /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf If you’re on macOS 10.14 or later, the Bitcoin PDF should immediately open in Preview. The whitepaper is used as a sample text for a device called 'Virtual Scanner II' which is either hidden or not installed for everyone by default In Image Capture, select the “Virtual Scanner II” device if it exists, and in the Details, set the Media to 'Document; and Media DPI to “72 DPI.” You should see the preview of the first page of the Bitcoin paper. Source: Andy Baio via waxy.org Advertisement\n\nHe argued it would stop greedy banks from abusing their customers' funds.\n\nAfter making the discovery, Baio wrote on his site Waxy.org: 'Of all the documents in the world, why was the Bitcoin whitepaper chosen? Is there a secret Bitcoin maxi working at Apple?\n\n'Maybe it was just a convenient, lightweight multipage PDF for testing purposes, never meant to be seen by end users.'\n\nAfter the post went viral Baio updated his blog to reveal Apple employees were aware of the issue - but had failed to take action yet.\n\nHe wrote: 'A little bird tells me that someone internally filed it as an issue nearly a year ago, assigned to the same engineer who put the PDF there in the first place, and that person hasn’t taken action or commented on the issue since.'\n\nHe added it was 'likely' the document will be scraped from future models.\n\nSocial media users were also quick to speculate on what the link between the two firms meant.\n\nRoberto Nixon wrote on Twitter: 'Either the company stands behind Bitcoin and its mission and this is their way of pledging support — or a rogue engineer is about to feel the wrath of their legal team.'\n\nBitcoin was founded in 2008 by Namatoko and was the first ever cryptocurrency to exist.\n\nLittle is known about Namatoko's identity and he is believed to have used a pseudonym.\n\nIn 2014 he was incorrectly identified by Newsweek as Japanese-American Dorian S Nakamoto - who denied having anything to do with the cryptocurrency.\n\nIn 2021 computer scientist Craig Wright appeared to be unmasked as the Bitcoin inventor in a Florida lawuit.\n\nHe was being sued by the family of the deceased David Kleiman who alleged he helped to create the currency and therefore they were worthy of a stake in the fortune.\n\nAfter the post went viral Baio updated his blog to reveal Apple employees were aware of the issue - but had failed to take action yet\n\nDorian Satoshi Nakamoto was incorrectly identified as Bitcoin founder Satoshi Nakamoto in 2014\n\nDavid Kleiman (left) and Craig Wright (right) appeared to be unmasked as the founders Bitcoin as part of a Florida lawsuit but the court never ruled on whether they were genuinely 'Satoshi Nakamoto'\n\nWhile Wright lost the suit, the court never ruled on whether the pair were truly 'Satoshi Nakamoto.'\n\nSince recent financial turbulence broke out following the collapse of Silicon Valley Bank, Bitcoin saw a 24 percent increase in its value.\n\nThe token was hovering at around $27,925 Thursday."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZGVjcnlwdC5jby8xMjU3MTgvY3JhaWctd3JpZ2h0LWFwcGxlLWNvcHlyaWdodC1iaXRjb2luLXdoaXRlLXBhcGVy0gFQaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNTcxOC9jcmFpZy13cmlnaHQtYXBwbGUtY29weXJpZ2h0LWJpdGNvaW4td2hpdGUtcGFwZXI_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Craig Wright Hints Apple May Be Violating Copyright by Storing Bitcoin White Paper - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nControversial computer scientist and self-proclaimed “creator of Bitcoin” Craig Wright today hinted that Apple was violating copyright laws.\n\nWhen asked on Twitter Friday if Apple might be “in breach of copyright” for storing the Bitcoin white paper on its computers, the Australian computer scientist responded by saying: “Yes.”\n\nThis week news dropped that the largest cryptocurrency’s explanatory paper was stored on Apple machines—unbeknownst to many Mac users.\n\nAD\n\nAD\n\nYes — Dr Craig S Wright (@Dr_CSWright) April 6, 2023\n\nJust by punching in a simple command into the Terminal, one can find a copy of Bitcoin’s foundational text on MacOS operating systems (Apple has a history of hiding files on its products for users to find.)\n\nAustralian programmer and lawyer Wright has long claimed that he is Bitcoin’s pseudonymous creator, Satoshi Nakamoto. He has repeatedly said that Bitcoin spin-offs derived from the cryptocurrency are in breach of his intellectual property rights because he came up with the original blockchain.\n\nAnd today, he appeared to be making the point that Apple was sharing his alleged seminal work without asking for permission first.\n\nBut Wright has also long been criticized for making such a claim and not having the proof to back it up: To do so, he’d have to show that he has the private keys to Satoshi’s Bitcoin address.\n\nAD\n\nAD\n\nWright’s lawyers told Decrypt in 2020 that he didn’t have them.\n\nDecrypt today asked Wright whether he would try and sue Apple for breach of copyright but did not immediately receive a response.\n\nIn February, Wright lost a claim in a UK court to protect the Bitcoin blockchain by copyright. He also hinted in December that he was no longer interested in convincing people that he created the world’s biggest digital asset.\n\nWright is also supports Bitcoin SV: a Bitcoin spin-off that emerged in November 2018 when Bitcoin Cash—another fork and currently the 30th biggest cryptocurrency—split in two.\n\nBitcoin SV proponents (Wright is perhaps the loudest cheerleader) call Bitcoin SV “the original Bitcoin” but it been delisted from a number of major exchanges.\n\nWright is no stranger to the courts: Reuters reports that he is currently in the process of suing 15 Bitcoin developers to retrieve around 111,000 BTC after he lost the encrypted keys to access them when his home computer network was allegedly hacked."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vd3d3LmludmVyc2UuY29tL3RlY2gvYml0Y29pbi13aGl0ZS1wYXBlci1oaWRkZW4tbWFjb3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Manifesto is Hidden In Every Copy of MacOS, and No One Knows Why - Inverse",
        "content": "I’m staring at the original Bitcoin white paper on my monitor, not because I’ve decided to get into crypto, but because it’s somehow been on my MacBook Pro without my knowledge. Developer and veteran blogger Andy Baio discovered the document while trying to fix his printer, and apparently, it’s been buried in a hidden app in macOS since at least macOS Mojave, released all the way back in 2018.\n\nWhy Apple (or at least one of Apple’s engineers) would include a document explaining how Bitcoin works in its desktop operating system is unknown, but the mystery is more complicated than an unexpected PDF.\n\nWhat Is Virtual Scanner II?\n\nThe Bitcoin white paper could be buried in the Mac you’re using to read this. Screenshot by Ian Carlos Campbell\n\nThe white paper is called “simpledoc.pdf” on macOS Mojave (10.14) or later and can be pulled up easily in Preview by dropping the following command in Terminal:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nIf entered correctly, you should be able to see the exact same text that’s freely available on bitcoin.org and acts as the manifesto for the currency and the early crypto movement in general. Not the kind of thing you’d expect to see hanging out in an operating system used by millions of people, let alone one from a company as buttoned up as Apple.\n\nBaio found that using the macOS Image Capture utility, the white paper is displayed as a sample document for a device called “Virtual Scanner II.” It’s not clear what this device is for, and it's seemingly not activated or visible to everyone by default, but Baio speculates it could be related to the iPhone’s ability to scan documents onto your Mac.\n\nThis isn’t the first time the white paper has been discovered, and it’s also not the only strange file lurking in Apple’s operating system. A photo of a sign from Treasure Island is also just chilling in there, waiting to be discovered too.\n\nBut Why the Bitcoin White Paper?\n\nWe may have a “Doge” situation on our hands. Screenshot by Ian Carlos Campbell\n\nApple's stance on cryptocurrencies and blockchain technologies is pretty strict in general. While it’s ostensibly okay with crypto-adjacent apps in the App Store, the company’s App Review Guidelines disapprove of apps that accept crypto payments, mine for cryptocurrencies on devices, or award cryptocurrencies for specific tasks, which removes the main reasons people might want to use a virtual currency in the first place.\n\nA company’s employees do not have to share the official stances of the company they work for, and Apple is an awfully big company. It’s just as possible that there’s a Bitcoin maximalist hoping the discovery of Bitcoin creator Satoshi Nakamoto’s white paper in Apple products will help burn down the financial system as it is that this is a freak accident. Still, it is ironic and, as MacRumors notes, could spark even more interest in the mysterious identity of Bitcoin’s creator in the first place.\n\nThe speculative and reactionary culture of the crypto world makes discoveries like these valuable for other reasons — mainly because they tend to juice the price of individual coins. Why does the web version of Twitter have a picture of “Doge” in the place of the social platform's iconic bird? Well, it’s either because Elon Musk is trying to shift the price of Dogecoin, or he’s poking fun at the fact that he’s being sued for supposedly running a Dogecoin pyramid scheme. Neither answer makes perfect sense, but either way, the number goes up. Hiding the Bitcoin white paper in macOS could be an attempt to achieve the same effect for a much more widely known and held coin.\n\nDoes This Even Matter?\n\nNot in terms of your day-to-day use of macOS, but it is a good reminder that operating systems are made by people, with values all their own, over a series of iterations, and across multiple teams. Things get forgotten, tests go unresolved, and features end up unimplemented. Apple has created an air of perfection around itself, not because it’s actually perfect, but because its choices seem intentional. Hiding a mysterious document could be intentional too, or it could stand out because the rest of the operating system is designed not to. But until someone comes forward, it might have to remain a mystery."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTA2L25hc3NpbS1uaWNob2xhcy10YWxlYi1vbi1iaXRjb2luLXZhY2NpbmVzLXN2Yi1zdG9ja3MtYW5kLXJpc2vSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Nassim Nicholas Taleb On Bitcoin, Vaccines, SVB, Stocks and Risk - Bloomberg",
        "content": "Listen to Odd Lots on Apple podcasts\n\nListen to Odd Lots on Spotify\n\nSubscribe to the newsletter\n\nRead the transcript\n\nNassim Nicholas Taleb would like some of his biggest fans to know that they misunderstand his famous worldview."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmluZHkxMDAuY29tL3NjaWVuY2UtdGVjaC9hcHBsZS1tYWNib29rLWJpdGNvaW4tZmlsZS1oaWRkZW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "There's a secret file about bitcoin hiding in your MacBook - here's how to find it - indy100",
        "content": "Many MacBook owners take comfort in the fact that Apple products come with some pretty robust security protections in to prevent unwanted files from making their way onto their laptop, but there’s one hidden document about bitcoin lurking in the computer’s folders that not even Apple is telling you about.\n\nIt turns out that hiding in the system files of MacBooks is a blueprint or research paper on the creation of the cryptocurrency, penned by its pseudonymous and rumoured founder Satoshi Nakamoto.\n\nTitled ‘Bitcoin: A Peer-to-Peer Electronic Cash System’, the paper’s abstract notes a “purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution”.\n\nSign up to our free Indy100 weekly newsletter\n\nIt continues: “Digital signatures provide part of the solution, but the main benefits are lost if a trusted third party is still required to prevent double-spending. We propose a solution to the double-spending problem using a peer-to-peer network.\"\n\nIronically, for a nine-page paper containing such a complex idea the file on your MacBook is in fact titled ‘simpledoc’.\n\nHow to find the hidden bitcoin paper? First of all, go to Finder – that’s the app with a blue and white smiley face icon. Once there, find a way to get to the view of Macintosh HD. One way of doing this is going to ‘Go’ in the navigation bar at the top of the screen and selecting ‘Computer’. After that, you’ll want to click System, then Library, then Image Capture, then finally, Devices. Once there, you’ll see a VirtualScanner file. Don’t click it (it did nothing for us), but instead right-click to open up the options view. There, you’ll want to click ‘show package contents’. Then click on the Contents folder, then Resources, and there you are.\n\n\n\n\n\nAs well as housing the bitcoin paper, this folder also contains more unusual files, including blank image files titled ‘bed2’, ‘edge2’ and ‘top2’, as well as a picture of a wooden blue door with the number six on it, and a sign warning of an alarm system being in place.\n\nThere’s also another image file, titled ‘grid’, which contains an 8x6 grid of the numbers 1 to 48, if you’re looking for a fun way to waste your time, or play an incomplete game of Snakes and Ladders.\n\nSimilarly, there’s a four-page PDF document in which every page contains a large number denoting the page number. It’s very weird.\n\nThis bizarre easter egg – if you can call it that – was shared by tech blogger Andy Baio on Wednesday, and before that, only a handful of other people have spotted it.\n\nAs for why it’s even there in the first place, Baio writes in a blog post: A little bird tells me that someone internally filed it as an issue nearly a year ago, assigned to the same engineer who put the PDF there in the first place, and that person hasn’t taken action or commented on the issue since.”\n\nWell, now you know. You’re welcome.\n\nHave your say in our news democracy. Click the upvote icon at the top of the page to help raise this article through the indy100 rankings."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZGVjcnlwdC5jby8xMjU3MzkvZ2l2ZS1iaXRjb2luLXBvb3ItZWNvbm9taXN0LW5heWliLWJ1a2VsZdIBSGh0dHBzOi8vZGVjcnlwdC5jby8xMjU3MzkvZ2l2ZS1iaXRjb2luLXBvb3ItZWNvbm9taXN0LW5heWliLWJ1a2VsZT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Give Your Bitcoin to the Poor, Salvadoran Economist Urges Nayib Bukele - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAn economist has suggested that El Salvador’s Bitcoin-loving president should use his “failed” cryptocurrency investment to help the country’s poor.\n\nSpeaking to El Diario de Hoy newspaper, UCA El Salvador University professor Rafael Lemus said that President Nayib Bukele’s Bitcoin buys had produced no benefit for the country and should be put to better use.\n\nPresident Bukele—who became El Salvador’s leader in 2019—made Bitcoin legal tender in the tiny Central American country back in 2021. He has also bought a lot of the cryptocurrency, according to Twitter announcements, but his government won’t reveal information on the investment.\n\nAD\n\nAD\n\n“Just as he blew through more than $2 million in Bitcoin, why not undo that investment, recover what he can, and allocate it to the poorest households,” the professor said, referring to the leader’s buying spree.\n\nHe added that such a move would prevent the poorest households in the country from “moving into extreme poverty” due to inflation.\n\nEl Salvador is one of the poorest nations in the Americas. It previously suffered from endemic gang violence but the murder rate—once one of the highest in the world—has dropped dramatically under Bukele’s watch.\n\n#NuevasIdeas = #NuevosPobres en situación extrema.\n\n❌ No logran cubrir el costo de una canasta básica 532 mil y se incrementó en 164 mil. ❌ Un retroceso a niveles superiores de 2017. ❌ Pobreza relativa se reduce, pero un 80% pasan a situación extrema ❌ ¿Prioridad #Bitcoin? pic.twitter.com/9EgNjAWe98 — Rafael Lemus 🇸🇻 Pro 🇺🇦 (@Lemusrafa) September 10, 2022\n\nAccording to data from the Nayib Tracker website, the president has spent over $113 million on Bitcoin but is currently down 34% on the investment.\n\nAD\n\nAD\n\nDespite the president being very popular in El Salvador—and Latin America as a whole, according to polls—Bukele’s Bitcoin bet has been criticized.\n\nThe likes of the World Bank and the IMF have dismissed the idea and so far, not many Salvadorans use the cryptocurrency for everyday purchases.\n\nEl Salvador’s Bitcoin Law requires businesses in the country to accept the cryptocurrency if they have the technological means to do so. Citizens were also encouraged to use it.\n\nBut when Decrypt visited the country in 2021, not many merchants, other than major companies like McDonald’s or Starbucks, were interested in the asset."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS93aG9sZWNvaW5lci1hZGRyZXNzZXMtd2l0aC1tb3JlLXRoYW4tMS1iaXRjb2luLWRvdWJsZWQtc2luY2UtMjAxNi_SAV9odHRwczovL2NyeXB0b3BvdGF0by5jb20vd2hvbGVjb2luZXItYWRkcmVzc2VzLXdpdGgtbW9yZS10aGFuLTEtYml0Y29pbi1kb3VibGVkLXNpbmNlLTIwMTYvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "“Wholecoiner” Addresses With More than 1 Bitcoin Doubled Since 2016 - CryptoPotato",
        "content": "According to on-chain analytics provider Glassnode, there are almost a million addresses holding more than one Bitcoin. Furthermore, the number of “wholecoiner” addresses has doubled since around mid-2016.\n\nIt plateaued at just over 800,000 addresses during the last cycle peak but has increased during the cycle bottom of late 2022 and into 2023 as investors accumulated.\n\nThis statistic is remarkable because there are more than 56 million millionaires in the world.\n\nHowever, with BTC trading at around $28,000, it will be quite some time before one coin will make a holder a millionaire!\n\nBinance CEO Changpeng Zhao, who has been a victim of fake news this week, made the observation on April 6.\n\nThere are more than 56 million millionaires in the world, and only 1 million people with more than 1 bitcoin. Do the math. https://t.co/k7gWNtRzkf pic.twitter.com/H6suIxRkj2 — CZ 🔶 Binance (@cz_binance) April 5, 2023\n\nBitcoin Scarcity Leads to Demand\n\nAnother observation crypto advocates like to make is dividing the total supply of Bitcoins by the world’s population. This works out at around 0.002616 BTC per person, so those holding more than one coin really are a rarity.\n\nThe scarcity of the asset with its finite supply has traditionally been a driver of demand. This has been clearly evident in previous cycles, which are catalyzed by halving events.\n\nThe next Bitcoin halving is due between April and May 2024, depending on what counter is referenced. The current block reward of 6.25 BTC will be halved to 3.125 BTC decreasing issuance and making the asset scarcer.\n\nBitcoin markets have already reached a transition or inflection point, as reported by CryptoPotato. The slow grind higher is likely to continue this year if history rhymes.\n\nThe real bull rally should follow the halving event and occur in the latter half of 2024 if previous cycles are anything to go by.\n\nGlassnode has just added the Bitcoin fear and greed index to its charts to ascertain market sentiment and compare it to previous peaks and troughs.\n\nThe sentiment is currently in a state of “greed” following Bitcoin’s 25% gain over the past month.\n\nWe have recently added the #Bitcoin Fear and Greed Index, which is now firmly within Greed territory. Will this rally push $BTC into Extreme Greed like 2019, and 2021? Or be overwhelmed by resistance like March 2020, or the 2022 deleveraging? 📊https://t.co/89w49UkXnC pic.twitter.com/k8NpbmiGtm — glassnode (@glassnode) April 5, 2023\n\nBTC Price Outlook\n\nBitcoin prices have been consolidating for almost three weeks now, with very little movement since March 18.\n\nThe asset has dipped 1.4% on the day in a fall to $28,094 at the time of writing, according to CoinGecko. Support lies at the $27,000 level, where it fell on March 28, and longer-term resistance is at $30,000, a price not visited since early June."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZGVjcnlwdC5jby8xMjU1NzUvbm9ydGgtY2Fyb2xpbmEtY291bnR5LW11bGxzLTEteWVhci1iaXRjb2luLW1pbmluZy1tb3JhdG9yaXVt0gFcaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNTU3NS9ub3J0aC1jYXJvbGluYS1jb3VudHktbXVsbHMtMS15ZWFyLWJpdGNvaW4tbWluaW5nLW1vcmF0b3JpdW0_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "North Carolina County Mulls 1-Year Bitcoin Mining Moratorium - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nNorth Carolina’s Buncombe County is considering a 1-year moratorium on new and existing Bitcoin mining operations in the area.\n\nThe pause would give the county's Board of Commissioners time to “develop standards and mitigation methods for intensive land uses that may pose detrimental harm to the natural environment,” reads a county document first reported by local news outlet News 13 WSOL.\n\nThe board will discuss and finalize the issue in a public hearing on May 2, 2023.\n\nAD\n\nAD\n\nCrypto mining refers to the process of verifying and validating transactions on a proof-of-work (PoW) blockchain. Bitcoin is the largest PoW blockchain, with Ethereum having just switched to a proof-of-stake (PoS) blockchain last September.\n\nBuncombe County's board plans to classify cryptocurrency mining separately from data centers.\n\nUntil then, the moratorium will restrict zoning certification permits for cryptocurrency mining.\n\nPrevious reports indicate that Buncombe is taking a closer look into crypto mining in the county after the activity stirred controversy in neighboring Cherokee County, specifically over how loud these operations can be.\n\nIn response, Buncombe County Commissioner Terri Wells said at that time that “it’s just something I’d rather be proactive in looking at.”\n\nAD\n\nAD\n\nBitcoin mining around the world\n\nIn November 2022, New York's governor ratified a similar 2-year moratorium on new proof-of-work (PoW) Bitcoin mining operations.\n\nChampioned by New York assembly member Anna R. Kelles, the bill will pause \"permits from being issued for two years to proof-of-work cryptocurrency mining operations that are operated through electric generating facilities that use a carbon-based fuel.\"\n\n\"As New York and Buncombe County look to halt digital asset mining, numerous other jurisdictions are welcoming the innovation, jobs, and revenue,\" the Digital Chamber of Commerce's VP of policy Cody Carbone told Decrypt. \"I believe these efforts are shortsighted, but will not impact the growth of this industry long term.\"\n\nChina’s government reiterated its ban on Bitcoin mining operations in 2021, calling crypto-related businesses \"illegal financial activities.\"\n\nSince then, the U.S. has become the major hub for miners, with American firms accounting for 37.8% of the entire network’s hash rate today, per the Cambridge Bitcoin Electricity Consumption Index (CBECI)."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vcHJvZmVzc2lvbmFsL2Jsb2cvY29uZmlkZW5jZS1pbi1iaXRjb2luLWdyb3dzLWFzLWl0LXBhc3Nlcy1hLWxpcXVpZGl0eS1zdHJlc3MtdGVzdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Confidence in Bitcoin grows as it passes a liquidity stress test | Insights - Bloomberg",
        "content": "This analysis is by Bloomberg Intelligence Senior Market Structure Analyst Jamie Douglas Coutts. It appeared first on the Bloomberg Terminal.\n\nAlthough the rates narrative has dramatically shifted, Bitcoin continues to be the signal in the noise as its Q1 performance marks a significant milestone in its potential ascendancy as a global reserve asset. Even as the market prices in deflation and US authorities ramp up hostilities against the industry, confidence in the network based on the hashrate is hitting an all-time high.\n\nShift in market narrative\n\nWith backward-looking inflation prints remaining high, 2023 started with a consensus rates narrative of “high for longer”. Bitcoin’s outperformance of global assets had started in November and continued through the first two months of 2023, when the market narrative suddenly changed; a liquidity crisis in US banks was prompted by the Fed’s record-setting rate rises and the subsequent depositor exodus."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9tYWdpYy1lZGVuLXJvbGxzLWJpdGNvaW4tb3JkaW5hbHMtMTYwMDAwNjEwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Magic Eden Rolls Out Bitcoin Ordinals NFT Creator Launchpad - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nNon-fungible token (NFT) marketplace Magic Eden said Thursday it’s rolling out a creator launchpad for Ordinals, helping creators successfully inscribe their Bitcoin-based NFT collections.\n\nWhile the company already has the infrastructure for creators to list and sell Ordinals, the launchpad will help onboard creators to the ecosystem to easily facilitate the creation of tokens on the Bitcoin network. The process of inscribing an Ordinal NFT is far different from minting a digital asset on Ethereum, which poses a barrier to entry for many creators who aren’t familiar with the intricacies of Taproot and inscriptions. This led Magic Eden to find a way to help ease the process for the growing market of Ordinals collectors.\n\nSee Also: Crypto Custody Firm BitGo Releases Security Features Aimed at Bitcoin Ordinals\n\nZhuoxun Yin, chief operating officer and co-founder of Magic Eden, said in a press release that helping creators to mint Ordinals will help grow a larger market for tokenized assets on Bitcoin.\n\n“Bitcoin is the grandfather of all blockchains, and we believe it can be the home to pure digital artifacts,” said Yin. “With Ordinals, content can be preserved forever, and we're proud to be helping creators and the Ordinals community grow together.\"\n\nTo kick off its launchpad, Magic Eden is teaming with Ethereum-based NFT collection Godjira to release its Bitcoin-based (Dead)Jira collection on April 7. The company has also tapped creators Genopets, Lazy Lions, Humanoids and rapper Lil Durk to mint Bitcoin inscriptions on the new platform within the next week.\n\nThe excitement around Ordinals has grown since January and Magic Eden has been ready to embrace the growing market for inscriptions. Last month, Magic Eden released a Bitcoin NFT marketplace, allowing collectors to purchase Ordinals on the secondary market, integrating support for two Bitcoin wallets in doing so.\n\nStory continues\n\n\"We're on the ground level listening to what is needed from all of these subgroups of the Ordinals community, and we will look to deliver on those needs,\" said Head of Marketing at Magic Eden, Tiffany Huang. \"We think involvement of our expertise and resources is much needed to continue the growth of Ordinals and encourage a flourishing ecosystem.\"\n\nOutside of the Bitcoin network, Magic Eden has made an effort to expand its offerings outside of Solana, the layer 1 blockchain that put the marketplace on the map. Days after rolling out its Bitcoin NFT marketplace, Magic Eden established a Web3 gaming collective, bringing together leading blockchain-based game funds and publishers to help foster adoption in the space. Earlier in March, it kicked off \"Mint Madness,\" allowing users to mint free NFTs for over a dozen Web3 games.\n\nUPDATE (April 6 17:03 UTC): Added quotes from Magic Eden."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iZWFyLW1hcmtldHMtYXJlLWZvci1maWxtaW5nLXRoZS1iaXRjb2luLWZpbG0tZmVzdGl2YWwtaW4td2Fyc2F30gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bear markets are for filming: The Bitcoin Film Festival in Warsaw - Cointelegraph",
        "content": "The bear market might rage on, but that won’t stop the Bitcoin (BTC) shooters, creators and filmmakers from producing new content.\n\nHosted in the capital of Poland, Warsaw, the first edition of the Bitcoin Film Festival took place in March. The festival brought together Bitcoin advocates and film lovers from across the globe to sit through some of the best-known Bitcoin films and documentaries.\n\nHosted in the Kinoteka theater in the iconic Palace of Culture and Science, the Bitcoin Film Festival festival celebrated Bitcoin’s growing global influence while underscoring the thriving cultural movement that underpins the digital network. Some talents from the Bitcoin movement’s first film festival, BitFilm in 2015, such as Tomer Kantor, were in attendance, and they continue to shoot Bitcoin-centric films.\n\nCointelegraph premiered The Bitcoin Farmer, a short documentary about Bitcoin mining using solely renewable energy in Ireland. The film was followed by a panel discussion with Cointelegraph’s director of video, Jackson Dumont; global reporter, Joe Hall; co-founder of Bitcoin Film Fest, Pierre Corbin; and Mark Morton and Vince Giltinan from Scilling Digital Mining.\n\nOn stage for the Bitcoin Farmer debrief. From left, Pierre Corbin, Joe Hall, Jackson Dumont, Vince Giltinan and Mark Morton.\n\nPierre Corbin told Cointelegraph that he and co-founder Tomek Kolodziejczuk put together the Bitcoin Film Festival because it’s a “cool idea” for the community. Although the film fest was a valuable means of introducing Polish people to Bitcoin, Pierre explained that Bitcoin “has been very popular here in Poland with Ukrainians coming here because of the war.”\n\nPoland borders Ukraine, with as much as 25% of Poland’s immigrant population being Ukrainian. At the outset of the war, Bitcoin donations soared, and Corbin explains that people on the ground used the decentralized tool:\n\n“The human rights foundation helped them [Ukrainians] transfer their wealth into Bitcoin, helping them cross the border here into Poland and then walk them through the process of getting their money back out from Bitcoin ATMs because Poland is the country in Europe with the most Bitcoin ATMs.”\n\nKolodziejczuk set the ball rolling for the world’s first Bitcoin film festival in November 2022. He was keen to meet Corbin and screen his film, The Great Reset and the Rise of Bitcoin, at a local Bitcoin meetup. However, the idea snowballed. Their encounter and subsequent meetings led to the screening of Bitcoin movies from around the world in one of Eastern Europe’s most iconic buildings.\n\nThe film festival location. Source: Linkedin\n\nFrom documentaries shot in El Salvador, like Bond to Unbind, to a snapshot of the impact of Bitcoin on individuals’ lives in The Human B, the film festival showcased the most recent and notable film production efforts. Corbin explained the selection process:\n\n“If you select the right films that tell the right stories, then bringing people from outside will understand Bitcoin from the angle that we want them to understand.”\n\nA crowdfunding campaign was held through the Bitcoin crowdfunding campaign Geyser Fund, in which The Satoshi Mystery by Remi Forte won the community voting segment. Meanwhile, Corbin raised satoshis (the smallest denomination of Bitcoin) for his second Bitcoin documentary, The Fight for the US Dollar.\n\nRelated: Film review: ‘Human B’ shows a personal journey with Bitcoin\n\nThe film festival also piggybacked off a Libertarian conference hosted in Warsaw the same weekend. Libertarians are proponents of minimizing the state’s encroachment on daily life, and were some of the earliest adopters of Bitcoin.\n\nThe Bitcoin Film Festival organizers are mulling whether to change the location for the 2024 installment or keep the festival in Warsaw. While bear markets are undoubtedly for building, it appears they’re also for filming.\n\nMagazine: NFT Creator, Sarah Zucker: The Sarah Show’s analog past meets dizzying digital future"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vZmluYm9sZC5jb20vc2VsZi1wcm9jbGFpbWVkLXNhdG9zaGktYWNjdXNlcy1hcHBsZS1vZi12aW9sYXRpbmctY29weXJpZ2h0LWJ5LXB1dHRpbmctYml0Y29pbi13aGl0ZS1wYXBlci1vbi1tYWNib29rcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Self-proclaimed Satoshi accuses Apple of violating copyright by putting Bitcoin white paper on MacBooks - Finbold - Finance in Bold",
        "content": "As soon as it was discovered that the Bitcoin white paper was integrated into Apple’s macOS operating systems, self-proclaimed Satoshi Nakamoto Dr. Craig Wright accused the tech giant of breaching copyright laws.\n\nIndeed, on April 6, Wright turned to Twitter to respond to a message which stated that Apple might be infringing upon copyright. The tweet also asked for the computer scientist’s view on the matter after it came to light earlier this week that the Bitcoin white paper is buried deep inside new MacBooks; White said, “Yes.”\n\nYes — Dr Craig S Wright (@Dr_CSWright) April 6, 2023\n\nSome on social media have openly encouraged Wright to sue Apple, even though doing so would almost certainly fail or be counterproductive given the company’s financial and legal resources.\n\nBitcoin White Paper on MacBook. Source: Andy Baio\n\nBitcoin White Paper hid inside MacBooks\n\nNotably, Finbold reported on April 6 the first discovery was made by tech writer Andy Baio, who discovered that a copy of the white paper had been covertly hidden in Apple’s macOS since the Mojave version in 2018.\n\nThe self-proclaimed Satoshi is well-known for his contentious approach to asserting intellectual property rights over Bitcoin and its underlying technology.\n\nPatent trolling refers to submitting many patent applications all at once, in this case, covering Bitcoin and blockchain technologies. Wright hopes to have legal authority over the further creation and use of the technology in this manner.\n\nIn doing so, an individual or company can take legal action against other businesses to protect their intellectual property. Because of this, they may ask for expensive licensing and royalty payments and fight costly legal disputes."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vd3d3Lm1hY29ic2VydmVyLmNvbS90aXBzL2hvdy10by9maW5kLWhpZGRlbi1iaXRjb2luLXdoaXRlcGFwZXItbWFjb3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "How to Find the Hidden Bitcoin Whitepaper in macOS - The Mac Observer",
        "content": "There are often Easter eggs found within Apple’s various operating systems. In the latest find, sleuths discovered a PDF copy of Satoshi Nakamoto’s Bitcoin whitepaper hidden within macOS for years. In fact, it’s shipped with every copy of the Mac operating system since macOS Mojave in 2018. Let’s walk through how you can find this hidden gem.\n\nWhich Versions of macOS Have the Bitcoin Whitepaper?\n\nAccording to Andy Baio, Nakamoto’s technical paper on the first cryptocurrency has been included in every version of macOS since 10.14 Mojave. You won’t find it, though, in macOS 10.13 High Sierra or earlier.\n\nI’ve confirmed for myself that it’s present on macOS Ventura 13.3. Someone at Apple squirreled it away inside an Image Capture device called “Virtual Scanner II.”\n\nIt’s rather perplexing, because that device doesn’t seem to appear for everyone in the Image Capture utility. For those who do have it, though, the Bitcoin whitepaper serves as a sample document for the device. Some suggest Virtual Scanner II might be used to power the “Import from iPhone” feature, but I’ve been unable to confirm that.\n\nFinding the Hidden PDF On Your Mac\n\nThat being said, here are two ways you can locate the hidden PDF. You can do this either from Terminal or Finder, with Terminal being (surprisingly) the easiest method.\n\nOpening the Bitcoin Whitepaper Using Terminal\n\nThe quickest and easiest way to view this whitepaper is going to be from the command line. Here’s what you need to do.\n\nOpen Applications > Utilities > Terminal. From Terminal, enter the following command all on a single line:\n\nopen /System/Library/Image Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nThe Bitcoin PDF should open immediately in Preview.\n\nNavigating to the Easter Egg With Finder\n\nIf Terminal’s not inside your comfort zone, fear not. There is another way to open up Satoshi’s Bitcoin treatise.\n\nTime needed: 1 minute To open the Bitcoin whitepaper using Finder, just follow these steps. Click the Finder icon in the Dock. Click on Macintosh HD. Open System > Library > Image Capture > Devices. Right-click on VirtualScanner.app, then click Show Package Contents. Now open Contents > Resources. Double-click the simpledoc.pdf file.\n\nHere Today, Gone Tomorrow?\n\nIf you want to snag that PDF copy, you may want to follow one of the guides above sooner rather than later. According to our sources, someone at Apple filed the document’s presence as an issue/bug nearly a year ago.\n\nWhile the person who reported the “bug” hasn’t taken any action or commented on it since then, other sources say the file will “likely be removed in future versions.”\n\nPersonally, I think Apple should leave it, as it’s completely harmless. It’s definitely not the problem posed by an earlier Image Capture bug that could fill your entire storage device with empty data."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZGVjcnlwdC5jby8xMjU1OTkvbWFnaWMtZWRlbi1iaXRjb2luLW5mdC1sYXVuY2hwYWQtb3JkaW5hbHPSAUlodHRwczovL2RlY3J5cHQuY28vMTI1NTk5L21hZ2ljLWVkZW4tYml0Y29pbi1uZnQtbGF1bmNocGFkLW9yZGluYWxzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Magic Eden Bitcoin NFT Launchpad Debuts as Ordinals Total Nears 1 Million - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Ordinals protocol for inscribing digital assets on Bitcoin—similar to NFTs on Ethereum and other blockchain networks—has taken off in a big way so far this year. And now with the total number of Ordinals about to top 1 million, Magic Eden is rolling out a platform that lets creators launch new collections.\n\nThe multi-chain marketplace, which recently launched on Bitcoin and quickly overtook rivals in terms of Ordinals trading volume, announced today that it will debut its Bitcoin launchpad on Friday. The launchpad is a primary sales platform for creators who have inscribed artwork or media to the Bitcoin blockchain.\n\nMagic Eden’s first launchpad project on Bitcoin is Deadjira, a spinoff from the Ethereum NFT project Godjira, with a series of 107 pixelated lizard-themed profile pictures (PFPs) that were inscribed in February.\n\nAD\n\nAD\n\nPG x Magic Eden\n\nFirst Bitcoin Launchpad 💀🦖 Let the 🪄 begin @PGodjira @MEonBTC pic.twitter.com/FMf3AfSIWQ — Magic Eden 🪄 (@MagicEden) April 5, 2023\n\nThe launchpad will feature a few more Ordinal drops over the following week, including from Solana-based NFT game project Genopets, fellow existing NFT projects Lazy Lions and The Humanoids, and a project from popular rapper Lil Durk.\n\nInitially, the launchpad will let creators sell Bitcoin Ordinals that have already been inscribed to the blockchain, or Magic Eden itself can help facilitate the inscription process if requested.\n\nCreators may use an allowlist if desired to let certain wallet addresses mint Ordinals, and then users will “come to mint in a trustless minting form, and it will essentially execute the sale of the pre-inscribed Ordinal to the allowlisted users wallet for the mint price,” a Magic Eden representative told Decrypt.\n\nMagic Eden's launchpad is a business initiative that complements its secondary marketplace, providing a \"white glove service\" for creators to debut new projects. It's a revenue-generating venture for Magic Eden, and a rep told Decrypt that the company's cut or share of each launch \"varies by deal.\"\n\nAD\n\nAD\n\nThe firm's Ordinals marketplace has routinely topped the charts for trading volume since its March launch, although it's still a relatively small market. Magic Eden has racked up about $3.3 million worth of sales volume with Ordinals so far, per data from Dune, serving only about 2,700 unique wallets.\n\nOrdinals rise\n\nInscribing Ordinals or “digital artifacts” on the Bitcoin blockchain is a different process than minting NFTs on a chain like Ethereum or Solana.\n\nOn those chains, NFT projects use smart contracts—which contain the code that operates decentralized protocols and software—to enable functionality like on-demand minting. That allows creators to drop things like PFP projects in which images are generated from a pool of possible traits, or generative artwork spawned from an artist’s custom algorithm.\n\nOrdinals launched in January, letting people inscribe artwork, media, and text directly to the Bitcoin blockchain by attaching them to an individual Satoshi, the smallest unit of measure for Bitcoin (1/100,000,000 BTC). Inscribing is a more complicated process than deploying NFT projects on other top chains, however, and the Ordinals infrastructure is early and still evolving.\n\nBut that hasn’t stopped creators from embracing the concept. More than 930,000 inscriptions have been made in just over two months, and given that a single-day record of over 76,000 inscriptions was set on Tuesday this week, the total could well top the million mark before the end of this week.\n\nMagic Eden Head of Marketing Tiffany Huang told Decrypt that \"a lot of creators understand the value it offers, how it differentiates from other blockchains, and how having presence on Bitcoin can be complimentary to a collection or brand.\" But she added that inscribing and selling Ordinals \"can also be quite loaded with friction to get started.\"\n\nAlong with original projects, Ordinals has thus far lured notable NFT creators from other chains, including Bored Ape Yacht Club maker Yuga Labs with its Twelvefold generative art project, DeLabs with BTC DeGods, and photographer Justin Aversano. Magic Eden believes that its launchpad will help even more creators embrace the burgeoning Ordinals space.\n\nEditor's note: This article was updated after publication to include comment from Magic Eden about its launchpad business terms.\n\nAD\n\nAD"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vdGVjaC5oaW5kdXN0YW50aW1lcy5jb20vdGVjaC9uZXdzL2JpdGNvaW4tcHJpY2Utd2lsbC1nby10by10aGUtbW9vbi13aGVuLXRoaXMtaGFwcGVucy03MTY0OTMwNDc5MTI1MS5odG1s0gF1aHR0cHM6Ly90ZWNoLmhpbmR1c3RhbnRpbWVzLmNvbS9hbXAvdGVjaC9uZXdzL2JpdGNvaW4tcHJpY2Utd2lsbC1nby10by10aGUtbW9vbi13aGVuLXRoaXMtaGFwcGVucy03MTY0OTMwNDc5MTI1MS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price will go to the ‘Moon’ when this happens? - HT Tech",
        "content": "Billionaire crypto investor Michael Novogratz says that once the Federal Reserve takes a pause, Bitcoin could start to take off again.\n\nNovogratz, who leads Galaxy Digital Holdings, predicted the central bank under the helm of Jerome Powell will remain “very hawkish for a while” due to high inflation, and will likely raise interest rates by 50 basis points soon. But as the economy slows down and the Fed steps back, “Bitcoin goes to the moon,” he said, repeating a popular crypto catchphrase.\n\nNovogratz was speaking at the “Bitcoin 2022” conference in Miami, which kicked off on Wednesday with the unveiling of a bull statue that commemorates the city's partiality toward cryptocurrencies and the digital-assets industry. The event has attracted more than 25,000 attendees.\n\nNovogratz also reiterated a call that Bitcoin will eventually reach a price of $500,000 and eventually $1 million. The largest digital currency fell about 3.3% to $44,366 as of 10:34 a.m. Eastern time.\n\n“I go to bed and I pray that the stewards of the U.S. economy don't screw it up,” he said, adding that he has Russian friends who have gone “bankrupt” recently. “And so I really do pray that the dollar is going to be strong and it doesn't go to infinity because Bitcoin going to infinity means the rest of the Western world has really fallen apart,” he said, though Bitcoin can reach his price targets “with stability in the West.”\n\nBitcoin has recently traded in a narrow range -- it hasn't been able to meaningfully break out above $48,000 and is down so far this year. Proponents have been debating which of its narratives -- including whether it's an inflation hedge or not -- is most prevalent at the moment and which story could likely end up sticking for the long run.\n\nNovogratz said that though Bitcoin has largely traded in tandem with the tech-heavy Nasdaq 100, it could be in the process of disabusing itself from that relationship. Bitcoin's purpose, he says, won't be for purchasing everyday items, like shoes. But, “it's that I'm going to take some of my wealth and preserve and store it there.” The coin, he added, is becoming a part of institutional portfolios."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3Lm1hY3dvcmxkLmNvbS9hcnRpY2xlLzE3ODA0NDUvaG93LXRvLWZpbmQtdGhlLWJpdGNvaW4td2hpdGVwYXBlci1oaWRkZW4taW4tbWFjb3Mtd2hpbGUteW91LXN0aWxsLWNhbi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "How to find the Bitcoin whitepaper hidden in macOS (while you still can) - Macworld",
        "content": "Ever notice that macOS takes up a whole lot of storage space? There’s a lot of code in macOS, and apparently, some of it is not what you’d expect, as Andy Baio found out earlier this week. On Baio’s blog, Waxy.com, he wrote about his discovery of Satoshi Nakamoto’s Bitcoin whitepaper that is stashed within macOS.\n\nThe paper, titled “Bitcoin: A Peer-to-Peer Electronic Cash System,” explains the Bitcoin electronic cash system and was originally published in 2008. The paper has apparently shipped with every copy of macOS since Mojave in 2018. Why? No one really knows. Baio theorizes that it was used as a test document.\n\nBaio notes that “a little bird” told him that the paper could be removed in a future version of macOS. So if you want to see it, here’s how.\n\nSee the hidden Bitcoin whitepaper via the Terminal\n\nOpen the Terminal app (it’s in Applications > Utilities) and enter the following:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nSee the hidden Bitcoin whitepaper via the Finder\n\nDon’t want to use the Terminal? Do the following:\n\nIn the Finder, open the Go menu and select Go to Folder. In the Go to Folder that appears enter the following: /System/Library/Image Capture/Devices Press the Return key. The Finder window should appear with a VirtualScanner app icon. Control-click (or right click) VirtualScanner and select Show Package Contents. The Finder window should show a Contents folder. Open it. Open the Resources folder. Open (or use Quick Look) the file named simpledoc.pdf.\n\nThe gif below shows how to navigate to the whitepaper the long way, by opening the nested folders.\n\nFoundry\n\nLong-held secret\n\nWhile Baio and others have recently discovered this, Joshua Dickens tweeted about it in 2020. Dickens also points out that there’s an image that resembles a Thomas Hawk photo in the same folder as the Bitcoin whitepaper.\n\nHere's a mystery: why do I have an Image Capture device called Virtual Scanner II on my Mac? It shows a preview of a painted sign that for some reason closely resembles a photo by @thomashawk on 'clustershot'? But not exactly — the scanned version looks more weathered. pic.twitter.com/jPb5kx3NyS — Josh D (@schwa23) November 28, 2020\n\nThe VirtualScanner stuff is just one of the hidden mysteries of macOS. Now if only we can figure out the mysteries of macOS Ventura 13.3…"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvZGNncy1iaXRjb2luLW1pbmluZy1maXJtLWZvdW5kcnktdG8tYmVnaW4tY2hhcmdpbmctZmVlcy1mb3Itc2VydmljZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "DCG's Bitcoin Mining Firm Foundry To Begin Charging Fees For Services - Nasdaq",
        "content": "The largest mining pool by hash rate share will no longer offer its services for free, according to a notice sent to clients.\n\nFoundry, the Bitcoin mining arm of Digital Currency Group, will stop providing its services for free, according to a notice distributed to clients as reported by Bloomberg.\n\nThe company has been offering its mining pool services free of charge since 2019 which contributed to its significant growth, now holding the largest share of estimated hash rate at more than 30%.\n\n\n\nThe notice states that the mining pool fees will be tiered based on the previous quarter’s average hashrate. The change is expected to take effect between April 19 and April 22.\n\nDCG's crypto lending unit, Genesis, filed for bankruptcy as one of the final dominos ensuing from the collapse of Sam Bankman-Fried’s FTX exchange.\n\n\n\nBitcoin mining companies faced a rocky 2022, with many “fighting for survival,” as Bitcoin Magazine PRO analysts put it. But despite necessary moves like public mining giant Marathon Digital selling bitcoin for the first time in company history, good news has come out of the industry as 2023 takes off, such as the announcement of Terawulf’s nuclear facility operation, the expected 50MW CleanSpark expansion, and more.\n\n\n\nThis move by Foundry may be a bolstering effort designed to better mitigate the impacts of seasons like that of late 2022.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3Lnh0Yi5jb20vaW50L21hcmtldC1hbmFseXNpcy9uZXdzLWFuZC1yZXNlYXJjaC9jcnlwdG8td2Vha2VuZWQtYmVhcmlzaC1kaXZlcmdlbmNlLW9mLWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Crypto weakened Bearish divergence of Bitcoin - XTB",
        "content": "Cryptocurrencies are retreating from recent record highs as the sell-off on the Nasdaq gains strength and concerns around a slowing US economy have increased. A weakening consumer could mean lower risk appetite and a narrower range of potentially interested buyers of speculative assets. A recession would likely do nothing good for the crypto market. With its declining reaction in recent days, bitcoin has confirmed that its role as a recession or banking crisis hedging asset is still uncertain. Is the king of cryptocurrencies in for a trend change?\n\nA change in the crypto trend?\n\nThe on-chain market sentiment vector is pointing to levels close to greed, which could signal an impending correction. It's also worth noting that BTC's volatility has been drying up in recent days, which has historically heralded an imminent, sudden price movement. Source: Glassnode\n\nLooking at the chart of BITCOIN on the D1 interval, we can see that the RSI indicator has risen since the beginning of the year, but since then it has been recording lower and lower levels, although the price of the largest cryptocurrency has been steadily rising. This phenomenon is called a bearish divergence, and it can signify the weakening strength of buyers and a change in the trend. The closest support level for declines is the 23.6 Fibonacci retracement of the upward wave initiated on March 11, when the cryptocurrency rebounded sharply amid the collapsing SVB. Source: xStation5"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZW4taW4vZW50cmVwcmVuZXVycy81LXRoaW5ncy10by1rbm93LWFib3V0LXNhdG9zaGktbmFrYW1vdG8tYXMtdGhlLWZvdW5kZXItb2YvNDQ5MjMy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "5 Things To Know About Satoshi Nakamoto As The Founder of Bitcoin Turns 48 - Entrepreneur",
        "content": "Satoshi Nakamoto created Bitcoin in 2008 making it world's first decentralised currency. According to the P2P Foundation forum, Nakamoto had developed a new open-sourced P2P e-cash system called Bitcoin.\n\nOpinions expressed by Entrepreneur contributors are their own.\n\nYou're reading Entrepreneur India, an international franchise of Entrepreneur Media.\n\nThe founder of Bitcoin, the most popular crypto on the planet, Satoshi Nakamoto, turned 48 on April 5. Satoshi Nakamoto created Bitcoin in 2008 making it world's first decentralised currency. According to the P2P Foundation forum, Nakamoto had developed a new open-sourced P2P e-cash system called Bitcoin.\n\nSatoshi Nakamoto: Still a Mystery?\n\nThe name Satoshi Nakamoto has earned plaudits all over the world for inventing a new-age P2P e-cash system. However, the identity of the person still remains a mystery. Some people believe that Satoshi Nakamoto might be a group of people who helped Bitcoin to come to life while some believe it is a single person. The identity has not been disclosed as the founder of Bitcoin continues to live in the shadows.\n\nNakamoto: A Potential Nobel Prize Winner?\n\nNakamoto could have been a nobel prize winner in economic sciences in 2015 as he was nominated by Bhagwan Chowdhry, a professor of finance at UCLA.\n\nThe Hidden Meaning Behind His Birth Date\n\nSatoshi Nakamoto chose April 5th to be his birth date according to the P2P Forum foundation. The date is significant in the history of the world since Franklin D. Roosevelt, former President of the United States of America, started issuing an executive order for all U.S. citizens to return all gold coins and certificates worth more than $100 to federal reserve in 1933.\n\nSharing Wealth is Important\n\nNakamoto's main motive to start Bitcoin was to initiate decentralized transactions but also to share wealth. The pseudonymous founder of Bitcoin even told his successor Gavin Anderson to share wealth a she believed it was as important as making the venture successful.\n\nSatoshi Nakamoto: A Billionaire?\n\nThe popular belief is Satoshi Nakamoto might be a billionaire due to being the creator of Bitcoin. According to an analysis by the Independent, Satoshi Nakamoto was the 15th richest person as of 2021. Estimates suggest Satoshi Nakamoto 's net worth would be approximately $42-43 billion. People believe that Satoshi Nakamoto owns more than 1 million Bitcoin in total."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vZmluYm9sZC5jb20vZ3VpZGUvYnV5LWJpdGNvaW4td2l0aC1zbmFwY2hhdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "How to Buy Crypto With Snapchat [2024] - Finbold - Finance in Bold",
        "content": "Summary: Snapchat does not provide cryptocurrency trading on its platform. Therefore, to buy digital assets, such as Bitcoin (BTC) and Ethereum (ETH), we suggest investors sign up with a trusted crypto-friendly multi-asset investing platform such as eToro.\n\nBest Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals.\n\n0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees.\n\nCopy top-performing traders in real time, automatically.\n\neToro USA is registered with FINRA for securities trading. 30+ million Users Get Started eToro is a multi-asset investment platform. The value of your investments may go up or down. Your capital is at risk. eToro USA LLC does not offer CFDs, only real Crypto assets available. Don’t invest unless you’re prepared to lose all the money you invest.\n\nCan you buy crypto with Snapchat?\n\nUnfortunately, you can’t buy, sell, or trade crypto on Snapchat. However, there are many other investing platforms where you can buy digital assets with various payment methods, including bank transfers, credit cards, and online payment systems like PayPal.\n\nHow to buy crypto with Snapchat?\n\nAs of now, Snapchat does not offer a built-in feature to buy or sell cryptocurrencies. However, to invest in cryptocurrencies, you can sign up with a renowned broker like eToro, which is a widely trusted multi-asset investing platform with over 70 cryptocurrencies and unique features such as Copy Trading (enables users to imitate top-performing crypto traders), a staking service, custom watchlist, as well as advanced charts and technical analysis tools.\n\nHow to buy crypto with Snapchat: Step-by-step\n\nYou can get started in minutes with four simple steps:\n\nStep 1: Create an account on eToro and complete your verification (personal or company);\n\nCreate an account on and complete your verification (personal or company); Step 2: Enter the GBP/EUR/USD amount you want to deposit on the eToro platform;\n\nEnter the GBP/EUR/USD amount you want to deposit on the eToro platform; Step 3: Deposit your selected fiat currency;\n\nDeposit your selected fiat currency; Step 4: The final step is to find the cryptocurrency you want to purchase and execute your trade.\n\nDisclaimer: Cryptocurrency is offered by eToro USA LLC (“the MSB”) (NMLS: 1769299) and is not FDIC or SIPC insured. Investing involves risk, and content is provided for educational purposes only, does not imply a recommendation, and is not a guarantee of future performance. Finbold is not an affiliate and may be compensated if you access certain products or services offered by the MSB.\n\nCrypto on eToro. Source: etoro.com\n\nAbout Snapchat\n\nSnapchat (NYSE: SNAP), developed by Snap Inc., is a multimedia instant messaging app and service founded in 2011 by Evan Spiegel, Bobby Murphy, and Reggie Brown. A key characteristic of Snapchat is that photos and messages are typically only viewable for a short period before they become unavailable to the receiver.\n\nSnapchat’s homepage. Source: snapchat.com\n\nSnapchat’s crypto policy\n\nSnapchat does not have cryptocurrency trading services, so you can’t buy, sell or trade any crypto assets with Snapchat.\n\nHow to buy crypto safely\n\nBuying crypto can be lucrative but comes with risks. The thing is—cryptocurrencies are highly volatile and susceptible to scams. Therefore, to navigate this wild market safely:\n\nResearch thoroughly: Understand the chosen cryptocurrency and its risks;\n\nUnderstand the chosen cryptocurrency and its risks; Use a secure device: Avoid public networks; use a personal computer with a VPN;\n\nAvoid public networks; use a personal computer with a VPN; Choose a reputable exchange: Ensure it’s licensed, read terms, and check reviews;\n\nEnsure it’s licensed, read terms, and check reviews; Secure your account: Employ two-factor authentication and a strong password;\n\nEmploy two-factor authentication and a strong password; Use a secure wallet: Opt for a hot or cold wallet to safeguard against hackers;\n\nOpt for a hot or cold wallet to safeguard against hackers; Invest wisely: Only invest what you can afford to lose, especially in the volatile crypto market;\n\nOnly invest what you can afford to lose, especially in the volatile crypto market; Monitor investments: Stay informed about market changes and your chosen cryptocurrency’s performance.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk.\n\nFAQs about how to buy crypto with Snapchat\n\nDoes Snapchat have crypto? Snapchat doesn’t offer cryptocurrency services on its platform.\n\nCan you buy crypto on Snapchat? No, Snapchat users can’t buy crypto Snapchat. Nevertheless, investors that are looking to buy cryptocurrencies can sign up with a crypto-friendly multi-investing platform, such as eToro."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY29pbmpvdXJuYWwubmV0L25ld3MvMS1pbi1ldmVyeS0xMzgtYml0Y29pbnMtYXJlLW5vdy1vd25lZC1ieS1taWNyb3N0cmF0ZWd5LWJ1dC1pdC1kb2VzbnQtbWFrZS1tdWNoLXNlbnNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "1 in every 138 Bitcoins are now owned by MicroStrategy, but it doesn't make much sense - CoinJournal",
        "content": "Key Takeaways\n\nMicroStrategy has purchased another thousand Bitcoin, taking their holdings to 140,000 at an average price of $28K\n\nThe total investment is now $4.2 billion, with the company’s fate tied to the Bitcoin price\n\nCEO Saylor remains ultra-bullish, but has no regard for risk management\n\nFor investors, someone may as well just purchase Bitcoin directly\n\nMicroStrategy is at it again.\n\nThe software company, which is now essentially a Bitcoin -holding company, has purchased another 1,045 Bitcoin. The company now holds 140,000 coins, with Michael Saylor’s now-trademark Twitter post announcing the latest investment to the world Wednesday.\n\nMicroStrategy has acquired an additional 1,045 #bitcoin for ~ $29.3M at an average price of $28,016 per bitcoin. As of 4/4/2023 @MicroStrategy holds 140,000 bitcoin acquired for ~$4.17 billion at an average price of $29,803 per bitcoin. $MSTR https://t.co/IBufTxalnv — Michael Saylor⚡️ (@saylor) April 5, 2023\n\nMicroStrategy’s 140,000 stash of Bitcoins is the largest holding of any public company. It constitutes 0.72% of the entire supply, meaning they own 1 in every 138 Bitcoins currently in circulation.\n\nA long way to go to Satoshi Nakamoto and his/her approximate stash of 1 million coins (5.2% of the supply), but Saylor is on his way.\n\nThe latest purchase was locked in at average price of $28,016 per Bitcoin, bringing the average price to $29,803, meaning the company is slightly underwater on the $4.17 billion investment.\n\nMichael Saylor doesn’t do risk management\n\nCEO Saylor’s conviction remains unwavering, while his disdain for portfolio diversification is also unchanged. For me, regardless of your thoughts on Bitcoin as an investment, it is difficult to get on board with an investment of this scale.\n\nThe risk is extreme, with the fate of the company now well and truly in the hands of the capricious crypto gods. A look at the share price action shows how tightly correlated it now is with Bitcoin. MicroStrategy shed three-quarters of its value last year as Bitcoin plummeted amid the bear market, but has doubled this year as Bitcoin has bounced back.\n\nSaylor’s conviction may be admirable, but his risk management not. This is especially pertinent when looking at his rhetoric regarding advising people on what to do with their funds – again, nothing to do with Bitcoin, but the failure to understand the risk tolerance and financial circumstances of everyday people is jarring:\n\n“Take all your money and buy Bitcoin. Then take all your time to figure out how to borrow more money to buy more Bitcoin. Then take all your time to figure out what you can sell to buy Bitcoin.\n\nAnd if you absolutely love the thing and don’t want to sell it, go mortgage your house and buy Bitcoin with it. And if you’ve got a business that you love because your family works for the business – if it’s been in the family for 37 years and you can’t bear to sell it – mortgage it, finance it and convert the proceeds into the hardest form of money on earth, which is Bitcoin”\n\nThe interview occurred in March 2021. Bitcoin was trading north of $56,000 at the time, approximately double what it is currently. I sincerely hope that nobody listened to his advice of this billionaire and mortgaged their house or business.\n\nAnd again, this is not a discussion on the merits or price of Bitcoin. The same logic would hold if Bitcoin was now $200,000 per coin. Not that it needs to be said, but for the record, mortgaging your future and your entire financial well-being on one asset – and especially one as volatile as Bitcoin- is, well, not smart.\n\nNonetheless, Saylor is intent on doing this with MicroStrategy. At least that is a little less perilous than betting one’s own personal future. But the reality is that with such a large investment – $4.17 billion! – MicroStrategy is now a Bitcoin holding company.\n\nFor investors, I am not sure what the appeal is here, as one can just buy Bitcoin directly. For Saylor, however, he doesn’t seem to care. He’s all in."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vcHVuY2huZy5jb20vYml0Y29pbi1wbGF0Zm9ybS13aXRoLTEtNW0tbmlnZXJpYW4tdXNlcnMtc2h1dHMtZG93bi_SAU1odHRwczovL3B1bmNobmcuY29tL2JpdGNvaW4tcGxhdGZvcm0td2l0aC0xLTVtLW5pZ2VyaWFuLXVzZXJzLXNodXRzLWRvd24vP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin platform with 1.5m Nigerian users shuts down - Punch Newspapers",
        "content": "Peer-to-peer Bitcoin platform, Paxful, with 1.5m users in Nigeria, has announced that it is shutting down its operations.\n\nThis was disclosed by the Co-founder and Chief Executive Officer, Ray Youssef, in a blog post on Tuesday.\n\nHe said, “Today, Paxful will be suspending its marketplace. We are not sure if it will come back. This will probably come as a big shock to many. While I cannot share the full story now, I can say that we unfortunately have had some key staff departures.\n\n“Also, regulatory challenges for the industry continue to grow, especially in the peer-to-peer market and most heavily in the U.S. While we work through these issues, we have taken the most secure option and ask you to explore self-custody and trade elsewhere.”\n\nAccording to crypto-focused news website, Decrypt, Youssef said during a Twitter Space that the decision to close the platform was also influenced by a lawsuit brought by a Paxful co-founder who is suing Paxful and Youssef after being “kicked out of the company” over a year ago.\n\n“My co-founder sued the company and sued me. I have a lawsuit over my head right now,” he was quoted as saying on the Twitter Space.\n\nThough he did not name the plaintiff explicitly, Youssef was likely referring to co-founder Artur Schaback, who filed a lawsuit in Delaware Chancery Court against Youssef in January, based on a court docket hosted on CourtConnect.\n\nAlthough cryptocurrency is restricted in Nigeria, the 2020 Geography of Cryptocurrency Report by Chainalysis, ranked Nigeria eighth in crypto adoption and usage among 154 countries included in the study.\n\nNigerian cities, Lagos and Ibadan, have also been listed as cryptocurrency hubs across the globe by crypto accounting services firm, Recap, which put together a list of the top 50 crypto hubs in 2022. Nigerian cities made it to number 14 (Lagos) and 24 (Ibadan) respectively.\n\nPaxful is credited with pioneering the use of peer-to-peer technology in the country, thus helping to expand the crypto industry in Nigeria.\n\nIn an interview with Business Africa Insider in 2022, Paxful’s CEO said that Nigeria is the firm’s largest market, with 1.5 million users and over $1.5bn volume to date (since 2015).\n\nWith its impending closure, Paxful joins a long list of crypto firms to shut down after promising customers so much. Paxful gained prominence in Nigeria after the Central Bank of Nigeria placed a restriction on crypto transactions through official channels.\n\nDue to its P2P nature which allowed Nigerians to circumvent the ban, a lot of individuals started relying on the firm for their crypto demands. In 2021, the firm disclosed that Nigeria was its biggest market with a volume of $1.5bn.\n\nIt stated that it had over 1.5 million users from Nigeria at the time. In 2022, the firm told The PUNCH, “Nigeria is our largest country based on trade volume — Over $760m in trade volume last year. In 2021, we also saw over 6 million successful trades in Nigeria, which breaks down to over 16,000 trades each day.”\n\nThe firm confirmed to The PUNCH on Wednesday that there is currently no timeline for withdrawals. In an email, a spokesperson said, “The Paxful Wallet is up for users to safely get out their funds. Ray shared that he will not get his BTC off the platform until users do so as well.\n\n“There’s no timeline, but we will be transparent as details unfold.”\n\nCommenting on the firm’s shutdown, The President of Stakeholders in Blockchain Technology Association of Nigeria and General Secretary of Blockchain Industry Coordinating Committee of Nigeria, Senator Ihenyen, told The PUNCH that it would negatively impact the Nigerian crypto space.\n\nHe explained, “If you observe closely in the last two years, especially with the CBN’s restriction of crypto from the banking industry, the adoption of P2P has been the only viable option into the crypto market.\n\n“Paxful had a P2P platform that was largely trusted by its users. From all indications, it controls a big market here, I expect that this will be a significant negative impact on the growth of P2P in the Nigerian space.”\n\nHe noted that self-custody of crypto assets on decentralised exchanges will gain more prominence, especially with the recent and pronounced failure of many centralised exchanges."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tY2FzaW5vLWdhbWluZy10cmVuZHMtaW4tMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Casino Gaming Trends in 2023 - Analytics Insight",
        "content": "The year 2022 was a successful one for crypto casinos. Mobile gaming had a sharp rise, general improvements, and the introduction of new cryptocurrencies as payment options.\n\nThe hold and win slots have taken the gaming industry by storm. Additionally, once 2023 begins, you can only anticipate seeing more innovation given the popularity and profitability of cryptocurrency casinos.\n\nThe cryptocurrency gaming sector, albeit young, has already altered the way we view casinos. Today, you may use cryptocurrencies to place bets and improve your investment portfolio while still protecting your privacy and personal information. However, the cryptocurrency gaming industry is always changing, so in 2023 you may expect some fascinating developments to emerge.\n\nSome of the major trends to expect in the bitcoin casino gaming industry in 2023 include:\n\nChanges in crypto payment\n\nEvery casino’s payment method will undergo significant modifications in 2023. Some bitcoin casinos have started bypassing exchanges. On their website, they provide you the option to buy cryptocurrencies directly from them.\n\nThis greatly simplifies the procedure of making deposits at casinos. Additionally, it increases the accessibility of crypto casinos for a much bigger player base.\n\nYou may make a purchase using the program and your debit/credit card or Google Pay. Your casino account receives your money right away. In 2023, we can anticipate finding this function at any crypto casino.\n\nThe advent of original games with provable fairness\n\nProvably fair games are the obsession of cryptocurrency gamers. You may utilize blockchain technology to check the fairness of these games. Bitcoin casinos have gone the extra mile to provide players with more of a good thing by developing their own due to their popularity with players.\n\nAuthentic crash games, Plinko, dice games, and more are available. And throughout 2023, you can anticipate not just seeing this tendency persist but also growing.\n\nMany renowned bitcoin casinos have employed a group of game developers to produce brand-new, original games. There are no other casinos that offer these games. There are many other provably fair games available, including online slots, roulette, poker, and more.\n\nCreation of mobile-compatible casino games\n\nToday’s mobile-first revolution has been fueled by the release of new features, the widespread use of smartphones, and the increased accessibility of high-speed internet.\n\nIn most international markets, 80% of all gamblers in the gaming sector utilize mobile devices. According to recent estimates, internet devices now provide 70% of the income for the online betting sector.\n\nThis trend will undoubtedly impact the business over the coming several years by encouraging the development of casino games and activities that can be played on mobile and wearable devices.\n\nImproved online safety capabilities\n\nYou already experience higher levels of online safety when you play at cryptocurrency casinos rather than conventional betting sites. You can protect your financial and personal data by making deposits and withdrawals using your cryptocurrency wallet.\n\nHowever, there are undoubtedly some frauds in the field of online betting. To shield people from the consequences of malware and phishing attempts, the industry is swiftly adjusting. Even more crucially, the most trustworthy Bitcoin betting sites make use of top-notch software infrastructure and get the required certifications to increase consumer confidence.\n\nVR and AR gaming\n\nTechnologies like virtual reality and augmented reality have significantly contributed to the growth of the digital entertainment sector as a whole. And the cryptocurrency gaming market is by no means an exception.\n\nThese technological advancements enable you to have a lot more immersive gaming experience. You can imitate the special feelings you would have while playing at your preferred physical casino.\n\nAt the moment, the price of VR and AR headsets as well as their size continue to be a major barrier to their widespread acceptance. But as these technologies advance, more and more gamers opt to participate in VR gambling sessions in 2023 and beyond.\n\nCreation of robust bitcoin casino communities\n\nWith its players, crypto casinos are setting the groundwork for a better feeling of community. This was accomplished in the past through ongoing advertising offers and internet forums.\n\nBut it seems like casinos are trying to promote a feeling of family among their patrons. As a consequence, we are beginning to notice more public community conversations where you may interact with others, pose questions, win prizes by providing the answers to trivia questions, and give one another advice.\n\nThis kind of interaction has previously been seen in multiplayer games, such as the group conversations found in real-money casino games. However, we are now observing it more clearly at bitcoin casinos. If you’re new to casinos and looking for assistance or advice on how to enhance your games, this can be extremely beneficial.\n\nA more immersive casino experience\n\nThe crypto online casino industry has lagged behind other segments of the digital entertainment market in terms of gameplay and visuals. However, it’s unlikely that this tendency will continue for very long.\n\nToday’s bitcoin casinos use a variety of elements to make the gameplay more interesting. The casinos also want to improve the visual attractiveness of their gaming tables and slot machines. Utilizing specialized programming languages and graphic design methods are a couple of these.\n\nNot all cryptocurrency casinos are made equal or have the same features. However, advancements in visuals and user experience across the board can help you make an informed decision and personalize your gaming experience.\n\nAn emphasis on online privacy\n\nThe amount of secrecy offered by crypto casinos is one of the key factors that encourage gamblers to utilize them. You may protect your online privacy and participate in anonymous games without having to provide any money or personal information.\n\nThe industry is anticipated to continue developing in this manner during the next years to enhance consumer safety and privacy. New features that will soon be introduced include registration-free gaming and increased degrees of adherence to national privacy laws like GDPR.\n\nLive player option\n\nBuilding a thriving gaming community goes hand in hand with this latest iteration of bitcoin casino promos. Numerous bitcoin casinos are now scanning your data and analyzing your playing behavior using AI software.\n\nThis enables the promotions department of the casino to create a more accurate player profile for each user. The information will also allow the casino to build customized casino offers for you based on the games you prefer playing.\n\nA bitcoin casino may discover, for instance, that you play Aviator frequently and at around the same time each month. If the casino notices that tendency, it may send you an email or a direct message and give you free spins for your favorite game.\n\nAdditionally, casinos have the option to do this in real-time to improve benefits for VIP players. To provide you with more personalized VIP perks, they connect you with the VIP manager. The relationship between you and the casino will be strengthened thanks to these methods and technologies. They genuinely provide you with a singular experience that you can’t get anyplace else.\n\nEsports gambling\n\nOver the past ten years, there have been significant changes in the esports betting industry. Some of the finest gambling platforms have recently integrated eSports gaming into their libraries as a result of recent developments in the bitcoin casino market.\n\nEven though players haven’t been drawn to eSports at bitcoin casinos, the top casinos are always working to include additional eSports elements into their platforms. Therefore, it is projected that eSports gambling would become popular at online casinos in 2023.\n\nOther potential gambling trends for 2023\n\nSome of the crypto gambling trends that you may or may not experience in 2023 include:\n\nGamification\n\nIf you play video games or know someone who does, you’ve seen some popular patterns emerge. Now, you may buy skins, specialized skills and weapons, and other items straight from within the game. This is an additional area where bitcoin casinos may start to see how they may improve the gaming experience.\n\nCasinos may start to offer avatar creation and customization tools so that users may create unique avatars for their user accounts. We can undoubtedly anticipate that this strategy, which has been quite effective in mobile gaming, will soon spread into iGaming.\n\nCasinos are also introducing Wheels of Fortune loyalty programs as another kind of gamification. You may spin the wheel and win quick cryptocurrency rewards at several casinos’ daily free spins events.\n\nTop crypto casinos are also quite popular with level-up systems, where you get fresh incentives for each level you advance to. Increased cashback payouts, free spins on well-known games, fast cash awards, and other incentives can be prizes.\n\nTokens\n\nNumerous cryptocurrency casinos have started awarding players with custom tokens. Casino tokens may be exchanged for items like free spins, cash, and other things. Similar to how cryptocurrency prices vary, the value of these assets will be as well.\n\nWhether gamers will desire or utilize them is the key question in this. It all down to how it is done. These assets should be special and accomplish something that eventually improves the overall user experience since you don’t want to give away pointless rewards. Although many casinos have started token and NFT marketplaces, they are still relatively comparable to most VIP loyalty programs.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vdGVjaHBvaW50LmFmcmljYS8yMDIzLzA0LzA2L2hlZGVyYS1oYmFyLWFuZC1iaXRjb2luLWJ0Yy1mYWxsLXNob3J0LW9yYmVvbi1wcm90b2NvbC1vcmJuLWVtZXJnZXMtYXMtdGhlLXN1cGVyaW9yLXRva2VuL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Hedera (HBAR) and Bitcoin (BTC) Fall Short: Orbeon Protocol (ORBN) Emerges as the Superior Token - Techpoint Africa",
        "content": "In recent years, cryptocurrency has become an increasingly popular way for investors to participate in a wide range of investment opportunities. With so many options to choose from, it can be challenging to identify the best investment for your portfolio.\n\nHedera (HBAR) and Bitcoin (BTC) are two popular cryptocurrency investments, but they have some limitations that have prevented them from being the best choice. In this article, we will look at how Orbeon Protocol (ORBN) is emerging as the superior token following its 2700% gains and Uniswap listing.\n\n>>BUY ORBEON TOKENS HERE<<\n\nHedera (HBAR) Struggles with High Volatility and Scalability Issues, Pushing Investors Towards Alternatives\n\nWhile Hedera (HBAR) has been hailed as a promising investment, it has struggled to deliver on its potential. One significant disadvantage of Hedera (HBAR) is its high volatility, which has led to significant price drops. Additionally, Hedera (HBAR) has faced scalability issues that have prevented it from achieving widespread adoption.\n\nThese limitations of Hedera (HBAR) have led many investors to seek alternatives that offer more stability and scalability. At present, the value of HBAR stands at $0.0585.\n\nHowever, it's important to note that Hedera is currently experiencing a significant decline from its all-time high of $0.26, with a staggering 77.90% drop in price.\n\n>>BUY ORBEON TOKENS HERE<<\n\nBitcoin (BTC) Struggles to Keep Up with Evolving Crypto Market Despite Popularity\n\nBitcoin (BTC) is the most popular cryptocurrency, but it has struggled to keep up with the rapidly evolving crypto market. One disadvantage of Bitcoin (BTC) is its slow transaction times, which have led to long wait times and high fees.\n\nAdditionally, Bitcoin (BTC) has faced issues with scalability, making it difficult to keep up with the growing demand for cryptocurrency investments.\n\nThese limitations have made Bitcoin (BTC) less appealing to many investors who are seeking a more modern and efficient investment opportunity. As of now, the market value of BTC is $27,117.21. However, it's worth noting that Bitcoin is struggling with a steep decline of 60.58% from its record high of $68,789.63.\n\n>>BUY ORBEON TOKENS HERE<<\n\nOrbeon Protocol (ORBN) Offers Accessible and Inclusive Investment Opportunities\n\nIn contrast to Hedera (HBAR) and Bitcoin (BTC), Orbeon Protocol (ORBN) is an exciting new investment opportunity that offers a range of advantages over traditional cryptocurrency investments.\n\nOrbeon Protocol (ORBN) is designed to provide an accessible and inclusive platform for investors to participate in decentralized crowd-funding and venture capital. The key advantage of Orbeon Protocol (ORBN) is its focus on allowing startups to raise capital via equity-backed, fractionalized NFTs, which provides everyday investors with the opportunity to invest as little as $1 in budding startups.\n\nOrbeon Protocol (ORBN) is constructed on a launchpad that supports multiple blockchains, allowing projects to generate funding and launch on several blockchains at the same time.\n\nThis ecosystem is powered by the ORBN token, which grants holders access to staking bonuses, governance rights, access to exclusive investor groups and more. Having completed its presale with over 2700% gains, Orbeon Protocol (ORBN) has stunned investors with its performance and Uniswap listing, resulting in predictions of the token surging even higher, upwards of 6000%.\n\n>>BUY ORBEON TOKENS HERE<<\n\nConclusion\n\nOverall, Orbeon Protocol (ORBN) is emerging as a superior token that offers a range of advantages over traditional cryptocurrency investments such as Hedera (HBAR) and Bitcoin (BTC).\n\nOrbeon Protocol (ORBN) provides investors with accessibility, versatility, and dynamic investment opportunities that are designed to bridge the gap between the Web2 and Web3 worlds.\n\nWith the potential to grow by 6000% following its wildly successful presale, ORBN is a potentially lucrative investment opportunity that investors should not overlook.\n\nFind Out More About The Orbeon Protocol\n\nWebsite: https://orbeonprotocol.com/\n\nUniswap: https://app.uniswap.org/#/swap\n\nTelegram: https://t.me/OrbeonProtocol\n\nTwitter: https://twitter.com/OrbeonProtocol"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvLWFuZC10aGUtbWljcm9zb2Z0LW1hc3Rlcm1pbmQtaXMtYmlsbC1nYXRlcy1pbnZlc3RlZC1pbi1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Crypto and the Microsoft mastermind: Is Bill Gates invested in Bitcoin? - Finbold - Finance in Bold",
        "content": "As cryptocurrencies become more widely adopted around the world and blockchain is touted as one of the most important technological achievements of the 21st century, many people wonder if Bill Gates, the co-founder of the American technology mammoth Microsoft (NASDAQ: MSFT), has already jumped on the crypto train.\n\nCuriously, despite being one of the most famous ambassadors of technological advancement, Gates still remains very skeptical – if not outright disapproving – about the crypto industry, primarily concerned about volatility and the use of crypto in illegal activities.\n\nAs it happens, the legendary Microsoft co-founder has publicly discussed Bitcoin (BTC) and cryptocurrencies over time, but he has never disclosed whether he had any. It seems the chances are slim because his comments related to crypto made at a TechCrunch conference in June 2022 reveal he is still on the fence.\n\n‘Greater fool theory’\n\nAccording to a CNN report at the time, Gates was quoted as saying that cryptos and non-fungible tokens (NFTs) were “100% based on greater fool theory,” referring to profiting on worthless or overvalued assets as long as people are willing to bid them higher, adding that he was “not long or short” on crypto.\n\nAs he explained:\n\n“I’m used to asset classes, like a farm where they have output, or like a company where they make products.”\n\nEarlier, in 2021, Gates said in an interview with CNBC that he was ‘neutral’ on Bitcoin, stating he did not own any and criticizing its volatility, although he did acknowledge crypto’s goal of making money more digital and getting transactions down, which was “something the Gates Foundation does in developing countries.”\n\n‘Better than currency’?\n\nInterestingly, in October 2014, Gates, however, praised Bitcoin as ‘better than currency’ in a BloombergTV interview on the sidelines of the ‘Sibos 2014’ financial services industry conference in Boston.\n\n“Bitcoin is exciting because it shows how cheap it can be. (…) Bitcoin is better than currency in that you don’t have to be physically in the same place and, of course, for large transactions, currency can get pretty inconvenient.”\n\nAddressing the attendees at the conference, the Microsoft co-founder reiterated his opinion on crypto and stressed that financial transactions in the future would be “digital, universal, and almost free.” However, he also criticized the anonymity of virtual assets like Bitcoin.\n\nMoreover, during a Reddit Ask Me Anything (AMA) session in February 2014, he stated that his organization was “involved in digital money, but unlike Bitcoin, it would not be anonymous digital money,” as he referred to Vodaphone M-pesa, a mobile phone-based money transfer and microfinancing service in Kenya backed by his foundation.\n\nAll things considered, Bill Gates does not seem to be a vocal fan of crypto but hope remains as his views do not seem to be as scathing as those of, for instance, Berkshire Hathaway (NYSE: BRK.A) CEO Warren Buffett, who has slammed cryptocurrencies as “rat poison,” and his vice chairman Charlie Munger who referred to them a “bad combination” of “partly fraud and partly delusion.”"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYm9sZC5jb20vd2lsbC1lYXN0ZXItdHJpZ2dlci1hLWJpdGNvaW4tcHJpY2Utc3VyZ2UtYWZ0ZXItd2Vla3Mtb2Ytc3RhYmlsaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Will Easter trigger a Bitcoin price surge after weeks of stability? - Finbold - Finance in Bold",
        "content": "After several weeks of stability, the price of Bitcoin (BTC) might expect a significant trend to the upside upon observing the historical chart patterns that the flagship decentralized finance (DeFi) asset has demonstrated during Easter weekends every few years.\n\nAs it happens, Bitcoin has been stable for weeks, recording strong support at $25,000, and if it manages to hold this level, a break above $35,000 is possible, but a retest and bounce would “also be ideal,” according to the Twitter post shared by the cryptocurrency and finance analyst CryptoYoddha on April 7.\n\nBitcoin price action analysis. Source: CryptoYoddha\n\nOn top of that, according to CryptoYoddha’s chart analysis, Bitcoin could also briefly reach the $48,000 level in May or June before correcting to $25,000 in late 2023 and again soaring beyond the previous critical level and toward $90,000 in April 2024.\n\nEaster bull?\n\nIt should also be noted that the maiden crypto has followed a pattern of recovery from a heavy bear market every three or four years and that Easter has typically been a starting point for a bullish run in the following weeks, as observed by another pseudonymous crypto market analyst, Stockmoney Lizards, on April 7.\n\nBitcoin historical patterns. Source: Stockmoney Lizards\n\nIndeed, such behavior took place in the weeks following Easter in 2012, when Bitcoin soared 225.33%, in 2016, when it improved by 94.83%, and in 2019, when the crypto industry representative gained 167.88% to its price, with the analyst expecting Bitcoin to move toward $40,000 in late May.\n\nBitcoin price analysis\n\nAs things stand, Bitcoin is currently changing hands at $27,945. Its price represents an increase of 0.03% on the day but also a minor decrease of 0.34% across the past week and a growth of 25.78% on its monthly chart, according to the latest data retrieved on April 7.\n\nBitcoin 30-day price chart. Source: Finbold\n\nMeanwhile, Bitcoin has been demonstrating strength against traditional assets since the year’s turn, recording a return on investment (ROI) that was 170.32% higher during the first quarter of 2023, compared to the average of five major stock indexes, as Finbold reported on April 6.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYm9sZC5jb20vY3J5cHRvLWFuZC10aGUtcHJvYmxlbS1jaGlsZC1pcy1qYWtlLXBhdWwtaW52ZXN0ZWQtaW4tYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 07 Apr 2023 07:00:00 GMT",
        "title": "Crypto and the Problem Child: Is Jake Paul invested in Bitcoin? - Finbold - Finance in Bold",
        "content": "After Jake Paul became one of the celebrities charged by the United States Securities and Exchange Commission (SEC) for illegally promoting cryptocurrencies, many have started to wonder how much crypto the American social media personality and professional boxer actually held.\n\nAlthough the specific numbers are unclear, Jake Paul is a known Bitcoin (BTC) enthusiast, claiming the flagship decentralized finance (DeFi) asset was the “best investment” of his life as he sat down for a chat with BitBoy Crypto in April 2021.\n\nAs he said back then:\n\n“I invested in Bitcoin when it was $100 when I was 16 years old, and it was the craziest, best investment of my life. (…) Ever since that moment, I’ve sort of been involved in crypto and still investing to this day, buying Bitcoin, buying Ethereum (ETH).”\n\nBitcoin bet backfires?\n\nHowever, one year later, during an episode of his ‘Impaulsive’ podcast with co-hosts George Janko and Mike Majlak, his older brother Logan revealed Jake had endured major financial losses as he had allegedly invested most of his wealth into the crypto market, which had subsequently crashed.\n\nIndeed, as Janko touted Jake’s boxing career, stating that it was “going pretty well,” and Majlak stressed that “he made like $40 million last year,” Logan quickly jumped in to say that “it doesn’t matter; he put it all in crypto. (…) He’s poor.”\n\nInterestingly, the YouTuber-turned-boxer had blamed US President Joe Biden for the “plummeting crypto prices” at the time, despite some commenters pointing out to him that Jake was the “one of the main dudes pumping and dumping” crypto.\n\nBiden accomplishments\n\n\n\n1. Highest gas prices\n\n2. Worst inflation\n\n3. Plummeting crypto prices\n\n4. Highest rent prices ever\n\n5. Created new incomprehensible language\n\n\n\nIf you’re reading this and voted for Biden and you still don’t regret it then you are the American problem. — Jake Paul (@jakepaul) June 12, 2022\n\nFraud accusations\n\nIt seems that one commenter, in particular, was referring to Paul’s support for the SafeMoon (SAFEMOON), now revamped as SafeMoon V2 (SFM) token, that faced security concerns and several scandals in 2022, including fraud lawsuits against the network’s executives and celebrity influencers who endorsed it and then allegedly sold their holdings.\n\nMeanwhile, Jake Paul has been charged for illegally promoting Tron (TRX) and/or BitTorrent (BTT) without disclosing that he was compensated for it, alongside Lindsay Lohan, DeAndre Cortez Way (Soulja Boy), Austin Mahone, Michele Mason (Kendra Lust), Miles Parks McCollum (Lil Yachty), Shaffer Smith (Ne-Yo), and Aliaune Thiam (Akon).\n\nNotably, crypto entrepreneur Justin Sun and three of his companies, Tron Foundation Limited, BitTorrent Foundation Ltd., and Rainberry Inc., also stand accused of the unregistered offer and sale of TRX and BTT as investments through multiple unregistered “bounty programs,” as Finbold reported on May 22."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYm9sZC5jb20vdmVyaWZpZWQteW91ci1hcHBsZS1jb21wdXRlci1pcy1ob3N0aW5nLXRoZS1iaXRjb2luLXdoaXRlLXBhcGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 06 Apr 2023 07:00:00 GMT",
        "title": "Verified: Your Apple computer is hosting the Bitcoin white paper - Finbold - Finance in Bold",
        "content": "The Bitcoin white paper was found buried deep inside Apple’s (NASDAQ: AAPL) system files on computers running macOS Catalina or later. The document, which has the filename “simpledoc.pdf,” purports to present Satoshi Nakamoto’s ideas for a decentralized form of currency that is based on a public ledger on all nine of its pages.\n\nOn the day of Nakamoto’s 48th birthday, an independent blogger named Andy Baio claimed for the first time that there was a subtle mention to the world’s oldest blockchain on his Waxy blog on April 5.\n\n“I was trying to scan a document with my wireless printer/scanner, but the device wasn’t showing up in Image Capture after I upgraded macOS recently. Just this “Virtual Scanner II” device that I’d never seen (or noticed?) before,” Baio told Blockworks.\n\nBitcoin whitepaper preview. Source: Waxy\n\nBaio claims that the document is present in all up-to-date versions of macOS, but he can’t explain why it would be in such a hidden location. According to Baio, you may see the file by opening Terminal and entering the following command:\n\nBitcoin whitepaper command. Source: Waxy\n\nNon Apple experts\n\nIf you are not an Apple expert, he suggests that you “open Finder and click on Macintosh HD, then open the System→Library→Image Capture→Devices folder. Control-click on VirtualScanner.app and choose Show Package Contents, then go to the ContentsResources folder and open simpledoc.pdf.”\n\nBaio adds that there is an additional step required to access the document: “In Image Capture, select the “Virtual Scanner II” device, and in the Details, set the Media to “Document” and the Media DPI to “72 DPI.” You should look at the first page of the Bitcoin paper.”\n\nApple’s relationship with the blockchain and cryptocurrency business is complicated when the company allowed non-fungible token (NFT) to be traded via apps on the App Store in the second half of 2022.\n\nThe change was made to facilitate the sale of NFTs inside applications and the incorporation of tokens into future apps. Apple opted to take a 30% share from App developers earning more than $1 million through its store, and a 15% cut from those making less, in an effort to monetize the buzz around the new technology."
    }
]