[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDUvMTgvbWlhbWktYml0Y29pbi1jb25mZXJlbmNlLWZsYWdzLWF0dGVuZGFuY2UtZG93bi1ieS1oYWxmLWFzLWNyeXB0by13aW50ZXItZHJhZ3Mtb24v0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNS8xOC9taWFtaS1iaXRjb2luLWNvbmZlcmVuY2UtZmxhZ3MtYXR0ZW5kYW5jZS1kb3duLWJ5LWhhbGYtYXMtY3J5cHRvLXdpbnRlci1kcmFncy1vbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Attendance at World's Largest Bitcoin Conference Down by Half as 'Crypto Winter' Drags On - CoinDesk",
        "content": "The price of bitcoin (BTC) has risen to about $28,000 from around $15,000 in November, but it’s still well off the all-time high around $69,000 reached in late 2021."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vdGV0aGVyLnRvL2VuL3RldGhlci10by1mdXJ0aGVyLXN0cmVuZ3RoZW4tcmVzZXJ2ZXMtdGhyb3VnaC1wdXJjaGFzZS1vZi1iaXRjb2luLXdpdGgtcmVhbGl6ZWQtbmV0LW9wZXJhdGluZy1wcm9maXRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Tether to Further Strengthen Reserves Through Purchase of Bitcoin with Realized Net Operating Profits - Tether USD",
        "content": "17 May 2023 - Tether International Limited (Tether), the company managing the reserves of the first and most widely used stablecoin, announced today its latest investment strategy aimed at further strengthening its reserves portfolio.\n\nStarting this month, Tether will regularly allocate up to 15% of its net realized operating profits towards purchasing Bitcoin (BTC). Tether anticipates that the current and future BTC holdings in its reserves will not exceed the Shareholder Capital Cushion and will further strengthen and diversify the reserves. As reflected in Tether’s Q1 2023 Assurance Report, as of the end of March 2023, Tether already held approximately $1.5 billion in BTC in its reserves. While it is common practice among many institutional investors to third-party custody their Bitcoin, Tether believes in the philosophy \"Not your keys, not your bitcoin\" and takes possession of the private keys associated with all of its Bitcoin holdings.\n\nUnder this new approach, Tether will focus exclusively on utilizing realized profits from its investment strategy, disregarding unrealized capital gains generated by price increases. This means that Tether will consider only the tangible gains from its operations, which consist of the difference, between purchase price and net proceeds from the sale or, in case of a maturing investment, between the purchase price and the reimbursed amount (for example the notional amount for a zero coupon investment like with U.S. treasury bills).\n\nTether’s purchase of BTC is part of its conservative and prudent approach to investment decisions aimed at strengthening, increasing and diversifying its reserves. By implementing this framework, Tether aims to enhance transparency and provide a clearer view of the company's performance and capital allocation strategy.\n\n\"The decision to invest in Bitcoin, the world's first and largest cryptocurrency, is underpinned by its strength and potential as an investment asset,” said Paolo Ardoino, CTO of Tether. “Bitcoin has continually proven its resilience and has emerged as a long-term store of value with substantial growth potential. Its limited supply, decentralized nature, and widespread adoption have positioned Bitcoin as a favored choice among institutional and retail investors alike. Our investment in Bitcoin is not only a way to enhance the performance of our portfolio, but it is also a method of aligning ourselves with a transformative technology that has the potential to reshape the way we conduct business and live our lives.”\n\nTether believes that Bitcoin has demonstrated its investment potential with a track record of impressive returns over the past decade. Its performance, combined with increasing recognition and adoption by major financial institutions, has cemented Bitcoin's position as a key component in diversified investment portfolios.\n\nBy incorporating Bitcoin into its investment strategy, Tether aims to capitalize on the digital asset's potential growth, while leveraging its position as a trusted and reliable financial infrastructure provider. Tether's decision to allocate a portion of its net realized operating profits towards Bitcoin highlights the company's confidence in the cryptocurrency market and its belief in supporting the broader ecosystem.\n\nAmong other smaller investments performed with its own capital, Tether Group is focusing on building communication (through peer-to-peer technologies like Holepunch), energy and bitcoin mining infrastructure\n\nTether will continue to adhere to stringent risk management practices to ensure the stability and security of its operations. The company remains steadfast in its commitment to maintaining the stability of its flagship stablecoin, Tether (USD₮), while exploring innovative opportunities in the ever-evolving digital asset landscape."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMTcvdGV0aGVyLWJ1eXMtMjIyLW1pbGxpb24td29ydGgtb2YtYml0Y29pbi10by1iYWNrLWl0cy11c2R0LXN0YWJsZWNvaW4uaHRtbNIBbWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA1LzE3L3RldGhlci1idXlzLTIyMi1taWxsaW9uLXdvcnRoLW9mLWJpdGNvaW4tdG8tYmFjay1pdHMtdXNkdC1zdGFibGVjb2luLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Tether buys bitcoin with a portion of its net profit to back USDT stablecoin - CNBC",
        "content": "A picture taken in London shows gold-plated souvenir cryptocurrency tether, bitcoin and ethereum coins arranged beside a screen displaying a trading chart, May 8, 2022.\n\nCryptocurrency giant Tether on Wednesday said that it's going to purchase hundreds of millions of dollars' worth of bitcoin to back the world's largest stablecoin.\n\nThe company said it would invest 15% of its net profit into bitcoin to \"diversify\" the reserves that back its USDT token, which aims to stick to a 1-to-1 peg to the U.S. dollar.\n\nThat would amount to roughly $222 million, based on the company's last attestation report, which provides a breakdown of the assets that make up its USDT reserves as well as excess reserves and profits.\n\nA Tether spokesperson clarified the bitcoin it purchases would amount to only a small portion of its overall net profit, with the bulk of excess income being spent on running the business, including bank fees.\n\n\"The aim is to keep the Bitcoin portfolio value well below the size of our total excess reserves that accounted for 2.48B at the end of Q1/2023, while bitcoin holdings accounted for 1.5B,\" the Tether spokesperson said.\n\nUSDT is the largest stablecoin in the market, with a circulating supply of more than $82.8 billion, according to CoinGecko data. It competes with Circle's USD Coin and Binance's BUSD.\n\nStablecoins are used by traders to move in and out of different cryptocurrencies without converting money back into fiat currencies.\n\n\"The decision to invest in Bitcoin, the world's first and largest cryptocurrency, is underpinned by its strength and potential as an investment asset,\" Tether CTO Paolo Ardoino said in a statement.\n\n\"Bitcoin has continually proven its resilience and has emerged as a long-term store of value with substantial growth potential. Its limited supply, decentralized nature, and widespread adoption have positioned Bitcoin as a favored choice among institutional and retail investors alike.\"\n\nThe move would make Tether an even bigger holder of bitcoin — the firm already holds over $1.5 billion worth of bitcoin on its balance sheet — and follows moves from notable investors like Paul Tudor Jones and MicroStrategy boss Michael Saylor to accumulate huge stockpiles, in the belief that the token is immune to the effects of currency depreciation and inflation.\n\nAnalysts and investors have previously told CNBC that bitcoin could get a boost this year due to the influence of so-called \"whales\" — market players with significant financial firepower, which enables them to buy up huge sums of tokens.\n\nTether's methods to maintain a $1 value for its token have drawn controversy in the past because of concerns over the quality of its reserve assets. Previously, the company held a great deal of its reserves in commercial paper — a form of short-term, unsecured debt issued by companies. This is seen as less safer than other forms of debt, such as U.S. Treasury bills.\n\nTether sought to allay investor fears by rotating out of commercial paper and replacing these fund holdings with only U.S. government debt securities.\n\nIn February, the company said it had whittled down its commercial paper holdings to zero.\n\nUSDT and its issuer remain a source of contention in the crypto market. The U.S. Department of Justice is reportedly investigating executives at Tether over possible bank fraud.\n\nStablecoins were already a hot-button issue for regulators, who have been scrambling to figure out how to keep the industry in check after the demise of several notable firms in the space."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMingFodHRwczovL2RhaWx5cHJvZ3Jlc3MuY29tL2JyYW5kYXZlc3R1ZGlvcy9leHBsb3JpbmctdGhlLWJlbmVmaXRzLW9mLWhvbGRpbmctYml0Y29pbi1mb3ItbG9uZy10ZXJtLWludmVzdG1lbnQvYXJ0aWNsZV81NDA2N2I4NS0xYTkyLTU4NjMtYTY1NS05MTQ0NmU2YmNkZmIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Exploring the benefits of holding Bitcoin for long-term investment - The Daily Progress",
        "content": "In today's fast-paced and ever-changing world, achieving financial freedom is a dream that many aspire to. With the rise of digital currencies, such as Bitcoin, a new investment strategy has emerged: holding Bitcoin for the long term. This article will explore why holding Bitcoin can be the key to financial freedom and how it can revolutionize your approach to wealth-building.\n\nUnderstanding Bitcoin\n\nBitcoin, often referred to as a digital or cryptocurrency, is a decentralized form of currency that operates on a peer-to-peer network. In 2009, it was created by an unknown individual or group using the pseudonym Satoshi Nakamoto. Based on blockchain technology, it aims to ensure transparency, security and immutability of transactions.\n\nOver the years, Bitcoin has gained widespread adoption and has shown significant growth in value. As of this article, Bitcoin has reached an all-time high in terms of its market capitalization, surpassing traditional financial institutions and gaining recognition from major companies and investors.\n\nConcept of holding Bitcoin\n\nOnce you buy Bitcoin with a credit card, there are various approaches, including short-term trading, day trading or long-term holding. While short-term trading can be lucrative for some, it requires constant monitoring, technical analysis and a high tolerance for risk. On the other hand, holding Bitcoin for the long term can offer a more passive and strategic approach to building wealth.\n\nHolding Bitcoin involves purchasing Bitcoin with the intention of keeping it for an extended period, typically years, rather than frequently buying and selling based on short-term market fluctuations. This strategy is based on the belief that Bitcoin has the potential for long-term appreciation in value, driven by its scarcity, utility and growing acceptance worldwide.\n\nWhy holding Bitcoin can offer potential benefits for long-term investment and wealth-building strategies\n\nOne of the main reasons why holding Bitcoin can be the key to financial freedom is its unique characteristics as a store of value. Unlike traditional fiat currencies, such as the U.S. dollar or the Euro, which can be subject to inflation and depreciation, Bitcoin's limited supply may offer protection against inflation and depreciation of fiat currencies. With a limited supply of 21 million Bitcoins, its scarcity and mathematical scarcity make it an attractive option for hedging against inflation and preserving wealth.\n\nWhile short-term trading can be lucrative for some, it requires constant monitoring, technical analysis and a high tolerance for risk. On the other hand, holding Bitcoin for the long term can offer a more passive and strategic approach to building wealth. Bitcoin may offer potential benefits as part of a diversified investment portfolio, but investors should also consider the potential risks and uncertainties associated with this emerging asset class. These risks may include market volatility, regulatory uncertainty and potential security breaches, among others.\n\nIn addition, holding Bitcoin can offer diversification benefits to an investment portfolio. Traditional investment assets, such as stocks, bonds or real estate, are subject to market fluctuations and risks that can affect the overall performance of a portfolio. By adding Bitcoin to a diversified investment portfolio, investors can reduce the risk of over-reliance on traditional assets and potentially enhance their overall returns.\n\nOvercoming common misconceptions about Bitcoin\n\nDespite its growing popularity, Bitcoin still faces misconceptions and skepticism from some individuals. Concerns about its volatility, risks and legitimacy are often cited as reasons to avoid holding Bitcoin. However, it's important to note that Bitcoin has come a long way since its early days and has gained significant mainstream acceptance.\n\nWhile it's true that Bitcoin can experience short-term price volatility, especially in an emerging and relatively unregulated market, its long-term trajectory has been positive. Many experts argue that the risks associated with Bitcoin can be mitigated through careful planning, education and risk management strategies. At the same time, it is important for investors to acknowledge that Bitcoin has faced criticism and concerns from some investors and regulators. It is crucial for investors to educate themselves about the potential risks and uncertainties of investing in this asset class. Some concerns may include its volatile price movements, the potential for fraud or market manipulation and the lack of a clear regulatory framework in some jurisdictions.\n\nConclusion\n\nHolding Bitcoin can be the key to financial freedom, offering the potential for wealth accumulation, diversification and a hedge against inflation. Despite misconceptions and risks associated with Bitcoin, its growing acceptance, increasing institutional adoption and historical price appreciation make it a compelling investment option for those looking to achieve financial freedom. By educating yourself, developing a strategic plan, practicing risk management and taking a long-term investment approach, you can unlock the potential of holding Bitcoin and embark on a path toward financial freedom.\n\nThis content is for informational purposes only and should not be construed as financial advice. This content is for educational purposes only. Your situation is unique and the products and services discussed here may or may not be right for your individual situation. This is not an offer of financial advice, or financial services. Performance information may change. Past performance is not indicative of future results. All investing includes the risk of loss. The opinions expressed here are that of the advertiser alone.\n\nLee Enterprises newsroom and editorial were not involved in the creation of this content."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGV0aGVyLXRvLWJ1eS1iaXRjb2luLTc0OTk0MzPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Tether to Spend Millions on Bitcoin to Diversify USDT Reserves - Investopedia",
        "content": "Tether International Ltd., the company behind the third-largest cryptocurrency by market value, will use 15% of its net investment profit, equivalent to $222 million of its first-quarter profit, on Bitcoin to diversify reserves backing its USDT stablecoin.\n\nKey Takeaways The issuer of the world's largest stablecoin will add to its $1.5 billion BTC reserves.\n\nTether started making a profit from operations in February of this year.\n\nThe Bitcoin allocation will amount to over $200 million based on a recent profit.\n\nTether was fined by U.S. regulators in 2021 for misrepresenting reserves backing its stablecoin meant to keep it at 1:1 to the U.S. dollar. The company, which said last week that its assets total $81.1 billion, said most of that was in the form of Treasury bills, and that 85% of its assets were \"extremely liquid\" in cash and cash equivalents. Gold and Bitcoin accounted for about 4% and 2% of Tether's total reserves, respectively.\n\n\n\nTether said it doesn't expect its Bitcoin holdings to exceed its share capital cushion—reserves in excess of the customer liabilities from Tether's token issuances.\n\nTether Reserve Transparency Debate Continues\n\nThe company was fined $41 million by the Commodities Futures Trading Commission (CFTC) and separately by the New York Attorney General two years ago for its handling of reserves. Critics say Tether has far to go before its reserves are regarded as transparent and confirmed.\n\n\"Tether’s fundamental business, the essence of everything Tether does, is tied exclusively to Tether’s financial reserves,\" former SEC attorney James Reed Stark tweeted last week. \"Yet those reserves remain unaudited, unconfirmed and therefore dubious.\"\n\nStark's comments sparked a twitter debate between him Tether CTO Paolo Ardoino.\n\nTether's Bet on BTC Upside\n\nTether's bet on Bitcoin \"aims to capitalize on the digital asset's potential growth\" and it's not the only company to do so. Software company MicroStrategy (MSTR) has also been buying Bitcoin as an investment. At the end of the first quarter, MicroStrategy's Bitcoin stash swelled to 140,000, valued at about $4.2 billion.\n\n\n\nTether's new strategy could also underpin the price of Bitcoin into the end of the year, with analysts at Standard Chartered Bank saying the cryptocurrency may hit $100k by the end of 2024, CNBC reported. The collapse of SVB and mid-tier lenders have improved the outlook for BTC as a \"trustless asset,\" while profits at crypto miners and the end of the Fed's tightening cycle would also help, said analyst Geoff Kendrick."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50Lzg2MTI0YzBlLTFjMzEtNDVlNy04NmY0LTExOGE3ZTc2YjQwYtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Grayscale aims for possible loophole with new bitcoin ETF filing - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Exchange traded funds myFT Digest -- delivered directly to your inbox.\n\nLatest news on ETFs Visit our ETF Hub to find out more and to explore our in-depth data and comparison tools\n\nGrayscale, manager of the world’s largest cryptocurrency fund, has long been stymied by regulators in its bid to convert its flagship vehicle into an exchange traded fund.\n\nHowever, it may have found a ruse to partially circumvent the restrictions imposed by the US Securities and Exchange commission.\n\nGrayscale has filed to launch a US-listed ETF that would partly invest in so-called “spot” bitcoin exchange traded products already up and running in other countries.\n\nThese ETPs invest directly in “physical” bitcoin, or track the cryptocurrency’s price synthetically — structures the SEC has so far not permitted.\n\nInstead, the SEC has only allowed bitcoin ETFs that trade in futures contracts listed on the Chicago Mercantile Exchange, which is a regulated venue.\n\nThis stance has prompted Grayscale to sue the SEC for its refusal to allow the $16.9bn Grayscale Bitcoin Trust (GBTC), a private spot bitcoin trust, to convert to an ETF. A ruling is due by the end of the third quarter.\n\nIn the interim, though, Grayscale has filed to launch a Global Bitcoin Composite ETF, which would invest 40 per cent of its assets in spot bitcoin ETPs listed on “major non-US exchanges”, such as in Canada or Europe.\n\nWhile there is no guarantee that the application will be approved, analysts believe it has a chance given that the overseas ETPs Grayscale is proposing to invest in are regulated securities — precisely the type of asset that the SEC has insisted crypto ETFs hold.\n\n“Grayscale’s filing seems intended to push the envelope with the SEC by using the SEC’s own words against it to launch crypto ETFs,” said Bryan Armour, director of passive strategies research, North America at Morningstar.\n\n“This seems like Grayscale is directly challenging the SEC’s past decision to allow bitcoin futures ETFs on one hand and on the other hand reject spot bitcoin ETFs,” he added.\n\nTodd Rosenbluth, head of research at VettaFi, a consultancy, described the filing “as a creative way of Grayscale trying to offer US-listed product with some spot bitcoin exposure”.\n\n“I think there is greater likelihood of Grayscale getting approval for this ETF than it getting the SEC to voluntarily approve a US-listed spot bitcoin only ETF, which is what Grayscale wants,” he added.\n\nRosenbluth believed the filing was an “acceptance of the reality that the SEC is not going to give [Grayscale] the green light”, to convert GBTC.\n\nOne point in Grayscale’s favour in its latest filing is that vast numbers of US-listed ETFs already hold regulated, non-US securities, mostly in the form of equities and bonds.\n\nIndeed, at least one US ETF already holds foreign-listed spot bitcoin ETFs, appearing to set something of a precedent for the structure.\n\nThe $447mn Amplify Transformational Data Sharing ETF (BLOK) has positions in four Toronto-listed spot bitcoin ETFs, although they currently account for just 4.3 per cent of its portfolio, with the balance in stocks of companies involved in blockchain technology.\n\nGrayscale is proposing that its 40 per cent exposure to spot bitcoin ETFs would be weighted equally between five underlying funds.\n\nRosenbluth also noted the “added irony” of Cathie Wood’s Ark Next Generation Internet ETF (ARKW) having a 6.8 per cent exposure to Grayscale’s GBTC trust, even though the SEC deems GBTC’s structure to be unsuitable for an ETF. The SEC declined to comment.\n\nEven if Grayscale was to get approval for the Global Bitcoin Composite ETF, it is far from certain there would be a huge appetite for the fund, however.\n\nIt is proposing that the remaining 60 per cent of the portfolio would be invested in the equity of bitcoin mining companies. Armour was unconvinced there was much demand for such a structure.\n\n“I don’t think investors benefit from access to a 60/40 portfolio of bitcoin miners and a global spot bitcoin fund of funds sleeve,” he said.\n\n“The portfolio is confusing and will do a worse job tracking the spot bitcoin price than a bitcoin futures ETF, so I’m not sure this type of product adds any value aside from parsing out the SEC’s strategy for approving bitcoin-related ETFs.”\n\nRosenbluth agreed demand might be lacking, saying “combining bitcoin with other investments is not novel but has had limited interest”.\n\nAs evidence he cited the Global X Blockchain & Bitcoin Strategy ETF (BITS), which invests in the Global X Blockchain ETF (BKCH) and bitcoin futures, but which holds just $11mn.\n\nRosenbluth noted that despite a strong bounce for bitcoin and crypto-related companies after last year’s sharp losses, with the currency itself up 61 per cent so far this year, “demand for ETFs exposed to bitcoin has been limited”.\n\nLatest news on ETFs Visit the ETF Hub to find out more and to explore our in-depth data and comparison tools helping you to understand everything from performance to ESG ratings\n\n“Investors seem sceptical the rally can persist and remember the challenges of 2022,” he added.\n\nFor instance, although the $1bn ProShares Bitcoin Strategy ETF (BITO), the largest bitcoin futures ETF, was up 57 per cent year to date as of May 12, it had only seen net inflows of $95mn, according to VettaFI’s data. This was not far ahead of the $75mn attracted by the $120mn ProShares Short Bitcoin ETF Strategy (BITI), which takes the opposite bet and is down 44 per cent year to date.\n\nBKCH has returned 69 per cent so far this year but has seen net outflows of $2mn. Likewise the Invesco Alerian Galaxy Crypto Economy ETF (SATO) is up 68 per cent “and has seen no investor interest either”, Rosenbluth added.\n\nMichael Sonnenshein, chief executive of Grayscale, was more bullish, however, arguing that “there is no question, coming out of the crypto winter, that investors’ appetite for crypto remains healthy. It has certainly not gone unnoticed by the crypto community that crypto has achieved some of the highest returns in 2023 to date.”"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmZpbnRlY2huZXh1cy5jb20vd2h5LWRvLWludmVzdG9ycy1iZWxpZXZlLWJpdGNvaW4taXMtcmVhZHlpbmctZm9yLWEtY29tZWJhY2sv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Why do investors believe bitcoin is readying for a comeback? - Fintech Nexus",
        "content": "The following is a guest post by Dmytro Spilka, Head Wizard at Solvid.\n\nFollowing a solid start to 2023, investors are beginning to grow in confidence that a prosperous period for bitcoin is on the horizon.\n\nHowever, with many market commentators anticipating rallies beyond $100k over the coming years, what has made everyone so bullish on bitcoin again?\n\n“Professional investors are forecasting a strong year ahead for bitcoin and are confident about its long-term valuation,” reported a recent Nickel Digital Asset Management survey. “Nearly nine out of 10 professional investors predict bitcoin price rise this year. Two out of three agree $100,000 valuation is possible but only for long-term investors.”\n\nThe report suggested that bitcoin’s price is expected to rise exponentially within the next three-to-five years. As much as 65% of institutional investors surveyed agree that bitcoin could hit a value of $100k in the long term, with 58% suggesting a three-to-five-year time frame, while 25% said it would take longer than five years.\n\nHowever, expectations for 2023 appear to be lower, with 23% of investors anticipating that bitcoin will exceed $30,000 by the end of the year.\n\nWith CoinGecko data showing that bitcoin’s price has already accelerated from $16,450 towards $28,000 by the end of Q1 2023, it could yet be seen that Nickel’s survey results for 2023 expectations end up being a little more conservative than reality.\n\nBut what about expectations for exceeding $100k over the coming years? Could BTC really rally towards six-figure valuations? Let’s take a deeper look into why investors are so confident that a bitcoin comeback is on the way:\n\nGreat expectations for bitcoin’s halving\n\nThe key reason behind the optimism for bitcoin’s future price rallies revolves around the asset’s cyclical halving events. Approximately every four years, bitcoin is programmed to halve the rewards it distributes to miners by 50%.\n\nThis mechanism helps control BTC’s inflation rate and emulates the asset’s scarcity in line with precious metals like gold.\n\nWith bitcoin’s current halving reward at 6.25 BTC distributed per block, the next halving event will decrease rewards to 3.125 BTC per block mined. This actively creates a deflationary environment for bitcoin and has the power to increase its scarcity–provided sufficient demand still exists actively.\n\nCrucially for investors, bitcoin’s previous halving events in 2012, 2016, and 2020 have all preceded seismic market-wide bull runs that culminated in a new all-time high value for the cryptocurrency.\n\nOne of bitcoin’s most heavily-used visualizations when anticipating the coin’s halving cycles is the coin’s stock-to-flow model. This assesses how BTC has performed with its halving events, with each event drawn into the chart.\n\nIn the wake of bitcoin’s 2016 halving, the asset climbed to a new all-time high value of $19,783.21 in December 2017. Following the coin’s 2020 halving event, an eventual all-time high of $69,044.77 was reached in November 2021.\n\nWith bitcoin’s next halving event likely to occur in April 2024, much of the cryptocurrency market will be firmly braced for action throughout 2025 in anticipation of a similar all-time high-breaking bull run.\n\nAnticipating regulations\n\nEven bitcoin’s most avid supporters will likely agree that the regulatory landscape will play a key role in deciding the scale of any future rally.\n\nThe recent collapse of FTX has caused more key players to call for stronger cryptocurrency market regulations to protect investors. While this can be difficult for cryptocurrency investors who believe in the power of genuinely decentralized assets that operate independently of external influences and regulators, the move may positively affect the market.\n\n“The industry is steadily moving towards regulations globally. Country-specific laws are being drafted to protect investors from market uncertainties, obliterate security risks, and prevent any impact on the monetary system should the crypto industry go through a rough period,” says Rajagopal Menon, vice president of cryptocurrency WazirX.\n\nWhile the demise of FTX has hurt many investors, a new regulatory environment could be a reliable means of whittling out the industry’s less sustainable players.\n\nHowever, the cryptocurrency landscape could benefit from innovating its way to greater stability alongside implementing calming regulatory measures.\n\nOne such solution is SKARB, an institutionally-focused trading terminal that enables widespread change in how institutions navigate the cryptocurrency ecosystem.\n\nSKARB helps mitigate the prospect of institutions facing future events like FTX by unifying multiple exchanges and market makers within one UX.\n\nThis unified approach comes with vast benefits and helps institutions to avoid the risks associated with liquidity issues among cryptocurrency exchanges. This will actively aid institutions by minimizing the dangers of counterparty risk by allowing you to diversify your exposure across multiple counterparties while keeping your trade workflow unified.\n\nRelated:\n\nSKARB’s unified platform allows institutions to trade effectively across multiple venues while consolidating their trading and reporting experience and establishing a more effective trade monitoring, compliance, and overall trade workflow.\n\nThis tool carries significant ramifications for the crypto regulatory landscape because it can provide far greater levels of institutional trust, which can help to ensure that organizations are better prepared against the prospect of troubled exchanges.\n\nDealing with unpredictability of economic landscape\n\nPerhaps bitcoin’s biggest challenge relates to the ongoing difficult economic conditions throughout global economies. Although the coin’s halving cycles can generate plenty of momentum, it’s worth acknowledging that the path to bitcoin’s most recent all-time high in November 2021 coincided with a significant growth period for global tech stocks, particularly those on Wall Street.\n\nThese links with traditional financial markets historically follow bitcoin, meaning that the risk of recessions in 2023 could negatively impact BTC and the broader crypto market.\n\n“If concerns about growth intensify, then crypto assets might struggle to sustain this recovery,” said Fawad Razaqzada, market analyst at City Index, in an interview with Markets Insider.\n\nHowever, Nasdaq has reported that bitcoin has begun to show a negative correlation in comparison to the S&P 500 Index in recent weeks for the first time since the FTX collapse, indicating that these market links may be weakening.\n\nWhile it’s undoubtedly worth exercising caution when investing in cryptocurrencies, signs of growing market sentiment towards bitcoin ahead of next year’s halving event seem familiar when remembering the events of 2020 and 2021.\n\nAlthough the relationship between BTC and the S&P 500 could be gradually decoupling, it’s worth assessing how the cryptocurrency markets respond to upcoming economic challenges in traditional finance.\n\nWhether investors are right to be optimistic about bitcoin reaching $100,000 remains to be seen. Still, in a market where unpredictability reigns supreme, it’s always safe to brace for the unexpected."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTE3L2xpdGVjb2luLWx0Yy1wcmljZS1yYWxsaWVzLWFmdGVyLWJpdGNvaW4tYnRjLWZlZXMtcmVhY2gtMzDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Litecoin (LTC) Price Rallies After Bitcoin (BTC) Fees Reach $30 - Bloomberg",
        "content": "A digital token launched 12 years ago as a more transaction-friendly version of Bitcoin is drawing the attention of speculators after a meme-token frenzy drove up costs on the largest blockchain.\n\nLitecoin has rallied almost 20% since May 8, when fees on Bitcoin reached a high of $30 per transaction, compared with a decline in an index of cryptocurrencies. The surge in Bitcoin fees has also driven transactions on the Litecoin blockchain to a record as users sought a cheaper alternative — without spawning a similar jump in costs."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5iY21pYW1pLmNvbS9uZXdzL2xvY2FsL2luZHVzdHJ5LWxlYWRlcnMtZGlzY3Vzcy1zdGF0ZS1vZi1jcnlwdG8tYWhlYWQtb2YtbWlhbWktYml0Y29pbi1jb25mZXJlbmNlLzMwMzY1NzAv0gF9aHR0cHM6Ly93d3cubmJjbWlhbWkuY29tL25ld3MvbG9jYWwvaW5kdXN0cnktbGVhZGVycy1kaXNjdXNzLXN0YXRlLW9mLWNyeXB0by1haGVhZC1vZi1taWFtaS1iaXRjb2luLWNvbmZlcmVuY2UvMzAzNjU3MC8_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Industry Leaders Discuss State of Crypto Ahead of Miami Bitcoin Conference - NBC 6 South Florida",
        "content": "The City of Miami's quest to become a world-class finance and tech hub continues, but industry leaders say it appears the focus is shifting away from cryptocurrency\n\nIn April 2022 at the Bitcoin conference, Mayor Francis Suarez unveiled the Miami Bull, a 3,000-pound crypto-inspired statue.\n\n\"We are redefining Miami as the financial capital of the world. The decentralized financial capital of the world,\" Suarez said in 2022.\n\nNow ahead of Bitcoin 2023, the collapse of FTX and the suspension of Miami Coin trading are leading some to wonder if this crypto craze was a bunch of bull.\n\nGet South Florida local news, weather forecasts and entertainment stories to your inbox. Sign up for NBC South Florida newsletters.\n\n\"I take a controversial approach. I say almost 90% of all projects, whether it was a coin or NFT project, they were pyramid schemes or Ponzi schemes,\" said Ryan Kirkley, founder of Cryptan Labs and blockchain expert. \"They only worked as long as people kept thinking they were going to be worth more later on. The problem is at the end of the day someone gets left in the back.\"\n\nKirkley moved to Miami in 2021 and said in the early stages, his company invested heavily in cryptocurrency but then began to pivot toward venture capital and artificial intelligence.\n\n\"I know a lot of prominent leaders in Miami who are not in Miami for the Bitcoin conference, which a year ago, you would've never thought of that,\" Kirkley said. \"So I do think we are seeing a pretty big shift as far as what's important to the tech leaders, entrepreneurs, CEOs and investors in the space. There is still a contingent that are Bitcoin to the end, but the majority of us are far more excited about building on technology and how to transform into the next era of technology.\"\n\nTech entrepreneur Temante Leary plans to attend the conference this weekend and said he still has confidence in Bitcoin. He believes Miami continues to be the crypto capital of the nation.\n\n\"I still have confidence in Bitcoin. I think it will go up,\" Leary said. \"I am still seeing a lot of new entrance into the Miami market and a lot of those entrants are in the fintech, crypto space.\"\n\nNBC6 reached out to Mayor Suarez's office for comment, but he was not available for an interview. In a recent interview, he said Miami's brand is tech and innovation."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8xNy93aGF0LWRvZXMtdGhlLWRlYnQtbGltaXQtc2hvd2Rvd24tbWVhbi1mb3ItYml0Y29pbi_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDUvMTcvd2hhdC1kb2VzLXRoZS1kZWJ0LWxpbWl0LXNob3dkb3duLW1lYW4tZm9yLWJpdGNvaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "What Does the Debt Limit Showdown Mean for Bitcoin? - CoinDesk",
        "content": "That’s unacceptable exactly because debts and deficits are such deadly serious issues, not just in the U.S. but around the world. In the U.S., a staggering 7% of federal spending goes to servicing debt. Those taxpayer dollars are no longer doing anything to strengthen the economy or improve the lives of its citizens. And every time we run an annual budget deficit, that spending on debt service goes up."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTA1LTE4L3RldGhlci1ib3VnaHQtc29tZS1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Tether Bought Some Bitcoin - Bloomberg",
        "content": "Programming note: Money Stuff will be off tomorrow, back on Monday.\n\nThere is a view that crypto was a low-interest-rates phenomenon, but stablecoins are really a low-interest-rates phenomenon. The idea of the most popular (“fully backed,” non-algorithmic) stablecoins is:"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA1LzE4L3VzLWJpdGNvaW4tY29ycC10by1ob3N0LTE1MGstY3J5cHRvLW1pbmluZy1yaWdzL9IBYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA1LzE4L3VzLWJpdGNvaW4tY29ycC10by1ob3N0LTE1MGstY3J5cHRvLW1pbmluZy1yaWdzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "U.S. Bitcoin Corp to Host 150K Crypto Mining Rigs - CoinDesk",
        "content": "While USBTC has seen positive developments in its operations, as it also reached an agreement with the city of Niagara Falls to continue operating its bitcoin mine there, Hut 8 has been facing operational difficulties."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDUvMTcvdGhlLWJsb2Nrc2l6ZS13YXJzLXJldmlzaXRlZC1ob3ctYml0Y29pbnMtY2l2aWwtd2FyLXN0aWxsLXJlc29uYXRlcy10b2RheS_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA1LzE3L3RoZS1ibG9ja3NpemUtd2Fycy1yZXZpc2l0ZWQtaG93LWJpdGNvaW5zLWNpdmlsLXdhci1zdGlsbC1yZXNvbmF0ZXMtdG9kYXkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "The Blocksize Wars Revisited: How Bitcoin’s Civil War Still Resonates Today - CoinDesk",
        "content": "But I'll leave you with one last bit of history to mull: SegWit was written long before it was ever implemented, and found its way into Bitcoin's source code well before there was complete consensus between users and miners, with arguably just a slight quorum Bitcoin Core developers in favor. There's good that came from the resulting debate – including, as former Blockstream CTO Samson Mow noted, a concerted drive to reduce the concentrated power of miners (Blockstream was early on the trend of building mining facilities in North America). But SegWit was a change that made it into a Core release, which could have passed unnoticed had miners not boycotted the change. Is there not some version of the story where the rarefied circles of Bitcoin puritans are in the wrong? Where miners, wanting a vote, kickstarted a debate that changed how Bitcoin is governed for the better?"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA1LzE3L3RldGhlci1zYXlzLWl0LXdpbGwtYnV5LWJpdGNvaW4tZm9yLXN0YWJsZWNvaW4tcmVzZXJ2ZXMtdXNpbmctcmVhbGl6ZWQtcHJvZml0cy_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDUvMTcvdGV0aGVyLXNheXMtaXQtd2lsbC1idXktYml0Y29pbi1mb3Itc3RhYmxlY29pbi1yZXNlcnZlcy11c2luZy1yZWFsaXplZC1wcm9maXRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Tether Says It Will Buy Bitcoin for Stablecoin Reserves Using Realized Profits - CoinDesk",
        "content": "The company said it will exclusively utilize realized profits from its investment operations for buying BTC, disregarding unrealized capital gains. It means that the firm considers “only the tangible gains from its operations,” consisting of the difference between the purchase price and net proceeds from an asset sale or, in case of maturing assets such as Treasury bills, between the purchase price and the reimbursed amount, per the statement."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTgvcGVwZS10aGVtZWQtYml0Y29pbi1mcm9ncy1iZWNvbWVzLW1vc3QtdHJhZGVkLW5mdC1hbWlkLWJpdGNvaW4tb3JkaW5hbHMtaHlwZS_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzE4L3BlcGUtdGhlbWVkLWJpdGNvaW4tZnJvZ3MtYmVjb21lcy1tb3N0LXRyYWRlZC1uZnQtYW1pZC1iaXRjb2luLW9yZGluYWxzLWh5cGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Pepe-Themed ‘Bitcoin Frogs’ Becomes Most Traded NFT Amid Bitcoin Ordinals Hype - CoinDesk",
        "content": "NFTs issued directly on Bitcoin have gained prominence after the launch of the Ordinals Protocol earlier this year. The Ordinals Protocol allows users to embed data onto the Bitcoin blockchain by inscribing references to digital art into small bitcoin-based transactions – with the so-called Ordinals “inscriptions” surpassing the 3 million mark earlier this month."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTE3L3RldGhlci10by1wdXJjaGFzZS1iaXRjb2luLWFzLXBhcnQtb2YtcmVzZXJ2ZXMtc3RyYXRlZ3nSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Tether (USDT) to Purchase Bitcoin (BTC) in Reserves Strategy Shift - Bloomberg",
        "content": "Tether Holdings Ltd., the operator of the largest stablecoin, will invest as much as 15% of profits on a regular basis in Bitcoin as part of a strategy to diversify its reserves.\n\nStarting this month, all Bitcoin purchased will be considered as additional holdings on top of the minimum assets kept in reserve to back its USDT token and other stablecoins, the British Virgin Islands-based firm said in a statement. Stablecoins are digital tokens that aim to keep a one-to-one value with a less volatile asset like the dollar, typically by maintaining large reserves as segregated collateral."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1peGVyLW9mZmVycy1zZXJ2aWNlcy1lbmhhbmNpbmctMTg1NTAwMDM3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Bitcoin Mixer Offers Services Enhancing Privacy and Anonymity in Cryptocurrency Transactions - Yahoo Finance",
        "content": "Summary: Bitcoin mixers are an essential tool for individuals who value their privacy and anonymity when conducting Bitcoin transactions.\n\nCALIFORNIA CITY, CA / ACCESSWIRE / May 17, 2023 / With the latest development, Bitcoin Mixer offers services enhancing privacy and anonymity in cryptocurrency transactions. It gives users a way to safeguard their financial information. By using Bitcoin, every transaction that the users make is recorded on the blockchain, which is a public ledger that anyone can access, and their Bitcoin transactions are not entirely anonymous. In addition, their personal information and transaction history could be traced back to the users.\n\nBitcoin Mixer has emerged as a viable solution to enhance privacy and protect users' identities.\n\nBitcoin Mixer, Wednesday, May 17, 2023, Press release picture\n\nBy utilizing the Bitcoin Mixer, transactions are visible to all users of the Bitcoin blockchain, and everybody who wants to protect their privacy uses Bitcoin mixing services. Bitcoin Mixer offers a range of services tools with multiple features that work incredibly and attract users as well, including:\n\nWhirlWind - It is a leading Bitcoin mixer that adheres to a strict no-logs policy, ensuring that once the mixing process is completed, all transaction information is permanently erased.\n\nCryptoMixer - High volume Bitcoin mixer that provides service with highly secure mixing algorithms that ensure users' privacy and anonymity. It ensures the users neither crypto-hackers nor security agencies can keep track of their financial activities.\n\nSinbad - It is a Bitcoin mixer that offers a simple and easy-to-use interface to its users. The platform works efficiently and securely deletes all transaction information within an hour once the session is completed.\n\nCoinomize - Bitcoin mixer that offers a variety of features. It helps to maintain a strict no-logs policy and offers remarkably low and flexible fees as well.\n\nMixtura - During the coin mixing process, it utilizes funds acquired from reputable cryptocurrency exchanges. (Binance & OKEx).\n\nAnonymixer - To enhance anonymity, the platform helps to split the funds received from each user into smaller portions and seamlessly blends them with funds from other clients.\n\nBitcoin Blender - It is emerging as a high-quality Bitcoin mixer that offers a reliable and secure method to protect privacy when making transactions.\n\nYo!Mix - It gives the opportunity that the users can keep their names confidential.\n\nMixero - The platform empowers users to blend their bitcoins with those from fellow users, effectively concealing the origin and destination of funds.\n\nStory continues\n\nFurthermore, Bitcoin mixers mix Bitcoin with other Cryptocurrencies. Bitcoin mixers enable users to change their coins between each other and make it impossible to trace the source of Crypto. The users enter the Destination address, where mixed coins will be sent, and get the Mixer's address, where they should send their own Crypto that needs to increase the level of Anonymization. And then, the users wait for confirmations from the blockchain network before the mixing process can be completed.\n\nAbout Bitcoin Mixer:\n\nBitcoin (BTC) mixers are an essential tool for individuals who value their privacy and anonymity when conducting Bitcoin transactions. It also offers services for mixing Ethereum (ETH Mixer) and Litecoin (LTC Mixer). The variety of mixers provides their users with a wide range of options to suit their specific needs and preferences.\n\nwww.bitcoinmixing.org\n\nContact name: Peter James\n\nCompany name: Bitcoin Mixer Services\n\nEmail: advertise@bitcoinmixing.org\n\nSOURCE: Bitcoin Mixer\n\n\n\n\n\nView source version on accesswire.com:\n\nhttps://www.accesswire.com/755660/Bitcoin-Mixer-Offers-Services-Enhancing-Privacy-and-Anonymity-in-Cryptocurrency-Transactions\n\n\n\n"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vcmVmcmVzaG1pYW1pLmNvbS9kaWFtb25kLWhhbmRlZC1jcnlwdG8tZW50aHVzaWFzdHMtdGFrZS10aGUtYnVsbC1ieS10aGUtaG9ybnMtYXQtYml0Y29pbi0yMDIzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Diamond-handed crypto enthusiasts take the bull by the horns at Bitcoin 2023 - Refresh Miami",
        "content": "The most prominent cryptocurrency shows its resilience at this year’s conference in Miami Beach\n\nBy Riley Kaminer\n\nIt wasn’t just those riding the mechanical bull installed in the Miami Beach Convention Center today that were taking the bull by the horns. Rather, the optimism about Bitcoin was universal amongst all the attendees Refresh Miami interacted with at this year’s edition of the cryptocurrency’s flagship conference.\n\nOrganizers told us that the Bitcoin 2023 conference expects a total of 13,000 to 15,000 attendees – about half the attendance of Bitcoin 2022 – across the three-day event. The conference started today with an ‘industry’ day focused on the Bitcoin business community. The goals: to network, learn, and build together.\n\nThe crowd included a large swathe of the Bitcoin ‘maximalists’ or ‘maxis,’ as its die-hard supporters are known – focused on the cultural elements surrounding Bitcoin. Another major subset of the crowd was clearly focused on the technical side of the industry. But we also spoke to some newcomers who were interested in diving deeper into the ecosystem. Clearly, the allure remains, albeit to a lesser extent than last year.\n\nMaking sense of the banking bust\n\nFor Bitcoin fans, the recent collapse of traditional banks SVB and First Republic act as a point in Bitcoin’s favor.\n\nJan van Eck, CEO of asset manager Van Eck, which has $70 billion of assets under management, drew parallels between gold and Bitcoin as a way to hedge the risk of government monetary policy.\n\n“The world can change really fast, and Bitcoin is a great thing to look at in people’s portfolios,” he said.\n\nIn a separate conversation, Wall Street veteran turned Bitcoin influencer Caitlin Long – one of the conference’s main draws – also noted that recent episodes have been “a gigantic advertisement for Bitcoin.”\n\nL-R: Dylan LeClair, Caitlin Long, Mark Connors, and Ram Ahluwalia\n\n“It’s not a shock that Bitcoin is up, in light of what’s happened in the traditional banking system.”\n\nMark Connors, the Head of Research for digital asset investor 3iQ, echoed these sentiments. He noted that the government had consolidated banks, which then overleveraged themselves – causing the global financial crisis.\n\n“It’s continuing,” Connors asserted. “In March, the Fed absorbed more banks, making this a multi-decade rollup.” It is in this context that the decentralized nature of Bitcoin might provide a competitive advantage.\n\nAnxiety over regulation\n\nIf there were one main theme from today’s talks, it was that regulation poses an unknown threat to the Bitcoin community. There were different philosophies on how exactly to manage this lack of regulation. For instance, van Eck signaled that his firm plans to double down on its European presence, since legislators there seem more keen on providing regulatory guidance.\n\nExperts were in consensus that regulators should act quickly. “We need action sooner, we need policy that’s not prohibitive, and we need education for the policymakers that are going to build the guidelines that are going to last for the sustainable future of Bitcoin,” asserted Mina Khattak, the senior director of crypto and web3 at Worldpay from FIS.\n\nFor Perianne Boring, founder of trade organization The Chamber of Digital Commerce, digital asset regulation proposed by Massachusetts Senator Elizabeth Warren “jeopardizes our American values.”\n\nBoring believes that Bitcoin and blockchain technology can advance US national security, economic security, and energy security. And broadly, she is optimistic that the Bitcoin crowd will prevail. “The pro-crypto army is bigger, more organized, and more sophisticated than any anti-crypto army I’ve seen on the ground in Washington, D.C.,” Boring asserted.\n\nBuilders continue to build\n\nA buzzing expo floor showcased a wide range of professionals doubling down on Bitcoin – from nonprofits to lawyers to blockchain infrastructure providers and more. One row was devoted to a “Bitcoin Bazaar,” with small vendors selling wares as diverse as Bitcoin-themed children’s books and ‘shitcoin’ themed toilet wipes. And another section displayed Bitcoin artwork, much of it was available for purchase (in BTC, of course).\n\nBut startups played a protagonistic role at the conference. An international set of companies took part in ‘pitch day,’ or a continual series of pitch competitions across different verticals.\n\nMiami startup Moon Mortgage was also in attendance. Brickell-based co-founder and CEO Aaron Nevin expressed his excitement about participating in the conference now as an exhibitor, after having attended for the last five years.\n\n“It’s like a big family reunion,” he told us. “This is the center of the crypto universe. It’s incredible to be here at Bitcoin 2023 – and to be in the crypto space.”\n\nIn April, Moon Mortgage announced a new product that enables users to borrow against the value of their crypto, in addition to a real estate mortgage product. Nevin said that we should expect more to come from this nine-person company as they continue to scale in the US.\n\nThe conference continues tomorrow and Saturday with keynotes from presidential candidate Robert F. Kennedy Jr. and Vivek Ramaswamy and best-selling author Michael Lewis, as well as sessions about Bitcoin payments, self-custody, Bitcoin in the Global South, and more.\n\nMORE SCENES FROM THE BITCOIN 2023 CONFERENCE\n\nREAD MORE ON REFRESH MIAMI:"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8xOC9zaG91bGQtd2Utd29ycnktYWJvdXQtdGV0aGVycy1iaXRjb2luLWJ1eWluZy1wbGFuL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNS8xOC9zaG91bGQtd2Utd29ycnktYWJvdXQtdGV0aGVycy1iaXRjb2luLWJ1eWluZy1wbGFuL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Should We Worry About Tether’s Bitcoin-Buying Plan? - CoinDesk",
        "content": "But, in a real way, buying bitcoin with surplus cash likely won’t affect USDT users (though it might even benefit BTC holders). For the trade to go sideways, so much else has to go wrong. It never really made sense to me when Do Kwon would bash the U.S. dollar, claiming that his “decentralized money” (which was pegged to fiat!) would outcompete the world’s reserve currency. Likewise, Tether’s support of bitcoin as a hedge is an implicit acknowledgement of the risk of its own main product. There’s really no amount of bitcoin that would save the firm if the buck breaks. But until that happens, Tether just has to take in funds and pay out withdrawals – and it can invest the spread wherever it wants."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmludGVjaC5nbG9iYWwvMjAyMy8wNS8xNy9iaXRjb2luLXRlY2gtZmlybS1yaXZlci1zbmFncy0zNW0tc2VyaWVzLWIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Bitcoin tech firm River snags $35m Series B - FinTech Global",
        "content": "River, a Bitcoin technology and financial services startup, has successfully raised $35m in a Series B funding round.\n\nKingsway Capital led the investment, with notable contributions from investors like Peter Thiel, Goldcrest, Cygni, M13, Valor Equity Partners, Esas Ventures, and Alarko Ventures.\n\nRiver aims to create a robust financial system through Bitcoin, a unique incorruptible digital currency. To this end, they offer a range of services, including Bitcoin brokerage, full-reserve custody, mining, and a Bitcoin wallet that supports both on-chain and Lightning Network transactions.\n\nRiver’s CEO, Alex Leishman, has noted a surge in Bitcoin interest, particularly from businesses and institutions. He attributes this to growing recognition of the flaws in the traditional financial system and an acknowledgment of Bitcoin’s potential to foster a more secure and transparent global economy.\n\nThe company has also developed River Lightning, an enterprise API that facilitates integration with the Lightning Network. It’s already being used by several crypto applications, such as El Salvador’s Chivo wallet, for instant Bitcoin payments.\n\nWith the demand for Lightning transactions increasing due to rising on-chain fees, River plans to use part of the funding to enhance its B2B River Lightning segment. The company aspires to be the industry’s back-end for Bitcoin payments.\n\nEmphasising River’s commitment to regulatory compliance and avoiding undue risks, Leishman maintains that River’s approach is to do things right. The firm intends to continue promoting a brighter economic future powered by Bitcoin, staying true to its mission.\n\nFounded in 2019, River has emerged as a leading player in Bitcoin technology and financial services. The company provides an all-in-one mobile app and platform for Bitcoin brokerage, custody, and mining. It has also made significant strides in Lightning infrastructure, powering Lightning transactions for other crypto exchanges and wallets.\n\nKeep up with all the latest FinTech news here\n\nCopyright © 2023 FinTech Global"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTgvZmlyc3QtbW92ZXItYW1lcmljYXMtYXhpZS1pbmZpbml0eS1yYWxsaWVzLWFmdGVyLWFwcGxlLWFwcC1zdG9yZS1kZWJ1dC_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA1LzE4L2ZpcnN0LW1vdmVyLWFtZXJpY2FzLWF4aWUtaW5maW5pdHktcmFsbGllcy1hZnRlci1hcHBsZS1hcHAtc3RvcmUtZGVidXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Rebounds Amid Optimism on Debt-Ceiling - CoinDesk",
        "content": "Bitcoin Frogs, the newly-launched non-fungible token (NFT) fashioned after frogs, has become the most-traded collection in the past 24 hours, surpassing even prominent collections such as Bored Apes. Bitcoin Frogs, which launched in late February on Bitcoin Ordinals, reached a trading volume of over $2.2 million, data from CryptoSlam show. The collection describes itself as “10,000 unique frog collectibles minted directly on the Bitcoin Blockchain.” At the time of writing, each NFT was selling for 0.12 bitcoin (BTC), or more than $3,200. Buyers and sellers are paying trading fees ranging from $50 to over $1,200 as of Thursday."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tbWluaW5nLWRpZmZpY3VsdHktcmlzZXMtdG8tYS1uZXctYWxsLXRpbWUtaGlnaC_SAVBodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLW1pbmluZy1kaWZmaWN1bHR5LXJpc2VzLXRvLWEtbmV3LWFsbC10aW1lLWhpZ2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Bitcoin mining difficulty rises to a new all-time high - Forkast News",
        "content": "Bitcoin’s mining difficulty level rose 3.22% on Thursday, hitting an all-time high, as the network’s hashrate also increased to a record high. The difficulty changes roughly every two weeks and measures how hard a miner would have to work to verify transactions on a block. A higher difficulty reading indicates that it is more competitive to mine Bitcoin.\n\nSee related article: Could Bitcoin mining make renewable energy more profitable?\n\nFast facts\n\nThe mining difficulty reading came in at 49.55 trillion at block height 790,272 in Thursday’s adjustment, rebounding from a 1.45% decline in the previous adjustment on May 4, according to data from BTC.com.\n\nThe difficulty of mining Bitcoin typically rises when more miners go online, which raises competition. Miners are rewarded Bitcoin for validating transactions on the network. Their profitability is highly dependent on Bitcoin spot price and mining difficulty.\n\nMining difficulty adjustments have been highly correlated to changes in hashrate, the level of computing power used for mining.\n\nBitcoin’s hashrate, a measure of computational power used for mining, was at around 368.5 exahashes per second on Wednesday, up from 350.8 exahashes on May 4, data from Blockchain.com shows.\n\nBitcoin’s price edged up 1% over the last 24 hours to trade at US$27,276 at 1:40 p.m. in Hong Kong, and slid 0.72% over the past seven days, according to data from CoinMarketCap. The largest coin by market capitalization traded at around US$29,000 on May 4, up about 64% this year.\n\nSee related article: Biden administration pushes for 30% electricity tax in swipe at crypto miners"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTcvZXRoZXItcmVib3VuZHMtdmVyc3VzLWJpdGNvaW4taW4tcmVsYXRpdmVseS1xdWlldC10cmFkZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Ether (ETH) Price Rebounds Versus Bitcoin (BTC) Price - CoinDesk",
        "content": "A look back at historical RSI levels implies that prices may stall however. Since 2015, the ETH/BTC RSI has fallen between 52 and 54 approximately 112 times, with average 30 day performance of just .002%. The data highlights bitcoin’s tendency to outperform ether historically. The ETH/BTC pair is currently trading 40% below its 2018 maximum of $0.11."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90ZXRoZXItdG8tYnV5LWJpdGNvaW4tYmFzZWQtb24tbW9udGhseS1uZXQtcHJvZml0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Tether to buy Bitcoin based on monthly net profits - Cointelegraph",
        "content": "Tether, the company behind the largest stablecoin Tether (USDT), is following in the footsteps of MicroStrategy to manage its reserves. The stablecoin issuer plans to strengthen its reserves with the help of Bitcoin (BTC) and move away from United States-based government debts.\n\nIn an announcement on May 17, Tether revealed that it plans to invest a portion of its profits into BTC on a monthly basis. The firm said it will “regularly allocate up to 15% of its net realized operating profits towards purchasing Bitcoin.”\n\nThe announcement comes within a week of the company’s quarterly financial report, where the stablecoin issuer reported $1.5 billion in net profits.\n\nAccording to a statement from the company, Tether will keep all of its Bitcoin in self-custody. At the end of the first quarter of 2023, it has $1.5 billion in Bitcoin on hand, making up around 2% of its total reserves. 85% of the holdings were in cash, cash equivalents and other short-term deposits, primarily Treasury bills.\n\nTether claimed BTC was an obvious choice since the market-leading cryptocurrency has proven to be a long-term store of value assets. The stablecoin issuer cited Bitcoin’s mammoth price rise over the past decade and its resilience against traditional financial failures for the decision.\n\nRelated: Circle CEO blames US crypto crackdown for declining USDC market cap\n\nIn a statement, Tether chief technology officer Paolo Ardoino said that the world’s first and largest cryptocurrency is underpinned by its potential as an investment asset. He added that Bitcoin’s limited supply, decentralized nature and widespread adoption have positioned it as a “favored choice among institutional and retail investors alike.“\n\nMicroStrategy has a similar Bitcoin investment plan, actively replacing the U.S. dollar in its reserves with Bitcoin. Although MicroStrategy doesn’t have a fixed time frame for its BTC investment, Tether plans to do it at the end of each month.\n\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZm9ya2FzdC5uZXdzL29yZGluYWxzLWluc2NyaXB0aW9ucy1zbG93LWJpdGNvaW4tY29uZ2VzdGlvbi1saW5nZXJzL9IBT2h0dHBzOi8vZm9ya2FzdC5uZXdzL29yZGluYWxzLWluc2NyaXB0aW9ucy1zbG93LWJpdGNvaW4tY29uZ2VzdGlvbi1saW5nZXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Ordinals inscriptions slow down but Bitcoin congestion lingers - Forkast News",
        "content": "Total daily Ordinals inscriptions on the Bitcoin network fell to 282,467 on Tuesday from 374,037 on Sunday, but Bitcoin network congestion remains stubbornly high.\n\nThe slowing rate of new Ordinals, a form of non-fungible tokens (NFTs) on the Bitcoin network, comes as the network surpassed 7 million inscriptions on Monday.\n\nWeekly Ordinals sales volume on the Bitcoin network fell 51.84% to US$37.8 million on Tuesday, according to CryptoSlam data.\n\nThere were 250,876 Bitcoin transactions waiting in line to be validated at 8:40 p.m. in Hong Kong, according to mempool.space data.\n\nThe network jam could be attributed to the red-hot growth of BRC-20 tokens, the fungible tokens standard built on the Ordinals protocol.\n\nThe number of different types of BRC-20s grew from 14,300 tokens on May 11 to 24,677 on Wednesday. BRC-20 tokens have a combined market capitalization of around half a billion dollars and have been increasing block space demand on the world’s first modern blockchain, according to data provider BRC-20.io.\n\nThe persisting Bitcoin network congestion raised concerns about the effect of Ordinals and BRC-20 tokens and their potential to clog the network, raising confirmation time and costs for regular Bitcoin transactions.\n\n“Ordinals have slowed down a bit, and are taking a bit of a back seat to BRC-20s, and like you’re seeing, they’re behaving similarly and filling up the [memory pool],” said Yehudah Petscher, an NFT strategist at Forkast Labs. “It’s nothing but healthy for Bitcoin to see such tremendous activity, and its only threat is that it will drive the development of layer 2 solutions to help with scalability as we see on Ethereum already.”\n\nBitcoin’s network congestion can be measured by its memory pool size, or mempool, the queue of pending valid transactions waiting to be added to blocks. It is often measured in virtual bytes (vbytes), and a single Bitcoin block can theoretically hold up to a million vbytes.\n\nThe mempool size was at a near one-month high of 202.8 million vbytes as of 5:40 p.m. Hong Kong time. Bitcoin’s mempool size stood at 3.31 million vbytes on April 24, according to on-chain data from mempool.space.\n\n“I know some are complaining about keeping Bitcoin pure as just a currency, but that’s old-world mentality,” said Petscher. “This is a decentralized blockchain and the people will use it exactly how it’s intended to be used, which is free from censorship and free to use as they want.”\n\nThe growing mempool size caused Bitcoin transaction fees to surge to a two-year high of US$30.91 on May 8, before retracing to US$5.6 at press time, according to Chicago-based financial data firm YCharts.\n\nSee related article: Weekly Market Wrap: Bitcoin dips to US$26,166 as memecoins flood the blockchain"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9taWNyb3N0cmF0ZWd5LWxvb2tpbmctYml0Y29pbi1vcmRpbmFscy1hcHAtMDA1NzU2MjkyLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "MicroStrategy Looking at Bitcoin Ordinals for App Development, Says Michael Saylor - Yahoo Finance",
        "content": "MicroStrategy co-founder and Executive Chairman Michael Saylor said the company isn’t just aware of Ordinals, it’s interested in how the protocol that’s set Bitcoin’s community abuzz could lead to software innovation.\n\nIn an interview at Bitcoin 2023 in Miami, Saylor exclusively told Decrypt that the software firm is looking at Ordinals and assessing its potential in terms of application development.\n\nOften used to create NFT-like assets on top of Bitcoin, Ordinals launched in January, and the protocol—while not embraced entirely by the Bitcoin community—has created a new wave of experimentation with crypto’s oldest coin.\n\nWhile Bitcoin Fees Soar to Two-Year Highs, El Salvador Pays the Price\n\nOne recent innovation in the space leveraging Ordinals is an experimental framework for building tokens on top of Bitcoin. It was pioneered by the pseudonymous on-chain data enthusiast Domo in early March. And since then, thousands of other so-called BRC-20 tokens have been created.\n\nAll those transactions have been partly—or entirely, depending on who you ask—responsible for elevated transaction fees on Bitcoin. That’s been a boon for Bitcoin miners, who collect transaction fees for their role in securing the network. But lots of members of the community have complained that high fees make it harder for regular people to use BTC as the peer-to-peer electronic cash system that Satoshi Nakamoto, the pseudonymous creator of Bitcoin, intended it to be.\n\nThe discussion surrounding Ordinals is important, Saylor said, because “Bitcoin miners have to be successful over the long term.” He added that the development of applications building on Bitcoin’s functionality could also bolster the coin’s overall adoption, among individuals, firms, and governments.\n\nSaylor didn’t specifically say what use cases MicroStrategy could be looking into that tap Ordinals, but he noted the ability to commit data to Bitcoin’s blockchain that isn’t solely related to transactions has many potential applications.\n\nStory continues\n\n“The whole idea of burning a piece of data on the blockchain opens the door to the possibility that I might burn a digital signature, or I might burn a registration, or I might burn a hash of a document,” Saylor said.\n\nMichael Saylor: Bitcoin Ordinals Are a ‘Catalyst’ for Adoption\n\nTouching on corporate security, Saylor mentioned DocuSign, which lets businesses and individuals send and sign agreements securely using the firm’s electronic signature product. But that makes mega corporations reliant on a proprietary database, Saylor noted.\n\n“Right now, enterprises have weak security compared to Bitcoin,” Saylor said, adding that innovations using the world's largest cryptocurrency could possibly “introduce a new level of security” available to firms “that doesn't exist right now.”\n\nSaylor’s comments come just a week after he described Ordinals as a “catalyst” for Bitcoin adoption on the PBD Podcast. Still, he acknowledges that Ordinals have been used for plenty of silly reasons.\n\n\"The general consensus is criticize stuff that we think is silly, but don't censor it,\" he said on Thursday in Miami.\n\nSaylor didn't want to predict \"which protocol will win,” but he said altering Bitcoin so that it censors certain uses would be wrong. It was a nod to the effort by a group of core Bitcoin developers, including Luke Dashjr, to treat Ordinals as \"spam\" and filter them out of transactions.\n\n“If somebody wants to change the protocol, in order to censor someone else from using Bitcoin, I don't think that's consistent with the values of the community,” Saylor said. “I do believe in rules without rulers.”"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNS8xOC9wYWtpc3Rhbi1hbm5vdW5jZXMtZnJlc2gtYmFuLW9uLWNyeXB0by1idXQtYWRvcHRpb24tYXMtYS1oZWRnZS1yZW1haW5zLXBvcHVsYXIv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzA1LzE4L3Bha2lzdGFuLWFubm91bmNlcy1mcmVzaC1iYW4tb24tY3J5cHRvLWJ1dC1hZG9wdGlvbi1hcy1hLWhlZGdlLXJlbWFpbnMtcG9wdWxhci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Pakistan Announces Fresh Ban on Crypto, but Adoption as a Hedge Remains Popular - CoinDesk",
        "content": "The minister said that the Financial Action Task Force (FATF) had set a condition that cryptocurrency will not be legalized to keep it off the international finance watchdog's so-called \"Grey List,\" according to one local news outlet, and another said Pakistan's stated position is because it goes against the conditions set by the FATF."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZXRmdHJlbmRzLmNvbS9jcnlwdG8tY2hhbm5lbC93aG9sZWNvaW5lci1iaXRjb2luLW93bmVyc2hpcC1yZWFjaGVzLXJlY29yZC_SAVpodHRwczovL3d3dy5ldGZ0cmVuZHMuY29tL2NyeXB0by1jaGFubmVsL3dob2xlY29pbmVyLWJpdGNvaW4tb3duZXJzaGlwLXJlYWNoZXMtcmVjb3JkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "‘Wholecoiner’ Bitcoin Ownership Reaches Record - ETF Trends",
        "content": "There has been a longer-ranging positive for recently-weak bitcoin prices. The number of addresses holding at least one bitcoin is now at an all-time high.\n\nThose are also known as “wholecoiner” addresses, and recent data from Glassnode confirms that as of May 13, the number of wholecoiners is at record highs. That implies smaller crypto market participants used the crypto winter of 2022 and this year’s pullbacks to grow their bitcoin positions. Now, many such participants have gathered together enough of the digital currency to get to the much-ballyhooed “one” level.\n\nThe rise of wholecoiners is important because smaller bitcoin owners tend to hold the cryptocurrency for longer periods of time. This can somewhat dampen broader bitcoin market volatility. Because of small initial stakes, these market participants are unlikely to sell at the first big decline or depart into substantial rallies.\n\nRather, many wholecoiners take a long-term view of bitcoin and see value in incrementally building stakes and buying on dips. Additionally, we can assume a fair number of these market participants will continue to build their positions. They don’t want to liquidate all of their bitcoin holdings just after reaching their personal price objectives.\n\nWholecoiner Details\n\nThere are now about one million wholecoiners holding at least one bitcoin. Alone, that’s impressive, but there’s more to the story that could be encouraging for crypto bulls.\n\n“While the round number ‘one million’ marks a new notch in the record books, it’s worth pointing out that one Bitcoin wallet address doesn’t always represent a single person,” reported Tom Mitchelhill for Cointelegraph. “Many crypto investors have multiple Bitcoin addresses and other addresses belong to major institutions like cryptocurrency exchanges and investment firms that typically own large sums of Bitcoin.”\n\nThere are other implications related to the buy-and-hold nature of these investors. As they hold bitcoin rather than trade it, this may support price appreciation. There is, after all, a finite amount of bitcoin, and much of it is permanently lost.\n\n“Furthermore, a staggering 3 million BTC — worth $80.4 billion and accounting for 17% of the total circulating supply — are ‘lost forever,’ according to estimates from Glassnode, which draws the figure from a combination of data including BTC sent to ‘burn addresses,’ wallets with lost keys and large accounts that have remained untouched for more than a decade,” noted Mitchelhill.\n\nFor more news, information, and analysis, visit the Crypto Channel.\n\nThe opinions and forecasts expressed herein are solely those of Tom Lydon, and may not actually come to pass. Information on this site should not be used or construed as an offer to sell, a solicitation of an offer to buy, or a recommendation for any product."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA1LzE3L3R5cGVzLW9mLWNyeXB0b3MtdGhhdC1jb3VsZC1vdXRwZXJmb3JtLWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "The 3 Types of Cryptos That Could Outperform Bitcoin This Year - The Motley Fool",
        "content": "Even with its recent pullback from the $30,000 price level, Bitcoin remains one of the top-performing cryptos of 2023. It is up 65% this year, and it's hard to find any large market-cap coins that can top this.\n\nBut savvy investors know it's best not to put all your eggs into one basket. If you are looking to diversify your crypto portfolio, here are three types of digital coins that could outperform Bitcoin this year.\n\n1. Potential Ethereum replacements\n\nWhile Ethereum (CRYPTO: ETH) continues to be the dominant Layer 1 blockchain in the crypto world, there are plenty of up-and-comers that hope to dethrone it. Three rivals that stand out are Solana, Aptos, and Fantom. Both Solana and Aptos are up more than 100% this year, and Fantom is not too far behind, at 93%.\n\nJudging from their performance, investors are not entirely convinced that Ethereum is going to retain its dominant role in so many key blockchain sectors, ranging from non-fungible tokens (NFTs) to decentralized finance (DeFi). While The Merge helped to improve the speed, efficiency, and scalability of the core Ethereum blockchain, these blockchain rivals are still much faster and cheaper. That has huge implications in areas such as DeFi, where users are looking for near-zero fees and near-instantaneous settlement of transactions.\n\nOf these Ethereum rivals, my personal pick is Solana, which has been out-innovating Ethereum of late. For example, Solana recently launched the first-ever mobile phone for a major blockchain network (the Saga) and has been exploring new initiatives to leverage all the hype and excitement around artificial intelligence, including a new plug-in for ChatGPT. For Solana to outperform Bitcoin, it will need to show that mobile crypto and crypto AI are sustainable, long-term growth catalysts.\n\n2. Scaling solutions for Ethereum\n\nIf you are looking for a less risky way to outperform Bitcoin, then blockchain scaling solutions for Ethereum could be the answer. Simply stated, these scaling solutions sit on top of the main blockchain and help Ethereum process transactions faster and cheaper.\n\nFor that reason, they are referred to as Layer 2 solutions (i.e., they are the second layer on top of the base Ethereum layer). Each scaling solution uses its own form of proprietary technology to accomplish its goals, so it can sometimes be difficult to differentiate among these different solutions.\n\nIf you buy into the idea that these Layer 2 coins are essential to the future success of Ethereum, then there are a few key prospects to target, including Immutable, Optimism, and Polygon. The name that's probably most familiar to investors will be Polygon, which has been making waves recently with new NFT initiatives, including a high-profile partnership with Nike to create an entirely new NFT marketplace for digital sneakers. However, if you are craving maximum upside potential, a better pick might be Immutable, which is up a mind-blowing 99% this year.\n\n3. Cryptos that help people stake on Ethereum\n\nLastly, there are a growing number of cryptos that help people stake on Ethereum. Now that Ethereum has transformed from a proof-of-work blockchain into proof of stake, this is tremendously important. Crypto staking is suddenly big business, and investors are always looking for ways to earn the highest staking rewards possible.\n\nThe two big names to watch here are Lido DAO, which is up 95% this year, and Rocket Pool, which is up 157% this year. Both emerged from relative obscurity after The Merge due to the popularity of staking, and both now currently rank in the Top 50 cryptos in terms of market capitalization.\n\nWhich of these is the best buy?\n\nThe common theme of all three categories of cryptos detailed above is that they somehow involve Ethereum. The first category, for example, includes all those capable of displacing Ethereum one day as the preeminent Layer 1 blockchain. The second category includes all digital currencies helping Ethereum scale bigger and faster. And the third category includes all cryptos that involve staking on Ethereum.\n\nSo if the prospect of picking winners and losers in niche areas of the blockchain space seems too daunting, the classic buy-and-hold crypto is Ethereum, which is up a not-too-shabby 52% this year.\n\nBut if you're looking for a little extra turbocharging for your portfolio, then my best picks would be Solana and Polygon. I'm long-term bullish on both of them, and I still regard both as best-in-class for their respective blockchain categories."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDUvMTcvbGl0ZWNvaW4teHJwLWFuZC1vdGhlci1hbHRjb2lucy1yaXNlLWJsdWUtY2hpcC1iaXRjb2luLWhpdHMtYS1sdWxsLmh0bWzSAWtodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wNS8xNy9saXRlY29pbi14cnAtYW5kLW90aGVyLWFsdGNvaW5zLXJpc2UtYmx1ZS1jaGlwLWJpdGNvaW4taGl0cy1hLWx1bGwuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Litecoin, XRP and other altcoins rise Wednesday as 'blue chip' bitcoin hits a lull - CNBC",
        "content": "While bitcoin and ether were flat on Wednesday, altcoins rose higher.\n\nLitecoin rose 5.67% and XRP added 6%, according to Coin Metrics. The Sandbox token jumped 4%. The price of the Axie Infinity token added about 8%.\n\nAmong the Ethereum competitors, the Solana token gained 2%, Cardano's ada added 3.5% and the Polkadot token jumped 3%.\n\nOn Wednesday Ripple, the global payments company behind XRP, announced its acquisition of Metaco, a Swiss crypto custody services firm. The deal is expected to give Ripple access to clients like Citi and BNP Paribas and expand its overseas presence.\n\nCrypto price action has been relatively subdued for the past month, despite volatility coming back a bit recently due to thin liquidity in the market. Still, realized 30-day volatility for both bitcoin and ether are off their record lows of the year, according to Glassnode.\n\nWith that, some investors have shifted their attention away from bitcoin and toward smaller and newer tokens, or \"altcoins.\" This is a recurring period in the bitcoin cycle known as \"altcoin season.\" In recent months, bitcoin and ether have been regarded by many as so-called \"blue chip\" or \"flight to safety\" assets in crypto.\n\n\"Like macro markets, juggling resilient stock prices with increasingly bleak economic data points, the crypto market is also dealing with duality. There are some signs of frothiness,\" said Noelle Acheson, author of the \"Crypto is Macro Now\" newsletter.\n\nSpecifically, earlier this month ether briefly rallied and the Bitcoin blockchain saw a record high in daily transactions amid a surge in interest around memecoins and NFT-like tokens on the Bitcoin network called ordinals.\n\n\"In spite of these hints of froth, activity is low,\" Acheson added. \"Prices are down more than 10% on the month, and volumes are trending lower.\"\n\nBitcoin and ether continued to hover around the flat line Wednesday at the $27,000 and $1,800 levels, respectively."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA1LTE4L3ZhbmVjay1zYXlzLWJpdGNvaW4tc3BvdC1ldGYtbm90LWxpa2VseS1pbi10aGUtdXMtaW4tbmVhci1mdXR1cmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "A Bitcoin-Spot ETF Is Unlikely in US in the Near Future, VanEck CEO Says - Bloomberg",
        "content": "Investors aren’t likely to see a Bitcoin-spot exchange-traded fund offered in the US anytime soon, according to VanEck Chief Executive Officer Jan Van Eck .\n\n“No chance,” Van Eck said as part of a panel at the Bitcoin 2023 conference in Miami Beach on Thursday. “Even if the SEC loses the Grayscale litigation, they’ll just drag their feet. So I just don’t see that in the next year and a half.” Van Eck was referring to asset-manager Grayscale Investments’s ongoing lawsuit against the US Securities and Exchange Commission in which it’s attempting to convert its Bitcoin trust into an ETF."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNhZmVyLXRoYW4tdXNkLXNheXMtbmV3LXJlcG9ydC13YXRjaC10aGUtbWFya2V0LXJlcG9ydNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "New survey says Bitcoin is safer than the US dollar — Watch The Market Report - Cointelegraph",
        "content": "On May 17’s episode of The Market Report, analyst and writer Marcel Pechman discusses whether Bitcoin (BTC) is safer than the United States dollar, considering the risk of the U.S. government defaulting on its debt. He also covers why Bitcoin’s $28,000 resistance will not be a walk in the park and, finally, what is happening between Celsius, Ethereum and Lido staking. The show airs every Tuesday on the Cointelegraph Markets & Research YouTube channel.\n\nThe first news article covered discusses a Bloomberg Markets survey showing Bitcoin as a top three asset in the event of a U.S. debt default. For Pechman, it is no surprise that Bitcoin trumps fiat currencies in investors’ picks, considering the central banks from the eurozone, Japan, Canada, England and Switzerland boosted their borrowing programs from the U.S. Federal Reserve in March 2023. There’s a high correlation to fiat currencies, putting the asset class at significant risk if a U.S. debt default happens.\n\nPechman predicts that investors’ allocations in gold would be 10x higher than Bitcoin’s due to the cryptocurrency’s lower market capitalization and high volatility. On the positive side, 11% of retail investors would add Bitcoin to their portfolio in the event of a government shutdown versus 46% for gold. What are the odds of Bitcoin breaking above $100,000 in the case of a government shutdown? No spoilers — check the show.\n\nOn to the show’s next topic: Pechman discusses why Bitcoin’s $28,000 resistance will likely prove stronger than expected. The recent correction down to $25,800 was probably caused by high transaction fees, but Pechman argues that the network worked exactly as intended and that high fees are the network’s defense against spamming.\n\nThe problem holding back a quick recovery above $28,000 is professional traders’ positioning using derivatives. Before the event, whales and market makers were already neutral-to-bearish.\n\nIn the final part of The Market Report, Pechman explains failed crypto lending platform Celsius’ $780 million Ether (ETH) movement from the Lido staking platform. No one knows if the Ether will be sold at market and eventually paid out in U.S. dollars to Celsius creditors\n\nDon’t miss out! The show is available exclusively on the Cointelegraph Markets & Research YouTube channel.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThe views, thoughts and opinions expressed here and during the show are the analysts’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9vbmUtb2YtdGhlLWdyZWF0ZXN0LWJpdGNvaW4tbWV0cmljcy1zYXlzLWJ0Yy1wcmljZS1idWxsLXJ1bi1pcy1oZXJl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "'One of the greatest' Bitcoin metrics says BTC price bull run is here - Cointelegraph",
        "content": "Bitcoin (BTC) is entering a new “speculation cycle” typical of a bull run, new analysis says.\n\nIn a tweet on May 16, Philip Swift, creator of data resource LookIntoBitcoin and co-founder of trading suite DecenTrader, revealed history repeating itself according to the RHODL Ratio metric.\n\nRHODL Ratiocreator on BTC price: “Zoom out”\n\nRHODL Ratio is a method of tracking BTC price behavior based on the realized price of the supply — the price at which coins last moved.\n\nCreated by Swift in 2020, it compares the relative ages of coins that moved one week ago to those which moved one to two years ago.\n\nThis ratio gives an insight into the relative activity of short-term (STHs) and long-term holders (LTHs) and, by extension, the extent to which speculation is present on the market.\n\nCurrently, RHODL is bouncing higher, having hit its green accumulation zone at the end of 2022.\n\nAt the time, Swift told Cointelegraph that Bitcoin was “at the point of maximum opportunity” — something which has since proven true, with BTC/USD gaining 70% in Q1 2023.\n\nPrior to that, its descent toward that point had coincided with Bitcoin’s own retreat to macro lows.\n\nNow, with speculative activity seemingly increasing, he believes that a new bull cycle is already underway.\n\n“When I created the bitcoin RHODL Ratio indicator in 2020, one thing that struck me was how it showed a new bull run forming...when the ratio value of younger coins began to increase. Which is where we are right now,” he commented.\n\n“Don’t panic about small price pullbacks. Zoom out.”\n\nBitcoin RHODL Ratio annotated chart. Source: Philip Swift/Twitter\n\nSwift is not alone in his conviction. Responding, Checkmate, lead on-chain analyst at Glassnode, called RHODL Ratio “one of the greatest onchain finds.”\n\nAn accompanying chart, meanwhile, added that the 2021 bull market, despite delivering a blow-off top for BTC/USD, did not see a copycat move for RHODL. The last time the metric hit its red “high speculation” zone was at Bitcoin’s prior all-time high in late 2017.\n\nBitcoin RHODL Ratio chart (screenshot). Source: LookIntoBitcoin\n\nFear, depression and lack of interest\n\nContinuing, Swift argued that on short timeframes, market participants remain risk-off on crypto markets.\n\nRelated: Watch these BTC price levels as Bitcoin threatens to lose $27K support\n\nThe conclusion followed a scan of funding rates on exchanges, with a slew of “bearish” ratings for Bitcoin generated by DecenTrader. These concerned open interest and long/short ratio in addition to funding rates themselves.\n\nMarket data for various major cryptocurrencies (screenshot). Source: DecenTrader\n\n“Market is still fearful/depressed/uninterested…” he summarized on the day.\n\nEarlier this month, Swift gave Cointelegraph an updated forecast on what might happen to Bitcoin in the final year before its next block subsidy halving. Among other eventualities, a return to $20,000 is not out of the question.\n\nMagazine: Alameda’s $38B IRS bill, Do Kwon kicked in the assets, Milady frenzy: Asia Express\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTgvZmlyc3QtbW92ZXItYXNpYS1iaWRlbnMtdG91Z2gtdGFsay10ZXRoZXJzLWJpdGNvaW4tYmV0LW5vdC1tb3ZpbmctY3J5cHRvL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDUvMTgvZmlyc3QtbW92ZXItYXNpYS1iaWRlbnMtdG91Z2gtdGFsay10ZXRoZXJzLWJpdGNvaW4tYmV0LW5vdC1tb3ZpbmctY3J5cHRvL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "First Mover Asia: Biden’s Tough Talk, Tether’s Bitcoin Bet Not Moving Crypto - CoinDesk",
        "content": "But on the other hand, crypto does seem to care. Tether announced Wednesday U.S. Time that it's diversifying its reserves away from government debt and into crypto as it pledged to use around 15% of its profits to buy Bitcoin for its stablecoin reserves. Almost in parallel, Circle said that it is diversifying the reserves supporting its $30 billion USD Coin (USDC), including $8.7 billion in overnight repurchase agreements managed by BlackRock, to fortify against potential U.S. government debt default risks."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNhcGl0dWxhdGlvbi1iZWxvdy0yNmstaW5jcmVhc2VzLWFzLWZyaWRheS1zLWJ0Yy1vcHRpb25zLWV4cGlyeS1sb29tc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Bitcoin price capitulation below $26K possible as Friday's BTC options expiry looms - Cointelegraph",
        "content": "Bitcoin’s price lost steam after a failed rupture of the $27,500 resistance on May 15, putting bears in a better position for the May 19 expiry. The regulatory newsflow likely played a key role in trimming investors’ risk appetite, as governments seek more control over the sector.\n\nIn a memo circulated among committee members, Democrats in the United States legislature sought to cement the Securities and Exchange Committee’s (SEC’s) authority over crypto. The document was made public on May 10 and included the argument that nearly all digital assets constitute securities. Moreover, according to SEC Chairman Gary Gensler’s view, even network nodes are in violation of securities laws.\n\nThe United Kingdom’s Treasury Committee “strongly recommended” on May 17 regulating retail crypto trading and investment activity as gambling, consistent with the principle of “same risk, same regulatory outcome.” Treasury Committee Chair Harriett Baldwin described Bitcoin (BTC) and Ether (ETH) as accounting for two-thirds of the total market capitalization of crypto assets, both of which she claimed are “unbacked.”\n\nThe $735 million Bitcoin weekly options expiry on May 19 might play a decisive role in determining whether the price will capitulate by falling below $26,000.\n\nBitcoin could be making a short-term bottom\n\nBitcoin bears will try to take advantage of the negative regulatory environment and uncertainty caused by the risk of the U.S. Treasury “running out of funds” as the debt ceiling approaches. Such a pessimistic scenario partially explains why some Bitcoin traders decided to reduce exposure over the past couple of weeks.\n\nBitcoin 4-hour price movements during options expiries. Source: TradingView\n\nThe Bitcoin price traded down 6.6% in the 36 hours that preceded the latest BTC options expiry on May 12, marking a short-term bottom on the four-hour chart. More importantly, the subsequent three-day rally toward $27,500 was short-lived, favoring the thesis of bearish momentum.\n\nBitcoin options data shows bulls were excessively optimistic\n\nThe open interest for the May 19 options expiry is $735 million, but the actual figure will be lower since bulls concentrated their wagers above $28,000. These traders got excessively optimistic after Bitcoin’s price gained 7% between May 12 and May 15, testing the $27,500 resistance.\n\nBitcoin options aggregate open interest for May 19. Source: CoinGlass\n\nThe 0.42 call-to-put ratio reflects the imbalance between the $424 million in call (buy) open interest and the $312 million in put (sell) options. However, if Bitcoin’s price remains near $26,500 at 8:00 am UTC on May 19, only $30 million worth of these call (buy) options will be available. This difference happens because the right to buy Bitcoin at $27,000 or $28,000 is useless if BTC trades below that level on expiry.\n\nRelated: Tether to buy Bitcoin based on monthly net profits\n\nBitcoin bulls aim for $27,000 to balance the scales\n\nBelow are the four most likely scenarios based on the current price action. The number of options contracts available on May 19 for call (bull) and put (bear) instruments varies depending on the expiry price.\n\nThe imbalance favoring each side constitutes the theoretical profit:\n\nBetween $25,000 and $26,000: 100 calls vs. 7,800 puts. Bears in total control, profiting $190 million.\n\n100 calls vs. 7,800 puts. Bears in total control, profiting $190 million. Between $26,000 and $27,000: 1,100 calls vs. 4,300 puts. The net result favors the put (sell) instruments by $80 million.\n\n1,100 calls vs. 4,300 puts. The net result favors the put (sell) instruments by $80 million. Between $27,000 and $28,000: 2,300 calls vs. 2,000 puts. The result is balanced between put and call options.\n\n2,300 calls vs. 2,000 puts. The result is balanced between put and call options. Between $28,000 and $29,000: 5,700 calls vs. 700 puts. The net result favors the call (bull) instruments by $140 million.\n\nThis crude estimate considers the put options used in bearish bets and the call options exclusively in neutral-to-bullish trades. This oversimplification disregards more complex investment strategies.\n\nFor instance, a trader could have sold a call option, effectively gaining negative exposure to Bitcoin above a specific price. Unfortunately, there’s no easy way to estimate this effect.\n\nStill, traders should be cautious as the bears are currently in a better position for Friday’s weekly options expiry, favoring negative price moves. Thus, an eventual capitulation below $26,000 should not be discarded.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oeXBlcmJpdGNvaW5pemF0aW9uLWNvbWluZy1zYXlzLWJpdGNvaW4tb2ctYXMtd2hvbGVjb2luZXJzLWhpdC0xLW1pbGxpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Hyperbitcoinization coming, says Bitcoin OG as 'wholecoiners' hit 1M - Cointelegraph",
        "content": "Bitcoin (BTC) has crossed a significant threshold this month — and while it does not involve price, it does involve “millions.”\n\nData from on-chain analytics firm Glassnode confirms that as of May 18, there are over 1 million addresses that hold at least 1 BTC.\n\nBack: Adoption trend lays path to “hyperbitcoinization”\n\nIt was a long time coming and received much attention on social media, and the time is finally here — there are 1 million entities that own a whole Bitcoin.\n\nThese “wholecoiners” have been steadily accruing since mid-2021, Glassnode shows, and the upward trend in 1-BTC wallets has seen almost no reversal since.\n\nIn 2022, however, the trend accelerated, having started the year with 814,000 wholesalers and finishing it with 978,000 — an increase of 20%.\n\nReacting, Adam Back, CEO and co-founder of Bitcoin firm Blockstream, made a case for “hyperbitcoinization” soon to come.\n\nShould the existing trend continue, he argued, BTC price growth would soon make buying it not only a luxury but something unattainable altogether.\n\nThis would happen, he tweeted, “because 10mil people trying to buy 1 BTC over a few years would push the price out of reach.”\n\n“And many current hodlers are not selling,” he continued.\n\n“Eg very few of the recent whole coiners would re-sell, probably moving up to their next target for extra bitcoin, most are trying to buy more!”\n\nBitcoin: Number of addresses with a balance ≥ 1 chart. Source: Glassnode\n\nAs Cointelegraph reported, existing Bitcoin investors who are long-term market participants have broadly resisted the urge to sell through the recent bear market and subsequent price recovery.\n\nAt the same time, an uptick in short-term holders, or speculators, in 2023 has got some excited about the birth of a new Bitcoin bull market.\n\nWhale numbers halt 2022 decline\n\nGlassnode data, meanwhile, shows that at the other end of the spectrum, whale wallets have become stagnant.\n\nRelated: Sink or swim at $27K? 5 things to know in Bitcoin this week\n\nEntities with between 1,000 BTC and 9,999 BTC are now showing signs of recovery after falling from mid-2022 onward.\n\n10,000+ BTC entities, on the other hand, remain in a range entered following the FTX collapse last November. There are currently 117 such entities.\n\nBitcoin: Number of addresses with balance ≥ 1K chart. Source: Glassnode\n\nObservers, such as monitoring resource Material Indicators, often note that the largest classes of whales still exert the most influence over BTC price action thanks to their trading activities.\n\nMagazine: ‘Moral responsibility’: Can blockchain really improve trust in AI?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vbW9uZXkuY29tL2Jlc3QtYml0Y29pbi1taW5pbmctc29mdHdhcmUv0gE4aHR0cHM6Ly9tb25leS5jb20vYmVzdC1iaXRjb2luLW1pbmluZy1zb2Z0d2FyZS8_YW1wPXRydWU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "9 Best Bitcoin Mining Software - Money",
        "content": "The best bitcoin mining software makes it easy to earn a passive income through crypto by lending your hardware’s processing power to the Bitcoin network. Choosing the appropriate software for your machine is just as important as finding high-quality components for it.\n\nThere are dozens of Bitcoin mining software to choose from, each with different features and intended for specific use cases. To assist in your decision-making process, we have identified the top mining software options and provided a breakdown of their features, how they work and who could benefit from them. Keep reading to learn more about the best bitcoin mining software of 2023.\n\nDisclaimer: Bitcoin mining is an energy-intensive process that is now considered a burden on the environment, and there are discussions on a global level on how to further regulate the industry. See more below.\n\nOur Top Picks for the Best Bitcoin Mining Software of 2023\n\nAds by Money. We may be compensated if you click this ad. Ad Build your ultimate crypto portfolio Public provides investors, from beginners to experts, with a comprehensive crypto trading experience, on a powerful yet user-friendly platform. Start investing today by clicking on your state! Hawaii Alaska Florida South Carolina Georgia Alabama North Carolina Tennessee RI Rhode Island CT Connecticut MA Massachusetts Maine NH New Hampshire VT Vermont New York NJ New Jersey DE Delaware MD Maryland West Virginia Ohio Michigan Arizona Nevada Utah Colorado New Mexico South Dakota Iowa Indiana Illinois Minnesota Wisconsin Missouri Louisiana Virginia DC Washington DC Idaho California North Dakota Washington Oregon Montana Wyoming Nebraska Kansas Oklahoma Pennsylvania Kentucky Mississippi Arkansas Texas Download App Offer valid for U.S. residents 18+ and subject to account approval. There may be other fees associated with trading. See Public.com/disclosures.\n\nBest Bitcoin Mining Software Reviews\n\nBest for Experienced Miners: CGMiner Start Mining\n\nPros Open-source\n\nSupports multiple operating systems\n\nCompatible with multiple types of hardware\n\nMine multiple cryptocurrencies at once Cons Command-line interface only\n\nNot for beginners\n\nSome compatibility issues with Windows 10\n\nHIGHLIGHTS Platform Windows, Mac, Linux Fees None Complexity High\n\nWhy we chose it: CGMiner is one of the original Bitcoin mining software on the market, offering an open-source mining program that is cross-compatible with multiple operating systems and mining hardware configurations. Open-source software allows you to modify the software as you wish and there are no licensing restrictions with how it is used. Founded in 2011, CGMiner has been kept up-to-date since, and is a great option for single miners or mining pools.\n\nCGMiner offers several options for customization, allowing users to control fan speeds, overclock their processors and set up remote control of their unit. CGMiner can also scale with your hardware setup and needs, supporting Field-Programmable Gate Array (FPGA), Graphics Processing Unit (GPU), and Control Processing Unit (CPU) mining, as well as Application-Specific Integrated Circuit (ASIC) hardware.\n\nCGMiner utilizes a command-line interface that only allows for text-based commands (similar to using Command Prompt in Windows), which may be too complicated for beginners to set up. The software is compatible with Mac, Windows and Linux computers, though Windows Defender on Windows 10 may cause issues with getting the software working.CGMiner supports several cryptocurrencies as well, including Bitcoin, Litecoin and Dogecoin. The software is available for free on GitHub.\n\nBest for Beginners: NiceHash Miner Start Mining\n\nPros Simple user interface\n\nSetup takes only a few minutes\n\nMobile app available Cons QuickMiner only works with NVIDIA cards\n\nCan only mine Bitcoin\n\n2% fee assessed on payments\n\nHIGHLIGHTS Platform Windows, Mac, Linux Fees 2% fee for payments Complexity Low\n\nWhy we chose it: NiceHash is an easy-to-use Bitcoin mining software with a simple interface that allows users to choose their hardware type and download the appropriate software. Once set up (which only takes a few clicks), NiceHash will optimize the mining operations for your software and hardware setup, without the need to tweak settings.\n\nNiceHash offers two software versions: the NiceHash QuickMiner software, which is suitable for beginners, and the NiceHash Miner software, which is open to more hardware types. Both software versions automatically detect the hardware you are using and will configure your mining to the optimal settings; simply hit “start mining” to begin. There is also a mobile app with a well-designed interface that's perfect for beginners who want to get started right away.\n\nNiceHash Miner supports Bitcoin mining only, but it does offer a crypto wallet that supports multiple cryptocurrencies. Just be aware that it charges a 2% payment fee when depositing Bitcoin into your wallet.\n\nBest for Different Cryptos: Cudo Miner Start Mining\n\nPros Supports 9 cryptos from five algorithms\n\nAuto-detects the most profitable coin to mine\n\nSupports GPU, CPU and ASIC miners Cons High fees for miners (up to 6.5%)\n\nNo built-in crypto wallet\n\nHIGHLIGHTS Platform Windows, Mac, Linux Fees 1.5% - 6.5% Complexity Low\n\nWhy we chose it: Cudo Miner is a well-designed and versatile cryptocurrency mining software that supports nine crypto on five different algorithms. Cudo also uses artificial intelligence to automatically detect the best performing coin and switch over to that coin for you, enhancing your mining profitability.\n\nBesides having nine coins for mining, Cudo also offers four different cryptocurrency payout options: bitcoin, CUDOS, Ethereum, Monero and Alogrand. It supports GPU, CPU and ASIC mining as well as Windows, Mac and Linux devices.\n\nCudo Miner is free to download and set up, but it charges a fee based on the amount of cryptocurrency mined over a 30-day period. While top miners that produce over 10 BTC are only charged a 1.5% mining service fee, users that mine less than 0.005 BTC over a 30-day period are charged 6.5%, which is high.\n\nPros Utilizes BFGMiner mining engine\n\nGraphical interface for ease-of-use\n\nOpen-source code available on GitHub Cons Not natively compatible with Mac or Linux\n\nDoesn't have many advanced settings\n\nHIGHLIGHTS Platform Windows (Mac and Linux requires additional software) Fees None Complexity Medium\n\nWhy we chose it: MultiMiner is an open-source Bitcoin mining software available on GitHub with no licensing requirements. This means that users can modify the software as needed to fit their own mining needs. MultiMiner was developed by the founder of BFGMiner, and actually utilizes the same mining engine as BFGMiner.\n\nMultiMiner is popular with beginners, as it utilizes a graphical user interface that makes it easy to choose your settings and set up mining rigs. It has built-in hardware detection and gives you the supported parameters based on your hardware setup.\n\nMultiMiner also allows you to mine multiple cryptocurrencies and supports ASIC, GPU and CPU mining hardware. And while the software supports Windows, Mac and Linux operating systems, you need additional software to achieve full compatibility with Mac and Linux.\n\nMultiMiner is beginner-friendly, but also allows customization and access to an API. Overall, it's a great open-source Bitcoin mining software that's available for free.\n\nBest for Automation: Kryptex Miner Start Mining\n\nPros Can run in your computer's background\n\nSupports mining several cryptocurrencies\n\nAutomated coin switching for maximum profit\n\nMultiple payout methods (BTC or cash) Cons Charges high withdrawal fees\n\nDoesn't work well on basic hardware\n\nHIGHLIGHTS Platform Windows Fees 0.00005 BTC (or 3%) Complexity Low\n\nWhy we chose it: Kryptex Miner is a cryptocurrency mining software that uses your computer power to mine Bitcoin and other cryptocurrencies in the background. The software is only available for Windows, and registered users can download it for free.\n\nKryptex Miner will switch between several cryptocurrencies to mine the most profitable coin available, and payouts are made in BTC or your local currency (such as the U.S. Dollars).\n\nSince the software can mine while you’re using the computer for other purposes (using “lite mode”) Kryptex is a great way to automate your Bitcoin mining. Nevertheless, it charges a withdrawal fee of 0.00005 BTC on all Bitcoin withdrawals, which may be a large fee if withdrawing small amounts of BTC. Cashing out in fiat money comes with high fees as well (usually about 3%).\n\nKryptex Miner does not support Mac or Linux operating systems, and while you can install it on any Windows machine, don’t expect to earn much unless you have a powerful computer. Still, Kryptex Miner is a great way to automate crypto mining using hardware you may already have.\n\nBest Cloud-Based Platform: Ecos Cloud Mining Start Mining\n\nPros No hardware requirements\n\nRent processing and electricity from Ecos\n\nCompletely cloud-based Cons Profit depends on future price of BTC\n\nProfit calculator may be misleading\n\nHIGHLIGHTS Platform Cloud-based Fees Starting at $49 Complexity Low\n\nWhy we chose it: Ecos is a cryptocurrency cloud mining platform that allows you to purchase cloud mining contracts and rent power and equipment to mine Bitcoin. There are no hardware or utility requirements, as Ecos manages both, and the built-in profitability calculator can help estimate your earnings.\n\nEcos has you pick a Bitcoin (future) price prediction and contract duration, as well as the amount you want to spend on processing power. This will help you see an estimated profit percentage using the platform. You can then purchase your contract by paying an up-front fee to begin mining.\n\nEcos offers daily payouts into your Bitcoin wallet, and even has a mobile app to check in on your progress. But be aware that the calculator is not 100% accurate, and you may be able to achieve more Bitcoin profit by mining on your own.\n\nIf you want a hands-off approach to Bitcoin mining, Ecos is one of the best options on the market.\n\nBest for Centralized Management: Awesome Miner Start Mining\n\nPros Manage multiple miners in one place\n\nSupports 50 mining engines\n\nSupports multiple types of hardware\n\nRemote access available via browser Cons Monthly subscription required for all features\n\nMac OS not supported\n\nHIGHLIGHTS Platform Windows, Linux Fees $2/month per miner Complexity Medium\n\nWhy we chose it: Awesome Miner is a powerful Bitcoin mining software that offers centralized management of your cryptocurrency mining farm or mining pool. It integrates with over 50 mining engines and works with all of the most popular algorithms.\n\nAwesome Miner is designed for large-scale crypto miners. It supports several cryptocurrencies and has a well-designed user interface that allows you to see all of your mining hardware activity in one place.\n\nBesides granting you remote access from almost any device, it also allows you to:\n\nAutomatically switch between mining algorithms\n\nEnable the mining pools of your choice\n\nAutomatically mine the most profitable coins\n\nIntegrate the system with your own custom mining software\n\nAwesome Miner supports multiple hardware configurations (FPGA, ASIC, GPU, CPU), and is supported on both Windows and Linux devices. Mac OS is not supported, though you can access the Awesome Miner dashboard from any web browser (including Safari).\n\nAwesome Miner has a free version available, but it has limited features. Subscriptions start at $2 per miner per month, with discounts available to annual subscribers.\n\nBest for Fast Setup: EasyMiner Start Mining\n\nPros Mine Bitcoin, Litecoin and other crypto\n\nAutomatically starts mining upon activation\n\nEasy-to-use interface Cons Only supports CPU and GPU mining\n\nForces Litecoin mining\n\nWebsite is very dated\n\nHIGHLIGHTS Platform Windows Fees None Complexity Low\n\nWhy we chose it: Easy Miner is not a misnomer. As an open-source software that's free to download, it allows users to quickly start mining Bitcoin and Litecoin with just a few clicks. Easy Miner is also designed to detect your mining hardware and optimize the settings for profitability.\n\nEasy Miner offers a graphical user interface that is great for both beginners and advanced users who want to quickly configure their mining setup. The software is designed to mine both Bitcoin and Litecoin simultaneously. Upon activation, Easy Miner will automatically create a Litecoin wallet, begin mining using your CPU and give you Litecoin reward.\n\nThe Easy Miner interface lets you quickly switch between mining pools, update your network settings and check the details of your crypto wallets. But Easy Miner does not support FPGA or ASIC mining, relying instead on slower mining hardware (CPU and GPU) only.\n\nIf you’re a beginner, or simply want to ramp up your mining operation very quickly, Easy Miner is a good option.\n\nAds by Money. We may be compensated if you click this ad. Ad Take your Cryptocurrency potential to the next level Crypto Wallets make life on the blockchain simple and secure. Take control of your investment by downloading your wallet today. Download App\n\nOther companies we considered\n\nPros Allows you to mine Bitcoin from your iPhone Cons Only for ARM64 iOS Devices\n\nAdvanced setup process\n\nWhy it didn’t make the cut: MobileMiner is an CPU miner for ARM64 iOS Devices. It will use your iPhone’s spare processing power to mine Bitcoin. While the concept is interesting, it’s specifically ARM64 devices. Plus, you can’t get it on the App Store, and the set up process can be advanced for average users.\n\nPros Free Bitcoin cloud mining\n\nUse funds to save on trading fees Cons Must create a StormGain account\n\nDoesn't allow you to withdraw funds\n\nWhy it didn’t make the cut: StormGain is a cryptocurrency exchange that offers Bitcoin cloud mining for free, once you create a StormGain account. The Bitcoin is stored in a StormGain wallet but the funds can only be used to save on trading fees, you can’t withdraw them.\n\nBitcoin Mining Software Guide\n\nIt’s easy to see the appeal of crypto mining: spin up a rig, connect to a mining pool and earn Bitcoin while you sleep. But to do this, you’ll need the right software to complement your hardware setup.\n\nBitcoin mining software are specialized tools that use your machine’s processing power to generate new coins and introduce components to the Bitcoin blockchain.\n\nHow does Bitcoin mining software work?\n\nBitcoin mining software makes use of your hardware’s processing power to solve complex mathematical computations in search of a hash, an alphanumeric code that represents data — mostly transactions — on the Bitcoin blockchain or network. The hash contains the information for the next block in the network as well as the previous block, which ensures the data is accurate and in order. The computer that solves for the hash is allowed to mine the next block on the Bitcoin blockchain and collect a block reward (6.25 BTC per block as of May 9, 2023).\n\nBitcoin mining software takes as many guesses at the hash as possible in the shortest amount of time, increasing the device's odds of earning a block reward and giving miners a competitive advantage. However, the advanced computing power required for Bitcoin mining software uses a substantial amount of electricity, which can have a considerable environmental impact.\n\nBitcoin mining software pros and cons\n\nDespite its straightforward appearance, crypto mining is a complex activity with some considerable caveats that neither crypto trading nor staking share. We recommend anyone who is seriously considering bitcoin mining as a source of income to review its benefits and drawbacks before they start investing.\n\nPros of Bitcoin Mining Cons of Bitcoin Mining Contributes to Bitcoin’s growth and stability . Becoming a miner, be it alone or as part of a group, helps ensure the longevity of the Bitcoin blockchain. For Bitcoin enthusiasts, this promotes the financial inclusion, innovation and democratization the coin espouses. Consumes a large amount of energy. Crypto mining in general requires a large amount of electricity to power the machines that solve hashes for miners. Bitcoin mining, however, is especially wasteful due to how competitive mining is for this digital asset. Hands-off investment . Once you have the necessary hardware and software, you only need to worry about upkeep and minor upgrades to your machine. Compare this to crypto trading, which is a more involved process that demands constant attention in order to see any profits. Expensive up front . Solo miners require high-end hardware to even have a chance at competing with others. Even those in mining pools or farms will have to invest plenty in their mining rig to get anything out of these arrangements. No interference from third parties. Bitcoin mining offers financial freedoms that other ventures do not. For example, miners can freeze their resources at any time and are not as exposed to data fraud issues from banks or centralized crypto exchanges. Can’t afford going offline. In order to have an efficient bitcoin mining operation, miners have to be online all the time. Going offline does not completely stop the mining process, but having a strong, uniform and continuous internet connection is crucial nonetheless.\n\nWhat are the average fees of Bitcoin mining software?\n\nMost Bitcoin mining software is free to download, and many of the most popular software on the market don’t charge any mining fees.\n\nThat being said, there are a few mining software companies that charge a monthly fee for using their software (usually just a few dollars per mining rig). Some software charges service fees (typically 1% to 6.5%) that are deducted from your total mining profits.\n\nBest for… Available Platforms Fees CGMiner Experienced Miners Windows, Mac, Linux None NiceHash Miner Beginners Windows, Mac, Linux 2% fee for payments Cudo Miner Different Cryptos Windows, Mac, Linux 1.5% - 6.5% MultiMiner Open-Source Software Windows (Mac and Linux requires additional software) None Kryptex Miner Automation Windows 0.00005 BTC (or 3%) Ecos Cloud Mining Cloud-Based Cloud-based Service contracts starting at $150 Awesome Miner Centralized Management Windows, Linux $2/month per miner EasyMiner Fast Setup Windows None\n\nHow to choose a Bitcoin mining software\n\nWhen looking for a quality Bitcoin mining software for your mining rig, you’ll want to review the following details:\n\nPrice\n\nMost Bitcoin mining software is free to download. However, some software charge fees on a regular basis or offer additional features behind a paywall. Others still may require both an up-front cost and ongoing expenses, like cloud-based mining services.\n\nMake sure to understand all of the costs associated with a Bitcoin mining software before purchasing or downloading it. Find out if it requires a one-time payment or charges monthly service fees, and consider how much that could eat into your crypto mining profits. Also, check whether the software puts all your bitcoin into its own wallet and charges withdrawal fees.\n\nSupported hardware\n\nSome mining software only support certain graphics cards, while others are designed for newer hardware, such as ASICs (Application-Specific Integrated Circuit) units. Make sure your hardware is supported before you settle on a Bitcoin mining software.\n\nSupported operating system(s)\n\nWhile most Bitcoin mining software supports Windows, Mac and Linux operating systems, some don't. Make sure your operating system is supported before attempting to download the mining software.\n\nUser Interface\n\nNot all mining software is designed with beginners in mind. If you’re uncomfortable with a command-line interface, make sure the Bitcoin mining software has a graphical user interface or a web-based interface. These types of interface make navigating the software much easier.\n\nHow long does it take to mine a bitcoin?\n\nHow long it takes to mine a bitcoin will vary widely depending on your hardware and chosen bitcoin mining software. Estimates from various sources say that solo miners can mine one bitcoin in about ten minutes, but this is only with an ideal (i.e. expensive) setup. Realistically speaking, most miners will be able to mine a bitcoin in around 30 days.\n\nMoreover, while it's possible to determine how much time it would take to mine a single bitcoin, it’s technically impossible to do as much — at least as a solo miner. This is because bitcoin mining is a binary game: You either win the network’s current block reward for solving a hash or lose against other miners in the race. That is to say, you either earn 6.25 BTC or you don’t.\n\nThis “rule” doesn’t apply for mining pools or farms since miners in those groups share the block rewards between themselves. With this type of arrangement, it’s possible to accumulate fractions of a bitcoin, which may eventually add up to a single bitcoin.\n\nBitcoin Mining Software FAQs What is bitcoin mining? chevron-down chevron-up Bitcoin mining is the process of solving complicated mathematical equations in order to verify and record new bitcoin transactions. Miners receive bitcoin for processing these transactions, which is how new bitcoins enter into circulation. Mining helps maintain the Bitcoin blockchain's history but is highly competitive, requires specialized hardware and can have a markedly negative impact on the environment. How to mine bitcoin? chevron-down chevron-up Technically, all you need to start mining bitcoin is your choice of bitcoin mining software and a specialized or high-end computer. The choice of hardware comes down to either an ASIC miner, which is a computer exclusively designed for mining specific coins, or a PC with a powerful GPU (graphics card) or CPU (processor). Once you have both of these elements, you can begin the mining process and earn some bitcoin. Because companies have turned bitcoin mining into a large-scale commercial affair by using data centers with purpose-built servers, most individual miners are at a disadvantage. This is why many prospective miners choose to join a mining pool when starting out — especially if they don't have a powerful machine. Because companies have turned bitcoin mining into a large-scale commercial affair by using data centers with purpose-built servers, most individual miners are at a disadvantage. This is why many prospective miners choose to join a mining pool when starting out — especially if they don't have a powerful machine. Can I run multiple Bitcoin mining software on one computer? chevron-down chevron-up You can run multiple Bitcoin mining software on your computer, but that may not be advisable. If you do this, make sure one software is focused on your CPU and the other on GPU so they aren't trying to pilfer processing power from each other. You may also be able to set up multiple mining software to connect to different mining pools. This allows you to automatically switch to the backup software if one goes down, minimizing downtime. But most Bitcoin mining software offers automatic switching these days and are designed to run only one instance. You may also be able to set up multiple mining software to connect to different mining pools. This allows you to automatically switch to the backup software if one goes down, minimizing downtime. But most Bitcoin mining software offers automatic switching these days and are designed to run only one instance. Is Bitcoin mining software eco-friendly? chevron-down chevron-up Bitcoin mining is not eco-friendly. It used to consume only a small amount of processing power when the network was relatively small and mining difficulty was low. As the Bitcoin network has grown over the past decade, however, mining has become extremely difficult and now requires a great amount of processing power to compete for block rewards. This has made Bitcoin a very consumptive technology. In fact the Bitcoin Energy Consumption Index reports that global Bitcoin mining operations utilize more power than all of The Netherlands. This problem has spurred discussions at a global level on how to regulate Bitcoin mining to reduce its impact on the environment. This has made Bitcoin a very consumptive technology. In fact the Bitcoin Energy Consumption Index reports that global Bitcoin mining operations utilize more power than all of The Netherlands. This problem has spurred discussions at a global level on how to regulate Bitcoin mining to reduce its impact on the environment.\n\nHow We Chose the Best Bitcoin Mining Software\n\nWe researched over 15 Bitcoin mining software options and evaluated them based on price, security, functionality and ease-of-use. Since there are several ways to mine Bitcoin, we tried to include a variety of mining software choices, including support for multiple platforms and types of hardware.\n\nThe Bitcoin mining software included in our list scored high in the following categories:\n\nSecurity\n\nWhen downloading open-source software from the internet, security is of utmost importance. The mining software we've chosen typically uses SSL and encryption to ensure your computer is safe.\n\nFeatures\n\nWhether they offer one-click mining or complete customization, our top picks have some of the best and most sought-after features for various mining needs.\n\nCost\n\nMost of the mining software we've included on this list are free or only charge reasonable fees. This can help you keep more of your crypto mining profits. One exception is cloud-based mining, which has an up-front cost and ongoing expenses for renting the equipment to mine.\n\nSummary of the Best Bitcoin Mining Software of 2023"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luYmFzZS5jb20vaW5zdGl0dXRpb25hbC9yZXNlYXJjaC1pbnNpZ2h0cy9yZXNlYXJjaC93ZWVrbHktbWFya2V0LWNvbW1lbnRhcnkvd2Vla2x5LXdob3MtYnV5aW5nLXNlbGxpbmctYml0Y29pbi1tYXktMTktMjAyM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Who's buying and selling bitcoin - Coinbase",
        "content": "Market view\n\nThere are several important technical supply vs demand factors that may influence bitcoin performance in the next few months, ahead of the rewards halving event in April 2024:\n\nMt. Gox (141,686 BTC). One of the most well telegraphed sources of pressure in the months ahead may be the bitcoin that’s due to be distributed to creditors as part of the Mt. Gox rehabilitation plan. Disbursements are supposed to be made by October 31 (though the deadline may be extended), but bitcoin selling could take place before that to raise the cash needed for settlements. The general framework is that the first JPY200k (~US$1440) of each creditor’s claim will be paid in cash followed by a mix of around 70%/30% token vs cash for the remaining balance – unless a creditor has explicitly requested a different split (e.g. 100% bitcoin or 100% cash). Incidentally, the two largest creditors representing around 20% of all Mt. Gox claims have also elected to be paid in mostly bitcoin. Note that we do not know the current number of available creditors as an unspecified number have sold their claims to third parties, but the Mt. Gox collapse had initially affected around 24,000 creditors. That puts the potential upper limit of forced bitcoin selling near an estimate of 35k BTC. Currently, the Mt. Gox trustee is sitting on 137,891 BTC, a balance that has remained constant since May 2018.\n\nUala. The Central Bank of Argentina (BCRA) issued a regulatory decree on May 4 that prevents payment service providers (that offer payment accounts) in its country from carrying out crypto related operations for their clients. This is forcing around 250-300k customers of one fintech firm – Uala – to liquidate their crypto asset holdings (mainly BTC and ETH) within 30 days. Note that digital assets will have to be sold (to be settled in ARS) as the company doesn’t allow their digital wallets to transfer crypto off the platform – ruling out the possibility of self-custody. Their platform had required a minimum investment of ARS250 (~$1.08) per user. We do not know the total amount of bitcoin that has been or may need to be sold.\n\nTether. Stablecoin Tether (USDT) announced that it would start accumulating bitcoin in its reserves on a monthly basis using 15% of its net realized operating profits from investments (i.e. not including asset appreciation). Given that Tether increased its net profit by $1.5B in the first quarter, this would presumably translate into $222.3M in bitcoin purchases (equivalent to 8,234 BTC) in the first tranche of buying, based on the data from its 1Q23 Assurance Report . The attestation also indicates that bitcoin comprised $1.5B or 1.8% of its consolidated reserves as of March 31, contributing to excess reserves of $2.4B or a 3.1% capital ratio on its $79.4B outstanding liabilities. This is up from a capital ratio of 1.5% in 4Q22.\n\nPlease be aware that the list provided above is not exhaustive, and there could be additional factors or sources that may contribute to bitcoin market activity through year-end."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDUvMTgvZWxpemFiZXRoLXdhcnJlbnMtYmlsbC13b250LXN0b3AtbW9uZXktbGF1bmRlcmluZy1idXQtaXQtY291bGQtYmFuLWNyeXB0by_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA1LzE4L2VsaXphYmV0aC13YXJyZW5zLWJpbGwtd29udC1zdG9wLW1vbmV5LWxhdW5kZXJpbmctYnV0LWl0LWNvdWxkLWJhbi1jcnlwdG8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Elizabeth Warren’s Bill Won’t Stop Money Laundering, but It Could Ban Crypto - CoinDesk",
        "content": "If the Warren-Marshall legislation fails the necessary test, does it do more harm than good? After all, money laundering is terrible. Shouldn’t the legislation be passed even if it only helps on the margins? Here is where the harms of the legislation, namely requiring those that develop software and validate transactions on a blockchain to register as financial institutions, are so problematic. The problem is these individuals can’t practically register as a financial institution. The authors of this legislation know this and further know that requiring software developers and validators to engage in the same kind of multi-million dollar compliance regime that banks do would collapse the crypto economy, which, after all, is the point."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tYWRvcHRpb24taXMtYm9vbWluZy1idXQtbm90LWluLXRoZS11cy1vci1ldXJvcGUtYml0Y29pbi1idWlsZGVycy0yMDIz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Crypto adoption is booming, but not in the US or Europe — Bitcoin Builders 2023 - Cointelegraph",
        "content": "Mass crypto adoption is already taking place around the world, but not in the United States or Europe, nor does it have Bitcoin as a flagship asset for mainstream acceptance. According to Daniel Fogg of IOV Labs, the foundation that supports smart contract platform Rootstock among other projects, the increase in adoption is instead ongoing in emerging markets, where cryptocurrencies are offering solutions to people’s everyday problems.\n\nIn an interview with Cointelegraph’s Joe Hall at the Bitcoin Builders Conference in Miami, Fogg spoke about Bitcoin pragmatism, adoption worldwide and how emerging economies are shaping the future of the crypto space.\n\nJoe Hall and Daniel Fogg at the Bitcoin Builders Conference 2023. Source: Cointelegraph\n\nAccording to Fogg, emerging markets are leading the way in crypto adoption for one major reason — countries that have significant macroeconomic challenges. In his view, many people’s first meaningful digital banking experience will be happening in emerging markets on crypto rails in the coming years.\n\n“People on the streets have a pressing need to protect their income, to get access to U.S. dollars to get a loan. [...] We’re seeing these massive shifts. For me, if you want to look at the future of what I hope crypto will become, it exists today in Turkey, Colombia, Nigeria, Argentina. It doesn’t exist today in the United States or the U.K.\"\n\nFogg believes the crypto space is evolving through two major crypto use cases. One is centered around decentralized finance (DeFi) solutions for people seeking outsized returns and alternative investment opportunities. Another use case involves people acquiring stablecoins pegged to the U.S. dollar for savings and daily payments in economies dealing with inflation, devaluation and other monetary problems.\n\n“I think there’s a kind of bifurcation in what DeFi could become, advanced DeFi, which is a lot of what I think the usage in America and Europe will be [...], and then everyday DeFi, which is what you’re going to see in emerging markets every day.\"\n\nEmerging markets offer “scale opportunity” to retail finance, said Fogg, adding that developing DeFi products for these areas is a key strategy for Rootstock and its sister company, IOV Labs. Speaking about Bitcoin pragmatism, Fogg highlighted that although Bitcoin is a remarkable innovation, Bitcoin alone is simply not enough. As told by Fogg, the crypto space doesn’t yet have an established use case for billions of users, and it may take years to achieve that:\n\n“In many cases, we think they’re paying, saving, borrowing, lending, retail finance, etc. But there are many other use cases as well. We have to experiment our way there. And if we are held back by a traditional conservative mindset around what Bitcoin could be, I think that’s to the world’s detriment.\"\n\nMagazine: Bitcoin in Senegal: Why is this African country using BTC?\n\nUpdate (5/19/2023 22:00 UTC): This article has been updated to clarify that Daniel Fogg works for IOV Labs only and that IOV Labs is a foundation that supports the development of Rootstock, among other projects."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xNDA1OTUvYml0Y29pbi0yMDIzLWluLW1pYW1pLWJlYXItbWFya2V0LWxvd2VyLWF0dGVuZGFuY2XSAVJodHRwczovL2RlY3J5cHQuY28vMTQwNTk1L2JpdGNvaW4tMjAyMy1pbi1taWFtaS1iZWFyLW1hcmtldC1sb3dlci1hdHRlbmRhbmNlP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Bitcoin 2023 Attendees in Miami Blame Bear Market Vibes for Lower Attendance - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThousands of people flocked to Miami Beach this week to partake in Bitcoin 2023 and talk shop about crypto’s top coin, but some attendees said the iconic conference feels different on its first day than in years past—with less hype and more empty chairs.\n\nThe conference devoted to crypto’s most dominant coin attracted around 35,000 people last year, according to the event’s website, featuring speakers like the NFL quarterback Aaron Rodgers and the tennis legend Serena Williams.\n\nBut a steep decline in digital asset prices and a wave of crypto-native blowups has dampened attendance. The conference organizers expect to see 15,000 attendees at what they call “the world’s largest Bitcoin gathering.”\n\nAD\n\nAD\n\n“It's not wall-to-wall packed like it normally is,” said Andre Hicks, a traveling nurse based in upstate New York, who’s attended the Miami-based Bitcoin conference for the past two years. “I've never ever been to one where it was just like a dead bear market like it is now.”\n\nBitcoin 2023 attendee Andre Hicks. Source: André Begansk/Decrypt\n\nHe attributed the lack of people present to a decline in disposable income for the average person, pointing to factors like high inflation. He also said most people would prefer to attend a conference where Bitcoin was rising as opposed to one where its price is depressed.\n\n“Everybody wants to win,” Hicks said. “But nobody wants to go through the stacking phase, actually teaching yourself about cryptocurrency.”\n\nGeneral admission tickets to Bitcoin 2023 cost nearly $1,000, but the cheapest option among tickets only grants attendees access to two of the conferences three days. Conference goers who spent an extra $1,300 got access to an Industry Pass, which granted them access to events set aside for Bitcoin-related businesses yesterday.\n\nBitcoin 2023 attendee Sam Miyakawa. Source: André Beganski/Decrypt\n\n“They'll get a lot more people here tomorrow,” said Sam Miyakawa, an open-source developer who’s interested in decentralized social media and contributes to Snort Social, a nostr-based project. “I didn't expect that many people to be here.”\n\nAD\n\nAD\n\nCompared to Bitcoin 2022, which Miyakawa also attended, it only makes sense that fewer people would attend this year, he said. He noted that when Bitcoin 2022 took place last April, crypto was just coming off a bull market.\n\nBitcoin 2023 attendee Will Laurent. Source: André Beganski/Decrypt\n\nIn the conference’s press room, where speakers mingled with influencers and reporters, Will Laurent, a contract worker for DFINITY, said it felt like a ghost town compared to last year.\n\nDuring Bitcoin 2022, the press room was packed, Laurent said, as people clamored to interview speakers like the Canadian entrepreneur and “Shark Tank” star Kevin O’Leary or the Bitcoin Foundation’s Chairman, Brock Pierce.\n\n“They still might come in,” Laurent said, referring to the two former speakers. “But where are all the other people?”"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZmludGVjaC5nbG9iYWwvMjAyMy8wNS8xNy9jb3JtaW50LWJhZ3MtMzBtLWFuZC00MDAtYnRjLXRvLXNjYWxlLWJpdGNvaW4tbWluaW5nLWluLXdlc3QtdGV4YXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Cormint bags $30m and 400 BTC to scale Bitcoin mining in West Texas - FinTech Global",
        "content": "Cormint Data Systems, a burgeoning Bitcoin miner that aims to mine cost-effective Bitcoin at scale while supporting a sustainable and dependable power grid, has announced a successful $30m Series A equity raise.\n\nThe funding round was co-headed by Cormint’s President, Jamie McAvity, and Silicon Laboratories, Inc’s Chairman Nav Sooch. The round also saw significant participation from existing investors. Silicon Labs’ former CTO, Alessandro Piovaccari, joined the round as an advisor to Cormint alongside Sooch, while also investing in the company.\n\nThe Series A funding supplements the capital Cormint previously raised through Bitcoin-denominated promissory notes issued in 2022. This additional financial backing will facilitate rapid expansion of Cormint’s operations at its main site in Fort Stockton.\n\nThe company has set an ambitious goal of achieving 2.4 EH of self-mining capacity by the end of 2024. With its proprietary immersion solution and power optimisation software, Cormint aspires to be one of the lowest-cost Bitcoin miners in North America.\n\nThe freshly secured funds will be used to further expand Cormint’s operations in West Texas, with President Jamie McAvity emphasising his commitment to Bitcoin mining in the region. He underscored the supportive regulatory environment in Texas, highlighting its favourable impact on the growing Bitcoin mining industry and the state’s transition to renewable energy.\n\nCormint’s President, Jamie McAvity, expressed his elation at the strong support from investors. He recently led both equity and debt rounds into Cormint after successfully exiting his previous SaaS business, Knock, which was acquired by Texas-based Realpage in 2022.\n\nMcAvity said, “I am going all in on Bitcoin mining in West Texas. Pecos County is our home and we are proud to be here. In my view, Texas is the best place to be a Bitcoin miner, having set the playing field with transparent and fair regulation for the fast growing Bitcoin mining industry that is proven to be supportive of grid stability and the renewable energy transition.”\n\nFounded in 2018, Cormint boasts a strong foundation in engineering, energy, and financial management. Its leadership team, consisting of four dedicated co-founders and ardent Bitcoin enthusiasts, believes these strengths will ensure sustainable growth and deliver impressive returns to investors throughout various economic cycles. Cormint has already achieved operating free cash flow in its most recent financial quarter and anticipates continued improvement in operating margins as the business scales.\n\nKeep up with all the latest FinTech news here\n\nCopyright © 2023 FinTech Global"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9saWdodG5pbmctbGFicy1sYXVuY2hlcy11cGRhdGVkLXByb3RvY29sLWJpdGNvaW4tYnJjMjAtY29uZ2VzdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Lightning Labs launches updated protocol to help solve Bitcoin's BRC-20 issues - Cointelegraph",
        "content": "Bitcoin (BTC) users have been given a possibly more efficient way to mint new assets on the blockchain after an updated edition of the recently-rebranded Taproot Assets Protocol was released by Lightning Labs.\n\nIn a May 16 blog post, Lightning Network infrastructure firm Lighting Labs criticized the current methods by which assets are inscribed on the Bitcoin blockchain, calling them “particularly inefficient” and pointed to cumbersome protocols that write asset metadata “directly into block space.”\n\nToday we're excited to announce the newest version of Taproot Assets , a scalable protocol to issue assets on #bitcoin and Lightning.\n\n\n\nWith this release, developers have the core set of features to bitcoinize the dollar in a chain-efficient manner! ⛓️https://t.co/7WmeDjNnM2 — Lightning Labs⚡️ (@lightning) May 16, 2023\n\nThe Taproot Assets Protocol is designed to operate “maximally off-chain” in order to avoid the network congestion that has become an unfortunate characteristic of the Bitcoin network since the inception of the BRC-20 token standard by anonymous developer “Domo” on March 8.\n\nLightning Labs said Protocol users could soon integrate BRC-20 assets into the Lightning Network, with wallets, exchanges and merchants ported, over instead of needing to “bootstrap a new ecosystem” from scratch.\n\nDomo has previously said the Taproot Assets Protocol is a far “better solution” for minting new assets on Bitcoin when compared to the pre-existing methods like JavaScript Object Notation (JSON), as it allows for users to easily transfer to the Lightning network for “fast and cheap transactions.”\n\nThe overwhelming majority of BRC-20 tokens created thus far utilize Ordinal inscriptions of JSON data to deploy token contracts, mint tokens and transfer them.\n\nThis method has drawn widespread criticism from developers, who claim the process costs four times as much in transaction fees compared to just using binary.\n\nThe Taproot Assets Protocol is the rebranded version of the original “Taro” protocol. Lightning Labs was forced to change the name of the software following what it called a “frivolous” trademark infringement suit filed against them by blockchain development firm Tari Labs on Dec. 8 last year.\n\nRelated: Ordinals and BRC-20 will disappear in a matter of months, says JAN3 CEO\n\nThe total value of BRC-20 tokens briefly surpassed the $1 billion mark on May 9 but has since shrunk back down to $500 million, a drop of nearly 50%.\n\nThe total number of BRC-20 tokens ranked by market cap. Source: BRC-20\n\nMagazine: $3.4B of Bitcoin in a popcorn tin — The Silk Road hacker’s story"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJ1c2luZXNzd2lyZS5jb20vbmV3cy9ob21lLzIwMjMwNTE3MDA1Nzk4L2VuL1VTLUJpdGNvaW4tQ29ycC1TZWN1cmVzLUhpZ2gtUHJvZmlsZS1Ib3N0aW5nLUNvbnRyYWN0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "US Bitcoin Corp Secures High-Profile Hosting Contracts - Business Wire",
        "content": "MIAMI--(BUSINESS WIRE)--US Data Mining Group, Inc. dba US Bitcoin Corp (“USBTC”), a leading industrial-scale operator of bitcoin mining sites for both self-mining and hosted machines, today announced that it has finalized hosting contracts for an aggregate of approximately 150,000 machines with major mining companies, including Marathon Digital, Foundry USA, Sphere 3D, Decimal Group, and TeslaWatt.\n\nUSBTC will host these machines at its Charlie, Delta, and Echo sites, which the company operates under its US Mining Infrastructure Operations (“USMIO”) subsidiary. USMIO provides site owners with an industry-first, turnkey site management solution covering all aspects of site operations, including accounting, curtailment, and customer relations.\n\n“Our most recent partnerships with major hosting customers showcase our commitment to collaborative growth and innovation,” said Asher Genoot, President of USBTC. “We continue to expand operations across sites both fully owned by USBTC and operated in partnership with pioneering site owners like Generate Capital and NextEra Energy. We are committed to driving the future of sustainable and efficient Bitcoin mining infrastructure and our ability to secure major hosting contracts at these sites is a testament to this vision and our operating capabilities.”\n\nUSBTC’s Charlie and Delta sites are located in Kearney, Nebraska, and Granbury, Texas, respectively. USBTC operates these sites in partnership with Generate Capital, a leading financier and operator of sustainable infrastructure.\n\nUSBTC’s Echo site is located in Upton County, Texas, and co-located with a wind farm. USBTC operates the site under a joint venture with NextEra Energy, one of the world's largest energy companies. USBTC entered the joint venture with NextEra Energy in December 2022, when it acquired the 50% membership interest formerly held by Compute North Holdings, Inc. in the joint venture.\n\nAbout US Bitcoin Corp (USBTC)\n\nUSBTC is a leading industrial-scale operator of bitcoin mining sites, specializing in the design, construction, and management of sites with access to low-cost and sustainable sources of energy. The company operates four sites across the United States with a total capacity of more than 730 MW of electricity and generates revenue through self-mining, hosting, managed infrastructure operations, and equipment sales.\n\nUSBTC announced an all-stock merger of equals with Hut 8 Mining Corp. on February 7, 2023, which is subject to customary closing conditions. The combined company will be named Hut 8 Corp. and will be a U.S.-domiciled entity.\n\nFor more information, visit www.usbitcoin.com or contact info@usbitcoin.com\n\nDisclaimer\n\nThis press release incorporates \"future-oriented information\" and \"forward-looking statements\" as per United States securities laws. All data, apart from statements of historical facts, included in this press release that address actions, events, or developments that USBTC anticipates or expects will or might take place in the future, including aspects such as future business strategy, competitive strengths, objectives, expansion and growth of USBTC's businesses, operations, plans, and other similar matters, constitute future-oriented information. Forward-looking information is often indicated by terms such as \"may\", \"would\", \"could\", \"should\", \"will\", \"intend\", \"plan\", \"anticipate\", \"allow\", \"believe\", \"estimate\", \"expect\", \"predict\", \"can\", \"might\", \"potential\", \"predict\", \"is designed to\", \"likely\", or similar expressions. Furthermore, any statements in this press release referring to expectations, projections, or other descriptions of future events or circumstances contain forward-looking information.\n\nStatements containing forward-looking information are not historical facts; instead, they signify management's expectations, estimates, and projections about future events based on certain significant factors and assumptions at the time the statement was made. While US Data Mining Group Inc. dba US Bitcoin Corp (“USBTC”) deems these statements reasonable as of the press release's date, such statements are subject to recognized and unknown risks, uncertainties, assumptions, and other factors that may result in the actual results, activity level, performance, or achievements being materially different from those conveyed or implied by such future-oriented information.\n\nThe forward-looking statements included in this press release are provided as of the press release's date, and USBTC expressly disclaims any duty to update or modify statements containing any future-oriented information, or the factors or assumptions underlying them, whether due to new data, future events, or otherwise, except as mandated by law. Except where otherwise specified herein, the information provided herein is based on matters as they exist as of the date of preparation and not as of any future date and will not be updated or otherwise revised to reflect information that subsequently becomes available, or circumstances existing or changes occurring after the date of preparation."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWRlZmVuc2UtbGF3eWVyLXNheXMtY3JhaWctd3JpZ2h0LWxhd3N1aXQtY291bGQtaGFybS1vcGVuLXNvdXJjZS1zb2Z0d2FyZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Bitcoin defense lawyer says Craig Wright lawsuit could harm open source software - Cointelegraph",
        "content": "Jessica Jonas, chief legal officer of the nonprofit Bitcoin Legal Defense Fund, discussed the potential legal ramifications of a high profile lawsuit against Bitcoin core developers during the Bitcoin 2023 event in Miami on May 18.\n\nThe case in question is a U.K. legal action filed by Craig Wright, the owner/operator of Tulip Trading. Wright’s perhaps most well-known for his assertion that he is Bitcoin creator Satoshi Nakamoto — a claim driving another unrelated lawsuit.\n\nI would just want to say a quick reminder for BTC Core and Roger Inc.\n\n\n\nYou are under litigation hold. Those telegram groups, the signal groups, the others that you think I don't know about are all discoverable evidence and spoliation is a criminal offence. pic.twitter.com/vtjFmeGrRd — Dr Craig S Wright (@Dr_CSWright) February 3, 2023\n\nIn the case between Tulip Trading and 14 named individuals allegedly involved in the open source development of Bitcoin Core, in addition to others, Wright alleges that the said developers owe him a fiduciary duty. Jonas described the case as being about “an allegation that Tulip Trading owned, allegedly, 111,000 Bitcoin and was hacked, allegedly, and lost that 111,000 Bitcoin in some very Ocean’s 11 style hack.”\n\nIn order to obtain compensation for the alleged loss, Wright is demanding, per Jonas, that Bitcoin developers “create a backdoor into the Bitcoin core blockchain such that Tulip Trading can recover the funds it allegedly lost,” a remedy Jonas asserts can’t be implemented:\n\n“They are asking the court to order that this group of software developers write a patch into the software that diverts funds. That’s not how Bitcoin works. It’s impossible.”\n\nJonas explained that implementing such a change would require hard forking the Bitcoin blockchain and then expecting everyone in the world to shift to the new fork instead of continuing to use the existing core chain. Describing the area of law surrounding fiduciary duty as “complicated,” Jonas went on to describe the lawsuit as extraordinarily dangerous for reasons beyond technical limitations.\n\n“This case has actually already gone through an appeal and the appellate court found that the question of whether open source developers should owe a fiduciary duty to people who use their code is an important one,” claimed Jonas. Furthermore, Jonas described the potential threat to the open source community as “existential.” “Open source software makes up 97% of the world's software,\" she said.\n\nRelated: 7 people who could be (or not) Bitcoin creator Satoshi Nakamoto\n\nJonas also framed the case as a matter of free speech. Despite the fact that many of the defendants named in the suit are U.S. citizens operating in the U.S., the case is being tried in the U.K. per the appellate court’s decision that it held jurisdiction due to the potential outcome being in the public interest in that country.\n\nAccording to Jonas, software development is considered free speech in the U.S. and, per her assessment, “Tulip Trading is acting in a U.K. court in a civil action to compel many Americans to speak.” While the U.K. court can’t necessarily enforce free speech laws in the U.S., Jonas pushed back against the idea that it would be far-fetched for the court to rule in Wright’s favor.\n\nBitcoin open-source development is under the Massachusetts Institute of Technology's (MIT's) open-source license. Because open-source software is generally available to anyone, anywhere, assigning fiduciary duty to developers could lead to a situation where someone in one country is liable for damages to someone in another simply because they contributed to an open-source project. Current law, explained Jonas, is meant to protect open-source developers from being sued by strangers:\n\n“They are volunteering their time to work on public infrastructure. They’re doing it for free. They’re doing it under MIT license, which is supposed to protect them from things like this.”\n\nMagazine: Coinbase screws up, Florida bans CBDCs, and Ordinals face controversy"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vZGVkb2xsYXJpemF0aW9uLXVzZC1ncmVlbmJhY2stZ29sZC15dWFuLWV1cm8tYml0Y29pbi1icmljcy1hbHRlcm5hdGUtMjAyMy010gFvaHR0cHM6Ly93d3cuYnVzaW5lc3NpbnNpZGVyLmNvbS9kZWRvbGxhcml6YXRpb24tdXNkLWdyZWVuYmFjay1nb2xkLXl1YW4tZXVyby1iaXRjb2luLWJyaWNzLWFsdGVybmF0ZS0yMDIzLTU_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "De-dollarization: Alternative assets that are trying to replace USD - Business Insider",
        "content": "The dollar isn't going away, but other assets classes are slowly chipping away at its dominance.\n\nThe US dollar is the world's top reserve currency — by far. CFOTO/Future Publishing via Getty Images\n\nThe US dollar has been the world's reserve currency since the second world war, playing a crucial role in the world's trade.\n\nBut countries globally are now lining up backup currencies for trade, as sanctions against Russia over its invasion of Ukraine have led to some prominent world leaders and business figures sounding a warning over the power Washington — and the US dollar — wields.\n\nSanctioned countries like Russia and emerging nations like Argentina have recently started using the Chinese yuan for trade, primarily with China.\n\nEven so, there's no indication the dollar's dominance could fade in the foreseeable future, simply because the currency is such an integral part of the world economy, Insider's Jennifer Sor reported on May 6.\n\nThe dollar is by far the world's most dominant reserve currency — meaning a large quantity of a foreign currency held by central banks and major financial institutes for their use from investments to payments.\n\nIn 1999, over 70% of the world's foreign exchange reserves were held in the US dollar.\n\nBut that percentage has been dropping — the dollar's share in global foreign exchange reserves fell to under 60% in the fourth quarter of 2021, the International Monetary Fund, or IMF, said in a June 2022 blog post.\n\nAnd despite accounting for the lion's share, or 54%, of global foreign exchange reserves in the fourth quarter of 2022, there has been a decline in the dollar's share of the total foreign reserve pie, per IMF data.\n\nBut this doesn't mean America's strategic competitors — like China — wouldn't stop challenging American hegemony. Even alternative currencies like the Swedish krona, the South Korean won, and the Australian and Canadian dollars have been chipping away at the greenback's share.\n\nRead further for five assets that are trying to topple the dollar's dominance."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvY3J5cHRvY3VycmVuY2llcy1iaXRjb2luLWRvd24tZm9yLXNlY29uZC1zdHJhaWdodC13ZWVrL9IBZGh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvY3J5cHRvY3VycmVuY2llcy1iaXRjb2luLWRvd24tZm9yLXNlY29uZC1zdHJhaWdodC13ZWVrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Cryptocurrencies: Bitcoin Down for Second Straight Week - ETF Trends",
        "content": "by Jennifer Nash, 5/17/23\n\nThis weekly update tracks some of the largest cryptocurrencies by market share: bitcoin and ether. We’ve also included XRP, as it was one of the largest cryptocurrencies when this article began. According to Wikipedia, a cryptocurrency is “a digital asset designed to work as a medium of exchange that uses cryptography to secure its transactions, to control the creation of additional units, and to verify the transfer of assets.”\n\nBitcoin was the world’s first cryptocurrency and decentralized digital currency. The first bitcoin transaction occurred in early 2009 and has since grown worldwide. Ether is another cryptocurrency run on the Ethereum blockchain platform and has the second largest market share, despite being the newest of the three with its launch in July 2015.\n\nThe third-largest market share of cryptocurrency, tether, is a token “backed by actual assets” which includes one US dollar, one euro, or loans to affiliate companies and is controlled by the owners of Bitfinex. It’s a controversial cryptocurrency due to its alleged manipulation of crypto pricing. It is called a “stable coin” because it was designed to always be worth $1.00. We do not chart it because its price rarely changes.\n\nXRP, which is owned by Ripple and launched in 2012, was one of the larger cryptocurrencies for some time until new coins joined the market. We’ve included it here for reference.\n\nThe Latest Data (through May 16, 2023)\n\nBitcoin continued its decline this past week, dropping below $27,000 for the first time in almost 2 months. Despite the second consecutive weekly fall, Bitcoin is up ~63% year-to-date.\n\nXRP fell to $0.42 during this past week, its lowest level since the end of March, and is currently up ~26% year-to-date.\n\nEther (ETH) fell below $1,800 for the first time since the beginning of April during this past week. Despite the decline, ETH is up ~51% year-to-date.\n\nI have also created an index in order to chart these together given their very different pricing history. Ether tops the chart – the price of an ether has changed the most out of all three cryptocurrencies.\n\nETFs associated with cryptocurrencies include: ProShares Bitcoin Strategy ETF (BITO) and ProShares Short Bitcoin Strategy ETF (BITI).\n\nOriginally published on Advisor Perspectives.\n\nFor more news, information, and analysis, visit the Crypto Channel."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy92YWxreXJpZS1sZXZlcmFnZWQtYml0Y29pbi1mdXR1cmVzLWV0Zi1hcHBsaWNhdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Valkyrie Leveraged Bitcoin Futures ETF gets inspiration from TradFi memes - Cointelegraph",
        "content": "In its latest futures-based exchange-traded fund (ETF) filing, Valkyrie Funds utilizes one of the popular memes from the financial Twitter community, known as “fintwit,” to capture attention and interest.\n\nOn May 16, the investment firm submitted a new application for a Bitcoin (BTC) futures-based ETF to be listed on the Nasdaq with the ticker symbol “BTFD.“\n\nBoth of Valkyrie’s Bitcoin-centric funds do not have direct exposure to Bitcoin itself; instead, they invest in Bitcoin futures traded on the Chicago Mercantile Exchange. Bitcoin futures are financial contracts that allow investors to speculate on the future price movements of Bitcoin. These contracts obligate the buyer to purchase or the seller to sell Bitcoin at a predetermined price on a specific future date. Unlike trading Bitcoin — which involves owning and holding the digital asset itself — Bitcoin futures enable traders to speculate on the price of Bitcoin without directly owning it.\n\nInitially intended for the first fund, the suggestive ticker was reportedly modified by the firm in October 2021.\n\nIn contrast to the firm’s existing block trading facility (BTF) fund, this newly proposed fund will offer leverage, allowing speculators to increase their exposure to the dominant cryptocurrency. A BTF is an actively managed ETF available through Nasdaq that invests primarily in Bitcoin futures contracts.\n\nUp to this point, the market has witnessed the introduction of four distinct Bitcoin futures-based ETFs. The first, ProShares Bitcoin Futures ETF, was launched in October 2021.\n\nThus far, the United States Securities and Exchange Commission (SEC) has denied several attempts to introduce Bitcoin spot ETFs or funds that provide direct exposure to the dominant cryptocurrency, citing concerns regarding potential market manipulation in the Bitcoin market.\n\nRelated: Breaking: Court victory for Ripple as judge denies SEC motion to seal Hinman docs\n\nDigital asset manager Grayscale is currently involved in a prolonged legal dispute with the SEC as it seeks to transform its struggling Grayscale Bitcoin Trust into a Bitcoin spot ETF. The investment firm criticized the SEC’s decision to authorize futures-based ETFs instead of spot ETFs, deeming it “illogical.“\n\nIn March, the judges presiding over the dispute between the two entities in the U.S. Court of Appeals for the District of Columbia Circuit expressed the view that the SEC “must provide a thorough explanation” regarding its understanding of the connection between Bitcoin futures and the spot price of Bitcoin.\n\nMagazine: Ordinals turned Bitcoin into a worse version of Ethereum: Can we fix it?"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRyYWRlci1wcmVkaWN0cy1lbmQtb2YtZGlwLXdpdGhpbi13ZWVrcy1hcy1idGMtcHJpY2UtYWRkcy0zLTXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Bitcoin trader predicts end of dip within weeks as BTC price adds 3.5% - Cointelegraph",
        "content": "Bitcoin (BTC) held a snap rebound on May 18 as analysts hoped that further upside would come next.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\nBTC price sustains knee-jerk move higher\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it circled $27,400 on Bitstamp.\n\nThe pair had made swift gains toward the prior day’s Wall Street open, these topping out at 3.5% versus the day’s lows.\n\nAmid changing signals on exchange order books, popular trader Skew was hopeful for continuation.\n\n“Price swept the pre-emptive swing low, which was enough liquidity to push up higher,” he summarized in part of a Twitter analysis.\n\nSkew added that while macro conditions were overall causing friction for BTC price performance, the largest stablecoin Tether pledging regular BTC buys should be a “positive headwind.”\n\nBitcoin cumulative volume delta (CVD) data annotated chart. Source: Skew/ Twitter\n\nMeanwhile, cumulative volume delta (CVD) showed increasing momentum, further indicating that Bitcoin price might sustain its newfound strength.\n\n“Looking for sustained buying momentum by spot else scalp short,” Skew added.\n\nOn-chain monitoring resource Material Indicators tracked the action on the Binance order book, with the price uptick coinciding with an increase in volume from the largest class of Bitcoin whales.\n\nIf you've been following for more than a minute, you've seen me say that Purple whales have historically had the most influence over Bitcoin PA. Here's a text book illustration of that on the W chart.\n\n\n\nLearn more about FireCharts here https://t.co/cLxkExkPmX pic.twitter.com/1I5JKGstCt — Material Indicators (@MI_Algos) May 17, 2023\n\nAs ever, not everyone was convinced about the uptick’s longevity. Among them was the popular trading account TraderSZ, which began the day closing out a long BTC position.\n\n“Think the bounce is done,” part of the accompanying commentary stated, anticipating a return to the downside.\n\nBTC/USD annotated chart. Source: TraderSZ/ Twitter\n\nAs Cointelegraph reported, shorter-term and longer-term downside targets currently extend to around $25,000 and $24,000, respectively.\n\nBottom “might be in” for Bitcoin price correction\n\nZooming out, meanwhile, fellow trader Credible Crypto revealed a belief that a more pronounced return to the upside could come within the next month.\n\nRelated: ‘One of the greatest’ Bitcoin metrics says BTC price bull run is here\n\n“How much longer till expansion and is the bottom in? 25k’s tested, liq below us taken, bottom for this correction MIGHT be in but need to see how PA develops over the coming days. While we can’t rule out a flush lower yet, developing PA will give us some clues to work with,” part of a tweet on the day explained.\n\nCredible Crypto uploaded two charts with trend lines worth noting, adding that the upper one should hold as support, with BTC/USD then going higher.\n\n“I expect that blue dotted trendline on the right to hold which would mean less than 30 days for this sideways phase to complete and the next move up to begin,” he continued, describing the move’s character as “absolutely explosive.”\n\nBTC/USD annotated chart with trend lines. Source: Credible Crypto/ Twitter\n\nMagazine: Alameda’s $38B IRS bill, Do Kwon kicked in the assets, Milady frenzy: Asia Express\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93YXRjaC10aGVzZS1idGMtcHJpY2UtbGV2ZWxzLWFzLWJpdGNvaW4tdGhyZWF0ZW5zLXRvLWxvc2UtMjdrLXN1cHBvcnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Watch these BTC price levels as Bitcoin threatens to lose $27K support - Cointelegraph",
        "content": "Bitcoin (BTC) looked poised to give up $27,000 as support on May 17, with traders waiting for new lows.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\nWhales meet low liquidity\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD trading near $26,800 at the time of writing.\n\nThe pair had staged multiple crosses of the $27,000 mark the day before, with that level forming a low-timeframe focus now at risk of breaking down.\n\nBTC/USD annotated chart. Source: Crypto Tony/ Twitter\n\n“3 wave up into resistance, followed by a retest and a rejection off resistance zone,” popular trader Crypto Tony summarized about recent activity.\n\nHe added that a potential target to wait for was now $26,400.\n\nTrading account TraderSZ had previously predicted an “expansion candle” to enter should the breakdown continue.\n\n$BTC daily. Looks like it’s breaking down. If correct we should get big down expansion candle soon. https://t.co/MAV2GY6mKn pic.twitter.com/24GXaMJPXR — TraderSZ (@trader1sz) May 16, 2023\n\n“Small long flush early in the morning,” another popular trader, Daan Crypto Trades, continued.\n\n“On the Bybit futures chart we can see how asks were filled and from there on out spot pushed price down to take out the longs that accumulated in this mini range. Overall still choppy and no clear direction.”\n\nAnalyzing order book setup on Binance, monitoring resource Material Indicators noted an overall lack of liquidity.\n\nThe largest-volume traders, it revealed, had reduced activity to a minimum as a result, perhaps due to that absence of coins exposing them to potential slippage.\n\nLiquidity on both sides of #Bitcoin price is so thin that whales have to either break up their market orders into smaller order sizes to minimize slippage or wait for pockets of liquidity before smashing buttons.\n\n\n\nCranked the Volume Percentile filter way down to see how and… pic.twitter.com/dpXddCKgiX — Material Indicators (@MI_Algos) May 16, 2023\n\nZooming out, however, an accompanying narrative for many remained the concept of “choppy” price action continuing.\n\nThe current trading range, featuring as a key support and resistance zone from 2021 onward, showed no signs of relinquishing control.\n\n“For the next few days I expect price action to be choppy between $27.2k - $26.5k,” Titan of Crypto wrote in one such market appraisal.\n\nBTC/USD annotated chart. Source: Titan of Crypto/ Twitter\n\n$25,000 BTC price target in stocks comparison\n\nWhile bullish in the long term, trading group Stockmoney Lizards offered a potential downside target of $25,000 on the day.\n\nRelated: Bitcoin trader eyes CME gap with $24K BTC price dip target in play\n\nAcknowledging the “head and shoulders” formation playing out during April — a bearish signal reported previously — it also presented the 25-week simple moving average (SMA) as a possible support line.\n\nThe 25-week SMA stood at just $23,100 on the day but was set to rise toward the potential retest in June.\n\nBTC/USD annotated chart. Source: Stockmoney Lizards/ Twitter\n\nA separate post nonetheless called the overall shape of price performance a “well-known” pattern, referencing similar moves on United States equities in years gone by. These moves ultimately resulted in a break to the upside.\n\n#Bitcoin\n\n\n\nis attempting to retest the neckline in this well-known chart pattern. pic.twitter.com/e6YtBYBRvt — Stockmoney Lizards (@StockmoneyL) May 17, 2023\n\nMagazine: Alameda’s $38B IRS bill, Do Kwon kicked in the assets, Milady frenzy: Asia Express\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZGVjcnlwdC5jby8xNDA0NjEvdGV0aGVyLXBsZWRnZXMtdG8tcGxvdy0xNS1vZi1wcm9maXRzLWludG8tYml0Y29pbtIBUWh0dHBzOi8vZGVjcnlwdC5jby8xNDA0NjEvdGV0aGVyLXBsZWRnZXMtdG8tcGxvdy0xNS1vZi1wcm9maXRzLWludG8tYml0Y29pbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Tether Pledges to Plow 15% of Profits into Bitcoin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nTether is to start regular purchases of Bitcoin to bolster its excess reserves, the stablecoin issuer said in an announcement on Wednesday.\n\nThe company will allocate up to 15% of its net realized operating profits for buying up the world’s largest cryptocurrency, starting this month.\n\n“Bitcoin has continually proven its resilience and has emerged as a long-term store of value with substantial growth potential,” said Paolo Ardoino, Tether’s CTO. “Its limited supply, decentralized nature, and widespread adoption have positioned Bitcoin as a favored choice among institutional and retail investors alike.”\n\nAD\n\nAD\n\nTether🧡#Bitcoin Starting this month, Tether will regularly allocate up to 15% of its net realized operating profits towards purchasing Bitcoin. These Bitcoin shall be considered on top of the minimum reserves assets that 100% back tether tokens. More 👉 https://t.co/7zC2swgwWH pic.twitter.com/BOcSDjjmDf — Tether (@Tether_to) May 17, 2023\n\nTether mints USDT—the third-largest cryptocurrency after Bitcoin and Ethereum and the industry’s biggest stablecoin. Stablecoins are cryptocurrencies with prices pegged to “stable” assets, like the U.S. dollar.\n\nThe company already holds around $1.5 billion worth of Bitcoin in its reserves, as per an assurance report from March this year.\n\nThe amount put towards the new investment strategy will be based on realized profits, which does not include unrealized gains from price increases within the portfolio.\n\nArdoino said on Twitter that the company has accrued $2.5bn in excess reserves on top of the 100% reserves that back issued tokens. This is a result of interest rates on U.S. Treasury bills and other investments such as gold.\n\nAD\n\nAD\n\n“While banks can do fractional reserve, we believe that's not a viable strategy for a stablecoin, so it's crucial that Tether keeps an additional cushion to further protect its user base,” he said.\n\nSoaring profits, but critics are \"dubious\"\n\nIn its most recent financial update, Tether boasted of “tremendous success” as it said net profits had hit $1.48 billion in the first quarter, while reserves are at an all-time high.\n\nBut the business was recently hit by accusations that its reserve claims are “dubious,” with former former Securities and Exchange Commission enforcement attorney John Reed Stark arguing that the firm’s regular unaudited attestations are “meaningless.”\n\nTether’s critics have voiced concerns over whether it provides sufficient disclosure regarding the U.S. dollar reserves which supposedly back USDT.\n\nThe Wall Street Journal reported in March that companies backing USDT used fake documents and shell companies, an allegation Tether said was “wholly inaccurate and misleading.”"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNS8xNy9pbnZlc3RvcnMtdHJhY2stcGVwZWNvaW4td2hhbGVzLXRvLWNhc2gtaW4tb24tbWVtZS1jb2luLW1hbmlhLWFzLXdpZGVyLW1hcmtldC1zdGFnbmF0ZXMv0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA1LzE3L2ludmVzdG9ycy10cmFjay1wZXBlY29pbi13aGFsZXMtdG8tY2FzaC1pbi1vbi1tZW1lLWNvaW4tbWFuaWEtYXMtd2lkZXItbWFya2V0LXN0YWduYXRlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Investors Track Pepecoin Whales to Cash In on Meme Coin Mania as Wider Market Stagnates - CoinDesk",
        "content": "Anyone doing so is ignoring the fact that the shocking magnitude of PEPE's controversial rise is rare. Digital assets that have very little – or no – fundamental value like dogecoin (DOGE) or Shiba Inu (SHIB) pop out of the ether every couple of years. But finding the next PEPE is next to impossible; every winner is surrounded by the ashes of many failures. (And, also, PEPE's market cap has crashed to less than $650 million, according to CoinGecko.)"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9kb2dlbWl5YWdpLWJpdGNvaW4tcmlwcGxlLWV4cGxvcmluZy1zZWNyZXRzLTA3MTEzMzA1Ny5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "DogeMiyagi, Bitcoin and Ripple: Exploring the Secrets Behind Top Crypto Supply Strategies - Yahoo Finance",
        "content": "In the exciting landscape of crypto, each token takes a different approach. Bitcoin (BTC), Ripple (XRP) and a new meme coin, DogeMiyagi (MIYAGI), have captured the attention of investors with their unique supply strategies. They each take a distinctive approach to fueling excitement and potential growth.\n\nBitcoin: The Scarcity-Driven Model\n\nBitcoin kickstarted the entire crypto revolution, introducing a completely new financial system. Built on the belief that scarcity breeds value, Bitcoin’s total supply is strictly capped at 21 million tokens. This digital gold relies on miners to confirm transactions and earn Bitcoin for securing the network.\n\nBitcoin’s supply is regulated through a halving process which happens every four years and reduces the reward for mining Bitcoin by 50%. As demand surges and the token becomes rarer, the price tends to skyrocket. The last halving occurred in 2020 and boosted Bitcoin’s price by 19% compared to the year before. The next halving event is scheduled for April 2024, and crypto enthusiasts anticipate an even bigger price surge.\n\nRipple: The Controlled Supply\n\nXRP, Ripple’s digital asset, was designed to create faster and cheaper transactions. Unlike Bitcoin, XRP was not designed to be mined. Instead, the token’s maximum supply is capped at 100 billion, 80 billion of which was gifted to Ripple by its founders.\n\n55 billion tokens were then placed in an escrow account for controlled release. Ripple periodically sells XRP to fund operations and promote its technology, growth and stability. This structure also allows XRP to complete more transactions at a faster and cheaper rate.\n\nDogeMiyagi: The Transparency-Driven Supply Strategy\n\nDogeMiyagi is a new meme coin with a focus on both entertainment and utility, and while meme coins often come and go in the market, this one is here to stay. With a total supply of 96,192,515,112,011 tokens, this project has divided its allocation wisely. DogeMiyagi has garnered attention for its focus on community involvement and its commitment to transparency.\n\nStory continues\n\nThe majority (60%) is dedicated to the presale, allowing the community to join in on the action early and benefit from the project’s continued growth. 24% will then be saved for exchanges, 6% for the referral program, 5% for the team, which is locked for 2 years and 5% for marketing which is locked for one year.\n\nDogeMiyagi has also orchestrated a burn schedule for each stage of the presale. There will be 6 burn events in total, each representing one of the Karate Kid films. In a fitting tribute, just before launch, the largest token burn will take place, representing the death of the beloved Mr Miyagi at the age of 86 years and 5 months, burning 86,050,000,000,000.00 tokens.\n\nCryptocurrencies all have different approaches to their supply strategies, and Bitcoin and Ripple have been some of the most successful so far, driving scarcity and prolonged growth. DogeMiyagi is strategically balancing meme coin culture, community and utility, providing a fresh take on crypto meme coins. The project’s supply model is designed to propagate growth for the coin and benefit every community member.\n\nFor more about DogeMiyagi:\n\nWebsite: https://dogemiyagi.com\n\nTwitter: https://twitter.com/_Dogemiyagi_\n\nTelegram: https://t.me/dogemiyagi"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS93aG8tYXJlLXRoZS1iaWdnZXN0LWJpdGNvaW4td2hhbGVzLWluLXRoZS13b3JsZGNoZWNrLWhlcmUtMTY3MDMxMDEuaHRt0gFyaHR0cHM6Ly93d3cuY25iY3R2MTguY29tL2NyeXB0b2N1cnJlbmN5L3doby1hcmUtdGhlLWJpZ2dlc3QtYml0Y29pbi13aGFsZXMtaW4tdGhlLXdvcmxkY2hlY2staGVyZS0xNjcwMzEwMS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Who are the biggest Bitcoin whales in the world - CNBCTV18",
        "content": "Several factors can affect the price of cryptocurrencies, including Bitcoin. For instance, Bitcoin whales play a pivotal role in influencing the market to a large extent. Whenever these whales buy or sell assets, it often creates a market stir, which is closely observed by other players. At times, whale purchases can push Bitcoin’s price to higher levels, while whale offloading can do the opposite.\n\nIn simple terms, Bitcoin whales refer to individuals, governments, exchanges, companies, and institutions that hold a significant number of bitcoins. Some of these Bitcoin whales have now become influencers, and people often seek their expertise to understand market sentiment. Let's take a look at some of the biggest Bitcoin whales currently in existence.\n\nIndividual Bitcoin Whales\n\nThe pseudonymous founder of Bitcoin, Satoshi Nakamoto, currently has 1 million BTCs in his kitty (worth around $27 billion at present), making him one of the biggest Bitcoin whales in the world. Surprisingly, he hasn't moved a single penny since he first mined these bitcoins. If he/she ever decides to move this massive stash of Bitcoin, it’s likely that the market would respond to the event.\n\nThe founder and CEO of Digital Currency Group (DCG), Barry Silbert, was an early Bitcoin adopter. In an interview with Reuters in 2017, he said that he had about $175,000 worth of bitcoin in 2012 and that he paid about $11 a bitcoin. Considering how much the market has evolved, he surely made a lucrative deal.\n\nHe founded the DCG group in 2013, which consists of five crypto-focused companies that invest in crypto startups. Over the years, the companies have accumulated around $28 billion worth of cryptocurrencies, including Bitcoin and Ethereum.\n\nThe Federal Bureau of Investigation (FBI) also holds large amounts of Bitcoin, obtained from seized properties. They auction the seized bitcoin to interested buyers, and Barry Silbert happens to be among them. He bought 48,000 bitcoins from the FBI in 2013.\n\nRoger Ver is another well-known Bitcoin whale. Popularly known as ‘Bitcoin Jesus”, Ver owns around 335,000 bitcoins. He has invested in various crypto projects, including Ripple, bitcoinstore.com, Kraken, and more, over the course of many years. The multi-millionaire Bitcoin proponent has been interested in the king coin since early 2011, and has even called it one of the most important inventions in the history of humankind.\n\nCorporates’ Largest Bitcoin wallets\n\nOne of the largest centralized crypto exchanges, Coinbase, holds around 2 million bitcoin worth $53 billion as of May 18, 2023. Meanwhile, Brian Armstrong, CEO of Coinbase, owns a 19 percent stake in Coinbase, which technically makes him a big Bitcoin whale as well.\n\nBinance, the world’s largest crypto exchange by volume, is also one of the biggest Bitcoin whales in the market. The Binance wallet holds 248,597 bitcoins, worth over $6 billion at current prices. The same represents almost 1.3 percent of Bitcoin’s circulating supply.\n\nAnalytics software company Microstrategy reportedly holds 140,000 bitcoins, and its CEO Michael J. Saylor, who is also a crypto influencer, revealed in 2021 that he privately held 17,732 bitcoins. The company's Q1 2023 report disclosed a net income of $94 million and additional purchases of 7,500 Bitcoins. The 140,000 Bitcoins it owns were collectively acquired at an average cost of roughly $29,800, as per the Q1 2023 report. Based on current market prices, Microstrategy’s Bitcoin holdings are valued at $3.7 billion.\n\nGovernment Bitcoin Holdings\n\nReportedly, the European country of Bulgaria holds 213,000 bitcoins, which were seized by local authorities from a criminal group in 2017. At the time of the seizure, the value of the bitcoins was around $500. The same is now it is worth over $5 billion. However, what remains unclear is what the country plans on doing with its BTC holdings.\n\nAs of March 25, 2023, the US government held 205,515 confiscated bitcoins worth $5.6 billion, which is about 1.06 percent of the coin’s circulating supply. Glassnode on-chain data revealed that on March 9, about 9,860 bitcoins were sent to Coinbase addresses. The US government’s bitcoin stockpile accumulated through various seizures, including the Silk Road bitcoin seizure in 2020, the Bitfinex hack, and the James Zhong case related to illicit Silk Road transactions.\n\nCentral American country, El Salvador, made history in September 2021 by becoming the first country in the world to adopt Bitcoin as legal tender. The country has known to purchase Bitcoin at regular intervals, even during market dips. As of June 2022, El Salvador's President Nayib Bukele announced via a tweet that the country currently holds around 2,301 bitcoins. At current market prices, these BTC’s are worth around $61.6 million.\n\nConclusion\n\nWhile the US government’s confiscated bitcoin holding may not of much importance here since it is auctioned away, the accumulation of massive amounts of bitcoins by individuals and companies demonstrates the growing popularity of the digital asset.\n\nHowever, it is important to note that when bitcoin is concentrated in one address and crypto whales continue to increase, it can create disparity in the market. Critics argue that these large crypto wallets control other players, giving them a disproportionate amount of influence and leaving other participants with less control over the market.\n\nUntil a comprehensive assessment is released, whether Bitcoin whales are a blessing or a burden to the industry is essentially a matter of personal choice."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZGVjcnlwdC5jby8xNDA2NTcvamFjay1kb3JzZXktbGVhZHMtNi1taWxsaW9uLXJhaXNlLWJpdGNvaW4tcGF5bWVudHMtY29tcGFueS1henRlY2_SAWFodHRwczovL2RlY3J5cHQuY28vMTQwNjU3L2phY2stZG9yc2V5LWxlYWRzLTYtbWlsbGlvbi1yYWlzZS1iaXRjb2luLXBheW1lbnRzLWNvbXBhbnktYXp0ZWNvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Jack Dorsey Leads $6 Million Raise for Bitcoin Payments Company Azteco - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBlock co-founder and CEO Jack Dorsey—also co-founder and former CEO of Twitter—led a $6 million seed funding round for Bitcoin payments firm Azteco, the startup announced today.\n\nAzteco offers a unique way to buy Bitcoin worldwide with a focus on making it easier for unbanked populations to use the digital money. Users either buy an Azteco voucher online or at a local, brick-and-mortar store, which they can then redeem for Bitcoin. The model works similar to buying a gift card or a mobile phone top-up.\n\nSince users don't have to go through an exchange to purchase Bitcoin in their native currency, this method provides users more flexibility and has come to be known in Bitcoin circles as a project with the potential to help bank the unbanked.\n\nAD\n\nAD\n\nDay 17 of redeeming Bitcoin through @Azteco_ for 21 days straight! R1 gets you Bitcoin worth around 178 sats. Successfully redeemed for Bitcoin through the https://t.co/P6FF2gz36Z USSD code. https://t.co/VboqSc6ywu pic.twitter.com/iYBe8tEs3x — kgothatso@8333.mobi (@440UrPp) April 24, 2023\n\nIn a statement, noted Bitcoin investor and enthusiast Dorsey said that he was “honored to support” Azteco as it attempts to help unbanked individuals enter the financial system.\n\n\"The unbanked population is immense. We have the technology and resources to close this gap, but until now, no one has taken that important next step,” Dorsey said. “Azteco is providing so much more than just access to a secure financial system; it is building an ecosystem of financial self-determination that is secure and supported by local communities.”\n\nAlong with Dorsey, investors include Lightning Ventures, Hivemind Ventures, Ride Wave Ventures, Aleka Capital, Visary Capital, Gaingels, and serial entrepreneur Sunil Rajaraman.\n\n\"More than two billion people worldwide lack access to any financial services, facing significant challenges managing, storing, and transferring money and accessing credit,” Azteco founder and CEO Alexander \"Akin\" Fernandez told Decrypt. “These individuals, many living in countries with untrustworthy and volatile economies, need alternative, independent solutions that provide financial inclusion and long-term stability.”\n\nAD\n\nAD\n\nUsers can purchase vouchers in 195 countries. Azteco plans to use the fresh funding to flesh out its product and expand its offerings in Latin America and Europe.\n\nSome users have also described the potential of \"no KYC\" Bitcoin, where users don't have to provide identifying “know your customer” information in order to buy Bitcoin. Since only small amounts of Bitcoin can be purchased with Azteco, governmental KYC laws do not apply in those jurisdictions that the company operates in.\n\n“Azteco is bringing vouchers for small amounts of Bitcoin to the masses who need it most,” Fernandez said. “As an alternative to traditional currencies and bank accounts, Bitcoin enables financial self-determination, putting people in control of their finances with privacy and security.”\n\nEditor's Note: This story has been updated to correct the attribution of Azteco founder and CEO Alexander \"Akin\" Fernandez's comments."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGFpbHljb2luLmNvbS9iaXRjb2luLW5ldHdvcmstdXNhZ2UtZHJvcHMtYnV0LXRoYXQtbWF5LW5vdC1iZS1hLWJhZC10aGluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Bitcoin Network Usage Drops, But That May Not Be a Bad Thing - DailyCoin",
        "content": "Daily unique transactions on the Bitcoin network have seen a significant drop.\n\nDespite this fall, the reduction could provide an impetus for development.\n\nThe Lightning Network promises to solve Bitcoin’s scaling problems.\n\nScalability issues remain the bane of most major blockchain networks, most recently, Bitcoin. The biggest crypto has seen a drop in network usage as it continues to struggle with network congestion.\n\nOn Thursday, May 18, the number of unique addresses performing transactions daily dropped to less than 800k. This marks a 22-month low for Bitcoin, the lowest level since July 2022.\n\nHowever, this drop might not necessarily signal the decline of Bitcoin’s utility. As scaling solutions increase in popularity, Bitcoin’s Network could naturally see a drop in activity.\n\nLightning Could Ease Bitcoin’s Congestion Issues\n\nThe drop in unique daily transactions doesn’t account for transactions via the Lightning Network, Bitcoin’s Layer-2. For some, this scaling solution holds the keys to making Bitcoin transactions faster and cheaper.\n\nWith the growing popularity of scaling solutions, Bitcoin’s congestion issues could be relieved. This would, however, likely result in a natural decrease in the base layer’s transaction activity as more users migrate to second-layer solutions.\n\nStill, the recent drop in transactions on the Bitcoin network has not been accompanied by a corresponding activity on the Lightning Network. This indicates that, despite its advantages, Lightning Network still has hurdles before it can reach mass adoption.\n\nFor instance, technical challenges, such as routing issues and channel capacity constraints, have been a sticking point for some users. Furthermore, setting up a Lightning node can be daunting for non-technical users, posing another barrier to widespread adoption.\n\nBitcoin Struggling With Ordinals\n\nThis sudden decrease in unique transactions is likely due to the rise of ordinals. These inscriptions, Bitcoin’s answer to Non-Fungible Tokens (NFTs), are becoming increasingly popular. However, their popularity comes at a price, helping escalate the network’s gas fees.\n\nAs gas prices continue to climb, more and more users start avoiding transactions that are not necessary. This is likely the reason behind the noticeable reduction in overall network activity.\n\nOn the Flipside\n\nIn May, Litecoin hit a record amount of transactions thanks to rising fees and congestion on the Bitcoin network.\n\nThe Bitcoin community is not in agreement with how to deal with ordinals. In May, one core developer’s suggestion to ban ordinals started a civil war in the community.\n\nWhy This Matters\n\nBitcoin’s scaling issues could significantly impact the dominant crypto in the future. As the community tackles the scaling issues, it is crucial to understand how they impact the network.\n\nRead more about how Lightning can tackle the ordinals issue:\n\nHow Lightning Network’s Taproot Upgrade Solves BRC-20 Issues\n\nRead about the latest trends in the retail use of DeFi:\n\nUniswap Survey Uncovers DeFi Barriers, but Users Keen to Experiment"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vbmV3cy5za3kuY29tL3N0b3J5L2NyeXB0by10cmFkaW5nLXNob3VsZC1iZS10cmVhdGVkLWxpa2UtYS10eXBlLW9mLWdhbWJsaW5nLWluZmx1ZW50aWFsLW1wcy1zYXktMTI4ODIxODfSAXRodHRwczovL25ld3Muc2t5LmNvbS9zdG9yeS9hbXAvY3J5cHRvLXRyYWRpbmctc2hvdWxkLWJlLXRyZWF0ZWQtbGlrZS1hLXR5cGUtb2YtZ2FtYmxpbmctaW5mbHVlbnRpYWwtbXBzLXNheS0xMjg4MjE4Nw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Crypto trading should be treated like a type of gambling, influential MPs say - Sky News",
        "content": "An influential panel of MPs has called on the government to regulate consumer crypto trading and speculation as a type of gambling.\n\nThe cross-party Treasury Committee claimed digital currencies such as Bitcoin and Ether have \"no intrinsic value and no useful social purpose\" - and as well as consuming large amounts of energy, they are often used by criminals for scams.\n\nIt comes after the government announced proposals in February to regulate the crypto industry by bringing it under financial services law.\n\nBut MPs said a better approach would be to recognise how speculation in unbacked cryptoassets - like Bitcoin - \"more closely resembles gambling than a financial service\".\n\nIt recommended that safeguarding rules which oversee the likes of lotteries, betting firms and casinos should apply instead.\n\nAround 10% of UK adults have speculated in cryptoassets, according to HM Revenue and Customs.\n\nThe committee's new report warned digital currencies are a \"significant risk\" due to \"huge\" price volatility, with the potential for customers to lose everything they invest.\n\nIt said there was evidence that addictions to cryptocurrency speculation were on the rise - and warned there are limited controls currently in place to protect vulnerable consumers.\n\nMPs said they were concerned that bringing the industry under financial service regulation \"will create a 'halo' effect that leads consumers to believe that this activity is safer than it is, or protected when it is not\".\n\nAdvertisement\n\n\"We therefore strongly recommend that the government regulates retail trading and investment activity in unbacked cryptoassets as gambling rather than as a financial service, consistent with its stated principle of 'same risk, same regulatory outcome,'\" the report added.\n\nPlease use Chrome browser for a more accessible video player 1:14 What is the main aim of cryptocurrency?\n\nA 'Wild West' industry\n\nIt comes after a 2018 report by the committee described the cryptocurrency industry as a \"Wild West\" - with MPs saying nothing in their subsequent enquiries had moved them to alter that verdict.\n\nFollowing the new report, committee chair, Conservative MP Harriett Baldwin, said: \"Effective regulation is clearly needed to protect consumers from harm, as well as to support productive innovation in the UK's financial services industry.\n\n\"However, with no intrinsic value, huge price volatility and no discernible social good, consumer trading of cryptocurrencies like Bitcoin more closely resembles gambling than a financial service, and should be regulated as such.\"\n\nThe MPs said they still felt there was potential in the technology - such as by improving the efficiency and costs of making payments - and advised the government to take a \"balanced approach\" in supporting innovation.\n\nThe committee added it was separately considering the potential role of digital currencies backed by central banks.\n\nMeanwhile its report also criticised the government's attempt in April 2022 to launch a non-fungible token (NFT) - a type of cryptocurrency asset - through the Royal Mint. The plan was dropped earlier this year following a review.\n\nMPs said the government \"should seek to avoid expending public resources on supporting cryptoasset activities without a clear, beneficial use case\".\n\nPlease use Chrome browser for a more accessible video player 5:26 Is the crypto crisis over?\n\nCrypto 'offers opportunities'\n\nIt comes as the government considers responses to a consultation into its regulation proposals.\n\nA Treasury spokesperson indicated ministers would likely reject the committee's recommendation.\n\nThey told Sky News: \"Risks posed by crypto are typical of those that exist in traditional financial services and it's financial services regulation - rather than gambling regulation - that has the track record in mitigating them.\n\n\"Crypto offers opportunities but we are taking an agile approach to robustly regulating the market, addressing the most pressing risks first in a way that promotes innovation.\"\n\nBe the first to get Breaking News Install the Sky News app for free\n\nThe report comes amid growing pressure on governments around the world to better regulate the industry, heightened by the sudden bankruptcy of crypto platform FTX in November.\n\nSome 80,000 UK-based customers were impacted by the collapse, and one British investor was left with a £1m hole in his finances.\n\nThe European Union this week approved tougher cryptoasset rules - including new powers to ban exchanges that fail to protect consumers.\n\nThe International Organisation of Securities Commissions (IOSCO), whose members include regulators in the US and UK, said it will also soon announce proposals for the first ever set of global rules covering crypto trading."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDUvMTcvYnVsbGlzaC1zZW50aW1lbnRzLXN1cnJvdW5kLWJpdGNvaW5zLXBvdGVudGlhbC1zdXJnZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 17 May 2023 07:00:00 GMT",
        "title": "Bullish Sentiments Surround Bitcoin's Potential Surge - Crypto Times",
        "content": "Bitcoin (BTC) is garnering attention from top crypto analysts who are expressing bullish sentiments and predicting a potential parabolic surge for the cryptocurrency.\n\nRenowned crypto strategist Michaël van de Poppe, followed by over 656,700 Twitter users, is observing positive signs for Bitcoin on the weekly chart. Despite a retreat from the significant psychological resistance at $30,000, Bitcoin continues to trade above two critical technical indicators on the weekly timeframe. Van de Poppe believes that the digital asset’s upward momentum will persist, leading it towards the price range of $38,000 to $42,000.\n\n#Bitcoin breaks upwards and tests $27,600.\n\n\n\nGood signs.\n\n\n\nWeekly timeframe; Holding 200 MA and EMA.\n\n\n\nI think we're continuing towards $38,000-42,000 from here. pic.twitter.com/gduHkOFUHu — Michaël van de Poppe (@CryptoMichNL) May 15, 2023\n\nAnother respected crypto analyst, Kaleo, who has a Twitter following of 587,400, shares the bullish sentiment. Kaleo suggests that Bitcoin’s recent reclaiming of support around $27,000 sets the stage for a potential rally to fresh yearly highs. The analyst sees this as a promising risk/reward long setup, with a target of $40,000, which still holds a magnetic appeal.\n\n#Bitcoin / $BTC\n\n\n\nI’m a fan of this breakdown / reclaim. See this a pretty solid r/r long setup for a potential move back to range highs.\n\n\n\nAnd yes, $40K is still a magnet. pic.twitter.com/kNc7r3DuDv — K A L E O (@CryptoKaleo) May 15, 2023\n\nAdding to the positive sentiment is pseudonymous trader Bluntz, known for accurately predicting the 2018 Bitcoin bottom. Bluntz believes that Bitcoin’s corrective move from $30,000 has likely concluded and anticipates a resumption of the cryptocurrency’s upward trend. Noting the emergence of favorable follow-through candles on the daily chart, Bluntz suggests that new all-time highs may be within reach if the recent three-wave ABC correction is indeed complete. The sentiment in the market has shifted, with many now expecting further upside instead of anticipating more downside.\n\nstarting to get some nice follow through candles on daily for #btc after fridays reversal.\n\n\n\nif this was a 3 wave abc down complete then new highs are potentially on the table.\n\n\n\nsentiment does seem to have flipped down here with many expecting further downside now pic.twitter.com/gAOZuFJ9ha — Bluntz (@Bluntz_Capital) May 15, 2023\n\nWith multiple prominent analysts expressing optimism for Bitcoin’s future trajectory, market participants and observers are closely monitoring the cryptocurrency’s price movements. The possibility of a parabolic surge in Bitcoin remains an exciting prospect as the crypto market continues to evolve and captivate the attention of investors worldwide."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC1yZW5kZXIvcG9zdC8yMzEzNzfSAUZodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yMzEzNzcvcGVwZS1iaXRjb2luLW1pYW1pLXBpY2Fzc28tYXJ0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "Pepe the frog takes over Bitcoin 2023 with Picasso-inspired mural - The Block",
        "content": "What a difference a year makes. Last year, when Bitcoin was over $40,000, a giant metal bull greeted visitors to the annual Bitcoin conference in Miami, proclaiming that the “future of finance” had arrived. A year later, and well into a fresh crypto winter, Pepe seems to have taken over.\n\nIn the first day of the three-day event, the mood was somewhat subdued as crowds trickled in to hear panel discussions such as “The Fed vs. The Financial System,” “Fighting the Anti-Crypto Army” and “Bitcoin & The Banking Crisis.” The mood was serious, yet hopeful. But the real star of the show was Pepe, whose omnipresence coincides with the memecoin that caused a frenzy when it hit the market in mid-April.\n\nOff to the side of the large expo hall at the conference, an art gallery featured both physical and digital art, some of which could be purchased in an ongoing auction using bitcoin.\n\nThe show stopper is a massive, 21-panel mural that pays meme homage to Picasso’s Guernica, the famed 1937 oil painting that became a symbol of the Spanish Civil War. Dubbed Pepernica, the painting by artist Luis Simo is over 11 feet tall and 25 feet long. The current bid is 5.5 millions sats, or nearly $1,500.\n\nSimo, a 27-year-old visual artist based in Valencia, Spain, said the mural took him about a month and a half to paint. He said he first had the idea after attending the Bitcoin conference last year and had been inspired by the subsequent crypto market crash and the war in Ukraine.\n\n\"Memes are a reoccurring part of the art world,\" he said in an interview. \"If you go to museums and galleries in the U.S. and Europe, you'll easily see memes. But to introduce memes from Crypto Twitter into physical art and installations, that's just getting started.\"\n\n\"It would be great if it goes to someone with the space to exhibit it,\" Simo continued, adding that he thought a hotel would be the perfect place for the work. He plans to keep the bitcoin he receives from the sale.\n\nAnother work by Simo called “Las Pepinas” is an original oil painting that memes Diego Velázquez’s Las Meninas (The Ladies-in-Waiting). Winners of the works will also receive NFTs minted on Counterparty.\n\nLas Pepinas\n\nOther Pepe-themed works at the show included Pepe-ized pop art “Plans for the Dollar” and \"Oswald’s Diary.\" The Indipepe series by artist JB is a memed derivative of Robert Indiana's famous \"LOVE\" work that “seamlessly integrates the iconic Pepe the Frog into the annals of art history.”\n\nTo bid on the art, you have to deposit 1% of your bid as collateral, or 0.02 BTC for unlimited bids.\n\nPepe as Love\n\nThe gallery was not without digital art, and an “Ordinals Alley” displayed some of the earliest and most prominent Bitcoin Ordinals that have taken the sector by storm. Pepe was also there.\n\nPepe shoes\n\nArt wasn’t the only thing for sale, with the event also featuring a peer-to-peer Bitcoin Bazaar where you could buy Bitcoin related items.\n\n(Updates with comment from artist in fifth paragraph.)"
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LnRla2VkaWEuY29tL2hvdy1iaXRjb2luLXBpenphLWNhbWUtaW50by1leGlzdGVuY2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 18 May 2023 07:00:00 GMT",
        "title": "How Bitcoin Pizza Came into Existence - Tekedia",
        "content": "Bitcoin is a revolutionary digital currency that has changed the way people transact and store value. But do you know how it all started? One of the most iconic events in Bitcoin’s history is the Bitcoin Pizza Day, which marks the first time someone used Bitcoin to buy a real-world good.\n\nBitcoin Pizza Day is a reminder of how far Bitcoin has come from its humble beginnings to its current status as a global phenomenon. It is also a celebration of the innovation and creativity of the Bitcoin community, which continues to push the boundaries of what is possible with this technology.\n\nThe story goes back to May 22, 2010, when a Florida programmer named Laszlo Hanyecz posted on a Bitcoin forum that he was willing to pay 10,000 bitcoins for two pizzas delivered to his house. He wrote: “I’ll pay 10,000 bitcoins for a couple of pizzas… like maybe 2 large ones so I have some left over for the next day. I like having left over pizza to nibble on later.”\n\nAt that time, Bitcoin was still a new and obscure technology, with no established market value or widespread adoption. Hanyecz had mined some bitcoins on his computer, but he had no idea what to do with them. He thought it would be cool to exchange them for something tangible, like food.\n\nLuckily, someone took up his offer and agreed to order two pizzas from Papa John’s and deliver them to Hanyecz in exchange for 10,000 bitcoins. The pizzas cost about $30, which means Hanyecz paid around $0.003 per bitcoin. The person who accepted the deal was a British man named Jeremy Sturdivant, who went by the nickname “jercos” on the forum.\n\nThe transaction was completed and Hanyecz posted a picture of the pizzas on the forum, confirming that he had received them. He wrote: “I just want to report that I successfully traded 10,000 bitcoins for pizza. Thanks jercos!”\n\nThe event was recorded on the Bitcoin blockchain as transaction hash ID a1075db55d416d3ca199f55b6084e2115b9345e16c5cf302fc80e9d5fbf5d48d.\n\nLittle did Hanyecz know that his pizza order would go down in history as the first documented case of Bitcoin being used to purchase a physical good. The day of the transaction, May 22, is now celebrated as Bitcoin Pizza Day by the Bitcoin community around the world.\n\nThe significance of Bitcoin Pizza Day is not only that it demonstrated the potential of Bitcoin as a medium of exchange, but also that it showed how much Bitcoin has appreciated in value over time. The 10,000 bitcoins that Hanyecz spent on the pizzas are now worth over $200 million at the current market price of around $20,000 per bitcoin.\n\nThe value of the 10,000 bitcoins used in the transaction has also skyrocketed over time, reaching hundreds of millions of dollars at current prices. This makes the pizzas arguably the most expensive ones ever bought in history. However, Hanyecz does not regret his decision and has said that he enjoyed the pizzas and was happy to be part of the early days of bitcoin.\n\nThat means Hanyecz paid about $10 million per pizza, making them the most expensive pizzas ever bought. Of course, Hanyecz did not regret his decision, as he later said: “It wasn’t like Bitcoins had any value back then, so the idea of trading them for a pizza was incredibly cool.”\n\nThe bitcoin pizza transaction has become part of the folklore of cryptocurrency and is celebrated every year on May 22 as Bitcoin Pizza Day. On this day, bitcoin enthusiasts around the world commemorate the event by buying goods (often pizza) with bitcoin or other cryptocurrencies. Some also use the occasion to reflect on how far bitcoin has come since its inception and how much potential it still has.\n\nThe bitcoin pizza transaction may seem trivial today, but it was a milestone in the history of cryptocurrency. It demonstrated that bitcoin could be used as a medium of exchange for goods and services, not just as a store of value or a speculative asset. It also showed that bitcoin could facilitate cross-border transactions without intermediaries or fees. Moreover, it inspired other people to experiment with using bitcoin for everyday purchases and created a sense of community among early adopters.\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    }
]