[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMDUvYml0Y29pbi1kcm9wcy1iZWxvdy0yNjAwMC1hZnRlci1zZWMtc3Vlcy1jcnlwdG8tZXhjaGFuZ2UtYmluYW5jZS5odG1s0gFpaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDYvMDUvYml0Y29pbi1kcm9wcy1iZWxvdy0yNjAwMC1hZnRlci1zZWMtc3Vlcy1jcnlwdG8tZXhjaGFuZ2UtYmluYW5jZS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin drops below $26,000 after SEC sues crypto exchange Binance - CNBC",
        "content": "A worsening macroeconomic climate and the collapse of industry giants such as FTX and Terra have weighed on bitcoin's price this year.\n\nCryptocurrency prices dropped Monday after the U.S. Securities and Exchange Commission charged Binance, the largest crypto exchange in the world, with violating securities laws.\n\nBitcoin fell 5.5% to $25,662.50, its lowest level since March, according to Coin Metrics.\n\nEther slid 5.1% to $1,807.79. Binance Coin , a token used to pay transaction and trading fees on the Binance exchange, tumbled 9.5%.\n\nThe declines came after the SEC alleged Binance and its co-founder, Changpeng Zhao, comingled billions of dollars of investor funds with their own and violated securities laws. The complaint follows a similar one against Binance from the Commodity Futures Trading Commission earlier this year.\n\n\"Binance is the largest cryptocurrency exchange by trading volume so it's no surprise that the market is responding the way it is to the news,\" Sam Callahan, lead analyst at bitcoin services company Swan Bitcoin, told CNBC. \"Any regulatory action against a major player in the cryptocurrency space creates uncertainty and leads to increased market volatility in the short term.\"\n\n\"However, such volatility is often temporary, and prices may recover once the market absorbs the news,\" he added. \"Long term this can be seen as a healthy development for the ecosystem as bad actors are cleansed out, and capital flows out of cryptocurrencies with significant regulatory risk and into bitcoin.\"\n\nThe suit is the latest development in this year's crackdown on the crypto industry by U.S. regulators. Since January, the SEC has charged Kraken, Genesis and Gemini Trust with offering unregistered securities to investors and has warned Coinbase of potential securities charges.\n\nBitcoin last week capped its worst month of trading since November, finishing May down 7.9% after trading in a narrow range of between $26,000 and $28,000. Technical analysts see $25,200 as the key level to watch for bitcoin on the downside."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMDUvYml0Y29pbi1yZXRhaWwtZGVtYW5kLXRvLXJlbWFpbi1zdHJvbmctYWhlYWQtb2YtaGFsdmluZy1ldmVudC1qcG1vcmdhbi_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzA1L2JpdGNvaW4tcmV0YWlsLWRlbWFuZC10by1yZW1haW4tc3Ryb25nLWFoZWFkLW9mLWhhbHZpbmctZXZlbnQtanBtb3JnYW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Retail Demand to Remain Strong Ahead of Halving Event: JPMorgan - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMDUvYml0Y29pbi1ldGhlci1ibmItYW5kLW90aGVyLXRva2Vucy10YW5rLWFmdGVyLXNlYy1zdWVzLWJpbmFuY2UtYW5kLWNoYW5ncGVuZy16aGFvL9IBfGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMDUvYml0Y29pbi1ldGhlci1ibmItYW5kLW90aGVyLXRva2Vucy10YW5rLWFmdGVyLXNlYy1zdWVzLWJpbmFuY2UtYW5kLWNoYW5ncGVuZy16aGFvL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether, BNB, and other tokens tank after SEC sues Binance and Changpeng Zhao - Fortune",
        "content": "Bitcoin was down approximately 4%, Ether about 4.5%, and Binance’s token, BNB, dropped approximately 8% in the first hour after the Securities and Exchange Commission sued top crypto exchange Binance and Changpeng Zhao, its founder and CEO, in a 136-page court filing.\n\nThe precipitous decreases in the largest cryptocurrencies by market capitalization mirrors the downswing of the broader market, as the total market capitalization for all cryptocurrencies dropped approximately 4.5% in the first hour after the suit, according to CoinMarketCap.\n\nAt time of publication, some cryptocurrency prices started to bounce back—Bitcoin was hovering around $25,800 after dipping below $25,500—but the effects of the SEC’s lawsuit indicate Binance’s outsize influence. The exchange did more than 10 times the volume of Coinbase, for example, in the past 24 hours, but saw $69 million in trading outflow after news of the SEC’s lawsuit broke, per CoinDesk. Shares of Coinbase, the largest U.S. exchange, were down double digits.\n\nThe Commodity Futures and Trading Commission had previously sued Binance and Zhao in a separate case in March, alleging that the exchange knew it was “violating CFTC rules.” Prices for some of the top cryptocurrencies similarly dropped after the suit became public.\n\nThe SEC’s lawsuit against Binance alleges similar findings, filing 13 charges against the exchange and Zhao, alleging an “extensive web of deception” and “blatant disregard of the federal securities laws and the investor and market protections these laws provide.”\n\n“While we take the SEC’s allegations seriously, they should not be the subject of an SEC enforcement action, let alone on an emergency basis. We intend to defend our platform vigorously,” Binance said in a blog post on Monday. “Unfortunately, the SEC’s refusal to productively engage with us is just another example of the commission’s misguided and conscious refusal to provide much-needed clarity and guidance to the digital asset industry.”"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8zMWstd2FzLW5vdC10aGUtZW5kLTUtdGhpbmdzLXRvLWtub3ctaW4tYml0Y29pbi10aGlzLXdlZWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "'$31K was not the end' — 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) starts the second week of June in familiar territory, but a breakout is coming, investors say.\n\nAfter a calm weekly close, BTC/USD is firmly in its established trading range, while under the hood, market participants are preparing for some dramatic shifts.\n\nIt has been a long time coming, and for seasoned traders, the signs are increasingly pointing to volatility making a comeback.\n\nThere is little by way of macroeconomic triggers due this week, making the focus shift elsewhere for cues as to what BTC price action might do in the short term.\n\nThe on-chain analysis provides other interesting insights, reinforcing the idea that for Bitcoin currently, the only “boring” part is the spot price.\n\nCointelegraph looks at the key factors at play as BTC/USD hovers around $27,000 for another week.\n\nWeekly close preserves key trend line\n\nBTC/USD may not have inspired with its latest weekly close, but some popular traders are seeing new grounds for optimism.\n\nDespite remaining firmly in its narrow trading range, as confirmed by Cointelegraph Markets Pro and TradingView, the chances of a breakout toward $30,000 are increasing.\n\nBTC/USD 1-day candle chart on Bitstamp. Source: TradingView\n\n“Feels like it’s a matter of time until Bitcoin finally breaks that 30k level once and for all,” trader Jelle wrote in part of his latest analysis.\n\nJelle, like others, noted that the 200-week moving average (MA) — a key support line — remained intact.\n\nBTC/USD annotated chart. Source: Jelle/ Twitter\n\nAlso intact were various support structures on trader and analyst Rekt Capital’s radar covering daily timeframes.\n\n“So far, so good,” he summarized, about an exit higher, potentially invalidating a bearish “head-and-shoulders” structure from the previous weeks.\n\n#BTC successfully retesting not just the top of the red downtrending channel but also the bottom of the red box\n\n\n\nSo far, so good$BTC #Crypto #bitcoin https://t.co/a0VCL61Qvm pic.twitter.com/V7SnIMlpJZ — Rekt Capital (@rektcapital) June 4, 2023\n\nAn additional tweet mentioned a “successful retest” of support in the offing.\n\n“BTC broke down from a head and shoulders pattern in May. But there’s classic whipsaw action around the neckline,” trading account Game of Trades nonetheless acknowledged.\n\n“The pattern remains valid unless the price moves above the right shoulder.”\n\nAn accompanying chart gave a potential downside target of just $24,000 for BTC/USD due to the head-and-shoulders pattern.\n\nOthers looked for less movement, such as trader Crypto Tony, who eyed $25,300 as a possible destination, subject to $28,350 staying unflipped as resistance.\n\n$BTC / $USD - June / July plan\n\n\n\nSo right now we are consolidating following the drop from the 14th April high. I am looking for\n\n\n\n- $25,300 target to look for longs\n\n- Must remain below $28,350 for the downside target\n\n- Combo corrective pattern\n\n\n\nI will update daily as always pic.twitter.com/Q93mr4hjGH — Crypto Tony (@CryptoTony__) June 4, 2023\n\nMacro lull comes as traders eye dollar rebound\n\nIn an unusual week of calm for traders, June 5–9 will see little by way of macroeconomic data coming out of the United States.\n\nWith the debt ceiling debacle left behind, the next potential volatility catalysts will come in the form of macro reports for May, such as the Consumer Price Index (CPI) print; however, these are not due for another week.\n\nWith that, attention is focusing on oil production cuts from Opec+ members as prices continue to fall despite existing reductions in output.\n\nU.S. Dollar Index 1-day candle chart. Source: TradingView\n\nMeanwhile, a more direct potential headwind for Bitcoin and crypto comes in the form of the U.S. dollar.\n\nThe strength of the greenback has been forming a rebound since the start of May, and since then, the U.S. Dollar Index (DXY) — traditionally inversely correlated with risk assets — has gained around 3.5%.\n\nPopular analyst Matthew Hyland noted increasing relative strength index (RSI) scores for DXY on weekly timeframes.\n\nFellow trader Skew flagged 104.7%, the current June high, as a critical level to close above to form a bullish DXY trend.\n\n“Strong close & moving higher in early EU trading session,” he commented on the day.\n\n“If USD closes above $104.7, I would consider that as USD strength. So far this looks risk off but we see later on.”\n\n$DXY 1D\n\nStrong close & moving higher in early EU trading session.\n\n\n\nif USD closes above $104.7, I would consider that as USD strength.\n\n\n\nSo far this looks risk off but we see later on. https://t.co/F28baIv2JV pic.twitter.com/3SLDs5wtos — Skew Δ (@52kskew) June 5, 2023\n\nOver the weekend, meanwhile, TraderSZ described DXY as “bullish until proven otherwise.”\n\nStocks buoy bullish crypto case\n\nThe debt ceiling resolution had an immediate cathartic effect on equities, but crypto markets have broadly failed to copy their enthusiasm.\n\nThis may still change, market participants argue, as the S&P 500 hits 10-month highs.\n\n“The US House has passed a key debt ceiling deal, launching the #SP500 to its highest price since August. Altcoins like $LTC, $LEO, and $FGC have jumped today,” research firm Santiment wrote on June 2.\n\n“With crypto lagging behind equities, there could be some $BTC catch-up time coming soon.”\n\nCrypto vs. macro comparison. Source: Santiment/ Twitter\n\nAn accompanying chart also tracked a “rebound” for gold, this nonetheless short-lived, with a retracement setting in to mark the new week.\n\nAs Cointelegraph reported, others were also eyeing a positive correlation between Bitcoin and a resurgent S&P 500.\n\nBitcoin hodlers comfortably in profit\n\n“It’s easy to ‘feel’ that the Bitcoin rally is over, but the facts say it’s not,” popular technical analyst CryptoCon wrote in findings last month.\n\nAt the time, BTC/USD was almost $1,000 higher than current levels, but enthusiasm was just as lacking.\n\nCryptoCon was analyzing the state of Bitcoin holder profitability, using the net unrealized profit/loss (NUPL) metric created in 2019 by entrepreneur and analyst Tuur Demeester and others.\n\nFor the past several months, NUPL has stayed practically stationary around a value of 0.25, indicating that overall, the BTC supply is modestly “in the black.”\n\nNUPL measures the difference between unrealized profit and unrealized loss. It is calculated by gathering unspent transaction outputs (UTXOs) and comparing how much coins are worth now with when they last moved on-chain.\n\n“Any value above zero indicates that the network is in a state of net profit, while values below zero indicate a state of net loss. In general, the further NUPL deviates from zero, the closer the market trends towards tops and bottoms,” analytics firm Glassnode explained in an introduction.\n\nWhile calm in recent months, NUPL has delivered an uptrend retest, which is cause for confidence, CryptoCon now says.\n\n“31k was not the end, hope you’re ready!” he concluded in an update this weekend.\n\nAn accompanying chart of NUPL showed its behavior versus investor sentiment at various stages over the past 10 years.\n\n#Bitcoin has seen a lot of sideways price action recently, but during that time two very important things have happened on the NUPL:\n\n\n\n- Retest of trend\n\n- Support made on Hope / Fear sector\n\n\n\nThe next step, a leap to the belief/denial range\n\n\n\n31k was not the end, hope you're ready! pic.twitter.com/yi1GMO1hri — CryptoCon (@CryptoCon_) June 4, 2023\n\nLargest Bitcoin whales at center of “dichotomy”\n\nOn the topic of investor sentiment, the current view of the market varies heavily between classes of hodlers.\n\nRelated: Bitcoin ‘big move’ due in July after March $30K push — Latest analysis\n\nAs noted by Glassnode, most remain risk-off on Bitcoin; since May, selling has dominated despite the lack of capitulatory events.\n\nThe one exception, it appears, is the largest class of Bitcoin “whales.”\n\nUploading a chart of accumulation versus distribution adjusted by cohort, Glassnode showed that wallets holding at least 10,000 BTC are adding to their positions while everyone else is reducing exposure.\n\n“An interesting dichotomy across the Bitcoin Accumulation Trend Score persists, as the largest of Whales (>10K BTC) continue to aggressively accumulate, whilst all other major cohorts experience heavy distribution,” researchers commented.\n\nThe last accumulation phase from these “mega whales” was in late 2022, with BTC/USD beginning its 2023 rebound weeks later.\n\nThe whales then paused in mid-January, entering a distribution phase of their own before flipping back to accumulation in May.\n\nBitcoin trend accumulation score by cohort chart. Source: Glassnode/ Twitter\n\nMagazine: Home loans using crypto as collateral: Do the risks outweigh the reward?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMDUvZmlyc3QtbW92ZXItYW1lcmljYXMtaXMtYml0Y29pbi1oZWFkaW5nLWJlbG93LTI2ay_SAWJodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzA1L2ZpcnN0LW1vdmVyLWFtZXJpY2FzLWlzLWJpdGNvaW4taGVhZGluZy1iZWxvdy0yNmsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "First Mover Americas: Is Bitcoin Heading Below $26K? - CoinDesk",
        "content": "The appointment of Richard Teng to oversee Binance’s regional markets outside the U.S. has positioned the one-time Abu Dhabi regulator as the most likely successor to Changpeng Zhao, who founded the world’s largest crypto exchange in 2017. The enhanced role follows a report last month that Zhao, commonly known as CZ, is looking to reduce his ownership of Binance.US, the firm's American arm – a move that's seen as something of an appeasement to U.S. regulators. Teng's knowledge and experience as a regulator will come to bear in his new role overseeing Asia, Europe, the Middle East and North Africa as the exchange, often targeted by authorities, attempts to draw a line under mounting enforcement actions related to conduct during crypto’s early years. Prior to heading up the Financial Services Regulatory Authority at Abu Dhabi Global Market, Teng was chief regulatory officer of Singapore Exchange (SGX) and spent 13 years with the Monetary Authority of Singapore. In an interview with CoinDesk, Teng sidestepped the idea that he’s being groomed to take the reins from the 46-year-old CEO."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wNi8wNC9qYWNrLWRvcnNleS1lbmRvcnNlcy1iaXRjb2luLWFkdm9jYXRlLXJvYmVydC1mLWtlbm5lZHktanItZm9yLXByZXNpZGVudC1wcmVkaWN0cy13aW4v0gF4aHR0cHM6Ly9mb3J0dW5lLmNvbS8yMDIzLzA2LzA0L2phY2stZG9yc2V5LWVuZG9yc2VzLWJpdGNvaW4tYWR2b2NhdGUtcm9iZXJ0LWYta2VubmVkeS1qci1mb3ItcHJlc2lkZW50LXByZWRpY3RzLXdpbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Jun 2023 07:00:00 GMT",
        "title": "Jack Dorsey endorses fellow Bitcoin advocate Robert F. Kennedy, Jr. for president—and predicts he’ll win - Fortune",
        "content": "Jack Dorsey, Twitter’s cofounder and former CEO, has endorsed Democratic presidential contender Robert F. Kennedy, Jr.\n\nOn Sunday, the influential tech billionaire tweeted a Fox News YouTube video entitled “Robert F. Kennedy, Jr. argues he can beat Trump and DeSantis in 2024” writing, “He can and will.”\n\nAsked whether he was endorsing or predicting, he replied, “Both.”\n\nKennedy, a nephew of President John F. Kennedy and the son of his slain brother Robert F. Kennedy, is like Dorsey a strong believer in Bitcoin, which he recently described as an “exercise in democracy.”\n\nLast month, Kennedy delivered a well-received keynote address at a Bitcoin conference in Miami. He called Bitcoin a “bulwark” against “government and corporate expansion and intrusion.”\n\n“As president, I will make sure that your right to hold and use Bitcoin is inviolable,” he added.\n\nHe pledged to defend the right of self-custody of Bitcoin and other digital assets. “You should be able to own your own private keys, the same as you own the keys to your car or own your wallet…I don’t think the government has the right to demand access to your Bitcoin key or indeed any of your passwords. To say otherwise to cede essential territory to surveillance state.”\n\nAn anti-vaccine activist, Kennedy frequently and controversially attacked Anthony Fauci, former director of the National Institute of Allergy and Infectious Diseases, over the way he handled the pandemic, accusing him of orchestrating “fascism” and writing a book on the topic.\n\nWhen a Twitter user commented there was “not a chance the DNC [Democratic National Committee] allows him to be nominated,” Dorsey replied, “Even more reason.” He later added that the DNC “seems more irrelevant by the day” and wrote “end of an empire,” to which Tesla CEO and current Twitter owner Elon Musk replied with two fire emoji.\n\nEarlier on Sunday, Musk tweeted that he’ll host Kennedy in the Twitter Spaces audio platform on Monday afternoon. Dorsey replied to that by writing, “Excellent.”\n\nThe event came together quickly, with Musk asking Kennedy Friday on Twitter, “Would you like to do a Spaces discussion with me next week?” Kennedy replied in the affirmative, and Dorsey chimed in, “This would be great.”\n\nTwitter Spaces also figured large in politics last month, when Republican Florida governor Ron DeSantis announced his presidential bid there, although technical glitches marred the event.\n\nOn Friday evening, Musk tweeted, “System is being upgraded & stress-tested in advance of @RobertKennedyJr interview on Monday.”\n\nWhen a Twitter user commented that Kennedy’s shaky voice is “an issue,” Dorsey replied by calling it a “super power,” saying it sets the candidate apart."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzA1L2VsLXNhbHZhZG9ycy12b2xjYW5vLWVuZXJneS1zZWN1cmVzLTFiLWluLWNvbW1pdG1lbnRzLWZvci0yNDEtbXctYml0Y29pbi1taW5lL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzA1L2VsLXNhbHZhZG9ycy12b2xjYW5vLWVuZXJneS1zZWN1cmVzLTFiLWluLWNvbW1pdG1lbnRzLWZvci0yNDEtbXctYml0Y29pbi1taW5lL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "El Salvador's Volcano Energy Secures $1B in Commitments for 241 MW Bitcoin Mine - CoinDesk",
        "content": "Tether has been trying to diversify its \"strategic ecosystem\" and Volcano Energy represents one of \"the most ground-breaking\" initiatives it has backed, said Chief Technology Officer Paolo Ardoino. The stablecoin issuer has been busy on the investment front in the past few weeks, including on bitcoin mining in Uruguay and purchasing bitcoin to add to its reserves backing USDT."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzA1L2ZpcnN0LW1vdmVyLWFzaWEtd2h5LWRpZC1iaXRjb2lucy1wcmljZS1ob2xkLWFib3ZlLTI3ay1vdmVyLXRoZS13ZWVrZW5kLXR3by1hbmFseXN0cy1leHBlY3QtY29udGludWVkLXJlc2lsaWVuY2Uv0gGhAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMDUvZmlyc3QtbW92ZXItYXNpYS13aHktZGlkLWJpdGNvaW5zLXByaWNlLWhvbGQtYWJvdmUtMjdrLW92ZXItdGhlLXdlZWtlbmQtdHdvLWFuYWx5c3RzLWV4cGVjdC1jb250aW51ZWQtcmVzaWxpZW5jZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Jun 2023 07:00:00 GMT",
        "title": "First Mover Asia: Why Did Bitcoin's Price Hold Above $27K Over the Weekend? Two Analysts Expect Continued Resilience - CoinDesk",
        "content": "First Mover Asia: Why Did Bitcoin's Price Hold Above $27K Over the Weekend? Two Analysts Expect Continued Resilience\n\nALSO: The bitcoin options put/call ratio across exchanges has sunk to 0.47, suggesting that fewer investors are seeking downside protection against price declines than they had prior to the passage of a bill to raise the U.S. debt ceiling."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzA2L2ZpcnN0LW1vdmVyLWFzaWEtd2h5LWRpZC1iaXRjb2luLWZhbGwtdG8tMjU0ay1zZWMtbGF3c3VpdC1hZ2FpbnN0LWJpbmFuY2Utcm9ja3MtY3J5cHRvLW1hcmtldHMv0gGPAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMDYvZmlyc3QtbW92ZXItYXNpYS13aHktZGlkLWJpdGNvaW4tZmFsbC10by0yNTRrLXNlYy1sYXdzdWl0LWFnYWluc3QtYmluYW5jZS1yb2Nrcy1jcnlwdG8tbWFya2V0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "First Mover Asia: Why Did Bitcoin Fall to $25.4K? SEC Lawsuit Against Binance Rocks Crypto Markets - CoinDesk",
        "content": "Ether, the second largest crypto in market value, was recently changing hands below $1,800, off more than 5% from Sunday, same time. ETH and other major altcoins followed a similar path as bitcoin did on Monday with the bulk of their declines coming in the immediate hours after the SEC suit. BNB, Binance’s exchange token, and SOL, the native cryptocurrency of the Solana blockchain, recently plunged more than 10%. ADA and MATIC, the tokens of smart contract platforms Cardano and Polygon respectively, and popular meme coin DOGE were recently off more than 8%. Even litecoin, which has been rallying the past few weeks, fell more than 9%. The SEC suit called those tokens unregistered securities."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNi8wNS90aGUtbGlnaHRuaW5nLW5ldHdvcmstZG9lc250LWZpeC1ldmVyeXRoaW5nLXdyb25nLXdpdGgtYml0Y29pbi_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDYvMDUvdGhlLWxpZ2h0bmluZy1uZXR3b3JrLWRvZXNudC1maXgtZXZlcnl0aGluZy13cm9uZy13aXRoLWJpdGNvaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "The Lightning Network Doesn’t Fix Everything Wrong With Bitcoin - CoinDesk",
        "content": "But the idea that Bitcoin can scale to billions isn’t taken for granted these days, and some see it as an outrageous proposition. More people using bitcoin could be a problem. Nobody knows if the Lightning Network will continue to be cheap if transaction fees start to rise."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLXNraWQtYm5iLWRyb3BzLTAwMjMxODAxNC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether skid; BNB drops more than 10% after U.S. securities regulator sues Binance - Yahoo Finance",
        "content": "Bitcoin fell almost 6% and Ether lost 5% in a broad market fall by all top 10 non-stablecoin cryptocurrencies on Tuesday morning in Asia after the U.S. Securities and Exchange Commission (SEC) sued cryptocurrency exchange Binance and its founder Changpeng Zhao on charges of securities violations. The BNB token issued by Binance was the biggest loser with a drop of more than 10% in the past 24 hours.\n\nTop 10 cryptos slide\n\nBitcoin dropped 5.66% over the last 24 hours to US$25,730 at 7:10 a.m. in Hong Kong, bringing losses over the past seven days to 7.23%, according to data from CoinMarketCap.\n\nEther fell 4.91% in the same period to US$1,808, and logged a 4.56% weekly loss.\n\nBNB skidded 10.21% to US$275.17 in the last 24 hours, losing 11.61% over the past week.\n\nThe SEC on Monday filed 13 charges against Binance, alleging the exchange made unregistered and unlawful offers and sales of its BNB and BUSD tokens. The SEC also alleged that Binance did not register Binance.com as an exchange or a broker-dealer clearing agency.\n\nIn response to the SEC lawsuit, Binance said in a Tuesday statement that it intends to defend its platform “vigorously.”\n\n“The SEC’s refusal to productively engage with us is just another example of the Commission’s misguided and conscious refusal to provide much-needed clarity and guidance to the digital asset industry,” Binance said.\n\nCryptocurrencies traded on the Binance exchange, including BNB, BUSD, Solana, Cardano’s ADA, Polygon’s MATIC, are securities and require registration and regulation, according to the SEC suit.\n\nSolana dropped 9.52% over the past 24 hours, with ADA falling 7.73% and MATIC losing 7.64%.\n\n“The total crypto market cap is down,” Justin d’Anethan, head of APAC business development at Belgium-based crypto market maker Keyrock, told Forkast on Tuesday morning in Asia. “The fact that the news doesn’t come as a shock doesn’t mean that it was priced in, apparently.”\n\nIn a Monday tweet, SEC Chair Gary Gensler said that Zhao and Binance entities engaged in “an extensive web of deception, conflicts of interest, lack of disclosure and calculated evasion of the law.”\n\nStory continues\n\nIn response, Zhao tweeted: “Wonder if he ever reads the comments under his post, from the consumers he is [supposed] to protect.”\n\nWonder if he ever reads the comments under his post, from the consumers he is suppose to protect. https://t.co/xQjC872GsD — CZ 🔶 Binance (@cz_binance) June 5, 2023\n\nAccording to d’Anethan, the SEC’s legal action is not a surprise considering the U.S. Commodity Futures Trading Commission had earlier filed a lawsuit against Binance for alleged violations of trading rules for derivatives.\n\nHowever, traders see the lawsuit as extremely bearish and it’s shaking up the market, he said.\n\nThe total cryptocurrency market cap fell 4.6% to US$1.09 trillion in the 24 hours through to 8:30am Hong Kong, while trading volume surged 118% to more than US$48 billion.\n\nApple headset bumps Binance in NFT market\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index edged down 0.17% to 3,295.91 in the 24 hours to 9:20 a.m. in Hong Kong.\n\nThe SEC’s lawsuit against Binance “hasn’t had an impact on NFTs yet, but it likely will,” Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News, said on Tuesday. “It has already impacted crypto, and usually NFTs lag behind just a bit.”\n\nIn the U.S. overnight, Apple Inc. unveiled its highly-anticipated mixed-reality headset Vision Pro. While priced at a hefty US$3,499, the headset has got the NFT industry excited about its potential application in metaverse developments.\n\n“Apple’s headset is really all the NFT spaces was talking about today and rightfully so,” Petscher said. “Really, it’s the single most important thing to happen to NFTs since CryptoPunks, even though Apple didn’t mention NFTs or the metaverse once in their reveal of the Vision Pro.”\n\nSébastien Borget, co-founder and chief operating officer of decentralized gaming giant The Sandbox, said in a Tuesday interview with Forkast that Apple’s headset is “opening a big field of opportunity” for metaverse developments.\n\n“This has the highest chance of becoming a game changer versus everything we’ve seen so far over the past five years in this field … allowing people to interact with their virtual assets in the physical world.”\n\nNFT sales on Ethereum rose 5.64% over the last 24 hours to US$25.75 million, and gained 90.84% in the past week. Sales on the Bitcoin network climbed 4.17% to US$3.16 million, but recorded a 11.87% weekly decline.\n\nBored Ape Yacht Club (BAYC) and Azuki remained the two most-sold Ethereum collections. BAYC had the biggest sales in the past 24 hours of US$7.26 million, followed by Azuki’s US$2.65 million.\n\nDMarket, a Mythos blockchain-based collection of gaming NFTs, was the third most-sold collection over the past 24 hours with an 11.49% rise in sales to US$1.52 million.\n\nCoinbase shares hit by Binance\n\nImage: Coinbase\n\nShares of Coinbase, the largest crypto trading platform in the U.S., dropped 9.05% on Monday following the SEC’s lawsuit against Binance. Shares of MicroStrategy, the world’s largest corporate holder of Bitcoin, fell 8.53%.\n\nU.S. stock futures also moved marginally lower as of 10:00 a.m. in Hong Kong. Dow Jones Industrial Average futures dipped 0.05%, S&P 500 futures fell 0.04%. Nasdaq Futures fell 0.09%.\n\nCoinbase has its own legal battle with the SEC. In March, the SEC alleged Coinbase violated investor protection laws and threatened enforcement action against the exchange. Coinbase argued back in April that the SEC’s move appeared to be undermining its own role as the monitor of companies registering to sell shares to the public.\n\nCoinbase has also requested a court to compel the SEC to publicly respond to the exchange’s July 2022 petition asking for clearer crypto regulation guidelines.\n\nOn the regulation front, Paul Grewal, chief legal officer of Coinbase, tweeted on Monday that he will testify on Tuesday before the House Committee on Agriculture on the need for clear crypto rules and on the Digital Asset Market Structure discussion draft released Friday.\n\n“The US is falling behind,” Grewal tweeted. “We cannot afford to ignore crypto while other markets take advantage of our absence, developing rules and regulations that enable the industry to thrive and risk sending jobs, investment, and technological leadership overseas.”\n\n(Updates with equity section.)"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG8tZXhjaGFuZ2UtbWVyY2Fkby1iaXRjb2luLWdldHMtMDI1MDEzMTg1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Jun 2023 07:00:00 GMT",
        "title": "Crypto Exchange Mercado Bitcoin Gets Payment Provider License in Brazil - Yahoo Finance",
        "content": "Crypto Exchange Mercado Bitcoin Gets Payment Provider License in Brazil\n\nCrypto Exchange Mercado Bitcoin Gets Payment Provider License in Brazil\n\nMercado Bitcoin, a cryptocurrency exchange in Brazil, has received a license from the country's central bank to operate as a payment provider. This will allow the company to launch its fintech service MB Pay, which will offer digital banking solutions to its users using crypto assets. MB Pay will enable users to invest in digital fixed income, stake their crypto, and access other financial transactions. The company also plans to introduce a debit card that will allow users to convert their crypto into fiat currency.\n\nMercado Bitcoin is one of the leading crypto exchanges in Brazil, with over 3 million customers and more than $5 billion in trading volume. The company is part of 2TM Group, which also owns other digital asset platforms such as Bitrust and Meubank. The payment provider license is a significant milestone for Mercado Bitcoin and the crypto industry in Brazil, as it shows the growing recognition and adoption of digital currencies in the country.\n\nBrazil has a large and vibrant crypto market, with several other exchanges and platforms operating in the country. Some of them have also obtained payment provider licenses from the central bank, such as Crypto.com and Bitso. Coinbase, the largest crypto exchange in the US, has also expanded its presence in Brazil by partnering with local payment providers to enable crypto purchases and withdrawals in Brazilian real."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3RldGhlci50by9lbi90ZXRoZXItcGFydGljaXBhdGVzLWluLTEtYmlsbGlvbi1pbnZlc3RtZW50LXRvLWJ1aWxkLXRoZS13b3JsZHMtbGFyZ2VzdC1iaXRjb2luLW1pbmluZy1mYXJtLWluLWVsLXNhbHZhZG9yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Tether Participates in $1 Billion Investment to Build the World's Largest Bitcoin Mining Farm in El Salvador - Tether USD",
        "content": "5 JUNE, 2023 — Tether, the company operating the fintech platform tether.to that powers the first and most widely used stablecoin in the world, announced today that it has participated in the first round of a new billion dollar renewable energy initiative in El Salvador. Following on its mission to invest in renewable energy sources to support and promote sustainable Bitcoin mining, Tether will provide capital and bring its domain expertise in energy, hardware, and communications to build “Volcano Energy”, a 241 MW renewable energy generation park in Metapán. By integrating solar and wind projects within the volcanic region, Tether aims to play a key role in paving the way for one of the world's largest Bitcoin Mining Farms.\n\nIn Central America, El Salvador has the highest geothermal energy production. Located in the El Chiste hamlet within the municipality of Metapán, Santa Ana, the site chosen for this development will be divided between 169 MW of photovoltaic solar energy and 72 MW of wind energy. This output will create an initial computation power surpassing 1.3 EH/s (1 EH/s is equivalent to one quintillion hashes per second).\n\n“We are excited to be among the initial pioneers of renewable energy in El Salvador as an equity investor and advisor,” said Paolo Ardoino, Chief Technology Officer at Tether. “Volcano Energy represents one of the most ground-breaking and strategic initiatives we are investing in and we look forward to working alongside Josue Lopez and his team to make El Salvador a global force in renewable energy production. This investment continues Tether’s journey in diversifying its strategic ecosystem.”\n\nThe long-term sustainability of the bitcoin network can only be achieved through energy innovation, competitiveness, diversification and geographic expansion. By investing in renewable energy resources around the world, Tether aims to become one of the leading providers and investors in global renewable energy and mining infrastructure.\n\n“Currently, more than 52% of Bitcoin mining is being done sustainably,” said Josue Lopez, CEO at Volcano Energy. “We believe this percentage will significantly increase in the coming years, through important investments like ours. Not only is “Volcano Energy” important for the future of Bitcoin resiliency, it’s also an important sign of the new crucial role that El Salvador plays in the global tech environment.”\n\n“El Salvador has the volcanoes, natural resources, the talent, and now the expertise and support of Tether to be a Bitcoin mining powerhouse. Bitcoin Country will now also be known as Bitcoin mining country,” said Max Keiser, Chairman of Volcano Energy."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZGlwcy1iZWxvdy11czI3MDAwLWxpdGVjb2luLWJpZ2dlc3QtbG9zZXIv0gFLaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1kaXBzLWJlbG93LXVzMjcwMDAtbGl0ZWNvaW4tYmlnZ2VzdC1sb3Nlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin dips below US$27,000, Litecoin biggest loser - Forkast News",
        "content": "Bitcoin fell on Monday afternoon in Hong Kong to below US$27,000. Most other top 10 non-stablecoin cryptocurrencies traded mixed over the past 24 hours, with Litecoin leading losses, followed by Binance’s BNB token. XRP gained the most, followed by Tron and Solana. Asian and European bourses mostly gained while U.S. stock futures traded mixed.\n\nSee related article: HK green lights retail crypto trading as Beijing releases Web3 white paper\n\nBitcoin, Ether slump\n\nBitcoin fell 1.73% from 7 a.m. to 4 p.m. in Hong Kong, lowering its value to US$26,836, according to data from CoinMarketCap. Monday’s depreciation contributes to a weekly loss of 3.85%. Over the past month, the world’s biggest cryptocurrency by market capitalization reached a low point of US$25,878.\n\nEther, which is the world’s second largest cryptocurrency, also experienced a drop in value. It fell by 1.41% to US$1,873, marking a weekly decline of the same percentage.\n\nOf the top 10 cryptocurrencies excluding stablecoins, Litecoin saw the largest drop over a 24-hour period, falling 2.43% to US$93.37. However, over the course of the past week, it gained 2.14%. The token’s third halving event is set for Aug. 2, which is expected to reduce the network’s block rewards.\n\nAccording to a recent report from digital asset researcher CCData, the sector experienced its first decrease in total assets under management for digital asset investment products in 2023. The overall AUM contracted by 8.92% to US$30.6 billion in May. The report added that May 2023 marked the first time in the year when Bitcoin and Ethereum products saw a decrease in AUM, declining by 10.3% and 4.42%, respectively.\n\nBNB, the native token of the world’s biggest crypto exchange Binance, fell by 1.88% to US$301.09 in the past 24 hours, part of a 4.28% decline in the last seven days. Richard Teng has emerged as the front-runner to lead Binance should its current chief executive Changpeng Zhao decide to step down amid regulatory hurdles, according to a Bloomberg report on Monday. The exchange faces regulatory scrutiny in the U.S., has suspended its Australian dollar services, and has ceased operations in Canada due to tightened crypto mandates.\n\nXRP, Solana and Tron gained among the top 10 non-stablecoin cryptos. XRP rose 1.79% to US$0.5343 in 24 hours, bringing its weekly gains to 11.07% after the XRP community reacted to the draft bill Digital Asset Market Structure Proposal released Friday by Republicans that seeks clarity in regulating cryptocurrencies as securities or commodities.\n\nSolana climbed 0.30% to US$21.66 while Tron’s TRX token gained 1.15% to US$0.08151 in the last 24 hours.\n\nNFT sales edge higher\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dropped 0.75% to 3,305.61 in the last 24 hours to 3.45 p.m. in Hong Kong, and is down 2.19% on the week.\n\nThe Forkast ETH NFT Composite index was down 0.65% to 1,113.45 in the same period, bringing its weekly losses to 1.11%.\n\nNFT sales on Ethereum fell 14.45% to US$21.77 million, but gained 81.34% in the last seven days, according to CryptoSlam data.\n\nSales on the Bitcoin network increased 49.36% in the last 24 hours to US$3.05 million but lost 4.59% on the week.\n\nAmong Ethereum collections, Bored Ape Yacht Club (BAYC) clocked the highest sales volume in the past 24 hours of US$4.53 million, followed by Azuki’s US$2.75 million and Mutant Ape Yacht Club’s US$1.58 million.\n\nSales volumes on the Bitcoin network were led by $OXBT BRC-20 NFTs, rising 40.73% to US$580,597 in 24 hours, followed by Bitcoin Bear Cubs, which rose 2.30% to US$530,830.\n\nSales of uncategorized Ordinals — Bitcoin NFTs that are not part of an established collection — climbed 75.68% to US$525,458.\n\n“There’s lots of green to be seen on the seven-day NFT collection rankings by sales volume. A Bitcoin project is still king, but the reigning king of NFTs, BAYC, has had some significant sales this week, as some collectors are securing grails ahead of a possible entry by Chinese collectors,” according to Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\n“The blockchains by NFT sales volume rankings show the battle for the third spot still raging on, with Solana holding it down at almost US$10 million in sales volume. Ethereum and Bitcoin are still top dogs, and nobody is expecting that to change anytime soon,” Petscher said.\n\nAsian, European bourses gain, U.S. futures mixed\n\nMost Asian equity markets gained on Monday after U.S. President Joe Biden announced over the weekend that he signed the debt ceiling bill into law, averting a potential default in the world’s largest economy.\n\nThe Shanghai Composite gained 0.07%, while the Shenzhen Component Index dropped 0.47%. Hong Kong’s Hang Seng Index climbed 0.84%, and Japan’s Nikkei 225 strengthened 2.20%.\n\nMajor U.S. stock futures traded mixed as of 6.15 p.m. in Hong Kong. The S&P 500 futures index was down 0.02%, the tech-heavy Nasdaq-100 futures dropped 0.29%, and the Dow Jones Industrial Average futures gained 0.07%.\n\nCrude oil prices rose after the Organization of the Petroleum Exporting Countries and its partners (OPEC+) decided to reduce production by another million barrels per day starting in July. Output will decline to 9 million barrels per day from about 10 million in May, potentially adding to inflationary pressures by pushing up prices.\n\nEuropean bourses gained on Monday, with the benchmark STOXX 600 rising 0.05% while Germany’s DAX 40 rose 0.14%.\n\nIn a speech last week, European Central Bank (ECB) President Christine Lagarde reportedly indicated that additional interest rate hikes were possible since it was unclear if core inflation in the eurozone had peaked. Most central banks around the globe, including the ECB and the U.S. Federal Reserve, have set 2% as a target inflation rate.\n\n“For the past two decades, central banks have struggled to push inflation rates up to their respective targets, with deflation fears dominating the balance of risk during the ‘lowflation’ period since the global financial crisis. Looking ahead, central banks are now more likely to struggle to avoid inflation from overshooting those targets,” Azad Zangana, senior European economist and strategist at Schroders, said in a note on Monday.\n\nThe U.S. central bank is scheduled to meet on June 14 to decide on interest rates and the economy’s trajectory. The interest rate in the U.S. is now between 5 and 5.25%, the highest level since 2006. Annual inflation in the world’s biggest economy was below 5% in April, but above the Fed’s target of 2%.\n\n“The Fed is almost certainly not done yet with interest rate hikes, especially following Friday’s robust jobs report. Even if the central bank takes a pause this month, we do expect further rate rises are on their way before they bring their hiking program to an end,” Nigel Green, chief executive of financial advisory firm deVere Group, said in a statement on Monday.\n\n(Update adds equity section.)"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vd3d3LmFpZXIub3JnL2FydGljbGUvZGVjZW50cmFsaXphdGlvbi1hbmQtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Jun 2023 07:00:00 GMT",
        "title": "Decentralization and Bitcoin | AIER - AIER - Daily Economy News",
        "content": "From the late-1980s until the early 2000s, the Cypherpunks – a group of cryptographers, mathematicians, computer scientists and activists – worked to build what they referred to as a crypto-anarchist “Galt’s Gulch in cyberspace.” This virtual place would be one where individuals from around the world could communicate and engage in commerce, with property rights protected, with contracts enforced, and with its own native digital currency. These Cypherpunks are widely credited to having significant involvement in the development of (or influence on) projects such as Tor, anonymous remailers, PGP for email encryption, OTR for chat encryption, BitTorrent, Wikileaks, the Silk Road market, and, of course, Bitcoin, both during the group’s formal existence and thereafter.\n\nAs Bitcoin’s very existence derives from the set of ideas to which these Cypherpunks adhered, it is worth exploring its anarchic roots.\n\nAccording to Timothy C. May, one of the Cypherpunk founders and more influential members, crypto-anarchy was a concept deriving inspiration from the work of economist David D. Friedman, science fiction writer Vernor Vinge, and philosopher Ayn Rand.\n\nFriedman’s book The Machinery of Freedom, first published in 1973 and now in its third edition, makes the case for anarcho-capitalism, exploring how various societies throughout history, to varying degrees, protected property, resolved disputes, enforced contracts, and provided defense without the state.\n\nFrom Vinge’s work, May references the novella True Names. And, as it turns out, Friedman had an impact on Vinge’s thinking too. In an interview, Vinge cites Friedman’s The Machinery of Freedom as one of his own inspirations, stating that Friedman’s book instigated a profound “internal intellectual revolution.”\n\nFriedman’s inspirations for anarchy\n\nWhere did David Friedman’s own anarchy come from? His influential parents Milton and Rose Friedman were certainly no anarchists.\n\nIn an email to me, he confirms that Robert Heinlein’s fictional novel The Moon is a Harsh Mistress was a primary influence. In an interview about the book Friedman states that it:\n\n…provided a fictional picture of a society in which law and law enforcement are endogenous… done within the system… As far as I could tell, it was an internally consistent picture… That is as far as I could tell [from] reading it, there is no particular reason why that shouldn’t have worked under those circumstances… Once I was convinced that it was possible to have a society in which law and law enforcement were internal to the market system rather than imposed from the outside, that got me interested into the question of how one could do the equivalent in something more like the world I actually lived in.\n\nFriedman is quick to point out that if he had more knowledge of history and anthropology at the time he may not have needed Heinlein’s fiction to arrive at these conclusions, as he later discovered there was no shortage of real world examples.\n\nF.A. Hayek was another influence. In a recorded conversation, Friedman highlights Hayek’s “distinction between an organization and a self-generated order.” He (Friedman) was intrigued by the idea that “a market economy does not have a purpose” in the way that clubs or corporations do. This is to say that many individuals, with their own different ends, could still coordinate their plans. In Friedman’s words, “a set of people that have different purposes nonetheless interact and coordinate their activities.”\n\nNotably, Friedman dedicated The Machinery of Freedom to both Heinlein and Hayek (among others).\n\nFriedman’s influence on May\n\nTimothy May advocated for a crypto-anarchist society as far back as 1988 in his “Crypto Anarchist Manifesto” and later repeatedly mentioned Friedman and The Machinery of Freedom in the Cypherpunk mailing list as well as in other writings.\n\nBut beyond anarchy generally, May would have also had the opportunity to come across Friedman’s writings on money. The second edition of Friedman’s book The Machinery of Freedom, published in 1989 around the time that the Cypherpunks were just getting started, contains a chapter entitled “The Market for Money.” This chapter (which also cites economist Lawrence H. White’s work on private monies) argues that “instead of arguing about whether our government should return to the gold standard we should instead be thinking about whether the government should produce money at all,” and that private monies might be devised that would “not rely on the wisdom or benevolence of the people appointed to manage the money supply.” Here we see Hayek’s idea of competition in money integrated into Friedman’s broader anarchist ideas, which were quickly embraced by the Cypherpunks.\n\nMay’s passion for crypto-anarchy was shared by Cypherpunk and computer engineer Wei Dai, whose 1998 essay ‘b-money’ described how a cryptocurrency might work (and, by the way, was listed in the references of Satoshi Nakamoto’s Bitcoin whitepaper). Dai wrote in his essay that “I am fascinated by Tim May’s crypto-anarchy.”\n\nNote: Although May had come across Murray Rothbard’s ideas (yet another pioneer in anarcho-capitalist thought), I have found no mention of Rothbard in any of May’s Cypherpunk-era writings. So May’s writings on anarcho-capitalism, taking on a new face as ‘crypto-anarchy,’ make it clear that Friedman was the primary influence.\n\nTimothy C. May’s (later) influence on Friedman\n\nMay noticed that Friedman was becoming interested in the mating of ideas between cryptography and anarchy. He wrote in the Cypherpunk mailing list how Friedman “became a convert” to crypto-anarchy and had given a talk on the matter in Los Angeles.\n\nFriedman stated in a presentation to the Independent Institute in 2001 that “the basic history of these ideas is that I stole them from from a bunch of people called ‘Cypherpunks,’ of whom the leading light is Tim May, who stole some of them from me… and then I stole the ideas back from him.” Friedman even dedicated his book Future Imperfect to May (among others), and in fact, the book covers Friedman’s own contributions to many of the same technological ideas that Cypherpunks dealt with.\n\nConclusion\n\nTimothy May envisioned – and some key Cypherpunks worked to create – a (sometimes) hidden digital society (inspired by the fictional works of Ayn Rand and Vernor Vinge) that would essentially exist in a state of anarchy (inspired by David Friedman). In the context of cyberspace, this meant that individuals from around the world with very different ends could coordinate their plans, thanks to interconnectivity of computers around the world, open source software, and technological breakthroughs in cryptography.\n\nBitcoin itself is a currency that might best be considered existing in a state of anarchy. It was indeed designed, but its decentralized governance operates in such a way that no single party (neither the miners, nor the full node operators, nor the programmers, nor the users, nor the exchanges, nor the wallet providers, nor the payment processors) controls it. Thus, it has governance, objective rules by which each party must follow, but as a protocol, it is entirely stateless.\n\nFriedman’s reading of Heinlein’s science fiction allowed him to imagine a society “in which law and law enforcement were internal to the market system rather than imposed from the outside,” and when he began to dig, he found many real world examples of this in practice.\n\nBeyond fiction, he also took the idea of a “self-generated order” to its logical conclusions: to anarchy, further than Hayek was comfortable with taking it himself. His creative way of thinking about how individuals with very different ends could coordinate their plans was instrumental in the thinking of the Cypherpunks, whose ideas and work eventually led to what we now call Bitcoin."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWxpdHRsZS1jaGFuZ2VkLWFyb3VuZC11cy0wMDI4NDQ0NDEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin little-changed around US$27,000, Ether treads water; Solana, XRP gain - Yahoo Finance",
        "content": "Bitcoin traded little changed on Monday morning in Asia to hold above the US$27,000 threshold. Ether also traded flat, along with most other top 10 non-stablecoin cryptocurrencies. However, Solana and XRP both gained more than 4%. U.S. stocks jumped Friday as a deal was approved to raise the debt ceiling, with the bill signed by U.S. President Joe Biden on Saturday to avoid a government default. U.S. Stock futures were trading flat on Monday morning in Asia. Investor focus has shifted to what will be the next move on interest rates by the Federal Reserve when it meets on June 14.\n\nBitcoin, Ether trade flat; Solana, XRP gain\n\nBitcoin edged up 0.87% over the last 24 hours to US$27,309 at 7:00 a.m. in Hong Kong, but is down 2.84% in the past seven days, according to data from CoinMarketCap. The world’s largest cryptocurrency fell to as low as $26,574 on Friday.\n\nEther traded 0.67% higher in the past 24 hours to US$1,904, little changed for the week.\n\nMost other top 10 non-stablecoin cryptocurrencies traded flat. The exceptions were a 4.69% price jump for Solana, and a 4.19% gain for XRP.\n\nSolana’s move comes just as non-fungible token (NFT) secondary sales on the Solana network rose 21.62% over the last 24 hours, according to data from CryptoSlam.\n\nXRP is up 12.06% over the past week, gaining momentum after the XRP community reacted to the draft bill Digital Asset Market Structure Proposal released Friday by Republicans that seeks clarity in regulating cryptocurrencies as securities or commodities. Pro-XRP lawyer Jeremy Hogan tweeted that the discussion draft could be known as an “XRP holder protecting” act.\n\nThe Securities Clarity Act.\n\n\n\nAlso known as the:\n\n\n\n\"XRP holder protecting/Coinbase & Binance relieving/Crypto start-up protecting/USA Pro-innovation/Hinman speech codifying/Stick it to the SEC/ ACT.\"\n\n\n\nFor short. https://t.co/31gn4u7mOi pic.twitter.com/akNNXEJleb — Jeremy Hogan (@attorneyjeremy1) June 2, 2023\n\n“Investor sentiment across both digital assets as well as traditional finance appears to be in a holding pattern waiting for further indications from the U.S. Federal Reserve and other central banks as to anticipated interest rate movements in the third quarter of this year,” Nathan Simmons, chief compliance officer of Hong Kong-based digital asset platform VDX, said late Friday.\n\nStory continues\n\nNFT 500 index falls, May transaction volume surges\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dropped 1.58% to 3,281.22 in the 24 hours to 9:30 a.m. in Hong Kong, adding to a 2.38% weekly loss.\n\nThe Forkast ETH NFT Composite index was down 1.17% in the same period, logging a 1.38% weekly decline.\n\nNFT sales on Ethereum fell 10% over the last 24 hours to US$23.65 million, but gained 83.97% in the past week. Sales on the Bitcoin network dropped 31.9% to US$3.82 million, but still recorded a 30% weekly increase.\n\nBored Ape Yacht Club (BAYC) and Azuki remained the two most-sold Ethereum collections. BAYC had the biggest sales in the past 24 hours of US$5.1 million, followed by Azuki’s US$3.4 million and Mutant Ape Yacht Club’s US$1.7 million.\n\nUncategorized Ordinals – recently popular Bitcoin Ordinals that are not part of an established collection – recorded a 45.24% drop to US$1.4 million in sales over the past 24 hours, but its seven-day sales gained 7.85%.\n\nDMarket, a Mythos blockchain-based collection of gaming NFTs, continued gaining momentum with a 18.34% rise in sales to US$1.35 million in the last 24 hours.\n\nNotably, the number of NFT transactions reached 8.9 million in May, the largest since February 2022, according to CryptoSlam data.\n\n“Before we get too excited we need to understand that the NFT landscape is vastly different from last year,” Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News, wrote in a commentary on Sunday.\n\n“Today, we have projects like DMarket’s gaming skins on Mythos Chain, which did over 2 million transactions in the past 30 days alone. Still, growth isn’t measured in just sales, and the May turnaround just might indicate that mass adoption is happening right under our noses,” Petscher added.\n\nBiden signs debt bill; China, Japan services sectors expand in May\n\nU.S. President Joe Biden. Image: Getty Images\n\nU.S. stock futures traded mixed as of 10:20 a.m. in Hong Kong. Dow Jones Industrial Average futures edged up 0.02%, while S&P 500 futures dipped 0.1%. Nasdaq Futures fell 0.32%.\n\nCrude oil prices rose after the OPEC+ group of oil-producing countries on Sunday decided to extend output cuts through next year, which could be an inflationary factor.\n\nOn Saturday, U.S. President Joe Biden signed into law a bill to avoid a government default. The bill, passed by the U.S. Senate on Thursday, would suspend the U.S.’ debt limit through January 1, 2025.\n\n“I just signed into law a bipartisan budget agreement that prevents a first-ever default while reducing the deficit, safeguarding Social Security, Medicare, and Medicaid,” Biden tweeted on Saturday.\n\nIn Asia, China’s services sector extended its recovery in May, with Caixin China General Services Purchasing Managers’ index (PMI) climbing to 57.1 from April’s 56.4.\n\n“Both services supply and demand expanded further in May,” Wang Zhe, senior economist of Caixin Insight Group, said in the PMI report. “Services activity continued to rebound after China scrapped its ‘zero-Covid’ policy in December.”\n\nJapan’s service sector also expanded in May, according to surveys by au Jibun Bank. Its Japan Services PMI for May came in at 55.9, or higher than 55.4 in April.\n\n“The Japanese service sector continued on its upward trend that began at the end of last year during May, with latest PMI data pointing to back-to-back record increases in business activity, new orders and exports,” Usamah Bhatti, an economist at S&P Global Market Intelligence, said in the report.\n\n“Firms were buoyed by the easing of the few remaining pandemic restrictions and have noted strong increases in demand, notably from overseas and inbound tourism,” Bhatti added.\n\n(Updates with NFT and equities sections.)"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tYXliZS1iaXRjb2luLWRpZG4tdC1ib3R0b20tc2VjLWxhd3N1aXQtYWdhaW5zdC1iaW5hbmNlLXNoYWtlcy1idGMtYnVsbHMtY29uZmlkZW5jZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Maybe Bitcoin didn't bottom? SEC lawsuit against Binance shakes BTC bulls' confidence - Cointelegraph",
        "content": "Bitcoin’s price declined 5% in one hour on June 5 after the United States Securities and Exchange Commission (SEC) filed a lawsuit against Binance on allegations of violating federal securities laws. Even though the $25,500 support held for Bitcoin, investors are still digesting the potential impacts of the regulatory action, which also involves Binance CEO Changpeng “CZ” Zhao.\n\nAccording to digital asset investment firm Arca CEO Jeff Dorman, the direct impact of an eventual shutdown of Binance operations in the U.S. is irrelevant. Furthermore, non-criminal charges from the past should not destabilize Binance’s present international structures. Still, Arca’s CEO expects negative market sentiment to prevail as the crypto community cheers for CZ and Binance.\n\nMy 2 sats on SEC vs Binance\n\n\n\nMostly irrelevant since no one operates in the US anymore and a bunch of non-criminal charges for past wrongdoings don’t really matter.\n\n\n\nI see 2 actual negatives from this: ⬇️ — Jeff Dorman, CFA (@jdorman81) June 5, 2023\n\nBinance is not the only pressing concern\n\nEven if the SEC charges against Binance have little to no impact in the medium term, there’s additional uncertainty coming from Digital Currency Group (DCG) and its subsidiary Genesis Capital, which filed for Chapter 11 bankruptcy on Jan. 19.\n\nlooks like a dcg portco\n\n-manages ~3b of silbert's personal holdings\n\n-lent genesis 1b\n\n-pulled 1b coincident w/ 3ac default / dcg note\n\n-has ~ no clients other than barry\n\n\n\nits v clear nobody else reads these filings carefully\n\n\n\nthe stonewalling makes sense!https://t.co/7NgFnUkmp1 — Data Finnovation (@DataFinnovation) June 4, 2023\n\nAccording to Jon Reiter, CEO of Data Finnovation and ChainArgos, DCG CEO Barry Silbert pulled $1 billion out of his personal holdings just as cryptocurrency hedge fund Three Arrows Capital defaulted. While this could have been a coincidence, it certainly draws even more attention to the intercompany loans and deals inside DCG.\n\nTraders now question whether Bitcoin (BTC) will test the $25,000 resistance, a level unseen since March 17. Considering that the U.S. debt ceiling crisis has been averted, the odds for a surprise Bitcoin price rally seem even more unlikely in the short term.\n\nInvestors should be especially attentive if Bitcoin futures contract premiums flip negative or if increased costs for hedging using BTC options occur.\n\nBitcoin derivatives markets show a mixed reaction\n\nBitcoin quarterly futures are popular among whales and arbitrage desks. However, these fixed-month contracts typically trade at a slight premium to spot markets, indicating that sellers are asking for more money to delay settlement.\n\nAs a result, BTC futures contracts in healthy markets should trade at a 5 to 10% annualized premium — a situation known as contango, which is not unique to crypto markets.\n\nBitcoin 2-month futures annualized premium. Source: Laevitas\n\nBitcoin traders have been rather cautious since June 1, as the futures premium remained below 4%. On the other hand, the indicator stood at 3.5% after the SEC charges against Binance came to light on June 5.\n\nTraders should also analyze options markets to understand whether the recent correction has caused investors to become more optimistic. The 25% delta skew is a telling sign of when arbitrage desks and market makers overcharge for upside or downside protection.\n\nIn short, if traders anticipate a Bitcoin price drop, the skew metric will rise above 7%, and phases of excitement tend to have a negative 7% skew.\n\nRelated: Fines and regulation, The ever-growing landscape of crypto compliance\n\nBitcoin 30-day options 25% delta skew. Source: Laevitas\n\nAs displayed above, according to the BTC options 25% delta skew, traders suddenly flipped bearish, as the indicator spiked to 11% on June 5. This level was the highest in three months and signals discomfort from professional traders.\n\nThe bear trend continues while FUD prevails\n\nIn essence, Bitcoin options and futures markets suggest that the bear trend that started after the failed $31,000 test on April 14 continues, although there has been no significant fallout in the overall market structure. Yet, it might be too early to interpret the potential consequences of the SEC’s actions, and court rulings take months — if not years — to settle.\n\nConsequently, those betting on a Bitcoin bull run should adjust their expectations because investors hate uncertainty.\n\nUntil there is more clarity on the DCG-Genesis situation and Binance’s operational capability amid the tougher U.S. regulatory environment, there is less incentive for long-term buyers to step in and defend the all-important $25,000 support.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNoYXJ0LWZsYXNoZXMtYS1idWxsaXNoLXNpZ24tdGhhdC1jb3VsZC1sZWFkLXRvLWJyZWFrb3V0cy1pbi1hZGEtcW50LXJuZHItYW5kLXJwbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price chart flashes a bullish sign that could lead to breakouts in ADA, QNT, RNDR and RPL - Cointelegraph",
        "content": "The United States equities markets welcomed the debt ceiling deal and the May nonfarm payrolls data on June 2 with strong rallies. The S&P 500 rose 1.8% during the week while the tech-heavy Nasdaq was up 2%. This was the sixth successive week of gains for the Nasdaq, the first such occasion since January 2020.\n\nIn addition to the above, the expectation that the Federal Reserve will be in a pause mode during its next meeting may have acted as a catalyst for the rally. CME’s FedWatch Tool is showing a 75% probability of a pause, with the remaining 25% expecting a 25 basis points hike at the June 14 meeting.\n\nCrypto market data daily view. Source: Coin360\n\nRallies in the equities markets failed to trigger a similar performance in Bitcoin (BTC) and the altcoins. However, a minor positive is that several major cryptocurrencies have stopped falling and are trying to start a recovery.\n\nCould bulls maintain the momentum and surmount the respective overhead resistance levels? If they do, which are the top five cryptocurrencies that may lead the rally?\n\nBitcoin price analysis\n\nBitcoin has been trading close to the 20-day exponential moving average ($27,233) for the past three days. This suggests that the bulls are buying the dip near $26,500.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe 20-day EMA has flattened out and the relative strength index (RSI) is just below the midpoint, indicating a balance between supply and demand. This balance will tilt in favor of the buyers if they drive the price above the resistance line of the descending channel pattern. That may start a northward march toward $31,000.\n\nIf the price turns down from the resistance line, it will suggest that the BTC/USDT pair may spend some more time inside the channel. The critical level to watch on the downside is $25,250. A break and close below this support may intensify selling and tug the price toward $20,000.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bears are guarding the immediate resistance of $27,350. On the downside, the pair has been forming higher lows in the near term, indicating demand at lower levels. This enhances the prospects of a rally above the overhead resistance. If that happens, the pair may soar to the resistance line of the descending channel.\n\nIf bears want to gain the upper hand, they will have to quickly sink the price below the nearest support at $26,505. The next stop on the downside could be $26,360 and then $25,800.\n\nCardano price analysis\n\nCardano (ADA) has been repeatedly finding support at the uptrend line but the bulls have failed to kick the price above the 50-day simple moving average ($0.38).\n\nADA/USDT daily chart. Source: TradingView\n\nA breakout from this tight range trading is likely to happen within the next few days. If bulls shove and sustain the price above the 50-day SMA, it will clear the path for a possible rally to $0.42 and then to $0.44.\n\nAlternatively, if the price turns down from the 50-day SMA and dips below the uptrend line, it will suggest the start of a deeper correction. The ADA/USDT pair could then plunge to the strong support at $0.30.\n\nADA/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the $0.38 level is behaving as a strong obstacle. However, the rising moving averages and the RSI in the positive zone indicate that the bulls have the upper hand. If buyers thrust the price above $0.38, the pair could climb to $0.40 and thereafter to $0.42.\n\nIf the price turns down sharply from the current level and breaks below the 50-SMA, it will suggest that bears have seized control in the near term. The pair may then collapse to $0.36 and later to $0.35.\n\nQuant price analysis\n\nAfter staying below the downtrend line for several days, Quant (QNT) turned around and started a recovery on May 26. The bulls continued their purchase and pushed the price above the moving averages on May 29, indicating a potential trend change.\n\nQNT/USDT daily chart. Source: TradingView\n\nThe moving averages have completed a bullish crossover and the RSI is in the positive territory, indicating that the path of least resistance is to the upside. There is a barrier at $120 but if bulls overcome it, the QNT/USDT pair could rise to $128 and subsequently to $135.\n\nContrary to this assumption, if the price turns down sharply from $120, the bears will try to yank the price to the 20-day EMA ($110). This remains the key level to keep an eye on because a break below it will indicate that bears are back in control.\n\nQNT/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the price is stuck inside a trading range between $114.50 and $120. The 20-EMA is flattish but the RSI is in the positive territory, indicating that the momentum remains bullish. If bulls clear the hurdle at $120, the pair is likely to start the next leg of the up-move.\n\nConversely, if the price turns down and plummets below $114.50, it will suggest that bears have a slight edge. The pair may then slump to $110 and later to $102. The deeper the fall, the greater the time needed for the recovery to resume.\n\nRelated: Cryptocurrency markets’ low volatility: A curse or an opportunity?\n\nRender Token price analysis\n\nWhile most major cryptocurrencies are struggling to start a recovery in a downtrend, Render Token (RNDR) has started a new upward move.\n\nRNDR/USDT daily chart. Source: TradingView\n\nThe RNDR/USDT pair dipped to the 20-day EMA ($2.48) on May 31 but the bulls successfully defended the level. This shows a positive sentiment where traders are buying the dips to strong support levels. The pair could retest the 52-week high of $2.95. If this resistance is overcome, the pair may soar to $3.75.\n\nThe first sign of weakness will be a break and close below the 20-day EMA. Such a move will indicate aggressive profit-booking by the short-term bulls. That may open the doors for a possible drop to the 50-day SMA ($2.20).\n\nRNDR/USDT 4-hour chart. Source: TradingView\n\nThe moving averages have completed a bullish crossover and the RSI is in positive territory, indicating that bulls have the upper hand. Buyers will try to push the price above the overhead resistance zone between $2.90 and $2.95. If they succeed, the pair may start a new uptrend.\n\nOn the contrary, if the price turns down from the current level or the overhead resistance and breaks below the moving averages, it will suggest that the bears are on a comeback. A break and close below $2.42 will indicate the start of a downward move toward $2.25.\n\nRocket Pool price analysis\n\nRocket Pool (RPL) has been trading inside an ascending channel pattern for the past several days. A positive sign in the short term is that the bulls have kept the price above the moving averages. This indicates a change in sentiment from selling on rallies to buying on dips.\n\nRPL/USDT daily chart. Source: TradingView\n\nThe RPL/USDT pair has been trading inside a tight range for the past few days. This suggests that a range expansion could be around the corner. If the price breaks and closes above $50.50, it will suggest the start of an up-move to the resistance line of the channel. The bears are expected to defend this level with all their might.\n\nThis positive view will invalidate in the near term if the price turns down from the current level and breaks below the moving averages. The pair could then plummet to the support line of the channel.\n\nRPL/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bulls are sustaining the price above the moving averages,but they have failed to clear the overhead hurdle at $50.37. This suggests that bears continue to sell on minor rallies.\n\nIf the price turns down and breaks below the 50-SMA, it will indicate that the bulls have given up. The pair may then plummet to the support line near $46.\n\nContrarily, if buyers propel and sustain the price above $50.50, the bullish momentum may pick up and the pair could rally to $53.50.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvd2hvLWhhcy10aGUtYml0Y29pbi1hLWNsb3Nlci1sb29rLWF0LXRoZS1iaXRjb2luLXN1cHBsedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Who Has The Bitcoin? A Closer Look At The Bitcoin Supply - Nasdaq",
        "content": "The article below is an excerpt from a recent edition of Bitcoin Magazine PRO, Bitcoin Magazine's premium markets newsletter. To be among the first to receive these insights and other on-chain bitcoin market analysis straight to your inbox, subscribe now.\n\nWho Holds The Bitcoin?\n\nBitcoin’s public ledger comes with a unique level of transparency that includes significant information detailing where the bitcoin supply lives. With the help of address tracking, public announcements and some estimation across data sources, we can get a sense of where nearly 47% of total bitcoin supply is today. A considerable portion of bitcoin’s 21-million supply is estimated to be lost, which includes Satoshi Nakamoto’s coins. There’s useful data from both Glassnode and Chainalysis to suggest that nearly 4 million bitcoin has been lost.\n\nOther large amounts of bitcoin are on exchanges, in the Grayscale trust, or in bitcoin miners’ wallets. Swaths of bitcoin have been accumulated by the likes of MicroStrategy, and more recently Tether. Some 5,500 bitcoin are locked up on the Lightning Network, while other sums exist as wrapped bitcoin (WBTC) on blockchains besides Bitcoin.\n\nMost bitcoin estimates can be tracked on a routine basis when looking at examples, like known U.S. government-associated on-chain addresses from various bitcoin seizures, or when analyzing monthly production updates from public bitcoin miners, while other holding details can be much harder to come by. A private institution may have indicated bitcoin holdings years ago, but isn’t required to publicly announce updates of their stash. Other instances include uncertainty around government holdings. China may have 194,000 bitcoin from seizure, but it’s difficult to verify if this number is current.\n\nAll that said, the below chart is a rough cut of available data that can be expanded upon and improved for better accuracy across different groups. These figures come from on-chain forensics, public SEC filings and balance sheet attestations.\n\nBitcoin holdings separated by type of entity.\n\nOf the 2.3 million of bitcoin on exchanges, the majority resides on Binance and Coinbase. This wouldn’t include bitcoin in investment custody products like Grayscale and Coinbase Custody, for example. Binance’s share of bitcoin on exchanges has risen from under 10% in 2019 up to 30% today. The company is estimated to have nearly 700,000 bitcoin on their platform, which can predominantly be attributed to their derivatives marketplace dominance and their international presence, whereas Coinbase is mainly a spot exchange with a heavy U.S. presence.\n\nThe percent share of exchanges' bitcoin balances.\n\nOver time, the amount of circulating bitcoin supply on exchanges has reached 17.5% of circulating supply, reaching its peak in March 2020 before declining to just 11.89%. We suspect that the trend of declining bitcoin on exchanges as a percentage of circulating supply will continue as bitcoin distributes across an increased number of global adopters, thanks to sophisticated personal custody solutions becoming more mainstream and robust as time goes on.\n\nA little less than 12% of circulating bitcoin is held on exchanges.\n\nIn absolute terms, there has never been this level of long-term holders in bitcoin. In relative terms, the only two times in history with a larger share of long-term holder coins is in 2009 before bitcoin had an exchange rate, and in the depths of the 2015 bear market. With so much of the supply off the market, sell-side pressure in the interim can result in large price adjustments to the downside, since many market participants are partaking in more of a passive role.\n\nLong-term holders' percentage of circulating supply is growing.\n\nWe can also look at bitcoin’s illiquid supply to quantify holder dynamics. The term “illiquid supply” refers to bitcoin that are held by entities that rarely sell, meaning these coins are not readily available for trading. To quantify this, an entity's bitcoin holdings are deemed illiquid if less than 25% of its received bitcoins have been spent, liquid if 25% to 75% have been spent, and highly liquid if over 75% have been spent.\n\nIn the post-2016 halving era, bitcoin’s illiquid supply as a percentage of circulating supply is at its highest level, with holder accumulation taking coins off the market faster than miner issuance can distribute them.\n\nAs of this April 2023, bitcoin’s illiquid supply surpassed 15,000,000 coins.\n\nA large majority of bitcoin's supply is illiquid.\n\nIlliquid bitcoin supply has trended upward since 2016.\n\nThe trend is clear: Bitcoin continues to distribute into more hands, with a greater concentration of supply shifting from entities holding large amounts of bitcoin — balances of 1,000-10,000 BTC, 10,000-100,000 BTC, and greater than 100,000 BTC — to entities holding balances of 10 BTC or less.\n\nEntities' bitcoin balances of over 1,000 bitcoin has been trending down since 2011.\n\nBitcoin balances of less than 10 bitcoin has been growing for over a decade, meaning supply is getting distributed more evenly.\n\nIt’s important to note that entities holding large amounts of bitcoin, particularly those with 10,000-plus BTC, are likely managing keys for thousands or even millions of users, exchanges being an obvious example. This is often a classic source of mischaracterization and misinformation when people make claims regarding a lack of wealth distribution of bitcoin. Yes, there are clumps of addresses with large holdings of bitcoin, but this is like claiming that one corporation owns 14% of all U.S. dollars in the commercial banking system. While JPMorgan Chase has $2.4 trillion out of $17.1 trillion of deposits in domestic banks and the deposits are a liability of JPMorgan, in actuality, they are custodied for millions of unique individuals and businesses.\n\nThe key difference — aside from the legal versus cryptographic ownership structure — is the fact that bitcoin’s ownership structure, the UTXO set, is much more transparent and easily auditable. This makes it easy for anyone to look at the data and make informed claims about bitcoin’s supply concentration.\n\nFinal Note\n\nBitcoin has been successful in attracting a broad spectrum of holders, from individuals to corporations, private entities and even nation-states. As evidenced by increasing retail ownership and historically high levels of long-term holders, it’s clear that bitcoin's supply is getting distributed more evenly across this vast array of adopters. This trend is further reinforced by a declining amount of bitcoin held on exchanges and an increasing illiquid supply.\n\nMoving forward, we anticipate these trends of increased distribution and declining concentration to continue, as bitcoin’s 21,000,000 hard capped supply is divided up between the world’s individuals, institutions, corporations and nation states.\n\nThat concludes the excerpt from a recent edition of Bitcoin Magazine PRO. Subscribe now to receive PRO articles directly in your inbox.\n\nRelevant Past Articles:\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXdpbGwtZ2V0LWFub3RoZXItdGVzdC1vZi0yMDAtd2Vlay10cmVuZC1saW5lLWFuYWx5c3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price will get 'another test' of 200-week trend line — analyst - Cointelegraph",
        "content": "Bitcoin (BTC) fell to multi-day lows at the June 5 Wall Street open as action heated up on exchanges.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\nVan de Poppe: Trend line failure could mean “bottom isn’t in yet”\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD wicking to $26,640 on Bitstamp.\n\nDown nearly 3% versus the weekend’s highs, the pair looked weak as key support lines inched closer.\n\nAmong these was the 200-week moving average (MA), now at $26,400, which had weathered repeated tests to stay as support since mid-March.\n\n“Bitcoin is going to get another retest of support at the 200-Week MA (purple),” Keith Alan, co-founder of monitoring resource Material Indicators, warned in commentary on the weekly chart.\n\n“IMO, a Weekly candle close below the 200-Week MA would be an indication that the bottom isn’t in yet. Things could get spicy this week. The last line of defense is at the 50-Month MA around $25.5k.”\n\nBTC/USD annotated chart. Source: Keith Alan/Twitter\n\nOthers eyed similar areas for bulls’ last stand to take place.\n\n“Bitcoin is, still, stuck in the range-bound area where $26,600 is the important area to hold,” Michaël van de Poppe, founder and CEO of trading firm Eight, told Twitter followers on the day.\n\n“Couldn’t break $27,500. The standard Sunday/Monday dump took place, let’s see what the week will bring going forward. Pretty relaxed macro-economic week too.”\n\nMaterial Indicators itself, meanwhile, uploaded a chart of liquidity on largest global exchange Binance.\n\nBTC/USD order book data for Binance. Source: Material Indicators/Twitter\n\nCommenting on Alan’s findings, it argued that the United States Federal Reserve decision on interest rates due June 14 would be the ultimate “do or die” moment.\n\n\"If Technical Support levels at the key Moving Averages is lost, the next level of support would be around the 2017 Top, which has confluence with the trend line,\" it wrote.\n\n“BTC liquidity remains thin on both sides of price. Markets await the June 14th FED rate hike decision.\"\n\nExchange speculation heats up\n\nTrader Daan Crypto Trades was among those who noted noises coming from futures markets, where open interest was increasing.\n\nRelated: ‘$31K was not the end’ — 5 things to know in Bitcoin this week\n\nAction going on over at the Binance $BTC Futures pair.\n\n\n\nSeeing some big walls towards both sides. Some of them getting filled while some are likely spoof orders.\n\n\n\nMeanwhile, Open Interest is going up and fundingg is going down. pic.twitter.com/Rq3vQDuNJo — Daan Crypto Trades (@DaanCrypto) June 5, 2023\n\nTrading suite DecenTrader likewise noted a “significant increase” in open interest, with long positions becoming more prominent before the Wall Street open.\n\nThis seems to mostly be coming from #Bitcoin Longs as we are seeing an increase in both Funding Rates and the Long/Short ratio. https://t.co/I48kl4kbGW pic.twitter.com/pDf57zs2W4 — Decentrader (@decentrader) June 5, 2023\n\nData from monitoring resource CoinGlass, meanwhile, showed liquidations more impacting longs for June 5, with cross-crypto position losses totaling $33 million at the time of writing.\n\nCrypto liquidations chart. Source: CoinGlass\n\nMagazine: Home loans using crypto as collateral: Do the risks outweigh the reward?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNS1qdW5lLTIwMjMvYXJ0aWNsZXNob3cvMTAwNzYyMDIzLmNtc9IBvQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtNS1qdW5lLTIwMjMvYW1wX2FydGljbGVzaG93LzEwMDc2MjAyMy5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin falls below $26,800; Litecoin, BNB decline over 2% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were majorly trading mixed on Monday. Bitcoin, Ethereum, and BNB were trading with cuts, while XRP , Solana, and Tron were trading with gains.Bitcoin (BTC) fell 1.20% to $26,797, whereas Ethereum (ETH) was below the $1,900 level. BTC volume stood at approximately $11.57 billion, falling 39.42% in the last 24 hours.\"Crypto markets have continued to be tightly range-bound as overall market capitalization remained just below $1.2 trillion over the weekend, without any change in the last 24 hours. Investors are currently displaying a lack of initiation for trend control. It is because of this that we can expect the market to perform sideways till a prominent narrative picks up,\" Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said.The total volume in DeFi is currently $2.29 billion, 8.67% of the total crypto market 24-hour volume. The volume of all stablecoins is now $24.44 billion, which is 92.65% of the total crypto market 24-hour volume.The global cryptocurrency market cap was trading higher around $1.12 trillion, declining 0.92% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $519 billion. Bitcoin’s dominance is currently 45.83%, a decrease of 0.08% over the day, according to CoinMarketCap.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 45, with a neutral outlook. The Stochastic %K (14, 3, 3) at 44 and the Average Directional Index (14) at 18 indicate a Neutral outlook as well.\"The MACD Level (12, 26), at −151, indicates “Sell”. The Stochastic RSI Fast (3, 3, 14, 14) is “Neutral” at 46 and William's Percentage is “Neutral” at 62 as well,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.24 hours, IST on June 5, 2023)Bitcoin $26,796 -1.20%Ethereum $1,871 -1.43%Tether $1.00 -0.02%BNB $301 -2.01%XRP $0.5376 2.72%Cardano $0.3723 -1.36% Dogecoin $0.07211 -1.54%Polygon $0.867 -1.78%Solana $21.53 0.18% Litecoin $93.37 -2.1%Polkadot $5.26 -1.53%Tron $0.08147 0.71%Shiba Inu $0.000008539 -1.15%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTA0L2JpdGNvaW4tYnRjLWRldmVsb3BlcnMtZmV1ZC1vdmVyLWVuZGluZy1vcmRpbmFscy1tZW1lY29pbi1mcmVuennSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Developers Feud Over Ending Ordinals Memecoin Frenzy - Bloomberg",
        "content": "The coders who maintain Bitcoin’s blockchain are clashing over whether to stamp out the meme tokens swarming the network.\n\nA torrent of speculative coins led to a record number of transactions and an 11-fold spike in processing fees on the blockchain in May, creating a logjam and forcing the Binance exchange to temporarily halt Bitcoin withdrawals."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvcHJvcG9zZWQtMzAtdGF4LW9uLWJpdGNvaW4tbWluaW5nLWVuZXJneS11c2UtZGllcy1pbi11LnMuLWRlYnQtZGVhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Proposed 30% Tax on Bitcoin Mining Energy Use Dies in U.S. Debt Deal - Nasdaq",
        "content": "By Landon Manning\n\nA tax proposed by the Biden Administration to curtail Bitcoin mining in the United States has apparently been shelved indefinitely, thanks to the terms of a compromise over the U.S. debt ceiling.\n\nThe tax in question was known as the Digital Asset Mining Energy (DAME) excise tax, and it was originally made public by the White House in early May as part of a broader budget proposal. Primarily targeting the environmental impact of the crypto industry, DAME as originally envisioned would have required all crypto miners in the United States to pay a tax equivalent to 30% of the cost of the electricity these companies use. Such a tax would not only be devastating to a business that relies on cheap power costs, but would also completely ignore the reality that a huge number of bitcoin miners today are reliant on renewable energy.\n\nHowever, this plan, and indeed all the White House’s proposals for economic functioning, have been dramatically hampered by the latest round of negotiation over the U.S. debt ceiling. In essence, without a vote of confidence from an embittered Congress, the federal government would have defaulted on its loans, creating a crisis for the dollar. To continue the normal functioning of the global reserve currency, a deal was reached in late May that largely focused on concessions over economic policy. It’s thanks to this deal that the DAME act seems well and truly shuttered.\n\nThe crypto community has generally reacted to this news with celebration, as some of the largest mining firms are seeing massive stock rallies on top of a year that has already been successful. For the moment, it does not seem like there is political will to carry out an attack on Bitcoin from this angle.\n\nJust because this plan has failed, though, does not mean that crypto miners are safe from similar taxes on other fronts. Considering that this proposal collapsed over the federal government’s spending, Bitcoiners should be wary of the White House’s arguments that the DAME tax would generate billions for federal coffers. In other words, it seems very likely that similar attacks on crypto mining will be proposed in the future, possibly in a reworked fashion to seem more economically valuable or otherwise accompanied by increased efforts to link crypto mining and climate change.\n\nFor now, DAME failed in the same month it was proposed, and the immediate threat to Bitcoin has passed. The speed of this victory should remind the world of how far cryptocurrency has come in the last few years; an economic maverick has seen enough acceptance within the halls of power that it now has no shortage of friends in the U.S. House and Senate. As the crypto industry continues to grow and represent economic freedom for millions of people worldwide, it seems safe to say that it’s smart to bet on Bitcoin.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZ2xvYmFsbmV3cy5jYS9uZXdzLzk3NDY5NjgvYml0Y29pbi1wcmljZS11cy1zZWMtYmluYW5jZS1jcnlwdG8v0gFLaHR0cHM6Ly9nbG9iYWxuZXdzLmNhL25ld3MvOTc0Njk2OC9iaXRjb2luLXByaWNlLXVzLXNlYy1iaW5hbmNlLWNyeXB0by9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin tumbles as U.S. regulators sue crypto exchange Binance - Global News",
        "content": "Send this page to someone via email\n\nU.S. regulators sued Binance and its CEO Changpeng Zhao on Monday for allegedly operating a “web of deception,” piling further pressure on the world’s biggest cryptocurrency exchange and sending bitcoin to its lowest in almost three months.\n\nThe Securities and Exchange Commission (SEC) complaint, filed in a federal court in Washington, D.C., listed 13 charges against Binance, Zhao and the operator of its purportedly independent U.S. exchange.\n\nThe SEC alleged that Binance artificially inflated its trading volumes and diverted customer funds, as well as failed to restrict U.S. customers from its platform and misled investors about its market surveillance controls.\n\nThe SEC also claimed that Binance and Zhao, its billionaire founder and one of the crypto industry’s highest-profile moguls, secretly controlled customers’ assets, allowing them to commingle and divert investor funds “as they please.”\n\nBinance created separate U.S. entities “as part of an elaborate scheme to evade U.S. federal securities laws,” the SEC also alleged, citing a number of practices first reported by Reuters in a series of investigations into the exchange published thisyear and in 2022.\n\nStory continues below advertisement\n\nFrom almost three years ago until June 2022, a trading firm owned and controlled by Zhao, Sigma Chain, engaged in so-called wash trading that artificially inflated the trading volume of crypto asset securities on the Binance.US platform, the SEC also alleged.\n\n2:02 Crypto exchange Coinbase dismisses 20% of workers in 3rd round of layoffs\n\n“We allege that Zhao and Binance entities engaged in an extensive web of deception, conflicts of interest, lack of disclosure, and calculated evasion of the law,” SEC Chair Gary Gensler said in a statement.\n\nIn a blog post, Binance said: “We intend to defend our platform vigorously,” adding that “because Binance is not a U.S. exchange, the SEC’s actions are limited in reach.”\n\nFinancial news and insights delivered to your email every Saturday.\n\nFinancial news and insights delivered to your email every Saturday.\n\n“All user assets on Binance and Binance affiliate platforms, including Binance.US, are safe and secure,” the blog post said.\n\nBinance.US, which is ultimately controlled by Zhao, said in a tweet that the lawsuit was “unjustified by the facts, by the\n\nlaw, or by the Commission’s own precedent.”\n\nStory continues below advertisement\n\nBitcoin, the world’s biggest cryptocurrency, fell as much as six per cent on the news to its lowest in almost three months.\n\nBinance’s own cryptocurrency BNB, the world’s fourth-largest by market size, dropped more than five per cent.\n\nMarket players said the SEC’s allegations could hobble Binance, with the lawsuit likely to reverberate through the crypto industry. Binance dominates crypto trading, last year processing trades worth about $65 billion a day with up to 70 per cent of the market.\n\n“I think that there’s a big risk here that this could be crippling to Binance,” said Ed Moya, senior market analyst at Oanda.\n\n1:19 Bitcoins falls below US$20,000 for first time since 2020 amid financial turbulence\n\nLEGAL HEADACHES\n\nThe SEC complaint is the latest in a series of legal headaches for Binance, which was also sued by the U.S. Commodity Futures Trading Commission (CFTC) in March for operating what the regulator alleged were an “illegal” exchange and a “sham” compliance program. Zhao called those an “incomplete recitation of facts.”\n\nStory continues below advertisement\n\nBinance is also under investigation by the Justice Department for suspected money laundering and sanctions violations, according to people familiar with the probe.\n\nThe holding company of Binance, founded in Shanghai in 2017 by CEO Zhao, a Canadian citizen who was born and raised until the age of 12 in China, is based in the Cayman Islands. The exchange, however, says it does not have a headquarters and has declined to state the location of its main Binance.com exchange.\n\nThe SEC alleged that Zhao designed and implemented a plan to “surreptitiously evade U.S. laws.”\n\n“We do not want.com to be regulated ever,” the SEC alleged that Binance’s chief compliance officer admitted. Zhao directed Binance.US even though the U.S. entity has long said it operates independently, the SEC said.\n\nThe SEC said that billions of dollars in Binance customer funds were commingled – mixed with corporate funds, in breach of U.S. laws – in a bank account of an entity controlled by Zhao, and then transferred to a trading firm, Merit Peak, also controlled by Zhao.\n\n0:36 Cops warn of crypto scam after Winnipegger loses $168,000\n\nReuters reported last month that Binance commingled its customers’ funds with its corporate revenues in a U.S. bank account belonging to Merit Peak. Binance denied mixing customer deposits and company funds, saying that users who sent money to the account were not making deposits but rather buying Binance’s bespoke dollar-linked crypto token.\n\nStory continues below advertisement\n\nReuters reported on Monday before the SEC lawsuit that a senior Binance executive was the main operator for five bank accounts belonging to BAM Trading, the operator of Binance.US, including an account that held American customers’ funds.\n\nThe SEC wrote that the executive had at least until December 2020, also had “signatory authority over BAM Trading’s U.S. Dollar accounts.”\n\n(Reporting by Jonathan Stempel in New York, Hannah Lang in Washington and Tom Wilson in London, additional reporting by Angus Berwick in London and John McCrank in New York; Editing by Nick Zieminski)"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmZvcmJlc2luZGlhLmNvbS9hcnRpY2xlL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1leGNoYW5nZS1tZXJjYWRvLWJpdGNvaW4tZ2V0cy1wYXltZW50LXByb3ZpZGVyLWxpY2VuY2UvODU0MDEvMdIBfGh0dHBzOi8vd3d3LmZvcmJlc2luZGlhLmNvbS9hbXAvYXJ0aWNsZS9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tZXhjaGFuZ2UtbWVyY2Fkby1iaXRjb2luLWdldHMtcGF5bWVudC1wcm92aWRlci1saWNlbmNlLzg1NDAxLzE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Crypto exchange Mercado Bitcoin gets payment provider licence - Forbes India",
        "content": "Image: Shutterstock\n\nBrazil has a vibrant crypto market with huge demand for digital solutions. There are several other exchanges and platforms operating in the country, some of which have also obtained payment provider licences from the central bank. These crypto exchanges include Crypto.com and Bitso.\n\nMercado Bitcoin, a cryptocurrency exchange in Brazil, has been granted a payment provider licence from the country’s central bank on June 2, 2023. This licence will allow the company to launch its fintech solution MB Pay.“The approval of the Central Bank is a crucial step, as it allows us to continue expanding our business and providing a better service to our customers,” said Roberto Dagnoni, CEO of 2TM, which is the parent company of Mercado Bitcoin.MB Pay will offer Brazilian users specific digital banking solutions using crypto assets held on the exchange. It will enable them to invest in digital fixed-income investments, stake their crypto and access other financial transactions. Further it is anticipated that a debit card which will offer users to convert their crypto currency to fiat currency will go live soon.One of the leading crypto exchanges in Brazil, Mercado Bitcoin has more than 3 million customers and over $5 billion in trading volume. Traditional local broker Guide Investimentos had also previously announced a partnership with Mercado Bitcoin for entering into the digital asset market.Its fintech rollout had actually been planned for 2021 but was delayed because of the regulator’s approval process. The development came on the day on which Mercado Bitcoin had been ordered to return over 2,182 bitcoins.Coinbase, the largest crypto exchange of the US, is also expanding operations in the country by partnering with local payment providers to allow crypto purchases and withdrawals in Brazil’s local currency.Recently Brazil has witnessed several other crypto-related moves, such as Latam Gateway, Binance’s payment provider, receiving a similar licence. The company is a facilitator for foreign firms which seek to operate in Brazil.Overall, South American countries have been an attractive region for crypto. With many parts of the world struggling financially because of being underbanked or unbanked, nations like Brazil have attracted the attention of the crypto sector. This could make a huge change and include its citizens in the global financial market."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNi8wNS9zZWMtc3Vlcy1jcnlwdG8tZXhjaGFuZ2UtYmluYW5jZS1jZW8tY2hhbmdwZW5nLXpoYW8v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "SEC Sues Crypto Exchange Binance and CEO Changpeng Zhao, Alleging Multiple Securities Violations - CoinDesk",
        "content": "\"As a second part of Zhao’s and Binance’s plan to shield themselves from U.S. regulation, they consistently claimed to the public that the Binance.com Platform did not serve U.S. persons, while simultaneously concealing their efforts to ensure that the most valuable U.S. customers continued trading on the platform,\" the suit said. \"When the Binance.US Platform launched in 2019, Binance announced that it was implementing controls to block U.S. customers from the Binance.com Platform. In reality, Binance did the opposite. Zhao directed Binance to assist certain high-value U.S. customers in circumventing those controls and to do so surreptitiously because – as Zhao himself acknowledged – Binance did not want to 'be held accountable' for these actions.\""
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmtpdGNvLmNvbS9uZXdzL2FydGljbGUvMjAyMy0wNi0wNS9iaXRjb2luLXVuc3RvcHBhYmxlLWZpYXQtY2Fubm90LWJlLWZpeGVkLWFuZC1haS13aWxsLWFjY2VsZXJhdGUtaXRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin is unstoppable, fiat cannot be fixed, and AI will accelerate its collapse - Jeff Booth - KITCO",
        "content": "Get all the essential market news and expert opinions in one place with our daily newsletter. Receive a comprehensive recap of the day's top stories directly to your inbox. Sign up here!\n\n(Kitco News) - Bitcoin can already address the twin problems of currency depreciation and spiraling debt, but to see it you need to step outside of the current financial paradigm, according to Jeff Booth, General Partner at Ego Death Capital.\n\n“You have a monetary system that is 10,000 times bigger than Bitcoin today, and that relies on theft,” Booth said. “This is going to be hard to digest… because you're measuring a system problem from the system creating the problem, and all the politics on top, no matter what side, is just theater on top of a system problem.”\n\nBooth spoke with Michelle Makori, Lead Anchor and Editor-in-Chief at Kitco News at Bitcoin Miami earlier this month. He said our debt-based financial system cannot function without continuous currency depreciation, which makes ordinary people poorer even as real productivity skyrockets.\n\n“Globally, there's about 400 trillion dollars of debt,” he said. “If you try to pay back one trillion dollars at one dollar a second, it would take you approximately 32,000 years. So the debt is already insolvent, but we pretend it's solvent because we allow governments to manipulate money to pay back the debt with cheaper dollars tomorrow, and that manipulation of money carries a huge problem throughout society, because it's just manipulation.”\n\nBitcoin mirrors rise of e-commerce\n\nBooth said today’s Bitcoin vs. fiat analysis mirrors the online vs. physical store analysis from the 1990s and 2000s, seeing opportunities as threats and failing to account for the speed of technological change.\n\n“If you were an executive at Amazon from 1995 to 2010 versus an executive at Sears, you saw two different worlds,” he said. “You saw one getting easier and easier and easier, Amazon was providing more value to people and people were using it, it was getting stronger and stronger and stronger, and Sears was getting weaker and weaker and weaker, and your view of the world would be determined by what system you were looking through. Same world, it was just about the measure you were using to measure the world.”\n\nHe said this is exactly what’s happening in the financial system right now. “There is an open monetary network that any person on the planet can move over to, and essentially measure differently, and not have to pay for $400 trillion of debt that's already insolvent, and not having their wages decline in real terms every year,” he said. “More and more people are moving over to it, and once they measure the world from that new system, they see truth, hope, abundance.”\n\nAI will only magnify fiat manipulation\n\nBooth said the reason most people can’t see the proven advantages of the Bitcoin system is because they are measuring Bitcoin’s price from within the manipulated currency system, instead of using Bitcoin’s price stability to measure the devaluation of the fiat system. “They're saying bitcoin price is going up,” he said. “It's the opposite.”\n\nHe added that the economic and financial distortions caused by rising productivity being stolen by increased inflation will be magnified and accelerated with the advent of AI, automation and machine learning. “If you wait a year or two or three, artificial intelligence is going to merge with machines and it’s going to bring productivity gains that we can’t even imagine right now,” he said. “And it’s going to mean that the prices will fall faster and faster and faster.”\n\nCBDCs are about reasserting control\n\nBooth said that governments know they must maintain absolute control of the money in order to absorb all the real gains while staying ahead of the ballooning debt, and central bank digital currencies [CBDC] are their response to the decentralized, stable and honest pricing instrument that is Bitcoin.\n\nHe believes that despite resistance from people, banks and politicians, central banks could successfully implement CBDCs by giving the digital currency to the public. “Will people fall for it? Yes,” he said.”Because you’ll give people programmable money and you’ll say, ‘here’s a hundred dollars out of UBI,’ and you’ll lock them into that system. And a lot of people will think that they’re safe when they’ve just given away every individual right and freedom.”\n\nBooth believes, however, that CBDCs will ultimately fail for the same reason fiat itself must fail: countries will manipulate their own CBDC, but will never trust one another’s. “If you imagine every country with a CBDC, how could they trade together? How could there be global trade? Because then you’d have to manipulate every currency transition, the market rates between currencies,” he said “And this is all in parallel while Bitcoin is getting stronger and stronger and stronger. So they will fail.”\n\nHe said that once people understand that Bitcoin is actually pricing the baked-in risks of currency collapse and the debt spiral, rather than fiat pricing Bitcoin’s supposed volatility, they’ll recognize where the real value lies. “They see Bitcoin as a risk,” Booth said. “It’s the safest thing you could do right now.”\n\nTo hear which countries will be the first to leave fiat for Bitcoin, and how deflation could actually be a positive, watch the above video."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbmdlZWsuY29tL2RldmVsb3BpbmctYS1iaXRjb2luLXdhbGxldC1oZXJlLXdoYXQteW91LW5lZWQtdG8tY29uc2lkZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Jun 2023 07:00:00 GMT",
        "title": "Developing a Bitcoin wallet? Here's what you need to consider - CoinGeek",
        "content": "width=\"562\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nBitcoin wallets are a critical cog in the rise of digital currency adoption globally. Today, wallets have gone beyond the safe custody of users’ funds and offer features such as remittances, on/off ramps, day-to-day payments, direct bank withdrawals, and more. But what goes toward making the perfect Bitcoin wallet? This was the question the industry’s leaders in the field sought to answer on Day 1 of the London Blockchain Conference.\n\nThe panel discussion was moderated by the BSV Blockchain Association’s Kevin Healy on the technical stage. The panelists were Centbee founder Lorien Gamaroff, 4chain Studio CEO Michal Pawelski, DotWallet founder Lin Zheming, and TAAL’s Liam Missim.\n\nThe discussion starts with Healy asking whether new entrants must build their own solutions from scratch or leverage existing wallets. Lin pointed out that it all depends on the needs of the users.\n\n“We need to think about the user,” Pawelski concurred. “There are a lot of solutions already out there. Do we need another wallet, or another application that we surrender our crucial data to? For simple UTXO management, you can use existing tools that are battle tested.”\n\nThe panelists noted that security is one of the key concerns for anyone building a wallet. Missin says some formats, such as web wallets, have higher security risks. He believes the industry needs more standards to allow different interfaces to interact easily.\n\n“Security is a major topic,” Gamaroff added. He revealed that Bitcoin wallets are “constantly attacked, all the time.” Some, like Centbee, offer non-custodial solutions, easing the burden on security. However, he admitted that this is a band-aid solution as an average user doesn’t want the responsibility of securing their private keys.\n\nThe panelists delved into the dire need for regulations in the industry, having Bitcoin wallets at the operating system (OS) level, and the role that financial institutions play in the industry.\n\nThe challenges of wallet development\n\nOn challenges faced, the panelists noted that regulators have not caught up with the rapid pace of industry developments. Centbee, for instance, has failed in its quest to be regulated like other remittance companies despite offering the same services through Minit Money.\n\n“If we could get these licenses—since we’re performing the same function but using a different rail—we could enjoy some benefits like easy access to bank accounts,” Gamaroff said.\n\nA few high-profile delistings have also thrown a spanner in the works for the wallets, which must adapt quickly. Some popular hardware wallets also don’t support BSV blockchain, making it even more critical for BSV blockchain wallets to secure their platforms as they hold large sums of funds for their users.\n\nMost wallets offer both web and mobile platforms. According to Lin, the choice of platform depends on the target audience.\n\nAnother key challenge for Bitcoin wallets has been the ever-evolving industry standards impeding interoperability. Gamaroff noted that most exchanges still use legacy systems and addresses and have yet to adopt features such as Paymail and simplified payment verification (SPV).\n\n“It makes things more complex, and so you have to support everything. Eventually, hopefully, we can scale it down to just a few standards which the entire ecosystem can buy into,” he added.\n\nYet another challenge has been integrating legacy payment systems for off-and-on-ramps. Some, like Centbee, have resorted to providing their liquidity ecosystem where users can cash out directly to make payments or buy gift cards.\n\n“As adoption comes, these problems will go away,” Missin summed it up.\n\nWatch: How To Create a Wallet?\n\nwidth=\"562\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vYml0Y29pbi5jb20uYXUvaG93LW1hbnktc2F0b3NoaXMtaW4tMS1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "How Many Satoshis in 1 Bitcoin? - Bitcoin Australia",
        "content": "If you’re new to Bitcoin, you may have heard the term “satoshi” thrown around on various websites and wondered what it means. Satoshi Nakamoto, the elusive inventor of Bitcoin, introduced the concept of satoshis as the tiniest unit of the cryptocurrency. In this blog post, we’ll explore the world of satoshis and how they relate to one Bitcoin. Whether you’re a crypto newbie or just looking to expand your knowledge, let’s dive into the world of satoshis together.\n\nTable of Contents:\n\nWhat are Satoshis?\n\nCryptocurrency, particularly Bitcoin, is a rapidly growing market, and at the heart of it is the mysterious figure known as Satoshi Nakamoto. Satoshis, named after their enigmatic creator, represent the minuscule units of Bitcoin. Think of them as the “cents” of the Bitcoin world, similar to dollars and cents in the traditional currency system. Commonly abbreviated as “sats,” these smaller units help make Bitcoin transactions more manageable and flexible, especially when dealing with small amounts of money.\n\nHow Many Satoshis are in 1 Bitcoin?\n\nThere are exactly 100 million satoshis in one Bitcoin. This high level of divisibility allows Bitcoin to be easily split into tiny parts, making it more accessible for everyday use. To help you understand this concept better, we’ve created a table below to show how you can convert between Bitcoin and satoshis:\n\nBitcoin Satoshis 1 100,000,000 0.1 10,000,000 0.01 1,000,000 0.001 100,000 0.0001 10,000\n\nWhy Use Satoshis?\n\nUsing satoshis instead of whole Bitcoins can provide several benefits when making transactions. For instance, the divisibility of satoshis allows for more precise payments, especially when dealing with small amounts in dollars. As the current price of Bitcoin continues to grow, using satoshis can make transactions more manageable and user-friendly on various websites and platforms.\n\nExample:\n\nLet’s say you want to purchase a cup of coffee that costs 0.0003 Bitcoin, which is roughly equivalent to a ten dollars (inflation is rough!). To figure out how many satoshis you would need to pay, simply multiply 0.0003 by 100,000,000. This results in a total of 30,000 satoshis. In this case, one unit of Bitcoin (30,000 satoshis) is equal to the cost of your cup of coffee.\n\nWhere can I use Satoshi?\n\nWhile Bitcoin is becoming more and more popular, it’s important to remember that not all merchants and service providers accept cryptocurrency as a form of payment. However, you can still use your satoshis to purchase goods and services through various cryptocurrency exchanges and platforms that do accept Bitcoin. To use your satoshis, you’ll need to convert them into BTC and then transfer them into your wallet or account. Always do thorough research before making a purchase to ensure that the website or service you’re using is reputable and trustworthy.\n\nHow Much is One Satoshi Worth?\n\nThe value of one satoshi is directly tied to the price of Bitcoin. As the price of Bitcoin fluctuates, so does the value of a satoshi. To determine the value of one satoshi in dollars, simply divide the current price of Bitcoin by 100,000,000. Keep in mind that the value of cryptocurrencies like Bitcoin can be volatile, so the worth of one satoshi may change from day to day or even within a single day.\n\nAdvantages of Satoshis:\n\nOne of the key advantages of satoshis is their divisibility, which allows Bitcoin to be broken down into tiny parts. This makes it easier to conduct transactions of various sizes and helps facilitate the widespread adoption of cryptocurrency. Additionally, using satoshis can make it more manageable to handle price fluctuations in the Bitcoin market, especially when converting to and from dollars.\n\nDisadvantages of Satoshis:\n\nDespite their advantages, satoshis can be subject to fluctuations in value. As the price of Bitcoin changes, the value of a satoshi can become more or less desirable. Additionally, the speculative nature of the cryptocurrency market means that investing in satoshis and Bitcoins may not be suitable for everyone.\n\nFAQ:\n\nAre Satoshis subject to transaction fees?\n\nYes, satoshis are subject to transaction fees, just like any other unit of Bitcoin. When you send satoshis from one wallet to another or use them to make a payment, there may be a small fee involved. These fees help support the network and incentivize miners to maintain the blockchain. It’s essential to keep these fees in mind when making Bitcoin transactions on websites and platforms.\n\nCan I earn Satoshis through mining?\n\nYes, you can earn satoshis through mining. When you mine Bitcoin, you’re essentially solving complex mathematical problems to validate transactions on the blockchain. In return, you’re rewarded with newly minted Bitcoin. As Bitcoin is divisible into satoshis, your mining rewards can be broken down into tiny units, too.\n\nAre Satoshis subject to capital gains tax or other taxes?\n\nThe tax treatment of satoshis varies depending on your country’s laws and regulations. In many countries, satoshis are subject to capital gains tax, just like any other asset. It’s important to consult with a tax professional or conduct thorough research to understand the tax implications of holding or transacting with satoshis in your jurisdiction.\n\nWe hope this blog post has given you a better understanding of satoshis and their role in the world of cryptocurrency, particularly Bitcoin. As you continue to explore Bitcoin and other cryptocurrencies, keep in mind the various advantages and potential drawbacks of using satoshis in your transactions on websites and platforms. Remember to stay informed and always conduct thorough research before making any financial decisions. Good luck on your crypto journey, and may the satoshis be with you!"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V0aGVyZXVtLWhvbGRpbmctcHJpY2UtYmV0dGVyLXRoYW4tYml0Y29pbi1jYW4tYXZvcmFrLXRyYWRlLWV4cGxhaW4td2h5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 04 Jun 2023 07:00:00 GMT",
        "title": "Ethereum holding price better than Bitcoin, can Avorak Trade explain why? - Analytics Insight",
        "content": "Avorak Trade has been making waves in the crypto market while still in development. With the Ethereum (ETH) holding price better than Bitcoin (BTC), investors wonder whether Avorak Trade can help.\n\nEthereum (ETH) and Bitcoin (BTC) price\n\nCorrelations are incredibly important in the crypto markets. The correlation between the Ethereum (ETH) and Bitcoin (BTC) prices was close to 1.0, which made it less crucial to track. However, recent reports indicate a decline in the correlation, dropping from 0.95 in mid-March to 0.82 in mid-April. ETH is gaining more value in relation to BTC as time progresses. This shift could be attributed to various factors, including Ethereum’s recent technical upgrades. Additionally, Ethereum’s diversified ecosystem, encompassing decentralized finance (DeFi), NFTs, blockchain gaming, and more, sets it apart from Bitcoin, which is primarily used as a payment method. Investors increasingly recognize Ethereum’s potential, and some speculate that with a stronger and more diversified ecosystem, Ethereum could eventually flip Bitcoin. However, the crypto market is highly unpredictable, and it remains to be seen whether Ethereum (ETH) can surpass Bitcoin (BTC) and become the most valuable cryptocurrency by market capitalization.\n\nWhat is Avorak Trade? Can it help?\n\nAvorak Trade is a powerful trading tool developed by Avorak AI. It can offer valuable insights and assistance in understanding the dynamics of cryptocurrency markets, including the contrasting price movements of Ethereum (ETH) and Bitcoin (BTC). Avorak Trade utilizes advanced AI algorithms and machine learning to analyze vast amounts of market-related data, identifying patterns and trends that may impact the price correlation of BTC and ETH. Avorak Trade then provides price predictions and significant indicators with timely notifications of changes and real-time analysis of market patterns, giving users a deeper understanding of market trends and allowing them to make more informed trading decisions.\n\nAvorak Trade also includes an AI trading bot that can execute complex trades on behalf of users. The bot learns from the market movements and its user’s strategies and preferences to enable smooth automated trading. Users don’t have to be expert traders or tech-proficient as the bot uses a simple non-code command-line input and can employ AI algos to find and execute the best possible trades. The Avorak Trade bot can work across exchanges and asset classes, providing a resourceful AI-driven trading solution. Whether you are interested in understanding the factors behind Ethereum’s higher holding price or seeking assistance in navigating and profiting from the complex crypto market, Avorak Trade offers a comprehensive solution with timely insights and enhanced trading outcomes.\n\nTo access Avorak Trade and other Avorak AI solutions, such as chatbots and image creators, users require the AVRK token. AVRK is the native utility token of the Avorak AI ecosystem and it can be traded for other cryptocurrencies or fiat. The AVRK token is available through Avorak’s initial coin offering (ICO), where 1AVRK is currently at $0.255 in phase 7. The ICO offers many benefits to investors, including token bonuses and priority access to Avorak’s beta products. A number of analyses point to a possible surge in AVRK’s price. Thus, the ICO offers a great opportunity to get AVRK at discounted prices and several other advantages over open-market buyers.\n\nTo get more information on Avorak AI and its ICO:\n\nWebsite: https://avorak.ai\n\nBuy AVRK: https://invest.avorak.ai/register\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vYml0Y29pbmlzdC5jb20vZWwtc2FsdmFkb3JzLWJpdGNvaW4tYmlsbC1pcy1ub3ctdHdvLXllYXJzLW9sZC_SAUpodHRwczovL2JpdGNvaW5pc3QuY29tL2VsLXNhbHZhZG9ycy1iaXRjb2luLWJpbGwtaXMtbm93LXR3by15ZWFycy1vbGQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 07:00:00 GMT",
        "title": "El Salvador’s Bitcoin Bill Is Now Two Years Old, How Has The Country Fared Since Then? | Bitcoinist.com - Bitcoinist",
        "content": "On June 5, 2021, El Salvador made waves across the financial space when its bill to make Bitcoin a legal tender in the country was first made public. Since then, the North American country has gone on to completely implement BTC as a legal tender in the country, as well as invest a significant amount in the digital asset as well. Here’s how the country has fared since then.\n\nEl Salvador Down On Its Bitcoin Bet\n\nShortly after President Nayib Buckle passed the bill and made Bitcoin a legal tender in El Salvador, the country would begin buying BTC in large quantities. The first purchase saw the country buy a total of 400 BTC for $18.724 million for an average price of $46,811 on September 6, 2021, a day before BTC officially became legal tender in the country.\n\nIn the months that followed, Bukele would double down on his decision to invest in the cryptocurrency using the country’s funds, disregarding warnings from financial institutions like the International Monetary Fund (IMF) to stop doing so.\n\nThe next purchase happened just a day later on September 7 with a purchase of 150 for approximately $6.9 million. El Salvador has continued to purchase BTC since then on a semi-consistent basis since then, which has brought its total BTC stash to 2,381 as of its last purchase on June 30, 2022, of 80 BTC at an average price of $19,000 worth $1.52 million at the time.\n\nEl Salvador's total BTC purchases | Source: BuyBitcoinWorldwide\n\nHowever, El Salvador’s dollar cost average (DCA) has not helped its position so far. The country has spent a total of $103,233,360 on its BTC purchases since 2021 at an average price of $43,357. At current prices, El Salvador’s BTC stash is worth around $61.3 million, meaning the country is nursing a $40 million loss on its BTC investment.\n\nBTC Adoption In The Country\n\nSince September, BTC has operated as a legal tender in El Salvador, allowing residents to pay for goods and services using the cryptocurrency. However, the adoption has not been as swift as expected as the US dollar remains dominant in the country.\n\nFollowing the 2021 official announcement, there were reports of protests about the use of BTC as a legal tender, with many citing the security and economic risks of using a volatile digital asset as a legal tender. And even today, those concerns remain at the forefront of the minds of lawmakers.\n\nBTC retests $26,000 resistance | Source: BTCUSD on TradingView.com\n\nIn May, US senators James Risch, Bob Menendez, and Bill Cassidy introduced a bill to require El Salvador to report on the adoption of BTC in the country. This bill called the Accountability for Cryptocurrency in El Salvador Act proposes to assess “the risks for cybersecurity, economic stability, and democratic governance in El Salvador.”\n\nPresident Bukele is yet to respond to this bill which has given a 90-day window for the plan to be submitted to the committees of Congress involved in the matter.\n\nOn June 5, Reuters reported that El Salvador entered into a public-private partnership to invest $1 billion into creating a large Bitcoin mining farm. Volcano Energy confirmed this, revealing that the country will first put $250 million into the project as it looks to build one of the largest BTC mining farms in the world."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vdGhlY3VycmVuY3lhbmFseXRpY3MuY29tL3dlYnN0b3JpZXMvbWVyY2Fkby1iaXRjb2luLXJlY2VpdmVzLWJyYXppbGlhbi1jZW50cmFsLWJhbmstbGljZW5zZS10by1iZWNvbWUtcGF5bWVudC1wcm92aWRlci_SAX9odHRwczovL3RoZWN1cnJlbmN5YW5hbHl0aWNzLmNvbS93ZWJzdG9yaWVzL21lcmNhZG8tYml0Y29pbi1yZWNlaXZlcy1icmF6aWxpYW4tY2VudHJhbC1iYW5rLWxpY2Vuc2UtdG8tYmVjb21lLXBheW1lbnQtcHJvdmlkZXIv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 05 Jun 2023 00:05:17 GMT",
        "title": "Mercado Bitcoin Receives Brazilian Central Bank License to Become Payment Provider - The Currency Analytics",
        "content": "With a population nearing 214 million and a growing demand for digital solutions, Brazil has become an attractive destination for cryptocurrency companies. Global exchanges like Binance have recognized the country's immense potential and identified Brazil as a prime market for expansion. Binance's local partner, Latam Gateway, secured a payment provider license in Brazil in May, solidifying their presence in the region. Other cryptocurrency exchanges, such as Crypto.com and Bitso, have also obtained payment provider licenses in the country. Moreover, American exchange Coinbase has been steadily expanding its operations in Brazil since March, offering crypto purchases and facilitating deposits and withdrawals in local currency through partnerships with local payment providers."
    }
]