[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTIzL2JpdGNvaW4tYnRjLWhhbHZpbmctaW4tMjAyNC1zcHVycy1wcmVkaWN0aW9ucy1vZi1yYWxseS1wYXN0LTUwLTAwMNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin 'Halving' Due Next Year Spurs Predictions of Rally in Token Past $50000 - Bloomberg",
        "content": "Bitcoin’s rebound is just the start of a rally that will take it past $50,000 next year courtesy of a process known as halving that curbs the supply of new tokens, according to projections from crypto analysts.\n\nThe largest digital asset has climbed 67% since Dec. 31 in a partial revival from an epic rout in 2022. While the token at the moment is struggling in the vicinity of $30,000, halving holds the potential to trigger an advance of at least 81%, according to Bloomberg Intelligence and Matrixport."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzIyL2hlcmUtYXJlLXNpeC1uZXctcHJvamVjdHMtbG9va2luZy10by1taXRpZ2F0ZS1iaXRjb2luLW1pbmluZ3MtZW5lcmd5LWZvb3RwcmludC_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDQvMjIvaGVyZS1hcmUtc2l4LW5ldy1wcm9qZWN0cy1sb29raW5nLXRvLW1pdGlnYXRlLWJpdGNvaW4tbWluaW5ncy1lbmVyZ3ktZm9vdHByaW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Apr 2023 07:00:00 GMT",
        "title": "Here Are Six New Projects Looking to Mitigate Bitcoin Mining’s Energy Footprint - CoinDesk",
        "content": "Here Are Six New Projects Looking to Mitigate Bitcoin Mining’s Energy Footprint\n\nFrom technical improvement efficiencies to novel market-based solutions, a plethora of projects are trying to improve the bitcoin mining’s environmental footprint.\n\nBy Eliza Gkritsi Apr 22, 2023 at 2:51 p.m. UTC"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzIzL2JpdGNvaW5zLXZvbGF0aWxpdHktaXMtZGVjcmVhc2luZy1oZXJlcy13aHktaXRzLWdvL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Volatility Is Decreasing -- Here's Why It's Good News for Investors - The Motley Fool",
        "content": "Bitcoin (BTC -0.21%) has long been criticized for its high volatility, which is often cited as a major barrier to adopting the cryptocurrency as a legitimate investment. However, in recent years, its volatility has been steadily decreasing, and this trend looks poised to continue in the future.\n\nHere's why this shift could be the under-the-radar catalyst that leads to Bitcoin's continued success in the coming years and decades.\n\nWhy Bitcoin is volatile\n\nTo start, let's look at why Bitcoin experiences such dramatic price fluctuations. First, it is traded internationally 24 hours a day, seven days a week. It isn't limited to set hours like the stock market. With people all over the world trading at all hours of the day, substantial swings can and do occur.\n\nSecond, Bitcoin is a relatively new asset. With limited historical data, the market struggles to assign an accurate price, which can also lead to sudden price swings. Unlike traditional assets, which have a history of finding fair value in particular economic conditions, Bitcoin is constantly under pressure to find a more accurate valuation depending on market sentiment, recent news events, and investor behavior.\n\nAlthough Bitcoin remains more volatile than traditional assets like stocks or bonds, there is a clear trend that its volatility has been tempering since the cryptocurrency was invented in 2009, with a considerable decline since 2022.\n\nBut why is this and how can it benefit investors?\n\nA substantial shift\n\nThere may be several reasons Bitcoin is becoming less volatile.\n\nOne of the primary draws of Bitcoin for investors is its use as a store of value. Many investors are now treating Bitcoin as a long-term investment option, rather than a short-term speculative asset. As more people start holding on to their Bitcoin for longer periods of time, the demand for Bitcoin will become more stable, resulting in less price volatility.\n\nIn addition, the Bitcoin market is maturing. The world's first cryptocurrency is no longer just a niche investment alternative for a few tech-savvy investors. It's now a mainstream investment option for millions of people and even some institutions.\n\nThe combination of these factors helped Bitcoin's total market cap rebound and stabilize after plunging last year. The market cap size alone -- now at almost $600 billion, bigger than all but a handful of companies -- makes it harder for large traders or institutional investors to swing the price of Bitcoin, which in turn has reduced its volatility. In other words, the larger Bitcoin's market cap becomes, the harder it is for large buy or sell orders to have an effect on the price.\n\nThe opportunity at hand\n\nSo why is the decreasing volatility of Bitcoin a good thing for investors? Well, quite simply, it turns the narrative of high volatility on its head. Rapidly fluctuating prices have been one of the primary reasons risk-averse investors shied away, but as Bitcoin's volatility decreases, its risk profile becomes more akin to that of other traditional assets that are found in most portfolios. In time, the cryptocurrency could become a more attractive option for portfolios of all risk levels.\n\nEven better, as more investors begin to see Bitcoin as a legitimate asset class, the demand for the cryptocurrency should continue to grow, which will in turn not only help to stabilize its price but cause it to rise as the pressures of increased demand meets Bitcoin's finite supply of 21 million coins.\n\nThis won't happen overnight, but data show Bitcoin's volatility has been diminishing over the years. Ahead of the day when Bitcoin becomes a legitimate asset for investors of all risk levels, it makes investing today a promising opportunity with the cryptocurrency still almost 60% below its all-time high."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWNhc2gtYmNoLWlzLW5vdy1ob21lLXRvLWFuLWlubm92YXRpdmUtbGV2ZXJhZ2UtdHJhZGluZy1hcHDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Cash (BCH) is now home to an innovative leverage trading app - Cointelegraph",
        "content": "Decentralized finance (DeFi) is one of the largest sectors in crypto. The applications within the DeFi space consist of decentralized trading, borrowing and lending, and many more financial services. However, even with its rising popularity, the sector has many obstacles to overcome before mass adoption is possible.\n\nThe rise of DeFi\n\nThe growth of DeFi’s popularity was volatile and quick, which follows suit with the overall development of the crypto industry. During the peaks of 2021, the sector saw almost $180 billion in total value locked in the many protocols that still exist today. Of course, the DeFi space also got hit by the crypto winter.\n\nRecently, DeFi stood out in the market upturn during the first quarter of 2023. The DeFi space rose $29.6 billion in value, making the sector stand out against the performances of major asset classes like gold and oil.\n\nThe popularity of DeFi can be attributed to the increasing amount of decentralized applications (DApps) and the flow of users from centralized to decentralized exchanges, among other reasons. However, while the increasing popularity is a positive development, there are some caveats.\n\nRise in transaction costs\n\nOne of the caveats is the rising transaction costs once more users start using a network. Investors experienced this during the bull market in 2021; the Ethereum (ETH) network saw a large influx of transactions, mainly happening within the DeFi space. The result was steeply rising transaction costs on the network. Sending crypto became so expensive that users faced a significant barrier to interacting with DeFi DApps.\n\nAnother risk is that of vulnerabilities such as smart contract back door keys, massive centralization on single contracts, and counter-party risks of custodial stablecoins. With numerous bridge hacks plaguing the space, and failures of algorithmic protocols such as Terra, using DeFi DApps is certainly not without risk. However, the industry keeps evolving, with many new platforms aiming to improve the issues and challenges current DApps deal with.\n\nDeFi on Bitcoin Cash\n\nThanks to the continuous development since its foundation in 2017, Bitcoin Cash (BCH) can also perform as a vibrant environment for smart contract deployment and the creation of DeFi DApps on its UTXO mainchain. One new project that has recently launched is BCH Bull.\n\nWith the help of the AnyHedge protocol, BCH Bull lets users create long or hedge positions on several assets, such as the United States dollar, Bitcoin (BTC) and gold. Users can even add leverage to their on-chain trades. Roger Ver, a well-known Bitcoin Cash supporter and early investor in AnyHedge, said about this use case: “Allowing people to permissionlessly lock the value of their Bitcoin Cash to the price of external legacy currencies is an incredibly useful tool for people who don’t want to deal with cryptocurrency price volatility. That’s why I chose to invest in AnyHedge.”\n\nSource: BCH Bull\n\nScalable and no centralized smart contract risks\n\nThe main difference between comparable apps on Ethereum is that each trade has its own independent smart contract. Once two traders agree on the terms, the smart contract is initiated. This eliminates centralized security risks for smart contracts.\n\nFurthermore, the UTXO-based protocol of Bitcoin Cash prevents high transaction fees and makes the chain scalable, meaning fees don’t increase even if the transaction volume on the network increases.\n\nSince October 2022, BCH Bull has been in beta, in which it has already created and redeemed over 3,000 smart contracts. The project has now been released into full production mode this month. Its growing user base can now initiate up to 90-day-long contracts at 2~3x the previous contract size, enjoying the security and scalability that Bitcoin Cash offers.\n\nLearn more about BCH Bull"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL3d3dy5wb3N0YW5kY291cmllci5jb20vYnVzaW5lc3Mvc2MtYml0Y29pbi1taW5lci1zYXlzLWl0cy1idXNpbmVzcy1pcy10aHJlYXRlbmVkLWJ5LWJhbmtydXB0LXZlbmRvci9hcnRpY2xlXzcyMDQ0M2IyLWRlYzUtMTFlZC05NTI2LTI3ZjM2YjU3OTZkNC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Apr 2023 07:00:00 GMT",
        "title": "SC bitcoin miner says its business is threatened by bankrupt vendor - The Post and Courier",
        "content": "A Greenville-based cryptocurrency business led by a former gubernatorial candidate says a bankrupt vendor that provides high-powered computers vital to its operations is threatening to pull the plug unless it's paid more money.\n\nGEM Mining has asked a judge to intervene in its dispute with Austin, Texas-based Core Scientific Inc., which filed for bankruptcy protection in December.\n\nThe legal battle provides a glimpse into the murky world of bitcoin mining, an industry that relies on thousands of computers to solve complicated math equations to earn the world's most valuable form of crypto.\n\nGEM said in court documents that data processor Core Scientific has repeatedly threatened to reject contracts to provide computer equipment, known as \"miners,\" as part of its restructuring unless GEM agrees to renegotiate the agreements \"with a materially higher hosting rate.\"\n\nDuring a conference call last month, Core Scientific executives said they would \"intentionally shut down\" GEM's equipment by April 3 if GEM did not agree to terminate or rework the deals, according to court documents.\n\nJudge David Jones called the allegations \"troubling\" in an April 13 order requiring Core Scientific to provide uninterrupted service to GEM pending a hearing on May 22.\n\nJohn Warren, GEM's president and a 2018 candidate for South Carolina governor who previously founded Lima One Mortgage, did not respond to requests for comment last week. Neither did an attorney representing Core Scientific.\n\nThe bankruptcy filing stems in part from the shakeup following last year's epic collapse of the cryptocurrency exchange FTX and the subsequent arrest of founder Sam Bankman-Fried on fraud charges. Bitcoin tumbled from a 52-week high of $42,945 to a low of $15,516 in the wake of the scandal. Prices have since stabilized at around $30,305 but are still far below their peak.\n\nCore Scientific — which provides mining services for itself and clients at data centers in five states — also felt the brunt of soaring energy costs, with electricity to power and cool the company's high-speed computers one of its biggest expenses. The company listed about $1.3 billion in debts and has obtained financing to reorganize its business."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTIxL2JpdGNvaW4tYnRjLXN0dW1ibGVzLXRoaXMtd2Vlay1hZnRlci0zMC0wMDAtdGhyZXNob2xkLWZhaWxzLXRvLWhvbGTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Stumbles This Week After $30000 Threshold Fails to Hold - Bloomberg",
        "content": "Bitcoin is ending the week on a down note after failing to sustain momentum once it pushed past $30,000 for the first time since June.\n\nThe largest cryptocurrency by market value has dropped about 10% since last Sunday to around $27,300, rounding out its first weekly loss in four. Bitcoin had climbed as high as $31,013 on March 14, and has surged around 65% this year, helping to soften the blow from a similar-sized decline in 2022."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzIyL2JpdGNvaW4tdnMtZ29sZC13aGljaC1vbmUtaXMtYS1iZXR0ZXItaW52ZXN0bWVudC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin vs. Gold: Which One Is a Better Investment? - The Motley Fool",
        "content": "Over the past decade, Bitcoin (BTC -0.22%) has catapulted into the spotlight as the premier cryptocurrency. Along the way, multiple narratives have arisen to justify an investment in Bitcoin. One of those is that it is like \"digital gold\" because, like gold, it can act as a store of value and a hedge against inflation.\n\nSo if Bitcoin is basically digital gold, which is the better investment?\n\nThe tale of the tape\n\nTo start, let's talk about the concept of a store of value. A store of value is an asset that preserves wealth and acts as a counter to economic declines and inflation, with the expectation that it will also appreciate over time. Gold has long been considered to meet this criterion.\n\nWhen we compare the price of both since Bitcoin was created in 2009, it becomes clear that while gold does a fair job at preserving wealth, it comes nowhere near the combination Bitcoin provides of preserving and growing wealth.\n\nWhat the numbers say\n\nSince 2009, the inflation-adjusted return of gold annually has been about 3.3%, and the total return has been about 57%. In the same period, Bitcoin has an inflation-adjusted annualized return of nearly 145% and a total return of 33,983,965%.\n\nNow, clearly there is a flaw in this comparison because gold has been in existence for millennia and Bitcoin has only been around for 14 years. So let's take it back further.\n\nSince 1980, gold's performance has proven lackluster, generating an annualized return of 3.1% before inflation. After we account for 40 years of inflation, gold produced an unappetizing annualized return of -0.24% and a total return of -10.1%.\n\nFrom this angle, it becomes clear that not only does Bitcoin outpace gold in terms of preserving wealth as a store of value and as a hedge against inflation, it also does an excellent job of growing wealth.\n\nWhy Bitcoin?\n\nBut to truly understand how Bitcoin has risen to this level, it helps to understand how it improves upon some of the primary characteristics that originally made gold attractive to investors.\n\nBitcoin and gold both exist in finite amounts. But Bitcoin takes this a step further. While gold is finite in the sense that it is a physical resource that needs to be mined, its supply is not fixed and can fluctuate based on mining activity and new discoveries. However, Bitcoin's supply is fixed at 21 million coins, and new coins will gradually enter circulation at a diminishing rate until the year 2140, when the last Bitcoin will be mined.\n\nAnother advantage of Bitcoin over gold is its portability and ease of transfer. Bitcoin can be sent anywhere in the world in a matter of minutes, without the need for intermediaries such as banks or payment processors. All one needs is an internet connection.\n\nIn addition, Bitcoin has a high degree of divisibility, with each coin divisible into 100 million satoshis. This makes it easier to use Bitcoin as a medium of exchange for small transactions, something that isn't as feasible with gold. While Bitcoin as form of currency hasn't quite materialized like some might hope, there is progress being made thanks to growing adoption of payment solutions like the Lightning Network.\n\nFinally, it is worth mentioning the technological advancements that Bitcoin represents. Bitcoin is built on blockchain technology, a decentralized digital ledger that is immutable and transparent. This means that every transaction that takes place on the Bitcoin network is verified and recorded on the blockchain, making it virtually impossible for anyone to alter or manipulate the data. This level of transparency and security is unprecedented in the world of finance and represents a significant leap forward.\n\nConsider these additional characteristics and the simple fact that Bitcoin has recently dominated gold in terms of its performances as a store of value and inflation hedge, and it becomes clear that an investment in Bitcoin today could prove valuable. In a world that is becoming increasingly digital and as the need for alternatives to inflation-prone fiat currencies persists, Bitcoin is in a unique position to benefit for decades to come as increased demand runs up against its finite supply."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWhvbGRpbmctMjdrLWNvdWxkLW9wZW4tYnV5aW5nLW9wcG9ydHVuaXRpZXMtaW4tYm5iLWFkYS14bXItYW5kLXRvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price holding $27K could open buying opportunities in BNB, ADA, XMR and TON - Cointelegraph",
        "content": "Bitcoin (BTC) is on target to finish the week with a sharp fall of around 9%. This suggests that some traders may be booking profits in fear of a resumption of the downtrend. Analysts expect Bitcoin to reach the $26,600–$25,000 zone, where buying interest may pick up.\n\nWhen an asset emerges from a bear market, it tries to form higher lows on the way up. These levels act as strong supports during subsequent corrections. The current pullback could end up forming a higher floor for Bitcoin, which may act as a launch pad for the next rally.\n\nCrypto market data daily view. Source: Coin360\n\nIf long-term investors believe that a bottom has been made, then panicking and selling on every corrective phase is not a good strategy. Rather, every dip could be an opportunity to build a portfolio.\n\nThe correction in Bitcoin has pulled several altcoins lower. Only a handful of major cryptocurrencies are holding out and looking strong on the charts. Let’s study the charts of five cryptocurrencies that may outperform on the way up.\n\nBitcoin price analysis\n\nBuyers are trying to arrest Bitcoin’s correction at the 50-day simple moving average (SMA) ($26,983), but the shallow bounce suggests that the bears are not willing to give up.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe 20-day exponential moving average (EMA) ($28,606) has started to turn down, and the relative strength index (RSI) is in the negative zone, signaling that bears have a slight edge. The selling could pick up further if the 50-day SMA cracks.\n\nThe BTC/USDT pair could then tumble to the breakout level of $25,250. This is an important level to keep an eye on because if this support crumbles, the pair may plunge to $20,000.\n\nBuyers will have to push and sustain the price above the 20-day EMA to signal a comeback. That could attract buying and push the price toward the $31,000–$32,500 resistance zone.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe pair bounced off $27,125 and reached the 20-day EMA. This is the first hurdle that the bulls need to cross to start a strong recovery. The pair may then reach the 50-day SMA, where the bears will again try to mount a strong defense.\n\nIf the price turns down from the current level and slides below $27,125, it will suggest that the sentiment remains negative and traders are selling on every minor rally. That will increase the likelihood of a fall to $26,500 and eventually to $25,250.\n\nBNB price analysis\n\nBNB (BNB) is witnessing a tough battle between the bulls and the bears. Sellers are active above $338, while the bulls are fiercely defending the 50-day SMA ($316).\n\nBNB/USDT daily chart. Source: TradingView\n\nThe BNB/USDT pair rebounded off the 50-day SMA on April 21, and the bulls are attempting to clear the hurdle at $338. If they succeed, it will enhance the prospects of a rally above $346. The pair may then soar toward $400. The gradually upsloping 20-day EMA ($325) and the RSI in the positive territory indicate that bulls have a slight edge.\n\nIf bears want to prevent the up-move, they will have to yank the price back below the 50-day SMA. That could accelerate selling and sink the pair to $300 and thereafter toward $280.\n\nBNB/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the price rebounded off the support near $316 and has reached the 50-SMA. If bulls overcome this obstacle, the pair will try to rise to $338 and subsequently to $346. A break above this level could witness a pick-up in bullish momentum.\n\nThe first support to watch on the downside is the 20-day EMA. If this support gives way, it will suggest that the pair may consolidate between $315 and $335 for some time. The advantage will tilt in favor of the bears if the $315 support gives way.\n\nCardano price analysis\n\nCardano’s ADA (ADA) turned down and plunged back below the neckline of the inverse head-and-shoulders (H&S) pattern on April 20. This indicates that the bears are trying to trap the aggressive bulls. A minor positive in favor of the buyers is that they are trying to guard the 50-day SMA ($0.37).\n\nADA/USDT daily chart. Source: TradingView\n\nThe 20-day EMA ($0.40) has turned down, and the RSI is just below the midpoint, indicating that sellers are trying to seize control. If the price plummets below the 50-day SMA, it will suggest that the bears are in the driver’s seat. The ADA/USDT pair could then collapse to $0.30.\n\nConversely, if buyers want to retain their supremacy, they will have to quickly thrust the price back above the neckline. If they manage to do that, the pair could witness solid buying. The pair may then surge to $0.46.\n\nADA/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bears pulled the price below the uptrend line and are trying to flip the level into resistance on a retest. The downsloping 20-EMA and the RSI in the negative territory indicate that bears have the upper hand. If the price slips below $0.38, the selling could intensify, and the pair may plunge to $0.34.\n\nThis negative view will invalidate in the near term if buyers propel the price back above the uptrend line. Such a move will suggest that the recent breakdown may have been a bear trap. The recovery is likely to pick up momentum after buyers push the price above the 50-SMA.\n\nRelated: Chinese city public servants to receive digital yuan salaries starting May\n\nMonero price analysis\n\nMonero (XMR) turned down from the neckline of the developing inverse H&S pattern, but the sharp recovery from lower levels indicates aggressive buying on dips.\n\nXMR/USDT daily chart. Source: TradingView\n\nBuyers have pushed the price back above the 20-day EMA ($157) and will again try to challenge the neckline. If this level is scaled, it will complete the bullish setup, clearing the path for a potential rise to $185 and thereafter to the pattern target of $199.\n\nIf the price turns down from the current level or the neckline, it will signal that bears are selling on rallies. A break and close below $149 will signal that bears have seized control. The XMR/USDT pair may then slump to $145 and later to $140.\n\nXMR/USDT 4-hour chart. Source: TradingView\n\nThe pair is trading inside a descending channel pattern on the four-hour chart. The snapback from the support line of the channel shows solid buying at lower levels. If buyers sustain the price above the 50-SMA, the pair could rally to the resistance line of the channel.\n\nContrarily, if the price continues lower and slides below the 20-EMA, it will suggest that the pair may remain stuck inside the channel for some more time. The bears will gain the upper hand on a break below the channel.\n\nToncoin price analysis\n\nToncoin (TON) has formed a bearish descending triangle pattern, but a positive sign in favor of the buyers is that the price has been trading near the resistance line of the triangle for the past few days.\n\nTON/USDT daily chart. Source: TradingView\n\nThe bulls will try to drive and sustain the price above the resistance line, which will invalidate the bearish setup. A breakdown of a negative pattern usually results in an up-move because aggressive traders who may have gone short in anticipation of a decline cover their positions.\n\nAdditionally, bullish traders who have been sitting on the sidelines due to the negative setup jump in to buy. Above the resistance line, the TON/USDT pair could rally to $2.64 and thereafter to $2.90.\n\nThis positive view will invalidate in the near term if the price turns down and breaks below $2.20.\n\nTON/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the pair is rising inside an ascending channel pattern. In the near term, the bears are trying to protect the $2.33 level, but the bulls continue to attack the level with vigor.\n\nIf the $2.33 level gives way, the pair may start its journey toward the resistance line of the channel near $2.45. Alternatively, if the price once again turns down from $2.33, the bears will try to sink the pair to the support line of the channel.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzIyLzMtdG9wLWNyeXB0b3MtdGhhdC1jb3VsZC1zb2FyLWhpZ2hlci10aGFuLWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Apr 2023 07:00:00 GMT",
        "title": "3 Top Cryptos That Could Soar Higher Than Bitcoin - The Motley Fool",
        "content": "In the crypto market, all eyes are on Bitcoin (BTC -0.07%), the world's largest cryptocurrency by market capitalization. At one point, Bitcoin was up more than 80% for the year, as it soared to a price of $30,000. However, Bitcoin has started to pull back in recent days and is now up only 3% over the past 30 days.\n\nAt the same time, a number of cryptos are keeping pace with Bitcoin's overall performance. For example, Ethereum (ETH -0.89%) is up more than 63% for the year and 10% over the past 30 days. And both Avalanche (AVAX 2.69%) and Cardano (ADA -1.75%) are up more than 64% for the year. Here's a closer look at why these three cryptos could be ready to soar higher than Bitcoin.\n\nThe Layer 1 blockchain thesis\n\nAll three of these cryptos are premier Layer 1 blockchains. You can think of these blockchains as the \"building blocks\" of the crypto industry. Once you have a Layer 1 blockchain like Ethereum, you can start to build on top of it. That means enjoying things like non-fungible tokens (NFTs), smart contracts, decentralized finance (DeFi), blockchain gaming, and web3 decentralized applications.\n\nImportantly, these are all innovations the Bitcoin blockchain was not designed to offer. Bitcoin is, first and foremost, a potential store of value, similar to gold. Satoshi Nakamoto, the anonymous creator of Bitcoin, also designed it to be a peer-to-peer electronic cash system. But beyond that, Bitcoin does not offer nearly the functionality and diversification that you find with the big Layer 1 blockchain networks. If you want to get involved in the world of decentralized finance (DeFi), for example, you go to a blockchain like Ethereum.\n\nAs a result, one powerful investment thesis right now involves Layer 1 blockchains. All three of these Layer 1 blockchains -- Ethereum, Cardano, and Avalanche -- are highly diversified, and all of them rank as Top 15 cryptocurrencies by market capitalization. In terms of market cap, Ethereum trails only Bitcoin. Cardano, which launched back in 2017, now ranks as the No. 7 crypto in terms of market cap.\n\nOf these three, Avalanche (No. 15 in terms of market cap) may be the least-known among casual investors. However, during the last crypto bull market rally, Avalanche was routinely discussed as a potential \"Ethereum killer\" and comes with a solid pedigree. And in January 2023, Avalanche signed an important partnership deal with Amazon Web Services to offer blockchain services to large corporate and government clients.\n\nThe flight to quality\n\nHowever, not all Layer 1 blockchains are seeing the same type of performance as Ethereum, Cardano, and Avalanche. For example, if you look at the next tier of smaller Layer 1 blockchains, many of them are actually struggling right now. For example, Aptos (CRYPTO: APT) is down 9% over the past 30 days, and Algorand (CRYPTO: ALGO) is down 11%.\n\nThe big factor here appears to be an overall flight to quality by investors. While sentiment has turned markedly bullish for crypto in 2023, there is still a realization that we're not out of the woods yet. Case in point: Bitcoin seemed to be unstoppable for the first three months of the year but now is struggling to soar past $30,000.\n\nAs a result, investors are still searching out high-quality names. This generally means a focus on cryptos with huge market caps and the biggest blockchain ecosystems. This explains why some Layer 1 blockchains are doing so well while others are not.\n\nWhich Layer 1 blockchain is the best investment?\n\nIn choosing between top Layer 1 blockchains, the obvious choice would be Ethereum. This crypto, just like Bitcoin, is a favorite of institutional investors. It has a huge market cap, a well-diversified ecosystem, and a huge developer base. Ethereum also ranks No. 1 in terms of NFT trading volume and No. 1 in terms of Total Value Locked (TVL), which is a key metric for determining how much activity is actually taking place on a blockchain. Moreover, in late 2022, Ethereum completed a highly successful technological transformation -- known as The Merge -- that sets the stage for strong long-term growth.\n\nHowever, if you're looking for a dark horse candidate that might end up outperforming Ethereum over the long run, it's Cardano. This crypto, which has never traded higher than $3.10, is en fuego this year. It's up 64% for the year, which is keeping pace with both Ethereum and Bitcoin. And it has a new strategy based around DeFi that is going gangbusters. The latest first-quarter 2023 metrics for Cardano are now in, and all signals are flashing green.\n\nNow is the time to invest in high-quality Layer 1 blockchains that have diverse blockchain ecosystems and solid long-term growth prospects. The three names on my list right now are Ethereum, Cardano, and Avalanche."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRyYWRlcnMtY2FsbC1mb3ItY2FsbS1hcy1idGMtcHJpY2Utc2xpcHMtMTAtaW4tYS13ZWVr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 22 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin traders call for calm as BTC price slips 10% in a week - Cointelegraph",
        "content": "Bitcoin (BTC) barely held $27,000 on April 22 as another round of losses left bulls with little firepower.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nGiant RSI support retest greets Bitcoin bulls\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD barely preserving the $27,000 mark on April 22 after the Wall Street trading week ended on a sour note.\n\nIn contrast to United States equities, which managed to seal modest gains on April 22, Bitcoin continued to suffer as analysts warned of a return toward $25,000.\n\nWith that, BTC/USD was down 10% for the week and 4% in April overall, according to data from monitoring resource Coinglass, amid a dramatic turnaround in fortune versus much of Q1.\n\nBitcoin monthly returns chart (screenshot). Source: Coinglass\n\nFor popular trader Credible Crypto, however, there was still every reason to hope that the long-term uptrend remained intact.\n\n“If your macro thesis on Bitcoin has changed because of a $2,000 pullback after a $10,000+ vertical rally from 19k to 30k+ you’re doing it wrong,” he insisted in part of his latest Twitter commentary.\n\nIn an additional post, he argued that such price action is “common” in crypto markets.\n\n“The last major retest we had was at 19k before our rally to 30k+. A retest of 25k here would be logical and healthy,” he stated.\n\nBTC/USD annotated chart. Source: Credible Crypto/Twitter\n\nFinancial information resource Stockmoney Lizards agreed, telling Twitter followers that the road higher may be slow and steady.\n\n“After these huge green candles, we usually find some cooldown,” it wrote regarding the three-month BTC/USD chart.\n\n“Short-/mid-term still bullish (3 months), but don't expect it to go too fast.”\n\nCrypto analyst CryptoCon delivered similar conclusions on the basis of the latest movements in Bitcoin’s relative strength index (RSI).\n\nUsed to determine overbought and oversold conditions at given price points, the RSI can help offer insights into forthcoming price trends.\n\n“Short term #Bitcoin price action seems grim, but behind the scenes, the Weekly RSI has broken out of a 6-year downtrend and is now attempting to make support,” CryptoCon revealed, comparing the latest action to prior halving cycles.\n\n“Bitcoin is now at decision point. Continue 2019 parabolic price action, or take the healthier, steady 2015 approach?”\n\nBTC/USD annotated chart with RSI. Source: CryptoCon/Twitter\n\nBTC price analyst expects “stronger buy interest” near $25,000\n\nTrader Skew, meanwhile, delved into the potential near-term price targets for BTC/USD, focusing on moving averages (MAs).\n\nRelated: Forget BTC price: The Bitcoin mining boom is quietly going parabolic\n\nThe zone north of $25,000 remained the principal point of interest, with the 200-week MA residing at $25,850.\n\n$BTC 1D\n\nFailed breakout above 1D resistance $30K\n\n\n\nWill be interesting if price retests $25K & 1W Trend MAs\n\n\n\nI'd expect a stronger buy interest around there as it's closest to invalidation there before HTF demand around $19K pic.twitter.com/D5eP9ujyHh — Skew Δ (@52kskew) April 22, 2023\n\nThe market composition remained apt to liquidate traders, with Coinglass data showing April 22 costing crypto longs another $173 million.\n\nAs Cointelegraph reported, April 19 saw the largest amount of long liquidations of 2023 so far.\n\nCrypto liquidations chart. Source: Coinglass\n\nMagazine: Crypto regulation: Does SEC Chair Gary Gensler have the final say?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA0LzIzLzctdGhpbmdzLXRoYXQtbmVlZC10by1oYXBwZW4tZm9yLWNyeXB0by10by1yZWJvdW5kL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "7 Things That Need to Happen for Crypto to Rebound - The Motley Fool",
        "content": "The crypto market has been a wild ride so far, and the road got even bumpier than usual in 2022. A lot of folks are left wondering what it would take for the sector to bounce back for real. The glory days of 2021, where Bitcoin (BTC -0.21%) nearly reached $70,000 per digital coin and Ethereum (ETH -1.09%) peaked just below $4,900, almost feel like a fever dream. Were those soaring prices ever real?\n\nNow that things are starting to calm down a bit, there are a few crucial factors that could steer the market's course. I believe that blockchain tech and cryptos will hit the mainstream eventually, but in terms of exact timing, we're all just throwing darts at the calendar.\n\nThe future of crypto investments depends on so many factors, seemingly unrelated, that add up to a massive speed bump at the moment. Settling all of these issues at once would release a bull run worthy of a sweltering summer in Pamplona, but we are far more likely to see a gradual process of steps forward and then back again.\n\nSevillian Flamenco, anyone? Follow the beat!\n\nLet me count the ways\n\nAhem. Not sure why I'm daydreaming about summer in Spain when discussing the future of crypto. I guess I'm getting excited about the game-changing promise and pulse-pounding risks of cryptocurrencies. So let's explore the factors that could reduce the risks and release the crushing pressure on crypto prices.\n\nRegulatory clarity: One of the primary challenges facing the crypto market is the lack of a clear regulatory framework. I mean, this is Step #1 for good reason -- most of the improvements below can't move forward until we have firmer laws and regulations around ownership, taxation, and trading of cryptocurrencies. Governments and regulatory bodies -- in America and around the world -- need to establish well-defined rules and guidelines for the industry to foster innovation while also ensuring consumer protection. Scalability solutions: Scalability has long been a hurdle for cryptocurrencies, especially for widely used networks like Bitcoin and Ethereum. Using effective performance-boosting solutions such as the Lightning Network and Optimism could significantly improve transaction speeds and lower fees, making cryptocurrencies more attractive for everyday use. Institutional adoption: For cryptocurrencies to rebound, institutional investors must continue embracing digital assets. As more corporations and financial institutions invest in cryptocurrencies and incorporate them into their operations, this could create a ripple effect, ultimately boosting the entire market. Enhanced security: As cyberattacks and fraud continue to plague the crypto space, enhancing security measures is crucial. I mean, the cryptocurrencies themselves are often quite robust, but the trading exchanges and other institutions that manage them have not always held up to scrutiny. More robust security protocols and tools on this level will help protect investors and instill greater confidence in digital assets. Education and awareness: The general public's understanding of cryptocurrencies and their underlying technology remains limited. For crypto to rebound, it's essential to raise awareness and educate people about the benefits, risks, and potential applications of digital assets. Lots of people are under the impression that serious wealth management tools like Bitcoin and advanced financial transaction systems such as Ethereum are immature playthings or outright scams. In reality, these innovative assets will probably change the nature of money, payments, ownership, and transactions on a global scale. Yes, that's serious business. I am not exaggerating the long-term promise of properly regulated cryptocurrencies. A more informed public is more likely to embrace and adopt crypto-based financial concepts. Mainstream integration: And the educational requirement dovetails neatly with my next point. The whole reason why cryptocurrencies are valuable in the first place is because they can help billions of people do many things in a cheaper, faster, more reliable way. But first, the consumer-facing tools that make it happen must be invented, developed, and cleared of showstopping bugs. In other words, digital assets must become more seamlessly integrated into everyday life. From using cryptocurrencies for daily transactions to implementing blockchain technology in various industries, making crypto more accessible and user-friendly will encourage broader adoption. Market stability: Finally, for cryptocurrencies to regain their footing, the market needs to stabilize. Calmer volatility and a more mature crypto market would go a long way toward inviting more risk-averse investors into the crypto space. That includes the deep-pocketed financial institutions mentioned earlier.\n\nSo there you have it, folks! While these factors could set the stage for a crypto rebound, remember that it's up to us investors to keep our wits about us and make educated decisions before jumping in. The market's future might be shrouded in mystery, but all you need is some patience, knowledge, and a dash of courage. With those wealth-building tools in your pocket, you could witness cryptocurrencies going mainstream and early crypto investors reaping the rewards in the market."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNyYXdscy0yLTUtb2ZmLWxvd3MtYXMtd2Vla2x5LWNoYXJ0LXJpc2tzLWJlYXJpc2gtZW5ndWxmaW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price crawls 2.5% off lows as weekly chart risks 'bearish engulfing' - Cointelegraph",
        "content": "Bitcoin (BTC) sought to snatch back lost ground on April 23 as 10-day lows remained in place.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\n$26,600 becomes popular BTC price target\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it rose to circle $27,700 at the time of writing.\n\nUp around 2.5% from the lows set the day prior, the pair remained on traders’ radar as a potential short opportunity into the weekly close.\n\n“$26,600 is my target in my short position right now, and being the weekend it may take a bit longer to get there,” Crypto Tony confirmed to Twitter followers on April 23.\n\n“It is the most logical target and we also have bids popped up down there too now, so i am expecting a reaction once tested.”\n\nBTC/USD annotated chart. Source: Crypto Tony/Twitter\n\nThat target would mark a new bottom for Bitcoin, which lost 10% over the week to turn its April performance negative overall.\n\nAnalyst Mark Cullen eyed the potential for BTC/USD to approach the April 21 CME futures closing price of $27,310 before the weekly close.\n\n“Lots of bids sitting at 26.5k, but not sure they get tapped just yet,” he added in accompanying commentary, offering a target similar to Crypto Tony.\n\nBTC/USD annotated chart. Source: Mark Cullen/Twitter\n\nA further tweet noted increased spot market selling on Binance, the largest exchange, potentially adding downside pressure in an otherwise less-liquid weekend trading environment.\n\nGM #Crypto!\n\n\n\nLooks like the @binance spot selling is still trying to push price lower. They took a break as markets closed on Friday, but the algos seem to be kicking back in. pic.twitter.com/VQCROCYOnU — AlphaBTC (@mark_cullen) April 23, 2023\n\n“Horrendous bearish engulfing” looms\n\nMarket participants appeared to share the same consensus over BTC price action more broadly, suggesting that short-term bearish moves were not yet apt to change the overall bullish trend for 2023.\n\nRelated: Forget BTC price: The Bitcoin mining boom is quietly going parabolic\n\nAmong them was Michaël van de Poppe, founder and CEO of trading firm Eight, who likewise shared the popular downside targets.\n\nThe weekly chart, he added, was still on track to print a higher low (HL), thus preserving the uptrend.\n\n“I don't see the entire bearish perspective,” he argued.\n\n“Weekly timeframe we’re seeking for a HL, which seems as a possible case around $26,500-27,000 (perhaps $25,000). Breaking back above $27,800 is probably a strong upwards reaction to $29,000 for #Bitcoin and continuation of the uptrend.”\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nPopular trader CryptoBullet sounded more nervous — even while acknowledging that a weekly candle eclipsing a full month’s progress would not necessarily spell the end of the bull run.\n\n#Bitcoin $BTC 1W\n\n\n\nEven if we close the weekly candle as a horrendous Bearish Engulfing, it’s not over yet\n\n\n\nLet me remind you what we had back in 2019 during the same Echo Bubble rally:\n\n\n\n1 - Bear Market Low\n\n2 - First Bounce\n\n3 - Higher Low\n\n4 - Weeks of sideways consolidation after… pic.twitter.com/MI4yYTAKBe — CryptoBullet (@CryptoBullet1) April 22, 2023\n\nMagazine: Crypto regulation: Does SEC Chair Gary Gensler have the final say?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3Lm91dGVydGVtcGxlLmNvbS9kby1iaXRjb2luLWRldmVsb3BlcnMtb3dlLWZpZHVjaWFyeS1kdXRpZXMtdG8tdGhlLXRydWUtb3duZXJzLW9mLWEtZGVmcmF1ZGVkLWNyeXB0b2Fzc2V0LW93bmVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "Do bitcoin developers owe fiduciary duties to the true owners of a defrauded cryptoasset owner? - Outer Temple Chambers",
        "content": "Do bitcoin developers owe fiduciary duties to the true owners of a defrauded cryptoasset owner?\n\nOuter Temple’s Anson Cheung comments on the case of Tulip Trading which was first heard in the High Court. This case generated much interest in being the first case to argue that bitcoin developers owed fiduciary duties to the true owners of a defrauded cryptoasset owner.\n\nThat argument was quickly shot down in the High Court for having no prospects of success, but has now been resuscitated by the Court of Appeal.\n\nBackground\n\nFollowing an alleged hacking and subsequent theft of keys controlling approximately £3b in cryptoassets, Tulip Trading Limited (Tulip) issued proceedings against certain crypto developers who it claimed controlled and ran 4 different bitcoin networks.\n\nTulip claimed that the developers owed it a fiduciary duty and/or tortious duty of care, such that the developers were obliged to assist Tulip in regaining control and use of the cryptoassets. In a novel argument, Tulip argued the fiduciary duties owed should extend to implementing the necessary software patch which would have the effect of transferring the digital assets to which access has been lost to a new address.\n\nAll the developers were out of jurisdiction, and jurisdiction was so challenged. Therefore the proceedings before the first instance judge and the Court of Appeal proceeded in the context of the first limb of the jurisdiction test, being whether that there is a serious issue to be tried.\n\nThe first instance judge held that the second and third limb of the jurisdiction test had been established, but that Tulip could not establish the first limb – i.e. there was no realistic prospect of establishing that the facts pleaded amount to a breach of fiduciary or tortious duty owed by the defendants to Tulip.\n\nCase Comment\n\nThe judgment of the Court of Appeal was outstandingly clear. There are three interesting observations that are worth bearing in mind:\n\nFirst, Birss LJ recognised that any recognition that the developers owed a fiduciary duty to bitcoin owners would be a significant development in the law (at [86]). However, he noted that there was often frequent warning in the authorities against deciding controversial points of law in a developing area on assumed or hypothetical facts rather than on the basis of actual factual findings. Therefore, whether or not there was a fiduciary duty in law in the circumstances alleged by Tulip ought to be decided “once the facts are established” (at [91]). This is particularly relevant given that there was dispute between Tulip and the developers as to whether it was the miners who controlled the software in a decentralised manner by creating a ‘fork’ in the software, or whether it was the developers who would create such a ‘fork’ by producing rival protocols.\n\nSecond, Birss LJ noted that applying common law principles on fiduciary duties – particularly, the classic definition of a fiduciary as set out in Bristol and West Building Society v Mothew [1998] Ch 1 – were capable of applying to developers:\n\n“The developers of a given network are a sufficiently well-defined group to be capable of being subject to fiduciary duties. Viewed objectively the developers have undertaken a role which involves making discretionary decisions and exercising power for and on behalf of other people, in relation to property owned by those other people. That property has been entrusted into the care of the developers. The developers therefore are fiduciaries[…] The content of the duties includes a duty not to act in their own self interest and also involves a duty to act in positive ways in certain circumstances. It may also, realistically, include a duty to act to introduce code so that an owner’s bitcoin can be transferred to safety in the circumstances alleged by Tulip.”\n\nSuch an approach highlights the incremental approach of courts of England and Wales to blockchain technology and cryptoassets more generally: the courts apply the usual common law principles “by analogy with existing cases”, for example by considering whether bitcoin (itself a new and novel concept) fits the classic definitions of ‘property’. (at [71])\n\nThird, Birss LJ’s analysis of how fiduciary duties would function in the context of bitcoin network developers was enlightening. He noted that the developers control the software which creates bitcoins, much like banks but ‘the bank’s developers have nothing like the control over the customer’s assets which Tulip alleges the bitcoin developers have over bitcoin” (at [72]). Such control involved taking active steps to update, or to decline an update to the code, and such decisions ultimately involved an exercise of authority which were entrusted to them by bitcoin owners, much as beneficiaries would entrust decisions to trustees. In making such decisions, the developers would owe duties to bitcoin owners “not to compromise the owners’ security in that way. It would be a duty which involves abnegation of the developer’s self-interest. It arises from their role as developers and shows that the role involves acting on behalf of bitcoin owners to maintain the bitcoin software.” (at [76])\n\nConclusion\n\nTo conclude, the argument proceeds to a full trial. If it succeeds and the courts of England and Wales do impose such a fiduciary duty on the developers, it will undermine the notion of decentralised governance of bitcoin, and one of the fundamental tenets behind blockchain technology and cryptoassets. Indeed, as the Court of Appeal concluded in its final paragraph, “if the decentralised governance of bitcoin really is a myth, then in my judgment there is much to be said for the submission that bitcoin developers, while acting as developers, owe fiduciary duties to the true owners of that property”.\n\nTo view the judgment from the High Court, click here.\n\nThe Court of Appeal judgment can be found here.\n\nFind out more\n\nAnson Cheung practices in international arbitration, construction and commercial litigation, financial services, professional negligence and pensions.\n\nPrior to starting the BPTC, Anson worked in the Legal Office of the UN World Food Programme in Rome. For the BPTC, Anson was awarded the most prestigious scholarship at Gray’s Inn, the Bedingfield Scholarship, and an Advocacy Award for aptitude in advocacy from BPP University. She was called to the Bar by Gray’s Inn in 2019.\n\nTo find out more, contact Sam Carter on +44 (0)203 989 6669 or Colin Bunyan on +44 (0)20 7427 4886 for a confidential discussion.\n\nLegal Blogs"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LnRoZXN1bi5jby51ay9tb25leS8yMjEzNTY2OC93YXJuaW5nLWZha2UtbWFydGluLWxld2lzLWJpdGNvaW4tc2NhbS_SAVNodHRwczovL3d3dy50aGVzdW4uY28udWsvbW9uZXkvMjIxMzU2Njgvd2FybmluZy1mYWtlLW1hcnRpbi1sZXdpcy1iaXRjb2luLXNjYW0vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 23 Apr 2023 07:00:00 GMT",
        "title": "Urgent warning over fake Martin Lewis bitcoin scam that’s losing people £80,000 – here’s how to stay safe... - The Sun",
        "content": "INVESTORS have been warned about a fake Martin Lewis bitcoin scam which cost one elderly couple their life savings.\n\nRetired Barbara and Ewan Atkins (not their real names) lost £80,000 to the fraudster who pretended to be endorsed by the money saving expert.\n\n2 The MoneySavingExpert website says it nor Martin Lewis ever endorse a product or investment Credit: Rex\n\nThe conman convinced the pair, both 78, to use popular e-money platform Revolut to avoid fraud checks.\n\nHe explained how to set up accounts with Wise, Binance and Revolut, which the couple had not heard of, before giving them details on how to avoid triggering fraud prevention processes.\n\nBut when the attempted to withdraw their money and were told they needed to make more payments, they realised they had been scammed.\n\nThey told their daughter and son-in-law, who contacted the banks in order to report the fraud.\n\nThe family say though Revolut’s response was not sufficient, particularly when they were contacted about their complaint and it included links to a foodbank website and Age UK.\n\nConcerns about Revolut’s ability to deal with fraud cases and money laundering have been raised by senior industry insiders who say the e-money institution, which is not a bank in the UK, is the “vehicle of choice” for fraudsters.\n\nHaving moved back to the UK from France, they spotted an advert for Bitcoin online in late February.\n\nIt appeared to be backed by the consumer champion Martin Lewis and thought it would be a good way to stretch out their savings.\n\nHaving clicked on the link, they were then called by a man calling himself Michael Hampton whose apparent online profile made him out to be some “dynamic international investor”.\n\nHe convinced them that their bank, Barclays, would question their large transactions and that they should tell them they were planning a big purchase.\n\nBarclays did flag the payments as being unusual and contacted the couple to make sure they were happy to move the money.\n\nThe conman then told the pair how to create an account with Wise, a foreign exchange service started in 2011, so they could invest in Bitcoin.\n\nThey transferred £10,000 to the account, which was flagged by Wise and the account was closed.\n\nSET UP REVOLUT ACCOUNT\n\nThe scammer then talked the couple into setting up a Revolut account, saying that only the first payment would be flagged on the system.\n\nThey made 14 transactions of between £3,000 and £5,000 over the next few days, encouraged by the “investment manager” who phoned them repeatedly each day.\n\nWhile the first transaction did prompt a warning message from Revolut none of the other transactions were challenged.\n\nThe elderly couple got daily updates on their nearly £65,000 “investment” which they were told had almost doubled in just four weeks.\n\nHowever, when they attempted to withdraw the money, the fraudsters told them they had to pay £10,000 for capital gains tax.\n\nIt was then they realised they had been conned and told their daughter and son-in-law.\n\nWhen they got in touch with Barclays fraud team that they realised just how much money had been lost.\n\nThe bank said that because it has warned them about the payments and called them before the money left their account it would not refund the money they had lost.\n\nRevolut initially told the couple there had been “no trace” of fraudulent activity and then said they would not reimburse them.\n\nIt sent a number of links, in the hope that “this information helps you understand the situation and stay safe in the future”.\n\n'DISGUSTED'\n\nTheir son-in-law and daughter told the MailOnline they were “disgusted” at how dismissive Revolut had been.\n\nThey said they were amazed the fraud processes at the online platform hadn’t picked up the unusual payments quicker and the initial response from Revolut said they weren’t fraudulent.\n\nTheir daughter said: “It’s a permanent weight on our minds. We were shell-shocked as well that my parents had been scammed like that.”\n\nShe added that sending a link to a foodbank showed Revolut’s lack of interest, insensitivity and lackadaisical approach.\n\nShe said: “Everybody knows about foodbanks, so we didn’t need to see that as a link from Revolut.”\n\nThe pensioners have now taken their case to the financial ombudsman.\n\nA senior industry insider, a director of compliance at a large firm, said Revolut was the “vehicle of choice” for money launderers and fraudsters.\n\nFigures quoted by the news outlet suggest Revolut has been struggling with protecting customers against fraud, with the number of crime reports made to Action Fraud rising from 3,975 in 2021 to 7,198 last year, an increase of 81 per cent.\n\nThose figures also account for cases where the fraudsters funnel money through Revolut accounts, or when an identity has been stolen and fake account created.\n\nIn early March, Revolut, which offers current account services but is not a bank in the UK, said it would be getting its banking licence “imminently”.\n\nRevolut is not signed up to the Contingent Reimbursement Model (CFM) in the UK, which is a voluntary agreement between banks that they will repay victims of some kinds of fraud.\n\nA Wise spokesman said: “We are truly sorry to learn of the scam Mr and Mrs Atkins have fallen victim to.\n\n“We’re currently investigating the case and will be in touch with them directly regarding updates on the remaining funds.”\n\nGareth Shaw, deputy editor at Martin Lewis's website MoneySavingExpert.com, said: “Sadly, this is similar to scams we’ve been seeing for years.\n\nHere at MSE, we find it so frustrating and disheartening that many scammers get away with it Gareth Shaw deputy editor at MoneySavingExpert\n\n“Please know – and spread the word if you can – that neither MoneySavingExpert nor Martin Lewis ever endorse products or investments.\n\n“Here at MSE, we find it so frustrating and disheartening that many scammers get away with it.\n\n“It's why MSE and Martin Lewis have always tried to close down their routes to the general public and create awareness through campaigning.”\n\nA Barclays spokesperson said: “We have every sympathy with our customer who was a victim of a sophisticated investment scam.\n\n“We urge everyone to stay vigilant to fraudulent investment opportunities.\n\n“Please take steps to satisfy yourself that the person or business you are investing through is legitimate and who you think it is, and check the FCA website and warning list to ensure they are a regulated financial firm before transferring any funds.\n\n“Remember, if the investment seems too good to be true, it probably is.'\n\nA Revolut spokesman said: “We are very sorry that Mr and Mrs Atkins were targeted by ruthless and highly sophisticated criminals.\n\n“We take our responsibility to protect and support our customers extremely seriously and have made significant investments in our systems, processes and people to ensure that our customers are safe.\n\n“When making an investment, we urge everyone to take steps to satisfy themselves that the person they are sending money to is legitimate.\n\n“We encourage customers to check the investment company is genuine and a regulated firm. If in doubt, seek trusted independent financial advice first.”\n\nIt said it was “deeply concerned” about fraud involving fake social media ads and fake phone calls."
    }
]