[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA3LzE0L2JpdGNvaW4tY2FzaHMtcmVtYXJrYWJsZS0xNjUtcmlzZS1jYW4tdGhlLWdyb3d0aC1jL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Cash's Remarkable 195% Rise: Can the Growth Continue? - The Motley Fool",
        "content": "In the last month, few other cryptocurrencies have surged as much as Bitcoin Cash (BCH 1.91%). After a lackluster start to 2023, things changed in June and so far this year it's up more than 195%.\n\nHowever, despite the short-term gains, Bitcoin Cash investors should exercise extreme caution and keep their hopes for a continued run in check. By taking a closer look at the reasons behind Bitcoin Cash's recent momentum and its position relative to its predecessor, Bitcoin (BTC 0.04%), it becomes clear that there are better options for your portfolio.\n\nThe big news\n\nOn June 15, a new crypto exchange called EDX made its debut, setting itself apart from popular exchanges like Coinbase Global and Binance due to its non-custodial services. Adding to the uniqueness of EDX is the backing it received from notable names on Wall Street, including Charles Schwab and Fidelity, among others.\n\nOut of the four cryptocurrencies permitted for trading on EDX, Bitcoin Cash is one of them, alongside Bitcoin, Ethereum, and Litecoin. The selection of these cryptocurrencies was a deliberate move by EDX to avoid regulatory scrutiny, as these cryptos are considered among the most decentralized and, therefore, not classified as securities under Securities and Exchange Commission (SEC) regulations.\n\nConsequently, when this news broke, Bitcoin Cash surged as traders perceived it to have gained an endorsement from Wall Street and recognized it as a truly decentralized asset. While this may seem like bullish news, it fails to capture the full picture of Bitcoin Cash's bleak future.\n\nA little context\n\nIn 2017, a group of miners and developers proposed changing the Bitcoin code to allow for larger blocks, with the aim of facilitating faster transactions. However, this proposal faced resistance from the broader Bitcoin community. As a result, developers decided to hard fork the Bitcoin blockchain, thereby creating a separate cryptocurrency known as Bitcoin Cash that included larger block sizes.\n\nAt its inception, Bitcoin Cash gained traction and reached the top 10 cryptocurrencies by market value. However, as time went on, the novelty of Bitcoin Cash wore off, and it began to lose its market appeal as the realization that Bitcoin could meet the needs of users in its original form solidified.\n\nThe clear leader\n\nSome of the key reasons Bitcoin remains a superior investment compared to Bitcoin Cash lie in the current developments within the Bitcoin ecosystem and its unparalleled levels of decentralization and security.\n\nWhile Bitcoin Cash emphasizes larger block sizes and faster transaction speeds, Bitcoin continues to make significant strides in addressing scalability issues. Layered solutions like the Lightning Network, for example, are helping Bitcoin to become more efficient by enabling instant transactions through off-chain payment channels, all while maintaining the security and decentralization of the Bitcoin main chain. Furthermore, Bitcoin remains orders of magnitude more decentralized and secure, as its slower block times and smaller block sizes keep the costs to run a node and participate in the network to a minimum.\n\nWhen it comes down to comparing price appreciation between the two, it becomes evident that Bitcoin has consistently outperformed Bitcoin Cash over time. The value of Bitcoin Cash relative to Bitcoin has shown a downward trend, indicating a lack of long-term growth and inability to keep pace with its predecessor.\n\nWhile Bitcoin Cash may have experienced a temporary surge due to its listing on the EDX crypto exchange and the perceived endorsement from Wall Street, it is important to approach such developments with caution. The fundamental strengths of Bitcoin, including its robust infrastructure, widespread adoption, and established reputation, make it the more reliable and secure investment option.\n\nEventually momentum behind Bitcoin Cash will likely fade, just as it has before. In preparation for this reality, investors are better off prioritizing the original and proven cryptocurrency for a more secure and rewarding investment strategy."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA3LzE0L2JsYWNrcm9jay1jZW8tbGFycnktZmluay10YWxrcy11cC1jcnlwdG8tZGVtYW5kLWZyb20tZ29sZC1pbnZlc3RvcnMv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDcvMTQvYmxhY2tyb2NrLWNlby1sYXJyeS1maW5rLXRhbGtzLXVwLWNyeXB0by1kZW1hbmQtZnJvbS1nb2xkLWludmVzdG9ycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "BlackRock CEO Larry Fink Talks Up Crypto Demand From Gold Investors - CoinDesk",
        "content": "\"If you look at the value of our dollar, how it depreciated in the last two months and how much it appreciated over the last five years ... an international crypto product can really transcend that,\" he said. \"That's why we believe there's great opportunities and that's why we're seeing more and more interest. And the interest is broad-based [and] worldwide.\""
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wNy8xNS9jb2luYmFzZS1yb2Jpbmhvb2QtYml0Y29pbi1taW5pbmctc2hhcmVzLXN1cmdlLXJpcHBsZS1ydWxpbmctc2VjLWNyeXB0by_SAWtodHRwczovL2ZvcnR1bmUuY29tLzIwMjMvMDcvMTUvY29pbmJhc2Utcm9iaW5ob29kLWJpdGNvaW4tbWluaW5nLXNoYXJlcy1zdXJnZS1yaXBwbGUtcnVsaW5nLXNlYy1jcnlwdG8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jul 2023 07:00:00 GMT",
        "title": "Coinbase, Robinhood, Bitcoin miners surge as Ripple ruling bodes well for crypto plays: ‘This is a positive read-through’ - Fortune",
        "content": "Shares of companies with exposure to cryptocurrencies surged this week as investors cheered a key ruling on one token as a win for the industry.\n\nCoinbase Global, Inc. gained 34% this week, its best performance for the period since mid-March, despite closing 1.6% lower Friday.\n\nOther crypto-linked stocks also had positive weekly performances. Robinhood Markets, Inc. rose 15% this week, its best in nearly a year, and Bakkt Holdings Inc. gained 30%. Bitcoin mining companies such as Marathon Digital Holdings, Hut 8 Mining Corp., Riot Platforms, Inc. and Cipher Mining Inc. also saw weekly gains, even as some sold off Friday.\n\nThursday’s ruling that the Ripple Labs Inc. token is a security when sold to institutional investors — but not the general public — was the biggest contributor to gains. The decision added to optimism over Bitcoin ETF applications that lifted investor spirits and Bitcoin earlier in the week.\n\n“This is a positive read-through to COIN as it sets precedent that crypto token sales through exchanges, at least in the XRP case, did not violate securities laws,” Needham analyst John Todaro wrote in a note, boosting his price target to $120 from $70 on the buy-rated stock. “We believe this outcome should moderately de-risk the regulatory pressure on the stock.”\n\nOf course, the ruling was specific to Ripple and shouldn’t be hastily applied across the industry, Benjamin Salisbury of Height Capital Markets said in a note.\n\n“We note that the ruling is specific to facts in this case alone and caution against applying this ruling to the Coinbase lawsuit broadly,” Salisbury said. “We also expect the SEC to appeal the ruling, given the potential implications for securities laws.”\n\nOutside of regulations, short covering may also be lifting crypto-linked stocks whose 2023 rallies have set up contrarian traders to be squeezed.\n\nIn the last month, short sellers bought back $407 million worth of Coinbase shares to exit their positions, according to data from S3 Partners LLC. This year, Coinbase shorts have paper losses of $2.9 billion, making it the seventh least-profitable short behind Tesla Inc., Nvidia Corp., Apple Inc., Microsoft Corp., Meta Platforms Inc. and Amazon.com Inc., S3 said."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjM5NTgxL2pwbW9yZ2FuLWJpdGNvaW4taGFsdmluZy1zdHJlc3MtdGVzdC1taW5lcnPSAVNodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yMzk1ODEvanBtb3JnYW4tYml0Y29pbi1oYWx2aW5nLXN0cmVzcy10ZXN0LW1pbmVycw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "JPMorgan says upcoming Bitcoin halving could be a stress test for miners - The Block",
        "content": "The upcoming Bitcoin halving event will form a crucial test for miners as they navigate reduced rewards and increased production costs, according to JPMorgan.\n\n\"Miners with lower electricity costs would find it easier to cope after the halving event, while miners with higher electricity costs could struggle post halving event,\" JPMorgan strategists led by Nikolaos Panigirtzoglou wrote in a report on Thursday. Put simply, the halving event will determine miners' ability to adapt and remain profitable in a changing environment.\n\nThe Bitcoin halving is an event that occurs approximately every four years, reducing the reward for mining new Bitcoin blocks by half, effectively decreasing the rate at which new bitcoins are created, in order to control inflation and maintain the scarcity of bitcoin over time. The upcoming Bitcoin halving will see the block reward halve from 6.25 bitcoin to 3.125 bitcoin.\n\nWhile Bitcoin's halving is generally seen as having a positive impact on the price of Bitcoin, it poses challenges for Bitcoin miners, because the cost of production has historically acted as a floor price, according to JPMorgan analysts. \"According to our current bitcoin production cost model, one cent per kWh [kilowatt-hour] change in the electricity cost induce a $4,300 change in the bitcoin production cost. Post halving this sensitivity would double to $8,600 thus increasing the vulnerability of higher cost producers,\" the analysts said.\n\nRELATED INDICES See crypto indices\n\nCompetition among Bitcoin miners is also intensifying ahead of the halving event as the Bitcoin hash rate, or the total computational power to mine the cryptocurrency, is increasing, according to the analysts. Post the halving event, however, the Bitcoin hash rate may not continue to rise at the same pace without any sustained rise in the Bitcoin price above its production cost or a large increase in transaction fees that could offset the reduction in issuance rewards, the analysts said.\n\n\"And at the moment the decline in the hype around ordinals poses an additional challenge for bitcoin miners' revenues,\" the analysts concluded."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tc3VyZ2UtcmlwcGxlLXdpbi1zZWMteHJwLWxlYWRzLXJhbGx5L9IBRmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tc3VyZ2UtcmlwcGxlLXdpbi1zZWMteHJwLWxlYWRzLXJhbGx5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether surge after Ripple notched partial win against SEC; Ripple’s XRP leads crypto rally - Forkast News",
        "content": "Bitcoin surged on Friday morning in Asia to breach the US$31,000 resistance level, after Ripple Labs achieved a partial victory in its three-year lawsuit against the U.S. Securities and Exchange Commission (SEC). The regulator accused Ripple of offering XRP as an unregistered security. Along with Bitcoin, Ether and all other top 10 non-stablecoin cryptocurrencies logged considerable gains, with XRP spearheading the rally with a rise of over 70%. U.S. equity futures traded flat in the Asia time zone on Friday as investors await earnings reports from major U.S. banks. Thursday’s U.S. producer price index (PPI) has added to a sense that inflation is slowing in the country.\n\nXRP ruling provides crypto market boost\n\nBitcoin climbed 3.45% over the last 24 hours to US$31,463 as of 07:50 a.m. in Hong Kong for a weekly gain of 4.93%, according to data from CoinMarketCap. The world’s largest cryptocurrency reached a high of US$31,814 early Friday morning, the highest price since June 2022.\n\nIn a summary judgement on Thursday, New York Southern District Court Judge Analisa Torres ruled that Ripple’s programmatic sales of the XRP token on public exchanges do not constitute securities, marking a partial victory for Ripple with the SEC. The regulator first sued the San Francisco-based financial technology firm on the grounds that XRP constitutes a security in 2020.\n\nThe verdict came with a critical caveat, however. The court ruled that Ripple’s XRP sales to institutional investors did violate securities laws.\n\nNonetheless, Ripple’s Chief Executive Officer Stuart Alderoty called the judgement “a huge win” in a Friday tweet.\n\nA huge win today – as a matter of law – XRP is not a security. Also a matter of law – sales on exchanges are not securities. Sales by executives are not securities. Other XRP distributions – to developers, to charities, to employees are not securities. — Stuart Alderoty (@s_alderoty) July 13, 2023\n\nAlderoty said that “the only thing the Court found constitutes an investment contract is past direct XRP sales to institutional clients.” Those transactions will now be subject to further court proceedings.\n\nDespite the overall optimism in the crypto community evidenced by the upswing in the market, there are also a number of industry voices sounding a note of caution.\n\nIn an emailed comment, CoinShares’ Head of Product Townsend Lansing said that the aspect of the ruling that identifies Ripple’s sales to institutional customers as a violation of securities law marks “a considerable victory for the SEC.”\n\nThe ruling will now set a precedent for legal action against other cryptocurrencies by regulators, he said.\n\n“It is important to note that institutional investors who purchased directly from Ripple may find themselves subject to class-action litigation as potential underwriters,” Lansing added. “This is an area to watch closely, especially if big-name venture capitalists were involved.”\n\nBut, while some sense of jeopardy remained for those involved, Justin d’Anethan, head of APAC business development at Belgium-based crypto market maker Keyrock, believes that the ruling had at least “shook investors in the best of ways.”\n\nElsewhere, Europe’s first Bitcoin exchange-traded fund (ETF) is set for a public listing this month. That follows a 12-month delay from the initially planned date, the Financial Times reported on Thursday.\n\nExperts have identified the listing as another potential catalyst for the crypto market.\n\n“With the talks of ETFs in the background, the idea that we could see products tracking many cryptocurrencies is not implausible and traders are naturally positioning themselves accordingly,” said Keyrock’s d’Anethan.\n\nLike Bitcoin, Ether surged 6.99% to US$2,004, moving up 7.69% for the week. The token is trading above US$2,000 for the first time since April.\n\nBoosted by the ruling on the SEC-Ripple case, all other top 10 non-stablecoin cryptocurrencies rose in the past 24 hours. Cardano’s ADA, Solana’s SOL and Polygon’s MATIC each logged two-digit gains.\n\nXRP, subject of the SEC’s lawsuit against issuer Ripple, jumped 72.75% to US$0.8142 and added 74.89% for the week. In doing so, it replaced Binance’s BNB as the third largest non-stablecoin cryptocurrency by market cap.\n\nThe total crypto market capitalization rose 6.19% in the past 24 hours to US$1.26 trillion, while trading volume jumped 95.72% to US$60.3 billion.\n\nForkast 500 up, Dapper Labs announces layoffs\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe main Forkast 500 NFT index edged up 0.14% in the past 24 hours to 2,699.39 as of 09:55 a.m. in Hong Kong. Forkast’s Solana and Cardano NFT market indices also moved higher, while the Etheum and Polygon indices dropped.\n\nDespite the overnight rise in cryptocurrency prices associated with the Ripple ruling, total NFT sales volume dipped 1.72% in the past 24 hours to US$24.45 million, according to data from CryptoSlam.\n\nAmong all NFT collections, Bitcoin-based $FRAM BRC-20 NFTs topped the 24-hour sales volume, edging up 0.31% to US$2.14 million. In doing so, it recorded over two thirds of the total volume on the Bitcoin network. Ethereum-based collections Bored Ape Yacht Club (BAYC) and the Captainz ranked second and third respectively.\n\nBAYC #1734, part of the BAYC collection, topped collectible sales in the past 24 hours. It was sold at 600 Ether (US$1.2 million) early Friday. As exciting as this big sale is, BAYC #1734 was previously sold at 800 Ether in January 2022.\n\n“This grail Bored Ape was sold at a huge loss, but the takeaway is that there is still a market for very high-priced NFTs, even in a bear market,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\nAs the bear market continues, Dapper Labs, the developer of hit NFT collections such as CryptoKitties and NBA Top Shot, announced the layoff of 51 staff on Thursday — roughly 12% of its workforce.\n\n“The decision was incredibly difficult” but necessary to “ensure a lean and efficient” company, said Dapper Labs Chief Executive Officer Roham Gharegozlou in a letter to employees. It is the third round of layoffs at the company in the past 12 months. Those layoffs saw its workforce cut by 22% in November 2022 and by a further 20% in February this year.\n\nCool Cats Group, the Web3 company behind NFT collection Cool Cats, announced a partnership with game developer nWayPlay, a subsidiary of Hong Kong-based software and investment giant Animoca Brands. Together, the two companies will develop a Web3 game set to be released between late 2023 and early 2024.\n\nUS equities flat amid data releases\n\nImage: Envato Elements\n\nU.S. stock futures traded flat as of 11:50 a.m. in Hong Kong. All three major U.S. indexes closed higher in regular Thursday trading, with the Nasdaq leading the gains with a 1.58% rise.\n\nThe U.S. producer price index (PPI) released Thursday recorded a 0.1% year-on-year rise for the month of June, down from 0.9% in May. The June figure is the smallest increase since August 2020.\n\nThe data is also well below analyst expectations of a 0.4% annual increase in PPI. Combined with weak consumer price index data released on Wednesday, the data points to a slowdown in U.S. inflation.\n\n“The better-than-expected inflation figures for June 2023 would suggest that policy is working to ease price pressures as higher interest rates reduce demand. Key payroll figures announced in early July also came in below expectations with the economy generating less jobs than expected in June,” said Keith Wade, chief economist & strategist at asset management Schroders.\n\nHowever, given lingering inflation worries, Wade still expects the Federal Reserve to make another interest rate hike in July. The tight labor market and the potential for a reversal in the Fed’s monetary policy could, Wade said, trigger a rally in the bond market that would “loosen financial conditions.”\n\n“Given the efforts the Fed has made to convince markets they were serious about inflation and not about to pivot, this would seem to be too early,” said Wade.\n\nFederal Reserve Governor Christopher Waller said in a Thursday speech that the Fed would need to “keep policy restrictive for some time” in order to reduce inflation below its 2% target. He said that he anticipates two more rate hikes by the end of the year.\n\n“I am more confident that the banking turmoil is not going to result in a significant problem for the economy, and I see no reason why the first of those two hikes should not occur at our meeting later this month,” said Waller.\n\nMeanwhile, a Wednesday report by financial comparison service company Bankrate showed that economists believe there is a 59% chance the U.S. economy will enter a recession inside the next twelve months. The report cited concern about the long-term economic impact of this year’s extended series of rate hikes.\n\nThe 59% figure is, however, a decrease on the 64% chance given in April, and the lowest level in the past 12 months.\n\nThe Federal Reserve meets on July 26 to discuss its next move on rates, which now sit between 5% and 5.25%. The CME FedWatch Tool predicts a 92.4% chance the Fed will enact a 25-basis-point rate increase this month, and a 7.6% chance it will leave the rate unchanged.\n\nInvestors are now awaiting the release of second-quarter earnings reports from major financial institutions on Friday. The releases will include reports from JPMorgan Chase, Wells Fargo, Citigroup, BlackRock and more.\n\nElsewhere, main stock indexes across Asia traded higher on Friday morning. China’s Shanghai Composite, Hong Kong’s Hang Seng, Japan’s Nikkei and South Korea’s Kospi all posted rises as of 12:30 p.m. in Hong Kong.\n\n(Updates with equity section.)"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vd3d3LmNjbi5jb20vZWR1Y2F0aW9uL2JpdGNvaW4taGFsdmluZy1leHBsYWluZWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Halving, Explained - CCN.com",
        "content": "Key Takeaways\n\nBitcoin halving reduces supply, increases scarcity, and potentially leads to price appreciation. Mining rewards decrease, impacting profitability and requiring miners to find more efficient mining methods. Approximately 1.3 million Bitcoins left to be mined after the Bitcoin halving in 2024. HODLing, dollar-cost averaging, research, risk management, and seeking professional advice for guidance are good avenues to speculate on Bitcoin.\n\nWhat Is Bitcoin Halving?\n\nThe Bitcoin network operates through a decentralized system where network participants, known as miners, validate transactions and secure the network by solving complex mathematical problems. In return for their efforts, miners are rewarded with newly minted Bitcoins (BTC).\n\nThe Bitcoin halving cycle is an event in the Bitcoin blockchain that occurs approximately every four years or 210,000 blocks. During a halving event, the reward for mining Bitcoin transactions is reduced by half. This reduction affects the rate at which new Bitcoins are created and ultimately lowers the available supply of new coins.\n\nThe total supply of Bitcoin is limited to 21 million coins. The final halving event is projected to happen in the year 2140, when the maximum supply of 21 million Bitcoins will be reached and the mining reward reduced to zero after that date.\n\nHow Bitcoin halving impacts the supply and mining rewards?\n\nDuring the halving event, the number of new Bitcoins created and rewarded to miners for validating transactions is reduced by half. This reduction is programmed into the Bitcoin protocol and is designed to control the inflation rate and ensure a finite supply of Bitcoins.\n\nWhen a halving occurs, the supply of new Bitcoins entering the market decreases. The Bitcoin halving schedule has moved as follows over its lifespan:\n\n2012: The block reward was reduced from 50 to 25 Bitcoins per block.\n\n2016: Reduced from 25 to 12.5 Bitcoins.\n\n2020: The last Bitcoin halving reduced the reward from 12.5 to 6.25 Bitcoins.\n\n2024: Currently at 6.25 to be reduced to 3.13 Bitcoins approximately in the next Bitcoin halving date scheduled for April 2024.\n\n2140: The final halving year that will result in the 21 million Bitcoin cap being reached. No more Bitcoin will be mined after this date.\n\nAs the supply decreases, this increased scarcity historically results in upward pressure on the price of Bitcoin, as the shock in supply boosts demand. Miners, on the other hand, experience a direct impact on their profitability. Since the block reward is halved, miners receive fewer Bitcoins for their mining efforts. This puts pressure on mining operations, particularly those with higher operational costs, as they need to find more efficient ways to mine or adjust their strategies to maintain profitability.\n\nOverall, Bitcoin halving events play a crucial role in regulating the supply and mining rewards of Bitcoin, with implications for both the market price and the economics of mining.\n\nThe Bitcoin Halving Performance\n\nThe following section will focus on price appreciation of the Bitcoin halving dates history 150 days post halving:\n\n2012\n\nThe first Bitcoin halving took place on November 28th, 2012, reducing the block reward from 50 BTC to 25 BTC. The price of Bitcoin was $12.35 on that day. 150 days later, the price had increased to $127.00.\n\n2016\n\nThe second halving occurred in 2016 on July 9th. Before the halving, the block reward was 25 BTC, which was reduced to 12.5 BTC. The price of Bitcoin on the halving day was $650.63, and it rose to $758.81 150 days later.\n\n2020\n\nThe third halving occurred on May 11, 2020. Before the halving, the block reward was 12.5 BTC, and it was reduced to 6.25 BTC. On the halving day, the price of Bitcoin was $8821.42, and it increased to $10,943.00 150 days later.\n\n2024\n\nAfter the next Bitcoin halving in 2024, the mining reward will be further reduced from the current 6.25 Bitcoins per block to 3.125 Bitcoins per block. This reduction will continue the trend of diminishing the rate at which new Bitcoins are created and introduced into circulation.\n\nIn terms of the total number of Bitcoins left to be mined, it’s important to note that Bitcoin has a finite supply of 21 million coins. Approximately 19.7 million Bitcoins would have been mined by 2024 halving. After the 2024 halving, there will be approximately 1.3 million Bitcoins left to be mined until the maximum supply is reached. To date the impact of the Bitcoin halving on the Bitcoin price has been positive resulting in higher prices. It’s worth noting that the rate of mining will continue to decrease over time, making the remaining Bitcoins progressively harder to mine.\n\nThe Effects Of Bitcoin Halving\n\nThe Bitcoin halving countdown effects can be observed in several aspects of the cryptocurrency ecosystem.\n\nImpact On Bitcoin’s Price And Market Dynamics\n\nBitcoin halving has historically been associated with a bullish trend in the price of Bitcoin. The reduction in the rate of new Bitcoin creation and the sense of scarcity created by halving events can drive up demand and increase Bitcoin’s value over time. However, the market dynamics surrounding Bitcoin are influenced by various factors, including speculation and market sentiment, which can contribute to price volatility.\n\nInfluence On Mining Profitability And Network Security\n\nBitcoin halving affects mining profitability by doubling the costs of mining, forcing less efficient miners to shut down their operations. The reduction in block rewards decreases miners’ revenues, leading to lower energy consumption as miners tighten their belts where necessary. This shift towards more efficient mining operations contributes to network security as only the most cost-efficient miners sustain their operations.\n\nRole Of Bitcoin Halving In Controlling Inflation And Scarcity\n\nBitcoin halving events are designed to control inflation by reducing the rate at which new Bitcoins are created, preserving the purchasing power of the cryptocurrency. Additionally, halving events create a sense of scarcity, which can drive up demand for Bitcoin over time.\n\nMarket Expectations And Speculation\n\nMarket expectations and speculation surrounding Bitcoin halving have been a topic of interest among analysts and experts. Here is some analysis of market sentiments concerning Bitcoin halving:\n\nMarket Expectations And Sentiment\n\nSome crypto analysts, like myself, who have been watching the price of Bitcoin for just under a decade, believe Bitcoin could experience a significant rally leading up to the next halving event, in April 2024, which could propel its price as high as $35,000 – $50,000.\n\nPredictions And Projections\n\nVarious predictions have been made regarding Bitcoin’s price performance before and after halving. According to time analysis data, Bitcoin’s price could reach as high as $98,000 or even $260,000 by October 2025. However, there is also less agreement on the duration and extent of the rally, as well as the potential volatility in the crypto market leading up to halving.\n\nComparison Of Past Halving Events\n\nPrevious halving events have been associated with significant price surges for Bitcoin. Each halving has been followed by a bullish trend in the price of Bitcoin, generating substantial returns for investors. While past performance is not indicative of future results, these historical patterns have contributed to the anticipation and speculation surrounding the next halving event.\n\nStrategies For Navigating The Halving Cycle\n\nStrategies may vary depending on individual risk tolerance and investment goals, here are some general approaches to consider:\n\nLong-term HODLing: One strategy is to “HODL” Bitcoin, which means holding onto it for the long term. This approach aims to capture price appreciation over time, capitalizing on historical patterns of post-halving price rallies. Dollar-cost averaging: Where investors allocate a fixed amount of funds to buy Bitcoin at regular intervals, regardless of price. This approach mitigates short-term price fluctuations and allows for gradual accumulation of Bitcoin over time. Research and analysis: Staying informed and conducting research is crucial during the halving cycle. This involves keeping up with expert opinions, market trends, and historical data for informed decision-making. Analyzing indicators, sentiment, and news can help identify buying or selling opportunities. Risk management and diversification: Setting investment goals, defining risk tolerance, and establishing stop-loss or profit-taking levels contribute to effective risk management. A strategy may be to use the volatility that comes with the halving to find entry and exit points. Active trading and technical analysis: For individuals with the time, expertise, and risk appetite, active trading and technical analysis can be employed during the halving cycle. This strategy involves closely monitoring price charts, identifying patterns, and executing trades based on market movements. It requires a deeper understanding of technical analysis indicators and trading strategies. Utilizing professional advice: Engaging with professional financial advisors or experienced cryptocurrency traders who can provide valuable insights and guidance tailored to individual circumstances. Their expertise and experience can assist in formulating effective strategies and navigating the halving cycle with a personalized approach.\n\nConclusion\n\nTo navigate the future halving events successfully, staying informed and conducting thorough research remains key. Analyzing expert opinions, market trends, historical data, and indicators can help make informed investment decisions. Essentially, it is important to just remain informed at a pace that matches the level of investment made in this space. Additionally, implementing risk management strategies, such as diversification and setting clear goals, is essential for mitigating potential risks and optimizing investment outcomes.\n\nFAQs\n\nWhat is Bitcoin halving?\n\nBitcoin halving is an event that occurs approximately every four years, reducing the mining reward by half and impacting the rate at which new Bitcoins are created.\n\nHow does Bitcoin halving impact supply and mining rewards?\n\nBitcoin halving reduces the supply of new Bitcoins and affects mining rewards, potentially leading to increased scarcity and upward price pressure. Miners receive fewer Bitcoins for their efforts, impacting their profitability.\n\nHow many Bitcoins are left to be mined after the 2024 halving?\n\nAfter the 2024 halving, there will be approximately 1.3 million Bitcoins left to be mined until the maximum supply of 21 million is reached.\n\nWhat are some strategies for navigating the halving cycle?\n\nStrategies for navigating the halving cycle include long-term HODLing, dollar-cost averaging, research and analysis, risk management and diversification, and seeking professional advice for personalized guidance"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtYWNjZXB0cy1ibGFjay1yb2NrLWJpdGNvaW4tZXRmLWFwcGxpY2F0aW9uLXNpZ25hbGluZy1yZWd1bGF0b3J5LXJldmlld9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jul 2023 07:00:00 GMT",
        "title": "SEC accepts BlackRock's Bitcoin ETF application, signaling regulatory review - Cointelegraph",
        "content": "The United States Securities and Exchange Commission (SEC) has accepted BlackRock’s application for a spot Bitcoin (BTC) exchange-traded fund (ETF) following its acknowledgment of a similar application by Bitwise the day before.\n\nThe SEC’s acknowledgment indicates the commencement of the official review process for BlackRock’s ETF proposal. While it is an initial step in a lengthy regulatory journey, it signals the SEC’s readiness to explore the idea of a spot Bitcoin ETF and assess its potential market effects.\n\nETFs are investment funds that typically follow specific indexes and are commonly traded on exchanges. In the realm of cryptocurrencies, a fund that mirrors the value of one or multiple digital tokens and comprises a variety of cryptocurrencies is known as a cryptocurrency ETF.\n\nOn Friday, July 14, the regulator announced that it is also in the process of reviewing applications for various funds, including Wise Origin Bitcoin Trust, WisdomTree, VanEck and Invesco Galaxy.\n\nBlackRock’s entry into the spot Bitcoin ETF race is significant due to its stature in the financial industry. Its filing for a spot Bitcoin ETF included an agreement for “surveillance-sharing” with cryptocurrency exchange Coinbase.\n\nRelated: Crypto will transcend international currencies — BlackRock CEO\n\nThe competition among companies vying to be the first to launch a Bitcoin ETF in the United States is seen by many as a positive development for the crypto industry. With multiple filings, the chances of success increase, with diverse proposals enabling the SEC to assess different strategies and concerns.\n\nThe SEC has yet to approve a spot Bitcoin ETF in the United States; however, in Canada, the financial product is already available. Three significant funds: Purpose Bitcoin, 3iQ CoinShares and CI Galaxy Bitcoin, have been approved by regulators in the country.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: SEC calls ETF filings inadequate, Binance loses euro partner and other news: Hodler’s Digest, June 25 – July 1"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2F1c3RyYWxpYW4tc3BvdC1iaXRjb2luLWV0ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "First spot bitcoin ETF application filed under new Australian regulations - Blockworks",
        "content": "An application for Australia’s first fully-licensed spot bitcoin ETF under new regulatory guidelines has been filed with the Australian Securities Exchange (ASX).\n\nBitcoin-focused asset management firm Monochrome, in partnership with Vasco Trustees, announced Friday the lodgement of an updated application for the Monochrome Bitcoin ETF (IBTC) – intended to provide regulated exposure for retail investors.\n\nThe move marks the first instance of a filing for a spot bitcoin ETF on the ASX under a licensing regime featuring crypto provisions, established almost two years ago.\n\nIt also follows a year after Monochrome’s partner Vasco received a financial license to operate crypto spot ETFs in the country.\n\nASIC, the country’s securities regulator, revised its rules for the Australian financial services (AFS) license in October 2021. ASIC sought to promote market transparency amongst crypto firms while enhancing investor protections.\n\nThe rules dictate that institutional support and acceptance of the underlying crypto should exist for a spot ETF to go through. “Reputable” and “experienced” service providers must be willing to support those products.\n\nAs it stands, there are only currently two AFS licensees, including the issuer behind Monochrome’s ETF, with any retail crypto-asset license authorization. Others are listed as wholesale, meaning they are not yet green-lit to offer such products to mom-and-pop investors.\n\nOther Australian attempts at bitcoin ETFs\n\nAnother bitcoin ETF from Cosmos Asset Management’s bitcoin ETF attempted to take the crown as the country’s first last year, spot or otherwise.\n\nThat ETF, however, was established as a fund of funds, offering exposure to one of Canada’s spot bitcoin ETFs managed by Purpose. Global X and 21Shares’ Bitcoin ETF ended up being the first to list in Australia, while Cosmos delisted its offering in November due to lack of interest.\n\nGlobal X 21Shares’s Bitcoin ETF, still trading today, operates using a wholesale-retail feeder fund structure. In this setup, a retail fund invests in a wholesale fund that directly holds bitcoin.\n\nThough the wholesale fund is not subject to the newly instituted regulations specifically aimed at retail funds dealing with digital assets, Blockworks was told.\n\n“What sets us apart from other fund structures is that the Monochrome Bitcoin ETF is authorized under the ‘crypto-asset’ licensing category, which allows the fund to hold bitcoin directly on the fund level,” Jeff Yew, Monochrome CEO, said.\n\nThe executive added he was confident that a positive outcome would be reached.\n\nWhen asked about the poor performance of Australia’s spot bitcoin ETFs, the executive reasoned that Cosmos’ delisting was driven by unfavorable market timing, confusion about the fund’s licensing and operational issues leading to discrepancies between the unit price and bitcoin.\n\nThe current climate presents a “different circumstances and product structure/licensing,” Yew said.\n\nRenewed interest in spot bitcoin ETFs has also hit the US, with major institutions such as BlackRock, Invesco and WisdomTree all filing over the past month.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXR1bWJsZXMtYmVsb3ctMzBrLWNyeXB0by0xODU2MjM1OTAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Tumbles Below $30K, Crypto Prices Buckle After Altcoin Frenzy on XRP Ruling - Yahoo Finance",
        "content": "Cryptocurrency prices cooled off Friday afternoon after Thursday's major rally on the apparent court victory for Ripple Labs and its XRP token.\n\nBitcoin (BTC), the largest cryptocurrency by market capitalization, fell below $30,000, down more than 5% from a high of about $31,800 at one point on Thursday.\n\nEther (ETH) also sagged from its rousing Thursday to change hands at $1,900, a 4% decline. The second largest crypto in market value had previously soared past $2,000 to hit a three-month high.\n\nXRP was trading at about $0.69, or down 25% from a peak of $0.93 hit yesterday. The token briefly toppled Binance’s BNB as the fourth largest cryptocurrency by market cap, but slipped back to fifth in the ranking after today's price drop.\n\nOther major altcoins were mostly lower, including ADA and MATIC – the tokens of smart contracts platforms Cardano and Polygon, respectively – each off more than 5% Friday afternoon, though still higher over the last two days. The CoinDesk Market Index, a measure of crypto markets performance, was down about 4% over the past 24 hours.\n\n“[Bitcoin is] still trading like an instrument in consolidation,” wrote Craig Erlam, senior market analyst for foreign exchange market maker Oanda, in an email to CoinDesk. The break above $31,000, he said, doesn't seem \"particularly convincing at this stage.\"\n\nThe sudden drop in prices caught traders who bet on higher prices off-guard, with $155 million of long positions liquidated, according to CoinGlass data. This was the largest long liquidation in a month.\n\nUPDATE (Jul. 14, 19:20 UTC): Updated prices through the story. Added liquidation data."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vb2lscHJpY2UuY29tL0ZpbmFuY2UvdGhlLU1hcmtldHMvVGhlLURhd24tT2YtQml0Y29pbi1FVEZzLUNvdWxkLVNwYXJrLUFuLUludmVzdG9yLUZyZW56eS5odG1s0gFpaHR0cHM6Ly9vaWxwcmljZS5jb20vRmluYW5jZS90aGUtTWFya2V0cy9UaGUtRGF3bi1PZi1CaXRjb2luLUVURnMtQ291bGQtU3BhcmstQW4tSW52ZXN0b3ItRnJlbnp5LmFtcC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jul 2023 07:00:00 GMT",
        "title": "The Dawn Of Bitcoin ETFs Could Spark An Investor Frenzy - OilPrice.com",
        "content": "Cryptocurrency investors have been in a frenzy in recent weeks about the possible approval by the US financial regulator of spot Bitcoin Exchange-Traded Funds (ETFs).\n\nSpot ETFs invest directly in underlying assets, typically stocks or bonds, at the current market price (spot price). They aim to replicate the performance of a specific index or asset class by holding a portfolio of the actual securities that make up the index.\n\nA wave of some of the world’s largest asset managers, including BlackRock and Fidelity, have applied to the Securities and Exchange Commission (SEC) in last few weeks. However, the globally influential watchdog has said that all the recent filings have been inadequate.\n\nBut, like many others, I remain confident that a spot Bitcoin ETF is inevitable. The SEC is flexing its muscles, but it will be a matter of time. These multi trillion-dollar asset managers are, of course, amazingly-well connected. And there won’t be just one company approved either, because this would imply that that regulator is a de facto ‘kingmaker’.\n\nIf I am right and we get a wave of approvals of ETFs, I am confident that crypto prices will skyrocket for four main reasons.\n\nFirst, a Bitcoin ETF allows investors to gain exposure to Bitcoin without directly owning or trading the cryptocurrency. Such increased accessibility for both can lead to a larger pool of potential investors entering the market, driving up demand for Bitcoin.\n\nSecond, the introduction of a Bitcoin ETF will undoubtedly attract institutional investors who have strict regulatory requirements and risk management policies. They’ll bring with them capital, expertise and clout.\n\nThird, ETFs are traded on established stock exchanges, providing liquidity and ease of trading. This liquidity will attract more traders and increase market efficiency, reducing price volatility. As such, increased liquidity and market efficiency can positively impact the price of Bitcoin and other cryptocurrencies.\n\nAnd fourth, a Bitcoin ETF will generate significant mainstream attention and media coverage which will drive up demand and prices in the crypto market.\n\nSo, now we wait for the SEC approval. But with the influence and power of these financial titans, maybe it won’t be for too long?\n\nADVERTISEMENT\n\nBy Nigel Green via CityAM\n\nMore Top Reads From Oilprice.com:"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGVjcnlwdC5jby8xNDg3NTIvc2VjLWJsYWNrcm9jay1zcG90LWJpdGNvaW4tZXRmLWFwcGxpY2F0aW9u0gFKaHR0cHM6Ly9kZWNyeXB0LmNvLzE0ODc1Mi9zZWMtYmxhY2tyb2NrLXNwb3QtYml0Y29pbi1ldGYtYXBwbGljYXRpb24_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jul 2023 07:00:00 GMT",
        "title": "SEC Formally Accepts BlackRock Spot Bitcoin ETF Application for Review - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBlackRock's application to offer a spot Bitcoin exchange-traded fund (ETF) has been added to the official docket of the Securities and Exchange Commission as part of its proposed rule change process. The move, recorded late Thursday, advances the most closely-watched Bitcoin-related proposal to the SEC to date.\n\nThe application for the iShares Bitcoin Trust was filed nearly a month ago, prompting a new wave of optimism across the crypto market, and additional filings for spot Bitcoin ETFs from a number of other prominent players, including from firms like Invesco, Wisdom Tree, Bitwise, and Fidelity—which saw its previous application rejected last year along with those from other contenders.\n\nWhen the SEC signaled last month that BlackRock's application was lacking, the company filed a revised application, adding a \"surveillance sharing\" clause that would involve the Coinbase crypto exchange monitoring and reporting possible illegal activity.\n\nAD\n\nAD\n\nSoon enough, Valkyrie updated its application with the same provision, as did Fidelity and ARK Invest.\n\nA spot Bitcoin ETF would track the value of Bitcoin without requiring the asset to be held directly. It would also be tradable on a traditional stock exchange.\n\nWhile a Bitcoin ETF based on Bitcoin futures launched to great fanfare earlier this year, a spot ETF—which is tied to the current price of the cryptocurrency—has been described as a \"holy grail\" for the industry. The SEC's continued resistance to approving one over the past several years has been described as a \"complete and utter disaster.\"\n\nWith BlackRock's application now on the SEC's official calendar, it will be published in the Federal Register and trigger a 21-day public comment period.\n\nMeanwhile, four other applications were docketed on Friday related to the Cboe BZX Exchange, which was the first entity to apply for a Bitcoin ETF in March 2021, They include the Wise Origin Bitcoin Trust, WisdomTree Bitcoin Trust, VanEck Bitcoin Trust, and Invesco Galaxy Bitcoin ETF, which will also enter a three-week comment period.\n\nAD\n\nAD"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA3LzE0L3Nob3VsZC15b3UtYnV5LWJpdGNvaW4td2hpbGUtaXRzLXN0aWxsLWJlbG93LTQwMDAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Should You Buy Bitcoin While It's Still Below $40,000? - The Motley Fool",
        "content": "Bitcoin (BTC 0.04%) has had a fantastic start to the year, up almost 90% as of July 13. The bulls are certainly happy with this trend, especially after this digital asset tumbled 65% in 2022. As the overall crypto market bounces back, it seems investors are now more optimistic.\n\nBitcoin's price now is about $31,400, so it remains well off its peak price of nearly $69,000 in late 2021.\n\nDoes that mean it's smart to buy this top cryptocurrency while it's still below $40,000? Let's take a closer look at why I think it just might be.\n\nThe 2024 halving\n\nBitcoin runs a proof-of-work consensus mechanism, requiring Bitcoin miners to solve complex computational problems to win the right to process new transactions on the blockchain. The reward for all this effort is newly created Bitcoin. Right now, the block reward is 6.25 coins. Some time probably in April 2024, the reward gets cut in half to 3.125 coins. This event, which occurs roughly every four years, is what's known as a halving.\n\nAlthough the past is no indication of what the future may hold, the price of Bitcoin has generally gone up starting several months before a halving occurs. And this upward trend continues even 12 to 18 months after a halving. This means that now could be a great time to be a buyer.\n\nThis makes sense because a halving essentially cuts the supply growth rate of Bitcoin. A reduced inflow of new supply, coupled with rising demand, should lead to a higher price, according to basic economic theory. Plus, there's the fact that there will only be 21 million coins in circulation. A hard-coded supply cap like this can drive more interest.\n\nTo say that Bitcoin's price history is like a roller coaster would be accurate. Throughout its 14-year history, Bitcoin has seen declines of more than 50% numerous times. While the volatility has undoubtedly declined as the asset grows in popularity and its market cap increases, Bitcoin still trades like a speculative growth tech stock.\n\nBut one thing is absolutely certain. Bitcoin has always found a way to reach higher highs and higher lows over time, albeit not in a perfectly straight line. Following the next halving event in 2024, I think it's likely that Bitcoin will eclipse its previous all-time high.\n\nExpect greater adoption\n\nIt's hard to forecast with any level of precision when, if ever, Bitcoin will become a prominent medium of exchange that's used globally for everyday transactions. There is just a lot of uncertainty around this outcome.\n\nTherefore, I think Bitcoin's best investment case rests on its increasing adoption as a store of value. This means that Bitcoin won't be used for its utility, but instead because it can maintain, or hopefully significantly increase, someone's savings.\n\nIts volatility is gut-wrenching, no doubt, but it's hard to deny Bitcoin's long-term track record. Since April 2011 (the earliest data available on CoinMarketCap), Bitcoin's price has skyrocketed almost 50,000,000%. That absolutely crushes the performance of the S&P 500 and the Nasdaq Composite index by huge margins.\n\nAnd during this same time period, the price of a single ounce of gold has increased just 29%. Using this data, it's obvious that Bitcoin has done a much better job at building wealth.\n\nAs more market participants, especially institutions, start to feel comfortable owning Bitcoin in their portfolios, its price can soar even higher over the next five to 10 years. Large asset managers, like BlackRock and Fidelity, are trying to launch a spot Bitcoin exchange-traded fund.\n\nInterest like this bodes well for Bitcoin's future, making it a good idea to buy Bitcoin while it's still below $40,000."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTQvYml0Y29pbi1jcnlwdG8tcHJpY2VzLWJ1Y2tsZS1hZnRlci1hbHRjb2luLWZyZW56eS1vbi14cnAtcnVsaW5nL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTQvYml0Y29pbi1jcnlwdG8tcHJpY2VzLWJ1Y2tsZS1hZnRlci1hbHRjb2luLWZyZW56eS1vbi14cnAtcnVsaW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Tumbles Below $30K, Crypto Prices Buckle After Altcoin Frenzy on XRP Ruling - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNwZW5kaW5nLW1ldHJpYy1idGMtcHJpY2UtYnVsbC1tYXJrZXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin spending copies history as metric flags '1st stage bull market' - Cointelegraph",
        "content": "Bitcoin (BTC) long-term holders are coming back to life as BTC price increases, the latest analysis confirms.\n\nIn a tweet on July 13, Philip Swift, creator of on-chain data resource LookIntoBitcoin, revealed classic bull market behavior among “older” BTC investors.\n\nValue Days Destroyed Multiple prints BTC price bull signal\n\nBitcoin’s current price cycle may be dividing opinions when it comes to how high BTC’s price could go, but one thing is for sure: Hodler behavior is the same.\n\nThanks to BTC/USD more than doubling in 2023, on-chain spending velocity is up, indicative of profit-taking activity.\n\nUploading a chart of the Value Days Destroyed (VDD) Multiple, Swift suggested that the current cycle barely differs from all previous ones in this regard.\n\n“Increased onchain spending volume showing where we are in the cycle right now,” part of an accompanying Twitter commentary stated.\n\n“History doesn’t repeat but it often rhymes.”\n\nVDD is based on the extant Coin Days Destroyed (CDD) metric, which measures periods of inactivity each time an amount of BTC moves on-chain. It takes CDD data and factors in the current BTC price, and its multiple then compares the 30-day result with the 365-day average.\n\n“It is able to highlight when older coins begin to rapidly enter the market to be sold,” Swift explains in an instructional guide on LookIntoBitcoin.\n\n“This typically happens when longer-term participants look to take profits as price accelerates up in major bull market cycles.”\n\nThe VDD Multiple currently measures 1.32, narrowly behind its 2023 peak of 1.37 seen in April. For Swift, this is a telltale sign of a “1st stage bull market.”\n\nBitcoin VDD Multiple annotated chart. Source: Philip Swift/Twitter\n\nReacting, Checkmate, lead on-chain analyst at data firm Glassnode, called the findings “remarkable.”\n\n“It is remarkable how consistent the cycles are. Humans reacting the same, given similar stimulus,” he responded.\n\n“This time is indeed, not different.”\n\nNot just Bitcoin diamond hands\n\nGlassnode data, meanwhile, underscores how tempting it might be for various hodler classes to cash out at current prices.\n\nRelated: Bitcoin bulls ‘have work to do’ after XRP price spikes 104%\n\nBitcoin’s market-value-to-realized-value (MVRV) ratio for long-term and short-term holders (LTHs and STHs, respectively) shows both types of investors considerably in the black.\n\nLTH coins — defined as coins dormant for at least 155 days — are on aggregate worth 1.52 times more than when they last moved. For the STH equivalent, the number is 1.12.\n\nPreviously, Cointelegraph reported on the increasing sway that STHs have over BTC price action.\n\nBitcoin LTH, STH MVRV vs. BTC/USD chart. Source: Glassnode\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMTQvbXV0aW55cy1uZXctYnJvd3Nlci1iYXNlZC1iaXRjb2luLXdhbGxldC1vbi1saWdodG5pbmctYXZvaWRzLWFwcC1zdG9yZS1yZXN0cmljdGlvbnMv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMTQvbXV0aW55cy1uZXctYnJvd3Nlci1iYXNlZC1iaXRjb2luLXdhbGxldC1vbi1saWdodG5pbmctYXZvaWRzLWFwcC1zdG9yZS1yZXN0cmljdGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Mutiny’s New Browser-Based Bitcoin Wallet on Lightning Avoids App Store Restrictions - CoinDesk",
        "content": "“Some lesser-known bugs exist, but we generally want to exercise caution when using this wallet for now,” the company states on its blog. “Test the wallet, let us know how it is, and I promise we will surprise you with how fast we fix your bugs and ship new features.”"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1pbmVycy1mYWNlLXN0cmVzcy10ZXN0LTIwMDIwNDk2OS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Miners Face 'Stress Test' in Next Halving: JP Morgan - Yahoo Finance",
        "content": "Bitcoin miners will face headwinds as the hash rate reaches new record highs ahead of the upcoming halving event next spring, with volatile electricity costs and competition among miners pushing up the cost of production, according to analysts at global financial giant JP Morgan.\n\nHash rate refers to the computational power used to mine a cryptocurrency. The halving event, which occurs roughly every four years, will reduce miners' rewards by half.\n\n\"The upcoming bitcoin halving event in April/May 2024 could be a stress test for Bitcoin miners,\" writes JP Morgan analyst Nikolaos Panigirtzoglou and colleagues in the firm's latest Flows and Liquidity report, which the firm shared with Decrypt.\n\n\"[It] would reduce the issuance rewards from 6.25 to 3.125 BTC, implying a reduction in miners’ revenue, effectively increasing Bitcoin’s production cost at the same time,\" the report explains. \"As a result, while Bitcoin halving is seen as having a positive effect on the bitcoin price given the production cost acted historically as a floor, it poses a challenge for bitcoin miners.\"\n\nBerenberg Analysts: Bitcoin 'Could Rally' Near Next Year's Halving Event\n\nAccording to the analysis, and based on a global average cost of electricity of $0.05/kWh, it costs around $20,000 to mine a Bitcoin, which is currently worth around $30,000, per CoinGecko. But JP Morgan said the volatility of the hash rate points to the use of a variety of energy sources, meaning miners with access to lower-priced power have an advantage.\n\nIn fact, the company said, a one-cent increase in the cost per kilowatt hour translates to a $4,300 increase in the cost of Bitcoin production.\n\n\"Post halving this sensitivity would double to $8,600, thus increasing the vulnerability of higher-cost producers,\" the firm noted.\n\nThere has been some good news for miners, however.\n\nVanguard Now Owns $560 Million Worth of Bitcoin Mining Stocks\n\nStory continues\n\n\"Institutional interest in bitcoin mining has provided support to struggling miners, with investments in mining rigs from companies like Galaxy Digital and Grayscale Investments,\" it observed. Galaxy Digital recently acquired a major mining facility from Argo Blockchain, and Grayscale spun off an entity focused on Bitcoin mining hardware.\n\n\"Tether, the world largest stablecoin issuer, also plans an investment in a bitcoin mining site in El Salvador,\" according to the report.\n\nNonetheless, the price of Bitcoin and transaction fees will need to rise significantly to offset the lower block reward.\n\nJP Morgan also observed that \"the decline in hype surrounding cryptocurrencies poses an additional challenge for miners' revenues,\" including \"the decline in the hype around Ordinals.\"\n\nThe number of daily Ordinals inscriptions recently hit an all-time high, but Bitcoin fees did not sustain earlier highs along with them.\n\n\"Going forward, it seems unlikely that the Bitcoin hash rate will continue to rise at the same pace post the April/May 2024 halving event without any sustained rise in the Bitcoin price above its production cost or a large increase in transaction fees that could offset the reduction in issuance rewards,\" JP Morgan concluded."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy94cnAtbGVhZHMtZ2FpbnMtdG9wLTEwLTEwMTQ1MDMyMi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "XRP leads gains as Bitcoin, top 10 cryptos rally after Ripple's win against U.S. SEC - Yahoo Finance",
        "content": "Bitcoin and all other top 10 non-stablecoin cryptocurrencies gained in Friday afternoon trading in Asia. The gains come after Ripple Labs achieved a partial victory on Thursday when a U.S. court ruled that Ripple Labs’ programmatic sales of the XRP cryptocurrency did not qualify as the offer and sale of investment contracts. The U.S. Securities and Exchange Commission (SEC) in 2020 accused Ripple of offering XRP as an unregistered security. The judgment marks a significant milestone in the three-year legal tussle between the San Francisco-based payments firm and the U.S. regulator. XRP rallied over 62% in the past 24 hours.\n\nSee related article: What is XRP and what is Ripple?\n\nXRP leads crypto market rally\n\nBitcoin, the world’s largest cryptocurrency by market capitalization, gained 2.46% to US$31,115 in 24 hours to 4 p.m. in Hong Kong, and increased 3.69% on the week, according to CoinMarketCap data. Ether strengthened 6.46% to US$1,991 and rose 7.26% in the last seven days.\n\nBoosted by the ruling on the SEC-Ripple case, XRP led a rally in the crypto market on Friday, rising 62.71% to US$0.7674 and bringing its weekly gains to 65.47%.\n\nIn a summary judgment on Thursday, New York Southern District Court Judge Analisa Torres ruled that Ripple’s programmatic sales of the XRP token on public exchanges do not constitute securities, but the verdict also said that Ripple’s XRP sales to institutional investors violated securities laws.\n\nThe SEC first sued the San Francisco-based financial technology firm in 2020 on the grounds that XRP constituted a security.\n\nRipple’s chief legal officer Stuart Alderoty called the judgment “a huge win” in a tweet on Friday. “The only thing the Court found constitutes an investment contract is past direct XRP sales to institutional clients. There will be further court proceedings only on these institutional sales per the Court’s order,” Alderoty said.\n\nMaybe we can now start a rational conversation about crypto regulation in this country. — Stuart Alderoty (@s_alderoty) July 13, 2023\n\nCoinbase, the largest crypto exchange in the U.S., said in a tweet that it is reopening trading of XRP. Other crypto exchanges like Crypto.com also tweeted that it is enabling XRP trading, while Kraken Pro said on Twitter that XRP is “back in full-trading mode” on its platform.\n\nStory continues\n\n“This can be considered a win because XRP is one of the more centralized foundations, with a prominent figurehead who offered standard sales via exchanges, and formal distribution programs. If XRP is not considered a security, nearly nothing sold via exchanges is,” Vincent Chok, CEO of Hong Kong-based consultancy First Digital, told Forkast in an emailed response.\n\n“If the court states that XRP is not a security, it strengthens the case for many other tokens that the SEC considers a security. The SEC has tried the regulation by enforcement tactic, but this ruling might make it think twice about its past approach,” Chok added.\n\nHowever, according to Ben Caselin, vice president and chief strategy officer at Dubai-based crypto trading platform MaskEX, the court’s ruling might be cause for some relief among investors, but this tug-of-war is far from over.\n\n“Due to their peer-to-peer and digital native nature, cryptocurrencies do not easily allow for regulation in the traditional sense, but, going forward, if projects and companies who issue tokens want to deal with the general public and institutional investors, they might want to practice more caution compared to a few years ago,” Caselin told Forkast in an emailed response.\n\nXRP’s 24-hour trading volume soared 1,743.38% to US$13.27 billion, while its market capitalization strengthened 64.52% to US$40.85 billion.\n\nThe verdict on the Ripple vs. SEC lawsuit also boosted prices of all top 10 non-stablecoin cryptocurrencies.\n\nCardano’s ADA token gained 22.88% to US$0.3526, bringing its weekly gains to 25.91%. Solana increased 31.98% to US$28.75 and is up 47.96% on the week. Polygon’s Matic token strengthened 17.96% to US$0.8555 in 24 hours and 29.4% on the week.\n\nThe three cryptocurrencies saw double-digit losses in early June when the SEC labeled the tokens as financial securities in its lawsuits against crypto exchanges Coinbase and Binance.US.\n\n“The resolution of the lawsuit could lead to increased investor and market confidence in XRP [which] could attract new investors and drive greater liquidity and trading volume for XRP,” Minal Thukral, executive vice-president of growth and strategy at CoinDCX, India’s first crypto unicorn, said in an emailed statement on Friday.\n\nThe total crypto market capitalization rose 5.59% to US$1.25 trillion, while market volume increased 131.39% to US$70.53 billion in the past 24 hours.\n\nForkast 500 NFT index gains\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the main Forkast 500 NFT index edged up 0.27% to 2,706.85 in 24 hours to 6.45 p.m. in Hong Kong.\n\nForkast’s Ethereum and Solana indices also gained in the same period.\n\nTotal NFT sales volume on Ethereum blockchain gained 8.95% in the past 24 hours to US$17.07 million, according to data from CryptoSlam.\n\nBy collections, Ethereum-based Bored Ape Yacht Club recorded the highest 24-hour sales volume, rising 2.76% to US$2.09 million.\n\nNFT sales volume on the Bitcoin network declined 22.49% in 24 hours to US$2.68 million. Bitcoin’s $FRAM BRC-20 NFTs ranked the second-highest among collections.\n\n“CryptoPunks are gaining traction after Twitter users started speculating that a new cryptocurrency would be launched by an influencer named Pauly, who has been active in the Phunks community,” according to Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\nI AM creating a token.\n\n\n\nThere is no next $pepe.\n\n\n\nBe early. You will thank me later. pic.twitter.com/bCUE7Sh6bJ — PAULY (@Pauly0x) July 9, 2023\n\n“Pauly is known as a co-defendant in the Yuga Labs vs Ryder Rips BAYC collection lawsuit, and also as potentially a co-creator of Yuga Labs’ $APE Coin,” Petscher added.\n\nEthereum-based CryptoPunks gained 9.01% in sales volume to US$927,929 in the past 24 hours, ranking it the fourth biggest collection.\n\nAsian equities, U.S. futures gain; European bourses mixed\n\nImage: Envato Elements\n\nAsian stock markets mostly rose on Friday after the People’s Bank of China deputy governor Liu Guoqiang said that China’s central bank will step up “countercyclical adjustments” to aid recovery of the world’s second-largest economy. The central bank would use monetary policy tools such as the reserve requirement ratio, medium-term lending facility, and open market operations to boost economic growth.\n\nChina’s Shanghai Composite, Hong Kong’s Hang Seng, South Korea’s Kospi strengthened while Japan’s Nikkei dropped.\n\nIndia’s annual wholesale price index-based inflation declined for the third straight month to 4.12% in June compared to 3.48% in May. The decline was mainly due to lower prices of food products, mineral oils, crude petroleum and natural gas.\n\nIndia’s Sensex index at the Bombay Stock Exchange gained 0.77% at the close of trading hours on Friday.\n\nEarlier this month, Goldman Sachs said the world’s most populous country would become the world’s second largest economy by 2075, surpassing not only Japan and Germany but also the U.S.\n\nAs India’s population of 1.4 billion people becomes the world’s largest, its GDP is forecast to expand dramatically. Goldman Sachs Research projects India will have the world’s second-largest economy by 2075. https://t.co/CFFM0JsmEL pic.twitter.com/xHruyuSFex — Goldman Sachs (@GoldmanSachs) July 6, 2023\n\nU.S. stock futures strengthened as of 8 p.m. in Hong Kong, with the Dow Jones Industrial Average futures, the S&P 500 futures, and the Nasdaq 100 Futures all in the green.\n\nThe U.S. producer price index (PPI) released Thursday recorded a 0.1% year-on-year rise for June, down from 0.9% in May. The June figure is the smallest increase since August 2020. The data is also well below analyst expectations of a 0.4% annual increase.\n\nThe latest U.S. consumer price index, a key inflation indicator, slowed to 3% in June, beating market expectations of 3.1%. It was also the smallest annual increase since March 2021, and brought inflation rates closer to the Federal Reserve’s target of 2%.\n\nJeff Feng, co-founder of Sei Labs – a contributor to the Sei blockchain focused on trading – and a former Goldman Sachs analyst said that cooling inflation will be a boost to crypto markets.\n\n“This economic thaw doesn’t merely spell relief from the spiraling prices but is also poised to breed bullish sentiment across markets, especially for risk-on assets like cryptocurrencies. As the fear of inflation recedes, investors, buoyed by the healthier economic outlook, may be more inclined to channel their resources toward such assets,” Feng wrote.\n\nThe Federal Reserve meets on July 26 to discuss its next move on interest rates which are currently between 5% and 5.25%.\n\n“We will still see a rate hike in July. The debate will intensify though, and we do not expect a move in September,” Keith Wade, chief economist and strategist at Schroders, said in an emailed statement on Friday.\n\n“The next move should prove to be the last hike in this cycle with cuts following thereafter,” Wade added.\n\nEuropean bourses traded mixed on Friday as the benchmark STOXX 600 gained while Germany’s DAX 40 dropped during Friday afternoon trading hours in Europe.\n\n(updates with equities section.)"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTQtanVseS0yMDIzL2FydGljbGVzaG93LzEwMTc1NjEwNC5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTE0LWp1bHktMjAyMy9hbXBfYXJ0aWNsZXNob3cvMTAxNzU2MTA0LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin surges above $31,000; XRP skyrockets over 68% on court ruling - The Economic Times",
        "content": "(What's moving Sensex and Nifty Track latest market news stock tips and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nDownload The Economic Times News App to get Daily Market Updates & Live Business News.\n\nSubscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZm9ya2FzdC5uZXdzL2V1cm9wZXMtZmlyc3Qtc3BvdC1iaXRjb2luLWV0Zi1zZXQtbGF1bmNoLWp1bHktZnQv0gFLaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvZXVyb3Blcy1maXJzdC1zcG90LWJpdGNvaW4tZXRmLXNldC1sYXVuY2gtanVseS1mdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Europe’s first spot Bitcoin ETF set to launch in July: FT - Forkast News",
        "content": "Author profile\n\nZoltan is a writer at Forkast with a deep passion for storytelling and blockchain. Prior to joining the team, he worked as a marketing and content writer, focused on software and technology. Zoltan holds a master’s degree from the Ludwig Maximilian University of Munich and is interested in the future of global financial decentralization.\n\nAuthor's email\n\n[email protected]"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90aGlzLWlzLXdoeS1yb2JlcnQta2l5b3Nha2ktc3RpY2tzLXdpdGgtcmVhbC1hc3NldHMtbGlrZS1iaXRjb2luLWFuZC1nb2xkL9IBZ2h0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90aGlzLWlzLXdoeS1yb2JlcnQta2l5b3Nha2ktc3RpY2tzLXdpdGgtcmVhbC1hc3NldHMtbGlrZS1iaXRjb2luLWFuZC1nb2xkLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jul 2023 07:00:00 GMT",
        "title": "This Is Why Robert Kiyosaki Sticks With Real Assets Like Bitcoin and Gold - CryptoPotato",
        "content": "Robert Kiyosaki, the author of several best-seller books, continues to display his support for bitcoin, gold, and silver above all other assets.\n\nIn his latest tweet on the matter, he praised the aforementioned three assets while warning that the rich will get richer in the wake of the US government’s policies.\n\nSticking With BTC\n\nThe largest US stock market indexes registered some gains over the week, with the Dow jumping by over 3% and the S&P 500 by just shy of that percentage. The renowned author, businessman, and entrepreneur commented on the matter, as he believes these increases are only because of the removal of the US debt ceiling.\n\nRecall that the world’s largest economy faced a major crisis until June when President Biden signed a bill that suspended the country’s $31.4 trillion debt ceiling, thus avoiding the nation’s first-ever default.\n\nKiyosaki, though, who recently predicted that BTC will tap $120,000 soon, believes the government’s decision will only benefit the rich and harm America because the US national debt will increase, just like the stock market. As such, he doubled down on his support for what he referred to as “real assets” – bitcoin, silver, and gold.\n\nWHY is stock market taking off? Because “Debt Ceiling” removed. Means national debt to rise with stock market. Rich get richer as America gets poorer. Sad. Sticking with real money & real assets: Gold, Silver, Bitcoin. — Robert Kiyosaki (@theRealKiyosaki) July 14, 2023\n\nBTC Vs. Gold Vs. Silver YTD\n\nAlthough Kiyosaki keeps praising the two precious metals as well as BTC, it’s worth exploring their performance as of late, especially on a year-to-date basis.\n\nSilver entered the new year at $23,75 per ounce and jumped to over $26 at one point. However, it since retraced to $22 before climbing back to $24.9 to close on Friday, which gives it a modest 4.84% YTD increase.\n\nGold’s performance has been rather identical as it started 2023 at $1,827 before it shot up to a yearly peak at $2,080 on May 4. However, it couldn’t maintain its run and fell back down to $1,955 as of Friday’s closing hours. As such, the yellow metal is up by 7% so far this year.\n\nBitcoin, on the other hand, started the year on a positive note after the devastating 2022 bear market. It quickly surged from its January 1 price of $16,700 to over $20,000 and just this week tapped a 13-month peak at $31,850.\n\nDespite losing some ground and currently trading at $30,300, the cryptocurrency’s YTD gains stand at just over 80%, making it the best-performing asset so far this year."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vaW52ZXN0bWVudHUuY29tL2hvdy1kb2VzLWJpdGNvaW4tbWFrZS1tb25leS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "How Does Bitcoin Make Money? | Learn More - Investment U",
        "content": "Bitcoin is a decentralized digital currency that was created in 2009. No government or central bank is in charge of issuing it. It is also not a business, so it doesn’t have any revenue or a balance sheet. Due to this, the price of Bitcoin can seem a little arbitrary. At a moment’s notice, the price of Bitcoin can spike or slump. So, who determines how much one Bitcoin is worth? And how does Bitcoin make money for investors? Let’s take a look at the answers to these questions and more.\n\nHow Does Bitcoin Make Money and What Makes it Go Up and Down?\n\nThe short answer is supply and demand. If more people are buying Bitcoin instead of selling then the price will trend upward. But if more people are selling instead of buying then the price will trend down. The stronger the buying pressure is, the faster the price will climb. Adversely, the stronger the selling pressure is, the faster the price will drop.\n\nSupply: One of the most important factors of Bitcoin is that its supply is fixed. Bitcoin has a maximum supply of 21 million coins. Once this number is reached, no new coins will be created. This limited supply makes the existing Bitcoins more valuable. It’s a big difference from our existing financial system, which creates new money all the time.\n\nBitcoin’s limited supply is what gives it value as an investment. If an unlimited number of Bitcoins could be created then it would erode the value of each coin.\n\nDemand: Bitcoin is an asset just like a stock, bond, or gold. As such, investor behavior can influence its price. For example, in 2020, China’s citizens may have used Bitcoin to dodge regulations from the government. Since it’s untraceable, Bitcoin gave Chinese investors a way to move money out of the country. This surge in buying led to a runup in Bitcoin’s price at the end of 2021.\n\nOn the other hand, let’s say that the U.S. was to enter into a war. Lots of investors would panic and rush to sell their investments. This surge of selling would likely hurt Bitcoin and cause it to fall in price.\n\nAt first glance, Bitcoin’s price may seem to move randomly. However, if you take a look at the global picture, it can be fairly simple to guess why Bitcoin is trending up or down.\n\nOther Factors Behind Bitcoin’s Price\n\nSupply and demand are the two biggest drivers of Bitcoin’s price. But there are a few other factors that also play a role:\n\nThe cost to mine a Bitcoin. This determines the number of people mining new Bitcoins, which impacts supply.\n\nThis determines the number of people mining new Bitcoins, which impacts supply. The rewards issued to miners for verifying transactions on the blockchain. This also impacts supply.\n\nThis also impacts supply. The number of competing cryptocurrencies. Increased competition can give investors other places to store money.\n\nIncreased competition can give investors other places to store money. The state of the economy.\n\nPotential regulations on the cryptocurrency industry.\n\nIn general, cryptocurrencies have volatile prices. This means that their prices can rise and fall very quickly. But that doesn’t mean that you can’t still earn money. So, how does Bitcoin actually make money for investors?\n\nHow Can You Profit From Bitcoin?\n\nThere are two main ways that investors profit from Bitcoin. The first is to try and trade around the price swings. The second is to buy and hold for the long term.\n\nTrading: Trading Bitcoin is a strategy where investors try to anticipate price movements. They constantly buy and sell Bitcoin in anticipation of where they think the price will move. For example, let’s say a trader buys one Bitcoin at $30,000. The price then surges 10% to $33,000. The investor might sell their Bitcoin and profit $3000. Then, they’ll wait for the price to dip again before buying more.\n\nThis strategy can be risky since the investor has no way of knowing which way the price will move. It requires a high-risk tolerance and good anticipation skills.\n\nBuy and hold: Another way to profit from Bitcoin is simply to buy and hold. This strategy is much simpler. You simply buy Bitcoin and wait for its price to increase over time. The biggest difference is that you are probably comfortable holding Bitcoin for months, if not years.\n\nYou will still experience volatility in the short term. But Bitcoin has a great track record over the long term. Over the past five years, Bitcoin is up almost 4,000%.\n\nBut what about investors who want to use Bitcoin to create income? How does Bitcoin make money for these investors? Let’s take a look.\n\nHow Else Can Investors Make Money?\n\nBitcoin Mining\n\nMining is the process of approving transactions on the blockchain. Since Bitcoin is decentralized, it does not have a main regulating body. Instead, it requires workers to make sure each transaction is legitimate. These workers are called Bitcoin miners. For their efforts, they are rewarded in Bitcoin.\n\nThe mining process requires completing a complex math problem. If you are the first to solve the problem then you win the right to approve a transaction and get rewarded.\n\nGetting started mining will give you a steady stream of Bitcoin. You can then sell this Bitcoin and convert it to dollars. Keep in mind that this process requires a mining rig and tons of computing power.\n\nStaking\n\nCrypto staking is the process of “locking up” your coins for a period of time. Doing this helps contribute to the security of the respective blockchain network. As a reward for staking your coins, you will receive an annual percentage yield. In this sense, it’s similar to keeping your money in a savings account.\n\nStaking is generally only available for many newer coins. It’s usually not available for Bitcoin, since Bitcoin uses a proof-of-work system, not a proof-of-stake one. However, Crypto.com lets you stake Bitcoin. You can expect to earn at least 4-5% APY when you stake your coins. In some cases, you can earn as high as 15%. It all depends on the coin you want to stake and the length of time that it’s staked for.\n\nThose are the two main strategies that answer the question: how does Bitcoin make money? But if you are to expand beyond Bitcoin then there are dozens of ways to make money using cryptocurrency in general.\n\nEntrepreneurship\n\nThere are tons of ways that you can earn money within the world of cryptocurrency. Most of them include starting a business of some sort. Here are just a few new industries that you can explore:\n\nAll of these ventures have the potential to be very lucrative. However, they are also very different from each other. The path that’s best for you will depend on your skillset and financial goals.\n\nI hope that you’ve found this article valuable for learning how does Bitcoin make money? Please remember that I’m not a financial advisor and am just offering my own research and commentary. As usual, please base all investment decisions on your own due diligence."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZGVjcnlwdC5jby8xNDg2MjEva2ltLWRvdGNvbS10ZWFzZXMtYml0Y29pbi1jYXNoLWtpbGxlci1hcHAtYXMtYml0Y2FjaGUtaGVhZHMtZm9yLWxpcXVpZGF0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Kim Dotcom Teases Bitcoin Cash 'Killer App’ as Bitcache Heads for Liquidation - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcache, a crypto project founded by political activist and founder of the now-defunct file hosting service Megaupload, Kim Dotcom, has begun a liquidation process in New Zealand due to unpaid legal fees by the company.\n\n“The business formerly known as Bitcache has been liquidated because a law firm that offered to work for shares in the company decided years later to invoice the company for past legal fees,” tweeted Kim late Thursday. He pointed out that he “was the evangelist for the business and supports the liquidation of the company.”\n\nThe controversial tech entrepreneur has been fighting extradition to the U.S. to face copyright infringement charges for years. In 2012, the FBI alleged that his now defunct service, Megaupload, earned millions by helping people illegally share files.\n\nAD\n\nAD\n\nDespite news of the liquidation, Kim Dotcom tweeted on Thursday that the project will continue under a new name, Fileshop. He added that it’s “been developed from scratch with a completely new code base and without any of the Bitcache IP.” He said he’s also working with some “friendly previous investors and partners.”\n\nThe good news is that the project is now called FileShop, has been developed from scratch with a completely new code base and without any of the Bitcache IP. Very happy to announce that friendly previous investors and partners have not been forgotten and that this app is coming. — Kim Dotcom (@KimDotcom) July 13, 2023\n\nThe new project, says Dotcom, aims to become a “Bitcoin Cash killer app.”\n\nThe Bitcache blockchain, was touted by Kim as a disruption in how online content creators will be able to monetize their content. It was built as a subscription-as-a-service that would allow for Bitcoin to be used for micro-payments–receiving substantial funding through the well known investment firm, BnkToTheFuture.\n\nAccording to a report from Newsroom, a New Zealand media outlet, the platform failed to launch in early 2017, due to “unexpected hiccups” Kim Dotcom said at the time. Dotcom, says Newsroom, was named as an evangelist due to his ongoing disputes with the US government over the now-defunct website MegaUpload.\n\nAlthough Kim Dotcom took heavily to Twitter throughout 2017-2018–claiming his company would introduce millions of new users to Bitcoin–the project never came to fruition. In late 2022, after years of silence, Dotcom announced the project “never got the software right.”\n\nAD\n\nAD\n\nNewsroom reported that Auckland lawyer and former Bitcache director Phil Creagh applied for liquidation last month.\n\n“It’s pretty straightforward, there are fees owed and not paid. The company has not taken any steps so far to avoid being placed in liquidation,” Creagh told the news outlet. “We’ll put it in liquidation and see what, if anything, can be recovered.”"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tb25vY2hyb21lLWZpbGluZy1zcG90LWJpdGNvaW4tZXRmLWFzeC1hdXN0cmFsaWHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Monochrome Bitcoin ETF gets filed to Australian securities exchange - Cointelegraph",
        "content": "Australian-based crypto investment firm Monochrome Asset Management has updated its application to offer a spot Bitcoin (BTC) exchange-traded fund (ETF) on the Australian Securities Exchange (ASX) through its partner Vasco Trustees.\n\nThe ETF — Monochrome Bitcoin ETF — will be able to offer retail Australian investors direct exposure to Bitcoin, according to the firm’s July 14 announcement.\n\nSpeaking to Cointelegraph, Monochrome CEO Jeff Yew explained that by obtaining a license, Australian retail investors would be exposed to Bitcoin within a formidable regulatory landscape:\n\n“Through a Bitcoin ETF, it makes it possible for them to buy and use the asset class in however they see fit with the investment choices [and] in a regulated manner, and also operating within the regular regulatory perimeter.”\n\n“So that is the benefit, I guess, compared to, say, unregulated exchanges where there’s no investor protection,” he added.\n\nYew believes that if a Bitcoin ETF goes live on ASX, it will send a “clear signal” to traditional investors that the “unregulated Wild West is coming to an end” because their investments will be backed by a “familiar,” “structured” and “protected environment.”\n\nVasco, its “Responsible Entity Partner,” is authorized under an Australian Financial Services Licence to offer retail investors regulated exposure to the cryptocurrency market, the firm stated.\n\nRelated: Bitcoin ETF is the needed ‘seal of approval’ for BTC — Mike Novogratz\n\nSpot Bitcoin ETF applications have been a focus point for the industry lately, particularly in the United States. In recent weeks, the industry has seen spot Bitcoin ETF filings from major financial firms, including Fidelity, Invesco, Wisdom Tree, Valkyrie and the $10 trillion asset management firm BlackRock.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nUpdate (July 14 at 15:00 UTC): This article has been updated to reflect that Monochrome's Bitcoin ETF provides exposure only to Bitcoin and not Ether."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2JpdGNvaW4tY3Jhc2hlcy1vdmVyLXJlcG9ydHMtb2YtYmluYW5jZS1sYXlpbmctb2ZmLTEwMDAtZW1wbG95ZWVzL2FydGljbGVzaG93LzEwMTc3NDEyNS5jbXPSAYsBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL3RlY2gvdGVjaG5vbG9neS9iaXRjb2luLWNyYXNoZXMtb3Zlci1yZXBvcnRzLW9mLWJpbmFuY2UtbGF5aW5nLW9mZi0xMDAwLWVtcGxveWVlcy9hbXBfYXJ0aWNsZXNob3cvMTAxNzc0MTI1LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin crashes over reports of Binance laying off 1,000 employees - The Economic Times",
        "content": "Elevate Your Tech Prowess with High-Value Skill Courses Offering College Course Website MIT MIT Technology Leadership and Innovation Visit Indian School of Business ISB Professional Certificate in Product Management Visit IIM Kozhikode IIMK Advanced Data Science For Managers Visit\n\nSan Francisco, Bitcoin prices nosedived on Saturday after leading cryptocurrency exchange Binance reportedly laid off roughly 1,000 workers, and the layoffs could continue.Bitcoin slipped back nearly $30,000 per token after the news emerged late on Friday, which was first reported by the Wall Street Journal.Bitcoin value suffered more than 2.7 per cent loss after the Binance layoff news.As per the WSJ's report, Binance could let go of up to one-third of its workforce, which was nearly 8,000 prior to the start of layoffs.A Binance spokesperson told Forbes it has \"become clear\" to the company that it \"needs to focus on talent density across the organisation to ensure we remain nimble and dynamic\" as it prepares for the \"next major bull cycle.\"The US Securities and Exchange Commission (SEC) is separately suing Binance and Coinbase.Last month, the US regulator sued Binance, its CEO Changpeng Zhao and BAM Trading and BAM Management over allegedly mishandling funds and lying to regulators.In a federal lawsuit, the regulator filed 13 charges against the defendants.Later, a US judge urged the SEC to reach a settlement with crypto exchange Binance to let it continue operating in the US.Binance was also ordered by Belgium's Financial Services and Markets Authority (FSMA) to immediately cease all offers of virtual currency services in the country.The FSMA noted that \"Binance is offering and providing exchange services in Belgium between virtual currencies and legal currencies, as well as custody wallet services, from countries that are not members of the European Economic Area\".The FSMA ordered Binance to cease, with immediate effect, offering or providing any and all such services in Belgium.--IANSna/prw"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1bGxzLWFmdGVyLXhycC1wcmljZS1zcGlrZXMtMTA00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin bulls 'have work to do' after XRP price spikes 104% - Cointelegraph",
        "content": "Bitcoin (BTC) consolidated near $31,000 on July 14 after a classic short squeeze sparked new yearly highs.\n\nBTC/USD 1-day chart. Source: TradingView\n\nBTC liquidates $50 million shorts in new squeeze\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price movements returning to cement support after rapid gains the day prior.\n\nAlready tipped for a trip higher, Bitcoin reacted instantly to news that a United States judge had supported the idea that altcoin XRP (XRP) was not a security.\n\nThis was taken by markets as a blow to regulator the Securities and Exchange Commission (SEC), which in recent months had sought to label altcoins as securities en masse.\n\nXRP/USD immediately spiked by over 100%, almost touching the $1 mark before returning to trade near $0.80 at the time of writing. The last time that such levels formed part of the chart was in April 2022.\n\nXRP/USD 1-week chart. Source: TradingView\n\nBitcoin, while considerably more muted, still managed to liquidate $50 million of shorts, according to data from monitoring resource CoinGlass.\n\nBTC/USD liquidations chart (screenshot). Source: CoinGlass\n\nWhile Cointelegraph reported that bears may still be able to get the upper hand around the weekly options expiry, on the day, traders were cautiously optimistic.\n\n$BTC Aggregate CVDs & Delta\n\nConfluence with market data ~ aggressive short squeeze & covering\n\n\n\nStrong spot bid as well, want to see LTF dips bought by spot pic.twitter.com/XrwJpM6XOV — Skew Δ (@52kskew) July 14, 2023\n\n“Bitcoin failed to breakout overnight and could be falling back into the range here,” popular trader Jelle wrote in his latest social media update.\n\n“Waiting to see how this 4h candle turns out, but bulls have some work to do. A bit of a push, and we can have a lot of fun this weekend.”\n\nFellow trader Crypto Tony voiced frustration at the lack of a clear breakout from Bitcoin’s long-established trading range.\n\n“Rejecting from the range high so no entry for us to just yet on Bitcoin .. Waiting for a solid flip before we get into this,” he told Twitter followers, adding that he “would be disappointed if BTC doesn't flip.”\n\nBTC/USD annotated chart. Source: Crypto Tony/Twitter\n\nAltcoins now due “mega-run”\n\nMeanwhile, XRP staging a comeback formed the background to a snap drop in Bitcoin market cap dominance.\n\nBitcoin market cap dominance chart. Source: TradingView\n\nRelated: Will Bitcoin catch up? BTC price was $40K when the dollar was previously this weak\n\nThe largest cryptocurrency previously constituted almost 52% of the total, dropping below 50% overnight to near one-month lows.\n\nThat did not take long.\n\n\n\nLet's see how $ALTS do once everything settles down a bit. https://t.co/ABBGid4MWL pic.twitter.com/VhRUHqgL9O — Daan Crypto Trades (@DaanCrypto) July 13, 2023\n\nTraders had already hoped that Bitcoin would cool its increasing dominance presence to allow altcoin markets to make gains of their own as part of a broader crypto bull market.\n\n“Good things come to those who wait,” trader Moustache summarized on the day, predicting that the altcoin boom would still go ahead.\n\n#Altcoins\n\n\n\nAltcoins are preparing for a mega-run imo.\n\n\n\nI've been sharing this chart for a few months now and everything is going according to plan.\n\n\n\nIt's just a waiting game.\n\n\n\nGood things come to those who wait. https://t.co/OM2dKtbENW pic.twitter.com/DkasZSkE3t — ⓗ (@el_crypto_prof) July 14, 2023\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wNy8xNS90b3AtY3J5cHRvLWFuYWx5c3QtaXNzdWVzLWJpdGNvaW4tYWxlcnQtd2FybnMtYnRjLWNvdWxkLW51a2UtaWYtb25lLWNyaXRpY2FsLXN1cHBvcnQtbGV2ZWwtY3J1bWJsZXMv0gGJAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzA3LzE1L3RvcC1jcnlwdG8tYW5hbHlzdC1pc3N1ZXMtYml0Y29pbi1hbGVydC13YXJucy1idGMtY291bGQtbnVrZS1pZi1vbmUtY3JpdGljYWwtc3VwcG9ydC1sZXZlbC1jcnVtYmxlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jul 2023 07:00:00 GMT",
        "title": "Top Crypto Analyst Issues Bitcoin Alert, Warns BTC Could Nuke if One Critical Support Level Crumbles - The Daily Hodl",
        "content": "A top crypto analyst is predicting that Bitcoin (BTC) is at risk of collapsing if one scenario plays out in the near term.\n\nPseudonymous analyst DonAlt tells the 52,300 subscribers of the TechnicalRoundup YouTube channel that Bitcoin is looking at a decline of up to 30% if it loses the key $30,000 level.\n\nHe notes that Bitcoin rallied on the positive news of Bitcoin spot exchange-traded fund (ETF) applications and the historic XRP ruling, but that impact may wear off and send BTC plunging.\n\n“Price is higher than it was yesterday. And I’m much more bearish now than I was yesterday on Bitcoin.\n\nNow the altcoins could get a little bit of a tailwind and the Bitcoin thing could get invalidated. I’m not necessarily bearish yet. In general, the cool thing with Bitcoin right now is that basically, this move started off of good news, one, and off of $30,000, a strong, strong level that is just very obvious to see, $30,000 round number, $30,000 just feels like a good number.\n\nAnd I think if we lose both, basically if we lose the news impact and we lose the $30,000 psychological level, I think this is going to collapse – like proper nuke level as in you get like 10%, 20%, 30% down pretty much almost immediately.”\n\nA 30% drop from Bitcoin’s current price of $30,307, would bring BTC to around the $21,000 level.\n\nAccording to DonAlt, Bitcoin may slowly decline in value over the next few days before the entire crypto markets turn bearish.\n\n“Because this news just pushed this thing up 2%. You would expect much, much more. But basically, bullish invalidation is 2% away. And so it doesn’t cost too much to be bullish.\n\nGut feeling of mine still feels like down. I have a few reasons why I’m very, very defensive in the market. But I think altcoins could carry over a little bit of momentum even if we just bleed out the next three, four or five days we could still have a bit of altcoin action.\n\nBut that would be the worst combination honestly. If you get altcoin action, while Bitcoin bleeds this news event out, that’s the most bearish it could be…\n\nAny full retraces of this news event will be very, very bearish. And that means that you can be bullish until it actually happens.”\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2lucy1jcnlwdG8tbWFya2V0LWRvbWluYW5jZS1zbGlkZXMtMTA0ODE5NTM2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin's Crypto Market Dominance Slides by Most in 13 Months as XRP Court Ruling Spurs 'Alt Season' Talk - Yahoo Finance",
        "content": "Bitcoin's (BTC) share of the total crypto market, known as its dominance, tanked Thursday after a U.S. court complicated the Securities and Exchange Commission's (SEC) plan to regulate digital assets and spurred hopes for a sustained outperformance of alternative cryptocurrencies, often called the \"alt season.\"\n\nIn a highly anticipated ruling in the SEC's case against Ripple Labs for violating securities law through XRP sales, the District Court for the Southern District of New York ruled that XRP is not a security when offered to individuals through centralized exchanges, but is one when sold directly to institutions.\n\nThe distinction in the ruling essentially threw a spanner in SEC's plan to paint all altcoins with the same brush and subject them to stringent oversight by categorizing them as securities.\n\nBitcoin's dominance rate fell 2.6% to 50.14% after the court ruling, the biggest one-day decline since June 13, 2022, according to data from charting platform TradingView. Altcoins like XRP, SOL, MATIC and ADA chalked out double-digit gains, outshining bitcoin by a big margin.\n\nSome observers foresee potential for a continue outperformance of altcoins over the near term.\n\n\"Alt season may be upon us following the Ripple news as indicators collectively suggest risk appetite is funneling down the risk continuum,\" Decentral Park Capital said in a market update published Thursday. \"With the U.S. dollar breaking down and the inflation battle nearing the end, it appears to be game on for investors.\"\n\nIn contrast, Noelle Acheson, author of the Crypto Is Macro Now newsletter, said the ruling could help Coinbase in its legal tussle with the SEC, but cautioned against predicting an outsized altcoin rally.\n\nEarly last month, the SEC charged cryptocurrency exchange Coinbase and its offshore rival Binance for offering unregistered securities, a move that injected uncertainty into the market.\n\n\"The ruling should be enough to reawaken greater interest in the shifting market narrative, which itself could be enough to bring in new flows,\" Acheson told CoinDesk.\n\nStory continues\n\n\"However, it's premature to assume that a 'win' is in the bag – the SEC will likely appeal the decision, and given some of the inconsistencies, it might win. At best, the uncertainty will drag on for longer. So, it feels too soon for alt season; that will probably wait until we get greater clarity on the Coinbase case,\" Acheson said.\n\nIn a note to clients on Friday, analysts at K33 Research voiced a similar opinion, saying, \"the ruling will be appealed and might even be reversed, so we expect the ongoing battle to continue.\"\n\nThe court also found Ripple violated securities law when selling XRP directly to institutions. So institutions that bought XRP can come under the regulatory scanner, injecting further uncertainty into the market.\n\n\"It is important to note that institutional investors who purchased directly from Ripple may find themselves subject to class-action litigation as potential underwriters. This is an area to watch closely, especially if big-name venture capitalists were involved,\" CoinShares’ head of product, Townsend Lansing, said. \"The legal landscape continues to change, and we urge all parties to stay informed of these important developments.\""
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2JpdGNvaW4tbmVhci0xMy1tb250aC1oaWdoLWFzLWludmVzdG9ycy13ZWxjb21lLXJpcHBsZS1ydWxpbmcvYXJ0aWNsZXNob3cvMTAxNzYzNTk0LmNtc9IBhwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2JpdGNvaW4tbmVhci0xMy1tb250aC1oaWdoLWFzLWludmVzdG9ycy13ZWxjb21lLXJpcHBsZS1ydWxpbmcvYW1wX2FydGljbGVzaG93LzEwMTc2MzU5NC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin near 13-month high as investors welcome Ripple ruling - The Economic Times",
        "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi10b3BzLTMxNTAwLWV0aGVyZXVtLWFib3ZlLTIwMDAteHJwLXJhbGxpZXMtNjQtYWZ0ZXItY291cnQtcnVsaW5nLTM4OTY3Mi0yMDIzLTA3LTE00gGhAWh0dHBzOi8vd3d3LmJ1c2luZXNzdG9kYXkuaW4vYW1wL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi10b3BzLTMxNTAwLWV0aGVyZXVtLWFib3ZlLTIwMDAteHJwLXJhbGxpZXMtNjQtYWZ0ZXItY291cnQtcnVsaW5nLTM4OTY3Mi0yMDIzLTA3LTE0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin tops $31,500; Ethereum above $2,000; XRP rallies 64% after court ruling - Business Today",
        "content": "Bitcoin and other crypto tokens were going gaga during the trading session on Friday after Ripple's victory with the US SEC in court. Additionally, the upbeat US inflation data stirred the optimism for the global digital assets, which pushed the token to the massive gains.\n\nBitcoin was back in green, posting some big gains. The largest crypto token jumped as much as 4 per cent to hover around $31,500-mark. Its largest peer, Ethereum, outperformed and rose about 8 per cent to top $2,000-levels. However, other altcoins posted robust gains in the last 24 hours.\n\nBitcoin surged to a one-year high above the $31,700 level following a favorable federal court decision for Ripple. BTC has since consolidated and is now trading at the $30,400 level. The month-to-date performance shows a 3 per cent gain, while the year-to-date increase stands at an impressive 89 per cent, said Edul Patel, co-founder and CEO at Mudrex.\n\n\"Soon after this news, XRP reached its highest point in a year within the last 24 hours outperforming the BTC by surging by over 61 per cent. Ethereum, the second-largest cryptocurrency, has also reached a new high by surpassing the $2,000 mark. The current market sentiment appears to be bullish,\" he added.\n\nMajority of the top crypto tokens were trading with masculine gains on Friday with a number of tokens posting double digit gains. XRP rallied 64 per cent, while Solana surged 31 per cent. Cardano gained more than 25 per cent and Polygon advanced 18 per cent. Avalanche and Polkadot added 13 per cent and 10 per cent, respectively.\n\nThe global cryptocurrency market cap was trading sharply higher, surging to $1.26 trillion-mark, as it jumped almost 7 per cent in the last 24 hours. However, the total trading volumes zoomed about 121 per cent to $67.66 billion.\n\nThe crypto market has registered massive gains in the last 24 hours. The crypto fear and greed index has jumped 3 points to remain in the greed zone with a score of 60/100. These market gains have been triggered by a US court ruling which is partially in favour of Ripple, said said Parth Chaturvedi, Investments Lead, CoinSwitch Ventures\n\n\"The court has stated that the trading of XRP amongst retail investors can't be dubbed as a 'securities' sale. The SEC continues to hold its stance against the ruling and will likely re-appeal, but overall this has set a strong precedent for the sector and has resulted in a massive rally in prices,\" he added.\n\nTech View by Giottus Crypto Platform\n\nRipple is currently experiencing a major rally following the victory from SEC v Ripple case, as the Judge ruled Ripple as not a security for retail investors. The asset almost doubled following the news, soaring to as much as $0.94 and is currently trading in the $0.75 range.\n\nFollowing this bullish breakout, after registering short candles for six consecutive days, a pullback can be expected in coming days. The upward shift has propelled the RSI index to the overbought territory and is currently sitting at 78.3.The notable divergence between the 20-day moving average and 100-day moving average suggests bullish momentum over the near term. If the price manages to successfully surpass the $0.85 mark, this could lead to further increase towards the resistance levels of$1.0.\n\nMajor Levels:\n\nSupport: $0.50, $0.68\n\nResistance: $0.85, $1.0\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvbGl0ZWNvaW4tc2lsdmVyLXRvLWJpdGNvaW5zLWdvbGQtMjAyMzA3MTQxMTAx0gFgaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvbGl0ZWNvaW4tc2lsdmVyLXRvLWJpdGNvaW5zLWdvbGQtMjAyMzA3MTQxMTAx?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Litecoin Silver to Bitcoin's Gold - FXStreet",
        "content": "Share:\n\nLitecoin is considered one of the earliest alternative cryptocurrencies to Bitcoin and is sometimes referred to as \"silver to Bitcoin's gold.\" Litecoin is a peer-to-peer cryptocurrency created in October 2011 by Charlie Lee, a former Google engineer, and designed to improve upon some of the limitations of Bitcoin, providing a faster and more efficient cryptocurrency.\n\nLitecoin has consistently been one of the top cryptocurrencies by market capitalization. While it has faced competition from numerous other cryptocurrencies over the years, it has maintained its position as one of the prominent altcoins.\n\nFaster block generation\n\nLitecoin is based on the open-source Bitcoin protocol but has several technical differences. One notable difference is the hashing algorithm used for mining. While Bitcoin uses SHA-256, Litecoin uses a different algorithm called Scrypt, allowing faster block generation.\n\nThus, it has a faster block generation time compared to Bitcoin. While Bitcoin's average block time is around 10 minutes, Litecoin has a target block time of 2.5 minutes. This faster block time enables quicker transaction confirmations. The total supply of Litecoin is capped at 84 million coins, four times the supply of Bitcoin, which, as is known, has a maximum limit of 21 million. Why 84 and not 21 million? Because in 10 minutes, four blocks of Litecoin come out instead of one of Bitcoin.\n\nMining\n\nThe mining process in Litecoin, as in other cryptocurrencies, is crucial in maintaining network security and achieving consensus. Miners compete to find valid hashes, and once a block is mined and added to the blockchain, it becomes part of the immutable ledger. Mining in Litecoin follows a similar concept to Bitcoin mining but as already mentioned, uses a different hashing algorithm called Scrypt, which is more memory-intensive than Bitcoin's SHA-256 algorithm.\n\nThe Litecoin network adjusts the mining difficulty level every 2016 blocks (approximately every 3.5 days) to maintain an average block generation time of around 2.5 minutes. If blocks are being mined too quickly, the difficulty increases, making it harder to find a valid hash. Conversely, the difficulty decreases if blocks are mined too slowly, making it easier to find a valid hash.\n\nWhen miners successfully mine a new block, they are rewarded with a certain number of Litecoins as a block reward. Initially, the block reward was 50 Litecoins, but it reduces by half through a process called halving. As of the most recent halving in August 2019, the block reward stands at 12.5 Litecoins per block. This reward serves as an incentive for miners to contribute their computational power to secure the network.\n\nHalving in Litecoin\n\nHalving in Litecoin occurs every 840,000 blocks, which is roughly equivalent to four years based on the target block time of 2.5 minutes. The first Litecoin halving took place on August 25, 2015, and subsequent halving occurred on August 5, 2019, while in a few weeks, on August 04, 2023, we will once again have the halving phenomenon.\n\nThe primary purpose of halving is to control the issuance rate of new Litecoins and manage inflation. By reducing the block reward, halving gradually decreases the rate at which new Litecoins are introduced into circulation, ultimately leading to a maximum supply of 84 million Litecoins.\n\nExpectations for Litecoin\n\nHalving events often generate interest and anticipation in the cryptocurrency community, as they are seen as significant milestones. The reduction in the rate of new Litecoin issuance, coupled with the increasing demand, can potentially lead to scarcity, which, in turn, may positively impact Litecoin's price.\n\nThis, coupled with data from on-chain analytics company Santiment, which shows that the total number of large Litecoin wallets, i.e. Litecoin addresses with at least 10,000 coins, has increased in recent months, is likely to attest to Litecoin's upward trend. It is also noteworthy that 64% of Litecoin holders are profitable, as on-chain data shows.\n\nAll of the above may suggest that the upward slope of the past few months may develop into a strong uptrend that is likely just around the corner."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vaW52ZXN0bWVudHUuY29tL3dpbGwtYml0Y29pbi1nby1iYWNrLXVwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Will Bitcoin Go Back Up? And if So, When? - Investment U",
        "content": "Will Bitcoin go back up in price? Absolutely. And how about other cryptocurrencies? Some will and others won’t survive a prolonged crypto winter. You see, the crypto markets are the very definition of a news-driven market. A little bit of good news, and markets go up. But a little bit of bad news, and prices can tank quickly.\n\nIf you’ve been following the crypto markets lately, you know there’s a whole lot more bad news than good news going around. Terraform’s LUNA project crumbled. Celsius Network paused all withdrawals, swaps and transfers between accounts. And that’s not the only exchange with questions of solvency looming around it. Coinbase recently let go of 18% of its workforce. Gemini has made similar moves. And there are rumors that plenty of other exchanges could be even worse off.\n\nSo yea, there’s not a lot to be positive about when it comes to crypto right now. That’s why we’ve taken a long view on crypto for the time being. We’re not holding out hope for any major short-term upward movement in price. But in the next couple years, it’s quite possible Bitcoin will not only go back up, but will exceed its former highs.\n\nThat being said, crypto investors recently got a little much-needed good news… In a roundabout sort of way. Talking head Jim Cramer was recently on CNBC’s Squawk Box, where he said:\n\nCrypto really does seem to be imploding. Went from $3 trillion to $1 trillion. Why should it stop at $1 trillion? There’s no real value there.\n\nThis might sound like bad news. But those that have been following Cramer’s crypto advice think otherwise…\n\nWill Bitcoin Go Back Up? Maybe Sooner Than We Thought\n\nSay what you will about the host of Mad Money and his investment advice. We’re sure he’s offered some good information over the past 17 years. But crypto hasn’t proven to be Cramer’s forte. In fact, he’s garnered some notoriety for his coverage of crypto markets.\n\nHe recommended investors take up a sizable stake in Coinbase (Nasdaq: COIN) stock when it was trading around $250 a share. Shares of the popular exchange haven’t fared so well since then. They’ve fallen to below $75 a share.\n\nOn top of this, Cramer first noted he took a stake in Bitcoin in December 2020. He then mentioned he sold most of his stake in Bitcoin in June 2021. His reasoning was that the price wasn’t going up due to structural reasons, regulations and cyberattacks. Whoops. A handful of months later, Bitcoin hit its all-time high of $69,000.\n\nMore recently, back in April, he forecasted that Ethereum was likely to see a 40% short-term gain. Since then, Ethereum has fallen roughly 60%. So again, Cramer doesn’t exactly have a marvelous track record when it comes to crypto. So will Bitcoin go back up in the coming weeks? Maybe months? That’s a hard… maybe. But we’ll certainly be rooting for the “Cramer Effect” to take hold of the crypto markets again.\n\nBut while it would be funny – if not hilarious – if ol’ Jimmy Cramer completely missed the mark yet again, it’s the opposite of a sure thing. More realistically, we’re anticipating Bitcoin (and the crypto markets as a whole) to be pretty quiet for the next couple of years.\n\nThis, of course, offers an interesting long-term investment opportunity. Should folks be investing in crypto right now? Well, that depends…\n\nSome Tokens May Work Out Better Than Others\n\nOf late, we have seen a number of random tokens outperforming the crypto markets at large. That’s not terribly difficult right now, but still…\n\nFor instance, Numeraire (NMR) has been on a solid run of late. And before that, Chainlink, XCAD and MoveZ all went on impressive short-term runs. Some of these tokens jumped up as much as 50% in value. But those gains were short lived for the most part. But this serves as a reminder that even in a sideways market, there’s money to be made. Even for short-term traders.\n\nQuick moves like these are best capitalized on by crypto day traders. They can also be tracked using crypto trading bots. These programs can help take some of the guesswork and chart analysis out of the equation. That being said, there’s less certainty that microcap tokens like these will survive a prolonged downturn in the market. So they may be good for some possible short-term gains, but they offer a bit less assurance for the long haul.\n\nThese price movements also help remind us that there’s still some life in the crypto markets. Even right now. So will Bitcoin go back up? There’s plenty of reason to believe it’ll have its turn again… Just like the smaller tokens mentioned above.\n\nHowever, we’re not suggesting an inevitable demise of any token. For all we know, they could outlive your grandkids. But, if we were to put a sizable investment into any token right now, it would have to be one with some specific characteristics.\n\nFour Elements of a Long-Term Crypto Token\n\nLook for a strong use case. Any crypto worth its salt should have a good reason to exist – beyond simply helping investors head “to the moon.” Reading a token’s whitepaper usually offers the best explanation of its use case (if it has one).\n\nLook for community engagement. A token’s team might have a strong presence on Telegram, Discord or even Twitter where it interacts with folks. That can be a good sign that there is interest from developers, miners, stakers and other folks who have a long-term interest in the project.\n\nLook for longevity. While this isn’t the most important factor. A token that’s been around the block a few times has a better chance at surviving a long bear market than a new one does. Will Bitcoin ever go back up you, you ask. This point is a key reason we think it will. It’s done so time and time again. It’s been down before. And it’s bounced back every other time. Why would this time be any different?\n\nDo all the research above and then some. Any investment worth making is worth some extra time investigating. Look into the management team behind the project. (Although this obviously doesn’t apply to the mystery team behind Bitcoin.) Check to make sure a token’s liquidity pool is solvent.\n\nWill Bitcoin Go Back Up: The Bottom Line\n\nThere’s ample reason to believe Bitcoin and the crypto markets in general will eventually bounce back. Whether that comes from the next Bitcoin halving in 2024 or the “Cramer Effect,” we’re not sure. But in the meantime, the down markets have given folks a whole lot more buying opportunities than they had a few months ago.\n\nWill Bitcoin go back up? Almost assuredly. However, it’s likely to see a whole lot of volatility in the meantime. So the key here is to only invest what you can live without for the next couple years. Don’t dip into the rainy day fund to invest in crypto. It might rain. We highly recommend only investing what you could reasonably consider lost money in the short term."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vcGhvdG9zL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1idGMtYml0Y29pbi1ldGhlcmV1bS1zaGliYS1pbnUtc29sYW5hLXBvbHlnb24tZG9nZWNvaW4tMTcyMjE5NzEuaHRt0gGJAWh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9waG90b3MvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlLXRvZGF5LWJ0Yy1iaXRjb2luLWV0aGVyZXVtLXNoaWJhLWludS1zb2xhbmEtcG9seWdvbi1kb2dlY29pbi0xNzIyMTk3MS5odG0vYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin, Ethereum and other tokens gain, Solana surges 33% - CNBCTV18",
        "content": "1 / 7\n\nBitcoin | The world's largest and most popular virtual currency, Bitcoin, gained 2.68 percent to $31.236. Its market value stood at $606.96 billion. The trade volume was at $26.33 billion.\n\n2 / 7\n\nEthereum | The second largest virtual currency, Ethererum or Ether, gained 6.78 percent to $2,000.43 with a market capitalisation of $240.33 billion. The trade volume of Ethereum was $12.94 billion in the last 24 hours.\n\n3 / 7\n\nDogecoin | Meme-based virtual currency, Dogecoin, was up 8.49 percent. Its market value stood at $9.87 billion. The trade volume was at $774.62 million.\n\n4 / 7\n\nShiba Inu | Shiba Inu gained 6.55 percent with a market capitalisation of $4.69 billion. The trade volume was $225.89 million in the last 24 hours.\n\n5 / 7\n\nSolana | Solana gained 33.30 percent to $29.142 with a market capitalisation of $11.58 billion. The trade volume of Solana was $2.54 billion in the last 24 hours.\n\n6 / 7\n\nPolygon | Polygon gained 18.73 percent with a market capitalisation of $7.99 billion. The trade volume was $1.07 billion in the last 24 hours.\n\n7 / 7"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2lucy10cmFuc2FjdGlvbi1udW1iZXJzLXJlYm91bmQtYnV0L9IBQ2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2lucy10cmFuc2FjdGlvbi1udW1iZXJzLXJlYm91bmQtYnV0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 15 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin’s transaction numbers rebound, but… - AMBCrypto News",
        "content": "Bitcoin’s block interval significantly dipped as the hash rate soared.\n\nThe number of unconfirmed transactions in the Mempool queue was low.\n\nTransaction fees on the Bitcoin [BTC] network have dropped to their lowest levels since March, potentially causing more hardship for miners. According to a tweet by on-chain analytics firm IntoTheBlock, the total fees collected on 14 July stood at $3.6 million, marking a 37.7% increase from the previous day.\n\n#Bitcoin fees dropped to their lowest since March, despite transaction activity rebounding pic.twitter.com/xT9VMYoXOP — IntoTheBlock (@intotheblock) July 14, 2023\n\nIs your portfolio green? Check out the Bitcoin Profit Calculator\n\nInterestingly, the decline in fees came despite a sharp rebound in on-chain trading activity. As per the Glassnode chart below, transaction numbers witnessed a robust recovery in July after weeks of downtrend.\n\nIn fact, the transaction count last weekend reached its highest level since the BRC-20 euphoria of May. What could then possibly explain the dip in fees?\n\nBlock intervals dip\n\nThe period witnessing the surge in transaction count also saw a sharp uptick in the network hash rate. A growing hash rate is a positive development in the sense that it makes the network more decentralized and secured.\n\nHowever, a growing hash rate also reduces the rate at which new blocks are mined and added to the chain. As depicted below, the block interval significantly dipped as the hash rate soared. This meant that transactions could be processed quickly without people needing to bid up their fees to jump the line.\n\nAccording to Mempool data, the number of unconfirmed transactions in the queue at the time of writing was 259,652, a considerable decrease from the 465,000 seen in early May. A fee of $0.3 was being charged, ruling out prioritizing transactions.\n\nMiners’ woes continue\n\nLow transaction fees over blockchain networks work in favor of users, especially when making low-value transactions. This bodes well for the widespread adoption of Bitcoin by retail users.\n\nOn the contrary, reduced fees adversely impacts miners’ economics. Miners need to be incentivized to validate transactions and secure the Bitcoin network. They rely on these incentives to cover their hardware and electricity costs.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nBitcoin miners fought the punishing bear market of 2022 with tenacity, expecting to recoup their losses in 2023. However, after achieving yearly peaks in May, their earnings have significantly dried up."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xNDg2MTIvYmxhY2tyb2NrLWNlby1sYXJyeS1maW5rLWNyeXB0by10cmFuc2NlbmQtY3VycmVuY3nSAVJodHRwczovL2RlY3J5cHQuY28vMTQ4NjEyL2JsYWNrcm9jay1jZW8tbGFycnktZmluay1jcnlwdG8tdHJhbnNjZW5kLWN1cnJlbmN5P2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "BlackRock CEO Larry Fink: Crypto Will 'Transcend Any One Currency' - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBlackRock boss Larry Fink has upped his bullish stance on cryptocurrency as an investment, today saying that “it’s going to transcend any one currency.”\n\nThe CEO of the world’s largest asset manager said in a Friday interview with CNBC that although he couldn’t talk about Bitcoin specifically as BlackRock had filed an application with the U.S. Securities and Exchange Commission for a spot market Bitcoin ETF, crypto “has a differentiating value versus other asset classes.”\n\nBlackRock—which manages $9.5 trillion in assets—last month applied to the SEC for a spot Bitcoin exchange-traded fund, leading institutional investors to pour money into the space and in turn causing the asset to jump to a 12-month high.\n\nAD\n\nAD\n\n“We believe we have a responsibility to democratize investing,” he said regarding ETFs. “Over the last five years, more and more global investors are asking us about the role of crypto—and like I said, I do think a lot of crypto is an international asset.”\n\n“More importantly, because it’s so international, it’s going to transcend any one currency in currency valuation,” he continued, adding that an “international crypto product” can “transcend” the problem of dollar devaluation.\n\nA spot market Bitcoin ETF would give institutional investors access to Bitcoin without having to deal with complex storage issues, which could mean more money flowing into the market should an ETF ever be approved.\n\nETFs are popular investment vehicles that allow people to buy shares that track the value of an underlying asset like gold, foreign currencies, or cryptocurrency.\n\nA spot Bitcoin ETF does not yet exist in the U.S., but a number of high-profile investment firms have applied to the SEC for one. The SEC has been reluctant to approve such a product, though, citing market manipulation as one of the concerns.\n\nAD\n\nAD\n\nJust last week, billionaire Fink said the role of crypto is “digitizing gold” and that Bitcoin was “an international asset.”\n\nBut back in 2017, he said that “Bitcoin just shows you how much demand for money laundering there is in the world.” He changed his stance over the years, later claiming that it was a “great asset.”"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi93aHktaXMtYml0Y29pbi1wcmljZS11cC10b2RheS0yL9IBSWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi93aHktaXMtYml0Y29pbi1wcmljZS11cC10b2RheS0yL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Why Is Bitcoin Price Up Today? - NewsBTC",
        "content": "The Bitcoin price tagged a new yearly high yesterday at $31,840, leaving market participants wondering about the driving forces behind this bullish momentum.\n\nThe Power of Economic Indicators\n\nOne of the crucial factors contributing to Bitcoin’s upward trajectory was the release of the United States Producer Price Index (PPI) data. The latest figures revealed a significant slowdown in inflation, with PPI YoY dropping to 0.1% in June, surpassing expectations and marking the smallest pace since August 2020. Notably, the Core PPI YoY came in at 2.4%, slightly below the estimated 2.6%, reinforcing the notion of a diminishing inflationary environment.\n\nThis decrease in PPI is seen as a positive sign for the Consumer Price Index (CPI), providing hope for a more stable economic landscape. Macro researcher Mortensen Bach emphasized the significance of the PPI’s impact, stating, “PPI always leads CPI. Inflation is no longer a thing and input prices clearly indicate that! Deflation remains the primary risk going forward. This is what happens when you have a Federal Reserve who is blindly focused on backward-looking data!”\n\nEchoing these sentiments, macro analyst Ted added, “PPI inflation leads CPI by a few months… and today’s PPI numbers have YoY running at +0.24%. Almost in deflation! Fed pivot anyone?”\n\nAlso worth noting is that, May PPI inflation was revised lower from 1.1% to 0.9%. May Core PPI inflation was revised lower from 2.8% to 2.6%. The drop and revision lower in Core PPI is what the US Federal Reserve wants to see.\n\nInverse Correlation With The DXY\n\nAnother pivotal factor driving Bitcoin’s surge is the recent drop in the US Dollar Index (DXY) below 100.00, a level not seen in 15 months. This development has sparked renewed interest in risk assets like Bitcoin as a hedge against a weakening dollar.\n\nThe inverse correlation between the DXY and Bitcoin has historically played a significant role in the cryptocurrency’s price movements, and this recent drop in the DXY has acted as yet another bullish catalyst.\n\nRipple’s Partial Victory\n\nThe ongoing legal battle between Ripple Labs and the US Securities and Exchange Commission (SEC) has probably provided another boost to Bitcoin’s price. Ripple’s partial victory in the case has generated optimism in the crypto community and can be seen as a net positive event for Coinbase, which is embroiled in its own legal dispute with the SEC.\n\nInterestingly, Coinbase serves as the exchange partner for all U.S. Bitcoin spot Exchange-Traded Funds (ETFs) currently filed with the SEC. Recently, chair Gary Gensler’s comments on Coinbase’s involvement in ETF filings have raised concerns about the suitability of the exchange as a market surveillance sharing partner, as Bitcoinist reported.\n\nEric Balchunas, a Senior ETF analyst for Bloomberg, expressed his apprehension, suggesting that “SSA could be pointless if this is a problem for him.” With this in mind, the Ripple victory can also be seen as extremely positive news for the approval of a Bitcoin spot ETF, as Coinbase could benefit from the ruling in its case against the SEC.\n\nAt press time, the BTC price retraced to $31,250, up 2.6% in the last 24 hours.\n\nFeatured image from iStock, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3Lm91dGxvb2tpbmRpYS5jb20vY3J5cHRvL2NyeXB0by1wcmljZS11cGRhdGUtZ2xvYmFsLW1hcmtldC1yYWxsaWVzLTYtNS1hcy1iaXRjb2luLWV0aGVyZXVtLXNlZS1iaWctZ2FpbnMtbmV3cy0zMDI3NjTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Update: Global Market Rallies 6.5% As Bitcoin, Ethereum See Big Gains - Outlook India",
        "content": "XRP (XRP) was the most trending and the top gainer cryptocurrency, up 66.47 per cent to $0.7873. Its 24-hour trading volume was $12.7 billion. ECash (XEC) was the top loser, down 4.40 per cent to $0.00003134. Its 24-hour trading volume was $72 million."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vZmluYm9sZC5jb20vZ3VpZGUvZmFzdGVzdC13YXktdG8tYnV5LWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "Fastest Way to Buy Bitcoin [2024] | Step-by-Step - Finbold - Finance in Bold",
        "content": "Summary: If you are looking for the fastest way to buy Bitcoin, consider acquiring BTC through a regulated third-party cryptocurrency trading platform, such as BYDFi.\n\nAll-in-One Crypto Exchange - Get Your First Coins in 2 Minutes Multiple Licenses - Reliable and Regulated\n\nService Diversification - One-Stop Trading Platform\n\nCopy Trading - Get Copied, Get Paid\n\nEasy Deposit & Withdrawal - From Fiat to Crypto, Fast and Easy 500,000+ Users Get Started\n\nAbout Bitcoin\n\nWhat is Bitcoin (BTC)? Bitcoin ( BTC ) is a decentralized cryptocurrency known for being the first successful electronic money based on peer-to-peer technology that you can use for transactions without any intermediary service, such as banks . Created by an anonymous person or collective with the pseudonym Satoshi Nakamoto , Bitcoin is fully decentralized, with a public ledger that lists every transaction made with the cryptocurrency.\n\nBitcoin’s blockchain, or digital body of interlinked transaction data, can be accessed and edited by anyone. Although this sounds risky, this is the blockchain’s core perk: the majority of stakeholders must verify each transaction, making fraud extremely difficult to pull off.\n\nAfter Bitcoin, many other altcoins came forth, such as Ethereum (ETH), XRP, and Dogecoin (DOGE). The estimated number of cryptocurrencies in circulation as of December 2023 is over 8,850.\n\nWhere to buy Bitcoin?\n\nBitcoin is the most popular cryptocurrency, so investors regularly buy and use it to diversify their portfolios. As BTC remains the most popular crypto investment asset, virtually all cryptocurrency exchanges trade it as part of their service.\n\nYou can buy Bitcoin as part of active day trading efforts to profit from price changes or to hold on to it in anticipation of its value rising. Regardless of which, the best way to buy BTC is via BYDFi, a regulated and competitive crypto investing service that provides investors with the following:\n\nOver 400 different crypto assets;\n\nCopy trading;\n\nAdvanced features such as pot, leveraged pairs, and perpetual with up to 150x leverage;\n\nA significant degree of regulation (such as MSB and FINTRAC registration for the US and Canada);\n\nUser-friendly interface.\n\nAdditionally, BYDFi maintains tight security measures and implements the ‘Know Your Customer’ policy, making it a safe platform to trade cryptocurrencies.\n\nHow to buy Bitcoin fast: step-by-step\n\nBuying Bitcoin with BYDFi can be done in two minutes with a straightforward and quick procedure.\n\nStep 1: Create a free account on BYDFi website or app\n\nVisit the BYDFi website and click the [Get Started] button in the top right corner of the screen.\n\nAlternatively, initiate the process using an email sign-up prompt in the center of the page. Type in your email address and press the [Get Started] button.\n\nOnce you do this, the platform will give you two account registration options: via an email address and through a phone number.\n\nEmail registration:\n\nIf you decide to register using an email, type in your address and press [Send] to start the verification process. Once done, BYDFi will send you an email with a six-digit verification code, which you should copy and paste into the field.\n\nMove on to create a login password. Click on the circle next to the terms and conditions to check them. Optionally, you can type in an invitation code in the respective field.\n\nAfter that, press the orange [Get Started] button.\n\nMobile registration:\n\nThe procedure is similar for registration via phone number. BYDFi will send the verification code by SMS; the rest of the steps should be followed as in the first method.\n\nYou are now an owner of a BYDFi account and one step closer to buying Bitcoin. The next step is to fund the newly-made account.\n\nStep 2: Decide on the amount and buy Bitcoin\n\nAfter creating an account and logging in, the next step is to transfer the funds and buy Bitcoin.\n\n1. Click the [Buy Crypto] button on the top left side of the main navigation bar.\n\n2. Find and select BTC as the receiving coin and choose the fiat currency you want to buy it with.\n\n3. Scroll down to see the payment channels and select your preferred method. Note that third-party services may charge a fee for fiat deposits. The BYDFi platform does not process fiat purchases directly.\n\n4. Depending on your preference, after you press [Buy Now], you will get several payment options:\n\nCredit card payment;\n\nApple Pay;\n\nGoogle Pay;\n\nCashApp;\n\nBank wire.\n\nConsider the amount of BTC you want to purchase. Transfer times will be different depending on the payment method you choose. As for BYDFi, the transaction is complete within 2-10 minutes.\n\nStep 3: Review the fees and confirm your order\n\nBYDFi will provide precise information on fees, costs, and the number of BTC tokens you receive once you confirm the order and make the transaction.\n\nThe platform’s fees are straightforward and competitive – crypto spot trading fees range between 0.1% and 0.3% of the transaction amount, depending on the cryptocurrency you invest in. BYDFi does not have deposit fees, only a flat fee per transaction to cover the maintenance costs. Third-party crypto exchanges and fiat transfer services may introduce their own rates if mandated by your trading method.\n\nStep 4: Set up storage\n\nWe are nearing the end of the process; you confirmed your order and received (or are about to receive) the tokens. You can hold the received sum of BTC in your BYDFi account or store it in a personal crypto wallet.\n\nWhen it comes to storage, BYDFi securely stashes your crypto investment in offline devices named cold wallets. Regardless, if you want to, you can manage security yourself and use a crypto wallet of your own. Either way, you should limit or completely deny potential access points to your digital portfolio.\n\nUltimately, even if the platform goes through a digital breach, hackers will not run away with your tokens, as BYDFi’s servers do not keep a record of private keys.\n\nTrading tips for the fastest buying of Bitcoin\n\nTrading Bitcoin, or any other cryptocurrency, requires meticulous planning and preparation. In order to be ready for the potential challenges of investing, you need to understand both the market and the asset.\n\nSo, to maximize your profit, make sure you do your research before you put your money into any speculative asset. Follow the golden rule: ‘Plan your trade and trade your plan.’ To manage the risks involved, diversify your portfolio. Finally, familiarize yourself with the following:\n\nNote If you want to learn more about crypto trading, check out our ‘How to Invest in Crypto’ guide to strengthen your trading position.\n\nBTC price today\n\nPros and cons of buying Bitcoin\n\nPros Store of value : Bitcoin carries the title of ‘digital gold’, as investors expect it to retain value over time;\n\n: Bitcoin carries the title of ‘digital gold’, as investors expect it to retain value over time; High liquidity : As BTC is accepted in many commercial activities, even becoming a legal tender in some countries, it is highly liquid, and you can change it to and from cash quickly;\n\n: As BTC is accepted in many commercial activities, even becoming a legal tender in some countries, it is highly liquid, and you can change it to and from cash quickly; Historically high returns : Quickly after it entered commercial use, Bitcoin became the best-performing asset in the past decade. Even small companies and individuals who invested in Bitcoin early on made colossal success stories;\n\n: Quickly after it entered commercial use, Bitcoin became the best-performing asset in the past decade. Even small companies and individuals who invested in Bitcoin early on made colossal success stories; Fixed supply: As Bitcoin has a set number of tokens, it has a deflationary aspect that is expected to boost each coin’s value. Cons Volatile : Cryptocurrencies are volatile assets that have to be regularly monitored: Bitcoin, although stabler than many, is not an exception;\n\n: Cryptocurrencies are volatile assets that have to be regularly monitored: Bitcoin, although stabler than many, is not an exception; Competition : Although it is still the best-performing token, BTC has gained thousands of rivals in past years, all vying for dominance. If any crypto coin provides a better transaction formula, Bitcoin will decrease in significance;\n\n: Although it is still the best-performing token, BTC has gained thousands of rivals in past years, all vying for dominance. If any crypto coin provides a better transaction formula, Bitcoin will decrease in significance; High energy consumption : Bitcoin functions on the proof-of-work consensus, incentivizing miners to run specialized computers that consume stunningly large amounts of energy;\n\n: Bitcoin functions on the proof-of-work consensus, incentivizing miners to run specialized computers that consume stunningly large amounts of energy; Low TPS: Bitcoin has significantly fewer transactions per second, unlike some of its peers like Solana.\n\nMistakes to avoid when investing in cryptocurrencies\n\nMistakes do hurt, but some are inevitable in this branch of commerce. However, you can easily prevent making some common investing mistakes that others have made if you follow specific guidelines. What you should avoid at all costs includes:\n\nNot doing research : Many decisive factors make the crypto market turn. Thoroughly researching them is necessary if you want to increase your investment’s success;\n\n: Many decisive factors make the crypto market turn. Thoroughly researching them is necessary if you want to increase your investment’s success; Not considering their budget : There are no guaranteed outcomes in investing. All crypto coins have volatile periods, even Bitcoin. Invest only what you can afford to lose ;\n\n: There are no guaranteed outcomes in investing. All crypto coins have volatile periods, even Bitcoin. Invest ; Falling for fraud : Rug pulls and pump and dump schemes occur frequently in the crypto market, most targeting novice traders. Trade crypto with caution and via regulated and authorized services only;\n\n: Rug pulls and pump and dump schemes occur frequently in the crypto market, most targeting novice traders. Trade crypto with caution and via regulated and authorized services only; Neglecting security : The security of your investments is just as important as earning money in the first place. Consider using a crypto wallet;\n\n: The security of your investments is just as important as earning money in the first place. Consider using a crypto wallet; Impulsive decision-making: Conclusions made and followed through under emotional stress can harm your investment goals. Keep your head cool and your hand steady.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk.\n\nFAQs about the fastest way to buy Bitcoin:\n\nHow to buy Bitcoin? The fastest way to buy BTC online is through a professional and competitive intermediary crypto exchange service, such as BYDFi.\n\nWhere to buy Bitcoin? Virtually all cryptocurrency exchanges offer Bitcoin, and you can get it with the help of a third-party cryptocurrency exchange. Consider BYDFi as a recommended candidate.\n\nHow to buy Bitcoin with a credit card? You can trade for Bitcoin using a credit card on BYDFi. It is a standard procedure and is available for every payment method on the platform.\n\nHow to buy Bitcoin in the US? Most US-based exchanges offer BTC, and you can purchase it through many international brokerages.\n\nHow to buy Bitcoin in the UK? You can buy BTC in the UK through every major cryptocurrency exchange. You will need to use the services of an online cryptocurrency brokerage like BYDFi."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vaW52ZXN0bWVudHUuY29tL2J0Yy1wcmljZS1wcmVkaWN0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Jul 2023 07:00:00 GMT",
        "title": "BTC Price Prediction: Bitcoin's Unbelievable Forecast for 2032 - Investment U",
        "content": "The BTC price prediction for the next decade is staggering. In fact, most analysts believe the poster child of the cryptocurrency market is set to take off even further. Bitcoin is down more than 50% in the past year due to the market downturn, regulations and crypto uncertainty. However, experts are still riding high on Bitcoin. Let’s take a further look at the BTC price prediction and what this could mean for investors.\n\nBTC Price Prediction 2022-2032\n\nBitcoin truly rose to prominence in 2020 before taking off in 2021. Specifically, it hit an all-time high of $68,990.90 in November of 2021. But it has come back down to Earth in 2022, much like the rest of the market. It’s trading around $20,000 at the moment and is facing extreme levels of volatility.\n\nBitcoin launched in 2009 and its price climbed more than 9,000,000% over the next 11 years! And this is despite the crypto winter in 2018 when the entire market took a major hit. It rose to historic levels soon after, but now it’s down again due to what experts believe to be the global climate. Recession fears are everywhere, inflation is soaring and spending is down. Moreover, this isn’t just affecting cryptocurrencies. The traditional stock market is in a downturn as well.\n\nYet, the BTC price prediction remains strong moving forward. And it really isn’t that hard to understand why. Bitcoin is a household name. It’s the largest cryptocurrency in the world by a huge margin. And it’s proven to recover better than any digital currency on the market.\n\nBitcoin has staying power and a lower barrier to entry right now. Furthermore, the crypto boom is still alive and well due to a surge of new, young and energetic investors. As a result, most analysts consider Bitcoin to be a home run investment over the next decade.\n\nThe current BTC price prediction has Bitcoin hovering around $200K by 2027. By 2030, the average projection is sitting at half a million dollars! And by 2032, it could hit $800K or more. These are lofty expectations, but major players such as Changelly are sticking to these forecasts.\n\nLong-Term Investing in Bitcoin\n\nBitcoin isn’t going anywhere. And its projections are better than almost any other investment in the world. However, you must take the BTC price prediction with a grain of salt, so to speak. It’s clear that Bitcoin has massive long-term value. But will it really hit $1 million in the next decade? I highly doubt it. And that’s not a bad thing.\n\nThe likelihood that Bitcoin hits $1 million by 2032 is quite low. But it’s looking like major growth is on the way nonetheless. Coming close to $500K would bring in massive, life-changing gains for current investors who hold on for the long-term. And while the price is down to $20,000, it may be worth making an investment. As you can see, the experts are very optimistic about Bitcoin’s future. And these are people who spend all day analyzing Bitcoin’s price fluctuations, history, news cycles and everything in-between.\n\nInvesting in Cryptocurrencies\n\nThe cryptocurrency market comes with higher risks than traditional stocks. Therefore, it’s important to do your due diligence before making any investment decisions. But this doesn’t mean you should cast aside cryptocurrencies altogether. With higher risks comes higher rewards. And many Americans have made millions of dollars investing in cryptocurrencies.\n\nTo learn more about the current market and potential investment opportunities, sign up for one of the best investment newsletters. There are various e-letters that provide expert analysis, trends and chart breakdowns for absolutely FREE. This research may help you enhance your portfolio when it needs it most. And you don’t want to miss out on the next big investment that takes off.\n\nIt’s clear the BTC price prediction has long-term investors licking their chops and dreaming of riches. Nevertheless, keep a close watch on Bitcoin and determine if it’s the right fit for your investment portfolio."
    }
]