[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2FyZ2VudGluYS1taWxlaS1iaXRjb2luLXByZXNpZGVudNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Argentina elects pro-Bitcoin president Javier Milei - Blockworks",
        "content": "A runoff election in Argentina, Sunday, resulted in a win for Javier Milei, a libertarian on the political right who wants to dollarize the country’s economy and has expressed support for Bitcoin.\n\nMilei won about 56% of the vote versus just over 44% in the runoff, in Latin America’s third most populous nation.\n\nIn a country which has recently witnessed triple-digit rates of inflation, Milei sees bitcoin and digital currencies as an effort to “return money to its original creator: the private sector.”\n\nLoading Tweet..\n\nEmphasizing Bitcoin’s finite supply, he regards it as a more secure alternative to traditional mediums like gold or silver​​​​.\n\nMilei, known for his anti-central banking stance, has criticized the central bank for “cheating good people” through inflationary tax. He claimed that he would “blow it up,” calling it a scam, even releasing a cinematic political ad in 2021 while running for a seat in parliament, in which he’s seen destroying a model representing the central bank with a Thor-like hammer.\n\nLoading Tweet.. The ad, surfaced recently, was produced in 2021.\n\nHis criticism is particularly poignant given Argentina’s high inflation rates, which reached 135% in 2023​​. The peso has fallen in value, resulting in all-time highs for bitcoin (BTC), currently about ARS 13.2 million per BTC.\n\nMilei has been involved in controversies, including being sued for allegedly promoting a Ponzi scheme called Coinx in Argentina. He denied any misconduct, comparing the company’s actions to those of a typical bank​​.\n\nDespite his support for cryptocurrencies, Milei has not proposed making bitcoin legal tender in Argentina, as it is in El Salvador. Instead, he has called for dollarizing the Argentine economy, as a way of dealing with the country’s rampant inflation​​​​​​ problem.\n\nWhile Milei’s views on Bitcoin and cryptocurrencies reflect a strong preference for private sector-controlled money, and a skepticism towards central banking, it’s unclear what a Milei administration will mean in practice when it comes to integrating crypto into national economic policies.\n\nUpdated November 20, 2023 at 8:35 am ET, clarifying Milei’s anti-central bank political ad was from 2021.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzIwL2JpdGNvaW4tc3VycGFzc2VzLTM3ay1vbi1hcmdlbnRpbmEtcHJlc2lkZW50aWFsLWVsZWN0aW9uLXJlc3VsdC1hcy1hbmFseXN0cy1mb2N1cy1vbi1mZWQtbm90ZXMv0gGPAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjAvYml0Y29pbi1zdXJwYXNzZXMtMzdrLW9uLWFyZ2VudGluYS1wcmVzaWRlbnRpYWwtZWxlY3Rpb24tcmVzdWx0LWFzLWFuYWx5c3RzLWZvY3VzLW9uLWZlZC1ub3Rlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Surpasses $37K on Argentina Presidential Election Result as Analysts Focus on Fed Notes - CoinDesk",
        "content": "\"The Fed typically starts a cycle of rate cuts only after a significant market correction starts, on the back of damaged risk appetite,\" Kuptsikevich wrote in a note on Monday. \"A cut in the first half of 2024 can only be triggered by severe turbulence in debt and equity market.\""
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vYml0Y29pbi1yZWdhaW5zLXVzZDM3LTAwMC1hcy1hcmdlbnRpbmEtZWxlY3RzLXByby1iaXRjb2luLXByZXNpZGVudC04NDA0Nzk10gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Regains $37,000 As Argentina Elects Pro-Bitcoin President - Investopedia",
        "content": "Key Takeaways Economist Javier Milei will become the new president of Argentina after defeating Sergio Massa.\n\nMilei has made positive statements regarding bitcoin in the past, and he has also called for the abolishment of the Central Bank of Argentina.\n\nMilei has not outlined any specific policies regarding Bitcoin, but the dollarization of Argentina was a core tenet of his presidential campaign.\n\nBitcoin has become increasingly relevant in political campaigns around the world in recent years.\n\nOn Sunday, the Libertarian Party's Javier Milei was elected as the new president of Argentina. Milei has spoken positively about bitcoin in the past, and the price of the crypto asset rose to roughly $37,500 as Milei's opponent in the runoff election conceded defeat.\n\nMilei Has Embraced Bitcoin But Has No Policy Outlined\n\nLibertarian Javier Milei defeated fellow contender Sergio Massa in the runoff election for the president of Argentina on Sunday, with Milei receiving nearly 56% of the final vote tally.\n\nThe election result was viewed positively by bitcoin proponents around the world, as Milei has spoken supportively about the crypto asset in the past. Earlier this year, Milei referred to bitcoin as a representation of the \"return of money to its original creator, the private sector.\"\n\nMilei has already drawn comparisons to the heavily pro-bitcoin president of El Salvador, Nayib Bukele, who declared bitcoin legal tender in his country. However, the new president-elect of Argentina has not yet outlined a specific bitcoin policy for the country.\n\nThat said, Milei has promised to close the Central Bank of Argentina and embrace the dollarization of the Argentine economy. Argentina has a long history of difficulties with inflation, and the country has recently been struggling with an inflation rate of more than 100%.\n\n\"Ultimately, Grayscale Research views this as a meaningful step forward for crypto adoption, as bitcoin moves closer toward fulfilling its role as a super-sovereign means of exchange to accelerate a more accessible and inclusive financial system,\" wrote crypto asset manager Grayscale's Matt Maximo regarding the potential impact of Milei's victory.\n\nBitcoin Gathering Political Currency\n\nMilei is yet another example of bitcoin becoming a larger talking point in the global political landscape.\n\nIn the United States, independent Robert F. Kennedy Jr. made his first official appearance as a presidential candidate at a bitcoin conference earlier this year. Additionally, the current mayors of both New York City and Miami have talked about turning their respective cities into crypto hubs.\n\nThat said, there are also opponents of crypto in the U.S., most notably Massachusetts Senator Elizabeth Warren, who has embraced the idea of building an \"anti-crypto army\" in Washington.\n\nIn the past, Venezuela, which has been dealing with much worse levels of inflation than Argentina, attempted to create its own crypto token. However, Venezuela's crypto project, known as the Petro, was largely centralized, working much differently from bitcoin and failed in achieving what it set out to do."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTEvMjAvYml0Y29pbi0zNzAwMC1lbGVjdGlvbi1iaXRjb2luLWZyaWVuZGx5LXByZXNpZGVudGlhbC1jYW5kaWRhdGUtYXJnZW50aW5hLWphdmllci1taWxlaS_SAYABaHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyMy8xMS8yMC9iaXRjb2luLTM3MDAwLWVsZWN0aW9uLWJpdGNvaW4tZnJpZW5kbHktcHJlc2lkZW50aWFsLWNhbmRpZGF0ZS1hcmdlbnRpbmEtamF2aWVyLW1pbGVpL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin breaks $37,000 following election of crypto-friendly presidential candidate in Argentina - Fortune",
        "content": "Bitcoin jumped nearly 3% after a pro-crypto candidate from the far right handily defeated Argentina’s current economic minister in the country’s presidential election.\n\nBitcoin broke through the $37,000 mark, and was still up 2% over the past 24 hours, after Javier Milei, a populist figure who labels himself an anarcho-capitalist and libertarian, was named the winner. Milei has found an audience in Argentina—and among the crypto faithful—in part for his radical economic proposals such as eliminating the country’s central bank.\n\nMilei is friendly to cryptocurrencies, especially the most popular token, Bitcoin. In an interview with the Argentine newspaper Clarín he raged against central banks and politicians, adding that Bitcoin was the natural reaction against “the scam that is central banks.”\n\n“What Bitcoin is representing is the return of money to its original creator, which is the private sector,” he said.\n\nThe 53-year-old economist may be friendly to Bitcoin but he doesn’t support making it legal tender as did El Salvador President Nayib Bukele in 2021. Milei has said he plans to dollarize Argentina’s economy in a bid to fight the more than 140% inflation that the South American country is facing.\n\nStill, some notable crypto figures have congratulated the president-elect, including MicroStrategy founder Michael Saylor and Arthur Hayes, the cofounder of crypto exchange BitMEX.\n\nWhile Milei’s libertarian views on the economy have proved popular among Argentinians, the politician’s radical stances on other issues have alienated others. Milei has actively opposed sex education and feminist causes, and he’s said that humans are not the cause of global climate change, contradicting a nearly unanimous scientific consensus."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTIwL3Nwb3QtYml0Y29pbi1idGMtZXRmLWFwcHJvdmFsLXNlZW4tZHJpdmluZy1tb25leS1tYW5hZ2Vycy10by1jcnlwdG_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Spot-Bitcoin (BTC) ETF Approval Seen Driving Money Managers to Crypto - Bloomberg",
        "content": "It’s touted as crypto’s big breakthrough on Wall Street: The imminent arrival of Bitcoin exchange-traded funds that will kick open digital-currency investing to the institutional and retail masses.\n\nThat’s driving the latest hype cycle in the world’s largest token on bets that the likes of wealth managers and financial advisers will finally start to lavish a small portion of their trillion-dollar portfolios on the crypto promise."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjAvYml0Y29pbi1mdW5kYW1lbnRhbHMtaGF2ZS1uZXZlci1sb29rZWQtYmV0dGVyLWJlcm5zdGVpbi_SAWhodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzIwL2JpdGNvaW4tZnVuZGFtZW50YWxzLWhhdmUtbmV2ZXItbG9va2VkLWJldHRlci1iZXJuc3RlaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Fundamentals Have Never Looked Better: Bernstein - CoinDesk",
        "content": "Another tailwind is the approval of a U.S.-listed spot bitcoin exchange-traded-fund (ETF), which will make it easier for companies and retail to gain access to the cryptocurrency. “U.S. bitcoin ETF is on track for an early 2024 approval, as the Securities and Exchange Commission (SEC) continues to engage on the applications from leading asset managers,” the authors wrote."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTIwL2NhdGhpZS13b29kLXMtYXJrLTIxc2hhcmVzLXVudmVpbC0wLTgtZmVlLW9uLXBlbmRpbmctc3BvdC1iaXRjb2luLWV0ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Wood's Ark, 21Shares Unveil Fee on Pending Spot Bitcoin ETF - Bloomberg",
        "content": "Cathie Wood ’s ARK Investment Management and digital-asset firm 21Shares just became the first major applicant in the US spot Bitcoin ETF race to list a fee on their planned offering.\n\nThe Ark 21Shares Bitcoin ETF would carry a management fee of 80 basis points, according to an updated filing Bloomberg Terminal Monday. That means if someone invests $100, they would be charged 80 cents. The application for the ETF, which will trade under the ticker ARKB, had previously listed 70 basis points in a placeholder capacity."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTEvMjEvYmluYW5jZS1ibmItdG9rZW4tZHJvcHMtOC1wZXJjZW50LW9uLWNyaW1pbmFsLWNoYXJnZXMtYml0Y29pbi1hbmQtYnJvYWRlci1tYXJrZXQtcmV0cmVhdC_SAYMBaHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyMy8xMS8yMS9iaW5hbmNlLWJuYi10b2tlbi1kcm9wcy04LXBlcmNlbnQtb24tY3JpbWluYWwtY2hhcmdlcy1iaXRjb2luLWFuZC1icm9hZGVyLW1hcmtldC1yZXRyZWF0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Binance BNB token drops on criminal charges, Bitcoin and broader crypto market dip slightly - Fortune",
        "content": "The native token of crypto exchange Binance, known as BNB, plummeted Tuesday on news the Justice Department is filing criminal charges against the company and its CEO, Changpeng “CZ” Zhao.\n\nBinance’s cryptocurrency, BNB, fell as much as 9% on the initial news, before narrowing the drop to around 5% by midafternoon. The initial report came from the Wall Street Journal, which said Zhao would soon step down as CEO of the exchange and plead guilty to violating U.S. anti-money-laundering laws. Court documents have since confirmed this.\n\nBinance will also plead guilty to a criminal charge and pay $4.3 billion in fines, which will allow it to settle civil charges brought against it by regulators. Zhao himself will pay $50 million.\n\nAs BNB fell, so did the broader crypto market, with the global cryptocurrency market cap dropping 3.5% over the past day to $1.43 trillion, according to CoinGecko. Bitcoin, the most popular cryptocurrency, fell just under 2% following news of the charges against Zhao and Binance.\n\nBinance initially sold millions of BNB in 2019, and currently allows customers to use the tokens for a discount on trading. The company and Zhao still hold billions of dollars worth of the coin.\n\nThe Justice Department is scheduled to hold a press conference at 3 p.m. Eastern Time on the criminal charges. The lawsuit follows previous lawsuits by the Securities and Exchange Commission and the Commodity Futures Trading Commission."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tb3JkaW5hbHMtZXRoZXJldW0tZmxpcHBlbmluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Ethereum won't flip Bitcoin anytime soon, but Ordinals could change that - Blockworks",
        "content": "Bitcoin block space looks set to be the hottest commodity in crypto.\n\nBitcoin once again occupies more than half the entire crypto market, having outperformed ether by nearly double so far in 2023. Now, the long-prophesied “flippening” of ether over bitcoin is even further in the future.\n\nThe market currently values Bitcoin three times higher than Ethereum. Bitcoin’s market cap, at $727 billion, has swelled by $400 billion in 2023 — a figure bigger than Mastercard’s entire stock valuation and about twice that of Netflix’s.\n\nEthereum’s valuation has grown by $100 billion, jumping from under $145 billion in January to nearly $245 billion today.\n\nSome anticipate that Ethereum’s market cap will one day eclipse Bitcoin’s, despite the latter’s half-decade head start.\n\nThings were looking good coming out of the 2019 bear market and into 2021’s explosive bull cycle. DeFi summer and NFT mania boosted interest in Ethereum, at times driving up fees for certain actions beyond $250.\n\nBitcoin‘s market value was 925% of Ethereum’s — $130 billion to $14 billion — at the end of 2019 (bottom of the bear market).\n\nThat figure had shrunk to under 200% by the end of 2021 (peak bull market).\n\nBitcoin’s market value is now 300% of Ethereum’s.\n\nThe Bitcoin rally has widened the gap\n\nThe case for flippening has recently taken a hit by a different flip: The Bitcoin network now rakes in more fees than Ethereum for the first time since December 2020.\n\nOver the past four days, Bitcoin users have paid miners about $40 million to have their transactions processed.\n\nEthereum users, meanwhile, forked out less than $27 million ether (most of those fees have been burned, slightly reducing Ethereum’s overall supply).\n\nLayer-2 Ethereum networks Arbitrum and Optimism haven’t bridged that gap as they each generate less than $200,000 in fees per day right now.\n\nThe fee-flippening (flee-pening?) is awkward when you consider the sheer amount of use cases supported by Ethereum. Decentralized exchanges, DAOs, memecoins, NFTs, stablecoins, DeFi and GameFi all run atop Ethereum.\n\nRead more: Ethereum’s Justin Drake is unconcerned despite ether’s middling year pricewise: Q&A\n\nBitcoin, on the other hand, had for the longest time mostly had one application — bitcoin transactions. But the rate of on-chain transactions had until recently sustained very little growth since 2015. Perhaps due to its “digital gold” narrative and the rising ubiquity of alternative cryptocurrencies.\n\nOver the past five years, Ethereum users have paid $17 billion in fees, Bitcoin users just $2.9 billion\n\nAll that changed with Ordinals — a protocol for inscribing individual units of bitcoin (BTC) with unique data to create digital collectibles, first launched in January.\n\nMusic, text, art, video and even code for browser-based DOOM clones have since been inscribed to Bitcoin, resulting in an on-chain collectibles market worth thousands of BTC. Bitcoin users trade Ordinals as Ethereum or Solana users would trade NFTs.\n\nToday, anywhere from around a third to one half of Bitcoin transactions contain Ordinals, driving up demand for blockspace as well as transaction fees. At times today, “medium priority” transactions went for around $11 compared to around $2.30 for the same on Ethereum (more priority generally means faster processing), although those prices have since come down.\n\nTron comes in third overall for monthly fees, mostly thanks to stablecoin Tether\n\nSo is Bitcoin netting more fees than Ethereum good for Bitcoin? Maybe not.\n\nSome Bitcoin insiders worry the network isn’t properly equipped to handle Ordinals and potential influxes of interest in its original use case, BTC payments.\n\nThe CryptoKitties incident in December 2017 — during which a NFT game grew so popular that it spectacularly clogged Ethereum — first showed that Ethereum probably couldn’t handle serving as the “World Computer” just yet.\n\nThen, the 2021 bull market saw NFT mint costs soar to $250 at times — a reminder of how necessary it was to port activity to smaller chains, including rollups. Still, memecoins and low quality token projects ratcheted up fees beyond $20 earlier this year, drastically reducing Ethereum’s usefulness for non-critical tasks.\n\nThe NFT craze of 2021 made Ethereum block space the hottest commodity in crypto. Even while tanking its utility.\n\nOrdinals may end up having the same effect on Bitcoin, especially if demand keeps up and the bull market truly hits.\n\nAt that point, it would seem reasonable to value Bitcoin and Ethereum more similarly. It might just take another run.\n\nUpdated Nov. 16, 2023 at 4:25 pm ET: Corrected reference to percentages in bullet points.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzIwL3NhbnRhbmRlci1wcml2YXRlLWJhbmstaW50cm9kdWNlcy1iaXRjb2luLWV0aGVyZXVtLXRyYWRpbmctZm9yLXN3aXNzLWNsaWVudHMv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMTEvMjAvc2FudGFuZGVyLXByaXZhdGUtYmFuay1pbnRyb2R1Y2VzLWJpdGNvaW4tZXRoZXJldW0tdHJhZGluZy1mb3Itc3dpc3MtY2xpZW50cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Santander Private Bank Introduces Bitcoin, Ethereum Trading for Clients in Switzerland - CoinDesk",
        "content": "“The Swiss regulation related to digital assets is one of the first and most advanced in the world, since it provides clarity and a comprehensive regulatory environment for our clients,” said John Whelan, head of crypto and digital assets at Santander, in an email. “As holding of crypto as an alternative asset class continues to expand, we expect that our clients prefer to rely on their existing financial institutions to be responsible for their assets.”"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8yMS9idXktdGhlLXJ1bW9yLWJ1eS10aGUtbmV3cy1vbi1zcG90LWJ0Yy1ldGYtc2F5cy1vbmUtZXhwZXJ0LXdoaWxlLWFub3RoZXItd2FybnMtb24tY29pbmJhc2Uv0gGMAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzIxL2J1eS10aGUtcnVtb3ItYnV5LXRoZS1uZXdzLW9uLXNwb3QtYnRjLWV0Zi1zYXlzLW9uZS1leHBlcnQtd2hpbGUtYW5vdGhlci13YXJucy1vbi1jb2luYmFzZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "'Buy the Rumor, Buy the News,' on Spot BTC ETF, Says One Expert, While Another Warns on Coinbase - CoinDesk",
        "content": "'Buy the Rumor, Buy the News,' on Spot BTC ETF, Says One Expert, While Another Warns on Coinbase\n\nPantera Capital’s Dan Morehead believes a spot bitcoin ETF will ‘fundamentally change access’ to bitcoin, while analysts at JPMorgan say it could be a threat to Coinbase in the medium term.\n\nBy Helene Braun Nov 21, 2023 at 5:56 p.m. UTC"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjAvYml0Y29pbi1vcHRpb25zLW9wZW4taW50ZXJlc3QtY2xpbWJzLXRvLXJlY29yZC0xNWItb24tY3J5cHRvLWV4Y2hhbmdlLWRlcmliaXQv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8yMC9iaXRjb2luLW9wdGlvbnMtb3Blbi1pbnRlcmVzdC1jbGltYnMtdG8tcmVjb3JkLTE1Yi1vbi1jcnlwdG8tZXhjaGFuZ2UtZGVyaWJpdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Options Open Interest Climbs to Record $15B on Crypto Exchange Deribit - CoinDesk",
        "content": "One trader sold a straddle, which is an options strategy aimed at profiting from a decline in price volatility, for a premium of $2.8 million. Such volatility selling strategies were quite popular in BTC and ETH during the summer, when both cryptocurrencies were listless."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzIyL292ZXItMjAwbS1pbi1jcnlwdG8tZnV0dXJlcy1iZXRzLWxpcXVpZGF0ZWQtYXMtYml0Y29pbi1zbHVtcGVkLXVuZGVyLTM2ay1vbi1iaW5hbmNlLXNldHRsZW1lbnQv0gGPAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjIvb3Zlci0yMDBtLWluLWNyeXB0by1mdXR1cmVzLWJldHMtbGlxdWlkYXRlZC1hcy1iaXRjb2luLXNsdW1wZWQtdW5kZXItMzZrLW9uLWJpbmFuY2Utc2V0dGxlbWVudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Over $200M in Crypto Futures Bets Liquidated as Bitcoin Slumped Under $36K on Binance Settlement - CoinDesk",
        "content": "Data from CoinGlass show, exchanges have liquidated crypto perpetual futures positions worth $227 million in the past 24 hours. Bullish longs accounted for nearly 80% of the tally. Meanwhile, over $67 million worth of bitcoin longs and shorts, referring to bets on and against price rises, respectively, have been liquidated in the past 24 hours. This was among the highest liquidation events in 2023."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjEvYml0Y29pbi1idWZmZXRlZC10aGFuLWJvdW5jZXMtb24tYmluYW5jZXVzLXNldHRsZW1lbnQtcmVwb3J0L9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjEvYml0Y29pbi1idWZmZXRlZC10aGFuLWJvdW5jZXMtb24tYmluYW5jZXVzLXNldHRsZW1lbnQtcmVwb3J0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Buffeted Then Bounces on Binance/U.S. Settlement Report - CoinDesk",
        "content": "Nevertheless, crypto markets for the time being will continue to have to deal with a hostile regulatory environment in the U.S. The Securities and Exchange Commission (SEC) late last week delayed any decisions on three more spot bitcoin ETF applications, likely making any resolution on these vehicles a 2024 event. Last night, the agency launched a lawsuit against crypto exchange Kraken for operating an unregistered platform."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjIvY3J5cHRvLXRyYWRlcnMtbG9hZC11cC1vbi1iaXRjb2luLXRvcHNpZGUtb3B0aW9uLXBsYXlzLWFmdGVyLWJpbmFuY2VzLWd1bGl0eS1wbGVhL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzIyL2NyeXB0by10cmFkZXJzLWxvYWQtdXAtb24tYml0Y29pbi10b3BzaWRlLW9wdGlvbi1wbGF5cy1hZnRlci1iaW5hbmNlcy1ndWxpdHktcGxlYS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Crypto Traders Load Up on Bitcoin Topside Option Plays After Binance's Guilty Plea - CoinDesk",
        "content": "The sentiment is that U.S. regulators have cleaned up the industry, setting the stage for approving the first U.S.-based exchange-traded fund that invests in cryptocurrency. The so-called spot-based ETF is expected to bring billions in investor money to the crypto market."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmludmVzdG1lbnRuZXdzLmNvbS9wcmFjdGljZS1tYW5hZ2VtZW50L29waW5pb24vZWRpdG9yaWFsL3RoZS1jdXJpb3VzLWNhc2Utb2YtZnR4LWFuZC1iaXRjb2lucy1zdXJnZS0yNDU4ODXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "The curious case of FTX and bitcoin's surge - InvestmentNews",
        "content": "Sam Bankman-Fried, the founder of fraud-ridden cryptocurrency exchange FTX, presented himself as an altruistic, unkempt genius who found himself unwittingly out of his depth. The jury, however, decided that he was a fraudster who knowingly stole $8 billion of customers’ money. Another example that all that glitters in crypto land is not gold? A blockchain lover’s Barbieland detached from the real world?\n\nWhatever your stance, crypto now has its own Jordan Belfort, and Bankman-Fried faces years behind bars. Ironically, as the 31-year-old awaits sentencing, bitcoin is on a tear. Its price has doubled, surging back above $37,000, while trading volume went gangbusters. But away from the courtroom drama, the reasons for this tidal shift are more prosaic, with the U.S. rumored to be on the cusp of having spot-price bitcoin ETFs approved by the Securities and Exchange Commission.\n\nThis is arguably the biggest thing to happen to bitcoin since the mythical Satoshi Nakamoto invented it in 2008. Many clients will, therefore, see the legitimization provided by the new ETFs as a reason to ask their advisors why they aren’t benefiting from the price increase.\n\nOn the surface, there are compelling arguments for the nascent asset class — its increasing lack of correlation to major markets establishes it as an alternative to gold, and the pending regulatory approval indicates that the data and structure are sound. But as InvestmentNews’ Emile Hallez reports in this issue, most advisors don’t have exposure. In short, they don’t trust bitcoin or, whisper it, don’t understand it. Given the cryptocurrency’s short history and wild price swings, few advisors are willing to recommend an investment for which they can’t predict or measure risk.\n\nAdvisors are, of course, paid to steer clients away from unsuitable investments, and bitcoin’s volatility remains a huge turnoff for long-term financial planning. But doing so without a deep understanding of what you’re rejecting won’t be enough for bullish clients. Further education to get ahead of what could be another crypto wave looks like a smart play.\n\nThe new ETFs, at the very least, will make a small allocation of “play money” in portfolios more palatable. Perversely, the fall of FTX may embolden some investors who view its collapse as some sort of nadir for crypto. “That can’t happen again, right?”\n\nBut for advisors, the SEC approval will be what matters and there is little doubt that bitcoin is inching toward more widespread legitimacy. Advisors, even deeply cynical ones, should be prepared for clients’ crypto questions."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY3J5cHRvLm5ld3Mvd2lsbC1iaXRjb2luLXByaWNlLW1ha2UtYS1uZXctYWxsLXRpbWUtaGlnaC1pbi0yMDIzLXByZWRpY3Rpb24tYW5kLWFuYWx5c2lzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Will Bitcoin price make a new all-time high in 2023? Prediction and analysis - crypto.news",
        "content": "Bitcoin’s price action shows consolidation and significant volatility, focusing on the $38,000 resistance level and market sentiment indicators. How high can Bitcoin go?\n\nBitcoin (BTC) has shown resilience and bounced back above $37k levels after declining to $35k levels on Nov. 15.\n\nBTC has maintained its bullish outlook despite a period of sliding prices influenced by the absence of significant developments in the spot Bitcoin exchange-traded fund (ETF) and other macroeconomic factors.\n\nMoreover, over the past few weeks, Bitcoin’s journey has been marked by a pattern of higher lows and higher highs, a characteristic of a bull phase in the crypto market.\n\nGreg Moritz of AltTab Capital remarks on the natural occurrence of pullbacks even in bullish markets, suggesting that the current scenario is a typical fluctuation within an overall positive trend​​.\n\nFurther bolstering Bitcoin’s position is the macroeconomic landscape, which presents interesting dynamics for cryptocurrencies.\n\nThe Federal Reserve’s policy adjustments in response to economic indicators and endorsements by financial institutions like BlackRock have contributed to a resurgence in crypto, reflecting a cautiously optimistic market sentiment​​.\n\nGiven Bitcoin’s current state within a rapidly evolving financial ecosystem, let’s see what factors are affecting BTC price and what’s the Bitcoin price prediction for the coming days.\n\nUpdated status and market expectations for spot BTC ETF\n\nThe SEC’s cautious stance on the approval of spot Bitcoin ETFs remains evident, as seen by the fact that, to date, no applications for these ETFs, including a notable submission from Global X, have been approved.\n\nThis consistent hesitance from the regulatory body has effectively narrowed the window for approving multiple ETFs, pushing the potential for a first spot Bitcoin ETF approval into 2024.\n\nAttention is now turning towards the Jan. 10, 2024, deadline for the ARK 21Shares application, which stands as a significant date for investors and analysts monitoring the situation.\n\nThe SEC’s ongoing reluctance to approve spot BTC ETFs, even amidst growing interest in integrating cryptocurrencies into the mainstream financial sector, underscores the enduring regulatory hurdles within the crypto market.\n\nBitcoin price action and technical analysis\n\nAs of Nov. 21, Bitcoin’s price action has been fluctuating around the $37,000 mark, displaying the challenges it faces in reclaiming higher ground as a stable support level​​.\n\nThe 50-day exponential moving average (EMA) is well below Bitcoin’s current price at about $36,900, indicating a bullish state in the market. Bitcoin’s price movement is currently confined within a sideways channel, fluctuating between $36k and $38k level.\n\nFurthermore, Bitcoin bulls and bears are engaged in a tug of war near the $36,400 support/resistance level, which has become a critical midpoint of the trading range for BTC. This pattern emerged after Bitcoin first spiked to $38,000 on Nov. 9, indicating a consolidation phase in its price movement​​.\n\nThe market also witnessed significant volatility, with a noticeable drop to the $34,750 level, signaling a cooling trend. However, a strong rally was observed on Nov. 16, with Bitcoin surging to a high of $38,000, mirroring its peak. This repeated peak forms a double top, suggesting $38,000 as a strong resistance level​​.\n\nMeanwhile, the crypto fear and greed index is currently at 74 out of 100 points, indicating an elevated level of optimism within the cryptocurrency sector. The index experienced a drop from a weekly high of 77 achieved on Nov. 16, which denoted even more greed.\n\nThe fear and greed index is a crucial indicator of market sentiment, often used to gauge the emotional state of the crypto markets​​​​.\n\nBitcoin (BTC) price prediction\n\nDigitalCoinPrice anticipates an optimistic Bitcoin price forecast for the coming years. Their BTC forecast for 2023 suggests a significant rise in Bitcoin’s value, estimating it to reach around $74,086.\n\nLooking ahead to 2024, the BTC price prediction by DigitalCoinPrice becomes even more promising, with an expectation of Bitcoin’s price climbing to approximately $90,228.\n\nOn the other hand, CoinCodex offers a near-term Bitcoin price prediction that is a bit more conservative.\n\nAs per their forecast, by Nov. 29, Bitcoin is anticipated to be valued at about $54,343. This BTC price prediction, while lower than DigitalCoinPrice’s, still reflects a positive outlook for Bitcoin in the short term.\n\nIt’s crucial to approach these Bitcoin price predictions with caution, keeping in mind the volatile nature of the cryptocurrency market.\n\nRemember, investing in cryptocurrencies like Bitcoin should always be done judiciously, never exceeding what one can afford to lose.\n\nRead more: Why Bitcoin price predictions often miss the mark\n\nDisclosure: This article does not represent investment advice. The content and materials featured on this page are for educational purposes only.\n\nFollow Us on Google News"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1hbmQtYXVzdHJpYW4tZWNvbm9taWNzJTNBLWluc2lnaHRzLWZyb20tdHV1ci1kZW1lZXN0ZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin And Austrian Economics: Insights From Tuur Demeester - Nasdaq",
        "content": "Bitcoin and Austrian Economics have been subjects of much interest and discussion in recent years. In this article, we will explore the basics of Bitcoin, delve into the principles of Austrian Economics, and examine the unique insights provided by Tuur Demeester, a renowned expert in both fields.\n\nThe Role of Bitcoin in Today's Economy\n\nMoreover, Bitcoin has become a store of value for many individuals who see it as a hedge against fiat currency devaluation. Its decentralized nature and limited supply have led some to view it as digital gold, a safe haven asset in times of economic uncertainty. This perception has been further reinforced by institutional investors and corporations, such as MicroStrategy and Tesla, allocating a portion of their treasury reserves to Bitcoin.\n\nIt is important to note that Bitcoin's impact extends beyond its monetary value. The underlying principles of decentralization, transparency, and censorship resistance have inspired a broader movement for financial sovereignty and individual empowerment. Bitcoin has become a symbol of resistance against centralized authorities and a catalyst for reimagining the future of money.\n\nThe Principles of Austrian Economics\n\nLet us turn our attention to the principles of Austrian Economics. Austrian Economics is a school of economic thought that emphasizes individual freedom, free markets, and limited government intervention. Its origins can be traced back to the works of economists such as Carl Menger, Friedrich Hayek, Murray Rothbard, and Ludwig von Mises.\n\nThe Origin and Evolution of Austrian Economics\n\nAustrian Economics emerged as a reaction to the prevailing economic theories of the time, which focused on mathematical models and central planning. Its proponents argued that economics should be grounded in the study of individuals' actions and choices, rather than abstract aggregates. Over the years, Austrian Economics has evolved and gained prominence, attracting a dedicated following of scholars and practitioners.\n\nKey Tenets of Austrian Economics\n\nAustrian Economics is characterized by several key principles. Firstly, it emphasizes the subjective nature of value, arguing that value is determined by individuals' preferences and choices. Secondly, it highlights the importance of entrepreneurship and market competition in driving economic growth and innovation.\n\nFurthermore, Austrian Economics emphasizes the role of the price mechanism in coordinating economic activity. Prices, according to Austrian economists, communicate crucial information about scarcity and consumer preferences. Finally, Austrian Economics advocates for sound money and opposes inflationary monetary policies.\n\nTuur Demeester: A Brief Introduction\n\nDemeester's Background and Influence\n\nTuur Demeester is an economist and investor who has extensively studied Bitcoin and Austrian Economics. He is the founder of Adamant Capital, an investment firm specializing in Bitcoin research. Demeester's research and analysis have contributed significantly to the understanding of Bitcoin's economic implications and its relation to Austrian Economics.\n\nDemeester's Views on Bitcoin and Austrian Economics\n\nDemeester has highlighted the compatibility between Bitcoin and Austrian Economics. He argues that Bitcoin's decentralized and permissionless nature aligns with the principles of Austrian Economics, which emphasize individual freedom and free markets. Demeester sees Bitcoin as a potential disruptor to traditional financial systems and believes it can empower individuals by providing them with financial sovereignty.\n\nThe Intersection of Bitcoin and Austrian Economics\n\nDemeester's Perspective on Bitcoin as a Free Market\n\nDemeester sees Bitcoin as a manifestation of the free market principles advocated by Austrian Economics. The absence of a centralized authority controlling Bitcoin's issuance and transaction validation aligns with the Austrian belief in spontaneous order and voluntary exchanges. Bitcoin's open-source nature allows anyone to participate and contribute, making it a truly decentralized ecosystem.\n\nThe Role of Bitcoin in Austrian Economic Theory\n\nBitcoin's emergence has sparked debates within the Austrian Economics community. Some argue that Bitcoin represents a digital form of Austrian economics in practice, as it operates outside the control of central banks and governments. Others contend that Bitcoin's lack of intrinsic value and its volatility make it an unsuitable representation of Austrian economic principles.\n\nCriticisms and Counter Arguments\n\nAs with any subject of interest, Bitcoin and Austrian Economics have not been immune to criticisms. Let us examine some common criticisms and explore Demeester's responses.\n\nCommon Criticisms of Bitcoin in Austrian Economics\n\nOne common criticism argues that Bitcoin's price volatility renders it unreliable as a medium of exchange. Critics claim that the constant fluctuation in value undermines its suitability as a store of value and a unit of account. Additionally, concerns have been raised about the environmental impact of Bitcoin mining and its potential energy consumption.\n\nDemeester's Responses to Criticisms\n\nDemeester acknowledges the valid concerns raised regarding Bitcoin's volatility and energy consumption. However, he argues that as Bitcoin matures, its volatility is likely to decrease, making it more suitable for everyday transactions. Furthermore, Demeester highlights the growing adoption of renewable energy sources in Bitcoin mining, mitigating the environmental impact.\n\nIn conclusion, the insights provided by Tuur Demeester shed light on the fascinating intersection of Bitcoin and Austrian Economics. Bitcoin's unique attributes align with the principles of Austrian Economics, opening the door to discussions about the future of money and the role of decentralized systems in our economic landscape.\n\nWeekly Recap (11/13/2023 - 11/17/2023)\n\nGermany’s fourth largest bank Commerzbank granted Bitcoin and Crypto Custody license\n\nU.S. Presidential Candidate Vivek Ramaswamy: ‘The Government is threatened by Bitcoin’. During an interview on Natalie Brunell’s CoinStories podcast Ramaswamy asserted that the government perceives Bitcoin as a potential threat to its control over monetary policy.\n\nBtcoin’s price rose 120% since El Salvador became the first nation to buy 1 bitcoin a day. One year ago today (11/16/2023), El Salvador announced an ambitious plan to begin adding 1 Bitcoin per day to its national treasury.\n\nGrayscale CEO says ‘They’re ready for the main event’, awaiting Spot Bitcoin ETF approval. Bitcoin is up 122% year-to-date on the speculation of the first spot ETF approval in the United States.\n\nHong Kong based Boyaa plans to buy $45 Million worth of Bitcoin as a treasury reserve asset.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjAvYml0Y29pbi1hbmQtYm5iLXRva2VuLXN0YWdlLXJlbGllZi1yYWxsaWVzLW9uLWJpbmFuY2Utc2V0dGxlbWVudC1uZXdzL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjAvYml0Y29pbi1hbmQtYm5iLXRva2VuLXN0YWdlLXJlbGllZi1yYWxsaWVzLW9uLWJpbmFuY2Utc2V0dGxlbWVudC1uZXdzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin and BNB Token Stage Relief Rallies on Binance Settlement News - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLXJlYXNvbnMtYml0Y29pbnMtbW9tZW50dW0tanVzdC0xNjU1MDAyNjEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "3 Reasons Bitcoin's Momentum is just Beginning - Yahoo Finance",
        "content": "Whether it be a game of pool, a “2-minute drill” for a football team, or the stock market, momentum can play an integral role in technical and fundamental outcomes. On Wall Street, one can trace the heart of price trends to fundamental momentum. For stocks, this usually means increasing earnings expectations, leading to more investor interest. For other assets, it can mean scarcity and a better use case. Either way, all price trends are birthed when buying pressure outweighs selling pressure and momentum picks up. Bitcoin, which is up ~125% year-to-date and is the world’s most popular cryptocurrency, is one such asset class gaining momentum. Below are three reasons the Bitcoin momentum may just be beginning:\n\nInternational Adoption & Real-World Use is on the Rise\n\nLast night, hyperinflation-plagued Argentina shocked the world by electing a wild-haired, chainsaw-wielding Libertarian candidate named Javier Milei. After embracing socialism for years, an inflation rate of more than 100% a year pushed citizens of South America’s second-largest economy to move in a completely different direction and try something new politically. Years of money printing, currency devaluation, and corruption have collectively brought the country to a tipping point, disrupting the delicate balance between money supply and economic output. Investors cheered the news and sent domestic juggernauts like oil juggernaut YPF (YPF) higher by ~34% and the MSCI Argentina ETF (ARGT) higher by more than 10% in volume which tracked 9,800% above average in early trading.\n\nZacks Investment Research\n\n\n\nImage Source: TradingView\n\nAs is the case throughout history, crisis tends to lead to opportunity for investors. In the case of Argentina, the real opportunity may be in Bitcoin. Because Argentina is in such financial trouble, the economic picture remains muddled regardless of who’s in office. However, the election results are bullish for Bitcoin for two main reasons. First, Milei is the second pro-Bitcoin presidential candidate in Latin America to gain office (El Salvador’s Nayib Bukele was the first).\n\nStory continues\n\nBetween the two shocking election outcomes and a wave of US politicians embracing Bitcoin, the momentum is shifting politically on a grand scale. Second, and most importantly, Bitcoin is being used in the real world to stave off inflation. The evidence? Following the election news, Bitcoin hit new highs in three inflation-plagued countries, including Nigeria, Turkey, and, of course, Argentina. The evidence is clear: world citizens are gravitating toward Bitcoin because of its inflation-resistant protocol (there will only ever be 21 million coins, while countries around the world print money endlessly). Year-to-date, Bitcoin is up a robust 351% versus the Argentine Peso.\n\nZacks Investment Research\n\n\n\nImage Source: TradingView\n\nBitcoin Supply is Stagnant\n\nOver the weekend, Bitcoin analyst Will Clemente pointed out that “88% of Bitcoin supply hasn’t moved in at least three months.” In other words, many investors seem to be shifting to a long-term mindset. Because Bitcoin has a fixed supply, as the remaining supply wanes and investor demand increases, Bitcoin should rally further.\n\nZacks Investment Research\n\n\n\nImage Source: Glassnode, Will Clemente\n\nInstitutional Appetite\n\nLong-awaited approval of ETFs will likely mean a quantum leap for the Bitcoin asset class. With juggernauts such as Fidelity and BlackRock (BLK) applying for ETFs, demand will soar from both institutions and retail investors should the ETFs be approved (they likely will be). In the meantime, Bitcoin proxies such as the ProShares Bitcoin ETF (BITO), Coinbase (COIN), and MicroStrategy (MSTR) should benefit dramatically.\n\n\n\n\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nYPF Sociedad Anonima (YPF) : Free Stock Analysis Report\n\nMicroStrategy Incorporated (MSTR) : Free Stock Analysis Report\n\nGlobal X MSCI Argentina ETF (ARGT): ETF Research Reports\n\nCoinbase Global, Inc. (COIN) : Free Stock Analysis Report\n\nProShares Bitcoin Strategy ETF (BITO): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzIwL2x1eG9yLXN0YXJ0cy1uZXctYnVzaW5lc3MtdG8tbWFrZS1zaGlwcGluZy1vZi1iaXRjb2luLW1pbmluZy1yaWdzLWZhc3Rlci_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8yMC9sdXhvci1zdGFydHMtbmV3LWJ1c2luZXNzLXRvLW1ha2Utc2hpcHBpbmctb2YtYml0Y29pbi1taW5pbmctcmlncy1mYXN0ZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Luxor Starts New Business to Make Shipping of Bitcoin Mining Rigs Faster - CoinDesk",
        "content": "Luxor aims to set itself apart from the competition by emphasizing on its expertise of global shipping, using the U.S. as its home base. The firm said it has already completed shipping over $245 million worth of equipment to more than 30 countries."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjEvZmVkLW1pbnV0ZXMtcmVsZWFzZS1tYXktYmUtYS1ub24tZXZlbnQtZm9yLWJpdGNvaW4v0gFjaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8yMS9mZWQtbWludXRlcy1yZWxlYXNlLW1heS1iZS1hLW5vbi1ldmVudC1mb3ItYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Fed Minutes Release May Be a Non-Event for Bitcoin - CoinDesk",
        "content": "Release of the minutes \"is likely to be less market-moving than usual, given the post-meeting softness in data,\" analysts at ING said in a Nov. 17 note to clients. \"We have already heard from several Fed officials who have welcomed the direction of the numbers but commented that they want to see more of the same to be sure that inflation is on the path to 2%.\""
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby93aGVuLWNvdWxkLXRyYWRlcnMtc2VlLXRoZS1hcnJpdmFsLW9mLWEtc3BvdC1iaXRjb2luLWV0Zi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "When Could Traders See the Arrival of a Spot Bitcoin ETF? - CoinDesk",
        "content": "What do you make of these application delays? Are we going to see an approval of a spot Bitcoin ETF next year? Maybe I wouldn't, I would not put bet on uh on January of next year. And these delays I think are symptomatic of the general product that is being offered. So there, the SEC is delaying a whole host of them post the grey scale decision. We shouldn't be surprised that they're not going to go through until they're comfortable with all of them. Uh I mean, you know, before I deleted Twitter, of course, you had a lot of people on there that were saying things like, well, if it, if Blackrock and Fidelity are on it, then this is gonna happen because they have all this money and, and they know how to do things and they can tell the sec what to do because that's how the world works and you don't know anything, please. Um So tell me, I, I, is that actually a legitimate argument that all of us silly people who think that that regulators at the end of the day do have some amount of power over even the largest asset managers can say, look, we, we just don't want this out there and, and do you think that that's something they will do? It's, I think it's less that they just don't want it out there as much as we saw in the gray scale decision. What they want to continue to avoid. Right. They don't want to have any more losses. They suffered a huge loss on the arbitrary and capricious decision. They don't want to also suffer a loss in some of the other things that the court has suggested that they might lose on. And so one other thing that they are probably keeping in mind is how much these spot ETF S are going to probably change the investing market. We know, for example, that right now financial advisors aren't really advising people to diversify into Bitcoin. These are retail investors. Right. They're like maybe 12% but certainly that would go up to 77%. And I think that's what the SEC is taking a look at is that once they're comfortable with all, we'll probably see them say yes to all. But at the same time until they're comfortable with all, we're not going to see some sort of trickle effect of one after another. Slowly."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjEvYml0Y29pbi1mYWNlcy1oZWFkd2luZHMtYXMtZXRmLW9wdGltaXNtLXN0YWxscy1kb2dlLXNvbC1naXZlLWJhY2stZ2FpbnMv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8yMS9iaXRjb2luLWZhY2VzLWhlYWR3aW5kcy1hcy1ldGYtb3B0aW1pc20tc3RhbGxzLWRvZ2Utc29sLWdpdmUtYmFjay1nYWlucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Faces Headwinds as ETF Optimism Stalls; DOGE, SOL Give Back Gains - CoinDesk",
        "content": "Interest rate decisions have the tendency to move markets. Higher rates usually mean risk assetss such as stocks and cryptocurrencies take a hit as investors could take profits and invest in bonds."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW92ZXJ0YWtlcy1ldGhlcmV1bS10cmFuc2FjdGlvbi1mZWVzLTA1NDkyNjg4MS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Overtakes Ethereum in Transaction Fees on the Back of Renewed Ordinals Frenzy - Yahoo Finance",
        "content": "Bitcoin Overtakes Ethereum in Transaction Fees on the Back of Renewed Ordinals Frenzy\n\nBitcoin (BTC) has recently surpassed Ethereum (ETH) in terms of average daily transaction fees, signaling a notable shift in the fee landscape. On November 20, Bitcoin's average daily transaction fee reached $10.34, while Ethereum's average fee stood at $8.43.\n\nThe upswing in Bitcoin transaction fees is a result of heightened activity surrounding the Ordinals Protocol, which enables the creation of NFT-like assets and BRC-20 tokens on the Bitcoin network. After a period of relative dormancy in late September to October, Ordinals-based assets experienced a significant surge in late October, according to Dune Analytics.\n\nSince October 24, over 6 million Ordinal assets have been generated, leading to the redistribution of more than 800 BTC in fees (equivalent to $30 million) to the network. The momentum further escalated when ORDI, the second-largest BRC-20 token by market capitalization, was listed on Binance on November 7. This listing sparked increased buying activity of BRC-20 tokens, resulting in a price surge of slightly over 50% for the ORDI token.\n\nIn addition to the growing popularity of the Ordinals Protocol, the Taproot Wizards project, which is built on the Ordinals protocol, announced a seed funding round of $7.5 million on November 17.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaWctYmFuay1lbWJyYWNlcy1jcnlwdG8tc2FudGFuZGVyLTExNDg1NjUzOS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Big Bank Embraces Crypto: Santander To Offer Bitcoin and Ethereum Trading - Yahoo Finance",
        "content": "Big Bank Embraces Crypto: Santander To Offer Bitcoin and Ethereum Trading\n\nSantander Private Banking International has announced it will now offer its high-net-worth clients in Switzerland the ability to trade and invest in Bitcoin and Ethereum.\n\nThe Spain-based financial services giant, which caters to over 210,000 wealthy clients worldwide, revealed in an internal memo seen by CoinDesk that the new crypto trading and custody services are being provided upon request to clients with accounts in Switzerland through their relationship managers.\n\nSantander said the crypto assets will be kept in a regulated custody model, with the bank storing private keys in a secure environment. Over the next few months, additional digital currencies that meet Santander's screening criteria will be added.\n\n\"As holding of crypto as an alternative asset class continues to expand, we expect that our clients prefer to rely on their existing financial institutions to be responsible for their assets,\" said John Whelan Head of Crypto Assets at Santander.\n\nHe also noted Switzerland's crypto regulations are among the most advanced globally, providing clarity for clients.\n\nSantander, which has been in business for over 160 years and counts 166 million customers, has taken a proactive stance on crypto. While risks exist, the bank seems to recognize the growing importance of digital assets in banking."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmxleG9sb2d5LmNvbS9saWJyYXJ5L2RldGFpbC5hc3B4P2c9OWVhNzM1ZWUtODExMS00N2NlLWI3NDktNTQ2YTIwZmE3NmNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Halving: A Brief Guide - Lexology",
        "content": "Bitcoin mining involves people using computers or specialised mining hardware to participate in bitcoin’s blockchain network as a transaction processor and validator. Bitcoin uses a system known as proof-of-work (PoW) to validate transaction information.\n\nBitcoin sets itself apart from conventional currencies managed by central banks through its fixed supply mechanism. Specifically, there will only ever be 21 million bitcoins in existence, and at present, slightly fewer than 2 million are left to be mined. Roughly 90% of Bitcoin’s entire supply has already been mined, with an estimated 900 being mined per day. This limited availability is maintained through a process called \"halving”, strategically crafted to control inflation and progressively enhance its value.\n\nAs of today, network participants verifying transactions receive a reward of 6.25 bitcoins for successfully mining each block. However, the policy ingrained into its mining algorithm dictates a reduction of roughly half every four years, resulting in the reward falling to 3.125 in the next cycle.\n\nThe first bitcoin halving occurred in November 2012 and experts predict that the next halving will occur in April 2024.\n\nThe reward for mining each block:"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYzODQ1L2JpdGNvaW4tdHJhbnNhY3Rpb24tY29zdHMtc3VycGFzcy10aG9zZS1vbi1ldGhlcmV1bS1hbWlkLW9yZGluYWxzLXJlc3VyZ2VuY2XSAXRodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNjM4NDUvYml0Y29pbi10cmFuc2FjdGlvbi1jb3N0cy1zdXJwYXNzLXRob3NlLW9uLWV0aGVyZXVtLWFtaWQtb3JkaW5hbHMtcmVzdXJnZW5jZQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin transaction costs surpass those on Ethereum amid Ordinals resurgence - The Block",
        "content": "Bitcoin BTC -2.63% 's 7-day average transaction fee has surpassed that of Ethereum's, according to The Block's Data Dashboard.\n\nIn the last week alone, Bitcoin's average transaction fee increased 48.4% from $8.59 on Nov. 12 to $12.75 on Nov. 19. Conversely, Ethereum's average transaction fee was $7.55 on Nov. 19.\n\n\"While both chains have seen an uptick in activity recently (and in turn fees), the recent resurgence of Ordinals minting and trading seems to have pushed Bitcoin to have an average transaction fee higher than Ethereum's,\" The Block research analyst Rebecca Stevens said.\n\nThe 7-day moving average of the average transaction fee on Bitcoin has surpassed that on Ethereum since Nov. 9, Stevens noted, adding that the gap is now much wider than when they briefly flipped in early October.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nBitcoin Ordinals\n\nBitcoin Ordinals are a type of non-fungible token recorded on the Bitcoin network. Several advancements throughout the past decade have made the minting of non-fungible tokens, along with their metadata, cheaper and easier on the Bitcoin network.\n\nSeptember saw a peak in Ordinals trading, followed by a slump in October, The Block previously reported. Startups specializing in Bitcoin Ordinals have seen venture capital interest, such as Taproot Wizards's $7.5 million seed raise on Nov. 16."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vdGhlaGFja2VybmV3cy5jb20vMjAyMy8xMS9yYW5kc3Rvcm0tZXhwbG9pdC1iaXRjb2luLXdhbGxldHMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Randstorm Exploit: Bitcoin Wallets Created b/w 2011-2015 Vulnerable to Hacking - The Hacker News",
        "content": "Bitcoin wallets created between 2011 and 2015 are susceptible to a new kind of exploit called Randstorm that makes it possible to recover passwords and gain unauthorized access to a multitude of wallets spanning several blockchain platforms.\n\n\"Randstorm() is a term we coined to describe a collection of bugs, design decisions, and API changes that, when brought in contact with each other, combine to dramatically reduce the quality of random numbers produced by web browsers of a certain era (2011-2015),\" Unciphered disclosed in a report published last week.\n\nIt's estimated that approximately 1.4 million bitcoins are parked in wallets that were generated with potentially weak cryptographic keys. Customers can check whether their wallets are vulnerable at www.keybleed[.]com.\n\nThe cryptocurrency recovery company said it re-discovered the problem in January 2022 while it was working for an unnamed customer who had been locked out of its Blockchain.com wallet. The issue was first highlighted way back in 2018 by a security researcher who goes by the alias \"ketamine.\"\n\nThe crux of the vulnerability stems from the use of BitcoinJS, an open-source JavaScript package used for developing browser-based cryptocurrency wallet applications.\n\nEspecially, Randstorm is rooted in the package's reliance on the SecureRandom() function in the JSBN javascript library coupled with cryptographic weaknesses that existed at that time in the web browsers' implementation of the Math.random() function, which allowed for weak pseudorandom number generation. BitcoinJS maintainers discontinued the use of JSBN in March 2014.\n\nAs a result, the lack of enough entropy could be exploited to stage brute-force attacks and recover the wallet private keys generated with the BitcoinJS library (or its dependent projects). The easiest wallets to crack open were those that had been generated before March 2012.\n\nThe findings once again cast fresh light on the open-source dependencies powering software infrastructure and how vulnerabilities in such foundational libraries can have cascading supply chain risks, as previously laid bare in the case of Apache Log4j in late 2021.\n\n\"The flaw was already built into wallets created with the software, and it would stay there forever unless the funds were moved to a new wallet created with new software,\" Unciphered noted."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9hcmstaW52ZXN0LWRpc2Nsb3Nlcy0wLTgwLTAwMjcwMzk3MC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "ARK Invest Discloses 0.80% Fee for Spot Bitcoin ETF - Yahoo Finance",
        "content": "Famed growth investor Cathie Wood’s ARK Invest, along with European-based cryptocurrency investment firm 21Shares, updated its most recent spot bitcoin ETF filing, unveiling an 0.80% fee.\n\nOn Monday, the two firms filed a third amendment to their S-1 ETF filing, in which they laid out additional risk disclosures and added new information about the fund’s fee. The ETF would trade on the BZX Exchange by the Chicago Board Options Exchange under the ticker ARKB.\n\nA slew of firms have recently added updates to their spot bitcoin ETF filings, including WisdomTree Investments on Nov. 16, indicating that conversations with the Securities and Exchange Commission are moving along toward a potential approval.. ETF issuers are adding risk disclosures and tweaks to their proposals based on conversations with the agency, according to multiple people familiar with the matter.\n\nThe SEC must decide on ARK's application by Jan. 11, the earliest deadline for a spot bitcoin ETF. The agency delayed its decision in September.\n\nBitcoin ETF Fees\n\nARK is the first big player to unveil a fee. The 80-basis point charge is the first strong indication of how asset managers will price the novel products in an ETF industry known for competing on fees.\n\nThe largest bitcoin ETF product, the ProShares Bitcoin Strategy ETF (BITO), charges a 0.95% fee, while the Grayscale Bitcoin Trust (GBTC), which the firm is vying to convert into an ETF, charges 2%. Grayscale has said it is committed to lowering the fee if the trust is converted into an exchange-traded fund.\n\nFees could be a key part in the battle for market share that will likely ensue if multiple spot bitcoin ETF applications are approved at once.\n\n“It’s marketing game from there, although some people would call it a war,” Wood said in an interview with etf.com last week.\n\nYet not all experts agree that fees will be what distinguishes different ETFs. Some people familiar with the matter have noted that issues like liquidity and investors' familiarity with the issuer could be more important than cost.\n\nStory continues\n\nContact Lucy Brewster at lucy.brewster@etf.com.\n\n\n\n\n\nPermalink | © Copyright 2023 etf.com. All rights reserved"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMjIvYml0Y29pbi1hbmQtYm5iLXJlY292ZXJ5LWFzLWJpbmFuY2UtcGxlYS1zZWVuLWJvb3N0aW5nLXNwb3QtZXRmLW9kZHMv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8yMi9iaXRjb2luLWFuZC1ibmItcmVjb3ZlcnktYXMtYmluYW5jZS1wbGVhLXNlZW4tYm9vc3Rpbmctc3BvdC1ldGYtb2Rkcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin and BNB Recover as Binance Plea Seen Boosting Spot ETF Odds - CoinDesk",
        "content": "Still, the price volatility spurred by the action against Binance and CZ looks to have proved costly for leverage traders. Data from Coinglass shows that in the 12 hours since the settlement was announced, $110 million in bitcoin long positions were liquidated compared to $37.2 million in short positions. In the last hour, that number has reversed with $4.26 million in short positions being liquidated compared to $111,000 in longs."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jZWxzaXVzLW5ldHdvcmstZm9jdXMtYml0Y29pbi1taW5pbmctMDYwNjQxODUzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Celsius Network To Focus on Bitcoin Mining Following Post-Bankruptcy Restructuring - Yahoo Finance",
        "content": "Celsius Network To Focus on Bitcoin Mining Following Post-Bankruptcy Restructuring\n\nCrypto lending platform Celsius Network has made changes to its plans after emerging from bankruptcy, focusing solely on Bitcoin mining due to regulatory concerns expressed by U.S. authorities about its other proposed business activities.\n\nCelsius had initially intended to generate income through \"staking\" fees, which involved validating blockchain transactions and managing cryptocurrency loans, as part of its restructuring strategy. However, the company announced on Monday that it had adjusted its direction based on feedback received from the U.S. Securities and Exchange Commission (SEC).\n\nThe revised plan, approved by a U.S. bankruptcy court in Manhattan on November 9, allowed Celsius to return cryptocurrency to its customers and establish a new company owned by Celsius creditors. However, the SEC did not explicitly state during the bankruptcy proceedings whether the new company's business plans would violate U.S. regulations.\n\nThis strategic shift has led to further negotiations with Fahrenheit, a consortium of bidders chosen to oversee the reorganized company. Celsius plans to seek court approval for a modified bankruptcy plan in the near future.\n\nCelsius anticipates that the reduced scope of the new company will lead to reduced management fees and enable a larger amount of cryptocurrency to be directly returned to customers starting in January 2024.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9tYXJhdGhvbi1kaWdpdGFsLXNlZXMtc2hpZnQtYml0Y29pbi0wNTQ0MjU5ODMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Marathon Digital Sees Shift in Bitcoin Mining Industry Dynamics With Energy Producers, Renewable Energy - Yahoo Finance",
        "content": "Marathon Digital Sees Shift in Bitcoin Mining Industry Dynamics With Energy Producers, Renewable Energy\n\nAccording to Adam Swick, the chief growth officer at Marathon Digital, the Bitcoin mining industry has now entered a new phase characterized by a changing relationship between miners and energy producers.\n\nBitcoin miners can no longer rely solely on purchasing power at competitive rates. Instead, they actively seek opportunities where there is a mismatch between energy generation and demand. For instance, collaborations with hydro plants that generate surplus electricity have become common. This shift has led to a mutually beneficial relationship between energy producers and Bitcoin miners.\n\nIn addition, Bitcoin mining tools have advanced, with the introduction of hydro-cooling and immersion-cooling technologies replacing the traditional air-cooled rigs. These innovations offer advantages such as reduced noise, minimal maintenance requirements, and increased potential for overclocking, resulting in improved mining efficiency.\n\nAs the fourth Bitcoin halving event approaches in April, some miners express concerns over the potential impact on their revenues.\n\nIn response to these challenges, Marathon Digital is actively pursuing cost-effective electricity solutions, developing proprietary technology, and exploring alternative revenue streams. The company's objective is to achieve high fleet efficiency, and it has formed partnerships with Abu Dhabi and Paraguay to leverage their energy generation gaps.\n\nMarathon Digital's recent project in Utah serves as an example of environmentally friendly and economically viable mining practices. By harnessing methane flare gas emitted from landfills, the company actively combats air pollution while simultaneously generating energy for mining purposes.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjY0MTYyL3NlYy1qdXN0LW1ldC13aXRoLWdyYXlzY2FsZS1mb3Itc3BvdC1iaXRjb2luLWV0Zi1saXN0aW5nLW1lbW8tc2hvd3PSAWtodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yNjQxNjIvc2VjLWp1c3QtbWV0LXdpdGgtZ3JheXNjYWxlLWZvci1zcG90LWJpdGNvaW4tZXRmLWxpc3RpbmctbWVtby1zaG93cw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "SEC recently met with Grayscale, BlackRock over spot bitcoin ETF listings, memos show - The Block",
        "content": "Grayscale Investments recently met with the Securities and Exchange Commission as it continues to seek approval for its application to convert its Grayscale Bitcoin BTC -2.63% Trust into a spot bitcoin exchange-traded fund.\n\nIn a memo published by the Securities and Exchange Commission, the asset manager on Monday met with officials from the SEC’s division of trading and markets to discuss potential listing matters concerning the shares of the product.\n\n“The discussion concerned NYSE Arca, Inc.’s proposed rule change to list and trade shares of the Grayscale Bitcoin Trust (BTC) under NYSE Arca Rule 8.201-E,” the memo said.\n\nThe meeting comes after Grayscale last month filed a new registration statement with the SEC in its latest attempt to covert the trust product into a spot bitcoin ETF. A D.C. circuit court also issued a formal mandate last month to assert its August ruling, directing the regulator to re-review the firm's application.\n\nAn earlier filing showed that last week, Grayscale and the Bank of New York Mellon agreed to have BNY Mellon serve as the transfer agent for shares of the trust.\n\nGBTC intends to list the shares on NYSE Arca under the symbol GBTC, and issue the shares on an ongoing basis upon approval of its S-3 form and a separate 19b-4 filing from NYSE Arca, according to the S-3 filing submitted on Oct. 19.\n\nBlackRock meeting\n\nOther major asset managers, including BlackRock and Fidelity, are also seeking approval from the SEC for spot bitcoin ETFs. SEC Chair Gary Gensler said last month that the regulator is \"doing work\" on the filings.\n\nRELATED INDICES See crypto indices\n\nJames Seyffart, an ETF Analyst at Bloomberg Intelligence, said in a post on X that he had also \"heard rumblings of other potential spot bitcoin ETF issuers meeting with SEC in the last week or so.\"\n\nA separate memo dated Nov. 20 showed that the SEC also had a meeting with BlackRock and Nasdaq employees.\n\n\"The discussion concerned The NASDAQ Stock Market LLC’s proposed rule change to list and trade shares of the iShares Bitcoin Trust under NASDAQ Rule 5711(d),\" the memo stated.\n\nAn attached presentation detailed \"In-Kind\" and \"In-Cash\" redemption models.\n\n\"Based on this it looks like BlackRock prefers in-kind for their #bitcoin ETF (makes sense as its probably cleanest structure for them & end investors),\" Seyffart said.\n\n(Updates with details on BlackRock meeting.)"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy8zLXN0b2Nrcy1hZGQtcG9ydGZvbGlvLWJpdGNvaW5zLTEzMDYwMDE2OC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "3 Stocks to Add to Your Portfolio on Bitcoin's November Rally - Yahoo Finance",
        "content": "The November rally continues for cryptocurrencies on the back of a spate of positive news. Bitcoin, particularly, has been on a dream run over the past three weeks after remaining rangebound over the past two-and-a-half months.\n\nOn Nov 17, both Bitcoin (BTC) and Ethereum (ETH) were traded above $37,000 and $2,000, respectively. The rally has primarily been fueled by renewed optimism among investors following news that the Securities and Exchange Commission (SEC) is almost set to approve a Bitcoin exchange-traded fund (ETF).\n\nThe anticipated approval of a Bitcoin ETF is poised to boost demand by offering traditional investors a means to access Bitcoin and other cryptocurrencies through conventional stock markets.\n\nThe move is expected to attract new investments to the crypto market, which could further boost overall demand for cryptocurrencies.\n\nThe positive news sent other major cryptocurrencies like Cardano (ADA), Dogecoin (DOGE) and BNB (BNB) on a rally.\n\nIn fact, Bitcoin, Ethereum, Cardano and Dogecoin have rallied 124.8%, 69.1%, 59% and 15.1%, year to date, respectively,\n\nCryptocurrencies rallied in the first seven months of the year as they staged a solid rebound from last year’s lows. The rally stalled in August as investors failed to get a clear picture of the Federal Reserve’s next course of action with interest rate hikes.\n\nHigher interest rates typically exert a negative impact on growth-oriented sectors, including technology, consumer discretionary industries, and cryptocurrencies.\n\nHowever, investors’ mood has perked up once again as they expect the Fed to soon end its monetary tightening campaign as inflation has been declining sharply over the past few months.\n\nOur Picks\n\nNVIDIA Corporation NVDA is a major player in the semiconductor industry and has been one of the standout success stories of 2023. As a leading designer of graphic processing units (GPUs), the value of the NVDA stock tends to surge in a thriving crypto market. This is primarily due to the crucial role that GPUs play in data centers, artificial intelligence, and the mining or production of cryptocurrencies.\n\nStory continues\n\nNVIDIA’s expected earnings growth rate for the current year is 226.1%. The Zacks Consensus Estimate for current-year earnings has improved 2.1% over the last 60 days. NVIDIA currently sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nInteractive Brokers Group, Inc. IBKR is a global automated electronic broker. IBKR executes, processes and trades in cryptocurrencies. IBKR’s commodities futures trading desk also offers customers a chance to trade cryptocurrency futures.\n\nInteractive Brokers Group has an expected earnings growth rate of 41.7% for the current year. The Zacks Consensus Estimate for current-year earnings has improved 2.3% over the last 60 days. IBKR currently has a Zacks Rank #2 (Buy).\n\nCoinbase Global, Inc. COIN offers financial infrastructure and technology to support the global cryptocurrency economy. COIN provides a main financial account for consumers in the crypto space, a marketplace with liquidity for institutional crypto asset transactions, and technology and services for developers to build crypto-based applications and accept cryptocurrencies securely as payment.\n\nCoinbase Global’s expected earnings growth rate for the current year is 91.7%. The Zacks Consensus Estimate for current-year earnings has improved 45.6% over the last 60 days. Coinbase currently carries a Zacks Rank #2.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nInteractive Brokers Group, Inc. (IBKR) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nCoinbase Global, Inc. (COIN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZlZXMtZmxpcC1ldGhlcmV1bS1vcmRpbmFscy1jb21lYmFja9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin transaction fees flip Ethereum's as Ordinals hype returns - Cointelegraph",
        "content": "Average daily transaction fees on Bitcoin (BTC) have flipped with Ethereum following a frenzy of Ordinals-related activity on the Bitcoin network.\n\nOn Nov. 20, the average daily transaction fee for Bitcoin stood at $10.34, while Ethereum transaction fees came to an average of $8.43, according to BitInfoChart data.\n\nBitcoin’s average daily trading fee notched a new six-month high on Nov.16, reaching a peak of $18.67, while Ethereum fees reached $7.90.\n\nBitcoin’s average daily fees have surged above Ethereum in the last five days. Source: BitInfoCharts\n\nThe sudden uptick in Bitcoin transaction fees stems from a renewed market appetite for assets inscribed with the Ordinals Protocol — a tool for creating nonfungible token (NFT)-like assets and BRC-20 tokens on Bitcoin.\n\nFollowing a significant lull in activity between Sept. 25 and Oct. 23, Ordinals-based assets saw a drastic uptick beginning in late October, according to Dune Analytics data.\n\nThe number of Ordinals inscriptions grew by over six million since late October. Source: Dune Analytics\n\nRelated: Bitcoin Ordinals team launches nonprofit to grow protocol development\n\nSince Oct. 24, over six million Ordinal assets have been created, resulting in more than 800 BTC in fees — worth roughly $30 million — being redistributed to the network.\n\nThe uptick in Ordinals inscription activity compounded as ORDI — the second largest BRC-20 token by market cap — was listed on Binance on Nov. 7. The listing spurred a wider wave of BRC-20 buying activity from traders with the price of the ORDI token jumping by just over 50% on the day.\n\nAdditionally, on Nov. 17, the Ordinals-based project Taproot Wizards announced a $7.5 million seed round.\n\nMagazine: I spent a week working in VR. It was mostly terrible, however…"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tY29tbXVuaXR5LWJlZ2lucy1iaXRjb2luLWhhbHZpbmctY291bnRkb3duLWFzLW1pbGVzdG9uZS1kYXRlLW5lYXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Crypto community begins Bitcoin halving countdown as milestone date nears - Cointelegraph",
        "content": "The crypto community and many of its most high-profile players have started shifting focus toward the Bitcoin halving, an event that occurs every four years and cuts the market supply of new Bitcoin (BTC) in half.\n\nAt the next halving event scheduled for April 2024, the Bitcoin mining reward will reduce from the current 6.25 BTC per block to 3.125 BTC per block.\n\nBinance CEO Changpeng Zhao took to Twitter to set the countdown for the next halving in an X (formerly Twitter) post to remind everyone that the next BTC halving event is only 135 days away.\n\nHistorically, the Bitcoin halving is linked to bullish momentum for the BTC price due to supply and demand dynamics. The halving of new supply amid growing demand usually pushes the BTC price to new highs in the months following the halving.\n\nTwo months prior to the last halving event in May 2020, the Bitcoin price was trading at less than $10,000. As the event drew closer, bullish momentum saw BTC’s price surpass the previous cycle’s all-time high of around $17,000. After the halving, the BTC price broke into parabolic momentum and created an all-time high of almost $69,000.\n\nPopular trader and analyst Rekt Capital also took to X to elaborate on the different phases of a BTC bull cycle. The analyst divided the timeline into pre-halving and post-halving events, highlighting that approximately 60 days before the halving, a pre-halving rally tends to occur as investors tend to “Buy the Hype” to “Sell the News.”\n\nHowever, the euphoric price surge in the pre-halving period is usually followed by a retracement around the time of the actual halving. In 2016, the pre-halving retracement was 38%, while the 2020 pre-halving retracement was 20%.\n\nThe pre-halving pullback is often followed by a multi-month reaccumulation phase during which the BTC price rises and falls, with little gains during a period of stagnation. Many investors get shaken out in this stage due to boredom, impatience, and disappointment with their BTC investment’s lack of performance in the halving’s immediate aftermath.\n\nBitcoin halving cycle phases. Source: X/Rekt Capital\n\nThe accumulation phase is then typically followed by a parabolic surge, in which Bitcoin breaks out from the reaccumulation area to hit new highs. During this phase, Bitcoin experiences accelerated growth on its way to new all-time highs."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmLXdoeS10aGlzLXRpbWUtZGlmZmVyZW500gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Spot Bitcoin ETF: Why this time is different - Cointelegraph",
        "content": "A wave of optimism around the potential approval of a spot Bitcoin exchange-traded fund (ETF) in the United States has ignited bullish price action in the crypto market in recent weeks.\n\nBut that could be just the beginning: If a spot Bitcoin (BTC) ETF is greenlit by the U.S. Securities and Exchange Commission, it would mark a major milestone in the history of digital assets.\n\nThe ETF would provide institutional investors with a simple and regulated way to get exposure to Bitcoin, with potentially explosive consequences for the market.\n\nAccording to many analysts, a spot Bitcoin ETF could spark a demand shock that, coupled with next year’s Bitcoin halving event, could spark the new crypto bull market.\n\nThe SEC has so far rejected all applications, but two main factors make the current batch of applications different.\n\nOne is the involvement of BlackRock, the world’s largest asset manager, which filed for a spot Bitcoin ETF earlier this year.\n\nThe second is the court ruling that required the SEC to revisit a previous rejection of Grayscale’s application, defining the regulator’s process as “arbitrary and capricious.”\n\n“The Grayscale decision ultimately says that you can’t allow Bitcoin futures ETFs to trade and then argue that the same situation is not for spot Bitcoin ETFs,” said James Seyffart, an analyst at Bloomberg Intelligence.\n\nThat is why, according to Seyffart, the odds of an approval by early January are 90%.\n\nTo understand why a spot Bitcoin ETF approval would be a big deal and its potential impact on the market, check out the full Cointelegraph Report on YouTube, and don’t forget to subscribe!"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jYXRoaWUtd29vZC1hcmstc3BvdC1iaXRjb2luLWV0Zi1hbWVuZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "ARK, 21Shares update spot Bitcoin ETF application as next SEC deadline looms - Cointelegraph",
        "content": "ARK Investment Management, a cryptocurrency investment firm founded by Bitcoin (BTC) advocate Cathie Wood, isn’t giving up on its efforts to launch a spot Bitcoin exchange-traded fund (ETF) in the United States.\n\nOn Nov. 20, ARK Invest filed another amended prospectus for its spot Bitcoin ETF product developed in collaboration with the European digital asset manager 21Shares.\n\nIf approved, the ETF, named the ARK 21Shares Bitcoin ETF, will trade on the Chicago Board Options Exchange’s BZX Exchange under the ticker symbol ARKB, the updated filing reads.\n\nThis latest update is ARK and 21Shares’ third amendment to the prospectus since the firms first filed for a spot Bitcoin ETF in April 2023. ARK previously amended its form S-1 registration statement in October, which was interpreted by experts as a “good sign” of progress.\n\nIn September 2023, the SEC again delayed its expected decision on ARK’s application. The next deadline for the decision has been set for Jan. 11, 2024.\n\nAccording to Bloomberg ETF analyst Eric Balchunas, the latest filing includes many updates, including numerous risk disclosures designed to satisfy corporate finance requirements.\n\nRelated: WisdomTree amends S-1 form spot Bitcoin ETF filing as crypto awaits SEC decisions\n\n“One interesting thing is they are sticking to in-kind creations redemptions — albeit in a hybrid model — to minimize tax and spread issues,” Balchunas noted. “Semi-shocker to be honest, but in a good way,” he added, stating:\n\n“The more updates to these documents the better, shows them getting these bad boys in shape for SEC approval.”\n\nBloomberg ETF watcher James Seyffart also suggested that the latest filing likely reflects that things are moving with the SEC conversations.\n\nWhile ARK has been actively amending its application, not all spot Bitcoin ETF filers have amended their filings. According to Steyfart’s data, as of mid-November, Franklin Templeton and Global X were the only two firms out of 12 spot Bitcoin ETF filers that hadn’t amended their S-1 filings.\n\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0Zi1hZG9wdGlvbi1vci13YXRlcmVkLWRvd24tY3J5cHRvLWRlYmF0ZS1yYWdlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Are Bitcoin ETFs good for adoption or 'watered-down crypto'? Debate rages - Cointelegraph",
        "content": "CoinList founder Andy Bromberg believes that spot Bitcoin (BTC) exchange-traded funds (ETFs) are just “watered down crypto” and a sign the industry is heading in the wrong direction, amid growing hype over potential ETF approvals in the United States.\n\nBromberg — also CEO of payments-focused wallet app Beam — told Cointelegraph: “If a Bitcoin ETF is considered crypto, we’ve failed as an industry.”\n\nHe said a Bitcoin ETF would “absolutely” be a net positive for crypto adoption but asserted the space’s success comes from helping people self-custody assets and decouple from the traditional finance system — the antithesis of a TradFi ETF.\n\n“If crypto adoption happens mostly through ETFs and similar centralized financial instruments, then the core promises of the technology won’t be realized — decentralization and true ownership.”\n\nThe rise of rollups & account abstraction unlock the ability to build payment apps on Ethereum as good as — or better than — web2 products.\n\n\n\nBetween self-custody's regulatory viability and that new tech, it's the right place to focus.\n\n\n\nAnd it's what crypto is all about. — Andy Bromberg (@andy_bromberg) September 20, 2023\n\nBromberg’s take is contrary to the prevailing sentiment of excitement around the potential for spot ETFs to bring in institutional money. Some predict ETFs could see Bitcoin’s market capitalization double and the price hit $150,000 by the end of 2024.\n\nCoinShares head of research James Butterfill told Cointelegraph that setting up a wallet for safe self-custody was still a daunting task for many non-tech-savvy institutional and retail investors. He believes an ETF will improve market access and will “help further democratize Bitcoin.”\n\n“Self-custody simply isn’t possible for many institutional funds, as it steps outside the regulated framework they must operate in,” Butterfill said, adding that it’s also the case for some retail investors.\n\nMatrixport research head and Crypto Titans author Markus Thielen agreed and argued the reason so much crypto remains on exchanges despite a string of collapses is because self-custody is “still problematic for most users and has clumsy interfaces.”\n\nBromberg conceded that self-custody has historically been a challenge but pointed to technology such as account abstraction — which allows for wallet creation without using a seed phrase and more recovery options if access is lost — as proof it was possible to make “mainstream-usable self-custody.”\n\nInstitutional investors need legal clarity, not ETFs\n\nBromberg thinks the real solution to giving institutional investors who want to hold crypto a way to do so lies in regulatory agencies providing legal clarity and the industry giving education on technology and products for institutions to comfortably self-custody.\n\n“There are institutions that hold crypto on their balance sheet already, and others could follow,” Bromberg said.\n\nMany public companies report crypto holdings, including car maker Tesla, business intelligence firm MicroStrategy and a host of crypto miners — although it’s unknown what the custody arrangements are for most.\n\nWhenever the spot bitcoin ETF is approved, we will see what the true global demand looks like for the investment asset.\n\n\n\nLarge institutions aren’t buying bitcoin for transactions, they will want exposure to the best store of value currently available. — Pomp (@APompliano) November 13, 2023\n\nButterfill said ETF-based Bitcoin holdings would come under a regulatory purview that would “ensure high standards for custody.” He explained that some Bitcoin ETF providers could offer physical redemption, similar to some gold-backed ETFs.\n\nWall Street suits won’t change Bitcoin\n\nOther Bitcoin advocates are concerned about the possible influence that massive asset managers such as BlackRock could have over the Bitcoin network.\n\nIn October, Bitcoiner Peter McCormack told Altcoin Daily that a BlackRock ETF would be “good for price but bad for Bitcoin” and expressed concern that it could end up the largest Bitcoin holder by way of its ETF.\n\nThe playbook:\n\n\n\n1. BlackRock files for an ETF.\n\n\n\n2. Retail buys #Bitcoin sending it higher in anticipation of being able to sell even higher to institutions who “gEt iN LaTe”.\n\n\n\n3. BlackRock dumps on retail (you) after the pump.\n\n\n\n4. BlackRock FUDs your bags back down so they can… https://t.co/SxBBKeAoI7 — SHELDON EVANS (@SheldonEvans) November 14, 2023\n\nButterfill said, however, that BlackRock would represent a “large and diverse set of clients” within a regulated structure, which is “very different to an individual or the control a government could exert if there were such a large holder.”\n\nRelated: Ex-Cantor execs launch crypto lending platform in expectation of Bitcoin ETFs\n\nTrading volumes of existing Bitcoin exchange-traded products typically make up a maximum of 5% of total Bitcoin volumes daily, “so we have a very long way to go before ETPs could challenge the overall market,” he explained.\n\nThielen welcomed the possible new Bitcoin holders, saying BlackRock’s ETF would “open the door to thousands of institutional players” who he believes will use Bitcoin to replace “gold and other safe-haven assets such as Treasurys.”\n\nHe added that everybody has a right to own Bitcoin and that the cryptocurrency has become a speculative asset, mostly moving away from its peer-to-peer cash beginnings.\n\n“We should welcome ‘the suits’ from Wall Street to become promoters of Bitcoin. We can all benefit from it.”\n\nMagazine: Big Questions: Did the NSA create Bitcoin?"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8xMS8yMi9pcy1iaW5hbmNlLWJpZy1lbm91Z2gtdG8tc3Vydml2ZS1hLTQzYi1maW5lLWFuZC1mb3VuZGVyLWN6cy1vdXN0aW5nL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8xMS8yMi9pcy1iaW5hbmNlLWJpZy1lbm91Z2gtdG8tc3Vydml2ZS1hLTQzYi1maW5lLWFuZC1mb3VuZGVyLWN6cy1vdXN0aW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Is Binance Big Enough to Survive a $4.3B Fine and Founder CZ’s Ousting? - CoinDesk",
        "content": "For almost its entire existence – barring the last couple of months, when Binance’s PR and legal teams seemed to make a show of the exchange prioritizing compliance – the exchange acted with extreme disregard to U.S. and global regulations. Zhao once boasted the exchange had no headquarters because Bitcoin doesn’t. It opened and closed subsidiaries in known tax havens like Bermuda (in 2018, planning to develop a regulatory framework that didn’t pan out), Jersey (shuttered in 2020) and Malta (ousted in 2021)."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTEyMTIzOTUwMC9lbi9VUy1CaXRjb2luLUNvcnAtU3RvY2tob2xkZXJzLUFwcHJvdmUtVHJhbnNmb3JtYXRpb25hbC1CdXNpbmVzcy1Db21iaW5hdGlvbi13aXRoLUh1dC040gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "US Bitcoin Corp Stockholders Approve Transformational Business Combination with Hut 8 - Business Wire",
        "content": "MIAMI--(BUSINESS WIRE)--Today, U.S. Data Mining Group, Inc. d/b/a US Bitcoin Corp (USBTC) is thrilled to announce that its stockholders have overwhelmingly voted in favor of the proposed business combination (the \"Transaction\") with Hut 8 Mining Corp. (“Hut 8”) (Nasdaq: HUT) (TSX: HUT), one of North America’s largest and innovative digital asset mining pioneers. This decision follows the recent approval by Hut 8's shareholders as announced on Sept. 13, 2023.\n\n\"I'm incredibly proud of what we've accomplished at US Bitcoin Corp. and equally excited about our future with Hut 8,\" says Asher Genoot, President of US Bitcoin Corp. \"Our shareholders have seen the immense value and potential in this merger of equals, and their overwhelming support is testament to this. We are eager to build upon our shared vision for economical mining, highly diversified revenue streams, and industry-leading environmental, social, and governance (ESG) practices.\"\n\nThe Transaction is expected to close by November 30, 2023, subject to customary closing conditions. Upon the closing of the Transaction, the common stock of the combined company, Hut 8 Corp. (“New Hut”), is expected to be listed on Nasdaq and the Toronto Stock Exchange under the proposed ticker symbol “HUT”.\n\nThe Transaction will further allow the newly formed entity to expand its focus on high performance computing, hosting, and managed infrastructure operations, including the maintenance and management of third-party mining sites using purpose-built software.\n\n\"Today's vote marks a significant step towards realizing our shared ambition of creating a sustainable, diversified, and globally recognized digital asset mining leader,\" Genoot added. \"We are committed to delivering superior value for our shareholders, customers, and the broader digital asset community.\"\n\nThe final steps to complete the Transaction are currently underway, marking the start of a new chapter for both entities.\n\nAbout US Bitcoin Corp\n\nFounded by a team of visionary entrepreneurs and experienced executives, USBTC is an efficient, eco-friendly, and large-scale North American mining company. With campuses in New York, Nebraska, and Texas, USBTC seeks to set the standard for what is possible in its industry.\n\nTo learn more, visit https://usbitcoin.com/ or contact Matt Prusak at info@usbitcoin.com.\n\nCautionary note regarding Forward–Looking Information\n\nThis press release includes “forward-looking information” and “forward-looking statements” within the meaning of Canadian securities laws and United States securities laws, respectively (collectively, “forward looking information”). All information, other than statements of historical facts, included in this press release that address activities, events or developments that USBTC or Hut 8 expects or anticipates will or may occur in the future, including such things as future business strategy, competitive strengths, goals, expansion and growth of each company’s businesses, operations, plans and other such matters is forward-looking information. Forward looking information is often identified by the words “may”, “would”, “could”, “should”, “will”, “intend”, “plan”, “anticipate”, “allow”, “believe”, “estimate”, “expect”, “predict”, “can”, “might”, “potential”, “predict”, “is designed to”, “likely” or similar expressions. In addition, any statements in this press release that refer to expectations, projections or other characterizations of future events or circumstances contain forward-looking information and include, among others, statements with respect to: (i) the expected outcomes of the Transaction, including New Hut’s assets and financial position; (ii) the ability of Hut 8 and USBTC to complete the Transaction on the terms described herein, or at all, including, receipt of required regulatory approvals, shareholder approvals, court approvals, stock exchange approvals and satisfaction of other closing customary conditions; (iii) expectations related to the Celsius transaction, including the closing thereof and any required legal approvals and the expected impact on USBTC’s business and miners and hashrate under management, (iv) the expected synergies related to the Transaction in respect of strategy, operations and other matters; (v) projections related to expansion; (vi) expectations related to New Hut’s hashrate and self-mining capacity; (vii) acceleration of ESG efforts and commitments; and (viii) the ability of New Hut to execute on future opportunities, among others.\n\nStatements containing forward-looking information are not historical facts, but instead represent management’s expectations, estimates and projections regarding future events based on certain material factors and assumptions at the time the statement was made. While considered reasonable by USBTC and Hut 8 as of the date of this press release, such statements are subject to known and unknown risks, uncertainties, assumptions and other factors that may cause the actual results, level of activity, performance or achievements to be materially different from those expressed or implied by such forward-looking information, including but not limited to: the ability to obtain requisite shareholder approvals and the satisfaction of other conditions to the consummation of the Transaction on the proposed terms or at all; the ability to obtain necessary stock exchange, regulatory, governmental or other approvals in the time assumed or at all; the anticipated timeline for the completion of the Transaction; the ability to realize the anticipated benefits of the Transaction or implementing the business plan for New Hut, including as a result of a delay in completing the Transaction or difficulty in integrating the businesses of the companies involved (including the retention of key employees); the ability to realize synergies and cost savings at the times, and to the extent, anticipated; the potential impact on mining activities; the potential impact of the announcement or consummation of the Transaction on relationships, including with regulatory bodies, employees, suppliers, customers, competitors and other key stakeholders; security and cybersecurity threats and hacks; malicious actors or botnet obtaining control of processing power on the Bitcoin network; further development and acceptance of the Bitcoin network; changes to Bitcoin mining difficulty; loss or destruction of private keys; increases in fees for recording transactions in the Blockchain; internet and power disruptions; geopolitical events; uncertainty in the development of cryptographic and algorithmic protocols; uncertainty about the acceptance or widespread use of digital assets; failure to anticipate technology innovations; climate change; currency risk; lending risk and recovery of potential losses; litigation risk; business integration risk; changes in market demand; changes in network and infrastructure; system interruption; changes in leasing arrangements; failure to achieve intended benefits of power purchase agreements; potential for interrupted delivery, or suspension of the delivery, of energy to New Hut’s mining sites; failure of the Celsius transaction to receive the necessary legal approvals or failure of the Celsius transaction to otherwise close; and failure to achieve the intended benefits of the Celsius transaction and expected impact on USBTC’s business and miners and hashrate under management.\n\nThese risks are not intended to represent a complete list of the factors that could affect USBTC, Hut 8 or New Hut; however, these factors should be considered carefully. There can be no assurance that such estimates and assumptions will prove to be correct. Should one or more of these risks or uncertainties materialize, or should assumptions underlying the forward-looking statements prove incorrect, actual results may vary materially from those described in this press release as intended, planned, anticipated, believed, sought, proposed, estimated, forecasted, expected, projected or targeted and such forward-looking statements included in this press release should not be unduly relied upon. The impact of any one assumption, risk, uncertainty, or other factor on a particular forward-looking statement cannot be determined with certainty because they are interdependent and New Hut’s future decisions and actions will depend on management’s assessment of all information at the relevant time. The forward-looking statements contained in this press release are made as of the date of this press release, and USBTC expressly disclaims any obligation to update or alter statements containing any forward-looking information, or the factors or assumptions underlying them, whether as a result of new information, future events or otherwise, except as required by law. Except where otherwise indicated herein, the information provided herein is based on matters as they exist as of the date of preparation and not as of any future date, and will not be updated or otherwise revised to reflect information that subsequently becomes available, or circumstances existing or changes occurring after the date of preparation.\n\nAdditional information about the Transaction and where to find it\n\nIn connection with the Transaction, that, if completed, would result in New Hut becoming a new public company, New Hut has filed a registration statement on Form S-4 (the “Form S-4”) with the U.S. Securities and Exchange Commission (the “SEC”). USBTC and Hut 8 urge investors, shareholders, and other interested persons to read the Form S-4, including any amendments thereto, the Hut 8 meeting circular, as well as other documents filed or to be filed with the SEC and documents to be filed with Canadian securities regulatory authorities in connection with the Transaction, as these materials do and will contain important information about USBTC, Hut 8, New Hut and the Transaction. New Hut also has, and will, file other documents regarding the Transaction with the SEC. This press release is not a substitute for the Form S-4 or any other documents that may be sent to Hut 8’s shareholders or USBTC’s stockholders in connection with the Transaction. Investors and security holders are or will be able to obtain free copies of the Form S-4 and all other relevant documents filed or that will be filed with the SEC by New Hut through the website maintained by the SEC at www.sec.gov or by contacting the investor relations department of Hut 8 at info@hut8.io and of USBTC at info@usbitcoin.com.\n\nNo Offer or Solicitation\n\nThis press release is not intended to and shall not constitute an offer to sell or the solicitation of an offer to sell or the solicitation of an offer to buy any securities, nor shall there be any sale of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. No offer of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act of 1933, as amended (the “Securities Act”) or in a transaction exempt from the registration requirements of the Securities Act."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9qYXZpZXItbWlsZWktd2lucy1hcmdlbnRpbmEtcHJlc2lkZW50aWFsLWVsZWN0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin-friendly Javier Milei wins Argentina presidential election - Cointelegraph",
        "content": "Argentina’s Bitcoin (BTC)-friendly Javier Milei won the country’s presidential run-off election on Nov. 19, beating out his opponent Sergio Massa.\n\nWith almost 99% of the votes counted, Milei won over 55% of the votes, giving him a nearly 3-million-vote lead, according to Bloomberg data.\n\nMassa, the country’s minister of economy, called Milei to congratulate him on the victory after more than 90% of the votes were counted — before the announcement of the first official results. Milei will take office on Dec. 10.\n\nWith nearly 100% of the votes counted, Milei had an over-10-percentage-point lead over Massa. Source: Bloomberg\n\nArgentina’s long-lasting inflation crisis has been a heated topic in the South American country, with the Argentine peso recording a 140% increase in annual inflation in the last 12 months.\n\nMilei has been vocal about his criticisms toward the country’s central bank, referring to it as a scam and a “mechanism by which politicians cheat the good people with inflationary tax.”\n\nHe’s referred to Bitcoin as a movement toward “the return of money to its original creator, the private sector.”\n\nRelated: Bitcoin price hits all-time highs across Argentina, Nigeria and Turkey\n\nHowever, he has not signaled any intention to make Bitcoin legal tender in the country.\n\nVIVA LA LIBERTAD CARAJO pic.twitter.com/WzzzZaTcsz — Javier Milei (@JMilei) November 19, 2023\n\nMassa’s views on the money, banking and cryptocurrency industries appear to be polar opposite to Milei’s.\n\nIn October, he pledged to launch a central bank digital currency (CBDC) if elected to “solve” Argentina’s long-lasting inflation crisis.\n\nMassa won the first round of Argentina’s presidential election in October. However, it wasn’t enough to win the presidency outright, triggering the final run-off vote.\n\nPrior to that, Milei won Argentina’s primary election against Massa and other candidates in August.\n\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtcmV0dXJucy1wcm9maXQtYml0Y29pbi1leGNoYW5nZS0zNC03LWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "BTC price returns key profit mark to Bitcoin exchange users at $34.7K - Cointelegraph",
        "content": "Bitcoin (BTC) bought on exchanges every year since 2017 is now on average in profit, the latest data confirms.\n\nCompiled by on-chain analytics firm Glassnode, exchange withdrawal figures confirm that at $37,000, a user’s purchase is on aggregate “in the black.”\n\nBitcoin exchange users claw back bear market losses\n\nBitcoin returned multiple investor cohorts to profit when it retook $30,000 last month, but current prices are having an impact on BTC buyers who entered much earlier.\n\nAccording to Glassnode, which monitors the aggregate price at which coins left exchange wallets each year since 2017, $34,700 is the magic number for turning a profit on investment.\n\nPut another way, anyone who withdrew Bitcoin from a major exchange since Jan. 1, 2017, is up in dollar terms compared to the year of withdrawal.\n\nThis includes those who purchased during Bitcoin’s last bull run year, during which BTC/USD hit all-time highs of $69,000.\n\nThe last time BTC/USD traded above all the post-2017 cost basis lines was at the end of 2021.\n\n“The average withdrawal price for Bitcoin investors across all yearly classes are now in profit,” Checkmate, Glassnode’s lead on-chain analyst, wrote in X (formerly Twitter) commentary about the data on Nov. 21.\n\n“This model can be considered the ‘DCA cost basis’ for the average investor who started accumulating from 1-Jan of each year. Class of 2021 have the highest entry price at $34.7k.”\n\nBitcoin exchange average withdrawal price by year chart. Source: Glassnode\n\nNew realized price records flow in\n\nExchange withdrawal realized price adds another key line in the sand to the current BTC price range.\n\nRelated: Bitcoin stalls below $38K as analysis hints ‘Notorious B.I.D.’ is back\n\nAs Cointelegraph reported, $39,000 is also an important profitability mark, reflecting the price at which 2021 bull market buyers on aggregate return to profit.\n\nThat level also forms the lower bound of popular analyst Credible Crypto’s pre-halving BTC price target range, which bounded to the upside by $50,000. The halving is due next April.\n\nMeanwhile, James Van Straten, research and data analyst at crypto insights firm CryptoSlate, revealed a new all-time high for the total Bitcoin realized price — the complete acquisition cost of the BTC supply.\n\nShort-term holders’ (STH) coins, which refer to the portion of the supply beyond exchanges that has moved in the past 155 days, now also have a higher acquisition cost than ever before.\n\nThe total realized price and STH realized price now stand approximately $10,000 apart, at around $20,930 and $30,460, respectively.\n\n“This ascension emphasizes an increased probability of these coins being spent on a given day and signifies the influx of new investors, with a remarkable 3% surge being the highest since May 2023,” Van Straten wrote.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0xMS0yMi93aGF0LXVzLW1hcnNoYWxzLXNlaXplLWFuZC1zZWxsLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Rolexes, Bitcoin and Louboutins: What US Marshals Seize and Sell - Bloomberg",
        "content": "00:00\n\nRolexes, Bitcoin and Louboutins. What U.S. Marshals Seize and sell. So the U.S. Marshals are seizing these this contraband item. Who are they taking it from? What kind of criminals are we talking about here? Oh, you can kind of like take your pick. It's people who are involved in drug dealing, money laundering, Darkweb, the Internet stuff when they're selling drugs and malware and other sorts of things, then the items that the marshals seize are those that are basically proceeds from a crime or things that are used in the commission of crimes. And Michael, if I'm in the market to buy a Rolex, how do I attend one of these auctions and get my hand on a Rolex, which according to reporting, is at a pretty decent discount? Oh, yeah. That's the hard part, is sometimes that discount goes away. But these auctions happen online fairly often, and they partner with these national auction houses that basically like when you had a lot of really interesting things. Was there an item that stood out the most to you when you were doing your sleuthing through some of these filings? I think the racehorse was a really interesting one. That was the only animal that we saw on this list, and it was from an attorney who was basically taking funds from family members and other clients and used it to buy racehorses and all sorts of other things. Yeah, seem like Rolexes were a dime a dozen. There are a lot of Rolexes on there. Are there a couple of cars, classic cars? There's also digital coins, which you found were very a big haul in 2021. Makes sense given the price action. Yeah, absolutely. And I think, you know, unintentionally, the government probably made one of the best crypto trades of all time because they had they had all of this crypto that they seized and then sold it when it was basically at the highs. So I think it was something like $39 million from like 680 Bitcoin or something like they time the market like right at the top and entirely unintentionally, just given the way that the crypto markets were acting and upon. You know what interested me in all this? And we talk about, you know, this racehorse, the private jets, the boats, the digital coins, is that the auction data is not really accessible to the public. You actually had to file a Freedom of Information Act to get all this data to get five years worth of sales. Why is it not available to most people? Why is it not more public, given that the U.S. Marshal services are seizing this from criminals and taxpayers are funding a lot of these efforts? Yeah, I mean, they have annual reports. Second kind of breakdown of how much is being sold every year and how many items have been sold and how much has been given out in terms of victim compensation and that kind of thing. But there's no central database that tells you like they sold this Pokemon card on February 8th or whatever. So I don't know why they don't maintain a database that would have made my job a lot easier and I wouldn't have had to wait six months for it. But sometimes you just have to file the request and see what happens. And I filed this in September 2022, and I got it back in July 2023. And luckily it was free, but I just had to wait a bunch of time and it was not an easy thing to kind of like convert and get into Excel. It was all on like a PDF. And so there's a lot of work that had to be done to kind of get the project to publication. And Michael, this story has a lot of really cool graphics. I'm looking at the jump though, from 20 1922 and a half million dollars to more than $83 million in 2021. Is that more things being seized by the marshals, the more expensive items? What drove the run up because that was still before COVID. Yeah, there is a big ol cryptocurrency that was in there. And then I think the second biggest category is cars as well. So I want to say that part of the reason why that jump is so big is some of those crypto sales and you mentioned the graphics. Amanda Chan did a fantastic job putting all of this together. She's a Business Week designer. Where does this money go? Yes, When it is? Yes. What like the greatest, as you mentioned, great crypto trade by the U.S. government. Does it go to schools? Does it go to can they fund the government, fund the deficit? Yes. It does not go back to Treasury or anything like that. There's no deficit reduction or anything happening. It goes back to local law enforcement and then there's victim compensation funds to like if you were somebody who had been a victim of some sort of scammer crime and somebody, you know, stole your money to buy racehorses or cars or something like that, that money will hopefully go back to you. But it's not a sure process from what I heard. Like, I think they distributed $506 million of bonds last year, but some of that was around like prior years. So just like anything, it's going to take some time. We're talking we're talking to Bloomberg reporter Michael Tobin about a story about what U.S. marshals seize. Michael, with these big sales, do the auction houses get their traditional cut of the proceeds? Oh, that's a great question. I haven't I didn't have a chance to ask them that, but I know that they have what I assume is a contract with the US Marshals, all these auctions. But I have no idea about a cut from it. I don't think there's a buyer's premium on these either. So in a lot of auctions there can be like a 10% buyer's premium. But from what I've seen on the Marshals website, it doesn't look like it a buyer's premium on some of the auctions, least when when they auction off these items. Do people know that their seized items I mean, is it advertised as such? Yeah. So one of the auction houses, like the really big one, they do stuff with local governments as well but it specifically says US U.S. marshals forfeiture auctions. So it's it's pretty well advertised. Said this is property. Interesting. Is there a way to track where some of these items come from? I know you you in your reporting, you show like the Steinway piano for $34,000 belong to the consultant who allegedly made $30 million in a plot to bribe Indonesian government officials. Is there a way to see where the these pianos came from? Are these cars were pre-owned? That was honestly one of the hardest parts of this project. So a lot of this had to do with kind of like chasing down court records and then also doing more research on the Internet. But we have the Bloomberg Law tool, which is super helpful. So I was able to type in like specific keywords like Steinway piano, and I was able to pull off the court case because the government has to file documents essentially in which the property is the defendant. So the title of the case will be the United States of America versus 75 Gold bars, Steinway Piano, Serial Number, X-Y-Z or whatever. So if you're or if you are good at searching, you can kind of figure out kind of quickly where these are coming from. The hard part is some of the items are so fungible that you can't really say for sure if this one Rolex was connected to this one guy."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYzNzQ3L2JpdGNvaW4tbmVhcnMtYWxsLXRpbWUtaGlnaC1hcmdlbnRpbmEtamF2aWVyLW1pbGVpLXdpbnMtcHJlc2lkZW50aWFsLWVsZWN0aW9u0gF1aHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjYzNzQ3L2JpdGNvaW4tbmVhcnMtYWxsLXRpbWUtaGlnaC1hcmdlbnRpbmEtamF2aWVyLW1pbGVpLXdpbnMtcHJlc2lkZW50aWFsLWVsZWN0aW9u?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin nears all-time high in Argentina after Milei wins presidential election - The Block",
        "content": "The price of bitcoin in Argentina is reapproaching all-time highs after pro-bitcoin libertarian Javier Milei’s victory in the country’s presidential election last night.\n\nBitcoin BTC -2.63% jumped 2% from around 13 million to 13.2 million Argentine pesos following the announcement before consolidating. It is currently trading at 13.17 million Argentine pesos, according to CoinGecko data.\n\nThe price rise did not quite take bitcoin to new all-time highs in the country — 13.37 million Argentine pesos. That figure was set on Thursday, Nov. 16, coinciding with Milei becoming the strongly favored candidate on the decentralized prediction platform Polymarket.\n\nIt also did not rise as significantly as when Milei won the country’s summer primaries on Aug. 13, soaring more than 20% to 10.2 million Argentine pesos within 24 hours.\n\nBitcoin is also up 1.5% over the last 24 hours in U.S. dollar terms, currently trading at $37,215, according to The Block’s price data.\n\nMilei on bitcoin\n\nWhen asked about the potential for bitcoin as a monetary alternative in an interview with the Argentine newspaper Clarín last year, “The first thing we have to understand is that the central bank is a scam. It is a mechanism by which politicians cheat good people with an inflationary tax,” Milei said.\n\nRELATED INDICES See crypto indices\n\n“What bitcoin is representing is the return of money to its original creator — the private sector,” he continued. “Bitcoin has an algorithm that one day it will reach a certain amount and there is no more and it can compete with other currencies, but the problem is that governments will not give up the legal tender. Bitcoin is the natural reaction against central bank scammers and to make the money private again.”\n\nHowever, despite some drawing parallels with El Salvador President Nayib Bukele, who oversaw his country giving bitcoin legal tender status in 2021, Milei does not seem to favor bitcoin as legal tender either. Instead, the president-elect campaigned on eliminating Argentina’s central bank and dollarizing a devastated economy that has witnessed multiple debt defaults and inflation soaring to nearly 150%.\n\nMilei’s victory\n\nWith 99% of votes counted, Milei won 55.7% of support compared to 44.3% for Argentina’s current economy minister, Sergio Massa, according to Bloomberg.\n\n“Today is the beginning of the end of Argentina’s decadence,” Milei said in his victory speech, local media reported. “We’ll start doing things that history has shown works, and within 35 years, we’ll return to being a world power.”\n\nSeveral prominent bitcoiners congratulated Milei on X. “It’s time to try something different. Change is coming, and with it volatility. Let’s see if he stays true to his word and abolishes the central bank,” BitMEX co-founder Arthur Hayes said. “Bitcoin is hope for Argentina. Congratulations Javier Milei,” MicroStrategy founder Michael Saylor added.\n\nJubilant scenes among Milei’s supporters followed his victory announcement, with some appearing to rip up Argentine peso bills to use as confetti in their celebrations. However, others warned that Milei’s presidency could lead to economic “devastation” and “social chaos.”\n\nMilei will assume office on Dec. 10."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMinAFodHRwczovL3d3dy41bmV3c29ubGluZS5jb20vYXJ0aWNsZS9uZXdzL2xvY2FsL2Rld2l0dC1iaXRjb2luLW1pbmUtZ2V0cy1jb3VydC12aWN0b3J5LWp1ZGdlLXN0cmlrZXMtbm9pc2Utb3JkaW5hbmNlLzUyNy1mMWUyMjAxZi05YzRjLTQ0OTctODM4Yi1iMzM4NDVmN2JiY2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "DeWitt Bitcoin mine wins noise ordinance court case - KFSM 5Newsonline",
        "content": "U.S. District Judge Lee P. Rudofsky granted Jones Digital a preliminary injunction against enforcement of the new noise ordinance.\n\nExample video title will go here for this video\n\nNext up in 5\n\nExample video title will go here for this video\n\nNext up in 5\n\nDEWITT, Ark. — Jones Digital LLC, the digital asset mining company building a controversial facility outside DeWitt, won a federal judge’s ruling that halts Arkansas County from enforcing a noise limit approved last month that was stricter than decibel restrictions the county imposed in July.\n\nU.S. District Judge Lee P. Rudofsky granted Jones Digital a preliminary injunction against enforcement of the new noise ordinance, which the Arkansas County Quorum Court passed on Oct. 10.\n\nJones’ lawyers argued that the October ordinance sought to impose discriminatory decibel limits and notification inquiries on Jones Digital despite Act 851 of 2023, which outlawed “discrimination” against data centers and bitcoin miners. Digital currency mines and plans for them have spurred protests by their neighbors in several counties, and Act 851 set off a race for municipalities and counties to impose noise limits before the law took effect Aug. 1.\n\nTo read more about this case, our content partner Arkansas Business has the full story here.\n\nWatch 5NEWS on YouTube.\n\nDownload the 5NEWS app on your smartphone:\n\nStream 5NEWS 24/7 on the 5+ app: How to watch the 5+ app on your streaming device"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy83MC1idGMtZG9ybWFudC15ZWFyLTUtdGhpbmdzLWtub3ctYml0Y29pbi10aGlzLXdlZWvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "70% of BTC dormant for a year — 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) starts Thanksgiving week in the United States with a return to $37,000 as bulls stubbornly refuse to loosen their grip.\n\nBTC price action remains tantalizingly near 18-month highs as another weekly close provides a fresh taste of bull market momentum.\n\nThe largest cryptocurrency continues to hold onto reclaimed ground, and while upside has been slower than in previous weeks, BTC/USD is up 7% month-to-date.\n\nHow could the coming days shape up for Bitcoin?\n\nMacroeconomic data prints provide the opportunity for some snap volatility, while under the hood, the landscape when it comes to Bitcoin’s network fundamentals is as rosy as it has ever been in 2023.\n\nAt the same time, supply dynamics are surprising — coins dormant for a year or more now make up over 70% of the supply for the first time, indicating a reluctance among long-term holders to “sell the rip.”\n\nBitcoin dominance is also staying strong, leading to hopes that a classic crypto bull market is once again in its early innings.\n\nCointelegraph takes a look at these factors and more as part of the weekly rundown of all things moving BTC price action in the coming week.\n\nBitcoin traders maintain BTC price retracement odds\n\nBitcoin delivered a suitably buoyant weekly close with a trip to $37,500, but subsequently failed to hold that level.\n\nIn an ongoing expression of the difficulty of reclaiming higher ground as support, BTC price action is now back around the $37,000 mark as of Nov. 20, per data from Cointelegraph Markets Pro and TradingView.\n\n“Considerable supply above price & towards $40K,” popular trader Skew noted in part of his latest social media analysis.\n\n“This will take persistent demand for spot BTC to crack imo. Bullish confirmation is seeing limit bids move up closer to price here, that would signal for higher prices & demand.”\n\nWith hours to go until the Wall Street open, the sense among some market participants is one of range-bound trading continuing for the short term.\n\n“Bitcoin clearly making a range construction here,” Michaël van de Poppe, founder and CEO of trading firm Eight, told X subscribers as the weekly candle completed.\n\n“Resistance at $38K, while support at $33-34.5K is the one to watch for long entries. I think we’ll sweep slightly lower (maybe slightly beneath $36K) before we revisit highs. Needs to hold the trend.”\n\nBTC/USD annotated chart. Michaël van de Poppe/X\n\nThe concept of a retracement to test recent liquidity is nothing new. As Cointelegraph reported, downside targets include a trip to $33,000 and even below $31,000.\n\nUnlike its initial push to 18-month highs last week, however, Bitcoin market data shows a much calmer atmosphere among traders, with both open interest (OI) and funding rates staying neutral.\n\n#Bitcoin Some shorts pushed out on that push before the weekly close.\n\n\n\nOverall open interest still quite low compared to a few weeks back. Funding rates neutral.\n\n\n\nIf you're looking for an exchange to trade on, Consider Bybit and support me:\n\nhttps://t.co/rIxsG0GIWl pic.twitter.com/mtn3aNTfvv — Daan Crypto Trades (@DaanCrypto) November 20, 2023\n\nBTC/USD remains up 7% in November — modest gains — yet still the pair’s best-performing November month since 2020, per data from monitoring resource CoinGlass.\n\n“Even though the sentiment isn’t great, BTC is still up ~5% for the month of November,” popular trader Daan Crypto Trades commented on the performance.\n\n“December tends to be a volatile month that puts in big numbers. Bound to see a turbulent end of year I think!”\n\nBTC/USD monthly returns (screenshot). Source: CoinGlass\n\nJobs, Fed minutes lead short Thanksgiving macro week\n\nU.S. Thanksgiving week is due to be characterized by a cool set of macroeconomic data releases in a period of relief for crypto traders.\n\nJobless claims mark one of the highlights of the coming days, these set for release on Nov. 22.\n\nWhile Bitcoin has overall become less susceptible to macro-induced volatility this year, unemployment surprises have nonetheless succeeded in injecting short-term momentum in the past.\n\nAfter last week’s data prints showed U.S. inflation cooling faster than markets expected, however, market participants are in “wait and see mode” ahead of the next decision on interest rate changes due in mid-December.\n\nFed target rate probabilities chart. Source: CME Group\n\nSo far, consensus is practically unanimous on current levels remaining in place at the Federal Reserve’s Federal Open Market Committee (FOMC) meeting, per data from CME Group’s FedWatch Tool.\n\nThe Fed will release the minutes of its previous FOMC meeting this week.\n\nKey Events This Week:\n\n\n\n1. Existing Home Sales data - Tuesday\n\n\n\n2. Fed Meeting Minutes - Tuesday\n\n\n\n3. Core Durable Goods Orders - Wednesday\n\n\n\n4. Initial Jobless Claims - Wednesday\n\n\n\n5. US Markets Closed for Thanksgiving - Thursday\n\n\n\n6. US Markets Close at 1 PM ET - Friday\n\n\n\nHappy… — The Kobeissi Letter (@KobeissiLetter) November 19, 2023\n\n“Short week, but still some important events to watch. The Fed meeting minutes will be in the spotlight,” financial commentary resource The Kobeissi Letter wrote in part of its weekly forecast.\n\nAnalysis concerned over Bitcoin mining boom\n\nBitcoin network fundamentals remain at or near all-time highs — and depending on how the near-term BTC price action plays out, they may yet jump higher this week.\n\nBoth hash rate and mining difficulty are in full bull mode, analysis has concluded, having spent most of 2023 in a relentless uptrend with only minor retracements along the way.\n\nHowever, the optimistic status quo is not without its warning signs.\n\nIn his latest Quicktake market update for on-chain analytics platform CryptoQuant on Nov. 19, contributor Gigisulivan noted that new hash rate highs have traditionally preceded a BTC price comedown.\n\n“This was no longer the case after 15th of Sept as the dominant BTC Spot ETF rally took over and pushed BTC’s price 30%+ up,” he acknowledged.\n\nDespite this, there is still time for history to repeat itself, with the result potentially constituting a return toward the $30,000 mark.\n\n“Important to note is that we have another new high on hashrate 2 weeks ago, that is sitting still within the usual time-frame and usual pump before dump range,” the update added.\n\n“Most likely pullback target between 30-31.5k.”\n\nAs Cointelegraph reported, one theory suggests that miners will be looking to increase BTC stockpiles in advance of the April 2024 halving, when the amount of BTC awarded to them per block is cut by 50%.\n\nBitcoin’s next automated difficulty readjustment is scheduled for Nov. 25 and is currently expected to take difficulty only modestly higher — by around 2%, per data from monitoring resource BTC.com.\n\nBitcoin network fundamentals overview (screenshot). Source: BTC.com\n\nDominance fuels hopes of classic bull market\n\nWhen it comes to Bitcoin versus altcoins, the classic market cap dominance surge, which characterizes early stages of the crypto bull market, remains in play.\n\nBitcoin currently accounts for around 52.5% of the total crypto market cap — around 2% lower than at the start of the month, but still conspicuously higher than its year-to-date lows of nearer 40%.\n\n“Bitcoin price dominance is finally back, at least for the time being,” research firm Santiment wrote in an update on the status quo late last week.\n\n“Altcoins have been retracing on the tail end of the week after the past month’s blistering hot rally. If the crowd begins to get worried and show FUD, however, we could see some quick price rebounds.”\n\nBitcoin crypto market cap dominance 1-week chart. Source: TradingView\n\nBitcoin traditionally advances prior to major altcoins, with small cap tokens bringing up the rear as excitement over price gains permeates crypto markets.\n\nFor Daan Crypto Trades, that sequence of events should ideally continue to play out.\n\n“Best for Bitcoin and the overall market would be if Bitcoin Dominance takes off again while BTC grinds up,” he argued on Nov. 17.\n\n“Not enough liquidity yet to sustain the entire market moving at once. It’s why we see these flushes so often as liquidity is spread too thin. Then when BTC has rallied, capital can flow back into alts to play catch up. The weaker ETH/BTC is the stronger BTC will be most of the time.”\n\nETH/BTC 1-week chart. Source: TradingView\n\nETH/BTC returned to 0.05 BTC at the end of October — its lowest since mid-2022.\n\nSupply dormancy sets new record\n\nWhen it comes to long-term holder resolve to hodl beyond immediate price action, few charts are arguably as bullish as dormant supply.\n\nRelated: Bitcoin nears pre-halving ‘target zone’ toward $50K BTC price\n\nFrom the perspective of its iteration showing the percentage of mined BTC, which has not moved in at least a year, the metric has now hit all-time highs.\n\nOver 70% of the supply has ignored any gains seen since the 2022 bear market bottom and remains in the same wallets.\n\n“Bitcoin has gained +139% over the past year and 70% of all BTC in circulation hasn’t been sold / transferred,” Caleb Franzen, senior analyst at Cubic Analytics, responded.\n\n“Now that’s conviction.”\n\nBTC supply dormant for 1 year or more chart. Source: William Clemente/X\n\nFranzen referenced data from on-chain analytics firm Glassnode uploaded to X by William Clemente, co-founder of crypto research firm Reflexivity.\n\nAs Cointelegraph reported, the area immediately below $40,000 could well represent a key profit-taking watershed for those Bitcoin investors who purchased BTC during the 2021 run to current all-time highs.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZGVjcnlwdC5jby8yMDY2NjEvYWdyZW50aW5hLXByby1iaXRjb2luLXByZXNpZGVudC1qYXZpZXItbWlsZWnSAUxodHRwczovL2RlY3J5cHQuY28vMjA2NjYxL2FncmVudGluYS1wcm8tYml0Y29pbi1wcmVzaWRlbnQtamF2aWVyLW1pbGVpP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Argentina Has a New Pro-Bitcoin President—Who Is Javier Milei? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nPro-Bitcoin outsider candidate Javier Milei will be the next President of Argentina following his victory in a second-round runoff election on Sunday.\n\nPer Bloomberg data, Milei won 56% of the votes to 44% for rival Sergio Massa, who serves as economy minister in the country's incumbent Peronist coalition government; Massa conceded with 99% of the ballots counted.\n\nHeralding the \"rebuilding of Argentina,\" Milei vowed that \"there's no room for gradual measures,\" preparing to tackle the challenges of a spiralling rate of inflation and a rapid decline in the value of the country's currency, the peso. Milei's platform includes shock therapy measures such as \"eliminating the central bank,\" slashing public spending by 15% and abandoning the peso in favor of the U.S. dollar.\n\nAD\n\nAD\n\nFollowing the election, Milei will take office on December 10.\n\nMilei and Bitcoin\n\nKnown for his hardline libertarian views and luxuriant coiffure, the 53-year-old Milei first found fame as an economic pundit before his election to congress in 2021 for his Libertad Avanza (Freedom Advances) party.\n\nDuring the Presidential election campaign, the self-described anarcho-capitalist took to waving a chainsaw at rallies to illustrate his commitment to cutting state spending. Among the policies he's put forward are a free market for the sale of firearms and human organs, and the repeal of the country's 2020 legalization of abortion.\n\nMilei is a keen advocate of Bitcoin, describing the cryptocurrency as \"the return of money to its original creator, the private sector.\" A staunch opponent of central banks, he has described Argentina's central bank as \"one of the greatest swindles in our country’s history,\" arguing that it cheats the populace through \"inflationary tax.\" Bitcoin, he claimed, is the \"natural reaction against the central bank scammers.\"\n\nAD\n\nAD\n\nAlthough Milei has come out in support of Bitcoin, it doesn't figure in his policy proposals. Unlike El Salvador, which has adopted the cryptocurrency as legal tender, Milei has focused his attention on the dollarization of Argentina's economy by 2025, in a bid to halt the \"cancer of inflation.\"\n\nEdited by Stacy Elliott."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5jbWVncm91cC5jb20vbmV3c2xldHRlcnMvZXhjZWxsLXdpdGgtb3B0aW9ucy1yZXBvcnQtZnJvbS1yaWNoLWV4Y2VsbC9leGNlbGwtd2l0aC1vcHRpb25zLXJlcG9ydC1mcm9tLXJpY2gtZXhjZWxsLTIwMjMtMTEtMjEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Excell with Options: Is it time to be optimistic about bitcoin? - CME Group",
        "content": "Now I look at two different simulations. On the top, I look at the PNL if the future price moves down slowly. Again, I can see that the PNL from both ideas is very similar and not dissimilar to the flat market. The net short options in both structures will provide the bulk of the PNL for position. What is more interesting to me is the chart on the bottom. This is the PNL for the structures if we move up quickly. I can see the put-spread collar has a negative PNL initially but this recovers as we near expiration over time. The opposite is true of the ratio call spread. The PNL of this structure moves higher but then peaks and rolls over near expiration. Thus, if I’m inclined to trade out of this position before expiration, I may be better off using the ratio call spread which generates a similar profile in two scenarios and a better profile in a third.\n\nThe options market can be a powerful tool in the toolkit for the trader that knows how to interpret and optimize the strategies involved. Hopefully this week I got you to think outside the box a little bit.\n\nGood luck trading."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMivgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjAtbm92ZW1iZXItMjAyMy9hcnRpY2xlc2hvdy8xMDUzNDc2OTAuY21z0gHCAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZXMtdG9kYXktbGl2ZS1uZXdzLWJpdGNvaW4tZG9nZWNvaW4tZXRoZXJldW0tc2hpYmhhLWludS1jcnlwdG9jdXJyZW5jeS1sYXRlc3QtdXBkYXRlcy0yMC1ub3ZlbWJlci0yMDIzL2FtcF9hcnRpY2xlc2hvdy8xMDUzNDc2OTAuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Major cryptocurrencies trade mix; Bitcoin gains 2% amid dollar weakness - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nMajor cryptocurrencies traded mixed on Wednesday amid a fall in the greenback. Bitcoin (BTC) was trading at $37,198.42, up 1.84%. While top crypto tokens like Ethereum (ETH), BNB XRP , Solana, Cardano, and Dogecoin were up between 1% and 3.70% around 10.15 IST.Bitcoins's gains over the past seven days have been to the tune of 0.80% while for Solana Dogecoin and Cardano, the uptick has been nearly 4%, 2%, and 5% respectively. The laggards on a seven-day basis include XRP (-4.6%), Ethereum (-1.83%), and Tron (-5%).Cryptocurrencies have an inverse relationship with the US dollar. The dollar index was trading at 103.61, down 0.30 or 0.29%.The dollar index (DXY) has tumbled to a two-month low and corrected by 1.9% over the last five sessions, aiding the cause of cryptocurrencies. The weakness has been on account of softer US inflation for the October month which was lower than what the Street was expecting. This has given a fresh impetus to views that were batting for a pause in the interest rate. The lower inflation print may result in the Federal Reserve not doing any further rate hikes.\"Bitcoin is trading cautiously on the upside at $37,100 and a notable threshold at $38,000. Support levels at $35,835, $35,235 and $34,522 highlight potential stabilization points in the downtrend. Technical indicators present a mixed but slightly bullish scenario with RSI at 51 indicating a balanced sentiment. The 50-day EMA at $36,400 supports a short-term bullish trend. Chart analysis reveals a slight ascending channel, indicating a potential continuation of the bullish momentum,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin said.The analyst favors bullish trends above $36,400, he advises caution while putting importance to immediate resistance for short-term moves and potential moves in the coming days.The crypto market started gaining momentum on Sunday, as a pro-Bitcoin candidate—Javier Milei—won the elections in Argentina, Parth Chaturvedi, Investments Lead, CoinSwitch Ventures said. \"On this account, BTC (+2.2%) observed a steep rise before correcting near $37.2k levels. Support is seen in the range between $33,000 and $34.500 with resistance at $38,000,\" Chaturvedi said.On the institution adoption front, Fidelity has become the latest financial firm that is seeking to create an ETH ETF joining its rival BlackRock and 5 other companies, Chaturvedi said, adding that entry of financial giants such as Fidelity provides positive signals for the sector.On a similar note, the SEC has delayed its decision on Franklin Templeton's and Global X's spot bitcoin ETF applications, he informed, expecting the deadline now to shift to early 2024, without any significant impact on BTC's price.(You can now subscribe to our ETMarkets WhatsApp channel (Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of Economic Times)"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vbGVhcm4uYnliaXQuY29tL3dlYjMtZXhwZXJ0cy9iaXRjb2luLWVjb25vbXkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 21 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin's Surge: Unveiling Its Impact on Investors and Markets - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL2NyeXB0b2N1cnJlbmN5LW5ld3MvdGhlLWFtYml0aW91cy1jcnlwdG8tYWdlbmRhLW9mLWphdmllci1taWxlaS1hcmdlbnRpbmFzLXByZXNpZGVudC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 20 Nov 2023 08:00:00 GMT",
        "title": "The Crypto Agenda of Javier Milei, Argentina's President - Altcoin Buzz",
        "content": "The charismatic economist and political outsider has captured the nation’s attention with his unorthodox campaign and promises of economic revitalization through embracing digital currencies.\n\nAs Milei assumes the highest office in the country, the world is eager to see how his pro-crypto stance will shape Argentina’s economic policies. In this article, we’ll take a look at that are the crypto-related initiatives that Milei said he is interested in.\n\nWhat’s the Relation Between Javier Milei and Cryptocurrencies?\n\nMilei’s campaign was driven by a staunch commitment to free-market principles and a bold embrace of decentralized technologies. In his victory speech, the president-elect highlighted the transformative potential of blockchain technology. Emphasizing its capacity to bring financial inclusion and stability to a nation grappling with hyperinflation and a volatile fiat currency.\n\n“With legal tender, they scam you with the inflationary tax… #Bitcoin is the natural reaction against central bank scammers; to make money private again.” – Javier Milei, President of Argentina 🇦🇷🇦🇷pic.twitter.com/Rs2yXFo4e7 — Dylan LeClair 🟠 (@DylanLeClair_) November 19, 2023\n\nMilei’s vision for the crypto industry in Argentina is multifaceted and ambitious. Among his key proposals is the creation of a regulatory framework that fosters innovation while ensuring investor protection. He envisions a collaborative approach between the government and the crypto industry. The goal is to establish clear guidelines that balance the need for security with the imperative of allowing these technologies to flourish.\n\nThe Milei Effect on the Crypto Industry\n\nMilei has emphasized the importance of education and dialogue. He plans to establish a task force comprising experts from the crypto industry. Also, the government to address regulatory concerns and formulate policies that strike a balance between innovation and risk mitigation.\n\nThe international community is closely watching Argentina as it navigates this uncharted territory under the leadership of President-elect Javier Milei. The outcome of Milei’s pro-crypto agenda could serve as a blueprint for other nations grappling with the intersection of traditional finance. And the burgeoning world of digital assets.\n\nConclusion\n\nAs Argentina prepares to embark on this new chapter under Milei’s leadership, the global crypto community awaits eagerly to see if his vision can indeed transform the country into a beacon of innovation and economic prosperity, fueled by the transformative power of blockchain technology and cryptocurrencies.\n\nDisclaimer\n\nThe information discussed by Altcoin Buzz is not financial advice. This is for educational, entertainment, and informational purposes only. Any information or strategies are thoughts and opinions relevant to the accepted levels of risk tolerance of the writer/reviewers and their risk tolerance may be different than yours. We are not responsible for any losses that you may incur as a result of any investments directly or indirectly related to the information provided. Bitcoin and other cryptocurrencies are high-risk investments so please do your due diligence. Copyright Altcoin Buzz Pte Ltd."
    }
]