[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wMi8wMi9iaXRjb2luLW1hbmlwdWxhdGlvbi1wcmljZS1vdXRsb29rL9IBRmh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wMi8wMi9iaXRjb2luLW1hbmlwdWxhdGlvbi1wcmljZS1vdXRsb29rL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "There’s a wild theory that the price of Bitcoin is being propped up—and the academic who proved manipulation in 2017 suspects it may be happening again - Fortune",
        "content": "Back in 2017, John Griffin, a professor of finance at the University of Texas McCombs School of Business, noticed something strange. Griffin follows a totally different beat from typical business school finance profs who explore, say, how business cycles influence commodity prices or Fed policy sways the term structure of interest rates. The 6-foot-2 former high school football star views himself as a crusader for good, a moral sleuth who, as he tells Fortune, “looks to expose financial evil, to shed light on the world and expose dark things in the markets.” After the Great Financial Crisis, Griffin became a devout Christian. He has since dedicated his distinguished career to righteous forensic digging that’s unearthed abuses ranging from insider trading to mortgage fraud to the doctoring of bond ratings during the financial crisis.\n\nAs Griffin and Amin Shams, then a doctoral candidate at McCombs who’s joined Griffin in several gumshoe investigations, screened for misdeeds in 2017, they were fascinated to see that a little-known token that’s supposed to be backed one-for-one to the dollar was getting printed in large quantities. That clue led the pair to another: When new batches appeared, the price of Bitcoin seemed to jump. It looked like someone, or a group, was using that freshly printed “free money” to inflate Bitcoin’s price for their own profit. He and his coauthor Shams sifted through an incredible 200 gigabytes of trading data, equal to the troves that the Smithsonian Institution collects in two years, and followed sales and purchases from 2.5 million separate wallets.\n\nIn 2018, they coauthored a groundbreaking study showing that a single, still unidentified, Bitcoin “whale” almost singlehandedly drove the token’s giant run-up in late 2017 and early 2018 by distorting the trading in the token.\n\nToward the end of 2022, another mystifying trend caught Griffin’s eye. Despite the crypto crash and myriad other negative forces, every time Bitcoin briefly breached the $16,000 floor, it bounced above that level and kept stubbornly trading between $16,000 and $17,000. Almost unbelievably, as the crypto market has continued to unravel into 2023, Bitcoin has gone in the opposite direction, trading up 35% since Jan. 7 to $23,000.\n\n“It’s very suspicious,” Griffin told Fortune. “The same mechanism we saw in 2017 could be at play now in the still unreal Bitcoin market.”\n\nFor Griffin, the way normally super-volatile Bitcoin went calm and stable in the stormiest of times for crypto fits a scenario where boosters are uniting to support and juice its price. “If you’re a crypto manipulator, you want to set a floor under the price of your coin,” added Griffin. “In a period of highly negative sentiment, we’ve seen suspiciously solid floors under Bitcoin.”\n\nThough manipulation is unproven, the signs are troubling\n\nIt’s important to note that no definitive proof of chicanery has so far emerged. “The space is bigger now so it’s harder to dig the data,” says Griffin. “Sophisticated players may be expert at hiding their identities.” We have seen credible leaks asserting that major market participants call meetings of the sector’s elite when they fear a crypto leader plans to make what they consider a reckless, industry-endangering move. But no evidence has surfaced that the players are gathering to coordinate buying of Bitcoin or other cryptocurrencies. For example it's well known that earlier this fall Changpeng Zhao (known as CZ), chief of Binance, the world’s largest crypto exchange and other crypto crypto leaders believed that Sam Bankman-Fried’s hedge fund Alameda was attacking Tether, the then-wobbling coin whose reliability is crucial to the industry’s well-being, and reportedly encouraged him to stop. (Tether—symbol USDT—by the way, was also at the center of the 2017-18 manipulation exposed by Griffin and Shams.)\n\nIt's possible that evidence of cozy, clubby practices will come to light in the numerous bankruptcy proceedings, lawsuits, and criminal investigations now pending in the crypto-verse. “Now that SBF is being charged, he’ll turn on the other players and could accuse them of collusion,” predicts Alex de Vries, an economist at the central bank of the Netherlands who runs Digiconomist, a site that tracks Bitcoin’s carbon footprint. The collapse Genesis's lending business has set Barry Silbert, the head of its parent Digital Currency Group, at the throats of Cameron and Tyler Winklevoss, cofounders of floundering exchange Gemini. The brothers claim that DCG owes the $900 million that Gemini’s depositors loaned to a Genesis program that paid high interest rates and threaten to sue DCG and Silbert, whom they accuse of stonewalling and denying DCG's true liability. Put simply, as onetime allies battle in court, the secrecy surrounding trading in concert, if it exists, could well crumble.\n\nGriffin is far from the only prominent observer who’s wary of bad behavior. In a blog post on Nov. 30 titled “Bitcoin’s Last Stand,” European Central Bank Director General for market operations Ulrich Bindseil and ECB adviser Jürgen Schaaf dismissed Bitcoin’s resurgence as “an artificially induced last gasp before the road to irrelevance.” Two leading figures on Wall Street told this writer on background that Bitcoin’s price action, by resisting a flood of bad news, looks phony and different from a normal free market ruled by independent buyers and sellers.\n\nBitcoin has showed amazing stability amid negative sentiment\n\nThe leading sign that Bitcoin’s benefiting from coordinated buying: its astoundingly steady performance, forming the base for a takeoff to five-month highs following the FTX debacle that seemed likely to send the mainstay token reeling. From Nov. 5, the day before the FTX reports started spreading, to Nov. 9, Bitcoin (based on closing prices) dropped from $21,300 to $15,900, its lowest reading since late 2020, for a fall of 25%. Then the normally careening coin went, by Bitcoin standards, flat. In the 62 days between Nov. 10 and Jan. 11, it traded in the $16,000s and $17,000s for all but one day. In the 50 days from Nov. 22 to Jan. 11, its closing prices hovered in a narrow band, from a low of $16,200 and a high of $17,900, a difference from bottom to top of 10%.\n\nThis initial period of supersmooth sailing was atypical, to put it mildly. Fortune data editor Scott DeCarlo ran a detailed analysis and found that since the start of 2017, Bitcoin has never fluctuated in any of the 40 consecutive 50-day spans by less than 19%, and varied by over 30% in three out of four seven-week time frames. The median low to high reading was 44%. Hence, Bitcoin at peak FTX-induced turmoil showed both its smallest swings ever by a wide margin, and divergence from low to high that was one-fourth to one-fifth its average over the past six years.\n\nThen, from Jan. 12 to 24, Bitcoin began a bizarre upward march. During those two weeks, it rebounded by 28% from $17,935 to $23,000, its best price since August and well above the number when FTX fears began raging. This occurred while the market was digesting the bankruptcies of lender BlockFi on Nov. 28; Core Scientific, one of the largest publicly traded miners, on Dec. 21; and the Genesis lending arm a month later.\n\nYou’d think that the turmoil surrounding Bitcoin would have shaken the confidence of small investors and institutions alike in crypto, leading to lots of selling pressure and sharply falling prices. Indeed, sentiment on social media turned heavily against Bitcoin following the FTX catastrophe. Reflecting the sinking enthusiasm was a steep retreat in trading activity. At Coinbase, volumes in Q4 were well below Q3 readings, and down 52% from Q1.\n\nCould there be alternate explanations for Bitcoin's robust performance? A number of experts who follow crypto trading from day to day see no plot to inflate the prices, but a well-functioning market. “I don’t see a cabal of insiders,” says Andrew Thurman, a researcher at Blockchain analytics provider Nansen. “The price movements in Bitcoin are notoriously cyclical by nature. Often the best explanation is the most boring one. In this case, the price of Bitcoin is rising because there are more buyers than sellers. If anything, fallen players such as Celsius and FTX were selling Bitcoin and pushing down prices to prop up their own coins.” Vetle Lunde, a senior analyst at Norwegian crypto data analysis firm Arcane Research, agrees. “I don’t see a group holding up prices. Now we have a balanced dynamic. The forced selling following the FTX collapse has to some extent been absorbed and we’re seeing no further forced selling,” a phenomenon that’s aided Bitcoin’s recent rebound to over $23,000.\n\nBut there's no question that Bitcoin's post-FTX sturdiness, capped by its new jump, is a gigantic gift to the enterprises whose fortunes wax and wane with Bitcoin’s price. The stocks for exchanges, miners, and lenders all took a big leg down in the days after meltdown. But since hitting two-year lows in December, miners Riot, Marathon, and Bitfarms have jumped 92%, 150%, and 189% respectively as of Jan. 27. Coinbase, one of the world’s largest exchanges, has advanced 85% from its pre–New Year’s trough, adding $7 billion in market cap. Riot, Bitfarms have all rebounded to near their plateaus just prior to the FTX disaster.\n\nOne of the players most desperate for a boost got a big one. At MicroStrategy, cofounder and executive chairman Michael Saylor loaded his hybrid software provider and Bitcoin speculator with $2.4 billion in debt to buy coins, and when prices fell below $16,000 on Nov. 11, owed far more on his loans than the value of his cache of tokens. If Bitcoin kept dropping, MicroStrategy was heading for big trouble. But Bitcoin’s resurgence has lifted MicroStrategy’s holdings out of the red and sent its stock price from $166 in mid-November to $258 on Jan. 27, a gain of 55%.\n\nCrypto operates on a narrower edge than virtually any other financial sector. The factor that determines whether the big crypto players mint profits or tumble into bankruptcy is the price of Bitcoin, the benchmark that in turn leads the prices for other coins. Much of the crypto world has already shattered. But a lot more stalwarts were due to go down unless Bitcoin found a decent foundation after the FTX downfall shook that slender edge.\n\nGriffin and Shams’ findings from the 2017–18 rigging are echoing today\n\nThe Griffin-Shams study of the forces behind the 2017–18 Bitcoin bubble provides a guide to the strategies that could be pressing a thumb on the sales post-FTX. Griffin and Shams, now a professor at Ohio State’s Fisher College of Business, first published their 118-page report in 2018, and it appeared two years later in the prestigious, peer-reviewed Journal of Finance.\n\nFor the team, a tipoff for possible manipulation was that Bitfinex, the large exchange closely related to Tether, wasn’t providing much transparency about the supposed stablecoin. “We saw blogs speculating that Bitfinex wasn’t providing full backing for the coin,” recalls Griffin. “If someone’s printing money by printing Tether that’s unbacked by fiat currency, it could cause a bubble in Bitcoin,” he says. “That was the hypothesis.”\n\nGriffin and Shams found that two practices converged to spur those huge, sudden gains. The first: a flood of newly created coins that gave the fraudster the currency to goose Bitcoin. The second is the approach that’s most relevant today, in which the manipulator or manipulators agree that every time the price drops to a target level, they’ll jump in to push it well above that benchmark.\n\nThe pair saw a strong and questionable pattern in Bitcoin prices. Bitcoin had its biggest spikes when two things happened: Prices started dropping, and lot of Tether was being printed. Then, as now, Tether was the most important “stablecoin,” or cryptocurrency supposedly supported one-to-one by reserves in fiat currency. Tether’s effectively a stand-in for the dollar; each coin is supposed to be backed by the equivalent of one greenback in fiat currency. Tether is issued by an arm of iFinex, a Hong Kong company that also owns what was then the world’s largest exchange, Bitfinex.\n\nThe authors focused on the 1% of all one-hour intervals between the beginning of March 2017 and end of March 2018 that featured the largest combinations of large Tether issuance on Bitfinex, and big Bitcoin buys on two other exchanges, Bittrex and Poloniex. Just before the start of each period, Bitcoin prices were under pressure. But in each case, it appeared that a single huge buyer rode to the rescue, pushing the token sharply higher by the end of the 60-minute interlude. The “whale,” whose identity remains a mystery, was using Tether to buy Bitcoin and hike its price. “We saw a regular pattern of very sizable price reversals,” recalls Shams.\n\nThe 95 one-hour spans that witnessed those big Tether and Bitcoin inflows accounted for nearly 60% of Bitcoin’s immense gains over those 13 months.\n\n“Tether is used as cash to trade Bitcoin and other cryptocurrencies,” notes Shams. Although the market cap of Tether is a fraction of Bitcoin’s, Tether’s trading volumes are higher. Given its importance in trading, the printing of Tether without backing creates “new money” the way the Fed does when it prints excess quantities of dollars. “The issuing of Tether without backing inflated the amount of currency chasing the same supply of Bitcoin,” Griffin told Fortune. “The Tether created from thin air was inflating the price of Bitcoin and other cryptocurrencies.”\n\nOnce the whale obtained the newly minted Tether, it traded the coins for big quantities of Bitcoin on Bittrex and Poloniex. Those large buys reversed the downward trend in Bitcoin and boosted its price well above its level before the dip began. “This player either showed clairvoyant market timing or exerted an extremely large effect on Bitcoin’s price,” states the study. Today, it’s clear that Tether wasn’t holding full reserves behind the coins in this Bitcoin boom period, so that “it’s almost mechanical that money from nowhere would boost the price,” notes Griffin.\n\nAfter the paper appeared, Tether Ltd. insisted that its conclusions were flawed and maintained that Tether couldn’t be used to balloon Bitcoin prices. But a Commodity Futures Trading Commission investigation found otherwise. In October 2021, the CFTC won a $41 million settlement from Tether and its owners for failing to back its coins with dollars as advertised. The CFTC found that “Tether held sufficient reserves to back…tokens in circulation only 27.6% of the time in the 26-month sample from 2016 through 2018” and “comingled reserve funds with Bitfinex’s operational and customer funds.” Says Griffin, “Bitcoin and Tether aren’t used for buying things like cars and pizzas, they’re used for buying other coins. So in that closed system, a relatively small amount of manipulated buying, spurred by creating new coins from nothing, can cause an outsize increase in the Bitcoin price.”\n\nThe whale mastered setting a floor and kept the floor rising\n\nThe authors also found that the sizable purchases frequently happened when Bitcoin’s price reached certain thresholds, just below multiples of $500. “We saw far more purchases at those benchmarks,” says Griffin. “The whale kept establishing price floors, and those floors kept rising. It wasn’t a club. It was one entity. But when the whale held the price at the thresholds, that made it look as if Bitcoin was safe at those floors. That made it look safe for funds and small customers to buy Bitcoin, driving the price still higher.” Adds Shams, “Around round number price levels of Bitcoin, we saw activities consistent with creating price supports.”\n\nGriffin suspects that a similar dynamic is operating today. He says that collusion to prop up Bitcoin would mean that a clique of buyers agrees to purchase together when the price nears a floor. Let’s say that trigger is $16,000, a figure Bitcoin almost always remained just above during its time of extreme stability. If Bitcoin experiences heavy sales threatening to drive its price below $16,000, in our example, the whale club enters en masse. “That $16,000, for example, could serve as a coordinating mechanism,” says Griffin. The manipulators could drive the price up to near $17,000, then sell part of their winnings in many small trades that don’t move the market. They could pocket big profits just letting the price bounce back and forth in the tunnel between $16,000 and $17,000.\n\nGrowing confidence that Bitcoin won’t breach $16,000 would encourage more speculators to join in the buying. Then the group can agree to set a new floor at $18,000. “In crypto, a group of manipulators can push Bitcoin to higher floors unless a big party moves against them,” says Griffin. But it’s much harder to short Bitcoin than to short stocks or bonds. We aren’t seeing evidence of another group moving to drive down the price, giving a stronger hand to any possible club of bulls. “Most of the players in the space have a strong incentive to maintain a price floor,” says Griffin.\n\nIn conclusion, Griffin says, the Griffin-Shams study showed concrete proof of manipulation in 2017 and 2018, and that a single individual did the rigging. “We don’t have concrete analysis this time,” he says. “The truth may emerge in specific stories, if there is collusion.” The lesson, he says, “is that the Bitcoin market remains highly vulnerable to manipulation.”\n\nIndeed, Bitcoin in the wake of the FTX debacle has registered a wondrous performance. Maybe too wondrous to be trusted."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzAzL21hcmF0aG9uLWRpZ2l0YWwtc2VsbHMtbWluZWQtYml0Y29pbi1mb3ItZmlyc3QtdGltZS10by1tb25ldGl6ZS1yZWNlbnQtcmFsbHkv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMDMvbWFyYXRob24tZGlnaXRhbC1zZWxscy1taW5lZC1iaXRjb2luLWZvci1maXJzdC10aW1lLXRvLW1vbmV0aXplLXJlY2VudC1yYWxseS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Marathon Digital Sells Mined Bitcoin for First Time to Monetize Recent Rally - CoinDesk",
        "content": "The move bring the miner's strategy inline with some of its peers, including Riot Platforms (RIOT), which started selling some of its mined bitcoin last year. Marathon was among few remaining miners who continued to hold onto its mined bitcoin, even after indicating that it may sell at some point. The decision likely came after the price of bitcoin rose about 40% in January. The miner intends to continue to sell some of its mined bitcoin this year, to fund its monthly operating costs, according to the statement."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3BsYXktZG9vbS1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "You Can Now Play DOOM Directly On Bitcoin - Blockworks",
        "content": "It happened. Bitcoin runs DOOM.\n\nTo the delight of crypto Twitter and Reddit circles, someone has uploaded a cloned version of the 30-year-old video game classic DOOM to the Bitcoin blockchain as an inscription on the network’s own NFT protocol, Ordinals.\n\nThanks to a happenstance loophole enabled by Bitcoin’s Taproot upgrade pushed in Nov. 2021, a budget (read: free) version of DOOM has been permanently etched on a single satoshi via block 774526, which was added to the blockchain on Wednesday morning.\n\nBeing written to Bitcoin means the functional game will forever live on the immutable blockchain. As long as the network is online, folks can play this version of DOOM.\n\nWeb browsers are still required to compile the code, but forcing unconventional technologies to run DOOM is a meme in tech culture. Crafty hackers have made DOOM run via pregnancy tests, calculators, ATMs, smart watches, toasters and Pelotons — even “unhackable” crypto wallets, among other zany conduits.\n\nWhile the clone is fun in its own blocky-and-basic way, an actual copy of the real DOOM looks destined to make it to the Bitcoin blockchain sometime soon (a Reddit thread from Feb. 2018 suggests DOOM was once playable on Ethereum, however the linked YouTube video is now unavailable).\n\nDOOM on Bitcoin via a single satoshi\n\nMeanwhile, Ordinals continues to pepper conversation amongst Bitcoiners as the community parses what bringing NFTs to the oldest blockchain really means for the future of network and the NFT ecosystem writ large.\n\nThe protocol notably just enabled the biggest-ever Bitcoin block to be mined. A high-definition “Taproot wizard” was inscribed to a satoshi this week, clocking a 3.96MB transaction — close to Bitcoin’s 4MB block size limit (originally 1MB but stretchable via SegWit).\n\nAs for the DOOM Ordinal, it was only 31.2 KB big.\n\nRemember: It’s not the size that matters. The ability to run DOOM is far more important.\n\nUpdated Feb. 3, 2022 at 3:42 am ET: Added context.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LnRoZWNyaW1zb24uY29tL2FydGljbGUvMjAyMy8yLzIvYWxleGFuZGVyLWJpdGNvaW4tcm9tYW5zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Of Bitcoin and Barbarians | Opinion - Harvard Crimson",
        "content": "You couldn’t miss it if you tried. From YouTube adverts starring celebrity comedians to incessant news stories touting another broken price record, “it” was cryptocurrency, a movement taking the world by storm in 2021 and 2022. Largely born out of libertarian currents in the wake of the last financial crisis and limited in scope to Internet subcommunities for years, crypto had finally entered into the mainstream.\n\nHarvard was not immune from this explosion of enthusiasm. On campus, the first-ever undergraduate organization focused on blockchain was founded, while internships and offers of employment at cryptocurrency firms became ubiquitous and irresistible.\n\nThough the highs of 2021 have mostly subsided and the allure of a blockchain future has been greatly diminished by scandals such as the spectacular collapses of the LUNA “stablecoin” network and the FTX cryptocurrency exchange, it still remains unclear why crypto, a technology more than a decade old, was only able to have its moment in the sun over the past couple of years.\n\nThe classic answer given by pundits has been “easy money,” the notion that rock-bottom interest rates set by the Federal Reserve had made it far too tempting for deep-pocketed investors to go all in on moonshot ideas like upending the global monetary system. There may certainly be some truth to that, but it can’t explain how crypto captured the popular imagination, not to mention sovereign governments — how it was able to persuade a solid fifth of Americans and millions of others around the world, spanning across class and cultural boundaries, to risk their financial well-being for the sake of something new.\n\nThis question was somewhere in the back of my mind as I was strolling through the Harvard Art Museums toward the end of the fall semester. Having long been a nerdy numismatist, I soon found myself (again) on the third floor, gawking at the Roman coin collection, which boasts selections from the Late Republican era (1st century BCE) to the Late Antique (3rd-5th centuries BCE).\n\nThe temporal diversity of the collection makes it easy to spot clear compositional differences between coins cast at the opposite ends of the Pax Romana. And while it might not be fair to assume so at first glance, the quality of the coins differ significantly too. By and large, Roman coins, being minted by a central imperial authority, consistently underwent a process of debasement as a smaller and smaller amount of precious metals were used in their manufacture. For instance, whereas the silver denarius was 94 percent pure during the reign of Nero (54 – 68 CE), coins minted by Claudius Victorinus when he ascended to the throne two centuries later in 268 CE were basically junk metal, containing only 0.02 percent of real silver. To many emperors, the logic was simple. Expensive wars required costly expenditures, and what was easier — raising (and collecting) taxes or simply keeping more bullion in the public coffers by reducing how much was spent on currency?\n\nWhile the thesis that this regular debasement over centuries contributed to the ultimate downfall of the Roman state is hotly debated, the notion that the practice was common knowledge among the populus Romanus is more widely acknowledged. Salaries provided to regular soldiers steadily increased as coin purity decreased, while auxiliary forces recruited from “barbarian” forces increasingly demanded their pay in pure gold form. The once-unquestioned authority of the Roman state to control the mediums of exchange in its sphere of influence was gradually shredded to tatters.\n\nAmong the many parallels that politicians and thinkers so often draw between the Roman world and ours, especially with respect to the dominating nature of American cultural influence, perhaps one that should be heeded with caution is the loss of public trust in the Roman “financial” system and the one that we live with today. While there are certainly very significant differences in their respective architectures — namely that we no longer seek to chain our monetary supply with the availability of precious specie — surely we can compare the qualities of public sentiment.\n\nAfter all, money still largely serves the same social functions in our world as it did in our forefathers’, and as with any medium of exchange, unanimous agreement about the value of money is absolutely essential to its continued survival. Once collective trust in its worth erodes beyond some critical point, individuals may be incentivized to seek alternatives. While the Romans may have found refuge in the visible constancy of aurum, as many “gold bugs” still do today, crypto seems to be the new, very popular, kid on the block.\n\nAdvertisement\n\nIndeed, it doesn’t seem coincidental that a mass media motif that was just as pervasive recently as the rise of cryptocurrency was the imminent threat of inflationary pressures in the United States and globally. Think-tankers lined up to provide their version of how rising prices came to be, with some pointing back to the “easy money” policies of central banks and others blaming everything from the pandemic to the war in Ukraine. What was much less disputed was the effects of inflation on the average psyche, as popular discontent shot upward, fueled by the widely held belief that central authorities were to blame somehow for the newfound crisis.\n\nFramed in these terms, it may be much less of a mystery why cryptocurrency has appealed to so many so recently. It has been, in essence, a passive revolt against establishment institutions, driven by the same kind of sentiment and notions of a “break from the big banks” that drove thousands to Occupy Wall Street more than a decade ago.\n\nYes, crypto’s fifteen minutes of fame has likely elapsed, but extensive mistrust of the present financial status quo lingers. Public policy must thus be willing to address these eddies of economic disaffection, lest our currency too goes the way of the Romans’.\n\nAlexander Junxiang Chen ’24 is a Neuroscience and Chemistry concentrator in Quincy House. His column “Artifactual” appears on Thursdays."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm9wZW5hY2Nlc3Nnb3Zlcm5tZW50Lm9yZy9yaXNlLWJpdGNvaW4tY3J5cHRvY3VycmVuY3ktbWFya2V0LzE1MjU4MS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "The rise of bitcoin and the cryptocurrency market - Open Access Government",
        "content": "The cryptocurrency market, a digital or virtual currency marketplace that uses cryptography for security, has been on the rise in recent years – here’s why\n\nThe cryptocurrency market is decentralized, meaning no one organization or governmental body has jurisdiction over it. Instead, it operates on a blockchain, a public ledger that records all transactions. 2009 saw the creation of the first cryptocurrency, Bitcoin, by an unidentified person or group going by the name Satoshi Nakamoto.\n\nSince then, thousands of other cryptocurrencies have been created, with varying levels of success.\n\nThe rise of bitcoin\n\nBitcoin, the first and most well-known cryptocurrency, has seen a significant increase in value and mainstream acceptance in recent years. In 2009, the value of one Bitcoin was less than a penny. But by December 2017, the value had risen to nearly $20,000. This increase in value has attracted the attention of both individual investors and institutional investors.\n\nMany have begun to see cryptocurrency as a legitimate form of investment, rather than just a speculative gamble. This mainstream acceptance has also led to the development of various financial products, such as futures and exchange-traded funds (ETFs), that allow investors to gain exposure to the cryptocurrency market without actually owning any coins.\n\nThe impact of cryptocurrency on the financial industry\n\nThe rise of the cryptocurrency market has also had a significant impact on the financial industry. It has challenged traditional financial institutions, such as banks and payment processors, by providing a decentralized and secure alternative to traditional financial services. For example, Bitcoin and other cryptocurrencies can be used to make peer-to-peer transactions without the need for a middleman, such as a bank.\n\nThis has the potential to disrupt the traditional banking system and the way we conduct financial transactions. A Bitcoin wallet is a software program that allows individuals to store, send, and receive Bitcoin. It also manages a person’s private key, which is used to access and conduct transactions on the Bitcoin network.\n\nWhen an individual wants to make a transaction, they use their wallet to send the desired amount of Bitcoin from their address to the recipient’s address.\n\nThe transaction is then broadcast to the network and confirmed by miners, who add it to the blockchain. Once added to the blockchain, the transaction is considered complete and the funds are transferred to the recipient’s wallet. Bitcoin wallets provide a convenient and secure way to manage one’s Bitcoin transactions. In addition, blockchain technology, which is the underlying technology of cryptocurrency, has the potential to revolutionize many industries beyond just finance. It can be used for everything from supply chain management to voting systems.\n\nThe role of cryptocurrency in e-commerce\n\nThe cryptocurrency market has the potential to revolutionize e-commerce by providing a secure and decentralized way for businesses to accept payments. Online retailers can use cryptocurrency to avoid the high fees and chargebacks associated with traditional payment methods. Additionally, the use of blockchain technology can make e-commerce transactions more secure and transparent.\n\nThe cryptocurrency market has the potential to revolutionize e-commerce\n\nOne of the most popular use cases of cryptocurrency in e-commerce is the use of stablecoins. These are cryptocurrencies that are pegged to the value of a fiat currency, such as the US dollar, to avoid the volatility associated with other cryptocurrencies. This makes them a more viable option for e-commerce transactions.\n\nThe use of cryptocurrency in the gaming industry\n\nCryptocurrency has also been gaining popularity in the gaming industry. Players can use the cryptocurrency market to purchase in-game items and virtual currencies, and game developers can use blockchain technology to create decentralized and transparent gaming platforms. One example of this is the use of non-fungible tokens (NFTs) in the gaming industry. NFTs are unique digital assets that can be bought, sold, and traded like physical assets. They can be used to represent in-game items, such as weapons or armor, and can even be used to represent virtual real estate.\n\nThe role of cryptocurrency in social media\n\nThe rise of cryptocurrency has also had an impact on social media. Platforms such as Steemit and Minds allow users to earn cryptocurrency by creating and curating content. This incentivizes users to create high-quality content and rewards them for their efforts. In addition, some social media platforms are now accepting cryptocurrency as a form of payment for advertising and other services. This allows businesses to reach a wider audience and provides a new revenue stream for the social media platforms.\n\nChallenges faced by cryptocurrency\n\nDespite the rise of cryptocurrency, it is still a relatively new and untested technology. There are several challenges that need to be addressed in order for it to reach its full potential. The absence of regulations is one of the major problems. Because cryptocurrency operates outside of traditional financial systems, it is not subject to the same level of oversight and regulation. Concerns around fraud, money laundering, and other illicit activities have arisen as a result of this.\n\nWhile the value of Bitcoin and other cryptocurrencies has risen, they are still not widely accepted as a form of payment\n\nAnother challenge is the lack of mainstream acceptance. While the value of Bitcoin and other cryptocurrencies has risen, they are still not widely accepted as a form of payment. This makes it difficult for people to use them in their daily lives. Finally, there is the issue of scalability. The blockchain technology that underlies cryptocurrency can only process a limited number of transactions per second. This may result in lengthy transaction delays and expensive costs.\n\nSince the launch of Bitcoin in 2009, cryptocurrency has advanced significantly\n\nIt has seen a significant increase in value and mainstream acceptance, and has the potential to disrupt traditional financial systems. However, there are still challenges that need to be addressed in order for it to reach its full potential. The development of cryptocurrency is an ongoing process, and it will be interesting to see how it evolves in the coming years."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDIvMDIvYml0Y29pbi1yaXNlcy1hYm92ZS0yNDAwMC1leHRlbmRpbmctaXRzLW5ldy15ZWFyLXJhbGx5LWFtaWQtYS1icm9hZGVyLWdhaW4taW4tdGVjaC1zdG9ja3MuaHRtbNIBggFodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wMi8wMi9iaXRjb2luLXJpc2VzLWFib3ZlLTI0MDAwLWV4dGVuZGluZy1pdHMtbmV3LXllYXItcmFsbHktYW1pZC1hLWJyb2FkZXItZ2Fpbi1pbi10ZWNoLXN0b2Nrcy5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin briefly rises above $24,000, extending its new year rally amid a broader gain in tech stocks - CNBC",
        "content": "Bitcoin briefly touched the $24,000 level on Thursday, reaching a key technical level and building on its January rally.\n\nThe up move came a day after the Federal Reserve raised its benchmark interest rate by a quarter percentage point. But Fed Chairman Jerome Powell noted that a disinflationary process has started, soothing investors who are betting on inflation to fall and causing them to take on more risk.\n\nBitcoin was last trading about 1% higher at $23,821.00, according to Coin Metrics. The cryptocurrency rose to $24,069.00 earlier in the afternoon, after rising as high as $24,249.70 Wednesday night, its highest level since Aug. 17.\n\n\"The market took the latest FOMC as dovish, but bitcoin's rally remains precarious,\" said Yuya Hasegawa, crypto market analyst at Japanese bitcoin exchange Bitbank. \"The price did rise on Wednesday, but failed to close above $24k and its momentum seems to be on the decline.\""
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTAzL2JpbGxpb25haXJlLWNhbGxzLXNyaS1sYW5rYS1jb3JydXB0LXRoZW4tb2ZmZXJzLWJpdGNvaW4tZml40gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Billionaire Draper Pitches Sri Lanka on Bitcoin, Gets Rejected - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wMi8wMi9yYXktZGFsaW8tYml0Y29pbi1mdXR1cmUtdmlhYmxlLWNvaW4tbW9uZXktaXMtaW4tamVvcGFyZHkv0gFdaHR0cHM6Ly9mb3J0dW5lLmNvbS8yMDIzLzAyLzAyL3JheS1kYWxpby1iaXRjb2luLWZ1dHVyZS12aWFibGUtY29pbi1tb25leS1pcy1pbi1qZW9wYXJkeS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Legendary investor Ray Dalio is still unimpressed with Bitcoin but he says there might be a ‘viable coin’ on the horizon: ‘Money as we know it is in jeopardy’ - Fortune",
        "content": "Cryptocurrencies had a very dramatic year in 2022. After a period of explosive growth for many coins, higher interest rates combined with a few spectacular collapses made the industry lose $2 trillion in value.\n\n\n\nParts of the crypto industry have begun to bounce back recently. Bitcoin, for example, has surged 40% in value since the start of 2023. Last weekend, it crossed the $23,000 threshold and continues to remain robust. Mark Cuban of Shark Tank fame defended Bitcoin last month as an instrument of stored value despite soured sentiment. And longtime crypto evangelist Cathie Wood has even gone so far as to say that she thinks Bitcoin will surpass $1.5 million by the end of the decade.\n\nBut not everyone is sold on Bitcoin. Founder of Bridgewater Associates and legendary investor Ray Dalio sees Bitcoin as “a tiny thing” that is unstable and often receives “disproportionate attention.” The investor compared the value of Bitcoin to Microsoft—the cryptocurrency is less than a third of what the tech giant is valued at—and added that the coin has “no relation to anything.”\n\nBut he acknowledges that in a changing world, consumers want to find ways to store their wealth and secure their buying power.\n\n“We are in a world where money as we know it is in jeopardy,” Dalio said in an interview Thursday with CNBC’s Squawk Box. “We are printing too much, and it’s not just the United States.”\n\n“People are going to say, ‘Where is my safe store of wealth?’” he noted. “I think the question over the next number of years is really ‘What is money?’ Not just a medium of exchange but a storehold of wealth.”\n\n\n\nAlthough Dalio doesn’t think of Bitcoin as a stable store of value, and he shot down the idea of stablecoins, he didn’t write off digital currencies altogether, and discussed a possible future that could include inflation-linked digital coins.\n\n“I think you’re going to see probably the development of coins that you haven’t seen that probably will end up being attractive, viable coins. I don’t think Bitcoin is it,” he said.\n\nDalio isn’t the only major investor deeply skeptical of Bitcoin. JPMorgan CEO Jamie Dimon called Bitcoin a “hyped-up fraud” in January while defending the broader technology that powers it as useful. Former options trader and author of The Black Swan, Nassim Nicholas Taleb, has referred to Bitcoin as a “tumor” in the economy that has grown in an uncontrolled manner."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzAyL2ZpcnN0LW1vdmVyLWFzaWEtaXMtYml0Y29pbnMtcmlkZS1wYXN0LTI0MWstYS1zdG9wcGluZy1wb2ludC1vci1zaWduLW9mLWZ1cnRoZXItZ2FpbnMv0gGGAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMDIvZmlyc3QtbW92ZXItYXNpYS1pcy1iaXRjb2lucy1yaWRlLXBhc3QtMjQxay1hLXN0b3BwaW5nLXBvaW50LW9yLXNpZ24tb2YtZnVydGhlci1nYWlucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "First Mover Asia: Is Bitcoin's Ride Past $24.1K a Stopping Point or Sign of Further Gains? - CoinDesk",
        "content": "In its January markets report, CoinDesk Indices noted that bitcoin's nearly 40% monthly increase was its largest since October 2021 near the end of the last bull market and 12th best month in its history, and that other digital assets had fared even better. \"Crypto made a comeback in January as the macroeconomic environment turned brighter with decelerating inflation and expectations the Fed will dial back the pace of interest rates,\" the report said. It added that a falling dollar was further buoying the market and that \"as inflation and interest rates moderate, it also propels bitcoin more than traditional assets historically.\""
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2luc2lkZS1iaXRjb2luLWJpZ2dlc3QtYmxvY2vSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "What Was Inside Bitcoin's Biggest Block? - Blockworks",
        "content": "The biggest Bitcoin block ever has just been mined, 14 years after the blockchain went live.\n\nIt contained an Ordinal, the controversial new genre of NFT which recently debuted on Bitcoin.\n\nIn an apparent tease for a forthcoming bitcoin NFT collection, Luxor Mining and popular Bitcoin figure Udi Wertheimer mined the largest-ever bitcoin block, the company announced Tuesday.\n\nBlock 774628 housed the “Taproot Wizard,” a play on the legendary “magic internet money” meme featuring a bitcoin wizard. It was 3.96MB large, close to Bitcoin’s block size limit (which can be stretched to 4MB with SegWit).\n\nThe transaction containing the Ordinal made up 3.94MB, about 99.5%. There were 63 transactions in total, including the 6.25 BTC ($149,000) coinbase reward, which also went to Luxor.\n\n“The image is higher resolution so it contains more pixels (and thus more bytes),” Colin Harper, head of research and content at Luxor Mining, told Blockworks.\n\nLuxor announced the block via Twitter Tuesday evening, teasing followers that other wizards may be available soon. The firm earned an additional 0.009 BTC ($209) in fees for successfully mining the block.\n\nOrdinals — the new platform taking the industry by storm — store texts, images, SCG or HTML on-chain, attached to individual satoshis, bitcoin’s smallest unit currently worth $0.000231.\n\nRead More: Bitcoin NFTs: Love ‘Em or Hate ‘Em, You Can’t Ignore ‘Em\n\nSimilar to the NFT concept, inscribed satoshis can then be transferred freely via the Bitcoin blockchain.\n\nLoading Tweet.. This image is inscribed forever to satoshi 1308063627208201\n\nThe features are made possible using a loophole from the Taproot upgrade in 2021, which enabled “practically unlimited (capped by block size) storage using Opcodes, an executable script in a txn that can store arbitrary data,” Blockworks Research analyst Matt Fiebach said.\n\nOrdinals creator Casey Rodarmor boasts the NFT protocol holds digital artifacts to a “higher standard,” he wrote in a blog post. Ordinals cannot be stored off-chain or on centralized servers, he said.\n\nIndustry members continue to take a mixed view on Bitcoin NFTs, but Ordinals appear to be here to stay.\n\nUpdated Feb. 2, 2023 at 12:05 pm ET: Added comment from Luxor Mining’s Colin Harper.\n\nUpdated Feb. 2, 2023 at 1:39 pm ET: Adjusted excerpt.\n\nUpdated Feb. 2, 2023 at 4:33 pm ET: Corrected Bitcoin’s block size limit.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wMi8wMy9jYXRoaWUtd29vZC1iaXRjb2luLXdyb25nLWFyay1pbnZlc3QtY3J5cHRvLXN0cmF0ZWd5L9IBWGh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wMi8wMy9jYXRoaWUtd29vZC1iaXRjb2luLXdyb25nLWFyay1pbnZlc3QtY3J5cHRvLXN0cmF0ZWd5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Cathie Wood is still a Bitcoin evangelist but she’s getting candid about what she got wrong: ‘We tempered a few assumptions’ - Fortune",
        "content": "Cathie Wood is finally admitting she got some things wrong about Bitcoin.\n\nThe founder and CEO of ARK Investment Management said Thursday that she and her team misjudged the uptake of the cryptocurrency—or at least the timing of it—by companies and governments. Her firm has invested heavily in Bitcoin and continues to bet on its eventual rise to meteoric heights.\n\n“We tempered a few assumptions,” she told Bloomberg Radio on Thursday. “We thought that—led by Tesla, Block (formerly Square), and MicroStrategy—more corporations would put Bitcoin on their balance sheets. We’ve dialed that one down considerably. And the same thing with nation-states.”\n\nBitcoin lost nearly 65% of its value over 2022, ending the year at about $16,500. It currently stands at just over $23,500.\n\nCompanies holding Bitcoin, not surprisingly, took a beating last year. Tesla for example said in a regulatory filing this week that it registered a $204 million impairment loss on its Bitcoin holdings in 2022. As the cryptocurrency plunged, it sold 75% of its holdings last year.\n\nMeanwhile few governments were eager to follow the lead of El Salvador, which in 2021 became the first country to adopt Bitcoin as legal tender. A Bloomberg article in November last year carried the headline, “El Salvador’s $300 Million Bitcoin ‘Revolution’ Is Failing Miserably.”\n\n“Other countries will probably not move as quickly as they might have if El Salvador had had a grand swoosh right off the bat,” said Wood. “We do think it will happen, it’s just we’ve pushed it out a bit.”\n\nAs for why it will happen, she noted the inflation and fiscal crises people have suffered due to governments’ monetary responses to the pandemic. “Well, where do these people go for an insurance policy against an implosion in their purchasing power and wealth? It is in something like Bitcoin. Bitcoin is an insurance policy,” she said.\n\nBitcoin ‘could pass $1 million’\n\nWood acknowledged that 2022 was a “terrible year for everything crypto.” But she said it was “the centralized, opaque players” like crypto exchange FTX that went bankrupt. Bitcoin, by contrast, “is a rules-based digital monetary system, and it’s global, and there’s no human intervention,” she added.\n\nFTX founder Sam Bankman-Fried didn’t like Bitcoin because “it’s transparent and decentralized. He couldn’t control it,” Wood said in December.\n\nWood is sticking to her prediction that Bitcoin will see a rapid rise in value in the coming years. In five years, she said, it will hit “roughly $670,000, something like that, and then by 2030, as we see more use cases and more of these insurance policies taken out against fiscal and policy regimes that are not healthy, we think it could pass $1 million.”\n\nPlenty of doubters have questioned her prediction. As Bloomberg host Carol Massar noted to Wood, “People are saying to me, ‘Really? Does she really stick to this?’”\n\nMark Mobius, the billionaire cofounder of Mobius Capital Partners, predicted in December that Bitcoin would fall to $10,000 at some point this year.\n\nAnd this week, Warren Buffett’s right-hand man Charlie Munger argued in a Wall Street Journal op-ed that a “cryptocurrency is not a currency, not a commodity, and not a security. Instead, it’s a gambling contract with a nearly 100% edge for the house.”\n\nMunger, who once called Bitcoin “rat poison,” said the U.S. should follow China’s lead and pass laws that prevent both crypto trading and the formation of new cryptocurrencies."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDIvMDMvbmlnZXJpYXMtYml0Y29pbi1wcmVtaXVtcy1tYXktYmV0dGVyLXJlZmxlY3QtY291bnRyeXMtZGVtYW5kLWZvci10aGUtZG9sbGFyLW5vdC1jcnlwdG8v0gGGAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMi8wMy9uaWdlcmlhcy1iaXRjb2luLXByZW1pdW1zLW1heS1iZXR0ZXItcmVmbGVjdC1jb3VudHJ5cy1kZW1hbmQtZm9yLXRoZS1kb2xsYXItbm90LWNyeXB0by9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Nigeria’s Bitcoin Premiums May Better Reflect Country’s Demand for the Dollar, Not Crypto - CoinDesk",
        "content": "When there is a dramatic increase in demand for crypto in South Korea, and when local selling rates in Korean won are converted back into U.S. dollars, “you're seeing that they're actually paying a higher rate in their local currency than they would have been in the U.S. market,” Ryder said."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8wMy9jaGFybGllLW11bmdlci1oYXNudC10YWtlbi10aGUtdGltZS10by1zdHVkeS1iaXRjb2luLW1pY3Jvc3RyYXRlZ3lzLW1pY2hhZWwtc2F5bG9yL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8wMy9jaGFybGllLW11bmdlci1oYXNudC10YWtlbi10aGUtdGltZS10by1zdHVkeS1iaXRjb2luLW1pY3Jvc3RyYXRlZ3lzLW1pY2hhZWwtc2F5bG9yL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Charlie Munger Hasn't Taken the Time to Study Bitcoin: MicroStrategy's Michael Saylor - CoinDesk",
        "content": "Already a bull on MicroStrategy, Canaccord Genuity upped its price target on the stock to $400 from $372 following the earnings news. \"We believe the company's relatively conservative strategy of keeping most of its holdings unencumbered has been prudent,\" wrote analyst Joseph Vafi and team. \"Institutional investors are continuing to work on their bitcoin and overall digital-asset strategies, in our view. As such, we expect to see continued mainstream adoption, which we believe bodes well for the medium term and supports our view that BTC is biased higher over time.\""
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMDIvYml0Y29pbi1zcC01MDAtY2xvc2UtaW4tb24tYnVsbGlzaC1nb2xkZW4tY3Jvc3MtcHJpY2Utc2lnbmFsL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMDIvYml0Y29pbi1zcC01MDAtY2xvc2UtaW4tb24tYnVsbGlzaC1nb2xkZW4tY3Jvc3MtcHJpY2Utc2lnbmFsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin, S&P 500 Close In on Bullish 'Golden Cross' Signal - CoinDesk",
        "content": "A golden cross occurs when the 50-day simple moving average (SMA) of the security's price moves above its 200-day SMA, producing a cross on the price chart. Because moving averages are backward-looking indicators, the signal tells us only that the market's short-term gains have surpassed its long-term gains. Still, chart analysts and traders see it as a harbinger of higher prices over the long run."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzAzL2NyYWlnLXdyaWdodHMtdWstY2FzZS1hZ2FpbnN0LTE2LWJpdGNvaW4tZGV2ZWxvcGVycy10by1nby10by1mdWxsLXRyaWFsLXJlcG9ydC_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMDMvY3JhaWctd3JpZ2h0cy11ay1jYXNlLWFnYWluc3QtMTYtYml0Y29pbi1kZXZlbG9wZXJzLXRvLWdvLXRvLWZ1bGwtdHJpYWwtcmVwb3J0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Craig Wright's UK Case Against 16 Bitcoin Developers to Go to Full Trial - CoinDesk",
        "content": "The claim alleges that the developers owe \"fiduciary duties\" and \"duties in tort\" to re-write or amend protocol code in order to give Wright access to 111,000 bitcoin (BTC) from two wallets whose private keys were allegedly stolen and subsequently erased in a hack. One of the wallets Wright claims to own, the 1Feex wallet, holds nearly 80,000 BTC associated with the hack of Mt. Gox – the Tokyo-based bitcoin exchange that went bankrupt after a series of hacks between 2011 and 2014. His ownership of those coins is, as such, contested."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDIvMDIvdXMvaGl0bWFuLW11cmRlci1iaXRjb2luLW5ldy1qZXJzZXkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Man Paid $20000 in Bitcoin in Failed Attempt to Have 14-Year-Old Killed, U.S. Says (Published 2023) - The New York Times",
        "content": "A New Jersey man admitted in federal court on Thursday that he had tried to hire a hit man on the dark web, paying $20,000 in Bitcoin in an effort to kill a 14-year-old who he feared would testify against him in a child pornography case, the Justice Department said.\n\nThe man, John Michael Musbach, 31, of Haddonfield, N.J., pleaded guilty to a murder-for-hire charge in U.S. District Court in Camden, N.J., admitting that he had logged on to a website that promised to kill people in exchange for payment in the cryptocurrency Bitcoin.\n\nHe could face up to 10 years in prison when he is sentenced on June 13.\n\nMr. Musbach’s motivation for the failed murder-for-hire plan, prosecutors said, dated back to the summer of 2015, when he exchanged sexually explicit photographs with the victim, who was then 13 years old and living in New York. The photos resulted in child pornography charges against Mr. Musbach, so he decided “to have the victim killed so that the victim could not testify against him in the pending criminal case,” the Justice Department said in a news release.\n\nThat case concluded on Oct. 11, 2017, when Mr. Musbach pleaded guilty to endangering the welfare of a child by sexual contact, according to the Justice Department. He was sentenced on Feb. 9, 2018, to a two-year suspended sentence with parole supervision for life."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTAyL21pY3Jvc3RyYXRlZ3ktcG9zdHMtYW5vdGhlci1xdWFydGVybHktbG9zcy1hZnRlci1iaXRjb2luLWNoYXJnZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "MicroStrategy Posts Another Quarterly Loss After Bitcoin Charge - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1wcmljZS1tYW5pcHVsYXRpb24tdG9rZW4tY3J5cHRvLW1hcmtldHMtZXRoZXItYnRjLWZ0eC1ncmlmZmluLTIwMjMtMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Is Bitcoin Being Manipulated? One Professor Sees Red Flags. - Markets Insider",
        "content": "In 2017, professor John Griffin noticed the price of bitcoin appeared to be propped up by a single \"whale,\" and he's now seeing similar red flags, per Fortune.\n\nAt the end of 2022, Griffin observed that bitcoin seemed to bounce each time it breached the $16,000 floor.\n\n\"The same mechanism we saw in 2017 could be at play now in the still unreal bitcoin market.\"\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nAfter a dismal outing last year, bitcoin has skyrocketed more than 40% to start the new year. But John Griffin, a finance professor at the University of Texas McCombs School of Business, thinks there's something suspicious going on, according to Fortune.\n\nHe had a similar inkling of foul play in 2017, when he and a colleague noticed that a single bitcoin \"whale\" seemed to drive the token's price and distort trading.\n\nIn 2018, Griffin and Amin Shams published a 118-page report that detailed their proof of bitcoin market manipulation by a single entity. Two years later, the report was picked up by the peer-reviewed Journal of Finance.\n\nToday, he sees parallels.\n\nAdvertisement\n\n\"It's very suspicious,\" Griffin told Fortune. \"The same mechanism we saw in 2017 could be at play now in the still unreal bitcoin market.\"\n\nHe explained that a token manipulator would want to set a floor price for their asset, which seems to be the case now for bitcoin, which typically sees high volatility rather than stability.\n\n\"In a period of highly negative sentiment, we've seen suspiciously solid floors under bitcoin,\" he said.\n\nGriffin maintained that the sheer size of the crypto market and the amount of data has made definitive proof elusive. Not only that, but he said bad actors are sophisticated enough to hide their identities.\n\nAdvertisement\n\nStill, one finding from Griffin's research five years ago was that sizable bitcoin purchases happened when the token reached certain thresholds.\n\n\"We saw far more purchases at those benchmarks,\" Griffin said. \"The whale kept establishing price floors, and those floors kept rising. It wasn't a club. It was one entity. But when the whale held the price at the thresholds, that made it look as if bitcoin was safe at those floors. That made it look safe for funds and small customers to buy bitcoin, driving the price still higher.\"\n\nBitcoin price floor manipulation\n\nDuring bitcoin's latest run, it's peculiar how reliably bitcoin bounced above $16,000 seemingly the moment it breached that level, he said. That dynamic was evident when Sam Bankman-Fried's FTX was crashing.\n\nIn a five-day stretch in November, bitcoin plunged 25% to $15,900. Then, according to Fortune calculations, the token traded between $16,000 to $18,000 every single day leading up to January 11 except for one.\n\nAdvertisement\n\nFor bitcoin to exhibit that degree of stability is unusual. FTX marked one of the largest collapses in crypto and financial history, yet the price of the world's largest token saw some of the smallest swings ever.\n\nToday, Griffin believes that bitcoin remains \"highly vulnerable to manipulation,\" per Fortune.\n\n\"We don't have concrete analysis this time,\" he added. \"The truth may emerge in specific stories, if there is collusion.\""
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzAzL2JpdGNvaW4tZmFsbHMtYWZ0ZXItNTE3ay1qb2JzLWFkZGVkLWluLWphbnVhcnktYmVhdGluZy1leHBlY3RhdGlvbnMv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMDMvYml0Y29pbi1mYWxscy1hZnRlci01MTdrLWpvYnMtYWRkZWQtaW4tamFudWFyeS1iZWF0aW5nLWV4cGVjdGF0aW9ucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Falls After 517,000 Jobs Added in January, Beating Expectations - CoinDesk",
        "content": "\"This will give the [Federal Reserve] absolutely no reassurance that labor market imbalances – which have been adding to wage pressures - are easing,\" Brian Coulton, chief economist at Fitch Ratings, said. \"It will reinforce the message that the Fed still has quite a lot of work to do to tame core inflation.\""
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTAyLTAyL3doYXQtdXNlLWFyZS1vcmRpbmFscy1iaXRjb2luLW5mdHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "What Use Are Ordinals Bitcoin NFTs? - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW5mdHMtYXJlbi10LWJsb2NrY2hhaW4tMjIzMzMxNjgyLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "'Bitcoin NFTs' Aren't New, But Blockchain Purists Are Now on the Defensive - Yahoo Finance",
        "content": "For nearly a decade, creators have enlisted sidechain or layer-2 solutions to link digital art to the Bitcoin blockchain. But how this is accomplished—or whether it should even be done—has Crypto Twitter up in arms after new project Ordinals developed a way to add digital items to on-chain Bitcoin transactions.\n\nNFT are blockchain tokens that can serve as a proof of ownership for assets, including digital goods like artwork, videos, music files, and memberships. While blockchains like Ethereum and Solana are synonymous with NFTs and digital collectibles, many Bitcoin developers have sought ways to bring them to the quintessential blockchain.\n\nOne issue hampering the development of NFTs on Bitcoin is the need for smart contracts. In the minting process, NFTs use smart contracts to assign ownership of the digital asset in the NFT. The smart contract updates the ownership when the NFT is bought or sold.\n\nBitcoin has only limited smart contract support.\n\nTo address this, earlier projects like Counterparty and Stacks developed alternative solutions that use a native token for the contract piece but ultimately settle their transactions back on the Bitcoin blockchain.\n\nStacks Blows Up 57% After Bitcoin NFTs Take Off\n\nEarlier examples\n\nIn 2014, Counterparty launched the first layer-2 solution for digital assets using the Bitcoin blockchain. Counterparty, which provides the infrastructure for users to create unique tokens on the Bitcoin blockchain, saw its XCP token hit an all-time high above $91 in 2018, but it has fallen about 97% since.\n\nAlthough surpassed by Ethereum and other popular NFT chains in recent years, Counterparty still has an active community of supporters—and its assets can be bridged to Ethereum. More importantly, Counterparty is best known as the home for historical assets like Rare Pepes, which still command significant sums on secondary markets. In April 2022, an NFT containing the opening theme to Larry David’s “Curb Your Enthusiasm” was minted using Counterparty.\n\nStory continues\n\nLaunched in 2017 as Blockstacks, Stacks (as it’s now known) is a blockchain network that can run smart contracts and rolls up all of its transactions before settling them on Bitcoin. Stacks says it doesn’t use a sidechain or layer-2 model, but founder Muneeb Ali told Decrypt in 2021 that he refers to it as “a layer 1.5” built on top of Bitcoin.\n\nThe STX token hit a peak above $3 in December 2021, according to CoinGecko, as its NFTs started to attract the Bitcoin faithful, and in February 2022, an NFT collection called Satoshibles launched a cross-bridge to send NFTs to the Ethereum network. Broadly, however, Stacks has not developed an especially active or valuable NFT market.\n\nBitcoin: Will It Run Doom? Kinda\n\nWhat's Ordinals?\n\nThe most recent example of Bitcoin NFTs is Ordinals, and it takes a different approach. Launched in January, Ordinals aims to add NFT-like assets directly onto the Bitcoin blockchain.\n\nDesigned by Casey Rodarmor, a former Bitcoin Core contributor, Ordinals enables users to explore, transfer, and receive individual satoshis (the smallest unit of Bitcoin, or 1/100,000,000 of a BTC), which may include data such as videos and images. Adding assets to individual satoshis is called inscription, which is stored in a Bitcoin transaction’s signature.\n\nThe idea of filling Bitcoin blocks with JPEGs and videos—or even playable video games—isn’t sitting well with some in the Bitcoin community who have voiced concerns that putting NFTs directly on the Bitcoin network will drive up transaction costs.\n\nMarginalized peoples in developing countries will have to pay more to run their Bitcoin nodes and send transactions because privileged wealthy whites want to put JPEG drawings on the blockchain as status symbols. Just because you can doesn’t mean you should. — Bitcoin is Saving (@BitcoinIsSaving) January 29, 2023\n\nDespite the controversy, Ordinals brings the quest for NFTs on Bitcoin closer than ever, as it does not require a sidechain or layer-2 solution (or similar) or an additional cryptocurrency to work.\n\nBitcoin remains the top cryptocurrency by market cap, but as Ordinals and past examples show, some developers are still trying to use its decentralized network to power new use cases."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9taWNyb3N0cmF0ZWd5LWJvdWdodC1tb3JlLXRoYW4tODgwMC1iaXRjb2lucy1kdXJpbmctMjAyMnMtcGx1bmdlLTIyMzkyMjU5Mi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "MicroStrategy bought more than 8800 bitcoins during 2022's plunge - Yahoo Finance",
        "content": "MicroStrategy (MSTR) bought 8,813 bitcoins during 2022's major crypto dip, taking a $1.28 billion impairment loss for the year, the company said in its fourth quarter report on Thursday.\n\nAs of December 31, the company had spent a total $3.9 billion to acquire 132,500 bitcoins purchased at an average price of $30,137.\n\nThe company's carrying value of its bitcoin holdings at quarter's end was $1.8 billion. As of Thursday afternoon's bitcoin price, MicroStrategy's stash was worth $3.16 billion.\n\nShares of MicroStrategy were down as much as 3% in after hours trade on Thursday. Shares had gained more than 9% during normal trading hours on Thursday, and the stock has more than doubled so far this year.\n\nIn the fourth quarter, the business intelligence software company reported revenue of $132.6 million, just beating the $131 million expected by analysts, according to data from Bloomberg.\n\nMicroStrategy reported a net loss for the fourth quarter of $249.7 million.\n\n\"Our corporate strategy and conviction in acquiring, holding, and growing our bitcoin position for the long term remains unchanged,\" said MicroStrategy CFO Andrew Kang.\n\nMicroStrategy took a $197.6 million impairment charge for the fourth quarter on its bitcoin holdings, bringing its cumulative impairment charges related to bitcoin to $2.15 billion.\n\nThe company’s founder and Executive Chairman Michael Saylor has said previously that buying bitcoin has raised its public profile. Saylor stepped down in August from his role as CEO to focus on the company’s bitcoin strategy and related bitcoin advocacy initiatives.\n\nMicroStrategy CEO Michael Saylor speaks at the Bitcoin 2021 Convention, a crypto-currency conference held at the Mana Convention Center in Wynwood on June 04, 2021 in Miami, Florida. (Photo by Joe Raedle/Getty Images) (Joe Raedle via Getty Images)\n\nTo buy bitcoin, MicroStrategy has issued corporate debt, convertible bonds, equity, and taken out a loan with some of its bitcoin.\n\nDuring the quarter, the company issued $46.2 million worth its stock, and as of December 31, MicroStrategy had around $450 million available for sale under its current authorizaton.\n\nOver its fourth quarter, MicroStrategy also sold bitcoin for the first time, harvesting its losses to offset capital gains tax, according to an SEC filing.\n\nStory continues\n\nThe company's massive bitcoin write downs have also brought attention to how cryptocurrencies should be reported on a public corporation's balance sheet.\n\nBy current standards, crypto holdings must be recorded as intangible assets: when prices fall, the value must be written down to the lowest price point for the period. Alternatively, those assets can't be marked up when prices rise until they are sold.\n\nThe treatment will likely change by the end of 2024 according to Financial Accounting Standards Board (FASB), which voted Wednesday to issue a proposal for public comment by late March that would have corporates value some crypto at fair value like stocks.\n\nClick here for the latest crypto news, updates, values, prices, and more related to Bitcoin, Ethereum, Dogecoin, DeFi and NFTs\n\nRead the latest financial and business news from Yahoo Finance\n\nDownload the Yahoo Finance app for Apple or Android\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and YouTube"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLWJyZWFjaGVzLXVzMjMwMDAtYmVzdC1tb250aGx5LXBlcmZvcm1hbmNlLXNpbmNlLW9jdG9iZXItMjAyMS_SAXFodHRwczovL2Zvcmthc3QubmV3cy93ZWVrbHktbWFya2V0LXdyYXAtYml0Y29pbi1icmVhY2hlcy11czIzMDAwLWJlc3QtbW9udGhseS1wZXJmb3JtYW5jZS1zaW5jZS1vY3RvYmVyLTIwMjEvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin breaches US$23,000 in best monthly performance since October 2021 - Forkast News",
        "content": "Bitcoin, the world’s largest cryptocurrency by market capitalization, rose 2.50% in the week from Jan. 27 to Feb. 3, trading at US$23,528 at 8 p.m. on Friday in Hong Kong. Ether gained 4.47% in the same timeframe, to change hands at US$1,648.\n\nBitcoin surged 39.93% in January, rallying from US$16,496 at the start of the month to US$23,954 by Jan. 31, making it the best month since Oct. 2021, when the cryptocurrency also rallied more than 39%.\n\nDinesh Goel, founder of play-to-earn ecosystem One World Nation, said US$23,000 was a “wait-and-watch level” for Bitcoin holders. “Investors were optimistic that the Federal Reserve would give positive news but were also cautious of the impending recession fears. Overall, it has been a balanced outcome from the [Fed],” wrote Goel in an email. Bitcoin will advance upwards, slowly and steadily, he added.\n\nThe U.S. Federal Reserve has signaled that it plans to raise interest rates further, but economist George Brown said the latest 25 basis point rate hike may have been the Fed’s last.\n\n“Economic activity is beginning to soften as rate rises have gained traction. And forward-looking measures such as the Conference Board’s leading indicator are flashing red.” wrote Brown in a report shared with Forkast. “The labor market is showing tentative signs of turning… [and] inflation has convincingly moderated and should continue to do so.”\n\nPolygon’s Matic was the week’s biggest gainer among the 10 largest non-stablecoin cryptocurrencies, up 10.43% on the weekly chart, trading at US$1.19.\n\nThe global crypto market cap stood at US$1.08 trillion on Friday at 8 p.m. in Hong Kong, up 2.85% from US$1.05 trillion a week ago, according to CoinMarketCap data. Bitcoin’s US$461 billion represented 41.9% of the market, while Ether took up 18.7%.\n\nBiggest gainers\n\nThe Render Network’s token (RNDR) was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap.\n\nThe token jumped 103.09% to trade at US$1.70 after Render Network said it received governance approval for a burn and mint mechanism for its native token.\n\nThe Render Network allows idle GPUs (graphics processing units) to be used for the digital rendering needed in fields like 3D modeling, gaming imagery, and virtual reality.\n\nDecentralized derivatives exchange dYdX’s native token (DYDX) rose 49.22% to US$3.19, making it the week’s second-best gainer, after the exchange announced a lock-up extension for over 150 million tokens, meaning these tokens will only be released to early investors in December this year instead of February.\n\nSee related article: Bitcoin mining fund soars as BTC powers into 2023\n\nWhat’s ahead?\n\n“The general outlook and guidance are positive, which will ensure Bitcoin stays above $23,000 for a while,” wrote Goel, adding that he expects more bullish momentum and that “Bitcoin will start testing the $25k level towards the end of this week.“\n\n“The crypto market may see better days in the coming week since the market sentiment has been risk on. The FED’s 25 basis point rate hike on Feb. 1 sent the dollar sliding. Based on the idea of the recent rate hike, cryptocurrencies may have a strong run-up going next week,” wrote Adam Robertson, crypto market analyst and reporter at crypto.news.\n\nAsset management giant ARK Invest published the seventh edition of their report, Big Ideas 2023, on Feb. 1. The report estimates that the price of one Bitcoin could exceed US$1 million by 2030.\n\nArk outlines three scenarios for Bitcoin in 2030: a bear case, which puts it at US$258,500 with a 40% compound annual growth rate (CAGR); a base case, which estimates US$682,800 with a CAGR of 60%; and a bull case, which predicts that Bitcoin will grow with a 75% CAGR to reach US$1.48 million by 2030.\n\nOne World Nation’s Goel said this prediction may be exaggerated: “What they mean to say is — We believe in crypto, we believe in Bitcoin and it is the future,” he wrote.\n\n“A US$1 million price will peg the Bitcoin market cap at US$21 trillion, ~17% of the world’s 2030 projected GDP of US$126 trillion. This would need Bitcoin to be used by almost everyone in the world. And the current challenges are technology and regulation, which will take a while to get solved,“ said Goel.\n\nBitcoin analyst Willy Woo wrote that the recent gains can be linked to institutional buyers.\n\n“This recent rally coincides with a new pattern emerging of stablecoins flowing into exchanges during work days only. Seems to me like the heat signature of large institutions doing the buying,” Woo said.\n\n“Since this rally began, spot flows are dominant and leading over derivatives,” wrote Woo, adding that spot buying is moving the price, which “implies that long-term institutional investors are coming in via spot buying and moving to custody.”\n\nPseudonymous crypto analyst Rekt Capital tweeted: “BTC would need to break beyond ~US$26500 to break the macro downtrend this February.” “The price point that would represent the macro downtrend next month is ~$24600.”\n\nSee related article: New Bitcoin protocol may shake up the NFT market"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTAyL2JpdGNvaW4tanVtcHMtdG8taGlnaGVzdC1zaW5jZS1hdWd1c3QtaW4tcG9zdC1mZWQtY3J5cHRvLXJhbGx50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Jumps in Crypto Rally After Fed Chair Powell Inflation Remarks - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAyLzAyL2JpdGNvaW5zLW5ldy0zMzctYmlsbGlvbi1vcHBvcnR1bml0eS1pbi1hcml6b25hL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin's New $337 Billion Market Opportunity Is in... Arizona? - The Motley Fool",
        "content": "At the end of January, the Arizona legislature introduced a new bill to make Bitcoin (BTC 1.45%) legal tender within the state. If the bill passes into law, Arizona will become the first U.S. state where Bitcoin has the status of legal tender.\n\nThe move -- while it might appear quixotic to many crypto skeptics -- is actually similar to the one made by El Salvador back in September 2021, when it became the first nation in the world to make Bitcoin legal tender. Since then, the government of El Salvador, led by President Nayib Bukele, has become one of the staunchest supporters of Bitcoin on the world stage. So it's only natural to ask: What would be the implications of Arizona actually making Bitcoin legal tender?\n\nThe Arizona Bitcoin bill\n\nThe new Arizona bill formally states that Bitcoin can serve as a medium of exchange for \"the payment of debts, public charges, taxes, and dues.\" It would also require merchants to accept Bitcoin as payment for all commercial transactions. In essence, holding $20 worth of Bitcoin in your digital blockchain wallet would become the same as holding a physical $20 bill in your real-world leather wallet.\n\nOf course, Bitcoin is already legal within the United States, but the Arizona Bitcoin bill would add a whole new dimension. It would impact every business within Arizona, which had a state GDP of $337.42 billion in 2021. That's more than 10 times the size of El Salvador's national GDP. Moreover, the Arizona legislature also introduced a bill that would make cryptocurrency tax-exempt property. In other words, the state government couldn't tax you on your crypto holdings. If you're expecting Bitcoin to skyrocket to the moon, that's a big deal.\n\nBut does this Arizona bill actually have any chance of passing? On the surface, it would look highly unlikely. For one, the politician behind the Bitcoin push, state senator Wendy Rogers, attempted to pass this bill in 2022, and it failed on its second reading. Wendy Rogers is a highly polarizing figure within the world of Arizona politics, so she might have trouble getting true bipartisan support for the bill. And secondly, some legal experts say that the Bitcoin bill could be illegal under the \"contract clause\" of the U.S. Constitution, which prohibits states from issuing their own money. So, even if the bill passes, it might get tied up in the courts for a long time.\n\nPotential impact\n\nHowever, Bitcoin bulls can certainly dream. In El Salvador, for example, the decision to make Bitcoin legal tender has had some notably positive effects. For one, Bitcoin has made it much easier for El Salvadorans living outside of the country to send remittances back home. This is important because El Salvador is one of the leading nations in the world when it comes to remittances. Bitcoin has also sparked a surge in \"crypto tourism\" for the country. One small beach town -- known as Bitcoin Beach -- has even been featured by CBS News' 60 Minutes. Based on that success, there are now plans to build a Bitcoin City in the country.\n\nSo, if you extend this example to Arizona, the new Bitcoin bill would certainly have an impact on migrants entering the state for work, given that Arizona shares a 370-mile border with Mexico. It would make it much easier for these migrants, who are most likely unbanked, to transmit remittances back home. And it might spark a crypto tourism boom for cities like Phoenix. Instead of Bitcoin Beach, Arizona would be able to promote Bitcoin Desert. Come visit the Grand Canyon, and then spend your Bitcoin in Phoenix!\n\nThere's another possible economic impact here, and that's the possibility of turning Arizona into a crypto hub. Tech entrepreneurs from Southern California might be tempted to relocate to Arizona, just as tech entrepreneurs like Elon Musk are now relocating to Texas. Add in the fact that Arizona is trying to make crypto tax-exempt property, and you can immediately see how Arizona might become an attractive locale for anyone who believes in the future of crypto.\n\nThe global allure of Bitcoin\n\nAt some point, Arizona might turn into a real $337 billion market opportunity for Bitcoin. That would only happen if everyone within the state started to embrace Bitcoin, of course. And that would likely only happen if there is another great Bitcoin bull market rally in which everyone is getting rich. When El Salvador made Bitcoin legal tender in 2021, that was the situation.\n\nThat being said, even skeptics have to acknowledge that Bitcoin has been gaining legitimacy worldwide of late. In December 2022, for example, Brazil passed a sweeping new Bitcoin bill. The Pacific island nation of Fiji also elected a pro-Bitcoin prime minister. In addition, several Caribbean island nations are now planning to make crypto legal tender.\n\nSo Arizona is not some outlier on the world stage. I'm bullish on Bitcoin long-term, and I'm hopeful that Bitcoin will one day be able to take advantage of Grand Canyon-sized market opportunities like the one in Arizona."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9yZGluYWxzLWNyZWF0b3JzLWxvb2stZm9yLWZpeC1hZnRlci1maXJzdC1pbnN0YW5jZS1vZi1zaG9jay1wb3Ju0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Ordinals creator looks for fix after first instance of shock porn - Cointelegraph",
        "content": "Only days after the launch of the Bitcoin (BTC)-based Ordinals protocol, its creator had to deal with their first shock pornographic image, which has been inscribed into the blockchain.\n\nOn Feb. 2 at around 12:15 am UTC, an unsavory image known as “goatse” was inscribed onto the Bitcoin blockchain via the Ordinals protocol.\n\nIt featured on inscription 668 and was live on the Ordinals’ front page for roughly half an hour before the image was removed. It still exists on the blockchain but is not able to be viewed using the Ordinals website.\n\nOrdinals creator Casey Rodarmor told Cointelegraph he acted quickly to remove the image from the Ordinals website but admitted there isn’t much that can be done to stop future instances given the nature of the protocol.\n\nHe is at least working on a solution to stop the images appearing on the Ordinals website.\n\nThe image, known as “goatse,” depicts a man manipulating his anus. Due to its shock value, it’s often used to trick internet users.\n\nRodamor said for the moment, that there was no way to hide certain inscriptions on the Ordinals’ website without manual input.\n\n“The explorer has a config file that can be used to hide certain inscriptions, so we decided that was not very pleasant to look at,” he said. “We added it to that config file and now the server does not return that inscription and will not return that content.”\n\nOrdinals has a simplistic website with every new inscription appearing on its home page.\n\nWhile Rodarmor plans to have a “very liberal content policy” where people will “certainly” be able to inscribe pornographic images, he would like to censor them until he finds a way to automatically keep them off the first page, such as creating a separate space for them on the website.\n\nRecent inscriptions on the Ordinals site show users are inscribing images of Pepe the Frog, a cartoon internet meme. Sou: Ordinals\n\nCritics of blockchain technology have concerns that its immutable nature could be used to forever host illegal or grotesque media, while others argue its censorship resistance should be viewed as a key feature.\n\nAsked if he was concerned about the criticism Ordinals may receive for censoring certain images, Rodarmor responded:\n\n“The inscription is still on the chain and if you run your own copy of Ordinal — which everybody is free to do — it will not have that config file and you will see the gaping butthole if that is what you so desire.”\n\nHe added his site is just one instance of the block explorer and hopes others create more where they can “implement their own moderation policies according to their tastes.”\n\nRelated: ‘WTH did I just witness?' Magic Eden turns porno after hosting service hacked\n\nRodarmor said it’s only the second time he’s censored a pornographic image. He believes the technical difficulty and cost of inscribing an image onto the BTC network have reduced the instances of such trolling attempts.\n\nOrdinals launched on Jan. 21 and immediately divided the crypto community with arguments on whether it was good for the Bitcoin ecosystem.\n\nThe protocol works by inscribing satoshis — the native currency of the Bitcoin network — with content such as images to make NFT-like structures that can be transferred.\n\nThe cost of inscribing a satoshi can cost tens of dollars in comparison to a regular network transaction that ranges from a few cents to a few dollars."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMDIvZ2lhbnQtYml0Y29pbi10YXByb290LXdpemFyZC1uZnQtbWludGVkLWluLWNvbGxhYm9yYXRpb24td2l0aC1sdXhvci1taW5pbmctcG9vbC_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAyLzAyL2dpYW50LWJpdGNvaW4tdGFwcm9vdC13aXphcmQtbmZ0LW1pbnRlZC1pbi1jb2xsYWJvcmF0aW9uLXdpdGgtbHV4b3ItbWluaW5nLXBvb2wvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Giant Bitcoin 'Taproot Wizard' NFT Minted in Collaboration With Luxor Mining Pool - CoinDesk",
        "content": "Battle lines were drawn when the Ordinals protocol, which stores non-fungible tokens on Bitcoin, launched on the dominant blockchain last month. That showdown created two factions – purists who insist on using bitcoin (BTC) exclusively for payments and Ordinals fans who welcome NFTs, including this “Taproot wizard” sketch that nearly filled an entire 4 megabyte (MB) block, incurred no transaction fees (although a premium off-chain fee was likely paid) and left Bitcoiners of both stripes mystified."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDIvMDIvYml0Y29pbi1pcy1vdmVyZHVlLWZvci1hLXBhdXNlLWJlZm9yZS1idWxsaXNoLXRyZW5kLWNvbnRpbnVlcy1zYXlzLXdvbGZlLXJlc2VhcmNoLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin is overdue for a pause before bullish trend continues, says Wolfe Research - CNBC",
        "content": "Bitcoin has rallied more than 40% since the start of the year, quickly paring losses from its disastrous 2022. However, Wolfe Research thinks it isn't go time for the crypto bulls just yet. \"Bitcoin is still trading at the deepest overbought condition in over two years,\" the firm's Rob Ginsberg said in a note this week. \"Sometimes these extended overbought signals can be a sign of momentum, but our sense is that it's overdue for a brake check.\" The cryptocurrency is on pace to finish the week higher again, by about 2%, according to Coin Metrics. Overnight on Tuesday, the price climbed up to $24,249.70, its highest level since Aug. 17 and close to Wolfe's secondary target of $24,500. After finishing 2022 down 64%, bitcoin surged 39.6% in January, which was its best month since October 2021 and its best January performance since 2013. BTC.CM= mountain 2021-03-01 Bitcoin headed for 'brake check'? Investor sentiment got a boost in January from lower inflation readings and optimism around the possibility the Federal Reserve will soon slow down its inflation-fighting rate hikes. After the Federal Reserve said the \"disinflationary process has started\" at the conclusion of its policy meeting, bitcoin rose again. Ginsberg said he's \"encouraged by this initial breakout attempt\" and sees the bullish trend as a structural shift, but that a \"healthy digestion of gains is in order.\" \"An overbought condition this extreme simply is unsustainable regardless of the security,\" he said. \"Expect bitcoin to fall back within its range before seeing any near term upward moves.\" — CNBC's Michael Bloom contributed reporting."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAyLzAzL2RpZC1nb2xkbWFuLXNhY2hzLWdpdmUtYml0Y29pbi1zZWFsLWFwcHJvdmFsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Did Goldman Sachs Just Give Bitcoin a Seal of Approval? - The Motley Fool",
        "content": "For crypto investors, 2022 is starting to feel like a distant memory. In 2023, cryptocurrencies like Bitcoin (BTC 1.50%) are soaring and investor appetite is returning for even the riskiest tokens. Even Goldman Sachs Group (GS 1.06%) -- once a critic of the crypto asset class -- is getting into the act. According to a new Goldman Sachs report, Bitcoin is now the best-performing asset in the world on both an absolute and risk-adjusted basis.\n\nThe findings from that report could have important implications for Bitcoin's future price trajectory. Remember, it was just one year ago that Goldman Sachs slapped a $100,000 price target on Bitcoin, so this report might mark the much-anticipated return of bullish sentiment for crypto on Wall Street in 2023.\n\nRisk-adjusted versus absolute returns\n\nGoldman Sachs compared both risk-adjusted and absolute returns across 25 different asset classes. Bitcoin ranked No. 1 in absolute returns and No. 1 in terms of risk-adjusted returns. The next closest competitor was the MSCI Emerging Markets index, but it wasn't even close. The MSCI Emerging Markets index offered a lower absolute return and lower risk-adjusted returns as well.\n\nIn order to calculate risk-adjusted returns, Goldman Sachs used a popular metric called the Sharpe ratio, which compares the return of an investment with its underlying risk and volatility. In short, it's not enough to say that Bitcoin is now up nearly 40% year to date, because everyone knows that crypto is a very risky and volatile asset class. You are taking on tremendous risk to generate those returns. If another investment could generate those same returns by taking on less risk, it would be superior.\n\nThat's why I was blown away by the Goldman Sachs numbers. Even taking into account all the inherent volatility of crypto, Bitcoin was still a better investment than any other asset class on the planet. It beat out risky assets like emerging market stocks and high-yield debt, and it beat out much safer investments like gold and the S&P 500. The Sharpe ratio for Bitcoin was 3.1, which is absolutely phenomenal. When calculating this ratio, anything between 1 and 2 is considered good, and anything between 2 and 3 is very good. So Bitcoin absolutely hit it out of the park in January.\n\nThe implications\n\nThis is great news for crypto as an asset class, and could make Bitcoin much more palatable for institutional investors with a low risk tolerance. In 2022, Goldman Sachs began offering new Bitcoin-related products and services to clients, and this January report might be the key to offering even more in 2023. After all, when FTX collapsed last year, it was rumored Goldman Sachs was going to start buying crypto assets on the cheap. Could this bullish report on Bitcoin be the prelude to new moves by Goldman Sachs in the crypto market?\n\nThe big caveat here is that one month is a short period of time. Just because Bitcoin soared in January doesn't mean it's headed straight up for the rest of 2023. Crypto still remains a risky and volatile asset class. If you're a crypto skeptic, you could just as easily interpret the new Goldman Sachs data on risk-adjusted returns to mean: If you're crazy enough to take on all the volatility of crypto, then Bitcoin gives you the best bang for your buck.\n\nMoreover, consider just how quickly sentiment can change. In December, Goldman Sachs released completely contradictory findings suggesting that gold is a better investment than Bitcoin. At that time, the outlook for the economy looked bleak and it might have been natural to assume that gold would continue to outperform Bitcoin in 2023. But, as we've seen through the first month of this year, that hasn't been the case.\n\nThe big picture for Bitcoin\n\nTaking a big-picture view, it's clear the macroeconomic outlook for the economy plays a major role in how investors view Bitcoin. At one time, people thought Bitcoin's performance was completely uncorrelated with the broader financial market, but now that appears to be false. As the broader market goes, so goes Bitcoin. The good news is, that at least according to Goldman Sachs, Bitcoin looks like one of the best investments you can make if you believe U.S. economic growth is returning.\n\nGoing forward, I'm keeping a close eye on what's happening with institutional investors in the crypto market. If they are bullish on Bitcoin, then that's a good sign. It means there will be tremendous support for the crypto asset class from some of the smartest investors in the world. As they allocate some of their portfolios to crypto, that could push up the value of Bitcoin. For that reason, I remain bullish on Bitcoin both short- and long-term."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jbGVhbnNwYXJrLXJlbGVhc2VzLWphbnVhcnktMjAyMy1iaXRjb2luLTE0MDAwMDgxOS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "CleanSpark Releases January 2023 Bitcoin Mining Update - Yahoo Finance",
        "content": "Company mines a record 697 bitcoins for the month, up 50% from prior month and 129% from same prior year period; Company’s bitcoin holdings grow 32%\n\nLAS VEGAS, Feb. 02, 2023 (GLOBE NEWSWIRE) -- CleanSpark, Inc. (Nasdaq: CLSK) (the \"Company\" or \"CleanSpark\"), America’s Bitcoin Miner™, today released its unaudited bitcoin mining and operations update for the month ending January 31, 2023.\n\n“We had a banner month, and not just because we mined a record number of bitcoin,” said Zach Bradford, CEO. “We also had our most reliable month ever, achieving 98% uptime across all of our sites. This remarkable achievement is the direct result of some of the hardest working and most dedicated teams in the public bitcoin mining sector. This fact is one of the hallmarks of the CleanSpark way and it is foundational to our operational strategy as one of the largest proprietary miners in North America.\n\n“As a proprietary miner we exercise tremendous control over our ability to meet targets by building our own infrastructure and installing our equipment according to our own schedule. Additionally, we have greater control over our resources, which translates to higher uptime. This month’s mining update is a perfect example of this approach in action, which has allowed us to grow fast and operate reliably.”\n\nJanuary Bitcoin Mining Update (unaudited)\n\nBitcoin mined in January: 697, up 50% from December 2022\n\n2023 Calendar year bitcoin mined: 697\n\nTotal BTC holdings as of January 31: 301 BTC, up 32% from December 2022\n\nTotal BTC converted for operations and growth in January: 624\n\nCurrently deployed fleet of about 66,000 latest-generation bitcoin miners with a hashrate of 6.6 EH/s, up 7% from December 2022 and up 214% from January 2022\n\nThe Company funded growth and operations through the sale of 624 bitcoins in January 2023 at an average of approximately $19K per BTC. Sales of BTC equated to proceeds of approximately $11.9 million. January daily BTC mined averaged about 22.5 and reached a high of 24.2.\n\nStory continues\n\nAbout CleanSpark\n\nCleanSpark (NASDAQ: CLSK) is America’s Bitcoin Miner. Since 2014, we’ve helped people achieve energy independence for their homes and businesses. In 2020, we transitioned that expertise to develop sustainable infrastructure for Bitcoin, an essential tool for financial independence and inclusion. We strive to leave the planet better than we found it by sourcing and investing in low-carbon energy, like wind, solar, nuclear, and hydro. We cultivate trust and transparency among our employees, the communities we operate in, and the people around the world who depend on Bitcoin. CleanSpark holds the 44th spot on the Financial Times' 2022 List of the 500 Fastest Growing Companies in the Americas and ranks thirteenth on Deloitte’s Fast 500. For more information about CleanSpark, please visit our website at www.cleanspark.com.\n\nInvestor Relations Contact\n\nMatt Schultz\n\nir@cleanspark.com\n\nMedia Contacts\n\nIsaac Holyoak\n\npr@cleanspark.com\n\nBlocksBridge Consulting\n\nNishant Sharma\n\ncleanspark@blocksbridge.com\n\nCONTACT: Isaac Holyoak CleanSpark Inc. 702-989-7694 pr@cleanspark.com\n\n\n\n"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi0yMzUwMC1ldGhlci11cC1jcnlwdG8v0gE_aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvbWFya2V0cy1iaXRjb2luLTIzNTAwLWV0aGVyLXVwLWNyeXB0by9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Markets: Bitcoin dips to US$23,500, Ether inches up in mixed trading - Forkast News",
        "content": "Bitcoin and Ether traded mostly little changed Friday morning in Asia after a strong run up in the week so far, with other top 10 cryptocurrencies mixed. Binance’s BNB led the gainers, while Dogecoin lost some more steam following a jump earlier this week on speculation it may play a role in the Twitter payment system being considered by Elon Musk. U.S. tech stocks gained overnight in market hours, but Apple Inc., Amazon.com Inc. and Alphabet Inc. fell after-hours on disappointing Q4 earnings released after the market closed.\n\nSee related article: Crypto hackers stole record US$3.8 bln in 2022, mostly from DeFi and cross-chain bridges: Chainalysis\n\nFast facts\n\nBitcoin slipped 0.93% to US$23,500 in the 24 hours to 8 a.m. in Hong Kong, but is up 1.91% in the past seven days. Ether inched 0.23% higher to US$1,645, adding to gains for the week of 2.49%, according to CoinMarketCap data.\n\n“Bitcoin has been able to maintain its $23,000 price level, which it broke last week. While there is some selling pressure at $24,000, the higher resistance levels are a positive for the crypto market,” Rachel Lin, the co-founder and chief executive officer of crypto derivatives exchange SynFutures, told Forkast in an emailed comment.\n\nBinance’s BNB token gained 1.87% to US$323.29, leading the gains among the top 10 non-stablecoin tokens by market capitalization, and adding 6% over the past week. Polkadot and memecoin Shiba Inu both rose 1.25%.\n\nDogecoin lost 3.12% to US$0.0912, while layer-1 blockchain Solana’s native token fell 2.61% to US$24.34. Dogecoin is still up 5.36% for the seven days after the token’s advocate and Twitter chief executive Elon Musk said he was looking to add a payments system to the social media platform, fuelling speculation Dogecoin may be included.\n\nThe global cryptocurrency market capitalization dipped 0.19% to US$1.08 trillion, while total trading volume grew 18.40% to US$65.89 billion.\n\nU.S. equities were mixed on Thursday. The tech-focused Nasdaq Composite Index added 3.25% and the S&P 500 Index gained 1.47%. The Dow Jones Industrial Average dipped 0.11%.\n\nApple shares rose 3.71% in Thursday market-hours trading but then reversed after-hours to drop 3.2% when it released its 2022 Q4 earnings report that showed revenue fell 5% — the largest year-on-year decline since 2019. Shares in Amazon.com and Google’s parent company Alphabet followed the same pattern; rising during market hours and then falling after-market due to disappointing earnings reports.\n\nThe European Central Bank (ECB) on Thursday raised interest rates by 50 basis points to 2.5%, confirming expectations, and indicated it will raise another 50 basis points in March in its statement. The Bank of England also hiked interest rates by 50 basis points to 4% from 3.5%. However, it added that inflation may have peaked in the UK.\n\nOn Wednesday, the U.S. Federal Reserve raised rates by 25 basis points, the smallest increase since March 2022. Fed chair Jerome Powell commented that the U.S. economy is seeing the start of a “disinflationary process”.\n\n“The [Fed] interest rate hike, which was consistent with market expectations, coupled with the notion that disinflation is underway, has instilled even greater confidence in investors. This is evident in the upward trend we’re seeing in both the stock market and cryptocurrency market,” Henry Liu, the CEO of BTSE cryptocurrency exchange, told Forkast via email.\n\nU.S. non-farm payroll data, another key inflation indicator, will be out later on Friday.\n\nSee related article: Bankrupt FTX held US$1.4B in cash at the end of 2022"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYXVzdHJhbGlhbi1nb3Zlcm5tZW50LXJlbGVhc2VzLWZpcnN0LXN0ZXBzLXRvLXJlZ3VsYXRlLWNyeXB0by1hbmQtYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Australian Government Releases First Steps To Regulate Crypto And Bitcoin - Nasdaq",
        "content": "The first steps of a multi-stage plan to regulate the cryptocurrency industry within Australia have been released.\n\nThe Australian government has announced the first step of what it calls a multi-stage approach to tackling cryptocurrency regulation.\n\nAccording to the announcement, “the multi‑stage approach has three elements: strengthening enforcement, bolstering consumer protection; and establishing a framework for reform.”\n\n\n\nThe first step begins with the Australian Securities & Investments Commission (ASIC) increasing the size of its crypto team and “upping enforcement measures.” These enforcement measures described include taking legal action when cryptocurrencies are marketed without appropriate financial licenses. In addition, the report describes that particular attention will be paid to making sure risks are properly disclosed to consumers.\n\n\n\nThese steps are intended to step up efforts targeting scams, especially those involving cryptocurrencies.\n\n“The Government’s National Anti‑Scams Centre, located within the Australian Competition and Consumer Commission (ACCC), will facilitate real‑time data sharing and the coordinated prevention and disruption of scams,” reads the report, indicating that the collection of data will be a major part of the operations.\n\nIn addition to the steps announced today, the government introduced a token mapping consultation paper addressing “which elements of the crypto ecosystem are sufficiently regulated and which require additional attention.” The paper addresses Bitcoin specifically, describing it as a cryptocurrency network with the intent to operate as a “peer-to-peer payment structure,” as a “new form of currency.” In addition, the use cases of Bitcoin are illustrated, including its use as a store of value, and as a medium of exchange, “particularly in emerging markets.”\n\nThe Australian government's multi-stage approach to cryptocurrency regulation is designed to protect consumers while also providing oversight and regulatory clarity, but it remains to be seen if this regulatory environment will stifle growth and innovation, or fulfill its intended purpose while harboring growth.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9yYXktZGFsaW8tc2F5cy1iaXRjb2luLWlzLW5vdC10aGUtYW5zd2VyLXRoZS1jb21tdW5pdHktcmVzcG9uZHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Ray Dalio says Bitcoin is not the answer — The community responds - Cointelegraph",
        "content": "While billionaire Ray Dalio believes that fiat is in jeopardy, he also thinks that neither Bitcoin (BTC) nor stablecoins are the answer. In response, crypto community members took to Twitter to express their opinion on the topic.\n\nIn a recent interview on CNBC’s Squawk, Dalio shared his takes on Bitcoin being a potential solution to the problems with fiat currency. The billionaire argued that it would not be effective as a store holder of wealth and a medium of exchange. Dalio also highlighted that stablecoins are a replica of state-backed currencies and would also not be an effective form of money.\n\nBitcoiners were quick to respond to the interview, commenting that Bitcoin already fits Dalio's description of what money should be. A community member tweeted:\n\nA community member's thoughts on the topic. Source: Twitter\n\nAdditionally, a Twitter user cited various inherent features of Bitcoin and pointed out that it’s the solution Dalio is looking for. According to the community member, Bitcoin’s censorship resistance, neutrality, openness, limited supply and freedom from control make it the answer to the monetary problem that Dalio described.\n\nMeanwhile, another Bitcoin community member said that they were “orange pilled” by Dalio from his insights on the history of money. The Twitter user believes that the interview shows that the billionaire is close to “truly understanding Bitcoin.“\n\nRelated: Billionaire Ray Dalio 'impressed' how Bitcoin survived the last decade\n\nDalio has historically gone back and forth regarding his position on Bitcoin. In 2021, he went from describing Bitcoin as “one hell of an invention” to a more negative narrative, speaking of a potential ban on Bitcoin in the United States and saying that he would choose gold over Bitcoin.\n\nIn 2022, the billionaire recommended a 1% to 2% Bitcoin allocation for investor portfolios. Back then, Dalio praised BTC for its resilience against hacks and said that it has no better competitor in the market."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzAyL25ldy15b3JrLWJpdGNvaW4tbWluZXItdGVyYXd1bGYtcmVzdHJ1Y3R1cmVzLWRlYnQv0gFjaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMDIvbmV3LXlvcmstYml0Y29pbi1taW5lci10ZXJhd3VsZi1yZXN0cnVjdHVyZXMtZGVidC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Miner TeraWulf Restructures Debt - CoinDesk",
        "content": "TeraWulf has also raised $6.75 million in equity in the past several months. The two co-founders, Chief Executive Officer Paul Prager and Chief Operating Officer Nazar Khan, bought $2.5 million in TeraWulf stock for $1.05 per share in a private placement, adding to the $15 million they have already invested in the company. They have also \"received approximately $4.25 million in proceeds from the exercise of certain private placement warrants issued in December 2022,\" according to the press release."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTAyL2JpdGNvaW4tYnRjLXJlYm91bmQtZ2l2ZXMtY3J5cHRvLW1pbmVycy1jaGFuY2UtdG8tcmVuZWdvdGlhdGUtZGVidNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Rebound Gives Crypto Miners Chance to Renegotiate Debt - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvYml0Y29pbi1oYXMtMS1taWxsaW9uLXBvdGVudGlhbC1zYXlzLXRoaXMtZmFtb3VzLWludmVzdG9yL9IBZ2h0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvYml0Y29pbi1oYXMtMS1taWxsaW9uLXBvdGVudGlhbC1zYXlzLXRoaXMtZmFtb3VzLWludmVzdG9yL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Has $1 Million Potential, Says This Famous Investor - ETF Trends",
        "content": "Smaller bitcoin devotees are colloquially known as HODLrs, as in “holding on for dear life.” Indeed, the largest digital currency and many of its peers can be volatile assets that try investors’ patience and ability to hold over lengthy periods.\n\nStill, some market observers believe bitcoin offers massive upside from current prices of just below $24,000. In fact, some believe the cryptocurrency could appreciate dozens of times over during the next decade, indicating that there could be significant rewards for market participants with the temerity to hold even a small amount of bitcoin for an extend period.\n\nIn its new 2023 Big Ideas report, ARK Investment Management estimated that bitcoin could run to $1 million in the next decade — easily one of the most bullish forecasts around.\n\n“We believe Bitcoin’s long-term opportunity is strengthening. Despite a turbulent year, Bitcoin has not skipped a beat. Its network fundamentals have strengthened and its holder base has become more long-term focused,” according to ARK. “Contagion caused by centralized counterparties has elevated Bitcoin’s value propositions: decentralization, auditability, and transparency.”\n\nARK’s bitcoin forecast emerges after the digital currency notched an impressive January, erasing some of its 2022 declines. Speaking of bitcoin’s 2022 bear market, as ARK noted, it was the fifth-largest in terms of value shed and second-longest from a time perspective.\n\nAs 2022 drew to a close, some crypto market observers noted that deep, extended bitcoin declines historically gave way to the reverse scenario: significant rallies. It remains to be seen if that history repeats this year, but it’s a fact that bitcoin needs to almost triple to reclaim the all-time of around $69,000.\n\nOwing to bitcoin’s aforementioned reputation for volatility, some investors may be more apt to take quick gains and not wait around for prices to double, let alone triple. However, historical data indicate that bitcoin has previously displayed merit as a long-term holding.\n\n“Bitcoin’s volatility has obscured its long-term returns. Despite five drawdowns greater than 75% since its inception in 2009, bitcoin has delivered positive annualized returns over 3-, 4-, and 5-year time horizons,” added ARK.\n\nAdding to the bitcoin case are data points suggesting, as ARK pointed out, that many investors weren’t spooked by the collapse of crypto broker FTX and the ensuing contagion effect. Said another way, some investors realized that FTX likely perpetrated fraud and that wasn’t necessarily direct commentary on crypto fundamentals.\n\n“Despite extreme market fear fueled by the collapse of several major crypto entities, on-chain data suggest that bitcoin holders remained focused on long-term fundamentals,” concluded ARK.\n\nFor more news, information, and analysis, visit the Crypto Channel .\n\nThe opinions and forecasts expressed herein are solely those of Tom Lydon, and may not actually come to pass. Information on this site should not be used or construed as an offer to sell, a solicitation of an offer to buy, or a recommendation for any product."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1bGxzLW11c3QtcmVjbGFpbS10aGVzZS0yLWxldmVscy1hcy1kZWF0aC1jcm9zcy1zdGlsbC1sb29tc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin bulls must reclaim these 2 levels as 'death cross' still looms - Cointelegraph",
        "content": "Bitcoin (BTC) faces a sink-or-swim resistance test to confirm its “macro breakout,” a new analysis says.\n\nIn a tweet on Feb. 2, on-chain monitoring resource Material Indicators flagged key levels to flip to support after BTC/USD spiked above $24,000.\n\nBitcoin price gears up for trend line showdown\n\nIn what was ultimately a boon for Bitcoin bulls, the United States Federal Reserve delivered what risk-on traders wanted to hear on Feb. 1.\n\nWith Chair Jerome Powell using the word “disinflation,” hopes immediately began to bet on rate hikes ending sooner and easier monetary conditions returning in their place.\n\nThe mood was palpable across crypto, with BTC price action reversing an initial drop to see new six-month highs of $24,250 on Bitstamp.\n\nWhile a subsequent correction took the largest cryptocurrency around $500 lower, the mood has since stayed buoyant.\n\nFor the good times to continue, however, Material Indicators believes that BTC/USD must now tackle two trend lines, which have formed resistance for much of 2022.\n\nThese are the 50-week and 200-week moving averages (WMAs), with bulls failing to retest them thus far, let alone flip them to support.\n\nThe 50WMA and 200WMA currently stand at $25,345 and $24,837, respectively, data from Cointelegraph Markets Pro and TradingView confirms.\n\n“[BTC] must test key moving averages to confirm macro breakout or fakeout,” part of the commentary stated.\n\nAn accompanying chart showed the state of the Binance order book at the time, with resistance shifting higher to allow the spot price to rise with it. As Cointelegraph reported, this phenomenon had already been playing out prior to the Fed event.\n\nBTC/USD order book data (Binance) annotated chart. Source: Material Indicators/ Twitter\n\nContinuing, Material Indicators described the subsequent BTC price run-up as a “Herd of Bulls Stampede Through the Gate” in the absence of resistance pressure.\n\n“Whether it leads to the slaughterhouse or the auction house TBD at the 50WMA and 200WMA,” it added.\n\n“Toppy signs” and “wild cards”\n\nCurrently, BTC/USD has spent longer than ever below the 200WMA, a key aspect of its 2022 bear market, which singled it out from others in its history.\n\nRelated: Best January since 2013? 5 things to know in Bitcoin this week\n\nFurthermore, the two WMAs in focus are forming what is known as a “death cross,” where the falling 50WMA crosses under the 200WMA.\n\nShould this play out, analysts fear that it may engender fresh downside, as was previously the case with events on lower timeframes,\n\n“No doubt risk assets have been correlated, but BTC outperformed TradFi in January with a 40% rally,” Material Indicators co-founder, Keith Alan, commented prior to the Fed.\n\n“Now, SPX has a triple top on the Monthly and BTC is headed for a Death Cross on the Weekly. These are toppy signs, but the FED, FANG and labor market are dealing wild cards.”\n\nBTC/USD 1-week candle chart (Bitstamp) with 50, 200MA. Source: TradingView\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNic25ld3MuY29tL25ld3Mvam9obi1taWNoYWVsLW11c2JhY2gtYWRtaXRzLXBheWluZy1oaXQtbWFuLTIwMDAwLWJpdGNvaW4tdG8ta2lsbC0xNC15ZWFyLW9sZC1jaGlsZC1uZXctamVyc2V5L9IBf2h0dHBzOi8vd3d3LmNic25ld3MuY29tL2FtcC9uZXdzL2pvaG4tbWljaGFlbC1tdXNiYWNoLWFkbWl0cy1wYXlpbmctaGl0LW1hbi0yMDAwMC1iaXRjb2luLXRvLWtpbGwtMTQteWVhci1vbGQtY2hpbGQtbmV3LWplcnNleS8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "John Michael Musbach of New Jersey admits to paying hit man $20,000 in bitcoin to kill 14-year-old child, prosecutors say - CBS News",
        "content": "A New Jersey man admitted to paying $20,000 in cryptocurrency to have a 14-year-old child murdered, according to a news release from the Department of Justice on Thursday.\n\nJohn Michael Musbach, 31, pleaded guilty to an indictment charging him with one count of \"knowingly and intentionally using and causing another to use a facility of interstate and foreign commerce, that is the internet, with the intent that a murder be committed,\" according to the news release.\n\nMusbach is a resident of Haddonfield, N.J., but lived in Atlantic County when he first made contact with the unidentified victim, prosecutors say. The victim lived in New York at the time.\n\nMusbach exchanged sexually explicit photos and videos with the victim in the summer of 2015, the DOJ said, and the victim's parents called police when they found out about the \"inappropriate contact.\" New York law enforcement officers identified Musbach as an Atlantic County resident and contacted the Atlantic County Prosecutor's Office (ACPO). In March 2016, ACPO officers arrested Musbach on child pornography charges, the DOJ said.\n\nAfter Musbach was arrested, he \"decided to have the victim killed so the victim could not testify against him in the pending criminal case,\" prosecutors allege. During a two-week period in May 2016, Musbach \"repeatedly communicated\" with the administrator of a murder-for-hire website on the dark net, the DOJ said. The website, which was not named by the DOJ, purported to offer contract killings or other violent acts in return for cryptocurrency payments.\n\nMusbach allegedly arranged for a murder-to-hire and asked the purported hit man if \"a 14-year-old was too young to target.\" Prosecutors say Musbach then paid $20,000 in bitcoin for the hit. After Musbach asked the website's administrator for more details about the hit and when it would occur, he was pressed for an additional $5,000, the DOJ said.\n\nWhen Musbach then tried to cancel the hit, the website administrator revealed the \"website was a scam,\" and threatened to reveal Musbach's information to law enforcement, prosecutors said.\n\nThe DOJ did not say if it was the website administrator who made authorities aware of Musbach's murder-for-hire plot.\n\nThe charge of use of interstate commerce facilities in the commission of murder-for-hire carries a maximum sentence of 10 years in prison and a fine of at least $250,000, the DOJ said. Musbach is scheduled to be sentenced on June 13."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wMi0wMi9jYXRoaWUtd29vZC1vbi1kZWZsYXRpb24tcmlzay10ZWNoLXN0b2Nrcy1hbmQtYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Cathie Wood on Deflation Risk, Tech Stocks and Bitcoin - Bloomberg",
        "content": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZGVjcnlwdC5jby8xMjA0NjYvbmZ0cy1vbi1iaXRjb2luLW9yZGluYWxzLWNvdW50ZXJwYXJ0eS1zdGFja3PSAUxodHRwczovL2RlY3J5cHQuY28vMTIwNDY2L25mdHMtb24tYml0Y29pbi1vcmRpbmFscy1jb3VudGVycGFydHktc3RhY2tzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "‘Bitcoin NFTs’ Aren’t New, But Blockchain Purists Are Now on the Defensive - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFor nearly a decade, creators have enlisted sidechain or layer-2 solutions to link digital art to the Bitcoin blockchain. But how this is accomplished—or whether it should even be done—has Crypto Twitter up in arms after new project Ordinals developed a way to add digital items to on-chain Bitcoin transactions.\n\nNFT are blockchain tokens that can serve as a proof of ownership for assets, including digital goods like artwork, videos, music files, and memberships. While blockchains like Ethereum and Solana are synonymous with NFTs and digital collectibles, many Bitcoin developers have sought ways to bring them to the quintessential blockchain.\n\nOne issue hampering the development of NFTs on Bitcoin is the need for smart contracts. In the minting process, NFTs use smart contracts to assign ownership of the digital asset in the NFT. The smart contract updates the ownership when the NFT is bought or sold.\n\nAD\n\nAD\n\nBitcoin has only limited smart contract support.\n\nTo address this, earlier projects like Counterparty and Stacks developed alternative solutions that use a native token for the contract piece but ultimately settle their transactions back on the Bitcoin blockchain.\n\nEarlier examples\n\nIn 2014, Counterparty launched the first layer-2 solution for digital assets using the Bitcoin blockchain. Counterparty, which provides the infrastructure for users to create unique tokens on the Bitcoin blockchain, saw its XCP token hit an all-time high above $91 in 2018, but it has fallen about 97% since.\n\nAlthough surpassed by Ethereum and other popular NFT chains in recent years, Counterparty still has an active community of supporters—and its assets can be bridged to Ethereum. More importantly, Counterparty is best known as the home for historical assets like Rare Pepes, which still command significant sums on secondary markets. In April 2022, an NFT containing the opening theme to Larry David’s “Curb Your Enthusiasm” was minted using Counterparty.\n\nLaunched in 2017 as Blockstacks, Stacks (as it’s now known) is a blockchain network that can run smart contracts and rolls up all of its transactions before settling them on Bitcoin. Stacks says it doesn’t use a sidechain or layer-2 model, but founder Muneeb Ali told Decrypt in 2021 that he refers to it as “a layer 1.5” built on top of Bitcoin.\n\nAD\n\nAD\n\nThe STX token hit a peak above $3 in December 2021, according to CoinGecko, as its NFTs started to attract the Bitcoin faithful, and in February 2022, an NFT collection called Satoshibles launched a cross-bridge to send NFTs to the Ethereum network. Broadly, however, Stacks has not developed an especially active or valuable NFT market.\n\nWhat's Ordinals?\n\nThe most recent example of Bitcoin NFTs is Ordinals, and it takes a different approach. Launched in January, Ordinals aims to add NFT-like assets directly onto the Bitcoin blockchain.\n\nDesigned by Casey Rodarmor, a former Bitcoin Core contributor, Ordinals enables users to explore, transfer, and receive individual satoshis (the smallest unit of Bitcoin, or 1/100,000,000 of a BTC), which may include data such as videos and images. Adding assets to individual satoshis is called inscription, which is stored in a Bitcoin transaction’s signature.\n\nThe idea of filling Bitcoin blocks with JPEGs and videos—or even playable video games—isn’t sitting well with some in the Bitcoin community who have voiced concerns that putting NFTs directly on the Bitcoin network will drive up transaction costs.\n\nMarginalized peoples in developing countries will have to pay more to run their Bitcoin nodes and send transactions because privileged wealthy whites want to put JPEG drawings on the blockchain as status symbols. Just because you can doesn’t mean you should. — Bitcoin is Saving (@BitcoinIsSaving) January 29, 2023\n\nDespite the controversy, Ordinals brings the quest for NFTs on Bitcoin closer than ever, as it does not require a sidechain or layer-2 solution (or similar) or an additional cryptocurrency to work.\n\nBitcoin remains the top cryptocurrency by market cap, but as Ordinals and past examples show, some developers are still trying to use its decentralized network to power new use cases."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aHktYXJlLWJpdGNvaW4tYW5kLWNyeXB0by1wdW1waW5nLWFmdGVyLXRoZS1mZWQtbWVldGluZy13YXRjaC1tYXJrZXQtdGFsa3MtbGl2ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Why are Bitcoin and crypto pumping after the Fed meeting? Watch Market Talks live - Cointelegraph",
        "content": "In this week’s episode of Market Talks, Cointelegraph welcomes Budd White, chief product officer and co-founder of Tacen, a United States-based software company developing compliance software for a well-regulated crypto space.\n\nTo kick things off, we get to know White a little better and find out his background and what drew him to the space. We also find out what he’s looking forward to the most this year in the crypto market and how 2023 is going to differ from 2022.\n\nThe big question on everyone’s minds is What will be the catalyst that brings institutional investors back into the crypto markets, and how can they avoid the same risks that crippled them before? Are regulations the answer?\n\nSeveral cryptocurrency exchanges have come under regulatory fire recently. It might only be a matter of time before Binance gets some confrontation from high-level enforcement agencies. Keeping this in mind, we ask White what trends he sees emerging with centralized exchanges in the near future.\n\nWe dive into the topic of regulation and what role it should play in crypto, especially within centralized exchanges and decentralized finance (DeFi).\n\nGot an idea for a nonfungible token project but no experience in programming, smart contracts or anything related to crypto? Don’t worry, we ask White what the best way to launch your collection on OpenSea safely is. There might be a pro tip in there for you as well, so make sure you’re paying attention.\n\nMake sure to stay tuned until the end to get all of these insights and more. Cointelegraph will also be taking your questions and comments throughout the show, so be sure to have them ready to go.\n\nMarket Talks streams live every Thursday at 12:00 pm ET (5:00 pm UTC). Each week, it features interviews with some of the most influential and inspiring people from the crypto and blockchain industry. So, be sure to head on over to Cointelegraph’s YouTube page and smash those Like and Subscribe buttons for all our future videos and updates."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tbWFya2V0LWNhcC1qdW1wcy00MGItYXMtZmVkLWNoYWlyLXBvd2VsbC1oaW50cy1hdC1kaXNpbmZsYXRpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin spikes above $24K as Fed chair Powell talks of 'disinflation' - Cointelegraph",
        "content": "The price of Bitcoin (BTC) broke through the $24,000 ceiling and the total crypto market cap jumped nearly 4% after United States Federal Reserve Chair Jerome Powell indicated that inflation had begun slowing down in the world’s largest economy.\n\n“We can now say, I think for the first time, that the disinflationary process has started […] we see it really in goods prices,” said Powell during a Feb. 1 Federal Open Market Committee press briefing shortly after announcing an interest rate hike of 25 basis points.\n\nThe rate hike and Powell’s remarks appeared to have gone down well in the crypto markets, which had been trading sideways in the lead-up to the speech but saw market cap increase by over $40 billion in the hours after the announcement.\n\nCryptocurrency market capitalization from Feb. 1 to Feb. 2. Source: CoinMarketCap\n\nThe global crypto market cap is now at $1.09 trillion, up 3.88% over the last day, according to the latest figures from Coinmarketcap.\n\nMeanwhile, BTC tipped slightly over $24,000 for the first time in 2023, reaching $24,161.27 according to Coinmarketcap.\n\nRelated: Bitcoin bulls plan to flip $23K to support by aiming to win this week’s $1B options expiry\n\nThat being said, Powell said they still expect inflation to continue rising in the services sector for some time and to be prepared for “ongoing rate rises.”\n\n“We see ourselves as having more persistent inflation in that [services] sector, which will take longer to get down, and we have to complete the job. That’s what we’re here for.”\n\nPowell noted that “ongoing rate rises” would still be appropriate as the Federal Reserve attempts to bring inflation back to its 2% target level.\n\nIt should be noted that disinflation refers to a slowdown in the rate of increase of general price levels, as opposed to deflation, where the general price level of goods and services decreases."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXBhaW50cy1uYXNkYXEtZ3JlZW4tYXMtbmNpLWluZGV4LW1hcmtzLTM4LWdhaW4taW4tamFudWFyedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin paints Nasdaq green as NCI index marks 38% gain in January - Cointelegraph",
        "content": "Bitcoin’s (BTC) bullish surge in January has helped the Nasdaq Crypto Index to register its third-highest monthly gain, with a 38% surge. The cryptocurrency market started the year bullish, defying major bearish market outlooks. Bitcoin and a number of altcoins touched new multi-month highs as inflation cooled off.\n\nNasdaq Crypto Index monthly price chart Source: Google\n\nThe Nasdaq Crypto Index (NCI) recorded its third-biggest monthly gain since its inception in February 2021. The crypto asset index was launched by Brazilian asset manager Hashdex in partnership with the Nasdaq stock exchange. The index consists of eight cryptocurrencies: Bitcoin, Ether (ETH), Bitcoin Cash (BCH), Litecoin (LTC), Chainlink (LINK), and Stellar (XLM), among a few others.\n\nBTC has the highest weight in the index (69.8%), followed by ETH (27.08%). The other altcoins have a weight of less than 1%. Thus, the subsequent rise of BTC and ETH, which have surged over 35% in the past month, is also reflected in the index. The index weight refers to the share of stocks invested in a particular digital asset.\n\nRelated: Bitcoin bulls must reclaim these 2 levels as 'death cross' still looms\n\nWith a prolonged crypto winter throughout 2022, Bitcoin ended the year at around $16,500, with most altcoins also testing their yearly lows. Many market pundits had warned that the bearish sentiment might continue into the new year owing to the FTX saga unfolding daily. However, the crypto market showed resilience and started the year on a bullish note, registering a double-digit gain for the past month.\n\nOn Feb. 1, the Federal Open Market Committee press briefing announced an interest rate hike of 25 basis points. The United States Federal Reserve Chair, Jerome Powell, suggested that inflation has started to cool off in the world’s largest economy. The Fed raise worked wonders for the crypto market, with BTC briefly touching $24,000 and the crypto market cap rising by 4%."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tYXJhdGhvbi1zLWZpcnN0LWJpdGNvaW4tc2FsZS1pbi0yLXllYXJzLW5vdC10aGUtcmVzdWx0LW9mLWRpc3RyZXNz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Marathon's first Bitcoin sale in 2 years not the result of distress - Cointelegraph",
        "content": "The second largest publicly-listed holder of Bitcoin, crypto mining firm Marathon Digital Holdings has offloaded some of its Bitcoin (BTC) for the first time in two years.\n\nA spokesman told Cointelegraph this was not a result of financial distress.\n\nAccording to an update posted on Feb. 2, the company disclosed that during January it sold 1,500 BTC, worth $35.3 million at current prices.\n\nWhile some crypto miners have been forced to sell Bitcoin due to distress, Marathon vice president of corporate communications Charlie Schumacher said this was not the case for Marathon.\n\nMarathon Digital's Bitcoin Mining Data Center in Hardin, Montana. Source: Marathon Digital\n\nSchumacher said that Marathon had been diamond-handing its Bitcoin until now, as the firm didn’t want to sell while production was down, and has been bullish on the long-term prospects of the leading cryptocurrency.\n\nBut coming into the new year, Marathon wants to have a “war-chest” of liquidity composed of both cash and Bitcoin and is looking to continue paying down debt and increase its cash positions.\n\nSchumacher also noted that Bitcoin’s recent uptick in price contributed to the decision to sell some of its holdings.\n\nJanuary saw Bitcoin rise above the $24,000 price level for the first time since August.\n\nEven after the sale, Marathon managed to increase its unrestricted Bitcoin holdings in the month to 8,090 BTC ($189.8 million).\n\nOperational highlights from Marathon’s latest update. Source: Marathon Digital Holdings\n\nMarathon said it also had significantly ramped up Bitcoin production throughout January, producing 687 BTC, which represents an increase of 45% compared to the month prior. In the update, Marathon chairman and CEO Fred Thiel noted:\n\n“The improvement in our bitcoin production was primarily a result of our team’s ability to work in tandem with the new hosting provider in McCamey, Texas, to address the maintenance and technical issues at the King Mountain data center that had suppressed our bitcoin production in the fourth quarter of 2022.\"\n\nLast year, Marathon noted in a May 4 update that the last time it had sold any Bitcoin was on Oct. 21, 2020, and has been hodling since then.\n\nWhen asked how it had managed to avoid selling the main product of its business operations, Schumacher pointed to the firm’s low headcount, consisting of “32 people as of today,” and suggested it was a result of sound long-term financial strategies.\n\nRelated: Bitcoin price is up, but BTC mining stocks could remain vulnerable throughout 2023\n\nMarathon is the second-biggest publicly listed holder of Bitcoin according to CoinGecko, beaten only by software analytics company MicroStrategy. It has recorded a significant boost in its share price in recent days, with MARA stock rising 135% so far this year to $8, according to MarketWatch."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmxlZGdlci5jb20vYWNhZGVteS9zZXJpZXMvbGVkZ2VyLWhvdy10b3MvaG93LXRvLXNlbGwtY3J5cHRvLXdpdGgtbGVkZ2Vy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "How to Sell Crypto with Ledger - Ledger",
        "content": "How to Sell Crypto with Ledger\n\nWatch 2 min Beginner\n\nSHARE\n\nThis is a step-by-step guide to converting your crypto back to fiat (dollars, euros & more) securely using your Ledger device and Ledger Live.\n\nINTRODUCTION\n\nHi there, let’s talk about selling your coins through Ledger Live with our partner Coinify. Right now, you can only sell Bitcoin through Ledger Live. So, that’s what we’ll show you today, but don’t worry, we’ll be adding more options soon.\n\nOPEN LEDGER LIVE\n\nSo, let’s start by opening Ledger Live, connecting your Nano to your computer and unlocking it with your PIN. Then, check the ‘Apps Installed’ tab to make sure you have the Bitcoin app and the Exchange app. If either is missing, just go to the App Catalog and install it.\n\nSELECT SELL\n\nIf both apps are already installed, click on ‘Buy/Sell’ on the menu to the left. Then, click on ‘Sell’ at the top of the page. Click ‘Choose a Crypto Asset’ and select Bitcoin. Then, use the second drop-down to choose the accounts you wish to sell from, and click ‘Continue’. Here, we have the ‘Get Started’ page, where you enter the amount of Bitcoin you wish to sell in the top box. As you’re doing that, pay attention to Coinify’s minimum and maximum limits, and adjust as needed. Once you’ve entered your amount, choose the currency you’d like to receive, and you’ll see a quote in the ‘You Get’ box. Every quote is good for 15 minutes. And if you go over time, you’ll just refresh and do it again. Now, click the ‘Sell Now’ button, where you either log into an existing Coinify account, or create a new one.\n\nCOMPLETE KYC IF THIS IS YOUR FIRST TIME ON COINIFY\n\nIf you’re creating a new one, then complete the KYC steps, and resume the sale once you’ve verified. If you already have one, then you’ll just proceed.\n\nCONFIRM BANK DETAILS\n\nLet’s say you’re set up with Coinify, click ‘Continue’, so they can check for a bank account, and have you add one, if needed. Once you’ve added or chosen a bank account, you’ll return to the order page. If you’re okay with the numbers on the screen, then agree to the terms and conditions, and click the ‘Confirm Order’ button.\n\nCONFIRM TRANSACTION ON YOUR NANO\n\nOpen the Exchange app on your Nano when prompted, scroll through the details until you see ‘Accept and Send’. If all looks well, press both buttons and return to the app. Now, click, close down and continue to get your order summary. And check your email inbox for updates from Coinify. That’s it, sale complete. Selling is the same on all Nanos, so you’ll never have to re-learn it. And if you have questions, or if you’re ready to learn more, check out the other tutorials at the Help Center. And, as always, stay safe on your crypto journey, see ya!"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aHktZGlkLWJpdGNvaW4tcHJpY2UtZ28tZG93bi10b2RheS1idGMtdHJhZGVycy1icmFjZS1mb3ItMjNrLXJldGVzdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Why did Bitcoin price go down today? BTC traders brace for $23K retest - Cointelegraph",
        "content": "Bitcoin (BTC) headed toward $23,000 on Feb. 3, after a night of losses erased bulls’ latest progress.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nDollar rebound halts crypto party\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD hitting lows of $23,329 on Bitstamp.\n\nThe pair had come off a second trip above the $24,000 mark at the Feb. 2 Wall Street open, with buyers failing to sustain momentum amid macro market volatility.\n\nIn classic style for interest rate announcements by the United States Federal Reserve, an initial move was soon countered, with Bitcoin returning to its prior position.\n\nU.S. Dollar Index (DXY) 1-hour candle chart. Source: TradingView\n\nConditions worsened thanks to a rebound in U.S. dollar strength, with the U.S. Dollar Index (DXY) putting in a conspicuous bounce, which began to consolidate on the day.\n\n“Once the DXY dollar finds support and begins to bounce hard, then we will see pullbacks on our Crypto bags,” popular trader Crypto Tony warned.\n\n“Time to pay attention.”\n\nCointelegraph contributor Michaël van de Poppe eyed a level of 102 for DXY to spark inversely-correlated drops across risk assets.\n\n“I do expect it’s likely DXY will retest what was support and now overhead resistance,” Matthew Dixon, founder and CEO of crypto rating platform Evai, continued in his own analysis.\n\n“This would align with my inverse expectation on Btc and Crypto moving down a touch before a final ‘blowoff’ high (not much higher imo).”\n\nU.S. Dollar Index (DXY) annotated chart. Source: Matthew Dixon/ Twitter\n\nCPI presents fresh worry\n\nMacro-induced price pressure could linger through February, some believe.\n\nRelated: Bitcoin bulls must reclaim these 2 levels as ‘death cross’ still looms\n\nIn its latest market update sent to Telegram channel subscribers, trading firm QCP Capital drew particular attention to the next U.S. Consumer Price Index (CPI) print, set for release on Feb. 14.\n\n“Post-FOMC, we have a heap of 2nd tier data releases including the important ISM services and NFP. However the decider will be the Valentine's Day CPI - and we think there are upside risks to that release,” it stated.\n\n“Firstly, the Cleveland Fed’s inflation Nowcast is showing >0.6% print for Jan, even if it has overstated inflation the past few months.”\n\nDue to a change in the way CPI is calibrated, QCP suspected that forthcoming numbers in 2023 could be higher than the market expects. Whether psychological or not, the net impact could disappoint crypto bulls.\n\n“In Europe, a similar reweight has led to a surge in the January CPI released this week. Hence, we expect downside risks to materialize from here - either at this meeting, or after the next CPI release,” QCP added.\n\nAccording to data from CME Group’s FedWatch Tool, meanwhile, the consensus remained firm over the next rate hike in mid-March being identical to the February one at 25 basis points.\n\nFed target rate probabilities chart. Source: CME Group\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8yMGstYml0Y29pbi1tYXktcmV0dXJuLXNheXMtYW5hbHlzdC1hcy11cy11bmVtcGxveW1lbnQtaGl0cy01NC15ZWFyLWxvd9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "$20K Bitcoin may return, says analyst as US unemployment hits 54-year low - Cointelegraph",
        "content": "Bitcoin (BTC) fell prior to the Feb. 3 Wall Street open as fresh United States economic data came in “hot hot hot.”\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\n“Think again” over U.S. recession\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it erased gains from earlier in the day to center on $23,000 support.\n\nThe pair reacted negatively to U.S. unemployment data for January, which beat expectations so considerably that overall jobless figures fell to their lowest since 1969.\n\nNon-farm payrolls (NFP) data likewise outperformed, while average hourly earnings conformed to forecast 0.3% growth.\n\n“HUGE beat in NFP,” popular analytics account Tedtalksmacro responded on Twitter.\n\nReturning to predictions from the day prior, Tedtalksmacro eyed a potential opportunity to increase Bitcoin exposure, given the latest come-down, which it said could take BTC/USD all the way to $20,000.\n\n“An opportunity to reload on this news, potentially,” a further tweet added.\n\nBitcoin’s cold feet come from the implication that a stronger-than-forecast labor market allows the Federal Reserve to maintain tighter, less liquid monetary conditions for a longer period of time.\n\n“US economy sliding into a recession? Well, think again. At least not in the near term,” economist and analyst Jan Wüstenfeld continued.\n\nU.S. civilian unemployment rate chart. Source: Bureau of Labor Statistics\n\n$25,000 Bitcoin now “crowded trade”\n\nAs Cointelegraph reported, the Fed raised interest rates by 0.25% this week, in line with almost all expectations, while Chair Jerome Powell caused excitement by using the term “disinflation” in accompanying comments.\n\nRelated: Bitcoin bulls must reclaim these 2 levels as ‘death cross’ still looms\n\nBTC/USD thus spiked above $24,000 for the second time in as many days, with market participants still hopeful of a trip to $25,000 before a more significant retracement.\n\n“BTC has had a clean breakout above its macro downtrend line + a backtest,” investment research resource Game of Trades stated.\n\n“The next big resistance to clear is the $25k region.”\n\nBTC/USD annotated chart. Source: Game of Trades/Twitter\n\nPopular trader Crypto Tony nonetheless acknowledged that that target may no longer materialize.\n\n“$25,000 is my main target, but I am seeing now a lot of people asking for this, and is becoming a crowded trade,” he wrote in part of a fresh update on the day.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vZGFpbHljb2luLmNvbS9iaXRjb2luLXdoYXQtdG8tZXhwZWN0LWluLXRoZS1zaG9ydC1hbmQtbG9uZy10ZXJtL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin: What to Expect in the Short and Long Term - DailyCoin",
        "content": "Bitcoin has had a great start to 2023, from starting at $16,000 and surging back above $21,000 in January to greeting February with a brief visit above $24,000. Is the positive trend set to continue?\n\nThe price of Bitcoin has fluctuated around the $23,000 level since the beginning of the month, currently serving as a temporary base with multiple support and resistance levels. The cryptocurrency market is highly volatile and prices can deviate significantly from these levels. Thus, this analysis should only be viewed as a guideline rather than a definite prediction."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXMtYmlnLW1vbnRoLWRpZC11cy1pbnN0aXR1dGlvbnMtcHJldmFpbC1vdmVyLWFzaWFuLXJldGFpbC10cmFkZXJz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin's big month: Did US institutions prevail over Asian retail traders? - Cointelegraph",
        "content": "Bitcoin experienced the second-strongest January in its history — and the best since 2013 — rising nearly 40% amid wide reports that institutional investors were back on board.\n\nZhong Yang Chan, head of research at CoinGecko, told Cointelegraph that there were “net institutional inflows into digital asset funds in January 2023, particularly in the last two weeks, with Bitcoin the largest beneficiary.”\n\nMeanwhile, a Jan. 30 CoinShares blog noted that the total assets under management in digital asset investment products — a good gauge of institutional participation — had risen to $28 billion, led by Bitcoin (BTC), which was up 43% from November 2022’s low point in the current cycle.\n\nThe reasons for this bullishness varied depending on whom one asked, ranging from macro factors like a pause in inflation growth to more technical reasons like a squeeze on BTC short sellers. Elsewhere, a research report from Matrixport noted that institutional investors are “not giving up on crypto,” further suggesting that as much as 85% of Bitcoin buying in January was the result of U.S. institutional players. The cryptocurrency services provider added that many investors had used the U.S. Jan. 12 Consumer Price Index print “as a confirmation signal to buy Bitcoin and other crypto assets.”\n\nAlmost all gains were during U.S. market hours\n\nBut how did Matrixport come to attribute up to 85% of monthly BTC growth to U.S. institutional investors? As the Singapore-based firm explained in its recent market overview: “The most astonishing statistic is that almost all of the +40% year-to-date rally in Bitcoin has happened during US market hours. [...] That’s 85% of the Bitcoin move.” Matrixport continued:\n\n“We have always worked with the assumption that Asia is driven by retail investors, and the US is driven by institutional investors.”\n\nSo, if Bitcoin’s market price rises during U.S. market trading hours but falls during Asian trading hours, as seemed to be happening in January, can one assume that U.S. institutional investors were buying Bitcoin while Asian retail traders were selling it — a sort of yin-and-yang action? Apparently so. During U.S. trading hours, “institutions, aka ‘stable hands,’” were taking advantage of the dips, added Matrixport.\n\nRecent: State of play: Decentralized domain services reflect on industry progress\n\nIs this really what drove BTC’s price upward in January? “In my personal opinion, the assumption that Asian retail and U.S. institutional investors are two main drivers of net Bitcoin flows is valid,” Keone Hon, co-founder and CEO at Monad Labs — which developed the Monad blockchain — told Cointelegraph. There are other market participants, of course; but when looking at flows, “irregular ones” have the largest impact, continued Hon:\n\n“In the current market, institutional players represent a potentially new — or renewed — source of demand similar to early 2021. Meanwhile, on the retail side, Asia-centric exchanges like Binance, Bybit, Okex and Huobi represent a majority of spot volume and nearly all of the derivatives volume.”\n\nOthers, though, aren’t so sure. “There is no way to confirm that U.S. markets are driven by institutional investors and Asian markets are driven by retail players since we don’t have data related to the identity of traders,” Jacob Joseph, research analyst at CryptoCompare, told Cointelegraph.\n\nGranted, there is a “sentiment” or belief that large retail interest exists in Asia, “especially in Korea, as KRW represents the fourth-largest trading pair after USDT, BUSD and USD,” continued Joseph, but it can’t really be quantified.\n\nStill, he acknowledged that the Matrixport report was interesting, adding, “Our data shows that more than two-thirds of the BTC returns in January can be attributed to the U.S. market hours, and our historical hourly data also shows that an above-average volume is traded during these hours.”\n\nJustin d’Anethan, institutional sales director at the Amber Group — a Singapore-based digital asset firm — told Cointelegraph, “I don’t really have metrics to say whether 85% is on point or not.” He was inclined to see the January rally as broad and macro-driven, especially with inflation heading lower and expectations that the U.S. Federal Reserve won’t keep raising rates. He added:\n\n“You can see equities, gold, real estate, and, yes, crypto gaining. That’s probably driven by large institutions and smaller investors alike, especially when FOMO kicks in.”\n\nD’Anethan also looked at Coinbase’s recent premium index, “which is in the green but not massively. That’s typically a good metric to see if bigger American entities are on a shopping spree. Right now, it looks muted, positive, but probably just reallocating cash that was sitting on the sidelines.”\n\nJacob said that a better way to gauge U.S. institutional activity is to look at exchanges “that cater their services solely to them.” Along these lines, “CME Group, the largest institutional exchange in crypto, saw its monthly volume rise 59% in January,” while LMAX Digital, another institutional-focused exchange, “also saw its trading volumes rise 84.1%, higher than the average increase in trading volume on other exchanges.”\n\nThen, too, who’s to say Asian retail traders aren’t operating during U.S. market hours? Chan, for instance, acknowledged that while the markets “do tend to move more during U.S. hours,” CoinGecko believes that this is “more a reflection of the outsized influence that U.S. monetary policy currently has on the crypto market and broader financial markets. Traders are most active when they believe markets are volatile, and in the current environment, Asian traders may have also gravitated toward ‘Fed watching’ to catch potential market movements.”\n\nChris Kuiper, director of research at Fidelity Digital Assets, told Cointelegraph that there isn’t a single event or catalyst that one can point to, to explain Bitcoin’s recent price movement. But to him, “It’s not surprising given the conditions that have been forming — namely, the increasing amount of illiquid coins, coins that haven’t moved in over a year — and the continued outflow of coins from exchanges.” Both factors make for a lower supply of BTC “and create conditions ripe for higher moves.”\n\nKuiper also cited the futures and derivatives market as a factor in BTC’s climb, “with a large amount of shorts getting liquidated over the past few weeks.” D’Anethan, too, mentioned “short-sellers getting squeezed” as a possible driver. “In itself, it’s not a cause for [prices] going up, but when things do rise, it accelerates it.”\n\nLooking ahead\n\nBe that as it may, if one agrees that January held some promise for Bitcoin on the institutional front, can one necessarily assume that it will persist through 2023?\n\n“As the market gains clarity on which players avoided contagion, we’ll see an uptick in new entrants that were sidelined during the back half of last year, particularly as innovative custody agreements emerge to address the major pain points of the recent collapses,” David Wells, CEO of digital asset trading platform Enclave Markets, told Cointelegraph.\n\nRecent: What crypto hodlers should keep in mind as tax season approaches\n\nMore needs to be done to maintain institutional momentum, the executive stated. “To really attract institutional flow, crypto markets will need to build more sophisticated products that allow for proper hedging and risk management,” added Wells. He’s optimistic providers will rise to the challenge, however.\n\nIt appears that inflation may have peaked, and many expect the U.S. Fed and perhaps other central banks to slow the pace at which they tighten interest rates, said Kuiper. While that does not necessarily portend rising risk-asset prices, “institutions and other asset allocators in the longer-term may once again turn to Bitcoin if central banks ease aggressively as they have done in the past,” he concluded."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jb21tdW5pdHktbW9ja3MtY2hhcmxpZS1tdW5nZXItZm9yLWhpcy1vYnNlc3Npb24td2l0aC1jaGluYS1zLWJpdGNvaW4tYmFu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Community mocks Charlie Munger for his obsession with China's Bitcoin ban - Cointelegraph",
        "content": "The cryptocurrency community has ridiculed well-known Bitcoin (BTC) critic Charlie Munger, vice chairman of Berkshire Hathaway, for calling the United States to follow in the footsteps of China and ban crypto.\n\nIn an op-ed article in The Wall Street Journal, the 99-year-old investment veteran has once again slammed crypto, calling a cryptocurrency a “gambling contract with a nearly 100% edge for the house.”\n\nMunger also said that a cryptocurrency is “not a currency, not a commodity, and not a security,” adding that “obviously” the U.S. should enact a new federal law that would ban crypto.\n\nAccording to Munger, the best way to approach crypto is to follow the example of China, which put a blanket ban on crypto in September 2021. The Berkshire Hathaway vice chairman stated:\n\n“What should the U.S. do after a ban of cryptocurrencies is in place? Well, one more action might make sense: Thank the Chinese communist leader for his splendid example of uncommon sense.”\n\nThe community was quick to react to Munger’s latest anti-crypto arguments, with many expressing bewilderment about how measures like China’s crypto ban stack up with the United States’ proclamations that it supports freedom.\n\n“The battle lines are being drawn. Freedom or tyranny. Non-custodial wallets are the hill we can’t surrender,” NFT APE author Adam McBride wrote on Twitter.\n\nOthers also mocked Munger for not understanding that crypto is virtually unbannable. Indeed, even after “banning” crypto in 2021, China has continued to be the second-largest Bitcoin miner in the world, and possessing crypto is apparently still legal. Moreover, the idea of lifting the crypto ban has been floating around in China for a while.\n\nIt’s sad that Charlie munger believes he’s doing something by calling for a ban. Doesn’t understand it’s math and can’t be banned. Old age deteriorates critical thinking skills. — 941 (@level941) February 2, 2023\n\nGiven that Munger called cryptocurrency a “gambling contract,” it’s worth noting that gambling is legal under U.S. federal law, despite people losing significant money from it.\n\nRelated: EU lawmakers vote for more restrictive capital requirements on banks holding crypto\n\nAccording to data from the American Gaming Association, U.S. casinos and mobile gaming apps hit a record $54.93 billion in revenue during the first 11 months of 2022. The revenues came at the cost of Americans losing more money on gambling than ever before by the first quarter of 2022.\n\nMany European countries also allow at least some gambling, with about 420,000 British gamblers losing more than $2,000 per year.\n\nDespite casinos causing significant losses for investors, Europe and the U.S. have not followed in the footsteps of China, which banned most forms of gambling back in 1949."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjA3OTg2L2x1eG9yLW1pbmVzLWxhcmdlc3QtYml0Y29pbi1ibG9jay1ldmVyLWNvbnRhaW5zLXRhcHJvb3Qtd2l6YXJkLW5mdNIBamh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzIwNzk4Ni9sdXhvci1taW5lcy1sYXJnZXN0LWJpdGNvaW4tYmxvY2stZXZlci1jb250YWlucy10YXByb290LXdpemFyZC1uZnQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Luxor mines largest Bitcoin block ever, contains Taproot Wizard NFT - The Block",
        "content": "Bitcoin mining company Luxor mined the largest ever Bitcoin block on Feb. 1 in order to promote what seems to be a potential NFT collection.\n\nThe block contained an NFT based on the original \"magic internet money\" meme but featuring the name Taproot Wizards. The block was 3.96 MB in size, just shy of Bitcoin's 4 MB limit, and the NFT cost $209 in transaction fees (although potentially just paid to itself).\n\nThe NFT took advantage of the same discount used by NFT project Ordinals when placing extra text in the Bitcoin blockchain — something that was mostly introduced by Segwit in 2017 (but has been largely associated with Taproot due to a widely read blog post on the topic).\n\n\"Behold, the Taproot Wizard, untethered and freed from his bondage!\" said Luxor on Twitter. \"He refuses to be censored, he refuses to be silenced.\"\n\nThe NFT comes amidst a debate in the Bitcoin community over whether these NFTs are a reasonable use of the blockchain, or if they are spam and should be discouraged, or even eliminated. Luxor appears to be making the case that these belong on Bitcoin.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nUdi's brainchild?\n\nDigging into the project a bit more, it seems to be some sort of a collaboration between the mining company and well-known crypto developer Udi Wertheimer. A dedicated Discord server has been set up for the project where Wertheimer outlined the dilemma facing the community.\n\n\"Will you join the Keepers and try to revive the Curse? Or will you join the Taproot Wizards and storm the Gates?\" he said in the server.\n\nWertheimer added that the project's followers should stay tuned with updates to be posted in the Discord server — suggesting this may not be a one-off. On Twitter, he tweeted the NFT transaction and said, \"we do a lil magic.\""
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmxlZGdlci5jb20vYWNhZGVteS9zZXJpZXMvbGVkZ2VyLWhvdy10b3MvaG93LXRvLWJ1eS1jcnlwdG8tdGhyb3VnaC1sZWRnZXItbGl2ZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "How to Buy Crypto Through Ledger Live? - Ledger",
        "content": "How to Buy Crypto Through Ledger Live?\n\nWatch 4 min Beginner\n\nSHARE\n\nYou can now buy a wide array of cryptos directly through our Ledger Live app with our partner Moonpay. Discover how with our step-by-step video guide!\n\nSET UP IN LEDGER LIVE\n\nReady to buy some crypto? Let’s do it securely through Ledger Live with our partner Moonpay. To get started, open the Ledger Live app on your computer, connect your Nano, and unlock it with your PIN. Then decide which crypto you’d like to buy. Moonpay has dozens of options, but for this video we’ll go with Bitcoin (BTC). So head on over to the Portfolio tab and click “+Add account”. Select Bitcoin from the dropdown and click Continue, Ledger Live will install the Bitcoin app on your Nano. Your device needs the app to add a Bitcoin account to Ledger Live. Once your Bitcoin account has been added, navigate to the“Discover” tab on the left, then select Moonpay.\n\nENTER DETAILS IN MOONPAY\n\nEnter the amount in fiat you want to spend in the top bar and you’ll see an estimate of how much Bitcoin you’ll receive in the bottom bar. Then press Continue.” In the next step, select the Bitcoin account you just created. And Moonpay will prompt you to connect your Nano and confirm your Bitcoin address.\n\nVERIFY ADDRESS\n\nCarefully match the address on your computer to the address on your Nano then scroll right and use the buttons to approve. Click Continue. Now it’s time to check out. S\n\nSET UP IN LEDGER LIVE\n\nReady to buy some crypto? Let’s do it securely through Ledger Live with our partner Moonpay. To get started, open the Ledger Live app on your computer, connect your Nano, and unlock it with your PIN. Then decide which crypto you’d like to buy. Moonpay has dozens of options, but for this video we’ll go with Bitcoin (BTC). So head on over to the Portfolio tab and click “+Add account”. Select Bitcoin from the dropdown and click Continue, Ledger Live will install the Bitcoin app on your Nano. Your device needs the app to add a Bitcoin account to Ledger Live. Once your Bitcoin account has been added, navigate to the“Discover” tab on the left, then select Moonpay.\n\nENTER DETAILS IN MOONPAY\n\nEnter the amount in fiat you want to spend in the top bar and you’ll see an estimate of how much Bitcoin you’ll receive in the bottom bar. Then press Continue.” In the next step, select the Bitcoin account you just created. And Moonpay will prompt you to connect your Nano and confirm your Bitcoin address.\n\nVERIFY ADDRESS\n\nCarefully match the address on your computer to the address on your Nano then scroll right and use the buttons to approve. Click Continue. Now it’s time to check out.\n\nSTART PAYMENT PROCESS\n\nEnter your email and click Continue. Then check your inbox for a verification code from Moonpay. Type that into Moonpay in Ledger Live, agree to the terms and conditions by ticking the box, then click Continue. If this is your first time using Moonpay you’ll need to do a quick KYC check. Just pause this video here, complete the verification steps, and come right back. Now select a payment option. You can pay with either a bank card or with a bank transfer.\n\nCARD PAYMENT\n\nIf you choose to buy with a debit or credit card you’ll need to fill in your bank card details and confirm the transaction. This confirmation process may vary depending on the bank and card issuer, but it’s pretty intuitive so just follow the steps on your screen. Confirm your order by checking your card details and Bitcoin account one last time, tick the box that authorizes Moonpay to debit your card, then click Buy now. When you see “Processing transaction”, Moonpay is processing your order and will send you the BTC asap. You can also find your order details including the transaction cost and order ID, which you’ll need if you have to contact Moonpay’s customer service. That’s it for the bank card. You can close the app or leave it open until the BTC is delivered, and Moonpay will even send updates directly to your inbox. The whole transaction usually takes under 10 minutes. Once the BTC has reached your account it will show as delivered in the app.\n\nSTART PAYMENT PROCESS\n\nEnter your email and click Continue. Then check your inbox for a verification code from Moonpay. Type that into Moonpay in Ledger Live, agree to the terms and conditions by ticking the box, then click Continue. If this is your first time using Moonpay you’ll need to do a quick KYC check. Just pause this video here, complete the verification steps, and come right back. Now select a payment option. You can pay with either a bank card or with a bank transfer.\n\nCARD PAYMENT\n\nIf you choose to buy with a debit or credit card you’ll need to fill in your bank card details and confirm the transaction. This confirmation process may vary depending on the bank and card issuer, but it’s pretty intuitive so just follow the steps on your screen. Confirm your order by checking your card details and Bitcoin account one last time, tick the box that authorizes Moonpay to debit your card, then click Buy now. When you see “Processing transaction”, Moonpay is processing your order and will send you the BTC asap. You can also find your order details including the transaction cost and order ID, which you’ll need if you have to contact Moonpay’s customer service. That’s it for the bank card. You can close the app or leave it open until the BTC is delivered, and Moonpay will even send updates directly to your inbox. The whole transaction usually takes under 10 minutes. Once the BTC has reached your account it will show as delivered in the app."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiMmh0dHBzOi8vZGVjcnlwdC5jby8xMjA0NTkvd2lsbC1pdC1ydW4tZG9vbS1iaXRjb2lu0gE4aHR0cHM6Ly9kZWNyeXB0LmNvLzEyMDQ1OS93aWxsLWl0LXJ1bi1kb29tLWJpdGNvaW4_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin: Will It Run Doom? Kinda - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nWhat do eggplant emojis, porn, and video games have in common? They’re all now permanently inscribed on the Bitcoin blockchain.\n\nThis is probably not what Bitcoin creator Satoshi Nakamoto had in mind, but thanks to the Taproot upgrade and the controversial Ordinals project—which lets people store unique assets on it, akin to NFTs—you can now play an unofficial clone of the iconic 1993 first-person shooter Doom on the blockchain.\n\nCreated by Nicholas Carlini, the game is inscribed on Bitcoin as Inscription 466 and can be played with a keyboard and mouse. It’s a simplistic knockoff of Doom and doesn’t pack the gory, pixelated punch of the influential original, but it offers a taste of what’s possible through Ordinals. An enhanced version has since been inscribed.\n\nAD\n\nAD\n\nAnd just like that a new version of DOOM with improved gameplay has dropped on the BTC blockchain.https://t.co/1nGRo5krYR h/t @grandfreud https://t.co/6jVqCUrFIG — Hector Lopez (@hlopez_) February 2, 2023\n\nIt also adds a new layer to the ever-expanding “It Runs Doom” meme, in which people try to get the game working on nearly any gadget or device they can find—whether it’s an ATM, a fridge, a smartwatch, and plenty more. There’s even a subreddit devoted to the pursuit, followed by over 94,000 Reddit users.\n\nSo does Bitcoin run Doom? For now, the answer is: sort of.\n\nBitcoin is the original decentralized and permissionless blockchain—and the ability to store content on it makes it something of a unique historical record.\n\nThe Ordinal Theory Handbook argues that Bitcoin inscriptions like the Doom clone game are better than NFTs, which are unique blockchain tokens (typically ERC-721 tokens on Ethereum) that signify ownership over associated metadata that in many cases is stored off-chain in a centralized manner.\n\nAD\n\nAD\n\nEvery inscription on Bitcoin through Ordinals is labeled a “digital artifact,” because it is complete and decentralized in and of itself. It’s immutable, unlike most NFTs, whose metadata can be modified or even deleted by the creator.\n\nSince its launch in January, Ordinals has already caused quite the stir among the Bitcoin community, as maximalists and devotees have debated whether any content should be uploaded to Bitcoin at all.\n\nAs one might expect from the crypto “degen” community, much of what has been added to Bitcoin as inscriptions so far is something akin to digital graffiti. There are eggplant emojis and Bored Ape Yacht Club knockoffs, along with nudity, music, tweets, GIFs, Donald Trump memes, and even ads for the privacy chain Monero. Fun times."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vZWNvbm9teW1pZGRsZWVhc3QuY29tL25ld3MvYml0Y29pbi1mZWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin, other cryptos rally as Fed hikes interest rates again - Economy Middle East",
        "content": "As of press time, Bitcoin is trading at $23,420\n\nFollowing a quarter-point rate increase by the Federal Reserve, Bitcoin, and other cryptocurrencies increased along with other risky assets. Bitcoin jumped $700, moving above $23,600, as Federal Reserve Chair Jerome Powell suggested the US central bank is seeing signs of waning inflation. However, the world’s largest cryptocurrency by market capitalization headed toward $23,000 on Feb. 3 after a night of losses erased bulls’ latest progress. As of press time, Bitcoin is trading at $23,420.\n\nThe decision to raise rates further will depend on new economic data, noted Fed Chair Jerome Powell during a question-and-answer session with reporters. His comments caused the markets to rise.\n\nRead more: Fed raises interest rates by 25 basis points, Gulf central banks follow\n\nAs of press time, Ether (ETH), the native token of the Ethereum blockchain, was up 3 percent to $1,635 per token.\n\nCrypto-exposed stocks rose as well, with Coinbase (COIN) up 8 percent and Marathon Digital Holdings (MARA) up 7 percent.\n\nSmaller tokens Cardano and Polygon rose 5 percent and 10 percent respectively after the Fed’s release, after previously being down on the day.\n\nThe wider crypto space experienced a bullish month as well; NFT sales increased by 38 percent in the same month. However, crypto layoffs continue, with Chainalysis reducing its workforce by 5 percent.\n\nThe recent Federal Reserve’s statement added “nothing new to really move the markets,” according to CoinShares Head of Research James Butterfill. ” The Federal Reserve Chairman, Jerome Powell, “has tried to express hawkishness by stating that the job isn’t done,” he added.\n\nFor more on crypto, click here"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZGVjcnlwdC5jby8xMjA0NjgvYml0Y29pbi1oeXBlcmluZmxhdGlvbi1pbnN1cmFuY2UtcG9saWN5LWNhdGhpZS13b29k0gFTaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMDQ2OC9iaXRjb2luLWh5cGVyaW5mbGF0aW9uLWluc3VyYW5jZS1wb2xpY3ktY2F0aGllLXdvb2Q_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Is the Ultimate Insurance Policy: Cathie Wood - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin is the greatest form of defense against wealth confiscation and an insurance policy for the developing world, according to ARK Invest CEO Cathie Wood.\n\nThe investor—a longtime bull for the crypto industry—stands by her $1 million Bitcoin price target, believing the asset presents opportunities for wealth preservation to the rich and poor alike.\n\n“There’s hyperinflation all over the world as their currencies have fallen apart,” said Wood in an interview with Yahoo Finance on Thursday. “Those populations need a fallback—an insurance policy like Bitcoin.”\n\nAD\n\nAD\n\n“I’m struck that the market is now leading the Fed,” @ARKinvest Founder @CathieDWood says on bond market downtrends.https://t.co/DDNw4dbOPD pic.twitter.com/AAS0UWf0kh — Yahoo Finance (@YahooFinance) February 2, 2023\n\nWood believes that high-net-worth individuals also have much to gain by using Bitcoin as a shield against “confiscation” through inflation. The top cryptocurrency by market cap has a supply limit of 21 million coins, making it immune to debasement through money printing, as is common of fiat currencies.\n\nBut when it comes to defending against explicit confiscation in the “troubled” spots of the world like Russia and China, she says the asset can assist with that too.\n\nThough cryptocurrency users often store the keys to their coins using wallet hardware, their wallets are technically recoverable from anywhere if they can remember their unique seed phrase—usually a list of 12 to 24 random words.\n\n“Just keep that key in your head, and at some point, you’ll be able to cross a border and reclaim your wealth,” Wood added.\n\nAD\n\nAD\n\nWood’s flagship ARK Innovation fund had its best month ever in January, dating all the way back to its inception in 2014. It closed the month at $39.93 per share, up 28 since January.\n\nMuch of its gains were made on the backs of tech stocks including Tesla and Roku, which grew by 68% and 45% respectively. The firm’s crypto investments including Coinbase (COIN) and Grayscale Bitcoin Trust (GBTC) have also played a role, now up 142% and 67% year to date.\n\nGrayscale has failed thus far to transition its Bitcoin fund into a Bitcoin spot ETF—as have Cathie Wood’s attempts to launch a similar product in the United States."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1hcmtldC1zZW50aW1lbnQtbW9zdC1idWxsaXNoLTEwMDE1ODc3My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Market Sentiment Is Most Bullish in 14 Months With US Jobs Report Due - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nBitcoin (BTC) is currently priced significantly lower than it was in late 2021. Still, the mood in the market is as positive as it was back then.\n\nThat's the message from funding rates, a mechanism that keeps the prices of bitcoin perpetual futures contracts in sync with the spot market price. When perpetual futures are trading above spot, the funding rate is positive and holders of bullish long, or buy, positions pay bearish shorts to keep their trade open. The opposite happens when perpetuals trade below the spot price.\n\nAnalysts track the funding rate to gauge the mood of leverage traders. The higher the funding rate, the more excited traders are about price prospects and the more willing to pay a premium to keep their upside bets open.\n\nAs of Thursday, the annualized bitcoin perpetual funding rates across major exchanges including Binance was 8.491%, the highest since Dec. 3, 2021, according to data tracked by blockchain analytics firm Glassnode.\n\nBack then, one bitcoin was priced around $57,000, or 2.5 times the current market rate of $23,400. The cryptocurrency set a record high of $69,000 in November 2021.\n\nThe funding rate flipped positive in mid-December last year, indicating seller exhaustion. The cryptocurrency picked up a strong bid at the turn of the year and has rallied over 40% since then.\n\n\"There has been a clear shift in market sentiment post-[December) CPI with funding rates well into positive territory and price volatility on the rise,\" Dessislava Laneva, a research analyst at Paris-based crypto data provider Kaiko, said in a tweet referring to the U.S. consumer price index.\n\nThe CPI fell to 6.5% in December, the sixth straight monthly deceleration in price increases. The data convinced markets that the Federal Reserve was likely to pivot to liquidity-boosting interest rate cuts later this year.\n\nEarly this week, Fed Chair Jerome Powell acknowledged the inflation picture and downplayed concerns of a severe tightening-induced economic slowdown, bolstering the pivot hopes.\n\nStory continues\n\nFocus on US nonfarm payrolls\n\nThe U.S. nonfarm payrolls (NFP) report scheduled for release at 13:30 UTC is likely to show the world's biggest economy added 185,000 jobs in January following December's 223,000 increase, according to Reuters estimates sourced from FXStreet.\n\nThe unemployment rate is forecast to tick slightly higher to 3.6% in January, while average hourly earnings, or wage growth, is expected to print at 4.9% year on year following December's 4.6% rise.\n\nA notable increase in average hourly earnings, a proxy for potential inflation, coupled with the headline jobs figure might see investors reconsider the possibility of the Fed keeping interest rates higher for longer and scale back bullish positioning in risk assets, including cryptocurrencies.\n\n\n\n"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9uaWZ0eS1uZXdzLWJpdGNvaW4tbmZ0cy1jYXVzZS1zcGljeS1mZWVzLW1hc3RlcmNhcmQtZXhlYy10b2tlbml6ZXMtcmVzaWduYXRpb24tbGV0dGVyLWFuZC1tb3Jl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Nifty News: Bitcoin NFTs cause spicy fees, Mastercard exec tokenizes resignation letter and more - Cointelegraph",
        "content": "Bitcoin Ordinals cause fees to spike\n\nThe Bitcoin (BTC)-native Ordinals protocol is taking up record-breaking space on the blockchain and, in the process, hiking the transaction fees on the network.\n\nThe divisive newly launched protocol allows for nonfungible token (NFT) assets on the Bitcoin mainnet by inscribing satoshis with content.\n\nSo far, inscriptions have included content such as images, documents including a PDF file of the Bitcoin white paper and even a fully playable clone of the video game DOOM.\n\nThe 31.2 kilobyte DOOM clone (pictured) will now forever be playable on Bitcoin. Image: Ordinals\n\nOn Feb. 2, independent developer, Udi Wertheimer, tweeted he had conducted the “largest transaction in Bitcoin’s history” after using the Ordinals protocol to inscribe a 3.94-megabyte image of a sunglass-wearing, bald, bearded wizard lauding “magic internet JPEGs.”\n\nLast night, we made history\n\n\n\nThe gatekeepers tried to censor us\n\n\n\nBut we mined the LARGEST BLOCK and LARGEST TRANSACTION IN BITCOIN’S HISTORY\n\n\n\nSpecial thanks to bitcoin full node operators for supporting our efforts and hosting our 4MB NFT for all eternity!\n\n\n\ngm @TaprootWizards ‍♂️ pic.twitter.com/uKGG918af8 — Udi Wertheimer (@udiWertheimer) February 2, 2023\n\nThe data size of these inscribed transactions is much more than those typically conducted on the blockchain and, as a result, has driven up the fees associated with processing them.\n\nTypical Bitcoin transactions can cost a few cents to a few dollars, but Ordinals can cost tens of dollars in comparison.\n\nFigures from crypto-mining data provider Hashrate Index show over the past seven days, fees as a percentage of the block reward are on the rise, starting off the week at around 1% before jumping to a Feb. 1 weekly high of 6.74%.\n\nMastercard’s NFT lead quits on bad terms, sells resignation letter as NFT\n\nThe now-former NFT product lead at payments giant Mastercard left the company in a spectacular fashion, publicly slamming the firm for purportedly mistreating him and offering up his resignation letter as an NFT.\n\nIn a Feb. 2 Twitter thread, Satvik Sethi claimed Mastercard cut his salary by 40% when he moved from New York City to London, claiming he “had to work side jobs this past year to make ends meet.”\n\nI have resigned from @Mastercard.\n\n\n\nFor the past year, I served as the ‘NFT Product Lead.’ I evangelized Web3 for Mastercard leadership & regional teams, as well as all our Fortune 500 clients & partners.\n\n\n\nThis wasn’t easy but read on for why it was necessary, and what’s next : pic.twitter.com/kqiavsSIW7 — Satvik Sethi (@sxtvik) February 2, 2023\n\nHe claimed that at times he would not receive his salary “until I begged across the hierarchy for it.”\n\nSethi also alleged he was the victim of harassment “caused by a series of mismanaged processes, miscommunication [and] internal inefficiency.”\n\nHe asked his over 22,000 Twitter followers for their support by minting his resignation letter for 0.023 Ether (ETH), worth around $37.\n\n“100% of this goes to survival,” Sethi added as he will lose his British work visa and would “be based in India for the foreseeable future.” A future airdrop of art for holders of the NFT was also promised by Sethi.\n\nAt the time of writing 53 NFTs of the letter, which Sethi titled “New Beginnings,” had been minted.\n\nCointelegraph contacted Mastercard for comment regarding Sethi’s allegations but did not immediately receive a response.\n\neBay eyes talent for its acquired NFT marketplace\n\nE-commerce player eBay is looking to hire several Web3-related roles for its United Kingdom-based NFT marketplace KnownOrigin, which it acquired in June 2022.\n\nJob postings by eBay on LinkedIn revealed it is hiring for positions in the U.K. and at its headquarters in California.\n\nAmong the roles are a Manchester-based head of community for KnownOrigin and a content designer and marketing campaign executive for the marketplace, amongst other positions.\n\nThe firm is also hiring two California-based positions for a crypto counsel. The job description says the role will see a “creative crypto attorney” joining eBay’s legal team to support its “business, product, compliance and technology teams in the Web3 space.”\n\nOpenSea rolls out suite of tools for NFT creators\n\nNFT marketplace OpenSea released the next series of tools for its “Drops” feature, which is used to help creators launch NFT collections with OpenSea to benefit from its reach.\n\nIn a Feb. 2 Twitter thread, OpenSea said it had worked closely with 20 teams to “build a best-in-class drops experience.”\n\nWe’re excited to start rolling out the next phase ofDrops on OpenSeaa product we’ve been working on for the past few months! https://t.co/rRydH289Vq ⬇️ — OpenSea (@opensea) February 2, 2023\n\nThe next phase of the rollout includes giving creators tools to conduct multi-stage minting, smart contract deployment across multiple Ethereum Virtual Machine (EVM) chains and personalize web landing pages, among other features.\n\nThe tool will be “gradually opening up” to select creators “over the coming weeks,” according to OpenSea.\n\nIt will also add more features in the coming weeks before it’s released to the public at large.\n\nOpenSea has experimented with its Drops feature by creating personalized pages for select collections, most notably, one was created for the debut collection by actor Sir Anthony Hopkins which ended up selling out in under 10 minutes.\n\nOther Nifty News:\n\nJapanese Prime Minister, Fumio Kishida, said there are “various possibilities for using Web3” in the country. The government may use NFTs and decentralized autonomous organizations to promote its “Cool Japan” strategy, aiming to show off the nation’s tech and culture.\n\nCointelegraph spoke with industry professionals on preventing NFT thefts who advised users to take due diligence, revoke unnecessary permissions and segregate NFTs into different wallets, among other measures."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vbmV3LWplcnNleS1tYW4taGl0bWFuLWJpdGNvaW4tdGVlbi1ib3ktY2hpbGQtcG9ybm9ncmFwaHktMjAyMy0y0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "New Jersey Man Tried to Hire Hitman With Bitcoin to Kill 14-Year-Old - Business Insider",
        "content": "By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAccess your favorite topics in a personalized feed while you're on the go. download the app\n\nSign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview\n\nA New Jersey man has admitted he tried to hire a hitman for $20,000 in Bitcoin to kill a 14-year-old boy who was going to testify against him in a child-pornography case, according to the Department of Justice.\n\nJohn Michael Musbach, 31, from Haddonfield, New Jersey, pleaded guilty in federal court to hiring a hitman to carry out a murder, according to a release by the Department of Justice.\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nMusbach first encountered the boy in the summer of 2015 when the boy was 13 years old and living in New York with his parents, according to a criminal complaint filed in federal court. The complaint alleges that Musbach and the boy exchanged sexually explicit content with each other online, including videos of themselves masturbating.\n\nThe boy's parents found out and alerted the police, who started investigating Musbach, according to the complaint.\n\nAdvertisement\n\nProsecutors alleged in a court filing that police discovered Musbach had Google searched a variety of alarming queries, like \"child grooming law,\" \"death by chloroform,\" \"where to buy chloroform,\" \"how to buy a gun in NJ,\" and finally, searches on how to erase his search history.\n\nIn March of 2016, authorities arrested Musbach on child pornography charges, prosecutors said in the complaint.\n\nA few months after being arrested, Musbach then \"decided to have the victim killed so that the victim could not testify against him in the pending criminal case,\" the DOJ said in a statement released Thursday. The criminal complaint states that Musbach found a murder-for-hire website on the dark web and arranged to pay $20,000 worth of Bitcoin for the murder of the victim.\n\nThe murder-for-hire service advertised itself on its website, saying \"If you want to kill someone, or to beat the shit out of him, we are the right guys ... No undercover cops here. No risks of getting caught, because we are professional killers,\" according to the complaint.\n\nAdvertisement\n\nWhen Musbach asked if 14 years old was too young for the hit, the site administrator said \"14 years old is acceptable,\" according to the complaint.\n\nAfter paying up $20,000 in Bitcoin, Musbach then repeatedly messaged the service asking when the hit would be carried out, prosecutors said.\n\nEventually, the site administrator revealed that the site was a scam and threatened to turn Musbach in to law enforcement if he didn't turn over more money, according to the DOJ.\n\nMusbach allegedly responded, \"is this a joke?\"\n\nAdvertisement\n\nThe boy was never harmed, and the site did eventually turn Musbach over to authorities, prosecutors said. Musbach pleaded guilty to the murder-for-hire charges in court on Thursday, according to the DOJ.\n\nMusbach's lawyer, Rocco C. Cipparone, told Insider in a statement, \"Mr. Musbach decided to put this matter behind him without a trial, and accepted his responsibility.\"\n\nMusbach faces up to 10 years in prison when he is sentenced in June."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9maWF0LWlzLWluLWplb3BhcmR5LWJ1dC1iaXRjb2luLXN0YWJsZWNvaW5zLWFyZW4tdC10aGUtYW5zd2VyLWVpdGhlci1yYXktZGFsaW_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Fiat is in 'jeopardy' but Bitcoin, stablecoins aren't the answer either: Ray Dalio - Cointelegraph",
        "content": "Billionaire investor Ray Dalio has described fiat currency as being in serious “jeopardy” as an effective store of wealth but doesn’t believe Bitcoin (BTC) and stablecoins will be the solution either.\n\nThe founder of hedge fund firm Bridgewater Associates explained on CNBC’s Squawk Box on Feb. 2 that the mass money printing of the United States dollar and other reserve currencies has him questioning whether they are forms of “effective money.”\n\n“We are in a world in which money as we know it is in jeopardy. We are printing too much, and it’s not just the United States, it is all the reserve currencies.”\n\nHowever, Dalio was quick to add his thoughts on whether Bitcoin was a potential solution, acknowledging that despite what it has accomplished in “12 years,” it is still too volatile to serve as money:\n\n\"It's not going to be an effective money. It's not an effective store holder of wealth. It's not an effective medium of exchange,\" he argued.\n\nHe also dismissed stablecoins as an effective form of money, as they are replica of state-backed fiat currency.\n\nInstead, Dalio proposed the creation of an “inflation-linked coin” that would serve to ensure consumers secure their buying power.\n\n“The closest thing to that is an inflation index bond, but if you created a coin that says OK this is buying power that I know I can save in and put my money in over a period of time and transact in anywhere, I think that would be a good coin,” he said.\n\n\"#Bitcoin has no relation to anything. It's a tiny thing that gets disproportionate attention,\" says @RayDalio on #crypto. \"The value of $BTC is less than 1/3 of $MSFT stock. It's not an effective store of wealth. But we are in a world where money as we know it is in jeopardy.\" pic.twitter.com/Cc7o2TwkxG — Squawk Box (@SquawkCNBC) February 2, 2023\n\n“So I think you’re going to see the development of coins that you haven’t seen that probably will end up being attractive, viable coins. I don’t think Bitcoin is it,\" he added.\n\nHowever, not everyone agreed with Dalio’s take on Bitcoin and the viability of an inflation-linked coin.\n\nDigital asset manager Eric Weiss of Bitcoin for Family Officers was one, telling his 38,300 Twitter followers that such a coin could not exist:\n\n“According to Ray, [Bitcoin] is very close to being the solution to the world’s problems but it’s too volatile. He's waiting for and vaguely describes a solution that doesn’t and can’t exist,\" said Weiss.\n\nARK Invest CEO Cathie Wood also had a different view of Bitcoin, referring to it as a defense against wealth confiscation in parts of the developing world:\n\n“I’m struck that the market is now leading the Fed,” @ARKinvest Founder @CathieDWood says on bond market downtrends.https://t.co/DDNw4dbOPD pic.twitter.com/AAS0UWf0kh — Yahoo Finance (@YahooFinance) February 2, 2023\n\n“Those populations need a fallback, an insurance policy like Bitcoin,” she said.\n\nRelated: Crypto-friendly Ray Dalio steps back from Bridgewater’s $150M fund\n\nDalio’s latest views on Bitcoin come despite once having labeled it “one hell of an invention” that could serve as a viable inflation hedge. However, these remarks were made on Jan. 28, 2021 — before the current bear market took effect.\n\nThe billionaire investor has also previously recommended BTC should make up 1-2% of an investors portfolio on Jan. 6, 2022.\n\nAs an investment product, the hedge fund manager said back in May 2021 that he would rather buy BTC over bonds but stated a few months later that he still prefers gold.\n\nOn Oct. 4, Dalio stepped down as Bridgewater’s co-chief investment officer, but he remained on board as a mentor."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vZGVjcnlwdC5jby8xMjA1NzMvYml0Y29pbi1uZnQtbWludHMtcmlzaW5nLXRyYW5zYWN0aW9uLWZlZXPSAUlodHRwczovL2RlY3J5cHQuY28vMTIwNTczL2JpdGNvaW4tbmZ0LW1pbnRzLXJpc2luZy10cmFuc2FjdGlvbi1mZWVzP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin NFT Mints Are Rising—But So Are Transaction Fees - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOrdinals, a controversial new project that lets users put NFT-like media assets on the Bitcoin blockchain, is seeing surging activity this week. On Thursday, Ordinals recorded its largest number of single-day mints—but network fees are apparently growing as a result.\n\nMore than 1,000 total Bitcoin NFTs have been minted via Ordinals, according to public blockchain data curated by Dune, topping that total on Thursday as 420 new “inscriptions” were made on the blockchain. That’s more than three times the amount of NFTs minted on Bitcoin via the process on Wednesday.\n\nHowever, Thursday also marked the highest average transaction fee on Bitcoin in more than a month, landing at $1.53 worth of BTC per data from YCharts. That’s the highest it’s been since December 27, 2022\n\nAD\n\nAD\n\nImage: Dune Analytics\n\nThe launch of Ordinals revived the heated and long-standing debate in the Bitcoin space about block sizes, legitimate transactions, and whether JPEGs and other media should be inscribed on the original blockchain. Thanks to the Taproot upgrade, Ordinals has allowed anything from knock-off Bored Apes to video games to be added to the Bitcoin blockchain.\n\nNFTs are digital assets that are provably unique and linked to digital (and sometimes even physical) content like artwork, movies, and music files, and they can prove ownership of an item or membership in an exclusive group.\n\nWhile blockchains like Ethereum and Solana are synonymous with NFTs, the practice of committing digital assets to a blockchain network has existed on Bitcoin since 2014, with projects like Counterparty and Stacks leading the way.\n\ntl;dr after digging into the Ordinals \"spam\" debacle: 1) This has been possible since SegWit\n\n2) Taproot didn't enable this, it just made it (very) slightly easier and cheaper\n\n3) Prepare for the FUD as proponents of Bitcoin's early ossification try to weaponize this w/o nuance — Seth For Privacy (@sethforprivacy) February 3, 2023\n\nRising transaction fees are an apparent side effect of adding NFTs to Bitcoin’s mainnet. Bitcoin transaction fees are determined by the volume of data in the transaction and the speed at which the user wants their transaction completed. Users who want their transactions to go through during periods of high traffic can decide to pay more fees to push their transactions through.\n\nAD\n\nAD\n\nOn January 21, when Ordinals launched, Bitcoin transaction fees topped out at 2.10% as a percentage of the block reward for miners—but on January 24, Bitcoin fees topped out at 3.44%, according to data from Hashrate Index. On Thursday, that figure reached 3.86%.\n\nA closer look at the Hashrate Index data shows that the percentage is spiking at times during the day, including to a mark of nearly 8% late Friday afternoon. However, the overall daily average has thus far landed at a much lower number amid the rise of Ordinals.\n\nThe increase in transaction fees has led some Bitcoin maximalists to call Ordinals an affront to the Bitcoin ethos. Others say the project allows the spamming of the decentralized network.\n\nWe can have NFTs and collectables on Bitcoin without spamming/attacking the network. Taproot actually makes this even easier; the \"tapscript\" could be a new kind that refers to a torrent magnet instead of a script, and the spend on-chain doesn't need to add any data. — @LukeDashjr@BitcoinHackers.org on Mastodon (@LukeDashjr) February 3, 2023\n\nIt's sentiment that Ordinals developer Casey Rodarmor does not share. He told Decrypt on Monday that Bitcoin blocks need to be full to give users a reason to pay more than the minimum fee.\n\n“If blocks are not full, then nobody has any reason to pay more than the minimum fee rate to have their transactions included in a block,” he said. “So as a result, blocks must be full.\"\n\nHe further explained that while he's keen on full Bitcoin blocks, he does not support increasing the size of the blocks. \"I wouldn’t advocate to raise the block size,” he affirmed.\n\nEven so, Ordinals are apparently affecting how people use the Bitcoin network, which may only fuel the continuing debate around their value and use.\n\nAD\n\nAD"
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGVjcnlwdC5jby8xMjA1MjkvbWljcm9zdHJhdGVneS1zdG9jay1taWNoYWVsLXNheWxvci1zdGF5cy1idWxsaXNoLWJpdGNvaW7SAVhodHRwczovL2RlY3J5cHQuY28vMTIwNTI5L21pY3Jvc3RyYXRlZ3ktc3RvY2stbWljaGFlbC1zYXlsb3Itc3RheXMtYnVsbGlzaC1iaXRjb2luP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "MicroStrategy Stock Doubles Since January as Michael Saylor Stays Bullish on Bitcoin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDespite software giant MicroStrategy’s posting another loss yesterday, many long-term shareholders still have reason to be happy: the company’s stock has doubled so far this year.\n\nThe price of the Bitcoin-hoarding company’s stock is currently priced at $285.45, up 96.8% since the start of January. In the past five days, shares are up 11.83%.\n\nYesterday, MicroStrategy posted its eighth consecutive quarterly loss—this time its net loss was $249.7 million, or $21.93 a share, in the fourth quarter of 2022.\n\nAD\n\nAD\n\nThe digital asset impairment loss is down to the Bitcoin the company holds: MicroStrategy has been slowly collecting the biggest digital asset by market cap since 2020—helping to trigger a bull run.\n\nCurrently, the American company holds 132,500 BTC—worth over $3.1 billion today. MicroStrategy has paid an average of $30,137 per Bitcoin to accumulate its stash, according to yesterday’s filing. Since the company first bought Bitcoin in August 2020, its stock is up 113.8%\n\nBitcoin’s price is down 65.8% since its November 2021 all-time high of $69,044 per coin. Right now, the asset currently trades hands for $23,460.\n\nBut MicroStrategy co-founder and chairman Michael Saylor doesn’t seem fazed. Today, the business executive and mastermind behind the company’s Bitcoin accumulation said in an interview with CNBC that the company would continue snapping up the digital asset.\n\n“Our strategy is to buy and hold Bitcoin, and the key for us is to be consistent, transparent and responsible in the pursuit of that strategy,” Saylor said.\n\nAD\n\nAD\n\nToday’s interview with @MorganLBrennan covered the success of @MicroStrategy, global adoption of #Bitcoin and #Lightning⚡️, the evolution of the crypto industry, and the digital transformation of money. pic.twitter.com/bEnLOVbpiJ — Michael Saylor⚡️ (@saylor) February 3, 2023\n\nAnd MicroStrategy Chief Financial Officer Andrew Kangand said in the company’s SEC filing yesterday that the firm’s “conviction in acquiring, holding, and growing our bitcoin position for the long term remains unchanged.”\n\nMicroStrategy started buying Bitcoin back in 2020 when it initially spent $250 million on the asset.\n\nSaylor claims the biggest and oldest cryptocurrency is a “safe haven” asset and “digital gold.”\n\nIn today’s interview he said the most “exciting thing” in the digital monetary world is Lightning. The Lightning Network is a second-layer network which allows people to make Bitcoin transactions—big or small—relatively quickly and cheaply via certain crypto wallets.\n\nMicroStrategy is currently working on an “enterprise Lightning solution,” added Saylor, which will allow companies to move money “at the speed of light.”"
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMi8wMi93aHktZXgtc2VjLW9mZmljaWFsLWpvaG4tcmVlZC1zdGFyay1pcy13cm9uZy1hYm91dC1jcnlwdG8v0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzAyLzAyL3doeS1leC1zZWMtb2ZmaWNpYWwtam9obi1yZWVkLXN0YXJrLWlzLXdyb25nLWFib3V0LWNyeXB0by9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Why Ex-SEC Official John Reed Stark Is Wrong About Crypto - CoinDesk",
        "content": "One of Stark’s final points is a familiar one: Crypto gives criminals the best chance to steal from other people and abscond with their ill-gotten gains. This doesn’t accurately reflect the evidence, and one cannot compare the prevalence of illicit financial activity in crypto and in the traditional financial system because it is nearly impossible to even estimate the level of illicit activity in comparatively opaque TradFi."
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vZGVjcnlwdC5jby8xMjA1MjYvYmlsbGlvbmFpcmUtdGltLWRyYXBlcnMtYml0Y29pbi1waXRjaC10by1zcmktbGFua2EtZmFsbHMtZmxhdC13ZS1kb250LWFjY2VwdNIBbGh0dHBzOi8vZGVjcnlwdC5jby8xMjA1MjYvYmlsbGlvbmFpcmUtdGltLWRyYXBlcnMtYml0Y29pbi1waXRjaC10by1zcmktbGFua2EtZmFsbHMtZmxhdC13ZS1kb250LWFjY2VwdD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Billionaire Tim Draper's Bitcoin Pitch to Sri Lanka Falls Flat: 'We Don't Accept' - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBillionaire investor and Bitcoin fan Tim Draper made a surprise visit to the headquarters of Sri Lanka’s central bank trying to promote the cryptocurrency as a tool to fight corruption, but faced a frosty reception from the bank's Governor Nandalal Weerasinghe, per a Bloomberg report.\n\n“I come to the Central Bank with decentralized currency,” Draper said, only for Weerasinghe to bluntly respond, “We don’t accept.”\n\n“Adoption of 100% Bitcoin won’t be a Sri Lanka reality ever,” Weerasinghe said, adding that, \"we don’t want to make the crisis worse by introducing Bitcoin.\"\n\nAD\n\nAD\n\nDuring his meeting with Weerasinghe, Draper, dressed in a Bitcoin tie, said that should Sri Lanka follow El Salvador's lead in making use of Bitcoin, \"A country known for corruption will be able to keep perfect records with the adoption of Bitcoin.”\n\nAccording to the Governor, however, having its own currency is necessary for Sri Lanka's monetary policy independence, and other technologies are capable of distributing financial services.\n\nSri Lanka’s economic crisis\n\nThe meeting came during Draper’s visit to the island nation this week to shoot an episode of his \"Meet the Drapers\" TV show with local entrepreneurs. During his stay, Draper also met the country’s president Ranil Wickremesinghe, where he again made the case for Bitcoin adoption in Sri Lanka.\n\nSri Lanka, which marks the 75th anniversary of its independence from Great Britain this year, is engulfed in a major economic and political crisis that saw it default on more than $56 billion of foreign loans in 2022. The country is facing fuel and food shortages that lead to mass protests and forced former president Gotabaya Rajapaksa to flee the country and resign,\n\nSystemic corruption is believed to be one of the reasons for Sri Lanka’s descent into chaos; however, those ruling the country today appear to be opposed to introducing Bitcoin as a possible solution.\n\nAD\n\nAD\n\nIn 2014, Draper bought 30,000 BTC—then worth $19 million—seized from the dark web drug marketplace Silk Road in an auction held by the U.S. Marshals Service.\n\nThat same year, he predicted the price of Bitcoin would go to $10,000 in three years. Bitcoin went on to surpass $20,000 in 2017.\n\nHowever, not all of Draper's predictions have come to pass. In 2018, he argued that Bitcoin would reach $250,000 by 2022; by November 2022, as the crypto space entered into a prolonged bear market, he \"extended\" his prediction by six months, claiming that \"by mid-2023, I'm expecting to see Bitcoin hit $250,000.\""
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9jcnlwdG8tbWFya2V0LXN0aWxsLXJlZWxpbmctYXMtYml0Y29pbnMtYnJlYWstYWJvdmUtMjQwMDAtdHJpZ2dlcnMtbGlxdWlkYXRpb25zL9IBeWh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9jcnlwdG8tbWFya2V0LXN0aWxsLXJlZWxpbmctYXMtYml0Y29pbnMtYnJlYWstYWJvdmUtMjQwMDAtdHJpZ2dlcnMtbGlxdWlkYXRpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Crypto Market Still Reeling As Bitcoin’s Break Above $24,000 Triggers Liquidations - NewsBTC",
        "content": "On Wednesday, the crypto market received favorable news in form of the FOMC announcement and the price of Bitcoin eventually broke above $24,000. With the Fed turning dovish after being hawkish all through 2022, it has been a beacon for the crypto market to rally and the liquidations have ramped up as the market took advantage of this.\n\nCrypto Market Liquidations Cross $130 Million\n\nWith bitcoin’s rally above $24,000, short traders have once again drawn the short stick and are getting brutalized in the market. As of Thursday morning, the volume of liquidations over the last 24 hours has quickly crossed $130 million.\n\nOver 47,000 traders have seen their positions liquidated with the market rally and as expected, the vast majority of these have been short traders. Data from Coinglass shows that 72.96% of all traders affected during this liquidation event were short traders.\n\nFurthermore, almost half of all liquidations took place on the Binance crypto exchange at 48.34%, while Bybit accounted for 19.37%, and OKX followed closely behind at 14.96%. Interestingly, the largest single liquidation took place on the Bybit exchange on the BTCUSD pair worth $1.69 million.\n\nLiquidations cross $130 million | Source: Coinglass\n\nBitcoin leads the pack with over 1,670 BTC liquidated worth $39.67 million. Ethereum saw 20,560 ETH liquidated with $34.31 million, as the price of ETH rocketed past $1,660. Aptos, Solana, and Optimism made the top 5 with liquidations of $6.10 million, $4.05 million, and $2.95 million, respectively.\n\nIn the last four hours though, there seems to be a turn in the trend with bitcoin’s drop below $24,000. While short traders are still suffering the majority of liquidations (58.14%), long positions are catching up.\n\nWhat Happens If Bitcoin Keeps Growing?\n\nBitcoin has since retraced after climbing above $24,000 but the digital asset still maintains its bullish streak. This means that there is still a long runway for bitcoin and it could possibly climb back above $24,000 before the trading day is over.\n\nIf this happens, then the liquidations are expected to ramp up quickly. BTC’s consolidation over the last few days had worked to sow doubt in the market, and short positions were opened during this time. The Fed’s decision to only raise interest rates by 25 basis points has already instilled more trust in investors who are now more willing to take risks.\n\nBTC trending above $23,800 | Source: BTCUSD on TradingView.com\n\nPresently, with BTC ranging above its 200-day moving average, $25,000 is more likely a point for the digital asset to end its rally before a major pullback.\n\nAt the time of this writing, bitcoin is still changing hands just below $24,000 at $23,800. Nevertheless, the digital asset is seeing gains of 3.39% in the last 24 hours, according to data from Coinmarketcap.\n\nFollow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from Bitcoinist, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1tYXJjaGVzLXRvd2FyZHMtMjRrLXBvbHlnb24tYm5iLXJpc2UtdXAtdG8tMTIvYXJ0aWNsZXNob3cvOTc1NDc2NjYuY21z0gGYAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLW1hcmNoZXMtdG93YXJkcy0yNGstcG9seWdvbi1ibmItcmlzZS11cC10by0xMi9hbXBfYXJ0aWNsZXNob3cvOTc1NDc2NjYuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin marches towards $24k; Polygon, BNB rise up to 12% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency market was trading in the green on Thursday after Federal Reserve chair Jerome Powell acknowledged that inflation has started to ease, in remarks he made following a quarter-point rate hike by the US central bank. Bitcoin (BTC) rose 3.11% to $23,788, while Ethereum (ETH) was above the $1,600 level. BTC volume in the last 24 hours stood at approximately $30.58 billion, rising 37.16% in the last 24 hours.\"Bitcoin traded above $23,900 after reaching a low of $22,874 the previous day. A potential upward trend towards $24,000 and then $25,000 is possible if the market stays favourable. Meanwhile, Ethereum broke above $1,600, with support at that level and resistance at $1,700,\" Edul Patel, Co-founder and CEO at Mudrex, said.Other top crypto tokens were also trading higher. Polygon rose 12.35%. Solana Cardano and BNB were also trading with gains.The global cryptocurrency market cap was trading lower around $1.09 trillion, rising 3.86% in the last 24 hours.The total volume in DeFi is currently $5.67 billion, 8.88% of the total crypto market 24-hour volume. The volume of all stablecoins is now $57.14 billion, which is 89.5% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, jumped around $458.6 billion, with a dominance of about 42.14%, a decrease of 0.33% over the day, according to CoinMarketCap.\"According to the 1-hour time frame analysis, the BTC/USDT spot market appears to be in a bullish state, with a price of $23,900 and support levels at $23,900 and $23,300. The resistance level is at $25,200 and the Relative Strength Index (RSI) is at 70, signaling an overbought market. The moving average is also above the 200-day moving average, further indicating a positive outlook,\" Rajagopal Menon, Vice President at WazirX, said.Crypto Cart: Quick Glance (Source: coinmarketcap.com, data as of 12.29 hours, IST on February 02, 2023)Bitcoin $ 23,788 3.11%Ethereum $1,667 5.79%Tether $1 0.01%BNB $329.72 7.21%XRP $0.4122 2.99%Dogecoin $0.09326 1.38%Cardano $0.402 5.21%Polygon $1.23 12.35%Polkadot $6.51 5.33%Tron $0.06341 2.43%Litecoin $100.45 4.32%Shiba Inu $0.00001204 3.41%Solana $24.87 5.70%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi93aWxsLWJpdGNvaW4tcHJpY2UtcmV0dXJuLXRvLTIwMDAwLWhlcmVzLXdoYXQtaW52ZXN0b3JzLWV4cGVjdC_SAWhodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2JpdGNvaW4vd2lsbC1iaXRjb2luLXByaWNlLXJldHVybi10by0yMDAwMC1oZXJlcy13aGF0LWludmVzdG9ycy1leHBlY3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Will Bitcoin Price Return To $20,000? Here’s What Investors Expect - NewsBTC",
        "content": "Bitcoin price is still trending comfortably above the $23,000 level as it maintains its bullish trend. This has continued for a couple of weeks now, propelled forward by the newly adopted dovish stance of the United States Federal Reserve. However, not all investors have embraced this bullish trend as many still expect a decline in price for the digital asset.\n\nBitcoin Price Could Trade At $20,000 Soon\n\nAccording to the Price Estimates feature on Coinmarketcap, a good number of investors are expecting a bearish reversal for the bitcoin price. Price Estimates is a feature on the data aggregator website that allows individual users to put in their price expectations and then gives an estimate of all of the predictions.\n\nIn the current round of forecasts, the bearish sentiment surrounding the digital asset seems to be heightened as the median estimations came out to a price of $20,000. If this plays out, then the price of bitcoin could reach this level by the end of February according to the Price Estimates feature. It would also be a 14.69% drop from the current price.\n\nBTC price estimates puts it over 14% lower | Source: Coinmarketcap\n\nInterestingly, the bearish expectations are not just limited to the month of February alone but span over the next five months. The median of 8,053 votes came out to a price estimate of $19,500 for the month of March, $18,426 across 5,294 votes for the month of April, $17,6660 across 3,617 votes for the month of May, and $18,555 across 2,161 votes for the month June.\n\nOwe 34,000 votes have been collected in total by the Price Estimates feature and the estimation average came out to $20,203.57 across all of the votes. The median estimate was much worse at a price of $19,659.\n\nBTC price recovers above $23,500 | Source: BTCUSD on TradingView.com\n\nBTC Price Still Shows Strong Fundamentals\n\nPresently, while there have been speculations that the current upward movement of bitcoin is a bull trap, the digital asset is still showing strong fundamentals which suggest the price may continue to rise. One of these is that cryptocurrency is still trading well above all important moving averages.\n\nThe digital asset has now established support right above $23,000 which means that the bulls are still well in control. The $24,000 may have been elusive but bitcoin still maintains enough momentum for a retest. In the last 24 hours, it has seen trading volumes above $29 billion. As long as the bulls can hold the bitcoin price above $23,000 going into the weekend, the possibility of a crash remains slim.\n\nBTC is currently trading at just Aviv $23,400 at the time of this writing. It is down 1.53% in the last 24 hours but is seeing gains of 2.08% in the last seven days.\n\nFollow Best Owie on Twitter for market insights, updates, and the occasional funny tweet… Featured image from Forbes, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3Lm1vbmV5Y29udHJvbC5jb20vbmV3cy9vcGluaW9uL2RvZXMtdGhlLWJpdGNvaW4tcmFsbHktbWVhbi1jcnlwdG8taXMtYmFjay05OTk1NTUxLmh0bWzSAWVodHRwczovL3d3dy5tb25leWNvbnRyb2wuY29tL25ld3Mvb3Bpbmlvbi9kb2VzLXRoZS1iaXRjb2luLXJhbGx5LW1lYW4tY3J5cHRvLWlzLWJhY2stOTk5NTU1MS5odG1sL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Does the Bitcoin rally mean crypto is back? - Moneycontrol",
        "content": "In anticipation of an end to the period of rising rates, Bitcoin and other cryptocurrencies have been picking up pace in 2023. Bitcoin has recovered some lost ground by rallying to almost $24,000\n\nBitcoin, the flagbearer of cryptocurrencies, had reached a peak price of more than 67,000 USD towards the end of 2021. But, as inflation started raising eyebrows and interest rates started picking up around the world, risky assets quickly moved out of favour. Consequently, cryptocurrencies crashed precipitously, with Bitcoin falling to as low as 15,000 USD, thereby eroding almost 80% of investor-wealth. Is the tide turning now? On the bright side, it looks like we are at the fag end of the..."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL25ld3MvYml0Y29pbi9iaXRjb2luLXNob3J0LXRlcm0taG9sZGVyLXByb2ZpdC1ub3YtMjAyMS_SAVNodHRwczovL3d3dy5uZXdzYnRjLmNvbS9uZXdzL2JpdGNvaW4vYml0Y29pbi1zaG9ydC10ZXJtLWhvbGRlci1wcm9maXQtbm92LTIwMjEvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Short-Term Holder Profit Taking Reaches Levels Not Seen Since Nov. 2021 - NewsBTC",
        "content": "On-chain data shows the Bitcoin short-term holder profit-taking has reached high levels not seen since the November of 2021.\n\nBitcoin Short-Term Holder SOPR Has Shot Up Recently\n\nAs pointed out by an analyst in a CryptoQuant post, a near-term top usually becomes more probable when this trend forms for BTC. The relevant indicator here is the “Spent Output Profit Ratio” (SOPR), which tells us whether the average Bitcoin investor is selling at a loss or at a profit right now.\n\nWhen the value of this metric is greater than 1, it means the holders as a whole are realizing some profit on their selling currently. On the other hand, values below the threshold suggest the overall market is selling at some loss at the moment.\n\nNaturally, the indicator having a value exactly equal to 1 would suggest the average investor is just breaking even right now as the total amount of profits being realized in the market is equal to the losses currently.\n\nThe SOPR here covers the entire market, but the metric can also be modified to cover only certain segments of the market. One major part of the sector is made up of the “short-term holders” (STH) which is a cohort that includes all investors that acquired their coins within the last 155 days.\n\nNow, here is a chart that shows the trend in the 30-day moving average (MA) Bitcoin SOPR specifically for these STHs over the last several years:\n\nThe 30-day MA value of the metric seems to have seen some rise in recent days | Source: CryptoQuant\n\nAs displayed in the above graph, the 30-day MA Bitcoin STH SOPR had been below a value of 1 throughout the 2022 bear market, implying that these investors had been selling at a loss during this period.\n\nThe quant has also marked previous instances of such a trend with the green boxes in the BTC price chart. It looks like this trend was also observed during bearish periods of the past cycles.\n\nRecently, with the latest rally, the metric has sharply climbed and broken out of this zone, as its value is above 1 now. This suggests that there is more profit harvesting happening from this cohort than loss realization currently.\n\nThis makes sense as prices right now are significantly higher than they were during the last 155 days window, which is when the STHs would have bought their coins, so these holders must be in some decent profits currently.\n\nAs the rally has continued, the STHs seem to have rapidly ramped up their profit-taking as well, since the SOPR indicator for them has also continued to shoot up. The level of their profit realization is now comparable to that seen in November 2021, when Bitcoin set its all-time high.\n\nAs for what this current profit-taking may imply for BTC, the analyst explains, “when retail starts to get euphoric, the probability of a near-term price top starts to increase.”\n\nBTC Price\n\nAt the time of writing, Bitcoin is trading around $23,800, up 3% in the last week.\n\nLooks like BTC has risen in the past day | Source: BTCUSD on TradingView\n\nFeatured image from Kanchanara on Unsplash.com, charts from TradingView.com, CryptoQuant.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbmdlZWsuY29tL2J1aWxkaW5nLW9uLWJpdGNvaW4td2l0aC1kYXJyZW4ta2VsbGVuc2Nod2lsZXItY29pbmdlZWstd2Vla2x5LWxpdmVzdHJlYW0tMjAyMy1lcGlzb2RlLTQtdmlkZW8v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Building on Bitcoin with Darren Kellenschwiler: CoinGeek Weekly Livestream 2023 Episode 4 - CoinGeek",
        "content": "width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nOn Episode 4 of the CoinGeek Weekly Livestream, Kurt Wuckert Jr. talks to Darren Kellenschwiler, also known as Deggen on YouTube, about building on Bitcoin. Kellenschwiler is the Chief Technical Officer at Elas and the Developers Community Manager of the BSV Blockchain Association.\n\nOrdinals on BTC\n\nWuckert asks Kellenschwiler if he’s up to speed on the Ordinals NFT situation on BTC. He says he is not and asks what it’s all about.\n\nWuckert explains that a developer has created a protocol scheme to turn individual satoshis into non-fungible tokens (NFTs).\n\n“It has broken the internet,” he says, noting that the whole point of the Bitcoin civil war was to prevent this sort of thing. However, this developer has figured out a way to put image-based NFTs on BTC, deeply upsetting the small-blocker maximalists who claim Bitcoin is under attack.\n\nKellenschwiler says he has been working on a token platform that, conceptually, will be very similar. It’s called Buzzmint.\n\nUnlike BTC fanatics, BSVers have no problem with useful token platforms. He speaks about how easy it is to develop applications on Bitcoin now, thanks to indexing services like JungleBus. Services like this will allow people to focus on their businesses rather than running nodes, the two agree.\n\nKellenschwilers’ Bitcoin story\n\nWuckert always asks guests what their Bitcoin story is, and so he urges Kellenschwiler to tell his.\n\n“2013-ish,” Kellenschwiler replies, remembering how he heard about it from an engineer friend in England. At first, he dismissed it as “internet POGs,” but after growing interested in how economics and money work, he started day trading Bitcoin and ended up selling a business and putting all of his cash into it.\n\nEventually, Kellenschwiler started coding and tinkering with Bitcoin applications. He moved to London and began traveling to events. These days, he works for Elas and is developing applications related to Metanet, among other things.\n\nIn the immediate future, Kellenschwiler is excited to attend the London Blockchain Conference. He’s also interested in creating BSV meetups in Austin, where he’s currently based.\n\nOn LiteClient\n\nWuckert recalls the excitement when LiteClient was first announced. However, he feels there’s a huge lack of clarity about what it is, who would run it, etc. He asks Kellenschwiler to clarify and explain his participation in creating it.\n\nThe main pushback is from developers who are so used to running full nodes that they’re “reluctant to even consider that running a Merkle root is as secure as all of the data in the entire block,” Kellenschwiler says. “That’s the main concept people don’t get.”\n\nExchanges and wallet developers are particularly reluctant to accept it, but application developers are far ahead.\n\nWuckert recalls a conversation with Dr. Craig Wright in Oslo in which he explained that, when everyone runs nodes, this simply replaces the Byzantine Generals Problem, which proof-of-work solved for a “Byzantine soldiers problem.” There are so many more of them, and it’s much harder to coordinate them, Wuckert notes, recalling how he had a lightbulb moment when Dr. Wright said it.\n\nWhat’s coming for LiteClient in the future? Kellenschwiler thinks it will change how transactions are broadcast to the network. At the moment, most app builders will use a merchant API, but these will soon be replaced by new apps that give extra features, such as guarantees of broadcast acceptance. Long-term, the future of LiteClient is IPv6, multicast, and much more. This will all make the Bitcoin economy more efficient.\n\nViewer questions and answers\n\nQ. Why are edges important when programming in Bitcoin?\n\n“Imagine the infrastructure that supports the internet at the moment,” Kellenschwiler says, painting a picture of the massive server farms that hold it all together. In a Bitcoin-powered world with multicast and IPv6, this will move toward the edges. It’s not like that now because it’s difficult to monetize, whereas Bitcoin allows us to monetize every packet.\n\nQ. What’s the latest on the COPA case? What cases will we see next?\n\nIt’s in “something of a holding pattern,” Wuckert says. He has heard that the Kleiman case will go back to judge Bruce Reinhart, who notoriously dislikes Dr. Wright, but he doesn’t have any further information right now.\n\nWatch: London Blockchain Conference 2023 – Bringing government and enterprise onto the blockchain\n\nwidth=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC0xMC1jcnlwdG9jdXJyZW5jaWVzLWZvci1mZWJydWFyeS0wMi0yMDIzLWJpdGNvaW4tYXQtdXMyM2sv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Top 10 Cryptocurrencies for February 02, 2023; Bitcoin At US$23K - Analytics Insight",
        "content": "A green jump has taken over the crypto market as Bitcoin stands stronger at US $23K according to our list of top 10 cryptocurrencies on February 02 2023.\n\nhttps://twitter.com/saylor/status/1620851880523100160\n\nBitcoin (BTC) is currently trading at US $23,805.89 after jumping 3.080% in the past 24 hours. As a result, the market capital of Bitcoin is currently at a whopping US$458 billion.\n\nThe number second crypto on the list, Ethereum(ETH) which is trading at $1,668.46 after mimicking BTC’s upswing and gaining 5.65% in the past 24 hours. The market cap of ETH is 204 billion. The global cryptocurrency market capital is now US$1.09 Trillion, and has gone down by 3.58% in the past 24 hours. Crypto market truly seems in a good recovering position , as of now!\n\nHere is the list of 10 best cryptocurrencies for 02 February, 2023:\n\nCryptocurrency Trading Price(in USD) Past 24 hour Bitcoin (BTC) $23,805.89 up by 3.08% Ethereum (ETH) $1,668.46 up by 5.65% Tether (USDT) $1.00 up by 0.01% BNB $1,668.46 up by 6.74% USD Coin (USDC) $0.9999 up by 0.01% XRP $0.413 up by 2.97% Binance USD (BUSD) $1 up by 0.0% Cardano (ADA) $0.4026 up by 4.73% Dogecoin (DOGE) $0.09329 up by 1% Polygon(MATIC) $1.23 up by 12.08%\n\nCryptocurrencies that are trending today are Taboo token (TABOO), Aptos (APT) and HyperChainX (HYPER), as all three of them show upswinging movements. APT is trading at US$18.13 after gaining 9.35% in the past 24 hours. TABOO is trading at a market value of $0.001238 after a jump of 18.50% and HYPER saw a jump of 13.08% with a current trading price of US$0.005292.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3RvcC0xMC1jcnlwdG9jdXJyZW5jaWVzLWZvci1mZWJydWFyeS0wMy0yMDIzLWJpdGNvaW4tYXQtdXMyMy01ay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Top 10 Cryptocurrencies for February 03, 2023; Bitcoin At US$23.5K - Analytics Insight",
        "content": "The crypto market again takes a dramatic turn as Bitcoin stands at US $23.5K according to our list of top 10 cryptocurrencies for February 03 2023.\n\nhttps://twitter.com/saylor/status/1620851880523100160\n\nBitcoin (BTC) is currently trading at US $23,524.59 after dropping by 1.13% in the past 24 hours. This makes the market capital of Bitcoin reach US$453 billion after it was US $458 billion yesterday. However , at one point bitcoin had reached the trading value at $24000.\n\nThe second most favorite cryptocurrency, Ethereum(ETH) is trading at US$1,642.39. Just like BTC, ETH too went down by 1.47% in the past 24 hours. At the time of writing, the market cap of ETH is 200 billion. The global cryptocurrency market capital is now US$1.08 Trillion, and has gone down by 0.89% in the past 24 hours.\n\nFollowing is the list of 10 best cryptocurrencies for 02 February, 2023:\n\nCryptocurrency Trading Price(in USD) Past 24 hour Bitcoin (BTC) $23,524 down by 1.13% Ethereum (ETH) $1,642.39 down by 1.47% Tether (USDT) $1.00 down by 0.01% BNB $323.19 down by 1.93% USD Coin (USDC) $0.9999 down by 0.00% XRP $0.4104 down by 0.49% Binance USD (BUSD) $1 up by 0.01% Cardano (ADA) $0.4011 down by 0.25% Dogecoin (DOGE) $0.09182 down by 1.53% Polygon(MATIC) $1.18 down by 3.91%\n\nTrending cryptocurrencies today are BTC, MATIC and PancakeSwap(CAKE). CAKE is trading at US$4.11 after witnessing a drop of 3.49% in the past 24 hours.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmluZGlhdG9kYXkuaW4vY3J5cHRvY3VycmVuY3kvdmlkZW8vd2FudC10by1rbm93LXdoeS1nb3Zlcm5tZW50cy1kb250LWxpa2UtYml0Y29pbi0yMzI5NjQwLTIwMjMtMDItMDLSAXRodHRwczovL3d3dy5pbmRpYXRvZGF5LmluL2FtcC9jcnlwdG9jdXJyZW5jeS92aWRlby93YW50LXRvLWtub3ctd2h5LWdvdmVybm1lbnRzLWRvbnQtbGlrZS1iaXRjb2luLTIzMjk2NDAtMjAyMy0wMi0wMg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 02 Feb 2023 08:00:00 GMT",
        "title": "Want to know why governments don't like Bitcoin? - India Today - India Today",
        "content": "Sledging Room: It's that time of the year when fan wars become a norm. Yes, it's time for another season of the Indian Premier League. Yes, before we get into previewing and analysing the strengths and weaknesses of the 10 teams, let's give you a brief on the major talking points in the lead-up to IPL 2024."
    },
    {
        "id": 89,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LnN0cmFpdHN0aW1lcy5jb20vYnVzaW5lc3MvdXMtYmlsbGlvbmFpcmUtY2FsbHMtc3JpLWxhbmthLWNvcnJ1cHQtdGhlbi1vZmZlcnMtYml0Y29pbi1maXjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "US billionaire calls Sri Lanka 'corrupt' then offers Bitcoin fix - The Straits Times",
        "content": "BENGALURU – A billionaire cryptocurrency evangelist may have had a tougher reception than he expected when proposing widespread adoption of Bitcoin to a bankrupt country.\n\nSilicon Valley investor Tim Draper was in Sri Lanka to shoot an episode of his Meet The Drapers TV show with local entrepreneurs, and met President Ranil Wickremesinghe on Tuesday to proselytise the adoption of cryptocurrency. He journeyed to the central bank the next day with the same pitch – but embattled governor Nandalal Weerasinghe, who is still working to calm financial mayhem, was having none of it.\n\n“I come to the central bank with decentralised currency,” proclaimed Mr Draper, dressed in a Bitcoin tie for the meeting.\n\n“We don’t accept,” Mr Weerasinghe said.\n\nIt was a frostier response than Mr Draper had received in some other locations. The tiny island country of Palau in the Pacific made him the founding resident of its digital residency programme, for instance.\n\nFuel and food shortages in Sri Lanka stirred riots last year that forced the then president to flee the country and later resign. The debt-stricken nation is in talks with international creditors about debt restructuring, aiming to get the International Monetary Fund to come up with a rescue plan. Inflation stands at 54.2 per cent and last year, the economy contracted 8 per cent, Mr Weerasinghe said.\n\nTo crypto enthusiasts, that might seem like the perfect place for Bitcoin adoption. One of the main uses that people see for crypto is as a steady store of value not subject to changes in central bank or government policy. Mr Draper even cited El Salvador, which adopted Bitcoin as legal tender, in the meeting. But experiences like El Salvador’s, which staved off default at the last minute in January, might serve as a cautionary tale more than anything.\n\nMr Draper, 64, a Silicon Valley venture capitalist and early backer of companies such as Tesla, Baidu, Skype, Coinbase and Robinhood, made news in 2014 when he purchased seized Bitcoin at a United States Marshals Service auction. Bitcoin is hovering in the low US$20,000 region — but he sees the cryptocurrency reaching US$250,000 (S$328,000) in 2023.\n\nHe kept trying in the meeting with Mr Weerasinghe. “Does the administration have the guts to do it?” he asked. “What is the advantage of having your own currency?”\n\nFurther, Mr Draper said he was “a little worried about you guys”, and that the financial crisis provided a window of opportunity for a country “known as the corruption capital”. Colombo could avert graft by keeping perfect records after adopting Bitcoin, he argued.\n\nMr Weerasinghe said other technologies could efficiently distribute financial services to foster inclusion and disburse electronic welfare payments, and noted that a country without its own currency could not have monetary policy independence.\n\n“We don’t want to make the crisis worse by introducing Bitcoin,” he said. BLOOMBERG"
    },
    {
        "id": 92,
        "url": "https://news.google.com/rss/articles/CBMiNmh0dHBzOi8vd3d3LmJhbmtsZXNzdGltZXMuY29tL2F1L3JvYm90cy9iaXRjb2luLXByaW1lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 03 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Prime Australia Review 2023 - Is it Legit? - Bankless Times",
        "content": "What Is Bitcoin Prime?\n\nBitcoin Prime was created a few years ago when cryptocurrency traders realised the financial promise of Bitcoin.\n\nIt is said that the Bitcoin Prime algorithm uses artificial intelligence to power its automated trading robot, which places and executes Bitcoin transactions. The platform then scans several Bitcoin exchanges and shows you the best bargains, aiming to reduce your chance of making a loss.\n\nThe platform is in constant flux, continually improving its service for new and seasoned traders alike. As such, Bitcoin Prime gives you access to regulated Bitcoin brokers in your region.\n\nIf you have some idea about the art of buying and selling things, you should be able to get your head wrapped around the Bitcoin Prime concept. You purchase Bitcoin when the market price is low, and then you sell BTC when the price goes up again. Bitcoin Prime’s AI is said to assist in this process, helping you potentially make a tidy passive income for a commission fee.\n\nBitcoin Prime Overview\n\n🤖 Robot Type: Bitcoin Robot 💸 Minimum Deposit: $250 ✅ Is It a Scam or Legit? Legit 🚀 Claimed Win Rate: 90% 💰 Trading Fees: 2% commission on profitable accounts only 💰 Account Fees: None 💰 Deposit/Withdrawal Fees: Up to 10 free withdrawals per calendar month 💰 Software cost: Free ⌛ Withdrawal Timeframe: 24 hours #️⃣ Number of Cryptocurrencies Supported: 14 💱 Supported Cryptocurrencies: BTC, ETH, LTC, XRP 💲 Supported Fiat Currencies: USD, EUR, GBP 📊 Leverage: 3000:1 📱 Native Mobile App: No 🖥️ Free Demo Account: Yes 🎧 Customer Support: Email ✅ Verification required: Yes\n\nPros and Cons of Using Bitcoin Prime\n\nPros Bitcoin Prime system has relatively low minimum deposit\n\nBitcoin Prime demo account is available for new users\n\nWithdrawals only take 24 hours\n\nBitcoin Prime has a quick and easy to use software\n\n24/7 customer support Cons Limited cryptocurrencies available on Bitcoin Prime\n\nRisk that comes with cryptocurrency auto trading\n\nMinimal information on Bitcoin Prime about their services\n\nWho Owns Bitcoin Prime?\n\nFinding information regarding Bitcoin Prime owners was not easy since there are many platforms with different information. However, based on what we gathered from its official website, Bitcoin Prime was developed and is owned by a team of professional traders and software developers. These individuals reportedly have decades of experience in the financial market, indicating that they are keen on ensuring the robot is at its best performance.\n\nAdditionally, Bitcoin Prime owners stay abreast with the latest trends and developments in the cryptocurrency market to gain insights into the market performance. This is so that they can ensure the robot identifies trends with more profitability and enhances its capability in managing cryptocurrency trades. Plus, the bot’s owners partner with regulated platforms, making it legit and safe to trade with.\n\nGetting Started With Bitcoin Prime\n\nGetting started with Bitcoin Prime is easy, and it will only take you a few minutes to have everything set up. Here is a brief overview of how to create a trading account and trade with Bitcoin Prime.\n\nRegister for a Trading Account\n\nAt the top right corner of the Bitcoin Prime page, there is a form to fill out to begin your account setup. This procedure takes less than five minutes to complete.\n\nDeposit Funds\n\nBitcoin Prime has a minimum deposit requirement of $250. To begin your cryptocurrency trading ventures, you will deposit these funds via its affiliated brokers who are believed to be highly regulated and safe.\n\nTrade\n\nIt's a no-brainer that Bitcoin Prime is a trading robot in the cryptocurrency space. Therefore, once you make your deposit and set up the robot, it will automatically start executing trades based on market conditions. With a 90% claimed win rate, your chances of tripling your capital are maximised.\n\nBitcoin Prime Markets, Assets, and Options\n\nWhat cryptocurrencies and products can you trade using Bitcoin Prime?\n\nThe Bitcoin Prime trading platform lets you trade Bitcoin and other altcoins, including Ethereum, Litecoin, Dash, and Ripple. Simply put, you have access to more than 14 cryptocurrencies, all of which you can also trade as CFDs. Unfortunately, the robot doesn't have any other trading options/markets. For instance, if you also venture into stocks and forex, you may want to consider other automated platforms.\n\nRemember, Bitcoin Prime features are user-friendly. So whether you are a beginner with zero experience in the crypto market or an expert trader looking for a better trading bot, it is suitable for your trading needs.\n\nWhat leverage trading options are available with the Bitcoin Prime app?\n\nThe robot works with regulated brokers in the cryptocurrency industry to offer investors up to 3000:1 leverage to magnify small trades. The company states that its high leverage is the main factor in the high return rate they offer to small investors. So, how does Bitcoin Prime work? Well, with 3000:1 leverage, if you invest $250, you can potentially borrow $750k to make crypto investments. This is relatively high compared to other Bitcoin trading platforms.\n\nHowever, you should remember that leveraged trading presents a significant amount of additional risk if you are inexperienced. Therefore, we recommend only investing what you can afford while you are a beginner.\n\nWhat are the spreads?\n\nThe spreads on Bitcoin Prime will change depending on which broker you are dealing with. In addition, because the market is quite volatile, you can expect some fluctuation between the buying and selling price of Bitcoin.\n\nFees, Limits, and Payment Options on Bitcoin Prime\n\nHow much does Bitcoin Prime cost?\n\nNote that there are no other fees attached to Bitcoin Prime besides the minimum deposit requirement and the 2% commission on profits made. For instance, this robot has a free account and there are no sign-up or subscription fees. In addition, you do not need to buy the robot since it is free to download. However, you cannot trade using Bitcoin Prime trading system without making the required deposit. Luckily, the bot has deposit bonuses from time to time, so always be on the lookout for these to maximise your experience.\n\nWe understand that some cryptocurrency traders are budget-conscious and might be skeptical of taking the plunge without understanding the robot. Fortunately, Bitcoin Prime has a demo account besides the live version to test the robot and practise how to navigate the cryptocurrency market without spending your hard-earned money.\n\n💸 Minimum Deposit: $250 💰 Trading Fees: 2% on profits earned 💰 Account Fees: Zero 💰 Deposit/Withdrawal Fees: Up to 10 free withdrawals per calendar month 💰 Software cost: Zero 💰 Subscription cost: Zero\n\nWhat are the payment methods accepted by Bitcoin Prime?\n\nBitcoin Prime trading platform offers numerous payment methods to make investments. These include:\n\nPayPal\n\nMastercard\n\nVisa\n\nAnd many others\n\nDoes Bitcoin Prime also charge fees and commissions?\n\nAs we have previously mentioned, you do not have to pay any fees to open your Bitcoin Prime account. In addition, you also do not have to pay any fees to make a deposit. Therefore, the only time you will ever have to give money to Bitcoin Prime is when you pay a commission from your trade profits.\n\nBitcoin Prime trade sizes and limits\n\nAs aforementioned, Bitcoin Prime requires all users to pay a minimum deposit of $250 when creating their account. This is also the minimum amount you can invest to trade Bitcoin. Additionally, Bitcoin Prime does not have a maximum limit on how much you can spend, though we recommend starting small to avoid falling into financial difficulty.\n\nBitcoin Prime Platform\n\nHow does Bitcoin Prime work?\n\nThe Bitcoin Prime platform is an easy-to-use auto trading system that allows investors to trade cryptocurrency and potentially earn passive income.\n\nInterestingly, it is one of few auto-trading systems in the market that claims to apply AI to exclusively trading BTC contracts for differences (CFDs).\n\nUtilising sophisticated technology, Bitcoin Prime’s auto trading robots reportedly analyse the current Bitcoin market to find the best investments for their users. Then, trading robots will invest the funds deposited in your account, making purchases and selling cryptocurrency to potentially garner a profit.\n\nSaid to be using complex algorithms, the trading platform reportedly finds the best deals for investors and helps them get a foothold in the market. As you would expect, these trading bots can cover huge amounts of information much faster than manual methods. Furthermore, the system runs independently, which means you do not have to sit on the app for hours at a time to invest your money -- the AI will do it for you.\n\nWhat devices can I use the Bitcoin Prime app on?\n\nYou can use the Bitcoin Prime app on many devices, including:\n\nSmartphones\n\nTablets\n\nDesktop Browsers\n\nThe app is surprisingly straightforward and does not cost anything to download. However, you will have to deposit funds before you start making your trades. Luckily, Bitcoin Prime provides a demo account to help you figure out the finer details of the app without risking your money.\n\nCan I use Bitcoin Prime in my country?\n\nKeep in mind that the Bitcoin Prime platform is available in most countries that legalise cryptocurrency trading. Examples of countries where you can use Bitcoin Prime include the following.\n\nCountry Is Bitcoin Prime available? Can I Use Bitcoin Prime in Australia Yes Can I Use Bitcoin Prime in Canada Yes Can I Use Bitcoin Prime in the UK No Can I Use Bitcoin Prime in the USA No Can I Use Bitcoin Prime in South Africa Yes Can I Use Bitcoin Prime in New Zealand Yes Can I Use Bitcoin Prime in the Philippines Yes Can I Use Bitcoin Prime in UAE Yes Can I Use Bitcoin Prime in Singapore Yes Can I Use Bitcoin Prime in France Yes Can I Use Bitcoin Prime in Spain Yes Can I Use Bitcoin Prime in Italy Yes Can I Use Bitcoin Prime in Germany Yes Can I Use Bitcoin Prime in Nigeria Yes Can I Use Bitcoin Prime in Mexico Yes\n\nIs the Bitcoin Prime system available in my language?\n\nBitcoin Prime is available in multiple languages and, therefore, accessible to many people across the globe. Currently, there are ten languages available in the dropdown menu at the top of the Bitcoin Prime homepage. These include:\n\nEnglish\n\nFrench\n\nSpanish\n\nItalian\n\nHow easy is it to use the Bitcoin Prime app?\n\nThe Bitcoin Prime app is an easy-to-use auto-trading platform that is straightforward to navigate. When you sign up, you don’t need to know much about the technical side of things because Bitcoin Prime provides a demo account to help new users find their feet on the trading platform. You also have access to a video tutorial, which will explain everything you need to know.\n\nBitcoin Prime uses AI technology to find you the best Bitcoin deals, making it both intuitive and passive. You don’t need to do anything to make a potential profit.\n\nThat being said, you should be aware that robot trading is riskier than other platforms. If you want to remain in complete control over your investments, you may prefer to go somewhere else.\n\nHow much profit can you make using Bitcoin Prime?\n\nIt's a no-brainer that Bitcoin Prime is tailored to manage trades. However, traders are advised to always monitor their activities to remain in control. Also, have a budget and do not be money-driven if you want to succeed at trading. Remember, losses are inevitable, so plan carefully before beginning your ventures.\n\nSome traders claim that they make thousands of dollars daily trading with Bitcoin Prime. While this can be true, we couldn’t find any information on Bitcoin Prime’s website guaranteeing trades’ success. The amount of profit you will earn depends on your trading strategy and the amount of capital you invest.\n\nIf you are a beginner, we advise you to start trading with small amounts to avoid risking losing all your capital in case a trade goes against your trading strategies. Also, keep in mind that the robot deducts 2% of your profits, and you will also report your earnings to the ATO for tax deductions.\n\nBitcoin Prime Key Features\n\nThere are many features on the Bitcoin Prime system that add to the overall experience and help you earn potential profits. These include:\n\nPayouts: The Bitcoin Prime trading platform has a reliable payout system, which offers transparency from the moment you make the investment until you receive your payment. The system uses software that ensures all calculations are wholly accurate and in line with the current market price. It uses commissions taken from account holders’ profits to fund its system. In addition, it will only take a commission when you make a profit from your trades.\n\nEasy Withdrawal Process: If you are looking for an auto trading platform with speedy withdrawal processes, this is the one for you. Bitcoin Prime will usually process your withdrawal request within 24 hours.\n\nDemo Account: If you are unsure how to use the service, Bitcoin Prime has a helpful demo account that lets you explore the system without using your money. You can use this account until you feel comfortable investing actual funds into the cryptocurrency market.\n\nNews Trading: The trading algorithms featured on Bitcoin Prime also monitor the market news feed to stay ahead of the market. By doing so, the robot identifies news that could significantly affect the prices of cryptocurrencies and executes trades based on its findings. Note that using Bitcoin Prime in managing news-based trades can be beneficial since the robot moves faster than humans, thus allowing you to take advantage of most trading opportunities.\n\nBitcoin Prime Security and Regulation\n\nIs Bitcoin Prime legit?\n\nBitcoin Prime is legalised in most countries that allow Bitcoin trading. Moreover, information from its website claims that many individuals from diverse countries globally have signed up for an account with the robot. Remember, every country has its own financial market regulations, and the fact that individuals are trading with it is a good sign the robot is legit and accepted globally.\n\nIs Bitcoin Prime safe?\n\nAs mentioned above, Bitcoin Prime partners with regulated cryptocurrency brokers, ensuring the safety of your funds at all times. In addition, all account holders have to pass a know-your-customer (KYC) verification process to confirm their address and identity. This helps prevent any fraudulent activity on the trading platform. The site also uses SSL encryption with the aim of protecting your valuable information.\n\nAre my money and I protected?\n\nSince the Bitcoin Prime system doesn't store trading funds, you must be wondering whether your data is secured with the robot. Well, note that it is highly encrypted, and there is no history of it being hacked and traders’ information accessed. Also, your email is safe, and based on reviews on Trustpilot, there are no complaints regarding traders’ emails being hacked.\n\nIs Bitcoin Prime regulated?\n\nSome of the authorities regulating Bitcoin Prime's integrated brokers include Cyprus Securities and Exchange Commission (CySEC), Financial Conduct Authority (FCA), etc.\n\nDo I have to verify my account with Bitcoin Prime?\n\nYes, when you sign up with Bitcoin Prime, you are paired with a regulated broker who will then ask you for the relevant KYC documents and information to complete your account. KYC refers to documents that confirm your identity and address, such as photo ID and proof of address. This is an important part of the process as it helps keep the platform free from fraudulent activity.\n\nHow Does Bitcoin Prime Work? Trading Strategies and Algorithms\n\nThe cryptocurrency market is highly volatile, and there is no guarantee of successful trades in this market. However, the use of the robot maximises traders' potential since the trading bot is said to feature advanced trading strategies and algorithms. Let’s analyse below how each trading strategy works to benefit your trades.\n\nIt uses superior technology to automate trades on behalf of cryptocurrency traders. This streamlines your activities and maximises your profitability. However, ensure you confirm the availability of your preferred asset before signing up for a trading account.\n\nArbitrage Trading\n\nTiming is everything when it comes to cryptocurrency trading. Bitcoin Prime is always alert to identify trends with more profitability. With arbitrage trading, the trading bot helps you manage multiple cryptocurrencies on different platforms at once.\n\nNews Trading\n\nNews could affect the prices of Bitcoin and other altcoins, and Bitcoin Prime manoeuvres the market to identify news feeds that could significantly affect your trades. This is so that you can make the best moves that favour your investments on time.\n\nPrice Trend Analysis\n\nBitcoin Prime accesses cryptocurrencies’ historical data and analyses the price trends to predict what the future holds.\n\nExtra Information About Bitcoin Prime\n\nEducational resources\n\nWhen you create an account on Bitcoin Prime, you can use a demo version of the platform to help you become accustomed to the service. The site also gives you a video tutorial that will walk you through everything you need to know about CFDs trading on Bitcoin Prime.\n\nIt comes with a simple layout that provides all the relevant charts and metrics you need to understand how much you can buy and sell Bitcoin for, as well as everything you need to know about the way the market is moving.\n\nCustomer support\n\nBitcoin Prime aims to provide dedicated customer support to all users. As such, you can contact the customer service helpdesk 24/7. This service is efficient, and you never have to wait long to speak to an advisor.\n\nBitcoin Prime Customer Support Details Bitcoin Prime support email info@bitcoin-prime.app Bitcoin Prime support contact number Not available Bitcoin Prime live chat option Yes / No Bitcoin Prime other support options… None\n\nDemo Account\n\nAs mentioned earlier, Bitcoin Prime has demo and live trading accounts. The demo account is specifically tailored to help you understand how the trading bot works without spending your real money. It is the best platform for newbies to get started since you have nothing to lose. Simply put, Bitcoin Prime’s demo account prepares you for the live markets free of charge.\n\nHow to Get Started With Bitcoin Prime\n\nHow to sign up with Bitcoin Prime?\n\nStep 1 - Navigate to the Bitcoin Prime website and sign up\n\nIf you want to create an account on Bitcoin Prime, you need to complete the registration form on the Bitcoin Prime website. Use the Bitcoin Prime login page to sign in, after which you will be paired with a broker who will ask for your identity verification.\n\nStep 2 - Get your account verified\n\nOnce you have completed the account registration process, you will be required to verify your trading account to have it fully activated. With Bitcoin Prime, you will go through the KYC process that involves submitting your ID card for identity verification and a utility bill or bank statement to confirm your location. Keep in mind that without completing the KYC procedure, it will be challenging for you to trade on Bitcoin Prime.\n\nStep 3 - Make a deposit\n\nOnce you have created your account, Bitcoin Prime will prompt you to make a deposit of $250 to start live trading. This is the minimum amount needed to make a trade on Bitcoin Prime. But, of course, you can always invest more money when you feel ready to do so later on.\n\nStep 4 - Start with a demo account\n\nOnce your deposit has been confirmed, do not rush to trade in the live markets. Instead, test your skills out and try to better understand the robot on its demo account. Ensure you are fully prepared before diving into the real market.\n\nStep 5 - Start trading\n\nTo start trading, ensure you customise the trading bot to suit your trading needs. Additionally, adjust your strategy and let the robot handle the trades. You can also include risk management controls, including stop-loss and take-profit orders to stay in control of your trades.\n\nKeep in mind that once you have created a trading account with Bitcoin Prime, you will access it via its affiliated broker. This means that you must sign in to your brokerage account to access Bitcoin Prime.\n\nHow to delete a Bitcoin Prime account?\n\nThere are only two ways to delete your Bitcoin Prime account. First, you can do so on Bitcoin Prime’s platform where you will access the bot’s menu and close the trading account. Alternatively, simply close down your trading account on a broker’s platform. This will also mean losing all your data saved with the broker. In any case, it is important that you contact Bitcoin Prime’s customer care to notify them of your intentions.\n\nHow to buy and trade cryptocurrencies with Bitcoin Prime?\n\nBuying and trading cryptocurrencies with Bitcoin Prime is easy. Below, we take you through the steps to get you started, using Bitcoin as an example.\n\nDownload and install Bitcoin Prime on a broker’s platform of your choice. Create a trading account by providing your personal details, including name, email, phone number, etc. Deposit $250 per the bot’s requirements. Select Bitcoin and identify the best entry point. Customise Bitcoin Prime to suit your needs and let it open and manage trades. Do not forget to apply risk management controls to minimise risks.\n\nHow to withdraw money from Bitcoin Prime?\n\nBitcoin Prime doesn't store trading funds, and all withdrawals should be made from brokers it is connected with. Here is how to make withdrawals from your broker’s platform.\n\nAccess your broker’s platform and log in to your account. Click withdraw funds and choose the payment method you want to use. Enter your preferred amount to withdraw. Click confirm and wait for the money to be transferred within 24 hours.\n\nNote that withdrawals on most Bitcoin Prime integrated brokers are made using fiat currencies. Therefore, ensure you select your preferred currency when making withdrawals. There is no payout in cryptocurrencies or digital wallets with Bitcoin Prime.\n\nBitcoin Prime Celebrity/Company Endorsements\n\nThere are a lot of speculations online regarding Bitcoin Prime being endorsed by top celebrities and companies. We did our due diligence regarding these claims, and below are our findings.\n\nIs Elon Musk related to Bitcoin Prime?\n\nNo. Elon Musk is Tesla and SpaceX’s CEO, and his opinion on the crypto market is highly valued by trades. Although there are rumours stating that he is involved with Bitcoin Prime, we couldn't find any concrete information backing these claims.\n\nIs Jeff Bezos or Amazon related to Bitcoin Prime?\n\nNo. Jeffrey Preston Bezos is a popular American media and business mogul. He founded Amazon and is currently its executive chairman. Based on our research, Bezos hasn't endorsed Bitcoin Prime nor is he connected with the robot whatsoever.\n\nIs Tesla related to Bitcoin Prime?\n\nNo. Tesla owns some Bitcoin, but this doesn't mean it has any relation to Bitcoin Prime. The company hasn't stated the platform it uses for trading, and we couldn't conclude it is related to Bitcoin Prime without concrete proof.\n\nHas Idris Elba endorsed Bitcoin Prime?\n\nNo. Idris Elba is a prominent actor, and although many people claim that he endorsed Bitcoin Prime, we haven't been able to prove these claims, making them all untrue.\n\nIs Connor McGregor related to Bitcoin Prime?\n\nNo. Connor McGregor is a famous UFC fighter who is also believed to endorse Bitcoin Prime. These claims are false, and our findings state that he has no connection to Bitcoin or other altcoins trading whatsoever.\n\nBitcoin Prime in the News\n\nThere are discussions going around regarding Bitcoin Prime being covered on media platforms. Here is what we found out regarding these rumours.\n\nThe Mirror: There are claims that The Mirror show has featured Bitcoin Prime in its news coverage several times. However, that is not the case, and The Mirror has not endorsed any Bitcoin trading platform. CNN: CNN media platform is also said to be connected with Bitcoin Prime. These claims are all false, and those spreading these rumours are simply misdirecting the readers.\n\nOther Bitcoin Prime Reviews and User Testimonials\n\nIf you still have doubts regarding the credibility of Bitcoin Prime, here is what we found out regarding user reviews and testimonials on Reddit and Trustpilot.\n\nWhat are the top Bitcoin Prime reviews on forums and Reddit?\n\nMany users on Reddit believe that Bitcoin Prime is an excellent addition to the cryptocurrency space. Not only does it have a user-friendly platform, but it is affordable and customisable for any trader. Moreover, the robot is faster than humans, thus allowing you to take advantage of trading opportunities as they arise.\n\nWhat are the top Bitcoin Prime reviews on Trustpilot?\n\nLike Reddit, Trustpilot is a social platform where users leave their reviews regarding their experiences with various businesses. Based on our findings, most users on Trustpilot highly recommend the robot because of its reliability and efficiency in managing trades. However, they also state that it is important to manage your activities for maximum potential.\n\nWhat to Consider When Starting With Bitcoin Prime\n\nHere are some things to consider when using Bitcoin Prime.\n\nTake the advice of your licensed broker.\n\nStart trading with a minimum deposit.\n\nWithdraw your profits early.\n\nCheck your account daily.\n\nOnly invest what you can afford.\n\nIs There a Bitcoin Prime Alternative?\n\nYes, there are many more crypto robots available. If you don't want to use Bitcoin Prime, check out some of our other reviews:\n\nCrypto Robot Minimum Deposit Read our review Bitcoin Profit $250 Read our Bitcoin Profit review Aussie System $250 Read our Aussie System review\n\nBitcoin Prime Review: Final Thoughts\n\nNow that you've read our Bitcoin Prime robot review, hopefully, you can see that Bitcoin Prime is legit, particularly when compared to some of the more notable scam cryptocurrency sites. The registration process is quick, and all information regarding your funds is transparent. We are also fans of the speedy withdrawal process. In addition, the Bitcoin Prime app is easy to use.\n\nIf you are looking for a crypto robot that does not complicate the cryptocurrency trading process, Bitcoin Prime is a worthwhile place to start. That being said, you should be aware that cryptocurrency auto trading is definitely riskier than using other trading platforms, which is partly due to the high leverage offer.\n\nFind Out About More About Robots"
    }
]