[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wNi8wOS9iaXRjb2luLWJsYWNrLXN3YW4tYXV0aG9yLW5hc3NpbS10YWxlYi_SAUpodHRwczovL2ZvcnR1bmUuY29tLzIwMjMvMDYvMDkvYml0Y29pbi1ibGFjay1zd2FuLWF1dGhvci1uYXNzaW0tdGFsZWIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "‘It’s not even good for money laundering’: ‘Black Swan’ author Nassim Taleb lashes out at Bitcoin and says it’s ‘transformed into a cult’ - Fortune",
        "content": "Bitcoin is an ineffective cult that not even “bad guys” want to join anymore, said the author of The Black Swan, a bestselling book on the extreme impact of outlier events. Cryptocurrency falls short on its claim to streamline payments, and doesn’t even facilitate illegal transactions well, Nassim Taleb told Bloomberg on Thursday.\n\n“It’s not even good for money laundering,” he said. “It is too traceable. Gold you can re-melt [into] bars, you can do something, but Bitcoin has a book entry somewhere that anyone with basic knowledge of statistics can triangularize.”\n\nThe essayist assailed broader crypto culture, too, describing it as fanatical and dysfunctional.\n\n“It has transformed into a cult. The first time in history probably, we’re mixing money and cults,” Taleb told Bloomberg. “Usually you do cults with yoga…cults with music, but here is a cult with a financial product. These things don’t go together well, because finance has some gravity rules that eventually end up hurting that model.”\n\nHe added that crypto is a fad that falsely claims to be a refuge from regulation. Despite advertising itself as a haven from government oversight, Bitcoin is “not even attracting the bad guys anymore,” according to Taleb.\n\nTaleb, a former options trader and risk analyst, has switched his stance on crypto over recent years. In 2019, he was an advocate for the currency’s antiestablishment ethos. He disapproved of the Lebanese government’s capital controls on banks, and lauded Bitcoin for existing outside central banking.\n\n“The most potent case for cryptocurrencies: Banks are never there when you need them,” Taleb tweeted in 2019. “And they are trying to bully the public so they avoid accountability and profit disbursements. Bankers are legal crooks.”\n\nBitcoin currently trades at around $26,400, down about 12% from this time last year, and down 62% from its peak of over $68,000 in November 2021.\n\nTaleb previously invested in Bitcoin, but in 2021 he began selling his crypto because he found the currency too volatile. He also tweeted that the Bitcoin community had been taken over by “COVID-denying sociopaths with the sophistication of amoebas.”\n\nEver since, the author has been vocal about his distaste for crypto and predicted its failure. On Tuesday, he compared Bitcoin to the Mafia, but said the Mafia was truer to its promise of protection than cryptocurrency.\n\nTaleb also told Bloomberg that the Federal Reserve could pull the plug on crypto at any moment, and would replace Bitcoin next month. He said this in reference to FedNow, an instant payment service the Fed plans to introduce in July. FedNow will let individuals and businesses transfer money in real time and have access to the funds within seconds, according to a video by the Fed. The service, which does not necessarily replace crypto, will be released in phases starting next month.\n\nTaleb’s comments on Bloomberg came on the same day that the founders of Binance and Coinbase, the two largest crypto trading platforms, lost close to a combined $2 billion after being hit with SEC lawsuits. Coinbase CEO Brian Armstrong lost $361 million, and Binance CEO Changpeng Zhao lost $1.4 billion.\n\nSecurities and Exchange Commission Chair Gary Gensler is suing Binance for alleged “wash trading,” when a company trades with itself to inflate volume. Meanwhile, he’s suing Coinbase for allegedly selling unregistered tokens and acting as a broker, exchange, and clearinghouse without permission.\n\nTaleb took aim at Coinbase on Thursday, replying to a tweet by the trading platform claiming it is easier to deliver a bag of money by plane than by wire transfer, and that crypto is a faster solution. Taleb responded by writing that the statement was a lie “meant to fool those who don’t do wire transfers.”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiqgFodHRwczovL3d3dy5kaXNwYXRjaC5jb20vc3Rvcnkvb3Bpbmlvbi9jb2x1bW5zL2d1ZXN0LzIwMjMvMDYvMTAvb2hpby1uZWVkcy10by1wcm9tb3RlLWJpdGNvaW4tYW5kLWJsb2NrY2hhaW4tdGVjaG5vbG9naWVzLXdpdGgtYS11bmlmaWVkLXZvaWNlLWNvbHVtbmlzdC1zYXlzLzcwMjU4NDQ5MDA3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Ohio needs to champion bitcoin and blockchain technologies| columnist - The Columbus Dispatch",
        "content": "Andrew Burchwell\n\nGuest Columnist\n\nOhio’s historical legacy is rooted in innovation. Our economic success and progress have always depended on our willingness to try new things – leading to innovations in energy manufacturing, healthcare, IT and more. Today, as we see new opportunities through digital advancements in blockchain technologies like bitcoin, it’s critical we keep our innovative spirit alive and open to stay competitive in an increasingly complex and global environment.\n\nOhioans might be surprised to learn that our state is home to many industry leaders in bitcoin and blockchain development. One reason for the unfamiliarity is that industry leaders benefit from a unified voice to advocate for the industry’s potential, and Ohio is just beginning to organize and champion bitcoin and blockchain technologies from a statewide perspective.​\n\nIf we do not act with an intention, Ohio will miss out on a generational opportunity for its communities, businesses, and families. We are still very early in the development of these technologies, and it is an opportunity Ohio is uniquely positioned to capture.\n\nAt Ohio Blockchain Council, we are working to unite industries under a common banner to advance bitcoin and blockchain technologies for and within our great state. We believe Ohio is well positioned to be a global leader in innovation and development. Combining the resources of multiple companies from various business sectors is our most effective pathway to progress.\n\nOne of the barriers to adoption of any technology is public understanding. The technology behind Bitcoin and blockchain is unquestionably complicated. What is not complicated, though still underemphasized in our public conversation, is the direct positive impact these technologies could have on all of Ohio’s communities. Families across Ohio struggle with high healthcare costs. Recently the Cleveland Clinic, IBM, Aetna and Anthem announced a partnership that will utilize blockchain to improve efficiency, reduce costs and enhance customer experience.\n\nOhio’s rural population stands to uniquely benefit from bitcoin adoption. While bitcoin mining operations like the Standard Power facility in Coshocton create jobs and increase local economic activity, the long-term implications of bitcoin adoption are far greater. It looks like farmers utilizing bitcoin to exert greater control over their pricing, markets and quality assurance. It means small businesses using bitcoin to avoid fees and open themselves up to new customer bases. It allows a new source of funding for municipalities struggling to compete and provide new accommodations for residents. These are just a few examples of the many ways in which the lives of Ohioans will be transformed for the better through innovation.\n\nBitcoin and blockchain technology also carry the potential to help solve one of our most complicated and pervasive challenges today: public trust. According to a recent Pew Research report, only two out of 10 Americans trust the federal government. University of Chicago Institute of Politics research indicates that a majority of Americans agree with the statement “the government is corrupt and rigged against everyday people like me.” Here in Ohio, where we’re living through a still unfolding massive public corruption scandal, it’s very likely trust in public institutions is at an all-time low.\n\nBlockchain technology can help rebuild public trust by enhancing accountability in government contracting, electronic voting, grant disbursement and more, according to the U.S. Government Accountability Office. That’s because blockchain technology is by definition decentralized, objective and transparent.\n\nMore:Logistics, bitcoin companies receive state tax incentives to create 125 jobs in Columbus\n\nOhio’s congressional delegation has been championing these issues because they know how important they are to our state’s growth. It’s not a red vs. blue issue, and has been overwhelmingly bipartisan through the leadership of Rep. Warren Davidson (R) and Rep. Joyce Beatty (D) in the House of Representatives and newly elected Sen. J.D. Vance (R) in the Senate.\n\nHowever, Sen. Sherrod Brown (D) has been absent as a champion and leader on bitcoin and the underlying blockchain technology. He sits as chairman of the Senate Banking, Housing and Urban Affairs Committee, which has jurisdiction on these important issues, but has yet to be a forward-leaning advocate for our state. Senator Brown has the opportunity to propel Ohio into a category of its own on bitcoin, and we are here to show him that the work being done across our beautiful state is only just beginning.\n\nBitcoin and blockchain technologies represent significant potential for uplifting communities, businesses, and families. Harnessing this potential is only possible through an aligned, unified and collaborative approach toward adoption and public policy. This is our mission at Ohio Blockchain Council, and we believe Ohio can truly become the heart of it all.\n\nAndrew Burchwell, executive director of Ohio Blockchain Council"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzEwL2JpdGNvaW4tbm93LWFjY291bnRzLWZvci1uZWFybHktaGFsZi1vZi10aGUtMTAxLXRyaWxsaW9uLWNyeXB0by1tYXJrZXQtdHJhZGluZ3ZpZXctZGF0YS1zaG93L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Dominance Surges, Accounting For Nearly Half of The $1T Crypto Market, Amid Altcoin Selloff - CoinDesk",
        "content": "BTC's dominance rate has been steadily rising since November and surged during the March U.S. banking crisis. The indicator now looks to be breaking out of its three-year oscillation pattern, a sign of continued bitcoin outperformance in months ahead, according to Decentral Park Capital's Lewis Harland."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0aGVyZXVtLXRvLXNoYWtlLW9mZi10b290aGxlc3MtYWR2ZXJzYXJ5LXNlYy1hcy1mb21jLWxvb21z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ethereum to shake off 'toothless adversary' SEC as FOMC looms - Cointelegraph",
        "content": "Bitcoin (BTC) and Ether (ETH) are due volatility — but not thanks to “toothless” United States regulators, new analysis says.\n\nIn its latest market update on June 9, trading firm QCP Capital told market participants to gear up for macro-fueled price action for BTC and ETH.\n\nRelated: Why is Bitcoin price stuck?\n\nQCP Capital: U.S. crypto “mudslinging” to continue\n\nThe dust is continuing to settle on this week’s main macro stories — lawsuits against exchanges Binance and Coinbase from the U.S. Securities and Exchange Commission.\n\nMore upheaval will come in the future, QCP believes, as the macro environment from next week onward becomes much more unpredictable.\n\nThe SEC and Chair Gary Gensler, however, even if they continue to go after crypto, will not spark the mass price depreciation that some fear.\n\n“Once again trigger-happy Gensler and his SEC cronies wielded their ‘securities’ threat on their favourite whipping industry. However as we have maintained before, BTC/ETH will continue to treat the SEC as a toothless adversary — especially as it becomes crystal clear that the term ‘security’ will not apply to either,” it wrote.\n\n“As more and more such far-fetched SEC complaints are filed, it becomes increasingly clear all they are seeking are sensational headlines leading to a final fat settlement. After all, Gensler has proven the most capitalist of all previous regulators.”\n\nWhat could put the cat among the pigeons, QCP warns, is the U.S. Department of Justice or other arms of the establishment.\n\n“And if one of them gets involved, then the case becomes more serious and all bets are off,” it continued.\n\n“Nonetheless we expect more mudslinging from the Biden administration to continue on crypto, and even ramp up into election season next year.”\n\nThe days following the exchange lawsuits have so far seen crypto market sentiment withstand the pressure, with the Crypto Fear & Greed Index staying rooted at 50/100 — “neutral” territory.\n\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\n\nBitcoin price consolidates into “action packed” week\n\nBeyond the SEC itself, meanwhile, next week’s macro data reports could provide a trigger of their own.\n\nRelated: Bitcoin price can gain 60% if ‘textbook’ chart pattern confirms — Trader\n\nThe Consumer Price Index (CPI) print for May is due June 13, along with a Federal Reserve policy update, which will decide the next step for benchmark interest rates.\n\n“Going into next week, we have an action packed macro week as well — with US CPI, the June FOMC (including quarterly Fed rate projections) and other huge central bank meetings all taking place,” QCP noted.\n\nThe analysis also flagged changes to the Treasury General Account, apt to suck liquidity out of the monetary system and in doing so present a potential headwind for risk assets across the board.\n\nThat theory is on the radar for other well-known crypto figures, including former BitMEX CEO Arthur Hayes, who has been monitoring it since the start of 2023.\n\nQCP’s optimistic perspective comes as BTC/USD continues to tread water near key price support levels, with the 200-week EMA in particular.\n\nBTC/USD traded at around $26,600 on Bitstamp at the time of writing, according to data from Cointelegraph Markets Pro and TradingView.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\nMagazine: Home loans using crypto as collateral: Do the risks outweigh the reward?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvanBtb3JnYW4tZXhwZWN0cy1yZXRhaWwtZGVtYW5kLWZvci1iaXRjb2luLXRvLXJlbWFpbi1zdHJvbmctYXMtcmV3YXJkLWhhbHZpbmctYXBwcm9hY2hlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "JPMorgan Expects Retail Demand for Bitcoin to Remain Strong as Reward Halving Approaches - Nasdaq",
        "content": "By Landon Manning\n\nIn anticipation of the next halving event for Bitcoin, researchers from JPMorgan have declared their belief that the underlying asset will remain strong.\n\nAn integral component of Bitcoin’s long-term viability is the cap on the volume of coins that can be mined. There will only ever be 21 million bitcoin and there is a gradual taper from the early days of extremely easy mining to a tiny crawl by the very end of bitcoin mining’s lifespan. The mechanism for this gradual taper takes the form of the “halving” event, when certain passed milestones in bitcoin mined will automatically cut all mining rewards in half. In other words, the same amount of equipment and electricity will create half as many assets as it had a day before. The next halving is about a year away.\n\nThis event has happened three times in Bitcoin’s past, and according to research published in June by JPMorgan, the last two halvings led to a rally in bitcoin’s price. The 2024 halving seems well on track to continue this trend, as the report claims that a halving “would mechanically double bitcoin production cost to around $40,000, creating a positive psychological effect.”\n\nSpecifically, the increase in production cost would help raise the floor for bitcoin’s valuation, and lead to an increase in demand for coins in circulation. Institutional investment has diminished somewhat, the report claims, but Ordinals and the BRC-20 protocol have been attracting lots of attention from retail investors. This endorsement of future performance is particularly interesting from JPMorgan, as the firm has historically displayed a skeptical attitude for Bitcoin.\n\nOne of the main effects the halving will have on the Bitcoin community is its radical impact on miners. With such a sheer drop in productivity, mining firms will surely struggle to maintain market viability for the sheer output of equipment and electricity. Instead, only the firms that are the most well configured to run efficiently will be able to weather the storm. When less efficient miners are pushed out of the pool, this will leave these miners able to take home a bigger proportion of the pie. In the end, the halving will be a mechanism that forces the whole industry’s hardware to optimize.\n\nIndeed, to an untrained observer, it might be quite surprising that the community is full of predictions that the halving will only spell good things for Bitcoin. How could increased costs of production be good for business? The simple answer is that, because Bitcoin has already been halved many times before and “trimming the fat” of mining operations has historically led to more buzz from investment, Bitcoiners are assuming the same will take place again. The difficulty in acquiring fresh bitcoin will lead to increased interest in purchasing old ones, and the mining industry will be disrupted in a way that ultimately benefits it.\n\nThe halving is expected to take place in about a year, according to current industry estimates, and there is still plenty of time to observe the trends in the market and adjust these predictions accordingly. With years of experience behind it, however, the Bitcoin community is resolute.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDE0LzMvMjEvNTUzMzI3Mi9tdC1nb3gtbWlzc2luZy1iaXRjb2luc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Mt. Gox: all the news on Bitcoin's original biggest bankruptcy scandal - The Verge",
        "content": "Mt. Gox was once Bitcoin’s biggest exchange. Then, in 2014, the exchange shut down its website and announced that hundreds of millions of dollars worth of customers’ Bitcoins had been lost to a series of hackings that went unnoticed over several years.\n\nCEO Mark Karpeles was arrested by Japanese authorities in 2015 on charges of embezzlement and aggravated breach of trust but was eventually acquitted on most of the charges he faced and handed a suspended sentence for falsifying data. Authorities have since unveiled charges against others in connection to thefts of Bitcoin from Mt. Gox."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiJmh0dHBzOi8vbWlsa3JvYWQuY29tL2d1aWRlL2J0Yy12cy1ldGgv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Ethereum vs. Bitcoin 2024 - ETH vs. BTC Comparison - Milk Road",
        "content": "This article compares the cryptocurrencies ETH and BTC, looking at their differences, pros and cons, and if they constitute good investments.\n\nEthereum (ETH) Vs. Bitcoin (BTC)\n\nEthereum and Bitcoin are the two most widely-used cryptocurrencies globally. They’re programmed differently, e.g., Ethereum uses the proof-of-stake consensus mechanism, while Bitcoin uses proof-of-work. This article will help you understand the differences between them.\n\nETH Vs. BTC Chart\n\nETH BTC Creator Vitalik Buterin and Gavin Wood Satoshi Nakamoto Launch date July 30, 2015 January 3, 2009 Market capitalization $148 billion $317 billion Supply 122 million tokens 19 million tokens Hash Rate None (doesn’t rely on mining) 255MH/s Fees Varying gas fees Varying gas fees Privacy Pseudonymous Pseudonymous Consensus mechanism Proof-of-stake Proof-of-work Block time 10 to 19 seconds 10 minutes Future token issuance Maximum of 18 million new tokens every year Maximum supply of 21 million tokens All-time high $4,811.39 $67,598.09\n\nWhat Is Bitcoin? Bitcoin is a decentralized digital currency operating on a blockchain. The blockchain is a public ledger that records all transactions on the Bitcoin network. Anyone with a Bitcoin wallet address can send tokens to another address or receive tokens from another address. Bitcoin was conceptualized and created by Satoshi Nakamoto, a pseudonym for a person whose real identity remains unknown. The first block for Bitcoin was created in January 2009, and the first reported real-world financial transaction using Bitcoin took place in May 2010 when a Florida man paid 10,000 BTC for two boxes of pizzas. As of its first reported transaction, one Bitcoin was worth roughly a fourth of a cent. A few years after, millions of people began adopting the token, and demand shot up, driving the price of a single Bitcoin to an all-time high of over $67,000 in 2021. However, the 2022 crypto market crash has seen the price of Bitcoin slump to just over $16,000.\n\nPros And Cons Of Investing In Ethereum\n\nPros Supports global transactions with fast speeds\n\nSupports global transactions with fast speeds Zero network downtime over the past few years\n\nZero network downtime over the past few years Decentralized digital currency Cons Highly volatile\n\nHighly volatile Transaction fees can be high depending on network demand\n\nTransaction fees can be high depending on network demand No maximum supply, so there’s a high risk of inflation\n\nETH Vs. BTC: Similarities And Differences\n\nSimilarities Both tokens have high demand and a very liquid market.\n\nBoth are decentralized tokens operating on a public ledger (blockchain).\n\nBoth tokens have millions of users globally.\n\nBoth use alphanumeric strings as wallet addresses and are tradable on crypto exchanges. Differences ETH uses the proof-of-stake consensus mechanism, while BTC uses proof-of-work.\n\nBTC has a maximum supply, while ETH doesn’t.\n\nBTC relies on mining, while ETH doesn’t.\n\nThe Ethereum blockchain processes transactions significantly faster than the Bitcoin blockchain.\n\nETH Vs. BTC Price\n\nBTC has historically had a much higher market capitalization than Ethereum. Both cryptocurrencies peaked in 2021, a bubbly year for digital assets, but in 2022 have plunged from their all-time highs.\n\nBitcoin Vs. Ethereum Fees\n\nEvery Bitcoin transaction includes a gas fee paid to the miners on the network validating the transaction. Likewise, every Ethereum transaction includes gas fees paid to the network’s validators. These fees are separate from what exchanges and brokerages charge to facilitate transactions.\n\nETH BTC Gas Fee: The minimum number of tokens necessary to execute a transaction, and it varies based on network demand. You can offer additional tips so that validators will prioritize your transaction. Gas Fee: The amount paid to the blockchain to execute a transaction. It varies based on network demand.\n\nBitcoin Vs. Ethereum Privacy\n\nUsing a decentralized exchange, you can purchase Bitcoin or Ethereum without giving up your identity. In contrast, centralized exchanges have know-your-customer (KYC) requirements, so users must provide some form of identity. Yet, even when you use a decentralized exchange, both Ethereum and Bitcoin aren’t fully anonymous, as someone may be able to tie your wallet address to your real-world identity via a platform you transact with.\n\nWhat Is Proof Of Work (POW) Vs. Proof-Of-Stake (POS)? Proof of Work and Proof of Stake are the most popular mechanisms for validating transactions on a blockchain, but they work differently. Proof of Work Proof of Stake Relies on miners whose capacity depends on computational power Relies on stakers whose validating capacity depends on the amount of tokens they stake Miners receive block rewards Stakers receive transaction fees as rewards Requires expensive mining equipment and high energy usage Doesn’t require expensive equipment or high energy usage The proof-of-work mechanism uses a competitive validation method (solving complex mathematical puzzles) to confirm transactions and add new blocks to the blockchain, while proof of stake uses validators selected at random to confirm transactions and add new blocks. Bitcoin operates on the proof-of-work mechanism, while Ethereum operates on the proof-of-stake mechanism.\n\nBTC Vs. ETH Use Cases\n\nYou can use BTC and ETH for different types of transactions or as a store of value.\n\nTop BTC Use Cases\n\nStore of value : You can use BTC as an alternative currency to store your assets.\n\n: You can use BTC as an alternative currency to store your assets. Online Payment : Many online merchants now accept BTC for payment.\n\n: Many online merchants now accept BTC for payment. Trading : You can swap BTC for other types of cryptocurrencies on an exchange.\n\n: You can swap BTC for other types of cryptocurrencies on an exchange. Dapps: You can use BTC to transact on various decentralized apps, e.g., games and gambling apps.\n\nTop ETH Use Cases\n\nStore of value : You can also use ETH as a store of value and a hedge against inflation from your local currency, but a stablecoin better fits this purpose.\n\n: You can also use ETH as a store of value and a hedge against inflation from your local currency, but a stablecoin better fits this purpose. Staking : You can stake your ETH on the Ethereum blockchain to earn a percentage of transaction fees paid to the network.\n\n: You can stake your ETH on the Ethereum blockchain to earn a percentage of transaction fees paid to the network. NFTs : You can use ETH to buy non-fungible tokens (ETH) on various platforms.\n\n: You can use ETH to buy non-fungible tokens (ETH) on various platforms. Lending: You can lend your ETH to other users and earn interest via a lending protocol.\n\nETH Vs. BTC Long-Term: Which Is A Better Investment?\n\nETH and BTC can be good long-term investments that’ll yield profits. Yet, be sure to perform your own due diligence before investing in any cryptocurrency. This article isn’t investment advice.\n\nA Case For Investing In ETH\n\nETH is one of the most traded cryptocurrencies globally. Anyone getting into the crypto markets as a newbie has likely heard of ETH, so may be compelled to buy it. The Ethereum network offers very fast transaction processing speeds compared to many other cryptocurrencies. It’s volatile but not as volatile as most altcoins. The token’s recent shift from the proof-of-work mechanism to proof of stake has attracted more users and increased its demand.\n\nAs of late 2022, the crypto market is experiencing a widespread rout that has the value of many tokens to plunge, including ETH. If you believe the market is headed for recovery, it’ll be a smart decision to invest in ETH.\n\nPotential Risks\n\nThe token is vulnerable to massive price swings.\n\nTransaction fees can be very high when there’s significant demand on the network.\n\nMany smart contract platforms are emerging to compete with Ethereum, so its appeal might fade.\n\nCrypto wallets and exchanges where you hold ETH are vulnerable to hacking attacks.\n\nA Case For Investing In BTC\n\nBTC is the cryptocurrency with the highest market capitalization. The demand for BTC is enormous across the globe, so there’s always the chance of it increasing in value. Lately, institutional investors have set their sights on the cryptocurrency markets, and BTC is the asset most of them buy. BTC is already huge, yet there’s significant potential for growth in its demand, meaning it could be a good long-term investment.\n\nPotential Risks\n\nBTC is significantly volatile.\n\nBTC is vulnerable to a 51% attack — a group of miners controlling more than 50% of the network’s mining power can connive to disrupt it.\n\n— a group of miners controlling more than of the network’s mining power can connive to disrupt it. There’s no central authority to retrieve your BTC if you fall victim to hacking.\n\nGovernments may decide to ban or restrict the use of Bitcoin if it’s affecting their national currencies.\n\nRemember that investing comes with risks. Hence, it’s wise to only invest money that you can forfeit without losing much sleep. Always do your own research before investing, and remember that this article doesn’t constitute investment advice.\n\nBest Cryptocurrency Exchanges To Buy ETH\n\nCoinbase: Best For Ease Of Use\n\nBest For Ease Of Use Binance: Best For Low Fees\n\nBest For Low Fees Uniswap: Best For DeFi Users\n\n1. Coinbase: Best For Ease Of Use Why we picked it: Coinbase makes it easy for residents of the US and many other countries to sign up and trade cryptocurrencies. It’s also a publicly-traded company subject to regulations from the US Securities and Exchange Commission, so the chances of losing your funds due to misuse are lower. Buy ETH On Coinbase Read Our Coinbase Review\n\n2. Binance: Best For Low Fees Why we picked it: Binance lets you trade ETH or any other cryptocurrency for much lower fees than competing platforms. It charges a standard fee of 0.1% for crypto trades. Buy ETH on Binance Read Our Binance Review\n\n3. Uniswap: Best For DeFi Users Why we picked it: Uniswap is a decentralized exchange where you can trade assets directly with other users and keep full control of your private keys. There’s no central intermediary that can tamper with your ETH tokens when you use Uniswap. Buy ETH on Uniswap Read Our Uniswap Review\n\nBest Cryptocurrency Exchanges To Buy BTC\n\nCrypto.com: Best for mobile app\n\nBest for mobile app Kraken: Best for ease of use\n\nBest for ease of use Binance: Best for low fees\n\n1. Crypto.com: Best For Mobile App Why we picked it: Crypto.com offers an intuitive mobile app that enables users to trade BTC with ease. Buy BTC on Crypto.com Read Our Crypto.com Review\n\n2. Kraken: Best For Ease Of Use Why we picked it: Kraken offers an intuitive interface that’s suitable for both newbies and advanced traders. Buy BTC on Kraken Read Our Kraken Review\n\n3. Binance: Best For Low Fees Why we picked it: Binance lets users trade cryptocurrencies for relatively low fees of 0.1% per trade. Buy BTC on Binance Read Our Binance Review\n\nTo Sum It Up\n\nBTC and ETH are two of the most popular cryptocurrencies worldwide. They have core differences and similarities, which we’ve outlined for you. We’ve also mentioned the advantages and disadvantages of each token over the other. Both digital assets can be good long-term investments if the crypto market recovers from the 2022 crash, and you can easily buy them using a crypto exchange.\n\nFrequently Asked Questions\n\nWhat Is The Main Difference In Application Between Ethereum And Bitcoin? BTC is primarily used as a store of value, while ETH is mainly used to transact with applications built on the Ethereum blockchain. What Are Some Of The Similarities Between Bitcoin And Ethereum? They are both decentralized tokens operating on a transparent public ledger. Which Is Better: ETH Or BTC? There’s no objectively “better” token; they each have their pros and cons. For example, ETH offers much faster transaction speeds, while BTC offers better privacy. What’s The Difference Between Ethereum And Bitcoin? Ethereum operates on the proof-of-stake consensus mechanism, while BTC operates on the proof-of-work mechanism. ETH Vs. BTC Mining: What’s The Difference? Bitcoin relies on mining, i.e., using computers to solve complex mathematical equations, but Ethereum no longer relies on mining following The Merge in September 2022.\n\nContributor Chisom Maduonuorah Chisom Maduonuorah is a writer passionate about tech startups, venture capital, the global stock markets, and emerging financial markets like cryptocurrency. When not writing, you can find him staring into the sky pondering what life is about. Read More"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vdGhlcmVjb3JkLm1lZGlhL210LWdveC1zdG9sZW4tYml0Y29pbi1pbmRpY3RtZW50LXJ1c3NpYW4tbmF0aW9uYWxz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Russian nationals accused of Mt. Gox bitcoin heist, shifting stolen funds to BTC-e - The Record from Recorded Future News",
        "content": "The Justice Department is accusing two Russian nationals of being behind the headline-grabbing hack of Mt. Gox, the biggest cryptocurrency exchange from 2010 to 2013.\n\nOn Friday, the DOJ unsealed charges filed in 2019 against 43-year-old Alexey Bilyuchenko and 29-year-old Aleksandr Verner, accusing the two of stealing 647,000 bitcoins from Mt. Gox and using it to underpin the illicit cryptocurrency exchange BTC-e from 2011 to 2017.\n\nBilyuchenko is also being charged for running BTC-e with Alexander Vinnik, a Russian national extradited to the U.S. last August after a 2017 arrest in Greece. Vinnik is accused of laundering more than $4 billion of criminal proceeds through BTC-e.\n\nBilyuchenko and Verner are facing conspiracy to commit money laundering charges while Bilyuchenko is facing accusations of money laundering, conspiracy and operating an unlicensed money services business.\n\nAssistant Attorney General Kenneth Polite said Bilyuchenko helped set up BTC-e in part to launder the funds that were stolen from Mt. Gox — an assessment others investigating the case have made previously.\n\n“For years, Bilyuchenko and his co-conspirators allegedly operated a digital currency exchange that enabled criminals around the world — including computer hackers, ransomware actors, narcotics rings, and corrupt public officials — to launder billions of dollars,” said U.S. Attorney Ismail Ramsey.\n\nCourt documents unsealed in the Southern District of New York accuse Bilyuchenko, Verner and unnamed co-conspirators of hacking into the Japan-based computer servers holding the cryptocurrency wallets used by Mt. Gox customers.\n\nThe suspects transferred the funds from Mt. Gox’s wallets to bitcoin addresses controlled by Bilyuchenko, Verner and others, prosecutors said.\n\nThe Justice Department said the group siphoned the 647,000 bitcoins from Mt. Gox between September 2011 and May 2014, effectively wiping out the platform’s holdings of that currency. The platform shut down in 2014.\n\nIn April 2012, the group allegedly struck a deal with an unnamed bitcoin brokerage service to liquidate the stolen currency in exchange for large wire transfers to several offshore bank accounts.\n\nBetween March 2012 and April 2013, the brokerage transferred about $6.6 million to overseas bank accounts controlled by Bilyuchenko, Verner, and their co-conspirators.\n\nIn return, the brokerage got “credit” on another crypto platform controlled by the group. Bilyuchenko, Verner, and their co-conspirators allegedly laundered more than 300,000 bitcoin stolen from Mt. Gox on this unnamed crypto exchange.\n\nFor years, former Mt. Gox CEO Mark Karpeles faced accusations that he was behind the theft and collapse of the platform.\n\nBTC-e laundering\n\nIn charges unsealed in the Northern District of California, Bilyuchenko is accused of working with Vinnik and others to run BTC-e until it was shut down by law enforcement in July 2017.\n\nBTC-e was a hotbed for criminal activity according to the Justice Department, serving as “one of the primary ways by which cyber criminals around the world transferred, laundered, and stored the criminal proceeds of their illegal activities.”\n\nThe platform allegedly served more than one million users worldwide – helping launder the proceeds of “numerous computer intrusions and hacking incidents, ransomware events, identity theft schemes, corrupt public officials, and narcotics distribution rings.”\n\n“As alleged, Alexey Bilyuchenko and Aleksandr Verner thought they could outsmart the law by using sophisticated hacks to steal and launder massive amounts of cryptocurrency, a novel technology at the time, but the charges unsealed demonstrate our ability to tenaciously pursue these alleged criminals, no matter how complex their schemes, until they are brought to justice,” said U.S. Attorney Damian Williams for the Southern District of New York."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9ibGFjay1zd2FuLWF1dGhvci1uYXNzaW0tdGFsZWItYml0Y29pbi1jdWx0LWNyeXB0b2N1cnJlbmNpZXMtMjAyMy020gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "'Black Swan' Author Says Bitcoin Is a Cult, Doesn't Even Help 'Bad Guys' - Markets Insider",
        "content": "\"Black Swan\" author Nassim Taleb doubled down on his criticism of cryptocurrencies.\n\n\"It's not even good for money laundering,\" Taleb said, adding that bitcoin has turned into a cult.\n\nThe essayist has long been vocal about his dislike toward the crypto world, comparing bitcoin to a \"tumor\" in the past.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\n\"Black Swan\" author Nassim Nicholas Taleb doubled down on his criticism of the digital-asset industry, saying bitcoin is no haven and doesn't even serve a purpose for money launderers.\n\nBitcoin investing has transformed into something of a cult - and such behavior typically doesn't go well with the pragmatic world of money, the statistics guru and former options trader said during the Bloomberg Invest conference on Thursday.\n\nTaleb has long condemned bitcoin, previously classing the world's largest cryptocurrency as a \"contagious disease\" and an \"obsolete product of low interest rates.\"\n\n\"I actually have been a critic of bitcoin for reasons like - my principal reason - well, guess what, it's not even good for money laundering,\" he said. \"It is too traceable - Bitcoin is a book entry somewhere that anyone with basic knowledge and statistics can triangularize,\" he added, saying that at least with gold, you can melt the bars.\n\nAdvertisement\n\n\"The second one is that it was transformed into a cult - the first time in history probably we're mixing money and cult,\" Taleb said. \"Here's a cult with a financial product - these things don't go together very well.\"\n\nThe assumptions that bitcoin works as a place of refuge and that it's good for transactions are also false, he continued, adding that the Federal Reserve can very quickly replace cryptocurrencies.\n\nThe crypto industry has been under intense scrutiny following the downfall of FTX late last year. It's spurred a full-blown crackdown on the industry, with other major exchanges including Binance being pulled into the crosshairs of inspection."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItcmlzZS1hbWlkLXN3b29uLXNvYXItdHJhZGluZy1hZnRlci1zZWMtbGF3c3VpdHMtYWdhaW5zdC1iaW5hbmNlLWNvaW5iYXNlL9IBcGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItcmlzZS1hbWlkLXN3b29uLXNvYXItdHJhZGluZy1hZnRlci1zZWMtbGF3c3VpdHMtYWdhaW5zdC1iaW5hbmNlLWNvaW5iYXNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether rise amid ‘swoon-soar’ trading after SEC lawsuits against Binance, Coinbase - Forkast News",
        "content": "Bitcoin prices rose in Friday morning trading in Asia, but failed to break back above US$27,000 after a rollercoaster week in crypto markets following the lawsuits by U.S. securities regulators against the Binance and Coinbase exchanges. Other top 10 non-stablecoin cryptocurrencies gained, with Polygon’s Matic token leading the winners.\n\nTop 10 gain ground\n\nBitcoin strengthened 1.06% over the last 24 hours to US$26,551 at 7:00 a.m. in Hong Kong, making up some losses from earlier this week after the Securities and Exchange Commission (SEC) filed lawsuits against two of the world’s biggest exchanges, alleging dozens of of crypto tokens have been illegally offered and traded as unregistered securities. The world’s largest crypto by market capitalization is now down 1.26% for the past seven days after sharper declines earlier in the week, according to data from CoinMarketCap.\n\nEther climbed 1.1% to US$1,849, and logged a 0.98% weekly decline.\n\nPolygon’s MATIC was the biggest gainer among the top 10, with a 2.69% rise, but it has lost 12.02% in value for the past week.\n\nBinance’s BNB added 2.01% in the past 24 hours, the second-largest rise among the top 10, but is a big loser for the week, down 13.9%.\n\nThe total cryptocurrency market cap edged up 0.35% to US$1.1 trillion in the 24 hours through to 8:30 a.m. in Hong Kong, while daily trading volume dropped 35.3% to US$25.9 billion, according to CoinMarketCap data.\n\nIn a new court filing on Wednesday, the SEC said transactions involving several billions of dollars of customer funds moved through now-defunct Silvergate Bank and Signature Bank under accounts allegedly controlled by Binance officials, including chief executive Changpeng Zhao.\n\nSachin Verma, an accountant employed by the SEC, said in the filing that some of the funds were moved to accounts suspected to belong to offshore firms linked to Zhao and Binance, in various regions including the Seychelles, Lithuania and Kazakhstan.\n\nZhao tweeted on Thursday that this is “simply false” in response to a CoinDesk article that said US$12 billion of funds was sent to Zhao, citing the Wednesday filing.\n\n“To the best of my knowledge, Binance.US had in total roughly US$2 billion in user funds. This number in USD equivalent fluctuates a little as crypto prices change. And declining as users withdraw due to recent news,” Zhao tweeted. “All user funds are accounted for, and never left the Binance.US platform (unless users withdraw themselves of course), ever.”\n\nGordon Grant, co-head of trading at crypto brokerage Genesis Trading, said that this week’s sweeping regulatory pronouncements “saw crypto realized volatility begin to rear its head.”\n\n“After seeming months of coiling in an ornery, reptilian rip-rap price action, the successive Monday and Tuesday swoon-soar tandem on the back of Binance and Coinbase headlines preempted consternation, head scratching and, if nothing else, a recognition that the asset class remains habitually prone to lurid gaps in price action,” Grant said.\n\nIn an email, Le Shi, head of trading at Auros, a crypto market-making and algorithmic trading firm, said cryptocurrency trading volumes continue to “plumb the depths” last seen in the middle of the last crypto bear market.\n\nCoinShares, a European crypto investment firm, said in a Thursday report shared with Forkast that while the SEC lawsuits seem to carry more severe implications for Binance, the potential impact on Coinbase and the broader crypto industry is significant.\n\n“The charges insinuate that a majority of crypto assets should be categorized as securities, which would radically modify the regulatory landscape, potentially confining access to regulated Wall Street entities (assuming that they have the appetite once the litigation is over),” CoinShares wrote.\n\nCoinShares added that the shift could potentially place the control of the crypto industry within the grasp of traditional financial institutions.\n\nNFT sales drop\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dipped 1.07% to 3,219.65 in the 24 hours to 9:45 a.m. in Hong Kong. The index was down 4.59% for the week.\n\nNFT sales on Ethereum fell 14.4% over the last 24 hours to US$13.72 million, and sales on the Bitcoin network dropped 9.34% to US$3.53 million, according to CryptoSlam data.\n\n“[It’s a] hard market to analyze right now,” Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News, said on Friday.\n\n“On one hand I believe we’ll see capitulation to the negative news, especially once the SEC files lawsuits against (NFT) projects, but at the same time, we are seeing bullish news from projects, art, among others, on an almost daily basis,” Petscher added. “I don’t think the SEC’s lawsuits have played a factor yet. They should soon.”\n\nUncategorized Ordinals – recently popular Bitcoin Ordinals that are not part of an established collection – saw the largest sales in the past 24 hours with a 74.13% rise to US$1.54 million.\n\nThe Captainz, an Ethereum-based collection, recorded a 2.33% increase in sales to US$1.12 million, making it the second most sold collection in the past day, followed by Mythos chain-based DMarket’s US$1.11 million daily sales.\n\nIn another development, crypto exchange Kraken has launched its NFT marketplace out of beta with over 250 collections.\n\nLuca Netz, the chief executive officer of intellectual property firm and NFT collection Pudgy Penguins, is set to launch a Web 3.0 licensing marketplace named Overpass as early as late June, according to a Thursday report by media firm NFT Now.\n\nPudgy Penguins is an Ethereum-based NFT collection of 8,888 unique digital assets. It is the 19th largest collection in all-time sales, with more than US$257 million traded, according to CryptoSlam data.\n\nU.S. stock futures fall\n\nNew York Stock Exchange. Image: Getty Images\n\nU.S. stock futures fell as of 10:10 a.m. in Hong Kong after the major U.S. stock indexes posted strong gains overnight. Dow Jones Industrial Average futures dropped 0.14%, and S&P 500 futures dipped 0.1%. Nasdaq Futures fell 0.1%.\n\nOvernight in the U.S., the Nasdaq Composite rose 1.02%, and the Dow Jones Industrial Average climbed 0.5%. The S&P 500 added 0.62%, hitting a new high for the year so far.\n\nIn macroeconomic developments, the U.S. Labor Department reported Thursday that the country’s initial jobless claims totaled 261,000 for the week ended June 3. That was the highest weekly level for such claims since October 30, 2021.\n\nThe jobless claims pointing to a slowing of the economy are another factor suggesting the U.S. Federal Reserve’s more than year-long hikes in interest rates are having an effect and may influence the Fed’s decision-making on rates at its meeting on June 14.\n\nU.S. interest rates are now between 5% and 5.25%, the highest since 2006.\n\nThe CME FedWatch Tool predicts a 74.8% chance the Fed will leave rates unchanged at next week’s meeting, and a 25.2% chance for another 25-basis-point rate hike.\n\n(Updates with equity section.)"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9tZWFud2hpbGUtY2VvLW9uLWZ1dHVyZS1vZi1iaXRjb2luLWxpZmUtaW5zdXJhbmNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Meanwhile CEO on Future of Bitcoin Life Insurance - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to coindesk.consensus.com to register and buy your pass now."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMDIzLzYvOS8yMzc1NTM3Ni9tdC1nb3gtYml0Y29pbi1oYWNrLXJ1c3NpYW5zLWNoYXJnZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Feds charge two men for the $400 million Bitcoin hack that took down Mt. Gox - The Verge",
        "content": "The US federal government has charged two Russian nationals in connection with the series of hacks that brought down the Mt. Gox Bitcoin exchange in 2014. In a press release on Friday, the Department of Justice announced it’s unsealing a 2019 indictment charging (PDF) Alexey Bilyuchenko and Aleksandr Verner with conspiring to launder 647,000 Bitcoins stolen from the exchange, which was worth around $400 million at the time.\n\nThe government is separately charging Bilyuchenko for working with Alexander Vinnik — who the DOJ indicted in 2017 before he was extradited to the US last fall — for operating BTC-e, a now-defunct crypto exchange that served as “one of the primary ways by which cyber criminals around the world transferred, laundered, and stored the criminal proceeds of their illegal activities.”\n\nAt the time of Vinnik’s indictment, the government alleged that stolen funds from Mt. Gox passed through BTC-e and wallets associated with Vinnik. Now the DOJ alleges that Bilyuchenko, Verner, and other co-conspirators laundered over 300,000 Bitcoins that had been stolen from Mt. Gox as well.\n\nMt. Gox owner and CEO Mark Karpeles was arrested in 2015 and indicted in Japan on charges including embezzlement and aggravated breach of trust. But in 2019, Karpeles was acquitted on most of them, with a suspended sentence applied for falsifying data. Today he retweeted a post linking to the unsealed indictment.\n\n“As alleged in the indictments, starting in 2011, Bilyuchenko and Verner stole a massive amount of cryptocurrency from Mt. Gox, contributing to the exchange’s ultimate insolvency,” Assistant Attorney General Kenneth A. Polite, Jr. says in a statement. “Armed with the ill-gotten gains from Mt. Gox, Bilyuchenko allegedly went on to help set up the notorious BTC-e virtual currency exchange, which laundered funds for cyber criminals worldwide.”\n\nWhile Bilyuchenko faces charges with conspiracy to commit money laundering and operating an unlicensed money services business and over 20 years behind bars, Verner is charged with conspiracy to commit money laundering with a maximum penalty of 20 years in prison."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWF2b2lkcy0zLW1vbnRoLWxvd3MtYXMtY3J5cHRvLWRpdmUtbGlxdWlkYXRlcy0zOTBt0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price avoids 3-month lows as crypto dive liquidates $390M - Cointelegraph",
        "content": "Bitcoin (BTC) challenged three-month lows into June 10 as altcoins felt the heat from United States regulatory pressure.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\nAltcoin bloodbath as exchanges reshape landscape\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD hitting $25,483 on the day, down over $1,200 from the previous day’s high.\n\nWhile showing weakness, Bitcoin was spared the fate of major altcoins, which reacted strongly to delisting that accompanied U.S. legal action against major exchanges.\n\nTrading app Robinhood announced that it would remove support for several cryptocurrencies named in the lawsuit against Binance and Coinbase by the U.S. Securities and Exchange Commission (SEC).\n\nThese subsequently hemorrhaged value, with both Cardano (ADA) and Solana (SOL) down nearly 25% in 24 hours at the time of writing.\n\n“We regularly review the crypto we offer on Robinhood,” the firm stated on its website.\n\n“Based on our latest review, we’ve decided to end support for Cardano (ADA), Polygon (MATIC), and Solana (SOL) on June 27th, 2023 at 6:59 PM ET.”\n\nADA/USD 1-day candle chart (Coinbase). Source: TradingView\n\n“As expected, following this week’s action on the regulatory front, we saw some delistings causing market selloff,” Kris Marszalek, CEO of Crypto.com, responded.\n\n“I guess we are in the ‘then they fight you’ stage on the crypto adoption curve. Make no mistake: crypto industry will go through this and emerge stronger than ever.”\n\nCrypto.com confirmed that it would halt its U.S. institutional trading service beginning June 21.\n\nBTC price 200-week trend line support fails\n\nThe events had a major impact on the overall cryptocurrency market cap, with Michaël van de Poppe, founder and CEO of trading firm Eight, warning that worse may be to come.\n\nRelated: Bitcoin, Ethereum to shake off ‘toothless adversary’ SEC as FOMC looms\n\nAs with BTC/USD, should the total crypto cap tally lose its 200-week moving average (MA), this would constitute a clear bear signal. Bitcoin’s moving average trend line currently stands at nearly $26,400.\n\n“This is not the weekly candle you’d want to see on the total market capitalization for Crypto,” he told Twitter followers alongside a chart.\n\n“Losing the 200-Week MA shouts for downwards continuation on the trend.”\n\nCrypto market cap annotated chart. Source: Michaël van de Poppe/Twitter\n\nVan de Poppe, like some other popular traders, nonetheless revealed interest in altcoin buys at lower prices.\n\nAccompanying him was Crypto Tony, who predicted “incredible entries” on the table for 2023.\n\nThese #Altcoin drops get me way too excited in Crypto as they really do not come by that often\n\n\n\nGot some incredible entries lined up later this year. I will share a few later today with you all and they are super realistic .. WHO IS READY — Crypto Tony (@CryptoTony__) June 10, 2023\n\nFor existing traders, however, the damage was done, as long liquidations totaled $320 million for June 10, according to data from CoinGlass, with the day not yet over.\n\nAnother $70 million in short positions also evaporated.\n\nCrypto liquidations chart (screenshot). Source: CoinGlass\n\nMagazine: Home loans using crypto as collateral: Do the risks outweigh the reward?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNi8wOS93aGVyZS10aGUtbXQtZ294LW1vbmV5LXdlbnQtbmV3LWRldGFpbHMtaW4tdGhlLWJ0Yy1lLWV4Y2hhbmdlLWNhc2Uv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA2LzA5L3doZXJlLXRoZS1tdC1nb3gtbW9uZXktd2VudC1uZXctZGV0YWlscy1pbi10aGUtYnRjLWUtZXhjaGFuZ2UtY2FzZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Where the Mt. Gox Money Went: New Details in the BTC-e Exchange Case - CoinDesk",
        "content": "Where the Mt. Gox Money Went: New Details in the BTC-e Exchange Case\n\nFresh court documents detail how two administrators of the now-defunct BTC-e exchange stole and laundered bitcoin from Mt.Gox, the hacked bitcoin exchange."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA2LzA5L2JpdGNvaW4tcGF5bWVudHMtZmlybS1zdHJpa2UtbW92ZXMtY3VzdG9keS1pbi1ob3VzZS1hZnRlci1kaXRjaGluZy10aGlyZC1wYXJ0eS1zZXJ2aWNlcy_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNi8wOS9iaXRjb2luLXBheW1lbnRzLWZpcm0tc3RyaWtlLW1vdmVzLWN1c3RvZHktaW4taG91c2UtYWZ0ZXItZGl0Y2hpbmctdGhpcmQtcGFydHktc2VydmljZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Payments Firm Strike Moves Custody In-House After Ditching Third-Party Services - CoinDesk",
        "content": "Strike users can now send bitcoin directly to other users on a peer-to-peer basis. They can also opt to receive funds as cash or bitcoin. Bitcoin payments can be made directly on-chain or via the Bitcoin Lightning Network – a second layer payment system for cheaper and faster bitcoin transactions."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1zZWMtY3JhY2tkb3duLWJpbmFuY2UtY29pbmJhc2UtY2FudC1zdG9wLWJpdGNvaW4tdHJhZGVzLWFib3ZlLXVzMjYwMDAv0gFyaHR0cHM6Ly9mb3JrYXN0Lm5ld3Mvd2Vla2x5LW1hcmtldC13cmFwLXNlYy1jcmFja2Rvd24tYmluYW5jZS1jb2luYmFzZS1jYW50LXN0b3AtYml0Y29pbi10cmFkZXMtYWJvdmUtdXMyNjAwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Weekly Market Wrap: SEC crackdown on Binance, Coinbase ‘can’t stop’ Bitcoin as it trades above US$26,000 - Forkast News",
        "content": "Bitcoin fell 2% from June 2 to June 9 to trade at US$26,598 at 7:45 p.m. Friday in Hong Kong. The world’s largest cryptocurrency by market capitalization has traded below US$30,000 since April 19. Ether fell 2.83% over the week to US$1,842.\n\nIt was a tumultuous week for the crypto industry after the U.S. Securities and Exchange Commission sued Binance’s U.S. wing for 13 charges related to securities violations, including the unregistered offers and sales of the BNB and BUSD tokens and activity related to its Simple Earn and staking programs.\n\nThe SEC sued Coinbase exchange on Tuesday, a day after initiating its lawsuit against Binance. The regulator alleged that Coinbase made billions of dollars unlawfully facilitating the buying and selling of crypto asset securities since at least 2019.\n\n“It is obvious that the SEC is currently on the hunt for crypto companies. This goes back to the collapse of FTX in 2022, as U.S. regulators would embarrass themselves if a similar scenario were to repeat itself without intervention,” Jonas Betz, crypto market analyst and founder of consultancy firm Betz Crypto, told Forkast in a LinkedIn response.\n\n“It is very likely that more exchanges will be targeted in the coming months. However, going for the big dogs like Binance and Coinbase first seems strategically clever as smaller companies will automatically adapt their activities to the new rules indicated by the outcome of the lawsuits.”\n\nFollowing the lawsuits, Bitcoin briefly dipped to a weekly low of US$25,493 on Tuesday but recovered above US$26,000 the same day.\n\n“The rapid recovery of crypto prices is due to two reasons. First, lawsuits can’t stop decentralized systems like Bitcoin and Ethereum and therefore do not pose a direct threat to cryptocurrencies. Second, even though the U.S. is an influential global player, these lawsuits should have little impact on other jurisdictions around the world. While holders of U.S. cryptocurrencies sold their shares in a short-lived market panic, many took the opportunity to buy cryptocurrencies at a discount, thus the market quickly recovered,” wrote Betz.\n\nJames Wo, the founder and chief executive officer of crypto investment firm DFG, said that market confidence did not take a significant hit from the lawsuits, unlike the panic selling caused by FTX’s collapse.\n\n“If it falls below US$26,000 again this week, it could be considered a short-term downtrend. Another price to watch is the previous high of US$28,000-28,500. Its break-through can be seen as a short-term bullish signal,” wrote Wo to Forkast.\n\nLucas Kiely, the chief investment officer of digital asset platform Yield App, said that the SEC’s crackdown occurred given its failure to prevent the FTX collapse and warned of the potential of a more aggressive approach by the regulator.\n\n“It remains unclear if more exchanges will be targeted in this crackdown. However, it is evident that the SEC is taking a more aggressive approach towards regulating the crypto industry, which may result in more legal actions against other exchanges that fail to comply with securities laws,” Kiely told Forkast.\n\nKiely added that the market’s quick recovery occurred as buyers saw an opportunity to buy the dip.\n\n“Some analysts believe that this is a sign of growing maturity in the cryptocurrency market. In previous years, negative news from regulatory bodies would have caused more significant price drops.”\n\nAdding to global investor concerns, the Eurozone economy officially entered recession as it shrank 0.1% in the first quarter of 2023, compared to preliminary estimates of a 0.1% growth, pressured by high inflation and borrowing costs.\n\nMike Ermolaev, founder of blockchain PR firm Outset PR and the author of the interview series ‘Crypto Opinion with Mike Ermolaev,’ said that a bull run could occur if the SEC loses the lawsuits.\n\n“[The SEC’s actions] appear to be an attempt to cripple the sector, especially in light of the new lawsuit against Coinbase. While cryptocurrency will undoubtedly recover, the road to redemption will be more challenging than ever. Moreover, we must not discount the possibility that unfair regulations could drive crypto into the shadows, taking a significant step backward,” wrote Ermolaev to Forkast.\n\nThe global crypto market capitalization stood at US$1.1 trillion on Friday at 7:45 p.m. in Hong Kong, down 3.5% from US$1.14 trillion a week ago, according to CoinMarketCap data. With a market cap of US$515 billion, Bitcoin represented 46.7% of the market while Ether, valued at US$221 billion, accounted for 20%.\n\nSee related article: It’s a fight for the future of money in the US, says Christopher Giancarlo\n\nNotable Movers: LUNC, XRP\n\nTerra’s Luna Classic (LUNC) token was this week’s second-biggest gainer in the top 100. LUNC rose 15.27% to US$0.00009811. The token started picking up momentum on Sunday, a day before proposal #11548 passed, which will provide a test environment for the price re-pegging of USTC.\n\nXRP, the cryptocurrency powering the XRP Ledger’s real-time gross settlements, was the week’s second-biggest gainer. XRP rose 2.3% to US$0.5274, as investors became less concerned with Ripple’s ongoing lawsuit with the SEC after the regulator filed two similar lawsuits against Binance and Coinbase.\n\nSee related article: Why the US is waging war on Binance, Coinbase\n\nNext Week: Can Bitcoin stay above US$25,350?\n\nInvestors await the release of May’s core Consumer Price Index in the U.S., scheduled for next Tuesday. The inflation data will be published a day before the Federal Reserve’s next interest rate decision on Wednesday, where the Fed is expected to pause its interest rate hikes for the first time in over a year, according to over 90% of economists polled by Reuters.\n\nEuropean investors are anticipating the European Central Bank’s next monetary decision, set for next Thursday. Following seven consecutive rate hikes, the bank is expected to hike its key lending rate by 25 basis points, even as higher borrowing costs start to take a toll on the European economy.\n\nA weekly close above US$27,600 in Bitcoin would signal more uptrend, while a close below US$25,350 means more bearish momentum, Johnny Louey, a crypto research analyst at trading platform LiquidityTech Protocol told Forkast in a Telegram message.\n\nYield App’s Kiely said that he only expects significant upward momentum after a close above US$30,500.\n\n“Multiple closes above this number and we could be at the onset of a new bull market. It could trade in the mid-term as low as US$24,000. If it breaks that level, it could continue to trade downwards,“ wrote Kiely.\n\nSee related article: What’s next for crypto miners after US debt ceiling deal?"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXBheW1lbnRzLWZpcm0tc3RyaWtlLW1vdmVzLTE4MTgwMzIzOS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Payments Firm Strike Moves Custody In-House After Ditching Third-Party Services - Yahoo Finance",
        "content": "Digital payments firm Strike has moved all customer bitcoin (BTC) and U.S. dollar (USD) assets to its own in-house infrastructure, according to a June 8 blog post by CEO and cofounder Jack Mallers.\n\nI just published Strike Infrastructure Update: We Now Serve Customers on Our Own Infrastructure\n\n\n\nWe're proud to offer our own safe and reliable infrastructure to custody our customers' #Bitcoin and U.S. dollars.\n\nhttps://t.co/rMBiXeG0zI — Jack Mallers (@jackmallers) June 8, 2023\n\nMallers says the move is part of a two-year effort and will reduce counterparty risk while ensuring the robustness and performance of the company’s products and services. His announcement comes in the wake of bankruptcy rumors about Strike’s former custodian, Prime Trust, which has agreed to sell itself to digital asset custody rival BitGo. Fellow Bitcoin financial services firm Swan Bitcoin also recently abandoned Prime Trust.\n\nRead more: Crypto Custody Firm BitGo Reaches Preliminary Agreement to Buy Prime Trust: Sources\n\nStrike declined to comment on the situation surrounding its former custodian, emphasizing that its plan to move custody in-house has been two years in the making. The company’s customer base, spread across more than 65 countries, will now custody bitcoin and fiat directly with Strike.\n\n“I’m proud to announce Strike now owns and operates all of its own infrastructure for customers,” Mallers wrote. “Strike now custodies customer bitcoin and dollars, which means no custodial intermediaries between us and our users.”\n\nBenefits of the transition\n\nMallers says the transition to in-house custody brings short and long-term benefits to users.\n\n“Because of our infrastructure enhancements, we’ve begun rolling out a lot of awesome new features and capabilities that are now live,” Mallers explained.\n\nStory continues\n\nStrike users can now send bitcoin directly to other users on a peer-to-peer basis. They can also opt to receive funds as cash or bitcoin. Bitcoin payments can be made directly on-chain or via the Bitcoin Lightning Network – a second layer payment system for cheaper and faster bitcoin transactions.\n\nDeposit limits have been increased and on-chain payments are now tiered, allowing users to pay higher fees for faster payments and lower fees for slower, less urgent transactions.\n\nThe 29-year-old says his company has “some serious ambitions” in the long-term.\n\n“Global on/off ramps, instant withdrawals, new DCA [dollar cost averaging] capabilities, continuing to improve our limits, more cross-currency capabilities, and more things we hope to bring soon,” Mallers said."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzEwL2NvdWxkLWJpdGNvaW4taGVscC15b3UtYmVjb21lLWEtbWlsbGlvbmFpcmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Could Bitcoin Help You Become a Millionaire? - The Motley Fool",
        "content": "Since July 2010 (the earliest data available from coinmarketcap.com), Bitcoin has produced a ridiculous return of nearly 43,000,000%. That crushes the gains of both the S&P 500 and Nasdaq Composite Index by insanely wide margins. And it has no doubt made some early adopters extremely wealthy.\n\nEven though Bitcoin has been around for about 14 years, I don't think it's too late to get in on the action. Right now, the price is 61% off its all-time high from November 2021, so there is some heightened pessimism around this top cryptocurrency. But can buying now help you become a millionaire?\n\nGiven enough time, I believe the answer is a resounding \"yes.\"\n\nThere is a clear need for Bitcoin\n\nIt's important to first take a step back and understand why Bitcoin is even needed in the world. Think about citizens dealing with corrupt governments (like Mexico's), or currencies that experience hyperinflation (like in Venezuela), or countries ravaged by war (like Afghanistan). The people in these places can't rely on the current financial systems that are in place. A decentralized form of money that can't be confiscated, that isn't controlled by anyone, and that can be stored on the internet or devices that connect to the web is extremely valuable in these types of situations.\n\nIn the U.S., skeptics would make the argument that there is no need for Bitcoin because we have a robust payments industry and developed capital markets. This misses the point that Bitcoin is a global network. Moreover, we take our working financial infrastructure for granted, while people in other countries struggle with a lack of basic banking services or stable currency.\n\nPlus, Bitcoin does serve a need in the U.S. Some investors and institutions are keen on holding a portion of their wealth in the world's most valuable cryptocurrency. That's because Bitcoin has a fixed supply cap of 21 million, yet over the past decade, central banks around the world have pumped so much money into the economy to stimulate growth after the Great Recession and throughout the coronavirus pandemic. The more fiat money, or government-backed currency, that there is relative to Bitcoin, the better the prospects for the latter's price appreciation.\n\nThe staggering debt burden of the U.S., which will only be exacerbated by further increases of the national debt ceiling in the future, also tells me that we can't keep interest rates high for too long. This increases the odds of elevated levels of inflation for extended periods of time. Holding Bitcoin makes even more sense with this in mind.\n\nRunning the numbers\n\nBitcoin has a market cap of about $516 billion. But let's say that a decade from now, its entire value equals that of the total value of all the world's gold, or roughly $12.5 trillion. I don't think this scenario is out of the question. As more individuals, corporations, and governments learn about Bitcoin and its attractive properties, it's probable that they would at least store a small fraction of their investable assets or reserves in it.\n\nThis would mean that Bitcoin's price would rise about 25-fold between now and the summer of 2033. This performance would likely crush what investors could earn putting their money in the stock market (or any asset class, for that matter). This projection suggests that a $40,000 investment in Bitcoin today could make someone a millionaire in 10 years' time.\n\nTo be clear, there are a ton of risks to think about. The most pressing one is the threat of governments banning Bitcoin and other cryptocurrencies, making it illegal to buy and own these digital assets. That's something to always keep in mind. Additionally, Bitcoin simply might not be adopted as widely as many hope.\n\nBitcoin could reach that projected value in a much longer time frame, or maybe not at all. The range of outcomes is vast.\n\nNonetheless, the potential is certainly there for Bitcoin to make you a millionaire."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9iaXRjb2luLWFzLWRpZ2l0YWwtZ29sZC1uYXJyYXRpdmUtcmV0dXJucy1mb3ItY3J5cHRvLW5hdGl2ZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin's 'digital gold' narrative sees renaissance — even as pro traders balk - DLNews",
        "content": "JPMorgan analysts say Bitcoin could track gold higher, reaching up to $45,000.\n\nPro traders, as well as commodities analysts, say Bitcoin is too speculative to be considered gold-like.\n\nThe narratives underlie the surging cryptocurrency, which has gained about 50% this year.\n\nBitcoin’s digital gold comparisons are mounting with the top cryptocurrency trading back around levels last seen in July of last year.\n\nJPMorgan analysts say Bitcoin could track gold higher over the next year. Even as sophisticated investors retreat from the top cryptocurrency, analysts say Bitcoin and gold were viewed as hedges to a “catastrophic scenario.”\n\nNOW READ: Even non-crypto people are asking ‘what’s going on’ with Bitcoin’s surge to $30,000\n\nFor crypto natives, Bitcoin has long been framed as a haven outside the traditional finance sector, especially in times of economic and monetary strife. This year’s banking crisis, along with regulatory crackdowns on crypto exchanges, have helped fuel that idea.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nClouding this narrative is that for pro traders, Bitcoin is a risk-on asset. Indeed, Bitcoin has tracked the tech-stock heavy Nasdaq higher — the Nasdaq has jumped about 28% this year, while Bitcoin has rocketed up about 50%.\n\nBitcoin has enjoyed many narratives over its 14-year history, most dividing insiders and outsiders. The asset’s pseudonymous founder envisaged a peer-to-peer version of electronic cash that would allow users to avoid financial institutions.\n\n“Bitcoin – the seminal cryptocurrency – has been many things over its 14 years of existence: a proof-of-concept, tech plaything, a monetary vehicle for criminals, digital gold, etc.,” Ryan Shea, a crypto economist at Trakx, wrote last month.\n\nThe digital gold narrative for Bitcoin is undergoing a renaissance, Shea added.\n\nJoin the community to get our latest stories and updates\n\nHedges in catastrophic times\n\nBitcoin and gold were viewed as hedges during the US banking crisis in March, JPMorgan said. Institutional investors favoured gold while retail shifted to Bitcoin during the crisis that saw lenders like Signature Bank and Silicon Valley Bank shutter.\n\nJPMorgan’s Nikolaos Panigirtzoglou said the banking crisis in the US “exposed the weaknesses of the traditional finance system,” driving crypto natives to Bitcoin. From a macroeconomic perspective, the bailouts of those banks played a role.\n\nNOW READ: Hodling pays off for patient Bitcoin investors with 1,000x returns\n\n“Extra liquidity, that’s the difference,” between the haven narrative and the cryptocurrency’s tendency to mirror more risk-on assets, Markus Thielen, head of crypto research and strategy at Matrixport, told DL News in March. He spoke after news of the US government’s intervention in the collapse of Silicon Valley Bank.\n\n“It went risk-on when the Fed provided deposit guarantees and traders realised that liquidity would be pumped into the system,” even as “some parts of the economy are in stress,” including banks, he said. “This is helping Bitcoin.”\n\nDemand for both\n\nDemand for both may be rising in tandem, with some retail investors buying Bitcoin as a speculative play, while others buy gold for “all the usual reasons,” Metals Focus analysts told DL News.\n\n“We would still not go as far as saying Bitcoin is a ‘digital’ form of gold even though they may have benefitted from the same drivers recently,” they added, noting that gold, the S&P 500 and Bitcoin have rallied together in the past, and, “nobody says stocks are the new gold.”\n\nBitcoin is too speculative in nature with too many structural unknowns to be considered gold-like, Metals Focus analysts added, noting that the exchange’s collapse can drive the price of Bitcoin.\n\nBitcoin’s correlation with gold turned negative today for the first time since March.\n\nBitcoin's correlation to gold just turned negative (Kaiko)\n\nPro traders and their crypto-native counterparts are also dealing with signs of the dollar’s eroding hegemony.\n\n“As the de-dollarization narrative starts to take shape, it would be rational to expect both risk assets and gold to perform, which would act as a secular tailwind for Bitcoin,” Jonah Van Bourg, global head of trading at DRW’s Cumberland, told DL News.\n\nNOW READ: Bitcoin becomes haven during bank bloodbath with 28% surge: ‘Extra liquidity, that’s the difference’\n\nBitcoin will eventually trade on its own fundamentals, Ed Moya, senior markets analyst at Oanda told DL News. “It might not necessarily end up being digital gold,” he added. “We could see a strong divergence” next year.\n\nInstitutions ditch Bitcoin\n\nBitcoin might be a gold-like play in the eyes of retail investors, but sophisticated traders have been decreasing their holdings over the past two years.\n\nJPMorgan took wallets holding less than 10 BTC as a proxy for retail investors, and those with more than 10 BTC as a proxy for institutional investors –– which includes family offices and wealthy individuals, asset managers, crypto exchanges, Bitcoin miners, funds, ETFs, and early Bitcoin investors.\n\nRetail traders have increased holdings this year, while institutional holdings have steadily declined.\n\n“In fact, the institutional impulse has been declining since 2022,” JPMorgan said last week.\n\nOn-chain Bitcoin flows, retail vs. institutions (JPMorgan)\n\n“Retail investors’ demand for bitcoin is likely to strengthen as we approach the April 2024 halving event,” JPMorgan said. The bank expects Bitcoin to trade in a range of $40,000 to $45,000 leading up to this.\n\nMoya said that Bitcoin will likely trade between $30,000 and $40,000, “if the regulatory environment doesn’t kill crypto,” in the meantime."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW5zLXByaWNlLW1haW50YWlucy0yNi01ay1kZXNwaXRlLWNvbnRpbnVlZC1yZWd1bGF0b3J5LXdvZXMtY3J5cHRvc2xhdGUtd21hcmtldC11cGRhdGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin's price maintains $26.5K despite continued regulatory woes - CryptoSlate",
        "content": "The cryptocurrency market saw mild net inflows of $0.23 billion over the last 24 hours and currently stands at $1.11 trillion — up 0.22%.\n\nDuring the reporting period, Bitcoin (BTC) market cap rose 0.55% to 515.53 billion, while Ethereum’s (ETH) market cap fell 0.14% to 221.42 billion.\n\nThe top 10 digital assets by market cap posted gains during the reporting period, except for Ethereum, BNB, and Cardano.\n\nADA topped the losers list with a 3.31% loss, while Solana led the gainers with a 1.98% increase.\n\nTether’s market cap (USDT) increased to $83.34 billion. The market cap of rival stablecoins USD Coin (USDC) and Binance USD (BUSD) continued their descents and currently stand at $28.43 billion and $4.86 billion, respectively.\n\nBitcoin\n\nBitcoin gained 0.55% and traded at $26,638 as of 07:00 ET. Its market dominance rose to 46.7% from 46.6%\n\nBTC peaked at $26,797 during the reporting period despite Binance.US announcing that its USD channels would be closed from June 13. CryptoSlate Research reported that the flagship digital asset maintained performance above $25,300.\n\nEthereum\n\nOver the last 24 hours, Ethereum lost 0.14% to trade at $1,844 as of 07:00 ET. Its market dominance fell to 20.0% from 20.1%.\n\nETH peaked at $1,861 during the reporting period before dropping to its current levels.\n\nTop 5 Gainers\n\nBDX is the day’s biggest gainer, growing 10.2% over the last 24 hours to $0.049 as of press time. The project has gained over 23% in the previous week. Its market cap stood at $265.72 million.\n\nMOB rose 9.37% over the last 24 hours to $0.64 as of press time. The privacy coin is down 16% in the previous 30 days. It has a market cap of $125.03 million.\n\nKASPA jumped 8% to $0.015 during the last 24 hours. A data agency in France 10h11 started accepting the digital asset as a payment method, according to a June 7 tweet from the project. Its market cap stood at $300.82 million.\n\nBICO increased 5.75% to trade at $0.25 at the time of writing. The network’s account abstraction feature enjoys more adoption, performing almost 20,000 transactions during the first week of June. Its market cap stood at $140.42 million.\n\nSKL gained 4.41% to $0.031 as of press time. Despite today’s upside, the Ethereum-based token has shed 10% in the last seven days. Its market cap stood at $106.77 million.\n\nTop 5 Losers\n\nHEX is the day’s biggest loser, falling 11.13% to $0.00989 at the time of press. The token has been on a downward trend over the past month, down 86%. Its market cap stood at $1.72 billion.\n\nRLC is back among the top losers’ list. The token fell 7.63% to $1.38 over the reporting period. Its market cap stood at $100.33 million.\n\nOCEAN lost 4.45% to trade at $0.105 as of press time. Its market cap stood at $205.2 million.\n\nNYM had sunk 3.94% to $4.67 as of press time. The privacy network introduced a socks5 client that allows users proxy desktop application traffic through the mixnet. Its market cap stood at $104.44 million.\n\nFLEX is down 1.78% in the last 24 hours and was trading for $2.46 at the time of writing. The exchange token is among the top gainers for the previous seven days, rising 122%. Its market cap stood at $242.81 million.\n\nMentioned in this article"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNhbi1nYWluLTYwLWlmLXRleHRib29rLWNoYXJ0LXBhdHRlcm4tY29uZmlybXMtdHJhZGVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price can gain 60% if 'textbook' chart pattern confirms — Trader - Cointelegraph",
        "content": "Bitcoin (BTC) may be in line for a 60% upside if a long-term chart feature stays intact.\n\nIn part of his latest analysis on June 8, popular trader Mikybull Crypto flagged encouraging signs on the BTC/USD weekly chart.\n\nWeekly Bitcoin price chart keeps $40,000 on the table\n\nWith Bitcoin still wedged in a narrow trading range it entered almost three months ago, market participants have little to go on when it comes to short-term price targets.\n\nDay-to-day performance has offered no decisive trend up or down, and $30,000 remains formidable resistance overhead.\n\n“The market is still in the same position it has been the past few days. Don't get chopped up, place some bids at the extremes and wait,” trader Jelle suggested in advice now typical of the current market perspective.\n\n“Stay focussed on the higher timeframe direction.”\n\nFor Mikybull Crypto, however, those higher timeframes point to some much more interesting price action around the corner.\n\nThe weekly chart, he argued, shows BTC/USD completing and now retesting an inverse head-and-shoulders pattern.\n\nThis is the bullish counterpart to the standard head-and-shoulders pattern, which shows resistance being cemented and is typically followed by downside.\n\nWhile daily timeframes have seen a bearish head-and-shoulders pattern materialize around April’s $31,000 local highs, the broader trend may yet play out in bulls’ favor.\n\n“Bitcoin is flashing a text book inverse head and shoulders on the weekly TF. Price is currently retesting the Neckline after the breakout,” Mikybull Crypto explained.\n\n“As taught, if the range between the head and neckline is usually the sprint, we are anticipating another 60% rally on BTC.”\n\nThat 60% “sprint” would place BTC/USD at around $40,000.\n\nBTC/USD annotated chart. Source: Mikybull Crypto/Twitter\n\nCasting aside rangebound “expectations”\n\nThe $40,000 mark and the nearby area are, in fact, already a popular target for various traders.\n\nRelated: US Bitcoin supply fell over 10% in the past year — Glassnode\n\nCrypto Kaleo has continued to describe $40,000 as a “magnet” for the market, while Bitcoin price has preserved key support trend lines throughout the three-month range.\n\nIn a prediction this week, meanwhile, fellow trader and analyst Credible Crypto said that $40,000 would not form the ceiling for BTC in 2023.\n\n“Expectations: ‘The Bitcoin halving is in April 2024. Expect $BTC to go sideways between 20-40k for about 12 months which is when we accumulate as much Bitcoin as we can. Once the halving hits, we start our next bull run to 100k+ into 2025. WAGMI,‘” he told followers.\n\n“Reality: BTC makes a new ATH in 2023 leaving the majority sidelined. Not everyone makes it.“\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdS1zLWRvai1jaGFyZ2VzLTItcnVzc2lhbi1uYXRpb25hbHMtZm9yLWxhdW5kZXJpbmctYml0Y29pbi1mcm9tLW10LWdveC1oYWNrLTc1MTA1MzLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Justice Department Alleges Russian Nationals Responsible For Mt. Gox Hack - Investopedia",
        "content": "The U.S. Department of Justice (DOJ) said that Russian nationals Alexey Bilyuchenko and Aleksandr Verner were responsible for hacking now defunct cryptocurrency exchange Mt. Gox in 2011, laundering bitcoin from the hack, and operating an illicit crypto exchange of their own.\n\nKey Takeaways DOJ alleges that Alexey Bilyuchenko and Aleksandr Verner laundered bitcoin linked to the infamous Mt. Gox hack.\n\nThe funds were allegedly used to establish another exchange called BTC-e, which gained popularity among criminal networks.\n\nThe DOJ alleges that the accused engaged in fraudulent contracts with a New York-based bitcoin broker to launder the stolen bitcoins.\n\nMt. Gox collapsed in 2014, leaving users with substantial financial losses and ongoing uncertainty regarding the distribution of remaining assets from the Mt. Gox estate. The charges may lead to the recovery of more funds for Mt. Gox's victims.\n\nLaundering the Proceeds from the Mt. Gox Hack\n\nIn September 2011, Bilyuchenko, Verner, and their accomplices allegedly accessed the server hosting the cryptocurrency wallets of Mt. Gox, by far the largest bitcoin exchange at the time. With unauthorized access, they allegedly transferred bitcoins from Mt. Gox's wallets to their own controlled bitcoin addresses.\n\nOver the span of approximately three years, from September 2011 to May 2014, Bilyuchenko, Verner, and their co-conspirators are said to have stolen around 647,000 bitcoins from Mt. Gox. The stolen bitcoins were allegedly laundered through bitcoin addresses associated with accounts controlled by Bilyuchenko, Verner, and their accomplices on two other online bitcoin exchanges, as well as through a specific user account on Mt. Gox itself.\n\n\n\nThe DOJ's allegations also suggest that the accused individuals engaged in fraudulent contracts with a New York-based bitcoin broker to launder the stolen bitcoins originating from Mt. Gox. Mt. Gox collapsed and filed for bankruptcy in 2014, resulting in significant financial losses for numerous users who are still waiting for the distribution of the remaining assets from the Mt. Gox estate.\n\n\n\nAnother Russian national, Alexander Vinnik, was previously charged with operating BTC-e in 2017."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jcnlwdG8tYml6LXRoZS1zZWMtc3VtbWVyLWNyYWNrZG93bi1hcHBsZS1zcGF0aWFsLWNvbXB1dGluZy1hbmQtbWVyY2Fkby1iaXRjb2lu0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Crypto Biz: The SEC's summer crackdown, Apple's 'spatial computing,' and Mercado Bitcoin gears up - Cointelegraph",
        "content": "After a period of relative calm, the United States Securities and Exchange Commission (SEC) kicked off its summer crypto crackdown by targeting two major exchanges, Binance and Coinbase.\n\nA total of 13 charges have been filed against Binance. One of the allegations in the suit claims that funds from Binance and Binance.US were commingled into an account controlled by the Changpeng Zhao-associated company, Merit Peak.\n\nAs for Coinbase, the SEC claims it has been offering unregistered securities and was never registered as a broker, securities exchange or clearing agency. Many in the crypto industry have been puzzled by the allegations against Coinbase, primarily because it is a publicly-traded company and received a previous green light from the regulator.\n\nWhile not surprising, this week’s developments again shed light on the dubious practices of the SEC toward the crypto space, as it claimed companies failed to register with the regulator, despite the absence of a path to do so. Ripple CEO Brad Garlinghouse said the latest string of lawsuits is an attempt by the SEC to “distract” from the agency’s “FTX debacle” Let’s not forget the SEC has not sued FTX, although it has charged its founder and former executives.\n\nThe crypto space has seen sell-offs in tokens and stocks, services halted and heightened uncertainty in recent days, but these events may also bring something that the industry is eager for — legal clarity.\n\nAlong with the recent wave of lawsuits, this week’s Crypto Biz also explores Apple’s new headset moving beyond the metaverse, Brazil’s Mercado Bitcoin gets the green light for its fintech payments arm, and how European Union regulators are targeting fake news generated by artificial intelligence.\n\nSEC complaint hints at why Brian Brooks resigned as Binance​.US CEO\n\nThe SEC’s latest complaint against Binance could explain why former Binance.US CEO Brian Brooks chose to step down in August 2021, only three months after his appointment. According to legal sources, the complaint cites an “unnamed source” who ran Binance.US for a brief period in 2021. The dates correlate with the time that Brooks was CEO of the company. Brooks — a former top banking regulator — led operations at the crypto exchange after replacing former CEO Catherine Coley. According to comments cited in the complaint, Brooks quickly realized that he was “not actually the one running this company.” Upon recognizing this, he decided to leave, announcing his resignation just three months later.\n\n1/ The SEC complaint against @Binance appears to solve the mystery of why Brian Brooks abruptly resigned as CEO of @BinanceUS in 2021.\n\n\n\nCZ allegedly reneged on promises that Brooks would be given autonomy to run https://t.co/reBq6K7KAs independently from @Binance. — MetaLawMan (@MetaLawMan) June 5, 2023\n\nBrazilian crypto exchange Mercado Bitcoin licensed as payment provider\n\nCryptocurrency exchange Mercado Bitcoin was granted a payment provider license from Brazil’s central bank on June 2. With the license, the company will launch its fintech solution MB Pay. The fintech arm will provide Brazilian users with specific digital banking services using crypto assets held on the exchange, such as digital fixed-income investments, staking and other financial transactions. A debit card offering a crypto off-ramp for users is expected to go live soon. Global crypto exchanges operating in Brazil’s market include Binance, Coinbase, Crypto.com and Bitso.\n\nApple’s Vision Pro headset reveal swaps metaverse for ‘spatial computing’\n\nApple’s newly revealed mixed-reality headset, the Apple Vision Pro, has turned tech-enthusiast heads in the past few days. The company, however, deliberately labeled its technology the first “spatial computer” to move away from the metaverse concept and differentiate its virtual reality tool from competitors. Apple’s marketing is focused on the words “spatial” and “spatial computing” rather than words such as “metaverse,” “AR,” and “VR.” A clear step away from Microsoft’s Hololens and Meta’s headsets. Apple’s headset will be launched in the U.S. in early 2024, for a hefty retail price of $3,499, before expanding internationally.\n\nUsing apps with Apple Vision Pro. Source: Apple\n\nEU officials want all AI-generated content to be labeled\n\nA new effort by the European Union to stamp out fake news targets artificial intelligence-generated content. According to EU officials, companies deploying generative AI tools should label their content to combat fake news. The statement comes as the EU prepares its forthcoming Artificial Intelligence Act, which will be a comprehensive set of guidelines for the public use of AI and the companies deploying it. Major tech companies, including Google, Microsoft and Meta Platforms, have already signed onto the EU’s 2022 Code of Practice on Disinformation.\n\nCrypto Biz is your weekly pulse of the business behind blockchain and crypto, delivered directly to your inbox every Thursday."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy1hYm92ZS0yNjUwMC1ibmItY2FyZGFuby1mYWxsLXVwLXRvLTMvYXJ0aWNsZXNob3cvMTAwODcwNTIyLmNtc9IBlgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1ob2xkcy1hYm92ZS0yNjUwMC1ibmItY2FyZGFuby1mYWxsLXVwLXRvLTMvYW1wX2FydGljbGVzaG93LzEwMDg3MDUyMi5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $26,500; BNB, Cardano fall up to 3% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading mixed on Friday. Bitcoin, XRP , and Polygon were trading with gains, while Ethereum, BNB , and Cardano were trading with cuts.Bitcoin (BTC) rose 0.58% to $26,532, whereas Ethereum (ETH) was below the $1,850 level. The global cryptocurrency market cap was trading higher around $1.1 trillion, rising 0.53% in the last 24 hours.\"Crypto markets have traded sideways in the last 24 hours. The crypto fear and greed index continues to maintain yesterday’s position right in the middle of the scale with 50 points. BTC’s hold around $26.5k remains firm despite events pertaining to the SEC lawsuits and the upcoming monetary policy decision by the Feds due next week,\" Parth Chaturvedi, Investments Lead at CoinSwitch Ventures, said.The total volume in DeFi stood at $1.91 billion, 7.38% of the total crypto market 24-hour volume. The volume of all stablecoins is at $24.7 billion, which is 95.36% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $515 billion. BTC volume stood at approximately $11.85 billion, falling 31.34% in the last 24 hours. Bitcoin’s dominance is currently 46.69%, an increase of 0.10% over the day, according to CoinMarketCap.\"The SEC action on crypto firms has not impacted BTC prices in a big way as the world’s largest crypto holds strong above the $26,000 mark. The largest altcoin, ETH, also remains resilient and did not slide further in the last 24 hours which is mainly due to optimism around Fed’s monetary policy decision which is due next week. There is a sense in the market that Fed may relax its hawkish stance to boost market liquidity,\" Shivam Thakral, CEO of BuyUcoin, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 45, with a neutral outlook. The Stochastic %K (14, 3, 3) at 35 and the Average Directional Index (14) at 22 indicate a Neutral outlook as well.\"The MACD Level (12, 26), at −261, indicates Sell. The Stochastic RSI Fast (3, 3, 14, 14) is Neutral at 41 and William's Percentage indicates Neutral at -64 as well,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.27 hours, IST on June 9, 2023)Bitcoin $26,532 0.58%Ethereum $1,838 -0.10%Tether $1.00 -0.04%BNB $258 -0.51%XRP $0.5231 0.53%Cardano $0.3169 -2.98% Dogecoin $0.6776 0.03%Polygon $0.7797 1.83% Litecoin $87.79 -0.41%Polkadot $5.01 -0.48%Tron $0.07765 0.93%Avalanche $13.83 -0.52%Shiba Inu $0.000007925 -0.16%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3Lm5hdGxhd3Jldmlldy5jb20vYXJ0aWNsZS9kZWxhd2FyZS1iYW5rcnVwdGN5LWNvdXJ0LWFwcHJvdmVzLWRpcC1maW5hbmNpbmctNzAwLWJpdGNvaW7SAWVodHRwczovL3d3dy5uYXRsYXdyZXZpZXcuY29tL2FydGljbGUvZGVsYXdhcmUtYmFua3J1cHRjeS1jb3VydC1hcHByb3Zlcy1kaXAtZmluYW5jaW5nLTcwMC1iaXRjb2luP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 10 Jun 2023 07:00:00 GMT",
        "title": "Delaware Bankruptcy Court Approves DIP Financing of 700 Bitcoin - The National Law Review",
        "content": "On May 8, 2023, online cryptocurrency exchange platform Bittrex, Inc. and three of its affiliated entities (collectively “Bittrex”) filed for chapter 11 to wind down their U.S. and long-dormant Malta operations. The bankruptcy filing followed costly regulatory investigations and an April 17, 2023 SEC enforcement action alleging that Bittrex improperly sold crypto assets that were securities. Unlike other crypto bankruptcies, Bittrex did not risk, hypothecate, or loan cryptocurrencies needed to meet its contractual obligations to its customers. Instead, since March 31, 2023, Bittrex had been urging its 5.4 million customers to withdraw their cryptocurrency deposits. Bittrex’s ultimate goal in its case is to pay all customer’s claims in full as soon as possible.\n\nWhat is particularly interesting about the Bittrex case is that for the first time, on June 7, 2023, a bankruptcy court authorized a debtor to obtain postpetition financing solely in bitcoin (“BTC”) from the DIP lender.\n\nDIP Financing Motion\n\nBittrex filed a postpetition financing motion on the petition date requesting that Bittrex’s ultimate parent company, Aquila Holdings Inc. (“Aquila”), be authorized to issue a DIP loan of 700 BTC to Bittrex. The DIP financing agreement provides that Aquila is entitled to a non-priming, super-priority administrative claim pursuant to section 364(c) of the Bankruptcy Code (i.e., higher priority over any and all administrative expense claims), but does not grant Aquila a security interest in any of Bittrex’s assets. Bittrex intends to use the DIP loan to fund the bankruptcy case and make distributions of cryptocurrency holdings to its former customers.\n\nThere were several reasons why Aquila required the DIP loan to consist exclusively of BTC rather than fiat currency. First, in the crypto industry it is common for participants to borrow funds in BTC. Second, after fiat banking services provider Silvergate Bank closed, it became very difficult for a cryptocurrency firm in wind-down mode to access fiat currency. And perhaps most importantly, Aquila would face negative tax consequences if it was required to liquidate its BTC, which would greatly increase the expense of Bittrex’s DIP loan.\n\nAccording to the financing motion, once Bittrex receives the BTC from Aquila, Bittrex will promptly convert the BTC into U.S. dollars to minimize the risk of currency rate fluctuations. Bittrex will then use the BTC proceeds to pay administrative expenses in accordance with the budget attached to the motion. Bittrex will need to repay the DIP loan principal no later than nine months after the interim order was entered (i.e., February 10, 2024), and the principal portion of the DIP loan must be repaid in BTC. Any other obligations, like the 4% interest per annum, may be repaid in BTC, U.S. dollars, or any combination thereof. To protect Bittrex against BTC price fluctuations between the time of borrowing and maturity, Bittrex negotiated a cap on the amount of additional BTC it may need to acquire to pay any shortfall. Specifically, Bittrex is only required to pay Aquila BTC equal to 110% of the value of the shortfall on the petition date. In other words, Bittrex is protected in the event the price of BTC rises after the petition date by only needing to pay Aquila up to 110% of the value of BTC advanced on the petition date.\n\nFor example, on the petition date the value of BTC in U.S. dollars was $28,611.44. The DIP loan is for 700 BTC, which means that on the maturity date Bittrex needs to repay 700 BTC to Aquila. If the price of BTC remained stable during the nine-month period, then Bittrex would need $20,028,008 worth of BTC to repay the DIP loan. But because the price of BTC constantly changes, if the price per BTC skyrockets following the petition date, Bittrex would only need to pay Aquila $22,030,808.80 of BTC (i.e., 110% of the value of BTC on the petition date) to satisfy the principal obligation, thus capping its risk.\n\nTakeaways\n\nBittrex’s DIP financing is relatively non-controversial – it does not include a rollup, does not prime any preexisting debt, does not impose a security interest against any assets, only includes a 4% interest rate per annum, meaningfully caps any upside Aquila may receive for postpetition increases in BTC valuation, and authorizes Bittrex to recognize any price savings if the value of BTC falls after the petition date. What may appear to be unique, at least for bankruptcy purposes, is that the loan is in BTC, although entities in the crypto industry commonly lend and borrow cryptocurrencies from one another. As crypto firms continue to file bankruptcy, Bittrex’s DIP facility may serve as a template for firms that intend to borrow BTC or other cryptocurrencies to finance their cases.\n\nBankruptcy practitioners can now seek to expand the scenarios for when BTC or other cryptocurrency DIP financing is acceptable in other cases. Debtors may begin to seek financing with more obscure cryptocurrencies or negotiate more complicated risk-transferring procedures to account for postpetition currency valuation fluctuations. For example, to obtain a lower interest rate or more value, debtors may agree to (i) a higher cap for a lender to obtain a larger principal payment (when valuations increase postpetition), and/or (ii) limit the floor of how large of a principal discount the debtor may obtain (when valuations drop postpetition).\n\nThe future has just begun to present creative cryptocurrency DIP financing solutions to debtors and lenders."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2NyeXB0by1yZXZvbHV0aW9uLWVhcmx5LWJpdGNvaW4tYW5kLWV0aGVyZXVtLWludmVzdG9ycy1maW5kLWdlbS1pbi1kaWdpdG9hZHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 09 Jun 2023 07:00:00 GMT",
        "title": "Crypto Revolution: Early Bitcoin and Ethereum Investors Find Gem In DigiToads - Analytics Insight",
        "content": "The crypto market has undergone a transformative revolution, with Bitcoin (BTC) and Ethereum (ETH) paving the way for a new era of digital assets. As these pioneering cryptocurrencies continue to shape the financial landscape, early investors have kept a keen eye out for the next profitable opportunity. DigiToads (TOADS), a remarkable discovery in this quest, has captivated investors’ attention.\n\nAs the crypto revolution gains momentum, the rise of DigiToads has become a beacon of potential, offering a unique best crypto investment prospect for those who dare to explore the uncharted territories of the digital realm. With the potential to revolutionize the blockchain landscape, TOADS has emerged as a hidden gem that promises untapped opportunities for those who recognize its immense value.\n\nThis article will explore DigiToads’ remarkable journey and why early Bitcoin and Ethereum investors find this cryptocurrency enticing.\n\nDigiToads (TOADS): A Web3 Gem Unleashing Unique Digital Creatures and Crypto Gaming Power\n\nDigiToads presents an excellent Web3 gaming platform that integrates collecting, nurturing, and engaging in battles with one-of-a-kind digital creatures called DigiToads. By combining innovative gameplay, community-focused initiatives, and promising investment potential, DigiToads has quickly become a hidden gem attracting the attention of early crypto adopters.\n\nTo make their DigiToads stronger in the competitive swamp arena, players can utilize TOADS DeFi tokens, the native currency of the DigiToads ecosystem. Players can enhance the size, strength, and abilities of their DigiToads by using TOADS tokens to acquire food, potions, and training equipment. This strategic approach gives players a competitive edge during battles against other players.\n\nDigiToads ensures that its community is consistently rewarded for its participation. At the end of each monthly season, the top 25% of players on the leaderboard receive TOADS DeFi tokens as a reward. 50% of the funds generated from in-game item sales are allocated to the prize fund, which is distributed.\n\nThe DigiToads project introduces an NFT staking platform where 2% of every TOADS transaction is allocated to a staking pool. This pool is distributed to NFT holders who regularly stake their cool NFTs. By incentivizing NFT holders to participate actively, DigiToads ensures continuous rewards and fosters a vibrant marketplace for digital collectibles.\n\nDigiToads presale has been strategically designed to offer substantial growth potential for early participants. In Lilypad 7 of the ten-stage presale, the project has raised over $4.7 million, with over 98% of the TOADS sold tokens. With an affordable presale price of 0.036 USD, investors can benefit from a potentially significant return on investment.\n\n>> Buy DigiToads Now <<\n\nBitcoin (BTC): Unveiling The Power of a Decentralized and Transparent Monetary System\n\nBitcoin, the first-ever decentralized cryptocurrency, emerged as a groundbreaking financial innovation. Early BTC investors were visionaries who recognized the potential of this pioneering technology. They saw beyond the skepticism and uncertainty surrounding cryptocurrencies then and embraced the idea of a decentralized and transparent monetary system.\n\nAmid the ongoing crypto revolution, early BTC investors have found a promising gem in DigiToads. These investors have discovered a valuable asset in DigiToads, as it promises to generate significant returns on investment, similar to the early days of Bitcoin and Ethereum.\n\nEthereum (ETH): Pioneering Smart Contracts and Decentralized Applications\n\nEthereum, often hailed as the pioneer of smart contracts and decentralized applications, continues to shape the landscape of blockchain technology. ETH is a powerful medium for facilitating peer-to-peer transactions and powering decentralized finance (DeFi) protocols.\n\nEarly investors in ETH have recently discovered the untapped opportunities in DigiToads. These Ethereum investors recognized the value of DigiToads’ innovative approach to cool NFTs and its potential for mass adoption in the booming NFT market.\n\n>> Buy DigiToads Now <<\n\nSummary\n\nThe ongoing crypto revolution has opened up unprecedented opportunities for early investors seeking the best crypto investment, particularly those with foresight in identifying promising projects. DigiToads has emerged as a true gem among these projects for early Bitcoin and Ethereum investors. With its innovative approach to non-fungible tokens (NFTs) and its dedicated community, DigiToads has proven itself as a valuable asset in the crypto space. Join the ranks of visionary investors and embrace the potential of DigiToads today!\n\nFor more information on DigiToads visit the website, join the presale or join the community for regular updates.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    }
]