[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZGFpbHljb2luLmNvbS9iaXRjb2luLWJ0Yy1iaXJ0aC1jcnlwdG9jdXJyZW5jeS1ibG9ja2NoYWluLXJldm9sdXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC): The Birth of Cryptocurrency and the Blockchain Revolution - DailyCoin",
        "content": "Bitcoin (BTC) has been given plenty of names in its lifetime. Digital Gold, The Future of Money, even ‘The Biggest Ponzi Scheme in Human History.’ Over a decade has passed since Satoshi Nakamoto published the Bitcoin Whitepaper. Despite bitcoin price volatility and what its naysayers would have you believe, Bitcoin is here to stay.\n\nNot only has Bitcoin stood the test of time, the world’s largest digital asset also inspired a technological revolution. Cryptocurrency and blockchain technology are re-inventing how we store our funds and manage our finances online in a way that traditional systems, like central banks, cannot replicate.\n\nDecentralized and fully open-source, the bitcoin network has given people greater control over their finances than ever before. It blazed the trail for other digital currencies, like Ethereum (ETH) and Ripple (XRP), to innovate and improve. While it’s more often considered a store of value than a currency these days, Bitcoin is still the centerpiece of the crypto market.\n\nWhat is Bitcoin? What is bitcoin mining and Proof-of-Work? Will Bitcoin always be king, or is it possible that altcoins like Ether or BNB will siphon BTC’s market cap and take its place at the top?\n\nWhat Is Bitcoin?\n\nBitcoin is a cryptocurrency, a kind of digital asset that’s used in the same way as fiat currencies like USD. With BTC, users can pay for goods and services and send funds to friends and family using a decentralized, peer-to-peer network.\n\nSounds like normal money, right?\n\nNot really.\n\nFiat currencies, such as the USD or EUR, are controlled and governed by centralized bodies. They’re often stored in central banks that can deny users access to their funds. If I want to transfer fiat currency to someone, I must trust an intermediary to settle the payment. This third party could block the transfer or charge me extortionate fees for their services.\n\nOn the other hand, bitcoin transactions are trustless and permissionless. Nothing stops me from using the bitcoin blockchain and sending BTC directly to a friend or business over the network. Moreover, I can watch the transaction in real-time by tracking it transparently on-chain.\n\nHow does it all work, then? If there’s no intermediary to settle the payment, what ensures that bitcoin transactions are processed?\n\nHow Does Bitcoin Work?\n\nThe bitcoin network is powered by miners and a unique algorithm called the Proof-of-Work consensus mechanism. Bitcoin miners are responsible for processing transactions on the blockchain and producing, or ‘mining’ new blocks. Simply put, a block is a unit of data on the blockchain that records previous transactions.\n\nIn the Proof-of-Work mechanism, miners compete to produce new blocks. Using intensive computational power, Miners solve complex puzzles using cryptography. Miners earn BTC as a reward for solving these puzzles, which process bitcoin transactions and create new blocks for the network.\n\nAnother thing separating Bitcoin from traditional fiat currencies is that BTC has a fixed max supply of 21 million coins. This makes BTC immune to inflation and is one of the main reasons many investors consider BTC a store of value and a hedge against inflation.\n\nBitcoin miner rewards slowly diminish over time through a process called Bitcoin halving. After every 210,000 blocks, the amount of BTC distributed to miners is cut in half. When BTC was first launched in 2009, every new block released 50 BTC into the circulating supply. However, following the third halving in May 2020, these rewards have been reduced to just 6.25 BTC per block.\n\nWhat Can Bitcoin Be Used for?\n\nThe bitcoin network was originally designed to be a decentralized peer-to-peer payment network. As a result, it’s most commonly used to send and receive funds anonymously over the internet. However, BTC has grown beyond its initial use cases and is now considered a store of value, like gold. This makes it a popular investment vehicle for speculators.\n\nAs blockchain technology evolves, BTC is witnessing greater adoption and utility. El Salvador recognizes BTC as a legal tender, and businesses worldwide accept bitcoin payments in exchange for goods and services. Even publicly traded, NASDAQ-listed companies like Tesla hold BTC, and other altcoins like DOGE, on their balance sheets.\n\nWhat’s more, innovation across the cryptocurrency industry continues to bring further use cases to Bitcoin. For example, BTC can be wrapped and deployed onto other blockchain ecosystems. This means that bitcoin’s value and liquidity can be used in DeFi apps on Ethereum.\n\nWith the rise of Ordinals, the Bitcoin blockchain hosts its own NFTs. These ordinal NFTs exist on the Bitcoin network, denominating their value in BTC price. At the beginning of 2023, Ordinal trading volume brought renewed attention and fresh eyes to the world’s first cryptocurrency.\n\nBitcoin Pros & Cons\n\nObjectively, Bitcoin is far from perfect. While it provides a secure, transparent, and decentralized payment network available to anyone with an internet connection, the bitcoin blockchain still has drawbacks.\n\nBitcoin Pros\n\nDecentralized – The bitcoin network has no centralized owner or governance. Moreover, the blockchain is distributed, meaning the network will remain fully functional even if large mining operations unexpectedly collapse.\n\n– The bitcoin network has no centralized owner or governance. Moreover, the blockchain is distributed, meaning the network will remain fully functional even if large mining operations unexpectedly collapse. Fast – Bitcoin transactions are faster than traditional banking transfers and are not restricted by international borders. With bitcoin, you can send funds anywhere in the world in seconds.\n\n– Bitcoin transactions are faster than traditional banking transfers and are not restricted by international borders. With bitcoin, you can send funds anywhere in the world in seconds. Accessible – Anyone with access to the internet can own bitcoin and use it for payments. There are no invasive KYC procedures that might stop users from opening a bank account or accessing financial services.\n\n– Anyone with access to the internet can own bitcoin and use it for payments. There are no invasive KYC procedures that might stop users from opening a bank account or accessing financial services. Affordable – Bitcoin transactions cost anywhere between a few cents and a couple of dollars, dependent on network congestion. In a world where centralized banks can charge commissions on large transfers and international transactions, the bitcoin network is an affordable option.\n\n– Bitcoin transactions cost anywhere between a few cents and a couple of dollars, dependent on network congestion. In a world where centralized banks can charge commissions on large transfers and international transactions, the bitcoin network is an affordable option. Transparent – The Bitcoin blockchain is a transparent and publically verifiable ledger of transactions. The entire protocol is open-source, meaning anyone can verify its source code to ensure the network is safe.\n\nBitcoin Cons\n\nEnergy Consumption – One of bitcoin’s biggest criticisms is that it requires enormous computational power. Analysts like the Bitcoin Energy Consumption Index estimate that over a year, the bitcoin network uses as much energy as Kazakhstan and expels a carbon footprint comparable to Portugal.\n\n– One of bitcoin’s biggest criticisms is that it requires enormous computational power. Analysts like the Bitcoin Energy Consumption Index estimate that over a year, the bitcoin network uses as much energy as Kazakhstan and expels a carbon footprint comparable to Portugal. Scalability Issues – While the Bitcoin blockchain is faster and more affordable than traditional banking, competing blockchain payment networks like Ripple have developed far more scalable systems. While Bitcoin processes around 4-5 transactions per second, Ripple handles over 1,000, with reduced fees.\n\n– While the Bitcoin blockchain is faster and more affordable than traditional banking, competing blockchain payment networks like Ripple have developed far more scalable systems. While Bitcoin processes around 4-5 transactions per second, Ripple handles over 1,000, with reduced fees. Price Volatility – If you’ve spent time in the crypto market, you’ll understand that bitcoin prices are prone to unexpected drops and surges. These prices affect Bitcoin’s market capitalization, and this volatility makes it difficult to use BTC as a currency of exchange.\n\nBitcoin’s Mysterious Beginnings\n\nThe Global Financial Crisis of 2008 wreaked havoc on economies worldwide. Central banks and financial institutions were in critical debt after a sudden housing market crash destroyed the value of their assets. Governments were forced to bail out overleveraged banks and institutions, and the resulting credit crunch broke the global economy.\n\nIn 2008, Bitcoin’s anonymous founder, or group of founders, published the Bitcoin whitepaper. Satoshi Nakamoto’s iconic document has become a manifesto for crypto enthusiasts. In just a few months, the Bitcoin network was launched. Nakamoto themself mined the first block, immortalizing a significant line of text into the blockchain forever: “The Times 03/Jan/2009 Chancellor on brink of second bailout for banks.”\n\nSatoshi Nakamoto continued to contribute to the bitcoin project. However, in 2011 the enigmatic founder confirmed in an email to a friend that he’d moved on from Bitcoin. He remains anonymous, though it is widely accepted he is the world’s largest BTC holder.\n\nThe Future of Bitcoin\n\nDespite Nakamoto’s disappearance, the bitcoin community has continued to develop the network to keep up with the growth of the wider blockchain industry. Their primary adjective is to increase the network’s scalability without sacrificing its decentralization.\n\nWith the uprising of smart contracts and decentralized finance, parts of the bitcoin community are worried that the network will get left behind. Some developers are working towards deploying native bitcoin smart contracts in the ecosystem, which will provide greater utility to BTC moving forward.\n\nLightning Network\n\nInitially proposed in 2015, the Lightning network is a kind of Layer 2 scaling solution for Bitcoin transactions. It takes certain payments off-chain into specific channels between two trusted parties. The Lightning network is intended for smaller, everyday transactions like buying coffee. As the name would suggest, the Lightning network is faster and more affordable than Bitcoin’s main network.\n\nBitcoin Smart Contracts – TapRoot Upgrades & Stacks Network\n\nRecent Taproot upgrades have introduced basic payment smart contracts to the network to make Bitcoin more composable. However, given Bitcoin’s underlying immutable code, these contracts are rather limited and don’t come close to the flexibility provided by other Layer 1 networks like Ethereum.\n\nMeanwhile, the Stacks (STX) network is an open-source Layer-1 blockchain that connects to Bitcoin’s main chain. Stacks provide developers and users with a suitable environment to deploy more complex smart contracts. The project aims to bring smart contracts to the Bitcoin ecosystem while utilizing Bitcoin’s security.\n\nIn the same way that BTC can be wrapped and deployed on Ethereum as wBTC tokens, Stacks will host sBTC tokens that can be redeemed for BTC at a 1:1 ratio.\n\nOn the Flipside\n\nDespite providing the foundation for the entire cryptocurrency and blockchain industry, Bitcoin’s scalability issues make it difficult to use as a payment network. Bitcoin also devastates the environment and consumes as much energy per year as a small country.\n\nWhy You Should Care\n\nWithout Bitcoin, your favorite blockchain, NFT, or meme coin wouldn’t exist. It’s important to know why Bitcoin and blockchain technologies were created and how they work. This also extends to the value of true decentralization and self-custody, which are cornerstones of the cryptocurrency world.\n\nFAQs"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWxlYWRzLWNyeXB0by1yYWxseS1jZW50cmFsLTAzMzkxMjQzNC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin leads crypto rally as central banks promise liquidity to stem rising bank risk - Yahoo Finance",
        "content": "Bitcoin jumped over the weekend to briefly breach US$28,000 in a bullish trend that extended into Monday morning trading in Asia and helped send most of the top 10 non-stablecoin cryptocurrencies higher. Bitcoin led the gainers amid growing concern about the state of the global banking industry. Several central banks over the weekend said they would coordinate an effort to pump cash into markets to ensure liquidity. This after Swiss authorities orchestrated an emergency weekend takeover of global investment bank Credit Suisse by UBS, which in turn followed a series of bank failures in the U.S. this month.\n\nSee related article: Weekly Market Wrap: Bitcoin rises above US$26,000, as ‘store of value’ narrative strengthens amid bank failures\n\nBitcoin rose 2.96% in the past 24 hours to US$27,929 at 09:00 a.m. in Hong Kong to post a weekly gain of 23.24%, according to CoinMarketCap data. The world’s largest cryptocurrency has surged more than 66% from the start of the year and briefly traded above US$28,000 at the weekend, breaking that ceiling for the first time since June 12 last year.\n\nThe main driver behind Bitcoin’s gains is concern about the fragile economic landscape in the U.S., Kadan Stadelmann, chief technical officer of blockchain infrastructure development firm Komodo, told Forkast on Friday.\n\n“The Federal Reserve embarked upon a many-trillion dollar quantitative easing program, cut the minimum bank reserves from 10% to 0% on March 26, 2020, and led us into the current bout with inflation, which has led people to seek alternative ways to preserve wealth. Bitcoin has become a prominent option,“ wrote Stadelmann.\n\nEther dipped 0.02% to US$1,777, but is up 9.24% over the past seven days.\n\nXRP rose 2.61% to US$0.3874, up 3.04% for the week. Paul Grewal, chief legal officer at Coinbase, hinted in an interview with Thinking Crypto last Friday that Coinbase might relist XRP.\n\nPolygon’s Matic token fell 2.30% to US$1.16, slashing its gain for the week to just 0.23%, even after Polygon Labs unveiled a partnership with enterprise software giant Salesforce last Thursday to develop NFT-based loyalty programs.\n\nThe bank turmoil dominated moves in capital markets and may force the Federal Reserve to revise its monetary policy of raising interest rates, adding to inflation risks and prompting more investors to see Bitcoin as a safe haven, according to a Bloomberg News report on Monday.\n\nThe total crypto market capitalization rose 1.46% in the past 24 hours to US$1.17 trillion. Total trading volume over the last 24 hours dipped 2.70% to US$65.76 billion.\n\nWorries about the banking industry drove U.S. equities lower on Friday. The Dow Jones Industrial Average dropped 1.19%, the S&P 500 fell 1.10%, and the Nasdaq Composite Index moved 0.74% lower. Shares in First Republic Bank fell 32.80% on Friday despite a US$30 billion injection from major U.S. financial institutions earlier in the week.\n\nThe Federal Reserve on Sunday announced a coordinated move with the central banks of Canada, the U.K., European Union, Japan and Switzerland to make more U.S. dollars available to improve market liquidity.\n\nThe move to pump cash into markets helped U.S. stock futures edge up as of 9:00 a.m. in Hong Kong on Monday. The Dow Jones Industrial Average futures moved up 0.19%. The S&P 500 futures gained 0.28%, while the Nasdaq Composite Index rose 0.41%.\n\nOn the inflation front, the University of Michigan reported on Friday an unexpected drop in the U.S. consumer sentiment index in March, the first decline in four months. The report indicates the Federal Reserve’s higher interest rate policy of the past 12 months is cooling off inflation.\n\nU.S. interest rates are between 4.5% to 4.75%, the highest since October 2007. Analysts at the CME Group expect a 76.8% chance the Fed will raise rates by 25 basis points when the bank meets this week, and a 23.2% chance of no rate hike, an increase from 20.3% on Friday."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiiAFodHRwczovL2ZvcnR1bmUuY29tLzIwMjMvMDMvMTkvYml0Y29pbi10b3BzLTI4MDAwLWZvci1maXJzdC10aW1lLXNpbmNlLWp1bmUtMjAyMi1hbWlkLWJhbmtpbmctY2hhb3MtaGlnaC1pbmZsYXRpb24taG9wZXMtZm9yLWRvdmlzaC1mZWQv0gGMAWh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wMy8xOS9iaXRjb2luLXRvcHMtMjgwMDAtZm9yLWZpcnN0LXRpbWUtc2luY2UtanVuZS0yMDIyLWFtaWQtYmFua2luZy1jaGFvcy1oaWdoLWluZmxhdGlvbi1ob3Blcy1mb3ItZG92aXNoLWZlZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin tops $28,000 for first time since June 2022 amid banking chaos, high inflation, hopes for dovish Fed - Fortune",
        "content": "Turmoil in the banking sector, hotter-than expected inflation data, and renewed hopes for a dovish Federal Reserve has Bitcoin reaching levels not seen in about nine months.\n\nThe largest digital asset topped $28,000 for the first time since June 2022, trading for as much as $28,258 on Sunday. Since the start of the year, Bitcoin’s price has risen almost 70%. Other digital assets rallied as well — with Ethereum up about 17% since the start of last week and so-called altcoins like Solana and Cardano advancing, too.\n\nTraders waded high levels of uncertainty last week in markets. US two-year yields fluctuated wildly, and the Cboe Volatility Index, the so-called fear gauge also known as the VIX, spiked above 30. But Bitcoin kept steadfast — and straight up.\n\n“Bitcoin is correlated with liquidity conditions and real rates. Real rates have declined, liquidity conditions have expanded, and it looks as if we’re entering a new regime,” said Ilan Solot, co-head of digital assets at Marex.\n\nBroader markets fluctuated in the past week after a handful of US lenders failed, and fresh concerns arose around Credit Suisse Group AG before UBS Group AG agreed to buy its fellow Swiss bank on Sunday. In the fallout, some investors have called on the Fed to pause interest rate hikes. But midweek data showed that core CPI advanced more than expected, a reminder that the fight against inflation is far from done. It’s unclear how the central bank will respond to the conflicting signals at this week’s Fed meeting.\n\nThat uncertainty troubled many corners of the financial world but emboldened Bitcoin bulls who see the digital asset as a hedge against inflation, despite last year’s evidence to the contrary. In 2022, a series of bankruptcies and scandals pushed the price of Bitcoin down more than 60%.\n\nThe token also rose in spite of internal strife in the digital asset space. USD Coin briefly lost its peg with the dollar this month, and the US Securities & Exchange Commission is doubling down on the belief that most digital assets qualify as securities.\n\nThe S&P 500 dropped 1.1% on Friday. If Bitcoin were still trading like it did for much of 2022, the token would have slumped alongside US stocks. But this month, the correlation between the digital asset and the S&P 500 has dissipated.\n\n“In this instance, we are definitely seeing people look to Bitcoin,” said David Martin, head of institutional coverage at digital asset prime brokerage FalconX.\n\n–With assistance from Muyao Shen."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9mb3JtZXItY29pbmJhc2UtY3RvLW1ha2VzLTJtLWJldC1vbi1iaXRjb2luLXMtcGVyZm9ybWFuY2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Former Coinbase CTO makes $2M bet on Bitcoin's performance - Cointelegraph",
        "content": "Former Coinbase chief technology officer Balaji Srinivasan has made a millionaire bet on Bitcoin’s (BTC) price over the next 90 days, predicting the cryptocurrency will reach $1 million by June 17.\n\nThe wager was initiated on March 17, when pseudonymous Twitter user James Medlock offered to bet anyone $1 million that the United States would not experience hyperinflation. A few hours later, the former Coinbase executive accepted the bet.\n\nSir, I believe we have ourselves a deal https://t.co/9JYaLNo9Eq — James Medlock (@jdcmedlock) March 18, 2023\n\nUnder the proposed terms, if Bitcoin’s price fails to reach $1 million by June 17, Medlock will win $1 million worth of the dollar-pegged stablecoin USD Coin (USDC) and 1 BTC. In the same way, if Bitcoin is worth at least $1 million by the date, then Balaji can keep the 1 BTC and the $1 million in USDC. Srinivasan explained in the thread:\n\n“You buy 1 BTC. I will send $1M USD. This is ~40:1 odds as 1 BTC is worth ~$26k. The term is 90 days.”\n\nRelated: Banking crisis: What does it mean for crypto?\n\nPer the thread, other Twitter users helped set up a smart contract with the betting terms. Srinivasan also disclosed that he would move another $1 million in USDC for another wager on the same topic:\n\n“I am moving $2M into USDC for the bet. I will do it with Medlock and one other person, sufficient to prove the point. See my next tweet. Everyone else should just go buy Bitcoin, as it’ll be much cheaper for you than locking one up for 90 days.“\n\nMedlock and Srinivasan made the wager based on their different views of the U.S. economy’s future amid ongoing uncertainty regarding its banking system.\n\nSrinivasan argues that there’s an impending crisis that will lead to the deflation of the U.S. dollar and, thus, to a hyperinflation scenario that would take the BTC price to $1 million. Medlock, on the other hand, is bearish about upcoming hyperinflation in the country.\n\nMeanwhile, Bitcoin’s price has reached $27,387 at the time of writing, with its market capitalization adding over $194 billion year-to-date to a 66% growth in 2023, outperforming Wall Street bank stocks amid fears of a global banking crisis.\n\nAlso, for the first time in a year, BTC’s price has shifted away from United States stocks, rising about 65% compared to the S&P 500’s 2.5% gains and the Nasdaq’s 15% decline, Cointelegraph reported."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3LmNiYy5jYS9uZXdzL3BvbGl0aWNzL2NyeXB0by1taW5pbmctZWxlY3RyaWNpdHktcHJvdmluY2VzLTEuNjc4MDkwN9IBIGh0dHBzOi8vd3d3LmNiYy5jYS9hbXAvMS42NzgwOTA3?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Crypto at a crossroads: Some provinces are wary of the technology's vast appetite for electricity - CBC.ca",
        "content": "Proponents of cryptocurrency mining say the industry's future in Canada is hanging in the balance after several provinces moved to restrict new projects earlier this year in response to concerns about their electricity usage.\n\nCrypto entrepreneurs — most of them focused on Bitcoin — have been drawn to Canada because of the abundant supply of clean, inexpensive electricity in provinces like British Columbia and Quebec. Most crypto operations need unfettered access to cheap power to operate the rows of high-powered computers required for cryptomining.\n\n\"Why Canada? So, first of all, we said, 'What are the key ingredients you need to run this computing service?'\" said Dan Roberts, an Australian cryptocurrency entrepreneur whose company, Iris Energy, operates three facilities in B.C.\n\n\"Cool temperatures — really important. Stability of law, good regulatory jurisdiction. But most importantly, renewable energy.\"\n\nCBC News: The House 20:20 The power of cryptocurrency mining and its uncertain future Several Canadian provinces have moved to put limits on new cryptocurrency mining operations, putting into question Canada’s place in the emerging sector. In a special report, freelance journalist Bob Keating speaks with entrepreneurs who are pushing for more mining operations in Canada and B.C. Energy Minister Josie Osborne speaks with host Catherine Cullen about why her province has hit the brakes on new operations.\n\nRoberts said he sees a new wave of economic prosperity growing out of cryptocurrency mining in provinces like B.C., which currently enjoys an electricity surplus.\n\n\"We can build a whole industry around this. We can go into those regional towns where they've been decimated by the end of the pulp-and-paper mill … rehire local workers, retrain them, and deliver all these benefits back into the community,\" he said.\n\nBut some provinces have slammed the brakes on new projects, saying the mining sites — where computers churn through complex equations to verify cryptocurrency transactions on the blockchain ledger (earning digital assets as a reward) — consume a staggering amount of electrical power.\n\nB.C. currently has seven mining sites in operation, with six more in advanced states of development. But it also has imposed an 18-month moratorium on connecting any new crypto mining projects to its electrical grid — halting 21 other projects which the province says would have used the same amount of power as 570,000 homes.\n\nManitoba also has paused new crypto hookups, while Hydro-Québec has set up higher rates and an electricity usage cap for mining projects. Ontario has proposed excluding crypto miners from an incentive program that could allow them to save money on electricity.\n\nUncertainty clouds future investments\n\nRight now, Canadian crypto miners account for the fourth highest amount of computing power being contributed to the blockchain network, after crypto operations in the United States, China and Kazakhstan. Moves by some provinces to ration the sector's access to electricity have some crypto enthusiasts questioning whether Canada will continue to be a major player.\n\n\"As a public company, I have shareholders and I need to pause or not make decisions until I know what the rules are. And once I know what the rules are, I look at whether to invest in Canada or somewhere more lucrative,\" said Sheldon Bennett, CEO of DMG Blockchain Solutions and part of the Canadian Digital Asset Mining Coalition, an advocacy organization.\n\nB.C. Energy Minister Josie Osborne told The House B.C.'s decision to impose the moratorium was meant to give the province time to consult with the industry to make sure energy is being put to good use.\n\nThe Site C dam in B.C., under construction in 2021. (B.C. Hydro/submitted)\n\nWhile B.C. has an energy surplus right now, Osborne said that might not always be the case.\n\n\"We don't want to put that electricity at risk. It's why we have to take this pause right now and instead use the electricity for the best opportunities in the future,\" she told host Catherine Cullen.\n\nOsborne argued that in order for B.C. to achieve its climate and economic goals, it has to look at other areas where its electricity might be more useful.\n\n\"Cryptocurrency definitely does not create the number of jobs that other industry does,\" she said.\n\nIt also does nothing to help B.C. achieve its climate goals, she added.\n\n\"Cryptocurrency mining doesn't lower pollution in other industries,\" she said. \"We want to use that electricity for our mines and for forestry operations, for marine port operations, for hydrogen operations [so] we could use the hydrogen to blend natural gas and decarbonize there. We want to use these electrons for their highest and best use.\"\n\n\n\nOsborne did signal her government is somewhat open to hooking up new crypto operations in the future.\n\nDan Roberts, co-founder of the cryptocurrency company Iris Energy, says Canada's supply of clean energy is a huge draw for his industry. (Bob Keating/CBC)\n\nCryptocurrency was once a trendy topic in Canadian politics. It was championed by Pierre Poilievre during his successful run for the Conservative leadership (he famously bought a shawarma sandwich with Bitcoin just under a year ago).\n\nPoilievre suggested at the time that cryptocurrencies could allow ordinary Canadians to \"opt out\" of inflation because they are not influenced by central banks. That was before many cryptocurrencies crashed last year; Bitcoin's value in late 2022 had dropped to about one-fourth of what it had been a year prior.\n\nBut policy development on crypto is moving forward. The Canadian Securities Administrators (CSA), the umbrella organization representing Canada's provincial and territorial securities regulators, has pushed for restrictions on crypto trading, while the Bank of Canada is in the midst of a digital asset review .\n\nThe shift of some cryptocurrencies like Ethereum — the second largest cryptocurrency — to what's known as a \"proof of stake\" system has eliminated the need for mining, and thus for most of the currency's energy consumption. That's provided hope to some advocates that the energy argument against cryptocurrencies can one day be eliminated.\n\nBut Bitcoin remains on a \"proof of work\" model, where mining is key. Bennett said he wonders about Canada's willingness to engage with the new sector.\n\n\"What does Canada decide it wants to do with this industry? Does it want to foster it and grow it? Does it appreciate the technology, the jobs and the investment that's coming into it and want to grow that?\" he said.\n\n\"Or does it want to sit back and see how other countries manage it?\""
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmJzYy5uZXdzL3Bvc3QvZXgtY29pbmJhc2UtY3RvLXdhZ2Vycy0ybS1vbi1iaXRjb2luLXJlYWNoaW5nLTFtLWJ5LWp1bmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Ex Coinbase CTO Wagers $2M on Bitcoin Reaching $1M by June - BSC NEWS",
        "content": "Disclaimer: Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items,\n\n\n\nThis is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $1500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. : Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items, HERE and HERE This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $1500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\nDisclaimer: The content in the above article is a press release, provided by a third party. Readers should do their own research before interacting or engaging with the mentioned companies and/or any related services. BSC News is neither directly nor indirectly responsible for any damage or loss caused or alleged to be caused by or in connection with the use of any content, goods or services mentioned in the above article.\n\nDisclaimer: Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items,\n\n\n\nThis is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $2500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release. : Overall it is vital to proceed with caution when purchasing tokens that have just been listed. For those who have not already read our articles on safety in the BSC it is crucial to reference the following items, HERE and HERE This is a paid press release, BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement article for $2500. Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the press release.\n\nDisclaimer: This is a paid Ask Me Anything (AMA), BSC.News does not endorse and is not responsible for or liable for any content, accuracy, quality, advertising, products, or other materials on this page. The project team has purchased this advertisement AMA for $2000 Readers should do their own research before taking any actions related to the company. BSC.News is not responsible, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any content, goods, or services mentioned in the AMA.\n\nDisclaimer: This article is exclusive BSC News Premium Content. Premium content is viewable without a membership for a limited time. After the limited time period expires, readers will need to either subscribe or hold a BSC News NFT to view Premium Content. Visit the BSC News NFT website, Discord, and Twitter to learn more about becoming a Premium member.\n\nDisclaimer: The content of this piece is the opinion of the writer. Nothing in this article is intended to constitute financial advice. The content of this article is intended for entertainment and educational purposes only. Investing in cryptocurrency carries a high degree of risk. Capital is at risk, and returns are never guaranteed. You should always do your own research.\n\nDisclaimer: Disclaimer: This article is written by a visiting author. Opinions herein are those of the visiting author. Nothing in this article is intended to constitute financial advice. The content of this article is intended for entertainment and educational purposes only. Investing in cryptocurrency carries a high degree of risk. Capital is at risk, and returns are never guaranteed. You should always do your own research."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTE5L2JpdGNvaW4tYnRjLXRocml2ZXMtaW4tY2hhb3MtYnJlYWtzLWFib3ZlLTI4LTAwMC1mb3ItZmlyc3QtdGltZS1zaW5jZS1qdW5l0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Thrives in Chaos, Breaks Above $28000 For First Time Since June - Bloomberg",
        "content": "Turmoil in the banking sector, hotter-than expected inflation data, and renewed hopes for a dovish Federal Reserve has Bitcoin reaching levels not seen in about nine months.\n\nThe largest digital coin topped $28,000 for the first time since June 2022, trading at around $28,200 at 9:45 a.m in London on Monday. Bitcoin is now up more than 70% since the start of the year. Other tokens have rallied as well, with Ether gaining almost 50% since Dec. 31 and Solana, one of last year’s most beaten-down coins, more than doubling."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vbGVhcm4uYnliaXQuY29tL2NyeXB0by93aHktYml0Y29pbi1wcmljZXMtZGlmZmVyLWFjcm9zcy1leGNoYW5nZXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Why Bitcoin Prices Differ Across Exchanges & How to Profit via Arbitrage - Bybit Learn",
        "content": "Grab Up to 5,000 USDT in Rewards\n\nGet a 20 USDT Coupon instantly & earn more bonuses when you sign up today."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzIwL2ZlZC1lY2ItYW5kLW90aGVycy10YWtlLWNvb3JkaW5hdGVkLXN0ZXBzLXRvLWJvb3N0LWRvbGxhci1saXF1aWRpdHktYml0Y29pbi10b3BzLTI4ay_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMy8yMC9mZWQtZWNiLWFuZC1vdGhlcnMtdGFrZS1jb29yZGluYXRlZC1zdGVwcy10by1ib29zdC1kb2xsYXItbGlxdWlkaXR5LWJpdGNvaW4tdG9wcy0yOGsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Fed, ECB and Others Take Coordinated Steps to Boost Dollar Liquidity; Bitcoin Tops $28K - CoinDesk",
        "content": "More importantly, the Fed's backstopping of the global dollar liquidity reduces the risk of a worldwide dash for cash – investors selling everything, including bitcoin and other cryptocurrencies, and moving to cash, predominantly the U.S. dollar. During turmoil, investors typically sell risk assets and park money in cash, preferably the dollar. That drives up the cost of acquiring U.S. dollars, leading to stress in the financial system."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1hcmtldC1jYXAtZ3Jvd3MtNjAtaW4tMjAyMy1hcy10b3Atd2FsbC1zdHJlZXQtYmFua3MtbG9zZS0xMDBi0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin market cap grows 60% in 2023 as top Wall Street banks lose $100B - Cointelegraph",
        "content": "The market capitalization of Bitcoin (BTC) has added $194 billion in 2023. Its 66% year-to-date (YTD) growth vastly outperforms top Wall Street bank stocks, particularly as fears of a global banking crisis are rising.\n\nBTC market cap daily performance chart. Source: TradingView\n\nMoreover, Bitcoin has decoupled from United States stocks for the first time in a year, with its price rising about 65% versus S&P 500’s 2.5% gains and Nasdaq’s 15% decline in 2023.\n\nSPX and NDAQ YTD performance vs. BTC/USD. Source: TradingView\n\nWall Street banks lose $100B in 2023\n\nThe six largest U.S. banks — JPMorgan Chase, Bank of America, Citigroup, Wells Fargo, Morgan Stanley and Goldman Sachs — have lost nearly $100 billion in market valuation since the year’s start, according to data gathered by CompaniesMarketCap.com.\n\nBank of America’s stock is the worst performer among the Wall Street banking players, with a nearly 17% YTD drop in valuation. Goldman Sachs trails with an almost 12% YTD decrease, followed by Wells Fargo (9.74%), JPMorgan Chase (6.59%), Citi (3.62%) and Morgan Stanley (0.84%).\n\nWall Street banks YTD performance. Source: TradingView\n\nU.S. bank valuations have slid amid the ongoing U.S. regional banking collapse. That includes the announcement last week that Silvergate, a crypto-friendly bank, was closing its doors, followed by regulators' subsequent takeover of Signature Bank and Silicon Valley Bank.\n\nRelated: Breaking: SVB Financial Group files for Chapter 11 bankruptcy\n\nThe crisis further expanded with the near-collapse of First Republic Bank, which was saved at the last moment through a $30 billion combined injection by Wells Fargo, JPMorgan Chase, Bank of America and Citigroup — among others.\n\nCyprus and Greece deja vu?\n\nThe rise of Bitcoin in the face of a growing U.S. banking crisis is similar to how it reacted during banking collapses in Cyprus and Greece.\n\nBTC’s price grew by up to 5,000% amid the Cyprus financial crisis in 2013, prompted by the exposure of Cypriot banks to overleveraged regional real-estate companies.\n\nBTC/USD performance during Cyprus banking crisis. Source: TradingView\n\nThe situation was so dire in March 2013 that Cyprus authorities closed all banks to avoid a bank run.\n\nWhen Greece faced a similar crisis in 2015 and imposed capital controls on citizens to avoid a bank run, Bitcoin’s price gained 150%.\n\nBTC/USD performance during the Greece banking crisis. Source: TradingView\n\n“Fears over the stability of the banking system, along with declining real interest rates, creates a good environment for Bitcoin to rebound,” commented Ilan Solot, co-head of digital assets at London broker Marex, adding that the crypto “is seen by some investors as a hedge against systemic risks.“\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yZWFsaXN0aWMtZm9ybWVyLWNvaW5iYXNlLWN0by0yLTIxNTMzOTMxNS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "How Realistic Is Former Coinbase CTO's $2 Million Bitcoin Wager on US Hyperinflation? - Yahoo Finance",
        "content": "Coinbase’s former CTO Balaji Srinivasan wagered on Friday that the price of Bitcoin will benefit from a rapid devaluing of the U.S. dollar in the next three months, skyrocketing to $1 million by June 17.\n\nSrinivasan entered a bet with two individuals that same day, ponying up $1 million with the pseudonymous Twitter pundit James Medlock and another unnamed person. If Bitcoin fails to notch what would be historic gains, the two would receive $1 million in Circle’s USDC stablecoin each.\n\nThe bet is part of Srinivasan’s view that the global economy is teetering on the edge of rapid change, which he dubbed “hyperbitcoinization.” He predicts the U.S. dollar will enter a point of rapid hyperinflation, and the global economy then “redenominates on Bitcoin as digital gold.”\n\nIn this scenario, the market capitalization of Bitcoin—already the largest token—would increase to around $19.3 trillion from about $549 billion today, according to CoinGecko. For comparison, the value of the U.S. stock market was just over $40.5 trillion by the end of last year, according to Siblis Research.\n\nSrinivasan’s prediction comes amid a series of bank failures in the U.S. that’s injected fear and uncertainty into financial markets. And even though Bitcoin’s correlation to stock indexes like the S&P 500 and Nasdaq remains significant, some on Twitter are calling it the “The Great Decoupling” given Bitcoin’s recent surge past $28,000 as Wall Street wavers.\n\nThe bold bet inspired lengthy Twitter threads from some of crypto Twitter’s most prominent voices, including Bitcoin entrepreneur and educator Jimmy Song and venture capitalist Adam Cochran, who delved into how realistic the prediction could be.\n\nReferencing the performance of cryptocurrencies during the onset of the coronavirus pandemic in 2020, Cochran said that Bitcoin would need a catalyst more extreme than that to outdo the 547% rally seen from 2020 to 2022.\n\n3/25 The bet here, is that within 90 days, Bitcoin will reach a price of $1M USD. Or around a 3600% gain within the next 90 days. To put that in perspective, the rally from 2020 - 2022 was only 547% and the 2017 rally at far lower prices was only 1105% gain. pic.twitter.com/7OZZHXNgYX — Adam Cochran (adamscochran.eth) (@adamscochran) March 18, 2023\n\nStory continues\n\nCochran posited that a collapse of the United States and Europe’s banking systems would ultimately overshadow the potential value of Bitcoin as an asset, making bunkers or beans a better use of money than purchasing the world’s largest cryptocurrency.\n\n“Simply put, stores of value or alternative assets do well when we doubt the profitability of an economic system and not the existence of a system,” he told Decrypt via Twitter DM. “If the system doesn’t exist, we shift down the hierarchy of needs, placing value on necessity goods, not valuables.”\n\nCochran said Srinivasan’s wager is a bid for hope in the crypto market after the industry faced tough sledding as crypto winter set in last year, a time when prices plummeted and numerous crypto firms collapsed. He noted that the digital assets industry lost a lot of the excitement and hope that brought people in.\n\n“They are hungry to have that back,” he said. “It’s just disappointing to see it fueled by an unrealistic bet in such a risky macro environment.”\n\nOther voices, such as Song, appeared supportive of ideas expressed Srinivasan’s bet, claiming Bitcoin could have some utility during an existential crisis for the financial system as it’s known today.\n\n“Bitcoin will play a crucial role in mitigating some of the catastrophic effects,” he said. “As a strictly limited currency, Bitcoin offers a much better store of value, dampening the impact of hyperinflation.”\n\n5/🌐 Despite the daunting situation, Bitcoin will play a crucial role in mitigating some of the catastrophic effects. As a strictly limited currency, Bitcoin offers a much better store of value, dampening the impact of hyperinflation. — Jimmy Song (송재준) (@jimmysong) March 19, 2023\n\nBloomberg’s Matt Levine chimed in on Saturday to ask what could be considered a straightforward question: If Srinivasan thinks Bitcoin will reach $1 million in 90 days, why would he use the money to make a bet about it as opposed to just buying Bitcoin?\n\nthe replies are all “no, he’s printing a futures trade way above market to manipulate the price up” which is not better — Matt Levine (@matt_levine) March 18, 2023\n\nLevine said in a subsequent Tweet that Srinivasan’s move could be an attempt to “manipulate the price [of Bitcoin] up” based on the replies he received. Others expressed the idea that Srinivasan could’ve made the bet as a way to bring exposure to himself and Bitcoin.\n\nSrinivasan’s net worth is estimated to be around $150 million, according to Datawallet. He had joined Coinbase after a company he co-founded called Earn.com—which rewarded users with digital assets for completing small tasks—was purchased by Coinbase.\n\nSrinivasan worked at Coinbase for around 14 months before leaving the exchange in May 2019. Among the accomplishments listed on his LinkedIn profile, he was responsible for organizing the “business and technical sides” of Circle’s USDC stablecoin launch.\n\nSrinivasan is not the only person out there who has envisioned a $1 million price per Bitcoin. In January of last year, Cathie Wood’s ARK Invest estimated that Bitcoin could exceed $1 million by 2030, saying the network “is likely to scale as nation-states adopt [Bitcoin] as legal tender.”"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWhpdHMtMjhrLWFzLXVuY2VydGFpbnR5LXN1cnJvdW5kcy1iYW5rc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin hits $28k as uncertainty surrounds banks - Cointelegraph",
        "content": "Bitcoin (BTC) price surged on March 19 to surpass the $28,000 zone, marking a 16% boost in value in the past seven days, according to Cointelegraph’s MarketPro data.\n\nAt the time of writing, the leading cryptocurrency was trading at $28,063, a 2.4% increase in the past 24 hours. The price reached $28,459 at its highest point during the day before trading at $26,877 during the day’s low.\n\nOverall this week, Bitcoin has gained over 37% against the U.S. dollar. Bitcoin’s market capitalization added $194 billion in 2023, representing a 66% gain year-to-date, outperforming Wall Street banks stocks, especially with fears of a global banking crisis rising. Bitcoin is up about 65% so far this year, versus the S&P 500’s 2.5% gain and Nasdaq’s 15% decline in 2023.\n\nBitcoin chart: Value and Trading Volume - March 13-19, 2023. Source: Cointelegraph\n\nUnited States bank valuations have slid amid the ongoing fear surrounding regional banks in the country after last week’s developments, including the shutdown of Silvergate, followed by regulators’ subsequent takeover of Signature Bank and Silicon Valley Bank.\n\nRelated: Bitcoin levels to watch as BTC price eyes highest weekly close in 9 months\n\nIn Europe, Credit Suisse was acquired by UBS Group for nearly $2 billion earlier in the day as part of emergency plans led by Swiss authorities to preserve the country’s financial stability. As part of the agreement, the Swiss National Bank committed to providing over $100 billion in liquidity to USB.\n\nThe $2 billion deal represents a considerable discount under Credit Suisse's market value on March 17 of nearly $8 billion, according to data from Companies Market Cap.\n\nAn impending global banking crisis could take Bitcoin to $1 million in less than 90 days, former Coinbase chief technology officer Balaji Srinivasan claimed on Twitter. According to Srinivasan’s forecast, a U.S. banking crisis would trigger a hyperinflation scenario leading to the seven-digit Bitcoin price. Srinivasan is betting $2 million on Twitter on his view of the U.S. economy’s future, as well as potential impacts on Bitcoin’s value."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9tYXJrLWN1YmFuLWp1c3QtdG9sZC1iaWxsLTE3MDAwMDE0Mi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Mark Cuban told Bill Maher that buying gold is 'dumb' — and he wants bitcoin to plunge so he can buy even more ... - Yahoo Finance",
        "content": "Mark Cuban told Bill Maher that buying gold is ‘dumb’ — and he wants bitcoin to plunge so he can buy even more. These are 3 simple ways to gain crypto exposure\n\nBeing a crypto bull has its challenges. Even though bitcoin has surged in 2023, it's still down more than 60% from its peak of $68,789 reached in November 2021.\n\nBut one billionaire investor still likes the world’s largest cryptocurrency: Mark Cuban.\n\nDon't miss\n\n“I want Bitcoin to go down a lot further so I can buy some more,” Cuban said in a recent episode of Bill Maher’s Club Random podcast.\n\nMaher, who self-claims to be “very anti-bitcoin,” owns gold instead. Cuban, conversely, has no time for the yellow metal.\n\n“If you have gold, you're dumb as f—,” says the Shark Tank star and Dallas Mavericks owner.\n\nMaher argues that gold “is like a hedge against everything else” but Cuban disagrees.\n\n“Gold is not a hedge against anything, right? What it is is a store of value and you don't own the physical gold, do you … Gold is a store of value and so is Bitcoin,” Cuban explains.\n\nHe then points out why gold can’t really protect your wealth in times of crisis.\n\n“You don't own the gold bar, and if everything went to hell in a handbasket and you had a gold bar, you know what would happen? Someone would beat the f— out of you or kill you and take your gold bar.”\n\nIf you share Cuban’s view, here are a few ways to gain exposure to bitcoin.\n\nBuy bitcoin directly\n\nThe first option is the most straightforward: If you want to buy Bitcoin, just buy Bitcoin.\n\nThese days, many platforms allow individual investors to buy and sell crypto. Just be aware that some exchanges charge up to 4% commission fees for each transaction. So look for apps that charge low or even no commissions.\n\nStory continues\n\nWhile Bitcoin commands a five-figure price tag today, there’s no need to buy a whole coin. Most exchanges allow you to start with as much money as you are willing to spend.\n\nRead more: Here's how much money the average middle-class American household makes — how do you stack up?\n\nBitcoin ETFs\n\nExchange-traded funds have risen in popularity in recent years. They trade on stock exchanges, so buying and selling them is very convenient. And now, investors can use them to get a piece of the bitcoin action, too.\n\nFor instance, ProShares Bitcoin Strategy ETF (BITO) started trading on NYSE Arca in October 2021, marking the first U.S. bitcoin-linked ETF on the market. The fund holds bitcoin futures contracts that trade on the Chicago Mercantile Exchange and has an expense ratio of 0.95%.\n\nInvestors can also consider the Valkyrie Bitcoin Strategy ETF (BTF), which made its debut a few days after BITO. This Nasdaq-listed ETF invests in bitcoin futures contracts and charges an expense ratio of 0.95%.\n\nBitcoin stocks\n\nWhen companies tie some of their growth to the crypto market, their shares can often move in tandem with the coins.\n\nFirst, there are bitcoin miners. The computing power doesn’t come cheap and energy costs can be substantial. But if the price of bitcoin goes up, miners like Riot Blockchain (RIOT) and Hut 8 Mining (HUT) are likely to receive increased attention from investors.\n\nThen there are intermediaries like Coinbase Global (COIN) and PayPal (PYPL). When more people buy, sell and use crypto, these platforms stand to benefit.\n\nFinally, there are companies that simply hold a lot of crypto on their balance sheets.\n\nCase in point: enterprise software technologist MicroStrategy (MSTR). It has a market cap of under $3 billion. Yet its bitcoin count reached approximately 132,500 as of Dec. 27, 2022, a stockpile worth around $3.4 billion.\n\nWhat to read next\n\nThis article provides information only and should not be construed as advice. It is provided without warranty of any kind."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWxldmVscy10by13YXRjaC1hcy1idGMtcHJpY2UtZXllcy1oaWdoZXN0LXdlZWtseS1jbG9zZS1pbi05LW1vbnRoc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin levels to watch as BTC price eyes highest weekly close in 9 months - Cointelegraph",
        "content": "Bitcoin (BTC) approached a key weekly close on March 19, with traders concerned about a retest of lower levels.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBitcoin bulls must “step in” to protect $26,000\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD circling $27,000 on Bitstamp.\n\nAfter briefly tapping $28,000 into the weekend, a slow comedown through out-of-hours trading denied bulls a squeeze higher. This led market participants to weigh the likelihood of Bitcoin returning to test support.\n\n“Holding my long position while we are above $25,500, but ultimately we lost $27,000 support so we are likely to come down and test around $26,100,” popular trader Crypto Tony told Twitter followers.\n\n“The key is for the bulls to absolutely step in at that moment.”\n\nBTC/USD annotated chart. Source: Crypto Tony/Twitter\n\nCointelegraph contributor Michaël van de Poppe, founder and CEO of trading firm Eight, was optimistic about the short-term outlook, even as BTC/USD drifted lower over the weekend.\n\n“Are we staying above $26,800? Answer is clear; yes. This means, trend will continue to last until $26,800 is lost. Looking for a final sweep into $28,300-28,900 and then reversal,“ part of the analysis on March 18 stated.\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/Twitter\n\nA subsequent post on the day nonetheless underscored the importance of nearby support just $300 below the current spot price.\n\n“$26,800 is crucial for Bitcoin,“ Van de Poppe summarized.\n\n“Had two tests now. If we get one more test, it will probably break and cause a deeper and harsh correction. Holding above -> $28,500 next.“\n\nDivorcing the downtrend\n\nOn weekly timeframes, BTC/USD was still in line for an impressive candle close, having last acted around $27,000 in June 2022.\n\nRelated: Bitcoin price hits $27K in new 9-month high as Fed injects $300B\n\nFor trader and analyst Rekt Capital, there was additional cause for optimism thanks to Bitcoin potentially leaving the intervening downtrend behind for good.\n\nSeveral months later and #BTC has finally broken out from its Accumulation Range\n\n\n\nThis Accumulation Range was calculated based on historical post-Death Cross retracement theory mentioned in the thread$BTC #Crypto #Bitcoin https://t.co/85DjLHoZnD pic.twitter.com/MRYUSGObdm — Rekt Capital (@rektcapital) March 18, 2023\n\n“When an old multi-month BTC downtrend gets broken… A new $BTC multi-month uptrend emerges,“ one of various weekend Twitter posts read.\n\nRekt Capital highlighted the ongoing significance of the 200-period moving average (MA) on weekly timeframes, currently sitting at $25,350 and primed for a resistance or support flip.\n\nBTC/USD 1-week candle chart (Bitstamp) with 200MA. Source: TradingView\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vdS50b2RheS9nb2xkbWFuLWhpZ2hsaWdodHMtYml0Y29pbi1hcy1iZXN0LXBlcmZvcm1pbmctYXNzZXTSAUdodHRwczovL3UudG9kYXkvZ29sZG1hbi1oaWdobGlnaHRzLWJpdGNvaW4tYXMtYmVzdC1wZXJmb3JtaW5nLWFzc2V0P2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Goldman Highlights Bitcoin as Best-Performing Asset - U.Today",
        "content": "Bitcoin has outpaced traditional investment assets and sectors, such as technology and gold, in year-to-date (YTD) absolute returns and risk-adjusted performance, according to recent data from Goldman Sachs.\n\nAdvertisement\n\nThe leading cryptocurrency has gained 51% in YTD absolute returns, surpassing information technology (+16%), communication services (+15%), consumer discretionary (+11%), Russell 1000 Growth (+10%), gold (+4%), and the S&P 500 (+4%).\n\nMeanwhile, energy and crude oil have seen declines of 11% and 14%, respectively. Oil prices have dropped to their lowest level since December 2021 due to softer fundamentals and broader market concerns. The market's floor will depend on OPEC+ and the US.\n\nIn terms of risk-adjusted returns, which are measured by the Sharpe Ratio, the bellwether coin has also demonstrated strong performance with a score of 1.9. This is higher than information technology (1.5), Nasdaq (1.4), and healthcare (-1.1).\n\nBitcoin's recent surge in price has been attributed to the growing likelihood of the US Federal Reserve eventually ditching its hawkish monetary policy.\n\nThe cryptocurrency has increased by 35% since March 10, which was when regulators shut down Silicon Valley Bank.\n\nDespite the warnings from market analysts of a possible correction, Bitcoin's rebound has been stronger than that of stocks from Wall Street, gaining the attention of investors.\n\nThe implosion of Terra, FTX, and Celsis 3AC as well as global monetary tightening damaged investor confidence in cryptocurrencies in 2022, with Bitcoin experiencing a massive correction.\n\nHowever, Bitcoin ended the week with a 34 gain, the best since January 2021, amid the ongoing banking crisis, indicating a narrative shift in the perception of the largest cryptocurrency.\n\nThe crypto rally during the ongoing banking crisis has been welcomed by desperate cryptocurrency investors after a brutal bear market, and some of them have suggested that there is a change in the way Bitcoin is perceived. Nevertheless, the value of Bitcoin is still largely affected by changes in inflation rates and decisions made by the Federal Reserve regarding interest rates."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RlY3J5cHQuY28vbmV3cy1leHBsb3Jlcj9waW5uZWQ9MTM0NjIxJnRpdGxlPWJhbGFqaS1zcmluaXZhc2FuLWJldHMtMW0tb24tYml0Y29pbi1oaXR0aW5nLTFtLXdpdGhpbi05MC1kYXlzLWR1ZS10by11cy1oeXBlcmluZmxhdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 22:46:10 GMT",
        "title": "News Explorer — Balaji Srinivasan Bets $1M on Bitcoin Hitting $1M Within 90 Days Due to US Hyperinflation - Decrypt",
        "content": "Mar 18, 10:04 pm\n\nCointelegraph\n\nBalaji Srinivasan Bets $1M on Bitcoin Hitting $1M Within 90 Days Due to US Hyperinflation\n\nBalaji Srinivasan, former Coinbase CTO, has made a bet of 1 BTC and $1 million in USD Coin (USDC) with James Medlock on whether the US will experience hyperinflation. The terms of the bet are that if Bitcoin's price fails to reach $1 million by June 17, Medlock will win the bet, and if it does, Srinivasan will keep the 1 BTC and the $1 million in USDC. Srinivasan has also moved $2 million in USDC for another wager on the same topic."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZGVjcnlwdC5jby8xMjM5MzEvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4tZXRoZXJldW0tcmFsbHktYmFua2luZy1jcmlzaXMtaW50ZXJ2ZW50aW9u0gFlaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMzkzMS90aGlzLXdlZWstaW4tY29pbnMtYml0Y29pbi1ldGhlcmV1bS1yYWxseS1iYW5raW5nLWNyaXNpcy1pbnRlcnZlbnRpb24_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin, Ethereum Post Mega Rallies After Banking Intervention - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThis week in coins. Illustration by Mitchell Preffer for Decrypt.\n\nAfter three consecutive weeks of losses, prices turned verdantly green for holders of the two largest cryptocurrencies by market cap this week.\n\nBitcoin (BTC) blew up 36% over the past seven days and now trades at around $27,515 according to CoinMarketCap data.\n\nAD\n\nAD\n\nLast week, Bitcoin shed around 10% in reaction to news that the industry-servicing Signature Bank and Silicon Valley Bank (SVB) had both failed.\n\nThe industry’s No. 2 coin, Ethereum (ETH), is back where it was before the downturn. ETH is up 27% over the seven days and currently changes hands at $1,832.\n\nThe entire crypto market surged back to life beginning last Sunday night after the Federal Reserve, U.S. Treasury, and FDIC announced they would step in to backstop all deposits at Signature and SVB. That promise was reiterated by President Biden.\n\nCrypto didn’t emerge fully unscathed, however: the industry has lost its two most crypto-friendly banks, and now conflicting reports are swirling over whether the FDIC is telling prospective buyers of Signature Bank that it will have to jettison the bank’s crypto business. Former Massachusetts congressman Barney Frank claimed the Feds shut down Signature to send an \"anti-crypto message\" and a Reuters report late in the week appeared to confirm Frank's claims; the FDIC has since denied the claims made in the Reuters story.\n\nOver in the U.K., Chancellor of the Exchequer Jeremy Hunt announced that the HM Treasury—the UK Finance Ministry—had brokered a bailout deal in which HSBC acquired the British arm of SVB for £1 to make whole British businesses with exposure to the bank.\n\nIn addition to these interventions, investors were drawn into risk-on assets like crypto and tech stocks this week after signs emerged that the banking crisis could be spilling over into Europe’s TradFi institutions: Credit Suisse announced on Wednesday a $54 billion loan from Swiss National Bank to shore up its liquidity.\n\nAD\n\nAD\n\nVirtually all of the top thirty cryptocurrencies by market cap posted significant gains this week, but some of the biggest winners aside from Bitcoin and Ethereum were Filecoin (FIL), which rose 33% to $6.39, Polygon (MATIC), which grew 22% to $1.24, Solana (SOL), which rose 28% to $22.30, and BNB, which climbed 25% to $344.76.\n\nUSDC—the dollar-pegged stablecoin issued by Circle—slipped its peg last weekend and fell all the way to 87 cents after uncertainty over the company’s exposure to the beleaguered banks. It restabilized this week in reaction to the bailout news."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGFpbHljb2luLmNvbS93cmFwcGVkLWNyeXB0by1ob3ctZG9lcy13YnRjLWJyaW5nLWRlZXBlci1saXF1aWRpdHktdG8tZGVmaS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Wrapped Crypto: How Does wBTC Bring Deeper Liquidity to DeFi? - DailyCoin",
        "content": "Interoperability is a difficult speed bump to overcome in the cryptocurrency industry. In the same way you can’t install an Android app onto an iPhone, different blockchains can’t recognize native assets from other networks. Fortunately, wrapped crypto tokens offer a simple solution.\n\nWrapped crypto tokens are a creative way to liberate cross-chain DeFi. By wrapping cryptocurrency, users can integrate their Bitcoin (BTC) with dApps in other ecosystems, like the Ethereum blockchain.\n\nHow exactly do wrapped tokens work? What’s the point of using my precious BTC on the Ethereum network?\n\nMore importantly, what are the risks associated with wrapped tokens?\n\nWhat are Wrapped Crypto Tokens?\n\nLike tourists dressing in local clothes on vacation, these digital assets enable users to ‘wrap’ a native token in a virtual package. In this way, the wrapped token can interact with its new environment. This is useful for crypto enthusiasts who want to use their on-chain digital assets in DeFi protocols on different networks.\n\nWrapped tokens are pegged to the value of their underlying asset. For example, if you wrap native BTC on the Bitcoin blockchain, you will receive an equivalent amount of wBTC on the Ethereum or the Binance Smart Chain.\n\n1 BTC = 1wBTC\n\n1 ETH = 1wETH\n\n1 BNB = 1wBNB\n\nGet the idea?\n\nWhile it’s not officially a wrapped token, stablecoins like Tether (USDT) are, in many ways, the wrapped version of fiat currency. By providing $1,000 US dollars to Tether, you can mint 1000 USDT.\n\nWhat are the mechanics of this process?\n\nHow Does Wrapped Bitcoin (wBTC) Work?\n\nWrapped Bitcoin is the most common example of how wrapped crypto assets work. In its most basic description, wBTC is an ERC-20 token representing an equivalent value of 1 native BTC on the bitcoin blockchain.\n\nThere are three different kinds of users within the wrapped bitcoin ecosystem. Custodians, merchants, and customers.\n\nCustodians\n\nThe Custodian is like a bank that holds native BTC assets. After receiving BTC, the custodian will mint an equivalent amount of wBTC. Custodians take care of BTC and wBTC assets and ensure they are backed and authenticated on-chain. BitGo is one of the most reputable custodians of BTC.\n\nThe Wrapped Bitcoin DAO (Decentralized Autonomous Organization) decides who will be a trusted custodian of native Bitcoins.\n\nMerchants\n\nWrapped asset merchants regulate the distribution of wBTC. Merchants like Ren Protocol and Kyber are the means of exchange between the native Bitcoin blockchain and other networks.\n\nMerchants ensure that native BTC always backs wBTC at a 1:1 ratio by redeeming WBTC for BTC depending on customer supply and demand. This ensures that the Wrapped Bitcoin price is pegged to the same price as BTC.\n\nCustomers\n\nCustomers are regular end users of wBTC and BTC tokens, like traders and DeFi enthusiasts. It’s worth mentioning that if you want to acquire wBTC, you don’t need to request it through a merchant. Decentralized exchanges like UniSwap host liquidity pools you can easily trade with to buy wrapped assets.\n\nWhat’s the Difference Between Ether (ETH) and Wrapped Ether (wETH)\n\nWhile it makes sense that native BTC tokens aren’t compatible with Ethereum DeFi applications, wrapped Ether is less obvious. Ironically, native Ether is different from most tokens on the Ethereum network because ETH itself is simply for paying gas fees and securing the blockchain.\n\nThe ERC-20 token standard is a kind of cryptocurrency that can integrate and communicate with smart contracts, like trading and DeFi staking. Before we can unlock the capital efficiency of ETH, it needs to be wrapped into the ERC-20 standard. Token standards are like a set of rules and conditions that govern what a token can do on-chain.\n\nWhy Would I Want to Wrap my Cryptocurrency?\n\nWrapping your tokens is helpful because it lets you do more with your cryptocurrency. If you hold ten native BTC in a bitcoin wallet, there’s not much you do with those assets on the bitcoin network apart from watching your portfolio swing with the market.\n\nHowever, if you wrap those crypto assets into a digital vault and deploy it on a different network, you can borrow against its value on a lending market like AAVE or trade it for wETH to buy NFTs on OpenSea. The full functionality of the Web3 world is at your fingertips.\n\nHowever, like anything in the cryptocurrency world, there are risks you need to take into account.\n\nPros\n\nWrapped crypto tokens let you move and store your digital assets across different blockchains.\n\nYou can use tokens like wBTC in DeFi applications to trade, stake, or borrow against their USD value.\n\nAlmost any digital asset can be wrapped. For example, XRP, PolkaDot, and Dogecoin can all be wrapped and minted on other networks.\n\nCons\n\nWrapping services are still fairly centralized. If a wBTC custodian collapses unexpectedly, it might be difficult to redeem wBTC. If wBTC can’t be redeemed for BTC, it’s effectively useless. This could destabilize the peg and devalue wBTC.\n\nIf the blockchain you’ve wrapped tokens on suffers an outage, your tokens are stuck until the network restarts. Last time the Solana blockchain paused, millions of dollars worth of sBTC and Solana-wrapped USDC got periodically trapped.\n\nCan Traditional Stocks Be Wrapped Crypto Tokens?\n\nIn the same way cryptocurrency can be wrapped and deployed on the blockchain, traditional assets like gold and stocks can also be wrapped. DeFi applications like Poison Finance support tokenized stocks like Apple, Microsoft, and Tesla on their trading platform.\n\nOn the Flipside\n\nWhile wrapped crypto tokens give you greater utility for your digital assets, you should be careful holding tokens on unreliable networks. Following the Harmony blockchain bridge exploit, stablecoins like USDC have lost all their value on the Harmony network and cannot be redeemed to other chains.\n\nWhy You Should Care\n\nWrapped assets are useful tools for DeFi enthusiasts and, when used strategically, can help optimize yield strategies and unlock deeper liquidity in your crypto holdings.\n\nFAQs"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0LzEwLXJlYXNvbnMtdG8taW52ZXN0LWluLWJpdGNvaW4tb3Zlci1vdGhlci1jcnlwdG9jdXJyZW5jeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "10 Reasons to Invest in Bitcoin Over Other Cryptocurrency - Analytics Insight",
        "content": "This article mentions the reasons to invest in Bitcoin over other cryptocurrencies\n\nAs a substitute for conventional currencies like the US dollar, euro, or pound sterling, bitcoin is a digital cryptocurrency that has grown in popularity recently. Although many investors presently refer to bitcoin as “digital gold,” it may potentially be utilized as a digital form of money. Since the quantity of bitcoin is set, as opposed to the supply of fiat currencies like the US dollar or Japanese yen, investors believe that investing in Bitcoin over other cryptocurrencies will increase in value over time. These are ten reasons to invest in Bitcoin over other currencies.\n\nBitcoin is decentralized because it is not governed by any one entity, including a government or financial institution, so it is not bound by the same rules and limitations as conventional currencies. This increases user financial autonomy and lowers the possibility of political meddling or currency manipulation.\n\nTransactions with Bitcoin are frequently quicker and less expensive than those involving traditional money exchanges because there are no middlemen involved. This can be especially helpful for overseas transactions, which with traditional currencies can be cumbersome and expensive.\n\nCompared to many conventional solutions, Investing in Bitcoin is more secure since it employs encryption to thwart fraud and hacking.\n\nBitcoin is a deflationary currency, meaning its value tends to rise over time, in contrast to traditional currencies, which tend to lose value over time owing to inflation.\n\nMeanwhile, Bitcoin may be used for transactions anywhere in the world, it is a practical choice for cross-border trade.\n\nWidely used: Bitcoin is being used for an increasing number of purchases and transactions as it is being accepted by more and more businesses and merchants worldwide.\n\nFinancial anonymity: Because transactions can be done without disclosing personal information, Bitcoin offers users better financial privacy and anonymity than traditional currencies.\n\nBitcoin may be divided into smaller parts, which increases its adaptability to transactions of various amounts.\n\nWith a fixed number of 21 million coins, bitcoin is a scarce asset with the potential to appreciate over time.\n\nBitcoin provides investors with the possibility for significant returns and portfolio diversity because it is a relatively young and volatile asset. Yet it’s crucial to remember that buying Bitcoin can also be hazardous, so you should proceed with caution.\n\nDue to the low price correlations that cryptocurrencies like Bitcoin have traditionally had with the US stock market, owning some can help you diversify your portfolio. If you think that people will use cryptocurrencies more frequently in the future, it makes sense for you to directly purchase some as part of a diversified investment portfolio. Be careful to have an investment thesis outlining why each cryptocurrency you invest in will endure the test of time. You ought to be able to manage the investment risk as part of your overall portfolio if you conduct adequate research and learn as much as you can about how to invest in cryptocurrencies.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9jb3VsZC1iaXRjb2luLWJ0Yy1iZS1vbi1jb3Vyc2UtZm9yLWFub3RoZXItZ3JlZW4td2Vla2VuZC_SAVNodHRwczovL2FtYmNyeXB0by5jb20vY291bGQtYml0Y29pbi1idGMtYmUtb24tY291cnNlLWZvci1hbm90aGVyLWdyZWVuLXdlZWtlbmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Could Bitcoin [BTC] be on course for another green weekend - AMBCrypto News",
        "content": "Analyst suggests that BTC could get a key breakout in the short term.\n\nThe Bitcoin network value remains expensive relative to the price but the coin could still hit a yearly crest.\n\nSince 2023 began, a number of weekends have acted as stepping stones for Bitcoin’s [BTC] production of green bars.\n\nInterestingly, the 11-13 March period of last week was no different. But with the coin losing and regaining price levels at different intervals, what do the next few days hold for BTC?\n\nHow much are 1,10,100 BTCs worth today?\n\nWell, a digital assets trader by the name of Markus Thielen on Twitter opined that the BTC might not stall its movement at $26,000. Thielen based his judgment on his technical analysis. There, he showed that BTC has long-term support.\n\nLittle beginnings may be faced with hurdles\n\nBesides, the chart revealed that the mid-term downtrend could be over. And a short-term breakout at $25,817 was already in motion. According to the analyst, BTC had the potential to end up at $28,000 soon.\n\nThere have been calls for the king coin to hit $30,000 before any other major retrace lately. So, Thielen’s opinion could not be outrightly dismissed. However, enthusiasts with this viewpoint may need to exercise caution.\n\nOne metric that suggested the stance above is the Network to Value Transaction (NVT) in relation to the BTC circulation. The circulation NVT provides an overview of an asset’s growth potential. This is derived using the Price-to-Earnings ratio and rate of daily circulation.\n\nAt press time, the circulation NVT was extremely high at point 538. A high circulation NVT indicates that an asset’s network valuation is higher than the current value displayed on the network.\n\nSo, this means that the current BTC value was not cheap compared to its expensive network.\n\nWill backup and support prevail?\n\nHowever, the NVT condition did not totally cancel the possibility of a further uptick for BTC. This was because whales’ interest in the coin remains intensified.\n\nAt press time, Santiment data showed that there has been a sustained increase in six to seven figures BTC transactions. A situation like this confirms buying pressure from this group. Also, the same whales had reduced selling some parts of their holdings as reported lately.\n\nAs per the daily chart, BTC seemed in a prime position to follow through with its increase based on the Awesome Oscillator (AO).\n\nThe indicator helps to assess market momentum in relation to trend affirmation, reversal, weakness, and strength. With the AO at 1455.59, it means that BTC had enough support to reach the price level suggested by Thielen.\n\nIs your portfolio green? Check the Bitcoin Profit Calculator\n\nFurthermore, the Directional Movement Index (DMI) also suggested a similar sentiment. At press time, the +DMI(green) was 39.03. And backing it up was the Average Directional Index (ADX), which was at 27.10."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC8yMDA4LWJhbmstY29sbGFwc2UtZ2F2ZS10aGUtd29ybGQtYml0Y29pbi1idGMtMjAyMy1iYW5rLWNvbGxhcHNlLXdpbGwtZ2l2ZS11cy1yZW5xLWZpbmFuY2UtcmVucS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "2008 bank collapse Gave the world Bitcoin (BTC), 2023 bank collapse will give us RenQ Finance (RENQ) - Analytics Insight",
        "content": "It is often said that out of great crises come great innovations. In the aftermath of the 2008 financial crisis, Bitcoin (BTC) emerged as a decentralized digital currency that promised to revolutionize the financial industry. Fast forward to 2023, and experts predict that another economic collapse is on the horizon.\n\nThis time, however, the world may turn to a different type of innovation: RenQ Finance (RENQ). RenQ Finance is a blockchain platform that aims to provide a more efficient and transparent way of conducting transactions. With its low transaction fees, fast transaction times, and community governance structure, RenQ Finance could become a go-to solution for a world in need of financial stability and trust.\n\n2008 Bank Collapse and the Rise of Bitcoin\n\nThe 2008 financial crisis was a turning point in the history of modern finance. The collapse of the banking industry and the ensuing economic downturn led to a worldwide recession that left many people financially vulnerable. However, out of this crisis emerged a new form of currency – Bitcoin.\n\nBitcoin was created in 2009 by an unknown individual or group using the pseudonym Satoshi Nakamoto. It was designed to be a decentralized, peer-to-peer digital currency that could operate without the need for intermediaries such as banks or governments. Bitcoin’s blockchain technology, which records all transactions on a distributed public ledger, made it resistant to manipulation and fraud.\n\nOver the years, Bitcoin has grown in popularity, with more people and businesses accepting it as a legitimate form of payment. Its market capitalization has also soared, reaching an all-time high of over $1.28 trillion in November 2021. Bitcoin has become a symbol of financial freedom and independence, as well as a hedge against inflation and economic instability.\n\n2023 Bank Collapse and the Emergence of RenQ Finance\n\nWhile Bitcoin was born out of the 2008 financial crisis, many experts believe that the next financial collapse will give rise to a new cryptocurrency – RenQ Finance (RENQ). RenQ Finance is a decentralized finance (DeFi) platform that operates on the Ethereum blockchain, offering users high-yield rewards through staking and liquidity mining.\n\nRenQ Finance’s unique combination of features has gained significant attention in the crypto space, with users attracted to its potential for high yields and profitability. Additionally, RENQ’s price has been performing well, increasing from around $0.02 in January 2023 to $0.03 at the time of writing.\n\nThe idea behind RenQ Finance is to create a decentralized platform that allows users to yield farm, liquidity mine, and stake their assets without the need for intermediaries such as banks. RenQ Finance’s native token, RENQ, is used to pay transaction fees and governance on the platform.\n\nRenQ Finance is designed to be AI-friendly, meaning that it can be used by developers and companies to build and deploy AI applications. The platform’s infrastructure is scalable, making it suitable for large-scale AI projects, and its fast and low-cost transactions provide an ideal environment for AI development.\n\nSummary\n\nThe 2008 financial crisis sparked the emergence of Bitcoin, a decentralized digital currency that has become synonymous with financial freedom and autonomy. While some experts anticipate the next financial crisis will usher in a new cryptocurrency, others believe it’s already here in the form of RenQ Finance (RENQ).\n\nBuilt on the Ethereum Chain, RenQ Finance is a decentralized finance platform that offers users high-yield rewards via staking and liquidity mining. With its AI-friendly infrastructure, it has the potential for AI development and presents a promising investment opportunity for those seeking high yields and profitability.\n\nIt’s important to note that cryptocurrency investment is a high-risk, high-reward endeavor, and investors should conduct their own research and due diligence before making any investment decisions.\n\nClick Here to Buy RenQ Finance (RENQ) Tokens.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpZy1leWVzLWNvaW4tYW5kLXF1YW50LWxpa2VseS10by1pbXByZXNzLWFzLWJpdGNvaW4tc2V0LWZvci1yZWNvdmVyeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 18 Mar 2023 07:00:00 GMT",
        "title": "Big Eyes Coin and Quant Likely to Impress, As Bitcoin Set for Recovery - Analytics Insight",
        "content": "Bitcoin (BTC) suffered one of its worst declines during the last bear rally, with many holders counting losses. Existing altcoins like Quant (QNT) weren’t spared either, but crypto investors are now focused on making up for the bad times. The two crypto assets could reward holders’ patience and trust with a steady upward rally that could amount to tangible profit yield.\n\nBig Eyes Coin (BIG) is another altcoin billed for an impressive run, as the new meme coin prepares to launch on UniSwap (UNI) and other major exchanges. With the market showing signs of improved profitability, the coming months may be great for holders of these crypto assets.\n\nQuant (QNT): An Highly Efficient Enterprise Grade Blockchain\n\nQuant is a top enterprise-grade network business leverage to improve efficiency by allowing them to harness the benefits of blockchain technology to the fullest. The blockchain network proffers practical solutions to common problems facing enterprises in different sectors, especially the finance and asset management niche.\n\nThe highly interoperable protocol leverages DLT (Distributed Ledger Technology) to achieve its functionalities. It helps businesses reduce risk exposure levels and operations costs while ensuring increased interoperability. Quant’s functions, especially in the business sector, have made it popular amongst many enterprises, especially Fintechs.\n\nThe blockchain network is constantly upgraded to remain relevant and highly functional for users. This increases its tendency of meeting up with any new demands users could possibly have. The protocol’s base currency, Quant (QNT), is used for payment on the platform. This includes any necessary network fees either for licenses or other transactions.\n\nThe altcoin currently sells below a dollar but looks likely to move beyond that price point as the year proceeds. Quant (QNT) could recover from its about 50% price dump, to set an impressive year high soon.\n\nBitcoin (BTC) Recovery is Imminent\n\nDespite the changing market dynamics, constant upgrades of other crypto projects, and new innovations, Bitcoin remains the apex crypto project. It’s no doubt that the cryptocurrency has stood the test of time, and it’s unlikely for any altcoin to topple it anytime soon. Bitcoin’s (BTC) quick recovery is a strong feature that sets it apart from most altcoins, and the digital currency looks set for another recovery after the crypto winter setback.\n\nCurrently, holders can expect gradual loss recovery, while potential new adopters are likely to enjoy great yield. Bitcoin’s pump or dump is usually associated with the general market condition. Thus, investors can expect impressive returns from almost all altcoins if Bitcoin (BTC) eventually embarks on its anticipated impressive rally.\n\nBig Eyes Coin (BIG) Set for Possible Post-launch Surge\n\nBig Eyes Coin (BIG) has been an impressive cat-theme meme token, and many expect it to replicate its impressive run upon launching into the market. The Ethereum-based meme coin boasts a self-sustaining ecosystem and strong community that can contribute to its success possibility.\n\nThe Big Eyes ecosystem contains a decentralized exchange (DEX) for token swaps, educational resources about DeFi to aid learning, and income-generating opportunities to propagate wealth in the community. Big Eyes will have NFTs collections and that comes with exclusive benefits for holders. Each NFT in the collection is billed to be an asset of worth and could yield value for holders in the future.\n\nThe meme project will allocate 5% of its treasury to charities involved in ocean protection. This will help protect a part of the Earth’s ecosystem. Token holders will be at the forefront of deciding which charity gets donations periodically, giving Big Eyes token (BIG) governance functions too.\n\nWith over $30 million raised on presale, it’s evident that Big Eyes Coin (BIG) has gained huge acceptance. Its adoption and prominence could translate to market success in the coming months, as analysts are optimistic about its market potential.\n\nBig Eyes Coin (BIG):\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYm9sZC5jb20vY2FuLWJpdGNvaW4tcmVhY2gtMzBrLWJ5LWVhc3Rlci0yMDIzLWJ0Yy1wcmljZS1wcmVkaWN0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 19 Mar 2023 07:00:00 GMT",
        "title": "Can Bitcoin reach $30k by Easter 2023? BTC price prediction - Finbold - Finance in Bold",
        "content": "The value of Bitcoin (BTC) has been rising in 2023, with the asset targeting new levels despite the prevailing impact of the banking crisis. With recent gains, the future price of Bitcoin is in focus, as investors monitor whether the gains will hold.\n\nIn this regard, Finbold leveraged CoinCodex’s self-learning machine platform to determine Bitcoin’s price during Easter 2023. According to the platform, Bitcoin’s momentum is likely to stagnate, and it might trade at $27,845 on Easter day, April 9, according to data retrieved on March 19.\n\nThe estimated price of Bitcoin represents gains of about 2% from the cryptocurrency’s valuation at the time of publishing.\n\nBitcoin one-month price prediction. Source: CoinCodex\n\nIt is worth noting that Finbold previously reported that another AI-based tool, CoinPriceForecast, indicated that Bitcoin is likely to reclaim $30,000 by the end of the year. The platform estimates that BTC will trade at $33,047 at the end of 2023.\n\nBitcoin price analysis\n\nBy press time, Bitcoin was trading at $27,324 after days of sustained capital inflow. On the weekly chart, Bitcoin has gained by over 30%, despite slightly correcting by about 1% in the last 24 hours, with a market cap of $526.8 billion.\n\nBitcoin seven-day price chart. Source: Finbold\n\nAlthough Bitcoin has slightly corrected, crypto trading expert and analyst Michaël van de Poppe, in a tweet on March 18, remained optimistic about BTC’s prospects in the short term.\n\n“Just like previously asked on Bitcoin, we got the answer now as well. Are we staying above $26,800? The answer is clear; yes. This means the trend will continue to last until $26,800 is lost. Looking for a final sweep into $28,300-28,900 and then reversal,” he said.\n\nBitcoin price analysis chart. Source: TradingView\n\nElsewhere, Bitcoin’s one-week technical analysis retrieved from TradingView is dominated by a bullish outlook. A summary and moving averages of the gauges recommend a ‘strong buy’ sentiment at 16 and 12, respectively.\n\nBitcoin technical analysis. Source: TradingView\n\nBitcoin fundamentals\n\nBitcoin’s momentum has translated into a growing belief that the asset is experiencing a change in its narrative due to the ongoing banking crisis. Despite this, the value of the cryptocurrency continues to be greatly affected by inflation and Federal Reserve rate increases.\n\nWith the inflation data showing slowed growth, the chances of increasing interest rates are diminishing, an aspect that is likely to act as a bullish catalyst for Bitcoin to possibly reclaim the $30,000 position.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]