[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMjQvYml0Y29pbi1idGMtcHJpY2UtY291bGQtaGl0LTEwMDAwMC1ieS1lbmQtMjAyNC1zdGFuZGFyZC1jaGFydGVyZWQuaHRtbNIBamh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA0LzI0L2JpdGNvaW4tYnRjLXByaWNlLWNvdWxkLWhpdC0xMDAwMDAtYnktZW5kLTIwMjQtc3RhbmRhcmQtY2hhcnRlcmVkLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Crypto winter is over — and bitcoin could hit $100,000 by the end of 2024, Standard Chartered says - CNBC",
        "content": "Bitcoin's value could jump to as much as $100,000 by the end of 2024, Standard Chartered said in a note published Monday.\n\nThe collapse of Silicon Valley Bank and other mid-tier U.S. lenders has solidified the case for bitcoin as a \"decentralised, trustless and scarce digital asset,\" Standard Chartered analyst Geoff Kendrick said in the note.\n\n\"We see potential for Bitcoin (BTC) to reach the USD 100,000 level by end-2024, as we believe the much-touted 'crypto winter' is finally over,\" Kendrick said in the report, titled \"Bitcoin — Pathway to the USD 100,000 level.\"\n\n\"The current stress in the traditional banking sector is highly conducive to BTC outperformance – and validates the original premise for Bitcoin as a decentralised, trustless and scarce digital asset,\" Kendrick added.\n\n\"Given these advantages, we think BTC's share of total digital assets market cap could move into the 50-60% range in the next few months (from around 45% currently).\"\n\nBitcoin was trading at $27,601.55 as of 9:40 a.m. ET, according to CoinGecko data.\n\nThe woes of Circle's USD Coin and other so-called stablecoins, which aim to achieve a 1-to-1 peg to the U.S. dollar, has also benefited bitcoin, Kendrick said.\n\nUSDC lost its peg to the dollar after its issuer Circle revealed exposure to SVB. The coin has since regained its $1 value, however its total market value has fallen to $30.7 billion from more than $43 billion since Mar. 10 when the bank was placed into receivership by the U.S. government, according to CoinGecko data.\n\nThis, coupled with a stabilization of risk assets and speculation that the Federal Reserve will ease monetary tightening further, means the \"pathway to the USD 100,000 level is becoming clearer,\" Kendrick said.\n\nProponents of bitcoin maintain the digital currency is an asset worth diversifying into in times of economic distress. As the theory goes, bitcoin has a limited supply of 21 million bitcoins, meaning it should appreciate as demand for alternative assets grows to avoid the effects of high inflation."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMirQFodHRwczovL3d3dy53YXNoaW5ndG9ucG9zdC5jb20vYnVzaW5lc3MvMjAyMy8wNC8yNC93aGF0LWlzLWJpdGNvaW4taGFsdmluZy1hbmQtZG9lcy1pdC1wdXNoLXVwLXRoZS1jcnlwdG9jdXJyZW5jeS1zLXByaWNlLXEtYS8yY2QxNjlhNi1lMjdmLTExZWQtOTY5Ni04ZTg3NGZkNzEwYjhfc3RvcnkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Analysis | What Is Bitcoin 'Halving' and Will It Push Up the Cryptocurrency's Price? - The Washington Post",
        "content": "Bitcoin is notoriously volatile, prone to sudden price surges and swift reversals that can wipe out millions of dollars of value in a matter of minutes. Those changes are often mysterious to market observers, given the digital currency’s lack of fundamentals, or ties to the real economy. Bitcoin has another quirk, one that was built into the code that gave it birth: every so often, the formula that governs the rate at which new tokens are created changes. As another such event — called a halving — approaches, Bitcoin supporters and skeptics are debating what kind of impact it may have on the coin’s value.\n\n1. Where do baby Bitcoin come from, anyway?\n\nOne of the characteristics that gave rise to a fascination with Bitcoin is the way its pseudonymous creator, Satoshi Nakamoto, tied the creation of coins to the work needed to prevent counterfeiting. Bitcoin is generated by so-called miners whose computers perform complex calculations that validate the transactions on what’s known as the blockchain, a public digital ledger. The miners compete with each other to earn newly issued tokens known as a block reward.\n\nAdvertisement\n\n2. What is a Bitcoin halving?\n\nA halving – sometimes referred to as halvening – is a planned reduction in rewards miners receive (the term is mentioned in Bitcoin’s code). Halvings happen once every four years or so – more precisely, every 210,000 blocks of transactions. As the name suggests, each one cuts the amount of Bitcoin miners receive per block reward in half. At Bitcoin’s launch in 2009, miners received 50 Bitcoin per block, but that reward was reduced to 25 in the first halving, in 2012, to 12.5 in 2016, 6.25 tokens in 2020 and is scheduled to drop to 3.125 coins in 2024.\n\n3. What’s the point?\n\nBitcoin’s issuance is limited in several ways. For one thing, according to its founding protocol, just 21 million will ever be in circulation. That’s appealing to many who fear that fiat money — the kind issued by governments — can lose its value to inflation if too much is printed. Supporters argue that Bitcoin, by contrast, will be guaranteed to increase. Halving also prevents inflation by acting to periodically slow the pace at which Bitcoin are created, so as to not outstrip demand. To other observers, halvings can serve as a hurry-up-and-buy signal by suggesting that slower growth could be accompanied by a bump in price.\n\nAdvertisement\n\n4. When is Bitcoin’s halving happening?\n\nShare this article Share\n\nThe quadrennial event is due next around April 2024. In general, predicting the exact date is hard because the time it takes to generate new blocks can slow down or speed up depending on a number of factors. Going by most estimates, there will be 64 Bitcoin halvings before that 21 million maximum is reached sometime around 2140, at which point halvings will stop. Once that happens, miners will no longer collect rewards and are expected to rely on charging fees for handling transactions, similar to what credit card companies do.\n\n5. Do halvings boost Bitcoin’s price?\n\nThat’s a matter of heated debate. In 2012, for instance, Bitcoin gained about 8,000% in the 12 months following the cut in rewards, and again rose almost 1,000% in the wake of the 2016 cut. The last halving, in May of 2020, was followed by a bull run that ended in a record Bitcoin price of almost $69,000 in November 2021. As of mid-April this year, Bitcoin has revived about 67% from an epic rout in 2022, to around $30,000. The next halving holds the potential to trigger an advance of at least 81%, according to Bloomberg Intelligence and Matrixport. Skeptics, on the other hand, argue that attributing price hikes to halving is specious, at best. The second halving, for example, came at a time when Bitcoin was already gaining greater mainstream recognition, and coincided with the boom in initial coin offerings, many of which had to be bought with Bitcoin. But the bounce has sputtered of late, restrained by cooling expectations of US Federal Reserve interest-rate cuts. A regulatory crackdown on crypto in the wake of the FTX exchange’s collapse in November 2022 also threatens the market outlook.\n\n6. If I own Bitcoin, will anything change for me after the halving?\n\nNo, except inasmuch as any subsequent price change would leave you richer or poorer. But it will be impossible to know how much of the change is due directly to the halving.\n\n--With assistance from Sidhartha Shukla and Brandon Kochkodin.\n\nMore stories like this are available on bloomberg.com"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vbG93ZXItYml0Y29pbi1ldGhlci1jb3JyZWxhdGlvbi03NDg0MjI10gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "What Does Lower Bitcoin-Ether Correlation Mean for Investments? - Investopedia",
        "content": "Prices of bitcoin and ether—the two largest cryptocurrencies by market capitalization—are usually closely correlated, but that's changing after Ethereum's Shanghai Upgrade, and it could affect investments and risk management for cryptocurrency investors.\n\nKey Takeaways Ether and Bitcoin have moved together in the past, with the exception of the time period around The Merge.\n\nThe lack of correlation increased after Ethereum's Shanghai (Shapella) hard fork.\n\nAt the same time, bitcoin has continued its correlation with the Nasdaq.\n\nEther and Bitcoin's Correlation\n\nAccording to a recent report by Coinbase, the correlation between bitcoin (BTC) and ether (ETH) has been declining since the beginning of 2023 and the rift widened after Ethereum's Shanghai (Shapella) hard fork. The upgrade, completed on April 12, allowed users to withdraw staked ether for the first time.\n\nThe BTC-ETH correlation based on a 40-day rolling window has fallen from 0.95 to 0.82 during that time. In the past, these two crypto assets have mostly moved lockstep.\n\n\n\nThe report attributes this trend to several factors, such as the increasing adoption of Ethereum-based decentralized applications (DApps), the growing popularity of non-fungible tokens (NFTs), and the transition of the network from a proof-of-work (PoW) to a proof-of-stake (PoS) consensus mechanism.\n\nHow Declining Correlation Impacts Investments\n\nLower BTC-ETH correlation could have implications for portfolio diversification and risk management. For institutional investors, it could mean a change in their hedging strategies.\n\n\"The relevance of this falling correlation for institutional investors is that it can affect quantitative strategies that rely on cross hedging one asset for the other (or using ETH as a hedge for less liquid altcoins),\" said Coinbase analysts.\n\nFor investors who want to gain exposure to the cryptocurrency market, holding both BTC and ETH could provide more benefits than holding either one alone, as they could reduce the overall volatility and increase the potential returns of their portfolio.\n\nHowever, the report cautions that correlation is not a static measure and could change over time depending on market conditions and developments in both networks.\n\nBitcoin Still Correlated with Nasdaq\n\nBitcoin is often touted as a hedge against inflation and a safe haven asset in times of economic turmoil. However, a recent analysis by CoinDesk shows that the cryptocurrency's correlation with the ratio of Nasdaq 100 to S&P 500 index has increased significantly since late 2020, suggesting that bitcoin may be more sensitive to shifts in market sentiment and risk appetite than previously thought.\n\n\n\nThe ratio of Nasdaq 100 to S&P 500 reflects the relative performance of growth stocks versus value stocks. Growth stocks are typically associated with higher earnings growth potential and higher valuations, while value stocks are seen as undervalued and often pay dividends.\n\n\n\nAccording to CoinDesk, bitcoin's 90-day correlation coefficient with the Nasdaq-to-S&P 500 ratio rose to a record high of 0.79 in March 2021, up from -0.06 in September 2020.\n\n"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LnRoZXZlcmdlLmNvbS8yMzY5NjQ2Ni9iaXRjb2luLWNyeXB0by1saWdodG5pbmctbmV0d29yay1saWdodHNwYXJrLWNlby1kYXZpZC1tYXJjdXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin is still the future of payments, says Lightspark CEO David Marcus - The Verge",
        "content": "We’ve got a special episode with Alex Heath, deputy editor at The Verge and a familiar host for Decoder listeners, and David Marcus, the CEO of Lightspark. That’s a company that just launched a service to make fast transactions using Bitcoin on something called the Lightning Network. David was previously at PayPal, and then he led Meta’s big payments effort that went nowhere, but he’s got a lot to say about where crypto and payments are right now.\n\nThis transcript has been lightly edited for clarity.\n\nNilay Patel: Alex, welcome.\n\nAlex Heath: Hey.\n\nNP: It’s good to have you back. Why did Lightspark catch your eye? What did you find interesting about this little startup?\n\nAH: Yeah, I don’t cover crypto all the time, but I do pay attention to what David Marcus is doing. He is a Bitcoin OG and has been in the space for a long time. And he had quite a journey trying to launch Facebook’s cryptocurrency.\n\nNP: David was the president of PayPal, and then we should talk about what happened at Facebook just for a second. Facebook wanted to launch a new cryptocurrency called Libra, was going to do it with governments around the world and different payment services, and it collapsed under the weight of its political ambitions. And now, David is back with a much leaner, simpler startup. Did you talk about the difference between those two ideas?\n\nAH: We did. Libra, for people who don’t remember, it feels like a blur now, this was in 2019, Facebook was going to do this stablecoin that was David Marcus’ brainchild, really, and he led it inside the company. And it met a lot of resistance for several reasons, but mainly, I think when you talk to people who worked on it, it was because Facebook was doing it, but there were also concerns just about a private company of that size creating a currency, and it was based on a basket of fiat currencies rather than just one pure cryptocurrency.\n\nThis gets kind of in the weeds, but I think the distinction is important because David has essentially decided that, for his next company — and interestingly, he took a lot of the founding team that made Libra with him at Facebook to Lightspark with him — that it’s going to be simpler for him to just build on top of Bitcoin. He chose that instead of all the other cryptocurrencies, layer one networks out there, ethereum, etc.\n\nAnd I think David, out of pretty much anyone in the industry, knows the most about the regulatory environment around crypto because, when he was doing Libra, he testified in front of Congress. I remember there was a photo of [Mark] Zuckerberg’s face on the dollar bill, with Zuck Bucks displayed behind him at one point. He had to meet regulators all around the world. They tried incorporating Libra in several different countries, including Switzerland. This is a guy who knows the global regulatory situation around crypto better than anyone. So the fact that he decided to make a company that he told me he hopes to be his life’s work around Bitcoin, specifically, I thought was interesting.\n\nNP: Yeah, that’s actually a really interesting part to me. We lived through what I would call crypto summer last year, where the hype was off the charts. There was a lot of conversation about ethereum, these other coins. I think that has all fallen by the wayside. It’s interesting to me that, out of all that wreckage, Dave Marcus is back, and he’s saying Bitcoin is it, and it’s still viable, and he’s managed to raise a bunch of money with that pitch.\n\nAH: Yeah, he’s raised a lot of money and the company’s pretty lean, but I think his goal is to scale Bitcoin as a payments network. He’s a payments guy through and through. That’s what he was doing at PayPal. He led the acquisition of Braintree and Venmo when he was there — and what he was trying to do at Facebook when he was working on Messenger before Libra even had to do with payments. So this has really been his life’s work, and he sees the opportunity thanks to this thing called a layer two network, which is this network that sits on top of Bitcoin, called Lightning, to let people actually transact using Bitcoin.\n\nAnd the most interesting part of all this is that he thinks people don’t even need to know that Bitcoin is the network they’re using to transact with because Lightning is that fast, and he actually sees companies using it to settle back into fiat on both sides of the transaction, so legal tender in real time. And I think that’s really interesting because he’s basically saying, with this network, we can obfuscate crypto out of the equation for the end consumer, and they don’t even need to know that they’re using it necessarily.\n\nNP: That’s fascinating. Did you ask him the only question I ever want to ask anybody about Bitcoin, which is, if I have a Bitcoin, why would I ever spend it?\n\nAH: Well, that gets to the whole reason he’s doing the company, which is he agrees that Bitcoin is, in its current state, a bad thing to transact with. It fluctuates. The idea with Lightning and the company he’s building, which is basically Bitcoin payments in a box for companies, is that it’s happening so fast, and it’s using microtransactions, so micro fractions of Bitcoins, called Satoshis, with this Lightning network, of course, that you don’t even know that Bitcoin is being transacted, and it happens so fast that the price fluctuations don’t matter.\n\nHe’s a really smart guy. He thinks very thoughtfully about this stuff. He’s a long-term thinker. He doesn’t really buy into the hype waves of the different crypto summers we’ve had. He’s been through many crypto winters. He thinks this one, interestingly, will be a very long and painful one, but he’s choosing to start a company in the space anyway, really in the middle of it. And he thinks he has the best bet at doing something in a space that’s not going to get gunned down by regulators like Libra was. And also just hearing him reflect on going from a big company, Facebook, trying to lead a project, basically a startup within that company, which is what Libra was, to actually just running his own startup now and what he enjoys about that and what the tradeoffs are, I thought was really interesting.\n\nNP: That’s pure Decoder bait. All right. I’m excited for this one. It’s a good conversation. To the moon, Alex Heath with Lightspark CEO David Marcus. Here we go.\n\nDavid Marcus, you’re the CEO and co-founder of Lightspark. Welcome to Decoder.\n\nThank you for having me.\n\nI first wanted to just table set and talk about the crypto industry more broadly. I think it’s safe to say we’re in a crypto winter, thanks in large part to the collapse of FTX. You’ve got rising interest rates — a lot of factors in there. I was reading your end-of-2022 predictions post, and you predicted that we won’t exit this crypto winter this year and probably not in 2024, either. And you wrote that “A lot of value, trust and stability was destroyed in 2022.” You’ve been doing this for a really long time, and you’ve lived through multiple crypto winters. I’m not sure how many. Do you know how many?\n\nAt least three, if not four.\n\nWhat’s different about this one in your mind versus the others?\n\nI think that this one is different because the industry got a lot bigger. So the downturn affected many more people, touched more consumers, more companies, more investors. There was a ton more capital deployed in this cycle versus the previous cycles. So it’s just bigger.\n\nAnd when you think about the opportunity still for crypto, what is it? Especially when you have this much disillusionment, so many retail investors were touched by the collapse of FTX. What is the long-term potential for the market?\n\nWell, look, I think that everything that’s speculative ends up in booms and busts cycles. It’s only if you build something valuable that solves real-world problems that you can actually create long-standing value. And so I think we’re starting on that journey now. There are a bunch of companies that built things that solve real-world problems, exchanges, wallets, and many more. But there was so much speculation and teams that were just building something just for the sake of listing a token and making a quick buck. And I feel like this era is coming to an end if it hasn’t ended already. And now teams are actually focusing on building valuable things.\n\nYou left Facebook in December of 2021, which we can get more into later. When did you decide that your new company was going to be Bitcoin focused? Because what you were doing at Facebook was a stablecoin. Why Bitcoin?\n\nListen to Decoder, a show hosted by The Verge’s Nilay Patel about big ideas — and other problems. Subscribe here!\n\nSo I had this idea in the back of my mind, but I wasn’t sure yet that I was going to just take the plunge and go with it. Many friends told me, “You should take at least nine months off.” And after month three, I was really going crazy, so it was time for me to get back on the horse. But why Bitcoin? Because I’ve come to the conclusion that if you want a true open, interoperable protocol for money on the internet, which is what we’re trying to help build here, it has to be built on something that literally no one controls.\n\nBitcoin is the only network and asset that fits the bill when you think about it that way. There’s no consortium of companies. There’s no people at the helm. There’s no leader. There’s Satoshi Nakamoto, but who knows who they or he or she is? And that’s kind of all of the value of the network.\n\nIt’s also the most robust network out there and battle-tested network out there that has been around for over 13 years and has resisted all possible kinds of attacks and issues. So it is, in our mind, the only network that can support a truly open interoperable protocol for money on the internet.\n\nWhat you just said — open, interoperable protocol — sounds similar to what you were trying to do with Libra, but I know what you’re doing with Lightspark is different. Why not Bitcoin as the basis for what Libra was? Why go from the synthetic stablecoin approach to Bitcoin?\n\nSo we actually explored Lightning in the early days of Libra, and we spent time looking at it, and we had a lot of back and forth, and Lightning wasn’t mature enough at the time. We’re talking early 2018. And the problem with Bitcoin as a pure play transactional asset, if you don’t have a real-time settlement network to move money in real time is the volatility of Bitcoin itself. And so it makes it a poor medium of exchange. Not everywhere, because you have a number of countries where the volatility of Bitcoin is actually better than the alternative of hyperinflation of their own home currency. At that time, we felt like we needed to try to bring something to the market that had really stable value so that it could become a great medium of exchange. And if we wanted that at the time, we had to go build something proprietary to actually support it because there was no blockchain that would do at-scale, real-time settlement for potentially hundreds of million if not billions of people.\n\nWhat is Lightning for people who are listening and aren’t quite sure? Maybe they’ve heard of it in passing but aren’t sure.\n\nSo Lightning is a Layer 2 payments protocol built on top of Bitcoin, and the concept is basically one of a channel-based payment network. And so you open payment channels between people or entities that want to transact with one another, and you basically move beads, for the lack of a better term, from one side to another. And you can do that in real time because those channels are very fast. And then there’s a network. So let’s say that you and I have a payment channel open and we want to pay someone else and you have a channel open with that third person, but I don’t. I can go through you to actually pay that third person.\n\nSo it’s a pretty unusual setup, but it’s not unfamiliar. Networking on the internet looks fairly similar in the sense that you have routers on the internet that route packets. You don’t have to be connected directly with anyone and everyone. You can move those packets through third parties, et cetera. So a small unit of Bitcoin on top of Lightning for us is a little bit like a TCP/IP packet for money.\n\nAnd Lightning, importantly, like Bitcoin, is not controlled by a centralized entity?\n\nCorrect. It runs on top of Bitcoin, so it’s completely decentralized. It brings a lot of capabilities to Bitcoin when it comes to payments because it’s near real time. So it’s really, really fast. It’s very cheap, and it’s almost infinitely scalable. And it’s also private, which Bitcoin Layer 1 isn’t. It basically has all of the attributes of a great open payment network.\n\nIs there any concern with the fact that the protocol is private in that it’s not totally visible on chain like Bitcoin in terms of the decentralization of it over time?\n\nNo, because you can see the topography of the network. The only thing you can’t see is actually who’s paying whom, which is a feature when it comes to payments.\n\nIf you’re a merchant, you don’t want your competitors to know exactly how much you’re doing in sales any given day or month. If you’re a consumer, you don’t want people to know exactly who you’re transacting with at all times. And so privacy is a feature of all existing payment networks and the same here with Lightning.\n\nSo you are thinking about Lightning even while you’re at Facebook in the early iterations of coming up with Libra. You leave Facebook at the end of 2021, and you have friends telling you you should take some time, you should not just jump right in. You did anyway. You jumped in. What was the impetus to jump in and go, even after everything you went through at Facebook and having to speak in front of Congress, all the scrutiny — what made you go, “I’m ready to do another company”?\n\nYeah, that’s a good question. I feel like I had a deep sense of unfinished business, and I think all of us, all of my co-founders here, feel exactly the same way because the fact that we’re in 2023 and that money moves the same way it moved in the late ’60s and ’70s on top of completely archaic, outdated systems is borderline infuriating to me. It’s just not right. It’s an anomaly in the world. Money should move the same way anything else on the internet moves. You should be able to send money the way you send an email or a text message. We failed trying to do that when we tried the Libra / DM journey at Facebook. And in that time period, everyone else that tried also failed. And so we still felt that massive amount of fire and passion to actually go fix that for the world because we feel it’s just not right.\n\nAnd what I think is also unique about Lightspark and the founding team that you have with you is it’s pretty much everyone who worked on Libra with you, almost, at least at the senior level, it seems. What was it like convincing everyone who just went through this with you?\n\nWell, it’s not everyone, but —\n\nA lot of people.\n\nBut look, I feel like we shared that same passion for seeing this through. And “this” is actually really trying to help the world with an open, interoperable, dirt-cheap, real-time settlement payment protocol. And so when we started hanging out again, we all felt the same feeling, the same fire to actually go and do this. So it wasn’t actually a complicated path to actually form that co-founding team that we have. And everyone felt like we still needed to try this. And as far as I’m concerned personally, I’ve now absolutely decided, and I have the purest possible version of clarity on this, that this is going to be my life’s thing. I’m just not going to stop until I get it done. This is it.\n\nLet’s get into Lightspark, then. So you recognize Bitcoin and Lightning are what you want to build on. Where is the opportunity to make a company in that space, and what is Lightspark?\n\nThe one downside currently with Lightning is actually that it’s very complicated to fully understand. And the barrier of entry as far as just the learning curve is so incredibly high that it dissuades a lot of people to actually use that network. Additionally, operationally, it’s actually very complex to operationalize Lightning because spinning up a node is complicated, but then you need to open channels with other peers on the network to have a well-connected node. And when you do that, when payments actually get routed through your nodes, you need to rebalance the liquidity that is actually locked up in payment channels. So this concept of payment channels is a little bit foreign for everyone who wants to actually send and receive money across the world 24/7 in real time.\n\nThe first step is really simplifying all of that, really removing all of the complexity and building an enterprise-grade entry point to Lightning so that developers and platforms around the world can actually tap into all the benefits of a real-time global payment network.\n\nSo that’s what we’re doing, and that’s what we’re launching this week. It’s really the easiest, fastest way for anyone to actually onboard the Lightning network and send and receive payments in no time. No operational overhead, no high liquidity requirements, none of that. We’ve taken something that’s fairly complex but great when you know how to use it into something that’s actually really simple, reliable, and enterprise-grade. And the business model for us is actually quite simple, which is we’re providing all these services, and we’re taking a small cut of the transactions that actually go through our stack. And it’s not dissimilar from AWS or any SaaS cloud-based business which brings together software that makes something that’s complicated, simple and accessible and charges a small fee for it.\n\nWhat is that fee relative to — I know there’s not really competition when it comes to Lightning, but in terms of similar types of companies that exist on other payment rails?\n\nWell, so we have a tiered payment plan, but at scale, we’ll basically collect about 15 basis points with no minimum fixed fee. So at a $100 transaction level, that’s about half of the cheapest payment systems that typically settle not in real time. Take ACH, for instance, which settles in three days. It’s considered to be really cheap. And that’s about half of that for real-time secure payments.\n\nWho do you see the customer being for this, maybe now, but also, I think probably more importantly, as you think about company building in the next several years? Who do you see being the companies wanting to plug into this network?\n\nWe’re excited and optimistic about this concept of streaming money.\n\nSo right now, we’re really targeting this toward developers, wallets, exchanges, OTC players. But the developer’s piece is really the most intriguing to us because we feel that if you empower developers with great developer tools and you give them the ability to send and receive money and build products and services that can move value around the world on the internet in real time at a really low cost, that you can build crazy new experiences. So a good example of that, of something that we’re actually pretty excited about and optimistic about, is this concept of streaming money.\n\nAnd let me just take a minute to explain what streaming money is. Because for the last two decades, we’ve been talking about micropayments as a thing, and it never became a thing. And the reason it never became a thing is that the current rails and the way that the pricing is set for payments cannot actually support that use case. The attempts that have typically been made require you as a consumer to preload a wallet that is actually not interoperable with other properties or other publishers and then start spending gradually as you go. So you don’t know as a consumer that you want to put $20 in one publisher’s wallet and you can’t use that balance anywhere else. It’s not really a micropayment — it’s a commitment.\n\nAnd then the way that the pricing is structured has a minimum fee. So if you wanted to do a 2 cents or 5 cents transaction, the actual cost of the transaction would far exceed the actual amount you’re trying to send. And so streaming money is this concept that you can actually send a cent or a fraction of a cent every second if you want on the network, between say a consumer wallet and a creator wallet. So let’s say that now this podcast would become a premium podcast where the first 10 minutes are free, but then you have dynamic pricing and the most interesting parts are maybe more expensive, and consumers could actually spend cents every second for each segment or every five seconds or every 10 seconds, and that would work globally.\n\nIt’s a concept that we think is very exciting because it could create new monetization opportunities for creators; it could create just new payment models as you go. And we’re very excited about what developers are going to build once you remove all of the constraints of all of these legacy payment rails that are around.\n\nThis is naturally leading us into company process questions. How do you go about selling this product? Do you build a sales team in-house to go out and knock on people’s doors, so to speak? Do you just wait and hope that developers see this and flock to it? You’re starting the company from scratch. How do you think about that?\n\nWell, eventually, we’ll build a sales team, but right now, the sales team is a sales team of internal people, me included, and we’re reaching out to companies we know well. And I think we have a pretty good sense of the real problems that those companies are facing and how we can help them address them and how we can help them build new products that would make them more competitive in pretty competitive landscapes. So I think, at first, it’s going to be all internal. The company is small — it’s a startup, which feels amazing.\n\nHow many employees?\n\nTwenty-six. So it’s just perfect. And so we’re going to keep it as small for as long as we possibly can. So we’re very principled in how we hire, and we just don’t want to ever get to this place where we’re bloated. So we just want to take it easy with hiring. But that being said, we’re going to launch this product, we’re going to get a number of developers and clients on the platform, and then we have a pretty busy road map ahead where we’re going to continue iterating on the product and build more capabilities and features in whatever’s left of this year.\n\nHow much money have you raised?\n\nSo we don’t really talk about that. It was a fairly substantial round, but we feel like the-\n\nThe reporting I saw was $175 million.\n\nYeah…\n\nSo ballpark, correct? The reason I ask is because I think it speaks to the longevity of what you’re hoping to create and also just the resilience of the company itself.\n\nI think for me, the important thing was how can I structure this in such a way that we can focus on the work and only the work for as long as possible with no or minimal overhead? And part of the fundraising strategy was that — I actually don’t want to be in a world where we’re fundraising every other year because that takes three months out of the year for the senior leadership team. And so I feel like this is a competitive advantage that we can actually focus on the core product and building rather than being distracted.\n\nThe downside of it, though, is if you’re not very cognizant of the fact that you have a lot of resources and you should try to box that, then you become bloated and fat prematurely, and you can’t ship anything. It’s like this notion that nothing great has ever been shipped by a large team, and I really believe in that. We’re trying to act and behave as if we needed to raise at the end of this year, despite the fact that we don’t.\n\nMaybe if we could dive into that a little more — how do you think about using capital now as a startup founder versus when you worked at a large company with a ton of resources before? You have a lot of resources relative to most companies your size and just personal connections. You mentioned, “We want to operate as though we may need to raise at some point. We don’t want to just think that we have unlimited resources.” How do you, as a CEO, manage that day-to-day with the team and manage expectations?\n\nIt’s culture — it’s 100 percent culture. And at this scale, culture setting is really not hard because it’s 26 people. We’re all thinking about things the same way. And a good measure of a good culture is when you add someone to the team and they feel they’ve always been here two weeks in. And so far, 100 percent of people who joined are exactly that. So we feel pretty good about our culture. And whenever we want to add a software engineer to the team or we want to add anyone on the team, there’s a lot of healthy debate. Do we really need that additional role? Do we really need that additional role for more than a certain period of time? Is it a permanent function that we need someone to actually look after or not?\n\nAnd I feel like we’ve got the right culture. At the time we talk now, we’re launching a product in a few days, and everyone’s been working around the clock over the weekend because we’re pushing something to production for the first time. And it’s just such a great feeling to see people being so hardcore and driven without you having to just ask. It’s just natural. So culture is everything at this scale.\n\nAnd for you as a manager, what’s been the biggest surprise from going from Big Tech — you were president at PayPal before — to a small company? What’s been the most surprising and also maybe the most rewarding in that shift?\n\nSo first of all, I don’t see myself as a manager. It feels very “large company” to talk about it that way. But also, remember that I did startups for all of my life before this decade in large companies. So it feels right at home, it feels very natural for me, and it feels like something that’s really in my DNA. It feels just right. So I have no surprises whatsoever, except that I didn’t know whether I was going to enjoy the hustle of building something from scratch again with the same level of fulfillment and happiness. And I’m actually surprised on the other side of it. I’ve just never felt this great. It’s amazing to be with such talented people on our team doing something really meaningful and no overhead.\n\nTalk about then, I know you’re only 26 people, but how have you structured the company and the people you brought on, and are you a functional organization? How do you think about scaling the company organizationally?\n\nWell, right now, we’re pretty flat. So there’s not a lot of structure by design, and we have very, very senior leaders. So it’s not like we need to spend a ton of time talking about how to structure the team. An interesting thing that I’ve done and tried in the past that works really well is that when I look at the engineering team, the responsibilities are actually split in two. So we have James Everingham, who’s done so many things in our industry for so many years, and he’s really focused on the management piece of the engineering team, the process or lack of process, so to speak. So he’s really acting in a way that enables every single engineer to do their best work and not have overhead.\n\nAnd then Kevin Hurley, our CTO, is really deep into tech in the engine room with all of the engineers. So it’s a split structure — on one side, more day-to-day management process stuff and, on the other, really deep into the technical weeds of how do we actually make this protocol become the winning protocol for money on the internet.\n\nAnd are you spending most of your time on product, or is it —\n\nI’m doing everything. So it’s product, it’s sales, BD partnerships, everything. It’s great.\n\nThis idea of transacting with Bitcoin is a fascinating one to me, and it’s one that the industry has talked about for years, and obviously, we’re talking about it with Lightning. I think the inherent tension in this is that many Bitcoin buyers really still see Bitcoin as an investment, even though you’ve got people like Gensler out there saying, “It’s the only crypto I would consider a commodity. Doesn’t really pass the Howey Test,” which maybe that’s debatable —\n\nIt’s not, it’s really not.\n\nIt’s not, okay. But when you have people out there making still $1 million coin price predictions, it seems like that’s a very hard mindset to change for people to think of Bitcoin as more than just a thing you hold on to — the digital gold analogy. So can you unpack that from your perspective and how you think that will shift because you’re making a huge bet that it will?\n\n“Dirt-cheap transactions, real-time settlement, infinite scalability almost.”\n\nSo let’s step back for a minute. First of all, it can’t be a really great way to transact if every transaction takes 10-, 20-plus minutes to clear. And every transaction is actually more expensive than the existing alternatives. So that doesn’t work. So in comes Lightning, really dirt-cheap transactions, real-time settlement, infinite scalability almost. So that solves that problem.\n\nAnd now, when you think about the behavior of people and the way that they think about Bitcoin and transacting with Bitcoin, you talked about the fact that people think of it as gold. But if you go back in history, the way that this happened is basically people were transacting with precious metals and the likes, and then they realized it was actually pretty inconvenient to actually move around with heavy gold to pay for stuff. And so they came up with bank notes.\n\nSo bank notes were basically just a paper that said you had the gold stashed somewhere. And that was true until 1972 when we stopped the gold-pegged dollar. I see Bitcoin to be exactly that, which is today you’re actually not paying with Bitcoin because, to your point, it’s volatile. It moves in price, et cetera, just like gold was and still is, right?\n\nBut if you can actually use fractions of Bitcoin on top of Lightning, in real time, and you have liquidity with all of the other fiat currencies that exist in the world, you can build products that are actually denominated in whatever currency you want. And so the underlying transaction and settlement asset is Bitcoin, but what consumers or merchants are exposed to can be whatever currency you want because you just get in and out of the network the same way that when you send an image, it gets broken into zeros and ones and sent over a TCP/IP network on the internet. You could break down value with small amounts of Bitcoin transacting and moving on the Lightning network in real time.\n\nSo we see it as a core infrastructure to move value around. And then our hope is that developers and other players will build services on top of this stack that are denominated in whatever currency they choose.\n\nSo the idea is that the end consumer doesn’t even necessarily know that this was settled through the Lightning network or Bitcoin.\n\nCorrect.\n\nIt’s all in fiat for the consumer.\n\nIt could be.\n\nDo you see the world trending in denominations of Satoshis, or Sats, which are the smallest units of Bitcoins or staying in fiat, which is legal tender like dollars? Or do you think that’s more of a sector-specific thing?\n\nI think there might be really good use cases for native Sats-denominated payments, and so if you spend time on Nostr, which is this decentralized social network running on relays.\n\nJack Dorsey is a huge proponent of it. It integrates with Lightning.\n\nYeah. It integrates with Lightning, and it’s fascinating to see the velocity of payments for Zaps or small payments for tipping essentially for posts. And you see the growth of the volume of payments on the network with very, very tiny amounts. And I think when it comes to publishing or when it comes to content monetization or creator monetization, I think you could see models exist on top of this network that are going to be Sats-denominated because it’s kind of the native purest form of payment on the settlement network. And so again, we’ll see what developers build now that the bearer of entry in terms of complexity and operational overhead has been completely eliminated.\n\nWhat is the number one concern you hear from a potential customer you’re talking to about building on Lightning, building with you?\n\nYeah, that’s a great question. We spent a lot of time engaging with all kinds of potential future customers, and they fall into two categories. One is they have looked into Lightning because, on paper, it looks amazing. And then they’ve spent cycles to actually try to get a well-connected node and try to get transactions moving on the network. And then they threw in the towel because it was too operationally intensive and complicated, and they had to have full-time people actually managing their node. So that’s one category.\n\nThe other category is actually, “Oh, I already am on the Lightning Network, but I have all of these same problems. Wouldn’t it be nice to actually not have to deal with all of that stuff so we can focus on our core business, which is definitely not managing a node on the Lightning network?”\n\nSo it’s a little bit like if, in 2023, you wanted to launch a website where you would have to actually go buy a server hardware and a router and configure the whole thing and put it in a rack and do all of these things, no one would do it. And so the analogy is basically that now it’s going to be as simple as just going to a hosting website and launching your website with “what-you-see-is-what-you-get” kind of tools. So that’s basically the analogy. We’re moving from that rack, a server, connected to a router era of the Lightning network to, “I go to lightspark.com, I open an account, and I’m up and running in minutes.”\n\nI thought you were going to say maybe a regulatory concern about using or settling with Bitcoin at all. Does that not really come up?\n\n“Out of all of the networks and assets out there, Bitcoin has the greatest regulatory clarity.”\n\nNo. That’s one of the advantages also of building on top of Bitcoin, which is that out of all of the networks and assets out there, it has the greatest regulatory clarity. And you see it because you see mainstream financial institutions offering Bitcoin products. Fidelity is now offering a 401(k) denominated in Bitcoin and the ability for any Fidelity customer to buy and sell Bitcoin. You can see mainstream financial services companies, well-established brands, carry Bitcoin products for their customers. And you don’t see that with other assets and other networks. And that’s because there is more regulatory clarity than with any other assets or network.\n\nDo you think there’s enough, though? Regulatory clarity?\n\nLook, if you ask me about the state of the US regulatory clarity for crypto in general, of course we don’t have enough regulatory clarity. I’ve been very vocal about that as well, which is if you want to reap the benefits of this revolution — because it is a revolution that will actually benefit consumers and create the next generation of leading companies — and if you want all of that to happen in the US, you need to have clear laws and regulations that, on one hand, protect consumers but, on the other, really incentivizes innovation to stay onshore in the US rather than just escape and go to The Bahamas or wherever you want to go.\n\nSo I think it’s essential. I’m optimistic that we’re moving in the right direction. I think right now, you can see the House Financial Services Committee actually moving in a direction of trying to bring more clarity for digital assets in general. So I think we’ll get to a good place, but it’s been, I know, very frustrating for many, many players out there to not have a clear set of rules that they can operate around.\n\nDo you have any sense of optimism, though, just in seeing what the tenor of the conversation was like when you were at Facebook and you were speaking before Congress in DC a lot, versus now in the progression? It seems like progression has been made, but maybe only on the edges in terms of —\n\nNo, I don’t think we’ve made progress.\n\nYou don’t think there’s any progress?\n\nI don’t think we made a lot of progress. I think people got more educated about the risks and opportunities I think. I feel like the education is slanted toward the risks more than the opportunities, which is kind of unfortunate. But no, we haven’t made that much progress. And it’s a problem. It’s a real problem.\n\nWhat do you think is holding that back? Why are politicians so hawkish on this?\n\nI think it’s a combination of different political undercurrents. But at the end of the day, I think that the surprising part is that if you’re an elected official, you need to look after the interest of your constituents. So on one hand, it’s normal when you see FTX blow up and all these things to try to say, “Okay, this is actually really not okay. We need to protect investors, and we need to protect consumers from bad actors, the same way that we’ve protected consumers from Wall Street bad actors back in the day. And now we have a clear set of rules, and we’re in a good place.”\n\nI think that the problem is actually when you don’t look at the opportunities to lower the costs for all kinds of financial services and payments on behalf of your constituents and, therefore, basically just stay very aligned with the status quo when it comes to incumbents controlling everything and basically pricing things way too high. And so with payments, notably, we’re in a world that looks exactly like pre-internet era with telecoms, where you used to spend a dollar a minute for an international call and you used to pay 25 cents for text messages. We’re exactly in that world and we’re in 2023. And there’s no open competition. So it’s a problem.\n\nHow does progress get made?\n\nWell, first I think that we could have done without all of the bad actors giving a terrible reputation to the entire industry by their reckless behavior. And I think that the problem is also as an industry, we have to start building things that solve real-world problems for a lot of people, and not build speculative products that are made to get rich really quickly, which obviously is just not the way to build an industry.\n\nAnd I think that the fact that we’re in a bear market in a crypto winter is actually good in that way. And you see a lot more energy coming back to Bitcoin when it comes to developer energy with Ordinals and all kinds of other developments. And that wouldn’t have happened last year because people would’ve wanted to issue a token and make money out of this thing. And now actually building on top of Bitcoin, you’re not making money with a new token, you’re going to actually make money because you build something of value, and the underlying asset is Bitcoin, and you can’t actually jumpstart the whole value creation. You have to go with it. So I think all of these things are going to help change the temperature and get us to a good place, but I still think it’s going to take at least a couple of years.\n\nWhat is the biggest risk to Bitcoin as a currency, as a network in your mind right now?\n\nWell, I think public opinion is just generally a thing. And when you look at the narrative around energy consumption and all of these things around Bitcoin, I feel like there’s a lot of posturing and not a lot of understanding of how energy generation, storage, and usage actually works. So I think that’s one angle where I feel like the narrative doesn’t match the reality of energy companies and utility companies and the fact that Bitcoin actually accelerates the adoption of renewables, because you can actually build a plant without waiting to have a 10-year lead time to connect it to the grid and have Bitcoin miners use the energy early on, and then amortize basically your investment as a renewable energy company until you can connect to the grid. That’s one example. No one talks about that.\n\nAnd I think, of course, the network, you could have said a decade ago that this was actually at risk of being hacked or risk of vulnerabilities, et cetera. But this network has proven to be incredibly resilient over 13 years. So I feel really good about that. It’s more of a general trend of the underlying crypto industry that is problematic for the whole industry, rather than Bitcoin itself.\n\nMaybe we could end it here just on a big-picture thing about Bitcoin itself. We’ve talked a lot about why it could work as a settlement layer, some of the concerns around regulation. For the average, everyday person who has most of their money in their bank in USD or whatever, and they think of Bitcoin as this thing that you can use on gambling websites or whatever, it’s this thing still on the peripheral. What do you say to them? Why is Bitcoin something that they should even be thinking about?\n\nI find that it’s really hard to explain the reality of the majority of people living on Earth to people here in America because we have it all, right? We have a stable currency. We have a banking system that, for the most part, we can actually feel pretty confident about. We have decently efficient payment systems. It’s not like we go buy a coffee and we tell ourselves, “Oh man, I wish that there was an easier way to pay for this thing.” But that’s a myopic view of what the rest of the world experiences. In a lot of other countries, people have hyperinflation at insane rates, which forces them to actually spend everything they have the minute they get their paycheck because actually, a bottle of water would retain more value than the bank notes in their pocket over the course of a couple of days even.\n\n“The fact that you have a form of value that is not controlled by any group of people is lifesaving, literally.”\n\nAnd they can’t trust their banking system. So in those places, actually, the fact that you have a form of value that is not controlled by any group of people is lifesaving, literally. And so I think we need to put that in perspective.\n\nBut I think that for us here in most Western countries and other parts of the world that have stable currencies, I think the reality is when we still want to move money around, it’s still complicated. When I was running PayPal, we acquired Braintree and Venmo as a package deal. That was maybe 10 years ago, and you still can’t move money around between Venmo and PayPal, and they’re part of the same company. It’s a little bit like you were trapped in Gmail and you could never send an email between Gmail and whatever other domain or Yahoo Mail or whatever it is. And so that’s the state of payments today.\n\nSo when I think about countries like ours and other parts of the world, I think about all of the innovation that can come from a truly interoperable, really cheap payment protocol on the internet. We talked about streaming money. We talked about moving money around the world in a more seamless way. We talked about people potentially getting their money way sooner and, as such, really having more opportunities to spend the money they earn.\n\nSo there’s a lot of innovation that will be unlocked. When you think about my analogy with telecoms, it’s not like the internet changed the way that people talk on the phone. You still talk on the phone, but instead of paying a dollar a minute, it’s now free. And now if you want to do a group video chat with everyone in high definition, you can. And it’s amazing. And that is net new. And so I think that when you think about it, a brand-new fully interoperable open protocol for payments on the internet, I think that we’ll see a lot of innovation around how value moves around the world that will benefit everyone, not only people who are as lucky as we are here in the US.\n\nAll right, David, I think we’ll leave it there. Thanks for being on Decoder.\n\nThank you for having me."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMjQvYml0Y29pbi1wcmljZS1tYXktaGl0LTEwMGstYnkteWVhci1lbmQtc3RhbmRhcmQtY2hhcnRlcmVkLWJhbmstc2F5cy_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzI0L2JpdGNvaW4tcHJpY2UtbWF5LWhpdC0xMDBrLWJ5LXllYXItZW5kLXN0YW5kYXJkLWNoYXJ0ZXJlZC1iYW5rLXNheXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Price May Hit $100K by End-2024, Standard Chartered Bank Says - CoinDesk",
        "content": "“Against this backdrop, bitcoin has benefited from its status as a branded safe haven, a perceived relative store of value and a means of remittance,” analyst Geoff Kendrick wrote. Bitcoin has gained 65% since the start of the year. It rose above $30,000 last week for the first time in almost a year. It was recently trading at $27,328, down 1.2% in the past 24 hours."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3Lm1hcmtldHBsYWNlLm9yZy8yMDIzLzA0LzI0L2hvdy1hLW1hdGhlbWF0aWNpYW4tYW5kLWFuLWVudHJlcHJlbmV1ci10b29rLWEtYml0ZS1vdXQtb2YtY3J5cHRvLWNyaW1lL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "How algorithms can help trace cryptocurrency crime - Marketplace",
        "content": "When Sarah Meiklejohn first discovered cryptocurrency, she was a grad student in computer science at University of California, San Diego.\n\n“In the beginning we all were just like ‘whoa, Bitcoin what’s anyone doing with it,” she said.\n\nThis was back in 2013, four years after Bitcoin was dreamed up in a white paper by someone named Satoshi Nakamoto, and back then it was generally accepted that Bitcoin was untraceable, which was odd because Bitcoin transactions are public.\n\nThey are all represented by a meaningless string of characters — or hashes — on a digital ledger called the blockchain.\n\nMeiklejohn believed once a cryptocurrency transaction touched the real world, the supposed meaninglessness of those hashes would fall away, and the transactions would reveal a lot about the people who made them.\n\n“I kind of knew beyond any shadow of a doubt that Bitcoin was not anonymous,” she said.\n\nIt turns out you could figure out a lot by seeing how Bitcoin transactions are related to each other. At the simplest level, if a string of Bitcoin characters is initiating lots of crypto transactions and another string, or wallet, is receiving them, that gives you a relationship to work with. So Meiklejohn decided to prove that in an unusual way: by shopping.\n\nStefan Savage was her thesis advisor at UCSD. He still has a lot of the stuff she bought, and he went through it. “So we have a Guy Fawkes mask — very on brand for the time — some earrings, organic Colombian coffee beans, I’m sure those are still good after fifteen years,” he said.\n\nThis was part of the collection of things he and Meiklejohn bought with crypto to watch the transactions go from buyer to seller.\n\n“It was, I need to get a purchase from some wallet in this cluster that my algorithm has identified,” Savage said, explaining how they came to choose their purchases. “Let me go and see things that are likely to get me there.”\n\nWhat Meiklejohn didn’t know at the time was that a man named Michael Gronager was following her project and had read her research paper. He was writing an algorithm that would allow him to trace transactions at scale.\n\nIn fact, he used that algorithm to figure out where a bunch of stolen Bitcoin had gone when a crypto exchange called Mt. Gox went bankrupt in 2014. He eventually turned all this into the company Chainalysis.\n\nHe said his algorithm essentially automated and sweetened Meiklejohn’s tracing process. “I can see an automated pattern that is running all the time,” he said. Now he’s using it to help financial institutions and governments track stolen money and identify bad players in the crypto world.\n\nAn earlier version of this story appeared on the Click Here podcast from Recorded Future News. Additional reporting by Sean Powers and Will Jarvis."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1yZWFsLWVzdGF0ZS1jcnlwdG8tbWFya2V0cGxhY2UtcHJvcGVydGllcy1idXktc2VsbC1wbGF0Zm9ybS1jb2luYmFzZS0yMDIzLTTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "The First US Bitcoin Real Estate Marketplace Is Getting Off the Ground - Markets Insider",
        "content": "What's billed as the first bitcoin real estate marketplace for US properties was launched this week.\n\n\"Real estate commerce needs to be changed,\" the CEO of MyEListing.com said.\n\nTexas properties were the first available on the platform, which is integrated with Coinbase Commerce.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nPeople who want to use cryptocurrency to buy and sell real estate in the US will soon be able to do so via a platform billed as the first bitcoin real estate marketplace in the country.\n\nThe launch of the service from MyEListing.com, a commercial real estate listings and data platform, was rolled out this week, bringing together the newest asset class with the multi-trillion dollar US commercial and residential property markets.\n\nTexas properties were the first to be listed this week. In June, real estate in \"other select states\" will be listed by agents, brokers, and sellers. The company in its statement didn't specify which states will carry listings.\n\nTransactions can be closed within one business day, which is about 50 times faster than current averages, the company said. The marketplace is open to people worldwide and is integrated with Coinbase Commerce, a section of the crypto exchange that allows merchants to accept digital coin payments.\n\nAdvertisement\n\nThe platform will push innovation in both the crypto and real estate industries, Caleb Richter, MyEListing.com's CEO, said in a statement.\n\n\"Real estate commerce needs to be changed. It's hard enough as it is to buy property in your local neighborhood, let alone in another state or country,\" he said.\n\nBitcoin Magazine noted that other real estate firms elsewhere in the world were accepting bitcoin as payment.\n\nThe launch arrives during a tumultuous period for the US housing and commercial property markets, with interest rates rapidly rising while a potential recession is brewing. Median home prices in March fell by the most since 2012, by 3.3% annually, according to Redfin. Meanwhile, lending standards for commercial real estate loans were expected to tighter further with a credit crunch forming, Bank of America said last month.\n\nAdvertisement\n\nBitcoin, pushing through a so-called crypto winter, has jumped by 65% this year. It traded down slightly on Friday to $27,511. Roughly 20% of Americans own cryptocurrencies, according to a Coinbase study carried out by Morning Consult published earlier this year."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wNC8yNS9jaGFtYXRoLXBhbGloYXBpdGl5YS1iaXRjb2luLWNyeXB0by1yZWd1bGF0b3JzLXNlYy1nYXJ5LWdlbnNsZXIv0gFjaHR0cHM6Ly9mb3J0dW5lLmNvbS8yMDIzLzA0LzI1L2NoYW1hdGgtcGFsaWhhcGl0aXlhLWJpdGNvaW4tY3J5cHRvLXJlZ3VsYXRvcnMtc2VjLWdhcnktZ2Vuc2xlci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "‘Crypto is dead in America’ thanks to regulators, says investor Chamath Palihapitiya, who once thought Bitcoin could hit $200,000 - Fortune",
        "content": "Venture investor Chamath Palihapitiya, who once thought that Bitcoin had “effectively replaced gold,” now thinks that “crypto is dead in America” owing to U.S. regulatory pressure on the sector.\n\n“The United States authorities have firmly pointed their guns at crypto,” Palihapitiya said on an episode of the All-In podcast, which he cohosts, released on Saturday.\n\nThe investor said that while crypto companies “were probably the ones that were the most threatening to the establishment,” the sector also pushed “the boundaries more than any other sector of the startup economy.”\n\nThe crypto industry is accusing the Securities and Exchange Commission and its chair, Gary Gensler, of “regulation by enforcement,” or pursuing lawsuits against cryptocurrency companies rather than setting a clear regulatory framework.\n\n“You had Gensler even blaming the banking crisis on crypto,” Palihapitiya complained. The chair of the SEC has highlighted two crypto-friendly failed banks, Silvergate Bank and Signature Bank of New York, in congressional remarks on the crisis.\n\nThe pressure on crypto exchanges is encouraging some companies to look outside the U.S. Coinbase announced last week that Bermuda had granted the company a license to operate in the territory, in what is likely the first step toward launching a new offshore exchange.\n\nCrypto exchanges are also thinking about the semiautonomous Chinese city of Hong Kong, whose government is embracing digital assets and cryptocurrencies as a way to revive its status as an international financial center. The city’s financial regulators have proposed rules to allow retail trading of digital assets, and are helping to connect crypto firms with banks.\n\nThat’s leading some crypto companies to move their Asia operations to Hong Kong. At a congressional hearing last week, Rep. Tom Emmer (R-Minn.) accused Gensler of “doing nothing in protecting everyday Americans and pushing American firms into the hands of the [Chinese Communist Party].” (Cryptocurrency trading is still banned in mainland China, unlike in semiautonomous Hong Kong.)\n\nOn Monday, Coinbase sued to compel the SEC to respond to the exchange’s petition asking for rulemaking, filed last July. “Because we’re absolutely convinced the SEC is violating the law, we feel like we have no choice but to take them to court,” Coinbase chief legal officer Paul Grewal told Fortune. Coinbase also received a Wells Notice, which informs a firm of imminent legal action, from the SEC on March 22.\n\nPalihapitiya on Saturday suggested Coinbase was a company that “tried to do the right things” when it came to working with regulators.\n\nNot quite to $200,000 anymore\n\nPalihapitiya used to be very bullish on Bitcoin, telling CNBC in 2021 that he expected Bitcoin to eventually hit $200,000. The cryptocurrency was worth around $39,000 at the time.\n\nBitcoin would eventually peak at almost $69,000 in November 2021, before plunging in value in 2022 following several high-profile crypto scandals and interest rate increases from the U.S. Federal Reserve. The cryptocurrency bottomed at about $15,500 in December 2022, and has since rebounded to hover between $27,000 and $30,000.\n\nInterest rate hikes have also hit Palihapitiya’s other investments. The investor was well known for taking startups like space tourism provider Virgin Galactic and real estate platform Opendoor to public markets through special purpose acquisition companies. SPACs, sometimes known as blank-check firms, are public firms constituted for the purpose of acquiring a privately held company, which inherits the listing.\n\nPalihapitiya closed two of his SPACs last September after failing to acquire a company to take public. “The era of excess, abundance, and zero-interest-rate policy has come to an end,” wrote Palihapitiya to Social Capital’s limited partners in early April, continuing that the past year was like “getting cold water thrown in our faces.”\n\nStill, some bullish bets on Bitcoin are reemerging. On Monday, Standard Chartered’s head of digital assets research suggested that the cryptocurrency might hit $100,000 by the end of 2024, citing an end to interest rate hikes following the banking crisis in the U.S."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tbGl0ZWNvaW4taGFsdmluZ3PSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Halvings Seem to Move Bitcoin and Litecoin in Very Different Ways - Blockworks",
        "content": "Ask superstitious Bitcoin fans about halvings and they’ll say they’re outrageously bullish, historically marking the onset of monumental price rallies.\n\nWhat about Litecoin halvings?\n\nBitcoin’s fourth halving event — which will again slash BTC issuance by 50% — is expected to hit this time next year. But spinoff blockchain Litecoin (LTC) will see its own halving in 100 days.\n\nHalvings occur every four years (every 210,000 blocks for Bitcoin, 840,000 blocks for Litecoin). Bitcoin’s issuance will drop from 6.25 BTC ($171,000) per block to 3.125 BTC ($85,400), while Litecoin’s will go from 12.5 LTC ($1,100) to 6.25 ($550).\n\nAll Bitcoin and Litecoin halvings have coincided with epic bull markets. Blockworks analyzed price data starting six months before each halving and encompassing up to one year after. BTC exploded up to:\n\n20,000% around the 2012 event;\n\n560% across the 2016 halving and;\n\n780% over the 2020 episode.\n\nMost of BTC’s gains were seen almost a full year after each halving took place. Litecoin halvings have also aligned with similar bullishness, but in a very different pattern.\n\nUnlike bitcoin’s after-the-fact rallies, LTC has pumped the hardest in the six months before its halvings occurred.\n\nThere does not appear to be a distinct pattern in LTC’s price performance in the year following each event. But the six months leading up to both halvings were eerily similar.\n\nLTC peaked at about 320% gains roughly 45 days out from each halving.\n\nIt gave up most of those returns in the month directly after.\n\nLTC rounded out the year after each event up between 80% and 110%.\n\nSelect the log view to better compare Bitcoin halvings\n\nBitcoin and Litecoin share source code (and halvings)\n\nRiyad Carey, research analyst at Kaiko, told Blockworks that halvings have been historically bullish catalysts for both BTC and LTC.\n\n“The timing of these halvings is quite interesting: ETH recently moved away from proof-of-work, which helped propel both Bitcoin and Litecoin’s hash rates to all-time highs as miners looked for alternatives,” Carey said.\n\nThere are other concerns: Bitcoin mining profitability tends to shrink after each block reward reduction, as miners are increasingly relying on transaction fees for revenue as they wait for speculative market prices to catch up to profitability.\n\nCarey continued: “Litecoin was for many years a top-five token but has since lost that position to newer, primarily Layer-1, tokens. A pre-halving price rally could generate some excitement and potentially attract miners if they look for alternatives to Bitcoin.”\n\nHalvings are indeed just one factor impacting price, alongside macroeconomic environment, correlation with tech stocks, trends in investor adoption and, increasingly, the business savvy of major crypto companies (or the lack thereof).\n\nIt is also worth stressing that the sample size of Bitcoin and Litecoin halvings are incredibly small, which renders realistic conclusions difficult to grasp.\n\nLitecoin launched in 2011, not by hard forking the Bitcoin blockchain (as is the case with Bitcoin Cash and the like), but by creating a direct fork of its source code.\n\nLitecoin developers, led by founder Charlie Lee, made small changes to Bitcoin’s original codebase. Namely faster block times (every 2.5 minutes compared to Bitcoin’s 10 minutes, on average) and a higher supply cap (84 million to Bitcoin’s 21 million).\n\nLitecoin’s value proposition was once that it could serve, in some sense, as a spiritual sister network, handling smaller transactions faster and cheaper than Bitcoin, while also acting as a store of value.\n\nThe advent of the Lightning Network shifted that narrative somewhat. Litecoin eventually grew to be a primary testing ground for potential Bitcoin upgrades — privacy focused technology MimbleWimble being one example.\n\nLitecoin’s price is so far tracking its 2015 halving\n\nThere are differences, but the general concept is the same: Distribute cryptocurrency to proof-of-work miners as payment for validating transactions and securing the network against 51% attacks.\n\nDifferent crypto, different investors\n\nHalvings cut those miners’ block rewards in half, leading to a boost to scarcity. As Kaiko’s Carey mentioned, mining profit margins are simultaneously narrowed, especially in Bitcoin’s case; there are less rewards for the same energy-intensive operations.\n\nUnless, of course, prices surge dramatically to make up the difference.\n\n“There clearly are speculators who dabble in Bitcoin in a big way, just as they dabble in Litecoin and other coins, but I would argue that the fundamentals of BTC are the strongest,” Bob Ras, co-founder at tokenized security startup Sologenic, told Blockworks.\n\n“And because the fundamentals are strong with BTC, this means that it’s only natural the impact from the halving is experienced afterwards instead of before.”\n\nLitecoin tends to rally hard leading up to its halvings because its users are mostly speculators, Ras reasoned, “playing ping pong of sorts” until LTC whales begin dumping after the halving.\n\nBitcoin sees “mega surges” following its own halvings due to their “dramatic impact on supply and scarcity,” Ras said.\n\n“After all, a lot of Bitcoin is self-custodied and therefore the availability of BTC on exchanges is relatively less on a proportional basis. So when that supply shock kicks in, and if demand stays the same or increases, then the only option is that of fireworks.”\n\nAs tempting as it is to see the face of god in market reactions to halvings, correlation does not necessarily imply causation, and these milestones are no different — be they Bitcoin or Litecoin.\n\nStill, a wise investor would strap in for increased volatility. The halvings are coming.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWhpdHMtbmV3LXJlY29yZC1oaWdoLWluLWFyZ2VudGluYdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price hits new record high in Argentina - Cointelegraph",
        "content": "Last week, the price of Bitcoin (BTC) reached a record high in Argentine peso (ARS) terms following persistent inflation in Argentina.\n\nArgentina’s inflation pushes BTC’s price to all-time high\n\nOn April 18, the BTC-to-ARS exchange rate crossed over 6.59 million ARS, according to aggregated price data tracked by Google Finance.\n\nSince the peak, the rate has corrected to around 6 million ARS, down 9%, but still up more than 100% year-to-date (YTD).\n\nBTC/ARS price performance so far in 2023. Source: Google Finance\n\nBitcoin’s growth in the Argentine markets coincides with the continuous ARS devaluation. For instance, traders were paying as low as 460 ARS to buy $1 from the black market on April 24 — more than double the official spot rate that pays 220 ARS for the dollar.\n\nFMyA, a United States-based consultancy firm, noted that the Argentine central bank’s reserves have dropped by half to an estimated $1.3 billion since 2019.\n\nThat has raised the risks of further peso devaluation, which has crashed nearly 99% from the currency crisis peak of 330 ARS in 2018. That has led locals to seek haven in the dollar, which has become scarce due to rising demand in the country.\n\nARS/USD price performance since 2004. Source: Google Finance\n\nAt the same time, Bitcoin and similar cryptocurrencies operating outside governments’ and central banks’ purview are increasingly emerging as alternatives. For example, data shows that Bitcoin’s peer-to-peer weekly volume in Argentina reached a record high of nearly $30 million in March on the Paxful exchange.\n\nBitcoin weekly volume in Argentina. Source: Paxful/CoinDance\n\nAlso, a study in 2022 found that nearly 60% of Argentines believe in Bitcoin’s ability to safeguard the value of their savings in the long term. Popular U.S. cryptocurrency exchange Coinbase also recommends BTC become a legal tender in Argentina.\n\nBitcoin gaining traction in Argentina\n\nEarlier in April, the National Commission of Value (CNV), Argentina’s securities regulator, approved a Bitcoin-based futures index on the Matba Rofex exchange set to debut in May. The derivative, settled in pesos, will enable accredited investors to gain exposure to the Bitcoin markets.\n\nRelated: Latin America is ready for crypto — Just integrate it with their payment systems\n\nIn addition, a recent bill proposed by the Ministry of Economy asked citizens to declare their crypto holdings and incentivized them with tax benefits. Also, in December 2022, an Argentine province announced its intentions to issue a dollar-backed stablecoin.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMjQvY3J5cHRvLWlzLWRlYWQtaW4tYW1lcmljYS1zYXlzLXRlY2gtaW52ZXN0b3ItY2hhbWF0aC1wYWxpaGFwaXRpeWEuaHRtbNIBamh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA0LzI0L2NyeXB0by1pcy1kZWFkLWluLWFtZXJpY2Etc2F5cy10ZWNoLWludmVzdG9yLWNoYW1hdGgtcGFsaWhhcGl0aXlhLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "'Crypto is dead in America,' says longtime bitcoin bull Chamath Palihapitiya - CNBC",
        "content": "Tech investor Chamath Palihapitiya, who said two years ago that bitcoin has replaced gold and predicted the digital currency would climb to $200,000, has a much more cautious view on cryptocurrencies these days.\n\n\"Crypto is dead in America,\" Palihapitiya said in the latest episode of the All-In podcast.\n\nPalihapitiya blamed crypto's demise largely on regulators, who have gotten much more aggressive in their pursuit of bad actors in the industry. Securities and Exchange Commission Chairman Gary Gensler has said crypto trading platforms should abide by strict U.S. securities laws.\n\nIn answering questions in front of lawmakers recently, Gensler connected the collapse of Silicon Valley Bank with the crypto industry.\n\n\"You had Gensler even blaming the banking crisis on crypto,\" Palihapitiya said. \"The United States authorities have firmly pointed their guns at crypto.\"\n\nThe SEC has ramped up its enforcement of the crypto industry, bearing down on companies and projects that the regulator alleges were selling unregistered securities.\n\nIn February, the agency proposed rules that would change which crypto firms can custody customer assets. In March, the SEC issued crypto exchange Coinbase a Wells notice — typically one of the final steps before it files charges — warning the company that it identified potential violations of U.S. securities law. Last week, the SEC charged the crypto asset trading platform Bittrex and its ex-CEO with operating an unregistered exchange.\n\nCoinbase CEO Brian Armstrong told CNBC that his company is preparing for a yearslong court battle with the commission, and is also considering relocating outside the U.S. if it doesn't get improved regulatory clarity. Meanwhile, Bittrex has already announced it would wind down U.S. operations specifically due to \"continued regulatory uncertainty.\"\n\nThey \"were probably the ones that were the most threatening to the establishment,\" said Palihapitiya, referring to crypto companies. \"And they were the ones that, in fairness to the regulators, did push the boundaries more than any other sector of the startup economy.\"\n\n\"Now they're paying the price for that,\" he said. \"The bill has come due for them.\"\n\nGensler faced similar criticism from House Republicans over the agency's crackdown on cryptocurrency platforms during four hours of congressional testimony last week.\n\n\"Regulation by enforcement is not sufficient nor sustainable,\" said House Financial Services Committee Chairman Rep. Patrick McHenry, R-N.C. \"You're punishing digital asset firms for allegedly not adhering to the law when they don't know it will apply to them.\"\n\nMcHenry said the SEC's approach was \"driving innovation overseas and endangering American competitiveness.\"\n\nGensler defended the agency's actions.\n\n\"We have a clear regulatory framework built up over 90 years,\" he said, adding that the exchanges \"are \"noncompliant generally, and they need to come into compliance.\"\n\nBitcoin, the largest cryptocurrency, reached a record of about $69,000 in November 2021, when the Federal Reserve's benchmark interest rate was near zero and investors were flooding into risk. The market changed in a hurry last year, as the Fed began steadily raising rates to fight inflation.\n\nIn early 2021, Palihapitiya predicted on CNBC that bitcoin would rise from $39,000 at the time to $100,000 and then up to $200,000.\n\n\"In what period, I don't know,\" he said. \"Five years, 10 years, but it's going there. And the reason is because every time you see all of this stuff happening, it just reminds you that, wow, our leaders are not as trustworthy and reliable as they used to be.\"\n\nLater in 2021, just before the peak, he said bitcoin had \"effectively replaced gold.\"\n\nBitcoin is currently trading at just over $27,300, down 60% from its all-time high."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzI1L2JpdGNvaW5zLTUwLWRheS1hdmVyYWdlLWJlY29tZXMtZm9jYWwtcG9pbnQtZm9yLWNyeXB0by1hbmFseXN0cy1hZnRlci0xMS1wcmljZS1wdWxsYmFjay_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNC8yNS9iaXRjb2lucy01MC1kYXktYXZlcmFnZS1iZWNvbWVzLWZvY2FsLXBvaW50LWZvci1jcnlwdG8tYW5hbHlzdHMtYWZ0ZXItMTEtcHJpY2UtcHVsbGJhY2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's 50-Day Moving Average in Focus for Crypto Analysts After 11% Price Pullback - CoinDesk",
        "content": "Oversold conditions illustrate a notable and consistent downward move in price over a specified period of time without much pullback. Technical analysts use indicators like the relative strength index and stochastic to gauge overbought/oversold conditions with charts that have different time frames (daily, weekly, hourly)."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9iaXRjb2luLXByaWNlLW91dGxvb2stMTAwMDAwLWNyeXB0by13aW50ZXItYmFuay1jcmlzaXMtYnRjLWhhbHZpbmctMjAyMy000gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Could Soar to $100,000 As Crypto Winter Ends: Standard Chartered - Markets Insider",
        "content": "Bitcoin could surge to $100,000 by the end of 2024, according to a Standard Chartered note.\n\nThat's due to bank turmoil, bitcoin halving, and the expected end of Fed rate hikes, among other things.\n\n\"While sources of uncertainty remain, we think the pathway to the USD 100,000 level is becoming clearer.\"\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nThe crypto winter has melted away, and bitcoin is set to flourish, a Standard Chartered note forecasted on Monday.\n\nThe world's biggest digital currency by market cap could surge to $100,000 by the end of 2024, the bank said, representing a 268% increase from current levels.\n\n\"We see potential for Bitcoin to reach the USD 100,000 level by end-2024, as we believe the much-touted 'crypto winter' is finally over,\" wrote Standard Chartered's Geoff Kendrick.\n\nOne of the reasons for the bullish outlook is the turmoil caused by Silicon Valley Bank's collapse last month. As worries of a banking contagion spread, bitcoin re-established its use case as a \"decentralized, trustless and scarce digital asset,\" according to the note.\n\nAdvertisement\n\nAt the same time, key rivals to bitcoin lost ground, especially stablecoins, some of which lost their peg to the US dollar. In fact, some of the assets that backed their value were held in SVB.\n\n\"Against this backdrop, Bitcoin has benefited from its status as a branded safe haven, a perceived relative store of value and a means of remittance,\" Kendrick added.\n\nStandard Chartered now sees bitcoin's share of the total crypto market cap rising to the 50%-60% range, up from 45% today and from 40% before the SVB collapse.\n\nIn addition, the note said bitcoin's recent rebound back above $30,000 also represented a turnaround for crypto miners, who previously had seen mining margins get squeezed.\n\nAdvertisement\n\nBitcoin has since dipped below $30,000, but Kendrick said if prices remain well above mining costs ($15,000), miners will likely hold onto what they mine instead of selling.\n\n\"This creates price upside, in our view. In addition, with energy prices likely having peaked, the structural profitability backdrop for miners should improve, adding further upside,\" he wrote.\n\nBitcoin is also set to trade better in the future as the Federal Reserve is nearing the end of its tightening cycle, Kendrick said, noting that its correlation with the Nasdaq suggests the crypto should trade better if risk-on assets improve broadly.\n\nAnother tailwind is the coin's upcoming halving in 2024, which is when the reward given to miners is cut in half. This is to cap the supply of bitcoins, and has historically led to price increases.\n\nAdvertisement\n\nBitcoin could also see upswings thanks to regulatory changes that promote investor access to the market — such as the creation of digital asset ETFs and stablecoin regulation. Already, some proposals that have been passed in Europe hold positive implications on crypto volatility.\n\n\"While sources of uncertainty remain, we think the pathway to the USD 100,000 level is becoming clearer,\" Kendrick said."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzI1L2VtYmF0dGxlZC1jcnlwdG8tbWluaW5nLWFuZC13YWxsZXQtZmlybS1wb29saW4tbW92ZWQtMTUwbS1pbi1iaXRjb2luL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzI1L2VtYmF0dGxlZC1jcnlwdG8tbWluaW5nLWFuZC13YWxsZXQtZmlybS1wb29saW4tbW92ZWQtMTUwbS1pbi1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "A Crypto Mining Firm May Have Moved $150M in Bitcoin, CryptoQuant Says - CoinDesk",
        "content": "The data and intelligence firm told CoinDesk that there is a \"higher probability that the wallet address is more affiliated with the AntPool entity than Poolin entity. There is inevitably some level of inaccuracy in the clustering algorithm\" and that \"the bridge wallet address was tricky.\""
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjI3ODk4L2JpdGNvaW4td2hhbGUtdHJhbnNmZXJzLW1pbGxpb25z0gFIaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjI3ODk4L2JpdGNvaW4td2hhbGUtdHJhbnNmZXJzLW1pbGxpb25z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin whale rouses from the deep, moves nearly $11 million after 12 years - The Block",
        "content": "A dormant bitcoin whale address, which hasn't been active for 12 years, transferred nearly $11 million in bitcoin\n\nThe address in question sent 400 bitcoins in batches of 100 to another address with a cumulative U.S. dollar value of $10.9 million. The transfer transaction fee came to 19 thousand satoshis, or $5.22, according to on-chain data.\n\nThe wallet had been dormant since 2011, when it added 900 and then 100 bitcoin worth around $4,300 and $480 at the time, respectively, according to on-chain data via BitInfoCharts.\n\nToday's awoken whale follows a recent trend of long-dormant wallets springing back to life.\n\nWake up call\n\nRELATED INDICES See crypto indices\n\nOn Thurday, a bitcoin whale address that had been dormant for over nine years transferred 2,071.5 BTC ($60.7 million) out. A day later, another whale awoke after a decade of inactivity, transferring 279 bitcoins — worth $7.8 million — to three fresh addresses.\n\nThe wake-up isn't limited to Bitcoin, a long-dormant Ethereum address that participated in the blockchain's initial coin offering, or ICO, awoke after over seven years today. The wallet transferred one ether to a new address.\n\nUPDATE: the transaction fee was 19,000 satoshis."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ydXNzaWEtMm5kLWJpZ2dlc3QtYml0Y29pbi1taW5lci0xMzM4NTk5NjUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Russia is 2nd biggest Bitcoin miner after U.S.: report - Yahoo Finance",
        "content": "Russia is now the second largest Bitcoin miner after the U.S., according to a report by Russian media Kommersant. Russia’s new ranking comes amid moves by the U.S. to tax and regulate crypto mining at both state and federal levels, resulting in a less welcoming environment for the industry in the U.S.\n\nSee related article: Bitcoin mining difficulty rises 1.7% to record high, hashrate jumps\n\nFast facts"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMjQvYml0Y29pbi1kcm9wcy10by0yNzNrLWV0aGVyLWVkZ2VzLXRvd2FyZC0xOGstYW1pZC1pbnZlc3RvcnMtaW50ZXJlc3QtcmF0ZS1jb25jZXJucy_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNC8yNC9iaXRjb2luLWRyb3BzLXRvLTI3M2stZXRoZXItZWRnZXMtdG93YXJkLTE4ay1hbWlkLWludmVzdG9ycy1pbnRlcmVzdC1yYXRlLWNvbmNlcm5zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Drops to $27.3K, Ether Edges Toward $1.8K Amid Investors' Interest Rate Concerns - CoinDesk",
        "content": "“A rising ratio means that BTC is outperforming safe-haven gold despite the ongoing macro uncertainty and is a bullish signal,” Kaiko said, adding the ratio, which had previously fallen to its lowest level when the FTX exchange collapsed in November, rebounded this year."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMjUvYml0Y29pbi1jb3VsZC1iZS1wb2lzZWQtZm9yLWEtcmVib3VuZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Could Be Poised for a Rebound - CoinDesk",
        "content": "Meanwhile, bitcoin approaching the lower range of its Bollinger Bands raises the question of whether prices will decline below the mark or stay within the confidence interval and move higher."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMjUvYml0Y29pbi13aGFsZXMtc3Bvb2stY3J5cHRvLXR3aXR0ZXItd2l0aC1zdWRkZW4td2FsbGV0LW1vdmVtZW50cy_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA0LzI1L2JpdGNvaW4td2hhbGVzLXNwb29rLWNyeXB0by10d2l0dGVyLXdpdGgtc3VkZGVuLXdhbGxldC1tb3ZlbWVudHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Whales Spook Crypto Twitter With Sudden Wallet Movements - CoinDesk",
        "content": "Monahan estimated more than 5,000 ether were drained from such wallets in the sophisticated attack. “My best guess is that someone has got themselves a fatty cache of data from 1 plus yr ago & is methodically draining the keys as they parse them from the treasure trove,” Monahan tweeted at the time."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMitwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9zdG9ja3MvbmV3cy9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjQtYXByaWwtMjAyMy9hcnRpY2xlc2hvdy85OTcyNjEyMi5jbXPSAbsBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvc3RvY2tzL25ld3MvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTI0LWFwcmlsLTIwMjMvYW1wX2FydGljbGVzaG93Lzk5NzI2MTIyLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin drops below $27,500; Polygon, Solana shed up to 3% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: Most of the cryptocurrencies were trading in the red on Monday. Bitcoin (BTC) fell 0.44% to $27,477, whereas Ethereum (ETH) was below the $1,850 level.\"The latest dip in Bitcoin can be seen as a price correction after the mini bull run. The healthy pullback means that BTC has more potential for growth if macroeconomic factors turn favourable. The crypto market is expected to remain stable in the coming weeks if there are no surprising news headlines,\" Shivam Thakral, CEO of BuyUcoin, said.Other top crypto tokens were also trading lower. BNB XRP , Cardano, Dogecoin , Polygon and Polkadot declined up to 3%. The global cryptocurrency market cap was trading lower around $1.16 trillion, falling 0.73% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $531 billion. BTC volume stood at approximately $13.98 billion, rising 6.87% in the last 24 hours. Bitcoin’s dominance is currently 45.93%, an increase of 0.19% over the day, according to CoinMarketCap.\"Bitcoin has seen a 10% decline over the past three days due to liquidation of long positions and a break of key support in the $29,000 area. Hotter-than-expected US Economic Survey data and UK inflation data pushed US yields higher, weighing on low-yielding crypto assets like Bitcoin,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.Rajagopal Menon, Vice President at WazirX said, \"Major market indicators point towards a Buy sentiment. The Relative Strength Index (14), one of the key indicators, sits at 45, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) is at 15 and 29, respectively, further indicating a ‘buy’ and ‘Neutral’ market.\"\"The MACD Level (12, 26) at 126 indicates a sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 12 with a Neutral indicator, while the Williams Percent Range (14) at −85 signals Buy,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.39 hours, IST on April 24, 2023)Bitcoin $27,477 -0.44%Ethereum $1,841 -1.44%Tether $1.00 -0.04%BNB $329 -0.35%XRP $0.4665 -0.83Cardano $0.3857 -1.46%Dogecoin $0.07886 -1.54%Polygon $0.9939 -2.88%Solana $21.23 -2.79%Polkadot $5.92 -0.30%Shiba Inu $0.00001028 -1.42%Litecoin $87.28 0.65%Tron $0.06601 -0.40%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNhbi1lYXNpbHktaGl0LTIway1pbi1uZXh0LTQtbW9udGhzLXBoaWxpcC1zd2lmdNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price can 'easily' hit $20K in next 4 months — Philip Swift - Cointelegraph",
        "content": "Bitcoin (BTC) is done with its bear market, but the coming months may see a return to $20,000.\n\nThat is the outlook for Philip Swift, a veteran Bitcoin market analyst who co-founded trading suite DecenTrader and data resource Look Into Bitcoin.\n\nIn his latest interview with Cointelegraph, Swift takes a look at what the near to long-term future holds for BTC price action.\n\nAfter predicting the end of the bear market at the end of 2022, Swift is sticking by his appraisal of underlying price strength, while staying cautious on the odds of a deeper correction than last week’s 10% dip.\n\nBulls face many obstacles on the road to new all-time highs, he said, with government policy particularly troubling when it comes to potential price suppression.\n\nNonetheless, there is every reason to believe that for now, the bottom is in, and a solid period of growth awaits Bitcoin in the latter half of the year.\n\nCointelegraph (CT): In our last interview in October, you predicted the Bitcoin bear market would be over in three months. Do you think it’s gone for good?\n\nPhilip Swift (PS): Yes.\n\nIt really felt like we were close to max pain back in October, and we got the final capitulation shortly after in November. BTC then started trending up in January, three months after our interview.\n\nThis chart highlights how the current bear market has been really quite similar to previous cycles in terms of timing showing that human nature never really changes.\n\nThat does not mean we cannot have a decent correction in the next few months, though. We may experience some volatility and chop after what has been an outstanding Q1 2023 where BTC has rallied 80%. I would not be surprised if we need to cool off for a little while.\n\nCT: Since Bitcoin gained 80% in Q1, has BTC’s price performance in 2023 surprised you?\n\nPS: It is not unusual for Bitcoin to put in major moves like that after such a long period of depression. As the price rallied up from the lows, we could see that funding rates were remaining flat/negative, which indicated that there was major disbelief among derivative traders.\n\nThat helped BTC’s price keep trending up all the way to $30,000 with a succession of short squeezes.\n\nCT: A large number of market participants remain skeptical of this year’s rally and expect a return to $20,000 or worse. To what extent do you agree with them?\n\nPS: It is definitely possible, as that would just be a -25% move to the downside from current prices. For a volatile asset like Bitcoin, that could quite easily play out at some point in the next three to four months. Beyond that, I think it becomes increasingly unlikely, as I do believe that the halving narrative will kick in later in the year, which should increase buy pressure.\n\nRelated: Bitcoin price flatlines near $27K — What can trigger the next move?\n\nCT: We’ve had various regulatory bombshells from which Bitcoin has managed to bounce back time and again in recent months. Do you think the market can continue to shake off such “mini” black swans?\n\nPS: I do as long as these mini black swans are quite specific and not industry-wide. To expand on that, my greatest fear for Bitcoin is a coordinated attack by major governments to cut off the fiat banking on and off-ramps that support the space.\n\n“I know Bitcoin is built to survive in isolation, but I do think that if such a coordinated effort is executed well, it would significantly suppress price for a long time.”\n\nWhat we are seeing in the U.S. right now in terms of regulations is not particularly encouraging. It is definitely something to watch over the next couple of years.\n\nCT: What’s your take on the U.S. banking crisis and its aftermath? Are we in for more shock events in the near to mid-term?\n\nPS: We will have to wait and see whether or not recent banking sector events were just the tip of the iceberg. However, I do think such events are ultimately a positive catalyst for Bitcoin — particularly among younger people, who will continue to question why they are better off having savings in a bank where there is custodial risk versus a decentralized self-custodied asset like Bitcoin.\n\n“Ultimately, I believe that banking sector problems relating to customer deposits are long-term bullish for Bitcoin.”\n\nCT: All things being equal, how do you see BTC/USD performing this quarter and beyond? Is it too early to talk about a pre-halving build-up?\n\nPS: I think we may need some sideways action from here for a few months after the stonking Q1 Bitcoin had. Toward the end of the year, late Q3 and into Q4, I expect the pre-halving narrative to really get going, which should have a positive impact on price.\n\nAlso, that should be enough time for the market to heal post-FTX. We should also have gone through much of the Mt. Gox selling risk. Any remaining selling should be evaluated and priced in by the market at that point.\n\nCT: Filbfilb (CEO of DecenTrader) recently released an analysis of how Bitcoin might perform during the next halving cycle and doubled down on $180,000 as his top target. Where do you stand on the next cycle’s blow-off top?\n\nPS: It is certainly possible. I expect long-term holders to start offloading their Bitcoin as the price goes beyond $80,000.\n\n“That will start to bring new supply into the market. Eventually, there will be too much supply for demand to soak up. I do expect that to be over $100,000.”\n\nExactly where is very hard to call. Back in 2017, we saw a price rally from $10,000 up to the $20,000 high in less than two weeks! Many people forget about that. If we do get another blow-off top like that, such volatility makes it extremely difficult or near impossible to call the exact top.\n\n“I think a realistic range would be $120,000–$210,000.”\n\nCT: What BTC price metrics currently have your attention?\n\nPS: Bull market comparison: useful to understand where we are from a timing perspective.\n\n1yr HODL Wave: Shows that long-term holders have accumulated and will not sell en masse until the price makes a new all-time high.\n\nBitcoin 1-year HODL Wave chart. Source: Decentrader\n\nMVRV Z-Score: Indicates levels of marketwide “profit” — the difference between market cap and realized cap. Currently, the market has just moved back into profit as the Z-score (blue line) has moved above the green accumulation zone. Still a long way to go until we get close to a market top.\n\nBitcoin MVRV Z-Score chart. Source: DecenTrader\n\nCT: Is the NFT market dead?\n\nPS: No, but it is currently in a state of major depression.\n\nWhile quality collections are broadly flat in USD terms, nearly all major collections are down versus Ether (ETH) over the past several months.\n\nVolumes are way down since bull market highs — $150 million per week versus the bull market highs of $1 billion.\n\nWe are even seeing NFT influencers on Twitter pivot to talk about other subjects like AI. That is not to say those influencers are not bullish long-term on NFTs, just that interest in short to mid-term NFT prices has clearly evaporated.\n\n“Having said that, we believe that we may soon be coming toward the latter stages of the NFT bear market.”\n\nWhile there may be more general market pain, we expect to see strategic investors increasingly on the lookout for quality NFTs at bargain prices. This could provide relief for a small number of collections in the near term.\n\nMagazine: Crypto regulation: Does SEC Chair Gary Gensler have the final say?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93ZWYtcy1wcm9tby12aWRlby1zaG93cy1iaXRjb2luLW1pbmluZy1idXQtaXQtbGVhdmVzLW91dC10aGUtYi13b3Jk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "WEF's promo video shows Bitcoin mining, but leaves out the B-word - Cointelegraph",
        "content": "The World Economic Forum (WEF) showcased the facilities and tech employed by a cryptocurrency mining firm and implied its operations were the “biggest winner” for the environment — but it never actually said it was mining crypto.\n\nPublished on April 20, the WEF video promoted efforts toward reducing flaring — where large amounts of gas from oil production or from decomposition are wasted — by the Colorado-based Bitcoin (BTC) miner Crusoe Energy Systems.\n\nProminent imagery of what appear to be cryptocurrency mining facilities are presented throughout the video; however, the video never directly addresses what is actually happening.\n\nThe video (screenshot) appears to show a facility housing Bitmain Antminer mining rigs but is referred to as a data center. Source: WEF\n\nChase Lochmiller, CEO, and co-founder of Crusoe, explained in the video that it builds and operates “modular data centers” that are co-located with waste energy sources to use wasted methane streams to generate power.\n\nIt was noted this enables the production of “ultra-low-cost computing infrastructure” by utilizing stranded energy sources that would otherwise go unused.\n\nA still from the video showing a close-up of what appears to be a Bitmain Antminer mining rig. Source: WEF\n\nThe video was noticed by several crypto industry figures.\n\nMicroStrategy co-founder Michael Saylor shared the video with his 3 million Twitter followers on April 23, stating that “even the WEF is recognizing the environmental benefits of Bitcoin Mining.”\n\nEven the @WEF is recognizing the environmental benefits of Bitcoin Mining. pic.twitter.com/kPnMIfyJpU — Michael Saylor⚡️ (@saylor) April 23, 2023\n\nMeanwhile, Kristine Cranley, a director at the advocacy group the Texas Blockchain Council, pointed out in an April 23 tweet that the video didn't once mention \"the b word\": Bitcoin.\n\n@WEF promoting mining without using the b word! Source below. Contrast this with the tone of the @nytimes hit piece! Same topic … different emotional experience they are trying to deliver. @NYTimesUp pic.twitter.com/d4OEPkWYFc — Kristine Cranley (@KristineCranley) April 23, 2023\n\nOne user suggested in a tweet that the WEF wasn’t allowed to mention BTC because of their previous “standpoint,” which has included advocacy for changing Bitcoin’s code to proof-of-stake, citing the environmental impact of its current consensus mechanism.\n\nCrusoe expanded its Bitcoin mining assets through the acquisition of the operating assets of portable BTC mining operator Great American Mining (GAM) in October 2022.\n\nRelated: ExxonMobil is using excess natural gas to power crypto mining: Report\n\nThe acquisition added over 10 megawatts (MW) to Crusoe’s mining output, along with approximately 4,000 application-specific integrated circuit (ASIC) crypto-mining rigs.\n\nIn June 2022, Crusoe Energy partnered with the government of Oman — a country that exports 21% of its gas production and seeks zero gas flaring by 2030.\n\nCrusoe will open an office in Oman’s capital city of Muscat and install its equipment for capturing gas waste at well sites to use as computing power for crypto mining.\n\nMagazine: Crypto Twitter Hall of Flame: Pro-XRP lawyer John Deaton ‘10x more into BTC, 4x more into ETH"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2NvbW1vZGl0aWVzL2JpdGNvaW4tcHJlZGljdGlvbnMtb3V0bG9vay01MGstaGFsdmluZy1hdWd1c3QtMjAyNC1jdXRzLXN1cHBseS1hbmFseXN0cy0yMDIzLTTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Could Top $50,000 As Next Year's Halving Cuts Supply: Analysts - Markets Insider",
        "content": "Bitcoin's 66% gain so far this year may be just the beginning of a bigger rally, according to some crypto analysts.\n\nBitcoin could surge past $50,000 as a routine 'halving' process due next year would slash supply, per Bloomberg.\n\nHalving could help the coin gain by at least 81%, per Bloomberg Intelligence and Matrixport.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nBitcoin has rallied 66% this year after a dismal 2022 - and that may be just the beginning of a bigger advance.\n\nSome cryptocurrency analysts think the token could surge past $50,000 following a routine 'halving' process due next year that would slash supply, according to a report by Bloomberg. The original digital coin is currently trading around $27,400, after briefly topping $30,000 earlier in April. It finished last year near $16,500.\n\nThe world's most traded cryptocurrency has soared after each of the last three 'halvings' that have taken place since 2012, according to data from Bloomberg Intelligence and Matrixport. The process could help the coin gain at least 81%, the outlet reported.\n\nBitcoin 'halving' happens roughly every four years and is due next in April 2024. It's done to eventually cap the token's total supply at 21 million units, and cuts in half the rate at which new coins are released as well as the reward given to miners for their work in processing transactions.\n\nAdvertisement\n\nMarkus Thielen, head of research and strategy at the digital-asset investment firm Matrixport, predicts that bitcoin will more than double its current price and reach around $65,623 by next April, Bloomberg reported. Bloomberg Intelligence analyst Jamie Douglas Coutts told the outlet he thinks the market has priced in 50% of the expected halving that's expected next year.\n\n\"Bitcoin cycles bottom around 12-18 months prior to the halving and this cycle structure looks similar to the past ones, albeit many things have changed — while the network is vastly stronger, bitcoin has never endured a prolonged severe economic contraction,\" Coutts told the publication.\n\nThe coin was trading at 27,618.70 at last check Monday, down from an all time high of almost $69,000 reached in November 2021.\n\nThe crypto industry took a hit in 2022 — a year dubbed a \"crypto winter\" — that saw overall market cap crash by more than $1.4 trillion, and bitcoin lose 64% of its value as the sector suffered a string of high-profile crypto bankruptcies including FTX and Three Arrows Capital.\n\nAdvertisement\n\n\"If the collapse of FTX was indeed the bottom of this cycle, then history would suggest that we still have approximately 350 days of 'accumulation' before witnessing the characteristic post-halving breakout price action,\" said Jacob Joseph, an analyst at CCData, according to the Bloomberg report."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vOXRvNW1hYy5jb20vMjAyMy8wNC8yNS9hcHBsZS1yZW1vdmVzLWJpdGNvaW4td2hpdGVwYXBlci1mcm9tLW1hY29zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Apple removes Bitcoin whitepaper from the latest macOS beta - 9to5Mac",
        "content": "A few weeks ago, users discovered that every copy of macOS has the original Bitcoin whitepaper hidden in its internal files. Apple never discussed the reason for this, although we believe that the existence of the file there was just a joke among Apple engineers. Now the file is gone with the latest version of macOS Ventura beta.\n\nmacOS has a copy of the Bitcoin whitepaper, but Apple is now removing it\n\nFollowing the release of macOS Ventura 13.4 beta 3 to developers on Tuesday, 9to5Mac has found that Apple has removed the Bitcoin whitepaper that was hidden in the system files. More specifically, the file was located in a folder within the Image Capture app along with other random assets, such as other PDF files and images.\n\nThese assets were part of an internal tool called “VirtualScanner.app” that let Apple engineers simulate the process of scanning and exporting documents and images with the Image Capture app without actually needing a scanner. In fact, the entire internal tool has been removed from the beta.\n\nThis pretty much confirms our original theory that both the Bitcoin whitepaper and the internal tool were never meant to be found by regular users. The most likely explanation is that the engineers previously did not bother to remove this tool from the public release of macOS since it didn’t include any sensitive information.\n\nThe Bitcoin whitepaper seems to have been added to the system with macOS Mojave in 2018. If you haven’t updated your Mac to the latest beta yet, you can still find the file by running the following command in Terminal:\n\nopen /System/Library/Image\\ Capture/Devices/VirtualScanner.app/Contents/Resources/simpledoc.pdf\n\nGiven the repercussions that the original news story had, it’s no surprise that Apple ended up removing the file from the system."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTA0LTI2L2JpdGNvaW4tY3J5cHRvLWJyb3MtaGFpbGluZy1ldS1yZWQtdGFwZS1hcmUtaW4tZm9yLWEtbmFzdHktc3VycHJpc2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Crypto Bros Hailing EU Red Tape Are In for a Nasty Surprise - Bloomberg",
        "content": "On April 20, the day that the European Parliament approved a sweeping package of cryptocurrency rules known as MiCA, a new euro-denominated stablecoin was unveiled on the continent. “CoinVertible” seeks to bridge the gap between traditional and digital finance, is available only to institutional investors, and is designed not by hoodie-wearing techies but French banking giant Societe Generale SA.\n\nThe sight of regulated banks dabbling in blockchain quickly generated online eye-rolling from crypto bros, who mocked the token’s heavy-handed compliance procedures. CoinVertible’s pitch is to offer legal certainty, collateral transparency and interoperability with TradFi — all in the spirit of MiCA — but only for clients who are approved using SocGen’s existing know-your-customer procedures."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5oaW5kdXN0YW50aW1lcy5jb20vd29ybGQtbmV3cy9teXN0ZXJ5LWJlaGluZC1iaXRjb2luLWZvdW5kZXItc2F0b3NoaS1uYWthbW90by13YXMtaGUtYXBwbGUtZm91bmRlci1zdGV2ZS1qb2JzLW5vLTEwMTY4MjMwOTkxMDU1NS5odG1s0gGVAWh0dHBzOi8vd3d3LmhpbmR1c3RhbnRpbWVzLmNvbS93b3JsZC1uZXdzL215c3RlcnktYmVoaW5kLWJpdGNvaW4tZm91bmRlci1zYXRvc2hpLW5ha2Ftb3RvLXdhcy1oZS1hcHBsZS1mb3VuZGVyLXN0ZXZlLWpvYnMtbm8tMTAxNjgyMzA5OTEwNTU1LWFtcC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Unraveling the enigma of Satoshi Nakamoto, was he Steve Jobs? maybe not - Hindustan Times",
        "content": "Twelve years ago, on April 23, 2011, the world of cryptocurrency witnessed a cryptic milestone when Satoshi Nakamoto, the elusive mastermind behind Bitcoin, penned one of the final correspondences to software developer Mike Hearn. The mysterious individual, who never revealed his real identity to the world, stated that he had \"moved on to other things\" and asserted that the project (Bitcoin) was in \"good hands.\" Since then, Nakamoto's identity has been the subject of much speculation. Bitcoin creator, Satoshi Nakamoto statue in Budapest features a reflective face(expansion.mx)\n\nIn December 2010, after the creation and initial implementation of Bitcoin, Satoshi Nakamoto vanished from the public eye. The last public message from this innovator was issued on December 12th, in which Nakamoto emphasized the need to work on denial-of-service (DoS) protection.\n\nHindustan Times - your fastest source for breaking news! Read now.\n\nAccording to Bitcoin.com, on April 23rd, 2011, Hearn received an email from Nakamoto in which he maintained that they had \"moved on to other things\" and expressed confidence in the project being in \"good hands with Gavin and everyone.\" Nakamoto also expressed hope for the continued development of Bitcoinj, Mike Hearn's Java version of Bitcoin, as it would provide Java developers with a project to work on. The email was titled, \"Holding coins in an unspendable state for a rolling time window.\"\n\nBitcoin.com then unveils another email from Nakamoto, \"I wish you wouldn't keep talking about me as a mysterious shadowy figure,\" and urged Andresen to focus on the open-source project and give more credit to the dev contributors, as it would help motivate them.\n\nIn March 2014, a Newsweek article claimed that creator of Bitcoin was a 64-year-old Japanese-American named Dorian Nakamoto. As a response message allegedly authored by Satoshi Nakamoto appeared on the P2P Foundation's online forum, stating, \"I am not Dorian Nakamoto.\"\n\nYears later technologist Andy Baio, in his blogpost claimed, to have stumbled upon a copy of Satoshi Nakamoto's Bitcoin white paper on his Mac computer which may have revealed his true identity. Since then several theories have been floating whether the man behind world's biggest cryptocurrency was none other than Apple co-founder Steve Jobs.\n\nBaio's discovery sparked fresh speculation that Nakamoto could have been Steve Jobs. \"Was Steve Jobs actually Satoshi Nakamoto, the creator of #bitcoin?\" tweeted Lark Davis, a Bitcoin investor and blogger with 1.1 million followers. \"Plus, Satoshi disappeared in December 2010, and then Jobs passed in October 2011. The timelines fit...\"\n\nThere is no concrete evidence linking Jobs to the creation of Bitcoin, and the appearance of the Bitcoin white paper on Mac computers seven years after Jobs' death makes it difficult to draw a direct connection.\n\nWhile the timelines of Nakamoto's disappearance and Jobs' passing do overlap, correlation does not necessarily imply causation. It's essential to consider that many individuals in the tech industry have been speculated to be Nakamoto, but none have been definitively confirmed. The identity of Satoshi Nakamoto remains one of the most intriguing mysteries in the world of cryptocurrency.\n\nThe debate over Nakamoto's identity continues, with some users agreeing with the theory, while others remain skeptical. As the enigma of Satoshi Nakamoto deepens, fans are left to wonder whether the mastermind behind Bitcoin was truly the late Apple co-founder, Steve Jobs. Regardless of the outcome, the mystery surrounding Nakamoto adds an intriguing layer to the already captivating world of cryptocurrency."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXRvcC0xMC1jcnlwdG9zLWZhbGwtMTEzNzU4OTA0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin, all top 10 cryptos fall; Asian equity markets drop on rising Covid fears - Yahoo Finance",
        "content": "Bitcoin fell in Tuesday afternoon trade in Asia, along with all other top 10 non-stablecoin cryptocurrencies. Polygon was the biggest loser followed by Solana. Most Asian markets dropped amid concerns of rising Covid cases in China ahead of its Labour Day holiday, the first long public holiday since the Lunar New Year. Most U.S. stock futures traded in the red while European bourses extended losses.\n\nSee related article: Cryptocurrencies trade lower as weekly losses pile up\n\nFast facts"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXMtcHJpY2UtaXMtZG93bi0xMC1uZXctYmVhci1tYXJrZXQtb3ItY29ycmVjdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's price is down 10% — New bear market or correction? - Cointelegraph",
        "content": "In today’s Market Report episode, analyst and writer Marcel Pechman covers the potential triggers to move Bitcoin’s price away from $27,000, including the United State Federal Reserve meeting on May 3. The show airs every Tuesday on the Cointelegraph Markets & Research YouTube channel.\n\nThe first news article discussed the catalysts for Bitcoin’s next move, including whether the Fed will follow the markets’ consensus of a 25-basis-point interest rate increase on May 3. The video analyzes how Bitcoin (BTC) should react to the central bank’s decision and explains how interest rates affect families and businesses.\n\nIn Pechman’s opinion, the correlation between Bitcoin and the stock market should decline considering the U.S. is nearing its debt limit and the economy is displaying signs of weakness and recession. Pechman does not believe there’s a rationale for Bitcoin trading at $25,000, as some analysts have suggested.\n\nOn to the show’s next topic, Pechman discusses Coinbase’s court action against the Securities and Exchange Commission. “Coinbase is looking to force the SEC to respond to its petition seeking rules for the crypto industry… asking the SEC to provide clarification about how it goes about classifying tokens as securities.”\n\nAccording to Pechman, it seems like the tables have turned, as the regulator has been postponing its ruling and harassing exchanges without ever giving some direction on what sets the bar for tokens to become securities. The conclusion? This case can have a bigger impact than previously imagined because judges will take note of the SEC’s arguments.\n\nIn the last part of The Market Report, Pechman argues that Ether (ETH) is in a bad place due to average transaction fees above $4. Consequently, the total value locked (TVL) in Ethereum’s smart contracts in Ether terms plunged to their lowest levels since August 2020.\n\nAt the end of the show, Pechman focuses on Ether’s derivatives markets, more specifically the put-to-call options volume. Currently, the protective put options outnumber the neutral-to-bullish call options by more than four times. Judging by pro traders’ bearish view, Ether’s price will unlikely be able to sustain the $1,850 support.\n\nThe Market Report airs every Tuesday, so be sure to head on over to the Cointelegraph Markets & Research YouTube page and smash those Like and Subscribe buttons for all our future videos and updates."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGVjcnlwdC5jby8xMzc3MTUvd2hhbGUtbW92ZXMtMTFtLWluLWJpdGNvaW4tYWZ0ZXItc2xlZXBpbmctZm9yLTEyLXllYXJz0gFWaHR0cHM6Ly9kZWNyeXB0LmNvLzEzNzcxNS93aGFsZS1tb3Zlcy0xMW0taW4tYml0Y29pbi1hZnRlci1zbGVlcGluZy1mb3ItMTIteWVhcnM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Satoshi-Era Bitcoin Whale Moves $11 Million After Sleeping for 12 Years - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe whales keep waking up. Today, another sleeping HODLer moved 400 Bitcoin—worth nearly $11 million at current prices—after not having transacted for nearly 12 years.\n\nMonday’s movements showed the whale moved 360 BTC ($9.8 million) to one wallet while the remaining 40 BTC to a number of other locations.\n\nThe term “whale” refers to Bitcoin investors who have more of the cryptocurrency than others. The hoarders often sit on their millions of dollars in digital assets, and sometimes reemerge after a long stretch of time to move their investment to other addresses.\n\nAD\n\nAD\n\nSuch movements are becoming more commonplace: Just last week, a whale moved over 279 BTC, or $7.6 million, to new wallets after a decade of inactivity.\n\nAnd in February, an old BTC address that had not budged in 11 years made a transaction by moving $9.6 million worth of the cryptocurrency. The coins had appreciated by 120,000,000% over the years, with the lucky investor having first received the Bitcoin when it was worth $8 a coin.\n\nBut although large movements do happen regularly, according to an analyst who spoke to Decrypt, an investor who hasn’t budged their coins in a decade isn’t too common.\n\nKirill Kretov, a developer of tools for automated trading, said: “An awakening of 2011 is rather rare, but we don’t know how much their owner has in total. It might be that recent large awakenings could also be attributed to the same entity.”\n\nWhales are by far the most successful investors: Bitcoin is up over 40,000% in the past 10 years. Those who sit on the cryptocurrency for the long-term make the biggest profits, while inexperienced retail investors who buy and sell crypto in the short-term tend to lose out, research shows.\n\nAD\n\nAD\n\nToday’s whale made a number of large transactions to move the cryptocurrency.\n\nBitcoin right now is trading for about $27,280, according to CoinGecko, down more than10% in the past week, and 1.3% in the past 24 hours."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iYWxsZXQtYW5ub3VuY2VzLW5vdy1zZWxsaW5nLWJpdGNvaW4tMTk1NjAwNjcwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Ballet Announces New Service, Now Selling Bitcoin For Physical Delivery - Yahoo Finance",
        "content": "The cryptocurrency wallet company Ballet announced today the launch of a new service, selling bitcoin for physical delivery. As an industry first, this new service allows customers to buy and invest in bitcoin while avoiding the hassle and risks associated with using a cryptocurrency exchange. After placing an order on Ballet's website, customers will be sent a cold storage card loaded with the purchased bitcoin. The seamless retail experience can be compared to buying gold and silver coins from an online precious metals retailer, with the gold and silver shipped to the customer.\n\nLAS VEGAS, NV / ACCESSWIRE / April 24, 2023 / The cryptocurrency wallet company Ballet announced today the launch of a new service, selling bitcoin for physical delivery. As an industry first, this new service allows customers to buy and invest in bitcoin while avoiding the hassle and risks associated with using a cryptocurrency exchange. After placing an order on Ballet's website, customers will be sent a cold storage card loaded with the purchased bitcoin. The seamless retail experience can be compared to buying gold and silver coins from an online precious metals retailer, with the gold and silver shipped to the customer.\n\nBallet Crypto Inc., Monday, April 24, 2023, Press release picture\n\n\"With our new service, we're offering a fundamentally new way to buy bitcoin that mimics the simplicity and convenience of buying gold and silver coins, while allowing customers to tap into the extraordinary investment potential of bitcoin,\" said Ballet founder and CEO Bobby Lee. \"We believe this service will make bitcoin accessible to hundreds of millions of new investors, and it will appeal to experienced users as well, as this is a great way to allow their friends and family members to easily buy and hold bitcoin,\" said Lee.\n\nThe purchased bitcoin will be delivered on Ballet's patented physical storage card, PURE Bitcoin, a variation of Ballet's flagship REAL Series cryptocurrency wallet. Similar to the REAL Series wallet, PURE Bitcoin is a stainless steel card that holds the bitcoin in cold storage, with the specific bitcoin denomination clearly shown on each card. This makes each loaded PURE Bitcoin card a physical bearer asset for bitcoin. There are no electronic components, providing superior durability and protection from cybersecurity threats such as hackers and malware. It's designed with tamper-evident security and anti-counterfeiting measures, and just like the REAL Series, it's incredibly easy to use. Once the customer receives their loaded PURE Bitcoin card, they can easily move the bitcoin on-chain to their wallet of choice. Alternatively, customers can choose to leave the bitcoin on the PURE Bitcoin cold storage card for long-term safekeeping. The bitcoins are held safely in cold storage on this physical card using Ballet's patented 2FKG implementation of the open-source BIP38 industry standard, which allows the user to generate the private keys to their digital bitcoins privately, at the time and location of their choosing.\n\nStory continues\n\nBy offering a retail experience similar to purchasing gold and silver coins, Ballet's new service aims to bridge the gap between traditional investment options and the surging demand for bitcoin. For the first time ever, customers can place an order on Ballet's website and then take physical delivery of their bitcoin securely, all without the need to use an online cryptocurrency exchange. By eliminating the need for an exchange, this service minimizes potential exposure to cybersecurity threats and reduces the learning curve for new Bitcoin users. Ballet is currently selling physical PURE Bitcoin cards in denominations of 0.1, 0.025, 0.01, and 0.005 BTC.\n\nThe innovative, user-friendly design of PURE Bitcoin cards makes them an ideal gift option for those looking to introduce friends and family to the world of bitcoin investing. They can also be advantageous for inheritance purposes, because unlike other cryptocurrency storage methods, heirs would not need technical expertise to access private keys or encrypted digital wallets.\n\nBallet is currently offering bitcoin for sale in the United States in states where regulations allow, with work ongoing to expand availability into more jurisdictions.\n\nBitcoin for physical delivery can be purchased at: https://bitcoin.ballet.com/\n\nAbout Ballet:\n\nBallet is a US-based cryptocurrency wallet company founded in 2019 by Bobby Lee, the former CEO of BTCC, one of the world's first and largest Bitcoin exchanges. Ballet's mission is to make cryptocurrency easy, safe, and accessible to everyone by providing simple and secure wallet solutions. Ballet products are designed to be easy to use, even for those with no previous experience in cryptocurrency.\n\nFor media inquiries, please contact: media@ballet.com\n\nMedia Contact\n\nOrganization: Ballet Crypto Inc.\n\nContact Person: Stephanie Ma\n\nWebsite: https://bitcoin.ballet.com/\n\nEmail: media@ballet.com\n\nCity: Las Vegas\n\nState: NV\n\nCountry: United States\n\nPR Contact\n\nKing Newswire\n\nsupport@kingnewswire.com\n\nSOURCE: Ballet Crypto Inc.\n\n\n\n\n\nView source version on accesswire.com:\n\nhttps://www.accesswire.com/750961/Ballet-Announces-New-Service-Now-Selling-Bitcoin-For-Physical-Delivery\n\n\n\n"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWZsYXRsaW5lcy1uZWFyLTI3ay13aGF0LWNhbi10cmlnZ2VyLXRoZS1uZXh0LW1vdmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price flatlines near $27K — What can trigger the next move? - Cointelegraph",
        "content": "Bitcoin (BTC) is keeping everyone on their toes when it comes to price trajectory — where will it go next?\n\nBTC price down 10% after bad week\n\nAfter a week in which BTC/USD fell by 10%, sentiment is getting a reset and traders are eyeing key support levels closer to $25,000.\n\nAt the same time, consensus is far from unanimous over market health — some believe that the next phase of upside is around the corner.\n\nAs macro markets gear up for a new period of crucial data and moves from the United States Federal Reserve, volatility catalysts are waiting in the wings, with Bitcoin potentially not staying calm for long.\n\nCointelegraph takes a look at the upcoming scenarios that could cause BTC/USD to quit its short-term sideways trading pattern.\n\nWill the Fed call the market's bluff?\n\nIt may be all quiet so far when it comes to macroeconomic triggers this week, but that is about to change.\n\nBeginning April 27, new data will emerge from the U.S. which could deliver a burst of volatility for currently lackluster risk assets.\n\nU.S. gross domestic product and jobless claims will precede the March print of the Personal Consumption Expenditures (PCE) Index, with the latter keenly eyed by the Fed for cues on inflation.\n\nThis month’s timing is important — a week later, the Fed will decide on how much, if at all, to raise benchmark interest rates. While the market already believes it knows the answer, this allows any surprises to have an even more pronounced impact on sentiment and price action.\n\nAccording to CME Group’s FedWatch Tool, as of April 25, there is an 87% chance that the Fed raises rates by 0.25% in early May.\n\nFed target rate probabilities chart. Source: CME Group\n\nCold feet emerge over U.S. stocks\n\nBitcoin remains correlated with U.S. equities into the end of the month, and concerns beyond crypto are focusing on indices’ inability to print new highs.\n\nFor trading firm Mosaic Asset, caution is warranted for several reasons going forward.\n\n“First, the rally since mid-March is leading to a sharp increase in bullish sentiment, signaling too much greed among investors. There’s also a big negative breadth divergence across multiple time frames in the stock market’s rally since mid-March,” it warned in the latest edition of its regular newsletter, “The Market Mosaic,” released on April 23.\n\nAn accompanying chart showed declining bullishness across S&P 500 stocks, marking a potential change of environment compared to Q1.\n\n“Just take a look at the percent of stocks trading above their 50-day moving average (MA),” it continued.\n\n“When the S&P was trading at a similar level back in early February, nearly 81% of stocks were in solid uptrends as shown with the arrows. But look at where things stand now with the circles. While the S&P 500 finds itself right back to similar levels, only 41% of stocks are in uptrends.”\n\nS&P 500 with % stocks above 50-day moving average. Source: Mosaic Asset\n\nBitcoin tipped to reverse on liquidity sweep\n\nAn optimistic take among some Bitcoin market participants focuses on sweeping range lows to continue the bull run.\n\nRelated: ‘Smart money’ eyes BTC bull run: 5 things to know in Bitcoin this week\n\nAdherents place emphasis on an area in the mid-$26,000 zone, with the potential to extend past Bitcoin’s 200-week moving average at around $25,850.\n\n“Bitcoin is still acting sideways here, which means that it might be sweeping the low one more time and then reverse up,” Michaël van de Poppe, the founder and CEO of trading firm Eight, told hisTwitter followers on April 25.\n\n“I'm still expecting to take longs in the next few days.”\n\nAn accompanying chart confirmed $26,600 as the downside target for the liquidity sweep.\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/ Twitter\n\nPopular trader Jelle, meanwhile, is one voice believing that the worst of the correction is over, adding to spot positions in recent days.\n\n“The higher timeframe direction is clear, this is just one of the many corrections on the way up. Buy the blood, sell the euphoria. Don’t get it twisted,” part of Jelle’s Twitter comments read.\n\nJelle sees similarities to BTC price action in February, but is banking on a positive breakout thanks to a bullish divergence in Relative Strength Index (RSI).\n\nZooming in - we have #Bitcoin sitting at a big support cluster, while RSI looks to be building a divergence.\n\n\n\nEnough for me to get long.\n\n\n\nTarget: 30k.\n\nInvalidation on a breakdown, adding if the divergence locks in. pic.twitter.com/F1ATLOdsmO — Jelle (@CryptoJelleNL) April 24, 2023\n\nMagazine: Crypto regulation: Does SEC Chair Gary Gensler have the final say?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvYml0Y29pbi1uZnRzLW9uLXRoZS1yaXNlLXRoZS1pbXBhY3Qtb2Ytb3JkaW5hbHMtb24tdGhlLWJpdGNvaW4tbmV0d29yay_SAXpodHRwczovL3d3dy5maW5hbmNlbWFnbmF0ZXMuY29tL2NyeXB0b2N1cnJlbmN5L2JpdGNvaW4tbmZ0cy1vbi10aGUtcmlzZS10aGUtaW1wYWN0LW9mLW9yZGluYWxzLW9uLXRoZS1iaXRjb2luLW5ldHdvcmsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin NFTs on the Rise: The Impact of Ordinals on the Bitcoin Network - Finance Magnates",
        "content": "It all started with Taproot, the most ambitious upgrade in Bitcoin's history that went live in November 2021, the first major upgrade since the Segregated Witness (SegWit) update in 2017.\n\nThe Taproot upgrade significantly improved the efficiency, scalability, and privacy of the Bitcoin network and allowed for more sophisticated smart contracts and transactions to be created.\n\nHowever, this upgrade didn't really take off until this year when a project called Ordinals introduced a new use case to the Bitcoin network — NFTs.\n\nBitcoin Ordinals: The Idea and the Base\n\nNFTs saw an explosion in popularity in 2020, but they were mostly minted and traded on the Ethereum blockchain. With the release of Ordinals from ex-Bitcoin Core collaborator, Casey Rodarmor, NFTs are finally appearing on Bitcoin.\n\nKeep Reading Nigeria Presses Binance amid Economic Turmoil and Detains Executives\n\nOrdinals use Bitcoin's scripting language and Simple Ledger Protocol (SLP) to build a new kind of Non-fungible Token.\n\nWhile the ordinal inscriptions first began in mid-Dec. 2022, they didn't catch on until late January this year. According to Dune Analytics, 641,143 ordinals have been inscribed to date.\n\nBut, What Is It Exactly?\n\nOrdinal Theory is a numbering scheme that assigns a number to each Satoshi (or sats which is 1/100,000,000 of a whole Bitcoin), allowing each sat to be tracked and transferred. These numbers are referred to as Ordinals.\n\nEach Ordinal is numbered in the sequence they are mined. The creation of Ordinals allows for digital assets, such as NFTs and stablecoins, to be attached to the Ordinal.\n\nOrdinals can further be engraved with content, such as images or video files, through a process called inscription. This creates collectibles or on-chain cryptographic artifacts, now commonly known as Bitcoin NFTs.\n\nThe difference between these NFTs and the NFTs typically found on Ethereum is that this new kind of Bitcoin NFT is stored permanently directly in the Bitcoin Blockchain, while the traditional NFT is stored on third-party databases, with the collectors in possession of only a link to that file within their digital wallet.\n\nThis makes Bitcoin Ordinal NFTs far more attractive for collectors looking to store their NFTs for an extended time without worrying about their NFTs disappearing. In February, Ordinal NFT popularity skyrocketed, increasing 25% in the average network fees per block, consuming nearly 30% of the maximum block space.\n\nWhile Ordinal NFT activity has grown tremendously, some groups in the Bitcoin community are against this new use case as they believe it would harm Bitcoin's financial and transactional uses.\n\nAdam Back, the CEO of Blockstream, went so far as calling for censorship \"as a form of discouragement\" in a now-deleted tweet. However, creator Rodarmor, believes that his project is simply an extension of Satoshi's original vision for Bitcoin.\n\nBitcoin Ordinals Landscape\n\nEver since Ordinals' entry into the Bitcoin community, more and more members have been inscribing media onto the Bitcoin blockchain. And, the hype surrounding Ordinals is getting bigger and crazier with each passing day.\n\nRecently, 'BRC-20' was launched, allowing people to mint and transfer any tokens they want through the Bitcoin blockchain. This latest development, which is still in its very early stages, has got a lot of creators and collectors excited and is now being used as an equivalent of Ethereum's ERC-20 token standard. Besides 'BRC-20', some notable Bitcoin NFT collections include Bitcoin Rocks, Ordinal Loops, and OnChain Monkey.\n\nTaproot Wizards is another popular project that involves a hand-drawn collection of 2,101 Wizards created by developer Udi Wertheimer in cooperation with Bitcoin mining company Luxor. This collection is known for the largest transaction ever processed on the Bitcoin network, with the first entry, inscription 652, taking up a 4MB space.\n\nBitcoin shrooms is yet another one, with the first shroom being Inscription 19, created by an unknown group of individuals. Currently, there are only 210 bitcoin shrooms inscribed into Bitcoin Blockchain. Popular NFT project Crypto Punks has also made its way to Bitcoin in the form of Ordinal Punks. These are 100 distinct punk characters, with the first one recorded as inscription 642 on the Bitcoin blockchain.\n\nEven the creators of Bored Ape Yacht Club (BAYC), Yuga Labs, have sold their original art collection through Ordinals. The collection, called 'TwelveFold', debuted at the end of February and comprised 300 generative art pieces, limited in number, and each one inscribed to the Bitcoin blockchain.\n\nIt is one of the highest-profile launches through Ordinal so far. All the pieces of the collection are arranged on 12x12 grids, which is a nod to how the Bitcoin blockchain stores its data. The art collection blends 3D graphics with hand-drawn features.\n\nIn an early-March auction, the Bitcoin NFT set attracted 3,246 bids over a period of 24 hours. It concluded with 288 successful bidders spending a combined $16.49 million in BTC. Of these, the highest bid was for 7.1159 BTC (about $159,500), while the lowest successful bid was for 2.2501 BTC (about $50k). The remaining 12 pieces were held for contributors to be distributed through Yugas charity programs.\n\nThe Ecosystem Evolves\n\nBitcoin's ability to execute smart contracts is much more limited than Ethereum and other blockchains that feature established NFT markets, as is its product stack, including infrastructure, tools, and platforms. However, the hype surrounding Ordinals is growing each day, which can see the largest cryptocurrency emerging as an Ethereum rival in the world of NFTs.\n\nNot to mention, the Bitcoin blockchain now has a purpose beyond peer-to-peer payments. This has enabled the Bitcoin blockchain to engage with digital content creators, the mainstay of the Internet economy, which can unlock a flood of new creative innovations across the space. As this happens, it will push others within the crypto community to create economically viable protocols on Bitcoin.\n\nOn top of that, Ordinals could improve the security budget scenario that may come up in the future, as mining rewards decline amid subsequent halvings. After all, growing demand for Bitcoin ordinals would incentivize miners to keep the network secure.\n\nWith Casey Rodamor's Ordinal project growing from a niche interest into accelerated technology capturing the attention of collectors and developers alike, Bitcoin's ecosystem could finally see all the developments to drive not just NFT but also DeFi to flourish on the Bitcoin network."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiLGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2Jlc3QtY3J5cHRvLWxvYW5z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "The Best (and Worst) Crypto Loan Providers of 2023 - Blockworks",
        "content": "With a growing list of crypto lending platforms, you can not only take a loan out on your crypto holdings, but you can use on-chain credit to apply for a loan. But is it a good idea? The industry is rife with instances where platforms shut down and depositors lost access to their accounts.\n\nDespite the reputation of bad apples, opportunities abound for both borrowers and lenders. Crypto loans can be a good alternative to traditional forms of credit. But to learn from the mistakes of the past, we need to highlight important considerations.\n\nWhat is a crypto loan?\n\nA crypto loan is a type of loan that requires you to pledge your cryptocurrency as collateral to the lender in return for immediate cash. Many platforms offer these loans in stablecoins, other cryptocurrencies or fiat currency. And for credit based crypto lenders, they use a variety of on-chain and off-chain credit to secure loans for customers.\n\nHow to find the best crypto loan platforms for you\n\nFirst, you will want to compare the technical, counterparty and liquidity risks of each platform. They look fundamentally different between centralized, decentralized and credit based crypto loan issuers.\n\nTechnical risks range from data center security breaches, protocol and pricing oracle failures, and smart contract hacks. Counterparty risk refers to the possibility that borrowers may default on their loan repayment. Traditional lending minimizes this risk through credit checks and thorough applicant assessments. In crypto lending, this is often mitigated through over-collateralization. Decentralized credit based crypto lending platforms use centralized authorities, collective review and on-chain credit to make assessments. They use various ways to decentralize the approval and funding process, but none of them are default proof. Liquidity risk in crypto lending refers to the potential failure of a platform’s reserve or liquidity pool to satisfy market demand. Because the industry lacks universal auditing standards, proof-of-reserves and FDIC insurance, platforms run greater risks of market contagion and liquidity failures. All platforms differ in how they mitigate these risks. DeFi lenders rely on algorithms to keep their automated market making protocols liquid and CeFi lenders use traditional accounting and proof-of-reserves.\n\nSecondly, the way platforms address these risks all impact the cost to the borrower. So you will also want to compare collateral requirements, loan-to-value ratios and interest rates of different platforms.\n\nThis article narrows the best crypto loans to the most reputable and longest-serving products. It forms part of the Blockworks series on Crypto Loans, which contains helpful information on how crypto loans work, the benefits and the risks.\n\nRead more: The Best Bitcoin Loans of 2023\n\nTop centralized crypto lending platforms\n\nPros Cons – Flexible repayment plans\n\n– Support for various crypto assets\n\n– User-friendly interface Fiat on-ramp and off-ramp\n\n– Exchange platform for swapping cryptocurrencies Prompt customer support via LiveChat and email\n\n– Proof-of-reserve auditing – The token-tied loyalty model makes navigating special offers confusing\n\n– Certain assets are only available for buying and not depositing to Nexo accounts\n\n– Nexo’s Yield products increase counterparty risk\n\n– Not available to US customers\n\nUSP: Credit line offered at 0% APR\n\nType: CeFi, Multi-coin\n\nLaunched in 2018, Nexo is a centralized crypto lending platform and one of the oldest-serving providers of such services. Nexo users instantly receive a credit line when they deposit crypto on the platform and can borrow either stablecoins or supported fiat currencies. The platform requires users to over-collateralize their loan positions and provides a clear liquidation threshold and flexible repayment options.\n\nNexo uses a loyalty tier system to calculate interest rates. They offer 6.9% to their highest rated tier and 0% if their LTV is below or equal to 20%. So if you posted $10,000 in BTC as collateral, you could use a credit line of approximately $2,000 at 0% APR.\n\nNexo users climb tiers by increasing the ratio of NEXO tokens to the rest of their portfolio. But price volatility can make it difficult to monitor this ratio and cause unsuspecting users to pay greater fees.\n\nUsers can also earn up to 12% APR from staking stablecoins and NEXO and up to 15% in high interest savings accounts. These interest rates vary depending on the amount deposited and the tier of your account.\n\nThe platform also lists a wide range of assets and enables users to add collateral to their accounts anytime during the loan duration. Nexo stores its funds with institutional-grade custodian BitGo and provides real-time proof-of-reserve attestation from an independent auditor to verify that it has sufficient backing for all deposited user assets.\n\nPros Cons – High 364% APR interest on Dual Asset Product\n\nSupport for various crypto assets\n\n– User-friendly interface Fiat on-ramp and off-ramp\n\n– Exchange platform for swapping cryptocurrencies Highest LTV is 90% – Interest savings accounts lower than competitors\n\n– Not available to US customers\n\n– Company experienced a data breach in 2019\n\n– No proof-of-reserves Higher interest rates on stablecoin loans\n\nUSP: 364% APR yield on Dual Asset Product\n\nType: CeFi, Multi-coin.\n\nYouHolder, a cryptocurrency lending platform, was created in 2018. They offer crypto loans with 90%, 70% and 50% LTV ratios with different interest rate fees, load durations and price down limits. They have a rather high interest rate on loans made out in stablecoins. They charge about 26.07% APR for loans made in USDT and USDC but 0% on loans in BTC and ETH.\n\nThe company also offers a new yield generating option called Dual Asset Product. It offers up to 364% APR in 1-5 day increments. The product is similar to yield farming AMM liquidity pools in that users add liquidity to a stablecoin/cryptocurrency pair of their choice.\n\nBut instead of depositing both assets, they choose one. The platform only makes the payout in stablecoins if the price of the cryptocurrency is above the starting price.\n\nFor example, say you deposited 1 BTC to the BTC USDT pair for 1 day at a 364% APR. If the price went up by .5%, you would get the deposited amount back in USDT + 1% in interest. But if the price dropped .5%, you would get the deposited amount back in BTC + 1% interest. Users can still lose money through this yield bearing product if they sell their crypto payouts at a loss.\n\nBankrupt CeFi platforms (the worst options of 2022)\n\nThe crypto bear market made 2022 a rough year for centralized crypto lending platforms. Market contagion spread from Terra/Luna’s collapse leaving a series of platforms in its wake. Here is a list of some of the crypto lenders that filed for bankruptcy in 2022.\n\nCelsius\n\nCelsius was one of the most aggressive CeFi lending platforms – offering customers up to 17% annual interest. The crypto loan issuer froze withdrawals in June 2022, just a month after the Terra/Luna implosion. They cited “extreme market conditions” as the reason why. And in July, the company filed for bankruptcy. Celsius had over 1.7 millions users. But in March 2022, Justice Martin Glenn ruled that these users can get up to 72% of their deposited funds back.\n\nVoyager\n\nVoyager, the crypto exchange and lending platform froze withdrawals and declared Chapter 11 bankruptcy following the collapse of crypto hedge fund 3AC in June 2022. They disclosed over $500 million in exposure to the failed fund. Customers also hope to recover 72% of their lost funds once the bankruptcy is complete.\n\nVauld\n\nVauld, a crypto lending program based in Singapore, froze customer accounts and filed for protection from its creditors on July 4th 2022. At the time of filing, they owed $402 million to creditors. And while 90% of that debt is in customer deposits, no plans to reimburse depositors have been announced. Instead, the Peter Thiel-backed company has twice extended the creditor protection period as they continue to restructure. It is set to expire on April 28, 2023.\n\nBable Finance\n\nBable Finance, a Hong Kong crypto lending platform that served crypto mining companies, institutions and high net worth borrowers froze all customer accounts on June 17, 2022. They did this just days after Celcius’ announcement and cited the same market volatility as why. A few days later on June 20, they entered into talks with counterparties on debt reconstruction. But on March 6, 2023 they filed for moratorium protection from creditors to launch a new DeFi platform and stablecoin with a similar collateral design to algorithmic stablecoins. They plan to use this scheme to pay their $766 million debt to creditors.\n\nBlockFi\n\nOn Nov. 28, 2022, BlockFi declared bankruptcy. Three weeks prior, the crypto lending platform froze customer withdrawals citing a “lack of clarity” into the line of credit promised by FTX. But in December, BlockFi worked with the bankruptcy court to implement a plan to return deposited funds back to its customers. This move is different from Voyager and Celsius because it means that customers could retrieve their funds before bankruptcy hearings are over.\n\nThese CeFi lenders all fell victim to leverage and over exposure to risk. But in the 2021 run up, many felt the pressure to offer more aggressive yields to compete. And for a brief time, customers were able to make 17% to 20% from savings held on these lending platforms. The takeaway was that if the product seemed too good to be true, then you were likely the product. These lenders wanted customers at all costs to finance their unsustainable scheme.\n\nWhile news of CeFi lender bankruptcies have died down, there is always the potential risk for more. Extra caution may be prudent when choosing lenders that offer unrealistic yields.\n\nTop decentralized crypto loan platforms\n\nPros Cons – Non-custodial cryptocurrency lending with on-chain transparency\n\n– Aave supports a wide variety of crypto assetsUsers can earn through incentives while borrowing\n\n– Aave offers a permissioned protocol ideal for high-profile and institutional investors – Users take on considerable token risk as most pool assets are correlated\n\n– The protocol’s decentralized nature means users must proactively manage their positions to avoid liquidation\n\n– Aave’s interface may be a little complicated for first-time users\n\n– Aave offers yield-generating products, which increases counterparty risk\n\nUSP: Decentralized crypto lending platform\n\nType: DeFi, Multi-coin\n\nAave is a DeFi protocol allowing investors to borrow against crypto. The protocol initially launched on the Ethereum network but has since expanded to 15 other ecosystems, including Polygon, Avalanche and Optimism.\n\nAave facilitates crypto loans by providing lending pools where users can deposit assets to earn interest. Borrowers can, in turn, tap into these pools by depositing crypto as collateral to borrow stablecoins or other assets available on the pool.\n\nDepending on the assets, Users can borrow up to 35% to 80% of the value of deposited collateral and choose between a fixed or variable interest rate. Aave protocol liquidates a position if the collateral value drops below a specified threshold and the user fails to deposit more collateral upon margin calls.\n\nPros Cons – Non-custodial cryptocurrency lending with on-chain transparency\n\n– Compound offers a relatively user-friendly interface\n\n– Compound offers reasonably competitive interest rates\n\n– Compound provides additional tools such as advanced transactions and position migrator to help lower network fees – Supports fewer assets than other DeFi protocols\n\n– Users face smart contract risks as is the case with all DeFi protocols\n\n– The use of COMP tokens to incentivize borrowing introduces further risks in addition to the danger of using highly-volatile assets as collateral\n\n– Being deployed only on Ethereum means users incur high network fees\n\nUSP: Non-custodial cryptocurrency lending platform with on-chain transparency\n\nType: DeFi, Multi-coin\n\nCompound is a DeFi protocol built on the Ethereum network. Users can deposit crypto to earn interest or use it as collateral to borrow from Compound’s liquidity pools. Compound supports major Ethereum-based assets, including wrapped bitcoin (WBTC), ether (ETH), compound (COMP), chainlink (LINK), uniswap (UNI), and staked ETH tokens. Users can draw out loans in these assets or use the USDC stablecoin.\n\nUsers automatically receive a credit line on Compound based on the value of deposited assets. The dashboard presents an overview of the health of a user’s loan position and the maximum LTV on each asset. Like most DeFi protocols, users must regularly check their position to avoid liquidation.\n\nPros Cons – Users can access competitive interest rates from different pools\n\n– The platform provides a user-friendly interface for managing crypto loans\n\n– The platform supports borrowing stablecoins with ETH, providing relative security against market drawdowns\n\n– The platform is transparent about its fees, including a rebalancing fee to guarantee the best rates – Fuji supports fewer assets compared to other protocols\n\n– Fuji’s planned cross-chain infrastructure may introduce a greater security risk\n\nUSP: DeFi aggregator for users to to find crypto loans at the best interest rates\n\nType: DeFi, Multi-coin\n\nFuji Finance is a DeFi aggregator for users to access crypto loans at the best interest rates from different protocols. Fuji analyzes multiple lending pools and uses its routing contracts to let users access these offers from a single platform.\n\nUsers can view their open loan positions, health factor, and liquidation price on their account dashboard. Fuji features a refinancing feature that automatically optimizes loan positions when a competing protocol offers improved rates. There are no repayment schedules, although users must maintain a healthy LTV to sustain their loan position.\n\nIn addition to Ethereum, Fuji is live on Polygon, Arbitrum and Fantom. The platform also plans to introduce cross-chain collateralization, enabling users to access liquidity using collateral deposited on a different chain.\n\nCrypto lending platforms offering loans with no collateral\n\nPros Cons – Provides borrowers access to credit who are outside of traditional banking\n\n– No over-collateralization\n\n– Lower interest rates: Goldfinch aims to provide more affordable credit by cutting out intermediaries and using a unique credit scoring system\n\n– Decentralized: Since Goldfinch is built on the Ethereum blockchain and managed by a DAO – offering greater transparency into governance and risk – Crypto price volatility: Since the value of crypto assets can be volatile, borrowers may face the risk of having their collateral liquidated if the value of their crypto assets drops significantly\n\n– Risk of default: There is always the risk that borrowers may default on their loans, which could result in a loss of principal for lenders\n\n– Limited liquidity: Lenders may not be able to withdraw their funds immediately, as the length of loan terms on Goldfinch may be longer than other investment options\n\nUSP: Credit based crypto loans with no over-collateralization\n\nType: DeFi, Multi-coin\n\nGoldfinch is a decentralized credit based crypto lending protocol on the Ethereum blockchain. According to their website, this protocol is governed through a community DAO – meaning that all changes to protocol configurations and parameters are voted on by governance token holders.\n\nTheir core mission is to provide credit to underserved communities around the world. They argue that the over-collateralization of most other crypto lenders limits the scope and purpose of crypto loans. And as result, most of it is used to leverage investments within the ecosystem. They see untapped opportunity in using the borderless limitations of cryptocurrency and smart contract platforms to offer credit based loans for real world use cases.\n\nRead more: What Are Real-world Assets? DeFi’s Newest Yield\n\nIn credit-based lending, borrowers are evaluated based on their creditworthiness, which is determined by factors such as their credit history, income, and other financial indicators. Since Goldfinch is a protocol governed by a DAO, they don’t directly run credit checks and require loan applications like traditional institutions. Instead they use a system that evaluates creditworthiness through the collective assessment of other participants.\n\nBitcoin only CeFi lenders\n\nPros Cons – Proof-of-reserves attestation\n\n– Transparent fees\n\n– Repayments available through bank transfer or stablecoins\n\n– Customer support available through email and LiveChat – Charges a 2% admin fee\n\n– The minimum collateral requirement makes the platform unfriendly to small borrowers\n\n– Ledn also offers investors a savings/yield product, creating rehypothecation risks\n\nUSP: Simple and easy-to-use platform for accessing Bitcoin-backed loans\n\nType: CeFi, Bitcoin only\n\nFounded in 2018, Canada-based Ledn is another crypto loan platform with a relatively impeccable record. Ledn employs BitGo as its official digital asset custodian. The platform primarily offers interest-yield products for bitcoin and USDC holders. Ledn users can borrow against BTC at a 9.9% annual interest rate plus a 2% admin fee.\n\nLedn requires users to deposit at least $1,000 worth of bitcoin collateral, with the option to borrow up to 50% of the deposit amount. The platform issues loans within 24 hours of a user’s request and requires no repayment schedule as long as the user maintains a healthy LTV.\n\nPros Cons – Transparent fees and charges\n\n– Users can verify via a multi-signature contract that deposited assets are not rehypothecated\n\n– Only interest payments are required monthlyLive customer support – The application process is manual, and approval may take up to a week\n\n– Origination fees and relatively high-interest rates\n\n– Unchained Capital’s 40% LTV means access to less capital compared to other crypto loan providers\n\nUSP: Bitcoin-backed loans offering a multisig self custody solution\n\nType: CeFi, bitcoin only\n\nBitcoin-focused financial services firm Unchained Capital offers a facility to borrow cash against BTC. Interested borrowers can complete an online application with Unchained Capital and receive a loan quotation. The platform requires a minimum collateral amount of $10,000, with users only able to borrow up to 40% of the deposited asset.\n\nIf approved, the borrower transfers the bitcoins to a designated address and receives the stablecoin collateral on their account. Unchained Capital requires monthly interest payments on its bitcoin loans. Users can choose to spread interest payments across 6 or 12 monthly payments, with the principal repayment only required at the end of the loan duration.\n\nGet the most out of crypto loans\n\nBitcoin and crypto loans are inherently risky because of the volatile nature of the underlying assets. However, investors can make the most of such loans by choosing platforms offering the highest security level for client assets.\n\nAt the most basic level, users should be able to verify that all deposited assets are fully backed and not subject to any form of rehypothecation. Platforms that offer low-interest rates on borrows typically have greater risks of reusing user collateral to earn a yield and subsidize fees for borrowers. Having a yield product also increases the chances of the platform needing to rehypothecate users’ funds to meet up with promised interest rates for depositors.\n\nMeanwhile, it is essential that customers have multiple options to deposit more collateral if their loan position is at risk of liquidation. All loan terms, including interest rates and associated fees, must be transparently agreed upon by both parties before the loan issuance.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMilAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzI0L2JpdGNvaW4tcG9zdHMtYmlnZ2VzdC13ZWVrbHktbG9zcy1zaW5jZS1ub3ZlbWJlci1hcy11c2QtbGlxdWlkaXR5LWRlY2xpbmVzLXVzLWRlYnQtY2VpbGluZy1mZWFycy1yZXR1cm4v0gGYAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMjQvYml0Y29pbi1wb3N0cy1iaWdnZXN0LXdlZWtseS1sb3NzLXNpbmNlLW5vdmVtYmVyLWFzLXVzZC1saXF1aWRpdHktZGVjbGluZXMtdXMtZGVidC1jZWlsaW5nLWZlYXJzLXJldHVybi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Posts Biggest Weekly Loss in 5 Months as Dollar Liquidity Declines, Debt Ceiling Fears Return - CoinDesk",
        "content": "\"I find it unlikely that the U.S. goes into default. I think the debt-ceiling issue will be resolved before it comes to that,\" Dunleavy said. \"If the U.S. does default or we get close to the deadline without a deal, it should be immensely positive for BTC. We've seen the store-of-value story for BTC become more solidified with the recent bank failures. BTC's correlation to gold is also near all-time highs.\""
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMjQvd3JhcHBlZC1iaXRjb2luLXRva2VuLWdvZXMtbGl2ZS1vbi1jYXJkYW5vLXRlc3RuZXQv0gFjaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNC8yNC93cmFwcGVkLWJpdGNvaW4tdG9rZW4tZ29lcy1saXZlLW9uLWNhcmRhbm8tdGVzdG5ldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Wrapped Bitcoin Token Goes Live on Cardano Testnet - CoinDesk",
        "content": "Various DeFi enhancements have aided the rise of such protocols on Cardano since the start of 2023, with the total value locked on Cardano-based platforms rising to over $150 million from less than $50 million"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1sb3dlci1oaWdocy12cy1iaXRjb2luLWhpbnQtYXQtbW9yZS1kb3duc2lkZS1pbi1hcHJpbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Ethereum price lower highs vs. Bitcoin hint at more downside in April - Cointelegraph",
        "content": "The price of Ethereum’s Ether (ETH) token has retreated from its recovery trend versus Bitcoin (BTC) while making a series of lower highs in April.\n\nETH price risks more losses vs. Bitcoin\n\nAs of April 24, the ETH/BTC pair was down about 5.5% from its local high of 0.0709 BTC six days ago. The same period witnessed Ether declining nearly 15% and Bitcoin dropping 11.25% in United States dollar terms.\n\nETH/BTC daily price chart. Source: TradingView\n\nFor now, ETH holds above its 50-day exponential moving average (50-day EMA; the red wave) near 0.0672 BTC. But if the March 2023 fractal is any indication, Ethereum's price could drop sharply below the support wave.\n\nThe ETH/BTC pair saw a pullback trend in March after testing the 200-day EMA (the blue wave), breaking below its 50-day EMA in the process.\n\nIf the fractal plays out similarly in April, the downside target is 0.0627 BTC by the month’s end, about 7% lower than the current levels, a level that served as a major support in March and April.\n\nThis target also coincides with Ether’s long-term ascending trendline support — the “buy zone” in the chart below — that has been capping its bearish attempts since June 2022.\n\nETH/BTC three-day price chart. Source: TradingView\n\nWeekly Ethereum institutional flows beat BTC\n\nInterestingly, Ethereum’s underperformance versus Bitcoin was counter to institutional flows for the past week.\n\nEthereum funds attracted $17 million to their coffers in the week ending April 21 versus Bitcoin's $53.1 million outflow, according to CoinShares’ latest report.\n\nFund flow into crypto funds. Source: CoinShares\n\n“These inflows suggest there is increasing confidence amongst investors following the successful implementation of the Shapella upgrade,” James Butterfill, head of research at CoinShares, noted, adding that they “were solely from Europe.”\n\nRelated: Ethereum up 20% in April while Markets Pro sees 379% gain in one day\n\nAs for Bitcoin, the outflow began around April 14 when the coin reached $30,000, a psychological resistance level. Butterfill said the BTC's drop to below $27,500 resulted from profit-taking in the absence of macroeconomic triggers.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYWxsLXRvcC0xMC1jcnlwdG9zLWZhbGwv0gE5aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1hbGwtdG9wLTEwLWNyeXB0b3MtZmFsbC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin, all top 10 cryptos fall; Asian equity markets drop - Forkast News",
        "content": "Bitcoin fell in Tuesday afternoon trade in Asia, along with all other top 10 non-stablecoin cryptocurrencies. Polygon was the biggest loser followed by Solana. Most Asian markets dropped amid concerns of rising Covid cases in China ahead of its Labour Day holiday, the first long public holiday since the Lunar New Year. Most U.S. stock futures traded in the red while European bourses extended losses.\n\nSee related article: Cryptocurrencies trade lower as weekly losses pile up\n\nFast facts"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vaW52ZXN0aW5nbmV3cy5jb20vZGFpbHkvdGVjaC1pbnZlc3RpbmcvYmxvY2tjaGFpbi1pbnZlc3RpbmcvY3J5cHRvY3VycmVuY3ktbWluaW5nLXN0b2Nrcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Cryptocurrency Mining Stocks: 6 Biggest Companies in 2023 - Investing News Network",
        "content": "Melissa Pistilli has been reporting on the markets and educating investors since 2006. She has covered a wide variety of industries in the investment space including mining, cannabis, tech and pharmaceuticals. She helps to educate investors about opportunities in a variety of growth markets. Melissa holds a bachelor's degree in English education as well as a master's degree in the teaching of writing, both from Humboldt State University, California."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3doYXQtaXMtcHJvb2Ytb2Ytd29ya9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "What Is Proof-of-work (PoW)? All You Need to Know - Blockworks",
        "content": "Proof-of-work (PoW) is a blockchain consensus mechanism that incentivizes network validation by rewarding miners for adding computational power and difficulty to the network. It is a lottery system where miners increase their likelihood of receiving the reward the more power they add.\n\nThe consensus mechanism represents about 60% of the total crypto market capitalization.\n\nThe history of proof-of-work\n\nThe origin of proof-of-work can be traced back to 1993 when Cynthia Dwork and Moni Naor were looking for a solution to deter email spam and DoS attacks. Their paper on pricing via processing outlined the basics of proof-of-work.\n\nIn 1997, Adam Black integrated their idea into Hashcash. His algorithm made it difficult for spammers to send large volumes of emails by requiring senders to include a computationally expensive string of characters in the email.\n\nThe solution to spam was essentially increasing the cost to send individual emails. This experiment proved that you could use computational difficulty to represent the value of something online. This inspired others to see if they could use the same idea to make a digital representation of cash.\n\nThe idea made an appearance again in Nick Szabo’s so-called ‘Theory of Collectibles’ and the paper “Shelling Out: The Origins of Money.” In 2004, these ideas inspired Hal Finney to create a version of it called reusable proof-of-work. And in 2009, Satoshi Nakamoto famously created the proof-of-work consensus mechanism for Bitcoin. It was the first decentralized implementation that solved the double spending problem and made bitcoin the first successful form of digital cash.\n\nWhat made proof-of-work different?\n\nPrevious iterations before Bitcoin failed because they required centralized entities to prevent the double spending of digital tokens.\n\nSatoshi’s improvements to proof-of-work used game theory to solve this problem. It made a way to incentivize anonymous volunteers called miners to verify the validity of all Bitcoin transactions – ensuring that no one is double-spending. This invention was the first time a decentralized network of participants could secure trust without a centralized intermediary.\n\nThis gamification incentivizes network participation so well that nation-states such as El Salvador use bitcoin as a reserve currency. But as the cryptocurrency currently employs approximately 99 terawatt hours of electricity per year, many believe this growth is unsustainable.\n\nThe “work” in the proof-of-work consensus mechanism is the source of these unsustainability concerns. To explain, let’s first outline the fundamentals.\n\nRead More: The Beginner’s Guide to Consensus Mechanisms\n\nProof-of-work (PoW) fundamentals\n\nMaintaining the integrity and security of all transactions in the network is the ultimate objective behind the proof-of-work consensus mechanism. Here is a breakdown:\n\nThe work(ers)\n\nProof-of-work blockchains are supported through a network of decentralized computers called nodes. They are tasked with two things: accepting batches of transactions from other nodes and validating (or proposing) new blocks of transactions to the network.\n\nThese nodes are also called miners because they spend computing power and resources in return for the network’s underlying cryptocurrency.\n\nThe “work” in proof-of-work is the computational power nodes have to contribute in validating a new block of transactions. This power is represented by the SHA-256 cryptographic hash function, and it sets this consensus mechanisms apart from its counterparts.\n\nAn algorithm called the difficulty adjustment ensures that it will take the entire network a fixed set of time to validate new blocks of transactions. The difficulty adjustment occurs approximately every 2,016 blocks (about once every two weeks) to maintain the target block time of 10 minutes. Miners coming and going from the network on an individual basis do nothing to affect difficulty level minute to minute, or day to day.\n\nMiners win the reward when they guess a hash that falls below the threshold provided by the network. Once a miner finds the valid block hash, it broadcasts this information to other miners who can quickly validate and add the new block to their blockchain copies. This validation process eliminates the possibility of miners including malicious transactions, such as an attempt by a user to double-spend coins.\n\nThe reward\n\nThere is an encoded rule regarding the amount paid to the miner who completes the proof-of-work. At the time of writing, miners earn a fixed 6.25 BTC per block, plus any user transaction fees. This reward potential incentivizes miners to compete in the proof-of-work and remain honest, as any attempt to cheat the system would waste resources.\n\nThe reward amount is set to half every 210,000 blocks (approximately four years). This deflation rate is referred to as the halving cycle. Many fear that if bitcoin’s price fails to keep pace, miners will lose the incentive to participate. But as miners disconnect from the network, the difficulty level drops accordingly. This balancing act makes the cost to mine bitcoin drop as well.\n\nThe economics of bitcoin mining though are not straight forward. There are many financing factors that drive miners to stay online even when they are unprofitable.\n\nRead more: Is Bitcoin Mining Still Profitable? The Economics Explained\n\nThe difference between proof-of-work and proof-of-stake\n\nThe main difference between proof-of-work and proof-of-stake is the difficulty requirement. In proof-of-stake, validating nodes compete for blocks by locking or delegating more of the network’s token to the network. This requires less energy but can make the entry barrier more expensive.\n\nA proof-of-work consensus model is used more for cryptocurrency networks focused on payment and monetary use cases. Other blockchains, such as Ethereum, Cardano and Solana, focus on powering decentralized applications and utilize the proof-of-stake (PoS) model.\n\nRead More: Proof-of-work vs. Proof-of-Stake\n\nProof-of-work examples\n\nMore than 60% of the cryptocurrency market capitalization utilizes proof-of-work algorithms. However, the most valuable networks implementing the consensus model are as follows:\n\nBitcoin: The network is the world’s most secure and decentralized PoW system. Bitcoin’s success has primarily been attributed to Satoshi’s ingenious PoW engineering, which beyond security, provides sustainable economics for network participants. Litecoin: Litecoin launched in 2011 as a Bitcoin fork, copying aspects of the legacy network, such as its PoW consensus model. Litecoin is often called the silver to Bitcoin’s gold and remains among the top crypto assets by market value. Dogecoin: Meme-inspired cryptocurrency Dogecoin launched in 2013, implementing a PoW technology with roots traceable to Litecoin. Dogecoin and Litecoin enable faster transactions but are generally less secure than Bitcoin. Monero: Monero is a privacy-focused cryptocurrency that implements a proof-of-work algorithm. Its unique features, including ring signatures and stealth addresses, make it difficult to trace transactions on the blockchain. Monero’s proof-of-work algorithm is designed to be ASIC-resistant, meaning it is more accessible to individual miners rather than large mining operations. Bitcoin Cash: Bitcoin Cash is a cryptocurrency that was created in 2017 as a result of a hard fork from the Bitcoin blockchain. It utilizes a proof-of-work consensus algorithm, similar to Bitcoin. Bitcoin Cash aims to improve on the scalability and transaction speed of Bitcoin by increasing the block size limit to 32 MB. However, it has faced criticism for centralization due to the dominance of a few mining pools in its network.\n\nHow proof-of-work works\n\nBitcoin mining through proof-of-work works similarly to buying lottery tickets with a prize draw every 10 minutes. Anyone can participate by purchasing a Bitcoin mining machine and plugging it into the network. Although everyone has the same odds of being drawn, buying more tickets increases the statistical likelihood of winning the lottery.\n\nIn the above example, the lottery tickets represent the hash rate deployed, while the prize is the BTC reward paid for successfully creating a Bitcoin block. Hash rate is the number of hashes per second mining equipment can carry out to find the above-noted cryptographic hash function. The more efficient a mining device is, the higher chances a miner has of winning the block rewards. For instance, An S19j Pro machine can perform 104 terahashes per second (TH/s), the equivalent of 104 trillion guesses or tickets per second.\n\nMeanwhile, users can join mining pools; comparable to office pools or syndicates. Joining the pool voluntarily would increase their chances of winning the lottery, unlike solo mining, where the odds of winning a Bitcoin block today are extremely rare.\n\nHowever, every win on a public mining pool is split among the members in proportion to their hashrate. Mining pool participants are not obligated to remain in the pool. Many criticize pools for being a centralizing force in the network. But individual participants provide a counterweight to that centralization. They can leave the pool or syndicate and do so very easily, a feature that comes in handy if the pool attempts to become dishonest.\n\nLike the lottery, the rules of participation and potential rewards are encoded in the Bitcoin software. Anyone can verify these rules and agree to play by them if they choose to set up a Bitcoin mining operation.\n\nProof-of-work and mining\n\nProof-of-work is closely intertwined with mining. PoW defines the exact process through which miners show peers that they have performed the required computation by generating a hash that matches the target for the block. On the other hand, mining focuses on adding a new block to the blockchain and receiving the associated coin rewards.\n\nConsidering how Bitcoin transactions are processed provides a clear insight into the relationship between PoW and mining. All user transactions on the Bitcoin network end up in a memory pool (mempool) from which miners select transactions to add to the next Bitcoin block. Every miner enters the race to create a new block for the Bitcoin blockchain, picking several transactions from the mempool and bundling them into a candidate block.\n\nHowever, before a candidate block becomes accepted as valid, the miner must perform computations that generate a hash below the target set by the Bitcoin proof-of-work algorithm. The first miner to produce a matching hash for their candidate block broadcasts it to other miners, who can easily verify and validate its addition to the blockchain record.\n\nThe successful miner receives the block rewards and associated transaction fees, having added a new valid block to the blockchain. Thus, the Bitcoin blockchain height grows while the race for mining the next block begins.\n\nWhy is proof-of-work important?\n\nThe proof-of-work algorithm is vital for several reasons. The most compelling is that it provides a secure and decentralized mechanism for network participants to maintain the integrity of the blockchain ledger. PoW incentivizes miners worldwide to expend computing power to validate blocks, thus filling the role usually played by a central entity such as a bank.\n\nAnother primary benefit of a PoW is that it regulates the creation of new coins. In Bitcoin’s case, the algorithm includes a mining difficulty adjustment that stabilizes the rate miners can produce new blocks. Bitcoin’s code specifies a target of 10 minutes per block, with the algorithm designed to increase the difficulty of finding a new block hash if the hash rate grows to a point where miners produce blocks faster than the average.\n\nWithout the PoW-linked mining difficulty adjustment, miners can drain the BTC supply faster than required for a sustainable economy. Moreover, as the network’s hashrate on a PoW chain grows, it becomes impractical for a bad actor to attack the system.\n\nA Braiins study puts the conservative cost of attacking the Bitcoin network through physical hashrate at $5.5 billion. However, such an operation is impractical to execute in the real world because the cost attack outweighs any perceived benefits. Besides that, a prospective attacker can immediately receive rewards for acting honestly and contributing hash power to Bitcoin.\n\nAdvantages and disadvantages\n\nBeing the earliest consensus model for blockchains, the pros and cons of proof-of-work systems have only become evident as the industry matures. Despite newer innovations, PoW remains the most proven, time-tested method for achieving consensus on a public blockchain.\n\nAdvantages Disadvantages – High level of security and decentralization\n\n– Censorship resistant\n\n– Economically incentivizes miners to protect the network\n\n– Promotes the adoption of renewable energy sources – Slower transaction speed and high fees\n\n– Mining requires high capital and operational expenses compared to newer consensus models\n\nProblems with proof-of-work\n\nEnergy usage\n\nThe most prevalent criticism of proof-of-work is that it wastes energy. Multiple research estimates that Bitcoin uses more energy than several midsized countries such as Norway and Argentina. Still, other findings assume that the Bitcoin network significantly contributes to climate change and will continue to do so as adoption grows.\n\nNonetheless, evidence points to the contrary regarding the impact of Bitcoin and its novel proof-of-work system. The Bitcoin network consumes significantly less energy than existing monetary systems and other major industries, including gold mining and financial sectors.\n\nAnother vital point to consider is that energy being the only variable in Bitcoin mining, incentivizes miners to seek out the cheapest methods, such as renewable sources. Over time, miners are adopting these cost-friendly energy channels to maximize profits. Industry estimates reveal that nearly 59% of bitcoin mining utilizes environment-friendly energy sources, much higher than other sectors and countries.\n\nAdditionally, Bitcoin’s PoW technology allows individuals and organizations to tap into the energy that may otherwise be wasted. This is especially true for power generated in locations such as oil drilling sites producing flare gas, agricultural regions harnessing biomass energy or jurisdictions where it is impracticable to transport such energy. The portability of Bitcoin mining machines allows miners to monetize such power and provide economic value to the local communities.\n\nScalability\n\nAnother common criticism against PoW systems such as Bitcoin is that they do not scale as efficiently as newer consensus models. Bitcoin advocates argue that Bitcoin’s unique positioning as a global monetary system means the delayed confirmation time contributes immensely to the network’s security. PoW systems are optimized for security and scale on secondary layers such as the Lightning Network implementations on Bitcoin and Litecoin.\n\nCentralization\n\nLastly, critics also argue that proof-of-work consensus algorithms have become more centralized over the years. The increasing cost to entry and computing difficulty has consolidated network consensus decisions around a handful of major mining pools.\n\nThese pools largely control the consensus decisions of the network because they collectively have more hashing power than individual miners. But a lot of this power is contingent that the pools act in good faith — as contributors can exit the pool at any time.\n\nFor example, Bitmain, one of the largest manufacturers of cryptocurrency mining hardware, controlled several mining pools that had more than 43% of the hashing power in 2018. With a few strategic moves, Bitmain may have been able to execute a double spend attack. The damage that would have had on the network and their reputation probably prevented them from executing the attack.\n\nWhat this means for investors\n\nContrary to the mainstream notion that PoW systems are harmful to the environment, the Bitcoin mining industry’s push toward renewable energy sources reveals that the technology may not have the impact they think. Advocates even argue that Bitcoin has the potential to be a net positive to the planet.\n\nTying the Bitcoin network’s security to a tangible real-world asset like energy makes the network more robust, especially at optimum hash rate. It also lets investors get exposure to the underlying BTC asset through mining stocks such as Riot Blockchain, Hive, Marathon Digital, and Hut8. Additionally, while other faster and more innovative consensus models have emerged in recent years, the underlying networks tend to become increasingly centralized.\n\nBeing a time-tested model for securing public blockchains means that PoW will likely continue to play a key role as the industry onboards more mainstream audiences. Rather than supersede the legacy consensus model, newer systems highlight the unique properties of PoW and make it more attractive to investors that prioritize security and censorship resistance.\n\nThe future of proof-of-work\n\nProof-of-work introduced the world to blockchains. Miners compete in a never-ending race to produce new blocks and collect associated rewards, thus making it increasingly difficult for bad actors to compromise the network. The novel consensus mechanism provides unparalleled security by incentivizing the use of computing power to protect the integrity of the underlying ledger.\n\nThe PoW consensus algorithm aims to provide a stable economy by regulating the coin’s issuance using the difficulty adjustment implementation. The coin’s supply is distributed more efficiently as miners cannot automatically boost their holdings or stake on the network by accumulating more tokens.\n\nThe legacy consensus model continues to power the largest market share of public blockchains and will likely always remain the most secure option for establishing consensus among decentralized networks.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXN0YW5kYXJkLWNoYXJ0ZXJlZC1jcnlwdG8tcHJpY2VzLWV0aGVyZXVtLTA4NDM0MTAwNy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin could rise to $100,000 by 2024, says Standard Chartered - Yahoo Finance UK",
        "content": "Since breaching $30,000 two weeks ago, bitcoin fell to $27,278 on Tuesday. Photo: Getty (Yuichiro Chino via Getty Images)\n\nStandard Chartered (STAN.L) said that bitcoin could reach $100,000 (£80,257) by the end of 2024, even though crypto prices have collapsed after a multi-week rally.\n\nStandard Chartered pointed to the collapse of Silicon Valley Bank and other mid-tier US lenders as promoting the case for bitcoin as a \"decentralised, trustless and scarce digital asset\".\n\nThe forecast comes as crypto prices crashed following over two weeks of gains.\n\nRead more: Philip Hammond warns of 'real risk' to London financial services from EU crypto bill\n\nSome 23,860 crypto-traders were liquidated in the past 24 hours, at a value of $80m, according to data from Coinglass. Most traders that were wiped out held leveraged long positions, speculating that the recent rally would continue.\n\nADVERTISEMENT\n\nBitcoin (BTC-USD) fell 7% to $27,278.\n\nStandard Chartered's bitcoin forecast\n\nIn a note on Monday, Standard Chartered analyst Geoff Kendrick suggested that the crypto winter is about to thaw.\n\nKendrick said that for bitcoin, \"while sources of uncertainty remain, we think the pathway to the $100,000 level is becoming clearer\".\n\nHe forecasted a stabilisation of risk assets later in the year, as the US Federal Reserve ends its rate-hiking cycle.\n\nRead more: Philip Hammond on CBDCs, stablecoins and crypto's place in global finance | The Crypto Mile\n\n“The current stress in the traditional banking sector is highly conducive to BTC outperformance, and validates the original premise for bitcoin as a decentralised, trustless and scarce digital asset,” he said.\n\nStandard Chartered (STAN.L) fell 1.38% on Tuesday to 623p in early trading in London.\n\nCrypto Collapse\n\nThe bitcoin price is up 66% since the start of the year, reaching over $30,000 in April, marking the first time in 10 months.\n\nSince breaching $30,000 two weeks ago, bitcoin fell to $27,278 on Tuesday.\n\nRead more: Crypto live prices\n\nThe global cryptocurrency market cap stood at $1.2tn, down 0.8% according to Coingecko.\n\nStory continues\n\nEthereum (ETH-USD) lost all its gains since the blockchain network successfully implemented its Shanghai Upgrade, falling 12% to $1,820.\n\nWatch: Philip Hammond warns of 'real risk' to London financial services from EU crypto bill | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXh0ZW5kcy1kcm9wLXN0YXlzLWJlbG93LXVzMjgwMDAv0gFCaHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1leHRlbmRzLWRyb3Atc3RheXMtYmVsb3ctdXMyODAwMC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin extends drop, stays below US$28,000 - Forkast News",
        "content": "Author profile\n\nPradipta Mukherjee is a business reporter and has worked for Bloomberg News and Business Standard in India. An MBA and a post-graduate in Economics, Mukherjee focuses on financial markets and corporates. She is a Mary Morgan Hewett award recipient for Women in Journalism. She has also won the Jefferson Fellowship; the Thomson Reuters Foundation fellowship on ‘Social Media and Digital Journalism’ at The Chinese University of Hong Kong; the Kiplinger Fellowship at Ohio University, USA; and most recently, the National Press Foundation's fellowship on 'International Trade.'\n\nAuthor's email\n\n[email protected]"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW4tY3JlYXRvci1teXN0ZXJ5LWNvbnRpbnVlcy1kb3JpYW4tbmFrYW1vdG8tc3BlYWtzb3V0LXVudmVpbHMtZ292ZXJubWVudC1jb250cmFjdGluZy1wYXN0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin creator mystery continues: Dorian Nakamoto speaks out, unveils government contracting past - CryptoSlate",
        "content": "Dorian Nakamoto denied involvement with Bitcoin’s development.\n\nIn a video shared by @CryptoNewsYes, Dorian Nakamoto clarified that he had nothing to do with building Bitcoin (BTC) — stating that he was “just an engineer doing something else.”\n\n“The main reason I’m here is to clear my name; that I have nothing to do with Bitcoin, nothing to do with developing.”\n\nFurthermore, he revealed that during the early development of Bitcoin in 2001, he was working as a government contractor — he did not state the nature of this role.\n\nWhen presented with copies of messages — presumably from the Bitcointalk.org forum in which Satoshi Nakamoto communicated development progress — Dorian Nakamoto said, “I never communicated with Bitcoins” — adding that in 2010, when the messages were dated from, “I was at home.”\n\nSatoshi Nakamoto mystery\n\nThe identity of Bitcoin creator Satoshi Nakamoto is shrouded in mystery.\n\nThe Bitcoin community has put forward several likely candidates, including the late Hal Finney – a cryptographer who was extensively involved in the development of Bitcoin. Finney was the first recipient of a BTC transfer, and some speculate that he sent those first Bitcoins to himself.\n\nProgrammer Nick Szabo is another popular choice. Szabo had already developed a decentralized, proof-of-work virtual currency called “Bit gold,” publishing its paper in 1998 — more than a decade before Bitcoin rolled out.\n\nMore recently, with the discovery of the Bitcoin whitepaper embedded in every Mac operating system from Catalina onwards, there has been renewed speculation connecting Steve Jobs to Satoshi Nakamoto.\n\nHowever, the individual or group that created Bitcoin is widely considered technically competent at coding and cryptography — which Jobs was not.\n\nApple co-founder Steven Wozniak said Jobs never coded but was proficient enough at it “to alter and change and add to other designs” occasionally. Wozniak describes Jobs more as a visionary.\n\n“Steve didn’t ever code. He wasn’t an engineer and he didn’t do any original design.”\n\nDorian Nakamoto\n\nPublic information on Dorian Nakamoto described him as an American-Japanese physicist who had adopted libertarian views after being fired from jobs multiple times.\n\nSince being “outed” by Newsweek in 2014, Dorian has consistently denied being Satoshi Nakamoto — saying the connection has caused him and his family frequent stress.\n\n“I did not create, invent or otherwise work on Bitcoin. I unconditionally deny the Newsweek report.”\n\nIn a coincidental twist, at one point, Dorian lived close to Finney in Temple City, California.\n\nMentioned in this article"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9yaWNoLWRhZC1wb29yLWRhZC1yb2JlcnQta2l5b3Nha2ktY2FzaC1pcy10cmFzaC1iaXRjb2luLTIwMjMtNNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "'Rich Dad Poor Dad' Author Says Cash Is Trash, Bitcoin Is 'Real Money' - Markets Insider",
        "content": "Personal-finance guru Robert Kiyosaki thinks cash is trash, while touting bitcoin, silver and gold as \"real money\" instead.\n\n\"To me, Gold, Silver, &Bitcoin are real money. To me Cash is trash,\" the \"Rich Dad Poor Dad\" author tweeted.\n\nHis view contrasts with that of market experts who no longer think cash is a poor investment, given the current high yields.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nRobert Kiyosaki touted the catchphrase \"cash is trash\" – and endorsed bitcoin, silver and gold as \"real money\" instead.\n\n\"GOLD to CRASH. Steve Van Meter whom I respect predicts gold to crash to $1000. He states markets are tired of waiting for gold to go higher. If gold drops to $1000 I will buy more. I am an investor not a trader. To me, Gold, Silver, &Bitcoin are real money. To me Cash is trash,\" the personal-finance guru said in a Monday tweet.\n\nThe famed \"Rich Dad Poor Dad\" author has flip-flopped in his views toward bitcoin, silver and gold, once slamming the world's largest cryptocurrency as speculative play. Now, he \"loves\" the token because of its decentralized qualities, meaning it's not controlled by an external body compared to the US financial system – currently in turmoil, Kiyosaki said in an earlier tweet.\n\nHe previously even promoted tuna as a better investment than gold, silver and bitcoin as US inflation hit 40-year highs last year.\n\nAdvertisement\n\nKiyosaki's \"cash is trash\" statement clashes with recent views from other market experts including Ray Dalio and Wall Street analyst Jim Bianco, who have warmed up to the greenback's high yields following the Federal Reserve's aggressive interest-rate increases over the past year aimed at taming inflation.\n\nRising rates encourage saving over spending as they boost returns from bank accounts an dn other interest-bearing financial instruments such as money-market funds. But elevated borrowing costs can also lead to a slump in demand for goods and services, slowing the economy and dragging down stocks and other assets."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zYXRvc2hpLWVyYS1iaXRjb2luLXdoYWxlLW1vdmVzLTE4NTkwNzYwNy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Satoshi-Era Bitcoin Whale Moves $11 Million After Sleeping for 12 Years - Yahoo Finance",
        "content": "The whales keep waking up. Today, another sleeping HODLer moved 400 Bitcoin—worth nearly $11 million at current prices—after not having transacted for nearly 12 years.\n\nMonday’s movements showed the whale moved 360 BTC ($9.8 million) to one wallet while the remaining 40 BTC to a number of other locations.\n\nThe term “whale” refers to Bitcoin investors who have more of the cryptocurrency than others. The hoarders often sit on their millions of dollars in digital assets, and sometimes reemerge after a long stretch of time to move their investment to other addresses.\n\nSuch movements are becoming more commonplace: Just last week, a whale moved over 279 BTC, or $7.6 million, to new wallets after a decade of inactivity.\n\nAnd in February, an old BTC address that had not budged in 11 years made a transaction by moving $9.6 million worth of the cryptocurrency. The coins had appreciated by 120,000,000% over the years, with the lucky investor having first received the Bitcoin when it was worth $8 a coin.\n\nBut although large movements do happen regularly, according to an analyst who spoke to Decrypt, an investor who hasn’t budged their coins in a decade isn’t too common.\n\nKirill Kretov, a developer of tools for automated trading, said: “An awakening of 2011 is rather rare, but we don’t know how much their owner has in total. It might be that recent large awakenings could also be attributed to the same entity.”\n\nWhales are by far the most successful investors: Bitcoin is up over 40,000% in the past 10 years. Those who sit on the cryptocurrency for the long-term make the biggest profits, while inexperienced retail investors who buy and sell crypto in the short-term tend to lose out, research shows.\n\nToday’s whale made a number of large transactions to move the cryptocurrency.\n\nNumber of Bitcoin Whales Drops to Lowest Level Since 2019\n\nBitcoin right now is trading for about $27,280, according to CoinGecko, down more than10% in the past week, and 1.3% in the past 24 hours."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zbWFydC1tb25leS1leWVzLWJ0Yy1idWxsLXJ1bi01LXRoaW5ncy10by1rbm93LWluLWJpdGNvaW4tdGhpcy13ZWVr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "'Smart money' eyes BTC bull run: 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) starts a new week in a precarious position after experiencing its most extensive losses since November.\n\nIn a major comedown from ten-month highs, BTC/USD lost around 10% before the weekly candle finally closed.\n\nAt around $27,600, the culmination of a grim few days for long traders means that BTC/USD is now caught battling for last month’s support.\n\nMarket participants are in two minds as to how the situation might play out — some are betting on deeper downside, while others remain confident of retesting those multi-month highs.\n\nCatalysts may come in the form of United States macroeconomic data releases later in the week, while markets are also gearing up for the next Federal Reserve interest rate decision.\n\nWith the recent correction taking some of the “greed” out of crypto sentiment, can the shock give way to more sustainable upside or is the bull market over, at least for now?\n\nCointelegraph takes a look at the data and opinions behind current BTC price action.\n\nBTC price fights for support amid warning of “bigger corrective move”\n\nIt was a mercifully nonvolatile weekly close for Bitcoin, which at $27,600 nonetheless finished up $2,700 under its starting position.\n\nThis marked its most brutal week since the FTX debacle hit in November last year, Data from Cointelegraph Markets Pro and TradingView shows.\n\nBTC/USD 1-week candle chart (Bitstamp). Source: TradingView\n\nCurrently targeting $27,000, BTC/USD now faces a decision — sit near current support, also a focus in March, or break out.\n\n“Spot premium back to the same levels it was at previously while trading at this price range. Funding rates slightly negative across the board. Nothing insane yet,” popular trader Daan Crypto Trades summarized on the day.\n\nFellow trader Crypto Tony maintained his target of $26,600, while Caleb Franzen, senior market analyst at Cubic Analytics, said that higher levels must return for bulls to gain the upper hand.\n\n“Bitcoin has been unable to break and stay above $27,820 (green range), which is a key level I've been sharing,” he explained alongside a chart.\n\n“For short-term momentum to shift in favor of the bulls, I think we need to see price get (and stay) above this range. It continues to act as resistance…”\n\nBTC/USD annotated chart. Source: Caleb Franzen/Twitter\n\nThe latest data from the Binance order book meanwhile showed resistance increasing at $28,000.\n\nAccording to monitoring resource Material Indicators, this was an attempt to push spot prices lower in order to fill bids at more appealing levels.\n\n#FireCharts shows a new block of ask liquidity suppressing #Bitcoin price, likely trying to push price into their bids in the $27.3k - $26.7k range. #NFA pic.twitter.com/ThOwqUT09R — Material Indicators (@MI_Algos) April 23, 2023\n\nOn the more conservative side, trader Mark Cullen predicted that the worst was yet to come.\n\n“A nice bear flag formed over the weekend, looking very corrective with volatility dropping while price increases & H4 bear divergences forming,” he tweeted on the day.\n\n“I am looking for the range lows to get swept before Bitcoin has a bigger corrective move.”\n\nBTC/USD annotated chart. Source: Mark Cullen/Twitter\n\nPCE print due as markets \"price in\" new Fed rate hike\n\nThe week’s macro triggers come principally in the form of corporate earnings and economic data releases in the United State.\n\nThese will center on GDP and jobless claims on April 27, as well as the March print of the Personal Consumption Expenditures (PCE) Index a day later.\n\nCorporate earnings will also continue, while looming on the horizon is the May meeting of the Federal Open Market Committee (FOMC) at which the Fed will decide on its next interest rate changes.\n\nThe strength, or otherwise, of intervening macro data prints influences that decision considerably, Chair Jerome Powell has confirmed, with markets thus in “wait and see” mode until the last of the figures are in.\n\nAccording to CME Group’s FedWatch Tool, however, consensus is now overwhelmingly in favor of yet another rate hike, further pressuring U.S. banks and the wider financial system.\n\nThe chances of another 0.25% hike currently stand at 85%.\n\nFed target rate probabilities chart. Source: CME Group\n\n“Expectations for a +25bps hike in the next FOMC meeting are high, but not reliable due to fluctuations,” investor Crypto Awakenings wrote in part of commentary on the day.\n\n“A pause announcement by Powell can trigger a break above $30k for Bitcoin. If a hike is announced, it’s likely already priced in by the market and confirms a ‘sell in May and go away’ won’t happen in 2023. The pause may happen in May or July, with May being more probable.”\n\nTrader Ash WSB likewise drew attention to the fact that the May hike was likely “priced in” by the market, suggesting less chance of a surprise if the Fed follows through.\n\nBTC 4hr trading in down trend from\n\nlast 3 days after hitting $31k.\n\n\n\n$27,700 and $26,600 are important\n\nsupport on chart.\n\n\n\nFOMC is on may 3rd and looks like\n\nmarket is already pricing 25BPS pic.twitter.com/TDGG4bsquB — Ash WSB (@Ashcryptoreal) April 21, 2023\n\n“Technically I think we'll be having the classic Monday drop and then we'll reverse,” Michaël van de Poppe, founder and CEO of trading firm Eight, added in part of his own analysis including shorter timeframes.\n\n“GDP & FED coming up. Markets are pricing in reality in which 25bps is a likelihood. Waiting for a clear reclaim of $27,800 or bull. divs in $26,800 area for longs on Bitcoin.”\n\nPanicking Bitcoin traders realizing losses\n\nIt is no secret that the past week’s BTC price action spooked many a less experienced trader, and data proves it.\n\nAccording to figures from on-chain analytics firm Glassnode, younger coins being sent to exchanges at a loss increased sharply last week.\n\nGlassnode commonly differentiates the BTC supply by age, with “long-term holders” (LTHs) used to describe wallets hosting coins for 155 days or more. Less than that, and they become “short-term holders” (STHs) — frequently corresponding to the more speculative end of the Bitcoin investor base.\n\nThe data shows that since around April 16, STH coins — those which last moved within the 155 days prior — were increasingly moved to exchanges at a lower price than that at which they moved in their previous transaction.\n\nThese STH realized losses suggest increasing panic, LTH realized losses also increasing among those moving funds to exchanges.\n\nBitcoin Relative Long/Short-Term Holder Realized Profit/Loss to Exchanges chart. Source: Glassnode\n\nSeparate data from Coinglass puts weekly inflows to largest exchange Binance at 21,000 BTC.\n\nBitcoin exchange balance chart. Source: Coinglass\n\nLooking at the ratio of transaction volume profit and loss across both Bitcoin and Ether (ETH), meanwhile, research firm Santiment notes some curious behavior.\n\nRecent days have seen an inordinate amount of loss-making volume versus volume in profit, despite the relatively shallow price retracement of both assets.\n\n“With many traders FOMO'ing in Bitcoin above $30k and Ethereum above $2k this past week, loss transactions have mounted as markets pulled back,” it explained over the weekend.\n\n“Since Thursday, traders are moving coins below prices they obtained them at 3 times as often as above.”\n\nBitcoin, Ethereum transaction volume profit/ loss data annotated chart. Source: Santiment/ Twitter\n\nAnalyst: \"Smart money is done accumulating BTC\"\n\nShould the above phenomenon point to a shakeout of speculative traders, it may have come right on time — at least by historical standards.\n\nIn his latest update on market strength, popular Bitcoin analyst Moustache revealed that behind the scenes, the current Bitcoin bull run is playing out just like all others before it.\n\nUsing the qualitative quantitative estimation (QQE) — a form of the relative strength index (RSI) — Moustache suggested that Bitcoin was now at a pivotal point.\n\n“Smart money,” he argued, has already bought the dip, and is now waiting for the real upside to begin.\n\n“Smart money is done accumulating BTC. I told you a few weeks ago that once QQE >0 = Accumulation ends,” he declared.\n\n“We always saw a strong bull run afterwards.”\n\nBTC/USD annotated chart with QQE Index. Source: Moustache/Twitter\n\nMoustache added that the past week’s losses were apt to give bears a false sense of security.\n\n“We're not the same. It’s buy the dip time,” he concluded.\n\nCrypto sentiment cools to \"neutral\"\n\nOne potential bonus attached to the latest BTC price drop concerns wider crypto market sentiment.\n\nRelated: Bitcoin price crawls 2.5% off lows as weekly chart risks ‘bearish engulfing’\n\nAccording to the Crypto Fear & Greed Index, the mood among market participants is rapidly trending back to more reasonable levels.\n\nPreviously, Fear & Greed was at its highest levels since November 2021 and Bitcoin’s latest all-time highs. This, some warned at the time, might be unsustainable and lead to a swift market correction as traders became complacent and placed bets on upside continuing unchallenged.\n\nWith the comedown in full swing, the Index abandoned its “fear” zone altogether, switching to “neutral” and a score of 53/100 as of April 24.\n\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\n\nThat score is around the lowest — or least “greedy” — since mid-March.\n\nMagazine: Crypto regulation: Does SEC Chair Gary Gensler have the final say?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3Lndpb25ld3MuY29tL2J1c2luZXNzLWVjb25vbXkvZXhwbGFpbmVkLW15c3Rlcnktc3Vycm91bmRpbmctdGhlLWJpdGNvaW4tZm91bmRlci13aG8taXMtc2F0b3NoaS1uYWthbW90by01ODU5MjTSAX1odHRwczovL3d3dy53aW9uZXdzLmNvbS9idXNpbmVzcy1lY29ub215L2V4cGxhaW5lZC1teXN0ZXJ5LXN1cnJvdW5kaW5nLXRoZS1iaXRjb2luLWZvdW5kZXItd2hvLWlzLXNhdG9zaGktbmFrYW1vdG8tNTg1OTI0L2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Explained | Mystery surrounding the identity of Bitcoin founder. Who is Satoshi Nakamoto? - WION",
        "content": "While the world of crypto currencies continues to puzzle many, the kind of impact it has had on the financial systems across the world is noteworthy. But mysteries seem to be a running theme and given its origins, it is spot on. Over a decade ago, the world witnessed a cryptic milestone when Satoshi Nakamoto developed Bitcoin, the world’s first cryptocurrency. But who is this mastermind? No one knows for sure.\n\nWhat do we know about Satoshi Nakamoto?\n\nNakamoto is said to be a pseudonym for the person or people who helped create Bitcoin but the real identity of who he, she or they might be, continues to remain one of the biggest mysteries of the 21st century. The mysterious individual or group was the author of a 2008 white paper which outlined the theory and operating structure of the Bitcoin payment system.\n\nNakamoto’s identity continues to remain shrouded in mystery due to the lack of personal or background details about the person who would only communicate via email. One of the biggest indications that Nakamoto created Bitcoin was the famous white paper titled “Bitcoin: A Peer-to-Peer Electronic Cash System”.\n\nThe elusive mastermind behind the now largest cryptocurrency in the world was said to be working on the first version of the software back in 2007. Around two years later, Nakamoto created the first-ever online message board post which was dedicated to cryptocurrency, on the P2P Foundation forum.\n\n“I’ve developed a new open source P2P e-cash system called Bitcoin. It’s completely decentralised, with no central server or trusted parties, because everything is based on crypto proof instead of trust. Give it a try, or take a look at the screenshots and design paper,” said Nakamoto, on the forum, as per Forbes.\n\nHowever, in 2010, his involvement with Bitcoin ended but the cryptocurrency did not. As of 2021, at least one million Bitcoin miners were verifying the data that make up the Bitcoin blockchain and the cryptocurrency continues to remain one of the world’s largest by market cap.\n\nWhat did Nakamoto do?\n\nIt is worth noting that while the idea of digital currency was not new at the time, as reports suggest, there had been few attempts to create it. However, Nakamoto managed to solve a fundamental problem with digital currency, duplication. Unlike tangible currency like coins or paper money which could only be present at one place at a time, cryptocurrency could be duplicated which is also known as “double-spending”.\n\nSince digital currency does not exist in physical space, the transaction of said currency would not be in a single person’s possession. As a result, digital currency could be spent more than once. In order to overcome this issue, Nakamoto created a blockchain system of verification.\n\nInitially, one of the solutions to circumvent this problem would be third-party intermediaries like banks which would verify if the currency has already been used by its holder. However, given the additional costs and the risk of fraud of the trust-based model, Nakamoto decided to remove the human factor altogether and proposed a decentralised approach for transactions using ledgers.\n\nThis is where the blockchain comes into play. This system adds timestamps to transaction information, and cryptographic techniques are used to encrypt the data which cannot be changed and must be validated. Subsequently, the network is required to verify the authenticity of the transactions based on a majority consensus mechanism called proof-of-work.\n\nIs Nakamoto a real person?\n\nWe know so little about the so-called father of cryptocurrency that many have questioned if Satoshi Nakamoto really does exist. However, given what is known about the mastermind behind this system, there seems to be at least one person, if not people behind it. Case in point, somebody would have to write a source code for Bitcoin, publish the white paper which began it all, send emails and even create a forum to talk about the cryptocurrency.\n\nAbout his disappearance\n\nSeveral reports have quoted Nakamoto’s last email written on 24 April 2011 which was a short statement to another developer where the creator of Bitcoin said “I’ve moved on to other things” and that the project was in “good hands”. In December 2010 following the creation and initial implementation of Bitcoin, the creator seemingly vanished from the public eye.\n\nIt was in 2014 when a final forum post credited to Nakamoto simply said, “I am not Dorian Nakamoto.” This came after a Newsweek magazine article published in March of that year claimed that a 64-year-old Japanese-American physicist was the creator of Bitcoin.\n\nThe report said, “The trail followed by Newsweek led to a 64-year-old Japanese-American man whose name really is Satoshi Nakamoto”. Although it could be said that Nakamoto did not necessarily ‘disappear’ considering his identity was never revealed and anonymity would likely be his only choice to avoid public scrutiny.\n\nIs Elon Musk Satoshi Nakamoto?\n\nThere have been speculations about Tesla and SpaceX founder Elon Musk being Satoshi Nakamoto after a former intern for Musk’s SpaceX company Sahil Gupta, in a blog post on the website Medium suggested so. He cited the billionaire’s knowledge and interests which could have led him to develop a cryptocurrency like Bitcoin.\n\nHowever, Musk has since denied this claim. In 2021, during a podcast by AI researcher Lex Fridman, the Tesla CEO said that he believes that the person behind the Nakamoto pseudonym is none other than cryptographic expert Nick Szabo.\n\n“He seems to be the one more responsible for the ideas behind Bitcoin than anyone else. He claims not to be Nakamoto, but I'm not sure that's neither here nor there,” said Musk, as quoted by CNBC. However, Szabo had also previously denied this claim.\n\n\n\n\n\n\n\nWATCH WION LIVE HERE"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmdvYmFua2luZ3JhdGVzLmNvbS9pbnZlc3RpbmcvY3J5cHRvL2Jlc3QtcGxhY2UtdG8tYnV5LWJpdGNvaW4v0gFOaHR0cHM6Ly93d3cuZ29iYW5raW5ncmF0ZXMuY29tL2ludmVzdGluZy9jcnlwdG8vYmVzdC1wbGFjZS10by1idXktYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "5 Best Places To Buy Bitcoin in 2023 - GOBankingRates",
        "content": "Andrey Danilovich / iStock.com\n\nInvesting in bitcoin has never been more popular, and while there are hundreds of places that let you buy bitcoin, not all of them are created equal.\n\nSome charge high fees, while others, sadly, are at risk of bankruptcy, or worse.\n\nFinding a time-tested, secure place to buy bitcoin is more important than ever, especially with the recent news of several crypto exchanges and investing platforms freezing customer assets.\n\nBest Places To Buy Bitcoin in 2023\n\nGOBankingRates has reviewed dozens of the top crypto exchanges and investing platforms to find the best places to buy bitcoin in 2023. Here are the top picks:\n\nCoinbase — Best place for security\n\n— Best place for security Binance.US — Best place for low fees\n\n— Best place for low fees Robinhood — Best for beginners\n\n— Best for beginners eToro — Best for bitcoin social trading\n\n— Best for bitcoin social trading Cash App — Best payment app for buying bitcoin\n\n1. Coinbase\n\nCoinbase is the most popular crypto exchange in the U.S., and it boasts over 100 million users globally. Coinbase has been around since 2012 and is one of the longest-standing crypto exchanges available.\n\nCoinbase allows you to quickly buy bitcoin with its super simple mobile app design, quickly connecting your bank account and letting you begin trading right away. The fees can be high (up to 0.60% plus a spread fee), but the platform is one of the safest places to buy bitcoin.\n\nPlus, you can transfer your bitcoin off the Coinbase platform into a hardware wallet of your choosing, further securing your digital assets.\n\n2. Binance.US\n\nBinance is the largest crypto exchange in the world, and Binance.US is the U.S.-regulated arm of this massive exchange. With access to rock-bottom trading fees and even the ability to buy bitcoin without any fees, Binance.US is one of the cheapest ways to buy bitcoin.\n\nInvesting for Everyone\n\nBinance.US also carries over 150 other cryptocurrencies for trading, including ethereum, solana and dogecoin. With robust security and a built-in educational platform, Binance.US is ideal for new crypto traders who want access to the best low-fee crypto exchange around.\n\nAs with Coinbase, Binance.US also allows you to withdraw your crypto to your own hardware wallet for safekeeping.\n\n3. Robinhood\n\nRobinhood is a stock trading platform that offers commission-free trading and a slick mobile app. But it also offers access to bitcoin and a few other cryptocurrencies, and it does not charge any commissions on crypto trades.\n\nRobinhood became popular with traders as it doesn’t charge fees for most trades, and beginners are able to quickly get set up and start trading without the complicated charting and trading tools of other brokerages. Once it added crypto, Robinhood became a one-stop shop for beginners investors.\n\nRobinhood is regulated by the Financial Industry Regulatory Authority and offers FDIC insurance on cash balances. However, Robinhood Crypto does not insure cryptocurrencies and is not regulated by FINRA.\n\nRobinhood has had its share of controversy surrounding halting stock trading and the way it gets paid (order routing), but it is still a solid way to buy crypto for beginners. And it recently became one of the first U.S. brokers to offer a digital crypto wallet, allowing you to actually take custody of your bitcoin.\n\n4. eToro\n\nEToro is another popular trading app that offers access to stocks, options, ETFs and cryptocurrencies. Users can also sign up for its CopyTrader feature, allowing them to automatically copy the trades of popular investors on the website.\n\nInvesting for Everyone\n\nEToro lets you invest in bitcoin and a handful of other cryptocurrencies with a flat 1% trading fee for buying and selling. Its mobile app is easy to use, but for more experienced traders, eToro offers a desktop platform with charting tools and advanced order types.\n\nEToro also allows you to transfer bitcoin off its platform, but it is a bit of a cumbersome process, requiring an interim eToro digital wallet.\n\n5. Cash App\n\nCash App is a popular payment app that now allows you to buy bitcoin and other cryptocurrencies directly within the app. Purchases can be made with your Cash App balance or linked bank account, and you can even send bitcoin to other Cash App users for free.\n\nCash App fees vary when buying bitcoin and include a spread fee as well. It may not be the most economical way to buy large amounts of bitcoin, but it is a very convenient way for Cash App users to invest in crypto.\n\nAnd unlike Venmo, Cash App lets you transfer your bitcoin off the platform to your own digital wallet, with no network fees unless you pay for an expedited transfer.\n\nWhere Can You Safely Buy Bitcoin in 2023?\n\nThere are several ways to buy bitcoin, but not all of them are safe. Here are the three safest ways to buy bitcoin online:\n\nCrypto exchange: While some crypto exchanges, such as FTX, have been shut down in recent years, there are several U.S.-regulated exchanges that offer a safe and secure way to buy bitcoin. These exchanges typically offer easy-to-use mobile apps, great liquidity (usually low spread fees), and an easy way to exchange U.S. dollars for crypto.\n\nWhile some crypto exchanges, such as FTX, have been shut down in recent years, there are several U.S.-regulated exchanges that offer a safe and secure way to buy bitcoin. These exchanges typically offer easy-to-use mobile apps, great liquidity (usually low spread fees), and an easy way to exchange U.S. dollars for crypto. Brokerage: Some traditional brokerage accounts now offer access to bitcoin investing. While these investing apps are designed for stock trading, some have added in popular cryptocurrencies, such as bitcoin and ethereum. Most brokerage firms are FDIC insured and can be found through the FDIC’s BankFind Suite, making them a safe place to use your cash to invest in crypto.\n\nSome traditional brokerage accounts now offer access to bitcoin investing. While these investing apps are designed for stock trading, some have added in popular cryptocurrencies, such as bitcoin and ethereum. Most brokerage firms are FDIC insured and can be found through the FDIC’s BankFind Suite, making them a safe place to use your cash to invest in crypto. Payment app: There are several payment apps that offer direct access to investing in bitcoin, making it easy to buy bitcoin with just a few taps.\n\nInvesting for Everyone\n\nYou can also invest in bitcoin in other ways, such as cryptocurrency stocks or a bitcoin futures ETF, but if you want to buy the real thing, you will want to use one of the options listed above.\n\nBottom Line\n\nContrary to popular headlines, bitcoin is not dead, and it is still one of the fastest-growing assets on the planet. But with so many crypto platforms going bankrupt and pausing customer withdrawals, it is more important than ever to find a quality place to buy and sell bitcoin.\n\nAnd of course, if you want to further secure your cryptocurrency, it is recommended that you transfer your crypto assets off any platform and onto a secure hardware wallet. This gives you complete custody of your coins and takes away the risk of any platform disappearing with your crypto."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWJ0Yy10aGlzLXJlcG9ydC1wcmVkaWN0cy1tYXNzaXZlLXJhbGx5LWlzLXRoZS1raW5nLWNvaW4tcHJpbWVkLWZvci0xMDBrL9IBamh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWJ0Yy10aGlzLXJlcG9ydC1wcmVkaWN0cy1tYXNzaXZlLXJhbGx5LWlzLXRoZS1raW5nLWNvaW4tcHJpbWVkLWZvci0xMDBrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin [BTC]: This report predicts massive rally – is the king coin primed for $100k - AMBCrypto News",
        "content": "The research lead of a reputable financial institution said BTC would hit the milestone by 2024.\n\nOn-chain data suggests an undervalued state as another analyst expects the coin to thrive by the next halving.\n\nBitcoin [BTC] has been on a wild ride over the past few months, hitting yearly highs and then plummeting again. However, a recent prediction by Standard Chartered has suggested that the cryptocurrency could be poised for a massive rally by the end of the coming year, with some analysts predicting that BTC could reach $100,000.\n\nIs your portfolio green? Check the Bitcoin Profit Calculator\n\nBTC: Already started the journey to new highs\n\nWhile this may seem like a lofty goal, the digital asset arm of the firm outlined several factors at play that could drive Bitcoin’s price to new heights.\n\nAccording to the report shared by Reuters, the multinational financial institution noted that the banking sector turbulence could have a positive effect on Bitcoin mining activities.\n\nAdditionally, Geoff Kendrick, head of digital assets research at the firm, pointed out that the U.S. Federal Reserves ending its rate hike may have confirmed the end of the crypto winter. Kendrick, in backing his position, mentioned:\n\n“While sources of uncertainty remain, we think the pathway to the USD 100,000 level is becoming clearer”\n\nOn looking at the Network Value to Transactions (NVT) ratio, Glassnode showed that it had exited the bottom to a relatively high level. The NVT ratio is the ratio of the market cap to the transferred on-chain volume, which indicates sentiment and fair value.\n\nWhen this metric is high, it means network value had outpaced network activity, indicating a bearish sentiment. But when it is low, it means that investor sentiment is bullish. At the press time state of the metric, BTC could be considered undervalued.\n\nIs halving the game changer?\n\nOn 23 April, a Bloomberg report mentioned that the Bitcoin halving was paramount to the recovery of the asset. When Bitcoin undergoes a halving, it means that miners’ rewards have been cut in half. And historically, this sets the precedent for a bull market.\n\nJamie Douglas Coutts, an Intelligence analyst at Bloomberg, opined that BTC could be valued at $50,000 around April 2024 after the event.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-2024\n\nNoting that Bitcoin was already in preparation mode and agreeing with some of Kendrick’s reasons, Coutts said,\n\n“Bitcoin cycles bottom around 12-18 months prior to the halving and this cycle structure looks similar to the past ones, albeit many things have changed — while the network is vastly stronger, Bitcoin has never endured a prolonged severe economic contraction.”\n\nMeanwhile, Bitcoin’s liveliness had decreased to 0.60 at press time. This metric increases when long-term holders decide to liquidate their positions. But since it was falling from its peak, it implied that these devoted sets were willing to HODL.\n\nFor the time being, several analysts expect BTC to continue in its correction stage."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDQvMjUvaHVnZS1iaXRjb2luLXdoYWxlLXJlc3VyZmFjZXMtc2hvY2tzLW1hcmtldC13aXRoLTExbS1tb3ZlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Huge Bitcoin Whale Resurfaces, Shocks Market with $11M Move - Crypto Times",
        "content": "Well, well, well! Look at what the amphibian dragged in, we recently got a Satoshi-era Bitcoin whale who’s finally come out of hibernation. The whale only made transactions worth nominal value for a decade, but recently this crypto behemoth has made its presence felt by moving a whopping 400 BTC, currently valued at around $11 million.\n\nAccording to the wallet transaction history, the whale transferred 360 BTC (worth $9.8 million) to a single wallet while dispersing the remaining 40 BTC across several other locations. To make it even more shocking – there’s still a staggering 600 BTC left in the wallet.\n\nBut wait, that’s not all! It is not an isolated incident. Lately, many other whales have been stirring from their slumber and moving their Bitcoin holdings after years of inactivity. Just last week, another whale transferred over 460 BTC (or $12.65 million) to other wallets.\n\nIn the past week, we’ve seen not one, not two, but three massive whale addresses make some seriously huge transfers after lying dormant for a decade. One such address even transferred 2,071 BTC worth $62 Million.\n\nThe cherry on the icing was that two other whale addresses also made separate transfers of over 1,000 BTC each, despite the Bitcoin price remaining relatively stagnant after consistent drops.\n\nSo, What does this mean for Bitcoin and the World of Crypto?\n\nFor starters, it proves that whales are still the most successful and influential investors out there. Although Bitcoin whale numbers had dwindled earlier this year, they are still a force to be reckoned with. And why not? Bitcoin has seen an incredible surge of over 40,000% in the past ten years, meaning those who held onto their coins have seen some serious profits.\n\nCurrently, Bitcoin is trading at $27,260, and it’s down by 10% in value over the past week. However, this could all change with the upcoming BTC halving that’s expected to shake things up significantly. And who knows? We may see more movement in BTC next year as it approaches the coveted $100k mark. Of course, there’s always the possibility that potential interest rate hikes could also impact the price of Bitcoin.\n\nHere’s the kicker – it’s not just Bitcoin that’s seeing this kind of whale activity. Ethereum (ETH) and XRP whale transactions were also recorded around the same time, which means that the entire crypto market may soon be in for some serious action.\n\nAll in all, it’s an exciting time to be in the world of cryptocurrency. Who knows what kind of surprises these whales will have in store for us next?"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9hc3Nlc3NpbmctYml0Y29pbi1vcmRpbmFscy1yZXN1cmdlbmNlLWFzLWluc2NyaXB0aW9ucy1tYWtlLW5ldy1yZWNvcmQv0gFgaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2Fzc2Vzc2luZy1iaXRjb2luLW9yZGluYWxzLXJlc3VyZ2VuY2UtYXMtaW5zY3JpcHRpb25zLW1ha2UtbmV3LXJlY29yZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Assessing Bitcoin Ordinals resurgence as Inscriptions make new record - AMBCrypto News",
        "content": "Ordinals Inscriptions are unique digital assets created using Bitcoin’s native scripting language.\n\nBitcoin Ordinals are struggling with improved activity on several marketplaces.\n\nBitcoin [BTC] Ordinals Inscriptions, a collection of Non-Fungible Tokens (NFTs) on the Bitcoin network, have attained a new milestone.\n\nThe number of daily Inscriptions minted in a single block surpassed 14,000. And this occurred at a time when interest in the assets seemed to have simmered down.\n\nRealistic or not, here’s BTC’s market cap in ETH’s terms\n\nBreakthrough in Satoshi land\n\nThis new landmark has helped the total Inscriptions minted to rise above 1.5 million. According to Dune Analytics, the total Inscription minted to date was 1,555,971.\n\nOrdinals Inscriptions are unique digital assets created using Bitcoin’s native scripting language. These assets can represent anything from music to images, texts, or applications. And since they became mainstream in January, they have been in the spotlight.\n\nIn a more detailed context, Ordinals are serial numbers of each satoshi, the smallest Bitcoin denomination assigned to an input. Therefore, Ordinals enable Inscriptions to allow digital assets to be stamped on these satoshis.\n\nThese pieces of engraved data emerged as a result of Bitcoin’s ability to include data directly on-chain. Unlike Ethereum [ETH]-based NFTs, images are not the most popular collectible on the Bitcoin network.\n\nInstead, text Inscriptions have been at the helm of reign. Even with the recent highlight, texts took over the show again, amassing over 190,000 on 23 April mints. Images, on the other hand, could only record a meager 2174 identified.\n\nTripping down the hill\n\nDespite the increase in Inscriptions production, there have been some downsides to the Bitcoin Ordinals’ activity. According to the blockchain-query dashboard, the volume across all marketplaces hit a two-month low.\n\nRecall that the hype around the assets propelled an expansion into other NFT marketplaces. Around that time, former Solana [SOL] only-based marketplace Magic Eden joined to increase patronage.\n\nHowever, it seemed that the move has not yet paid off in a blistering manner. At press time, the volume recorded on 23 April was less than $130,000 as shown above.\n\nAlthough this increased the all-time volume above $22 million, the decline implied that participation had slowed since there was fewer number of successfully-completed transactions.\n\nHow much are 1,10,100 BTCs worth today?\n\nHowever, Bitcoin Ordinals can find solace in the fact that it was continually attracting owners of the assets. At the time of writing, the cumulative number of unique users had increased.\n\nIn a related development, Ordinals’ open-source extension, UniSat Wallet disclosed that it had been exposed to a double-spend attack. This has occurred despite being the first marketplace to provide the BRC-20 wallet.\n\nA double-spend attack is a flaw unique to digital assets where multiple transactions sharing the same input are broadcasted on a network. However, UniSat noted that it will compensate those affected."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vYnVzaW5lc3NjbG91ZC5jby51ay9uZXdzL2luLWNyeXB0by1iaXRjb2luLWNhbi1oaXQtMTAway1zdGFuZGFyZC1jaGFydGVyZWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "In Crypto: Bitcoin can hit $100k - Standard Chartered - BusinessCloud",
        "content": "The value of Bitcoin can hit $100,000 by the end of 2024, according to Standard Chartered.\n\nThe British bank’s analysts claim that the collapse of Silicon Valley Bank and smaller US lenders validates BTC’s original premise as a scarce digital asset.\n\nGeoff Kendrick, writing in a report entitled ‘Bitcoin – Pathway to the $100,000 level’, said: “We see potential for Bitcoin to reach the $100,000 level by end-2024, as we believe the much-touted ‘crypto winter’ is finally over.\n\n“The current stress in the traditional banking sector is highly conducive to BTC outperformance – and validates the original premise for Bitcoin as a decentralised, trustless and scarce digital asset.\n\n“Given these advantages, we think BTC’s share of total digital assets market cap could move into the 50-60% range in the next few months.”\n\nIt currently stands at around 45%.\n\nKendrick also believes that the woes of so-called stablecoins – created as a supposedly safe crypto store, maintaining a peg to, for example, the value of the US dollar – further proves the case for BTC as a trusted store of value.\n\nUSDC, one of the more trusted stablecoins, had exposure to Silicon Valley Bank through parent company Circle and lost its $1 peg, which it has since regained.\n\n“The pathway to the $100,000 level is becoming clearer,” Kendrick said.\n\nCryptocurrency shorts\n\nCrypto exchange Binance has launched a ChatGPT-powered chatbot, ‘Sensei’, to help users find information on its Binance Academy blockchain education platform.\n\nTech investor Chamath Palihapitiya, a crypto bull who once said Bitcoin has replaced gold as a store of value and would eventually hit $200,000, now believes “crypto is dead in America”. He told the All-In podcast: “The United States authorities have firmly pointed their guns at crypto.”\n\nCosmose AI, a RetailTech firm which helps the likes of LVMH, Richemont, L’Oréal and Estée Lauder connect their online and offline shopping experiences, has secured a strategic investment from NEAR Foundation to drive Web3 into its offering.\n\nThe second series of Donald Trump NFTs have accounted for a third of the total Polygon NFT sales volume on OpenSea, $2.23m, in the last seven days. The overall floor price of the digital trading cards across series 1 and 2 has plummeted from $792 before series 2 launched to $242 today. The original auction price for both was $99.\n\nCrypto prices\n\nThe overall market cap of the 23,600 coins is at $1.15 trillion at the time of writing (7am UK), a 0.9% decrease in the last 24 hours, with Bitcoin trading around $27,400.\n\nFor round-ups of recent cryptocurrency news developments, click here.\n\nFor valuations of the top 100 coins by market cap in US dollars, plus 24-hour price change, see below.\n\n"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmFmci5jb20vbWFya2V0cy9jdXJyZW5jaWVzL2JpdGNvaW4taGl0cy1mb3VyLXdlZWstbG93LWFzLXVzMjUtMDAwLWJlY29tZXMtdGhlLWZvY3VzLTIwMjMwNDI1LXA1ZDM3a9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin hits four-week low as $US25,000 becomes the focus - The Australian Financial Review",
        "content": "Bitcoin reached an almost four-week low, with the largest cryptocurrency continuing to lose momentum since breaking above $US30,000 earlier this month for the first time since June.\n\nThe original digital currency was little changed on Monday after earlier falling as much as 1.9 per cent to $US26,989. That was the first time the price was below $US27,000 since March 28. Other digital assets were mostly flat to higher, with ether little changed and avalanche up about 2 per cent.\n\nCrypto-related stocks also extended their slide from last week. Coinbase, the biggest US digital exchange, has slumped for six straight trading sessions since bitcoin hit its recent high of around $US31,000 on March 14. MicroStrategy retreated for a fourth day.\n\nThe recent pullback in the largest cryptocurrency is viewed by some commentators as just a correction. Bloomberg\n\nThere has been some “overheating” of the market, said Aya Kantorovich, co-founder of blockchain start-up Fractal. After Bitcoin hit a resistance point at $US30,000, some traders also took “small realised gains off the table,” she said.\n\n“At this point the pullback is still viewed as nothing more than a correction within what has become a more constructive outlook since breaking back above $US25,000,” Joel Kruger, a market strategist at LMAX Group, said ."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LnN0cmFpdHN0aW1lcy5jb20vYnVzaW5lc3Mvc3RhbmNoYXJ0LXNlZXMtYml0Y29pbi1yZWFjaGluZy11czEwMDAwMC1pbi0yMDI0LWJ1dC1pbnZlc3RvcnMtc2hvdWxkLXJlbWFpbi1jYXV0aW91c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "StanChart sees Bitcoin reaching US$100000 in 2024, but investors should remain cautious - The Straits Times",
        "content": "SINGAPORE - After crashing in 2022, Bitcoin has risen by around 65 per cent so far in 2023, and on Tuesday evening, traded at just over US$27,000, compared with around US$16,000 on Jan 1.\n\nNow, some analysts say the digital currency’s value could more than triple from its present level before the end of 2024.\n\nIn a research note released on Monday, Standard Chartered analyst Geoff Kendrick noted that the crypto winter of 2022 is “finally over”, and that Bitcoin has the potential to reach US$100,000 by the end of 2024.\n\nThe so-called crypto winter of 2022 was a period of significant decline in the prices of cryptocurrencies during the year. This came after a string of firms in the sector went bankrupt and a series of rate hikes by the United States Federal Reserve to tame inflation triggered an outflow of cash from risky assets like crypto.\n\nBitcoin, the largest cryptocurrency by market capitalisation, saw its value fall from US$69,000 in November 2021 to just over US$15,000 12 months later.\n\nBut things appear to be turning around. A recent banking sector crisis, which saw Swiss bank Credit Suisse and three US banks collapse, has revived the case for crypto as an alternative, decentralised banking system unhampered by financial intermediaries like banks.\n\nIt is also testing the Fed’s resolve to keep interest rates high, and this has raised crypto’s appeal as an alternative investment class.\n\nMr Kendrick noted that valuation troubles faced by some stablecoins, which are competing cryptocurrencies designed to have a stable value relative to a fiat currency like the US dollar, have also helped Bitcoin regain its reputation as digital gold.\n\nBitcoin is often referred to as such because it shares some of the characteristics that make gold valuable, such as scarcity.\n\nThis is ensured by the fact that Bitcoin’s total supply is fixed at 21 million tokens. This means its code is programmed such that no more Bitcoins can be created beyond that number, making it similar to gold, which is a finite resource.\n\nCurrently, around 19 million Bitcoins have been mined and are in circulation, with about 2 million left to be mined, according to the Blockchain Council.\n\nBitcoin’s code includes a mechanism that governs the rate at which new tokens are created.\n\nAs an incentive for Bitcoin miners to process transactions made with the cryptocurrency, they receive a reward for every block of transactions they validate on a digital public ledger known as a blockchain.\n\nThe mechanism halves the reward Bitcoin miners receive after every 210,000 blocks of transactions are completed and validated, which is around once every four years or so."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNpdHlhbS5jb20vYml0Y29pbi1jb3VsZC10b3AtMTAwMDAwLWJ5LW5leHQteWVhci1zdGFuZGFyZC1jaGFydGVyZWQtc2F5cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin could top £80,000 by next year, Standard Chartered says - CityAM - City A.M.",
        "content": "Bitcoin could top £80,000 by next year, Standard Chartered says\n\nAnalysts say that it’s not just hopes of the approval of a spot bitcoin ETF driving the digital asset’s price run\n\nBitcoin could surge to $100,000, or £80,000, by the end of next year as central bankers ease interest rates and a so-called “crypto winter” thaws, according to analysts Standard Chartered.\n\nThe most valuable cryptocurrency could be boosted by factors including recent volatility in the global banking sector, the end of the Fed’s rate-hiking cycle and improved profitability of crypto mining, Standard Chartered’s head of digital assets research Geoff Kendrick said in a note.\n\n“While sources of uncertainty remain, we think the pathway to the $100,000 (£80,000) level is becoming clearer,” Kendrick wrote.\n\nThe prediction comes after a rally for Bitcoin at the start of the year, with prices rising above $30,000 (£24,000) in April for the first time in ten months.\n\nPrices have fallen over 10 per cent in the past week however. Bitcoin is currently trading at $27,290 (£21,888) dollars.\n\nTrillions of dollars were wiped from the market in 2022 after rate hikes triggered a rush back to safer ground and a string of crypto firms imploded.\n\nPredictions of sky-high valuations have been commonplace during bitcoin’s past rallies. A Citi analyst said in November 2020 that bitcoin could climb as high as $318,000 (£255,055). It closed last year down about 65 per cent at $16,500 (£13,234).\n\nAdditional reporting by Reuters"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vY2xlYXJ0YXguaW4vcy9pbXBhY3Qtb2YtY3J5cHRvY3VycmVuY3ktb24tc3RvY2stbWFya2V00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "The Impact of Cryptocurrency on the Stock Market - ClearTax",
        "content": "Cryptocurrency has had a significant impact on the stock market since its inception. Bitcoin, the first and most well-known cryptocurrency, was created in 2009, and since then, it has grown in popularity and value. As the value of cryptocurrencies continues to rise, it is important to understand their impact on the stock market and how they affect traditional investments.\n\nBitcoin and Ethereum are the two largest cryptocurrencies in terms of market capitalization, and their impact on the stock market has been a topic of interest for investors and analysts alike. Here's a historical analysis of their impact on the stock market in the past few years:\n\nBitcoin: Bitcoin's impact on the stock market has been limited, with little correlation between the two markets. However, there have been instances of Bitcoin's price movements affecting investor sentiment in the stock market. For example, in December 2017, Bitcoin's price surged to nearly $20,000, and some analysts speculated that the surge was partly due to investors selling off stocks to invest in Bitcoin. Additionally, in March 2020, Bitcoin's price plummeted amid the COVID-19 pandemic, causing a sell-off in global stock markets. Ethereum: Ethereum's impact on the stock market has been even less pronounced than Bitcoin's. However, some analysts have noted that Ethereum's underlying technology, blockchain, has the potential to disrupt traditional financial systems, which could have a long-term impact on the stock market. In addition, the growth of decentralized finance (DeFi) applications built on the Ethereum network could lead to increased investment in related stocks.\n\nOverall, while cryptocurrencies like Bitcoin and Ethereum have made headlines for their price volatility and potential to disrupt traditional financial systems, their impact on the stock market has been limited thus far. However, as the crypto market continues to evolve and mature, it remains to be seen how it will impact the stock market in the future.\n\nHere are some notable footprints that cryptocurrency has created on the stock market:\n\nIncreased Market Volatility\n\nOne of the most significant impacts of cryptocurrency on the stock market is increased volatility. Cryptocurrencies are highly volatile, and their value can fluctuate rapidly. This volatility can spill over into the stock market and cause fluctuations in stock prices. The high volatility of cryptocurrencies is often attributed to a variety of factors, including their lack of regulation, the absence of fundamental metrics to evaluate their value, and their susceptibility to market manipulation. As a result, cryptocurrencies are prone to sudden price swings, which can lead to significant gains or losses for investors.\n\nOverall, while the volatility of cryptocurrencies has the potential to generate significant returns for investors, it also poses significant risks to the stability of financial markets. As the crypto market continues to evolve and mature, it will be important for regulators and investors to carefully monitor and manage these risks to ensure the long-term stability of the broader financial system.\n\nIncreased Investment Opportunities\n\nThe emergence of cryptocurrencies has created new investment opportunities for investors looking to diversify their portfolios and potentially earn higher returns. In addition to investing directly in cryptocurrencies like Bitcoin and Ethereum, investors can also invest in companies that are involved in the crypto market, such as cryptocurrency exchanges, mining companies, and blockchain technology providers.\n\nMoreover, the growth of decentralized finance (DeFi) applications built on blockchain technology has also opened up new investment opportunities. DeFi applications are designed to provide traditional financial services, such as lending, borrowing, and trading, without the need for intermediaries like banks. These applications often rely on cryptocurrencies as their native currency, creating new opportunities for investors to participate in the emerging DeFi ecosystem.\n\nIn addition, the rise of cryptocurrency trading and investment has led to the development of new financial products, such as futures contracts and exchange-traded funds (ETFs), which allow investors to gain exposure to cryptocurrencies without directly owning them. These financial products can provide investors with a more accessible and regulated way to invest in cryptocurrencies.\n\nRise of Blockchain Technology\n\nBlockchain is a distributed ledger technology that allows for secure and transparent record-keeping. It provides a decentralised system that enables secure and transparent transactions without the need for intermediaries.\n\nThe potential applications of blockchain technology are vast and extend beyond the cryptocurrency space. In the financial sector, blockchain technology has the potential to streamline and automate many processes, including trade settlement, clearing, and payments. It could also enable faster and more secure cross-border transactions and reduce the need for intermediaries like banks and clearinghouses.\n\nThe increasing adoption of blockchain technology has also led to the development of new business models and opportunities. Companies that are early adopters of blockchain technology could see significant gains in the coming years. As the technology continues to mature, it will be important for companies to stay abreast of new developments and potential applications.\n\nRisks of Hype and Speculation\n\nThe hype and speculation surrounding cryptocurrency can lead to increased market volatility, as investors make speculative bets on the future price of cryptocurrencies. This can result in significant price swings, which can lead to losses for investors who enter the market at the wrong time or invest in risky assets.\n\nMoreover, the lack of regulation in the cryptocurrency market can create additional risks for investors. Many cryptocurrencies are not subject to the same regulatory oversight as traditional investments, which can make it difficult for investors to assess the risks associated with these assets.\n\nAnother risk associated with cryptocurrency is the potential for fraud and scams. The lack of regulation in the market has created an environment where unscrupulous actors can prey on unsuspecting investors. This can make it challenging for investors to make informed investment decisions and avoid risky assets.\n\nRegulatory Uncertainty\n\nRegulatory uncertainty is a significant challenge for the cryptocurrency market. Cryptocurrencies are not currently subject to the same regulatory oversight as traditional financial instruments, such as stocks and bonds. This lack of regulation can create uncertainty and risks for investors who may not fully understand the potential risks associated with investing in cryptocurrencies.\n\nThe lack of clarity around regulation can create challenges for companies operating in the cryptocurrency space. Companies may find it difficult to comply with existing regulations or may face new regulations that could impact their business models.\n\nFurthermore, regulatory uncertainty can also impact the broader adoption of cryptocurrencies. Some institutional investors may be hesitant to invest in cryptocurrencies due to regulatory uncertainty, which could slow down the development of the market.\n\nConclusion\n\nCryptocurrency has created a significant impact on the stock market, both in terms of increased investment opportunities and increased volatility. While there are risks associated with investing in cryptocurrency, there are also opportunities for investors who are willing to do their research and understand the risks involved. As blockchain technology becomes more mainstream, it is likely that we will see more companies adopt it and potentially benefit from the increased efficiency and security it offers. Ultimately, it is important for investors to weigh the potential benefits and risks of investing in cryptocurrency and make informed decisions based on their own risk tolerance and investment goals."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vZmludGVjaG5ld3Muc2cvNzE4MDEvY3J5cHRvL2JpdGNvaW4tcG9pc2VkLXRvLXJlYWNoLXVzMTAwMDAwLWJ5LWVuZC0yMDI0LXNheXMtc3RhbmRhcmQtY2hhcnRlcmVkLXJlc2VhcmNoZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 25 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Poised to Reach US$100,000 by End-2024, Says StanChart Researcher - Fintech Singapore - Fintech News Singapore",
        "content": "Bitcoin is likely to reach US$100,000 by the end of next year in a sign that the crypto winter might be waning, according to lead researcher at Standard Chartered, Geoff Kendrick in a note on April 24.\n\nAs the bank’s Head of Crypto Research and Western Emerging Markets Forex Research, Kendrick believes that the recent banking sector crisis has helped to re-establish Bitcoin’s core use case as a decentralised, trustless and scarce digital asset. In addition, Kendrick says that troubles faced by stablecoins have aided Bitcoin in regaining its reputation as “digital gold”.\n\nFor instance, the USD Coin (USDC) was temporarily de-pegged as Circle, its issuer, held US$3.3 billion with Silicon Valley Bank (SVB), which was triggered by a bank run and had to be bailed out. Earlier in May 2022, the collapse of Terra/Luna resulted in the de-pegging of the Tether (USDT) stablecoin.\n\n“Against this backdrop, Bitcoin has benefited from its status as a branded safe haven, a perceived relative store of value and a means of remittance,”\n\nsaid Kendrick in his note.\n\nKendrick expects Bitcoin’s share of the total digital assets market cap to keep rising, most likely back to the 50-60% range, from 40% before the SVB collapse and 45% currently.\n\nFollowing the SVB incident, Bitcoin surged from below US$20,000 to above US$30,000, increasing the profitability of Bitcoin mining companies, which Standard Chartered estimates are incurring costs of around US$15,000. The broader macro backdrop for risky assets is also gradually improving as the US Fed nears the end of its tightening cycle.\n\nKendrick believes that while Bitcoin can trade well when risky assets suffer, correlations to the Nasdaq suggest that it should trade better if risky assets improve broadly.\n\nLooking ahead, Kendrick notes that the next Bitcoin halving is due around April to May 2024. Previous halvings have had a successively smaller impact on Bitcoin prices, but prices have bounced around each halving. Kendrick reasons that this should add a “cyclical tailwind to the structural positives at play”.\n\n“Further positive regulatory steps in the US and UK are also likely. While sources of uncertainty remain, we think the pathway to the US$100,000 level is becoming clearer.”\n\nthe research head noted."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LnRoaXNkYXlsaXZlLmNvbS9pbmRleC5waHAvMjAyMy8wNC8yNC9tb3N0LWNvbW1vbi0zLW1ldGhvZHMtb2YtY29udmVydGluZy1iaXRjb2luLXRvLW5haXJhLWluLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Most Common 3 Methods Of Converting Bitcoin To Naira in 2023 - THISDAY Newspapers",
        "content": "Looking for ways to convert Bitcoin to Naira in 2023? Well, you’ve come to the right place.\n\nAs you and I may know, to get the value of your Bitcoin, most times, crypto traders will have to convert their Bitcoin to fiat currency for them to be able to use it.\n\nIn Nigeria, cryptocurrency is undoubtedly the talk of the town, and many also want to be involved. But trading cryptocurrency in Nigeria is quite difficult due to the crypto ban in Nigeria by the Central Bank. And this regulation also affects crypto trading when converting Bitcoin to Naira.\n\nSo now that there’s a crypto ban in Nigeria, how can one convert Bitcoin in Nigeria? In this article, I will be sharing 3 common ways to convert Bitcoin to Naira in 2023 without violating the crypto rules in Nigeria.\n\n3 Most Popular Ways To Convert Bitcoin To Naira In 2023\n\nHere are 3 common ways to change your Bitcoin to Naira despite the crypto ban in Nigeria:\n\n1. P2P Trading\n\nP2P trading allows you to exchange Bitcoin for Naira by selling your Bitcoins to a buyer directly. Typically, a crypto trading platform like Binance or Localbitcoins is used for this, as it links buyers and sellers.\n\nIn the cryptocurrency industry, peer-to-peer trading is frequently referred to as P2P trading. Users can immediately trade their cryptocurrencies for cash by engaging in this type of trading. P2P trading occurs when user “A” has some cryptocurrency and sets a price to sell it, and when user “B” sees the listing in the market chart, they both decide to purchase from “A.”\n\nYou have some influence over who buys your cryptocurrency and who you buy it from, as well as the price and settlement time when you trade it from peer to peer. Peer-to-peer trading gives customers some degree of control over the process, but it should be noted that there are certain hazards involved.\n\nP2P trading, however, might potentially have certain disadvantages. For instance, because you are working with a private individual rather than a licensed broker, there is a possibility of fraud or fraud. Additionally, the exchange rate may be lower than the market rate as you are negotiating with the buyer.\n\n2. OTC Trading (Breet)\n\nOTC trading is a way to exchange crypto like Bitcoin for Naira via a seasoned broker like Breet. In this method, you work with the broker to sell your Bitcoins and receive payment in Naira.\n\nOTC means Over-The-Counter. So, as I explained about peer-to-peer exchange, you work with a third party via an escrow system. But with OTC exchange, you can convert Bitcoin to Naira without any other party. It is direct and automatic.\n\nOne of the main advantages of OTC trading is that you can get a higher exchange rate than you might through other methods. Although one of the downsides of OTC exchange is that the exchange rate is fixed, so you cannot negotiate for a better deal.\n\nBreet is one of the best OTC exchanges out there. Breet is an OTC crypto exchange platform that allows users and businesses who simply want to receive crypto and get a flat equivalent of their coin to convert their crypto to cash money immediately.\n\nBreet enables users to securely convert and withdraw their crypto coin to cash money in less than five(5) minutes without the use of peer-to-peer trading or any third-party agent.\n\n3. Use Bitcoin ATM\n\nUsing a Bitcoin ATM is a method of converting Bitcoin to Naira by using a machine that dispenses cash in exchange for Bitcoin. This is a relatively new method, and there is currently only one Bitcoin ATM in Nigeria, located in Dazey Lounge and Bar, Lagos State.\n\nBitcoin ATMs provide various benefits, with the principal one being its rapid and simple transaction process. By inputting your digital currency, you can instantly acquire cash without any cumbersome dealings or intermediary interference. Furthermore, there is no requirement for bargaining or mediation with another party in this seamless procedure.\n\nHowever, there are also some potential drawbacks to using a Bitcoin ATM. For example, the fees can be high, and you may end up paying more than you would with other methods. Additionally, you need to physically go to the ATM, which may not be convenient for everyone. Finally, the ATM is only located in Lagos, so if you live outside of Lagos, this method may not be suitable for you.\n\nWhy OTC Trading Is Better Than Other Options\n\nWhile each method of converting Bitcoin to Naira has its own advantages and disadvantages, there are several reasons why OTC trading is often considered to be the best option, particularly for larger trades.\n\nFirst and foremost, OTC trading allows for a higher exchange rate than other methods. This is because the broker is buying a large amount of Bitcoin at once, which can be more valuable than small individual transactions. This means that you can potentially receive more Naira for your Bitcoin than you would through other methods, such as P2P trading or using a Bitcoin ATM.\n\nIn addition to the higher exchange rate, OTC trading also offers a greater level of convenience and security. When you use a professional broker like Breet for OTC trading, you don’t need to worry about negotiating with individual buyers or dealing with potential fraud or scams. The broker handles all of the transactions and ensures that everything is done securely and safely.\n\nAn additional benefit of OTC trading pertains to its swiftness in comparison with other approaches. Though P2P transactions can occasionally be expeditious, they may require an investment of time and effort in searching for a potential buyer as well as engaging in negotiations. In contrast, the broker engaged in OTC trading is primed to purchase your Bitcoin immediately upon request; thereby enabling prompt completion of the transaction which leads to earlier disbursement of payment.\n\nFinally, OTC trading is often the best option for larger trades. When you are dealing with a large amount of Bitcoin, you want to make sure that the transaction is handled professionally and efficiently. OTC trading offers a level of expertise and experience that may not be available through other methods, making it the best choice for larger trades.\n\nOf course, there are also some potential drawbacks to OTC trading. For example, the process can be slow and may take several days to complete. Additionally, the exchange rate is fixed, so you cannot negotiate for a better deal. Finally, there is often a minimum amount of Bitcoin required for OTC trading, so this method may not be suitable for smaller traders.\n\nOverall, however, OTC trading is often considered to be the best option for converting Bitcoin to Naira, particularly for larger trades. With its higher exchange rate, greater convenience and security, and faster transaction times, OTC trading offers a level of professionalism and expertise that is hard to match with other methods.\n\nSo whenever you want to convert Bitcoin to Naira, don’t forget to use the Breet app. Breet is available on all Android and iPhone devices. You can access it via the web, available on the Breet web version."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbnMtbmV4dC1hbGwtdGltZS1oaWdoLWlkZW50aWZpZWQtYXMtYnRjLWZvbGxvd3MtcHJlLWhhbHZpbmctcGF0dGVybi1saWtlLWNsb2Nrd29yay_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's next all-time high identified as BTC follows pre-halving pattern like 'clockwork' - Finbold - Finance in Bold",
        "content": "With about one year left until Bitcoin (BTC) goes through its next halving, after which the reward for mining new Bitcoin blocks will reduce in half as part of capping the supply to 21 million BTC, the flagship cryptocurrency is repeating its pre-halving pattern, indicating the time range for its next all-time high (ATH).\n\nAs it happens, Bitcoin is currently moving in the same chart pattern in which the ATH is followed by accumulation and then entrance into a pre-halving zone, succeeded by a rapid incline toward the next ATH, “like a clockwork,” according to the observations published by the pseudonymous crypto market analyst Stockmoney Lizards on April 24.\n\nNew ATH in 2025?\n\nSpecifically, with its price at press time standing at $27,478, the maiden decentralized finance (DeFi) asset seems to be entering the pre-halving zone, where the expert believes it could reach up to around $53,000. If the pattern sticks, this means that Bitcoin could rapidly climb toward $225,000 or its next ATH in late 2025 or early 2026.\n\nBitcoin’s historical pre-halving behavior. Source: Stockmoney Lizards\n\nEarlier, Finbold reported on another pseudonymous crypto analyst, therationalroot, comparing the past Bitcoin halving cycles with a focus on its ATHs, suggesting that Bitcoin had the habit of spiking roughly 10-12 months after each of the halving events.\n\nThis means that the next ATH could occur in April 2025, slightly earlier than Stockmoney Lizards’ predictions. More recently, therationalroot has noted the progress of the halving cycle progress, indicating that the maiden digital asset was 74% into the current halving cycle as of April 18.\n\nBitcoin price analysis\n\nAs things stand, Bitcoin is currently trading at the price of $27,478, down 0.55% in the last 24 hours, as well as dropping 9.33% in the past week and 0.42% across the previous 30 days, according to the latest data retrieved by Finbold on April 24.\n\nBitcoin 7-day price chart. Source: Finbold\n\nWith its current price, Bitcoin is testing support at around $27,000, while crypto trading expert Michaël van de Poppe expects a rebound to $29,200 in the coming weeks, with a possibility of ‘bullish divergences’ in the $26,500 – $27,000 zone, as Finbold reported earlier.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vZmluYm9sZC5jb20vaGVyZXMtaG93LW11Y2gtYml0Y29pbi1pcy11cC1zaW5jZS1wZXRlci1zY2hpZmYtdG9sZC1pbnZlc3RvcnMtdG8tc2VsbC1pbi1qYW51YXJ5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 24 Apr 2023 07:00:00 GMT",
        "title": "Here's how much Bitcoin is up since Peter Schiff told investors to sell in January - Finbold - Finance in Bold",
        "content": "Since the turn of the year Bitcoin’s (BTC) rally has taken some investors by surprise, particularly following the prolonged bear market of 2022. While some are optimistic that this signals the start of the next bull run for Bitcoin, others are skeptical and question the sustainability of the momentum.\n\nOne person who remains bearish on Bitcoin is Peter Schiff, chief global strategist of Euro Pacific Capital. Despite the gains, Schiff considers the rally to be temporary and views it as an opportunity to exit the market.\n\nOn January 12, Peter Schiff took to Twitter to express his opinion on Bitcoin’s price. With the cryptocurrency trading above $18,000, Schiff saw it as an ideal moment for investors to sell the digital asset.\n\nThe chief global strategist had predicted a potential market crash ahead of the release of the United States Consumer Price Index (CPI) also citing gold’s 8-month high, which he thought could impact Bitcoin’s value.\n\nDespite Schiff’s recommendation to sell Bitcoin, the opposite outcome has come to pass. Contrary to his prediction, the cryptocurrency’s value has continued to climb, reaching $27,450 at press time, and representing a significant 54% increase since Schiff urged investors to sell.\n\nBitcoin since Schiff’s prediciton. Source: @BTC_Archive\n\nSchiff follows Jim Cramer curse\n\nThe market’s reaction to Schiff’s advice shows the unpredictability of cryptocurrency and its resistance to conventional market analysis.\n\nIn a similar case, host of TV show “Mad Money,” Jim Cramer, urged investors to sell Bitcoin at $24,000 back in March. Since his call, the leading cryptocurrency rallied over 20% to where it stands today.\n\nWhere will Bitcoin trend next?\n\nBitcoin’s price has recently stabilized above the $27,000 threshold, facing strong resistance at $28,377.\n\nBitcoin 1-day price chart. Source: Finbold\n\nAccording to a recent analysis from Michaël van de Poppe, Bitcoin has the potential to increase its value if it successfully surpasses the $27,800-$28,000 range. If this occurs, Bitcoin could potentially accelerate towards $29,200. However, the cryptocurrency’s upward momentum depends on whether it can sustain the breakout above the resistance level.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]