[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3Lm1hcmtldHBsYWNlLm9yZy8yMDIzLzExLzA4L2hhcy1lbC1zYWx2YWRvcnMtYml0Y29pbi1nYW1ibGUtcGFpZC1vZmYv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Has El Salvador's bitcoin gamble paid off? - Marketplace",
        "content": "A sign outside the Good Beans coffee shop in San Salvador advertises that it accepts bitcoin. (BBC)\n\nAt a small coffee shop in San Salvador, the capital of El Salvador, customers come for freshly made coffee and packets of high-quality beans. And some pay in bitcoin.\n\nThe cryptocurrency has been legal tender in the Central American country for more than two years. Businesses are officially required to accept bitcoin, but patchy technology, limited internet access and a lack of enforcement means that only some do.\n\nCoffee shop owner Gabe Gutierrez believes taking bitcoin payments has helped him attract customers.\n\n“In a normal month, 5% to 10% of our sales are in bitcoin. The business impact has been very positive in that sense,” he said. “Obviously it’s bringing in revenue, but it’s not only that. It’s more convenient.“\n\nPresident Nayib Bukele argued that adopting bitcoin would reduce dependence on the country’s other currency, the U.S. dollar, and make it cheaper to send and receive remittances — when migrants send home money to their family.\n\nBut in the first six months of 2023, according to El Salvador’s central bank, only around 1% of received remittances were in bitcoin. Many Salvadorans, like Delmy Bran, aren’t using the currency.\n\n“If they educated the people in how to use the currency, then maybe we could,” he said.\n\nOthers like Bea Tenorio think the government’s decision was irresponsible. “A country needs medicine in the hospitals, resources in the schools. I don’t think those of us at the bottom will see the benefits of it.”\n\nEl Salvador has lost an estimated $40 million of its total investment in bitcoin since 2021 due to a decline in the value of the cryptocurrency. Carlos Acevedo, an economist and former president of El Salvador’s Central Reserve Bank, doesn’t think bitcoin is suitable as legal tender.\n\n“It’s like playing Monopoly in the casino. You can win, you can lose — and we have had bad luck so far — but for people who are poor, they cannot afford to take a drop in 5%, 10% in one day.”\n\nBut the government is continuing to push bitcoin. It recently announced that bitcoin education would be compulsory in schools starting next year. People from other countries are also moving to El Salvador to use the cryptocurrency, like James Turner and Nicky Malcom of New Zealand.\n\n“So I receive 100% of my income at the moment as bitcoin, which we then manage that to live our life here,” Turner said. “We use it to buy our groceries,” added Malcom.\n\nCharlie Stevens moved here from Ireland. “I use bitcoin to trim my beard, for coffees, for gas, for cooking, I use it for my motorbike, and that’s just the tip of the iceberg.”\n\nWhile some say El Salvador’s bitcoin project hasn’t succeeded, others believe it’s only just beginning."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vd3d3LmF4aW9zLmNvbS8yMDIzLzExLzA4L2JpdGNvaW4tbGlmZS1pbnN1cmFuY2UtbWVhbndoaWxl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin life insurance company sees beauty in boring - Axios",
        "content": "Zac Townsend, CEO of Meanwhile. Photo illustration: Axios Visuals. Photo: Paige Newton, courtesy of Meanwhile\n\nLife insurance is boring, which is just what bitcoin needs, according to Zac Townsend, the CEO of Meanwhile. Why it matters: Building classic financial services on newfangled digital assets is a road to building out crypto's original vision: An alternative financial system based on a monetary system that's not subject to the whims of politicians.\n\nWhat they're saying: \"Bitcoin has this culture of HODLing (a crypto meme for holding through price swings) and has this culture of long-term store of value, and that's really what life insurance is about,\" Townsend says.\n\nHow it works: Meanwhile is a life insurance company that does everything in bitcoin, while still offering tax advantages that customers might expect for products they're considering for estate planning.\n\nSpeaking very broadly, a customer that gives Meanwhile 10 BTC can expect a beneficiary to receive 20 BTC after the customer dies (precise terms are subject to actuarial analysis, etc., but that's been a rough idea of the deal, here in the early days).\n\nTownsend called that price a \"ballpark.\" The minimum buy-in, for now, is five bitcoin over five years (roughly $175,000).\n\nTo meet its obligations, the company runs a conservative credit desk, targeting a 3% return in bitcoin (2% is all it needs to pay death benefits).\n\nA selling point is that, over time, users can borrow against their benefit tax-free, Townsend explained.\n\nThe intrigue: \"We accept all our premiums in bitcoin. We pay all our claims in bitcoin,\" Townsend says. \"Because all our assets and liabilities are in bitcoin, the price of bitcoin doesn't matter.\"\n\nState of play: In June, Meanwhile announced it raised $19 million at a reported $100 million valuation.\n\nThat raise reached a little over $20 million now, with Stillmark — a Bitcoin-focused fund — joining later, Townsend tells Axios.\n\nThe company got its sandbox license with the Bermuda Monetary Authority at the end of last year. (Bermuda is a leading nation for domiciling insurance companies)\n\n\"The way we talked to them about it was, 'We're going to build a boring life insurance company,'\" he said.\n\nTownsend declined to disclose numbers but says Meanwhile is selling policies. Right now, it's only available in the U.S.\n\nHis goal is to offer it in places where saving is harder, such as Argentina, Zimbabwe and Nigeria.\n\nZoom out: The company runs with seven people now, but Townsend thinks a large insurance company can be built with low overhead by using artificial intelligence to do jobs like customer service.\n\nThe bottom line: \"We have already worked on policies right now that are going to outlive me,\" he says.\n\nGo deeper: Bitcoin ETF approvals are still no slam dunk"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDcvYml0Y29pbnMtcm9sZS1hcy1kaWdpdGFsLWdvbGQtd2lsbC1haWQtZnVydGhlci1kZW1hbmQtdHJhZGVycy1zYXkv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8wNy9iaXRjb2lucy1yb2xlLWFzLWRpZ2l0YWwtZ29sZC13aWxsLWFpZC1mdXJ0aGVyLWRlbWFuZC10cmFkZXJzLXNheS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin’s Role as ‘Digital Gold’ Will Aid Further Demand, Traders Say - CoinDesk",
        "content": "“The U.S. is now well over $33 trillion in debt, in addition to the unfunded liabilities of approximately $170 trillion. And, really, the only way out of this looming debt crisis is quantitative easing, or money printing, that will inevitably debase the dollar,” Mico said, adding bitcoin was poised to “be gold 2.0” amid such headwinds."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTEvMDcvd2h5LWJpdGNvaW4tYXRtcy1hcmUtdGFraW5nLW92ZXItbWFsbHMtYW5kLWdhcy1zdGF0aW9ucy1hY3Jvc3MtdGhlLXVzLmh0bWzSAW5odHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8xMS8wNy93aHktYml0Y29pbi1hdG1zLWFyZS10YWtpbmctb3Zlci1tYWxscy1hbmQtZ2FzLXN0YXRpb25zLWFjcm9zcy10aGUtdXMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Why bitcoin ATMs are taking over malls and gas stations across the U.S. - CNBC",
        "content": "A different kind of ATM is setting up shop in your local convenience store.\n\nThese machines look like traditional banking kiosks, but they allow customers to buy bitcoin in cash.\n\nBitcoin ATMs, or BTMs, exploded in popularity between 2020 and mid-2022, at the height of the crypto craze. At their peak, BTMs totaled 34,000 across the U.S., according to Coin ATM Radar.\n\nMore and more people are using bitcoin ATMs to send money at lightning speed. A study from Bitcoin Depot, the company with the largest share of BTMs across the U.S., found that two-thirds of their customers use the machines for remittances and online purchases. But these machines have also gained a reputation as a vehicle for crime. Scammers can send their victims to these kiosks to take advantage of the faster transaction speeds.\n\nWatch the video above to learn more about what's driving the BTM boom, why these machines attract crime, and how prosecutors plan to fight back."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvc25hcHNob3QvYmxhY2tyb2NrLWxhcnJ5LWZpbmstc2hpZnQtb24tYml0Y29pbi1kdWUtdG8td2VhbHRoLXRyYW5zZmVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "The real reason behind BlackRock boss Larry Fink's sudden love of Bitcoin - DLNews",
        "content": "BlackRock boss Larry Fink has U-turned on crypto over the years.\n\nIt may be explained by a historic transfer of wealth to the young.\n\nHappy Wednesday!\n\nBlackRock CEO Larry Fink attributed Bitcoin’s rise to a “flight to quality.”\n\nBut the asset has other things going for it, he said in 2020.\n\nLet’s dive into it.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\nCapturing the imagination\n\nAfter notoriously referring to Bitcoin as a means for money laundering, Fink changed his tune in 2020 when he stated the top cryptocurrency had “caught the attention and the imagination of many people.”\n\n”One of my important investors was on a television show in the last few days. He spoke about Bitcoin, monetary policy, and Covid,” Fink said during a keynote session at the Council on Foreign Relations at the start of the pandemic.\n\n“The hits on BlackRock’s website were 3,000 on Covid, 3,000 hits on monetary policy, and 600,000 hits on Bitcoin. Many people are fascinated by it. Many people are excited about it.”\n\nIf the company is tracking hits to its site, it must also know a thing or two about the demographics of that internet traffic.\n\nJoin the community to get our latest stories and updates\n\nFast forward to 2023 and BlackRock’s iShares unit has filed an application to launch its own spot Bitcoin exchange-traded fund.\n\nThe efforts to draw in young money come as a generational shift in wealth from baby boomers to millennials — referred to by some commentators as the great wealth transfer — may put billions of dollars in the hands of younger investors in coming years.\n\nA third quarter insights report by Coinbase shows more than one in three people from the millennial and Gen Z age bracket own crypto, while only 12% of older generations do.\n\nBlackRock is not the only institutional investors to aim for the younger crowd.\n\nFidelity Digital Assets, the crypto arm of finance giant Fidelity, has taken to X and TikTok to promote blockchain education to younger generations.\n\nVanEck, founded in 1955, has gained over 7,000 followers on X since beginning its “Enter the Ether” marketing campaign, which promotes the launch of its Ether futures ETF, in September.\n\nAnd all three financial firms have spot Bitcoin ETF applications awaiting SEC approval.\n\n“Some of these companies introducing these products may market to a new client segment,” Giovanni Vicioso, head of crypto at the CME Group, told DL News. “It may bring participants that are currently not in the space.”\n\nCrypto market movers\n\nBitcoin is up 2% in the last 24 hours, reaching $35,361.\n\nEthereum rose by 0.5% in the same period, at $1,886.\n\nToncoin and Polygon are both up 8.1%\n\nWhat we’re reading\n\nTyler Pearson is a Researcher at DL News. Got a tip? Reach out at ty@dlnews.com"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTExLTA3L2JpdGNvaW4tYnRjLW1pbmVycy1zb2xkLW1vcmUtdG9rZW5zLXRoYW4tdGhleS1taW50ZWQtZHVyaW5nLW9jdG9iZXItcmFsbHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Miners Sold More Tokens Than They Minted During October's Crypto Rally - Bloomberg",
        "content": "The top 13 public crypto-mining companies sold the equivalent of all the Bitcoin they minted in October, plus a little more, while the digital asset posted one of its biggest rallies since token prices crashed last year.\n\nThe liquidation-to-production ratio was about 105% for companies including Marathon Digital Holdings and Core Scientific Inc., according to data compiled by industry trade publication TheMinerMag, meaning they sold Bitcoin from their holdings in addition to what was produced. That is significantly higher than the previous three months, when the ratio was 64%, 77% and 77% in July, August and September respectively. The ratio peaked at 390% last June amid the crypto market crash and surging power costs."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvYml0Y29pbi1zdXBwbHktY3J5cHRvY3VycmVuY3ktaGlzdG9yaWMtbG93LWhvYXJkLXRva2Vucy1ldGYtaGFsdmluZy1wcmljZS0yMDIzLTEx0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Supply Hits Historic Low As Long-Term Investors Hoard Tokens - Markets Insider",
        "content": "Bitcoin's supply in circulation is extremely low as long-term investors are increasingly stashing tokens, Glassnode said.\n\nBy one measure, the amount of held bitcoin in wallets with minimal spending history hit a record of over 15.4 million tokens.\n\n\"LTHs historically wait for the market to break to new price [all-time highs] before ramping up their distribution.\"\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nThe supply of freely circulating bitcoin has tightened to historic lows, as long-term investors are stashing an all-time high amount of the cryptocurrency, according to data from Glassnode.\n\nBy one measure, the amount of held bitcoin in wallets with minimal spending history hit a record of over 15.4 million tokens, the blockchain data platform said. Similar trends can be seen in the net position change of long-term holders, with inflow levels steadily climbing.\n\nAn all-time high is also forming in the spread between long-term holder (LTH) and short-term holder (STH) supply, Glassnode said. It's a sign of how tight the market is becoming, demonstrating that short-term buyers are unlikely to find many sellers willing to part with their holdings.\n\n\"LTHs historically wait for the market to break to new price [all-time highs] before ramping up their distribution,\" the report said. \"This process can be seen by the large scale decline in their supply during the 2021 bull run, which is matched by an uptick in STH Supply, as well as Exchange inflow volumes.\"\n\nAdvertisement\n\nThis resistance to selling comes on expectations that bitcoin will eventually breach earlier price highs. That comes as possible regulatory approval of a spot bitcoin ETF as well as bitcoin's April halving are fueling investor optimism.\n\nThese same factors are driving increasingly bullish calls on bitcoin's trajectory, with investing firm Bernstein recently projecting the token to hit $150,000 by mid-2025.\n\nGlassnode suggested that bitcoin's current price levels are of interest, given that most short-term held coins have become profitable since the token breached $30,000. This may fuel a transfer of coins to new investors, especially if the price declines from its current $35,000 level."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjYyMTY3L2JpdGNvaW4tbG9uZy10ZXJtLWhvbGRlci1zdXBwbHktaXMtYXQtYW4tYWxsLXRpbWUtaGlnaNIBXmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL2FtcC9wb3N0LzI2MjE2Ny9iaXRjb2luLWxvbmctdGVybS1ob2xkZXItc3VwcGx5LWlzLWF0LWFuLWFsbC10aW1lLWhpZ2g?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin long-term holder supply is at an all-time high - The Block",
        "content": "The circulating supply of bitcoin is historically tight, with coins held by long-term investors at an all-time high, according to Glassnode data.\n\nThe data found that existing bitcoin investors are becoming increasingly unwilling to part with their holdings, with analysts at Glassnode observing \"impressive rates of accumulation taking place.\"\n\n\"The bitcoin supply is quite tight with several measures of supply such as illiquid supply, coins HODLed, and long-term holder supply at historical highs,\" Glassnode analysts said in a note shared with The Block.\n\nLong-term holders are accumulating\n\nIn a Wednesday blog post entitled \"The Tightening of Supply,\" Glassnode data showed the proportion of circulating supply of bitcoin held for longer than one year is hovering around all-time-high levels. Analysis of the data found this long-term holder metric is at an elevated level for several BTC -2.95% age bands.\n\nThe data revealed that 68% of the circulating supply of bitcoin has been held untouched for over one year. The bitcoin metric for coins held for over five years now sits at almost 30% of the total circulating amount.\n\n\"The illiquid supply metric, which measures the amount of supply held in wallets with minimal history of spending is also at an all-time high of 15.4 million bitcoin,\" Glassnode analysts added.\n\nIlliquid supply increasing\n\nRELATED INDICES See crypto indices\n\nThe data showed that the monthly rate of change for illiquid supply is within a multi-year period of net gains, currently increasing at a rate of over 71,000 bitcoin per month.\n\nThe Glassnode report described that this increase in illiquid supply has moved in tandem with investors withdrawing their digital assets from exchanges. \"The data suggests investors are continuing to withdraw their coins into custody, with over 1.7 million bitcoin doing so since May 2021,\" Glassnode analysts said.\n\nDivergence between long and short-term investor cohorts\n\nAccording to Glassnode, \"a powerful divergence continues to form between long-term holder supply, and short-term holder supply, which is at effectively all-time lows.\"\n\nThe analysts added that the spending behavior of short-term bitcoin holders has changed following BTC's rally above the key $30,000 level. \"The recent rally suggests that a shift in market character has taken place now that the market has rallied above the key $30,000 level. Analysis of investor cost basis for various cohorts suggests that this $30,000 level is an important zone of interest for the bulls,\" the Glassnode analysis said.\n\nThe world's largest cryptocurrency by market capitalization increased by over 1.3% in the past 24 hours to $35,272 at 9:48 a.m. in New York, according to CoinGecko."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8xMS8wOC91cy1zZWMtc2FpZC10by1vcGVuLXRhbGtzLXdpdGgtZ3JheXNjYWxlLW9uLXNwb3QtYml0Y29pbi1ldGYtcHVzaC_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMTEvMDgvdXMtc2VjLXNhaWQtdG8tb3Blbi10YWxrcy13aXRoLWdyYXlzY2FsZS1vbi1zcG90LWJpdGNvaW4tZXRmLXB1c2gvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "U.S. SEC Said to Open Talks with Grayscale on Spot Bitcoin ETF Push - CoinDesk",
        "content": "When pressed two weeks ago about what his agency will do next with Grayscale's application and the others, SEC Chair Gary Gensler said he wouldn't answer while the commission waits for its staff to recommend a course of action. Meanwhile, he published a video earlier on Wednesday spotlighting the work of the agency's corporation-finance arm – dealing with \"rapidly evolving technology and business models\" – that will be central to Grayscale's application."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDgvYml0Y29pbi1icmVha291dC10b3dhcmQtNDVrLWltbWluZW50LXNheXMtbWF0cml4cG9ydC_SAWVodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzA4L2JpdGNvaW4tYnJlYWtvdXQtdG93YXJkLTQ1ay1pbW1pbmVudC1zYXlzLW1hdHJpeHBvcnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Breakout Toward $45K 'Imminent' Says Matrixport - CoinDesk",
        "content": "\"The Santa Claus rally could start at any moment,\" said Matrixport. \"With a steady increase in buyers during U.S. trading hours and an ongoing attempt for bitcoin to break out, we could see prices rallying into the end of the month and year.\""
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDkvYml0Y29pbi1jYWxsLXNrZXctaGludHMtYXQtZnVydGhlci1wcmljZS1yaXNlLWFzLXNwb3QtZXRmLW9wdGltaXNtLWVuZXJnaXplcy1idGMv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDkvYml0Y29pbi1jYWxsLXNrZXctaGludHMtYXQtZnVydGhlci1wcmljZS1yaXNlLWFzLXNwb3QtZXRmLW9wdGltaXNtLWVuZXJnaXplcy1idGMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Call Skew Hints at Further Price Rise as Spot ETF Optimism Energizes BTC - CoinDesk",
        "content": "A call option gives the purchaser the right but not the obligation to purchase the underlying asset at a predetermined price on or before a specific date. A call buyer is implicitly bullish on the market. A put option gives the right to sell."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzA4L2JpdGNvaW4tcHVzaGVzLXRvd2FyZHMtMzZrLWFoZWFkLW9mLWxhc3QtYXBwcm92YWwtcGVyaW9kLWZvci1zcG90LWV0ZnMtdGhpcy15ZWFyL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMS8wOC9iaXRjb2luLXB1c2hlcy10b3dhcmRzLTM2ay1haGVhZC1vZi1sYXN0LWFwcHJvdmFsLXBlcmlvZC1mb3Itc3BvdC1ldGZzLXRoaXMteWVhci9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "BTC Price Pushes Towards $36K Ahead of 2023's Last Approval Period for Bitcoin ETFs - CoinDesk",
        "content": "Three applicants, Hashdex, Franklin and Global X, may have their own comment periods, the note said, so if the SEC is willing to disregard those applications for now, they could issue approvals for the first nine filings, which include BlackRock, Grayscale, 21Shares & Ark, Bitwise, VanEck, Wisdomtree, Invesco & Galaxy, Fidelity and Valkyrie."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDkvYml0Y29pbi10b3BzLTM2ay1hcy1ldGZzLW5vdC15ZXQtcHJpY2VkLWluL9IBW2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDkvYml0Y29pbi10b3BzLTM2ay1hcy1ldGZzLW5vdC15ZXQtcHJpY2VkLWluL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Tops $36K as 'ETFs Not Yet Priced in' - CoinDesk",
        "content": "\"It’s not at all priced in because the people who are going to buy this ETF are not aware that it’s coming or most likely coming; the majority of advisors who are the natural audience for this ETF don’t expect it to come until 2025 or later,” Hougan said. “If the people who are going to buy this ETF don’t think it's going to be approved in the next two months, then I don’t see how it’s priced in.”"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzA4L2JpdGNvaW4tbWluZXItbWFyYXRob24tZGlnaXRhbC1taXNzZXMtM3EtZWFybmluZ3MtYW5kLXJldmVudWUtZXN0aW1hdGVzL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzExLzA4L2JpdGNvaW4tbWluZXItbWFyYXRob24tZGlnaXRhbC1taXNzZXMtM3EtZWFybmluZ3MtYW5kLXJldmVudWUtZXN0aW1hdGVzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Marathon Digital Beats Q3 Earnings Estimates, but Misses on Revenue - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDgvYml0Y29pbi1mZWVzLXNvYXItbmVhcmx5LTEwMDAtc2luY2UtYXVndXN0LWFzLW9yZGluYWxzLWFyZS1iYWNrLWluLXZvZ3VlL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDgvYml0Y29pbi1mZWVzLXNvYXItbmVhcmx5LTEwMDAtc2luY2UtYXVndXN0LWFzLW9yZGluYWxzLWFyZS1iYWNrLWluLXZvZ3VlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Fees Soar Nearly 1,000% Since August as Ordinals Are Back in Vogue - CoinDesk",
        "content": "This is of particular import for the miners as Bitcoin's quadrennial halving event expected in April 2024 is drawing nearer, which will cut block rewards for the industry in half."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDcvc2hpYi1kb2dlLXRvcC1vcGVuLWZ1dHVyZXMtcmFua2luZ3MtYXMtYml0Y29pbi1yYWxseS1zcHVycy1yaXNrLXRha2luZy_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzA3L3NoaWItZG9nZS10b3Atb3Blbi1mdXR1cmVzLXJhbmtpbmdzLWFzLWJpdGNvaW4tcmFsbHktc3B1cnMtcmlzay10YWtpbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "SHIB, DOGE Top Open Futures Rankings as Bitcoin Rally Spurs Risk-Taking - CoinDesk",
        "content": "Open interest in XRP has increased by a meager 0.76% in seven days, even as the payments-focused cryptocurrency's price has surged by 18.6%, the biggest gain among major cryptocurrencies. The data show XRP's gains have been mainly spot-driven."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9iaXRjb2luLW1pbmVycy1idGMtcHJpY2UtcmFsbHktc3BvdC1ldGYtc3VwcGx5LXNob3J0YWdlLWNyeXB0by0yMDIzLTEx0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Miners Sold More BTC Than They Minted As Token's Price Surged - Markets Insider",
        "content": "Top bitcoin miners sold more tokens than they produced last month, according to data portal The Miner Mag.\n\nThirteen public miners sold $164 million worth of bitcoin, cashing in on its price rally in October.\n\nMiners' bitcoin liquidation-to-production ratio last month was 104%, up from 70% over the summer.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nTop crypto miners capitalized on the surge in bitcoin prices last month, selling more tokens than they produced.\n\nAccording to a post on crypto data portal The Miner Mag, 13 public bitcoin miners, including Hut 8 and Bit Digital, sold a total of 15,492 tokens worth $164 million.\n\nAs the amount sold was more than the number minted, the bitcoin liquidation-to-production ratio shot up to 104% in October from 70% over the summer, suggesting that miners reached into their own bitcoin stockpiles to unload tokens.\n\nThat came as bitcoin notched a 30% monthly gain that sent the price rocketing past $35,000 for the first time since 2022.\n\nAdvertisement\n\nLiquidation over production ratio for top public bitcoin mining companies. The Miner Mag\n\n\"While some of these companies consistently sell all of their mined bitcoin every month, others adopt a hybrid treasury strategy such as Marathon, Hut 8, Cipher, CleanSpark, Bit Digital – and it was them who liquidated more in October than in previous months,\" the post stated.\n\nUsually, miners sell minted coins to replenish their cash flows or take advantage of rallying crypto prices. Riding on a wave of optimism around an expected approval of a spot bitcoin ETF, prices surged to months-long highs. The currency is currently trading at $35,746, up 115% year-to-date.\n\nAnother possible reason why producers were cashing in on tokens is to get ahead of the next bitcoin halving in 2024. That's when the reward for mining is cut in half, and miners may have been trying to dampen the upcoming blow by selling.\n\nThe sale of tokens helps with bitcoin supply in what's currently a tight market. Last month, a Forex.com analyst warned that bitcoin may see a supply shock, with tradeable tokens on crypto exchanges at their lowest since 2018."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvY3J5cHRvY3VycmVuY2llcy1iaXRjb2luLWJyZWFrcy0zNTAwMC_SAVNodHRwczovL3d3dy5ldGZ0cmVuZHMuY29tL2NyeXB0by1jaGFubmVsL2NyeXB0b2N1cnJlbmNpZXMtYml0Y29pbi1icmVha3MtMzUwMDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Cryptocurrencies: Bitcoin Breaks $35,000 - ETF Trends",
        "content": "This weekly update tracks some of the largest cryptocurrencies by market share: bitcoin and ether. We’ve also included XRP, as it was one of the largest cryptocurrencies when this series began. According to Wikipedia, a cryptocurrency is “a digital asset designed to work as a medium of exchange that uses cryptography to secure its transactions, to control the creation of additional units, and to verify the transfer of assets.” Cryptocurrency is a young asset class that has developed a reputation for price volatility; however, there are ETFs that could help mitigate risk for those investors seeking crypto exposure.\n\nBitcoin was the world’s first cryptocurrency and decentralized digital currency. The first bitcoin transaction occurred in early 2009 and has since grown worldwide. Ether is another cryptocurrency run on the Ethereum blockchain platform and has the second largest market share, despite being the newest of the three with its launch in July 2015. XRP, which is owned by Ripple and launched in 2012, was one of the larger cryptocurrencies for some time until new coins joined the market. We’ve included it here for reference.\n\nThe third-largest market share of cryptocurrency, tether, is a token “backed by actual assets” which includes one U.S. dollar, one euro, or loans to affiliate companies, and is controlled by the owners of Bitfinex. It’s a controversial cryptocurrency due to its alleged manipulation of crypto pricing. It is called a “stable coin” because it was designed to always be worth $1.00. We do not chart it because its price rarely changes.\n\nFor a better understanding of crypto market cycles, read more here.\n\nThe Latest Cryptocurrencies Data (through November 7, 2023)\n\nBitcoin’s price continued to rise this week, breaking $35,000 for the first time since May 2022. BTC is now up ~111% year to date. Some cryptomarket observers believe this year’s rally is the start of something even greater and that Bitcoin could continue this momentum over the next few years.\n\nXRP’s price rose sharply this week as it briefly ticked above $0.70 for the first time since August. XRP is now up over 100% year to date.\n\nEther posted its highest close in over three months, finishing just under $1,900. ETH is now up ~56% year to date.\n\nAn index has been created to chart these three cryptocurrencies together, considering their significantly different pricing histories. Ether tops the chart, i.e., the price of an ether has changed the most out of all three cryptocurrencies.\n\nETFs associated with cryptocurrencies include: ProShares Bitcoin Strategy ETF (BITO), ProShares Short Bitcoin Strategy ETF (BITI), VanEck Ethereum Strategy ETF (EFUT), and Bitwise Ethereum Strategy ETF (AETH).\n\nWhat’s next in the crypto ETF market? Find out here.\n\nOriginally published on Advisor Perspectives.\n\nFor more news, information, and analysis, visit the Crypto Channel."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc3VwcGxpZXItb2Ytb3Zlci00MDAwMC1tZXJjaGFudHMtaW4tZWwtc2FsdmFkb3Itbm93LWFjY2VwdHMtYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Supplier of Over 40000 Merchants in El Salvador Now Accepts Bitcoin - Nasdaq",
        "content": "Bitcoin wallet and API platform Blink, formerly known as Bitcoin Beach Wallet, has announced a new partnership with Distribuidora Morazán, the second-largest distributor of consumer goods in El Salvador, according to a press release sent to Bitcoin Magazine.\n\nThis collaboration between Blink and Distribuidora Morazán has paved the way for a pilot program that allows the distributor to accept bitcoin from a select segment of its extensive customer base, which includes over 40,000 merchants. Furthermore, Distribuidora Morazán is actively encouraging and supporting these merchants in integrating Bitcoin as a payment option in their retail locations. This move by Distribuidora Morazán is a strategic endeavor to promote and foster business-to-business (B2B) Bitcoin adoption in El Salvador.\n\n\"Our distribution operation, until today, has been predominantly managed in cash and this presents a series of logistical, time, and operational difficulties that slow our day-to-day ability to visit more points of sale. Bitcoin solves that,\" said Distribuidora Morazán CEO Rodrigo Jacir Garcia-Prieto. \"The vast majority of our customers do not have access to banking services and this is the perfect way to introduce them to their first financial tool. We want to take full advantage of what bitcoin can do for us and our customers by enabling cash management efficiency, reducing operational expenditures, and increasing our ability to expand our reach within Central America while using a secure payment method such as Blink.\"\n\nThe pilot program has already been rolled out to 30 of the target 80 Phase I merchants, with plans to onboard up to 3% of Distribuidora Morazán's customers, equivalent to 1,000 merchants, in 2024.\n\n\"Our collaboration with Distribuidora Morazán isn't just about a feature or a program. It's about catalyzing a nation's shift to embrace Bitcoin from the ground up,\" said Noor El Bawab, CEO of Blink.\n\nThis partnership, along with Blink's new 'Buy & Sell Bitcoin' feature, marks a substantial step forward in normalizing Bitcoin transactions in everyday life in El Salvador. These initiatives exemplify a concerted effort to harness Bitcoin's potential for efficient business operations and inclusive economic growth among communities and small businesses.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMTEvMDcvYml0Y29pbi1hbHQtY29pbnMtcmV0dXJuLW9mLXJpc2stb24tdXB0b2Jlci_SAVZodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzExLzA3L2JpdGNvaW4tYWx0LWNvaW5zLXJldHVybi1vZi1yaXNrLW9uLXVwdG9iZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin, altcoins, and the return of ‘risk on’ - Fortune",
        "content": "It’s felt like old times in the crypto markets as traders celebrated the first proper “Uptober” (October in crypto speak) in a while, with Bitcoin gaining around 28% by month’s end. Meanwhile, the start of November has seen altcoins get a piece of the action with XRP rising around 20% over the past week as Dogecoin and Cardano have likewise posted double digit gains.\n\nAll of this reflects the return of what market watchers like to call “risk on” behavior—or what skeptics might prefer to call “Let’s hit the casino, boys!” The basic idea is that, as the vibe around crypto improves, more traders are willing to seek out investments that offer high risk but the potential for high rewards.\n\nAs analyst Noelle Acheson has noted, the recent rally has been fueled by the return of leverage as more traders borrow money to supersize their bet on a variety of exotic tokens. Meanwhile, the crypto derivatives market is humming again as people are buying stablecoins from DeFi platforms to try their luck on perpetual futures contracts and similar bets that those of us without a Ph.D. in math would be crazy to go near.\n\nThe question is what this all means. As is the case with most crypto market price swings, there appears to be no single cause to explain the current rally. Instead, there is a series of potential factors driving the current mini-boom—including a growing consensus that Crypto Winter is over at last and that better times are on the way. Don’t underestimate how much sentiment, bad or good, drives the market—and especially the crypto markets.\n\nIf the current altcoin rally lasts, though, the thing I am most curious to see is if traders put a new premium on fundamentals—however you want to define that term when it comes to crypto. In past bull markets, few investors bothered to look for anything resembling empirical evidence to justify throwing their money at the fly-by-night coin du jour. Instead, they relied on half-baked advice from their taxi driver or personal trainer, or accepted the claims of bag holders and bot armies on X. Number go up and all that.\n\nThis time around, it would be nice to see crypto traders return to the market older and wiser after the many debacles of the last cycle. And just maybe the price of altcoins will rise because they have found a novel application or because a critical mass of people are using them for something beyond blind speculation. That’s the optimistic case. But if this new cycle proves to be driven again by mindless gambling, we can look forward to the same bad hangover that’s become a defining feature of the crypto industry.\n\nJeff John Roberts\n\njeff.roberts@fortune.com\n\n@jeffjohnroberts\n\nDECENTRALIZED NEWS\n\nKraken plans to follow Coinbase's lead and launch its own layer-2 blockchain, possibly built on the tech stack of Polygon or Matter Labs. (CoinDesk)\n\nVisitors to Hong Kong's version of the NFT festival ApeFest, hosted by Yuga Labs, reported burning eyes as a result of exposure to ultraviolet light. (Bloomberg)\n\nNFT collections based on The Simpsons soared in value after the famous TV show's latest episode mocked NFTs. (Decrypt)\n\nU.K. regulators, citing the potential for savings and easier international payments, proposed plans to bring stablecoins into the day-to-day economy under the supervision of the Bank of England. (FT)\n\nAn inspector general's report found the SEC is struggling to recruit crypto experts partly due to agency rules that restrict crypto ownership. (Fortune)\n\nMEME O’ THE MOMENT\n\nDo as I say, not as I do:"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LnRoZWJhbmtlci5jb20vQXBwcm92aW5nLWJpdGNvaW4tRVRGcy1pbi10aGUtVVMtMTY5OTQzNzUxOdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Approving bitcoin ETFs in the US - The Banker",
        "content": "In the past few weeks, crypto has been in the news once more due to expectations that bitcoin exchange-traded fund (ETF) submissions will be approved by the UK Securities and Exchange Commission (SEC).\n\nOn Monday October 16, the bitcoin price skyrocketed due to an industry rumour that Blackrock bitcoin ETFs had been approved (they had not, and news reports that it had been retracted). One week later, on Monday October 23, bitcoin prices jumped again when the iShares bitcoin ETF was listed on the Depository Trust and Clearing Corporation with the ticker ‘IBTC’. This was later described as a standard process in bringing new ETFs to the market and not a confirmation of approval."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzExLzA4L3RoaXMtMS1jYXRhbHlzdC1jb3VsZC1zZW5kLWJpdGNvaW4tc29hcmluZy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "This 1 Catalyst Could Send Bitcoin Soaring Back to Its All-Time High of $69,000 - The Motley Fool",
        "content": "There's a good reason why Bitcoin (BTC -3.82%) has earned a reputation as a tremendously volatile asset. It typically moves in dramatic boom-and-bust cycles, sometimes without any apparent rhyme or reason. After a huge \"bust\" year in 2022, when it lost 65% of its value, Bitcoin has entered a new \"boom\" phase and is up more than 110% for the year.\n\nWhat makes this year's boom so remarkable is that it is not being driven by retail investors. Instead, the driving catalyst for this year's rally appears to be large institutional investors, many of whom are embracing Bitcoin for the first time. And that is leading to some tremendously bullish predictions about where Bitcoin could be headed next, including a potential rally back to its all-time high of $69,000.\n\nSigns of institutional investor bullishness\n\nThe signs of a dramatic change in investor sentiment are everywhere these days. Wall Street giant Morgan Stanley recently opined that \"crypto winter\" could finally be over. A top market strategist at Fidelity Investments recently outlined a new investment thesis calling Bitcoin \"exponential gold.\" Even some top hedge fund managers, who never before invested in crypto, are now waxing poetic about the allure of Bitcoin. Legendary billionaire Stanley Druckenmiller, for example, recently said in a Robinhood Fireside Chat, \"I don't own any Bitcoin, to be frank, but I should.\"\n\nWhat's driving the new enthusiasm for Bitcoin?\n\nThere are at least three good reasons for the change in sentiment. The most obvious one is the enthusiasm over the imminent arrival of the first-ever spot Bitcoin exchange-traded fund (ETF). When this product launches, it could result in a tsunami of new money into Bitcoin. Some of the largest institutional investors -- including BlackRock (BLK -2.08%), the largest asset manager in the world -- are behind this surge in new interest in Bitcoin. The conventional wisdom is that even if large institutional investors allocate just 1% of their portfolios to Bitcoin, then it could push up its price significantly.\n\nThe other big reason for the change in sentiment is the overall macroeconomic outlook. Institutional investors are always on the lookout for a hedge against bad things happening in the broader economy, and have settled on Bitcoin as a potential hedge. Bitcoin has been widely touted as a potential hedge against inflation, which is what has earned it the moniker of \"digital gold.\" And earlier this year, the string of regional bank failures led to many institutional investors moving their money into Bitcoin, all in the hopes of avoiding the pain and upheaval happening in the traditional banking system.\n\nAnd, finally, there's building excitement over the Bitcoin halving in April 2024. This unique event, which happens only once every four years, results in the mining reward for Bitcoin miners being cut by one-half. This might sound like a highly technical event, but it has rather profound implications for the future price of Bitcoin. It makes Bitcoin a more deflationary asset (by reducing the rate at which new Bitcoin is being created), and it creates a \"scarcity effect\" around Bitcoin. In three previous halving cycles, Bitcoin has rallied to new all-time highs, and the expectation is for a similar outcome in 2024.\n\nSo what could go wrong?\n\nGiven all of the above, it might seem obvious that Bitcoin has nowhere to go but up. But don't forget: Bitcoin is a highly volatile asset. Put another way, Bitcoin is unlikely to march upward in any kind of obvious pattern. There will be zigs and zags along the way. Some analysts predict that Bitcoin might drop back to $25,000 or even $20,000 from its current level of $35,000. And, when you add in macroeconomic and geopolitical uncertainty, Bitcoin could end up disappointing a lot of bulls over the next 12 months.\n\nThat being said, I remain bullish on Bitcoin over the long haul. The arrival of institutional investors to the Bitcoin party is long overdue, and should continue to push up the price of the world's most valuable cryptocurrency for years, if not decades, to come."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kYXRhLWhpZ2hsaWdodHMtYml0Y29pbnMtcG90ZW50aWFsLXBhdGgtdG8tNDBrLWFtaWQtZWNvbm9taWMtdHVyYnVsZW5jZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Data highlights Bitcoin's potential path to $40K amid global economic turbulence - Cointelegraph",
        "content": "Bitcoin (BTC) has been trading within a narrow 4.5% range over the past two weeks, indicating a level of consolidation around the $34,700 mark.\n\nDespite the stagnant prices, the 24.2% gains since Oct. 7 instill confidence, driven by the impending effects of the 2024 halving and the potential approval of a spot Bitcoin exchange-traded fund (ETF) in the United States.\n\nInvestors worry about the bearish global economic outlook\n\nBears expect further macroeconomic data supporting a global economic contraction as the U.S. Federal Reserve holds its interest rate above 5.25% in order to curb inflation. For instance, on Nov. 6, Chinese exports shrank 6.4% from a year earlier in October. Furthermore, Germany reported October industrial production down 1.4% versus the prior month on Nov. 7.\n\nThe weaker global economic activity has led to WTI oil prices dipping below $78 for the first time since late July, despite the potential for supply cuts from major oil producers. U.S. Federal Reserve Bank of Minneapolis President Neel Kashkari’s remarks on Nov. 6 set a bearish tone, prompting a “flight-to-quality” response.\n\nKashkari stated:\n\n“We haven’t completely solved the inflation problem. We still have more work ahead of us to get it done.”\n\nInvestors have sought refuge in U.S. Treasurys, resulting in the 10-year note yield dropping to 4.55%, its lowest level in six weeks. Curiously, the S&P 500 stock market index has reached 4,383 points, its highest level in nearly seven weeks, defying expectations during a global economic slowdown.\n\nThis phenomenon can be attributed to the fact that the firms within the S&P 500 collectively hold $2.6 trillion in cash and equivalents, offering some protection as interest rates remain high. Despite increasing exposure to major tech companies, the stock market provides both scarcity and dividend yield, aligning with investor preferences during times of uncertainty.\n\nMeanwhile, Bitcoin’s futures open interest has reached its highest level since April 2022, standing at $16.3 billion. This milestone gains even more significance as the Chicago Mercantile Exchange solidifies its position as the second-largest market for BTC derivatives.\n\nHealthy demand for Bitcoin options and futures\n\nThe recent use of Bitcoin futures and options has made media headlines. The demand for leverage is likely fueled by what investors believe are the two most bullish catalysts for 2024: the potential for a spot BTC ETF and the Bitcoin halving.\n\nOne way to gauge market health is by examining the Bitcoin futures premium, which measures the difference between two-month futures contracts and the current spot price. In a robust market, the annualized premium, also known as the basis rate, should typically fall within the 5%–10% range.\n\nBitcoin 2-month futures annualized premium (basis). Source: Laevitas\n\nNotice how this indicator has reached its highest level in over a year, at 11%. This indicates a strong demand for Bitcoin futures primarily driven by leveraged long positions. If the opposite were true, with investors heavily betting on Bitcoin’s price decline, the premium would have remained at 5% or lower.\n\nAnother piece of evidence can be derived from the Bitcoin options markets, comparing the demand between call (buy) and put (sell) options. While this analysis doesn’t encompass more intricate strategies, it offers a broad context for understanding investor sentiment.\n\nRelated: Bitcoin Ordinals see resurgence from Binance listing\n\nDeribit BTC options put-to-call 24h volume ratio. Source: Laevitas\n\nOver the past week, this indicator has averaged 0.60, reflecting a 40% bias favoring call (buy) options. Interestingly, Bitcoin options open interest has seen a 51% increase over the past 30 days, reaching $15.6 billion, and this growth has also been driven by bullish instruments, as indicated by the put-to-call volume data.\n\nAs Bitcoin’s price reaches its highest level in 18 months, some degree of skepticism and hedging might be expected. However, the current conditions in the derivatives market reveal healthy growth with no signs of excessive optimism, aligning with the bullish outlook targeting prices of $40,000 and higher by year-end.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9iaXRjb2lucy12b2xhdGlsaXR5LWRpbWluc2hlcy1pbi0yMDIzLWVjb2lub21ldHJpY3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin’s Volatility Diminshes in 2023: Ecoinometrics | Video - CoinDesk",
        "content": "Chart of the days presented by crypto dot com. The leading crypto platform trusted by over 80 million users worldwide. All right, let's take a look at the chart of the day. Bitcoin's volatility in 2023 is at its lowest in over a decade. That's according to E coin Metris. The term volatility which measures how much the price of an asset fluctuates often comes with a negative connotation, but that's not always the case investors can experience swings up or down. It's important to remember that there is up potential too. This chart shows Bitcoin's average monthly volatility since 2014. The largest Cryptocurrency by market cap has doubled in value and soared above the $35,000 mark this year. Amid weak liquidity conditions. Yet volatility has been largely absent from the market with rates ranging predominantly between 20 to 40%. It appears Bitcoin investors in 2023 are seeing more payoff compared to previous years. Though perhaps macro and leverage traders are continuing to sit on the fence. Bitcoin is currently trading hands at around $35,200. That's it for today's chart of the day. I'm Jen Sasi we'll see you next time to unpack more of the data behind top news stories."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9pcy1iaXRjb2lucy1wcmljZS1hdC1hLXR1cm5pbmctcG9pbnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Is Bitcoin's Price at a Turning Point? - CoinDesk",
        "content": "What we are seeing right now is a good old bump in open interest on the CME futures. And the chart we have here is for the standard contract, which is sized at 55 BDC per contract. And it's kind of considered a proxy for institutional activity and the open interest or as they say, you know, the notional dollar value locked in the number of active contracts, it has gone up by something like 30% in just four weeks. And popular inference is that the open interest is rising. It means traders are taking bullish bets, but that's not necessarily the case because you open interest doesn't tell you anything about the positioning of traders. Yeah, that they could be taking shots, they could be taking loans or, you know, they, they, they might be taking delta neutral trades like they might be selling futures against long position in the spot market right here. What's happening, you know, is the, as we can see on the chart, the open interest every time the open interest rises by double digits within just a few weeks, we tend to get a turnaround in the Bitcoin spot price. It happened in uh I think in late 2022 it marked the bottom, the July talk that we saw early this year was also accompanied by a sharp uptick in the CME open interest. So the similar pattern is likely to play out. Now, now that we have such a sharp rise in open interest. It's kind of, you know, if you're a bullish trader, it's kind of the right time to maybe scale back your risk and anticipate healthy price pullback."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiL2h0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS92aWRlby82MzQwNzU1MTg4MTEy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin is the currency of peace: Natalie Brunell - Fox Business",
        "content": "Log in to comment on videos and join in on the fun."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvYml0Y29pbi1taW5lcnMtcm9vbS1pbmNyZWFzZS1yZW5ld2FibGUtZW5lcmd5LXVzZS_SAV9odHRwczovL3d3dy5ldGZ0cmVuZHMuY29tL2NyeXB0by1jaGFubmVsL2JpdGNvaW4tbWluZXJzLXJvb20taW5jcmVhc2UtcmVuZXdhYmxlLWVuZXJneS11c2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Miners Have Room to Increase Renewable Energy Use - ETF Trends",
        "content": "One of the most frequently mentioned criticisms of bitcoin mining is that it’s energy-intensive. Making that matter worse is that the industry is a massive consumer of fossil fuels, arguably inviting that criticism. Indeed, data supports the notion that there’s ample room for bitcoin miners to increase usage of renewable energy.\n\nSome companies are getting that memo. As the groups’ green energy consumption increases, assets such as the Invesco Alerian Galaxy Crypto Economy ETF (SATO) could benefit. The equity sleeve of the fund’s portfolio heavily tilts toward cryptocurrency miners. That’s an asset class that isn’t highly correlated to crypto prices. But it’s one that’s also drawn the ire of policymakers and regulators for elevated dependence on fossil fuels.\n\nGreenfield of Green Energy Opportunity for SATO\n\nData confirms the point that the bitcoin mining industry, including SATO member firms, have plenty of room to improve renewable energy consumption. According to BanklessTimes.com, two-thirds of the energy consumed by bitcoin miners is fossil fuels, including coal and natural gas.\n\n“The choice of energy for Bitcoin mining has become a topic for debate. There is increasing evidence indicating that a significant amount of Bitcoin mining relies on fossil energies. This information is causing concerns about the impact of Bitcoin and how it could contribute to climate change,” noted analyst Alice Leetham.\n\nSome bitcoin miners are awakening to the benefits of broadening use of renewables. If nothing else, by boosting use of green energy, cryptocurrency miners can appease regulators while reducing criticism of their energy choices. Additionally, reduced dependence on fossil fuels could, over time, boost profitability in the industry.\n\nData indicates some operators are already seizing the benefits of renewables. Thirty-seven percent of the energy consumer by bitcoin miners is derived from hydro or wind power, according to BanklessTimes. Nearly 13% is either nuclear or solar. Those percentages aren’t staggering, but they imply room for growth and that some miners are taking seriously environmental stewardship.\n\n“Bitcoin mining companies, investors and enthusiasts have a shared responsibility to lead the industry towards friendly practices. It is essential to invest in energy infrastructure, promote research and development of energy technologies and advocate for strict regulations. These measures are crucial for reducing the impact of Bitcoin mining,” concluded BanklessTimes."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYmluYW5jZS1jZW8tYmxhc3RzLWRyLWRvb21zLW5ldy10b2tlbi1hcy1zaGFtZWxlc3MtYW1pZHN0LWJpdGNvaW4tY3JpdGljcy11LXR1cm7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Binance CEO Blasts Dr Doom's New Token As 'Shameless' Amidst Bitcoin Critic's U-Turn - Nasdaq",
        "content": "Economist Nouriel Roubini popularly known as Dr Doom, long known for his critical stance towards cryptocurrencies, has made a sudden pivot by unveiling his own cryptocurrency. This surprising turn of events has stirred controversy, with Binance co-founder and CEO Changpeng Zhao expressing his disapproval.\n\nWhat Happened: Roubini, who once labeled Bitcoin as a “shitcoin,” belittled Ethereum, and dismissed blockchain technology as no more than a spreadsheet, has now ventured into the world of cryptocurrency with his latest project. However, this unexpected move has not been well received by Zhao.\n\nSome people are shameless. After attacking Binance publicly on stage a year ago, now issues a token and puts #Binance logo on their website WITHOUT permission. 🤡🤷‍♂️😂 pic.twitter.com/WENaTO4tE4\n\n— CZ 🔶 Binance (@cz_binance) November 7, 2023\n\nRoubini’s has ventured into launching a stablecoin. According to the project’s website, the Atlas Climate Token (ACT) is not just a digital investment contract, but an actual blockchain-based stablecoin. The stablecoin is designed to be pegged to a diverse portfolio of tangible real-world assets, including climate-resilient REITs, strategic commodities, inflation-hedged sovereign bonds, and gold, the project website reads.\n\nThe website also reveals that Atlas is currently in active discussions with top-tier ETF issuers and distributors to facilitate the launch of the ETF.\n\nTaking to X, Zhao did not hold back in criticizing Roubini. “Some people are shameless,” he wrote.\n\nWill The SEC Finally Approve Long-Awaited Bitcoin Spot ETF? Ask industry experts directly at Benzinga's Future of Digital Assets event happening in NYC on Nov. 14, 2023. Be a part of the discussions where you won't just be a passive spectator. Don't let this chance slip away – secure early bird discounted tickets now!\n\nSee More: A Stay At The Floating Palace From James Bond's ‘Octopussy\n\nWhy It Matters: Ironically, Roubini’s new crypto venture, Atlas Capital, highlighted the experience of one of its team members who had previously worked at Binance, seemingly using it as proof of their own credibility. This move did not sit well with Zhao.\n\nZhao accused Roubini of including the Binance logo on Atlas Capital’s website without permission. Since Zhao’s tweet, Atlas Capital has removed all external company logos, including that of Binance, from the “Team” page on its website.\n\nInterestingly, during a CNBC live event in Abu Dhabi last year, Roubini did not mince words when describing Zhao. Referring to him as a “walking time bomb.\"\n\nAt the time of writing, Bitcoin (CRYPTO: BTC) was trading at $36,338.55 up 2.29% in the last 24 hours, according to Benzinga Pro.\n\nPhoto Courtesy: Wikimedia Commons\n\nRead Next: Here’s How Much You Should Invest In Shiba Inu Today For A $1M Payday If SHIB Hits 1 Cent?\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDkvYml0Y29pbi1zaG9ydC1zcXVlZXplLWJ1bXBzLXByaWNlcy10by1uZWFybHktMzdrLWFzLXNwb3QtZXRmLWhvcGVzLXN0cmVuZ3RoZW4v0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMS8wOS9iaXRjb2luLXNob3J0LXNxdWVlemUtYnVtcHMtcHJpY2VzLXRvLW5lYXJseS0zN2stYXMtc3BvdC1ldGYtaG9wZXMtc3RyZW5ndGhlbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Tops $37K for First Time Since May 2022 as Short Squeeze Bumps Prices Amid BTC ETF Optimism - CoinDesk",
        "content": "\"Delay orders were issued by the SEC for BlackRock, Bitwise, VanEck, WisdomTree, Invesco, Fidelity & Valkyrie at the same time,\" analyst James Seyffart said in an X post. \"If the agency wants to allow all 12 filers to launch – as we believe – this is the first available window since Grayscale's court victory was affirmed.\""
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNiYy5jYS9kb2N1bWVudGFyaWVzL3RoZS1wYXNzaW9uYXRlLWV5ZS93aHktaS13YW50ZWQtdG8tc29sdmUtdGhlLW15c3Rlcnktb2YtYml0Y29pbi1zLWNyZWF0b3ItMS43MDE3NzM30gEgaHR0cHM6Ly93d3cuY2JjLmNhL2FtcC8xLjcwMTc3Mzc?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Why I wanted to solve the mystery of Bitcoin's creator - CBC.ca",
        "content": "For almost three years, filmmaker Paul Kemp has been investigating what happened to Bitcoin's creator, Satoshi Nakamoto.\n\nSatoshi Nakamoto is a pseudonym: the cryptocurrency founder (or founders) hid his identity only to vanish in 2011, two years after he unleashed his new digital currency on the world.\n\nIt's believed Nakamoto holds more than one million Bitcoins — and not one of those coins has ever been transferred or moved from their digital wallet. If the value of Bitcoin continues to skyrocket, which it very likely will since there is a limited total of bitcoins in existence, Nakamoto could eventually become the richest person on earth.\n\nIn Searching for Satoshi: The Mysterious Disappearance of the Bitcoin Creator, Kemp investigates who the person (or people) behind the name might be and what might have happened to him.\n\nKemp was drawn to the story because it is, he says, \"the greatest technological mystery of all time.\" While there have been several attempts to uncover who Nakamoto is, none have been successful. So Kemp went on a global quest of his own, which he describes in the interview below.\n\nWhat made you want to investigate the story — and whereabouts — of Satoshi Nakamoto?\n\nWhen I heard about Bitcoin in 2009, 2010, 2011 … I didn't really know what it was. I thought it was like Monopoly money. I thought it was just some crypto weirdness that [didn't have] much staying power.\n\nBut as the decade went on, I started to realize people are still working on this thing and the name Bitcoin is everywhere. I saw ATM machines selling Bitcoin. I saw vendors [and] stores accepting Bitcoin. So I started paying more attention to it around 2018, 2019. That's when I learned there was a guy named Satoshi Nakamoto, who actually created Bitcoin.\n\nEveryone who knows anything about Bitcoin realizes he's the greatest mystery in technological history. Nobody knows who he is. All they know is he could possibly be the richest person in the world in the coming years, but he's just vanished.\n\nNakamoto launched Bitcoin in 2009, and by 2011, he [disappeared] with over a million Bitcoins. This documentary asks the deeper questions about who he is and why he did this.\n\nBitcoin was released in 2009 by Satoshi Nakamoto. 2 years later, he disappeared | Searching for Satoshi Duration 2:03 On January 3, 2009, Satoshi Nakamoto, the mysterious creator of Bitcoin, released the digital currency to the world by posted the \"genesis block,\" the starting point from where Bitcoins could be mined through the blockchain.\n\nHow did you try to track Nakamoto down?\n\nIt's a global story and it needed global legs. I needed to get on a lot of planes. I needed to do a lot of interviewing. Throughout the making of this documentary, I've been to the U.K. to uncover somebody who has claimed to be Nakamoto. I've talked to people in Australia. I've been to Saipan, which is a U.S. protectorate in the middle of the Pacific where I uncovered some amazing evidence of who Nakamoto might be. And of course, I've been to Silicon Valley and the enormous Miami Bitcoin conferences. I think I've traced a pretty good story for the audience.\n\nHow did you create your list of the five people Nakamoto could be?\n\nThe main candidates for Satoshi are currently:\n\nAdam Back, a U.K. cryptographer.\n\nHal Finney, a now deceased cryptographer who was deeply influential in the creation of Bitcoin.\n\nWei Dai, who was a cryptographer in the late '90s and early 2000s who had worked on an earlier proposal for a digital currency.\n\nNick Szabo, who is a polymath. He's written on all sorts of things from politics to economics, but also has the coding ability to possibly be Nakamoto.\n\nSo there are a handful of top candidates, but there's also the possibility that Satoshi Nakamoto is somebody that we've never heard of and that he basically released this technology on the world and vanished.\n\nPerhaps we'll never know who it is.\n\nDid the direction of the film change as you dug deeper into the story?\n\nIt's a detective story that's still unravelling, so the film was constantly changing and evolving as I discovered new pieces of evidence. I went into this film not knowing who I thought Nakamoto was. I had an idea that it could be probably three or four people.\n\nBut I was thrown for a loop on that and was forced to rethink my conclusions. And the deeper I went into my research, the more I came up with different conclusions.\n\nIn the documentary, I've presented a character whom I strongly believe is Nakamoto. Maybe I'm wrong. But if so, I'd love my critics to prove why."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9jdXN0b2RpYS1iYW5rLWJpdGNvaW4tY3VzdG9kedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Caitlin Long's Custodia Bank launches Bitcoin custody platform - Cointelegraph",
        "content": "Custodia Bank, a cryptocurrency-friendly bank founded by Bitcoin advocate Caitlin Long, has launched its Bitcoin custody platform.\n\nThe firm took to X (formerly Twitter) on Nov. 7 to announce the launch of Custodia Bank’s Bitcoin (BTC) custody service targeting businesses like fiduciaries, investment advisers, fund managers and corporate treasurers.\n\nCustodia Bank started rolling out custody in October 2023 after receiving approval from the Wyoming Division of Banking, Custodia founder and CEO Long told Cointelegraph. \"The regulator conducted the statutorily required pre-launch examination of us,\" the exec said, adding that Wyoming has specific rules that its special-purpose depository institutions must meet before launching custody.\n\nAccording to the bank's website, Custodia Bank operates as Custodia Digital Services in certain U.S. states, including Washington, Minnesota, Texas and others. The bank also operates as Custodia Bank in other states like California and Wyoming. Eligible users include U.S.-based businesses in states the bank is licensed, and which meets Custodia's customer onboarding requirements, Long noted.\n\nCustodia Bank and Custodia Digital Services operations in U.S. states. Source: Custodia\n\nCustodia Bank emphasized that the platform is a non-lending bank built by Bitcoiners that offers segregated custody accounts on its custom-built Bitcoin custody platform.\n\nUnlike the omnibus custody model, the segregated account model for Bitcoin custody is designed to separate customers' assets from the company’s assets, Custodia’s white paper reads. “The omnibus custody model dominates traditional financial markets, with most securities held at central securities depositories like the Depository Trust Company,” the document stated, adding:\n\n\"We offer segregated accounts, which have superior customer protections over competing omnibus accounts that are standard offerings in the digital asset custody industry, and which commingle customer digital assets.\"\n\nCustodia Bank’s approval from the Wyoming Division of Banking follows a series of regulatory challenges for the firm. In January 2023, the Federal Reserve Board rejected the bank’s application to become a member of the Federal Reserve System, saying it was “inconsistent with the required factors under the law.” The Fed subsequently denied Custodia’s request to reconsider its membership application in its system.\n\nRelated: DZ Bank, third-largest German bank, to start crypto custody for institutional investors\n\nIn a detailed report in March 2023, the Fed’s board said the decision to reject Custodia’s application was due to concerns about banks with a high concentration of activities related to the crypto industry. Custodia Bank opened for business in August 2023, though the Fed has blocked much of its proposed business model.\n\nFounded in 2020, Custodia is a bank aiming to bridge the gap between digital assets and the U.S. dollar payments system and a digital asset custodian. The firm was formerly known as Avanti Financial Group and is based in Cheyenne, Wyoming.\n\nMagazine: How to protect your crypto in a volatile market — Bitcoin OGs and experts weigh in"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9yZGluYWxzLWJ0Yy10cmFuc2FjdGlvbi1mZWVzLTUtbW9udGgtcGVha9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Inordinately high — Bitcoin Ordinals send BTC transaction fees to new 5-month peak - Cointelegraph",
        "content": "Bitcoin (BTC) transaction fees are at their highest in nearly six months as a new wave of inscriptions boosts competition for block space.\n\nData from statistics resource BitInfoCharts shows the average BTC transaction fee approaching $6 as of Nov. 7.\n\nOrdinals taking up Bitcoin mempool again\n\nThe return of Bitcoin Ordinals is making its presence felt this week as on-chain transactions attract highly elevated fees.\n\nIn an environment reminiscent of Q2 this year, blockspace is being taken up by ordinal inscriptions.\n\nOrdinals are nonfungible tokens (NFTs) that store data directly on the blockchain. BRC-20 Ordinals can add significant transaction numbers for Bitcoin miners to process on-chain, clogging up the mempool and resulting in more competition for confirmations.\n\nThe result is that higher fees are required, and transactions without them will confirm much more slowly than normal.\n\nBitcoin Ordinals heatmap (screenshot). Source: GeniiData\n\nPer statistics from GeniiData, almost 1 million ordinal “mints” have occurred in the past seven days.\n\nThe most active projects have changed in that time, with the most active minters coming from BEES, gpts and HALV at the time of writing.\n\nBRC-20 coin $RATS is clogging up the mempool, causing a significant rise in Bitcoin transaction fees.\n\n\n\nCan anyone give us more information about this token? pic.twitter.com/O7EAPHy83F — Ordinals Wallet (@ordinalswallet) November 4, 2023\n\nBitcoin’s mempool currently has a backlog of over 120,000 unconfirmed transactions, according to live data from Mempool.space.\n\nBy contrast, at the beginning of October, the queue contained fewer than 30,000.\n\nBitcoin mempool data overview (screenshot). Source: Mempool.space\n\nIncreased profits for BTC miners\n\nDiscussing what might happen to the fee trend next, social media users warned that new minting projects would come to take over once others had completed.\n\nRelated: Elon Musk slams NFTs but ends up arguing the case for Bitcoin Ordinals\n\n$BEES have turned mempool into ordhive\n\nFees are now around 70 sats!!\n\n\n\nWe already had $RATS $FOXS $OWLS $BNBS what’s next?!\n\n\n\nAlso, which Bee Collection will take off now that the token is minted out?! pic.twitter.com/PjMJdzRkyA — pawellwitt.xbt (@pawellwitt) November 6, 2023\n\nfoxs was yesterday, now is the end of bees and next thing coming straight after — Machine 384 (@sascha_bay) November 6, 2023\n\nReaping the benefits, meanwhile, are Bitcoin miners, whose income from fees is rapidly rising.\n\nAccording to on-chain analytics firm Glassnode, for Nov. 6, 8.5% of miners’ revenue came from the increased fee rates — the biggest daily proportion since early June.\n\nBitcoin miner % revenue from fees chart. Source: Glassnode\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWFjY3VtdWxhdGlvbi1pbmNyZWFzZXMtc3VwcGx5LXJlYWNoZXMtMDUyOTEzNzAzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Accumulation Increases as Supply Reaches Historic Low, Supporting Price Stability: Report - Yahoo Finance",
        "content": "Bitcoin Accumulation Increases as Supply Reaches Historic Low, Supporting Price Stability: Report\n\nBitcoin's available supply has reached a new historical low, indicating an accumulation pattern, according to data from Glassnode. The report suggests that Bitcoin's illiquid supply and long-term holders are on the rise, resulting in a tightening supply and increased bullish sentiment.\n\nAccording to Glassnode's data, smaller, long-term holding entities are actively purchasing the available BTC supply, accounting for 92% of newly produced Bitcoin. The accumulating pattern is visible across investor cohorts, with long-term holdings outperforming short-term holders. This limiting of supply is helping Bitcoin keep its price over $34,000, giving strong support above $30,000.\n\nThe growing trust in Bitcoin is not limited to smaller entities; practically all investors have increased their Bitcoin holdings this year. This pattern displays an optimistic market attitude and points to a long-term bullish outlook.\n\nAnother positive indicator is the accumulation of illiquid Bitcoin, which has a limited quantity. Monthly inflows into the illiquid Bitcoin supply continue, with a net gain of 71,000 BTC per month.\n\nLet us know what you loved about this article, what could be improved, or share any other feedback by filling out this short form."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzJiNmFmOThkLWU1NTktNDYxYi05NmM2LWVjMzRiZjJlMmMyONIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Robinhood: bitcoin price rally is no salve for trading woes - Financial Times",
        "content": "Print this page\n\nThink this year’s S&P 500 rally of 15 per cent is pretty good? Take a look bitcoin’s price, which has more than doubled since January.\n\nYet even that has done little to lift the fortunes of Robinhood. The company, whose app allows users to trade a number of cryptocurrencies, has lost four-fifths of its value since hitting a high in 2021. The stock fell another 15 per cent on Wednesday.\n\nThird-quarter earnings underscore how the app is losing its cachet among young traders.\n\nRobinhood’s funded accounts grew by 360,000 year-on-year to 23.3mn. But fewer customers are actively trading. The number of monthly active users fell 16 per cent to just over 10mn compared with the period for the prior year. That is about half the figure reached at the height of the retail trading frenzy two years ago.\n\nThe company’s woes are not shared by all its rivals. Brokerage platform Charles Schwab added 665,000 active accounts during its third quarter. Morgan Stanley, which owns E*Trade, added about 300,000 accounts during the September quarter.\n\nOverall, Robinhood’s transaction-based revenue fell 11 per cent to $185mn during the quarter, amid a sharp drop in crypto and equities trading. It now makes more from its customers’ idle cash. Segregated client accounts hold about $3.5bn of cash and securities. Revenue from net interest income nearly doubled year-on-year to $251mn. Even so, it booked a net loss of $85mn.\n\nThe boost from net interest income should soon diminish. The Federal Reserve appears to have finished raising interest rates. That will make for tougher comparatives in future. This is reflected in Robinhood’s lowly valuation of less than four times revenue. Charles Schwab manages five times.\n\nRobinhood has sought to reinvent itself by branching out into new products such as retirement accounts. But to do so it will compete against established brands like Charles Schwab and Fidelity. It needs to find more arrows in its quiver to draw in more active traders."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMTEvMDcvYml0Y29pbi1ldGZzLWEtc3VyZ2Utb2YtZnJlc2gtY2FwaXRhbC1vci1zcGVjdWxhdGlvbi1mcm9tLWNyeXB0by1pbnNpZGVycy_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzExLzA3L2JpdGNvaW4tZXRmcy1hLXN1cmdlLW9mLWZyZXNoLWNhcGl0YWwtb3Itc3BlY3VsYXRpb24tZnJvbS1jcnlwdG8taW5zaWRlcnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin ETFs: A Surge of Fresh Capital or Speculation From Crypto Insiders? - CoinDesk",
        "content": "While this could mean that capital could be isolated from assets that are usually “floated” by BTC, more money flows into an ETF also means that more of the underlying bitcoin has to be bought. This will create price increases that then raise the value in portfolios that do hold BTC directly. These holders, in turn, will have more money to diversify into other crypto assets."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy9iaXRjb2luLXVzLWVsZWN0aW9uLWNyeXB0by1uZXh0LXByZXNpZGVudC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin in the U.S. Election Race: What Role Will Crypto Play in Deciding Next President? - CCN.com",
        "content": "Key Takeaways\n\nSenator Ted Cruz now accepts Bitcoin donations for his 2024 campaign.\n\nThis move highlights his strong support for cryptocurrencies.\n\nBitcoin enjoys a bipartisan appeal, with several lawmakers hailing its significance.\n\nBut the Biden Administration’s push for SBDC faces skepticism from politicians.\n\nMayors across the US are increasingly opting to receive their salaries in Bitcoin.\n\nThemes like skepticism toward institutions, economic disparity, and increased financial literacy align closely with the surge of Bitcoin in terms of both its value and widespread adoption.\n\nAs Bitcoin reaches its peak value during an American Presidential election cycle, particularly appealing to a demographic with a growing distrust of traditional institutions, it raises curiosity about the potential implications of these trends on the upcoming 2024 U.S. Presidential election.\n\nTed Cruz Embraces BTC Donations for 2024 Campaign\n\nSenator Ted Cruz of Texas has started taking Bitcoin contributions for his 2024 reelection campaign. The Republican senator declared: “I am bullish on Bitcoin and I’m proud to accept Bitcoin campaign donations.”\n\nI am bullish on bitcoin, and I'm proud to accept bitcoin campaign donations.https://t.co/0j5njATP8M — Ted Cruz (@tedcruz) November 6, 2023\n\nThe front page of his official website now features the Bitcoin logo and invites supporters to make cryptocurrency donations.\n\nSeveral presidential contenders declared earlier in the year that they would take Bitcoin donations for their campaigns. Other politicians might very well follow suit if the move proves to be effective. There’s a chance that this will cause attitudes on Capitol Hill to change.\n\nStriving For Bipartisanship In BTC Realm\n\nThe senator is using BitPay, a cryptocurrency payment processor that allows payments in Bitcoin, Ether, BCH, and LTC with the ability to instantly convert to US dollars.\n\nThis makes him one of Congress’s strongest supporters of cryptocurrencies, especially as Texas is becoming a center for Bitcoin mining as a result of China’s 2021 ban on industrial mining.\n\nThe Bitcoin phenomenon may be more bipartisan than most people realize, despite the fact that Republicans have been more outspoken in their support of it.\n\nBe it as it may, a presidential candidate’s views on Bitcoin and crypto are important not only because the president leads the country, but also because the President is responsible for appointing the heads of more than 50 independent federal commissions that can influence various aspects of crypto, including the SEC, CFTC, Federal Reserve and Treasury.\n\nSenators Cynthia Lummis and Kirsten Gillibrand co-sponsored a bill about cryptocurrency. Though it is not a unique instance, this endeavor to legitimise the industry and explain rules in the summer of 2022 finally failed.\n\nAn essay titled “A liberal case for cryptocurrency ” was written in 2022 by Representative Ritchie Torres, for instance. His piece focused on helping the underprivileged and shifting Wall Street’s power dynamics. A few months prior, the article was the result of a legislative endeavor to provide clarification on cryptocurrency exchanges.\n\nEven at the most recent Bitcoin 2023 conference in Miami earlier this year, several lawmakers with varying political affiliations gave speeches. Robert Kennedy, Vivek Ramaswamy, and Tulsi Gabbard—past and present presidential contenders—were among the featured speakers.\n\nBiden Administration Advocates CBDC\n\nEven with the bipartisan support for Bitcoin, the Biden Administration’s push for a central bank digital currency has not convinced many politicians. Ted Cruz mentioned the increasing significance of Bitcoin in a recent audio interview about CBDCs that is available to listen to below.\n\nBiden Admin Urges Israel to STOP\n\nKilling Terrorists, Dems Smear Justice Thomas, and School Choice—the Civil Rights Issue of the 21st Century. @benfergusonshow and I discuss all this and more on this morning’s new episode of Verdict. Don’t miss it!https://t.co/zSt10lQMrs — Ted Cruz (@tedcruz) November 6, 2023\n\nCruz seems to be thinking of CBDCs as an extension of the failed initiatives that led to the creation of the Build Back Better law under the Biden administration. During the interview, he stated that Build Back Better would have mandated that banks notify the government of any transaction above $400.\n\nCruz is mostly worried about the extent of monitoring and control that CBDCs would permit. He concluded that “the federal government has no business monitoring the financial transactions of a free people.”\n\nAccording to the CATO institute, 74% of Americans are against using CBDCs in place of dollars. Support for Bitcoin may increase as a result of people’s opposition to CBDCs and their desire to elude increasing financial control.\n\nUS Mayors Join Bitcoin Payment Trend\n\nFollowing the 2021 election season, mayors of Miami and New York City, representing opposing political parties, decided to accept Bitcoin as payment for their salaries. Several other mayors were spurred to follow suit by this trend.\n\nTwo additional mayors have followed suit after Miami Mayor, Francis Suarez, and New York City Mayor, Eric Adams, declared they would accept their future paychecks in Bitcoin. Jane Castor of Tampa, Florida, and Scott Conger of Jackson, Tennessee, have similar plans for their next city payment.\n\nA group of politicians are attempting to establish their towns as genuine Bitcoin hubs in the United States as a result of game theory, which is increasing the rate and volume of mayors converting their payments into Bitcoin.\n\nWhile state law prohibits the @CityofJacksonTN from paying me in Bitcoin, I’ll follow the lead of @FrancisSuarez & @ericadamsfornyc and instantly convert my next paycheck to #Bitcoin — Mayor Scott Conger (@MayorConger) November 5, 2021\n\nAccording to the mayor, everyone can receive payment in Bitcoin; all they need to do is purchase Bitcoin with their entire wage as soon as it arrives. Since Tennessee law prohibits the city of Jackson from paying him directly in Bitcoin, he can still convert his wage into Bitcoin.\n\nThe Mayor of Tampa likewise expressed her readiness to embrace the same approach, indicating her willingness to join the group of U.S. mayors receiving their payments in Bitcoin.\n\nApologies for coming late to the conversation – we've been busy preparing for today's cryptocurrency conference here in the @CityofTampa . 🪙😏 But I'm certainly up for the challenge! #ForbesTopEmergingTechnologyCity #FloridasTechCapitol #TechTown — Jane Castor (@JaneCastor) November 5, 2021\n\nOther Lawmakers To Join BTC Battle\n\nProponents like Cruz anticipate that more lawmakers will join the battle to support Bitcoin as more people start to recognizeBitcoin its worth in the face of this escalating threat. Washington might hold onto its unyielding beliefs up until that point.\n\nAs Bitcoin continues to gain prominence and considering the importance of the young voter demographic, it will be intriguing to observe how presidential candidates’ positions on cryptocurrency develop and whether they will have an impact on the 2024 American Presidential election.\n\nIt is crucial to closely monitor this, as the legal framework, policies, and regulations will hold significant consequences for the cryptocurrency as an asset class, America’s position in the global economy, and the future of finance."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXN1cHBseS1oZWxkLWxvbmctdGVybS1ob2xkZXJzLWhpdHMtYWxsLXRpbWUtaGlnaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin supply held by long-term holders hits all-time high — Research - Cointelegraph",
        "content": "Data from Glassnode suggests that Bitcoin (BTC) is in an accumulation pattern, with its available supply reaching a new historical low. According to the report, Bitcoin’s illiquid supply and long-term holders are increasing.\n\nAs its supply tightens, available BTC is being purchased by smaller, long-term holding entities.\n\nBitcoin accumulation among a majority of investor cohorts and the bullish conviction of long-term holders have resulted in investors gobbling up “92% of the newly mined supply,” according to the Glassnode analysis."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXRyYW5zYWN0aW9uLWZlZXMtcmVhY2gtNS0xNDA3MTMwMDcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin transaction fees reach 5-month high, Ordinals surpass 38 mln inscriptions - Yahoo Finance",
        "content": "Average Bitcoin transaction fees rose to US$5.93 on Monday, the highest in over five months, amid the latest surge in interest in Ordinals inscriptions.\n\nSee related article: SBF conviction closes “dark chapter” in crypto: Yat Siu\n\nFast Facts\n\nOrdinals, an iteration of non-fungible tokens (NFTs) on the Bitcoin blockchain, recorded US$18.33 million in sales over the past seven days, a 191% weekly surge, according to data from CryptoSlam.\n\nThe rate of Ordinals inscriptions, which has slowed down throughout October, also started to pick up its pace. Ordinals surpassed 38 million total inscriptions on Sunday, according to Dune Analytics data.\n\nThe last time transaction fees on the Bitcoin network were this high was in June, according to BitInfoCharts. June was the last month Bitcoin Ordinals recorded over US$100 million in secondary sales, CrypoSlam data shows.\n\nIn October, Bitcoin Ordinals generated more than US$16 million in secondary sales. November’s running total has already surpassed last month’s record, currently standing at US$18.5 million.\n\nWeekly Ordinals buyers rose 18.4% to 13,176 buyers, while weekly transactions increased by 80.9% to 35,786, according to CryptoSlam.\n\nSee related article: Bitcoin collectibles: a diamond in the rough"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1pbnNjcmlwdGlvbi1udW1iZXItNzYtc2VsbHMtZm9yLSUyNDYwMDAwLWluLWxhdGVzdC1zdWItMTAwLW9yZGluYWxzLXNhbGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Inscription Number 76 Sells for $60000 in Latest Sub-100 Ordinals Sale - Nasdaq",
        "content": "BTC Inc., through its Ordinals-focused division Rare BTC, has brokered the sale of inscription number 76 for 1.7 BTC, which is equivalent to approximately $61,000 at the time of sale.\n\nThe sale is indicative of the active interest and perceived value in the Ordinals space, with Rare BTC positioning itself as a key player in the market for these distinctive bitcoin-based digital artifacts and unique satoshis.\n\nThe bitcoin ecosystem saw Ordinals generate a craze earlier this year, between May and June, with trading volume nearing that seen on Ethereum NFTs and leading to a spike in bitcoin fees. After a somewhat dull summer, Ordinals activity is back and already nearing the highs seen in May. Notably, yesterday public Ordinals trading volume in the preceding 24 hours surpassed Ethereum NFT’s for the first time.\n\nRare BTC specializes in the sale of rare satoshis and Sub-100 Ordinals, considered to be highly sought after in the digital collectibles space. This recent transaction follows a previous successful brokerage by Rare BTC, where inscription number 20 was sold for 3 BTC.\n\nThe company’s role in the Ordinals market includes connecting collectors, artists, and independent brokers to facilitate transactions. BTC Inc.'s established network within the Bitcoin community and its reputation for reliability play a crucial part in completing these sales, particularly as it offers escrow services to ensure secure exchanges between buyers and sellers.\n\nThose interested in acquiring or selling prime Ordinal inscriptions, or seeking brokerage partnerships, can reach out to Rare BTC through their email at rare@b.tc or DM on Twitter (X). Further information about their services and offerings can be accessed on their website.\n\nBitcoin Magazine was a pioneer in the Ordinals space, having inscribed its own historic print magazine covers into the bitcoin blockchain among the first 100,000 inscriptions. The oldest cover, Historic Cover #1, sold for 1.25 BTC at auction.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9yZGluYWxzLXNlZS1yZXN1cmdlbmNlLWJpbmFuY2UtbGlzdGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Ordinals see resurgence from Binance listing - Cointelegraph",
        "content": "Ordinals, a BRC-20 token collection minted on the Bitcoin blockchain, have surged by 40.8% in the past 24 hours to $10.19 after listing on crypto exchange Binance.\n\nAccording to Binance’s Nov. 7 announcement, users can now trade Ordinals (ORDI) against Tether (USDT), Bitcoin (BTC), and the Turkish lira. Binance claims that it did not charge developers any listing fees for the ORDI token and that withdrawals will open on Nov. 8. As part of initial incentives, the first 1,000 users who deposit at least 72 ORDI to the exchange received a 50 USDT trading rebate voucher.\n\n“ORDI is a relatively new token that poses a higher than normal risk, and as such will likely be subject to high price volatility.”\n\nBitcoin Ordinals is a numbering system that assigns a unique number to each individual satoshi, or 1/100 million of a Bitcoin, enabling tracking and transfer. Combined with the inscription process, which adds an additional layer of data to each satoshi, this allows users to mint unique digital assets on the Bitcoin blockchain. The current token listed on Binance, ORDI, is not associated with developers of Bitcoin Ordinals.\n\nInvented by Web3 developer Rodarmor in January, BRC-20 tokens have surged in popularity as one of the largest technological advancements in a 15-year-old blockchain. Self-custody wallet providers, such as BitKeep (now Bitget Wallet), have enabled BRC-20 token deposits and withdrawals since June. The total market cap of BRC-20 tokens currently stands at $1.34 billion.\n\nRelated: Bitcoin Ordinals’ total mintage fees increase 700% from April"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL25ld3MvdWsvaG9tZS1uZXdzL2xvc3QtYml0Y29pbi1jcnlwdG8tamFtZXMtaG93ZWxscy1iMjQwNjUxNy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Robot dogs, AI and the plan to retrieve £165m crypto fortune lost in rubbish dump - The Independent",
        "content": "Get the free Morning Headlines email for news from our reporters across the world Sign up to our free Morning Headlines email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nMorning Headlines email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nA man who lost an estimated £165m of cryptocurrency thrown into a landfill by mistake has unveiled his latest plan to try and get the money back.\n\n“I’ve tried for 10 years to be nice, now we need to go to battle”, James Howells explains as he outlines the next step in his fight with a council to find the hard drive that houses the digital fortune.\n\nThe IT systems engineer has spent a decade trying to convince Newport City Council to help him search for the device that was accidentally thrown away in 2013, but it has repeatedly refused to allow him access to the site.\n\nSo in a last roll of the dice, the 37-year-old has retained a legal team who have written to the local authority this week asking for legal access to the site. If successful, he hopes to employ mechanical arms powered by AI (artificial intelligence) to sift through the site to find the drive.\n\nThe bizarre saga started in 2013 when Mr Howells, put the hardware from an old laptop that contained 8,000 bitcoins, the world’s leading cryptocurrency, in a black bag in his hallway.\n\n“I was doing a clear-out in my office and put a lot of items into a bag which I then placed at the front door of my house,” he said. “I woke up the next morning and my ex-partner had already taken the bags to the landfill site; she thought she was doing me a favour, it wasn’t her fault.”\n\nAfter the unintentional error, the cryptocurrency expert hatched a plan to get back his lost millions by getting together a crack team of environmental health and data recovery experts.\n\nAs part of the plan, his team would utilise AI to operate a mechanical arm in sorting the mounds of rubbish. Each piece of detritus would then be sifted through by hand in a nearby pop-up tent.\n\nSecurity had been considered by the IT systems engineer who wanted to utilise robot dogs to make sure opportunistic thieves could not steal his discarded hard drive.\n\nMr Howells outside the landfill site in Docks Way where he believes his hard drive full of cryptocurrency is buried (Wales News Service)\n\nBut despite his schemes, there remains a stumbling block. The local council refuses to give permission to access the landfill site, despite Mr Howells saying he would cover any costs related to the search.\n\n“Over the last 10 years I’ve always tried to engage with Newport City Council in a businesslike manner, they are the site owner, they are the operator, they own the permit for the landfill, so I’ve always wanted to be friends with them and work with them,” he said.\n\n“And to do that I’ve always tried to build a bigger, better team to try and impress them and finally engage with me.”\n\nHowever, his requests to meet with the council’s senior leadership were not successful, so he has now taken the next step in his fight and retained a legal team.\n\nIf Mr Howells does manage to recover his lost millions, he wants to turn Newport into the UK’s first “crypto hub” and gift its 160,000 residents £50 in bitcoin each. A city council report in 2021 found that a quarter of areas in Newport were in the most deprived 10 per cent in Wales.\n\n“The idea is then people will have to learn how to use bitcoin, and that will then help them themselves going forward in the future,” he said.\n\n“We will also set up a blockchain education centre in Newport city centre which will be open with a five-year commitment where anybody can come in face to face and have a sit-down… it’s scary going on a phone to learn about crypto but if you have somebody face to face to teach you and show you to ropes, so to speak, it’ll be a little bit easier.”\n\nMr Howells is now speaking to lawyers about how to progress his case (Wales News Service)\n\nHe also wants to install crypto point-of-sale devices in all the independent stores in Newport, so the local community “can use the coins and we can get a crypto economy going in South Wales”.\n\nMr Howells’s legal team wrote to the council on 6 September asking for access to the site and it has two weeks to respond, before a possible escalation in the courts.\n\n“Until the door is fully slammed shut by a court, then I will continue trying, as I have over the last 10 years ... the court is the last step for me, I am no longer asking Newport City Council for access, I am now going to be asking a judge for access.”\n\nThe price of bitcoin fluctuates but the value of Mr Howells’s coins at the time of writing was £165m.\n\nA spokesperson for the authority said: “Newport City Council has been contacted multiple times since 2013 about the possibility of retrieving a piece of IT hardware said to contain bitcoins, which may or may not be in our landfill site.\n\n“The council has told Mr Howells multiple times that excavation is not possible under our environmental permit, and that work of that nature would have a huge negative environmental impact on the surrounding area.\n\n“The council is the only body authorised to carry out operations on the site.\n\n“We have been very clear and consistent in our responses that we cannot assist Mr Howells in this matter. Our position has not changed.\n\n“We will be offering no further comments on this issue as it takes up valuable officer time which could be spent on delivering services for the residents of Newport.”"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy9zdG9jay1tYXJrZXQvbWFya2V0LXNlY3RvcnMvZmluYW5jaWFscy9jcnlwdG9jdXJyZW5jeS1zdG9ja3Mv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Best Cryptocurrency Stocks for 2024 - The Motley Fool",
        "content": "Cryptocurrencies have quickly become a hot investment that is gaining mainstream adoption. Markets for digital currencies such as Bitcoin (BTC -3.71%) were virtually unheard of in 2012, but it has since grown into a massive industry.\n\nImage source: The Motley Fool\n\nThe cryptocurrency sector reached a peak market value of $3 trillion in fall 2021. The sudden surge in value and rapid evolution created immense wealth for early crypto investors. As a result, there is huge interest in finding and investing in the next cryptocurrency unicorn. With more than 20,000 different cryptocurrencies on the market -- and the world having been pushed further into the digital realm by the COVID-19 pandemic -- investing in technologies linking the digital blockchain space with society could be even more lucrative than guessing which token will become the next Bitcoin or Ethereum (ETH -3.52%). And there is no shortage of innovative companies trying to bridge the gap between the two.\n\nDigital currency companies hold major potential The original idea behind blockchain technology -- a digital ledger that automatically tracks transactions between parties and confirms ownership of a crypto asset -- was to create a borderless, peer-to-peer electronic cash payment system that's efficient and secure. Investors can certainly purchase cryptos themselves, perhaps by buying small amounts of several different cryptocurrencies. But a better way to gain exposure to the sector is to invest in bigger and more established companies that benefit from the increased popularity of blockchain and crypto assets. The revenue that crypto service providers are deriving from blockchain tech has explosively grown over the past few years. Companies that adopt blockchain technology, especially in finance, may gain a considerable edge over traditional competitors in processing payments. And brokers offering digital assets may attract more customers than exchanges offering traditional assets such as stocks and bonds. However, the sector is subject to sharp market swings. Its peak value of $3 trillion slipped to less than $1 trillion in June 2022 as rising inflation drove many investors away from high-risk investments. This was not the crypto market's first gigantic plunge, and it probably won't be the last. Every investment is subject to risks, and you should only invest money you don't need in the short term. That guidance is even more important in the highly volatile crypto sector. In keeping with that guidance, here are some of the best cryptocurrency stocks to consider:\n\n1. Coinbase Global Coinbase Global (COIN -8.6%), a top cryptocurrency trading exchange, made its initial public offering (IPO) in April 2021. The company is a popular platform for purchasing major cryptocurrencies such as Bitcoin, Ethereum, and Cardano (ADA -0.93%), allowing users to trade more than 250 altcoins. The Coinbase platform’s success has been contingent on the increase in crypto prices, which in turn has led to millions of new users creating accounts. Coinbase earns a small transaction fee whenever someone buys or sells a cryptocurrency. But the company aspires to be more than just a place to trade. It also sponsors a debit card that allows consumers to spend from the balance in their digital wallet, and it’s launched a cloud platform for companies using and storing digital currencies. Coinbase offers two game-changing innovations. The first is bringing the practice of asset loans -- which were previously only available to affluent investors -- to the masses. Users can pledge their Bitcoin or other cryptocurrencies as collateral and receive a low-interest loan to cover expenses. Using crypto as collateral means investors don’t have to sell their assets when emergencies arise, allowing their principal to continue compounding while they deal with matters at hand. The second innovation is the rising adoption of Coinbase’s blockchain analytics by governments and financial institutions. Because most blockchains operate on a public ledger, the company can harness and monitor the data for illicit transactions and wallet addresses. Suppose hackers managed to break through an individual's computer and demand ransom in the form of Bitcoin to unlock the machine. In that case, Coinbase could then match the hacker's wallet address with millions of know-your-customer (KYC) data points stored on its platform. This could help law enforcement track down the flow of funds and apprehend the cybercriminals -- building greater trust in the crypto space.\n\n[Cryptocurrency] is a new asset class, but like real estate, there's only so much Earth. So it's defined, and therefore this moving price of the commodity is just how much, within this finite class of a commodity, this new asset class, how much people value it or want it. David Gardner, co-founder, The Motley Fool\n\n2. Block and PayPal Holdings At the heart of every digital payment protocol is the absence of central intermediaries (and therefore, lower costs for businesses and consumers). So Block (SQ -4.98%) (formerly Square) and PayPal (PYPL 2.05%) saw a meaningful business opportunity in enabling users to purchase and hold cryptocurrencies within a digital wallet. In late 2017, Block’s Cash App consumer-facing application began allowing Bitcoin trading. In 2020 and 2021, Bitcoin was a huge revenue generator for Block, although the trading feature did little to help the company’s bottom line. However, the company is helping to foster the use of Bitcoin among its business users (through the Block ecosystem), and it could become a top platform for crypto transactions between companies and their customers. This is especially promising for disrupting traditional international transactions in which banks often charge hefty foreign exchange fees. Cash App added support for the Bitcoin Lightning network in April 2022, allowing customers to transfer Bitcoin much faster and without transaction fees. CEO Jack Dorsey said the feature will “increase the usability of Bitcoin all toward an open global monetary transmission network the world can trust.” PayPal’s Venmo digital wallet and peer-to-peer payments app, which unlocked crypto trading in early 2021, offer a similar mix of simple banking features and mass-market crypto-trading tools. At the launch, Venmo supported the trading of Bitcoin, Bitcoin Cash (BCH -0.46%), Ethereum, and Litecoin (LTC -2.56%). With the most users of any peer-to-peer money movement app, Venmo could become a leading cryptocurrency platform with its new feature. It serves as a solid access point for investors who wish to buy major cryptocurrencies and then use them to purchase altcoins or access decentralized finance (DeFi) applications. 3. Canaan and Hut 8 Mining Bitcoin mining has changed dramatically over the past few years. These days, companies such as Canaan (CAN -6.57%) design high-powered, application-specific integrated circuit (ASIC) machines specifically for the purpose of brute-force guessing the network's correct hash (passcode). Canaan's next-generation Avalon ASICs can make tens of trillions of guesses every second for the right hash to validate blocks on the Bitcoin network, which is millions of times more powerful than AMD (AMD -1.79%) and Nvidia's (NVDA -4.45%) latest graphics processing units (GPUs) for this hyper-specific purpose. Sales have been skyrocketing due to the device's affordability and relatively low energy consumption, meaning greater profits for miners. One of the most popular Bitcoin mining stocks is Hut 8 Mining (NASDAQ:HUT). The company, based in Canada, commands a sizable minority stake on the overall Bitcoin network, and it generates very strong cash flows compared to revenue. Instead of selling the Bitcoin it mines on the market, Hut 8 Mining maximizes returns for shareholders by lending them out and farming yields, leading to compounded returns. Furthermore, investors can be assured that environmental concerns regarding the practice won't hold the company back. Hut 8 Mining uses a mix of wind, solar, and natural gas sources for its electricity, with decade-long leases.\n\n4. Nvidia and AMD Chipmakers Nvidia and AMD don’t deal with cryptocurrencies directly, but the two semiconductor companies are the leading designers of graphics processing units (GPUs). Best known for powering high-end video game graphics, GPUs now enable computing-intensive applications such as data centers, artificial intelligence, and the creation of crypto assets. Cryptography and blockchain creation require immense computational power, and GPUs are well-suited for the job. Back in 2018, booming cryptocurrency prices were a driving force for Nvidia and AMD stock price increases as digital currency miners (people using their computers to create new units of digital assets) scrambled to purchase GPUs for the task. GPUs remain a fundamental piece of hardware for creating and managing crypto assets. Nvidia even launched a new lineup of chips specifically for crypto mining in early 2021. Both Nvidia and AMD look to further cement their positions as leaders in chip technology through acquisitions. Nvidia recently tried to purchase ARM Holdings, which licenses chip architecture design for data centers and smartphones, and AMD wanted to acquire field-programmable chip leader Xilinx. Nvidia had to give up on its ARM deal, but AMD completed its Xilinx buyout in February 2022. With or without the acquisitions, Nvidia and AMD are poised to continue taking market share of the semiconductor industry and are leading the way in developing more emerging technologies such as blockchain ledgers. 5. Meta Platforms and Shopify Facebook parent Meta Platforms (META -0.2%) attempted to develop a new cryptocurrency called Diem (formerly Libra). Diem was envisioned as a global financial payment and infrastructure platform accessible to everyone, including almost one-third of the global population without bank accounts. The project had some setbacks, including losing Visa (V 0.43%), Mastercard (MA 0.76%), and PayPal from its consortium of high-profile members. Government regulators expressed skepticism about Diem since cryptocurrency is still largely unregulated, and Meta eventually sold its control of Diem for $200 million. Nevertheless, work on the project is continuing under the new ownership, and Meta is reportedly considering different options for entering the cryptocurrency market. The company certainly wants to control part of the blockchain infrastructure behind its ambitious Metaverse vision. E-commerce infrastructure and software provider Shopify (SHOP -0.86%) allows merchants using its platform to accept cryptocurrencies as payment. It recently deepened its capability by integrating with cryptocurrency payments processor CoinPayments. In the spring of 2020, Meta’s Facebook Shops was announced as a new offering for small business e-commerce, with Shopify as a third-party software provider powering the new online stores. Together, Meta and Shopify are primed to benefit if the adoption of digital assets continues among small businesses and entrepreneurs.\n\n6. Robinhood Markets Robinhood Markets (HOOD 6.85%) is a popular discount brokerage app that allows users to buy stocks, options, rare metals, and now, cryptocurrencies. Investors can buy and sell more than a dozen cryptocurrencies, including Bitcoin, Ethereum, and Dogecoin (DOGE 2.53%), commission-free on the platform 24/7. The company already holds billions of dollars in crypto assets under custody, with crypto trading revenue now comprising a significant portion of overall sales. Robinhood can combine its commission-free model with scaling the number of cryptocurrencies on the platform, gaining a massive competitive advantage over both traditional and decentralized exchanges. The company also could offer the same crypto analytics services as Coinbase to further promote trust in the sector and boost its adoption. 7. CME Group CME Group (CME -0.52%) operates the world’s largest financial derivatives exchange allowing investors to trade futures, which bet on the future price of an asset, and options, which grant investors the option to sell or buy an asset in the future at a predetermined price. CME Group's exchange trades a diverse assortment of assets, including agricultural and mining products, energy, stocks, and currencies. It’s the latter that makes CME Group a crypto stock. At the end of 2017, CME established the first market for Bitcoin futures. At the start of 2020, the company created a market for options on Bitcoin futures. As of March 2022, Ether (units of the crypto platform Ethereum) also had futures available on the exchange. Both Ether and Bitcoin futures were joined by micro futures this year, based on smaller slices of the underlying cryptocurrencies. Establishing a full-featured exchange for derivatives of the best-known cryptocurrencies has given Bitcoin and Ethereum some extra legitimacy and provided a way for digital currency owners (both individuals and a growing list of businesses that accept cryptocurrencies as payment) to mitigate risk from changes in cryptocurrency prices. Cryptocurrency derivatives are still a small market for CME Group, but adding more exchanges for crypto assets in the future is possible -- and even likely.\n\nRelated crypto topics\n\nThe beauty of crypto stocks The best part about cryptocurrency stocks is that most of them are not pure plays on the industry, giving investors the reward of ample diversification. Cryptocurrencies are quite volatile and can cause wild swings in the revenue and earnings of companies with sector exposure. The crypto realm is rapidly gaining mainstream adoption. In August 2021, United Wholesale Mortgage (UWMC -1.3%), the second-largest mortgage lender in the U.S., announced it would accept Bitcoin to settle mortgage payments from its customers. Expect further momentum in crypto stocks as more companies join in the blockchain revolution. At the same time, you need to keep an eye on the evolving regulatory framework while the crypto market adapts to the ever-changing global economy. The stocks mentioned above are smart investments in digital currencies, and most of them come with the benefit of also running significant business operations outside the crypto sector. As such, many investors find that they make more sense than buying the cryptocurrencies themselves, at least until regulators and governments around the world have nailed down their long-term approach to digital assets."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNob3J0LXNxdWVlemUtYnRjLXByaWNlLTM1LTktay1vadIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin 'short squeeze' sends BTC price to $35.9K as OI stays elevated - Cointelegraph",
        "content": "Bitcoin (BTC) saw classic BTC price volatility into the Nov. 7 daily close as a “short squeeze” took the market near $36,000.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin hits “key” short squeeze price\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it reacted amid highly elevated open interest (OI) on exchanges.\n\nPreviously, Cointelegraph reported on the more than $15 billion in OI being apt to spark a fresh round of volatility. Some feared that BTC price downside would result, with the ultimate direction unknown.\n\nIn the end, shorts felt the heat as Bitcoin made swift gains to top out at just below $35,900.\n\nAnalyzing the situation before the move, popular trader Skew and others predicted the event in advance. Skew argued that momentum would increase quickly should $34,800 return — a sequence of events that then came true.\n\n“Open interest still building up & looking more like shorts have a higher float in the OI build up here. $34,800 ~ key price for a squeeze,” he told X subscribers.\n\nYup there was a significant rise in OI overnight- it seems to be more of the same- shorts aping into passive bids here at the local lows.\n\n\n\nWe have a big rise in OI, perp takers net selling, funding decreasing, and limit bids being filled. A recipe for a nice squeeze up. https://t.co/IgwSR5dIo9 pic.twitter.com/F82fmNnw7F — CrediBULL Crypto (@CredibleCrypto) November 7, 2023\n\nOn-chain monitoring resource Material Indiators repeated a previous assertion that $36,000 would stay out of reach this week.\n\n“You can never say, ‘Never’ in this game, but based on the latest Trend Precognition signals, I’d be very surprised to see BTC move above $36k before the Weekly candle close,” part of a post-move X post read, referring to one of its proprietary trading indicators.\n\nBTC/USDT order book data for Binance as of Nov. 7. Source: Material Indicators/X\n\nFellow trader Daan Crypto Trades, meanwhile, eyed what he described as “an interesting shift” in derivatives composition.\n\nTraders on the largest crypto exchange, Binance, were positioning themselves bearishly compared to exchange Bybit, he noted, but a “long squeeze” was far from certain.\n\n“Bybit perpetuals have consistently traded higher than Binance. There’s been a clear long interest on Bybit while Binance has been more short orientated during this range,” he summarized.\n\nAn accompanying chart compared the two exchanges’ BTC/USDT perpetual swap pairs, showing Binance trading lower after the short squeeze.\n\n“Will be very interesting to see how this resolves,” he concluded.\n\n“One thing is clear and that’s that Bybit traders are more bullish than Binance traders.”\n\nBinance vs. Bybit Bitcoin perpetual swaps chart. Source: Daan Crypto Trades/X\n\nMajor BTC futures OI flush still to appear\n\nFinancial commentator Tedtalksmacro showed the impact of the squeeze on Binance, where short open interest disappeared.\n\nRelated: Inordinately high — Bitcoin Ordinals send BTC transaction fees to new 5-month peak\n\nBTC shorts obliterated.\n\n\n\nAll of the OI built up earlier today ~$350MM USD, wiped in minutes. https://t.co/E8Ev1lsBWe pic.twitter.com/tHU25fTUt0 — tedtalksmacro (@tedtalksmacro) November 7, 2023\n\nBTC/USD traded at $35,300 at the time of writing on Nov. 8, with OI still beyond $15 billion, per data from on-chain monitoring resource CoinGlass.\n\nBitcoin futures open interest chart (screenshot). Source: CoinGlass\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9nbG9iYWxlY3J5cHRvLXJldm9sdXRpb25pemVzLWJpdGNvaW4tbWluaW5nLWRpdmVyc2UtMTc0NTAwNTAwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "GlobaleCrypto Revolutionizes Bitcoin Mining with Diverse Service Solutions and Cutting-Edge Hardware - Yahoo Finance",
        "content": "GlobaleCrypto\n\nLondon, UK, Nov. 07, 2023 (GLOBE NEWSWIRE) -- In the rapidly evolving landscape of cryptocurrency, GlobaleCrypto is making waves as the go-to solution for Bitcoin mining. As the value of Bitcoin skyrockets and the upcoming halving event approaches, GlobaleCrypto provides an accessible entry into the world of cryptocurrency mining, ensuring consistent profits, superior hardware, and top-tier security.\n\n\n\n\n\nUnderstanding Bitcoin Mining\n\nBitcoin mining plays a fundamental role in the operation of the cryptocurrency. It's the process by which transactions are verified and recorded on the blockchain, and it involves the creation of new bitcoins. Miners use powerful hardware and complex algorithms to validate these transactions and, in the process, secure the network. This crucial work prevents fraudulent techniques like double-spending, ensuring the integrity of the blockchain.\n\nEssential Mining Hardware\n\nSuccessful Bitcoin mining requires potent hardware, and over time, the bar has been raised to meet the escalating difficulty levels. While miners initially used graphics processing units (GPUs), application-specific integrated circuits (ASICs) have taken the lead due to their superior hashing power and energy efficiency.\n\nGlobaleCrypto recognizes the importance of efficient hardware and offers a range of high-powered mining machines, including top models such as Antminer S19 and S19 Pro. These machines provide exceptional hashing power, increasing the likelihood of solving a block and reaping the rewards.\n\nDiverse Service Solutions\n\nWhat sets GlobaleCrypto apart is its diverse range of stable and intelligent hash rate service solutions. With a robust business model encompassing cloud mining, miner hosting, and self-mining, the company expertly navigates market volatility. This enables the seamless vertical integration of the global digital asset mining industry.\n\nCutting-Edge Mining Machines for Diverse Potential\n\nA significant factor setting GlobaleCrypto apart is its curated selection of cutting-edge mining machines. These machines aren't just assets; they are tools designed to offer diverse potential for users across various plans :\n\nStory continues\n\nBitcoin Antminer S19 PRO Hyd: This machine guarantees a daily mining potential of $7.21 for single-day durations, harnessing the power of high mining efficiency.\n\nBitcoin Antminer S19 XP: Standing out with a potential of $51 over a couple of days, this machine is prized for its energy-efficient design and consistent performance.\n\nBitcoin Avalon-1366: Offering a daily mining potential of $53.50 for 7 days, this machine serves as an accessible entry point for cloud mining enthusiasts.\n\nBitcoin Whatsminer M50S 130T: For those seeking a medium-range option, this machine is an excellent choice, offering a daily potential of $83.02 for 15 days.\n\nBitcoin Avalon-1366I: Combining energy efficiency with dependable performance, this machine provides a daily mining potential of $119.12 over 30 days.\n\nBitcoin Antminer S19j XP: Promising high mining efficiency and profitability, this machine offers a potential of $315 over a month.\n\nBitcoin Antminer S19 PRO HYD: Standing out with a potential of $684 over 30 days, this machine is prized for its energy-efficient design and consistent performance.\n\nBitcoin Antminer S19 XP HYD: An excellent choice for investors, this machine offers an earning potential of $41,916 in 42 days.\n\nBitcoin Antminer S19 XP HYD: Finally, this machine promises high mining efficiency and profitability, offering a potential of $12,060 over a 60-day period.\n\nGlobaleCrypto's commitment to offering a diverse range of mining machines ensures that users across different plans can unlock the full potential of Bitcoin mining while maximizing their returns.\n\nBitcoin Mining Advantages\n\nBitcoin mining is not just about creating new bitcoins; it plays a vital role in maintaining the network's integrity and security. By validating transactions and adding them to the blockchain, miners prevent fraudulent activities like double-spending, ensuring the trustworthiness of the cryptocurrency.\n\nGlobaleCrypto's Cloud Mining Solution\n\nGlobaleCrypto's cloud mining platform offers a practical and accessible solution to the hurdles posed by the steep upfront costs of mining hardware. By renting computational power from GlobaleCrypto's state-of-the-art machines, users can engage in Bitcoin mining without the complexities of direct ownership and maintenance.\n\nThis streamlined approach enables users to focus on mining while leaving the technical intricacies to experts. Moreover, GlobaleCrypto's platform ensures secure and dependable mining, incorporating SSL encryption, the choice for two-factor authentication (2FA), and a unique two-tier recommendation system rewarding both direct referrals and the sales generated by those referrals.\n\nJoin the Bitcoin Revolution with GlobaleCrypto\n\nNow, more than ever, Bitcoin enthusiasts can explore innovative approaches to BTC acquisition, and GlobaleCrypto is leading the way. With a diverse range of investment plans that can start with as little as $7 , GlobaleCrypto is your gateway to consistent profits and robust security in the world of Bitcoin mining. Don't miss this opportunity to be part of the Bitcoin revolution with GlobaleCrypto.\n\nWebsite: https://GlobaleCrypto.com\n\n\n\nDisclaimer: The information provided in this press release is not a solicitation for investment, or intended as investment advice, financial advice, or trading advice. It is strongly recommended that you practice due diligence (including consultation with a professional financial advisor) before investing in or trading securities and cryptocurrency.\n\nCONTACT: For media inquiries, please contact: Zack Rios Email: bussiness(at)globalecrypto.com Website: https://GlobaleCrypto.com\n\n\n\n"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzA3L2JpdGNvaW4tc3F1ZWV6ZXMtdG8tMzU1ay1hcy1taW5pLWFsdGNvaW4tc2Vhc29uLWxpZnRzLWNyeXB0by1tYXJrZXQtY2FwLXRvLTEzLXRyaWxsaW9uL9IBhwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzExLzA3L2JpdGNvaW4tc3F1ZWV6ZXMtdG8tMzU1ay1hcy1taW5pLWFsdGNvaW4tc2Vhc29uLWxpZnRzLWNyeXB0by1tYXJrZXQtY2FwLXRvLTEzLXRyaWxsaW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Squeezes to $35.5K as 'Mini Altcoin Season' Lifts Crypto Market Cap to $1.3 Trillion - CoinDesk",
        "content": "\"November represents yet another solid month for aggressive accumulation of bitcoin, with an extended plan to distribute, reduce exposure, and reallocate to altcoins once the cat’s out of the bag,\" Lunde added."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9wZW4taW50ZXJlc3QtMTViLWFuYWx5c3Qtd2FybnMtMjAtYnRjLXByaWNlLWRpcNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin open interest passes $15B as analyst warns of 20% BTC price dip - Cointelegraph",
        "content": "Bitcoin (BTC) fell toward $34,500 on Nov. 7 as analysts’ attention turned to mushrooming open interest.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nOpen interest “surge” spooks Bitcoin pundits\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price struggling to reclaim $35,000 as support.\n\nThe largest cryptocurrency lacked clear direction into the Wall Street open, but market participants predicted that volatility would soon return.\n\nThe reason, they said, was a sharp increase in open interest (OI) on derivatives markets.\n\n“Almost 10k BTC (~$350MM USD) in open interest added today. Fireworks soon,” financial commentator Tedtalksmacro predicted on Nov. 7.\n\nAs Cointelegraph reported, open interest reaching elevated levels has coincided with bouts of volatility in recent months.\n\nCurrent levels totaled nearly $15.5 billion at the time of writing, per data from CoinGlass. James Van Straten, research and data analyst at crypto insights firm CryptoSlate, described the fluctuations as “noticeable.”\n\n“The CME exchange, preferred by institutional investors, has achieved a new record in open interest, with 105,380 BTC contracts open, valued at $3.68 billion. Binance has edged past this figure with open interest of approximately 113,500 BTC,” he noted.\n\n“This trend points to increasing involvement in Bitcoin futures, hinting at either a positive shift in market mood or a move towards protective strategies by investors.”\n\nBitcoin futures open interest chart (screenshot). Source: CoinGlass\n\nThe sense of uncertainty over how the OI phenomenon would play out was shared by J. A. Maartunn, a contributor to on-chain analytics platform CryptoQuant.\n\nBitcoin - Low Timeframe\n\n\n\nThe Open Interest on #Bitcoin futures is ramping up. Certain apes are taking significant positions, but it's unclear to me whether they are going short or long. pic.twitter.com/47anTWRAaA — Maartunn (@JA_Maartun) November 7, 2023\n\nIn an analysis on Nov. 6, he suggested that OI was now in a territory that had previously seen 20% BTC price drawdowns.\n\n“Historically, whenever this metric surpassed $12.2 billion, it resulted in a minimum 20% decline in bitcoin price,” he wrote on X, saying that OI deserved “significant attention.”\n\nBTC/USD annotated chart with OI. Source: J.A. Maartunn/X\n\nAnalysis: $36,000 BTC price “off the table” this week\n\nContinuing the coverage, popular trader Skew referenced the significance of current price levels on low timeframes.\n\nRelated: Inordinately high: Bitcoin Ordinals send BTC transaction fees to new 5-month peak\n\nWhoever is “wrong” on direction, he told X followers, would face difficulties, fuelling a potentially volatile price reaction.\n\n$BTC\n\nLooking like a short covering bounce here\n\n\n\nSome OI coming off the lows too here https://t.co/R7fglUGthX pic.twitter.com/S6d0QuhCTi — Skew Δ (@52kskew) November 7, 2023\n\nLooking ahead, monitoring resource Material Indicators concluded that $36,000 would remain the ceiling for the time being.\n\n“Calling a local top at $36k doesn’t mean >$36k is off the table this year, but the metrics I’m looking at indicate that at the very least, it’s off the table for this week,” it said in its Nov. 6 analysis on X.\n\n“That call also doesn't mean price will free fall back to the prior $25k-$28.5k range, but if a bull breakout isn’t validated this month, that range low is critical.”\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9uZXctYnRjLXByaWNlLWxldmVscy1iaXRjb2luLWF2b2lkcy0zNmvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "New BTC price levels to watch as Bitcoin avoids $36K - Cointelegraph",
        "content": "Bitcoin (BTC) has new short-term BTC price targets as consolidation mixes with bouts of volatility.\n\nAfter a classic “short squeeze” took the largest cryptocurrency to near $36,000, Bitcoin market participants are highlighting key levels to look for from Nov. 8 onward.\n\nBitcoin buy liquidity inches down to $34,000\n\nBitcoin is facing hurdles overcoming resistance at the $36,000 mark, and several attempts to clear it have quickly faded, data from Cointelegraph Markets Pro and TradingView shows.\n\nNow, sellers are becoming active on intraday timeframes, and data from exchange order books shows the buy side getting cautious.\n\nIn a. Nov. 8 X post, on-chain monitoring resource Material Indicators highlighted support liquidity heading lower — from $34,500 to $34,000.\n\n“The Bitcoin Gameboard is Changing,” it wrote in part of accompanying commentary.\n\nA snapshot of the BTC/USDT order book on Binance also confirmed $36,000 receiving additional sell liquidity after declining during the prior day’s tap of $35,900. $40,000 remained the crunch psychological barrier.\n\nBTC/USDT order book data for Binance. Source: Material Indicators/X\n\nWith $34,000 now a potential battleground should sell-side pressure push the market lower, popular trader Daan Crypto Trades eyed lines in the sand to the upside.\n\nThese came in the form of $35,000 and $35,000 — the site of liquidity that could serve to replicate the short squeeze should bulls gain the upper hand.\n\n“Clear liquidation clusters located around $35K & $35.7K,” he wrote about Binance BTC/USDT perpetual swaps.\n\n“Expect a bit of a squeeze to occur if either of these levels are tagged.”\n\nBTC/USDT perpetual swap liquidity chart. Source: Daan Crypto Trades/X\n\nSummarizing the spot and perp status quo, fellow trader Skew concluded that spot bidders were needed to give the market a chance of further upside.\n\n$BTC Market Data thread\n\n\n\nBinance Spot orderbook\n\n\n\nClear quoted range from liquidity perspective after high volume spot buying yesterday\n\n\n\nnote lack of spot volume currently\n\n\n\nBinance Futures orderbook\n\n\n\nvery thick bid depth & high short float led to the short squeeze yesterday as… pic.twitter.com/OUzfdRdl9q — Skew Δ (@52kskew) November 8, 2023\n\nAnalysis: $33,700 “most bearish” BTC price scenario\n\nIn a characteristically optimistic take, meanwhile, trader and analyst Credible Crypto stated that Bitcoin returning below $33,700 was unlikely.\n\nRelated: Exchange flow gap hits 10K BTC — 5 things to know in Bitcoin this week\n\nUpdating X subscribers on two BTC price scenarios, he suggested that $34,500 would, in fact, hold as support.\n\n“In my ‘most bearish’ low timeframe scenario, I don't expect we see below 33.7k,” he wrote.\n\n“In other words- no matter how this plays out in the coming days I think downside is extremely limited.”\n\nCredible Crypto added that hints as to the outcome of current conditions should be expected within “the next day or two.”\n\nBTC/USD 1-hour chart. Source: TradingView\n\nAs Cointelegraph reported, longer-term BTC price perspectives give bulls cause for celebration. Even year-end targets include $45,000 or more, with the upcoming block subsidy halving a source of optimism in itself.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDcvYml0Y29pbi1vcmRpbmFscy1wcm90b2NvbC10b2tlbi1vcmRpLXJvY2tldHMtNTAtb24tYmluYW5jZS1saXN0aW5nL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTEvMDcvYml0Y29pbi1vcmRpbmFscy1wcm90b2NvbC10b2tlbi1vcmRpLXJvY2tldHMtNTAtb24tYmluYW5jZS1saXN0aW5nL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Ordinals Protocol Token ORDI Rockets 50% on Binance Listing - CoinDesk",
        "content": "The Ordinals protocol allows users to embed data into the Bitcoin by inscribing references to digital art into small Bitcoin-based transactions. The protocol was released in April after the introduction of the Bitcoin Request for Comment (BRC-20) token standard, which allowed users to issue transferable tokens directly through the network. That quickly spurred a collection of digital artwork and meme tokens built on Bitcoin in the weeks afterward."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGVjcnlwdC5jby9yZXNvdXJjZXMvd2hhdC1hcmUtb3JkaW5hbHMtYS1iZWdpbm5lcnMtZ3VpZGUtdG8tYml0Y29pbi1uZnRz0gFWaHR0cHM6Ly9kZWNyeXB0LmNvL3Jlc291cmNlcy93aGF0LWFyZS1vcmRpbmFscy1hLWJlZ2lubmVycy1ndWlkZS10by1iaXRjb2luLW5mdHM_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "What Are Ordinals? A Beginner's Guide to Bitcoin NFTs - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEarn a free on-chain NFT by taking our free course, Crypto Investing: Fundamentals First. Decrypt will cover gas fees for the first 10,000 mints!\n\nOrdinals are taking Bitcoin by storm. Ordinal Inscriptions, similar to NFTs, are digital assets inscribed on a satoshi, the lowest denomination of a Bitcoin (BTC). Inscribing on satoshis, named after the pseudonymous creator of Bitcoin, Satoshi Nakamoto, is possible thanks to the Taproot upgrade launched on the Bitcoin network on November 14, 2021.\n\nWhat is an Ordinal Inscription?\n\nAD\n\nAD\n\nBitcoin developers have worked to bring non-fungible tokens or NFTs to the number one blockchain for nearly a decade, beginning in 2014 with Counterparty, the creators of the Rare Pepe NFT collection, followed by Stacks in 2017. The Inscription process writes or inscribes the data of the content stored into the witness of the Bitcoin transaction. The witness was introduced in the SegWit upgrade to the Bitcoin network in 2017.\n\n“What the team came up with Ordinals is genius,” Alex Miller, CEO of Hiro, a developer for layer-2 smart contract platform Stacks, told Decrypt in an interview. “It’s super core to the Bitcoin ethos in that they basically took several different things and pieced them together in a way the original creators did not foresee or expect.”\n\nThe first step in the creation of Ordinals is users downloading Bitcoin Core and syncing the node to the blockchain. After the sync is completed, the next step is to create an Ordinals wallet and send some satoshis to the wallet.\n\nHow did we get to this point?\n\nLaunched in 2017, Segregated Witness or SegWit fixed a host of bugs in Bitcoin Core, allowing more transactions per block, and laid the groundwork for Layer 2 payment channels like the Bitcoin Lightning Network. SegWit caused heated debate in the Bitcoin community and led to a hardfork of the network resulting in the launch of rival blockchains, Bitcoin Cash and Bitcoin Satoshi’s Vision, also known as Bitcoin SV.\n\nWhile detractors may view Ordinals as abusing the network, Ordinals developer Casey Rodarmor says these claims are unfounded.\n\nWith Taproot, all parties in a transaction can cooperate to make these complex transactions look like standard, person-to-person transactions. They do so by combining their public keys to create a new public key and combining their signatures to create a new signature. It does this through a device called Schnorr signatures.\n\nAD\n\nAD\n\nThe Taproot upgrade also scrambles transactions with single and multiple signatures, making it more challenging to identify transaction inputs on Bitcoin’s blockchain. Taproot enhances privacy while reducing the amount of data needed to make them, lowering transaction costs that have become much higher as Bitcoin has become more popular.\n\n“One thing that people don’t understand is that in order for Bitcoin to be secure, blocks must be full. That is part of the coin security model,” Rodarmor told Decrypt in an interview. “If blocks are not full, then nobody has any reason to pay more than the minimum fee rate to have their transactions included in a block. So, as a result, blocks must be full.”\n\nOrdinals can be a complicated process due to the size of the Bitcoin blockchain and the need to use the Command Line (Windows) or Terminal (Mac/Linux).\n\nWhat’s next for Ordinals?\n\nThe race is on to develop more seamless methods of inscribing on Bitcoin and wallets that make it possible to view the Bitcoin NFT once it is created.\n\nLooking to create a seamless way for collectors to create Ordinal Inscriptions, Gamma, a Bitcoin NFT marketplace on Stacks, began offering a paid service that allows users to inscribe images and text. Other projects providing this service include Oridalsbot from the creators of the Satoshibles NFT collection.\n\nSo you want a Bitcoin ordinal? Start with a Bitcoin full node, then install……no, no. For the past year, we’ve focused on making the best creator tools possible. Today, we’re launching no-code ordinal inscriptions to anyone with a BTC address. 🔗 https://t.co/WQzKZUWMw1 — Gamma.io (@trygamma) February 9, 2023\n\nHiro Systems announced Tuesday it is rolling out support for Odinals on its Hiro Wallet, and on Wednesday, Xverse, a Bitcoin-based web wallet, also launched support for Bitcoin NFTs.\n\nWe’ve begun rolling out support to Hiro Wallet for Bitcoin, NFTs and Ordinals for a truly cross-protocol Bitcoin Web3 experience. https://t.co/OAVriTraFq 🧵 A thread with details… #bitcoin #web3 #stx #nfts #ordinals pic.twitter.com/SiWrIluFhk — Mark Hendrickson | mark.btc | Hiro Wallet (@markymark) February 14, 2023"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oa2V4LWxpc3RlZC10ZWNoLWZpcm0tbGF1bmNoZXMtMTUtbWlsbGlvbi1iaXRjb2luLWZ1bmTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "HKEX-listed tech firm launches $15M Bitcoin fund - Cointelegraph",
        "content": "Linekong Interactive, a gaming and film production company headquartered in Beijing and listed on the Stock Exchange of Hong Kong (HKEX), is allocating $15 million to invest in projects building on the Bitcoin network.\n\nWang Fang, the founder of Linekong, said in a Nov. 8 tweet that the fund, dubbed “BTC Next,” will be used to accelerate emerging projects in the Bitcoin ecosystem, including “asset issuance protocols, trading markets, expansion, virtual machines, NFT, RWA, and GameFi.”\n\nFor initial efforts, the firm would “participate in the research and investment of Bitcoin network ecological assets as early as possible,” publish its investment portfolios, and update the list of Bitcoin ecological crypto assets. “The panoramic curtain of the Bitcoin network ecology has slowly unfolded,” BTC Next wrote. Traditionally, Bitcoin lacked the programmability associated with newer blockchains such as Ethereum, remaining for most periods largely unchanged from its invention in 2008.\n\nHowever, the Bitcoin ecosystem has expanded greatly this year with the invention of Ordinals and Inscriptions, two novel data storage methods that, together, allow users to mint unique digital assets on the Bitcoin blockchain.\n\nIn June, cross-chain wallet BitKeep (now Bitget Wallet) added deposit and withdrawal support for BRC-20 Bitcoin tokens modeled on the Ethereum ERC-20 standard. On Nov. 7, Binance listed popular BRC-20 token Ordinals (ORDI), causing its value to surge more than 40% in a single day. BRC-20 tokens have altogether reached $1.36 billion in market capitalization since their inception.\n\nFounded in 2007 in Beijing as an online gaming firm, Linekong Interactive first went public in Hong Kong in 2014. Before founding Linekong, Wang was a vice president of software development at Kingsoft Software, a Chinese information technology conglomerate.\n\nWang resigned as CEO of Linekong in 2018 to focus on blockchain, founding several projects in the nonfungible tokens, decentralized finance, and Bitcoin mining space. He returned to Linekong as CEO in 2022 after an invitation from the firm’s board of directors to better integrate Linekong products with Web3.\n\nRelated: Swiss crypto bank SEBA gets Hong Kong SFC license"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLXJlamVjdHMtMzZrL9IBQ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLXJlamVjdHMtMzZrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Price Rejects $36K: Why Dips In BTC Are Still Attractive - NewsBTC",
        "content": "Bitcoin price made another attempt to clear the $36,000 resistance. BTC struggled again and is now correcting lower toward the $35,200 support.\n\nBitcoin again failed to clear the key $36,000 resistance zone.\n\nThe price is trading above $35,000 and the 100 hourly Simple moving average.\n\nThere was a break above a major contracting triangle with resistance near $35,000 on the hourly chart of the BTC/USD pair (data feed from Kraken).\n\nThe pair is correcting gains and might find support near $35,200 or $35,000.\n\nBitcoin Price Faces Uphill Task\n\nBitcoin price remained stable above the $34,000 support zone. BTC attempted a fresh increase above the $35,250 resistance zone. There was a break above a major contracting triangle with resistance near $35,000 on the hourly chart.\n\nIt even cleared the $35,500 resistance, but the bears were active near the $36,000 zone. A high was formed near $35,900 and the price is again moving lower. There was a move below the $35,500 level. The price declined below the 23.6% Fib retracement level of the upward move from the $34,560 swing low to the $35,900 high.\n\nBitcoin is now trading above $35,000 and the 100 hourly Simple moving average. It seems to be approaching the $35,200 support or the 50% Fib retracement level of the upward move from the $34,560 swing low to the $35,900 high.\n\nIf it stays above $35,200, there might be a fresh increase. On the upside, immediate resistance is near the $35,560 level. The next key resistance could be near $35,900 or the recent high. The main resistance is still near $36,000. A clear move above the $36,000 resistance might open the doors for a move toward the $37,000 resistance.\n\nSource: BTCUSD on TradingView.com\n\nThe next key resistance could be $37,500, above which the price could rise toward $38,000. Any more gains might send BTC toward the $38,800 level.\n\nMore Downsides In BTC?\n\nIf Bitcoin fails to rise above the $35,560 resistance zone, it could continue to move down. Immediate support on the downside is near the $35,200 low.\n\nThe next major support is near the $35,000 zone or the 100 hourly SMA. If there is a move below $35,000, there is a risk of more downsides. In the stated case, the price could revisit the $34,000 support level in the near term.\n\nTechnical indicators:\n\nHourly MACD – The MACD is now losing pace in the bullish zone.\n\nHourly RSI (Relative Strength Index) – The RSI for BTC/USD is now above the 50 level.\n\nMajor Support Levels – $35,200, followed by $35,000.\n\nMajor Resistance Levels – $35,560, $35,900, and $36,000.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vZGVjcnlwdC5jby8yMDQ3MjQvYml0Y29pbi1vcmRpbmFscy1kYWlseS10cmFkaW5nLWhpdHMtNi1tb250aC1wZWFrLW9yZGktdG9rZW4tc3VyZ2VzLWJpbmFuY2UtbGlzdGluZ9IBcmh0dHBzOi8vZGVjcnlwdC5jby8yMDQ3MjQvYml0Y29pbi1vcmRpbmFscy1kYWlseS10cmFkaW5nLWhpdHMtNi1tb250aC1wZWFrLW9yZGktdG9rZW4tc3VyZ2VzLWJpbmFuY2UtbGlzdGluZz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Bitcoin Ordinals Trading Hits 6-Month Peak as ORDI Token Surges on Binance Listing - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin Ordinals transaction volume surged to its highest levels since May on Tuesday, as about $14.7 million worth of the Bitcoin-based assets traded hands, as of this writing, according to a Dune dashboard created by the pseudonymous on-chain data analyst Domo.\n\nLaunched earlier this year, Ordinals enables the creation of NFT-like assets on the Bitcoin blockchain. The protocol lets people assign data to an individual satoshi—equal to 1/100,000,000 of a whole Bitcoin—whether that's art, profile pictures, or text.\n\nThe lion’s share of trading volume on Tuesday took place on the cryptocurrency exchange OKX, per Domo’s dashboard. The Seychelles-based exchange rolled out trading support for Ordinals in May and accounted for 6,100 or 60% of daily Ordinals transactions, as of this writing.\n\nAD\n\nAD\n\nHowever, Domo’s dashboard does not reflect recent activity on Binance. Crypto’s leading exchange by volume initially rolled out support for image-based Ordinals in May too, but it began letting customers trade ORDI, the first-ever BRC-20 token, on Tuesday.\n\nAs of this writing, the Bitcoin-based token’s price has increased 124% over the past day to $13.21, more than doubling its initial price on Binance’s platform of $5.91, according to the exchange’s website. Across all exchanges, $471 million ORDI has traded hands over the past day, according to CoinGecko.\n\nIn addition to renewed interest from Bitcoin’s recent climb toward $35,000, Charlie Spears of Bitcoin mining firm Luxor Technologies told Decrypt that Binance’s move to support ORDI “sent everything flying” that’s related to Ordinals, whether that resembles a fungible token or JPEG.\n\n“Binance alone dwarfs that of the entire Ordinals trading volume across all marketplaces,” he said. “You have the fungible token side of Ordinals, and then you have the NFT, JPEG side of Ordinals, and they tend to go in tandem.”\n\nPioneered by the aforementioned Domo, BRC-20 tokens take inspiration from Ethereum’s ERC-20 standard, which is used across a plethora of tokens, such as Tether’s USDT stablecoin. Domo issued the first BRC-20 token, ORDI, initially as an experiment in March.\n\nAD\n\nAD\n\nDomo did not immediately respond to a request for comment from Decrypt.\n\nOrdinals creator Casey Rodarmor took to Twitter to address Binance’s support of ORDI, clarifying the token’s connection to the protocol. He said the exchange mistakenly called Domo’s token “Ordinals” and incorrectly linked to ordinals.com as ORDI’s “Official Website.”\n\n“ORDI is not associated with the Ordinals project,” Rodarmor said. “I hope this gets fixed soon.”\n\nI hope this gets fixed soon. ORDI is not associated with the Ordinals project, The Open Ordinals Institute, or The Ordicord. Those links should be removed, and the token should not be named \"Ordinals\". The name of the token is ORDI. If anyone has any contacts at Binance they… https://t.co/vR9cneIPBk — Casey (@rodarmor) November 7, 2023\n\nThe uptick in Ordinals transaction volume also comes as the NFT market shows signs of life. While the industry found itself in the crosshairs of “The Simpsons” during a segment dedicated to NFTs on Sunday night, NFT trading volume hit a three-month high the following day.\n\nIn May, Ordinals activity sparked concern among some Bitcoiners, as transaction fees climbed to at least 654 sat/vB, or around $26, for high-priority transactions. On Tuesday, high-priority transactions commanded a rate of 98 sat/vB, or around $5, according to mempool.space.\n\nInfluential NFT firms like Bored Ape Yacht Club maker Yuga Labs have leveraged Ordinals to mint art on Bitcoin, but the protocol’s momentum was bolstered in the first half of this year by fervor for BRC-20s. With Binance’s move, that continues to be the case, Spears said.\n\n“We were losing momentum from the BRC-20 mayhem that peaked in May and kind of subsided into August,” he said. “When the BRC-20s go flying when one gets listed on Binance, then it has knock-off effects to the broader Bitcoin NFT ecosystem.”\n\nAD\n\nAD\n\nEdited by Andrew Hayward"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1iZWxvdy0zNTAwMC1ldGhlcmV1bS1ob2xkcy0xOTAwLWFsdGNvaW5zLXJhbGx5LXVwLXRvLTYtNDA0ODIyLTIwMjMtMTEtMDfSAZcBaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvY3J5cHRvL3Rva2VuL3N0b3J5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLWJlbG93LTM1MDAwLWV0aGVyZXVtLWhvbGRzLTE5MDAtYWx0Y29pbnMtcmFsbHktdXAtdG8tNi00MDQ4MjItMjAyMy0xMS0wNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin below $35,000; Ethereum holds $1,900; Altcoins rally up to 6% - Business Today",
        "content": "Bitcoin and other crypto tokens continued their bullish momentum on Thursday as the oldest crypto asset hit a 17-month high after the Fed's dovish tone. Crypto tokens posted big gains following the completion of one year of Sam Bankman-Fried's crypto empire- FTX exchange.\n\nBitcoin was trading in red as the largest crypto token edged marginally lower, less than half-a-per cent but remained below 35,000-levels. However, its largest peer, Ethereum, was also seen in green, slightly up and hovered around $1,900-level. Majority of the altcoins were trading with decent gains.\n\nBitcoin kept on trading in a very narrow range of less than 2 per cent movement in the last 24 hours. It has now been close to two weeks. Although this means volumes in Bitcoin worldwide have started to slightly drop, any movement in its prices should mean the volumes are back in, said Shubham Hudda, Senior Manager at CoinSwitch Markets Desk.\n\n\"While BTC has been rising for a few weeks now, the ETH/BTC pair has seemed to find a little support around the 0.05 BTC per ETH mark. The little bounce back has helped other prominent altcoins as well to show some momentum on the upside price action,\" he said.\n\nOn the other hand, altcoin BLUR (+18.1%) has seen a positive price action in the last 24 hours. This could be as investors speculate it to be the world’s biggest NFT marketplace by trading volumes, especially after Opensea downsized by letting go of 50% of its staff recently\n\nBarring a few exceptions, all top crypto tokens were trading sharply higher on Tuesday. Chainlink was up 6 per cent, while Toncoin surged more than 5 per cent. Dogecoin and Polygon rose 4 per cent each, while Cardano and BNB added over 3 per cent each. Among the laggards, Tron was down a per cent.\n\nThe global cryptocurrency market cap was trading modestly higher, rising up to $1.33 trillion-mark, as it rose marginally in the last 24 hours. However, the total trading volumes increased more than 6 per cent to $40.46 billion.\n\nIn the last 24 hours, both BTC and ETH remained steady, while altcoins saw a rise of 5-10 per cent. This was accompanied by a decline in BTC dominance. Bitcoin is currently positioned between important support at $34,000 and resistance at $36,000, while Ethereum still has to clear a significant resistance level around $2,000, said CoinDCX Research Team.\n\n\"The market capitalization of altcoins, excluding Bitcoin and Ethereum, reached nearly $400 billion, marking a positive sign for the crypto space. It's worth noting that tomorrow, on November 8, 2023, Fed Chair Powell will deliver a speech, which could potentially introduce some market volatility,\" he said.\n\nImage: Crypto-chart-price\n\nTech View by WazirX Trade Desk\n\nThe Graph(GRT) is an indexing protocol, catering to data querying needs in networks such as Ethereum and IPFS. It plays a pivotal role in numerous applications within the DeFi sector and the larger Web3 ecosystem. Currently, GRT extends its support to the indexing of data from Ethereum, IPFS, and POA, with plans to include additional networks in the near future.\n\nImage: Chart-Graph\n\nOn the weekly time-frame, the GRT/USDT chart had been traversing within an ascending triangle pattern. The trend has bounced back from the bottom and is fast approaching the upper trendline with twice its average trading volumes. We could expect the momentum to continue into the coming weeks. The next resistance is expected at 0.17 USDT and an immediate support is expected at 0.12 USDT.\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3LmJsb2NrY2hhaW4tY291bmNpbC5vcmcvYml0Y29pbi9iaXRjb2luLXByaWNlLXRyZW5kcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 17:23:14 GMT",
        "title": "A Complete Timeline of Bitcoin Price Trends - Blockchain Council",
        "content": "The world of cryptocurrencies has been nothing short of a rollercoaster ride since the inception of Bitcoin in 2009. Bitcoin’s price has witnessed remarkable highs, gut-wrenching lows, and everything in between. Understanding the evolution of Bitcoin’s price trends is not only an intriguing journey through the history of digital currency but also a valuable exercise for anyone interested in the crypto market.\n\nIn this article, we embark on a comprehensive exploration of the price trends that have defined Bitcoin’s existence, from its humble beginnings to its current status as a global financial phenomenon. So, let’s start our journey through the complete timeline of Bitcoin’s price trends.\n\nBitcoin’s Complete Price History\n\nBitcoin’s price history is a fascinating journey marked by incredible highs, swift declines, and significant events that have shaped its trajectory. Here’s an in-depth analysis:\n\n2009-2010: The Early Days\n\nBitcoin emerged in 2009 with virtually no monetary value. It was an experimental concept more than a financial asset. In 2010, we witnessed the first real-world transaction with Bitcoin, where 10,000 BTC bought two pizzas. This era marks Bitcoin’s shift from an abstract idea to a commodity with tangible value. By the end of 2010, Bitcoin’s value had just begun to register, hitting around $0.3.\n\n2011: The First Peak and Crash\n\n2011 was a rollercoaster for Bitcoin. It began the year under $1 but soared to $29.6 by June, driven by growing interest and speculation. This was Bitcoin’s first significant spike, reflecting its potential as a digital currency. However, it couldn’t sustain these levels and plummeted to $4.7 by year-end, marking its first major crash, likely due to market corrections and uncertainties about its practicality and security.\n\n2012: Steady Growth\n\n2012 was relatively calm for Bitcoin. The year was characterized by gradual growth, devoid of the extreme volatility seen in 2011. It wasn’t yet catching mainstream attention, but there was a slow and steady accumulation, with its price inching up by a few dollars across the year.\n\n2013: Breakthrough and Volatility\n\nIn 2013, Bitcoin began to capture wider attention. Starting at around $13.3, it saw exponential growth, first crossing $100 in April and then $200 by October. This surge was due to growing awareness and acceptance of Bitcoin as a viable digital asset. However, the year ended with extreme volatility, with Bitcoin hitting over $1,000 in November and then dropping to about $805 by year-end.\n\n2014-2015: Regulatory Challenges and Recovery\n\nThese years were marked by regulatory challenges and the Mt. Gox scandal, which greatly affected Bitcoin’s price. The price fluctuated, reflecting the market’s reaction to these events, but by the end of 2015, Bitcoin had started to recover, indicating growing resilience against external shocks.\n\n2016: Gradual Uptrend\n\n2016 was a year of gradual growth for Bitcoin, with the price climbing steadily over the year. Starting at around $450, it experienced a slow but consistent increase, ending the year just under $1,000. This uptrend indicated a growing acceptance of Bitcoin as both a digital currency and a potential investment vehicle.\n\n2017: The Meteoric Rise\n\n2017 was a landmark year for Bitcoin, with its price skyrocketing. Starting just under $1,000, it experienced unprecedented growth throughout the year, reaching nearly $20,000 in December. This surge was driven by a frenzy of retail investment and media hype, marking Bitcoin’s arrival in the mainstream financial world.\n\n2018: The Great Correction\n\nFollowing the euphoric rise in 2017, 2018 was a year of correction. Bitcoin’s price plummeted throughout the year, dropping by about 73%. This decline was a response to the previous year’s rapid ascent and was compounded by regulatory concerns and market saturation with new cryptocurrencies.\n\n2019: Finding Stability\n\nIn 2019, Bitcoin’s price showed signs of stabilizing. It hovered around $3,000 to $4,000 for much of the year before seeing a mid-year surge above $10,000. This stability indicated that despite its volatility, Bitcoin was maturing as an asset class.\n\n2020: Pandemic and Price Surge\n\nThe COVID-19 pandemic initially caused a sharp decline in Bitcoin’s price. However, it quickly rebounded, largely due to investor perception of Bitcoin as a hedge against inflation and economic uncertainty. By the end of 2020, Bitcoin had reached around $29,000, showcasing its resilience and growing appeal in uncertain times.\n\n2021: Record Highs and Volatility\n\nBitcoin’s volatile nature was on full display in 2021. It started the year strongly, breaking past $40,000 in January and reaching over $60,000 by April. However, it also experienced significant drops, particularly in the summer, but it managed to reach an all-time high of around $68,789 in November. The year was marked by increased institutional interest and mainstream acceptance, but also heightened regulatory scrutiny.\n\n2022: The Crypto Winter\n\n2022 was a challenging year, with Bitcoin’s price experiencing a significant decline, dropping below $20,000 by year-end. This downturn, termed the “crypto winter,” was influenced by broader economic factors, including inflation concerns and geopolitical tensions.\n\nThe crypto winter of 2022 was a period of prolonged decline in the prices of cryptocurrencies, including Bitcoin (BTC). It began in November 2021, when BTC reached an all-time high of nearly $69,000. By the end of December 2022, BTC had fallen to around $17,000, a loss of over 75%.\n\nThis crypto winter was caused by a confluence of factors. First, central banks worldwide began raising interest rates in late 2021 to combat inflation. This made risky assets like cryptocurrencies less attractive to investors. Furthermore, ongoing geopolitical instability, including the war in Ukraine and other tensions, contributed to market volatility and risk aversion.\n\nGovernments around the world also played a significant role by cracking down on cryptocurrencies in 2022. They cited concerns about fraud, money laundering, and investor protection as reasons for increased regulation. Moreover, several high-profile crypto projects failed in 2022, such as the TerraUSD stablecoin and the Celsius Network lending platform. These failures eroded investor confidence in the crypto market.\n\nThe impact of the crypto winter extended far beyond price declines. Many crypto companies were forced to lay off employees and cut costs to survive the harsh market conditions. Some crypto projects ceased to exist altogether. The global cryptocurrency market capitalization fell dramatically from over $3 trillion in November 2021 to less than $850 billion in December 2022.\n\nOver 2,000 crypto projects failed during this tumultuous year. Additionally, the number of unique active crypto addresses decreased by over 40%, highlighting the reduced participation of users. Daily crypto transactions also saw a significant drop, falling by over 50%, underlining the diminished trading and investment activity in the market.\n\n2023: Recovery and Resilience\n\nIn 2023, Bitcoin showed signs of recovery, starting at $16,605 and rising consistently throughout the year. As of October, it was trading around $34,154, indicating a resurgence in investor confidence and a renewed interest in cryptocurrencies as a whole. The upwards price movement is expected to continue till December 2023 and beyond.\n\nAlso Read- Bitcoin Sees Massive Price Surge: Here’s What Led To Its Rise"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMS8wNy9vbmUtb2YtdGhlLW1vc3QtcmVsaWFibGUtb24tY2hhaW4tYml0Y29pbi1pbmRpY2F0b3JzLWp1c3QtZmxhc2hlZC1idWxsaXNoLWFjY29yZGluZy10by1nbGFzc25vZGUtZm91bmRlcnMv0gGPAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzExLzA3L29uZS1vZi10aGUtbW9zdC1yZWxpYWJsZS1vbi1jaGFpbi1iaXRjb2luLWluZGljYXRvcnMtanVzdC1mbGFzaGVkLWJ1bGxpc2gtYWNjb3JkaW5nLXRvLWdsYXNzbm9kZS1mb3VuZGVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "One of the Most Reliable On-Chain Bitcoin Indicators Just Flashed Bullish, According to Glassnode Founders - The Daily Hodl",
        "content": "The co-founders of a top crypto data analytics firm say that a reliable Bitcoin (BTC) indicator is signaling bullish moves for BTC.\n\nGlassnode co-founders Jan Happel and Yann Allemann, who share the Negentropic handle on the social media platform X, tell their followers that BTC’s market demand is outpacing its supply.\n\nAdditionally, the Bitcoin network recently saw 700,000 new addresses created in just one day, which the analysts say is one of the top indicators for future price movements.\n\n“Bitcoin’s market demand has outpaced its supply, a clear sign of robust positive momentum.\n\nIn just one day, a whopping 700,000 new BTC addresses joined the network. This expansion is considered one of the most reliable indicators for price predictions.\n\nWith fewer BTC coins currently in circulation, buyers might need to increase their bids to have their orders executed promptly.”\n\nIn a further analysis in a blog post, the co-founders say that with BTC moving so fast, buyers will likely be forced to enter the market without waiting for dips, possibly driving the price of BTC up.\n\n“Because there are fewer BTC coins available right now, purchasers may have to raise their bids to get their orders filled fast. This could unwittingly boost the BTC price above $40,000 soon.”\n\nBTC is worth $34,675 at time of writing.\n\nFollowing up on what’s next for altcoins, the Glassnode co-founders say decentralized finance (DeFi) and layer-1 tokens are blazing a comeback trail.\n\n“Altcoins’ Higher Beta Points to Potential for Elevated Gains Against Bitcoin’s Stability\n\nINTRO: As BTC stabilizes, the spotlight turns to altcoins for potentially higher returns, thanks to their volatility.\n\nMAIN: Solana leads the charge with XRP and Cardano on its heels, showcasing impressive growth and investor interest.\n\nCONCLUSION: This week’s rotation is clear: as BTC and ETH plateau, DeFi and Layer 1 tokens are bouncing back with vigor.”\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nShutterstock/antishock/Sol Invictus"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJubmJsb29tYmVyZy5jYS9leC1jYW50b3ItZXhlY3V0aXZlcy1zdGFydC1sZW5kaW5nLXBsYXRmb3JtLWZvci1hbnRpY2lwYXRlZC1zcG90LWJpdGNvaW4tZXRmcy0xLjE5OTUzMjfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 07 Nov 2023 08:00:00 GMT",
        "title": "Ex-Cantor Executives Start Lending Platform for Anticipated Spot Bitcoin ETFs - BNN Bloomberg",
        "content": "(Bloomberg) -- Several ex-Cantor Fitzgerald executives started a crypto lending platform with the expectation that it will serve operators of spot Bitcoin exchange-traded funds once they gain US regulatory approval.\n\nDigital Prime Technologies’ Tokenet already lets clients including Xapo Bank lend out digital assets to others, such as EDX Clearing and global institutional credit network Hidden Road Partners, the Jersey City, New Jersey-based company said Tuesday. The setup offers risk-management tools and a chat functionality that lets users manage loans.\n\nThe firm joins a slew of exchanges and other companies, such as Swan Bitcoin, who are launching products to fill a void left by the demise of crypto lenders Genesis, Celsius, BlockFi and others. The crypto lending industry’s collapse last year left market participants with a dearth of options, and helped depress trading volumes into 2023.\n\nThe launch also coincides with rising optimism that an ETF holding Bitcoin directly will be approved in the US within months. If that happens, Digital Prime expects ETF issuers will have a huge thirst for borrowing Bitcoin, and will jump start the fledging crypto-lending industry.\n\n“It’s almost like a rebirth of crypto lending,” James Runnels, the company’s chief executive officer, said in an interview.\n\nFor example, if authorized participants need to create new inventory in the ETF, but Bitcoin’s price suddenly jumps, they may chose to borrow the cryptocurrency, instead — and to buy it later at a lower price, Runnels said.\n\nWith ETFs, specialized traders known as authorized participants can work with an issuer to create shares when demand is building. When buyers’ appetites cool, participants redeem those shares with the fund’s sponsor to reduce the supply, keeping the ETF’s price in line with its net-asset value.\n\nRunnels was a managing director at Cantor Fitzgerald, while Digital Prime’s Chief Operating Officer Bob Sherry was COO for Prime Services at Cantor until 2018. Glen Garofalo, head of margin and risk solutions, was managing director of prime services, head of margin, at Cantor, according to his LinkedIn profile.\n\nDigital Prime’s DLCC Prime subsidiary received Financial Industry Regulatory Authority membership last year, and can operate as a broker-dealer registered with the Securities and Exchange Commission. Digital Prime received its seed funding from investors including TD Cowen Inc.\n\n©2023 Bloomberg L.P."
    }
]