[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDIvMTYvYml0Y29pbi1idGMtcHJpY2Utc3VyZ2VzLWFzLWNyeXB0by1tYXJrZXQtZ2FpbnMtODQtYmlsbGlvbi1pbi12YWx1ZS5odG1s0gFsaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDIvMTYvYml0Y29pbi1idGMtcHJpY2Utc3VyZ2VzLWFzLWNyeXB0by1tYXJrZXQtZ2FpbnMtODQtYmlsbGlvbi1pbi12YWx1ZS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin rises despite U.S. crackdown, as crypto market gains $84 billion in value - CNBC",
        "content": "In this article ETH.CM=\n\nBTC.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nBitcoin has had a strong start to the year with the cryptocurrency seeing a huge rally. Jakub Porzycki | Nurphoto | Getty Images\n\nCrypto markets rose on Thursday, shrugging off a tougher regulatory stance from the U.S. government. Bitcoin gained 2.06% to $24,500.00 at around 4:04 p.m. ET while ether was up 1.21% at $1,679.31, according to Coin Metrics. There are \" increasing signs that the market bottomed last November and has turned bullish,\" Vijay Ayyar, vice president of corporate development and international at crypto exchange Luno, told CNBC. \"We are gaining in momentum here and any bad news is being shrugged off, typical signs that the market believes the worst is over.\"\n\nCrypto markets were on edge earlier this week following increased regulatory scrutiny from U.S. authorities on digital currencies. On Monday, the New York State Department of Financial Services told Paxos to stop minting new Binance USD, or BUSD, stablecoins. A stablecoin is a type of cryptocurrency pegged to a real-world asset and some are backed by assets such as bonds or cash. BUSD is pegged one-to-one to the U.S. dollar. Paxos also confirmed that the Securities and Exchange Commission has notified the company that the agency could recommend an action that alleges BUSD is a security. The SEC has not yet formally levelled any charges against Paxos.\n\nFlows into bitcoin"
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDIvMTYvYnVzaW5lc3MvYml0Y29pbi1wcmljZS1yYWxseS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Price Stages a Comeback, Hitting Eight-Month High - The New York Times",
        "content": "A similar issue was front and center on Capitol Hill on Tuesday, when the Senate Banking Committee held a hearing to discuss new safeguards for crypto investors, a possible first step toward legislation. “It’s time now to consider how to protect consumers from unregulated digital assets, and ultimately, who we want our financial system to serve,” said Senator Sherrod Brown, Democrat of Ohio and the committee chairman.\n\nOn Monday, New York’s Department of Financial Services ordered Paxos, a crypto firm, to cease creating BUSD, a so-called stablecoin, because of “unresolved issues” over its relationship with the crypto exchange Binance, which carried the coin’s branding.\n\nLast week, the S.E.C. charged the crypto exchange Kraken with securities violations, arguing its “staking” practice — in which users pledge crypto holdings to companies in exchange for hefty returns — was akin to selling an unregistered investment contract.\n\nAnd then there is the shadow of the spectacular implosion of FTX, which left investigators on a global hunt to recover billions in missing assets. Amid attempts to claw back funds to repay FTX’s customers, attention has recently turned to $400 million that’s sitting in an interest-bearing bank account.\n\nSo what’s behind the Bitcoin rally? Some say that it’s a so-called short squeeze, in which those who have bet against Bitcoin have to cover their positions by buying more. Another explanation is tax-loss harvesting, in which investors sell at a loss at the end of the year to reduce their tax hit, and then add to their holdings again when the calendar flips. A third potential factor: Crypto investors appear to be selling their holdings in so-called altcoins and putting that money into the relatively more established Bitcoin."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzE1L2NyeXB0by1sb25nLXNob3J0LXNvcnRpbmctb3V0LWJpdGNvaW5zLXBlLXJhdGlvL9IBYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzE1L2NyeXB0by1sb25nLXNob3J0LXNvcnRpbmctb3V0LWJpdGNvaW5zLXBlLXJhdGlvL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Let’s Talk About Bitcoin’s Price-to-Earnings Ratio - CoinDesk",
        "content": "The highest NVT ratio for bitcoin that I found on record was 448.15 on Aug. 29, 2010. Was it overvalued? Well, BTC traded for about 6 cents at the time, and is around $22,000 now, so the relevance of this reading is a bit dubious in my opinion. What if we toss out all data before 2014? That gives a maximum NVT ratio of 98.52, which I think is more sensible. Bitcoin’s lowest NVT on record was 0.22 on Jan. 24, 2016, when BTC was trading at $403. The average NVT over the time span studied was 24, which I also think has relevance."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9lbC1zYWx2YWRvci10by1vcGVuLWEtYml0Y29pbi1lbWJhc3N5LWluLXRoZS11bml0ZWQtc3RhdGVz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "El Salvador to open a 'Bitcoin Embassy' in the United States - Cointelegraph",
        "content": "The world’s biggest cryptocurrency, Bitcoin (BTC), is connecting more countries as the government of El Salvador is opening a “Bitcoin Embassy” in the United States.\n\nEl Salvador, a country that adopted Bitcoin as legal tender in 2021, is expanding its Bitcoin strategy in a new partnership with the government of Texas. The intergovernmental collaboration aims to set up a Bitcoin Embassy, or El Salvador’s representative office, in Texas to work on new joint projects to promote Bitcoin adoption.\n\nMilena Mayorga, the Salvadoran Ambassador to the United States, announced the news in a statement on Twitter on Feb. 14.\n\nTexas Deputy Secretary of State Joe Esparza and El Salvador’s U.S. ambassador Milena Mayorga. Source: Twitter\n\n“In my meeting with the assistant secretary of the government of Texas, Joe Esparza, we discussed the opening of the second Bitcoin Embassy and the expansion of commercial and economic exchange projects,” Mayorga said.\n\nEl estado de Texas, nuestro nuevo aliado.\n\n\n\nEn mi encuentro con el Secretario Adjunto del Gobierno de Texas, Joe Esparza @TXsecofstate, abordamos la apertura de la segunda Embajada #Bitcoin y de ampliar los proyectos de intercambios comerciales y económicos. pic.twitter.com/NcmOjeadl6 — Milena Mayorga (@MilenaMayorga) February 14, 2023\n\nThe latest Bitcoin initiative comes a few months after El Salvador opened the first Bitcoin Embassy in Switzerland’s southern city of Lugano in October 2022. As part of the efforts, the two pro-crypto jurisdictions started working to establish a physical governmental presence to promote cooperation in education and research institutions related to Bitcoin.\n\nAccording to former Blockstream chief strategy officer Samson Mow, the phenomenon of the Bitcoin embassy is the next step in nation-states and cities adopting Bitcoin. He said that such initiatives imply cooperation between countries to develop new initiatives like establishing alliances between places that have adopted Bitcoin.\n\nRelated: El Salvador’s ‘limited’ use of Bitcoin prevents forecasted risks, says IMF\n\nThe news comes amid Texas lawmakers reportedly considering a new bill calling for a “a master plan for the expansion of the blockchain industry.” The legal initiative aims to turn Texas into the crypto capital of the country by introducing tax-free shopping with Bitcoin, among other proposals.\n\nAs previously reported, Texas has emerged as one of the crypto-friendly U.S. states, passing crypto-friendly laws aiming to better adapt commercial laws to blockchain innovation and digital asset regulations. Texas is also home to some of the largest Bitcoin miners in North America, with major mining companies like Riot Blockchain, Core Scientific and Genesis Digital Assets operating in the state."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wMi8xNi9taWtlLW5vdm9ncmF0ei1iaXRjb2luLXByZWRpY3Rpb24tNTAway1pbi0yMDI0LW5vdy0zMGstYnktMjAyMy1mZWQtaW50ZXJlc3QtcmF0ZXMv0gF1aHR0cHM6Ly9mb3J0dW5lLmNvbS8yMDIzLzAyLzE2L21pa2Utbm92b2dyYXR6LWJpdGNvaW4tcHJlZGljdGlvbi01MDBrLWluLTIwMjQtbm93LTMway1ieS0yMDIzLWZlZC1pbnRlcmVzdC1yYXRlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin bull Mike Novogratz, who once predicted it hitting $500K in 2024, would now be ‘the happiest guy’ if it ends the year at $30K - Fortune",
        "content": "Bitcoin bull Mike Novogratz is dialing it back.\n\nIn January 2021, the founder and CEO of crypto investment firm Galaxy Digital said he would get a tattoo to commemorate Bitcoin reaching $500,000, which he expected to happen in 2024. On Wednesday, he said he’d be happy if Bitcoin merely traded at $30,000 by the end of this year.\n\nNovogratz, an early investor in Bitcoin, made the comments at a Bank of America conference on Wednesday, as Bloomberg reported.\n\nBitcoin lost nearly 65% of its value over 2022, ending the year at about $16,500. It’s up about 50% year to date to $24,792. But that’s well below its peak of nearly $69,000 in November 2021.\n\n“When I look at the price action, when I look at the excitement of the customers calling, the FOMO [fear of missing out] building up, it wouldn’t surprise me if we were at $30,000 by the end of the quarter,” he said. “And I would’ve given both my shoes for that to be true just six weeks ago. Like if we end the year $30,000, I will be the happiest guy.”\n\nAt a Bitcoin conference in Miami in April last year, Novogratz reiterated his prediction the cryptocurrency would hit $500,000, adding he also believed it would eventually reach $1 million. Bitcoin was then trading at around $44,300.\n\nHe said at the time that Bitcoin’s price would soar once the Fed stepped back from raising interest rates.\n\nOn Wednesday, he predicted that the $500,000 mark would eventually be reached, but not in the next five years, and he again pointed to Fed Chair Jerome Powell’s interest rate decisions.\n\n“What makes me skeptical that we can have the explosive, back-to-the-old highs this year is Chairman Powell,” Novogratz said. “He’s really doing what he says he’s going to do, and I don’t see the Fed pivoting and cutting anytime soon.”\n\nHe’s not the only crypto investor remaining bullish on Bitcoin in the long term. Earlier this month, ARK Investment Management CEO Cathie Wood, long a Bitcoin believer, said that while 2022 was a “terrible year for everything crypto,” her firm predicts Bitcoin will hit “roughly $670,000” in five years then could pass $1 million by 2030.\n\nOf course, many top business thinkers disagree with such predictions—or discredit Bitcoin and other crypto entirely. Mark Mobius, the billionaire cofounder of Mobius Capital Partners, predicted in December that Bitcoin would fall to $10,000 at some point this year.\n\nAnd Warren Buffett’s right-hand man Charlie Munger argued in a Wall Street Journal op-ed this month that the U.S. should follow China’s lead and pass laws that prevent both crypto trading and the formation of new cryptocurrencies.\n\nIn January last year, Novogratz tweeted a photo of a new tattoo on his shoulder. Reading “Luna” and showing a wolf howling at the moon, it indicated his enthusiasm for the cryptocurrency Luna, which later lost all its value after the wipeout of the so-called stablecoin TerraUSD, a sister token.\n\n“It’s a good reminder that you are not always right,” Novogratz said last summer.\n\nNote: “Bitcoin maximalist,” used to describe Novogratz in an earlier version of this story, has been replaced with “Bitcoin bull.” Bitcoin maximalists—pointing to Novogratz’s Luna investment—would argue that he is not one of them since they “strive to stay clear” of the “scam-ridden crypto industry” and “do not even consider Bitcoin to be the same thing as ‘crypto,’” as one reader wrote to us."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMTUvYml0Y29pbi1zb2Fycy1wYXN0LTIzN2stdG8tcmVhY2gtMTMtZGF5LWhpZ2gv0gFdaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMi8xNS9iaXRjb2luLXNvYXJzLXBhc3QtMjM3ay10by1yZWFjaC0xMy1kYXktaGlnaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Soars Past $24K to Reach 2-Week High - CoinDesk",
        "content": "Bitcoin bolted past $24,000 for the first time in two weeks after surging more than 8% over the past 24 hours, likely the result of the type of short squeeze that historically has sent prices higher. The percentage increase was the largest since BTC jumped 10.5% on Sept. 9."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDIvMTYvYmlsbGlvbmFpcmUtY2hhcmxpZS1tdW5nZXItY3J5cHRvY3VycmVuY3ktaXMtY3Jhenktc3R1cGlkLWdhbWJsaW5nLmh0bWzSAWtodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wMi8xNi9iaWxsaW9uYWlyZS1jaGFybGllLW11bmdlci1jcnlwdG9jdXJyZW5jeS1pcy1jcmF6eS1zdHVwaWQtZ2FtYmxpbmcuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Billionaire Charlie Munger: Cryptocurrency is 'crazy, stupid gambling,' and 'people who oppose my position are idiots' - CNBC",
        "content": "Billionaire investor Charlie Munger isn't a fan of cryptocurrency.\n\nThe Berkshire Hathaway vice chairman called the form of virtual currency \"worthless\" during Wednesday's annual shareholder meeting of the Daily Journal Corporation, a publishing company where he's a director.\n\n\"Sometimes I call it crypto 'crappo,' sometimes I call it 'crypto s---.' It's just ridiculous that anybody would buy this stuff,\" Munger, 99, told CNBC's Becky Quick during a livestream of the event, adding: \"It's totally absolutely crazy, stupid gambling.\"\n\nCryptocurrency's advocates maintain that digital assets offer privacy, security, better transaction speeds and lower costs than traditional financial institutions.\n\nBut Munger, a longtime stock investor with a net worth of $2.3 billion, doesn't buy it. \"I think the people who oppose my position are idiots, so I don't think there is a rational argument against my position,\" he said.\n\nMunger's comments come amid an avalanche of problems for crypto investors over the past year.\n\nThe crypto market lost roughly $2 trillion last year. Bitcoin, one of the most popular cryptocurrencies, lost more than 60% of its value in 2022. And the implosion of FTX, a now-bankrupt crypto trading platform once valued at $32 billion, has shaken investors' confidence as the industry feels the ripple effects of the company's collapse.\n\n\"Many Americans are coming to realize that cryptocurrency is just a speculative mania and the industry is rife with crooks,\" James Royal, a principal reporter at Bankrate, tells CNBC Make It. Indeed, just 8% of Americans have a positive view of cryptocurrency as of November, according to the CNBC All-America Economic Survey.\n\nOn Wednesday, Munger said he's not proud of his country \"for allowing this crap.\" He's previously urged the U.S. government to ban cryptocurrencies, and may partially get his wish as the crypto industry faces rising regulatory crackdowns.\n\nIncreased scrutiny of crypto-trading firms and investment advisors are among the U.S. Securities and Exchange Commission's top priorities this year, as outlined in the agency's \"2023 Examination Priorities Report.\"\n\nThe SEC's examinations will focus on the \"offer, sale, recommendation of or advice regarding trading in crypto or crypto-related assets,\" the report says.\n\nThe agency voted Wednesday to expand federal rules that, if passed into law, could require crypto exchanges to hold their assets with a federal- or state-chartered bank to act as a custodian over customers' virtual currency.\n\nThe proposal puts crypto firms in a \"no-win\" scenario, SEC commissioner Mark Uyeda wrote in a statement on Wednesday. U.S. regulators have already warned banks that dealing with crypto exposes them to an array of risks, including fraud and scam.\n\n\"In other words, an adviser may custody crypto assets at a bank, but banks are cautioned by their regulators not to custody crypto assets,\" Uyeda wrote.\n\nGet CNBC's free Warren Buffett Guide to Investing, which distills the billionaire's No. 1 best piece of advice for regular investors, do's and don'ts, and three key investing principles into a clear and simple guidebook.\n\nSign up now: Get smarter about your money and career with our weekly newsletter"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWhpdHMtMjVrLWluLW5ldy0yMDIzLWhpZ2jSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price hits $25K in new 2023 high - Cointelegraph",
        "content": "The price of Bitcoin (BTC) has reached a new 2023 high of $25,000 after surging over much of January.\n\nThe last time Bitcoin’s price was around $25,000 was around mid-June, on its way down to between $19,000 and $21,000, where it then hovered for several months, according to data from CoinGecko.\n\nThe price of BTC has increased double digits over the last 24 hours to reach the $25,000 milestone.\n\nThe price of BTC then took a big dip in November following the FTX crisis, which saw BTC drop to a 2022 low of $15,742 on Nov. 10.\n\nIts price began to surge in early January, increasing over 14 consecutive days from Jan. 4-17.\n\nThat daily green candle streak was its second longest in the cryptocurrency’s 14-year history — having fallen one day short of its 15-day record set in November 2013.\n\nRelated: Bitcoin price correction was overdue — analysts outline why the end of 2023 will be bullish\n\nWhile BTC has had an impressive start to 2023, it is still down 63% from its all-time-high of $69,044, reached on Nov. 10, 2021.\n\nSome economists such as Lyn Alden believe that BTC’s current price surge may be relatively short-lived. The Bitcoin bull believes actions from the U.S. Federal Reserve will likely impose “considerable danger ahead” for BTC in the second half of 2023.\n\nMeanwhile, Galaxy Digital Holdings CEO Mike Novogratz is more bullish over the short term.\n\nSpeaking at a Bank of America conference on Feb. 15, Novogratz reportedly said that there’s a chance BTC could hit $30,000 by the end of March."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMi8xNS9ldS1iYW5rcy10b2xkLWJ5LXJlZ3VsYXRvci10by1hcHBseS1iaXRjb2luLWNhcHMtZXZlbi1iZWZvcmUtdGhleS1iZWNvbWUtbGF3L9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMi8xNS9ldS1iYW5rcy10b2xkLWJ5LXJlZ3VsYXRvci10by1hcHBseS1iaXRjb2luLWNhcHMtZXZlbi1iZWZvcmUtdGhleS1iZWNvbWUtbGF3L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "EU Banks Told by Regulator to Apply Bitcoin Caps Even Before They Become Law - CoinDesk",
        "content": "A survey published by the ECB on Wednesday said that distributed-ledger technology is “barely used across banks,” with fewer than one in five seeking to apply the solutions, and that crypto activities and exposures are “insignificant.”"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAyLzE2L3N0YXJ0dXAtc3VzdGFpbmFibGUtYml0Y29pbi1wcm90b2NvbC1jb21wbGV0ZXMtZmlyc3QtdHJhbnNhY3Rpb24tb2YtY2xlYW4tbWluaW5nLXRva2Vucy_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wMi8xNi9zdGFydHVwLXN1c3RhaW5hYmxlLWJpdGNvaW4tcHJvdG9jb2wtY29tcGxldGVzLWZpcnN0LXRyYW5zYWN0aW9uLW9mLWNsZWFuLW1pbmluZy10b2tlbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Startup Sustainable Bitcoin Protocol Completes First Transaction of Clean Mining Tokens - CoinDesk",
        "content": "The SBC was sold \"with a discount to the market price because this was the first transaction of its kind. Based on today’s bitcoin energy consumption levels, we estimate that SBC would sell now for approximately $1,150, which is roughly a 5% revenue add to a miner’s bottom line,\" if they're using 100% clean energy, David said."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzE1L2JpdGNvaW4tbWluZXItaGl2ZS1kZWxheXMtbGF0ZXN0LWZpbmFuY2lhbC1maWxpbmdzLXRpbGwtZmViLWVuZC_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8xNS9iaXRjb2luLW1pbmVyLWhpdmUtZGVsYXlzLWxhdGVzdC1maW5hbmNpYWwtZmlsaW5ncy10aWxsLWZlYi1lbmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Hive Delays Latest Financial Filings Till End of February - CoinDesk",
        "content": "The filings were due by Feb. 14 under Canadian securities law requirements. Hive said it will now file by Feb. 28, also saying that it expects to do so by Feb. 21."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzE2L2JpdGNvaW4tcHJpbWVkLWZvci1wYXJhYm9saWMtcmFsbHktdG8tNTZrLWFzLW5hc2RhcS1icmVha3Mtb3V0LW9mLWJ1bGwtZmxhZy1jaGFydC1hbmFseXN0L9IBigFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzE2L2JpdGNvaW4tcHJpbWVkLWZvci1wYXJhYm9saWMtcmFsbHktdG8tNTZrLWFzLW5hc2RhcS1icmVha3Mtb3V0LW9mLWJ1bGwtZmxhZy1jaGFydC1hbmFseXN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Primed to Rally to $56K as Nasdaq Breaks Out of Bull Flag, Chart Analyst Says - CoinDesk",
        "content": "Bitcoin Primed to Rally to $56K as Nasdaq Breaks Out of Bull Flag, Chart Analyst Says\n\nThe analyst, who correctly predicted the late 2020 bull run, said 2023 could be a surprisingly good year for both crypto and equities."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMTYvc2hvcnQtdHJhZGVzLW1ha2UtdXAtOTAtb2YtMjAwbS1pbi1sb3NzZXMtYXMtYml0Y29pbi1ldGhlci1zdXJnZS_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzE2L3Nob3J0LXRyYWRlcy1tYWtlLXVwLTkwLW9mLTIwMG0taW4tbG9zc2VzLWFzLWJpdGNvaW4tZXRoZXItc3VyZ2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Short Trades Make up 90% of $200M in Losses as Bitcoin, Ether Surge - CoinDesk",
        "content": "Bitcoin and ether rose to over $24,500 and $1,600 respectively, leading to a market-wide recovery. Okb, the native tokens of crypto exchange OKX, surged 20%, the most among major cryptocurrencies, while BNB Chain’s bnb (BNB) rose to $323 in Asian afternoon hours – reversing losses from earlier this week."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMTYvYml0Y29pbi1qdW1wcy1wYXN0LTI1ay1mb3ItZmlyc3QtdGltZS1zaW5jZS1qdW5lLTIwMjIv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMi8xNi9iaXRjb2luLWp1bXBzLXBhc3QtMjVrLWZvci1maXJzdC10aW1lLXNpbmNlLWp1bmUtMjAyMi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Jumps Past $25K for First Time Since August - CoinDesk",
        "content": "The largest cryptocurrency by market cap was recently trading at about $24,920, up more than 9% over the past 24 hours. BTC had been lingering below $22,000 as recently as Tuesday before it begain to surge as investors shrugged off the latest tepid inflation data and a regulatory crackdown on stablecoins."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8xNi9tdC1nb3hzLTItbGFyZ2VzdC1jcmVkaXRvcnMtcGljay1wYXlvdXQtb3B0aW9uLXRoYXQtd29udC1mb3JjZS1iaXRjb2luLXNlbGxvZmYtc291cmNlcy_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMTYvbXQtZ294cy0yLWxhcmdlc3QtY3JlZGl0b3JzLXBpY2stcGF5b3V0LW9wdGlvbi10aGF0LXdvbnQtZm9yY2UtYml0Y29pbi1zZWxsb2ZmLXNvdXJjZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Mt. Gox’s 2 Largest Creditors Pick Payout Option That Won’t Force Bitcoin Sell-Off: Sources - CoinDesk",
        "content": "Their decision to pick the former option could soothe longstanding fears among bitcoin holders that a wave of simultaneous liquidations tied to Mt. Gox bankruptcy recoveries could drive down the price of bitcoin. Had these two creditors opted to take the payout in fiat, the trustee overseeing the bankruptcy estate would likely have been compelled to sell off a significant portion of Mt. Gox’s recovered bitcoin holdings to fulfill all the fiat requests."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTE2L2JpdGNvaW4tdG91dGluZy1wcmVzaWRlbnQtd29uLW92ZXItd2FsbC1zdHJlZXQtYnktcGF5aW5nLWJvbmRz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin-Touting El Salvador President Bukele Won Over Wall Street by Paying Debt - Bloomberg",
        "content": "For much of the four years since he won office, El Salvador’s President Nayib Bukele has relished his role as an anti-establishment warrior.\n\nHe sacked judges, exited a regional anti-corruption pact, spurned the International Monetary Fund and adopted Bitcoin as legal tender. All the while, he seemed wholly indifferent to what foreign investors thought of him."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmVlbmV3cy5uZXQvYXJ0aWNsZXMvY3J5cHRvLWlzLWhlcmUtdG8tc2F2ZS10aGUtZ3JpZC1vci1jcmFzaC1pdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Crypto is here to save the grid. Or crash it. - E&E News by POLITICO",
        "content": "Like energy, cryptocurrency is subject to booms and busts — and last year was definitely a bust.\n\nBut with the value of bitcoin and other digital currencies beginning to rebound after plummeting in 2022, there are renewed concerns that cryptominers could wreak havoc on the electric grid and U.S. carbon-cutting plans.\n\nThat has prompted crypto companies to reframe their role on the grid, eyeing ways to both minimize power demand and boost ties to renewable energy. The industry is aware that a possible regulatory crackdown could halt the days of unfettered electricity use.\n\nAdvertisement\n\n“This is an industry with a lot of ethical holes in it, and one of the biggest is the impact on the environment,” Erran Carmel, a technology professor at American University, said of cryptocurrency.\n\nCryptocurrency has long been branded a climate villain. Companies acquire virtual coins by solving a series of computational puzzles in a “mining” process that essentially requires a fleet of computers to be running for long hours. Depending on where those computers are located, the load may be met by natural gas or coal plants, delaying a transition to renewable energy and generating more climate-warming emissions.\n\nAccording to a report from the White House Office of Science and Technology Policy, as of August 2022, total global electricity use for crypto was as high as 240 billion kilowatt-hours per year, more than the total electricity used in a year by Argentina.\n\nIn the United States — which hosts about a third of the world’s crypto operations — the industry accounted for between 0.9 percent to 1.7 percent of the country’s total electricity usage, higher than all residential lighting, the White House office found.\n\nThat sort of energy pull prompted New York Gov. Kathy Hochul (D) to sign legislation imposing a moratorium on new crypto mining in the state last year. Other state and local governments have placed their own restrictions on new crypto mining or imposed requirements that it run on renewable energy.\n\nRestrictions that go too far could hurt the industry at a time when it is looking to reshape its energy story, said John Olsen, New York state lead for the Blockchain Association.\n\n“Other areas of the country have embraced this technology and enabled the kind of out-of-the-box thinking where we don’t just rely on hydro or wind or solar, but have ways of curtailing emissions, capturing waste and even contributing to the overall health of the economy,” Olsen said. “A moratorium puts us a few steps back.”\n\nFor example, he said, some crypto mines have taken root in areas where renewable energy might go to waste, offering a load that can support large-scale projects. In Texas, bitcoin companies have shown that toggling their demand up and down can help stabilize prices on the grid.\n\nThe strategy isn’t just a regulatory dodge or good spin, said Joe Burnett, a mining analyst for bitcoin company Blockware Solutions. It’s also good business.\n\n“If bitcoin miners are inefficient and nonprofitable, governments should let them fail,” Burnett said. “This industry has the potential to balance energy grids and help supply. And I think that’s a viable future for mining companies.”\n\nThe power dilemma\n\nCrypto mining dipped throughout 2022, with the website digiconomist.net estimating the industry’s energy use dropped more than 60 percent between January and December.\n\nThat reflects 2022’s so-called “crypto winter,” when prices crashed as a number of companies failed and investors pulled out of the volatile and still risky market.\n\nThe collapse of cryptocurrency exchange FTX Trading Ltd. in November 2022 after a liquidity crisis and allegations of fraud against CEO Sam Bankman-Fried marked a thud near the end of the year that further drove prices down and increased regulatory scrutiny.\n\nWith little reward, mining naturally went down. But activity was also dented by rising electricity and natural gas prices, said Joshua Rhodes, a research scientist at the University of Texas, Austin, who has consulted for crypto companies.\n\n“The main cost of these systems is electricity. It’s basically a bunch of computers guessing at a particular number for trillions of guesses, which takes a lot of energy,” Rhodes said. “So as bitcoin prices fell, electricity prices went up. You’re getting squeezed from both sides.”\n\nAccording to a study by analytics firm Hashrate Index — backed by mining company Luxor Technologies — 10 of the most popular states for cryptocurrency mines saw electricity prices rise between 2021 and 2022, led by a 43 percent increase in Georgia. That trend, the report says, likely contributed to the bankruptcy of Core Scientific and other cryptomining companies.\n\nThe report found that crypto companies in states with abundant hydropower and less natural gas saw the smallest price increases and had more market stability.\n\n“Many miners learned a painful but important lesson in 2022: securing a low, long-term electricity price is vital to the mining business,” Hashrate Index said.\n\nAs bitcoin prices have ticked up from a low point in 2022, Hashrate Index found that the computing power behind bitcoin has also risen, hitting a record peak on Jan. 20.\n\nThat has coincided with increased regulatory attention from some states and countries.\n\nOregon lawmakers have proposed a bill that would require crypto miners and data centers to meet the state’s greenhouse gas reduction goals, including a 100 percent reduction by 2040. In Washington state, a new bill would require large loads served by municipal and public utilities to meet clean energy standards that currently apply to customers of investor-owned utilities.\n\nBoth states have seen an influx of crypto companies seeking low-cost, reliable hydropower. British Columbia and Manitoba in Canada have also implemented moratoria on new crypto connections.\n\nWhether renewable requirements make a difference remains to be seen.\n\nTake Missoula County in Montana, which in 2021 adopted new zoning rules mandating that crypto miners be powered with new renewable energy, either generated on site or purchased elsewhere. The rules came after the county saw a power drain and residential complaints from expanding operations by miner HyperBlock Inc., which set up shop there seeking out Montana’s relatively cheap power prices.\n\nHyperBlock filed for bankruptcy in 2020 during a dip in bitcoin prices.\n\nSince the rules went into effect, no new crypto companies have applied to come to Missoula County, said Jennie Dixon of the county’s Department of Planning, Development and Sustainability.\n\nIn a September report, the Office of Science and Technology Policy recommended that any policy on cryptocurrency consider its environmental and electricity impact and called for federal agencies to conduct reliability assessments for crypto mining and explore environmental standards.\n\nThe report also said that regulators could work with Congress on possible energy conservation standards for the industry.\n\nThe Office of Science and Technology Policy and the Department of Energy did not respond to requests for comment from E&E News about future regulations.\n\nEnvironmental regulations have chased crypto miners around the globe. A large share of the industry was housed in China until 2021, when the country’s government cracked down on mining and cryptocurrency transactions in part because of environmental concerns.\n\nMany companies relocated to coal-heavy Kazakhstan and the United States. A study published in the journal Joule found that, on the whole, the global industry used less renewable energy after that shift because of the power mix in the new locations.\n\nAmerican University’s Carmel said that as governments come to grips with the environmental impact of the industry, bitcoin miners are “drifting from country to country to find an unregulated environment.” Right now, he said, the United States offers a balance of unregulated sites and the potential for cheap power.\n\nA path forward\n\nOn the other hand, some states are instead encouraging cryptocurrency miners to move in, eager to have an emerging technology take root there. And the miners say that despite the concerns elsewhere, they can be responsible — and beneficial — grid participants.\n\nWyoming lawmakers have considered legislation that would create deregulated power zones for large industrial customers, allowing them to operate off the regulated grid and get massive quantities of power at low prices. Supporters say that could further enable renewables to be built to support those operations, while detractors have warned it could weaken the business model for existing utilities.\n\nTexas has actively recruited cryptocurrency miners, with at least 30 companies building operations there.\n\nAccording to data from the Electric Reliability Council of Texas (ERCOT) — the grid operator covering about 90 percent of the state’s power load — cryptocurrency miners consumed about 477 megawatts of continuous consumption per day over a 291-day period in 2022. ERCOT estimates that 1 MW can power 200 homes during times of peak demand.\n\nFor a grid that saw widespread blackouts in 2021, adding a load of that size has raised reliability questions.\n\nIn December, ERCOT announced a voluntary program that would allow bitcoin miners to reduce power during high demand periods, building on a pilot launched last summer. That can reduce the grid’s demand during winter storms and heat waves, while also offering crypto mines a potential source of income by selling back power when prices are higher.\n\nRhodes, the Texas researcher, said his research shows that under certain conditions a flexible cryptocurrency industry could result in more renewables being added to the grid because they offer a low-cost source of power that would not need to run continuously.\n\nBut, he added, matching “controllable load with uncontrollable generation” would require companies to “be economically flexible.”\n\nBlockware’s Burnett said that similar demand response programs could offer a responsible path forward for the mining industry, soaking up excess power from renewables and selling it during peak times.\n\n“When you’re in demand response mode, you enable consumers to have power without paying these ridiculous prices,” Burnett said. “We’re talking about energy that would already be wasted during normal times that can be used to mine.”\n\nOn the flip side, University of Houston energy fellow Ed Hirs wrote in a Barron’s editorial that allowing large users to sell back to the grid amounted to “cronyism” that would drive up prices for other consumers.\n\nEven with demand response, critics say that adding significant load to a national grid in the midst of an energy transition is likely to keep fossil fuel plants online longer.\n\nSustainable Bitcoin Protocol, a new company backed by major bitcoin miners, is seeking to put heft behind the environmental promise by offering transferrable assets representing coins mined with 100 percent clean power.\n\n“We want to make sure there’s no greenwashing in bitcoin,” said Elliot David, Sustainable Bitcoin Protocol’s head of climate strategy and partnerships, alluding to the practice of making something appear more environmentally friendly than it is.\n\nThe company will use third-party platforms to track the energy sources going into a mining company, then offer a separate certificate similar to a renewable energy certificate to that company, which can be sold on the market.\n\nDavid said the company doesn’t just want to push existing miners to use renewables, but will eventually make the full industry climate positive as it expands.\n\n“Bitcoin basically converts and monetizes electricity into a globally liquid currency,” he said. “So a place with high energy costs could use it to enable and unleash clean energy development. That’s why we want to maximize green sources.”\n\nBut those efforts can only be considered successful if you think that cryptocurrency mining is a necessity, said Carmel, the technology professor.\n\n“On a micro level, crypto mining companies may use alternative energy sources … and may work on a dynamic basis on the grid, which is good. But on a macro level, we have a responsibility to reduce the environmental impact of any industry and of course any pollution,” Carmel said. “That forces you to consider the main question: Is there a higher purpose to crypto, or is this just a Las Vegas casino?”"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTE1L2JpdGNvaW4tanVtcHMtdG8taGlnaGVzdC1zaW5jZS1hdWd1c3QtYXMtcmVndWxhdG9yeS1jb25jZXJuLWViYnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Jumps to Highest Since August as Regulatory Concern Ebbs - Bloomberg",
        "content": "Bitcoin rose to the highest level since August on Wednesday, gaining for a second day as a decrease in risk aversion helps to temper concerns about a widening crackdown by US regulators.\n\nThe largest cryptocurrency by market value jumped by 8.2% to $24,083 as of 4:19 p.m. in New York. The increase is the biggest one-day gain in about a month. Smaller digital tokens such as Ether, Cardano and Polkadot also rallied."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTE2L2JpdGNvaW4tanVtcHMtdG93YXJkLTI1LTAwMC1hcy1jcnlwdG8tbG9va3MtcGFzdC11cy1yZWd1bGF0b3J5LWNyYWNrZG93btIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Jumps Toward $25000 as Crypto Looks Past US Regulatory Crackdown - Bloomberg",
        "content": "A rally in Bitcoin took the token above $25,000 for the first time since August amid broad gains in crypto markets as investors shook off concerns about a US regulatory clampdown.\n\nThe largest digital asset rose as much as 3.4% to $25,002 as of 10:57 a.m. in New York. Smaller tokens such as Ether , Cardano and Avalanche also pushed higher."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjEyMjk4L2JpdGNvaW4tcHJpY2UtcmVhY2hlcy02LW1vbnRoLWhpZ2gtYWJvdmUtMjQwMDDSAVZodHRwczovL3d3dy50aGVibG9jay5jby9hbXAvcG9zdC8yMTIyOTgvYml0Y29pbi1wcmljZS1yZWFjaGVzLTYtbW9udGgtaGlnaC1hYm92ZS0yNDAwMA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price reaches 6-month high above $24,000 - The Block",
        "content": "Bitcoin reached its highest point since Aug. 17, and its drawdown in 2022 might have something to do with it.\n\nThe leading cryptocurrency by market cap was trading at $24,260 by 5:30 p.m. EST, up 9%, according to TradingView data.\n\nBitcoin plunged 65% in 2022, which makes it an interesting liquidity play, according to Noelle Acheson, former head of market insights at Genesis.\n\n\"BTC is one of the most sensitive liquidity plays right now – its whopping drawdown last year, its lack of cash flows to discount, its strong floor given its various use cases,\" she said.\n\nRELATED INDICES See crypto indices\n\nLower volatility in stocks and bonds, lower oil prices, and a weakening U.S. dollar have benefited bitcoin. The U.S. dollar index — a measure of the U.S. dollar versus a basket of six other currencies — has surrendered a significant portion of its gains from last year. The DXY reached a 24-year high of around 114 in September.\n\nWhile there are other risk assets sensitive to a liquidity recovery, none has experienced as significant a drawdown as bitcoin — which benefits from \"long-term accumulators who see BTC as a store of value.\" The cryptocurrency also benefits from having no cash flows to discount, Acheson added, making it less susceptible to higher rates than stocks and less sensitive to adverse economic news coming down the line.\n\n\"What it has is actual, potential, and growing utility, the valuation of which will move more on narrative than data,\" Acheson said, adding, \"BTC's narrative is multi-faceted; this also lends its floor strong support. For some, it's a store of value; for others, an early-stage liquid tech investment; for many, pure speculation, partially based on narratives driven by the first two. Complicated and fascinating.\""
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMi8xNS90aGUtc2VjLWlzLXRha2luZy1haW0tYXQtcGF4b3MtYW5kLWFubm95aW5nbHktaXRzLWdvb2QtZm9yLWJpdGNvaW4v0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzAyLzE1L3RoZS1zZWMtaXMtdGFraW5nLWFpbS1hdC1wYXhvcy1hbmQtYW5ub3lpbmdseS1pdHMtZ29vZC1mb3ItYml0Y29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "The SEC Is Taking Aim at Paxos and (Annoyingly) It’s Good for Bitcoin - CoinDesk",
        "content": "If the U.S. government instead intends to regulate stablecoins harshly in an attempt to introduce its own central bank digital currency (CBDC) with the same or worse transparency and strong-arm people into choosing it from a menu with only one option, then what have we actually achieved here? The attitude that “Uncle Sam knows best” is exactly why our institutions are the way they are now. U.S. stablecoins wouldn’t exist if the current banking infrastructure expanded access to financial services like permissionless stablecoin protocols rather than excluding half the world's population."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNpbmdsZS1kYXktcHJpY2Utc3VyZ2UtbGlua2VkLXRvLWJpbGxpb25zLWluLXVzZGMtaW5mbG930gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin single-day price surge linked to billions in USDC inflows - Cointelegraph",
        "content": "Bitcoin (BTC) hit a six-month high of $24,800 on Feb. 16, registering a double-digit surge of 15%.\n\nThe single-day Bitcoin price surge took many by surprise, given February has been historically bearish for the top cryptocurrency. BTC’s price rose by $1,820 in a single day, making it the biggest green day for the top cryptocurrency in six months.\n\nOne-day Bitcoin price chart. Source: TradingView\n\nMany people attributed the BTC price surge to several factors, including a rise in dollar value and declining inflation. On-chain data indicates the current price momentum can be traced back to a mysterious fund that started pouring money into the crypto market on Feb. 10.\n\nAccording to data from Lookonchain, nearly $1.6 billion in institutional funds have flowed into the crypto market over the past six days. Most of the $1.6 billion flowed from stablecoins, especially Circle-issued USD Coin (USDC). The owner of the funds first withdrew their USDC from Circle and then sent it to various exchanges.\n\nUSDC withdrawal from Circle. Source: Lookonchain\n\nThere were three notable wallets whose funds were traced from Circle to various exchanges. First, a wallet address starting with “0x308F” withdrew 155 million USDC from Circle and transferred to exchanges since Feb. 10. The second wallet address starting with “0xad6e” withdrew 397 million USDC from Circle and sent it to various exchanges, and a third wallet starting with “0x3356” withdrew 953.6 million USDC from Circle and transferred to exchanges around the same time.\n\nWallets moving funds from Circle to exchanges. Source: Lookonchain\n\nThe Bitcoin price surge comes just days after the top cryptocurrency hit its first-ever weekly death cross. The death cross appears on a chart when an asset’s short-term moving average, usually the 50-day, crosses below its long-term moving average, usually the 200-day. Despite the bearish nature of the pattern, the death cross has been followed by above-average short-term returns in recent years.\n\nThe crypto community reacted differently, with Bitcoin proponents calling it the start of another bull run. Samson Mow commented on the price surge, “BTC price is still below the 200 WMA, which is 25k. Bitcoin trading below the 200 WMA is an anomaly.” In each of its major market cycles, Bitcoin’s price historically bottoms out around the 200-week moving average. Others called the recent price surge a bear trap while warning that large players are cashing out."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWRlcml2YXRpdmVzLWxvb2stYS1iaXQtb3ZlcmhlYXRlZC1idXQtZGF0YS1zdWdnZXN0cy1iZWFycy1hcmUtb3V0bnVtYmVyZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price derivatives look a bit overheated, but data suggests bears are outnumbered - Cointelegraph",
        "content": "Bitcoin (BTC) price rallied over 12% on Feb. 15, marking the highest daily close in more than six months. Curiously, the movement happened while gold reached a 40-day low at $1,826, indicating some potential shift in investors’ risk assessment for cryptocurrencies.\n\nA stronger-than-expected U.S. inflation report on Feb. 14 showed consumer prices rising 5.6% year-on-year, followed by data showing resilient consumer demand, causing traders to rethink Bitcoin’s scarcity value. U.S. retail sales increased by 3% in January over the previous month — the highest gain in almost two years.\n\nOn-chain data indicates that the recent gains can be traced back to a mysterious institutional investor that started buying on Feb. 10. According to Lookonchain’s data, nearly $1.6 billion in funds have flowed into the crypto market between Feb. 10 and Feb. 15. The analysis showed that three notable USD Coin (USDC) wallets sent out funds to various exchanges around the same time.\n\nMore importantly, news emerged that the Binance exchange is preparing to face penalties and settle eventual outstanding regulatory and law-enforcement investigations in the U.S., according to a Feb. 15 Wall Street Journal report. The exchange’s chief strategy officer, Patrick Hillmann, added that Binance was “highly confident and feeling really good about where those discussions are going.”\n\nLet's look at derivatives metrics to understand better how professional traders are positioned in the current market conditions.\n\nBitcoin margined longs entered the “FOMO” range\n\nMargin markets provide insight into how professional traders are positioned because it allows investors to borrow cryptocurrency to leverage their positions.\n\nFor example, one can increase exposure by borrowing stablecoins to buy (long) Bitcoin. On the other hand, Bitcoin borrowers can only bet against (short) the cryptocurrency. Unlike futures contracts, the balance between margin longs and shorts isn’t always matched.\n\nOKX stablecoin/BTC margin lending ratio. Source: OKX\n\nThe above chart shows that OKX traders’ margin lending ratio increased between Jan. 13 and Jan. 15, signaling that professional traders added leverage long positions as Bitcoin price broke above the $23,500 resistance.\n\nOne might argue that the demand for borrowing stablecoins for bullish positioning is excessive as a stablecoin/BTC margin lending ratio above 30 is unusual. However, traders tend to deposit more collateral after a few days or weeks, causing the indicator to exit the FOMO level.\n\nOptions traders remain skeptical of a sustained rally\n\nTraders should also analyze options markets to understand whether the recent rally has caused investors to become more risk-averse. The 25% delta skew is a telling sign whenever arbitrage desks and market makers are overcharging for upside or downside protection.\n\nThe indicator compares similar call (buy) and put (sell) options and will turn positive when fear is prevalent because the protective put options premium is higher than risk call options.\n\nIn short, the skew metric will move above 10% if traders fear a Bitcoin price crash. On the other hand, generalized excitement reflects a negative 10% skew.\n\nRelated: $24K Bitcoin — Is it time to buy BTC and altcoins? Watch Market Talks live\n\nBitcoin 60-day options 25% delta skew: Source: Laevitas\n\nNotice that the 25% delta skew has been neutral for the past two weeks, signaling equal pricing for bullish and bearish strategies. This reading is highly unusual considering Bitcoin gained 16.2% from Jan. 13 to Jan. 16 and typically, one would expect excessive bullishness causing the skew to move below negative 10.\n\nOne thing is for sure, a lack of bearish sentiment is present in futures and options markets. Still, there are some concerning data on excessive margin demand for leverage buying, although it is too soon to call it worrisome.\n\nThe longer Bitcoin remains above $24,000, the more comfortable those pro traders become with the current rally. Moreover, bears using futures markets had $235 million liquidated between Jan. 15 and Jan. 16, resulting in a decreasing appetite for bearish bets. Hence, the derivatives markets continue to favor bullish momentum.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMTUvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLWhvbGRzLXN0ZWFkeS1vbi1jcGktZGF0YS1hcmUtaW52ZXN0b3JzLXVuZGVjaWRlZC_SAXpodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzE1L2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1ob2xkcy1zdGVhZHktb24tY3BpLWRhdGEtYXJlLWludmVzdG9ycy11bmRlY2lkZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Holds Steady on CPI Data. Are Investors Undecided? - CoinDesk",
        "content": "Stablecoin issuer Paxos acknowledged that it had received a Wells Notice from the U.S. Securities and Exchange Commission, indicating a possible enforcement action based on the charge that its Binance USD constitutes an unregistered security. Bain Capital Crypto partner and head of regulatory and policy TuongVy Le weighed in. Plus, MarketVector Indexes digital asset product strategist Martin Leinweber shared his crypto markets analysis after CPI for January rose 0.5% versus 0.1% a month earlier. And, the Moskowitz Law Firm managing partner Adam Moskowitz reacted to the legal battle brewing for control over private FTX cases."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vd3d3LmxlZGdlci5jb20vYWNhZGVteS93aGF0LWlzLXdyYXBwZWQtY3J5cHRv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "What Is Wrapped Crypto? - Ledger",
        "content": "What Is Wrapped Crypto?\n\nBy Mohammad Musharraf\n\nRead 6 min Medium\n\nSHARE\n\nKEY TAKEAWAYS — A wrapped crypto token is a tokenized representation of a particular cryptocurrency, with the exact same value, that is operable on another blockchain.\n\n\n\n— Wrapped tokens make it easy to transfer value across blockchains, which otherwise lack interoperability, and power a cross-chain decentralized finance ecosystem.\n\n\n\n— Some of the most popular wrapped tokens are WBTC, WETH, WMATIC, and renBTC.\n\nOne of the biggest challenges facing the blockchain and crypto space is the lack of interoperability of different blockchains and their respective assets.\n\nThat means you cannot directly transfer a cryptocurrency based on chain X to chain Y and use it there. Blockchains, by design, cannot enable such cross-chain digital asset support.\n\nWith decentralized finance (DeFi) predominantly on Ethereum, but coins and tokens existing across multiple other blockchains, supporting assets cross-chain has become crucial for cryptocurrencies and DeFi.\n\nThis is where wrapped crypto tokens come into the picture. You might have heard people mention “wrapped Bitcoin” or “wrapped Ether”. But what are they exactly?\n\nWhat Is Wrapped Crypto?\n\nWrapped crypto or wrapped tokens are digital assets that; represent the exact value of an original cryptocurrency from a different blockchain or follow a different token standard to the chain its on. WBTC and WETH are good examples of the former and latter respectively.\n\nWrapping original tokens to mint new tokens compliant with another blockchain allows users to use assets from one chain on another chain entirely.\n\nFor instance, let’s use Bitcoin (BTC) as an example. By design, bitcoin can originally only function inside the Bitcoin ecosystem. But what if you want to use the world’s largest cryptocurrency on the world’s largest dApp blockchain Ethereum?\n\nIn short, there’s a way to deposit your BTC from your Bitcoin wallet and receive wrapped Bitcoin (WBTC) — an ERC-20 token — in your Ethereum wallet.\n\nThe WBTC you receive will be a wrapped crypto token. In short, it represents the original value of the BTC that you deposited. Owning that wrapped Bitcoin then means you can use Ethereum-based decentralized application that support wrapped bitcoin transactions. Put simply, you can transfer the value of bitcoin while using Ethereum’s infrastructure.\n\nAs mentioned, “wrapping” is a just figurative term used to describe the minting or creation of a new token that derives its value from an underlying digital asset.\n\nTo understand this better, let’s take a look at how wrapped crypto actually works.\n\nHow Do Wrapped Crypto Tokens Work?\n\nSo far, you know that a wrapped token is an equivalent representation of a cryptocurrency based on a different blockchain. Or, in some cases, it is a representation of an asset based on the same chain, but having a different token standard.\n\nBut how do we exactly “wrap” these tokens?\n\nLet’s go back to wrapped Bitcoin (WBTC) for a moment.\n\nFor starters, there are three types of entities involved in the wrapping of BTC to create an equivalent amount of WBTC on Ethereum:\n\n1. Merchants: Entities that lock their BTC to mint new WBTC on Ethereum or, conversely, burn WBTC to free up the locked BTC.\n\n2. Custodians: Organizations responsible for securing the BTC reserves on the Bitcoin network.\n\n3: Wrapped Tokens DAO: A set of organizations that constitute a decentralized autonomous organization (DAO) and collectively decide what custodians and merchants to add or remove to WBTC Network. The organizations in the DAO use a multi-sig wallet to make these decisions.\n\nNow that you understand the three key players in WBTC, let’s look at a simple step-by-step process of token wrapping:\n\nStep 1: A merchant sends 10 Bitcoin (BTC) to the custodian.\n\nStep 2: The custodian adds it to a reserve (a crypto wallet) whose proof is published on-chain.\n\nStep 3: An equal amount of ERC-20 compatible WBTC is minted on Ethereum.\n\nMerchants can follow a similar process to request to burn WBTC on the Ethereum blockchain and free an equal number of BTC on the Bitcoin network.\n\nWhile WBTC relies on a DAO model to ensure security and decentralization, wrapped tokens are issued either by centralized entities or smart contracts.\n\nHowever, most DeFi proponents advise against using a wrapped token managed by a centralized entity. This is because a central entity may, at any point, defraud its users by tampering with the asset reserves. These reserves determine a wrapped token’s value. Thus, in situations like these, a wrapped token can lose significant value in a short time.\n\nApart from WBTC, there are several other wrapped tokens such as WETH, WMATIC, renBTC, WFTM. Across the DeFi space, there are multiple wrapper platforms issuing such tokens.\n\nNow that we’ve understood how wrapped tokens work, let’s check out what benefits they offer.\n\nBenefits of Wrapped Crypto Tokens\n\nThere are 197 countries in the world using around 180 different currencies. These countries have a combined total of thousands of banks.\n\nImagine a world where you were not able to send money from one bank to the other. Further still, imagine you visited a country that didn’t allow you to exchange your currency for its own. That would make for a terrible financial ecosystem, where people would fail to experience anything beyond the limits of their own country or bank.\n\nCurrently, the same would be the case with users of different blockchains if not for wrapped tokens.\n\nAt the time of writing, BTC makes up over 40% of the crypto market’s value. Following BTC is ETH, making up almost 20% of the market capitalization.\n\nThanks to WBTC and other wrapped representatives of BTC, Bitcoin users no more need to stay cut off from Ethereum, which boasts the largest DeFi ecosystem. They can simply go to a decentralized exchange and purchase WBTC. That way, the user gets the same exposure to BTC, but on Ethereum.\n\nBut it’s not just about Bitcoin and Ethereum. In fact, there are a wide variety of wrapped tokens for transferring value between popular chains, such as Polygon, Solana and Avalanche.\n\nWith the help of wrapped tokens, users don’t need to transfer their assets on one chain to a centralized exchange, convert it to another asset, and send it to another compatible chain. Instead, they can get their hands on a wrapped token representing their original asset.\n\nWhat Is Wrapped Bitcoin (WBTC)?\n\nWrapped Bitcoin (WBTC) is a joint initiative run by three Web3 entities: Kyber, Ren, and BitGo. These are three of the 15 entities in total that make up the Wrapped Tokens DAO. Collectively, they are responsible for minting and burning wrapped bitcoin. They also manage, i.e. add or remove, merchants and custodians.\n\nA total of 65 projects, protocols, and companies currently make up the Wrapped Bitcoin Network. These include lending and borrowing platforms, decentralized exchanges, centralized custodians. Wrapped Bitcoin is a now an integral part of many leading platforms and apps; from DeFi to much more.\n\nPlus, it’s really easy to get started. Users can directly exchange their existing ERC-20 tokens to wrapped Bitcoin and back as it behaves just like any other fungible Ethereum token.\n\nWrapped Tokens on Ethereum\n\nAt the time of writing, the total value locked in DeFi is over $42 billion. More than $25 billion of that is on Ethereum, making it the single largest DeFi ecosystem. That only makes it practical for almost every project to make its token compatible with Ethereum token standard ERC-20.\n\nWrapped crypto comes to the rescue for projects building on different blockchains. Wrapping tokens, therefore making them ERC-20 compliant, enables a project’s users to experience the speed and scalability of other chains. Plus, all of this is possible without missing out on Ethereum’s large user base and liquidity.\n\nIn fact, since ETH was created before the ERC-20 standard was established, it does not comply with ERC-20. Hence, we use a wrapped version of ETH called ‘wrapped ether’ (WETH) across DeFi protocols on Ethereum.\n\nHow To Secure Wrapped Crypto Tokens\n\nWrapped tokens, or crypto tokens or any kind for that matter, are a form of digital value. And much like physical assets in the real world, protecting your digital assets (such as wrapped tokens) is imperative.\n\nSpeaking of security, nothing comes close to hardware wallets such as Ledger Nano S Plus, Nano X, and Stax in terms of securing your assets.\n\nLedger wallets keep your private keys and seed phrase offline at all times, ensuring no one can virtually tamper with or access your wrapped tokens. Despite your keys being offline, you can still access a wide range of DeFi protocols online through Ledger Live — a mobile and desktop application that connects with your Ledger wallet.\n\nThis brings maximum security to your wrapped tokens without compromising on your flexibility to use them across DeFi platforms.\n\nKnowledge is power"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXRvdWNoZXMtMjUwMDAtZm9yLWZpcnN0LXRpbWUtc2luY2UtYXVndXN0LWFzLTIwMjMtY3J5cHRvLXJhbGx5LWNvbnRpbnVlcy0xODE2MTU1OTIuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin touches $25,000 for first time since August as 2023 crypto rally continues - Yahoo Finance",
        "content": "Bitcoin rose as much as 9% on Thursday to trade above $25,000 for the first time in six months as the 2023 crypto rally continues.\n\nLate Thursday morning, bitcoin (BTC-USD) traded as high as $25,104, bringing year-to-date gains for the world's biggest cryptocurrency to north of 50%.\n\nThe latest rally in bitcoin comes after this week's inflation data showed price pressured in the U.S. economy are both \"hot and cold.\"\n\nBetween Feb. 13-15, $112 million in bitcoin short positions were liquidated, or $84 million net of long positions, according to crypto derivatives aggregator CoinGlass.\n\n\"There was a combination of spot market buying and short-liquidations who may have been late to the party and thought going short after C.P.I. was a good long term macro trade,\" said Christopher Newhouse, a crypto options trader for GSR.\n\nOver the two-day period that followed inflation data published last month — which also sparked a bitcoin rally — $219 million worth of short positions on bitcoin were liquidated, or $95 million as net of long positions.\n\n\"Just goes to show how short-term price action driven by momentum and liquidations can overcome any longer term views people put on,\" Newhouse added.\n\n\"We've had an amazingly strong rally … I'm surprised at the velocity of it,\" Michael Novogratz, founder and CEO of Galaxy Digital, said at a conference on Wednesday.\n\n\"When I look at the price action, when I look at the excitement of customers calling that FOMO [is] building up, it wouldn't surprise me if we're at 30,000 by the end of the quarter,\" Novogratz added.\n\nMike Novogratz, founder and chief executive officer of Galaxy Digital, gestures as he speaks during the Bitcoin Conference 2022 in Miami Beach, Florida, U.S. April 6, 2022. REUTERS/Marco Bello (Marco Bello / reuters)\n\nAs bitcoin leads crypto’s rally, all eyes are on its 200-week moving average, which is set at the $25,000 price marker according to Yahoo Finance data.\n\nTotal crypto volume across the market has risen 22% to $1.8 trillion in the last week, according to crypto data aggregator Nomics. Trading in North America, however, has fallen more than 15% to $64 billion over this period.\n\nStory continues\n\nElsewhere on Wednesday, legendary investor Charlie Munger, a longtime critic of cryptocurrencies, said of crypto trading and investing: \"It's worthless, it's crazy, it's not good, it'll do nothing but harm, it's antisocial to allow it.\"\n\nIn recent weeks, U.S. financial authorities have ramped up actions in the sector. In January, banking regulators issued a joint statement warning of the risks assumed by banks that touch crypto activities.\n\nThe SEC has also picked up enforcement, fining exchange Kraken $30 million last week for its crypto staking program, the fourth of action against a U.S. crypto firm in the past six weeks.\n\nIn a Senate Banking Committee hearing Tuesday, Committee Chair Sen. Sherrod Brown (D-OH) lambasted industry firms and asked for the Committee to find common ground in order to pass cohesive legislation for crypto.\n\n\"The regulators understand that bitcoin is different, it's not a security. It doesn't have a centralized protocol with with a small group of programmers were in charge of it,\" said bitcoin investor James Lavish.\n\n\"With that said, it's going to be volatile and there's going to be another sell off, especially if we head into a recession so while it's great to see the price stabilize and move higher, I would just caution people from getting too excited.\"\n\nClick here for the latest crypto news, updates, values, prices, and more related to Bitcoin, Ethereum, Dogecoin, DeFi and NFTs\n\nRead the latest financial and business news from Yahoo Finance\n\nDownload the Yahoo Finance app for Apple or Android\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and YouTube"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmJ1aWx0aW5jaGljYWdvLm9yZy8yMDIzLzAyLzE2L2NoaWNhZ28tZnV0dXJlLTUtY29tcGFueS13YXZsYWtlLXExLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "This Startup Is Bringing Bitcoin Payments to the Music, Podcast Industries - Built In Chicago",
        "content": "Wavlake and co-founders Sam Means (left) and Michael Rhee (right). | Image: Wavlake / Built In\n\nSure the latest initiatives from the Teslas, Apples and Googles of the industry tend to dominate the tech news space — and with good reason. Still, the tech titans aren’t the only ones bringing innovation to the sector.\n\nIn an effort to highlight up-and-coming tech companies, Built In launched The Future 5 across seven major U.S. tech hubs. Each quarter, we will feature five early-stage tech companies, nonprofits or entrepreneurs in each of these hubs who just might be working on the next big thing. Read our round-up of Austin’s rising companies from last quarter here.\n\n* * *\n\nOver the last few years, several tech companies — including many based in Chicago — have released new products that disrupted the music industry. Now, Wavlake is looking to make its mark on the industry after raising pre-seed funding and announcing plans to grow its artist streaming payment platform.\n\nWavlake was co-founded by musicians and producers Michael Rhee and Sam Means. Through the use of blockchain and Web3 tools, their platform helps support artists financially. Wavlake is a music and podcast streaming platform that allows artists to receive Bitcoin payments from their fans.\n\n“I had been frustrated with music recommendation algorithms on streaming platforms for a long time. Then I learned about Lightning Network and how it enabled people to transmit Bitcoin to each other almost instantly around the world. The technology seemed like a great way to build a new kind of music streaming service that better-connected artists and fans,” Rhee told Built In via email.\n\nIn December, Wavlake closed a pre-seed round led by Trammell Venture Partners, an Austin-based VC firm focused on backing early-stage Bitcoin-native startups. Wavlake did not disclose the amount of capital it raised; however, it said the funding would be put toward growing the company and its products.\n\nWe’re hoping this helps inspire other companies and developers to make new and interesting music applications that are both fairer to artists and more enjoyable for fans.”\n\nWith the new capital, Wavlake plans to onboard more artists and creators onto its platform. Over the next year, Rhee and Means said they will also build out the Wavlake team and improve the platform’s foundation to better accommodate its growing artist base.\n\nBy continuing to build blockchain-enabled tools for creators, Wavlake hopes it can inspire others to create new technologies to support artists and their work.\n\n“We aren’t building any custom blockchain technology or issuing any kind of special token,” Rhee said. “We’re hoping this helps inspire other companies and developers to make new and interesting music applications that are both fairer to artists and more enjoyable for fans.”\n\nMore Chicago Future 5 CoverageThe Dibz Aims to Combat Clothing Waste With Online Shopping Platform"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LnZveC5jb20vdGhlLWdvb2RzLzIzNTk5ODQ1L2NyeXB0by1iaXRjb2luLWJsYWNrLWludmVzdG9ycy1mdHgtZnJlZWRtYW5zLWJhbmstY2l2aWwtd2Fy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Crypto failed Black investors — and so has banking - Vox.com",
        "content": "Crypto was sold as a sort of lifeline to Black communities, as a way to build wealth outside of the mainstream financial system that many people, understandably, mistrust. The crypto complex told the story of a potential for riches, a way for people left out of more traditional financial apparatuses to get in, bombarding the Black population with marketing and ads featuring celebrities such as LeBron James and Spike Lee. The industry made it clear: If you didn’t get in, well, you might just be missing out. Many Black investors picked up what marketers were putting down, investing in cryptocurrency at higher rates than their white counterparts — especially Black investors under 40.\n\nNow, cryptocurrencies are trading well below their 2021 highs. Many NFTs have plummeted in value and are essentially worthless. Some high-profile projects and companies in the space have imploded, and it’s not clear what, if anything, customers who put their money into those entities will get back. All is not totally lost. Investors who got into cryptocurrencies such as bitcoin and ethereum in the early days are still ahead (assuming they haven’t lost the coins or had them scammed away). Crypto often goes through boom and bust cycles, and it’s unlikely the ecosystem is dead.\n\nStill, Black investors were not generally among that early group to dive into crypto, as the Atlantic’s Annie Lowrey notes. Instead, many of them got in late, and some appear to have bought high and sold low. According to a recent LendingTree survey, Black crypto investors were likelier than white crypto investors to say that they had borrowed money to make their investment and that they had sold their crypto for less than it was worth. In other words, some Black investors have been left holding the bag.\n\n“The idea that crypto is somehow providing an avenue that’s easier than other forms doesn’t pan out. It’s not as democratizing and welcoming as suggested,” said Algernon Austin, director of race and economic justice at the Center for Economic and Policy Research, who has spoken out in the past about the risks of crypto to Black communities. “The crypto industry is concerned about the crypto industry, it’s not concerned about Black wealth.”\n\nIt’s a familiar tale throughout America’s history, explained Mehrsa Baradaran, a law professor at the University of California Irvine and author of multiple books on financial inequality and the racial wealth gap. She drew parallels to housing contract sales offered to Black communities in the wake of the New Deal in the 1950s and ’60s and to subprime home loans prior to the global financial crisis disproportionately made to communities of color. In both instances, Black consumers were targeted with predatory financial products existing somewhat on the margins.\n\nMost notably, she pointed to the Freedman’s Savings and Trust Company, more colloquially known as the Freedman’s Bank, a private savings bank established by Congress in the wake of the Civil War meant to help formerly enslaved people establish financial stability. The endeavor lasted for nine years and ended in disaster — its funds were mishandled, and eventually, the bank collapsed. Many depositors never saw their money again.\n\n“You have the perfect conditions that led to the Freedman’s Bank, that led to the subprime crisis, that led to the contract sales after the New Deal, which is that capitalism is undergoing some shift and something is wrong and the government needs to handle it, but instead, they leave out certain people and then some terrible, exploitative incentive gets born, and someone is always going to step into that,” Baradaran said.\n\n“It is a looting of people’s money”\n\nIn the 19th century, that took the shape of a bank that squandered Black people’s money and sowed skepticism of the financial system that persists today. In the 21st century, it was a pitch to build wealth through a new, largely unregulated technology that would later see the bottom substantially fall out. “It is a looting of people’s money,” Baradaran said.\n\nTo back up a bit — or, rather, a lot, to after the Civil War — the US Congress established the Freedman’s Bank in 1865. It was meant to serve as a savings institution for formerly enslaved people and their families, and deposits were supposed to be invested in “stocks, bonds, Treasury notes, or other securities of the United States.” Other loans weren’t initially intended to be made.\n\nAs Baradaran explained in her 2017 book, The Color of Money: Black Banks and the Racial Wealth Gap, a bank wasn’t exactly an ideal solution — giving formerly enslaved people land would have been better. “Blacks had not asked for the bank, but land grants having been foreclosed on by violence and southern retrenchment, the bank was a stand-in,” she wrote. “The reformers promised the Black community that the bank was the preferred and proper means by which they would achieve land ownership on their own.”\n\nThe Freedman’s Bank opened in New York in April of 1865 and over the course of a few years built up 19 branches. Eventually, the bank hit 37 branches and had tens of thousands of depositors. People were allowed to open accounts with as little as 5 cents, and most deposits were under $60. The bank struggled financially, and in 1867, its headquarters were moved to Washington, DC, and a new group of bankers, politicians, and businessmen took the wheel. Congress changed the bank’s charter to let the people now running the show invest in real estate and railroads, and they started to make risky bets. When financial panic hit in 1873, it took an enormous toll on the Freedman’s Bank, and the value of its investments plunged. There was a run on several branches, meaning many depositors tried to get their money out all at once, and by the time Congress sent regulators to take a look under the hood at what was going on, it was largely too late.\n\nIn 1874, abolitionist and writer Frederick Douglass was brought in to run the bank, but he quickly realized it was “the black man’s cow, but the white man’s milk.” Less than two months later, he described the situation as being “married to a corpse” and recommended Congress shutter the bank, which it did in June of that year. The bank’s assets were not backed by the federal government — a fact many customers had not realized — and many customers’ deposits were gone.\n\nIn The Souls of Black Folk, W.E.B. Du Bois wrote that “not even ten additional years of slavery could have done so much to throttle the thrift of the freedmen as the mismanagement and bankruptcy of the series of savings banks chartered by the Nation for their special aid.”\n\n“What should have happened in 1865 is that the treasonous Southerners should have lost their land because they had fought for the right to maintain slavery, and the people who for hundreds of years had grown the land should have gotten it,” Baradaran said in an interview. Instead, they got a poorly run bank, their money was squandered on irresponsible investments, and they were left with nothing.\n\nWhen the mainstream system doesn’t work — and it really doesn’t for many Black Americans — it’s natural to look elsewhere for something that does\n\nThe incident contributed to an ongoing mistrust of banks among Black communities. And in the modern day, it’s also hard not to see the parallels between the Freedman’s Bank and the most recent crypto implosion, where once again upstart institutions meant to be a new avenue for people to build wealth have gone bottoms-up or, at the very least, are teetering. “This is what you see with bitcoin, you get the scammers and the hucksters and the fraud, people who come in and say, ‘Look, we’re going to exploit people’s genuine desire to build wealth in a fucked-up system,’” Baradaran said.\n\nWhen the mainstream system doesn’t work — and it really doesn’t for many Black Americans — it’s natural to look elsewhere for something that does. That’s where the appeal of something like crypto resides. People are told it’s a way to establish financial independence and freedom and get away from the institutions that have wronged them in the past. It’s a prospect that’s easy to want to believe in.\n\n“It’s important to recognize that the Black population has more economic hardship and economic insecurity than the white population or the US population overall on average. You have more poverty, higher rates of debt, higher rates of insecurity, unstable work hours, unaffordable housing, there are a number of financial stresses in the lives of many African Americans,” Austin said. “So when you’re worrying how you’re going to pay your bills regularly and how you’re going to get ahead and someone shows up and says, ‘I have the solution, and this will help you pay all your bills and help you pay your kids’ college and the house that you’ve always dreamed about,’ that’s pretty enticing.”\n\nCharlotte Principato, financial services analyst at polling firm Morning Consult, said Black Americans “show through their higher ownership of cryptocurrency than adults of other races or ethnicities that they are open to alternative forms of payment and investment outside the sphere of traditional finance” and that it’s “not surprising” that they’re interested in alternative assets given that the mainstream system has not served them well. “It makes sense that they would try to stake their claim and find success,” she said. “It is unfortunate that it is that way with such a speculative asset.”\n\nIn conversations with crypto proponents over the years, I’ve heard time and time again that it is specifically good for communities of color, that it’s solving a problem for the unbanked, meaning people without banking access, and the underbanked, people who have banking accounts but often rely on other financial services, such as payday loans and check-cashing services, in the day to day.\n\nIt’s an argument that’s nice to believe. It’s also one that often falls apart: With potential upside risk comes a lot of the downside risk we’re seeing today.\n\nFor one thing, it’s rare to hear people who work on financial inclusion more broadly offer up crypto as a solution. They’re much likelier to push for postal banking and public banking and advocate for more credit unions. It’s hard to see how a hyper-capitalist, unregulated system would avoid the mistakes our already-capitalist, sometimes lightly regulated system already entails. And to state the obvious here, the crypto industry is here to make money. Businesses in the space aren’t generally doing business out of the goodness of their hearts.\n\n“The marketing campaign is not out of generosity or philanthropy, that’s the business model, the business model requires getting as many people as possible so then prices go up,” Austin said. “It’s not an investment that’s built on providing any goods or service, so once you understand that, you understand you’re really resting on herd mentality, only then you have to go with the herd and then make sure to jump away before it goes off the cliff.”\n\nMany investors — including many Black investors — did not jump away soon enough.\n\nTo be sure, the crypto industry has not completely imploded, though many big names in the arena have. There are plenty of people who still say they believe it is an avenue for building wealth. Charlene Fadirepo, a regulator turned bitcoin activist, told me she thinks the 2022 market crash was an “incredible teachable moment” for crypto investors to become safe, smart, and confident. “To be honest, traditional banking doesn’t have a great track record dealing with Black consumers,” she said, an assertion that is hard to dispute. She still believes bitcoin, specifically, has an appeal in offering “financial autonomy,” though she’s somewhat dubious of other cryptocurrencies. “There are fundamentals that promote bitcoin as a long-term investment ... that is not the case for all cryptocurrencies,” she said.\n\nFadirepo recalled a recent class she was teaching on crypto in South Carolina where a Black woman in the class said she had lost $3,000 when Celsius, a now-bankrupt crypto lender, failed. The woman didn’t want people to feel bad for her, Fadirepo said, but wanted people to realize they need to protect their crypto by storing it in a “cold storage wallet,” meaning not on a third-party platform and not connected to the internet. “I could have talked for hours, but that one anecdote shifted the conversation in the room,” she said. “I see a bright side here, and that bright side is just encouraging a level of investor discipline and a real need to be informed.”\n\nThat people sometimes just need to learn lessons from their mistakes is something you hear often in investing; there’s a line of thought that loss is sometimes just an opportunity to do better moving forward. While often delivered with the best of intentions, the sentiment can feel hollow. Many times, investors aren’t clear on the rules of the game they’re playing, and the people they’re playing against — or the people who are running the game — aren’t forthcoming about what’s going on in the background. Placing the blame on the losers, especially when they’re set up to lose, happens time and time again.\n\n“It’s the double whammy of not only is your money stolen, but as far as anyone knows, it’s your fault, you should have known better,” Baradaran said. “It’s shocking how similar those arguments end up.”\n\n“If the system’s broken, let’s fix it”\n\nThere’s no denying the American financial system is in many ways stacked against Black investors and consumers. And the best way to address that might be to try to fix the system instead of creating new avenues or endeavors, whether the Freedman’s Bank or some crypto project, which have many of the same failings but without the guardrails.\n\n“If the system’s broken, let’s fix it, instead of saying, ‘Look, the system’s broken, let’s create this other system,’” Baradaran said, comparing it to deciding to go live on Mars because Earth is too screwed up. “It’s losing all the lessons that we had to learn the hard way in this financial system, which is that you need trust, you have to have trust. And if we allow fraud without regulation, there will always be fraud.”\n\nFraud and mistrust are what have led many Black consumers to faulty offers and products over and over again. The latest iteration is crypto, but it probably won’t be the last."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvZm91ci1yZWFzb25zLXdoeS1iaXRjb2luLWJ0Yy1pcy1kcml2aW5nLWhpZ2hlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Four Reasons Why Bitcoin (BTC) is Driving Higher - Nasdaq",
        "content": "Bitcoin's (BTC) price movement is on fire, and it is now testing a significant level of resistance that may open the floodgates for bulls and propel the BTC price far higher. Some traders may be perplexed, and are attempting to determine the true cause of the recent surge and if it will endure. Bitcoin's price has increased by more than 50 percent so far this year, and it has hit a price level of 24,900, a level not seen in almost six months. The crypto market lost around $1.4 trillion last year due to the industry's extreme instability.\n\nWe'll go over four different reasons behind Bitcoin's recent rise, and whether this surge is sustainable.\n\nReason number one\n\nWhenever Bitcoin's price shoots up, there is almost always a high sense of FOMO (Fear Of Missing Out) among traders and investors. Investors are aware that despite all the criticism, major frauds in the cryptocurrency field, and regulatory issues, bitcoin is a beast capable of leaving all these concerns in the dust and rallying like there's no tomorrow.\n\nThe instant bitcoin's price seems to be moving somewhat, it draws attention to itself, causing people to get anxious and believe they cannot afford to miss the chance again. Fear of missing out is one of the primary causes for the present action.\n\nReason number two\n\nA recent regulatory crackdown by U.S. regulators on the Kraken and Paxos exchanges had traders on edge from a fundamental perspective. The New York State Department of Financial Services instructed Paxos to cease the minting of BUSD, Binance's stablecoin. Stablecoins are generally understood to be a kind of cryptocurrency that is partly backed by real assets and partially backed by cash, bonds, or other comparable assets. The risk is that BUSD might be classed as a security by the SEC, and if that occurs, Paxos and Binance could face much larger problems.\n\nThe SEC earlier had sent a strong message to the industry when it penalized Kraken for their staking operation. The whole exchange-operated crypto staking industry is still at risk, since Coinbase's CEO has expressed similar worries. Investors must bear these risks in mind.\n\nNotwithstanding these regulatory requirements, the SEC continues to assert that Bitcoin is a commodity and not a security. Because of the imminent danger of being branded as a security, more investors feel comfortable placing their money in Bitcoin since it has already passed the SEC's labelling test, which was the greatest threat to Bitcoin's survival except its widespread adoption.\n\nReason number three\n\nIn terms of technical price movement, the BTC price continues to retain a strong correlation with equities, particularly the Nasdaq index. The index has increased by more than 16% so far this year as investors continue to purchase bargains after the technology sector saw a big sell-off in 2022. Bitcoin has outperformed the Nasdaq by more than three times year to date.\n\nAs a result of the improbable occurrence of a severe recession in the U.S. economy, the stock markets are expected to see more upward movement. If the risk rally gains further momentum and the connection holds, a robust bull trend might emerge.\n\nReason number four\n\nThe BTC price has been consolidating for an extended period of time, and only yesterday, with its new six-month high, did it break out of this consolidation zone. Now, all eyes will be on the next significant resistance level, which is the $30,000 mark. A breach of this resistance will allow the price to attack its next significant price level, which will be the psychologically significant 50K price level.\n\nAll four elements are contributing to the recent surge in the price of BTC.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMTYvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLXJvY2tldHMtcGFzdC0yNDdrLXRvLWhpdC02LW1vbnRoLWhpZ2gv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMi8xNi9maXJzdC1tb3Zlci1hc2lhLWJpdGNvaW4tcm9ja2V0cy1wYXN0LTI0N2stdG8taGl0LTYtbW9udGgtaGlnaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Rockets Past $24.7K to Hit 6-Month High - CoinDesk",
        "content": "BLUR tokens were airdropped to users of the Blur marketplace, with the airdrop amount depending on the total activity, network volume, and transactions made by each user on the platform. There were a total of three airdrop rounds. The first was for everyone who traded in the six months prior to the launch of the Blur marketplace, the second was for traders who actively listed on the Blur marketplace through November, and the third was for traders who placed bids on Blur."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4taGlnaGVzdC1hdWd1c3Qtc2hvcnQtcG9zaXRpb25zL9IBQGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4taGlnaGVzdC1hdWd1c3Qtc2hvcnQtcG9zaXRpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin breaches US$24,000 to reach highest price since August amid short position liquidation - Forkast News",
        "content": "Bitcoin broke through the US$24,000 price ceiling for the first time in two weeks to reach its highest price since mid-August in Thursday morning trading in Asia, as investors liquidated almost US$70 million of mostly short-position bets, according to data aggregator GlassNode. The short positions, or bets the price of Bitcoin would fall, had grown following a series of U.S. regulatory crackdowns this month on crypto services. Ether rose with the rest of the top 10 non-stablecoin cryptocurrencies, with Solana leading the gains.\n\nSee related article: Sam Bankman-Fried banned from using VPNs while on bail: Bloomberg\n\nFast facts\n\nBitcoin rose 9.4% in the last 24 hours to trade at US$24,318 as of 8 a.m. in Hong Kong, bringing its gains over the past seven days to 6%, according to CoinMarketCap data. Ethereum rose 7.5% to US$1,674, a total gain of 1.4% for the week.\n\nSolana jumped 9.4% to US$23.88, up 2.9% for the past seven days. Cardano added 8.3% to US$0.41, a weekly gain of 6.1% following the successful deployment of the network’s Valentine upgrade yesterday. The upgrade aims to make it easier for developers to build cross-chain applications on the Cardano blockchain.\n\nBNB rose 7.1% to US$317.39. The token is still down 3.2% after the New York Department of Financial Services told Paxos Trust Co. to stop issuing the U.S. dollar-pegged Binance USD (BUSD) stablecoin. BUSD is issued through a collaboration with Paxos and BNB’s issuer Binance Global Inc., which runs the world’s largest crypto exchange.\n\nThe total crypto market capitalization in the 24 hours rose 6.9% to US$1.10 trillion, the highest since mid-August, with total trading volume up 7.9% to US$63.61 billion.\n\nU.S. equities rose on Wednesday. The Dow Jones Industrial Average gained 0.1%, the S&P 500 Index added 0.3% and the Nasdaq Composite Index finished the day up 0.9%.\n\nWednesday’s gains follow the release the day before of January’s Consumer Price Index that showed prices rose 0.5% for the month and 6.4% year-on-year. While these figures were slightly higher than the expected monthly increase of 0.4% and annual 6.2%, they do show that inflation has followed a downward trajectory for the past several months in the world’s largest economy.\n\nThe year-on-year CPI in December came in at 6.5% from the 7.1% recorded in November, which in turn declined from October’s 7.7% and 8.2% in September.\n\nThe Fed, which has said it wants inflation back in the 2% range, has raised interest rates multiple times since last March to reverse the inflation surge.\n\nAnalysts at the CME Group predict a more than 90% chance that the Fed will raise rates by a further 25 basis points at its meeting next month. U.S. interest rates are currently at 4.5% to 4.75%, the highest in 15 years, and Fed officials have repeatedly indicated they could raise rates to as high as 5% to get inflation back to the central bank’s target range.\n\nSee related article: Be careful what you wish for? Regulators pick up pace in the crypto industry crackdown"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMTUvYml0Y29pbi1oYXNocmF0ZS1oaXRzLTMwMC1laHMtbWFyay1hcy1pbmR1c3RyeS1nZXRzLXNvbWUtYnJlYXRoaW5nLXJvb20v0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wMi8xNS9iaXRjb2luLWhhc2hyYXRlLWhpdHMtMzAwLWVocy1tYXJrLWFzLWluZHVzdHJ5LWdldHMtc29tZS1icmVhdGhpbmctcm9vbS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Hashrate Hits 300 EH/s Mark as Industry Gets Some Breathing Room - CoinDesk",
        "content": "“While it took less than one year for the Bitcoin hashrate to grow from 200 to 300 EH/s, we will likely have to wait considerably longer until it breaks 400 EH/s. I'm confident we will end 2023 at below 350 EH/s, as the poor mining economics of 2022 didn't incentivize new investments,” Jaran Mellerud, analyst at mining services Luxor Technologies, said."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vYnJhdmVuZXdjb2luLmNvbS9pbnNpZ2h0cy9hLWJpdGNvaW4tZ29sZGVuLWNyb3NzLWNvbmZpcm1lZC13aGF0LXRoZS1pbmRpY2F0b3JzLXNheS1hYm91dC1hLXBvdGVudGlhbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "A Bitcoin Golden Cross Confirmed – What The Indicators Say About A Potential Bull Run - Brave New Coin Insights",
        "content": "A Bitcoin Golden Cross Confirmed – What The Indicators Say About A Potential Bull Run\n\nOver the same period as the Bitcoin price move, Ethereum (ETH), is also surging – up ~38.6% so far this year.\n\nWhat is perhaps even more interesting, is the short-term moving average line (3 0-day) crossing from above to below the long-term moving average line (200-day) – the so-called ‘golden cross‘. It is one of the most notable technical indicators in a technical analysis trader’s playbook. The golden cross has been hit on the daily chart.\n\nSource: Tradingview, Short-term blue — Long-term Red\n\nA confirmed golden cross suggests a bullish price action continuing.\n\nSource: Tradingview\n\nThere are three stages to a golden cross, The first stage is an extended downtrend. The second stage is a strong short-term reversal upward breakout – which hits its zenith when the short-term average crosses above the long-term average. The third stage, which is not always guaranteed even if the first two stages occur, is an extended price uptrend. The last time Bitcoin hit a golden cross was in June 2021, and the BTC price soared in the following months after stage 2 was reached.\n\nThis time around, however, the macro environment is quite different. After the embarrassment of the FTX debacle occurring right under its nose, the Securities and Exchange Commission (SEC) is coming after the crypto sector aggressively in the last week. Easy targets like Kraken and Coinbase are in its sights, and Kraken recently paid a $30 million fine to settle SEC charges that its staking service was actually a securities offering.\n\nUnregistered securities charges have also been levied at crypto product providers — Genesis and Gemini. In the last few days, it has been reported that the SEC is now also seeking to sue stablecoin issuer Paxos. Paxos is the issuer of two physically backed US dollar stablecoins — Paxos USD (PUSD) and Binance USD (BUSD). It also issues a gold-backed stablecoin Pax Gold (PaxG) and manages the itBit exchange.\n\nThe SEC has not yet confirmed these reports and whether there is an ongoing investigation. The initial report by the Wall Street Journal, claims that the SEC is charging Paxos for offering an unregistered security, BUSD. The price of BTC fell by 6.1% the day after the Kraken news.\n\nBitcoin’s excellent beginning to 2023\n\nBitcoin and the crypto asset class, in general, have begun the year strongly on the back of cooler economic data that has hinted that interest rate increases in the United States may end soon and inflation has maxed out. Bitcoin began the year trading around US$16,500 and now trades for above US$22,000.\n\nThe first Consumer Price Index (CPI) print of the year was released by the Bureau of Labor Statistics (BLS) on January 19th. The report, which covered consumer prices in December 2022, showed that prices rose by 6.5% in the month. This was the smallest increase in a year and the sixth month in a row when the inflation rate had slowed. The January Consumer Price Index CPI showed that prices rose 0.5% in the first month of the year, and by 6.4% on a year-by-year basis, more than economists expected.\n\nFed Chairman Jerome Powell has said many times this year that a disinflation process has begun in the USA and a softer economic landing may be possible. He told the Economic Club of Washington D.C. that the US Central Bank was succeeding in its fight against inflation, but acknowledged the battle is not over. He said if strong labor market and inflation data emerge, then the Fed will be forced to continue with interest rate hikes. Higher interest rates constrict the ability of investors to operate by increasing the cost of capital and making borrowing more favorable.\n\nSource: Tradingview\n\nIf the Fed’s tightening cycle shows signs of ending, then Bitcoin and crypto could be set to begin a bullish flip as the shackles are pulled off investors. When the Fed finished its last tightening cycle in 2019, BTC and crypto began an extended bullish price reversal. As the chart above indicates, in the months after the Fed started to cut interest rates, the price of BTC traded sideways. Once the Fed began to aggressively drop interest rates, the price of BTC began to skyrocket. Bulls may already be backing this narrative and are buying cheaper Bitcoin in preparation.\n\nAdditionally, while more drama surrounding the FTX collapse emerged during January, markets appeared disinterested and Bitcoin prices continued to trend up. This suggests that the FTX incident has now been priced in.\n\nThe price momentum of Bitcoin has stalled, however, as new economic data suggests that the US economy is getting hotter than expected. Nonfarm payrolls, the measure of US workers excluding farm workers, increased by 517,000 for the month, This blew past analysts’ expectations of a rise of 187,000. The unemployment rate in the country fell to 3.4%, the lowest since May 1969. This data is buffered by the strong January inflation data.\n\nThis suggests that a recession may be avoided in the short-to-medium and that a post-covid recovery is being undergone successfully. With macroeconomics, however, the good news is often bad news. In the shorter term, however, it means that the Fed should now have more room to continue rate hikes and use monetary policy to control inflation which sits well above the targeted 2% level\n\nOrdinals bring new utility and price surge to Bitcoin\n\nAs the charts below show, there has been a recent surge in onchain fees, active users & addresses, and miner revenue. All of this has coincided with the launch of the new Ordinals digital collectible boom on the Bitcoin network. The Ordinals protocol is a controversial, innovative new protocol that allows Non-fungible Tokens (NFTs) to be stored on Bitcoin.\n\nOrdinals are not the first project to try and introduce NFTs to Bitcoin. Counterparty brought Rare Pepes to the network and Stacks continues to make progress. Ordinals are different, however, because NFTs are inscribed directly on satoshis on Bitcoin without needing a sidechain or additional token. The project’s growth has been parabolic since it was launched in January with daily mints now around 10,000 a day.\n\nThe Ordinals appear to be more than just a gimmick with serious money being splashed. ‘Bitcoin punks’ takes inspiration from the popular Crypto punk franchise on the Ethereum network. One sold recently for 9.5BTC or ~US$208,000.\n\nSource: Glassnode, BTC Transfer volume\n\nSource: Glassnode, BTC TX fees – last month\n\nSource: Glassnode – BTC miner revenue – last month\n\nSource: Glassnode, BTC Active Addresses – Last month\n\nAdditionally, the Ordinals protocol utilizes Taproot. A Bitcoin transaction type that packages network transaction outputs together to make them more efficient and secure. Driven by Ordinals momentum, there has been a surge in Taproot usage over the last month.\n\nOther technical Indicators\n\nTrading volume is a measure of how much a given financial asset has been traded in a period of time. Traders look at volume to determine liquidity and the strength of conviction of a bull or bear trend.\n\nWhat may concern Bitcoin bulls is that the current surge in BTC’s price has arrived with weak volume that is trending downwards. A general rule of thumb is that rising prices with lower or tepid volume are difficult to trust and the buying pressure may run out of fuel, stalling the rally.\n\nThe Relative Strength Index (RSI) is a momentum indicator. It assesses the speed and magnitude of a security’s recent price changes to evaluate whether it is overbought or oversold based on the veracity of the move. If a price moves too quickly too soon it is being overbought or over-sold. The general rule of thumb is that an RSI over 70 indicates that an asset may be overbought and a reading of 30 indicates that an asset is oversold.\n\nThe current RSI for bitcoin (BTC) is ~47.55 which suggests that the asset is far from oversold. It is in fact in a downtrend which suggests lagging bullish momentum.\n\nConclusion\n\nBitcoin has reached a promised land, beyond the golden cross. The last time BTC achieved this technical bullish flag, it triggered an extended bull run that ended with new all-time highs. The bulls will be hoping for more of the same this time around.\n\nThe price push to the golden cross in 2023, has been driven by softer macroeconomic data. It has also been buoyed by a surge in usage of Bitcoin, which has been driven by an emerging use case for the network — NFTs directly inscribed onto the network.\n\nDespite the golden cross, there are some concerning flags emerging for bulls. One is major resistance at the US$24,000 price that has twice stalled price momentum for BTC in the last six months. Others include weak volume and a US Federal Reserve that may be tempted to raise interest rates aggressively again. The most concerning headwind, however, is the aggressive moves being made by the SEC, which has the potential to derail the growth of the entire sector in the United States."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vd3d3LnRoZXJlZ2lzdGVyLmNvbS8yMDIzLzAyLzE1L2NyYWlnX3dyaWdodF92c19iaXRjb2luX3N2L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Craig Wright's case against Bitcoin SV devs reopened - The Register",
        "content": "A company owned by the man who claims to have invented Bitcoin is suing the developers of a fork of Bitcoin. Although the case was dismissed once already, it is being reopened, and a UK court will hear the Seychelles company's version of events next month.\n\nThe Court of Appeal of England and Wales has decided that the case of Tulip Trading against the developers of Bitcoin SV should be reopened. Tulip is suing 15 people and one Swiss nonprofit, Bitcoin Association, the developers behind Bitcoin SV, a fork of the Bitcoin cryptocurrency.\n\nTulip is headed up by Australian doctor of theology Craig Wright (it is unrelated to another litigious company with a similar name, extinct Dutch vendor Tulip Computers).\n\nBitcoin SV, short for \"Bitcoin Satoshi Vision,\" was forked from Bitcoin Cash in November 2018. Bitcoin Cash in turn was forked from Bitcoin in 2017. As long ago as 2015, we reported that Wright owned an Australian company called Tulip Trading.\n\nAs the Appeals Court puts it:\n\nTulip Trading Limited, a company associated with Dr Craig Wright, claims to be the owner of some bitcoin with a very high total value (the value in $ expressed in April 2021 was about $4 billion). The bitcoin is held at two addresses on the blockchain called 1Feex and 12ib7. However the private keys have been lost in a hack, likely stolen. Without its private keys Tulip cannot access its assets or move them to safety. However, Tulip contends, the developers named as defendants in this case control and run the four relevant bitcoin networks, and it would be a simple matter for them to secure Tulip's assets, e.g. by moving them to another address which Tulip can control. Tulip contends that the role the developers have undertaken in relation to Tulip's property (the bitcoin) and the power this role gives them, and all the circumstances (discussed below), mean that the developers should be recognised as a new ad hoc class of fiduciary, owing fiduciary duties to the true owners of bitcoin cryptocurrency, including in this case Tulip as true owner of the bitcoin at 1Feex and 12ib7.\n\nThe developers deny they owe fiduciary or any other duties to Tulip. They contend that they have \"nothing like the power or control Tulip alleges and that duties of the kind Tulip contend for would be highly onerous and unworkable.\"\n\nThe justices said they would allow the appeal, but cautioned that \"the conclusion is not that there is a fiduciary duty in law in the circumstances alleged by Tulip, only that the case advanced raises a serious issue to be tried.\"\n\nBack in 2016, Wright claimed to be Satoshi Nakamoto, the pseudonymous programmer who invented Bitcoin. This claim is controversial, and Wright has previously sued people who have rubbished it, although he lost that case in 2020. Lawsuits over Wright's claim to be Satoshi were still ongoing in January last year.\n\nIn 2019, Wright was instructed by a Florida court to hand over Bitcoin then valued at approximately $5 billion. As we reported in January 2022, Wright said that he was hacked and lost access to two wallets containing the money, and was suing the developers of Bitcoin SV for them to change the code to give him access to two wallets: one with 449 coins and another with 155.\n\nWe note that Bitcoin SV is currently valued at some $40. Thus, BSV604 might be sold for as much as approximately US $25,500. Whoever Satoshi Nakamoto really is, they mined about 5 percent of all Bitcoin, and hold somewhere between 750,000 and 1.1 million BTC. Even though the value of Bitcoin has been dropping sharply for some years, currently that holding is valued at $17 billion to $24 billion. ®"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbnMtY29ycmVsYXRpb24tdG8tcmlzay1hc3NldHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin's Correlation To Risk Assets - Nasdaq",
        "content": "While many bitcoin investors look for the asset to behave as a safe haven, bitcoin typically has ultimately acted as the riskiest of all risk allocations.\n\nThe below is an excerpt from a recent edition of Bitcoin Magazine PRO, Bitcoin Magazine's premium markets newsletter. To be among the first to receive these insights and other on-chain bitcoin market analysis straight to your inbox, subscribe now.\n\nShort-Term Price Versus Long-Term Thesis\n\nHow bitcoin, the asset, will behave in the future versus how it currently trades in the market have proven to be drastically different from our long-term thesis. In this piece, we’re taking a deeper look into those risk-on correlations, and comparing the returns and correlations across bitcoin and other asset classes.\n\nConsistently, tracking and analyzing these correlations can give us a better understanding if and when bitcoin has a real decoupling moment from its current trend. We don’t believe we are in that period today, but expect that decoupling to be more likely over the next five years.\n\nMacro Drives Correlations\n\nFor starters, we’re looking at the correlations of one-day returns for bitcoin and many other assets. Ultimately we want to know how bitcoin moves relative to other major asset classes. There’s a lot of narratives on what bitcoin is and what it could be, but that’s different from how the market trades it.\n\nCorrelations range from negative one to one and indicate how strong of a relationship there is between two variables, or asset returns in our case. Typically, a strong correlation is above 0.75 and a moderate correlation is above 0.5. Higher correlations show that assets are moving in the same direction with the opposite being true for negative or inverse correlations. Correlations of 0 indicate a neutral position or no real relationship. Looking at longer windows of time gives a better indication on the strength of a relationship because this removes short-term, volatile changes.\n\nWhat’s been the most watched correlation with bitcoin over the last two years is its correlation with “risk-on” assets. Comparing bitcoin to traditional asset classes and indexes over the last year or 252 trading days, bitcoin is most correlated with many benchmarks of risk: S&P 500 Index, Russel 2000 (small cap stocks), QQQ ETF, HYG High Yield Corporate Bond ETF and the FANG Index (high-growth tech). In fact, many of these indexes have a strong correlation to each other and goes to show just how strongly correlated all assets are in this current macroeconomic regime.\n\nThe table below compare bitcoin to some key asset-class benchmarks across high beta, equities, oil and bonds.\n\nNote, you can find any of these indexes/assets on Google Finance with the tickers above. For 60/40, we’re using BIGPX Blackrock 60/40 Target Allocation Fund, GSG is the S&P GSCI Commodity ETF, and BSV is the Vanguard Short-Term Bond Index Fund ETF.\n\nAnother important note is that spot bitcoin trades in a 24/7 market while these other assets and indexes do not. Correlations are likely understated here as bitcoin has proven to lead broader risk-on or liquidity market moves in the past because bitcoin can be traded at any time. As bitcoin’s CME futures market has grown, using this futures data produces a less volatile view of correlation changes over time as it trades within the same time limitations as traditional assets.\n\nLooking at the rolling 3-month correlations of bitcoin CME futures versus a few of the risk-on indexes mentioned above, they all track nearly the same.\n\nBitcoin CME futures correlated with risk-on assets.\n\nAlthough bitcoin has had its own, industry-wide capitulation and deleveraging event that rival many historical bottoming events we’ve seen in the past, these relationships to traditional risk haven’t changed much.\n\nBitcoin has ultimately acted as the riskiest of all risk allocations and as a liquidity sponge, performing well at any hints of expanding liquidity coming back into the market. It reverses with the slightest sign of rising equities volatility in this current market regime.\n\nWe do expect this dynamic to substantially change over time as the understanding and adoption of Bitcoin accelerates. This adoption is what we view as the asymmetric upside to how bitcoin trades today versus how it will trade 5-10 years from now. Until then, bitcoin’s risk-on correlations remain the dominant market force in the short-term and are key to understanding its potential trajectory over the next few months.\n\nRead the full article here.\n\nLike this content? Subscribe now to receive PRO articles directly in your inbox.\n\nRelevant Articles:\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWJlc3QtYnJhbmQtY3J5cHRvLXdoeS0yMTEyMTQyMTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "'Bitcoin Is the Best Brand in Crypto': Why DeGods NFTs Are Now on Bitcoin - Yahoo Finance",
        "content": "Bitcoin NFTs via Ordinals are the buzziest thing in the space lately, with more than 100,000 such media assets committed to the blockchain in barely two weeks. Surprisingly, that tally includes 535 NFTs from DeGods—the most valuable Solana NFT project.\n\nDeGods revealed the move on Monday as word circulated that the profile pictures (PFPs) had all been inscribed on Bitcoin in a single block. (\"Inscribing\" is the process by which NFT-like assets are created on the Bitcoin blockchain, akin to \"minting\" on Ethereum.) The 535 particular images were originally released via Solana in 2021, but were “burned” (or permanently destroyed) to cut down the supply in the early days of the project.\n\nProject creator Rohun Vora, who goes by the pseudonym Frank, told Decrypt that he and Dust Labs CEO Kevin Henrikson (who simply goes by Kevin) are longtime Bitcoin aficionados who relished the opportunity to bring the project onto the leading cryptocurrency’s network in the early days of Ordinals momentum.\n\nAesthetics matter a lot to my team @DeGodsNFT. It was an honor working with @hash_bender to make sure there was no random trashy Ordinals minted in between all 535 DeGods. All in one block. Simple. Beautiful. Inscribed on the Bitcoin blockchain forever. pic.twitter.com/Yfuvc8IDuT — Frank III (@frankdegods) February 14, 2023\n\n“Bitcoin is the best brand in crypto—just as pristine as it gets,” Frank told Decrypt. “It's the most well known, and truly as simple but powerful as it can get. And the mission statement is it's never been corrupted, right? It's like global sound money. That is so powerful. Aligning ourselves with the best brand in crypto is a no-brainer at any given point in time.”\n\nStory continues\n\nNow those 535 PFPs have gained a second life on Bitcoin with never-before-seen upgraded artwork. DeGods previously provided holders refreshed “DeadGods” artwork last year, and created upgraded artwork for the burned NFTs as well, plotting an eventual revival.\n\nNFT Sales Jump 38% in January as Bored Apes Drive Trading Surge\n\n“We always had this notion of ‘What is dead may never die,’” Kevin explained, echoing the familiar refrain from the HBO series \"Game of Thrones.\" “And it was this idea, like: Holy shit, this is so perfect. We can literally bring these back, mint them as Ordinals on BTC, and it's permanent,” he said.\n\nBack to life\n\nOrdinals is a unique way of inscribing NFT-like media and assets to the Bitcoin blockchain by connecting them with a single Satoshi, or 1/100,000,000th of one BTC. The media is fully stored on-chain and the Ordinal can be transferred, although there’s still a need for a lot more infrastructure and platforms for transacting and handling the assets.\n\nIt has quickly given rise to CryptoPunks clones and playable web games on Bitcoin. OnChain Monkey, an Ethereum project, also put its entire 10,000 NFT original collection into a single inscription. However, Ordinals has also drawn considerable backlash from Bitcoin maximalists, plus it has boosted network congestion—and transaction fees in tandem.\n\nOver 100K Ordinals Minted on Bitcoin, Bringing Cheers and Network Congestion\n\nKevin said that they dove into Ordinals as soon as it started gaining steam. But with the DeGods inscriptions, they didn’t just want to mint them in the typical way and have the inscriptions added to the network across potentially multiple Bitcoin blocks.\n\nInstead, they worked with a Bitcoin miner, Luxor Technologies CEO Nick Hansen, to arrange for all 535 of the NFT inscriptions to be etched onto the blockchain in a single, exclusive block. The block was processed by DMG Blockchain Solutions’ Terra Pool, which claims to be a carbon-neutral mining pool powered by renewable energy solutions.\n\nOver 1 year ago, 535 DeGods were burned. Many have speculated on their return. What is dead may never die. pic.twitter.com/fmP1FhZI6F — Frank III (@frankdegods) February 13, 2023\n\n“It was a deal-breaker for us if we couldn't do it as a custom block, because we had to do something special,” Frank told Decrypt. “It’s the DeGods way, right? You can't just do it in the basic way. You’ve gotta do something that feels really fresh.”\n\nUltimately, to fit the 535 images into a single Bitcoin block, they had to be seriously compressed. Each was resized down to a low-resolution 210x210 pixels—a nod to the total Bitcoin supply of 21 million BTC—and in the .webp file format to conserve space. But now they’re all inscribed on the Bitcoin blockchain for future use.\n\nWhile many NFTs on Ethereum and other platforms store their artwork externally on either centralized servers or decentralized storage solutions (like IPFS), Ordinals fit the artwork or asset entirely within the on-chain block. That proved to be a key part of the appeal for the DeGods team—that these assets will live potentially forever on Bitcoin.\n\n“I've run a [Bitcoin] node, and the idea that every single node on the planet is now verifying and backing up this image is so powerful,” Frank said. “That is what got us really excited.”\n\nNext steps\n\nMeanwhile, the broader DeGods project is already set to be bridged from Solana to Ethereum sometime this quarter, as announced in December—with sister project y00ts bridging from Solana to Polygon.\n\nThat’s still happening for the rest of the project’s 10,000 total NFTs, and Frank tweeted this week that “having a presence on all blockchains is important.” However, these 535 specific DeGods NFTs, which were previously burned on Solana, will only live on Bitcoin via Ordinals.\n\nHow they roll out remains to be seen, however. The official DeGods account tweeted Monday that details on how to mint the Bitcoin NFTs will be announced “in the coming days.”\n\nOn Tuesday, however, Kevin told Decrypt that they’re currently being held in private wallets, and that they’re waiting for more tooling to be deployed to make Ordinals safer to handle and transact. Once that target is hit, Kevin said that they have plenty of ideas on how to launch the NFTs in an effort to “come back to our holders and support the community.”\n\n“We're gonna essentially sit on them,” Kevin said, “until we are comfortable that the tooling will support the proper custody of these for a reasonably sophisticated crypto connoisseur.”"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9vcmRpbmFscy1zdXBwb3J0LWNvbWVzLWJpdGNvaW4tYmFzZWQtMjEyNTQ0NDc4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Ordinals Support Comes to Bitcoin-Based Web Wallet Xverse - Yahoo Finance",
        "content": "Xverse, billed as a “Bitcoin wallet for Web3,” just rolled out support for Ordinals, the newly popularized protocol allowing users to inscribe NFTs onto the Bitcoin blockchain.\n\n\n\n“Today, we’ve launched first class support for Ordinals,” tweeted the wallet team on Wednesday. The company explained that inscribing NFTs through its software involves “no need to run a node, complex software, or anything else,” merely some Bitcoin to pay a transaction fee, which can be bought directly through the app.\n\nInscriptions are made via Gamma.io, a Bitcoin NFT marketplace that rolled out “no-code ordinal inscriptions” last week. According to Xverse, roughly 5% of Bitcoin inscriptions so far have been made using Gamma’s tool.\n\nAfter uploading an image and sending a transaction to their provided Ordinals address, users can find their inscriptions inside their Xverse NFT collection within 20 to 30 minutes—and embedded in the blockchain forever.\n\nOver 100K Ordinals Minted on Bitcoin, Bringing Cheers and Network Congestion\n\nThis comes just a day after Hiro, another Bitcoin focused Web3 wallet, rolled out inscriptions to its testnet on Tuesday. Both wallets interact with Stacks, a “layer 1.5” blockchain with its own NFT economy that settles its transactions on Bitcoin.\n\nXverse, too, lets Bitcoin users interact with Stacks, with plans to introduce instant payments via the lightning network.\n\nBitcoin recently logged its 100,000th Ordinals transaction, continuing a trend of exponential growth. Given that NFTs on Bitcoin were not a feature envisioned by its original developers, their existence has naturally sparked controversy, with many people unsure of whether they will hurt or help the network.\n\nStacks co-creator Muneeb Ali said he welcomes the new protocol, stating that it marks a “new chapter in Bitcoin history” on Tuesday. The following day, he said that Xverse’s Bitcoin wallet now has the “easiest on-ramp to ordinals.”\n\nKen Liao, the founder and CEO of Xverse wallet (aka Secret Key Labs), said that the ability to send out one’s ordinal from the wallet will be available soon. Liao was formerly an engineering parter at Stacks.\n\nStory continues\n\nIts out! The easiest way to inscribe Bitcoin Ordinals and store in your self-custody BTC wallet with a beautiful gallery for all your NFTs. https://t.co/xgEcEJXlX8 — kenliao.btc (@YukanL) February 15, 2023\n\nAccording to Liao, the rise of Ordinals is helping bring builders back into Bitcoin's ecosystem, and showing that the network is capable of more than allowing people to \"just hold Bitcoin.\"\n\n\"You've always been able to put data on the Bitcoin chain, but in a very limited way,\" said Liao, in comments shared with Decrypt via email. \"Ordinals made it easier and created a cultural movement essentially for people to do this.\""
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1jb250aW51ZXMtY29ycmVsYXRpb24td2l0aC1uYXNkYXEtMTAwLXRodXMtZmFyLWluLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Continues Correlation With Nasdaq 100 Thus Far in 2023 - Nasdaq",
        "content": "Last year, bitcoin moved in tandem with the stock market as well as the bond market as inflation applied downward pressure to most assets. In the recent rally, bitcoin is doing the same, tailing indexes like the Nasdaq 100 as it moves higher amid the anticipation of fewer rate hikes.\n\nThat remains to be seen, however, as the U.S. Federal Reserve could reverse course if it senses that it doesn't quite have inflation under control. If that's the case, more volatility could be ahead for the stock market, which could translate to volatility in the cryptocurrency market.\n\n\"On days when technology stocks trade higher, cryptocurrencies, including bitcoin (BTC) and ether (ETH), are likely to do the same,\" a Coindesk article noted. \"Conversely, a decline in technology stocks could drag the crypto market lower.\"\n\nThat said, macroeconomic catalysts like inflation reports and interest rate decisions are likely to move cryptocurrencies again this year. A peek at the Nasdaq 100 may offer market-watchers an idea of what the cryptocurrency market might be doing.\n\n\"The renewed positive correlation implies increased sensitivity of cryptocurrencies to macroeconomic data releases like the U.S. consumer price index (CPI), which injects volatility into stock markets,\" the article added further. \"The CPI days were among the most volatile for U.S. stocks last year, according to MarketWatch.\"\n\nGet Bitcoin Exposure on a Regulated Exchange\n\nGetting bitcoin exposure doesn't mean that investors must trade digital currencies by opening a separate account on an unregulated cryptocurrency exchange that could potentially open them up to potential risk. That said, investors have options in regulated markets in order to get cryptocurrency exposure to major coins like bitcoin.\n\nExchange traded funds (ETFs) can allow investors to get in on thebitcoin priceaction without investing directly in the digital currency itself. Consider the ProShares Bitcoin Strategy ETF (BITO) and the ProShares Short Bitcoin Strategy ETF (BITI).\n\nFor the bulls, BITO builds capital appreciation through its bitcoin futures contract use, allowing investors to get exposure tobitcoin priceappreciation within the regulatory framework of a traditional financial exchange. For the bears, BITI seeks daily investment results equal to the inverse (-1x) of the daily performance of the S&P CME Bitcoin Futures Index, allowing traders to profit off price declines in bitcoin.\n\nFor more news, information, and analysis, visit the Crypto Channel .\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNvaW5iYXNlLmNvbS9ieXRlcy9hcmNoaXZlL3RoZS1iaXRjb2luLW9yZGluYWxzLWJ1enotZXhwbGFpbmVk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Coinbase Bytes newsletter - Coinbase",
        "content": "There’s never a dull moment on the blockchain. Here’s what you need to know this week:\n\n Bitcoin “NFTs” are sparking hype. But not everyone agrees that Bitcoin's blockchain needs them.  Key quotes from the cryptoverse. Turns out Keanu Reeves is a big crypto fan. Plus, the SEC’s Hester Peirce criticizes recent enforcement actions.  Noteworthy numbers. The amount raised by an AI-meets-crypto startup, and other key stats from the week.\n\nBTC UPDATE\n\nWhat are Bitcoin Ordinals, and why is the cryptoverse buzzing about them?\n\nBitcoin is most famous for doing one thing really well: being decentralized digital money. But while Bitcoin’s core ethos involves peer-to-peer digital payments, some developers have long wondered whether the blockchain could support different functionalities like NFTs or be more programmable, like Ethereum. With the most recent craze to hit the crypto ecosystem, they may finally be getting their answer.\n\nThat craze? Bitcoin NFTs called “Ordinal Inscriptions.” Ordinals involve putting any kind of digital file — people have minted playable games, videos, and images — on Bitcoin’s blockchain, and they have taken off in 2023.\n\nYet, this trend has also generated controversy among some of Bitcoin’s most ardent supporters. Let’s take a closer look.\n\nWhat are Ordinals?\n\nOrdinals are essentially NFTs, but for the Bitcoin blockchain. Like NFTs, they represent digital assets. But instead of being minted, Ordinals are “inscribed” onto a single satoshi (the lowest denomination of BTC, similar to a penny vs. a dollar). Inscribing is the process of putting a piece of data onto the blockchain, where it will remain forever accessible and unchangeable.\n\nOrdinals began rising in popularity at the end of January, and to date more than 160,000 inscriptions have been created, including a playable version of the 1993 video game Doom and a picture of a Bored Ape morphed with a CryptoPunk.\n\nHow are Ordinals different from NFTs on other blockchains?\n\nBitcoin’s blockchain isn’t smart-contract compatible like those of Ethereum and Solana, so it’s more difficult to create applications like games and NFTs via BTC’s network.\n\nOrdinals are also far more technologically limited than traditional NFTs. While they can inscribe most forms of digital content, Ordinals are limited by the size of data that can fit in a BTC block, which is about 4 MB at maximum. Additionally, the barrier to create an inscription is high – typically one must be running a Bitcoin node to be able to inscribe into a satoshi.\n\nIn an effort to make Ordinals more accessible, however, BTC marketplace Gamma.io recently launched a tool to create a 60kb inscription for 21,000 satoshis (or, sats) which is about $5. And on Wednesday, crypto wallet maker MetaMask released an Ordinal wallet available to its 30 million users.\n\nWhat does the Bitcoin community think of Ordinals?\n\nDetractors in the Bitcoin community, like Adam Back, a prominent developer, believe that inscriptions are a “waste” because they are consuming blockspace that should be used for financial transactions, which is Bitcoin’s founding, primary purpose. Because inscriptions can contain audio or video files, creating them has increased the cost of transacting on Bitcoin’s blockchain.\n\nOthers argue that because inscribing into satoshis can alter their value, it would cause Bitcoin to lose an important trait that money has — fungibility — since all satoshis would no longer have equal value.\n\nAlex Miller, CEO of Hiro, a developer for the Bitcoin smart contract platform Stacks (which has seen its native STK token jump by more than 100% in the last week amid the Bitcoin NFT hype) believes that inscriptions being fundamentally different from traditional NFTs will help spur their adoption — even if Bitcoin’s blockchain wasn’t originally intended to be used for things like preserving digital versions of housing deeds of government documents.\n\nWhy it matters… It’s still too early to tell if Ordinals are the beginning of new use-cases for Bitcoin, or just a short-term fad. Will their functionality ultimately be eclipsed by Ethereum’s dominance as a programmable blockchain? Or will they usher in a new era for Bitcoin? People like Miller argue that Ordinals have a real future. “The Stacks community [has] been saying for so long that things should be getting built on Bitcoin,” Miller said. “Because it is the most trusted thing that’s been around the longest, it’s not going anywhere.”\n\nTAKES\n\nKeanu Reeves praises crypto, the SEC’s Hester Peirce criticizes her agency, and other key soundbites\n\nOrange pill… “To pooh-pooh crypto, or the volatility of cryptocurrency, it’s only going to make it better in terms of how it’s safeguarded,” was how “John Wick” star Keanu Reeves described crypto technology amid the negative headlines of recent months. Reeves, speaking to Wired magazine for its latest cover story, also declared that the “ideas behind an independent currency are amazing.”\n\nPeirce-ing remarks...\"If investor protection is about just shutting programs down or preventing people from purchasing certain things — that's a very unimaginative form of investor protection,\" was how SEC Commissioner Hester Peirce characterized recent actions by her agency targeting the crypto industry, during an episode of the Block’s podcast. Peirce has been an outspoken critic of the agency’s enforcement decisions, including its move to shut down crypto exchange Kraken’s staking program.\n\nFare thee well… “Crypto will endure. These setbacks are temporary and will come to pass. Stay strong and good luck,” was how Galois Capital concluded a Twitter thread confirming the news that it was shutting down. The crypto-focused quantitative hedge fund had been battered by FTX’s collapse, which had resulted in half of its assets being stuck on the defunct exchange.\n\nShould I stay or should I go?… “Every single lawyer we have met with has advised us against considering the U.S. due to the regulatory uncertainty,” was how crypto executive Boyd Cohen described the outlook on launching new crypto businesses in America in an opinion piece for CoinDesk titled “I’m American, but My Crypto Startup Won’t Be.”\n\nNUMBERS TO KNOW\n\n$5.3 million\n\nAmount raised by Kaito AI, an AI-powered search engine for crypto that aims to integrate the buzzy (and sometimes unsettling) ChatGPT/GPT-3 language models into a comprehensive search aggregator for crypto information, which is famously fragmented across the web and often hard to locate. Sequoia Capital and Dragonfly Capital were among the investors in the project, which is currently in beta with institutional clients.\n\n$900,000\n\nThe price of a *checks notes* Scottish golf course that a golf-obsessed crypto club called LinksDAO intends to buy with the proceeds from the sale of 9,090 NFT-based memberships. According to its website, LinksDAO is “on a mission to own one of the world’s greatest golf courses.”\n\n2,027\n\nNumber of Bitcoin whales (wallets holding 1,000 or more BTC) on Sunday, February, 19 — the lowest whale count since August 2019. In contrast, the number of BTC investors with 1 or more BTC sits at 982,000, up from 814,000 at this time last year and 788,000 in February 2020.\n\n5\n\nNumber of Bitcoin “maintainers” — developers who are responsible for implementing patches from roughly 1,000 active developers working on the Bitcoin network. Bitcoin Core, an open-source project that keeps BTC’s digital ledger up-to-date across thousands of computers, describes maintainers as “a final check to ensure that patches are safe and in line with the project goals.” Some have noted that Bitcoin Core’s role is in tension with the cryptocurrency’s goal of remaining decentralized.\n\nDISCLAIMER\n\nThis material is the property of Coinbase, Inc., its parent and affiliates (“Coinbase”). The views and opinions expressed herein are those of the author and do not necessarily reflect the views of Coinbase or its employees and summarizes information and articles with respect to cryptocurrencies or related topics that the author believes may be of interest.\n\nTOKEN TRIVIA\n\nWhat is proof of work?\n\nA The way miners secure and scale Bitcoin’s blockchain\n\nB A way to verify transactions on a blockchain\n\nC The predecessor to proof of stake\n\nD All of the above\n\nFind the answer below.\n\nTrivia Answer"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTE3L3RvcC1jcmVkaXRvci1vZi1tdC1nb3gtY3J5cHRvLWV4Y2hhbmdlLW9wdHMtZm9yLWJpdGNvaW4tcGF5b3V00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Top Creditor of Mt Gox Crypto Exchange Opts for Bitcoin Payout - Bloomberg",
        "content": "The largest creditor in the long-running bankruptcy process of the Mt Gox crypto exchange has opted for an early payout in Bitcoin rather than fiat currency, easing some concerns about the token’s price outlook.\n\nMt Gox Investment Fund has picked an early payout in September this year, according to a person familiar with the matter, who asked not to be identified as the information is private."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXNvYXJzLXBhc3QtMjRrLXJlYWNoLTIwMzAyMDM4OS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Soars Past $24K to Reach 2-Week High - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nBitcoin bolted past $24,000 for the first time in two weeks after surging more than 8% over the past 24 hours, likely the result of the type of short squeeze that historically has sent prices higher. The percentage increase was the largest since BTC jumped 10.5% on Sept. 9.\n\nThe largest cryptocurrency by market capitalization had dropped below $21,600 at different points in recent days amid growing investor fretfulness about crypto regulation, particularly targeting the stablecoin market, and about future U.S. central bank steps to tame inflation.\n\nBut those concerns seemed to fade quickly as bitcoin surged past $24,100 by the afternoon before retreating slightly.\n\nData from crypto data provider Coinglass showed that traders who bet on price shifts liquidated some $65 million of bitcoin over the past 24 hours, from which about $60 million were in short positions.\n\nCrypto-related stocks also jumped, with both exchange Coinbase (COIN) and bitcoin miner ​​Marathon Digital Holdings (MARA) increasing 15%. Business software company MicroStrategy (MSTR), a major BTC holder, recently rose more than 9%.\n\nEther (ETH) was up 5.5% to recently trade at $1,645. The CoinDesk Market Index spiked 4% for the day.\n\nLucas Outumuro, head of research at blockchain analytics firm IntoTheBlock, said that investors also found reason for optimism in Tuesday's tepid U.S. Consumer Price Index (CPI), which showed inflation declining slightly to 6.4% on an annual basis even as it failed to meet analysts expectations. \"Since the market reaction to the CPI print was positive even if it was higher than expected, I believe this was seen as a sign of strength for the rally to continue in risk assets altogether,\" Outumuro told CoinDesk.\n\nRiyad Carey, research analyst at crypto data firm Kaiko, also said that markets also may have already accounted for concerns about increased regulation tied to stablecoins, including Binance's BUSD token.\n\nStory continues\n\n\"Crypto has had some added catalysts with the BUSD news, which has largely been absorbed and I think today was a reflection of some of the regulatory fears – and immediate fears around BUSD – easing,\" Carey told CoinDesk.\n\nUPDATE (Feb. 15, 2023, 20:41 UTC): Updates headline and adds historical context to the size of bitcoin's 24-hour increase.\n\nUPDATE (Feb. 15, 2023, 20:56 UTC): Updates to reflect latest liquidation of BTC short and other positions.\n\nUPDATE (Feb. 15, 2023, 21:05 UTC): Updates price chart.\n\nUPDATE (Feb. 15, 2023, 22:39 UTC): Adds analysts comments."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vd3d3LmxlZGdlci5jb20vYWNhZGVteS9iaXRjb2luLW1pbmluZy13aGF0LWlzLWl00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "What Is Bitcoin Mining? - Ledger",
        "content": "What Is Bitcoin Mining?\n\nBy Lipsa Das\n\nRead 6 min Medium\n\nSHARE\n\nKEY TAKEAWAYS — Bitcoin mining is how Bitcoin’s proof of work consensus mechanism confirms and validates transactions through network participants such as miners and nodes.\n\n\n\n— Miner nodes compete against each other to solve mathematical problems, and the winner of this competition validates the new block and receives block rewards.\n\n\n\n— You need specialized mining hardware for Bitcoin mining. Beginners can use mining pools (group mining) or cloud mining (renting hardware) to reduce upfront investment.\n\nWhat is Bitcoin Mining?\n\nBitcoin mining is the process of adding new transaction blocks to the Bitcoin ledger by miner nodes that solve complex hashing problems and claim newly minted Bitcoins as mining rewards.\n\nHow does Bitcoin Mining work?\n\nBitcoin mining is a central concept of Bitcoin’s proof of work (PoW) consensus mechanism, which helps “mine” new bitcoins to the system while validating transactions.\n\nAs its name suggests, PoW literally translates to proof of “work being done”. In this case, that translates to powerful computers crunching the numbers required through sheer computational brute force to validate transactions and produce new bitcoins.\n\nCore to the PoW consensus protocol are two main network participants: miners and nodes. A node is a network computer that provides the first layer of checks to determine whether a transaction is valid. Valid transactions are then added to a memory pool or, in other words, a queue of transactions that don’t have any blocks assigned to them. That’s where miners come in.\n\nMiners compete against each other to find a secret phrase, called “nonce”, which, when combined with the transaction data, grants them the right to validate blocks. The winning miner determines which transactions need to be prioritized for the next block, put them together in a block and add it to the blockchain.\n\nMiners can also function as a node, because they have a copy of all transactions. However, nodes cannot operate as miners.\n\nSince miners need to have a copy of all transactions to do this, they can, by default, operate as a node, but vice versa is not necessary.\n\nWhich Miner Gets To Decide the Next Block?\n\nAs of writing, Bitcoin has over 14,000 miner nodes who compete with each other for the right to add to blocks to the chain, therefore earning the block reward.\n\nThis competition is where things get interesting.\n\nThink of the proof-of-work problems as the combination of a complex safe. You know some of the access codes for the safe, but you have to guess the rest of the digits. And you’ve to do it faster than other people.\n\nIn bitcoin terms, the miner’s computing equipment competes with other miners on the network to guess the nonce. Since there are billions of permutations, it’s a matter of trial and error until a miner guesses the correct one.\n\nThe nonce combines the transaction information in the block to produce an encrypted series of alphanumeric characters, or the “hash”. The miner that provides this hash to the Bitcoin network can add the new block to the network. They get rewarded a fixed amount of Bitcoins generated by the system (the block reward).\n\nHow To Be the Miner That Decides the Next Block?\n\nThe quality of your mining hardware makes a huge difference to your effectiveness as a miner. The better the hashrate (computing speed) of your hardware, the more guesses it can compute per second and eliminate incorrect answers quickly.\n\nTherefore, miners who invest in advanced hardware or pool their resources together have a higher chance of guessing the correct nonce faster.\n\nStatistically, though, the probability of the same miner getting it right every time is pretty low, which is good for the network. The more miners the network has, the more decentralized and secure the Bitcoin blockchain is.\n\nWhy Does Bitcoin Need Miners?\n\nBitcoin miners ensure the safety of the network by addressing a problem unique to crypto — double-spending. Double spending refers to trying to use the same currency more than once.\n\nIn a traditional financial system, this isn’t possible. In the cash economy, you can’t spend the same $100 bill at two places: Simply, once you spend it, since you don’t possess it any longer. With digital transactions too, banks can easily track the flow of funds, since they have a centralized database. In other words, you will never be able to spend the same money twice.\n\nHowever, since Bitcoin is a digital currency with no central authority verifying transactions, the process for tracking your spending (and maintaining accurate records) is distributed across the network.\n\nMiners act as decentralized “bankers” of the Bitcoin network and play a key role in preventing double-spending of Bitcoin.\n\nWhen unconfirmed transactions are pulled out of the memory pool for validation, the transaction with the most confirmations gets added to the block. Accordingly, any other transactions will fail. Typically, if a block gets over six node confirmations, it is valid.\n\nMeanwhile, individual miners themselves are incentivized to confirm transactions accurately and, honestly, the block reward is only valuable as long as the Bitcoin network remains accurate and trustworthy.\n\nWhy Mine Bitcoin?\n\n1. Financial Incentive\n\nAs of 2020, for each block a miner solves, they receive 6.25 Bitcoins as mining rewards. So while mining is not as profitable as it used to be a decade ago, Bitcoin mining is still lucrative.\n\nBitcoin mining profitability, though, depends on various other factors — electricity bills, the price of Bitcoin, mining competition, etc.\n\n2. Autonomy\n\nBitcoin and other cryptocurrencies are about autonomy – they allow you to be your own bank, storing value and transacting independently of a central authority.\n\nMining takes this to the next level. As a miner, you maintain a copy of Bitcoin’s entire transaction history on your computer, so you become your own source of truth.\n\nFurther, mining bitcoin also grants you “voting power” proportional to the hash rate you commit to the network. Therefore, you can influence fundamental network changes such as forks to the Bitcoin network.\n\n3. Maintaining the Bitcoin Network\n\nBecoming a Bitcoin miner means the satisfaction of knowing you’re preventing manipulation of the Bitcoin network. For those who are enthusiastic about a decentralized monetary system, contributing to its function has a lot of appeal.\n\nHow To Start Mining Bitcoin?\n\nTechnically, anyone can start mining Bitcoin. However, over the years of Bitcoin evolution, the sophistication of bitcoin mining has significantly increased — going from GPUs (the ones you find in gaming laptops) to mining rigs.\n\nIt’s still possible to mine with a GPU, but you’ll likely earn in pennies even if your hardware runs for months straight. And that is if you’re able to join a mining pool that accepts a low hash rate.\n\nIf you’re going the independent miner route, you’ll need specialized mining hardware, preferably ASICs (application-specific integrated circuit). ASICs are specialized hardware components with fast processing power, ranging from $500 to thousands of dollars.\n\nYou’ll also need to handle technical details yourself — for instance, deciding whether to purchase a secondhand machine, configuring the software that will run your miner, etc.\n\nThis process can quickly become complicated. Two of the simplest ways for beginners to start mining Bitcoin are; mining pools and cloud mining.\n\nWhat Are Mining Pools?\n\nMining pools are groups of cryptocurrency miners who pool their computational resources to solve the proof of work problems and share the rewards of the mined bitcoin. This tackles two problems.\n\nIndependent miners can be up against entire mining farms, which makes your chances of success relatively low as an individual. So pooling your resources with a mining group gives the whole group a better chance of collecting the block reward.\n\nFurther, investing in mining hardware is expensive and has a sunk cost due to hardware deterioration at high temperatures. Mining pools allow you to hack your way into mining success by utilizing the power of the group to solve problems faster.\n\nWith mining pools, miners have a higher probability of securing the prize with lower costs. Of course, in doing so, they have to sacrifice some of the autonomy with respect to mining strategies and a portion of the rewards. But hey — it’s better than being empty-handed, right?\n\nMining pools come in three types:\n\n1. Proportional Mining Pools\n\nIn proportional mining pools, each miner receives a share proportional to their hardware’s computing power to the entire pool. Once a block is found, the miner receives their payout.\n\n2. Pay-per-share Mining Pools\n\nIn pay-per-share mining pools, each miner receives an instant payout based on the hardware power they have committed to the pool. Here, the pool owner takes on the risk of providing a steady stream of income to miners, even if they do not find a block.\n\n3. Peer-to-peer Mining Pools\n\nPeer-to-peer mining pools take a decentralized approach to mining, where pool decisions are made on the blockchain.\n\nWhat Is Cloud Mining?\n\nCloud Mining extends the concept of cloud computing by allowing users to rent computing power from companies that mine Bitcoin on their behalf.\n\nIt’s similar to how cloud services like Google Drive store and share your files instead of running your own storage server. In cloud mining, you pay the company a fee, they allocate hash power proportional to that fee, and you’re free to use that power to mine your Bitcoins.\n\nThe direct benefit of cloud mining is that you don’t have to worry about buying or maintaining hardware and dealing with storage, electricity, or cooling costs. You also need little to no technical know-how while using cloud computing.\n\nCloud mining is also highly flexible. Depending on the market conditions and your mining strategies, you can scale up or down with a few clicks. Further, since most of these cloud mining companies run large-scale mining operations in inexpensive countries, you typically have access to state-of-the-art equipment at a fraction of the cost.\n\nHowever, involving a third party in mining operations always comes with a risk. It’s important to choose a reliable and transparent cloud mining supplier — since you don’t own any hardware and are entirely dependent on the mining company.\n\nBitcoin Mining Vs Energy Consumption\n\nThe proof-of-work consensus mechanism uses energy as the key resource for securing itself.\n\nAll miners use energy as they compete to solve the hash puzzle, but only one miner gets to add each new block; thus, energy expenditure by other miners serves purely to prevent a bad actor from manipulating the validation process, which in turn preserves the value of Bitcoin.\n\nAs a result, Bitcoin energy consumption is one of the core debates in the crypto space. But to fully grasp the “cost/benefit analysis” of Proof of Work, the facts must also be considered in context.\n\nYes, Bitcoin does consume significant energy; but doing so guarantees the security of the system and, therefore the value of the currency as a whole. This is what allows it to pose an alternative to centralized banking, something that brings enormous possibilities in itself.\n\nEnergy consumption remains a hotly-debated issue. However, as long as Bitcoin continues to function effectively and securely as a decentralized ledger, there’s a valid argument to be made in favor of Proof of Work.\n\nReady to Start Mining Bitcoin?\n\nMining bitcoin is a lucrative option for many people, but it takes some planning to make it a success.\n\nFor instance, you should do a cost-benefit analysis of mining Bitcoin relative to its price. Take into account the full stack infrastructure needed to run your mining operations profitably— mining hardware, energy costs, book-keeping, tax implications, accounting, etc.\n\nIf you’re new to Bitcoin and mining, starting with a lower-end investment like cloud mining or mining pools would make sense. Test the waters before you go all in.\n\nLet’s get mining!\n\nKnowledge is power"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3Mvd2hhdC1oYXBwZW5zLXdoZW4tdGhlLWJpdGNvaW4tYmxvY2tjaGFpbi1wcm9kdWNlcy1hbi1lbXB0eS1ibG9ja9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "What Happens When the Bitcoin Blockchain Produces an Empty Block - Blockchain.News",
        "content": "Accept the oddities: Bitcoin's blockchain has more empty blocks than intended.\n\nBitcoin ( BTC ) is a digital currency that is renowned for its durability, security, and dependability. A new block is added to the network on average every ten minutes, and the miner who successfully creates the block is rewarded with 6.25 Bitcoin, which is equivalent to almost $130,000.\n\nOn the other hand, the Bitcoin blockchain is known to sometimes spring a surprise on both watchers and players.\n\nNodes around the network confirmed the existence of a totally empty block at the height of 776,339 blocks. The fact that the block was uploaded to the Bitcoin network with no transactions included caused considerable consternation among those involved in the cryptocurrency industry. What precisely is meant by the term \"empty block,\" and how does this phenomenon occur?\n\nTo begin, while the presence of an empty block on the network may at first seem peculiar, this kind of thing is really rather common. Block 774486 was the location where it happened a little more than two weeks ago to the day.\n\nMiners are encouraged to mine blocks as rapidly as possible, and as a result, they may mine a block even if they have not yet received any transactions that they may include in the block. When this occurs, the block will continue to be empty.\n\nThe following justification may be found in the Bitcoin mempool, which is the primary location for doing research on the Bitcoin blockchain: \"When a new block is located, mining pools will give miners a block template that does not include any transactions. This will allow them to begin the search for the next block as quickly as possible. They immediately transmit a block template that is complete with transactions; but, a complete block template is a larger data transfer and reaches miners after a little longer period of time.\n\n\"During this interim period, which is often no more than one to two seconds, miners sometimes get fortunate and discover a new block utilizing the empty block template,\"\n\nIn essence, mining a template was a case of \"getting fortunate\" for the miners. The Bitcoin block with the height of 776,389 was added to the chain just a few seconds after the block that came before it, which had the height of 776,488. However, Block 776,388 received an additional 0.086 BTC in fees, which is equivalent to around $1,854. This amount was added to the block reward of 6.25 BTC, which is approximately $135,247.\n\nEven when there are no transactions in an empty block, the miner is still rewarded with freshly created bitcoins as part of the block reward. As a result, the reward for Block 776,389 was 6.25 Bitcoin and there were no transaction fees. The winning miner was Binance Pool, which contributed as much as 12% to the overall hash rate of the network.\n\nIt is essential to emphasize the fact that empty blocks do not provide a challenge for the network. Mining empty blocks still results in the production of the coin creation transaction, sometimes referred to as the coinbase transaction. This transaction ensures that Bitcoin is on track to meet its goal of having 21 million Bitcoins in circulation.\n\nThe proportion of vacant blocks on the network is often between between 1% and 2%, as seen by the statistics provided by BitInfoCharts. Given the proliferation of \"ordinals\" on Bitcoin, also known as the capacity to permanently carve photos, data, and marks into the blockchain, this statistic is even more shocking in light of its current state.\n\nThe increase in ordinals has led to various queries and even some anxiety among the Bitcoin community, and only lately the very first cases of pornography were documented.\n\nAs more and more image aficionados compete to have their work included in the Bitcoin blockchain, the mempool has become a more congested place, and block space has become a disputed resource."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjEyNTg2L2JpdGNvaW4tcmVhY2hlcy0yNTAwMC1pdHMtaGlnaGVzdC1wcmljZS1zaW5jZS1qdW5l0gFaaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjEyNTg2L2JpdGNvaW4tcmVhY2hlcy0yNTAwMC1pdHMtaGlnaGVzdC1wcmljZS1zaW5jZS1qdW5l?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin reaches $25,000, its highest price since June - The Block",
        "content": "Bitcoin was trading at $25,108 by 11 a.m. EST, up 3.1% over the past day, according to TradingView data. That's its highest price since June 2022.\n\nLower volatility in stocks and bonds, lower oil prices, and a weakening U.S. dollar have benefited bitcoin, according to Noelle Acheson, former head of market insights at Genesis. It's also one of the most sensitive liquidity plays right now, she said.\n\nRELATED INDICES See crypto indices\n\nBitcoin is up almost 50% year-to-date, following recent gains and January's extended rally."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1bGxzLWFpbS10by1ob2xkLXRoaXMtd2Vlay1zLWJ0Yy1nYWlucy1sZWFkaW5nLWludG8tZnJpZGF5LXMtNjc1bS1vcHRpb25zLWV4cGlyedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin bulls aim to hold this week's BTC gains leading into Friday's $675M options expiry - Cointelegraph",
        "content": "The price of Bitcoin (BTC) gained 6.3% just two days after reaching $21,370 on Feb. 13, which was the lowest level seen in more than three weeks. The price recovery can be partially explained by the Feb. 14 U.S. Consumer Price Index data displaying a 6.4% increase in year-over-year inflation in January.\n\nWhile the U.S. Federal Reserve continues to monitor the overheated economy, the most likely scenario is further interest rate hikes to curb inflation. The unintended consequence is the heightened government debt cost, creating a bullish environment for scarce assets such as commodities, stock market and cryptocurrencies.\n\nThe price gain of Bitcoin practically extinguished bears’ expectation for a sub-$21,500 options expiry on Feb. 17, so their bets are unlikely to pay off as the deadline approaches.\n\nBitcoin investors’ primary concern is the possibility of further impacts from regulators following the U.S. Securities and Exchange Commission ordering Kraken to halt its staking rewards program on Feb. 9 and the crackdown on Binance USD (BUSD) stablecoin issuing on Feb. 13.\n\nEven if the newsflow remains negative, bulls still can profit from Feb. 17’s options expiry by keeping the BTC price above $22,500, but the situation can easily flip and favor bears.\n\nBears were not expecting the $22,000 level to hold\n\nThe open interest for the Feb. 17 options expiry is $675 million, but the actual figure will be lower since bears were expecting sub-$22,000 price levels. These traders became overconfident after Bitcoin traded below $21,500 on Feb. 13.\n\nBitcoin options aggregate open interest for Feb. 17. Source: CoinGlass\n\nThe 1.12 call-to-put ratio reflects the imbalance between the $355 million call (buy) open interest and the $320 million put (sell) options. If Bitcoin’s price remains near $22,700 at 8:00 am UTC on Feb. 17, only $24 million worth of these put (sell) options will be available. This difference happens because the right to sell Bitcoin at $21,000 or $22,000 is useless if BTC trades above that level on expiry.\n\nBulls aim for $23,000 to secure a $155 million profit\n\nBelow are the four most likely scenarios based on the current price action. The number of options contracts available on Feb. 17 for call (bull) and put (bear) instruments varies, depending on the expiry price. The imbalance favoring each side constitutes the theoretical profit:\n\nBetween $21,000 and $22,000: 700 calls vs. 5,500 puts. The net result favors the put (bear) instruments by $100 million.\n\n700 calls vs. 5,500 puts. The net result favors the put (bear) instruments by $100 million. Between $22,000 and $22,500: 1,800 calls vs. 1,500 puts. The net result is balanced between bears and bulls.\n\n1,800 calls vs. 1,500 puts. The net result is balanced between bears and bulls. Between $22,500 and $23,000: 3,800 calls vs. 1,100 puts. The net result favors the call (bull) instruments by $60 million.\n\n3,800 calls vs. 1,100 puts. The net result favors the call (bull) instruments by $60 million. Between $23,000 and $24,000: 6,900 calls vs. 200 puts. The net result favors the call (bull) instruments by $155 million.\n\nThis crude estimate considers the call options used in bullish bets and the put options exclusively in neutral-to-bearish trades. Even so, this oversimplification disregards more complex investment strategies.\n\nFor example, a trader could have sold a call option, effectively gaining negative exposure to Bitcoin above a specific price, but unfortunately, there’s no easy way to estimate this effect.\n\nRelated: Bitcoin price eyes $23K despite US dollar strength hitting 6-week high\n\nBears might benefit from the impact of regulation\n\nBitcoin bulls need to push the price above $23,000 on Feb. 17 to secure a potential $155 million profit. On the other hand, the bears’ best-case scenario requires a 3.5% dump below $22,000 to maximize their gains.\n\nConsidering the negative pressure from regulators, bears have good odds of flipping the table and avoiding a loss of $60 million or larger on Feb. 17.\n\nMore importantly, looking at a broader time frame, there is little room for the Fed to slow down the economy without spiraling the debt interest repayments out of control.\n\nFeb. 17 will be an interesting display of strength between the short-term impact of a hostile crypto regulation environment versus Bitcoin’s long-term scarcity and censorship-resistance benefits.\n\nBitcoin (BTC) price gained 6.3% just two days after reaching $21,370 on Feb. 13, which was the lowest level seen in more than three weeks. The price recovery can be partially explained by the Feb. 14 U.S. Consumer price index data displaying a 6.4% increase in year-over-year inflation in January.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWJyZWFrcy0yNWstZmlyc3QtdGltZS0xNjUxMjk1NDQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin breaks $25K for first time since mid-2022, some hail thaw of crypto winter - Yahoo Finance",
        "content": "Shaking off a clampdown on crypto companies by regulators over the past several weeks, Bitcoin has surged around 9% over the past 24 hours to break $25,000 for the first time since June 2022, according to CoinMarketCap data.\n\nAfter more than eight months below the $25,000 mark, the cryptocurrency topped it before slightly retreating. The coin was trading at about $24,800 as of mid-day Thursday.\n\nThe performance of the most popular cryptocurrency also has lifted the second-leading cryptocurrency, Ether, which was up 8% and hovering near its highest point since September—about $1,700.\n\nChart shows BTC price since Jan. 1, 2023\n\nThe rise in Bitcoin's price could partly be due to the rise of Bitcoin NFTs, called Ordinals, leading to more activity on the blockchain by users not seeking just financial transactions, according to a report from blockchain data company Glassnode. The total non-zero balance addresses on the Bitcoin blockchain are also reached at an all-time high of 44 million.\n\n“This is a new and unique moment in Bitcoin history, where an innovation is generating network activity without a classical transfer of coin volume for monetary purposes,” Glassnode wrote in the report.\n\nThe recovery in crypto markets comes after a pullback in February following a slate of bad news for the industry.\n\nRecent actions by regulators against crypto exchange Kraken and Paxos have sent shockwaves throughout the ecosystem, and had some questioning the future of crypto companies in the U.S.\n\nMeanwhile, on Tuesday, January’s consumer price index report saw inflation increase 0.5% for an annual increase of 6.4% to start off 2023. Although that figure is above analysts' expectations, prices had been falling for the past six months, fueled in part by rate hikes from the Federal Reserve.\n\nStory continues\n\nStill, while leading economists have cautioned that 2023 could be a turbulent year for markets, some on Crypto Twitter have optimistically predicted an extended rally after Bitcoin’s most recent pump.\n\nThis story was originally featured on Fortune.com\n\nMore from Fortune:\n\n5 side hustles where you may earn over $20,000 per year—all while working from home\n\nMillennials’ average net worth: How the nation’s largest working generation stacks up against the rest\n\nThe best 5 ways to earn passive income\n\nThis is how much money you need to earn annually to comfortably buy a $600,000 home\n\n"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZm9ya2FzdC5uZXdzL2VsLXNhbHZhZG9yLWJpdGNvaW4tZW1iYXNzeS10ZXhhcy1kaWdpdGFsL9IBQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2VsLXNhbHZhZG9yLWJpdGNvaW4tZW1iYXNzeS10ZXhhcy1kaWdpdGFsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "El Salvador to establish “Bitcoin Embassy” in Texas to promote adoption of digital assets - Forkast News",
        "content": "El Salvador, the first country in the world to make Bitcoin legal tender, plans to open a “Bitcoin embassy” in Texas, the country’s U.S. ambassador, Milena Mayorga, tweeted on Wednesday. This follows a similar initiative in Switzerland last year to support the use of cryptocurrencies.\n\nSee related article: Will El Salvador’s lead on Bitcoin inspire others to follow suit?\n\nFast facts\n\nMayorga described Texas as a “new ally” and said she had met with Deputy Secretary of the Government of Texas, Joe Esparza, to discuss opening the Bitcoin office and the expansion of commercial and exchange projects. Texas is host to major Bitcoin mining operations.\n\nEl Salvador legalized Bitcoin for tender in September 2021 and now seems to be taking on the role of nation-state evangelist for the world’s biggest cryptocurrency, contrasting with regulatory crackdowns on crypto in other countries.\n\nThe Central American country established a “Bitcoin office” in Lugano, Switzerland in October 2022 to support “initiatives to drive the adoption of Bitcoin and other cryptocurrencies across their respective regions” and foster “the exchange of students and talents between El Salvador and Lugano,” the countries said at the time.\n\nEl Salvador, a country of just over 6 million people, currently holds 2,381 Bitcoin, the third most of any country after the U.S. and Ukraine, according to BitcoinTreasuries.\n\nEl Salvadoran President Nayib Bukele has faced criticism for the Bitcoin plan from the International Monetary Fund and other financial authorities. Bitcoin fell 15% just hours after the legislation making it legal tender came into effect, and has since dropped almost 50%.\n\nThe Central African Republic became the second country to legalize Bitcoin as tender in April 2022.\n\nSee related article: El Salvador’s Bitcoin adoption, one week on"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMi8xNS9lbC1zYWx2YWRvci1wbGFucy10by1vcGVuLWJpdGNvaW4tZW1iYXNzeS1pbi10ZXhhcy_SAWJodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDIvMTUvZWwtc2FsdmFkb3ItcGxhbnMtdG8tb3Blbi1iaXRjb2luLWVtYmFzc3ktaW4tdGV4YXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "El Salvador Plans to Open 'Bitcoin Embassy' in Texas - CoinDesk",
        "content": "The Central American country wishes to open a bitcoin embassy in \"new ally\" Texas, Mayorga said on Twitter. The embassy will aid \"expansion of commercial and economic exchange projects,\" Mayorga said following a meeting with the state's Secretary of State, Joe Esparza."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wMi8xNi9uZnRzLWNvdWxkLWdpdmUtYml0Y29pbi1hLWZhY2UtbGlmdC1hcy1pdC1pbmNyZWFzZXMtZGVtYW5kLWZvci10aGUtYmxvY2tjaGFpbi_SAXRodHRwczovL3RlY2hjcnVuY2guY29tLzIwMjMvMDIvMTYvbmZ0cy1jb3VsZC1naXZlLWJpdGNvaW4tYS1mYWNlLWxpZnQtYXMtaXQtaW5jcmVhc2VzLWRlbWFuZC1mb3ItdGhlLWJsb2NrY2hhaW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "NFTs could give Bitcoin a face-lift as it increases its blockchain demand - TechCrunch",
        "content": "To get a roundup of TechCrunch’s biggest and most important crypto stories delivered to your inbox every Thursday at 12 p.m. PT, subscribe here.\n\nWelcome back to Chain Reaction.\n\nThe past few weeks in crypto land have been focused on the latest craze: Ordinals.\n\nWhat are Ordinals, you might ask? They’re NFT-like Bitcoin digital artifacts that are on the blockchain.\n\nWhile the project isn’t the first to try to bring NFTs onto the Bitcoin blockchain, it’s definitely gaining the most traction today.\n\nAbout 122,500 Ordinals have been inscribed, which is jargon for created (or minted), to date, according to Dune Analytics data. The number of total inscriptions is up 40% from about 88,000 on Tuesday. On February 8, the number of Ordinals inscribed peaked over 21,000, and Wednesday was the second highest day with over 17,7000, the data showed.\n\n“It has really escaped, it’s gone nuclear,” Casey Rodarmor, the creator of Ordinals, shared with TechCrunch. “There are people building things that I don’t even hear about until they’ve launched. So it’s really about where people want to take this.”\n\nAlthough things have started off strong, time will tell on whether or not the project will continue to grow and compete with major NFT ecosystems on chains like Ethereum and Solana.\n\nMore below.\n\nThis week in web3\n\nOrdinals creator views his Bitcoin-centric creation as digital artifacts, not just NFTs (TC+)\n\nTechCrunch sat down with the Ordinals creator to discuss the inspiration for the NFT-like Bitcoin project that is expanding rapidly. “I thought I was building something good and I thought I was meeting an unmet market demand that NFT collectors had expressed a desire for,” Rodarmor said. And by the current market’s response, his creation did in fact meet that demand.\n\nCrypto exchange Binance expects to pay penalties to settle US investigations\n\nBinance, the world’s largest crypto exchange, expects to pay monetary penalties to settle probes into its business in the U.S., a top executive said, in a major about-face after publicly disputing the idea that it was under any investigation and mocking media outlets that reported otherwise. In an apparent admission of breaking laws, Binance chief strategy officer Patrick Hillmann told the WSJ that the company’s executives were unfamiliar with laws and rules written surrounding bribery, corruption and money laundering.\n\nBitcoin NFTs are growing quickly as community sees long-term potential (TC+)\n\nFollowing the theme of Ordinals, TechCrunch also spoke to a handful of experts on what Ordinals’ growth means for the Bitcoin ecosystem. Even though Ordinals and Bitcoin NFTs in general are exploding, it’s still in very early stages, especially when compared to behemoths like Ethereum and Solana. “If Bitcoin wants to stay the most decentralized, widespread and prolific cryptocurrency, it needs something like [Bitcoin NFTs] to push it forward,” Alex Adelman, co-founder and CEO of Bitcoin-rewards platform Lolli, said.\n\nSEC’s proposal could affect which crypto companies can manage assets (TC+)\n\nThe U.S. Securities and Exchange Commission proposed a new rule on Wednesday that may back crypto companies further into a corner as regulators continue to crack down on the space. The SEC voted 4-1 for a proposal that would direct registered investment advisers (RIAs) — like wealth managers or hedge funds — to keep customers’ money and securities with qualified custodians like a bank, broker-dealer or trust company when storing digital assets, mainly leaving crypto companies on the outskirts.\n\nWant to buy an NFT with your credit card? Magic Eden lets you do just that (TC+)\n\nOne of the biggest complaints in the crypto world is that using the technology is, you know, kind of difficult. But as the ecosystem evolves, many big players are trying to alleviate the issue through new on-ramps or payment solutions. MoonPay, a web3 infrastructure company, has joined forces with Magic Eden, one of the biggest NFT marketplaces, to help make NFTs more accessible through old-school tricks, the companies announced on Monday.\n\nThe latest pod\n\nWe released a fun bonus episode this week, which dives into TechCrunch’s newest podcast: Inside Startup Battlefield, which is a four-part series that takes you behind the Startup Battlefield competition.\n\nFor last week’s episode, Jacquelyn talked to Gwendolyn Regina, investment director at layer-1 blockchain BNB Chain. Prior to her current role, Gwen worked at Facebook, or as some call it now, Meta, building up a new business unit for venture capital partnerships and startup growth. She’s also a founder of a few different businesses and a founding team member for early-stage tech investment firm Thymos Capital.\n\nBNB Chain was launched in 2020 and initially kicked off by Binance, the world’s largest crypto exchange by trading volume. Since then, BNB Chain aims to be a decentralized, community-owned separate entity from Binance with a focus on three audiences: retail markets, builders and developers, and bridging Web 2.0 businesses to web3, Regina shared.\n\nGaming on BNB Chain also has grown “organically through robustness and cheaper fees,” but the blockchain’s team is now “doubling down” in that sector to encourage more gamers and developers to play and build on its chain, Regina added.\n\nWe also discussed:\n\nThe dApps developers are building on-chain\n\nBNB’s investing strategy\n\nWhat investors look for in founders\n\nAdvice to startups launching in a bear market\n\nSubscribe to Chain Reaction on Apple Podcasts, Spotify or your favorite pod platform to keep up with the latest episodes, and please leave us a review if you like what you hear!\n\nFollow the money\n\nStelo Labs raises $6 million in a16z-led round to help crypto wallet users protect themselves Crypto index platform Alongside raises $11 million led by a16z Monad Labs raises $19 million to grow its smart contract platform and improve the Ethereum space Caldera raises $9 million from two rounds led by Sequoia and Dragonfly Capital Ironblocks raises $7 million to protect decentralized finance and web3 from threats and theft\n\nThis list was compiled with information from Messari as well as TechCrunch’s own reporting."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiLWh0dHBzOi8vZGVjcnlwdC5jby8xMjE0MjAvZGVnb2RzLWJpdGNvaW4tbmZ0c9IBM2h0dHBzOi8vZGVjcnlwdC5jby8xMjE0MjAvZGVnb2RzLWJpdGNvaW4tbmZ0cz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "'Bitcoin Is the Best Brand in Crypto': Why DeGods NFTs Are Now on Bitcoin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin NFTs via Ordinals are the buzziest thing in the space lately, with more than 100,000 such media assets committed to the blockchain in barely two weeks. Surprisingly, that tally includes 535 NFTs from DeGods—the most valuable Solana NFT project.\n\nDeGods revealed the move on Monday as word circulated that the profile pictures (PFPs) had all been inscribed on Bitcoin in a single block. (\"Inscribing\" is the process by which NFT-like assets are created on the Bitcoin blockchain, akin to \"minting\" on Ethereum.) The 535 particular images were originally released via Solana in 2021, but were “burned” (or permanently destroyed) to cut down the supply in the early days of the project.\n\nProject creator Rohun Vora, who goes by the pseudonym Frank, told Decrypt that he and Dust Labs CEO Kevin Henrikson (who simply goes by Kevin) are longtime Bitcoin aficionados who relished the opportunity to bring the project onto the leading cryptocurrency’s network in the early days of Ordinals momentum.\n\nAD\n\nAD\n\nAesthetics matter a lot to my team @DeGodsNFT. It was an honor working with @hash_bender to make sure there was no random trashy Ordinals minted in between all 535 DeGods. All in one block. Simple. Beautiful. Inscribed on the Bitcoin blockchain forever. pic.twitter.com/Yfuvc8IDuT — Frank III (@frankdegods) February 14, 2023\n\n“Bitcoin is the best brand in crypto—just as pristine as it gets,” Frank told Decrypt. “It's the most well known, and truly as simple but powerful as it can get. And the mission statement is it's never been corrupted, right? It's like global sound money. That is so powerful. Aligning ourselves with the best brand in crypto is a no-brainer at any given point in time.”\n\nNow those 535 PFPs have gained a second life on Bitcoin with never-before-seen upgraded artwork. DeGods previously provided holders refreshed “DeadGods” artwork last year, and created upgraded artwork for the burned NFTs as well, plotting an eventual revival.\n\n“We always had this notion of ‘What is dead may never die,’” Kevin explained, echoing the familiar refrain from the HBO series \"Game of Thrones.\" “And it was this idea, like: Holy shit, this is so perfect. We can literally bring these back, mint them as Ordinals on BTC, and it's permanent,” he said.\n\nBack to life\n\nOrdinals is a unique way of inscribing NFT-like media and assets to the Bitcoin blockchain by connecting them with a single Satoshi, or 1/100,000,000th of one BTC. The media is fully stored on-chain and the Ordinal can be transferred, although there’s still a need for a lot more infrastructure and platforms for transacting and handling the assets.\n\nAD\n\nAD\n\nIt has quickly given rise to CryptoPunks clones and playable web games on Bitcoin. OnChain Monkey, an Ethereum project, also put its entire 10,000 NFT original collection into a single inscription. However, Ordinals has also drawn considerable backlash from Bitcoin maximalists, plus it has boosted network congestion—and transaction fees in tandem.\n\nKevin said that they dove into Ordinals as soon as it started gaining steam. But with the DeGods inscriptions, they didn’t just want to mint them in the typical way and have the inscriptions added to the network across potentially multiple Bitcoin blocks.\n\nInstead, they worked with a Bitcoin miner, Luxor Technologies CEO Nick Hansen, to arrange for all 535 of the NFT inscriptions to be etched onto the blockchain in a single, exclusive block. The block was processed by DMG Blockchain Solutions’ Terra Pool, which claims to be a carbon-neutral mining pool powered by renewable energy solutions.\n\nOver 1 year ago, 535 DeGods were burned. Many have speculated on their return. What is dead may never die. pic.twitter.com/fmP1FhZI6F — Frank III (@frankdegods) February 13, 2023\n\n“It was a deal-breaker for us if we couldn't do it as a custom block, because we had to do something special,” Frank told Decrypt. “It’s the DeGods way, right? You can't just do it in the basic way. You’ve gotta do something that feels really fresh.”\n\nUltimately, to fit the 535 images into a single Bitcoin block, they had to be seriously compressed. Each was resized down to a low-resolution 210x210 pixels—a nod to the total Bitcoin supply of 21 million BTC—and in the .webp file format to conserve space. But now they’re all inscribed on the Bitcoin blockchain for future use.\n\nWhile many NFTs on Ethereum and other platforms store their artwork externally on either centralized servers or decentralized storage solutions (like IPFS), Ordinals fit the artwork or asset entirely within the on-chain block. That proved to be a key part of the appeal for the DeGods team—that these assets will live potentially forever on Bitcoin.\n\n“I've run a [Bitcoin] node, and the idea that every single node on the planet is now verifying and backing up this image is so powerful,” Frank said. “That is what got us really excited.”\n\nAD\n\nAD\n\nNext steps\n\nMeanwhile, the broader DeGods project is already set to be bridged from Solana to Ethereum sometime this quarter, as announced in December—with sister project y00ts bridging from Solana to Polygon.\n\nThat’s still happening for the rest of the project’s 10,000 total NFTs, and Frank tweeted this week that “having a presence on all blockchains is important.” However, these 535 specific DeGods NFTs, which were previously burned on Solana, will only live on Bitcoin via Ordinals.\n\nHow they roll out remains to be seen, however. The official DeGods account tweeted Monday that details on how to mint the Bitcoin NFTs will be announced “in the coming days.”\n\nOn Tuesday, however, Kevin told Decrypt that they’re currently being held in private wallets, and that they’re waiting for more tooling to be deployed to make Ordinals safer to handle and transact. Once that target is hit, Kevin said that they have plenty of ideas on how to launch the NFTs in an effort to “come back to our holders and support the community.”\n\n“We're gonna essentially sit on them,” Kevin said, “until we are comfortable that the tooling will support the proper custody of these for a reasonably sophisticated crypto connoisseur.”"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMivQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTYtZmVicnVhcnktMjAyMy9hcnRpY2xlc2hvdy85Nzk3MzcwMS5jbXPSAcEBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTE2LWZlYnJ1YXJ5LTIwMjMvYW1wX2FydGljbGVzaG93Lzk3OTczNzAxLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin above $24,500; Ethereum, BNB rise over 7% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency market was trading higher on Thursday, with Bitcoin (BTC) rallying over 11% to $24,582, whereas Ethereum (ETH) was above the $1,650 level. BTC volume in the last 24 hours stood at approximately $36.77 billion, rising 36.42% in the last 24 hours.\"Bitcoin hovered above the $24,000 level after trading lower for several days. This surge is due to investors liquidating their positions, pushing the price higher. Compared to its low point a month ago, BTC has increased by 61%. In the past 24 hours alone, BTC surged by more than 11%, reaching this level for the first time in two weeks.If bullish investors maintain their momentum, BTC may reach US$25,000 soon. Overall, there is bullish sentiment in the market,\" Edul Patel, Co-founder and CEO at Mudrex said.Other top crypto tokens were also trading higher on Thursday. Polygon surged 9.6%. Solana, Cardano, Shiba Inu and BNB were also trading with gains. The global cryptocurrency market cap was trading higher around $1.11 trillion, rising 7.98% in the last 24 hours.The total volume in DeFi is currently $6.65 billion, 8.92% of the total crypto market 24-hour volume. The volume of all stablecoins is now $67.66 billion, which is 90.85% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $474.20 billion, with a dominance of about 42.61%, an increase of 1.07% over the day, according to CoinMarketCap.\"Market indicators continue to point to a neutral sentiment. The Relative Strength Index (14), one of the key indicators, sits at 69.79, with a neutral outlook. The Stochastic (14, 3, 3) and the Average Directional Index (14) are at 73.43 and 36.57, respectively, further signalling a neutral market, similar to its behaviour as the previous day,\" Rajagopal Menon, Vice President at WazirX said.\"The MACD Level (12, 26), another important indicator of the market sentiment, is at 519.38, indicating a “Buy”. The Stochastic RSI Fast (3, 3, 14, 14) is at 71.35 with a Neutral indicator, while the Williams Percent Range (14) at -7.27, signals “Sell”,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.56 hours, IST on February 16, 2023)Bitcoin $ 24,555 10.85%Ethereum $1,680 8.29%Tether $1 -0.03%BNB $320.55 7.53%XRP $0.3991 4.19% Dogecoin $0.08862 2.71%Cardano $0.4065 5.46%Polygon $1.35 9.11%Polkadot $6.58 6.01%Tron $0.0705 3.98%Litecoin $100.98 4.68%Shiba Inu $0.00001371 5.67%Solana $23.62 9.14%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMTUvZGJzLXNheXMtYml0Y29pbi10cmFkaW5nLXVwLTgwLWluLTIwMjItb24tZGRleC1leGNoYW5nZS_SAWhodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzE1L2Ricy1zYXlzLWJpdGNvaW4tdHJhZGluZy11cC04MC1pbi0yMDIyLW9uLWRkZXgtZXhjaGFuZ2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "DBS Says Bitcoin Trading up 80% in 2022 on DDex Exchange - CoinDesk",
        "content": "In a February 2022 interview with CoinDesk, Lionel Lim, the CEO of DDEx, said the exchange’s full-year trading volume was about $819 million for 2021, a fraction of what institution-focused LMAX Digital or Hong Kong-based institutional exchange OSL would do."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wMi8xNi9vcmRpbmFscy1jcmVhdG9yLXZpZXdzLWhpcy1iaXRjb2luLWNlbnRyaWMtY3JlYXRpb24tYXMtZGlnaXRhbC1hcnRpZmFjdHMtbm90LWp1c3QtbmZ0cy_SAX1odHRwczovL3RlY2hjcnVuY2guY29tLzIwMjMvMDIvMTYvb3JkaW5hbHMtY3JlYXRvci12aWV3cy1oaXMtYml0Y29pbi1jZW50cmljLWNyZWF0aW9uLWFzLWRpZ2l0YWwtYXJ0aWZhY3RzLW5vdC1qdXN0LW5mdHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Ordinals creator views his Bitcoin-centric creation as ‘digital artifacts,’ not just NFTs - TechCrunch",
        "content": "Ordinals, a Bitcoin-based NFT-like project, has expanded significantly over the past two weeks, but its creator, Casey Rodarmor, said he had no idea it would explode.\n\n“I thought I was building something good and I thought I was meeting an unmet market demand that NFT collectors had expressed a desire for,” Rodarmor told TechCrunch.\n\nBy the current market’s response, his creation did in fact meet that demand.\n\nAbout 122,500 Ordinals have been inscribed, which is jargon for created (or minted), to date, according to Dune Analytics data. The number of total inscriptions is up 40% from about 88,000 on Tuesday. On February 8, the number of Ordinals inscribed peaked over 21,000, and Wednesday was the second highest day with over 17,7000, the data showed.\n\nThe Bitcoin community has been somewhat divided on whether NFTs on its blockchain are a good thing. While many see them as a positive, fun way to further grow its ecosystem, some “Bitcoin maximalists” oppose them for taking up block space on the network and making transaction fees more expensive, among other things.\n\n“My theory on why this blew up is that [the community] saw this controversy, but then they saw exactly what they wanted — on-chain, immutable NFTs that are there forever. Like, fuck yeah, sign me up,” Rodarmor said.\n\nRodarmor’s Genesis inscription, which is the first Ordinal inscription — or inscription 0 — was some “tiny pixel art” of a skull that marked the beginning of it all, he said. The image was timestamped on December 14, according to the Ordinals website. It pays homage to the first block to be mined on the Bitcoin blockchain, which is commonly known as the Genesis Block. “It’s really simple, but I’m proud of it,” he added.\n\nThe second inscription, inscription 1, was made three days later. It an image of the infamous CryptoDickbutts NFT. No, that’s not a typo.\n\nRodarmor is a long-time Bitcoiner and programmer artist. He said he’s made art using code in the past, but it was always a hobby before he created Ordinals. In 2021, when NFTs started gaining interest, he saw the space as something he wanted to dive into, “even as a hardcore Bitcoiner who saw altcoins as uninteresting,” he joked.\n\nIn early 2022, Rodarmor decided he would figure out a way to create NFTs on top of Bitcoin’s chain. “So I came up with Ordinals, or Ordinal theory, when I’m being tongue-in-cheek.”\n\nWhile the project isn’t the first to try to bring NFTs onto the Bitcoin blockchain, it’s definitely gaining the most traction today. Counterparty, for instance, was the first platform to inscribe NFTs on Bitcoin’s network with the Rare Pepe collection in 2014. Although Rare Pepe didn’t do much to boost mass demand, one of its NFTs from 2016 sold for $3.6 million at a Sotheby’s auction about a year ago.\n\nOrdinals are a “simple concept” that essentially gives individual satoshis, the smallest denomination of bitcoin (equivalent to 100 millionth of a bitcoin), an identity and allows them to be tracked across transactions. The name derives from ordinal numbers, a common term in mathematics, he said.\n\nAnd what’s the identity? These Bitcoin NFTs — or digital artifacts (as he prefers to call them) — live on-chain forever.\n\nRodarmor shared that he got the name inspiration for digital artifacts from ChatGPT when he couldn’t figure out what to call them. “I was sitting there asking ChatGPT what word would you call an NFT, digital collectible, that could also be a trading card or a 15th-century digital equivalent of a Chinese silk fan.”\n\nChatGPT replied with “digital artifact,” he said. “I was like, fuck yes, that’s it.”\n\nWhile inscriptions are technically NFTs, Rodarmor prefers the term digital artifacts “because there’s a broader category of NFTs, but inscriptions are a subset of NFTs that don’t do certain things,” he said. “So it’s like all inscriptions are digital artifacts and also NFTs, but not all NFTs are digital artifacts.”\n\nWhat makes inscriptions stand out from NFTs? Security, immutability, decentralization and homogeneity, among other subtle characteristics, Rodarmor said.\n\n“Ordinal theory is like a lens that you can view the Bitcoin blockchain through, and when you view it through that lens, these trackable satoshis pop into view like Pokémon in the tall grass,” Rodarmor said. “That was what I needed, because I needed something where content could live as an artist.\n\n“I wanted to make digital artifacts and then the inscriptions came as a way to add content to those trackable sets,” Rodarmor said. “Then that is what inscriptions became; that’s the story.”\n\nBut Rodarmor said the story isn’t fully formed.\n\n“The short-term goal is to protect users and draw the line in the sand,” Rodarmor said. “I think that it’s very important to protect against scams.”\n\nThe project is currently fully open sourced, so in order for it to continue to scale, there need to be more developers, Rodarmor noted. “I have not taken any outside investment or made any promises, but I’m trying to scale an open source development organization to shepherd the technology and protocol.”\n\nDown the line, there’s a chance that Ordinals could become a for-profit corporation, he said. “I need a corporation to serve as a legal liability shield for the website. So I don’t want anybody to be surprised if there’s going to be a corporation — and that corporation may grow in scope as appropriate.”\n\nBut for the foreseeable future, scaling Ordinals will be all about improving its technology, education and helping others learn about it. “That’s really going to drive the growth,” Rodarmor said.\n\nOther community members have spoken out about the importance of infrastructure being built around the project, too. Many inscriptions are being completed manually rather than through a service like an NFT marketplace. Although some services have popped up in response to the sudden demand, the infrastructure is still extremely nascent and not bulletproof.\n\nAccessibility is the “north star for all of this right now,” Nick Hansen, CEO and co-founder of Luxor, previously told TechCrunch. Over time, there will be more users and more products focused on expanding the Bitcoin NFT — or digital artifact — ecosystem.\n\n“It has really escaped; it’s gone nuclear,” Rodarmor said. “There are people building things that I don’t even hear about until they’ve launched. So it’s really about where people want to take this.”\n\nRodarmor said he sees it as a “credibly neutral social layer” for the world. “You can put data on there, and it might not be to some people’s taste, but it’s pretty hard to censor it. People can use it as a sort of distributed publishing platform in addition to this with content you can own.”\n\nWhile Rodarmor shared that he doesn’t know what’s in store for the long run, he believes that it will continue to grow as a “very powerful concept.”\n\n“I think the sky’s the limit,” he added. “Come use bitcoin. The water is warm.”"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jaGFybGllLW11bmdlci1pbS1ub3QtcHJvdWQtb2YtbXktY291bnRyeS1mb3ItYWxsb3dpbmctY3J5cHRvLXNoLXQtMjAyMTA5MTU4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Charlie Munger: 'I'm not proud of my country' for allowing 'crypto sh-t' - Yahoo Finance",
        "content": "Legendary investor Charlie Munger pulled no punches when it came to offering his latest anti-cryptocurrency views on Wednesday.\n\nIn Munger's view, traditional currencies have helped turn man \"from a successful ape to a [successful] human,\" he said during the Daily Journal’s shareholder meeting in Los Angeles on Wednesday. Munger said claims cryptocurrencies can replace national currencies are the equivalent of saying that air can be replaced.\n\n\"It isn't even slightly stupid, it's massively stupid, and of course it's very dangerous, and of course the governments were totally wrong to permit it,\" Munger told CNBC's Becky Quick during a livestream of the event.\n\n\"And of course, I am not proud of my country for allowing this crap — well, I call it crypto shit. It's worthless, it's crazy, it's not good, it'll do nothing but harm, it's antisocial to allow it.\"\n\n\"I think the people that oppose my position are idiots,\" the 99-year-old Munger said when asked about his recent op-ed in the Wall Street Journal calling for a ban on the asset class. \"And so I don’t think there is a rational argument against my position.\"\n\nMunger, who has drawn criticism for praising the Chinese government in the past, said the nation's leaders were right not to allow cryptocurrencies. The People's Bank of China banned all cryptocurrency transactions in September 2021.\n\nBerkshire Hathaway Chairman Warren Buffett (left) and Vice Chairman Charlie Munger are seen at the annual Berkshire shareholder shopping day in Omaha, Nebraska, U.S., May 3, 2019. REUTERS/Scott Morgan (Scott Morgan / Reuters)\n\n\"You oughta be able to state a lot of issues: how big should the social safety net be? That’s a place where reasonable minds can disagree, and you should be able to state the case on the other side about it as well as the case you believe in,\" Munger said.\n\n\"But when you’re dealing with something as awful as crypto shit, it's just unspeakable,\" he added. \"I’m ashamed of my country that so many people believe in this kind of crap and the government allows it to exist.\"\n\nStory continues\n\nIn recent years, Munger has called crypto a type of \"venereal disease\" and once referred to Bitcoin \"probably rat poison squared.\"\n\nMunger's remarks Wednesday come following the collapse of FTX, previously one of the largest crypto exchanges in the world before founder Sam Bankman-Fried was accused of defrauding investors, among other crypto scandals that were surfaced in 2022.\n\nDigital asset values have plunged over the last year after reaching all-time highs reached in 2021 as the Federal Reserve's interest rate-hiking campaign prompted investors to steer away from speculative pockets of the market.\n\nAs of Wednesday, the total market cap of cryptocurrencies stood at around $1.07 trillion, down from a record north of $2.7 trillion reached in Nov. 2021.\n\nIn 2023, Bitcoin (BTC-USD) and Ethereum (ETH-USD) have rebounded sharply along with other risk assets and are up roughly 40% and 35%, respectively, year-to-date.\n\n—\n\nAlexandra Semenova is a reporter for Yahoo Finance. Follow her on Twitter @alexandraandnyc\n\nClick here for the latest trending stock tickers of the Yahoo Finance platform\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance\n\nDownload the Yahoo Finance app for Apple or Android\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and YouTube"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZGFpbHljb2luLmNvbS9icmF6aWwtdG8taG9zdC1maXJzdC1ldmVyLWJpdGNvaW4tYmVhY2gtY2Fybml2YWwv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Brazil to Host First-Ever Bitcoin Beach Carnival - DailyCoin",
        "content": "The Bitcoin education initiative Praia Bitcoin Brazil will host its inaugural Bitcoin Carnival in Jericoacoara. The project aims to build a sustainable circular economy for the unbanked and impoverished citizens in the country.\n\nThe social project has attracted substantial attention since its launch and was awarded by Blockchain for Humanity as the leading “social project with the greatest impact in the world” during a presentation at LaBitConf Argentina 2022. The conference aims to teach people how to practically use Bitcoin, providing a roadmap for merchants accepting cryptocurrency payments in the region."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vYmxvY2tjaGFpbi5uZXdzL25ld3MvYml0Y29pbnMtYXZlcmFnZS1ibG9jay1zaXplLWhpdHMtYWxsLXRpbWUtaGlnaHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin's Average Block Size Hits All-Time Highs - Blockchain.News",
        "content": "The average Bitcoin block size has reached record highs after Bitcoin NFT Ordinals protocol launched.\n\nBecause to the introduction of the nonfungible tokens (NFTs) protocol Ordinals in January 2023, the average size of a Bitcoin block has surpassed 2.5 megabytes (MB) for the first time since the cryptocurrency's foundation in 2009. This marks a new all-time high for the cryptocurrency.\n\nAccording to statistics obtained from Blockchain.com, the size of Bitcoin blocks increased by more than 2 MB in the weeks after the debut of the Ordinals Protocol. This surge in block size can be traced back to the beginning of February 2023.\n\nSoftware developer Casey Rodarmor introduced the Ordinals protocol in the month of January. This protocol makes it possible for users of the Bitcoin network to create \"digital artifacts.\" These may include JPEG photographs, PDF documents, as well as audio and video files.\n\nIn the documentation for Ordinals, Rodarmor explains that each of these digital objects may be inscribed to a single satoshi, which is one of the component parts of a Bitcoin. The value of one bitcoin is equal to 100,000,000 satoshis.\n\nIndividual satoshis have the ability to be imprinted with any kind of data, allowing for the creation of one-of-a-kind digital artifacts that are original to Bitcoin. These artifacts may be stored in bitcoin wallets and moved via bitcoin transactions. The permanence, immutability, security, and decentralization of inscriptions are on par with those of Bitcoin itself.\n\nThe Bitcoin community is split on the issue of whether or not it should be possible to engrave digital items into the blockchain , and the reasons both for and against the proposal provide plenty of material for reflection. The greater use of block space for the inscription of several Ordinals has emerged as one of the primary topics of discussion.\n\nSince July 2021 and continuing until February 2023, the typical size of a Bitcoin block has ranged between 0.7 and 1.5 megabytes. The average size of a Bitcoin block topped 2 megabytes for the first time on February 5, and it is now hovering at around 2.2 megabytes at the time of this writing.\n\nAccording to statistics obtained by Glassnode, the introduction of Bitcoin Ordinals has also resulted in the network reaching a new high of 44 million non-zero addresses.\n\nThe most recent issue of Glassnode's newsletter mentions that Ordinals compete for block space demand despite the fact that they have not yet materially influenced network pricing.\n\nThe introduction of Ordinals was referred to as a \"new and unique point in the history of Bitcoin\" by Glassnode. This is because innovation may promote network activity even without the \"classical transfer of currency volume for monetary objectives.\""
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vZGVjcnlwdC5jby8xMjE1MjcvYml0Y29pbi1wcmljZS1icmVha3MtYWJvdmUtMjUwMDDSAUBodHRwczovL2RlY3J5cHQuY28vMTIxNTI3L2JpdGNvaW4tcHJpY2UtYnJlYWtzLWFib3ZlLTI1MDAwP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Breaks Above $25,000 for the First Time in Eight Months - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin today broke above $25,000 for the first time since June last year.\n\nIt has since dropped slightly: right now, the largest cryptocurrency by market cap is trading hands for $24,914, according to CoinGecko data. That’s a 9.2% 24-hour jump.\n\nThe asset took the rest of the market with it—seemingly unfazed by a U.S. regulatory crackdown. The total market capitalization for all crypto assets has jumped by roughly $100 billion over the last day.\n\nAD\n\nAD\n\nEthereum, the second largest digital asset, is up 8.4% in the past day, priced in at $1,717. Dogecoin, the 10th biggest, jumped 4.6% and is now valued at $0.09.\n\nBut why is this happening? It’s hard to say but experts who spoke with Decrypt said the regulatory crackdown might actually be playing a part.\n\nLast week, the U.S. Securities and Exchange Commission hit American crypto exchange Kraken with a $30 million fine, and reports emerged this week that the regulator was also preparing to sue stablecoin provider Paxos.\n\nMeanwhile, the world’s biggest digital asset exchange Binance said yesterday it would likely pay fines to settle SEC investigations.\n\nWhite Lion Capital CIO John Nance told Decrypt that although it was hard to be certain, with “crypto getting attacked from all angles,” investors may be selling alt-coins and increasing Bitcoin holdings because it is “becoming more clear that the safest place in crypto is pure BTC.”\n\nAD\n\nAD\n\nCoinShares Head of Research James Butterfill added that Hong Kong’s plans to become an Asian crypto hub might be contributing to the price rise as Asian investors plug money into the space.\n\nBitcoin is still well below its November 2021 all-time high of $69,044—63% lower. The cryptocurrency has typically been correlated with the U.S. stock market as investors have lumped it into the “risk-on” asset class.\n\nAs the U.S. Federal Reserve has continually raised interest rates to get sky-high inflation under control, the cryptocurrency market—and tech stocks—have experienced a brutal sell-off. Sentiment on this front may be beginning to shift, however, as the Fed eases off from its aggressive posture."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtY29vbHMtb24tbGF0ZXN0LXVzLWRhdGEtYXMtYml0Y29pbi1saXF1aWRhdGVzLTgwbS1pbi1zaG9ydHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "BTC price cools on latest US data as Bitcoin liquidates $80M in shorts - Cointelegraph",
        "content": "Bitcoin (BTC) trended toward $24,000 at the Feb. 16 Wall Street open after fresh macroeconomic data from the United States overshot estimates.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nHot U.S. PPI data “rattles” markets\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD retracing some of its latest gains on the day, trading at around $24,400 on Bitstamp at the time of writing.\n\nThe pair had hit $24,895 on Bitstamp overnight, marking its highest levels in six months as a surprise rally appeared to catch many traders off-guard.\n\nOver the two days to Feb. 16, $80 million in short positions were liquidated on Bitcoin alone, with $65 million coming on Feb. 15 — the most in a single day since Jan. 20.\n\nBTC liquidations chart. Source: Coinglass\n\nThe U.S. Producer Price Index (PPI) print for January nonetheless extinguished some of the excitement on risk assets as it showed wholesale prices increasing more than expected on a year-on-year basis.\n\nThe S&P 500 and Nasdaq Composite Index were both down 1.1% at the time of writing.\n\n“Some signs of economic weakening in today’s macro data,\" investment research resource Game of Trades wrote in part of the reaction on Twitter, while also noting that unemployment data had come in below the expected 200,000 claims for the week.\n\nMarkets rattled by hot US PPI data. US PPI for Jan was hot (hotter than the CPI from a few days ago), w/headline +0.7% MoM vs +0.4%, PPI YoY at 6% vs 5.4% expected. Core US PPI disappointed as well w/+0.6% MoM vs +0.2% expected, 4.5% YoY vs 4% expected. pic.twitter.com/IE7SWvcM8Q — Holger Zschaepitz (@Schuldensuehner) February 16, 2023\n\nIn step with declining equities, the U.S. Dollar Index (DXY) showed renewed strength, climbing above 104.1 to its highest level since the first week of the year.\n\n“Still going perfectly as expected, so far we’re seeing a D1 downtrend break and flip, eyes on D1 200 EMA in the 104.5-104.7 area as discussed past couple of weeks,” popular trader Pierre wrote.\n\nU.S. Dollar Index (DXY) 1-day candle chart. Source: TradingView\n\nWhat’s in a death cross\n\nBitcoin faced key moving averages of its own, meanwhile, in the form of the 50-week and 200-week trend lines, these having just printed their first-ever “death cross” in a warning to bulls.\n\nRelated: Why is Bitcoin price up today?\n\nFor Cointelegraph contributor Michaël van de Poppe, however, there was reason not to pay too much attention to the phenomenon following the 2022 bear market.\n\n“The Death Cross only takes place based on historical price events,” he told Twitter followers on Feb. 15.\n\n“The entire bear market of the past year, that’s finally coming into that cross. Best thing to do with such a thing is to long instead of short.”\n\nBTC/USD 1-week candle chart (Bitstamp) with 50, 200MA. Source: TradingView\n\nFellow trader Crypto Tony summarized the mood among more conservative market participants.\n\nIn an update after the latest local highs, he argued that much depended on Bitcoin’s behavior around $25,000.\n\n“My main target on this 5th wave is $25,000 as this is also the prior untapped swing high,” he explained alongside a chart.\n\n“From here we will get more of a understanding whether we are indeed in a flat bearish correction, or if this is the start of something more exciting.”\n\nBTC/USD annotated chart. Source: Crypto Tony/Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1wcmljZS1wcmludHMtZGVhdGgtY3Jvc3MtYWZ0ZXItbG9zaW5nLTEzLXZlcnN1cy1iaXRjb2luLWZyb20tMjAyMy1wZWFr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Ethereum price prints 'death cross' after losing 13% versus Bitcoin from 2023 peak - Cointelegraph",
        "content": "Ethereum’s native token, Ether (ETH), has printed a death cross technical pattern versus Bitcoin (BTC) for the first time since May, suggesting more pain ahead for ETH/BTC in the coming weeks.\n\nPrevious ETH price death cross preceded 27.5% drop\n\nA death cross appears when an asset’s short-term 50-day moving average moves below its long-term 200-day moving average. Such a chart pattern was seen in December 2007, ahead of the global economic crisis.\n\nSimilarly, the ETH/BTC’s previous death cross, in May, preceded an approximately 27.5% price correction, dropping in part as investors reduced exposure to altcoins and sought safety in Bitcoin amid the Terra collapse.\n\nETH/BTC daily price chart. Source: TradingView\n\nThe latest ETH/BTC death cross could lead to a similar short-term sell-off, primarily due to the United States Securities and Exchange Commission’s crackdown on crypto staking services. Staking is a key feature of many blockchains, including Ethereum.\n\nRelated: Why is Bitcoin price up today?\n\nMeanwhile, capital flows to and from Bitcoin and Ethereum-based funds also reveal BTC gaining the upper hand. Interestingly, Bitcoin-based investment funds have attracted $183 million in 2023 compared to Ethereum’s $15 million, according to CoinShares’ latest weekly report.\n\nNext targets for ETH/BTC\n\nThe next potential targets to watch for ETH/BTC are best visible on the weekly chart.\n\nNamely, the 0.067-0.065 BTC area, which has served as a strong support level in recent history. A successful rebound here could have ETH price rebound toward its multi-month descending trendline resistance (black) near 0.075 BTC.\n\nETH/BTC weekly price chart. Source: TradingView\n\nConversely, a decisive break below the 0.067-0.065 BTC range could have ETH enter an extended selloff toward the 200-week exponential moving average (200-week EMA; the blue wave) near 0.055 BTC, down about 20% from current price levels.\n\nNotably, the 200-week EMA served as a bottom to the November 2021-June 2022 bear cycle.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZ2xpbmVhLmNvbS9lbmdsaXNoL2hvdy1uYXRpYi1idWtlbGUtZWwtc2FsdmFkb3JzLWJpdGNvaW4tbG92aW5nLXByZXNpZGVudC13b24tb3Zlci13YWxsLXN0cmVldC_SAYIBaHR0cHM6Ly93d3cuYmxvb21iZXJnbGluZWEuY29tL2VuZ2xpc2gvaG93LW5hdGliLWJ1a2VsZS1lbC1zYWx2YWRvcnMtYml0Y29pbi1sb3ZpbmctcHJlc2lkZW50LXdvbi1vdmVyLXdhbGwtc3RyZWV0Lz9vdXRwdXRUeXBlPWFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "How Nayib Bukele, El Salvador’s Bitcoin-Loving President, Won Over Wall Street - Bloomberg Línea English",
        "content": "El Salvador is one of the most extreme examples of how the world’s riskiest government bonds have recovered after being over-sold last year\n\nBloomberg — For most of the four years since taking office, El Salvador’s President Nayib Bukele has relished his role as an anti-establishment warrior.\n\nHe sacked judges, exited a regional anti-corruption pact, spurned the International Monetary Fund and adopted Bitcoin as legal tender. All the while, he seemed wholly indifferent to what foreign investors thought of him.\n\nIt turns out, the brash, ball-cap-backwards 41-year-old president is a hit with Wall Street.\n\nSalvadoran debt is the best performer in emerging markets this year after Lebanon. Even after a pullback this week, the notes have returned 19%, compared to a 2.3% average for other developing nations, according to a Bloomberg sovereign bond index.\n\nPUBLICIDAD\n\nVIEW + Nayib Bukele Says El Salvador Paid Full $800 Million of Maturing Foreign Bond El Salvador’s foreign bonds rallied an average of 24% this month as the maturity date approached, according to data compiled by Bloomberg\n\nEl Salvador is one of the most extreme examples of how the world’s riskiest government bonds have recovered after being over-sold last year by money managers who expected a wave of defaults. But it’s also a sign of how investors have warmed to Bukele. Instead of concerns about him running the economy into the ground, they are gushing about his embrace of fiscal prudence and largely looking beyond his autocratic tendencies.\n\nRally in El Salvador's Dollar Bonds | Investors are warming to the country's debt after Bukele paid back a bond in Jan.\n\nThe change in tone started when El Salvador repaid $800 million of bonds that matured last month and repurchased US$452 million of debt due in 2025, making good on repeated promises that the nation would meet its obligations. While there’s still some skepticism on where Bukele will take the country of 6 million, for now, he’s no longer the risk he once was.\n\n“We went from skepticism, from looking at the numbers and hearing his announcement of paying down the bond, to basically being surprised in a good way by his very strong willingness to pay,” said Federico Kaune, head of emerging-markets fixed income at UBS Asset Management in New York.\n\nPUBLICIDAD\n\nFor the last seven months bonds have been reversing a drop that began when El Salvador adopted Bitcoin alongside the US dollar as its currencies. Bukele has continued to ride the cyrptocurrency, even as its value plummeted more than 40% over the past year. This week, his government said it would open its second “Bitcoin embassy,” this one in Texas.\n\nVIEW + True or False: Is Crypto Collapse a Real Risk for El Salvador’s Economy? As cryptocurrencies are falling triggered by interest rates, Bloomberg Línea explains what is true and what is unclear about how it affects El Salvador\n\nBukele managed to spark a bond rally in July when he announced the buyback even as Bitcoin plunged. The remainder of the notes maturing in 2025 have surged to 74 cents on the dollar after trading as low as 28 cents, according to data compiled by Bloomberg.\n\n“We love his willingness to pay back,” said Christine Reed, Latin America regional specialist at asset management firm Ninety One in New York.\n\nThere are plenty of potential pitfalls ahead. Reed says El Salvador is unlikely to be able to generate enough reserves to carry out more buy backs in the future, while Kaune calls it a risky investment, troubled by a high debt load and questions over its fiscal outlook.\n\nPUBLICIDAD\n\nAnother source of concern is Bukele’s hard-line approach to crime. Organizations including Human Rights Watch and the Inter-American Commission for Human Rights have criticized his policies as authoritarian and dehumanizing. He has also tangled with the US, which has sanctioned some former government officials and condemned a decision to remove the attorney general and five top judges.\n\nVIEW + El Salvador’s Bukele to Seek Reelection in 2024 Despite Second-Term Prohibition The country’s Constitution prohibits a second term, but the current president could stand in 2024 by taking advantage of a loophole in the law and resigning six months before the elections\n\nThe government did not immediately respond to a request seeking comment. On Twitter, Bukele has taken note of how he defied widespread expectations that El Salvador wouldn’t pay the bonds, saying international news outlets had written hundreds of articles predicting the nation would default in January.\n\nFor now, investors have largely shrugged off concerns about Bukele’s policies — his hard-handed approach to crime has actually helped the economic outlook. Gross domestic product grew at a robust pace in 2022 due to the “unprecedented reduction in crime, and strong remittances and tourism revenues,” according to a statement by the IMF after an official staff visit Feb. 8.\n\nPUBLICIDAD\n\nThe fiscal deficit is narrowing as well, closing last year at 4.6% of GDP, down from from 5.6% in 2021, according to Fitch Ratings data.\n\n“You can see that they’ve already tightened the belt with the fiscal spending,” said Oren Barack, managing director of fixed income at New York-based AGP Alliance Global Partners. “It was never about willingness to pay it was about ability to pay. Now the two have converged.”\n\nVIEW + El Salvador’s Bukele Has Mixed Track Record Midway Through His Mandate Three years into a presidency marked by the Covid-19 pandemic, Nayib Bukele has brought change to the Central American country, but also faces many challenges\n\nRead more at Bloomberg.com"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWV5ZXMtMjNrLWRlc3BpdGUtdXMtZG9sbGFyLXN0cmVuZ3RoLWhpdHRpbmctNi13ZWVrLWhpZ2jSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price eyes $23K despite US dollar strength hitting 6-week high - Cointelegraph",
        "content": "Bitcoin (BTC) hit its highest in almost a week on Feb. 15 as “extremely positive” economic data boosted risk asset sentiment.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBTC’s price aims for $23,000\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD gaining 2.2% on the day to eye a reclaim of $23,000.\n\nAnalysts were already predicting volatility, with the latest economic numbers from the United States delivering a pleasant surprise.\n\nRetail sales and the Empire State Manufacturing Index both surpassed market expectations, showing a more resilient economy despite restrictive policy at the Federal Reserve.\n\n“Extremely positive numbers. Core Retail Sales and Retail Sales both smash expectations, while also Manufacturing Index more positive than expected,” Cointelegraph contributor Michaël van de Poppe, founder and CEO of trading firm Eight, reacted.\n\n“The relief rally will continue, as it seems.”\n\nThe figures followed the Consumer Price Index (CPI) print for January, which came practically in line with expectations and provided only limited volatility as a result.\n\nBitcoin made a much bigger statement on the day, however, causing some to rethink their short-term perspective on the market.\n\n“I was cleary wrong today with my expectations on lower TF, expecting some correction first. As mentioned: a reclaim of $22,3k is bullish to me and opens the road to 25k imo,” popular trader Crypto Ed acknowledged in part of Twitter comments.\n\nFellow trader Skew, meanwhile, eyed $22,500 as an important zone for bulls to reclaim next.\n\n“$22.5K was strong support & price consolidated above for 19days; reclaiming this level would be pretty bullish for BTC,” an update on the four-hour chart read.\n\n“Else failure will result in price testing the breakout consolidation.”\n\nBTC/USD annotated chart. Source: Skew/Twitter\n\nDXY surge may see “tighter financial conditions”\n\nU.S. equities were biding their time at the time of writing, meanwhile, with the S&P 500 still down 0.5% on the day.\n\nRelated: First weekly death cross ever — 5 things to know in Bitcoin this week\n\nThe Nasdaq Composite Index gained a modest 0.7%, while the much-watched U.S. Dollar Index (DXY) crossed the 104 mark for the first time since Jan. 6 in a warning to risk assets.\n\nU.S. Dollar Index (DXY) 1-day candle chart. Source: TradingView\n\n“I’d still be cautious around here. Keeping open mind of things...both btc and eth below jan high still. ...dxy pushing up. wouldn’t get too optimistic just yet,” TraderSZ thus argued about the outlook for major crypto assets.\n\nInvestor Michael J. Kramer, meanwhile, predicted a trip to 106 for DXY, along with “tighter financial conditions” in what could end up a recipe for defeat for the crypto rebound.\n\n$dxy trying to break out, next stop could be 106 and tighter financial conditions along with it. pic.twitter.com/pQNRzbhsW4 — Michael J. Kramer (@MichaelMOTTCM) February 15, 2023\n\n“For all the grave stomping on the dollar, the DXY is trading above the 2022 daily close. Interesting...,” Caleb Franzen, senior market analyst at Cubic Analytics, added.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xMjE0NDMvYml0Y29pbi1wcmljZS1vdmVyLTI0MDAwLW9yZGluYWxzLW5mdC1pbnNjcmlwdGlvbnPSAVJodHRwczovL2RlY3J5cHQuY28vMTIxNDQzL2JpdGNvaW4tcHJpY2Utb3Zlci0yNDAwMC1vcmRpbmFscy1uZnQtaW5zY3JpcHRpb25zP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Crosses $24K as Ordinals Takes the Network by Storm - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEven as U.S. regulators step up their actions against cryptocurrency exchanges and their staking programs, the price of Bitcoin brushed near $24,300 on Wednesday, the highest point since August 2022, gaining 8.2% in the last 24 hours, according to data from CoinGecko.\n\nThe pump, which comes close to breaking an eight-month record, arrives as users and major brands flock to the OG blockchain to inscribe content on the network using Ordinals inscriptions.\n\nThe number of Ordinal inscriptions crossed 100,000 late Tuesday night, and unlike Bitcoin sidechains like Stacks or Counterparty, Ordinals are inscribed directly onto the blockchain. Inscriptions were made possible by the SegWit and Taproot upgrades to the Bitcoin network, as they are stored in the transaction witness of a Bitcoin block.\n\nAD\n\nAD\n\nProjects moving to Ordinals include the popular Solana NFT collection DeGods, which put 535 DeGods NFTs on the Bitcoin blockchain. On Wednesday, Xverse, a Bitcoin-based web wallet, added support for Ordinals.\n\nAlso, it doesn’t hurt that Keanu Reeves like crypto.\n\nBut while Ordinals is having its moment in the sun, some point to recent movements by the SEC against stablecoins and staking, speculating that investors are converting their altcoins into Bitcoin, which SEC chair Gary Gensler said in the past was not a security.\n\nYes, I did yesterday and swapped most to btc. With SEC on a mission to destroy stables and regulations on the horizon, BTC should be the only sensible choice. — OG Superposition (@cryptoMaxistNft) February 15, 2023\n\nLast week, the Securities and Exchange Commission charged cryptocurrency exchange Kraken with a $30 million fine for failing to \"properly\" register its staking program.\n\nAD\n\nAD\n\nOn Monday, fellow U.S.-based cryptocurrency exchange, Coinbase, said it would defend its staking services against the SEC.\n\n“Coinbase’s staking services are not securities,” tweeted Coinbase co-founder and CEO Brian Armstrong, “We will happily defend this in court if needed.”\n\nCoinbase's staking services are not securities. We will happily defend this in court if needed.https://t.co/GtTOz77YV3 — Brian Armstrong (@brian_armstrong) February 12, 2023"
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL210LWdveHMtbGVhZGluZy1jcmVkaXRvcnMtb3B0LWZvci1iaXRjb2luLXBheW1lbnQtdGhhdC1ndWFyYW50ZWVzLTkwLW9mLWZ1bmRzLW93ZWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Mt. Gox's leading creditors opt for Bitcoin payment that guarantees 90% of funds owed - CryptoSlate",
        "content": "The two largest creditors of Mt. Gox, the now-defunct cryptocurrency exchange that got hacked in 2014 — leading to the loss of 850,000 BTC — have chosen an early lump sum payment option that will not require a selloff of their Bitcoin holdings.\n\nThe payment is scheduled for September 2023, CoinDesk reported Feb. 16.\n\nWhile the option to wait for all Mt. Gox litigation to settle may offer higher payouts, it could take another 5-9 years, as per sources. Opting for the early payout will allow the creditors to receive their payments sooner and avoid any potential market impact that could result from a large-scale Bitcoin sell-off.\n\nAccording to sources, the two largest creditors of Mt. Gox, the cryptocurrency exchange that collapsed due to a hack nearly a decade ago, have chosen to receive their bankruptcy recovery in mostly bitcoin (BTC).\n\nThese creditors, Bitcoinica, a now-defunct New Zealand-based crypto exchange, and MtGox Investment Funds (MGIF), which collectively account for about one-fifth of all Mt. Gox claims, will receive 90% of their recoverable funds, which are estimated to be around 21% of their original holdings on the platform at the time of the hack.\n\nIn 2014, hackers stole 850,000 BTC, valued at $460 million at the time. Following the hack, Mt. Gox was left with roughly 142,000 BTC, 143,000 bitcoin cash (BCH), and 69 billion Japanese yen.\n\nAccording to CoinDesk sources, creditors who choose the lump sum option can elect to receive their payment in a mix of BTC, BCH, and yen, or they can ask for the entire amount to be given in fiat. By selecting the early payment, Bitcoinica and MGIF have also decided to receive the crypto option, which means that the majority of their payout will be in BTC.\n\nIf creditors decline the early lump sum payout, their only other recourse is to wait for the conclusion of civil rehabilitation litigation, which includes a lawsuit by CoinLab against Mt. Gox’s estate. While this option may yield a slightly higher recovery, creditors have no guarantee that it won’t be potentially lower than the 90% of recoverable holdings guaranteed by the lump sum payout.\n\nAdditionally, a legal analysis by a Japanese law firm indicated that holdouts could wait many years for their money to be returned.\n\nCreditors must decide by March 10, 2023, whether to accept the offered early lump sum or continue to wait for a potentially larger payout at an unspecified time in the future.\n\nWith the expected reimbursement now likely only months away, analysts worry that a major sell-off of Bitcoin could follow."
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vbmV3cy5ibG9vbWJlcmdsYXcuY29tL2xpdGlnYXRpb24vYml0Y29pbi1zZW50LXRvLWFsbGVnZWQtcG9uemktc2NoZW1lLXdlcmUtY29tbW9kaXRpZXMtc3VpdC1zYXlz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Sent to Alleged Ponzi Scheme Were Commodities, Suit Says - Bloomberg Law",
        "content": "Vista Network Technologies was allegedly behind a Ponzi scheme that took in Bitcoin and Ether cryptocurrency, a government agency says in a new suit that views the tokens as commodities.\n\nWho regulates digital assets is currently an urgent topic. The Securities and Exchange Commission has asserted violations of securities laws in suits involving crypto issuers, including Ripple Labs Inc., and crypto scams.\n\nHere, it’s the Commodity Futures Trading Commission that filed suit Wednesday, asserting that Vista Network and its founder, Armen Temurian, violated the Commodity Exchange Act. The CFTC filed its complaint in the US District Court for ..."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3NvbWVvbmUtdXBsb2FkZWQtYS1mYXJ0LXRvLWJpdGNvaW4tb3JkaW5hbC1uZXR3b3JrLWFuZC1hcHBhcmVudGx5LXNvbGQtaXQtZm9yLTI4MGsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Someone uploaded a fart as a Bitcoin Ordinal NFT and sold it for $280k - CryptoSlate",
        "content": "A new Ordinal minted on the Bitcoin blockchain network, inscription 2042, consists of a one-second audio clip capturing the sound of a wet fart.\n\nWhat are Bitcoin Ordinals?\n\nLaunched in January by software engineer Casey Rodarmor, Ordinals are essentially a protocol that allows for data to be stored on Bitcoin’s blockchain network. Think NFTs but for Bitcoin.\n\nThey’re so new you can’t even buy them via a marketplace like OpenSea. They require special Bitcoin Ordinal wallets to store and trade, but this has not stopped people from uploading strange and uncanny files to the Bitcoin network.\n\nSo far, there have been over 100,000 inscriptions via the Ordinals protocol, everything from encrypted files to digital art.\n\nInscription 2042\n\nOn Feb. 2, inscription 2042 was uploaded onto the Bitcoin blockchain, a 1-second audio file that captured the sound of someone passing gas.\n\nAccording to one Reddit user posting in r/CryptoCurrency, inscription 2042 sold for 12.3 Bitcoin, the equivalent of $280,000.\n\nIt’s impossible to verify whether the fart actually sold because there is no centralized (or even decentralized) marketplace for Bitcoin Ordinals, with most being sold via OTCs in random discord channels, usually among Bitcoin node operators themselves.\n\nUPDATE Feb. 19: Revised ‘Ordinal network’ to ‘Ordinals procotol’ for clarity."
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmZvb2wuY29tL3RoZS1hc2NlbnQvY3JlZGl0LWNhcmRzL3VwZ3JhZGUtYml0Y29pbi1yZXdhcmRzLWNhcmQtcmV2aWV3L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Upgrade Bitcoin Rewards Card Review - The Motley Fool",
        "content": "Top perks\n\nThe Upgrade Bitcoin Rewards Card provides an interesting mix of benefits.\n\nBitcoin rewards\n\nThe main appeal of the Upgrade Bitcoin Rewards Card is right there in the name. It earns Bitcoin on your payments toward purchases you've made.\n\nBitcoin's price has skyrocketed many times over the years, so there's the possibility that your rewards will increase in value. It's worth mentioning the opposite is also true. Since Bitcoin is so volatile, your rewards could very well decrease in value.\n\nAll things considered, Bitcoin rewards are a great way to ease into the world of cryptocurrency. You can build a Bitcoin balance without needing to invest your own money.\n\nCOMPARE TOP PICKS: Best Crypto Credit Cards\n\nUnlimited 1.5% back\n\nThis card earns 1.5% back in Bitcoin when you make payments on your purchases. This is different from most rewards credit cards, which earn rewards when you make purchases. With an Upgrade card, you need to pay for a purchase first before earning rewards on it.\n\nUpgrade takes the cash value of your rewards and uses that to buy Bitcoin. For example, if you pay off a $100 purchase, it buys $1.50 worth of Bitcoin.\n\nThe Bitcoin purchase doesn't happen right away. After you make a payment, Upgrade will purchase the Bitcoin within one to two statement periods.\n\nNo card fees\n\nThere are no card fees to use the Upgrade Bitcoin Rewards Card. That means:\n\nNo annual fee\n\nNo draw fee, including for purchases and direct deposits to a bank account\n\nNo foreign transaction fee\n\nNo prepayment penalty\n\nThere is a 1.5% transaction fee when you sell your Bitcoin rewards. Since that's the only way to use your rewards, this fee is unavoidable.\n\nREAD MORE: Best No Annual Fee Credit Cards\n\nFixed APR\n\nThis Bitcoin rewards card has a fixed APR (annual percentage rate). Credit cards normally have a variable APR that can change with interest rate trends. With Upgrade, your card's interest rate stays the same. Another nice thing about Upgrade is that it typically offers lower interest rates than credit card issuers.\n\nLEARN MORE: What Is APR?\n\nLenient approval requirements\n\nThe Upgrade Bitcoin Rewards Card is intended for consumers with average to excellent credit. There aren't many rewards card options for fair/average credit, so if your score is in that range, this Upgrade card is a great choice.\n\nSend money to your bank account\n\nOne of the advantages the Upgrade Bitcoin Rewards Card has over credit cards is that you can use it for cash, not just purchases. If you're ever in need of a loan, you won't need to apply with a lender. You can get a direct deposit to your bank account from your Upgrade card for no additional fees.\n\nIt's not so easy or cheap to get cash from a credit card. Although many credit cards allow you to get cash as a cash advance, it carries an additional fee, and the credit card issuer normally charges a higher interest rate.\n\nLEARN MORE: How Does a Credit Card Cash Advance Work?\n\nFixed payments\n\nAt the end of the billing cycle, Upgrade takes your card's balance and gives you a fixed monthly payment. By paying at least this amount, you'll have the balance paid off by the end of your draw length.\n\nThis is much different than credit cards, where you can make small minimum payments and your balance doesn't have a set end date. Some people prefer the structure that fixed payments provide. If you're one of them, then you'll probably like the Upgrade Bitcoin Rewards Card."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXQtdGVuZG8tcHJvdG90eXBlLW9mZmVycy1iaXRjb2luLXJldHJvLWdhbWVzLWZvci1iYXJzLWNvbmZlcmVuY2Vz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "'Bit-tendo' prototype offers Bitcoin retro games for bars, conferences - Cointelegraph",
        "content": "Play-to-earn retro games with Bitcoin (BTC) payouts may soon be making their way to a bar, conference or meetup near you, according to a Feb. 12 tweet by Zebedee founder Christian Moss. The software is tentatively called “Bit-tendo.”\n\nBitcoin Pay to Play & Play to Earn in Super Mario 3 on the original NES! #bitcoin #retrogames #lightningnetwork powered by @zebedeeio and @lnbits\n\n\n\n200 retweets and i'll integrate SONIC\n\n\n\n\"Bit-tendo\" will be a free retro game bitcoin infuser for bars, conferences, meet ups etc pic.twitter.com/4GBuXX9pN2 — Christian Moss (@MandelDuck) February 12, 2023\n\nThe tweet includes a video of someone playing Super Mario Bros. 3 on a small old-school tube television. The TV displays a QR code at startup and asks for a Bitcoin payment. The game only starts running once the payment is sent.\n\nDuring gameplay, a “sats” counter is displayed that apparently counts the number of satoshis the player has won as a reward so far. Satoshis, or sats, are Bitcoin’s smallest divisible unit, representing 0.00000001 BTC each. The display also shows a timer that counts down from 90 seconds to zero. When the timer goes to zero, the game ends, and a new QR code is displayed. A statement at the bottom and top of the image implies that the player can use the QR code to withdraw their sats.\n\nIn the post, Moss said that the software will eventually “be a free retro game bitcoin infuser for bars, conferences, meet ups etc.”\n\nCointelegraph reached out to Moss for an explanation of how the software works. He said that it runs on a PC or other device that is able to accept a video feed. The game itself is produced by a real Nintendo Entertainment System (NES) console, but the video is altered en route to show the sats counter and timer. The software tracks movements in the video feed to determine if the player has collected a coin and updates the sats counter each time a coin is collected.\n\nMoss said that in order to fund the payout wallet, the bar or club needs to sign up for a custodial wallet with Zebedee or LNbits. The wallet is connected to the Lightning Network in order to enable low transaction fees and fast payments.\n\nRelated: Nigerian innovator launches first active Bitcoin Lightning node in the country\n\nThe Zebedee app is available on the Google Play Store and Apple’s App Store. Screenshots reveal that it has a “top up” (deposit) and “cash out” (withdrawal) function that can be accessed after the user completes a Know Your Customer verification process.\n\nMoss also explained how he came up with the idea for “Bit-tendo.” He said that he tried to get people interested in Bitcoin play-to-earn games at Bitcoin conferences but found that participants preferred to play games they already knew rather than “in-house” designed games. Moss said he hopes to make the software work with any game, not just Super Mario Bros. 3:\n\n“I want to also let the user be able to train the software to recognize events in any game they may have, ultimately making it game-agnostic.”\n\nIn his tweet showing off the software, Moss states that he would integrate Sonic The Hedgehog 2 with it if the post got 200 retweets, which it has since received.\n\nMoss has been an innovator in the blockchain gaming space since its inception. In 2014, he created Sarutobi, a game that allowed players to collect Bitcoin by controlling a monkey that swung across a jungle landscape. Because it predated the release of EverdreamSoft’s Spells of Genesis beta by approximately one year, Moss’ Sarutobi is considered by some to have been the first blockchain game."
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3LmJhbmtsZXNzdGltZXMuY29tL2hvdy1tYW55LWJpdGNvaW5zLWRvZXMtc2F0b3NoaS1uYWthbW90by1oYXZlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "How Many Bitcoins Does Satoshi Nakamoto Have? - Bankless Times",
        "content": "Satoshi Nakamoto is the creator and the biggest name in Bitcoin, but do we know just how many Bitcoins does Satoshi Nakamoto have, and what are they actually worth?\n\nFirst, it’s worth noting this question is difficult to answer, as we still don’t know for certain whether Satoshi is a single person, a group of individuals, or an entity. Satoshi Nakamoto is simply a pseudonym used to refer to the people, or person who helped develop the software for Bitcoin.\n\nCurrently, Nakamoto is considered to have the most Bitcoins of any cryptocurrency holder. Read on to learn all about the Satoshi Nakamoto Bitcoin wallet.\n\nHow Many Bitcoins Does Satoshi Nakamoto Have?\n\nSatoshi Nakamoto is believed to have approximately 1.1 million Bitcoin. However, it’s worth noting this number is only an estimate. It’s difficult to track the Bitcoin owned by Satoshi, because the public wallet addresses belonging to the entity haven’t been fully identified.\n\nThe 1.1 million Satoshi Nakamoto Bitcoin wallet value comes from a pattern identified in the first two years of the Bitcoin mining trend. The pattern was detected by a chain analyst named Sergio Demian Lerner, the Chief Scientist for RSK Labs, and is best-known as the Patoshi pattern.\n\nIn 2013, Lerner released a study which indicates the vast majority of the initial BTC released was mined by a single individual. According to Lerner’s estimates, a single miner may have processed around 22,000 blocks in the first year of Bitcoin, and may have gathered 1.8 million Bitcoin in total, 1.1 million of which has not been spent.\n\n(Bitslog)\n\nThe Bitcoins Owned by Satoshi Nakamoto\n\nExperts believe the sheer volume of Satoshi Nakamoto Bitcoin holdings attributed to the entity today are a result of a low hash rate for the cryptocurrency during 2009. Much of the mining which took place in the early days of Bitcoin was likely to be done by Satoshi himself, as many people still weren’t aware of the currency, or how to correctly mine it.\n\nSatoshi Nakamoto is widely considered to hold the most Bitcoin in the world.\n\nWith more than 1 million Bitcoins attributed to Satoshi Nakamoto today, the entity is considered the largest holder of BTC in the world. Although the number might not seem particularly large at first glance, the Satoshi Nakamoto wallets holding over 1 million Bitcoin account for around 5% of the total number of Bitcoins which can ever be generated.\n\nOnly 21 million Bitcoins can ever be created and mined, meaning Satoshi retains a massive stake in the overall Bitcoin cryptocurrency.\n\n(Coin Telegraph)\n\nThere’s no evidence Satoshi Nakamoto sold Bitcoin.\n\nThough people claiming to be Satoshi Nakamoto have announced they plan on selling some of their BTC to the public, there’s no evidence that this has taken place as of yet. Despite sitting on billions of dollars’ worth of Bitcoin, the Satoshi Nakamoto wallet value hasn’t dropped in recent years.\n\nInterestingly, however, a Satoshi-era wallet did become active and move during 2022, holding around 500 BTC. However, there’s no evidence this wallet actually belongs to the Bitcoin creator.\n\n(Pyments)\n\nSatoshi Nakamoto is the most productive Bitcoin miner in the world.\n\nAn analysis by Whale Alert, one of the biggest blockchain tracking and analytics companies in the world, found Satoshi may have been one of the most prolific Bitcoin miners of all time. According to the report, a single address (believed to belong to Satoshi) may have mined up to 1,125,150 tokens up to block 54,316 in the Bitcoin blockchain.\n\n(Whale Alert)\n\nWhat Is Satoshi Nakamoto’s Net Worth?\n\nThough we have very little information about any official Satoshi Nakamoto Bitcoin wallet, we can make assumptions about the entity’s net worth, based on the studies into the market.\n\nSatoshi Nakamoto may be worth around $42 billion.\n\nCurrently, estimates suggest the net worth of Satoshi Nakamoto may be around $42 billion. This is based on an analysis of the early Bitcoin wallets which are believed to belong to the person or group. These wallets currently hold around 980,000 bitcoins, although it’s believed Satoshi Nakamoto owns more than 1 million BTC in total.\n\nBased on the current value of Bitcoin, the value of around 980,000 BTC would equate to around $43 billion in today’s market.\n\n(Bitslog)\n\nSatoshi Nakamoto is the 15th wealthiest person in the world.\n\nAs of 2021, Satoshi Nakamoto was also identified as the fifteenth wealthiest person in the world, according to an analysis by the Independent. At the time, the publication valued Satoshi Nakamoto’s net worth as being somewhere around $73 billion.\n\n(Independent)\n\nConclusion\n\nUltimately, any estimates we have of a Satoshi Nakamoto net worth or wallet value are based on speculation and cryptocurrency analysis. We can’t know for certain how much this entity is truly worth without getting a clear view of which Bitcoin wallets they hold.\n\nHowever, most experts agree Satoshi Nakamoto is still the largest Bitcoin whale in the industry.\n\nSources:"
    },
    {
        "id": 83,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LmdpemNoaW5hLmNvbS8yMDIzLzAyLzE1L2JpdGNvaW4tcmF0ZS10by1yZWFjaC01MDAwMDAtcm9iZXJ0LWtpeW9zYWtpLWFzc3VyZXMv0gFdaHR0cHM6Ly93d3cuZ2l6Y2hpbmEuY29tLzIwMjMvMDIvMTUvYml0Y29pbi1yYXRlLXRvLXJlYWNoLTUwMDAwMC1yb2JlcnQta2l5b3Nha2ktYXNzdXJlcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Rate To Reach $500,000, Robert Kiyosaki Assures - Gizchina.com",
        "content": "Do you still doubt whether to buy cryptocurrencies or not? Do you like what Robert Kiyosaki writes? If your answer to both questions is positive, then you should hurry to buy a cryptocurrency, say, Bitcoin. The Bitcoin rate should be much higher than what it is now.\n\nBitcoin Rate Will Grow A Lot\n\nKiyosaki thinks that “faith in US dollar, fake money, will be destroyed.” He also called gold and silver “the money of the gods” and the first cryptocurrency “a dollar for the people.”\n\nAs a reminder, in November 2022, when Bitcoin’s rate was low, Kiyosaki reaffirmed his commitment to it. In other words, this author believes that Bitcoin will become one of the main currencies in the future.\n\nMoreover, Bitcoin analyst Willy Wu predicts that the number of owners of the flagship cryptocurrency will increase over the next three years. He says that by 2026, more than one billion people will own Bitcoins. As a reference, now, there are more than 300 million people who own the digital gold around the world.\n\nAlso Read: To Compensate For Bitcoin Mining Damage, We Need To Plant 431.6 Million New Trees\n\nWilly Wu reminded his followers on Twitter that it took Bitcoin six months to build an audience from its first 1,000 users. It took another five years for this number to grow to 1 million. It took 13 years and 8 months after the formation of the genesis block to reach the current indicators.\n\nGizchina News of the week Join GizChina on Telegram\n\nWhen comparing with other tech bigwigs, the audience of PayPal is 430 million people, and Twitter’s is 400 million. The crypto expert also believes that the lion’s share of social network users are bots.\n\nThe CEO of the blockchain tech firm Blockstream, Adam Back, said that since 2013, the Bitcoin rate has doubled. So if this trend continues, in about nine years, the price of Bitcoin will reach $10 million by 2032. If so, its market capitalization will reach $200 trillion.\n\nBy the way, ChatGPT has predicted the Bitcoin rate to reach $50,000 in the next six months.\n\nBitcoin shows a minimal 2% increase compared to a day before. The asset is trading at $22,152 with a market capitalization of $427.3 billion.\n\nDisclaimer: We may be compensated by some of the companies whose products we talk about, but our articles and reviews are always our honest opinions. For more details, you can check out our editorial guidelines and learn about how we use affiliate links."
    },
    {
        "id": 84,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGVjcnlwdC5jby8xMjE0MzAvb3JkaW5hbHMtc3VwcG9ydC1iaXRjb2luLXdlYi13YWxsZXQteHZlcnNl0gFKaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMTQzMC9vcmRpbmFscy1zdXBwb3J0LWJpdGNvaW4td2ViLXdhbGxldC14dmVyc2U_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Ordinals Support Comes to Bitcoin-Based Web Wallet Xverse - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nXverse, billed as a “Bitcoin wallet for Web3,” just rolled out support for Ordinals, the newly popularized protocol allowing users to inscribe NFTs onto the Bitcoin blockchain.\n\n\n\n“Today, we’ve launched first class support for Ordinals,” tweeted the wallet team on Wednesday. The company explained that inscribing NFTs through its software involves “no need to run a node, complex software, or anything else,” merely some Bitcoin to pay a transaction fee, which can be bought directly through the app.\n\nInscriptions are made via Gamma.io, a Bitcoin NFT marketplace that rolled out “no-code ordinal inscriptions” last week. According to Xverse, roughly 5% of Bitcoin inscriptions so far have been made using Gamma’s tool.\n\nAD\n\nAD\n\nAfter uploading an image and sending a transaction to their provided Ordinals address, users can find their inscriptions inside their Xverse NFT collection within 20 to 30 minutes—and embedded in the blockchain forever.\n\nThis comes just a day after Hiro, another Bitcoin focused Web3 wallet, rolled out inscriptions to its testnet on Tuesday. Both wallets interact with Stacks, a “layer 1.5” blockchain with its own NFT economy that settles its transactions on Bitcoin.\n\nXverse, too, lets Bitcoin users interact with Stacks, with plans to introduce instant payments via the lightning network.\n\nBitcoin recently logged its 100,000th Ordinals transaction, continuing a trend of exponential growth. Given that NFTs on Bitcoin were not a feature envisioned by its original developers, their existence has naturally sparked controversy, with many people unsure of whether they will hurt or help the network.\n\nStacks co-creator Muneeb Ali said he welcomes the new protocol, stating that it marks a “new chapter in Bitcoin history” on Tuesday. The following day, he said that Xverse’s Bitcoin wallet now has the “easiest on-ramp to ordinals.”\n\nAD\n\nAD\n\nKen Liao, the founder and CEO of Xverse wallet (aka Secret Key Labs), said that the ability to send out one’s ordinal from the wallet will be available soon. Liao was formerly an engineering parter at Stacks.\n\nIts out! The easiest way to inscribe Bitcoin Ordinals and store in your self-custody BTC wallet with a beautiful gallery for all your NFTs. https://t.co/xgEcEJXlX8 — kenliao.btc (@YukanL) February 15, 2023\n\nAccording to Liao, the rise of Ordinals is helping bring builders back into Bitcoin's ecosystem, and showing that the network is capable of more than allowing people to \"just hold Bitcoin.\"\n\n\"You've always been able to put data on the Bitcoin chain, but in a very limited way,\" said Liao, in comments shared with Decrypt via email. \"Ordinals made it easier and created a cultural movement essentially for people to do this.\""
    },
    {
        "id": 85,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZGVjcnlwdC5jby8xMjE0NTIveW91LWFyZS10aGUtYXJ0LWNoYWluc3BhY2UtbmZ0LXBvcnRhbHMtY29ubmVjdC1iaXRjb2luLWFuZC1ldGhlcmV1bdIBY2h0dHBzOi8vZGVjcnlwdC5jby8xMjE0NTIveW91LWFyZS10aGUtYXJ0LWNoYWluc3BhY2UtbmZ0LXBvcnRhbHMtY29ubmVjdC1iaXRjb2luLWFuZC1ldGhlcmV1bT9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "‘You Are the Art’: Chainspace NFT Portals Connect Bitcoin and Ethereum - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe sudden and explosive rise of Bitcoin NFTs via the new Ordinals project has sparked plenty of creativity from Web3 builders. Chainspace is one of the most vibrant examples to date—an experimental art project that connects Bitcoin and Ethereum through a lo-fi video rendering app that’s tied to both chains.\n\nThe project spans 800 total on-chain apps, each a unique portal that pseudonymous co-creators Timshel and el-ranye describe as a “digital object that emits infinite art.” Put simply, each web app—which lives entirely in an Ordinals inscription on the Bitcoin blockchain—is like a Snapchat filter that manipulates the image coming from your computer or device camera.\n\nEssentially, it takes your detailed selfie cam footage and renders it like old-school ASCII art, using letters and symbols to depict your real-time video view in a more abstract, stylized manner. Each Chainspace portal gives a different effect, and some are inspired by the look and vibe of notable Web3 projects like Loot and Terraforms.\n\nAD\n\nAD\n\na @el__ranye x @TimshelXYZ experimental art project └⫸ https://t.co/tpkbsRaFdf 𝚊 𝚙𝚘𝚛𝚝𝚊𝚕 𝚒𝚗𝚝𝚘 𝚌𝚑𝚊𝚒𝚗𝚜𝚙𝚊𝚌𝚎 inscribed onchain on BTC on a single satoshi will be minting via @ourzora mega thanks to @isiain who worked w/ me on a cross-chain BTC<>ETH renderer https://t.co/B7bvLw0fFD pic.twitter.com/DAjMKdRai0 — Timshel {𝚝𝚑𝚘𝚞 𝚖𝚊𝚢𝚎𝚜𝚝} (@TimshelXYZ) February 9, 2023\n\nTimshel, who’s a key figure in the emerging “Lootverse” gaming community and involved in on-chain publishing efforts, told Decrypt that Chainspace provides a way for Web3 users to share a bit of their humanity with communities without fully doxxing themselves. Timshel showcased Chainspace-derived screenshots that users shared in the project’s Discord.\n\n“This is beautiful because this ‘GM’ is much more essential and resonant and human than [a] random Pepe emoji,” Timshel told Decrypt. “There's something really cool and special to see how people are using this, sharing their feelings, their selves, and their faces.”\n\nThe NFT or inscription is not an “access pass” to an experience hosted elsewhere. Because Ordinals can hold a lot more on-chain data than an Ethereum NFT, the complete web app is inscribed onto the Bitcoin blockchain as a digital artifact. Each Chainspace portal exists as its own unique Ordinals inscription that can be transferred between owners.\n\n“The Ordinals innovation, and the idea of inscribing up to now 4MB of content onto a single Satoshi on Bitcoin—it just immediately clicked to me,” Timshel told Decrypt. “It opened up a whole blossom of ideas in my head about things you can do that are higher fidelity than what's possible on ETH, but still create a token on ETH that's tradable and ownable.”\n\nAD\n\nAD\n\nAcross chains\n\nHis comment hints at the Ethereum component of the Chainspace equation, but there are layers to it. Thursday’s NFT mint will actually take place on Ethereum, with each portal represented by an Ethereum NFT that can be minted through Zora and traded through major marketplaces.\n\nThe Ethereum NFT is connected to the Bitcoin-based Ordinal on-chain through a smart contract—which holds the code that powers decentralized apps (dapps) and NFT projects—developed by Zora software engineer Iain Nash. The Ethereum NFT artwork you see on a marketplace like OpenSea is actually a screenshot generated from the Ordinal inscription.\n\nBut they’re also paired in the sense that the NFT buyers can choose to trade in the Ethereum version and take custody of the Bitcoin Ordinal instead. Right now, that requires a manual process that Timshel and el-ranye can handle, but they aim to make it an easier, automated process as more and more Ordinals infrastructure comes online.\n\nAs such, Timshel describes Chainspace as being “200% on-chains”—yes, plural—since there’s a part of the experience on both Bitcoin and Ethereum, and they’re intertwined.\n\nBut the swap of the Ethereum NFT for custody of the Bitcoin Ordinal is a one-way process; they won’t let users swap back and forth or hold both versions at the same time. He also cautioned that the ability to swap is dependent in part on the status of Ordinals, a fast-evolving space that has proven contentious to some Bitcoin aficionados. It’s all an experiment for now.\n\nChainspace portals are publicly accessible, again reinforcing the idea that NFT owners are not buying an exclusive access pass. Anyone can use one of the portals and capture a still image from the manipulated video feed, and then they can do whatever they want with those—share them through social media, mint them on-chain, generate derivative art, etc.\n\nThey’ll put 620 of the NFTs on sale on Thursday, with an allowlist of active Discord users—people who have already shared their Chainspace screenshots and creations—able to mint one of the Ethereum NFTs for 0.33 ETH (about $550). Another 100 NFTs will be airdropped to Web3 builders who helped or influenced the project, with 60 NFTs reserved for the team.\n\nAnother 20 Chainspace apps, called X-portals, will have no Ethereum NFT counterpart and will live exclusively on Bitcoin. Those will be reserved for future auctions, as well as for the community around Ethereum NFT art project, Terraforms.\n\nAD\n\nAD\n\n‘Smashed penny’\n\nGiven that they’re publicly accessible, why would someone want to buy and own a Chainspace portal that isn’t exclusively available to them? It doesn’t come with any future promised utility or benefits, for example. A handful of the portals are available to play with via the project’s website, while others can be accessed via each Ordinal’s own page.\n\nTimshel cited the growing buzz around Ordinals and early on-chain inscriptions, and bets that people excited about on-chain media and Web3 experiments will want to own a portal. He likened it to public art installations that are open to all but ultimately still owned by someone, and compared an inscribed Satoshi to a souvenir flattened penny from an amusement park.\n\nI'm having so much fun generating these Chainspace templates aka high-functionality digital objects that bridge you into a higher plane. Experimental/performance art by @TimshelXYZ and @richa891 - in Chainspace, you are the art!👩‍🎨🖼️ pic.twitter.com/9c7AOtje3c — ozorian89 (@richa891) February 11, 2023\n\n“I think people are really excited about owning the actual Satoshi itself,” he said. “They want the ‘smashed penny’ with art on it in their wallet.”\n\nAlready, they’re seeing people turn Chainspace still images into derivative projects, such as Ethereum NFTs of screenshots of hand gestures or AI-assisted generative interpretations. People are free to do what they want with the portals, even if they don’t own them.\n\nBut ultimately, the goal is to explore new frontiers in experimental on-chain art tools while giving each user a totally unique experience. It loops back to the phrase that the co-creators have been using since the project was unveiled last week: “You are the art.”\n\n“Every portal is public and inscribed on Bitcoin for anybody to render, forever. But every viewing is a private one-of-one,” Timshel explained. “I don't think there ever will be another time where somebody's pixels and Chainspace look exactly like what's on my screen right now. It’d be like finding a grain of sand in the universe.”\n\nAD\n\nAD"
    },
    {
        "id": 86,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vZGFpbHljb2luLmNvbS9lbC1zYWx2YWRvci1vcGVucy1iaXRjb2luLWVtYmFzc3ktaW4tdGV4YXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "El Salvador Opens Bitcoin Embassy in Texas to Boost Adoption - DailyCoin",
        "content": "The partnership news between El Salvador and Texas comes just five days after the International Monetary Fund (IMF) published their annual report on El Salvador’s progress.\n\nSurprisingly, the IMF admitted that adopting Bitcoin (BTC) as a legal tender has accelerated El Salvador’s economic growth, also pointing out that “unprecedented reduction in crime, and strong remittances and tourism revenues have contributed to the robust activity and investment dynamics.”\n\nOn the other hand, the yearly report by the IMF also emphasized that not a lot of local people in the small Latin American country use Bitcoin (BTC), while some have barely heard of it.\n\nThe IMF contemplates that Bitcoin’s use “could grow given its legal tender status and new legislative reforms to encourage the use of crypto assets, including tokenized bonds (Digital Assets Law).” In addition, the report concludes that “efforts are underway to develop citizens’ digital skills by partnering with fintech firms.”\n\nUltimately, the Digital Assets Law has mostly to do with the Volcano bonds – tokenized sovereign bonds, which would enable foreign investors to invest in the Bitcoin Nation. El Salvador’s government expects to raise over $1 billion with the Volcano bonds, which will invest in Bitcoin City’s infrastructure and promote education about the world’s leading decentralized cryptocurrency."
    },
    {
        "id": 87,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zdG9jay1tYXJrZXQtbmV3cy1saXZlLXVwZGF0ZXMtZmVicnVhcnktMTYtMjAyMy0xMjI3NDA4NTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Stock market news today: Stock futures waver, bitcoin rallies - Yahoo Finance",
        "content": "U.S. stocks sold off on Thursday as investors parsed through more hotter-than-expected economic data and hawkish Fedspeak.\n\nThe S&P 500 (^GSPC) sank 1.4%, while the Dow Jones Industrial Average (^DJI) declined by 1.3%. The technology-heavy Nasdaq Composite (^IXIC) plunged by 1.8%.\n\nBitcoin (BTC-USD) rallied, hitting a new six-month high as regulatory crackdowns drove continued uneasiness in the crypto space. The token briefly topped $25,000 for the first time since August.\n\nThe yield on the benchmark 10-year U.S. Treasury note rose to 3.867% Thursday midday. The dollar index inched higher by nearly 0.09% to trade at $104.02. Energy traded lower, with WTI crude oil prices down at $78.03 a barrel.\n\nInvestors digested fresh economic data on Thursday, the headline of which was January’s producer price index (PPI). Headline PPI came in at a monthly increase of 0.7%, hotter than the 0.4% expected by economists.\n\nAlso on the macroeconomic front, the number of Americans filing new unemployment claims slid to 194,000 for the week ended Feb. 11, the Labor Department said on Thursday, lower than the 200,000 expected by economists.\n\nTwo Federal Reserve officials also made headlines Thursday with comments suggesting the central bank could be in for a long battle with inflation.\n\nFederal Reserve Bank of Cleveland President Loretta Mester said she was open to raising interest rates by 0.50%, more than what her peers voted for during the last monetary policy meeting. Meanwhile, Federal Reserve Bank of St. Louis President James Bullard said he favors additional rate hikes amid sticky inflation at the Fed's March meeting. Bullard said he favored bringing up the federal funds rate to 5.375% as soon as possible, up from a current level of 4.50%-4.75%.\n\nStocks had capped off the previous session higher after economic data continued to suggest the economy remains resilient in the face of higher rates and sticky inflation.\n\nRetail sales surged 3% in January, the Commerce Department said on Wednesday, reversing two consecutive monthly declines. Coupled with higher-than-expected reading on consumer prices Tuesday, concerns the Fed could keep raising interest rates have weighed on stocks this week.\n\nStory continues\n\n“Robust job growth and a level-shift up in disposable income in the new year also contributed to the Jan spending spike,” Bank of America Economist Aditya Bhave wrote in a note following the release.\n\nEconomists at JPMorgan raised their Q1 GDP projection to 2% from 1% on the news, noting that the acceleration in retail sales adds to “the goldilocks view of growth without inflation.”\n\nMeanwhile, the Congressional Budget Office warned on Wednesday that the Treasury Department’s ability to continue paying its government bills would be exhausted by the summer unless lawmakers strike a deal to raise the debt ceiling.\n\nBuilders continued to slow down home construction in January as housing starts fell to an annualized rate of 1.309 million homes, the Commerce Department said, down from the 1.356 million estimated. And permits to build slipped 0.1% to an annualized rate of 1.34 million, below consensus expectations of 1.35 million.\n\n\"The future for home construction became a bit bleaker this month as data on inflation, jobs and retail sales foreshadow the Federal Reserve may hike its federal fund rate higher than was expected a month ago,\" Robert Frick, corporate economist at Navy Federal Credit Union, wrote in a statement following the release.\n\nSeparately, Redfin (RDFN), DoorDash (DASH), and Dropbox (DBX) are gearing up to report quarterly results on Thursday after the bell.\n\nIn single stock moves, shares of Paramount (PARA) dropped 4.2% Thursday after the media giant reported an earnings miss on the top and bottom line. Revenue came in at $8.13 billion compared to $8.17 billion expected and subscriber growth also took a hit, reaching 9.9 million for the quarter versus the 10 million forecasted by analysts.\n\nShopify (SHOP) shares sank nearly 16% Thursday after the e-commerce company posted results for the fourth quarter, with revenue coming in at $1.73 billion against estimates for $1.65 billion. Adjusted earnings per share of $0.07 topped estimates for $0.02. The Ottawa-based company expects first-quarter revenue slightly below forecasts.\n\nRoku (ROKU) stock rose Thursday after the company’s net revenue of $867.1 million topped expectations for $804.5 million. Fourth-quarter loss per share of $1.70 came in slightly below the $1.74 expected by analysts.\n\nShares of Cisco (CSCO) climbed more than 5% after the company raised its third-quarter revenue guidance to be between 11% to 13% higher year-over-year, topping analysts' expectations.\n\nTesla (TSLA) shares were down after the National Highway Traffic Safety Administration (NHTSA) announced Tesla would recall 362,758 vehicles, citing safety issues with its Full Self-Driving (FSD) beta software.\n\n—\n\nDani Romero is a reporter for Yahoo Finance. Follow her on Twitter @daniromerotv\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance\n\nDownload the Yahoo Finance app for Apple or Android\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, and YouTube"
    },
    {
        "id": 90,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMi8xNS9iaXRjb2luLWJ0Yy1wcmltZWQtdG8tb3V0cGFjZS1ldGhlcmV1bS1ldGgtcmFwaWRseS1pbi10aGUtY29taW5nLXdlZWtzLXNheXMtdG9wLWNyeXB0by1zdHJhdGVnaXN0L9IBhwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wMi8xNS9iaXRjb2luLWJ0Yy1wcmltZWQtdG8tb3V0cGFjZS1ldGhlcmV1bS1ldGgtcmFwaWRseS1pbi10aGUtY29taW5nLXdlZWtzLXNheXMtdG9wLWNyeXB0by1zdHJhdGVnaXN0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 15 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin (BTC) Primed To Outpace Ethereum (ETH) Rapidly in the Coming Weeks, Says Top Crypto Strategist - The Daily Hodl",
        "content": "A closely followed crypto analyst believes that Bitcoin (BTC) could now be in a position to significantly outperform Ethereum (ETH).\n\nPseudonymous analyst Kaleo tells his 562,700 Twitter followers that the Ethereum/Bitcoin pair (ETH/BTC) is now trading below a diagonal trendline, suggesting that ETH is likely to trail BTC in terms of gains.\n\n“ETH/BTC finally broke beneath the high timeframe support line we’ve been watching.\n\nRemember, this chart only shows relative strength to BTC, so expect to see BTC begin to outpace a bit more rapidly sometime over the next several weeks.”\n\nTraditionally, a bearish ETH/BTC chart indicates that Bitcoin will likely rise in value faster than Ethereum and the general altcoin market.\n\nLooking at Bitcoin itself, Kaleo says BTC is likely headed toward the $30,000 price level after it managed to bounce from support at around $21,000.\n\n“High timeframe support has held strong. SPX [S&P 500 index] is currently at 4,000 support, which I still see rallying to 4,300 over the coming weeks. $30,000 is a magnet.”\n\nIn the short term, Kaleo says Bitcoin will likely gather more momentum if it takes out resistance at $22,400.\n\n“CPI came in a bit higher than expected and the market is basically flat. SPX / NDX [Nasdaq-100 Index] look primed for a leg higher after a bit of initial volatility, and BTC is knocking on the door of reclaiming a major level it lost last Thursday. $30,000+ is still a magnet.”\n\nAt time of writing, Bitcoin is worth $22,214.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 91,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vd3d3LmJhbmtsZXNzdGltZXMuY29tL2JpZ2dlc3QtY3J5cHRvLXdoYWxlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "The 10 Biggest Crypto Whales in the Market - Bankless Times",
        "content": "Who are the biggest crypto whales in the market today, and what kind of impact do they have on the investment landscape? In the cryptocurrency space, “whale” is the term given to an investor who holds a huge amount of coins or tokens of a particular cryptocurrency.\n\nCrypto whales are important to the cryptocurrency investment space because they can create a ripple effect in the market, generating changes in token valuation.\n\nIf you know where the whales are swimming, you can often gain a better idea of how the markets they’re involved in might be influenced going forward.\n\nWho Are the Biggest Cryptocurrency Whales Right Now?\n\nDefining the biggest whales in crypto can be difficult. While some of the biggest investors in cryptocurrency are very open about how many tokens they hold, others are less straightforward. Cryptocurrency can be a highly anonymized area, so it’s difficult to know for certain which big wallets belong to which people.\n\nSome of the biggest cryptocurrency whales are actually major companies responsible for trading or managing large amounts of tokens.\n\nHowever, this list focuses on individuals known to us by name (or pseudonym), and these are some of the biggest crypto whales we’re aware of right now based on estimates by experts.\n\n1. Satoshi Nakamoto\n\nUndoubtedly the biggest cryptocurrency whale in the world, Satoshi Nakamoto is the pseudonym for the inventor of Bitcoin. We’re not sure for certain whether this is a person or a group of people, but we do know they continue to hold ownership of around 1 million BTC.\n\nIn today’s market, 1 million BTC equates to around 19.2 billion US dollars. If Nakamoto is a single person, this would make them the biggest crypto whale of all time.\n\n2. Brian Armstrong\n\nBrian Armstrong is the CEO of Coinbase, one of the largest crypto exchanges on the market. The website handles billions of trades every day, and Brian has a significant amount of crypto contributing to his own net worth.\n\nEstimates suggest the CEO has a crypto fortune worth of around $6.5 billion. However, it’s difficult to know what kind of crypto whale Armstrong is and which currencies he holds.\n\n3. Michael Saylor\n\nMichael Saylor is an American entrepreneur and businessman, as well as one of the biggest Bitcoin whales of all time. Experts even believe he might have been responsible for some major movements in the Bitcoin landscape, and he currently owns more than 17,732 bitcoins, worth over $1.14 billion.\n\nSaylor’s company, MicroStrategy, also began accumulating bitcoins in 2020. While we don’t know exactly how many Bitcoins Michael holds today, some experts say the BTC bank for the company is worth billions.\n\n4. Chris Larsen\n\nOne of the co-founders of the credit lending company Eloan, and peer-to-peer lending site Prosper, Chris Larsen helped to launch the Ripple cryptocurrency in 2012. Ripple is a blockchain network that has grown popular in the crypto whales list over the years.\n\nWhile there’s no direct information on how much crypto Larsen holds overall, Larsen does have at least 5.19 billion XRP, creating a net holding worth of around $37.3 billion.\n\n5. Changpeng Zhao\n\nThe CEO of Binance, Changpeng Zhao, is considered to be one of the biggest Bitcoin whales on the market, though he hasn’t released a lot of information about his holdings. Unsurprisingly, Zhao’s crypto holdings fall into both Binance coin and Bitcoin.\n\nAccording to reports, Zhao’s net worth is around $96 billion, but this doesn’t take into account his cryptocurrency holdings, which he says he plans on donating to charity.\n\n6. Vitalik Buterin\n\nVitalik Buterin is considered to be one of the biggest Ethereum whales on the market, though his holdings in ETH remain unknown at this time. As the co-creator of Ethereum, Buterin was once said to hold around 355,000 Ethereum, as well as various whale-sized quantities of other coins, like SHIB, Akita, and Dogecoin.\n\nIn 2022, Vitalik announced he was no longer a crypto whale following the collapse of various coin investments. However, we don’t know for certain how much he holds today.\n\n7. Tim Draper\n\nWell-known venture capitalist, tech billionaire, and entrepreneur Tim Draper is considered to be one of the biggest players on the Bitcoin whales list after he purchased 30,000 bitcoins for a bargain price when they were seized by Silk Road.\n\nThough Draper won’t reveal how many bitcoins he currently owns today, he also has wallets in various other cryptocurrencies, such as Aragon’s “ANT” tokens. The tech expert is expected to be worth a little over $1 billion.\n\n8. The Winklevoss Twins\n\nThe Winklevoss twins are perhaps best known for accusing Mark Zuckerberg for stealing their idea for a social network. In a 2012 settlement, they won around $65 million in court and invested it in a stack of Bitcoin. At the time, the twins were said to purchase about 1% of all the BTC in existence.\n\nThe twins are still considered to be some of the biggest Bitcoin whales around, with around 70,000 bitcoins in their portfolio, as well as a variety of other cryptocurrencies.\n\n9. Barry Silbert\n\nBarry Silbert acquired Digital Currency Group with funds from the sale of Second-Market, an equity trading platform acquired by Nasdaq in 2015.\n\nThis conglomerate consists of five companies, one of which is Grayscale, a digital asset management company.\n\nGrayscale manages a portfolio of assets worth over $28 billion (£20.6 billion), including Bitcoin and Ether. It was the first application approved to trade securities backed by Bitcoin and raised about £434 million annually.\n\n10. Jed McCaleb\n\nJed McCaleb was one of the co-founders of Ripple and is, therefore, one of the biggest XRP whales in the market today. Although McCaleb left the company following a disagreement with his other founders, he’s still said to own around 3.4 billion XRP.\n\nBy today’s standards, this gives McCaleb’s wallet a net worth of around $1.6 billion, which makes up a significant portion of his overall wealth. Apparently, Jed also has investments in other crypto markets, though he hasn’t revealed the details of his portfolio.\n\nThe Biggest Crypto Whales Today\n\nCrypto whales’ fortunes can be difficult to estimate because not everyone is open about their cryptocurrency holdings. The information we have about the current crypto whales is based on the news reports issued by major crypto purchases over the years. However, the volatility of the crypto market means many new whales could emerge in the future.\n\nFAQ\n\nWho are the biggest crypto whales? The biggest crypto whales are people with the largest numbers of tokens in a specific cryptocurrency. For instance, one of the top crypto whales in Bitcoin is Satoshi Nakamoto, the individual responsible for initially creating BTC. How many crypto whales are there? While we do have some information about the largest crypto whales to hit the market throughout the years, many of these people and entities remain anonymous. As such, it’s difficult to determine how many crypto whales there really are. How much money do you need to be a crypto whale? Being a crypto whale isn’t about the amount of money you have as much as it is about the number of tokens or coins you own in a specific currency. Crypto whales usually have around at least $10 million worth of a specific coin.\n\nHere Are More Crypto Guides"
    },
    {
        "id": 93,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzE2L2NyeXB0by1zdGFydHVwcy1hcmUtaW5jcmVhc2luZ2x5LXBvc3Rwb25pbmctdG9rZW4tbGF1bmNoLWFzLWFsYW1lZGEtcmVzZWFyY2hzLWNvbnRhZ2lvbi1lZmZlY3RzLWxpbmdlci1vbi_SAZoBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMi8xNi9jcnlwdG8tc3RhcnR1cHMtYXJlLWluY3JlYXNpbmdseS1wb3N0cG9uaW5nLXRva2VuLWxhdW5jaC1hcy1hbGFtZWRhLXJlc2VhcmNocy1jb250YWdpb24tZWZmZWN0cy1saW5nZXItb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 16 Feb 2023 08:00:00 GMT",
        "title": "Crypto Startups Are Increasingly Postponing Token Launch Plans as Alameda Research's Contagion Effects Linger - CoinDesk",
        "content": "“Crypto markets are cyclical in nature, but it needs stress test conditions like the last few months to prove its resiliency for the long term,” he told CoinDesk in a note. “New token issuance activity has been down, but it gives more opportunity for incumbent and top projects.”"
    }
]