[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMTAvMTMvdXMvYml0Y29pbi1taW5lcy1jaGluYS11bml0ZWQtc3RhdGVzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Across U.S., Chinese Bitcoin Mines Draw National Security Scrutiny - The New York Times",
        "content": "When a company with Chinese origins broke ground last year on a crypto-mining operation in Cheyenne, Wyo., a team at Microsoft that assesses national security threats sounded the alarm.\n\nNot only was the site next door to a Microsoft data center that supported the Pentagon — it was about a mile away from an Air Force base that controlled nuclear-armed intercontinental ballistic missiles.\n\nThe location could allow the Chinese to “pursue full-spectrum intelligence collection operations,” the Microsoft team wrote in an August 2022 report to the Committee on Foreign Investment in the United States, a federal body that monitors threats posed by overseas investors.\n\nMicrosoft’s warning did not go unheeded. Speaking on the condition of anonymity, U.S. government officials told The New York Times last week that they had been tracking the Wyoming operation for months. One official said that measures had been taken to mitigate potential intelligence collection but declined to elaborate. In addition, the mining company said it responded to queries from the federal investment committee."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5lbmVyZ3ktc3RvcmFnZS5uZXdzL2NyeXB0b2N1cnJlbmN5LXByaWNlLWNvbGxhcHNlLWxlYWRzLXRleGFzLWJpdGNvaW4tbWluZS1kZXZlbG9wZXItdG8tdGFyZ2V0LWJhdHRlcnktc3RvcmFnZS1vcHBvcnR1bml0eS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Cryptocurrency price collapse leads Texas bitcoin mine developer to target battery storage opportunity - Energy-Storage.news",
        "content": "However, Bootstrap instead wants to replace the proposed second phase with a large-scale battery energy storage system (BESS) facility.\n\nThe developer had received zoning approval for siting its crypto mine on the land in mid-2022, but with the proviso that it be allowed to consider and put forward plans for alternative industrial uses. The City Council of Corpus Christi last week (10 October) approved its “change of focus” at a meeting, as well as revised execution timelines.\n\nTeaming up with Leyline Renewable Energy-backed battery storage developer Navitas Energy, Bootstrap said its BESS is expected to be connected to the ERCOT power grid and go into service “not later than the end of calendar year 2025”.\n\nThe company has been “proceeding diligently” in preparation for its alternative plan, including filing an interconnection request with ERCOT, according to a letter sent to the council in August by Bootstrap Energy chief operating officer Matthew Held.\n\nThe developers expect the full interconnection study to be completed next month by utility AEP, which owns the existing substation to which the BESS would be connected.\n\nNavitas bought a 50.1% stake in the BESS portion of the development in February and is currently designing the project to feature a 300MW battery storage system.\n\n‘Crypto winter’ price collapse\n\nBootstrap Energy is going ahead with the initial 300MW of cryptocurrency mining, but said that factors including the high profile fall of the FTX crypto exchange had precipitated a dramatic reduction in demand for mining.\n\nFTX’s collapse and subsequent jailing of CEO Sam Bankman-Fried came during what was already being referred to as a ‘crypto winter’ – a period when crypto prices become severely depressed, disrupting infrastructure investments in the sector.\n\nBootstrap noted in a presentation to the Corpus Christi council that when it signed an offtake deal in February 2022 for the first phase, the price of bitcoin (BTC) was US$44,000, but by September 2022, it had fallen to US$18,000. At that time, offtaker Computer North filed for Chapter 11 bankruptcy protection, and four months later FTX collapsed, bringing the BTC price down to just US$15,000.\n\nThen, the customer for Phase 2 backed out of the project “just days before expected closing,” the company said.\n\nThe good news was that energy storage is seen as a new opportunity and Bootstrap Energy was approached by “numerous energy storage developers” before brokering the deal with Navitas Energy and becoming its joint developers.\n\nIn the first quarter of 2023, ERCOT accounted for 70% of all large-scale BESS deployments in the US. From around 3.3GW of batteries on the grid as of this summer, there are forecast to be 9.5GW connected by the end of 2024.\n\nThe two parties are both focused on Texas’ fast-growing market and developing numerous other BESS sites as well as some gas generation, all scheduled to be financed and constructed in a 2024-2026 timeline.\n\nBootstrap said the Phase 2 development would represent around a US$100 million investment and noted that the longer depreciation period for BESS versus crypto means capital equipment replenishment will be needed every 10 years as opposed to every five as originally proposed to the city.\n\nIt also pointed out the availability of “massive” investment tax credit (ITC) incentives available for energy storage developments, as introduced with the passing of the federal Inflation Reduction Act (IRA) in August last year.\n\nPhase 1 will still go ahead as a bitcoin mine. Each of the two phases will be worth around an equal amount in payments to Corpus Christi’s general fund, an average of around US$1.6 million a year, Bootstrap said.\n\nIn April 2022, a bitcoin mining and services company, Blockstream Mining, began work on a proof of concept (POC) project to compute the currency using a 3.8MW solar PV array paired with 12MWh of Tesla Megapack BESS units. That POC is sited at an undisclosed US location, as reported by Energy-Storage.news last year.\n\nOur publisher Solar Media is hosting the 10th Solar and Storage Finance USA conference, 7-8 November 2023 at the New Yorker Hotel, New York. Topics ranging from the Inflation Reduction Act to optimising asset revenues, the financing landscape in 2023 and much more will be discussed. See the official site for more details."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTgvc3BvdC1iaXRjb2luLWV0Zi1hcHByb3ZhbC1pcy1jb21pbmctYnV0LWFuYWx5c3RzLWRpZmZlci1vbi1wb3NzaWJsZS1wcmljZS1yZWFjdGlvbi_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMC8xOC9zcG90LWJpdGNvaW4tZXRmLWFwcHJvdmFsLWlzLWNvbWluZy1idXQtYW5hbHlzdHMtZGlmZmVyLW9uLXBvc3NpYmxlLXByaWNlLXJlYWN0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Spot Bitcoin ETF Approval Might Be Near, but Analysts Differ on Possible BTC Price Reaction - CoinDesk",
        "content": "Spot Bitcoin ETF Approval Might Be Near, but Analysts Differ on Possible BTC Price Reaction\n\nOne line of thought envisions a major rally, while another suggests approval has been fully baked into prices.\n\nBy Krisztian Sandor Oct 18, 2023 at 7:41 p.m. UTC"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNuYmMuY29tL3ZpZGVvLzIwMjMvMTAvMTcvd2F0Y2gtdGhlLXByZXZpZXctb2YtY25iY3MtbmV3LWRvY3VtZW50YXJ5LWNyeXB0by05MTEtZXhwb3NpbmctYS1iaXRjb2luLWJpbGxpb25haXJlLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Watch the preview of CNBC's new documentary 'Crypto 911: Exposing a Bitcoin Billionaire' - CNBC",
        "content": "Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email\n\nWatch the preview of CNBC's new documentary 'Crypto 911: Exposing a Bitcoin Billionaire'\n\nEamon Javers joins 'Squawk Box' with a preview of CNBC's new documentary 'Crypto 911: Exposing a Bitcoin Billionaire'."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTE3L2JpdGNvaW4tYnRjLTEwLWp1bXAtdG8tMzAtMDAwLWhpbnRzLWF0LXBsYXlib29rLWZvci1zcG90LWV0ZnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) 10% Jump to $30,000 Hints at Playbook for Spot ETFs - Bloomberg",
        "content": "A brief 10% surge in Bitcoin gave traders a glimpse into the possible impact of a looming US Securities & Exchange Commission decision on whether to allow exchange-traded funds that invest directly in the cryptocurrency.\n\nAn erroneous report that BlackRock Inc. had won approval to launch a spot ETF rapidly sent the largest digital asset to $30,002 on Monday, the highest price since August. The move cooled after the world’s biggest money manager said its application remains under review, leaving Bitcoin 4.4% higher for Oct. 16. It was little changed at around $28,400 on Tuesday in New York."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiqAFodHRwczovL3d3dy53YXNoaW5ndG9ucG9zdC5jb20vYnVzaW5lc3MvMjAyMy8xMC8xNy9zcG90LWJpdGNvaW4tZXRmLXdoYXQtdG8ta25vdy1hYm91dC1ncmF5c2NhbGUtYmxhY2tyb2NrLWlzaGFyZXMtZnVuZHMvMTJjYTNiYTAtNmQxNy0xMWVlLWIwMWEtZjU5M2NhYTA0MzYzX3N0b3J5Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Analysis | Why Crypto and Wall Street Are Longing for Spot Bitcoin ETFs - The Washington Post",
        "content": "Investors who want to bet on Bitcoin may soon have more options to choose from. Major financial firms including BlackRock, Fidelity and Invesco have submitted applications to sell US “spot” exchange-traded funds tied directly to Bitcoin holdings, and Grayscale Investments LLC won an Aug. 29 court ruling in its push to turn its Bitcoin trust into an ETF. In the past, the US Securities and Exchange Commission has routinely rejected these products, citing wariness over volatility and potential manipulation. But the Grayscale ruling and the BlackRock filing, in particular, might show the cryptocurrencies industry gaining the upper hand.\n\n1. What do Bitcoin ETFs look like?\n\nETFs, a $7 trillion industry, are part of a broader family of products known as exchange-traded products, though people frequently use “ETFs” to refer to all of them since they are by far the largest and most popular category. Crypto-native firms and major Wall Street financial institutions alike are trying to launch a kind of ETF that actually holds Bitcoin, as opposed to the products that invest in Bitcoin futures. Futures-backed Bitcoin ETFs have been available to US customers since 2021, but the SEC hasn’t approved any applications for so-called spot Bitcoin ETFs. Issuers and investors are advocating for spot Bitcoin ETFs to be similarly accessible to retail and institutional investors in the US, a development that’s perceived as having the potential to greatly broaden participation in the cryptocurrency industry.\n\nAdvertisement\n\n2. What’s the difference between Bitcoin futures and spot Bitcoin?\n\nFutures are contracts to buy or sell an asset at a specified price at a later date. They are widely used in many markets, like oil, by investors who want to speculate on price movements without having to own or take possession of the underlying asset directly. As the price of Bitcoin swings up or down according to direct trading, Bitcoin futures track the cryptocurrency’s spot price indirectly on exchanges like the Chicago Mercantile Exchange. In the spot Bitcoin market, by contrast, users buy and sell the actual digital currency via exchanges.\n\n3. What’s been available before now?\n\nThe ProShares Bitcoin Strategy ETF became the first Bitcoin futures ETF available in the US, opening on Oct. 19, 2021, to strong demand. The Purpose Bitcoin ETF (ticker BTCC) made its debut in Toronto in early 2021; it invests directly in “physical/digital Bitcoin,” according to its issuer, Purpose Investments Inc. In June, issuer Volatility Shares launched a leveraged Bitcoin-futures ETF. Multiple Ether-futures funds debuted in October. Meanwhile, several US investment trusts have been following Bitcoin in a manner that’s similar to ETFs but with certain restrictions. The Grayscale Bitcoin Trust (ticker GBTC) is physically backed, meaning that it holds Bitcoin. Grayscale sued the SEC over its attempt to turn GBTC into an ETF; that’s the case in which Grayscale won a key legal fight in August.\n\nAdvertisement\n\n4. Where do things stand?\n\nShare this article Share\n\nThe world’s biggest asset manager, BlackRock Inc., filed an application for a spot Bitcoin ETF in June, kicking into high gear speculation that the long-illusive investment product would finally get SEC approval. BlackRock’s application, in turn, led to a major crypto market rally and a flurry of similar ETF applications and resubmissions from issuers including Fidelity Investments and WisdomTree Inc. Grayscale has been making the argument that a conversion would help it unlock billions of dollars in value for investors of GBTC. The SEC isn’t asking planning a federal appeals court to reconsider the ruling and isn’t going to lob any other appeals in the case. That brings further clarity to how the process of Grayscale potentially converting its trust to an ETF may unfold, though the road ahead could still be long and drawn out.\n\n5. Why did regulators shun a Bitcoin ETF for so long?\n\nAdvertisement\n\nIn addition to their worries about liquidity and manipulation, regulators have expressed concern that Bitcoin’s volatility might be too intense for ordinary investors — Bitcoin’s last three full-year returns were gains of 305% in 2020, up another 60% in 2021, followed by a loss of 64% in 2022. The SEC has also questioned whether funds would have the information necessary to adequately value tokens like Bitcoin, including whether they can validate who owns the underlying coins. In 2021, SEC Chairman Gary Gensler testified to the Senate Banking Committee that the lack of regulatory oversight and surveillance in crypto markets led to “concerns about the potential for fraud and manipulation.” In an attempt to allay some of the SEC’s concerns, BlackRock and other issuers following in its footsteps have proposed so-called surveillance-sharing agreements, a way to mitigate the risk of market manipulation and fraud. Coinbase Inc., the only publicly traded, pure-play spot-crypto exchange in the US, has emerged as ETF issuers’ market surveillance partner of choice.\n\n6. What might the SEC’s process look like?\n\nSome experts are expecting an ultimate approval of at least one spot Bitcoin ETF by the end of the year, while others advise caution, as the battlefield is already littered with corpses of around 30 prior attempts that failed to persuade the SEC to give them a chance. Analysts will now also be closely watching any potential developments in Grayscale’s conversion process. Bloomberg Intelligence analysts see the conversion as “inevitable” and expect open dialog between regulators and the asset-manager going forward.\n\n--With assistance from Claire Ballentine.\n\nMore stories like this are available on bloomberg.com"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTgvYml0Y29pbi1uZWFycy0yOWstYXMtZmlkZWxpdHktZXRmLWFtZW5kbWVudC1idW1wcy1idWxsaXNoLXNlbnRpbWVudC_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzE4L2JpdGNvaW4tbmVhcnMtMjlrLWFzLWZpZGVsaXR5LWV0Zi1hbWVuZG1lbnQtYnVtcHMtYnVsbGlzaC1zZW50aW1lbnQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Nears $29K as Fidelity ETF Amendment Bumps Bullish Sentiment - CoinDesk",
        "content": "“We continue to see continued elevated trading volumes. We view this as good news, given that the price is not high by historical standards,” said Alex Kuptsikevich, FxPro senior market analyst, in a note to CoinDesk. “It is an influx of fresh buyers rather than an active exit from the market.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTE4L2JpdGNvaW4tZXRmLWJ0Yy13YXRjaGVycy1jaXJjbGUtZnJpZGF5LWFzLW5leHQta2V5LWRhdGUtaW4tdGhlLXJhY2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin-ETF Watchers Circle Friday as Next Key Date in Approval Race - Bloomberg",
        "content": "Those closely following the quest for an exchange-traded fund that would hold Bitcoin have Friday circled on their calendars.\n\nThat’s when a DC court will issue a mandate that could make effective an August opinion that went in favor of Grayscale Investments LLC, which had sued the US Securities and Exchange Commission as it looked to convert its Bitcoin trust (GBTC) into an ETF, according to Bloomberg Intelligence analysts Elliott Stein and James Seyffart . It’s the next step in the process after the SEC last week opted against appealing the previous ruling, which it had lost."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEwLzE5L3Rlc2xhLWtlZXBzLWJpdGNvaW4tc3Rhc2gtc3RlYWR5LWF0LTI3NW0taW4tcTMv0gFgaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMTAvMTkvdGVzbGEta2VlcHMtYml0Y29pbi1zdGFzaC1zdGVhZHktYXQtMjc1bS1pbi1xMy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Elon Musk's Tesla Didn't Buy or Sell Any Bitcoin During the Third Quarter - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEwLzE3L2JsYWNrcm9jay1jZW8tbGFycnktZmluay1zZWVpbmctY2xpZW50LWRlbWFuZC1mb3ItY3J5cHRvLWFyb3VuZC10aGUtd29ybGQv0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMTAvMTcvYmxhY2tyb2NrLWNlby1sYXJyeS1maW5rLXNlZWluZy1jbGllbnQtZGVtYW5kLWZvci1jcnlwdG8tYXJvdW5kLXRoZS13b3JsZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "BlackRock CEO Larry Fink Seeing Client Demand for Crypto 'Around The World' - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEwLzE4L2JpdGNvaW4tbWluZXItbWFyYXRob24tdG8tY3VzdG9keS1zb21lLW9mLWl0cy1idGMtd2l0aC1maWRlbGl0eS1kaWdpdGFsL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzEwLzE4L2JpdGNvaW4tbWluZXItbWFyYXRob24tdG8tY3VzdG9keS1zb21lLW9mLWl0cy1idGMtd2l0aC1maWRlbGl0eS1kaWdpdGFsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Marathon to Custody Some of Its BTC With Fidelity Digital - CoinDesk",
        "content": "Marathan's decision comes after several custodians, including Fortress Trust, have been targeted by hackers that stole some digital assets. In the case of Fortress Trust, the theft spurred the custodian to try to sell itself to blockchain tech company Ripple, but that deal fell apart."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTcvYml0Y29pbi1hYm92ZS0yOGstYnVveWVkLWJ5LWNhbGlmb3JuaWEtYml0bGljZW5zZS1iaWxsLWJlaW5nLXNpZ25lZC_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzE3L2JpdGNvaW4tYWJvdmUtMjhrLWJ1b3llZC1ieS1jYWxpZm9ybmlhLWJpdGxpY2Vuc2UtYmlsbC1iZWluZy1zaWduZWQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Above $28K Buoyed by California ‘BitLicense’ Bill Being Signed - CoinDesk",
        "content": "“Relative to other assets, the risk vs. reward (or upside vs. downside) of crypto looks much better relative to other asset classes,” said Solo Cessay, co-founder of social app Calaxy, in a note to CoinDesk. “Crypto looks like it has the best upside vs. downside potential, given the current asset prices. Real estate, the S&P 500 - everything is still trading near all-time highs.”"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTAvMTcvYml0Y29pbi1tYWdhemluZS1vd25lci1iYWNrcy1maXJzdC1vcmRpbmFscy1mdW5kLXdoaWNoLWJvdWdodC04NWstcm9jay_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzEwLzE3L2JpdGNvaW4tbWFnYXppbmUtb3duZXItYmFja3MtZmlyc3Qtb3JkaW5hbHMtZnVuZC13aGljaC1ib3VnaHQtODVrLXJvY2svYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Magazine Owner Backs First Ordinals Fund, Which Bought $85K Rock - CoinDesk",
        "content": "While Ordinals and BRC-20 tokens could bring greater utility to Bitcoin, they are controversial among some developers who believe that they are clogging up the network and raising fees and that they \"pollute\" the blockchain with data that has nothing to do with Satoshi Nakamoto’s mission of a peer-to-peer system of money transfer."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTAvMTgvbGlnaHRuaW5nLWxhYnMtcm9sbHMtb3V0LXRhcHJvb3QtYXNzZXRzLXRvLW1ha2UtYml0Y29pbi1tdWx0aS1hc3NldC1uZXR3b3JrL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMTAvMTgvbGlnaHRuaW5nLWxhYnMtcm9sbHMtb3V0LXRhcHJvb3QtYXNzZXRzLXRvLW1ha2UtYml0Y29pbi1tdWx0aS1hc3NldC1uZXR3b3JrL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Lightning Labs Rolls Out 'Taproot Assets,' to Make Bitcoin 'Multi-Asset' Network - CoinDesk",
        "content": "\"The protocol only requires an issuer to make a single bitcoin transaction to mint an effectively unbounded amount of Taproot Assets, and all of the metadata describing those assets is stored off-chain, with only a cryptographic commitment to the assets stored on-chain,\" Gentry wrote in a direct message. \"Further, transacting with Taproot Assets over the Lightning Network will happen off-chain and will not touch the blockchain at all.\""
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTcvYml0Y29pbnMtcmlzaW5nLWRvbWluYW5jZS1yYXRlLWNoYWxsZW5nZXMtYWx0Y29pbi1ib29tLWZyb20tMjAyMS_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzE3L2JpdGNvaW5zLXJpc2luZy1kb21pbmFuY2UtcmF0ZS1jaGFsbGVuZ2VzLWFsdGNvaW4tYm9vbS1mcm9tLTIwMjEvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin's Rising Dominance Rate Challenges Altcoin Boom From 2021 - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMTAvMTcvY3J5cHRvOTExLmh0bWzSATJodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8xMC8xNy9jcnlwdG85MTEuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "The secret life of Jimmy Zhong, who stole – and lost – more than $3 billion - CNBC",
        "content": "Athens, Georgia, is home to the University of Georgia, and the police there are used to college town-type crimes: break-ins, bar fights and assorted rowdiness. That kind of thing. But the 911 call that came in on the night of March 13, 2019, was unlike anything the Athens-Clarke County Police Department had ever encountered. On the phone was 28-year-old Jimmy Zhong, a local party boy and Georgia alum who frequented Athens' drinking establishments. He wasn't like the other town rowdies – Zhong was also a computer expert who had an unusually robust digital home surveillance system. Now, he was calling to report a crime: hundreds of thousands of dollars in crypto currency that he said had been stolen from his home. Thinking of all that lost money, Zhong was distressed.\n\nIn March 2019, someone broke into Zhong's home, shattering the window. Source: Athens-Clarke County Police\n\n\"I'm having a panic attack,\" Zhong told the dispatcher, according to a recording obtained by CNBC. Zhong turned down the dispatcher's offer of an ambulance, and began trying to explain the situation. \"I'm an investor in bitcoin , which is like an online thing,\" he said. What happened next would bring an end to a nearly decade long manhunt and solve one of the biggest crimes of the crypto era. And it also would lead to the largest seizure of cryptocurrency from an individual in the history of the Department of Justice. Zhong's emergency call that winter evening sent investigators down a long digital trail that led back to the earliest days of bitcoin and revealed a dark truth about the universe of hackers and coders responsible for the creation of cryptocurrencies. It's a world where heroes and villains traded places and could even be the same people. None of it would go at all the way Zhong wanted. The 911 call didn't produce a suspect in the theft from Zhong's house. Athens police were dealing with one of their first crypto cases and unfamiliar with the shadowy underworld, and they failed to make progress in the case. So Zhong turned to local private investigator Robin Martinelli, who owns and operates Martinelli Investigations in nearby Loganville, Georgia.\n\nRobin Martinelli, Martinelli Investigations owner and private investigator. CNBC\n\nA former sheriff's deputy turned PI, Martinelli was far from an expert in crypto. She specialized in process serving, cheating spouses and custody investigations, the type of probes that once got her firm featured on an episode of \"The Montel Williams Show.\" Martinelli had recently undergone surgery to amputate one leg, leaving her to conduct her surveillance operations with the help of a prosthetic. Still, she was motivated to solve Zhong's case. \"When you wake up and don't put two feet on the ground, but you still have to run a company, you got to get out there and kick ass,\" Martinelli told CNBC in an interview for the new documentary, \"Crypto 911: Exposing a Bitcoin Billionaire.\" She began by examining Zhong's robust surveillance video archive of his home. In looking at footage from the night of the crime, Martinelli spotted a slender male figure.\n\nSurveillance footage CNBC obtained captures someone breaking into Zhong's home in March 2019. Source: Athens-Clarke County Police\n\n\"We could tell that they had like a hood on – a gray hood – but then they had almost like a black ski mask,\" Martinelli said. The suspect appeared to know his way around Zhong's house, which led Martinelli to believe that he was a friend or at least someone who had heard Zhong boast about his bitcoin stash. From the video, Martinelli was able to determine the suspect's height and even the size of his hands. She said she began her investigation by putting Zhong's friends under surveillance, following them to their homes and downtown bars on Broad Street and College Avenue. She put trackers on cars and scoured social media and conducted background checks. As she watched Zhong's bar friends come and go, Martinelli formed a low opinion of the group. She described them as \"very, very casual, plastic, not really caring, maybe using Jimmy a little bit.\" Martinelli said Zhong appeared resistant to her theories, especially when they began to focus on his circle of friends. Martinelli eventually settled on one suspect in particular who she believed had stolen 150 bitcoins from Jimmy. At the time, that amount of the digital currency was worth nearly $600,000. Zhong didn't want to hear it, she said. \"He would get upset when I would kind of mention somebody would had to have known where this cash was,\" Martinelli said. And she understood why Zhong was so hurt by the idea that someone close to him could have betrayed him. \"Jimmy wanted to be loved,\" she said. \"Jimmy wanted friends.\" Even as Martinelli soured on the friend group, she was warming up to her client, who she perceived as an odd man in search of friends. \"Jimmy was a good guy,\" she said. A lot of people around Athens felt similarly about him. In the years before the theft, Zhong was known for throwing a lot of money around town. He was the kind of guy who would buy a round of expensive shots for the whole bar, hundreds of dollars vanishing in seconds down eager throats.\n\nZhong pictured with two women in front of a limousine. Source: Zhong's social media profile\n\nAlthough he lived in a modest off-campus bungalow, near student housing and the downtown college bar scene, he stayed at fancy hotels, including the Ritz Carlton, the Plaza and the Waldorf Astoria, according to court documents CNBC reviewed. He shopped at high-end stores such as Louis Vuitton, Gucci and Jimmy Choo. He drove fancy cars, including a Tesla . He bought a second home, a lake house with a dock in Gainesville, Georgia, a short drive from Athens. He stocked it with jet skis, boats, a stripper pole, and lots and lots of liquor.\n\nZhong pictured with two women on a yacht. Source: Zhong's social media profile\n\nHis parties were epic. Zhong was living his best life with no visible source of income. As far as anyone knew, he didn't really have a job. He told his friends that he'd gotten into bitcoin early, mining thousands of coins in the earliest days of the technology. Zhong told people he dabbled in crypto as far back as 2009, the year bitcoin was invented by the mysterious Satoshi Nakamoto and a small crew of developers tied online to the anonymous crypto creator. Whatever Zhong was doing, he was making mountains of cash. And he was willing to splurge. In 2018, when his beloved Georgia Bulldogs football team made the Rose Bowl, Zhong rounded up a small group of friends for a pilgrimage to Los Angeles.\n\nZhong pictured with a group of friends at the 2018 Rose Bowl game. Source: Zhong's social media profile\n\n\"It really felt like with Jimmy, there were no limits,\" Stefana Masic, a Georgia alum and one of the friends on the trip, told CNBC.\n\nStefana Masic, Zhong's friend. CNBC\n\nMasic said not only did Zhong pay for all the tickets, but he also rented a private jet for the cross-country flight. And he gave each friend up to $10,000 for a Beverly Hills shopping spree on Rodeo Drive. They spent it on outfits, accessories and baubles to wear in the city. \"I had never flown private before, and I never stayed in such a nice Airbnb . It was cool because, you know, I got to experience a lot of things that I normally wouldn't.\" As he was cheering on his team in LA, Zhong couldn't have known that a small group of agents from the IRS Criminal Investigation unit, led by officials in the same city, were painstakingly trying to solve a crime that dated back years. What had captured the investigators' attention was a 2012 hack in which someone had stolen 50,000 bitcoins from a site on the dark web called Silk Road, according to court documents CNBC reviewed. That site was one of the earliest crypto marketplaces, where anonymous buyers and sellers exchanged all manner of illicit material. It was full of drugs, guns, pornography and other stuff people wanted to keep secret. Over the years, the value of the bitcoin stolen by the Silk Road hacker had soared to more than $3 billion, according to court documents. Investigators could track the location of the currency on the blockchain, which is a public ledger of all transactions. But they couldn't see the identity of the new owner of the funds. So they watched and waited for years as the hacker transferred funds from account to account, peeled some away, and pushed some of it through crypto \"mixers\" designed to obscure the source of the money. Finally, Chainalysis, a blockchain analytics company that was tracing the digital wallets containing the stolen Silk Road assets, saw the hacker made a tiny mistake. He transferred around $800 worth to a crypto exchange that followed established banking rules, including so-called know your customer processes, requiring real names and addresses of account holders. The account was registered in Zhong's name. The transaction took place in September 2019, six months after Zhong's 911 call to the local police. That alone wasn't enough to prove Zhong was the hacker. They had to be sure. So the IRS called the Athens-Clarke County Police Department and asked for some help, according to sources at both agencies. At the time, the police investigation into Zhong's own crime report had been languishing. \"I got a call from an IRS agent,\" Lt. Jody Thompson, who leads the local property and financial crimes unit, told CNBC. \"And he said, 'can I come by and speak to you about Jimmy?' And I was like, sure, I remember this case.\"\n\nLt. Jody Thompson, Athens-Clarke County Police. CNBC\n\nAfter that, Thompson joined forces with IRS-CI special agent Trevor McAleenan and Shaun MaGruder, CEO of a cyber intelligence company called BlockTrace. MaGruder's company works with the IRS as an embedded contractor and was hired for its experience untangling complicated blockchain transactions.\n\nShaun MaGruder, BlockTrace CEO. CNBC\n\nTogether, the three investigators said they devised a plan. They would approach Zhong using a ruse, telling him they were investigating the crime that he'd called about, the one in which a thief had stolen hundreds of thousands of dollars of his bitcoin. In reality, they were investigating Zhong for a crime they believed he had committed. A crime whose proceeds were now worth billions of dollars. When the three men knocked on the door of his lake home in Gainesville, Zhong opened it enthusiastically, according to body camera footage CNBC exclusively obtained. He believed the police officer and the two specialists were there to help solve his crypto cold case. \"If you guys solve this for me, I will invite you out for a party,\" Zhong told the trio on the body camera footage. The video shows the officers pouring on the praise. They called his front door \"beautiful.\" They called his speakers \"crazy,\" and they complimented his dog, Chad. They asked for a tour of the house. Body camera footage shows the men tapping on stone floors, looking in closets and checking out wood paneling. Zhong didn't know it, but they were scouring for secret compartments. Zhong brought investigators to his basement, equipped with a full bar and a stripper pole. \"Is this your workout?\" McAleenan asked Zhong. \"Nope, that's for girls,\" Zhong replied.\n\nBody camera footage CNBC obtained shows investigators in Zhong's basement, which contains a full bar and a stripper pole. Source: Athens-Clarke County Police\n\nThe body camera footage also shows they got a good look at Zhong's security system, asking him to explain each of its features and capabilities. Zhong is also captured showing them a metal case he said he once used to store $1 million in cash so he could impress a woman. \"Did it work?\" asked Lt. Thompson. \"Nope,\" Zhong said. \"It never does,\" Thompson replied. The law enforcement officers learned that Zhong had a flamethrower on the premises. And they saw his AR-15 rifle hanging on the wall. MaGruder said Zhong's level of sophistication was apparent. \"He was navigating that keyboard like I've never seen someone navigate a keyboard,\" MaGruder said. \"He didn't have to use a mouse because he knew all the hotkeys.\" Playing on the ruse, the officers asked Zhong to open his laptop and explain how he came to have the bitcoin in the first place. Zhong sat on the couch next to the investigators and entered his password, asking them to turn away as he typed. When he opened the laptop, law enforcement could see his bitcoin wallet. \"Lo and behold, he had $60 or $70 million worth of bitcoins right there next to us,\" MaGruder told CNBC in an interview.\n\nBody camera footage CNBC obtained captures Zhong showing investigators millions of dollars of bitcoin on his laptop. Source: Athens-Clarke County Police\n\nThe evidence was enough to convince the investigators they were on the right track. As he exited Zhong's lake house, MaGruder told CNBC he thought to himself, \"This is incredible. I think we found our guy.\" The first visit allowed the investigators to obtain a federal search warrant for Zhong's home, McAleenan said. McAleenan, MaGruder, and Thompson returned with an enormous team of officers on Nov. 9, 2021. Before the officers raided the house, McAleenan had to explain to Zhong that he wasn't really trying to help him. He was trying to convict him. \"I said, Jimmy, you know me as 'Trevor.' I'm actually Trevor McAleenan. I'm a special agent with IRS Criminal Investigation, and we're here to execute a federal-approved warrant on your house,\" McAleenan said.\n\nTrevor McAleenan, IRS-CI Special Agent. CNBC\n\n\"And he kind of had this look like, 'Am I being punked?'\" McAleenan added. At that moment, another officer slid a device known as a \"jiggler\" into Zhong's laptop, causing the cursor to continually move and giving law enforcement access to the password-protected contents of the computer, McAleenan said. Officers flooded into the home, cracking open every crevice in search of evidence. McAleenan said in an upstairs closet, they found a popcorn tin with a computer hidden inside that held millions of dollars worth of bitcoin.\n\nZoom In Icon Arrows pointing outwards The popcorn tin where investigators found a single board computer hidden inside that held millions of dollars worth of bitcoin. Source: IRS Criminal Investigations\n\nThe single board computer investigators found inside the popcorn tin. Source: IRS Criminal Investigations\n\nUsing sniffer dogs trained to detect electronics, McAleenan said they found a safe buried in concrete under some basement floor tile. Court documents said the safe contained precious metals, stacks of cash and physical bitcoins minted in the early years of crypto. They also found a wallet with bitcoin from the original hack of Silk Road in 2012.\n\nZoom In Icon Arrows pointing outwards Physical bitcoin and cash investigators found during the search warrant. Source: IRS Criminal Investigations\n\nZhong was busted. \"Really late at night we were able to say we were successful,\" McAleenan said. \"We found the evidence that we were looking for. And the house lit up. I mean, every agent on the site cheered.\" As they sorted through the evidence, agents discovered something else about the unusual Mr. Zhong. He was, in crypto slang, an \"original gangster,\" or OG. Investigators discovered that as far back as 2009, the year bitcoin was invented, Zhong was among a small group of early coders who worked to develop and perfect the technology. He was a smaller contributor than some of the other OG players who have since become famous in the bitcoin community, McAleenan said. But investigators concluded that he made contributions to the original bitcoin code and offered ideas to the early developers on key topics like how to reduce blockchain size. In other words, a hacker who had been involved in the development of bitcoin itself went on to become one of the biggest bitcoin thieves of all time. \"He is one of the, as we dubbed it, the original gangsters, OGs, as far as bitcoin core software developers,\" McAleenan said. \"He had been in this space for quite a while.\" The irony of Zhong's role in the history of bitcoin is emblematic of the culture that built the cryptocurrency in the first place, said Nathaniel Popper, author of \"Digital Gold: Bitcoin and the Inside Story of the Misfits and Millionaires Trying to Reinvent Money.\"\n\nNathaniel Popper, author of \"Digital Gold: Bitcoin and the Inside Story of the Misfits and Millionaires Trying to Reinvent Money.\" CNBC\n\n\"Everybody came to this for their own reason,\" Popper told CNBC. \"And it was, as a result of that, a very sort of eclectic and eccentric group of people.\" \"Bitcoin was always shot through with irony,\" Popper said. \"Yes, there was something ironic about a bitcoin proponent stealing bitcoin from another bitcoin proponent. But I think that was also in some ways a part of what defined bitcoin.\" Zhong was charged with wire fraud. After pleading guilty, he was sentenced to one year and a day in federal prison. Zhong, now 33 years old, began his sentence at the federal prison camp in Montgomery, Alabama, on July 14, 2023. In the end, Zhong didn't get to keep the stolen bitcoin. The U.S. government seized those assets. Officials opened a process that allowed victims of the hack to apply to get their bitcoin back, according to a forfeiture document CNBC reviewed. Nobody came forward to claim the loot. That's not surprising, given that users of Silk Road in 2012 were largely drug dealers and their customers. The federal government simply sold off the stolen bitcoin and will keep the proceeds. Some of the revenue generated will likely be shared with the Athens-Clarke County Police Department, in recognition of the local officers' help in the case, according to the IRS-CI. As he left the courthouse after his sentencing on April 14, CNBC attempted to question Zhong about his role in the crime. Zhong covered his head with his coat and left without saying a word. In his statement to the judge before sentencing, Zhong said having billions in stolen bitcoin made him feel important.\n\nZhong with his attorneys, Michael Bachner and John Garland, at sentencing. Source: IRS Criminal Investigations\n\nZhong's attorney, Michael Bachner, says the theft never actually damaged the U.S. government.\n\nMichael Bachner, Zhong's attorney. CNBC\n\n\"The government has certainly not been hurt by Jimmy's conduct whatsoever,\" Bachner told CNBC. \"If Jimmy had not stolen the coins and the government had in fact seized them from [Silk Road operator Ross Ulbricht] they would have sold them two years later in 2014 as they did with other coins.\" At that point, the government \"would have gotten $320 a coin or made somewhere about $14 million,\" Bachner said. \"Now, as a result of Jimmy having them, the government has gotten a $3 billion profit.\" Zhong asked for no jail time because he was concerned about the fate of Chad, his 13-year-old dog. Zhong has had a difficult life. On the autism spectrum, Bachner said he was severely bullied at school. And he found solace over the years in an online community where he could deploy his computing skills.\n\nChad, Zhong's elderly dog. Source: Zhong's social media profile"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG9jdXJyZW5jeS1tYWluc3RyZWFtLWxhdGVzdC1iaXRjb2luLWV0Zi0xOTA5MjE5MzkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Cryptocurrency Is About To Go Mainstream With Latest Bitcoin ETF — Can It Make Owning Crypto More Profitable? - Yahoo Finance",
        "content": "monsitj / Getty Images/iStockphoto\n\nSo-called “spot” Bitcoin exchange traded funds (ETFs) — which are “Bitcoin only” or “pure Bitcoin” funds — have been a holy grail concept for crypto aficionados for some time, but have long faced legal stalling from regulators.\n\nSee: ChatGPT Was Given $20K To Invest In Stocks and Crypto — Here’s How It Made $2,000 in a Month\n\nFind: 3 Things You Must Do When Your Savings Reach $50,000\n\nInvestors and investment managers have anxiously been awaiting approvals from the Securities and Exchange Commission (SEC) regarding Bitcoin ETFs, as several companies have filed for the approval of such funds with the SEC — approvals which have either been rejected or delayed.\n\nNow, though, it appears things may begin to change.\n\nAs Bloomberg reported on Oct. 16, the SEC will not ask a federal appeals court to reconsider a ruling that paves the way for Grayscale Investments to launch a spot Bitcoin ETF, according to a person familiar with the matter. Some experts are viewing this outcome as a watershed moment.\n\nIn October 2021, Grayscale announced it had filed with the SEC to convert its Bitcoin Trust into a Bitcoin Spot ETF “on the heels of the SEC’s clearance of a Bitcoin Futures ETF,” according to an announcement. The filing faced opposite from the SEC, however.\n\nIn August, in a highly anticipated decision, the U.S. Court of Appeals for the District of Columbia Circuit vacated the SEC’s decision.\n\n“The denial of Grayscale’s proposal was arbitrary and capricious because the Commission failed to explain its different treatment of similar products. We therefore grant Grayscale’s petition and vacate the order,” court documents read.\n\nA Grayscale spokeswoman indicated the Federal Rules of Appellate Procedure’s 45-day period to seek rehearing has now passed.\n\n“The Court will now issue its final mandate within seven calendar days. The Grayscale team remains operationally ready to convert GBTC to an ETF upon the SEC’s approval, and we look forward to sharing more information as soon as practicable,” she added.\n\nStory continues\n\nAlso: 8 Best Cryptocurrencies To Invest In for 2023\n\nIs An Approval Likely To Arrive Soon?\n\nAccording to Thomas Hogan, former chief economist from the U.S. Senate Banking Committee and economist with the American Institute for Economic Research, although there has been no official word from the SEC, there are hints that the approval of a Bitcoin ETF is becoming more likely.\n\n“Major investment companies like BlackRock, the world’s largest asset manager, have joined the many firms filing applications for Bitcoin ETFs. Almost 100% of BlackRock’s previous ETF filings have been approved, so they probably would not have filed an application unless they thought approval was likely,” said Hogan.\n\nSeveral experts echoed the above sentiment, including Nihar Neelakanti, CEO and co-founder of Ecosapiens. Neelakanti said it seems an approval of a spot BTC ETF is actually right around the corner — and, at the latest, is poised to happen early next year.\n\n“There’s just too much political pressure placed on the SEC for it not to approve, especially when you think about what institutions are involved here, such as BlackRock and Vanguard,” said Neelakanti. “Legally, with courts having essentially weighed in in favor of Grayscale and its proposed ETF, it’s now almost impossible to resist an approval.”\n\nNeelakanti added that when an approval happens, we will see a wall of money flooding into the space.\n\n“We saw a hint of this when there was false news reported recently about an approval of the iShares BTC ETF,” said Neelakanti, referring to the erroneous news published earlier this week. “The price of BTC shot up 10% in seconds when that false approval news was reported. This tells me we will see something similar, and likely far more pronounced, when an actual approval happens.”\n\nWhat Would a Spot Bitcoin ETF Approval Mean for Investors?\n\nZachary Townsend, co-founder and CEO of Meanwhile, said the SEC’s deadline for appealing the decision around Greyscale’s ETF application passed a few days ago — that it’s less a matter of if it will be approved, but rather when.\n\nAnd when a spot BTC ETF is approved, he said he expects tens of billions of dollars to flow into Bitcoin and then, indirectly, the broader digital asset ecosystem.\n\n“So many investors are keen on getting exposure to Bitcoin, but they don’t want to go through the hassle of self-custody, which is difficult for even seasoned Bitcoiners,” said Townsend.\n\nIn turn, he added that an approved spot BTC ETF will provide that kind of investment vehicle for investors — and that such a vehicle will also make it far easier for investment advisors to advise their clients in getting BTC exposure via one of these approved ETFs.\n\n“There’s just a tremendous amount of passively invested money that is poised to go into these BTC products, which are likely going to be available for 401k-like investments and such,” he said. “The issue now is timing, and I think next year is likely when we will see these approvals come about. There could be more delays, of course, but next year seems likely to me.”\n\nAnother impact of a potential approval is on Bitcoin’s price, which, according to several experts, could shoot up once this happens.\n\nBradley Duke, chief strategy officer at ETC Group, said that Bitcoin holders are celebrating this news because they believe a spot Bitcoin ETF being approved in the U.S. will unleash pent-up demand. It is also believed that, ultimately, the ETF issuers will need to buy and hold a lot of Bitcoin to back these ETFs.\n\n“With the total supply of Bitcoin being fixed at 21 million coins, this jump in demand will undoubtedly lead to upward price pressure on the Bitcoin spot price,” he said. “It’s hard to know how big this pent-up demand is and the timing thereof, but many institutional investors will get comfort from the fact that asset management giants like Blackrock will be issuing these new products, along with the fact that just about every major U.S. player in financial services, now has some kind of business in crypto — from Goldman Sachs to Fidelity, from Citadel to Charles Schwab and many others.”\n\nCan Approval Help the Broader Crypto Space?\n\nWhile a spot Bitcoin ETF has the potential to increase Bitcoin adoption, particularly among traditional financial players and advisors, it’s important to note that the ETF has certain limitations in comparison to owning actual Bitcoin. This is the position held by David Waugh, business development and communications specialist at Coinbits.\n\n“On one hand, an ETF can act as a connection for financial professionals who were previously hesitant or unprepared to enter the cryptocurrency space, which could positively impact Bitcoin’s price,” he said.\n\nHowever, he noted that ETFs are restricted because they operate within the traditional financial system, so they do not provide complete protection against market, government, or compliance risks that holding Bitcoin in self-custody does.\n\n“In other words, Bitcoin ETFs make the asset more accessible, but they do not fully encompass the revolutionary autonomy and protection that Bitcoin represents as a decentralized asset,” he added.\n\nMore From GOBankingRates\n\nThis article originally appeared on GOBankingRates.com: Cryptocurrency Is About To Go Mainstream With Latest Bitcoin ETF — Can It Make Owning Crypto More Profitable?"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LnRoaW5rYWR2aXNvci5jb20vMjAyMy8xMC8xNy9ldGhlcmV1bS1ldGZzLWFyZS1oZXJlLXNwb3QtYml0Y29pbi1uZXh0L9IBV2h0dHBzOi8vd3d3LnRoaW5rYWR2aXNvci5jb20vMjAyMy8xMC8xNy9ldGhlcmV1bS1ldGZzLWFyZS1oZXJlLXNwb3QtYml0Y29pbi1uZXh0Lz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Ethereum ETFs Are Here. Is Spot Bitcoin Next? - ThinkAdvisor",
        "content": "In a significant move this month, the Securities and Exchange Commission approved nine exchange-traded funds that invest in ethereum futures contracts.\n\nDoes this mean the SEC will soon allow spot bitcoin ETFs onto the market?\n\nInvestors are anxiously waiting for the SEC’s decision. In August, the SEC was ordered by a court to vacate its rejection of Grayscale’s application to convert the Grayscale Bitcoin Trust into an ETF. Last week, the SEC decided not to appeal the court’s ruling in the Grayscale case or require Grayscale to refile its application, which could have delayed approval for as much as a year.\n\nAlthough the arrival of ethereum futures ETFs is a welcome step toward the mainstreaming of crypto, there’s no assurance yet that the SEC will act immediately to approve the 10 pending spot bitcoin ETF applications.\n\nThe situation is frustrating for everyone. Everyone except SEC Chair Gary Gensler seems to understand that a spot bitcoin ETF would be in investors’ best interests, and greatly enhance consumer safety and protection against fraud.\n\nETFs are deservedly the most popular investment vehicle in the world; they feature low costs, low account minimums, transparency, liquidity, and ease of portfolio management.\n\nIt’s easy for advisors to engage in portfolio rebalancing, dollar cost averaging and tax loss harvesting.\n\nAccess to virtually every other asset class is available through ETFs — and there are even inverse, 3x and single-stock ETFs. So why not a bitcoin ETF?\n\nGensler’s refusal has raised everyone’s ire. Four members of Congress — two Republicans and two Democrats — wrote to the SEC in late September demanding that it approve these ETFs immediately."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTcvYml0Y29pbi1iZWF0cy1yZXN0LW9mLWNyeXB0by1tYXJrZXQtYXMtZXRoZXItZGVmaS10b2tlbnMtc3RydWdnbGUv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMC8xNy9iaXRjb2luLWJlYXRzLXJlc3Qtb2YtY3J5cHRvLW1hcmtldC1hcy1ldGhlci1kZWZpLXRva2Vucy1zdHJ1Z2dsZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Beats Rest of Crypto Market as Ether, DeFi Tokens Struggle - CoinDesk",
        "content": "\"Crypto is much less risky today than at any time over the past two years,\" ByteTree analysts said in a Monday market report. \"But, with halving close at hand, we sense bitcoin still has the upper hand for a while longer.\""
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMikgFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMC8xOC9iaXRjb2luLWZpbmFuY2lhbC1zZXJ2aWNlcy1maXJtLXVuY2hhaW5lZC1sb29rcy10by1hdHRyYWN0LXdlYWx0aHktY2xpZW50cy13aXRoLW5ldy1hZHZpc29yeS1zZXJ2aWNlL9IBlgFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8xMC8xOC9iaXRjb2luLWZpbmFuY2lhbC1zZXJ2aWNlcy1maXJtLXVuY2hhaW5lZC1sb29rcy10by1hdHRyYWN0LXdlYWx0aHktY2xpZW50cy13aXRoLW5ldy1hZHZpc29yeS1zZXJ2aWNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Financial Services Firm Unchained Looks to Attract Wealthy Clients With New Advisory Service - CoinDesk",
        "content": "In attempting to attract the deep pockets of HNWIs and other institutional investors, crypto firms are looking to craft offerings providing services that they would expect in traditional finance, advisory being one of them."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTE4L25vdm9ncmF0ei1zYXlzLWJpdGNvaW4tZXRmLXdpbGwtYmUtYXBwcm92ZWQtdGhpcy15ZWFyLWJ5LXRoZS1zZWPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Novogratz Says Bitcoin ETF Will Be Approved This Year by the SEC - Bloomberg",
        "content": "Michael Novogratz says he expects the US Securities and Exchange Commission will finally approve exchange-traded funds that invest directly in Bitcoin this year.\n\n“It’s gonna get approved,” Novogratz, the founder and chief executive officer of Galaxy Digital Holdings Ltd., said during an interview on CNBC. “We actually think it’s gonna happen in 2023.”"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTgvYml0Y29pbi1ob2xkcy0yOGstYXMtc3RvY2tzLWJ1Y2tsZS11bmRlci1pbnRlcmVzdC1yYXRlLWNvbmNlcm5zL9IBcGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTgvYml0Y29pbi1ob2xkcy0yOGstYXMtc3RvY2tzLWJ1Y2tsZS11bmRlci1pbnRlcmVzdC1yYXRlLWNvbmNlcm5zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Holds $28K as Stocks Buckle Under Interest Rate Concerns - CoinDesk",
        "content": "Socking the stock market indices is a new leg up in interest rates. The U.S. 30-year Treasury bond yield is higher by nine basis points to 5.02%. Should that level hold, it would be the first close above 5% for the long bond since the summer of 2007. The 10-year Treasury note yield is up seven basis points to 4.905%, also the highest yield since that summer."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEwLzE4L2V0aGVyLWNvdWxkLWNvbnRpbnVlLXRvLXVuZGVycGVyZm9ybS1iaXRjb2luLWFzLXVzLWJvbmQtbWFya2V0LWRpcy1pbnZlcnNpb24tcmVzdW1lcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) May Triumph Ether (ETH) Investments as U.S. Bonds Recover - CoinDesk",
        "content": "The spread between the 10- and two-year notes, another widely followed bond market gauge, has also dis-inverted by nearly 70 basis points to -0.34% in three months, raising the risk of broad-based risk aversion in financial markets."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctaGlnaC1jYW4tYml0Y29pbi1wcmljZS1nby0yMDI00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "How high can Bitcoin price go by 2024? - Cointelegraph",
        "content": "Bitcoin (BTC) is up over 70% so far in 2023, helped by a banking crisis and hopes about a spot BTC exchange-traded fund (ETF) approval in the United States.\n\nBTC/USD daily price chart. Source: TradingView\n\nSo, will Bitcoin price continue to climb for the rest of 2023? Cointelegraph takes a look at its chances and possible BTC price targets.\n\nRelated: BTC price models hint at $130K target after 2024 Bitcoin halving\n\n2020 Bitcoin price fractal eyes $50K\n\nBitcoin’s ongoing market trend looks very similar to its price action during the 2017 to 2020 period. Therefore, it can repeat a key breakout moment (the greened area) for a decisive bull run, argues popular BTC analyst Stockmoney Lizards.\n\nBTC/USD price performance comparison between 2020 and 2023. Source: TradingView/Stockmoney Lizards\n\nThe 2020 breakout preceded a Bitcoin bull run to its record high of $69,000 in November 2021. If a similar breakout occurs, the analyst sees BTC’s price climbing to the $45,000-$50,000 range by year’s end.\n\nUnlike Bitcoin’s 2020 price rally, however, Bitcoin is currently facing headwinds from the United States Federal Reserve's tightening, resulting in lower liquidity in the market.\n\nBitcoin's price is down 40% since April 2022 when the Federal Reserve's balance sheet reached its peak.\n\nStandard Chartered also sees Bitcoin at $50K\n\nStandard Chartered also predicts Bitcoin will reach $50,000 by the year's end.\n\nGeoff Kendrick, the global head of research and chief strategist at Standard Chartered, argues that increased miners’ profitability will reduce their need to sell BTC, leading to a lower supply against potential rising demand.\n\n“Increased miner profitability per BTC (Bitcoin) mined means they can sell less while maintaining cash inflows, reducing net BTC supply and pushing BTC prices higher,” Kendrick stated in a report.\n\nInterestingly, the number of Bitcoin held by miners surged during the Ordinals hype in May 2023, stabilizing since.\n\nBitcoin miner reserves in 2023. Source: CryptoQuant\n\nBitcoin price technical pattern hints at $32,000\n\nMeanwhile, one Bitcoin technical setup puts its year-end target near $32,000, also a recent price peak.\n\nNotably, BTC has entered the breakout stage of its prevailing bump-and-run reversal (BARR) Bottom pattern. The BARR Bottom pattern typically resolves after the price breaks above its descending trendline resistance and rises by as much as the pattern’s maximum height, as shown below.\n\nBTC/USD daily price chart ft. BARR breakout setup. Source: TradingView\n\nThe same BARR Bottom pattern played out accurately in Dogecoin’s case in June 2022. BTC price will be up another 12.75% by the end of 2023 if this pattern plays out as intended.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWFtc3RlcmRhbS1idGMtc2hpbmVzLWR1cmluZy1jcnlwdG8tYmVhci1tYXJrZXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Amsterdam: BTC shines in depths of crypto bear market - Cointelegraph",
        "content": "The Bitcoin (BTC) value proposition continues to be a source of confidence for investors and proponents amid prevailing depressed market conditions in the broader cryptocurrency space.\n\nThis was a key takeaway from in-depth interviews with Bitcoin developers, advocates, analysts and influential figures during the Bitcoin Amsterdam 2023 conference.\n\nJameson Lopp, co-founder and CTO of Bitcoin custody firm Casa, provides food for thought with less than a year to go before Bitcoin’s next mining reward halving. In a conversation with Cointelegraph, the Bitcoin advocate and software engineer said BTC’s value proposition has been a stronghold through months of tough market conditions:\n\n“During the bear market, so many people have lost money on all these other tokens. Once again, Bitcoin is shining as the safer asset.”\n\nDylan LeClair is another prominent voice in the Bitcoin space who continues to advocate the fundamentals of the asset amid an unprecedented economic landscape in the United States. The Bitcoin analyst tells Cointelegraph that the average investor continues to “passively plow” into a basket of government bonds and U.S. companies in the hopes of making money over the long term.\n\nRelated: Bitcoin Amsterdam: Focus on BTC fundamentals, says Edward Snowden\n\nLeClair admits that while no analyst can guarantee returns on investments in any one asset or vehicle, there is an increasingly strong argument for the long-term potential of Bitcoin:\n\n“Nothing is guaranteed, but its fundamentals suggest that in a very long time frame, you’re going to be securing a very good store of value. Like how people used to buy property or buy gold, whereas it has digital characteristics.”\n\nThe analyst adds that Bitcoin continues to be a means for citizens of countries facing hyperinflation to safeguard and control their wealth:\n\n“The people using Bitcoin — the true adopters — have more conviction than ever, and it’s more widespread than ever. People in third-world countries are using Bitcoin not because it’s fashionable or hyped. It’s because they’re using it to save them from losing everything.”\n\nCointelegraph journalist Joe Hall (right) hosts a panel featuring Rene Pickhardt and Jimmy Song during Bitcoin Amsterdam 2023. Source: Cointelegraph\n\nMeanwhile, Bitcoin developer and educator Jimmy Song tells Cointelegraph that altcoins have detracted from the transformational potential of Bitcoin by “muddying the waters between centralization and decentralization:”\n\n“We’re seeing how a lot of people think that Sam Bankman-Fried is somehow the CEO of Bitcoin — it’s just dirtying Bitcoin’s good name.”\n\nSong also suggests that various cryptocurrency projects have co-opted Bitcoin’s reputation for their own gain, which has left unsuspecting investors the ultimate losers:\n\n“People get confused, they get screwed out of it, and then they swear off crypto forever or something like that, not having ever understood anything about it.”\n\nPrince Filip Karađorđević of Serbia spoke to Cointelegraph just before hosting a one-on-one with President Miguel Albuquerque of Madeira. The autonomous Portuguese archipelago is set to launch a Bitcoin business hub as a means to drive the adoption of the cryptocurrency.\n\nKarađorđević has become a Bitcoin advocate in recent years and now works for Jan3, a Bitcoin firm founded by Samson Mow looking to drive nation-state use of BTC. Conversations centered around the potential of Bitcoin highlighted how the digital asset has different value propositions for developed, developing and first-world economies.\n\n“In developing countries, you’ll see much more adoption there — countries that really have double and triple-digit inflation, your Lebanon’s, Nigeria’s, Argentina’s.”\n\nMeanwhile, developed nations like the United States, the United Kingdom, France and Switzerland will see varying degrees of adoption dependent on regulation and education.\n\nNSA whistleblower Edward Snowden stressed the importance of Bitcoin in combatting tyranny and governmental overreach while providing individual sovereignty of wealth during a virtual address at the conference.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: ‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtaG9sZHMtZ2FpbnMtYml0Y29pbi0yOGstc3VwcG9ydNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "BTC price holds 6% gains as Bitcoin battles for 'crucial' $28K support - Cointelegraph",
        "content": "Bitcoin (BTC) passing $28,000 hints at bullish sentiment, but reclaiming it for good is essential, analysis says.\n\nIn an X (formerly Twitter) post on Oct. 17, Yann Allemann and Jan Happel, co-founders of on-chain analytics firm Glassnode, described the $28,000 mark as a “critical milestone” for the BTC price.\n\nGlassnode: “Keep an eye out” for $28,000\n\nAfter snap volatility, which caused Bitcoin to hit $30,000 for the first time since August, the largest cryptocurrency has managed to preserve some of its gains.\n\nAt the time of writing, BTC/USD is circling $28,500, per data from Cointelegraph Markets Pro and TradingView — still up around 6% since the weekly open.\n\nFor Allemann and Happel, the pair is now at a defining crossroads.\n\n“The crypto market is hinged on BTC’s ability to breach and consistently maintain a value north of $28k,” part of their commentary stated.\n\n$28,000 has formed a battleground ever since Bitcoin first crossed it in early 2021, and liquidity has traditionally surrounded it as bulls and bears fight to secure control over long-term trajectory.\n\nData from the trading suite DecenTrader, among others, confirms that the status quo remains despite recent BTC price moves, with $28,000 lying in a zone between major longs and shorts of varying leverage.\n\nBitcoin liquidity data. Source: DecenTrader\n\n“While this pivotal milestone was momentarily attained on futures, the spot market price peaked at $27.98k earlier today. It’s evident just how crucial this price point is in the larger scheme,” Allemann and Happel added.\n\n“The rapid movements and these price thresholds aren’t just numbers. They signify investor sentiment, market dynamics. Keep an eye out for the 28k level.”\n\nBTC/USD 1-day chart. Source: TradingView\n\nRoad to Bitcoin halving contested\n\nAs Cointelegraph reported, predictions over what the future will bring for Bitcoin both before and after its next block subsidy halving in April 2024 differ considerably.\n\nRelated: Mining BTC is harder than ever — 5 things to know in Bitcoin this week\n\nIn an interview last month, DecenTrader co-founder Filbfilb eyed BTC price galvanizing itself for upside during Q4, possibly reaching $46,000 by the halving.\n\nSome well-known market participants, however, remain risk-averse. Among them, popular trader Crypto Tony and others are betting on a pre-halving return to $20,000 for a final local bottom.\n\n“Many can scream they are long right now and caught that move, but if your not taking profit here at resistance your doing something wrong,” he told X subscribers about the recent surge.\n\n“I personally will not be long unless we flip that $28,500 level into support.”\n\nBTC/USD annotated chart. Source: Crypto Tony/X\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiwAFodHRwczovL3d3dy5jb3JzaWNhbmFkYWlseXN1bi5jb20vb3Bpbmlvbi9sZXR0ZXJzX3RvX3RoZV9lZGl0b3IvYWN0aXZpc3RzLWNhbGwtb3V0LXRoZS13b3JsZHMtbGFyZ2VzdC1iaXRjb2luLXBvbGx1dGVyLWluLXRleGFzLXdlZWstb2YtYWN0aW9uL2FydGljbGVfYTY5ODYxNTQtNmQxMi0xMWVlLWI5OGQtMzc1YjBhMDI5MmYxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Activists call out the world's largest bitcoin polluter in Texas Week of Action - Corsicana Daily Sun",
        "content": "Corsicana, TX (75110)\n\nToday\n\nCloudy early, then thunderstorms developing this afternoon. High 82F. Winds S at 10 to 20 mph. Chance of rain 80%..\n\nTonight\n\nThunderstorms likely. A few storms may be severe. Low 62F. S winds shifting to N at 10 to 15 mph. Chance of rain 80%."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtbW9kZWxzLTEzMGstdGFyZ2V0LTAyNC1iaXRjb2luLWhhbHZpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "BTC price models hint at $130K target after 2024 Bitcoin halving - Cointelegraph",
        "content": "Bitcoin (BTC) is destined to hit $128,000 or more by the end of 2025, multiple analytics models suggest.\n\nUploading his latest BTC price estimates to X (formerly Twitter) on Oct. 17, popular trader and analyst CryptoCon deduced a two-year target of around $130,000.\n\nMultiple BTC price forecasts converge on $130,000 in 2025\n\nBitcoin market participants are diverging over how BTC price behavior will respond to next year’s block subsidy halving, but for CryptoCon, the long-term roadmap is looking firmly bullish.\n\nIn an update for various models charting both Bitcoin price cycles and their highs and lows, the analyst reiterated that the area around $130,000 was fast becoming a magnet.\n\n“I’ve been doing a lot of Bitcoin cycle top experiments lately, and I keep seeing right around the same price... 130k,” he summarized.\n\nAn accompanying chart highlighted so-called “early” tops in each price cycle, along with the actual cycle top constituting a new all-time high.\n\nThe early tops, on average, occur three weeks on either side of July 9, CryptoCon explained. The new all-time highs come three weeks on either side of Nov. 28 — already a popular phenomenon that Cointelegraph reported on last month.\n\nThe timing for these events comes from plotting simple diagonal trendlines from the first early top.\n\n“Doing this has found the the price of the last two cycle tops exactly, and with our trend from last cycle, gives us a price of about 138k,” the X post continued.\n\n“I am prepared for lower prices, but the stars are aligning at 130k for Bitcoin this cycle!”\n\nBTC price model data. Source: CryptoCon/X\n\nPer model timing, 2025 should be the year that the next cycle top occurs, just under twice the current record set in 2021.\n\n“History favors the bears”\n\nFour-year halving cycles, meanwhile, form a guide for many well-known Bitcoin market commentators.\n\nRelated: Mining BTC is harder than ever — 5 things to know in Bitcoin this week\n\nAmong them is popular trader and analyst Rekt Capital, who continues to stress that the prehalving year 2023 could bring about some new local lows before the bull market attains full force.\n\n#BTC\n\n\n\n5 Phases of The Bitcoin Halving\n\n\n\n1. Pre-Halving period\n\n\n\nIf a deeper retrace is going to occur, it will likely be over the next 140 days or so (orange)\n\n\n\nIn fact, $BTC retraced -24% in 2015 and -38% in 2019 at this same point in the cycle (i.e. ~200 days before the Halving)… pic.twitter.com/r1dAWBJXyw — Rekt Capital (@rektcapital) October 6, 2023\n\nPreviously, he warned that the $32,000 highs seen earlier this year could end up printing a double-top structure, helping fuel a protracted BTC price downturn next.\n\n“At this same point in the cycle (~180 days before the Halving)… BTC retraced -25% in 2015/2016 and -38% in 2019,” one of his latest X posts reads.\n\n“Only question is: does history repeat? Or does 2023 generate something completely different? I’m a Macro Bull but history favours Bears.”\n\nRekt Capital added that any new lows “should be treated as an opportunity for re-accumulation.”\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctYnVsbGlzaC1pcy1iaXRjb2luLWhhbHZpbmctZm9yLWJ0Yy1wcmljZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Just how bullish is the Bitcoin halving for BTC price? Experts debate - Cointelegraph",
        "content": "A recent panel at the Swan Pacific Bitcoin Festival was cleverly titled “Are halving price cycles bullshit?” Throughout the discussion, the host and founder of The Bitcoin Layer, Nik Bhatia, asked Marathon Digital CEO Fred Thiel, Swan chief investment officer Ralph Zagury and Swan product manager Andy Edstrom to share their thoughts on whether the Bitcoin halving is truly a bullish event or just another narrative that novice investors buy into.\n\nWhile the panel’s headline might be off-putting for some, the inquiry is of great interest to all manner of Bitcoin (BTC) and cryptocurrency investors. The conventional belief held by many in the space is that the Bitcoin supply halving is a bullish phenomenon that, when complete, is followed by near-parabolic upside in BTC’s price.\n\nGo and ask any Bitcoin lover about what they’re most excited about in the next year, and if they don’t mention the chance for a spot Bitcoin exchange-traded fund approval first, they’re probably going to say the upcoming halving event.\n\nPrevious Bitcoin halving events have coincided with bull markets ramping up.\n\n\n\nBut will the macro conditions be ripe for that next year in May?\n\n\n\n~ If we are past the initial shock of a recession.\n\n~ If a spot BTC ETF is approved.\n\n~ If QE is back on the menu.\n\n\n\nThen the planets will… pic.twitter.com/g5dEEKiSMF — ecoinometrics (@ecoinometrics) September 6, 2023\n\nWhile previous performance does provide some compelling evidence for what might happen in the next halving, questioning long-held assertions and price expectations for a high-volatility asset like Bitcoin is probably something every investor should do more often — especially when considering the number of bearish events that have occurred in the past two years.\n\nTo start the discussion, host Bhatia jumped right in by asking whether the halving is the main driver of the Bitcoin price.\n\nThiel quickly responded with:\n\n“In this cycle, no, I think it’s liquidity.”\n\nZagury agreed, adding that “flow is really what drives the market, so the halving, by definition, there’s nothing on it that should impact price.” Interestingly, Edstrom took a different position:\n\n“I think the halving is still bullish, and we can debate what the magnitude of that effect is. But yeah, I think it still matters for price.”\n\nEach panelist, including host Bhatia, seemed to agree that, while the halving may possess some market-moving capacity, it could be diminishing over time. According to Bhatia:\n\n“The halving affects supply. It is less and less material as time goes on, and it does nothing to affect demand. But from a psychological perspective, we might be able to play devil’s advocate.”\n\nHalving hype and hopium is all in investors’ heads\n\nPanelists at the “Are halving price cycles bullshit?” panel. Source: Swan Bitcoin YouTube\n\nSpeculation is essentially at the root of all investing, and while Zagury and Thiel are of the mind that investors attribute more hope than fact to the forecast impact of the Bitcoin halving, Edstrom sees the event as the manifestation of a “psychological feedback loop coming into the demand side.”\n\n“We think that Bitcoin price is going to be higher in the future, and by extension, we are applying a lens of investment as we’re investing in Bitcoin.”\n\nAnother popular, yearslong-held belief by many investors is the role derivatives play in Bitcoin’s price discovery. Bhatia asked whether derivatives played a larger role than spot trading in impacting Bitcoin’s price action, and Zagury said:\n\n“The reality is that the data points we have, in terms of halving, are not enough to come to any conclusion. If you look historically at Bitcoin price, we’ve got the whole data set of price, and you try to find patterns of distribution of how returns actually work. Very quickly, you see that there’s a lot of outer correlation, which means that price depends on time and also past performance.”\n\nAccording to Zagury, “A thing about Bitcoin, which is super curious — and I think there isn’t any other asset class like this out there — is that most of the time, Bitcoin is moving either sideways, in terms of number of days, it’s either sideways or down.”\n\nRelated: BTC price models hint at $130K target after 2024 Bitcoin halving\n\nBitcoin’s time spent trading in a rangebound band or in a downtrend is what Zagury said “makes it really hard to hodl, right, because it means you’re going to have months and years of pain, and you’re going to have days of glory.”\n\n“Being a hodler by definition, by distribution of prices that you see historically, it’s extremely hard.”\n\nPeddling back to the initial question about the role derivatives play in Bitcoin price discovery, Zagury said:\n\n“When we talk about derivatives, the first thing you’re going to talk about is probability. It’s impossible to conclude what is really going to happen with Bitcoin price. That’s the first thing that you conclude by looking at historical returns. Going back to the halving, the fact that it actually outer correlates a lot, sometimes, in particular times of low liquidity. A small move that bumps the price up, the marginal seller out there will go through the short-term sellers, and then the price will jump up significantly. This explains why price moves up very, very quickly.”\n\nLiquidity will be the focal point\n\nDespite discounting the impact of Bitcoin supply halvings on BTC’s price, each panelist expressed their positive, longer-term bullish perspectives on Bitcoin’s value.\n\nWith liquidity being the agreed-upon future price catalyst for Bitcoin, Zagury said:\n\n“I’m very bullish. I think we are going to see that soon because liquidity has been drawing down, and we see that these things are starting to happen, and it’s not going to take a lot for us to see a very big move.”\n\nWhen asked when and how this all-important liquidity comes back, Edstrom hinted that 10-year United States Treasurys pushing above 5%, the potential regional bank failures that mirror the ones seen six months ago, and the rising number of banks holding long-duration government debt at a loss are all signs that a Federal Reserve pivot returning to quantitative easing could occur sooner than later.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LnNpbXBsaWxlYXJuLmNvbS90dXRvcmlhbHMvYmxvY2tjaGFpbi10dXRvcmlhbC9ibG9ja2NoYWluLXRlY2hub2xvZ3nSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "What is Blockchain Technology? How Does Blockchain Work? [Updated] - Simplilearn",
        "content": "Reviewed and fact-checked by Sayantoni Das\n\nOver the past few years, you have consistently heard the term ‘blockchain technology,’ probably regarding cryptocurrencies, like Bitcoin. In fact, you may be asking yourself, “what is blockchain technology?” It seems like blockchain is a platitude but in a hypothetical sense, as there is no real meaning that the layman can understand easily. It is imperative to answer “what is blockchain technology, “including the technology that is used, how it works, and how it’s becoming vital in the digital world.\n\nAs blockchain continues to grow and become more user-friendly, the onus is on you to learn this evolving technology to prepare for the future. If you are new to blockchain, then this is the right platform to gain solid foundational knowledge. In this article, you learn how to answer the question, “what is blockchain technology?” You’ll also learn how blockchain works, why it’s important, and how you can use this field to advance your career.\n\nWhat Is Blockchain Technology?\n\nBlockchain is a method of recording information that makes it impossible or difficult for the system to be changed, hacked, or manipulated. A blockchain is a distributed ledger that duplicates and distributes transactions across the network of computers participating in the blockchain.\n\nBlockchain technology is a structure that stores transactional records, also known as the block, of the public in several databases, known as the “chain,” in a network connected through peer-to-peer nodes. Typically, this storage is referred to as a ‘digital ledger.’\n\nEvery transaction in this ledger is authorized by the digital signature of the owner, which authenticates the transaction and safeguards it from tampering. Hence, the information the digital ledger contains is highly secure.\n\nIn simpler words, the digital ledger is like a Google spreadsheet shared among numerous computers in a network, in which, the transactional records are stored based on actual purchases. The fascinating angle is that anybody can see the data, but they can’t corrupt it.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nDive into the transformative world of blockchain technology with our intensive Cyber security Bootcamp. Uncover the revolutionary potential of blockchain while honing your skills in safeguarding these decentralized systems. From understanding the intricacies of smart contracts to fortifying digital transactions, this bootcamp equips you to navigate the evolving landscape of cybersecurity within the blockchain domain. Don't miss this opportunity to become a proficient cybersecurity professional in the realm of blockchain.\n\nWhy is Blockchain Popular?\n\nSuppose you are transferring money to your family or friends from your bank account. You would log in to online banking and transfer the amount to the other person using their account number. When the transaction is done, your bank updates the transaction records. It seems simple enough, right? There is a potential issue which most of us neglect.\n\nThese types of transactions can be tampered with very quickly. People who are familiar with this truth are often wary of using these types of transactions, hence the evolution of third-party payment applications in recent years. But this vulnerability is essentially why Blockchain technology was created.\n\nTechnologically, Blockchain is a digital ledger that is gaining a lot of attention and traction recently. But why has it become so popular? Well, let’s dig into it to fathom the whole concept.\n\nRecord keeping of data and transactions are a crucial part of the business. Often, this information is handled in house or passed through a third party like brokers, bankers, or lawyers increasing time, cost, or both on the business. Fortunately, Blockchain avoids this long process and facilitates the faster movement of the transaction, thereby saving both time and money.\n\nMost people assume Blockchain and Bitcoin can be used interchangeably, but in reality, that’s not the case. Blockchain is the technology capable of supporting various applications related to multiple industries like finance, supply chain, manufacturing, etc., but Bitcoin is a currency that relies on Blockchain technology to be secure.\n\nBlockchain is an emerging technology with many advantages in an increasingly digital world:\n\nHighly Secure It uses a digital signature feature to conduct fraud-free transactions making it impossible to corrupt or change the data of an individual by the other users without a specific digital signature.\n\nIt uses a digital signature feature to conduct fraud-free transactions making it impossible to corrupt or change the data of an individual by the other users without a specific digital signature. Decentralized System Conventionally, you need the approval of regulatory authorities like a government or bank for transactions; however, with Blockchain, transactions are done with the mutual consensus of users resulting in smoother, safer, and faster transactions.\n\nConventionally, you need the approval of regulatory authorities like a government or bank for transactions; however, with Blockchain, transactions are done with the mutual consensus of users resulting in smoother, safer, and faster transactions. Automation Capability It is programmable and can generate systematic actions, events, and payments automatically when the criteria of the trigger are met.\n\nStructure and Design of Blockchain\n\nA blockchain is a distributed, immutable, and decentralized ledger at its core that consists of a chain of blocks and each block contains a set of data. The blocks are linked together using cryptographic techniques and form a chronological chain of information. The structure of a blockchain is designed to ensure the security of data through its consensus mechanism which has a network of nodes that agree on the validity of transactions before adding them to the blockchain.\n\nBlocks:\n\nA block in a blockchain is a combination of three main components:\n\n1. The header contains metadata such as a timestamp which has a random number used in the mining process and the previous block's hash.\n\n2. The data section contains the main and actual information like transactions and smart contracts which are stored in the block.\n\n3. Lastly, the hash is a unique cryptographic value that works as a representative of the entire block which is used for verification purposes.\n\nBlock Time:\n\nBlock time refers to the time taken to generate a new block in a blockchain. Different blockchains have different block times, which can vary from a few seconds to minutes or may be in hours too. Shorter block times can give faster transaction confirmations but the result has higher chances of conflicts but the longer block times may increase the timing for transaction confirmations but reduce the chances of conflicts.\n\nHard Forks:\n\nA hard fork in a blockchain refers to a permanent divergence in the blockchain's history that results in two separate chains. It can happen due to a fundamental change in the protocol of a blockchain and all nodes do not agree on the update. Hard forks can create new cryptocurrencies or the splitting of existing ones and It requires consensus among the network participants to resolve.\n\nDecentralization:\n\nDecentralization is the key feature of blockchain technology. In a decentralized blockchain, there is no single central authority that can control the network. In decentralization,the decision-making power is distributed among a network of nodes that collectively validate and agree on the transactions to be added to the blockchain. This decentralized nature of blockchain technology helps to promote transparency, trust, and security. It also reduces the risk to rely on a single point of failure and minimizes the risks of data manipulation.\n\nFinality:\n\nFinality refers to the irreversible confirmation of transactions in a blockchain. If and when a transaction is added to a block and the block is confirmed by the network, it becomes immutable and cannot be reversed. This feature ensures the integrity of the data and prevents double spending, providing a high level of security and trust in Blockchain Types & Sustainability\n\nOpenness:\n\nOpenness in blockchain technology makes the blockchain accessible to anyone who intends to participate in the network. This implies that it is open for all and anyone can join the network, validate transactions, and can add new blocks to the blockchain, so long as they know the consensus rules. Openness promotes inclusivity, transparency, and innovation, as it allows for participation from various stakeholders.\n\nPublic Blockchain:\n\nIt is a kind of blockchain which is open for the public and allows everyone to join the network to perform transactions and to participate in the consensus process. Public blockchains are transparent, because all transactions are publicly recorded.\n\nHow Does Blockchain Technology Work?\n\nIn recent years, you may have noticed many businesses around the world integrating Blockchain technology. But how exactly does Blockchain technology work? Is this a significant change or a simple addition? The advancements of Blockchain are still young and have the potential to be revolutionary in the future; so, let’s begin demystifying this technology.\n\nBlockchain is a combination of three leading technologies:\n\nCryptographic keys A peer-to-peer network containing a shared ledger A means of computing, to store the transactions and records of the network\n\nCryptography keys consist of two keys – Private key and Public key. These keys help in performing successful transactions between two parties. Each individual has these two keys, which they use to produce a secure digital identity reference. This secured identity is the most important aspect of Blockchain technology. In the world of cryptocurrency, this identity is referred to as ‘digital signature’ and is used for authorizing and controlling transactions.\n\nThe digital signature is merged with the peer-to-peer network; a large number of individuals who act as authorities use the digital signature in order to reach a consensus on transactions, among other issues. When they authorize a deal, it is certified by a mathematical verification, which results in a successful secured transaction between the two network-connected parties. So to sum it up, Blockchain users employ cryptography keys to perform different types of digital interactions over the peer-to-peer network.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nTypes of Blockchain\n\nThere are different types of blockchains. They are as follows:\n\nPrivate Blockchain Networks\n\nPrivate blockchains operate on closed networks, and tend to work well for private businesses and organizations. Companies can use private blockchains to customize their accessibility and authorization preferences, parameters to the network, and other important security options. Only one authority manages a private blockchain network.\n\nPublic Blockchain Networks\n\nBitcoin and other cryptocurrencies originated from public blockchains, which also played a role in popularizing distributed ledger technology (DLT). Public blockchains also help to eliminate certain challenges and issues, such as security flaws and centralization. With DLT, data is distributed across a peer-to-peer network, rather than being stored in a single location. A consensus algorithm is used for verifying information authenticity; proof of stake (PoS) and proof of work (PoW) are two frequently used consensus methods.\n\nPermissioned Blockchain Networks\n\nAlso sometimes known as hybrid blockchains, permissioned blockchain networks are private blockchains that allow special access for authorized individuals. Organizations typically set up these types of blockchains to get the best of both worlds, and it enables better structure when assigning who can participate in the network and in what transactions.\n\nConsortium Blockchains\n\nSimilar to permissioned blockchains, consortium blockchains have both public and private components, except multiple organizations will manage a single consortium blockchain network. Although these types of blockchains can initially be more complex to set up, once they are running, they can offer better security. Additionally, consortium blockchains are optimal for collaboration with multiple organizations.\n\nHybrid Blockchains\n\nHybrid blockchains are the combination of both public and private blockchains. In a hybrid blockchain, some parts of the blockchain are public and transparent, while others are private and accessible only to authorized and specific participants. This makes hybrid blockchains ideal for use in those cases where a balance is required between transparency and privacy. For example, in supply chain management multiple parties can access certain information, but sensitive data can be kept private.\n\nSidechains\n\nSidechains are different blockchains that run parallel to the main blockchain, allowing for additional functionality and scalability. Sidechains enable developers to experiment with new features and applications without affecting the main blockchain's integrity. For example, sidechains can be used for creating decentralized applications and to implement specific consensus mechanisms. Sidechains can also be used to handle transactions of the main blockchain to reduce congestion and increase scalability.\n\nBlockchain Layers\n\nBlockchain layers refer to the concept of building multiple layers of blockchains on top of each other. Each layer can have its own consensus mechanism, rules, and functionality which can interact with other layers. This ensures greater scalability, as transactions can be processed in parallel across different layers. For example, the Lightning Network, built on top of the Bitcoin blockchain, is a second layer solution that enables faster and cheaper transactions by creating payment channels between users.\n\nThe Process of Transaction\n\nOne of Blockchain technology’s cardinal features is the way it confirms and authorizes transactions. For example, if two individuals wish to perform a transaction with a private and public key, respectively, the first person party would attach the transaction information to the public key of the second party. This total information is gathered together into a block.\n\nThe block contains a digital signature, a timestamp, and other important, relevant information. It should be noted that the block doesn’t include the identities of the individuals involved in the transaction. This block is then transmitted across all of the network's nodes, and when the right individual uses his private key and matches it with the block, the transaction gets completed successfully.\n\nIn addition to conducting financial transactions, the Blockchain can also hold transactional details of properties, vehicles, etc.\n\nHere’s a use case that illustrates how Blockchain works:\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program Hash Encryptions blockchain technology uses hashing and encryption to secure the data, relying mainly on the SHA256 algorithm to secure the information. The address of the sender (public key), the receiver’s address, the transaction, and his/her private key details are transmitted via the SHA256 algorithm. The encrypted information, called hash encryption, is transmitted across the world and added to the blockchain after verification. The SHA256 algorithm makes it almost impossible to hack the hash encryption, which in turn simplifies the sender and receiver’s authentication.\n\nblockchain technology uses hashing and encryption to secure the data, relying mainly on the SHA256 algorithm to secure the information. The address of the sender (public key), the receiver’s address, the transaction, and his/her private key details are transmitted via the SHA256 algorithm. The encrypted information, called hash encryption, is transmitted across the world and added to the blockchain after verification. The SHA256 algorithm makes it almost impossible to hack the hash encryption, which in turn simplifies the sender and receiver’s authentication. Proof of Work In a Blockchain, each block consists of 4 main headers. Previous Hash: This hash address locates the previous block. Transaction Details: Details of all the transactions that need to occur. Nonce: An arbitrary number given in cryptography to differentiate the block’s hash address. Hash Address of the Block: All of the above (i.e., preceding hash, transaction details, and nonce) are transmitted through a hashing algorithm. This gives an output containing a 256-bit, 64 character length value, which is called the unique ‘hash address.’ Consequently, it is referred to as the hash of the block. Numerous people around the world try to figure out the right hash value to meet a pre-determined condition using computational algorithms. The transaction completes when the predetermined condition is met. To put it more plainly, Blockchain miners attempt to solve a mathematical puzzle, which is referred to as a proof of work problem. Whoever solves it first gets a reward.\n\nIn a Blockchain, each block consists of 4 main headers.\n\nMining In Blockchain technology, the process of adding transactional details to the present digital/public ledger is called ‘mining.’ Though the term is associated with Bitcoin, it is used to refer to other Blockchain technologies as well. Mining involves generating the hash of a block transaction, which is tough to forge, thereby ensuring the safety of the entire Blockchain without needing a central system.\n\nHistory of Blockchain\n\nSatoshi Nakamoto, whose real identity still remains unknown to date, first introduced the concept of blockchains in 2008. The design continued to improve and evolve, with Nakamoto using a Hashcash-like method. It eventually became a primary component of bitcoin, a popular form of cryptocurrency, where it serves as a public ledger for all network transactions. Bitcoin blockchain file sizes, which contained all transactions and records on the network, continued to grow substantially. By August 2014, it had reached 20 gigabytes, and eventually exceeded 200 gigabytes by early 2020.\n\nAdvantages and Disadvantages of Blockchain\n\nLike all forms of technology, blockchain has several advantages and disadvantages to consider.\n\nAdvantages\n\nOne major advantage of blockchains is the level of security it can provide, and this also means that blockchains can protect and secure sensitive data from online transactions. For anyone looking for speedy and convenient transactions, blockchain technology offers this as well. In fact, it only takes a few minutes, whereas other transaction methods can take several days to complete. There is also no third-party interference from financial institutions or government organizations, which many users look at as an advantage.\n\nDisadvantages\n\nBlockchain and cryptography involves the use of public and private keys, and reportedly, there have been problems with private keys. If a user loses their private key, they face numerous challenges, making this one disadvantage of blockchains. Another disadvantage is the scalability restrictions, as the number of transactions per node is limited. Because of this, it can take several hours to finish multiple transactions and other tasks. It can also be difficult to change or add information after it is recorded, which is another significant disadvantage of blockchain.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nHow is Blockchain Used?\n\nBlockchains store information on monetary transactions using cryptocurrencies, but they also store other types of information, such as product tracking and other data. For example, food products can be tracked from the moment they are shipped out, all throughout their journey, and up until final delivery. This information can be helpful because if there is a contamination outbreak, the source of the outbreak can be easily traced. This is just one of the many ways that blockchains can store important data for organizations.\n\nHyperledger, Hosted by the Linux Foundation\n\nHyperledger is a global collaboration hosted by The Linux Foundation, including finance, banking, IoT, supply chain, manufacturing, and technology leaders. By creating a cross-industry open standard for distributed ledgers, Hyperledger Fabric allows developers to develop blockchain applications to meet specific needs.\n\nTen Steps to Your First Blockchain Application\n\nUnderstand what Blockchain is and its key components. Understand the purpose of your application. Create a use case for your application. Find out if there's already an existing blockchain for your purpose. Explore the different types of Blockchain platforms available for your application. There are many types of Blockchain, each with its strengths and weaknesses. Choose the right platform for developing your app. Select the consensus algorithm you will use. Learn Solidity - Ethereum's programming language for smart contracts and DApps (decentralized applications). Learn how to use Truffle or Remix - development tools for Ethereum DApps and smart contracts. Get an Ethereum account or wallet and buy some Ether (ETH), the currency of the Ethereum network.\n\nDecentralization\n\nDecentralization is difficult to Understand, but it is vital in the world today; decentralization is distributing or dispersing functions, powers, people, or things away from a central location or authority. Within the business world, decentralization typically refers to delegating authority from senior executives to middle managers and other employees further down the organizational hierarchy. The benefits of devolution are many and varied, but the most commonly cited advantages include improved communication, greater employee empowerment, and increased flexibility and responsiveness.\n\nTransparency\n\nOne of the most critical aspects of decentralization is transparency. All employees have access to information and decision-making processes in a decentralized organization. This transparency fosters a greater sense of trust and cooperation among employees. Furthermore, it allows employees to hold managers accountable for their decisions.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nBitcoin vs. Blockchain\n\nBitcoin is a digital currency that was first introduced in 2009 and has been the most popular and successful cryptocurrency to date. Bitcoin's popularity is attributed to its decentralized nature, which means it doesn't have a central authority or bank controlling its supply. This also means that transactions are anonymous, and no transaction fees are involved when using bitcoin.\n\nBlockchain is a database of transactions that have taken place between two parties, with blocks of data containing information about each transaction being added in chronological order to the chain as it happens. The Blockchain is constantly growing as new blocks are added to it, with records becoming more difficult to change over time due to the number of blocks created after them.\n\nBlockchain vs. Banks\n\nBlockchain has the potential to revolutionize the banking industry. Banks need to be faster to adapt to the changing needs of the digital age, and Blockchain provides a way for them to catch up. By using Blockchain, banks can offer their customers a more secure and efficient way to conduct transactions. In addition, Blockchain can help banks to streamline their operations and reduce costs.\n\nWhy is Blockchain Important?\n\nBlockchain is important because it has the potential to revolutionize the banking industry. Banks need to be faster to adapt to the changing needs of the digital age, and Blockchain provides a way for them to catch up. By using Blockchain, banks can offer their customers a more secure and efficient way to conduct transactions. In addition, Blockchain can help banks to streamline their operations and reduce costs.\n\nWhat is a Blockchain Platform?\n\nA blockchain platform is a shared digital ledger that allows users to record transactions and share information securely, tamper-resistant. A distributed network of computers maintains the register, and each transaction is verified by consensus among the network participants.\n\nProof of Work (PoW) vs. Proof of Stake (PoS)\n\nProof of work (PoW) is an algorithm to create blocks and secure the Blockchain. It requires miners to solve a puzzle to create a block and receive the block reward in return.\n\nProof of stake (PoS) is an alternative algorithm for securing the Blockchain, which does not require mining. Instead, users must lock up some of their coins for a certain time to be eligible for rewards.\n\nEnergy Consumption Concerns of Blockchain\n\nThe main concern with blockchain technology is its energy consumption. Traditional blockchains like Bitcoin and Ethereum, use a consensus mechanism called PoW( Proof of Work), which requires computational power and electricity to solve complex mathematical puzzles. This energy-intensive process has raised concerns about the environmental impact of blockchain technology because it produces carbon emissions and consumes a huge amount of electricity.\n\nBlockchain or Scalability Trilemma: Decentralization, Security, and Scalability\n\nBlockchain is a distributed database that maintains a continuously growing list of records called blocks. Blockchain is often said to have the potential to disrupt many industries, including banking, law, and healthcare.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nWhat are the Benefits of Blockchains Over Traditional Finance?\n\nBlockchain offers several potential advantages over traditional finance. One of the most touted advantages is that Blockchain is decentralized, while traditional finance is centralized. This means there is no single point of failure in a blockchain system. Another advantage of Blockchain is that it is more transparent than traditional finance.\n\nPromising Blockchain Use Cases and Killer Applications\n\nPromising Blockchain Use Cases and Killer Applications: Although there are many potential applications for blockchain technology, there are a few that stand out as having the potential to be truly game-changing. These are often referred to as killer applications. Some of the most promising killer applications for blockchain technology include supply chain management, identity management, and data management.\n\nPromising blockchain use cases and killer applications are being developed every day. The Shiba Inu team is committed to finding and developing the most promising applications for the SHIB community. The team has a proven track record in the cryptocurrency space, and they are committed to creating value for the SHIB community.\n\nHow to Invest in Blockchain Technology\n\nBlockchain technology and stocks can be a lucrative investment, and there are several ways to take the next step toward making your first blockchain investment purchase. Bitcoin is typically the first thing that comes to mind when it comes to investing in blockchain technology, and it shouldn’t be overlooked. Aside from Bitcoin, there is also the option of investing in cryptocurrency penny stocks, such as Altcoin and Litecoin. There are also certain apps and services that are in the pre-development phase and that are using blockchain technology to raise funding. As an investor, you can buy coins, with the expectation that prices will go up if the service or app becomes popular. Another way to invest in blockchain technology is to invest in startups built on blockchain technology. Finally, there is always the option to invest in pure blockchain technology.\n\nTraditional Finance and Blockchain Investment Strategies\n\nIn traditional finance, there are two main investment strategies: active and passive. Active investing involves picking stocks or other assets, and then holding onto them for a long period of time. Passive investing, on the other hand, involves investing in a basket of assets, and then holding onto them for a long period of time. Both of these strategies have their pros and cons, but there is one major difference between them: active investing is much more risky than passive investing.\n\nHow Do Different Industries Use Blockchain?\n\nBlockchain has the potential to streamline processes across many different industries.\n\nIn the supply chain industry, for example, Blockchain can track the movement of goods and materials as they change hands. This would allow for greater transparency and accountability and reduce the risk of fraud.\n\nIn the healthcare industry, Blockchain can be used to secure patient data and streamline the process of billing and claims.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nWhat are the Features of Blockchain Technology?\n\nBlockchain technology is a distributed ledger that is secure, transparent, and immutable.\n\nBlockchain technology can be used to create a decentralized database that is tamper-proof and has the potential to revolutionize the way we interact with the digital world.\n\nBlockchain technology is secure, transparent, and tamper-proof.\n\nWhat are the Key Components of Blockchain Technology?\n\nThere are three key components to blockchain technology:\n\nThe distributed ledger, the consensus mechanism, and the smart contracts.\n\nThe distributed ledger is a database that is spread across a network of computers. The consensus mechanism is what allows the network of computers to agree on the state of the ledger.\n\nThe smart contracts are what allows the blockchain to be used for more than just a database.\n\nWhat are Blockchain Protocols?\n\nThe three most common protocols Bitcoin was the first blockchain protocol and is still the most widely used is:\n\nBitcoin- Bitcoin is a decentralized digital currency, often referred to as a cryptocurrency. It exists on a decentralized network of computers, often called a blockchain, that keeps track of all transactions made using the currency. Bitcoin uses a proof-of-work algorithm to validate transactions and add them to the blockchain. Bitcoin was the first cryptocurrency to be created and is the most well-known.\n\nRipple- Ripple is a cryptocurrency that is similar to Bitcoin. Ripple uses a decentralized network of computers to keep track of all transactions made using the currency. Ripple uses a proof-of-work algorithm to validate transactions and add them to the blockchain. Ripple was created in 2012 and is the second largest cryptocurrency by market capitalization.\n\nEthereum- The Ethereum blockchain was initially described in a white paper by Vitalik Buterin in 2013. Buterin, a programmer who was born in Russia and raised in Canada, had been involved with bitcoin from its early days. He was excited by the technology, but he thought that bitcoin needed a scripting language for application development. He decided to create a new platform that would be more general than bitcoin.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nWhat is the Difference Between a Database and a Blockchain?\n\nSo what is the difference between a database and a blockchain? A database is centralized, meaning that a single entity controls it. This entity can be a company, government, or individual. On the other hand, a blockchain is decentralized, meaning that any entity does not control it.\n\nHow is Blockchain Different From the Cloud?\n\nBlockchain is a new technology that is different from the cloud in several ways:\n\nBlockchain is decentralized, while the cloud is centralized. This means that Blockchain is distributed across a network of computers, while the cloud is stored on a central server.\n\nBlockchain is immutable, meaning that once data is written to the Blockchain, it cannot be changed.\n\nWhat is Blockchain as a Service?\n\nBlockchain as a Service is a cloud-based offering that allows customers to build, host, and use their blockchain applications, smart contracts, and functions on the Azure cloud platform. Azure offers integrated services that make it easy to develop, deploy, and manage blockchain applications. Customers can use Azure's managed services to create and deploy blockchain applications without having to set up and manage their infrastructure.\n\nBasics to Advanced - Learn It All! Caltech PGP Full Stack Development Explore Program\n\nWhat are the Implications of Blockchain Technology?\n\nBlockchain technology has made a great impact on society, including:\n\nBitcoin, Blockchain’s prime application and the whole reason the technology was developed in the first place, has helped many people through financial services such as digital wallets. It has provided microloans and allowed micropayments to people in less than ideal economic circumstances, thereby introducing new life in the world economy.\n\nThe next major impact is in the concept of TRUST, especially within the sphere of international transactions. Previously, lawyers were hired to bridge the trust gap between two different parties, but it consumed extra time and money. But the introduction of Cryptocurrency has radically changed the trust equation. Many organizations are located in areas where resources are scarce, and corruption is widespread. In such cases, Blockchain renders a significant advantage to these affected people and organizations, allowing them to escape the tricks of unreliable third-party intermediaries.\n\nThe new reality of the Internet of Things (IoT) is already teeming with smart devices that — turn on your washing machines; drive your cars; navigate your ships; organize trash pick-up; manage traffic safety in your community — you name it! This is where blockchain comes in. In all of these cases (and more), leveraging blockchain technology by creating Smart Contracts will enable any organization to ‒ both — improve operations and keep more accurate records.\n\nBlockchain technology enables a decentralized peer-to-peer network for organizations or apps like Airbnb and Uber. It allows people to pay for things like toll fees, parking, etc.\n\nBlockchain technology can be used as a secure platform for the healthcare industry for the purposes of storing sensitive patient data. Health-related organizations can create a centralized database with the technology and share the information with only the appropriately authorized people.\n\nIn the private consumer world, blockchain technology can be employed by two parties who wish to conduct a private transaction. However, these kinds of transactions have details that need to be hammered out before both parties can proceed:\n\nWhat are the terms and conditions (T&C) of the exchange? Are all the terms clear? When does the exchange start? When will it finish? When is it unfair to halt the exchange?\n\nSince blockchain technology employs a shared ledger, distributed ledger on a decentralized network, all parties involved can quickly find answers to these questions by researching “blocks” in the “chain.” Transactions on a blockchain platform can be tracked from departure to the destination by all of the transactions on the chain.\n\nHow Can Features of Blockchain Support Sustainability Efforts\n\nIn spite of huge energy consumption the blockchain technology has features that can support sustainability efforts. For example:\n\nBlockchain can give transparency and traceability in supply chains, allowing consumers to verify the origins and sustainability of products. This can encourage sustainable practices and discourage unethical practices such as deforestation, illegal fishing, or labor exploitation.\n\nDecentralization: Blockchain's decentralized nature helps to eliminate the need for intermediaries and reduce costs and also to increase efficiency. This can enable more direct and transparent transactions, reducing the environmental impact associated with traditional intermediaries.\n\nSmart Contracts: These are self-executing contracts that run on blockchain which eliminates the requirements for intermediaries and automating processes. This can reduce paperwork to minimize the disputes and streamline operations. It can help to lead to greater sustainability by reducing paper waste by increasing resource utilization.\n\nTokenization: Blockchain enables tokenization where assets can be represented as digital tokens. This can enable fractional ownership and make the process easier for people who intend to invest in sustainable assets such as renewable energy projects or carbon credits, promoting green investments and supporting sustainability initiatives.\n\nConclusion\n\nAlthough we just skimmed the industry-wide potential of blockchain applications in this article, the career potential in this field is growing exponentially. Getting ahead of the game is always a good strategy for any professional. At Simplilearn, our latest and most up-to-date course on this emerging field is the Professional Blockchain Certificate Program in Blockchain. In partnership with the world-renowned university, IIT Kanpur, this program will help you get on track.\n\nIn this blockchain program, you will learn how to master blockchain concepts, techniques, and tools like Truffle, Hyperledger, and Ethereum to build blockchain applications and networks.\n\nFAQs\n\n1. What is Blockchain in Simple Terms?\n\nBlockchain is a shareable ledger that records transactions and is difficult to modify or change. It also tracks tangible and intangible assets such as cash or a house.\n\n2. How Many Blockchains Are There?\n\nThere are 4 types of blockchain networks currently - public blockchains, private blockchains, consortium blockchains, and hybrid blockchains.\n\n3. What’s the Difference Between a Private Blockchain and a Public Blockchain?\n\nPrivate blockchains are only open to selected people, while public blockchain is open to the general masses. Private blockchains are more secure compared to public ones.\n\n4. What is a Blockchain Platform?\n\nA Blockchain Platform is any platform that exists to support or facilitate Blockchains. There are many types of blockchain platforms for different needs, such as Ethereum, Hyperledger, etc.\n\n5. Who Invented Blockchain?\n\nBlockchain was created by unknown persons under the pseudonym Satoshi Nakamoto when they designed the online currency, Bitcoin.\n\n6. What is Blockchain used for?\n\nWhile most popularly used for digital currency such as Bitcoin, Blockchain is also now used in different sectors to safeguard records.\n\n7. What are the 3 Pillars of Blockchain Technology?\n\nDecentralization, Transparency, and Immutability are the 3 main pillars of blockchain technology.\n\n8. Who Controls the Blockchain?\n\nIn blockchain, the power is divided between all of the users operating on the network. No single user has any control.\n\n9. Why is Blockchain Important?\n\nBlockchain offers security, transparency, and trust between the entire network of users. It also offers cost saving and efficient methods for data recording and sharing."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWhvbGRzLWFzLWluc3RpdHV0aW9uYWwtaW52ZXN0b3ItYm9vc3RzLXNlbnRpbWVudNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin price holds $28K range as institutional investor maneuvering boosts sentiment - Cointelegraph",
        "content": "Bitcoin’s (BTC) price continues to show strength this week by hitting an intra-day high at $28,516 even as macroeconomic headwinds in the United States continue to weigh on investor sentiment. It’s possible that a certain degree of BTC’s price stability can be attributed to increasing institutional activity and positive institutional investor interest in Bitcoin.\n\nOn Oct. 17, Fidelity Investments, a large asset management institution, amended its proposed spot Bitcoin exchange-traded fund (ETF) with the United States Securities and Exchange Commission. The ETF, called the Wise Origin Bitcoin Trust, updated and outlined how Fidelity plans to protect customers’ Bitcoin in custody accounts and revealed risks associated with the unstable regulatory landscape of cryptocurrencies.\n\nFidelity is following in the footsteps of other large institutions such as ARK Invest and Invesco, which also amended their spot Bitcoin ETF filings. ARK Invest refiled on Oct. 11, with Invesco refiling on Oct. 13.\n\nThese actions suggest an ongoing dialogue between ETF applicants and the SEC, something ARK Invest CEO Cathie Wood seemed to verify this week on ETF Edge, stating:\n\n“We responded to the SEC request for information surrounding our Bitcoin filing. The SEC chose to engage, which is a change in behavior.”\n\nWood’s comment, combined with Fidelity’s filing, is providing renewed optimistic sentiment on Bitcoin. Grayscale’s Bitcoin investment vehicle, Grayscale Bitcoin Trust (GBTC), which is similar to an ETF, has reached its lowest net asset value premium discount since Dec. 9, 2021.\n\nGBTC premium. Source: Coinglass\n\nRelated: Beyond crypto: Zero-knowledge proofs show potential from voting to finance\n\nGrayscale was dealt a victory against the SEC on Oct. 14, with the commission reportedly not appealing an Aug. 29 ruling by the U.S. Court of Appeals, which means Grayscale’s ETF will now have to be reviewed.\n\nDespite all of the momentum, the SEC continues to delay Bitcoin ETF approval.\n\nCertain analysts anticipate that when approval is granted, it could potentially add at least $600 billion in new demand for Bitcoin. During an Oct. 16 interview on Fox Business, BlackRock CEO Larry Fink spoke about Bitcoin after false spot BTC approval news sparked a rally.\n\n“I think the rally is about a flight to quality, with all the issues around the Israeli war now [and] global terrorism. And I think there are more people running to a flight to quality — whether that is in Treasurys, gold or crypto, depending on how you think about it.”\n\nRelated: How high can Bitcoin price go by 2024?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vd3d3LmNjbi5jb20vbmV3cy93aHktYml0Y29pbi10cmVuZGluZy1vbi10d2l0dGVyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Why is 'Bitcoin ETF' Trending on Twitter Today? - CCN.com",
        "content": "Key Takeaways\n\nMajor financial institutions seek approval for US Bitcoin ETFs, signaling a shift in the crypto industry’s ETF approach.\n\nGrayscale’s conversion success and BlackRock’s application suggest a shifting landscape for crypto financial products.\n\nBitcoin briefly exceeded $30,000 amid price swings following a false report of SEC approval for a spot Bitcoin ETF.\n\nThere may soon be more alternatives available to those who wish to wager on Bitcoin, and this has Twitter in a frenzy as ‘Bitcoin ETF’ is trending following a bout of confusion news.\n\nMajor financial institutions, including BlackRock, Fidelity, and Invesco, have applied to sell US “spot” exchange-traded funds (ETFs) directly linked to holdings in Bitcoin, while Grayscale Investments LLC has been successful in its effort to convert its Bitcoin trust into an ETF, having won a court decision on August 29.\n\nThese products have frequently been rejected by the US Securities and Exchange Commission (SEC) in the past due to concerns about volatility and possible manipulation. However, the Grayscale decision and the BlackRock filing, in particular, may indicate that the cryptocurrency industry is taking the lead.\n\nHowever, many jumped the gun when a bogus report emanated from Cointelegraph suggesting that the SEC had approved the first offering in the U.S. With all the bubbling news, it is unsurprising that Twitter is so active around this point.\n\nCrypto Twitter Frenzy\n\nSome of the reasons why ‘Bitcoin ETF’ is trending on Twitter include progress being made by Fidelity, BlackRock’s continued push in this space, and a looming deadline on their decision, as well as positive news for Grayscale. Not to mention, socio-economic factors like global conflicts, also have people looking towards safe-haven assets.\n\nAs industry analysts and influencers expect that BlackRock’s Bitcoin spot ETF will launch soon, anticipation is growing. The popular cryptocurrency YouTuber Crypto Rover, who boasts an incredible 100,000 subscribers, claims that the BlackRock Bitcoin spot ETF’s actual expiration date or target date is within the next 60 to 90 days.\n\nThis forecast is based on BlackRock’s decision to forgo an appeal of Grayscale’s recent legal victory, which suggests that they lack any legal justification to deny any Bitcoin Spot ETF applications.\n\nThe real deadline/ expectation date for the BlackRock #Bitcoin spot ETF is in the coming 60-90 days. Here is why: They haven't appealed Grayscale's win, meaning they have no basis to reject ANY Bitcoin Spot ETF. The final deadline for the initial application from ARK is set… pic.twitter.com/FOdptgaOx3 — Crypto Rover (@rovercrc) October 17, 2023\n\nThe final date for the initial application from ARK , another significant participant in the crypto investment space, is set for January 10, 2024, according to Crypto Rover. Crypto fans predict that, should the SEC decide to approve any ETF, it will likely do so simultaneously with all others rather than picking one and rejecting the others.\n\nTherefore, the consensus among industry insiders is that the launch of the first Bitcoin spot ETF is likely to occur well before January 10, 2024.\n\n“Gary Gensler is standing in the way of spot Bitcoin ETFs – Cathie Wood,” according to “The Wolf Of All Streets.” The CEO of a well-known asset management company, Cathie Wood, stated that she does not believe the SEC as a whole, but rather SEC Chair Gary Gensler, is the biggest barrier to the establishment of a Bitcoin ETF.\n\nGARY GENSLER IS \"STANDING IN THE WAY\" OF SPOT BITCOIN ETFS – CATHIE WOOD She said the out loud part… out louder. Cathie Wood, the head of asset management firm Ark Invest, claims that SEC Chair Gary Gensler is the main obstacle to the approval of spot bitcoin ETFs, not the… pic.twitter.com/5UkUcANOPL — The Wolf Of All Streets (@scottmelker) October 16, 2023\n\nWood claims that the SEC staff is knowledgeable about BTC and understands its benefits. She went on to question Gensler’s decision to support a Bitcoin futures ETF while opposing a spot Bitcoin ETF, despite the latter’s lower counterparty risk.\n\nNotably, the SEC has already denied Ark Invest’s requests to launch ETFs twice. Grayscale Investments’ recent legal victory has increased pressure on the SEC to reconsider its position on spot Bitcoin ETFs.\n\nBitcoin On The Week Rally\n\nIn the last 24 hours, the price of Bitcoin fluctuated around $28,450, staying steadfastly above a range of around $26,000 that had remained for most of the previous two months due to sluggish mood and unusually low volatility and trading volumes.\n\nOne of the reasons was the fact that the application for its Bitcoin spot ETF “Wise Origin Bitcoin Trust” had been resubmitted to the SEC, a major ETF issuer with $37 billion in 58 ETFs. The regulator’s concerns that were earlier voiced when rejecting the Bitcoin ETF update are being addressed by the revised proposal.\n\nFollowing a bogus news report that the SEC had approved a spot Bitcoin exchange-traded fund (ETF), the largest digital asset even soared beyond $30,000 on Monday, most certainly signaling the beginning of ETF-linked volatility.\n\nSince last Friday, when it was revealed that the SEC had decided not to appeal a federal court decision that essentially allowed digital asset management Grayscale to convert its Bitcoin trust into an ETF, Bitcoin has been on the rise.\n\nETF issuers are working together with the SEC regarding changes required for SEC approval. BULLISH FOR #BITCOIN 🚀 pic.twitter.com/42nrcvwOEK — Crypto Rover (@rovercrc) October 18, 2023\n\nSince the summer, when BlackRock and other major mainstream financial institutions filed for SEC approval, the possibility of a spot Bitcoin ETF—which would hold the token itself rather than funds holding futures—has been a looming driver for cryptocurrencies.\n\nAlthough there is still uncertainty and potential roadblocks before any spot Bitcoin ETF starts trading, it is widely predicted that regulatory approval of such funds will revive the cryptocurrency markets and usher in a new wave of investment in Bitcoin. Despite this, traders are becoming more optimistic that the SEC will approve the conversion of the Grayscale Bitcoin Trust.\n\nLook no further than the Grayscale discount. The trust owned by the asset management trades similarly to a closed-end fund, with a price that varies from the net asset value of the Bitcoin it owns. For almost two years, that variance has been discounted, but it is getting smaller: The Grayscale discount was at its tightest since late 2021 on Tuesday, when it was around 15%, down from almost 19% at the beginning of the month.\n\nCrypto – A Safe Haven In The Time Of War\n\nDue to the recent Israel-Palestine conflict, the world is now more aware of the geopolitical tensions in the Middle East. Despite the wide-ranging impacts of the upheaval, one feature that is sometimes regarded as a safe haven in times of unrest has remained unaffected: the stability of the price of Bitcoin (BTC).\n\nAmid the Israeli authorities’ crackdown on cryptocurrency accounts and efforts to sever connections with Hamas following an attack, many have been closed, with millions in crypto assets seized. People attribute this action to growing concerns about global conflicts and their potential impact on the monetary system, prompting some to invest in Bitcoin.\n\n\"There is a way to trace transactions from bad actors and that digital paper trail has led to disruptions and seizures. The numbers we've seen need some context.\" @SignCurve on @crypto w/@kaileyleinz @mattmiller1973 https://t.co/WQGyPZ4SKZ pic.twitter.com/7mHmfUwTV8 — Crypto Council for Innovation (@crypto_council) October 18, 2023\n\nSince Russia’s invasion of Ukraine , cryptocurrencies have been frequently in the news, with demand for the always-volatile bitcoin in both Russia and other countries.\n\nDuring the greatest attack on a European nation since World War Two, cryptocurrencies have performed as shown in the following charts.\n\nCrypto enthusiasts view the Bitcoin as “digital gold,” a convenient place to deposit funds in times of conflict or calamity. According to the argument, Bitcoin is more secure than conventional currencies because it has a finite quantity and operates on a worldwide computer network outside the control of governments.\n\nNothing is ever really that easy. Uncertainty surrounds Bitcoin’s potential as a safe-haven asset: It frequently exhibits more risk-on asset characteristics, like equities.\n\nBe it as it may, Bitcoin is not just a speculative asset, it is also a seizure-resistant, policy-independent, longer-term store of value, and the war has contributed to this perception.\n\nIt is unclear which of the most recent wave of applications for a Bitcoin ETF the SEC will approve. However, the recent push for one from organisations like BlackRock may be an indicator of a more significant development for the token: the entry of institutional investors."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8xNy93aGlzdGxlYmxvd2VyLWVkd2FyZC1zbm93ZGVuLWlzc3Vlcy13YXJuaW5nLXNheXMtc3BvdC1iaXRjb2luLWV0Zi1hLWZvcm0tb2Ytc3VianVnYXRpb24tYnktdHJhZGZpL9IBhwFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8xNy93aGlzdGxlYmxvd2VyLWVkd2FyZC1zbm93ZGVuLWlzc3Vlcy13YXJuaW5nLXNheXMtc3BvdC1iaXRjb2luLWV0Zi1hLWZvcm0tb2Ytc3VianVnYXRpb24tYnktdHJhZGZpL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Whistleblower Edward Snowden Issues Warning, Says Spot Bitcoin ETF a Form of Subjugation by TradFi - The Daily Hodl",
        "content": "Famed whistleblower Edward Snowden thinks the crypto community should be wary of a spot-based Bitcoin (BTC) exchange-traded fund (ETF).\n\nWhile speaking at the Bitcoin Amsterdam 2023 event last week, the former U.S. National Security Agency (NSA) contractor and Central Intelligence Agency (CIA) employee warned about the potential dangers of letting traditional finance gain power over the top crypto asset.\n\n“I think we need to remember that particularly in these moments of instability, that we are all part of a much bigger game, and Bitcoin is one of our strongest levers in that.\n\nThe systems that we are influencing, that we are exerting leverage on – payments and finance – will shape what the world of tomorrow looks like. Now we have to cross some hurdles to get there in a meaningful way.\n\nRight now the reason everybody’s getting excited about the price is they’re thinking about ETFs or whatever. We don’t really want that to be the thing that moves price, even if price is moving. Because that is a kind of subordination, that is a kind of subjugation that is a process of taming that we see being played out.”\n\nThe U.S. Securities and Exchange Commission (SEC) delayed decisions on a slew of spot BTC ETF applications, including BlackRock’s, in late September.\n\nThe final deadline for the SEC to review one application, the ARK 21 Shares Bitcoin ETF, is on January 10th.\n\nI\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXByaWNlLXNob290cy1ibGFja3JvY2stYmxrLTA5MzgwMDM4My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Price Shoots Up on BlackRock (BLK) ETF Approval Rumor - Yahoo Finance",
        "content": "The race to launch a Bitcoin ETF has been getting a lot of eyeballs as it would give a regulated and orderly way to obtain exposure to Bitcoin price swings without actually owning the cryptocurrency. On Monday, Oct 16, the price of Bitcoin (BTC) briefly crossed the $30,000 mark on reports that the Securities and Exchange Commission (“SEC”) approved BlackRock, Inc.’s BLK application to launch a BTC ETF. The news turned out to be a rumor.\n\n“The iShares Spot Bitcoin ETF application is still under review by the SEC,” a BlackRock spokesperson clarified. On this, the price of the benchmark crypto coin settled back down below $29000, falling sharply by about 8%. The SEC, too, gave a cryptic yet stern message on social media, stating, \"Careful what you read on the internet. The best source of information about the SEC is the SEC.\"\n\nHowever, the sharp uptick in the price of Bitcoin on these rumors has started speculations that an actual approval may not be far off. The regulations body has been struggling in recent days to keep the rising optimism about Bitcoin ETFs at bay, and the best it has been able to do is to delay passing its verdict on various applications. Traditional finance giants seem to have decided to go mainstream with crypto, and the market appears prepared for it.\n\nOf late, the major development in this next-stage crypto move has been the Court of Appeals siding with Grayscale in its lawsuit against the SEC. Previously, the SEC had denied Grayscale’s application to convert its popular Grayscale Bitcoin Trust (GBTC) to an ETF. The SEC had until Friday to appeal the judge’s opinion that it had failed to provide a coherent explanation for its denial. But they did not take up that option in a significant act of omission. This will now pave the way for various companies from the traditional sector that are waiting for the SEC’s approval to jump into the crypto fray.\n\nStory continues\n\nApart from BlackRock, which is probably the biggest player in the race, the SEC is currently reviewing applications from major investment companies like Invesco Ltd. IVZ and Franklin Resources, Inc. BEN. Invesco and Franklin Resources currently carry a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFranklin Resources, Inc. (BEN) : Free Stock Analysis Report\n\nBlackRock, Inc. (BLK) : Free Stock Analysis Report\n\nInvesco Ltd. (IVZ) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWxpcXVpZGl0eS1iaW5hbmNlLXBsdW1tZXRlZC1kdXJpbmctMDUzNDM1NzM4Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Trading Bitcoin on Binance Got Tougher During the ETF Rumor Frenzy: Kaiko - Yahoo Finance",
        "content": "Binance has long been the world's largest cryptocurrency exchange by trading volumes. Still, on Monday, traders looking to buy and sell bitcoin (BTC) quickly on Binance were at a relative disadvantage to their peers on Kraken and Coinbase (COIN), according to data tracked by Paris-based Kaiko.\n\nThe 0.1% ask depth on Binance, a measure of buy-side liquidity, crashed to just 1.2 BTC ($30,000) from 100 BTC as volatility exploded after a false report of BlackRock's (BLK) spot exchange-traded fund (ETF) approval circulated on social media. The leading cryptocurrency popped 7.5% to $30,000 in a knee-jerk reaction to the rumor, only to give up gains after BlackRock denied the report.\n\nThe 0.1% ask depth refers to the number of outstanding purchase orders within 0.1% of the mid-price or average of the bid and ask prices. Ask price is the price at which the seller is ready to sell and bid is the value at which the buyer is ready to purchase.\n\nThe higher the bid and ask depth, the easier it is to execute large buy and sell orders at stable prices and the lower the slippage – the difference between the expected price at which a trade is placed and the actual price at which the trade goes through.\n\nThe 0.1% depth also dipped as low as 2 BTC on OKX and Bybit, with the average ask across major exchanges falling below 95 BTC.\n\nThe broad-based decline in liquidity saw several market participants, including pseudonymous traders exitpump and Omz, lose money due to slippage. Some traders saw slippage as high as 20%.\n\nLiquidity, as measured by the 0.1% market depth on major exchanges, crashed on major exchanges. (Kaiko)\n\nThe chart shows Kraken and Coinbase outperformed Binance and other exchanges during the liquidity meltdown.\n\nThe sticky liquidity on the two exchanges likely reflects the relative sophistication of their market makers - entities tasked with creating liquidity in an order book, according to Carey.\n\n\n\n\n\n\n\n"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTgvYml0Y29pbi1ib2xsaW5nZXItYmFuZHdpZHRoLXNpZ25hbHMtd2lsZC1wcmljZS1zd2luZ3MtYWhlYWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin 'Bollinger Bandwidth' Signals Wild Price Swings Ahead - CoinDesk",
        "content": "Volatility is said to be mean-reverting. Therefore, a prolonged period of below-average volatility often paves the way for sudden violent price action in either direction. In other words, the market is said to build energy during consolidation, which is eventually unleashed in the form of a notable bullish or bearish trend. The longer the volatility meltdown, the more violent the eventual breakout."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LnRoZWhpbmR1LmNvbS9zY2ktdGVjaC90ZWNobm9sb2d5L2JpdGNvaW4tcHJpY2UtanVtcGVkLWFmdGVyLWZhbHNlLW5ld3MtYWJvdXQtc3BvdC1ldGYtYXBwcm92YWwvYXJ0aWNsZTY3NDI5NjgwLmVjZdIBgwFodHRwczovL3d3dy50aGVoaW5kdS5jb20vc2NpLXRlY2gvdGVjaG5vbG9neS9iaXRjb2luLXByaWNlLWp1bXBlZC1hZnRlci1mYWxzZS1uZXdzLWFib3V0LXNwb3QtZXRmLWFwcHJvdmFsL2FydGljbGU2NzQyOTY4MC5lY2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin price jumped after false news about spot ETF approval - The Hindu",
        "content": "October 17, 2023 04:46 pm | Updated 04:46 pm IST\n\nA crypto news website has apologised after its incorrect social media post about the approval of a spot Bitcoin exchange-traded fund (ETF) was debunked and Bitcoin (BTC) prices spiked early in the week.\n\nCointelegraph had made a post on X (formerly Twitter), saying that the U.S. Securities and Exchange Commission had approved BlackRock’s application for a spot Bitcoin ETF. However, this was soon shown to be false by other journalists and channels, including BlackRock itself.\n\nIn the meantime, Bitcoin’s price shot up by around 10% and crossed the $29,300-mark before slipping back down to around $28,100.\n\n(For top technology news of the day, subscribe to our tech newsletter Today’s Cache)\n\n“We apologize for a tweet that led to the dissemination of inaccurate information regarding the Blackrock Bitcoin ETF. An internal investigation is currently underway. We are committed to transparency and will share the findings of the investigation with the public once it is concluded within 3 hours,” posted Cointelegraph on X on Monday.\n\nIn an update, Cointelegraph said that the news lead came from an “unconfirmed screenshot posted by an X user who claimed it was from the Bloomberg Terminal.” The publication also said its social media process had been violated when the report was posted to X without an editor’s confirmation. However, an article had not been published with the news. Cointelegraph has about 1.9 million followers on X.\n\nA spot Bitcoin ETF is a product many crypto traders are eagerly waiting for. This would encourage traditional and institutional investors to enter the crypto market in a more regulated manner, with the support of a licensed company, rather than going through riskier decentralised platforms. Multiple applications for these spot Bitcoin ETFs are currently pending, as the SEC is wary of the crypto market as a whole.\n\n“Careful what you read on the internet. The best source of information about the SEC is the SEC,” said the financial regulator on X on Tuesday.\n\nCryptocurrency prices are extremely volatile. Even coins with large market capitalisation values like Bitcoin can spike or plunge rapidly due to investor emotions, technical factors, and world events."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmZ4ZW1waXJlLmNvbS9mb3JlY2FzdHMvYXJ0aWNsZS9iaXRjb2luLWFuZC1ldGhlcmV1bS1nby10aGVpci1zZXBhcmF0ZS13YXlzLWZvci1ub3ctMTM4MTkxM9IBV2h0dHBzOi8vYW1wLmZ4ZW1waXJlLmNvbS9lbi9iaXRjb2luLWFuZC1ldGhlcmV1bS1nby10aGVpci1zZXBhcmF0ZS13YXlzLWZvci1ub3cvMTM4MTkxMw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Go Their Separate Ways for Now - FX Empire",
        "content": "English English Italiano Español Português Deutsch العربية Français\n\nImportant Disclaimers The content provided on the website includes general news and publications, our personal analysis and opinions, and contents provided by third parties, which are intended for educational and research purposes only. It does not constitute, and should not be read as, any recommendation or advice to take any action whatsoever, including to make any investment or buy any product. When making any financial decision, you should perform your own due diligence checks, apply your own discretion and consult your competent advisors. The content of the website is not personally directed to you, and we does not take into account your financial situation or needs.The information contained in this website is not necessarily provided in real-time nor is it necessarily accurate. Prices provided herein may be provided by market makers and not by exchanges.Any trading or other financial decision you make shall be at your full responsibility, and you must not rely on any information provided through the website. FX Empire does not provide any warranty regarding any of the information contained in the website, and shall bear no responsibility for any trading losses you might incur as a result of using any information contained in the website.The website may include advertisements and other promotional contents, and FX Empire may receive compensation from third parties in connection with the content. FX Empire does not endorse any third party or recommends using any third party's services, and does not assume responsibility for your use of any such third party's website or services.FX Empire and its employees, officers, subsidiaries and associates, are not liable nor shall they be held liable for any loss or damage resulting from your use of the website or reliance on the information provided on this website. Risk Disclaimers This website includes information about cryptocurrencies, contracts for difference (CFDs) and other financial instruments, and about brokers, exchanges and other entities trading in such instruments. Both cryptocurrencies and CFDs are complex instruments and come with a high risk of losing money. You should carefully consider whether you understand how these instruments work and whether you can afford to take the high risk of losing your money.FX Empire encourages you to perform your own research before making any investment decision, and to avoid investing in any financial instrument which you do not fully understand how it works and what are the risks involved."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMivQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTctb2N0b2Jlci0yMDIzL2FydGljbGVzaG93LzEwNDQ5MDk3MC5jbXPSAcEBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTE3LW9jdG9iZXItMjAyMy9hbXBfYXJ0aWNsZXNob3cvMTA0NDkwOTcwLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $28,200; Ethereum holds above $1,550 - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe crypto tokens were trading mixed in Tuesday's trade. Bitcoin, Ethereum, Solana, and Polygon were trading in the green, while XRP , Cardano, Dogecoin Toncoin and Polkadot were trading in the red.Meanwhile, the global cryptocurrency market cap surged 0.64% to around $1.09 trillion in the last 24 hours.Bitcoin was up 1.44% at $28,251 as of 12:35 p.m., while Ethereum was just below the $1,600 level.\"Bitcoin’s price touched the $30,000 mark before settling at the $28,000 level following false news published on X (formerly Twitter) about the SEC approving Blackrock’s spot ETF application. The news caused more than $100 million in liquidations,\" said Edul Patel, CEO of Mudrex.In other news, Microsoft finalized its acquisition of Activision Blizzard, the company behind games like Call of Duty, Candy Crush, etc. This could mean positive news for the web3 gaming industry and cause a potential uptick in the adoption of cryptocurrencies, Edul said.Vikram Subburaj, CEO of Giottus Crypto Platform, said, \"Bitcoin needs to hold its current level at $28,300 and push for another but sustained breach of $30,000 to continue its bullish momentum.\"In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, surged to $551 billion. Bitcoin's dominance is currently 50.67%, according to CoinMarketCap. BTC volume increased 122.3% to $25.8 billion.BTC's Exponential Moving Average for 10-day and 200-day indicate a “Buy” sentiment at 27571 and 27045, respectively. Similarly, the Simple Moving Average for 10-day and 200-day SMA indicate a \"Buy\" at 27427 and 28019, respectively. Exponential and Simple Moving Averages show a “Buy” sentiment.Major market oscillators point toward a \"Neutral\" sentiment. The Relative Strength Index (14), one of the key indicators, sits at 62, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) are at 48 and 23, respectively, further indicating a “Neutral” market.The MACD Level (12, 26) at 238 indicates a \"Buy.\" The Stochastic RSI Fast (3, 3, 14, 14) is at 74 with a \"Neutral\" indicator, while the Williams Percent Range (14) at −47 signals \"Neutral.\""
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by90b2tlbi9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi10b3BzLTI4MDAwLWV0aGVyZXVtLW5lYXJzLTE2MDAtc29sYW5hLXJpc2VzLTktNDAyMjM4LTIwMjMtMTAtMTfSAY4BaHR0cHM6Ly93d3cuYnVzaW5lc3N0b2RheS5pbi9hbXAvY3J5cHRvL3Rva2VuL3N0b3J5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLXRvcHMtMjgwMDAtZXRoZXJldW0tbmVhcnMtMTYwMC1zb2xhbmEtcmlzZXMtOS00MDIyMzgtMjAyMy0xMC0xNw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin tops $28,000; Ethereum nears $1,600; Solana rises 9% - Business Today",
        "content": "Bitcoin and other crypto tokens were trading sharply higher on Tuesday in Asia but the gains soon eased early morning. A false report of a spot ETF approval was posted on social media platform X, formerly known as Twitter. However, the gains were trimmed as the clarity emerged and the report was deleted.\n\n\n\nBitcoin posted sharp gains in the early morning as the last crypto token surged about 4 per cent to once again top 28,000-levels. However, its largest peer, Ethereum, also gained about 2 per cent but remained below $1600-level. Altcoins were also trading with decent gains in the early morning.\n\n\n\nYesterday was a very interesting day to trade. Bitcoin saw a 70-day high in price. This happened alongside a massive $65 million worth of liquidation in close to 15 minutes as a major crypto news publisher CoinTelegraph reported that the Blackrock Bitcoin ETF has been approved by the SEC, said Shubham Hudda, Senior Manager at CoinSwitch Markets Desk.\n\n\n\n\"However, shortly after, Blackrock clarified that their application is still under review,\" he said. \"The series of events makes one thing clear—a real spot Bitcoin ETF approval is highly likely to lead to an unprecedented rally. Currently, Bitcoin still looks bullish in charts,\" he added.\n\n\n\nBarring a few exceptions, the majority of top crypto tokens were trading with big gains on Tuesday. Solana surged about 9 per cent, while Polygon was trading 3 per cent higher. Tron, Litecoin and BNB added 2 per cent each. Among the losers, only Polkadot and USD Coin were seen in red.\n\n\n\nThe global cryptocurrency market cap was trading significantly higher, jumping to $1.09 trillion-mark, as it surged as much as three per cent in the last 24 hours. However, the total trading volumes zoomed more than 220 per cent to $62.5billion.\n\n\n\n\n\nTech View by WazirX Trade Desk\n\nSolana, an open-source project that leverages the unrestricted nature of blockchain technology, offers decentralised finance (DeFi) solutions. Although the project's conception and early development date back to 2017, Solana was formally introduced in March 2020 under the stewardship of the Solana Foundation, headquartered in Geneva, Switzerland\n\n\n\n\n\nThe SOL/USDT chart made a single day jump of nearly 7 per cent, reclaiming its position above the $24 level. On the daily time-frame, the SOL/USDT chart has just broken above the triangle pattern with its daily buying volumes almost doubling. The next resistance is expected at 27.5 USDT and an immediate support is expected at 20.2 USDT.\n\n\n\n\n\n\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY3J5cHRvLWJ1bGwtc2NhcmFtdWNjaS1zZWVzLTN4LWdhaW5zLWZvci1iaXRjb2luLWV0aGVyZXVtLWFuZC1hbGdvcmFuZC1oZXJlcy13aHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Crypto Bull Scaramucci Sees 3X Gains For Bitcoin, Ethereum, And Algorand — Here's Why - Nasdaq",
        "content": "SkyBridge Capital founder, Anthony Scaramucci has shed a bullish light on the future price trajectories of Bitcoin (CRYPTO: BTC), Ethereum (CRYPTO: ETH), and Algorand (CRYPTO: ALGO), suggesting hearty targets for these cryptocurrencies, detailing the intrinsic factors that could drive such a bullish trend.\n\nThis optimistic outlook comes just ahead of Benzinga's Future of Digital Assets conference on Nov. 14, which aims to delve into the evolving dynamics of digital assets. Discussions about these predictions by Scaramucci could form a riveting part of the narrative as industry experts explore the potential future of cryptocurrencies.\n\nScaramucci postulates a bullish scenario for Bitcoin, attributing his confidence to the post-halving cycle which historically propels a surge in demand, in an interview with Altcoin Daily.\n\nHe states, “I believe six to 12 months after the halving cycle, there’s no reason why Bitcoin couldn’t be at $100,000. Just given what I know about demand and given what I know about the cycle and where the miners are, and so forth, plus, we may get some interest rate relief. That’s a 3x bump.”\n\nHis prediction reflects a tripling in Bitcoin’s value, which he analogizes to the technological advancements that have historically witnessed such price surges.\n\nWhile Scaramucci admits to not being as intimately acquainted with Ethereum, he nonetheless holds a positive stance.\n\nAlso Read: Fed Governor Michelle Bowman Says Creation Of US CBDC 'Could Pose Significant Risks'\n\nHighlighting the technological improvements and the increasing utility that Ethereum offers, he said, “Could Ethereum be $4,500 by then? Why not? You know it’s a great utility. Speeds have improved. The layer-2s have helped it. Why not? Why couldn’t it be $4,500? These things are maturing.”\n\nHis optimism extends to Algorand, albeit with a tempered tone due to its current trading price. Despite the crypto’s present modest trading range of around $0.09 to $0.10, Scaramucci sees potential for growth.\n\nHe envisions a path to $0.30 per token as Algorand continues to develop and garner adoption, especially from corporations enamored by its technology.\n\nHe adds, “I’m bullish. I thought at $1 it could have easily gotten to $5... but could Algorand from here... could it be a $0.30 token as they continue their development and continue the adoption of what they’re doing and bringing in corporations that love the technology? I believe it can.”\n\nRead Next: Binance.US Changes Terms: No More Direct Withdrawals Of US Dollars From Platform\n\nJoin Benzinga's Fintech Deal Day & Awards on Nov. 13 and Future of Digital Assets on Nov. 14 in New York City to stay updated on trends like AI, regulations, SEC actions and institutional adoption in the crypto space. Secure early bird discounted tickets now!\n\nPhoto: Shutterstock\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nGet insight into trading platforms. Compare the best online stock brokerages.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNuYmNhZnJpY2EuY29tLzIwMjMvaG93LXRvLXN0ZWFsLWFuZC1sb3NlLW1vcmUtdGhhbi0zLWJpbGxpb24taW4tYml0Y29pbi1jbmJjLWRvY3VtZW50YXJ5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "How To Steal And Lose More Than $3 Billion In Bitcoin | CNBC Documentary - CNBCAfrica.com",
        "content": "Get the best of CNBC Africa sent straight to your inbox with breaking business news, insights and updates from experts across the continent.\n\nGet this delivered to your inbox, and more info about about our products and services. By signing up for newsletters, you are agreeing to our Terms of Use and Privacy Policy."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMivQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTgtb2N0b2Jlci0yMDIzL2FydGljbGVzaG93LzEwNDUyMjcwMC5jbXPSAcEBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTE4LW9jdG9iZXItMjAyMy9hbXBfYXJ0aWNsZXNob3cvMTA0NTIyNzAwLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $28,500; Toncoin jumps over 6% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe crypto tokens were trading mixed in Wednesday's trade with a positive bias. Bitcoin, Solana, Toncoin and Tron were trading in the green, while Ethereum, XRP BNB , Cardano, Dogecoin , and Polkadot were trading in the red.The global cryptocurrency market cap surged 0.76% to around $1.09 trillion in the last 24 hours.Bitcoin was up 1.1% at $28,586 as of 12:39 p.m., while Ethereum was below the $1,600 level.\"Bitcoin has maintained a trading position above the $28,300 mark in the last 24 hours. This price movement is driven by growing excitement among investors about the potential approval of a Bitcoin Spot ETF in the United States,\" said Edul Patel, CEO of Mudrex.\"BTC has successfully reclaimed the 200-day Simple Moving Average (SMA) and is currently holding above it. However, for BTC to continue its upward momentum, it needs to clear and sustain the crucial resistance level at ₹25,02,000 ($28,600),\" said CoinDCX Research Team.In the last 24 hours, the market cap of Bitcoin, the world's largest cryptocurrency, surged to $557 billion. Bitcoin's dominance is currently 51.23%, according to CoinMarketCap. BTC volume in the last 24 hours declined 40.3% to $15.4 billion.The central point of the chart is the pivotal $28,077, a key reference price. Immediate obstacles include resistance levels at $28,549, with subsequent obstacles at $29,219 and $29,886. Bitcoin's initial support is at $27,667 and other safety nets are at $27,208 and $25,985.The Relative Strength Index (RSI) is currently at 74, indicating that Bitcoin may be overbought. While an RSI above 50 usually indicates an uptrend, caution is advised due to its proximity to the overbought boundary.Meanwhile, the 50-day exponential moving average (50 EMA) at $28,077 reinforces its significance. Bitcoin is comfortably above the 50 EMA, indicating a short-term bullish outlook. Chart patterns reveal 4-hour trendline resistance near $28,600. Neutral candlestick patterns signal investor indecision, likely due to anticipation of clearer fundamental signals before taking action.Quick Glance (Source: coinmarketcap.com , data as of 13.08 hours, IST on October 18, 2023)Bitcoin $28,586 1.10%Ethereum $1,576 -0.53%Tether $1 -0.01%BNB $213 -0.16%XRP $0.4898 -0.12%Cardano $0.2477 -1.17%Dogecoin $0.0591 -1.05%Solana $24.01 0.32%Polygon $0.5211 -1.56%Litecoin $62.28 -1.36%Polkadot $3.68 1.75%Tron $0.0888 0.23%Shiba Inu $0.000006908 -2.08%Toncoin $2.08 6.08"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vYWZyaWNhLmJ1c2luZXNzaW5zaWRlci5jb20vbG9jYWwvbWFya2V0cy9ob3ctYml0Y29pbi1jcmVhdGVzLWludmVzdG1lbnQtb3Bwb3J0dW5pdGllcy1mb3ItaW5zdGl0dXRpb25zLzBrY3A4ZTjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 18 Oct 2023 07:00:00 GMT",
        "title": "How Bitcoin Creates Investment Opportunities for Institutions - Business Insider Africa",
        "content": "From setting up metaverse shops to adding Bitcoin to balance sheets, institutions are finding new ways to invest in this cryptocurrency. Initially, only a few people could imagine large institutions investing in Bitcoin. Many people thought Bitcoin was a mere cloud that would eventually pass. But this cryptocurrency has captured the attention of many institutional leaders due to its increasing value and popularity. The 2020 and 2021 bull run has particularly attracted the interest of many institutions in the crypto industry.\n\nAnd as more institutions bring money into the crypto sector, it draws more retail investors. But how does Bitcoin create investment opportunities for retail investors? This blog post explores different ways Bitcoin motivates institutions to invest in it.\n\nPortfolio Management and Diversification\n\nADVERTISEMENT\n\nBitcoin is unique due to its borderless and decentralized nature. Many institutional leaders see it as an alternative asset with low portfolio risk and attractive returns. Therefore, they invest in it to diversify their investment portfolio. Platforms like the Bitcoin Profit App enables institutions to quickly purchase this cryptocurrency and transfer it into their digital wallets, where they can hold it waiting for its value to increase. If you want to invest in bitcoins then you can check out the online trading platform bitqt\n\nHedging Against Economic Turmoil\n\nSome institutions see Bitcoin investments as a potential hedge against inflation and economic uncertainty. They see Bitcoin's limited supply and decentralization as a feature that can help safeguard against conventional currencies' devaluation. Additionally, they see Bitcoin as a tool for storing and protecting wealth.\n\nCustomer Demand and Retention\n\nThe number of customers wanting to pay with Bitcoin is increasing daily. That's because more people are realizing the benefits of this digital currency. Therefore, some institutions invest in Bitcoin to attract and retain more customers. Besides seeking Bitcoin investment opportunities, they are providing crypto-related services. Failure to address customers' demands can make them choose their competitors.\n\nADVERTISEMENT\n\nIncreasing Returns\n\nBitcoin lures corporate institutions to invest in it with the growing crypto investment returns. Any entity that invested in Bitcoin ten years ago can reap significant profits by cashing out this crypto today. This cryptocurrency's historical volatility and price performance have attracted companies seeking opportunities for reaping high returns. Such firms see Bitcoin as a speculative investment opportunity that can yield high profits with proper management.\n\nBitcoin's Future Outlook as an Investment for Institutions\n\nBitcoin has an evolving and promising future outlook as an investment for institutions. That's because institutional investors' interest in this cryptocurrency is growing. Additionally, cryptocurrencies are showing the potential to impact the financial landscape. More institutions have shown interest in Bitcoin, and this trend will likely continue as more institutional investors learn about Bitcoin's potential and the opportunities it presents.\n\nThe increasing participation of institutions in the crypto industry will increase liquidity, credibility, and stability in the Bitcoin market. And this will foster a favorable environment for this cryptocurrency's acceptance and growth.\n\nADVERTISEMENT\n\nMoreover, institutional investors' entrance into the crypto space will lead to overall market maturity. It will introduce expertise, regulatory compliance measures, and risk management strategies. These developments will help players in the crypto market address regulatory frameworks, custody, and security concerns among Bitcoin investors. Also, they will make Bitcoin more attractive and accessible to more investors.\n\nFinal Word\n\nBitcoin is an innovation with many investment opportunities for institutional investors. These investors play a vital role in Bitcoin's incorporation into various economic sectors and the future. Moreover, they help expand activities in the crypto industry. The unique nature of Bitcoin as a digital asset enables it to create various investment opportunities for institutions. And as more institutional investors explore these opportunities, they enhance Bitcoin's credibility, usage, and acceptance.\n\n--"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLWdpdmVzLXVwLWdhaW5zLWFmdGVyLWJsYWNrcm9jay1kZW5pZXMtZXRmLWFwcHJvdmFsLXJlcG9ydC9hcnRpY2xlc2hvdy8xMDQ0ODM1MTguY21z0gGSAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2JpdGNvaW4tZ2l2ZXMtdXAtZ2FpbnMtYWZ0ZXItYmxhY2tyb2NrLWRlbmllcy1ldGYtYXBwcm92YWwtcmVwb3J0L2FtcF9hcnRpY2xlc2hvdy8xMDQ0ODM1MTguY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin gives up gains after BlackRock denies ETF approval report - The Economic Times",
        "content": "(What's moving Sensex and Nifty Track latest market news stock tips and expert advice , on ETMarkets . Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets, investment strategies and stocks alerts, subscribe to our Telegram feeds .)\n\nDownload The Economic Times News App to get Daily Market Updates & Live Business News.\n\nSubscribe to The Economic Times Prime and read the Economic Times ePaper Online.and Sensex Today.\n\nTop Trending Stocks: SBI Share Price, Axis Bank Share Price, HDFC Bank Share Price, Infosys Share Price, Wipro Share Price, NTPC Share Price"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vZGF0YWNvbm9teS5jb20vMjAyMy8xMC8xNy9ob3ctZG9lcy10aGUtc3RhY2tzLWxheWVyLTItdGVjaG5vbG9neS1lbmhhbmNlLXRoZS1mdW5jdGlvbmFsaXR5LW9mLWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "How Does The Stacks Layer-2 Technology Enhance The Functionality Of Bitcoin? - Dataconomy",
        "content": "The challenge of the blockchain trilemma remains a prominent issue within the cryptocurrency field, with even Bitcoin – renowned for its decentralization and security – facing this same predicament. Although Bitcoin has set the precedent for all crypto endeavors, its limited scalability renders the BTC blockchain unfeasible for Web3 applications.\n\nBy implementing a new layer to Bitcoin, Stacks endeavors to alleviate this situation and present an alternative resolution. Dive into the world of Stacks Layer-2 technology and discover how it synergizes with Bitcoin in our article. We’ll also introduce you to Quantumator, an online trading platform that’s reshaping the landscape.\n\nWhat is Stacks?\n\nRather than immediately discussing Stacks, it may be beneficial to first examine the differences between Layer 1 and Layer 2 blockchains. The former, exemplified by the likes of Bitcoin and Ethereum, function as primary blockchains that prioritize robust security and decentralization. However, due to their scaling limitations, these blockchains struggle with low throughput, constituting a so-called blockchain trilemma. Only after fully grasping these distinctions can we move on to exploring Stacks.\n\nAs a result, Layer 2 blockchains are now a solution to improve the scaling as well as efficiency of Layer one networks. These blockchains act as one more layer over the principal blockchains and help with transactions. Ethereum is a level 1 blockchain, for example, and Polygon offers Layer 2 options. Layer two solutions are much less widespread for Bitcoin as compared to Ethereum.\n\nStacks is one of many platforms that developed a layering process for Bitcoin. It possesses numerous parallels with Layer Two alternatives, though the significant difference is in utilizing BTC as an anchor while working along with it. Stacks allow the inclusion of smart contracts to the blockchain of BTC, enabling possibilities for distributed programs (DApps) on the system. The stack tokens (STX) enhance the protection of the system as well as leverage Bitcoin’s security functions.\n\nHow does Stacks function?\n\nThe blockchain of Stacks works utilizing the Proof of Transfer (PoX) consensus method, enabling it to link with the Bitcoin community. The PoX system is derived from the Proof of Burn (PoB), in which miners add blocks on the chain by burning up their tokens to be able to get bonuses through the system. In much the same manner, PoX verifies blocks by transferring tokens rather than burning crypto coins. Individuals associated with verifying the blockchain L2 shift their tokens to a different participant’s address. These transactions take place with the indigenous tokens of L1 inside the L1 network.\n\nTransactions play an important role in confirming new blocks in this method. L2 – blockchains are meant to check the status of the L1 – system every twenty-four hours and validate each transaction between L2 – users. In this procedure, most L2 members get rewards for supplying indigenous tokens to L2.\n\nWhat is the difference between Stacks and Ethereum?\n\nAlthough they work similarly, there are two key differences between Stacks and Ethereum.\n\nEfficiency and Security\n\nStacks is founded upon the blockchain security of BTC, which possesses a good history of protection. Stacks utilizes methods such as macroblocks as well as subnets to boost its effectiveness while keeping the security of BTC.\n\nOn the flip side, Ethereum is renowned for its secureness and it is favored by programmers across the globe. Ethereum’s native throughput is restricted, however, it may be enhanced by utilizing scaling alternatives to support further transactions without compromising on efficiency or security.\n\nTools for developers\n\nEthereum is famous for its developer-friendly environment due to the Ethereum Virtual Machine (EVM) as well as the commonly used Solidity programming words. Stacks, however, provides a helpful development ecosystem that includes resources and tools that could be utilized to learn from.\n\nStacks’ advanced contract language, Clarity, is intended to be simpler to study as well as use, while simultaneously prioritizing effectiveness as well as protection.\n\nFeatured image credit: Traxer/Unsplash."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL3dvcnRoL25ld3MvZmFrZS10d2VldC1pbnZlc3RvcnMtc2VsbC04NS1taWxsaW9uLWNyeXB0by1iaXRjb2luLXByaWNlLWp1bXAtNjE3OTA5Lmh0bWzSAXRodHRwczovL3d3dy5pbmRpYXRpbWVzLmNvbS9hbXAvd29ydGgvbmV3cy9mYWtlLXR3ZWV0LWludmVzdG9ycy1zZWxsLTg1LW1pbGxpb24tY3J5cHRvLWJpdGNvaW4tcHJpY2UtanVtcC02MTc5MDkuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Investors Panic Sell $85 Million Crypto In 24 Hours After Fake Report Shoots Up Bitcoin By 10% - Indiatimes.com",
        "content": "A fake news report. That's all it took for Bitcoin to briefly jump 10% on Monday and result in investors panic selling $85 million crypto within just 24 hours.\n\nWhat Was The Fake Report About?\n\ncryptotimes\n\nA fake news report incorrectly asserted that BlackRock Inc. had received the green light to launch a spot exchange-traded fund in cryptocurrency. However, the US SEC clarified that the Bitcoin ETF application is still under review.\n\n\n\nAlso Read: Goldman Sachs Lends Its First Bitcoin-Backed Loan\n\nWho Spread The Fake News Report?\n\nIn a now-deleted tweet, crypto-focused news outlet CoinTelegraph reported the fake news on Twitter: \"BREAKING: SEC APPROVES ISHARES BITCOIN SPOT ETF.\" CoinTelegraph followed up with a tweet, saying: \"We apologize for a tweet that led to the dissemination of inaccurate information regarding the Blackrock Bitcoin ETF. An internal investigation is currently underway.\"\n\nWe apologize for a tweet that led to the dissemination of inaccurate information regarding the Blackrock Bitcoin ETF.\n\n\n\nAn internal investigation is currently underway. We are committed to transparency and will share the findings of the investigation with the public once it is… — Cointelegraph (@Cointelegraph) October 16, 2023\n\nWhen Did Blackrock Submit The Bitcoin ETF application?\n\n\n\nIn June, Blackrock submitted an application for a spot-Bitcoin ETF. While the news of Blackrock receiving approval may have been bogus, the money at stake was real! Data from tracker Coinglass shows that more than $85 million worth of trading positions, mostly from traders who were betting on lower prices, were liquidated over the past 24 hours, as per a Bloomberg report.\n\nThis episode adds to the ongoing discussion about whether the market has actually priced in the introduction of an exchange-traded fund tracking the largest digital coin. While misinformation is commonplace in a sector favored by fraudsters and proponents of digital currency alike, this incident is unfortunate. It also highlights regulators' worries that small-scale investors lack fundamental safeguards in the crypto Wild West, a problem that has in the past fueled the Securities and Exchange Commission's reluctance to open up the market.\n\ngetty\n\nAlso Read: US Man Pays 10,000 Bitcoins For Pizza\n\nHow Much Did Bitcoin Jump?\n\n\n\nBitcoin jumped 10% to a level above $30,000, its highest level since July, after a handful of tweets propagating unfounded news pushed the price up. The coin then pared those gains to trade around $28,300—just about where it had been before the incident—after BlackRock said its ETF application was “still under review” by regulators. It is currently at 28,466.70.\n\nThis specific incident occurs at a time when American investors' hopes are at an all-time high that a spot-Bitcoin ETF will indeed become available soon. Since about ten years ago, issuers have attempted to launch a US spot-Bitcoin ETF without success. Market manipulation and fraud have been mentioned by regulators as some of the causes of prior denials, as per the report.\n\nHowever, that hasn't stopped businesses from trying to capitalise on what may ultimately amount to billions of dollars in inflows. Over the years, many issuers have worked on their applications—or on approaches to placate regulators—in the hopes of launching such a fund. There are currently more than ten applications pending for a spot Bitcoin ETF, and many analysts think that the likelihood of approval is higher because BlackRock and other industry titans like Invesco and Fidelity are currently competing.\n\nFor the latest and more interesting financial news, keep reading Indiatimes Worth. Click here"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmRyaXZlLmNvbS5hdS9uZXdzL2ZlcnJhcmktbm93LWFjY2VwdHMtYml0Y29pbi1wYXltZW50cy1pbi10aGUtdXMtZXVyb3BlLXRvLWZvbGxvdy1yZXBvcnQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Ferrari now accepts Bitcoin payments in the US, Europe to follow – report - Drive",
        "content": "Those wanting a new Ferrari may soon be able to pay for one with Bitcoin, with the payment option being introduced in the US, and plans to expand the program to Europe and international markets in the future.\n\nThe marketing and commercial chief for Ferrari says the digital currency has been introduced as a payment method in the US ahead of its rollout in Europe, news agency Reuters reports.\n\nWealthy customers have been lobbying Ferrari to accept payments with Bitcoin, according to the senior spokesperson Enrico Galliera, with Bitcoin boasting a number of benefits for both the customer and the vendor.\n\n\"Some are young investors who have built their fortunes around cryptocurrencies, some others are more traditional investors, who want to diversify their portfolios,\" Mr Galliera said.\n\n\"This will help us connect to people who are not necessarily our clients but might afford a Ferrari,\" he added.\n\nWhile Bitcoin is considered the main form of 'cryptocurrency' – a decentralised digital currency not issued or controlled by a nation's bank – Bitcoin is considered to be volatile, increasing and decreasing in value dramatically compared to traditional currencies like the US Dollar and Australian Dollar.\n\nOver the past 12 months, Australian Dollar has moved from lows of 62c compared to the US Dollar, to highs of 72c, and back to its current level of 63c.\n\nMeanwhile, over the same period, Bitcoin has fluctuated from lows of $US15,750 ($AU25,000) to $US31,500 ($AU50,000), with the value currently sitting at $US27,200 ($AU43,000).\n\nIn early 2021, Tesla invested $US1.5 billion ($AU2.38 billion) in Bitcoin, and soon began accepting it as payment for its electric vehicles. However, the payment option was removed a short time later and has yet to be reintroduced.\n\nBitcoin has been criticised for its heavy reliance on electricity, with vast amounts of computer processing required to solve algorithms in order to create a single Bitcoin.\n\nA spokesperson for Ferrari has confirmed to Drive the Italian supercar company will initially introduce the Bitcoin payments in the US ahead of Europe, with plans to eventually roll out the digital currency payment to international markets.\n\nBen Zachariah is an experienced writer and motoring journalist from Melbourne, having worked in the automotive industry for more than two decades. Ben began writing professionally more than 15 years ago and was previously an interstate truck driver. He completed his MBA in Finance in early 2021 and is considered an expert on classic car investment.\n\nRead more about Ben Zachariah"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3LnJvYWRhZmZhaXIuY29tL3RyYXZlbC13aXRoLWNyeXB0by_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 17 Oct 2023 07:00:00 GMT",
        "title": "Paying for Travel with Bitcoin and Other Cryptocurrency: Pros and Cons - Road Affair",
        "content": "As cryptocurrency continues to rise in popularity, more and more consumers are investing in cryptocurrency like Bitcoin, Dogecoin, and Ethereum to pay for a wide array of goods and services. Among the industries increasingly accepting cryptocurrency as a form of payment are travel companies. Although paying with cryptocurrency has its pros and cons, more and more consumers seem eager to spend their crypto on airline tickets and hotel rooms.\n\nWhich Companies Accept Cryptocurrency?\n\nSeveral online travel agencies, including Travala, Destinia, CheapAir, BTCtrip, Abitsky, and Berkley Travel, accept Bitcoin and other forms of cryptocurrency. Through these agencies, travelers can book airline tickets and hotel rooms. If you prefer to book your flights directly through the airline, you’re in luck. AirBaltic became the first airline to accept crypto back in 2014, followed by LOT Polish Airlines and Virgin Galactic.\n\nIn 2021, the global payment network known as Universal Air Travel Plan (UATP) announced that they will begin accepting payments in 10 popular cryptocurrencies. Thousands of travel merchants, including many major airlines and travel agencies, accept UATP. The luxury hotel brand, Kessler Collection has also announced its acceptance of Bitcoin, Dogecoin, and Ether as valid payment methods.\n\nAs the number of consumers looking to pay for travel with crypto increases, it is likely that we will see more and more companies accepting the digital currency going forward. According to a survey conducted by Travala.com, 22 percent of American travelers intend to pay for part of their upcoming trip with cryptocurrency.\n\nHow to Book Your Next Trip With Cryptocurrency\n\nIf you’re interested in booking your next trip with crypto but you haven’t yet acquired any, there are several online exchanges where you can quickly and easily do so. Interested consumers can create an account with a reputable exchange website such as Binance, Coinbase, or Gemini and transfer real money to add cryptocurrency to an online wallet. When you’re ready to make a purchase through a valid agency or airline, select crypto as the payment option, and you’ll be redirected to one of the aforementioned sites. PayPal also allows customers to purchase digital currency directly.\n\nWhat Are the Pros of Booking Travel With Cryptocurrency?\n\nBooking flights and hotel rooms online with cryptocurrency is a fairly simple process similar to paying with a credit or debit card.\n\nMany consumers are also drawn to the security offered by cryptocurrency, which is managed through a decentralized technology known as blockchain. Since the goods and services associated with travel are relatively high-value purchases, safe and trusted transactions are highly desirable.\n\nTravelers can also use cryptocurrency to save money by avoiding hefty foreign exchange fees. Bitcoin ATMs can be used to convert your local currency into BTC, which can then be converted into a different national currency for a very small or nonexistent fee. If you’re traveling to a nation where the currency is particularly unstable, paying with crypto instead of converting your money to the local currency may also save you some headache.\n\nLoyalty rewards programs can be very lucrative for repeat customers, especially in the travel space. Luckily, if you choose to book your travel with cryptocurrency, you will still be able to receive these rewards, which will be tokenized as digital currency.\n\nWhat Are the Cons of Booking Travel With Cryptocurrency?\n\nUnfortunately, cryptocurrencies are known to be pretty unstable themselves. So, depending on where you’re traveling, crypto may not be the best way to protect yourself from potential volatility.\n\nAlthough some travelers prefer the security offered by crypto transactions, others are sticking with their credit cards. Credit card companies allow their customers to dispute potentially fraudulent charges under the Fair Credit Billing Act, a benefit not afforded to crypto owners.\n\nPerhaps the most notable disadvantages to paying with cryptocurrency are its limitations. While it has become increasingly common for online travel agencies and other companies to accept payments with crypto, there are many major players who have not yet followed suit. If your favorite site doesn’t accept cryptocurrency or you prefer to search around for the best price, you may not be able to cash in your Bitcoin.\n\nThere are also several countries that have banned the use of crypto for purchases, including Algeria, Bolivia, China, Egypt, Nepal, and Vietnam, and you won’t find any businesses in Russia or Pakistan accepting the digital currency.\n\nThere’s no denying that cryptocurrency has become an increasingly popular payment method across industries, and the travel space is no exception. Whether the pros outweigh the cons is largely dependent on your personal preferences and the nature of your trip."
    }
]