[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vY2JvZS1maWxlcy10by1saXN0LWJpdGNvaW4tc3BvdC1ldGYtZnJvbS1maWRlbGl0eS03NTU1NDg00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Fidelity Renews Push For Spot Bitcoin ETF Listed on CBOE - Investopedia",
        "content": "Fidelity Investments, which has $11 trillion in assets under management, has renewed its push to launch a spot bitcoin exchange traded fund (ETF) listed on the CBOE, according to a new CBOE filing with the U.S. Securities and Exchange Commission (SEC).\n\nKey Takeaways Cboe has filed to list a new bitcoin spot ETF managed by Fidelity Investments.\n\nFidelity had previously had their Wise Origin Bitcoin Trust application rejected by the SEC.\n\nMany traditional financial institutions have recently entered the race to launch the first bitcoin spot ETF in the U.S. following an application from BlackRock earlier this month.\n\nFidelity Mirrors Traditional Finance's Push For Crypto\n\nFidelity's Wise Origin Bitcoin Trust was previously rejected by the SEC, but this new filing from Cboe indicates Fidelity is making another attempt at getting regulatory approval for their bitcoin spot ETF.\n\nThe move comes after BlackRock (BLK) filed an application for a spot ETF and follows in the footsteps of other traditional financial institutions such as Invesco (IVZ) and Wisdomtree (WT) that revived their previously rejected applications.\n\nMarket-watchers have taken note of these developments, viewing them as significant due to BlackRock's reputation and confidence in obtaining regulatory approval. Investors too, have taken the cue, driving bitcoin prices to fresh highs.\n\nThere have been dozens of attempts to launch a spot-bitcoin product in the past, but many have faced opposition from regulators citing market concerns and investor protection.\n\nOne of the reasons commentators have been bullish on the prospect of BlackRock's bitcoin spot ETF approval is that it includes a surveillance sharing agreement with an unnamed bitcoin exchange based in the U.S., and this sort of arrangement is also mentioned in Cboe's recent filing.\n\n\n\nOther issuers, which include Valkyrie, Bitwise, VanEck, and ARK Investment Management, remain hopeful of securing regulatory approval this time around. Notably, this isn't the only area of crypto where traditional financial powerhouses are getting involved, as a new crypto asset exchange backed by Charles Schwab (SCHW), Fidelity, and others also recently launched.\n\nThis new interest from traditional financial institutions has clearly breathed new life into the crypto market after the industry had been shaken by SEC lawsuits against crypto exchange giants Binance and Coinbase (COIN)."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzI5L2Fzc2V0LW1hbmFnZXItZmlkZWxpdHktZmlsZXMtZm9yLXNwb3QtYml0Y29pbi1leGNoYW5nZS10cmFkZWQtZnVuZC_SAXRodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNi8yOS9hc3NldC1tYW5hZ2VyLWZpZGVsaXR5LWZpbGVzLWZvci1zcG90LWJpdGNvaW4tZXhjaGFuZ2UtdHJhZGVkLWZ1bmQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Fidelity Refiles for Spot Bitcoin ETF - CoinDesk",
        "content": "So far, the SEC has not made a decision regarding any of the new applications. While many seem optimistic about the application from BlackRock – which has received a green light for all of its previous 575 ETF applications, except one – some remain skeptical."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTI5L2ZpZGVsaXR5LWp1bXBzLWludG8tc3BvdC1iaXRjb2luLWV0Zi1yYWNlLXdpdGgtZnJlc2gtc2VjLWZpbGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Fidelity Files for Spot-Bitcoin ETF, Joining BlackRock in Crypto Race - Bloomberg",
        "content": "Fidelity Investments is the latest financial services heavyweight to throw its name into the race to offer the first US exchange-traded fund investing directly in Bitcoin.\n\nThe Boston-based asset manager, which has about $11 trillion in assets under administration and has tens of millions of customers, re-filed for the Wise Origin Bitcoin Trust, according to a document submitted Thursday with the US Securities and Exchange Commission. Similar to previous US spot Bitcoin ETF filings in the past few weeks, the updated application says that Fidelity expects to enter into a surveillance-sharing agreement with a US cryptocurrency exchange."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDYvMjkvZmlkZWxpdHktam9pbnMtdGhlLXJ1c2gtZm9yLWEtYml0Y29pbi1ldGYtZm9sbG93aW5nLWJsYWNrcm9jay1hcmstaW52ZXN0LWFuZC1vdGhlcnMuaHRtbNIBfGh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA2LzI5L2ZpZGVsaXR5LWpvaW5zLXRoZS1ydXNoLWZvci1hLWJpdGNvaW4tZXRmLWZvbGxvd2luZy1ibGFja3JvY2stYXJrLWludmVzdC1hbmQtb3RoZXJzLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Fidelity joins the rush for a bitcoin ETF, following BlackRock, Ark Invest and others - CNBC",
        "content": "Asset management giant Fidelity Investments is again trying to launch a spot bitcoin exchange-traded fund, according to a Thursday filing.\n\nThe move comes two weeks after BlackRock filed for a spot bitcoin ETF, which has long been opposed by the U.S. Securities and Exchange Commission.\n\nOther firms appear to have taken BlackRock's filing as a sign that the SEC's stance could soon change. Since then, WisdomTree, VanEck and Invesco have taken the initial steps toward their own funds. Cathie Wood's Ark Invest filed for changes to its proposed bitcoin fund Wednesday that brought it closer in line with BlackRock's application.\n\nThursday's filing is a proposed rule from the Cboe BZX Exchange to list the Wise Origin Bitcoin Trust, the name of Fidelity's previously proposed bitcoin ETF that was denied by the SEC. The exchange has made similar filings for other firms over the past two weeks.\n\nThe SEC has so far rejected every spot bitcoin fund application on which it has made a decision. The commission is in a legal battle with Grayscale about its decision to block the conversion of the Grayscale Bitcoin Trust into an ETF. A decision in that case is expected later this year.\n\nOne of the SEC's key concerns about a spot bitcoin product is transparency in the market and the potential for manipulation. The BlackRock filing includes a proposed surveillance-sharing agreement that could alleviate those concerns. The subsequent filings have similar proposals.\n\nThe SEC has already allowed the creation of ETFs that track bitcoin futures contracts, including the ProShares Bitcoin Strategy ETF (BITO) that has more than $1 billion in assets. The first leveraged bitcoin futures fund hit the market Tuesday.\n\nThe new rush for ETFs appears to have buoyed prices for bitcoin. The digital currency was trading near $30,500 Thursday afternoon, up from below $26,000 prior to the BlackRock filing."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmxlZGdlci5jb20vYWNhZGVteS90b3BpY3MvYmxvY2tjaGFpbi93aGF0LWlzLWEtYml0Y29pbi1taXhlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "What Is a Bitcoin Mixer? - Ledger",
        "content": "What Is a Bitcoin Mixer?\n\nBy Lipsa Das\n\nRead 6 min Medium\n\nSHARE\n\nKEY TAKEAWAYS: — Bitcoin mixers are software or third-party services that mix up your Bitcoin funds with other users’ funds to reduce the tracing of transactions.\n\n\n\n— There are two types of mixers: centralized mixers and decentralized mixers. Centralized mixers use a third party, while decentralized mixers use open-source protocols to mix transactions.\n\n\n\n— Crypto mixers offer users anonymity which can be integral to those living under oppressive regimes, but it can also open the door for criminal activity.\n\n\n\n— There are many potential risks of using mixers, such as violating local laws, receiving wallet flags, platform bans and more.\n\nFirst introduced in 2009, Bitcoin allows users to transact and trust each other across borders without needing banks 24/7. If that seems unfamiliar to you, make sure to read the guide on what Bitcoin is. However, for the purposes of this article, it’s important to understand that these benefits come with a trade-off.\n\nOne of the core concepts of what blockchain is offering — transparency — is not exactly privacy-friendly. To explain, the blockchain is freely available to everyone, and you can read every transaction on sites like block explorers. With this information and additional external data, you can link an arbitrary Bitcoin address to its owner. So, what do you do when you’d prefer not to share this information?\n\nMost people will never need to hide their blockchain transactions. However, for those living under oppressive regimes and require the freedom of moving their assets where they like, tools to protect users’ identities become imperative. But unfortunately, the very same tools that help such people survive also encourage bad actors.\n\nSpecifically, these tools are named crypto tumblers, or mixers and let you make anonymous transactions on the blockchain.\n\nBut what is a Bitcoin mixer exactly; how do they work, and are they even legal?\n\nLet’s dive in.\n\nWhat Is a Bitcoin Mixer?\n\nBitcoin mixers, also known as tumblers, are services that receive cryptocurrencies from users, pool them together, and then send the amounts to their corresponding recipient addresses. This is an effort to obfuscate the transaction trail.\n\nTo explain, if you’re using a mixer, the mixer’s address becomes the recipient of any outgoing transactions from your wallet instead of a specific Bitcoin address. Similarly, in the case of a recipient’s address, the address is again that of the Bitcoin mixer. If you want to see this in action, here’s how to read blockchain transactions.\n\nMixing funds hides the original sources, making it difficult for external observers to identify the specific senders or recipients.\n\nDepending on the mixer, service fees are generally quite low, ranging from 0.5% to 7% of the transaction.\n\nWhat Is a Bitcoin Mixer For?\n\nBitcoin mixers make crypto transactions harder to trace, thus preserving privacy and hiding the sender’s identity. Essentially, they serve as a way to anonymize crypto transactions.\n\nSo why would you want to use a crypto mixer?\n\nFirstly, many people using mixers live in countries with oppressive regimes. Not every country gives its citizens the same rights, meaning outspoken journalists, members of opposition parties, or even normal civilians may be in danger for expressing opposing views or beliefs. If citizens of such countries use a transparent transaction on the blockchain, they could be putting themselves at risk.\n\nSecondly, whistleblowers and investigative journalists can also benefit from this tool. Using a crypto mixer means they can pay and get paid for information across borders, but without revealing their sources.\n\nOf course, ‘anonymity’ also encourages bad actors to exist. Scammers often want to hide their identities, and crypto mixers are their tools of choice.\n\nFor instance, Bitcoin tumblers have a long history of money laundering and scams, with the first notable case in December 2013. Just four years after Bitcoin’s launch, the mixer Bitcoin Fog was used to launder 96000 BTC from a marketplace. These incidents continued well into 2021, with Bitcoin Fog allegedly funneling over $1.3 million BTC. US authorities finally arrested the founder of this tumbler, Roman Sterlingov, in 2021.\n\nSince then, US authorities have sanctioned many high-profile mixers, namely Blender.io and Tornado Cash. Similarly, German authorities also took down the infamous Chipmixer, and seized over $46 million in cryptocurrency.\n\nHow Do Crypto Mixers Work?\n\nCrypto mixers collect Bitcoin from their users, merge their transactions, and redistribute it.\n\nTo better understand this concept, let us take the example of a charity receiving donations anonymously. Instead of directly donating, multiple donors could pool their funds together and designate a third party to complete the actual transaction. As a result, the charity receives the donation without knowing the specific source.\n\nReplace this third party with a smart contract, and that’s essentially the foundation of a Bitcoin mixer. Usually, mixers also incorporate a slight delay in sending the Bitcoin to the destination address to avoid further detection.\n\nBitcoin mixers are of two types: centralized mixers and decentralized mixers.\n\nCentralized Mixers vs. Decentralized Mixers\n\nCentralized mixers are operated by private third-party services that users trust to mix their Bitcoin, while decentralized mixers are peer-to-peer protocols with an automatic mixing process.\n\nUsing centralized mixers, users send their funds to wallet addresses owned by these mixers, pay a service fee and mention where they want to send it. Once the mixer receives these funds, they combine them with other users’ funds in a pool and redistribute them. Good examples of centralized mixers include Yo!Mix and Mixtura.\n\nCentralized mixers, particularly, carry the additional risk of trusting a third party. You could potentially lose your funds if the network or the company shuts down. Since these mixers handle a large amount of money, they become attractive targets for hackers and pose risks of potential malicious intent from the company itself. Some centralized mixers might also save your info privately and tie you back to these transactions—and that defeats their whole purpose.\n\nOn the other hand, decentralized mixers use an open-source protocol, such as CoinJoin, to create an automatic permissionless mixing process. Essentially, they bank on multiple users using the protocol. Then, they consolidate their funds to a single large transaction, and route different Bitcoins to the destination addresses. The more people that use a decentralized mixer, the more efficient they become. That’s because an increased number of users reduces the odds of detection. A good example of a decentralized crypto mixer that uses CoinJoin includes JoinMarket.\n\nThe Wider Risks of Crypto Mixers\n\nWhile crypto mixers offer a degree of anonymity, it’s important to note that it’s not impossible to find out who sends and receives funds in this manner. Unfortunately, some crypto mixers aren’t as anonymous as they claim, and some are subject to local laws and regulations.\n\nFor example, Law enforcement agencies (such as the FBI) have sophisticated tools to trace the origin of funds sent through crypto mixers. This is easier to discover on mixers with limited users, or when tracking large sums of value.\n\nIn the case of fewer people participating in the service, tracing funds is simple. Since it’s less likely another user sent a similar amount of Bitcoin as yours, working out the source is entirely plausible. This can be particularly useful when trying to catch bad actors, but it also leaves people living under oppressive regimes vulnerable.\n\nFurther, some exchanges actively block these “mixed” tokens and coins due to security and compliance concerns. Thus, if using a crypto mixer, you might face similar issues across major exchanges, limiting how you can use crypto assets. So, while there are countless legitimate reasons to obfuscate your transactions, it’s often simply not that easy.\n\nBitcoin Mixers: Are They Illegal?\n\nWhile Bitcoin mixers are not illegal everywhere, many countries do limit their use, or even ban them entirely. Plus, since these mixing services can lend themselves to money laundering, they often attract increased scrutiny from regulators. Regulatory authorities often view mixers with suspicion, as they can hinder law enforcement efforts to track and trace suspicious transactions.\n\nTo combat this, countries like the US have placed restrictions on crypto mixers since they deal with money transfers. The US financial law enforcement agency, FinCEN, requires all mixers to register under the Bank Secrecy Act.\n\nFurther, in 2022, the US placed sanctions on major crypto mixers like Tornado Cash and Blender.io. The US Treasury held that Tornado Cash had been used for laundering over 7 billion dollars since its creation. Similarly, Blender.io helped a North Korean hacker group launder money.\n\nThese sanctions prohibit U.S. persons from doing business with both these services and freeze any assets they may have in the United States.\n\nSince many countries handle crypto mixers differently, consult your local crypto laws before using them.\n\nCan I Use a Crypto Mixer?\n\nSo, crypto mixers offer a novel way to benefit from the security and accessibility of the blockchain, without the burden of revealing your identity. For those under oppressive regimes or with political difficulties, this may be the only option. However, if you decide to use a crypto or Bitcoin mixer, it’s important to understand the risk involved. Before using any service that may obfuscate the origin of a specific set of funds, make sure you check your local laws and abide by them. You don’t want to use a crypto mixer and pay the price for it later.\n\nIf you want to keep your anonymity in crypto though, using a crypto mixer can be an interesting option. Only you know if using a crypto mixer is right for you. Now you know about how they work, you can navigate the market and decide whether that’s the right choice—because that’s the whole point of self-custody."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy51YWxycHVibGljcmFkaW8ub3JnL2xvY2FsLXJlZ2lvbmFsLW5ld3MvMjAyMy0wNi0yOS9ydXJhbC1hcmthbnNhcy1jcnlwdG8tbWluZXMtcHJvbXB0LW5vaXNlLWNvbXBsYWludHMtZnJvbS1yZXNpZGVudHPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Rural Arkansas 'crypto mines' prompt noise complaints from residents - KUAR",
        "content": "Last month, Gladys Anderson, who lives in the Bono community in Greenbrier, started hearing a loud, unbearable sound.\n\nA constant high-pitched hum, ranging from 60 to 70 decibels, is coming from a cryptocurrency mine built less than a half-mile away from her house.\n\n“You can hear it, especially at night,” she said, gesturing at the corner of her house where the bedrooms are located.\n\nCrypto mines are large collections of computers built to harvest cryptocurrency, a completely digital form of money not reliant on any central authority. The computers in Greenbrier are surrounded by a tall, opaque orange fence and signs that say “no trespassing.”\n\nThe mines are loud because of the fans needed to keep their hardware cool. In Greenbrier they generally run 24/7, staying on even at night.\n\nAnderson says she hears the ringing fan noise in every part of her large house, from the outdoor pool to the garage, to the guest house where her mother lives. When she isn't home, she says the sound is still \"burned into her brain.\"\n\nCarol Goforth is a professor of law at the University of Arkansas, Fayetteville, and has been studying the rise of cryptocurrency.\n\n“There's no coin behind Bitcoin,” she said. “There’s bits of data. There is nothing tangible, nothing physical. It's just alphanumeric sequences stored on computers.”\n\nWhen it comes to owning Bitcoin, the most popular cryptocurrency, Goforth says its value only comes from a belief in its worth by people who own it.\n\n“If I stop being willing to pay for it, it has no value.”\n\nIn some sense that's true of any form of currency. Dollars and cents only have value because society has agreed to give money value. Crypto is entirely electronic, as are most transactions done with actual currency. But with dollars, you can buy almost everything. Goforth says with Bitcoin, you can buy very little and it can be difficult to exchange it for actual currency.\n\nA new state law, Act 851, opened the door for more crypto mines to be built in Arkansas. Rep. Rick McClure, R-Malvern, presented the bill in committee on April 3 and it was signed into law about a week later.\n\n“As long as a data center is operating within the zoning laws, they shouldn't be singled out if they are in compliance with the ordinances that are already there,” McClure said in a legislative committee meeting.\n\nThe law prevents any kind of zoning or sound ordinance laws designed to “discriminate” against crypto mines and data centers. No one spoke for or against the bill, and only two lawmakers voted against it.\n\nA company called Green Digital LLC is drafting plans to build a crypto mine in the small town of Vilonia. According to a city councilman, the site would mimic the one in Greenbrier. Company representatives did not respond to requests for comment.\n\nAccording to an administrator in Faulkner County, the mines in Greenbrier are owned by an LLC called New Rays. When asked for comment on this story, CEO Ethan Wang said journalists are “fake news” and voiced his disappointment in the coverage he has seen so far.\n\nAt a Vilonia city council meeting last week, an ordinance was passed to cap noise in the town at 60 decibels, about the sound of a conversation.\n\nMellissa Blackwell, who lives just outside the Vilonia city limits, voiced her concern about the potential health effects on humans and wildlife in the area.\n\n“When living things are exposed to noise, it changes us,” she said.\n\nCity Councilman Steven Craig said he was indifferent about the mine.\n\n“I am open for any type of business coming to town, as long as you abide by zoning regulations. And that's where I see it might become an issue,” he said.\n\nA big argument for the mines is that they create jobs. Craig said the mine will create at most five new positions, which will probably be outsourced from Little Rock.\n\n“I am all for entrepreneurship and starting a business. If it creates one job, great. If it creates 100 jobs, even better,\" he said. \"Do I think those jobs are going to be coming from citizens within Vilonia? Probably not.”\n\nIn addition to noise complaints, law professor Carol Goforth says crypto mines use too much energy and are bad for the environment.\n\n“Bitcoin mines consume on an annual basis about the total energy consumption Ukraine had before the war.”\n\nBack in Greenbrier, Gladys Anderson says her family is struggling. Her son has autism and is nonverbal. She says he struggles to cope with the noise, but that it would be too much of an ordeal to move.\n\n“Even if I had the funds to do that, my kids have buried pets here. We have planted baby trees,” she said. “And why should I have to move? I was here first, and I'm not disturbing anybody in the community.”\n\nRepublican state Sen. Bryan King told Fayetteville station KUAF he’s considering drafting legislation to stop crypto mining in Arkansas. The north Arkansas city of Harrison has already put its plans for a crypto mine on hold.\n\nIn Vilonia, members of the city’s planning committee will meet Thursday to talk about the next steps of whether to approve plans for a new crypto mine."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wNi0yOC9taWNyb3N0cmF0ZWd5LXMtbXN0ci1zYXlsb3ItbWFrZXMtbGFyZ2VzdC1iaXRjb2luLXB1cmNoYXNlLXNpbmNlLXByaWNlcy1wZWFrZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "MicroStrategy's Saylor Makes Largest Bitcoin Acquisition Since Prices Peaked in Late 2021 - Bloomberg",
        "content": "MicroStrategy Inc. acquired about $347 million in Bitcoin during the second quarter, the largest purchase by the most prominent publicly-traded advocate of the cryptocurrency since prices peaked in late 2021.\n\nThe enterprise-software maker co-founded by crypto proponent Michael Saylor acquired 12,333 Bitcoin between April 29 and June 27 at an average price of $28,136, according to a US Securities and Exchange Commission filing on Wednesday. That brings the Tysons Corner, Virginia-based company’s Bitcoin purchases to around $4.5 billion, which is greater than it’s market capitalization of about $4.2 billion."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzI4L21pY2hhZWwtc2F5bG9ycy1taWNyb3N0cmF0ZWd5LW5vdy1ob2xkcy1vdmVyLTQ2Yi13b3J0aC1vZi1iaXRjb2luL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzI4L21pY2hhZWwtc2F5bG9ycy1taWNyb3N0cmF0ZWd5LW5vdy1ob2xkcy1vdmVyLTQ2Yi13b3J0aC1vZi1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Michael Saylor's MicroStrategy Now Holds Over $4.6B Worth of Bitcoin - CoinDesk",
        "content": "The company, which was founded by crypto billionaire Michael Saylor, is one of the largest HODLers of bitcoin. MicroStrategy also said it sold some $333.7 million of its shares as per a previously disclosed shares sale agreement."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjkvdXMtaW52ZXN0b3JzLWFyZS1kcml2aW5nLWJpdGNvaW5zLXByaWNlLXN1cmdlLWFzLWluc3RpdHV0aW9uYWwtZGVtYW5kLXJpc2VzL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjkvdXMtaW52ZXN0b3JzLWFyZS1kcml2aW5nLWJpdGNvaW5zLXByaWNlLXN1cmdlLWFzLWluc3RpdHV0aW9uYWwtZGVtYW5kLXJpc2VzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "U.S. Investors Are Driving Bitcoin’s Price Surge as Institutional Demand Rises - CoinDesk",
        "content": "\"The current institutional interest we are witnessing is far from the opportunistic FOMO [fear of missing out] we have seen in the past that can push prices up in the short term,\" Kerbage wrote. \"These institutions move slowly and deliberately and invest for the long term—once they are in, they are in.\""
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMjgvY3J5cHRvLW1pbmVycy1zZW50LW92ZXItMWItYml0Y29pbi10by1leGNoYW5nZXMtb3Zlci10d28td2Vla3MtY3J5cHRvcXVhbnQv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNi8yOC9jcnlwdG8tbWluZXJzLXNlbnQtb3Zlci0xYi1iaXRjb2luLXRvLWV4Y2hhbmdlcy1vdmVyLXR3by13ZWVrcy1jcnlwdG9xdWFudC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Crypto Miners Sent Over $1B Bitcoin to Exchanges Over Two Weeks: CryptoQuant - CoinDesk",
        "content": "Meanwhile, the past few days saw $128 million worth of bitcoin rewards sent to crypto exchanges, an amount estimated to total 315% of daily mining revenues, as per on-chain analytics firm Glassnode. This was the largest-ever sent amount on record by this metric."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjgvYml0Y29pbi1idWxscy1nZXR0aW5nLXJlYWR5LWZvci1zZWFzb25hbC1zdXJnZS1tYXRyaXhwb3J0L9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjgvYml0Y29pbi1idWxscy1nZXR0aW5nLXJlYWR5LWZvci1zZWFzb25hbC1zdXJnZS1tYXRyaXhwb3J0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Bulls Getting Ready for Seasonal Surge: Matrixport - CoinDesk",
        "content": "\"While summer tends to be a period of consolidation for bitcoin, a strong July tends to be followed by a mediocre August and a selloff in September,” wrote Markus Thielen, head of research."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjgvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLW1haW50YWlucy0zMGstYXMtdGhlLWVjb25vbXktaXNudC1icmVha2luZy1qdXN0LXlldC_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzI4L2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1tYWludGFpbnMtMzBrLWFzLXRoZS1lY29ub215LWlzbnQtYnJlYWtpbmctanVzdC15ZXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Maintains $30K as ‘the Economy Isn’t Breaking Just Yet’ - CoinDesk",
        "content": "Known for governmental efficiency, the city-state of Singapore scored highest overall for the three measures it could control: regulatory structure (35% of the total score and included in the drivers category), digital infrastructure (12%) and ease of doing business (10%), which are both part of the enablers category. That was enough to be firmly ensconced in second place despite middling scores for quality of life – due to a very high cost of living – and per-capita crypto jobs, companies and events, which comprise the opportunities category."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNi8yOC9hcmstYW1lbmRzLXNwb3QtYml0Y29pbi1ldGYtZmlsaW5nLXRvLWluY2x1ZGUtc3VydmVpbGxhbmNlLXNoYXJpbmctc2ltaWxhci10by1ibGFja3JvY2sv0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzI4L2Fyay1hbWVuZHMtc3BvdC1iaXRjb2luLWV0Zi1maWxpbmctdG8taW5jbHVkZS1zdXJ2ZWlsbGFuY2Utc2hhcmluZy1zaW1pbGFyLXRvLWJsYWNrcm9jay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Cathie Wood's ARK Amends Spot Bitcoin ETF Filing to Include Surveillance Sharing, Similar to BlackRock - CoinDesk",
        "content": "The inclusion of the agreement in BlackRock's application was seen as a potential breakthrough for the listing of a spot bitcoin ETF in the U.S., dozens of applications for which the SEC has rejected."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTI5L2JpdGNvaW4tdHVybnMtcmFuZ2UtYm91bmQtd2hpbGUtZXRmLWluc3BpcmVkLWV1cGhvcmlhLWRpc3NpcGF0ZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Price (BTC) Is Range-Bound After BlackRock ETF Excitement Fades - Bloomberg",
        "content": "Bitcoin has quickly settled into a narrow trading range after reaching a fresh one-year high, leaving reinvigorated enthusiasts wondering whether last week’s momentum will last.\n\nThe largest digital currency, which accounts for about half of the crypto sector’s $1.2 trillion market value, was about 1.7% higher to $30,600 on Thursday, even after Fidelity joined the list of firms to file for a Bitcoin ETF. The token has traded in a range of around $1,500 since hitting $31,410 last Friday."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTI4L3dvb2Qtcy1hcmstYWRkcy1wb3NzaWJsZS1zaWx2ZXItYnVsbGV0LXRvLWJpdGNvaW4tZXRmLWZpbGluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Wood's Ark Adds Possible 'Silver Bullet' to Bitcoin ETF Filing - Bloomberg",
        "content": "Cathie Wood ’s ARK Investment Management and digital-asset manager 21Shares amended their application for a US spot-Bitcoin exchange-traded fund to add a surveillance-sharing agreement.\n\nThe CBOE options exchange expects to enter into such an agreement with “an operator of a United States-based trading platform for Bitcoin,” according to Wednesday’s updated filing with the Securities and Exchange Commission. The language mimics a clause in BlackRock Inc.’s spot Bitcoin ETF filing, which landed roughly two weeks ago."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9taWNyby1zdHJhdGVneS1idXlzLTM0N20td29ydGgtb2YtYml0Y29pbi1hbWlkLW1hcmtldC10aGF30gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "MicroStrategy buys $347M worth of Bitcoin amid market thaw - Cointelegraph",
        "content": "On June 28, software analytics firm MicroStrategy announced the corporate purchase of 12,333 Bitcoin (BTC), worth $347 million at the time of publication. After the transaction, the total balance of BTC owned by MicroStrategy increased to 152,333 ($4.52 billion), with an average purchase price of $29,668 apiece.\n\nThe total average purchase price is close to the $28,136 purchase price disclosed in the day’s announcements. The coins were bought between April 27 and June 27. The purchase was partly financed with the issuance of new stock, as the company wrote:\n\n“On May 1, 2023, MicroStrategy entered into a Sales Agreement with Cowen and Company, LLC and Canaccord Genuity LLC, as sales agents, pursuant to which MicroStrategy may issue and sell shares of its class A common stock, par value $0.001 per share (“Shares”), having an aggregate offering price of up to $625.0 million from time to time through the Agents.”\n\nAs of June 28, MicroStrategy has issued and sold an aggregate of 1,079,170 shares under the agreement for total net proceeds of $337 million. Cointelegraph previously reported on April 5 that MicroStrategy added 1,045 BTC ($29.3 million) to its balance sheet. The company is led by Michael Saylor, who has been an outspoken advocate for Bitcoin and spearheading corporations’ charge to adopt the world’s largest cryptocurrency by market capitalization as a strategic asset.\n\nMicroStrategy has been actively purchasing Bitcoin with the use of cash and stock financing during the crypto bear market, sometimes irrespective of its current price. In Q1 2023, the firm reported its first profitable quarter since 2020 due to a one-time income tax benefit.\n\nDCA works. — CZ Binance (@cz_binance) June 28, 2023\n\nMagazine: Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’"
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjgvYml0Y29pbi1kcm9wcy1iZWxvdy0zMGstYXMtYWx0Y29pbnMtdHVtYmxlLWJ0Yy1kb21pbmFuY2UtcmVhY2hlcy0yNi1tb250aC1oaWdoL9IBf2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjgvYml0Y29pbi1kcm9wcy1iZWxvdy0zMGstYXMtYWx0Y29pbnMtdHVtYmxlLWJ0Yy1kb21pbmFuY2UtcmVhY2hlcy0yNi1tb250aC1oaWdoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Drops Below $30K as Altcoins Tumble; BTC Dominance Reaches 26-Month High - CoinDesk",
        "content": "\"With some newer tokens facing intensified regulatory scrutiny in the U.S., BTC has pulled ahead in 2023,\" Kyle Waters, analyst at digital asset research firm CoinMetrics, wrote in a report. \"We can see that BTC’s 85% return, year-to-date is outpacing most of the other major digital assets."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2NtZS1hZGRzLWV0aGVyLWJpdGNvaW4tcmF0aW8tZnV0dXJlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "CME Group to add ether/bitcoin ratio futures in July pending regulatory approval - Blockworks",
        "content": "CME Group announced plans to launch ether and bitcoin ratio futures on July 31, so long as they get regulatory approval.\n\n“Historically, ether and bitcoin have been highly correlated; however, as the two assets have grown over time, market dynamics may affect the performance of one more than the other, creating relative value trading opportunities,” said Giovanni Vicioso, CME Group’s global head of cryptocurrency products, said in a press release.\n\nThe futures will be cash-settled to the final settlement price of the CME’s ether futures and divided by the final settlement price of its bitcoin futures.\n\nThe listing cycle will be the same as CME’s bitcoin and ether futures contracts.\n\nAccording to Vicioso, this means that “investors will be able to capture ether and bitcoin exposure in a single trade, without needing to take a directional view.”\n\nXBTO’s Paul Eisma, head of options, said that “the launch of ether/bitcoin ratio futures completes the currency triangle allowing market makers such as XBTO the ability to arbitrage synthetically, for the first time, all three futures legs: the BTC/USD and ETH/USD dollar legs, and the ETH/BTC cross.”\n\nCME has expanded its crypto offerings this year, announcing in April that it would be expanding expiries for options on both bitcoin and ether futures contracts, making them available Monday through Friday.\n\nIt announced that it would be adding bitcoin futures to its event contracts earlier this year, though it first listed bitcoin futures back in 2017.\n\nIn 2022, CME added ether options contracts, an add-on to its ether contracts which were first listed in 2021. It listed bitcoin futures way back in 2017.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjgvYml0Y29pbi1vdGhlci1kaWdpdGFsLWFzc2V0cy1zdXJnZS1sYXRlLWluLXEyLW9uLXNwb3QtYml0Y29pbi1ldXBob3JpYS_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzI4L2JpdGNvaW4tb3RoZXItZGlnaXRhbC1hc3NldHMtc3VyZ2UtbGF0ZS1pbi1xMi1vbi1zcG90LWJpdGNvaW4tZXVwaG9yaWEvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Other Digital Assets Surge Late in Q2 on Spot Bitcoin Euphoria - CoinDesk",
        "content": "Note that Bitcoin and Ether – the cryptos with the largest values – Solana and crypto-based stocks have outperformed the indexes – no small achievement given stocks’ rise from 2022’s bear market – and that much of the digital asset market’s gains have occurred in the first quarter. A recent price spike following spot bitcoin filings by BlackRock and two other financial services powerhouses ensured bitcoin and other assets finished in positive territory for Q2."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzMwL2ZpcnN0LW1vdmVyLWFzaWEtbGFyZ2UtYml0Y29pbi1ob2xkZXJzLWNvbnRlbnQtdG8taG9sZC1sb25nLXBvc2l0aW9ucy1hbWlkLXJlZ3VsYXRvcnktdHVybW9pbC_SAY4BaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8zMC9maXJzdC1tb3Zlci1hc2lhLWxhcmdlLWJpdGNvaW4taG9sZGVycy1jb250ZW50LXRvLWhvbGQtbG9uZy1wb3NpdGlvbnMtYW1pZC1yZWd1bGF0b3J5LXR1cm1vaWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "First Mover Asia: Large Bitcoin Holders Content to Hold Long Positions Amid Regulatory Turmoil - CoinDesk",
        "content": "“Nonetheless, inflation pressures continue to run high, and the process of getting inflation back down to 2 percent has a long way to go,” Powell said, adding: “We see the effects of our policy tightening on demand in the most interest rate–sensitive sectors of the economy, particularly housing and investment. It will take time, however, for the full effects of monetary restraint to be realized, especially on inflation.”"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMjgvbWljaGFlbC1zYXlsb3ItbWljcm9zdHJhdGVneS1iaXRjb2luLWJ1eWluZy1zcHJlZS0zNDctbWlsbGlvbi_SAWhodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA2LzI4L21pY2hhZWwtc2F5bG9yLW1pY3Jvc3RyYXRlZ3ktYml0Y29pbi1idXlpbmctc3ByZWUtMzQ3LW1pbGxpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Michael Saylor’s MicroStrategy buys $347 million in Bitcoin following recent upswing - Fortune",
        "content": "After a strong month for the world’s most popular cryptocurrency, MicroStrategy is adding to its longstanding Bitcoin bet.\n\nThe company, led by cofounder and chairman Michael Saylor, said in a filing with the Securities and Exchange Commission on Wednesday that it had bought 12,333 coins for about $347 million between the end of April and Tuesday.\n\nThe newest purchase brings its total Bitcoin inventory to 152,333—acquired for $4.52 billion, at an average price of $29,668, according to a tweet by Saylor.\n\nMicroStrategy has acquired an additional 12,333 BTC for ~$347.0 million at an average price of $28,136 per #bitcoin. As of 6/27/23 @MicroStrategy hodls 152,333 $BTC acquired for ~$4.52 billion at an average price of $29,668 per bitcoin. $MSTR https://t.co/joHo1gEnR0 — Michael Saylor⚡️ (@saylor) June 28, 2023\n\nBitcoin on Wednesday morning was trading down about 2%, at $30,200.\n\nThe business software company purchased 1,054 Bitcoin in April for about $29.3 million in cash—at an average price of $28,016.\n\nUnder Saylor’s leadership—he stepped down as CEO in August but remains chairman, with a majority stake in the company—MicroStrategy started acquiring billions of dollars in Bitcoin as Saylor reasoned that inflation would render cash useless. Since 2020, the company has taken several massive losses on this gamble.\n\nMicroStrategy’s Bitcoin was worth about $5.9 billion at the end of the first quarter of 2022, but it’s fallen about 22% since then. Since the company began betting on Bitcoin in 2020, its stock has often correlated with Bitcoin’s price fluctuations.\n\nShares traded at about $123 in July 2020 before Saylor began the Bitcoin buying spree, and they reached a high of $1,272 in February 2021. As of Wednesday morning, the stock was trading near $322.\n\nDespite the losses, Saylor has not wavered in his commitment to the cryptocurrency. Earlier this month, the MicroStrategy chairman said he believes Bitcoin could eventually make up 80% of the crypto market. In June, Bitcoin surpassed 50% dominance in the market for the first time in two years.\n\n“The entire industry,” he told Bloomberg earlier this month, “is kind of destined to be rationalized down to a Bitcoin-focused industry, with maybe a half-a-dozen to a dozen other proof-of-work tokens.”"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vd3d3LmNhbGNhbGlzdGVjaC5jb20vY3RlY2huZXdzL2FydGljbGUvc3l0NXFycTAwbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Can BlackRock finally break down the SEC's objection to a bitcoin ETF? - CTech",
        "content": "Earlier this month, BlackRock, the largest asset manager in the world, with approximately $10 trillion under management, applied to launch an ETF (Exchange-Traded Fund) that tracks Bitcoin. If the request is approved, it will allow institutional investors to gain exposure to the cryptocurrency without actually purchasing it.\n\nOver the past six years, the U.S. Securities and Exchange Commission (SEC) has repeatedly denied such requests, even from large and well-known institutional players like Kathy Wood's technology-focused hedge fund firm Ark. Grayscale, a major player in the crypto market, even sued the SEC last October for refusing to approve a similar product. While it is still unclear whether BlackRock will receive the long-awaited approval, the mere possibility of institutional entities investing in the asset caused the price of bitcoin to increase by about 15% to a one-and-a-half-year high, surpassing $30,000. However, the current price is still about 53% lower than the currency's all-time high of over $65,000 in November 2021.\n\n1 View gallery Larry Fink, BlackRock CEO. ( Photo: AP )\n\nAccording to the application submitted to the SEC, BlackRock's iShares Bitcoin Trust fund will utilize the platform of the American trading exchange Coinbase and its Coinbase Custody services. If approved, the ETF is expected to be traded on the Nasdaq. BlackRock, whose founder and CEO Larry Fink once referred to bitcoin as an \"index for money laundering\" and claimed that the company's clients had no interest in the field, took a different approach in the summer of 2022. BlackRock established a connection with Coinbase to allow its private clients access to the crypto market, citing growing customer interest in the field in a letter to investors.\n\nBlackRock is an investment house that manages money for the general public worldwide. In Israel, operations are managed by Anath Levin, former deputy CEO of Bank Hapoalim and a senior executive at Clal Insurance and Migdal Insurance. BlackRock offers investors a wide variety of products, including many passive ones like ETFs. Additionally, it manages hedge funds, private equity funds, and debt funds.\n\nBlackRock has made its move at a time when the crypto market is trying to recover from months of distress. Last summer, several companies in the industry went bankrupt, leaving investors without access to their funds. Furthermore, BlackRock's ETF application comes after the SEC's recent enforcement actions against Binance and Coinbase for various securities law violations and, in some cases, defrauding investors.\n\nInterestingly, the man who once mocked bitcoin, Larry Fink, has now become the darling of the community, or at least significant parts of it. Galaxy Digital CEO Michael Novogratz, a long-time crypto investor, expressed that the launch of BlackRock's ETF \"will be the best thing that could happen to bitcoin.\"\n\nAn ETF on bitcoin would provide exposure to the currency without actual ownership. Instead of cumbersome purchases or using dubious platforms, investors would be able to buy shares that track the asset's price. For the past six years, the SEC has rejected requests to create such funds, except for those related to futures contracts. The SEC's rejections are based on various reasons, but a consistent and central concern is the potential for price manipulation on unsupervised platforms. The SEC has cited evidence of fake trading (wash trading) in the market and the ability of large players to manipulate bitcoin's price for personal gain. The lack of supervision and transparency in the crypto market makes it challenging for the SEC to monitor and detect fraud. Approving the requested ETF would raise concerns about investor protection.\n\n\n\n\n\nBlackRock addresses the SEC's concerns through a \"surveillance-sharing agreement\" between different exchanges, which is a first-of-its-kind effort in the crypto field. This, combined with BlackRock's positive track record of gaining SEC approval for similar products, leads some commentators to believe that BlackRock has a higher chance of success compared to previous applicants.\n\nBlackRock's move aligns with a trend of increasing institutional involvement in the crypto market. Last week, hedge fund Citadel, financial giant Fidelity, and investment bank Charles Schwab launched EDX Markets, a new crypto exchange targeting established players seeking distance from regulatory enforcement issues. Unlike traditional crypto exchanges, EDX does not offer custodial services, meaning it does not hold cryptographic assets itself. Instead, it serves as a platform where parties agree on prices and close transactions. Compared to existing exchanges, which have been associated with frauds and scams, EDX aims to reduce risk by trading only four cryptocurrencies that the SEC has not classified as securities."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzI4L21pY3Jvc3RyYXRlZ3lzLWJpdGNvaW4tcHVyY2hhc2VzLXRlbmQtdG8tYmUtc2hvcnQtdGVybS1uZWdhdGl2ZS1mb3ItcHJpY2VzLXJlc2VhcmNoLXNob3dzL9IBigFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzI4L21pY3Jvc3RyYXRlZ3lzLWJpdGNvaW4tcHVyY2hhc2VzLXRlbmQtdG8tYmUtc2hvcnQtdGVybS1uZWdhdGl2ZS1mb3ItcHJpY2VzLXJlc2VhcmNoLXNob3dzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "MicroStrategy's Bitcoin Purchases Tend to Be Short-Term Negative for Prices, Research Shows - CoinDesk",
        "content": "MicroStrategy began adding bitcoin to its balance sheet three years ago as a hedge against the Federal Reserve’s the-then ultra easy monetary policy. Recently, MicroStrategy’s CEO Micheal Saylor said that the crypto market is likely to become BTC-centric due to the recent U.S. regulatory crackdown on the digital assets industry."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjgvZmlyc3QtbW92ZXItYW1lcmljYXMtZmlyc3QtbGV2ZXJhZ2VkLWJpdGNvaW4tZXRmLWluLXVzLXRyYWRlcy01NW0tb24tZGF5LW9uZS_SAX1odHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzI4L2ZpcnN0LW1vdmVyLWFtZXJpY2FzLWZpcnN0LWxldmVyYWdlZC1iaXRjb2luLWV0Zi1pbi11cy10cmFkZXMtNTVtLW9uLWRheS1vbmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "First Mover Americas: First Leveraged Bitcoin ETF in U.S. Trades $5.5M on Day One - CoinDesk",
        "content": "Volatility Shares 2x Bitcoin Strategy ETF (BITX), the first leveraged bitcoin (and crypto) ETF in the U.S., started trading on Tuesday, witnessing $5.5 million of volume on its first day, according to data from Bloomberg. Action got off to a quick start, with volume of about $500K in the first 15 minutes after the open. By comparison, ProShares’ BITO – the first ever bitcoin ETF (futures-based) in the U.S. – saw roughly $1 billion in volume on its first day of trading in 2021. A number of futures-based bitcoin ETF products trade in the U.S., including now this new leveraged product. The SEC, however, has consistently blocked spot funds from launching – a stance that will again be tested after asset management giant BlackRock earlier this month applied to create a spot bitcoin ETF."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWdhaW5zLXRvcC0xMC1jcnlwdG8tMDA1NzIxNTIxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin gains with all top 10 crypto, Fidelity confirms Bitcoin ETF bid, U.S. economy rebounds - Yahoo Finance",
        "content": "Bitcoin gained along with all other top 10 non-stablecoin cryptocurrencies on Friday morning in Asia after data this week showed the U.S. economy expanded even in the face of repeated interest rate hikes. U.S. GDP grew faster than expected in the first quarter and initial jobless claims came in at less than expected. Also, asset manager Fidelity Investments on Thursday filed to offer a spot Bitcoin exchange-traded fund (ETF).\n\nAll top 10 cryptos rise\n\nBitcoin climbed 1.05% to US$30,453 over the last 24 hours to 6:40 a.m. in Hong Kong, according to data from CoinMarketCap. The world’s largest cryptocurrency by market capitalization is up 1.43% over the past seven days.\n\nEther rose 1.28% to US$1,853, but is down 1.4% for the week.\n\nAll top 10 non-stablecoin cryptocurrencies traded higher. Solana led the gains on a 12.35% jump and a 7.56% weekly gain. This despite the Thursday announcement from Cardinal, a Solana non-fungible token (NFT) protocol, that it will be winding down operations due to what it called a challenging macroeconomic environment.\n\nCardinal tweeted on Thursday that the team will disable new deposit instructions on July 19 and cease operations on features including staking and new NFT rentals.\n\nElsewhere, Fidelity has refiled an application for a spot Bitcoin ETF. The Thursday filing with the Securities and Exchange Commission (SEC) shows that the COBE exchange has proposed to list and trade shares of the Wise Origin Bitcoin Trust. The SEC rejected a Bitcoin ETF application from Fidelity in 2021.\n\nFidelity’s move follows a wave of U.S. spot Bitcoin ETF applications submitted by asset managers this month, including BlackRock, WisdomTree, Invesco and Bitwise, indicating institutions are confident in the profit potential of digital assets and demand.\n\n“To this point, the lack of a spot Bitcoin ETP exposes U.S. investor assets to significant risk because investors that would otherwise seek crypto asset exposure through a spot Bitcoin ETP are forced to find alternative exposure through generally riskier means,” the Fidelity filing said.\n\nStory continues\n\nOn Wednesday, investment management fund ARK Invest also filed an amendment to its April application for a spot Bitcoin ETF.\n\nThe total cryptocurrency market cap rose 1.24% to US$1.17 trillion, with trading volume dropping 12.22% to US$29.96 billion, according to CoinMarketCap data.\n\nLong-term Azuki collectors sell out\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the NFT market, the Forkast 500 NFT index dipped 0.79% to 2,852.82 in the 24 hours to 10:00 a.m. in Hong Kong. The index is down 1.79% for the week.\n\nNFT trading volume on Ethereum dropped 19.79% to US$20.87 million over the past 24 hours, while volume on the Bitcoin network rose 357.82% to US$13.38 million, according to CryptoSlam data.\n\nSales of Uncategorized Ordinals — CryptoSlam’s category of Bitcoin Ordinals that are not part of one established collection — rose 7.22% to US$9.25 million, making it the most-sold collection in the past day.\n\nSolana-based SMB Barrel Raffle, which started public minting on Thursday, saw the second-largest daily volume of US$5.1 million.\n\nTrading volume of Azuki Elementals dropped 46.5% to US$2.95 million, and the original Azuki collection saw a 7.76% drop to US$2.79 million.\n\nWhile the new Azuki Elementals sold out its 20,000 NFTs within 15 minutes when it began minting on Tuesday, collectors were “angry” as the new NFTs looked almost identical to the original Azuki collection, according to Yehudah Petscher, NFT strategist at Forkast Labs, the parent company of Forkast.News. That could potentially devalue the NFT collection as a whole, he said.\n\n“Tonight [on Thursday] the founder of Azuki, Zagabond, is meeting with the community to discuss the week’s mint, and likely address concerns,” Petscher said.\n\nAccording to data analytics firm Nansen on Twitter on Thursday: “Azuki and Beanz collectors that have held for over 1 year have been selling their NFTs post-Elementals mint.”\n\nMeanwhile, art auction house Sotheby’s plans to launch a new generative art program, or work generated from algorithms. That will be in partnership with Art Blocks, which powers generative minting technology to brands and artists, according to a Wednesday statement shared with Forkast via email.\n\n“This will allow generative art long form collections to be minted right on Sotheby’s own platform,” Petscher said. “Generative art is really beginning to spread its wings following the sale of ‘The Goose’ — The Ringers #879 — for US$5.4 million (US$6.2 million with fees) on June 15.”\n\nChina’s economy contracts for third month\n\nA steel factory oin Nantong, Jiangsu Province of China. Image: Getty Images\n\nAsia equity markets were mixed on the last day of the quarter as investors assessed fresh economic data from the U.S. and China.\n\nU.S. stock futures edged higher as of 11:00 a.m. in Hong Kong. Dow Jones Industrial Average futures edged up 0.01%, S&P 500 futures climbed 0.08%, and Nasdaq Futures added 0.19%.\n\nU.S. economic growth expanded faster than estimated in the first quarter, according to official data released Thursday. In the first quarter, the country’s gross domestic product (GDP) rose by an annualized rate of 2%, up from the previously estimated 1.3%.\n\nThe amount of initial jobless claims in the U.S. dropped by 26,000 to 239,000 for the week ended June 24, the largest decrease since October 2021.\n\nThe robust economic showing in the U.S. wasn’t repeated in China, where the country’s manufacturing activity contracted in June for the third month, the National Bureau of Statistics said Friday. The official manufacturing purchasing managers’ index came in at 49.0 for the month, compared to 48.8 in May. A reading below 50 indicates contraction.\n\nChinese Premier Li Qiang said on Tuesday that China was still on track to meet its 5% annual growth target.\n\nInvestors, however, still need to contend with more interest rate hikes this year in the world’s biggest economy. U.S. Fed Chair Jerome Powell has repeatedly said the Fed may raise rates at the next two meetings and repeated that message at a central bank gathering in Portugal this week.\n\nU.S. interest rates are now between 5% and 5.25%, the highest since 2006. The CME FedWatch Tool predicts an 86.8% chance for a 25-basis-point rate hike at the Fed’s next meeting on July 26. It predicts a 13.2% chance the Fed will leave rates unchanged.\n\n(Updates to add equities section.)"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzI5L2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1yZXRyZWF0cy1xdWlja2x5LXJlZ2FpbnMtMzBrLXBlcmNoLWFzLWludmVzdG9ycy1tdWxsLWV0Zi10aW1pbmctaW5mbGF0aW9uL9IBkwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzI5L2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1yZXRyZWF0cy1xdWlja2x5LXJlZ2FpbnMtMzBrLXBlcmNoLWFzLWludmVzdG9ycy1tdWxsLWV0Zi10aW1pbmctaW5mbGF0aW9uL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Retreats, Quickly Regains $30K Perch as Investors Mull ETF Timing, Inflation - CoinDesk",
        "content": "The capital city of Seoul is in the top tier for regulatory structure and scored high for ease of doing business and digital infrastructure – all criteria in which the government has a strong influence. Its grassroots’ embrace of crypto puts the country within the top 15% of the world in the crypto adoption index. But as the most populous hub in our final 15, it was hurt by a low opportunities score, which is a measurement of per-capita crypto jobs, companies and events. The sparse postings could be due to a cultural or language barrier, however, as we measured activity on Linkedin, Eventbrite and Meetup.com."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNtZWdyb3VwLmNvbS9tZWRpYS1yb29tL3ByZXNzLXJlbGVhc2VzLzIwMjMvNi8yOS9jbWVfZ3JvdXBfdG9fbGF1bmNoZXRoZXJiaXRjb2lucmF0aW9mdXR1cmVzb25qdWx5MzEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "CME Group to Launch Ether/Bitcoin Ratio Futures on July 31 - CME Group",
        "content": "CHICAGO, June 29, 2023 /PRNewswire/ -- CME Group , the world's leading derivatives marketplace, today announced plans to launch Ether/Bitcoin Ratio futures on July 31, pending regulatory review.\n\n\"Historically, ether and bitcoin have been highly correlated; however, as the two assets have grown over time, market dynamics may affect the performance of one more than the other, creating relative value trading opportunities,\" said Giovanni Vicioso, CME Group Global Head of Cryptocurrency Products. \"With the addition of Ether/Bitcoin Ratio futures, investors will be able to capture ether and bitcoin exposure in a single trade, without needing to take a directional view. This new contract will help create opportunities for a broad array of clients looking to hedge positions or execute other trading strategies, all in an efficient, cost-effective manner.\"\n\nThe Ether/Bitcoin Ratio futures will be cash-settled to the value of CME Group Ether futures final settlement price, divided by the corresponding CME Group Bitcoin futures final settlement price. The new contract will follow the same listing cycle as CME Group Bitcoin futures and Ether futures contracts.\n\n\"The launch of CME Group Ether/Bitcoin Ratio futures further expands the marketplace for institutions and sophisticated investors who want digital asset exposure in a regulated environment,\" said Jason Urban, Global Head of Trading at Galaxy. \"We're excited to support this product, which will appeal to investors looking to take advantage of changes between the two biggest digital assets by market capitalization. We commend CME Group's ongoing commitment to developing innovative offerings essential to building an enduring ecosystem for this asset class.\"\n\n\"The launch of Ether/Bitcoin Ratio futures completes the currency triangle allowing market makers such as XBTO the ability to arbitrage synthetically, for the first time, all three futures legs: the BTC/USD and ETH/USD dollar legs, and the ETH/BTC cross,\" said Paul Eisma, Head of Options Trading at XBTO. \"CME Group's innovative, regulated product will help increase volumes, reduce spreads, and give institutional crypto market participants a vehicle to express relative value between BTC and ETH.\"\n\n\"This new ETH/BTC cross-cryptocurrency contract from CME Group should allow investors more flexibility when hedging positions in non-dollar offshore markets,\" said Brooks Dudley of Marex Capital Markets, Inc. \"This marks another important advancement for CFTC-regulated cryptocurrency derivatives.\"\n\nFor more information on cryptocurrency options, please visit: www.cmegroup.com/ebr.\n\nAs the world's leading derivatives marketplace, CME Group (www.cmegroup.com) enables clients to trade futures, options, cash and OTC markets, optimize portfolios, and analyze data – empowering market participants worldwide to efficiently manage risk and capture opportunities. CME Group exchanges offer the widest range of global benchmark products across all major asset classes based on interest rates, equity indexes, foreign exchange, energy, agricultural products and metals. The company offers futures and options on futures trading through the CME Globex® platform, fixed income trading via BrokerTec and foreign exchange trading on the EBS platform. In addition, it operates one of the world's leading central counterparty clearing providers, CME Clearing.\n\nCME Group, the Globe logo, CME, Chicago Mercantile Exchange, Globex, and, E-mini are trademarks of Chicago Mercantile Exchange Inc. CBOT and Chicago Board of Trade are trademarks of Board of Trade of the City of Chicago, Inc. NYMEX, New York Mercantile Exchange and ClearPort are trademarks of New York Mercantile Exchange, Inc. COMEX is a trademark of Commodity Exchange, Inc. BrokerTec and EBS are trademarks of BrokerTec Europe LTD and EBS Group LTD, respectively. The S&P 500 Index is a product of S&P Dow Jones Indices LLC (\"S&P DJI\"). \"S&P®\", \"S&P 500®\", \"SPY®\", \"SPX®\", US 500 and The 500 are trademarks of Standard & Poor's Financial Services LLC; Dow Jones®, DJIA® and Dow Jones Industrial Average are service and/or trademarks of Dow Jones Trademark Holdings LLC. These trademarks have been licensed for use by Chicago Mercantile Exchange Inc. Futures contracts based on the S&P 500 Index are not sponsored, endorsed, marketed, or promoted by S&P DJI, and S&P DJI makes no representation regarding the advisability of investing in such products. All other trademarks are the property of their respective owners.\n\nCME-G\n\nSOURCE CME Group"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMjkvYml0Y29pbi1ob3ZlcnMtb3Zlci0zMDNrLWRlc3BpdGUtcmVuZXdlZC1pbmZsYXRpb24td29ycmllcy_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzI5L2JpdGNvaW4taG92ZXJzLW92ZXItMzAzay1kZXNwaXRlLXJlbmV3ZWQtaW5mbGF0aW9uLXdvcnJpZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Hovers Over $30.3K Despite Renewed Inflation Worries - CoinDesk",
        "content": "“Nonetheless, inflation pressures continue to run high, and the process of getting inflation back down to 2 percent has a long way to go,” Powell said, adding: “We see the effects of our policy tightening on demand in the most interest rate–sensitive sectors of the economy, particularly housing and investment. It will take time, however, for the full effects of monetary restraint to be realized, especially on inflation.”"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0Zi13aHktZG9lcy1ldmVyeW9uZS0wOTE2MDM0NDkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "What Is a Bitcoin ETF, and Why Does Everyone from Blackrock to Fidelity Want One? - Yahoo Finance",
        "content": "With more mainstream popularity than ever, many new people are interested in acquiring some Bitcoin. But many of the crypto-curious still view buying Bitcoin from a crypto exchange as an intimidating and opaque process. The technical aspects of holding Bitcoin—such as crypto wallets, Bitcoin addresses and private keys—are confusing to newcomers, and scare some investors away.\n\nAll of this has intensified the appeal of a Bitcoin ETF, or exchange-traded fund. Major financial institutions like Blackrock, Fidelity, and Invesco have applied with the U.S. Securities and Exchange Commission (SEC) to launch ETFs.\n\nWhat is an ETF?\n\n💸 An ETF is an investment vehicle that is publicly traded, like a stock, but tracks the performance of an underlying asset or index, rather than one company.\n\n🛢️ An ETF is a way for investors to get exposure to the value of its underlying asset, like gold or oil.\n\n📈 ETFs trade on a traditional stock exchange, and their value should rise when the asset increases in price, and fall when it decreases.\n\nSEC Approves First Leveraged Bitcoin Futures ETF\n\nThe first ETF launched in 1993, and they became popular as a way for retail investors to invest in a basket of assets at once. If you wanted to invest in 500 of the largest companies in America at once, you could buy shares in a S&P 500 ETF.\n\nA Bitcoin ETF works in much the same way as any other ETF. Investors buy shares in the ETF through whatever brokerage they buy stocks, and can trade them the same way they'd trade shares in Apple or Tesla.\n\nThe 2x bitcoin ETF $BITX has become effective, scheduled to launch Tuesday. I was doubtful it would happen but looks like it’s official. Could this be early sign of SEC lightening up? After $BITO launch I believe they made earlier 2x filers withdraw pic.twitter.com/XXxSt9xypu — Eric Balchunas (@EricBalchunas) June 23, 2023\n\nBitcoin ETFs track the current price of Bitcoin, and should act in lockstep with Bitcoin's price swings.\n\nStory continues\n\nWhy the need for a Bitcoin ETF?\n\nSo, why wouldn’t investors just buy Bitcoin?\n\nFor most regular retail investors, Bitcoin and cryptocurrencies in general still look risky.\n\nBesides having unclear regulations around them, owning Bitcoin requires keeping a Bitcoin wallet and trusting crypto exchanges, which are still uncharted territory for people unfamiliar with the space and require a certain level of self-education.\n\nHolding Bitcoin places the burden of security squarely on you, making you responsible for keeping your own private keys safe (unless you want to entrust them to the exchange). This may mean buying a hardware wallet to protect purchased Bitcoin, or storing private keys in a secure manner. You’d also have to work out how to file taxes for sales of Bitcoin that resulted in capital gains.\n\nHow To File Your Crypto Taxes In The U.S.\n\nWith a Bitcoin ETF, investors need not worry about private keys, storage, or security. They own shares in the ETF just like their shares of stock, and can gain exposure to the cryptocurrency market without having to go through the hoops of purchasing and holding crypto.\n\nAnd to put it plainly, that is an extremely appealing proposition for many regular folks—as well as sophisticated institutional investors.\n\nThat's why so many hedge funds and other investment firms have filed applications with the U.S. Securities and Exchange Commission (SEC) for Bitcoin ETFs. Gemini founders Cameron and Tyler Winklevoss were first out of the gate with an application for the Winklevoss Bitcoin Trust in 2013. In 2018, the U.S. Patent and Trademark Office awarded the Winklevoss brothers a patent for “exchange-traded products.\" But the SEC still hasn't approved their ETF—or any others.\n\nHow does a Bitcoin ETF work?\n\nA Bitcoin ETF is managed by a firm that buys and holds the actual Bitcoin; the price is pegged to the Bitcoin held in the fund. The firm lists the ETF on a traditional stock exchange, and you, the investor, trade the ETF just as you would any other stock. Bitcoin ETFs also offer new types of trading opportunities, including short-selling, where investors can bet against Bitcoin.\n\nBut there are also some key differences between a Bitcoin ETF and other ETFs.\n\nFirst, some ETFs, like those that track the S&P 500, represent equity shares, so you get a cut of the dividends that any company in the ETF pay to their shareholders. When Tesla pays a dividend and you have shares in an ETF that includes Tesla, you get a (smaller) dividend. Bitcoin is decentralized, so that won't happen with a Bitcoin ETF.\n\nSecond, just like with other ETFs, you have to pay fees to the company offering the ETF. But with a Bitcoin ETF, some portion of your fees would go to paying the custody and management fees for the purchase and storage of the Bitcoin that underlies the ETF.\n\nA brief history of Bitcoin ETF progress\n\nWhat’s so special about a Bitcoin ETF?\n\nA Bitcoin ETF in the U.S. is expected to bring a new level of mainstream trustworthiness and acceptance to Bitcoin investing. In 2020 and 2021, big publicly traded companies including Square and Tesla bought Bitcoin as an investment for their balance sheets, which spurred new adoption—but the cryptocurrency is still seen by many conservative investors as a risky bet or even a gimmick.\n\nThe approval of a Bitcoin ETF by the SEC would mean that institutional investors can more easily speculate on the price of Bitcoin. It would functionally bring Bitcoin to Wall Street, with the Bitcoin ETF traded through the same places as Tesla stock, bonds, gold, oil, or any other traditional assets.\n\nAnd it would likely be a huge boost to the price of Bitcoin.\n\nCannabis ETFs have become popular for many of the same reasons that Bitcoin ETFs have. Just like crypto, the marijuana industry is viewed as risky and uncertain by traditional investors who still want the opportunity to profit from it.\n\nBitcoin Price Stable Despite BitMEX Arrests and Trump's COVID Diagnosis"
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ub3J0aC1jYXJvbGluYS1ob3VzZS1wYXNzZXMtYmlsbC10by1zdHVkeS1iaXRjb2luLWhvZGxpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "North Carolina House passes bill to commission study on holding Bitcoin - Cointelegraph",
        "content": "A bill that would see North Carolina’s Department of State Treasurer study the feasibility and benefits of the state holding Bitcoin (BTC) has passed the lower house of the General Assembly.\n\nOn June 28, the North Carolina House of Representatives passed the bill which would commission a $50,000 study to examine “acquiring, securely storing, insuring, and liquidating” both gold bullion and “virtual currency [...] such as Bitcoin.”\n\nThe study would investigate what impact gold and cryptocurrency holdings would have if North Carolina held part of its funds in crypto and gold.\n\nSpecifically, it would research if such holdings would hedge against inflation and “systemic credit risks,” and if gold and crypto could reduce volatility, increasing the state’s portfolio returns.\n\nThe bill mulls potentially creating a state-administered depository for crypto that would see North Carolina as the custodian of its digital asset holdings.\n\nThe study would, however, examine the costs and benefits of using a “privately managed depository or another state’s depository.”\n\nThe 120-member House passed the bill, with 73 voting in favor, 40 against and seven absent.\n\nThe bill must pass the Senate before it’s either signed into law or vetoed by Governor Roy Cooper.\n\nRelated: Yes, the Secret Service has an NFT collection, and no, it’s not for sale\n\nOn May 3, North Carolina’s House unanimously passed a bill that would prohibit payments to the state using a central bank digital currency (CBDC).\n\nThe bill stipulated the United States Federal Reserve would also be barred from using North Carolina to test any future pilot CBDC.\n\nThe day before, on May 2, a one-year moratorium on crypto mining was passed by the Board of Commissioners for Buncombe County in North Carolina.\n\nOpinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ0Yy1uby1sb25nZXItZmF2b3JlZC1pbGxpY2l0LWNyeXB0by1hY3Rpdml0eS10cm0tbGFic9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin no longer crypto of choice for illicit crypto activity: TRM Labs - Cointelegraph",
        "content": "According to new research, fewer cybercriminals are turning to Bitcoin as their primary method of moving illicit funds, with bad actors opting to go back to fiat channels or choosing other cryptocurrencies.\n\nDigital asset compliance and risk management firm TRM Labs revealed that illicit finance volumes involving Bitcoin (BTC) had fallen significantly over the past seven years, according to its “Illicit Crypto Ecosystem Report,” released on June 28.\n\nTRM Labs said instead a new multichain era has led to a “qualitative leap” away from Bitcoin as a primary means of moving criminal proceeds. The firm also highlighted that cash and other forms of fiat-related finance remain the “default” means of criminal money movements.\n\n“Indeed, cash and even older forms of finance such as hawala (transferring money without physically moving it) remain the default means by which illicit activity is financed and its proceeds are laundered.”\n\nTRM Labs also noted that while illicit activity involving crypto has increased, “crypto did not invent these criminal forms.\"\n\nThe firm reported that around $2 billion in crypto was stolen through attacks on cross-chain bridges in 2022, but very little of that was Bitcoin.\n\nCharts showing the volume of Bitcoin used across various types of illicit activity. Source: TRM Labs\n\n“The multi-chain era has had a sweeping impact on the distribution of illicit crypto volume as a whole,” it noted, adding that Bitcoin’s share of illicit transactions plummeted from 97% in 2016 to just 19% in 2022.\n\nFurthermore, while two-thirds of the crypto hack volume was in Bitcoin back in 2016, that had fallen to just under 3% by 2022. The slack was taken up by Ethereum (68%) and BNB Smart Chain (19%), it said.\n\nMeanwhile, Bitcoin was also once the “exclusive currency” for terrorist financing back then as well, but by 2022 it had been “all but replaced” by Tron, with 92%, TRM Labs claims.\n\nAdditionally, TRM Labs claims that there has been a 240% increase in the use of Tether (USDT) among the terror financing entities that it tracked in 2022.\n\nUse of USDT and BTC for terrorist financing. Source: TRM Labs\n\nThe latest illicit finance figures in crypto may be brighter news for Bitcoin, which in recent days looks to be back on the table for institutional adoption.\n\nHowever, the cryptocurrency saw at least $7.8 billion paid into Ponzi and pyramid schemes, as much as $1.5 billion was spent on darknet markets specializing in narcotics, and $3.7 billion was stolen through DeFi hacks and exploits in 2022, according to TRM Labs.\n\nRelated: North Korea and criminals are using DeFi services for money laundering\n\nEarlier this year, Cointelegraph reported that 2022 set a new record for illicit crypto transactions. The total cryptocurrency value received by illicit addresses topped $20 billion last year, according to analytics firm Chainalysis.\n\nMagazine: Hall of Flame: William Clemente III tips Bitcoin will hit six figures toward end of 2024"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTA2LTI5L2ZpZGVsaXR5LWJsYWNrcm9jay1jaXRhZGVsLW1vdmUtaW4tb24tY3J5cHRv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Fidelity, BlackRock, Citadel Move in on Crypto - Bloomberg",
        "content": "In this issue of the Bloomberg Crypto newsletter, Emily Nicolle takes stock of a June wave of crypto incursions by some of the biggest names in traditional finance\n\nWhile crypto investors are tying themselves up in knots over the ongoing US crackdown, a flopped NFT collection and what’s next for FTX, powerful players in traditional finance are quietly laying the groundwork for a possible industry takeover."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9wdGlvbnMtZXhwaXJ5LTMway1yZXNpc3RhbmNlLWFuZC1wcmljZS1pbXBhY3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin options: How will Friday's $4.7B expiry impact BTC price? - Cointelegraph",
        "content": "The $4.7 billion Bitcoin (BTC) monthly options expiry on June 30 might play a decisive role in determining whether the $30,000 price will consolidate as long-term support and open room for further bullish momentum.\n\nWhy is Bitcoin breaking yearly highs?\n\nMany analysts consider Bitcoin’s recent breakout above $27,000 to be a bet on the multiple spot Bitcoin exchange-traded fund (ETF) applications, including those of BlackRock and ARK Invest.\n\nThe news also fueled expectations for Grayscale to be able to convert its Grayscale Bitcoin Trust to a Bitcoin ETF.\n\n$31,000 caps Bitcoin price gains for now\n\nOn the other hand, Bitcoin bears will try to take advantage of macroeconomic and regulatory headwinds, including exchanges implementing mandatory Know Your Customer (KYC) procedures.\n\nOn June 28, KuCoin announced an upcoming KYC system upgrade in a move to increase compliance with global Anti-Money Laundering regulations.\n\nMoreover, there’s increasing concern over the impact of miners’ sell pressure, with the network hash rate reaching 400 exahashes per second. Analytics firm Glassnode noted that miners sent an all-time high percentage of their BTC revenue to exchanges over the past week, totaling $128 million. Curiously, the movement mimics spikes seen during the 2021 bull run as miners took profits.\n\nAdditionally, during the European Central Bank Forum on Central Banking in Portugal, Federal Reserve Chair Jerome Powell warned that most policymakers expect two more rate hikes this year. According to the CME's FedWatch Tool, investors are pricing in 82% odds of a 25-basis-point interest rate increase on July 26.\n\nBitcoin 4-hour price movements during option expiries. Source: TradingView\n\nBitcoin price last flirted with the $31,000 level on June 27, but the resistance proved stronger than anticipated. The subsequent correction to $30,000 supports the thesis of sideways trading in the short term as investors evaluate the impacts of additional interest rate increases by the Fed.\n\nSuch a restrictive scenario for the global economy might explain why some Bitcoin traders decided to take profits, which limited the price upside.\n\n$4.7 billion out of reach — bulls were too optimistic\n\nThe open interest for the June 30 options expiry is $4.7 billion, but the actual figure will be lower since bulls were expecting price levels of $32,000 or higher. These traders got excessively optimistic after Bitcoin’s price rallied 25.5% between June 15 and June 23, testing the $31,000 resistance.\n\nDeribit Bitcoin options aggregate open interest for June 30. Source: Deribit\n\nThe 0.56 put-to-call ratio reflects the imbalance between the $3.1 million in call (buy) open interest and the $1.7 million in put (sell) options.\n\nBut if Bitcoin’s price remains near $30,500 at 8:00 am UTC on June 30, only $630 million worth of these call (buy) options will be available. This difference happens because the right to buy Bitcoin at $31,000 or $32,000 is useless if BTC trades below that level on expiry.\n\nBitcoin bears aim for sub-$30,000 to balance the scales\n\nBelow are the four most likely scenarios based on the current price action. The number of options contracts available on June 30 for call (bull) and put (bear) instruments varies depending on the expiry price. The imbalance favoring each side constitutes the theoretical profit.\n\nBetween $28,000 and $29,000: 7,200 calls vs. 16,200 puts. Bears are in control, profiting $250 million.\n\n7,200 calls vs. 16,200 puts. Bears are in control, profiting $250 million. Between $29,000 and $30,000: 13,000 calls vs. 12,600 puts. The result is balanced between put and call options.\n\n13,000 calls vs. 12,600 puts. The result is balanced between put and call options. Between $30,000 and $31,000: 1,500 calls vs. 2,100 puts. The net result favors the call instruments by $440 million.\n\n1,500 calls vs. 2,100 puts. The net result favors the call instruments by $440 million. Between $31,000 and $32,000: 3,300 calls vs. 800 puts. The net result favors the call instruments by $670 million.\n\nThis crude estimate considers the call options used in bullish bets and the put options exclusively in neutral-to-bearish trades. Even so, this oversimplification disregards more complex investment strategies.\n\nFor instance, a trader could have sold a put option, effectively gaining positive exposure to Bitcoin above a specific price. Unfortunately, there’s no easy way to estimate this effect.\n\nRelated: Will $30K be a new springboard for Bitcoin bulls?\n\nConsequently, it will come down to whether BTC price bears are willing to risk exposure while a potential spot Bitcoin ETF approval is being analyzed by the SEC.\n\nAlthough it is impossible to estimate the potential inflow or the timing of such an event, it paves the way for bulls to secure a $440 million profit by keeping Bitcoin price above $30,000 in the short term.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA2LzI4L3N5c2NvaW4tZGV2ZWxvcGVyLWxhdW5jaGVzLWV0aGVyZXVtLWNvbXBhdGlibGUtbGF5ZXItMi1uZXR3b3JrLXNlY3VyZWQtYnktYml0Y29pbi1taW5lcnMv0gGGAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDYvMjgvc3lzY29pbi1kZXZlbG9wZXItbGF1bmNoZXMtZXRoZXJldW0tY29tcGF0aWJsZS1sYXllci0yLW5ldHdvcmstc2VjdXJlZC1ieS1iaXRjb2luLW1pbmVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Syscoin Developer Launches Ethereum-Compatible Layer 2 Network Secured by Bitcoin Miners - CoinDesk",
        "content": "“Merged mining is a way to provide another system to open the doors to scale into a rollup,” Sidhu said in an interview. He said the project has been in the works for eight years."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tb3RoZXItdG9wLTEwLWNyeXB0b3MtcmlzZS1maWRlbGl0eS1zYWlkLXRvLXBsYW4tc3BvdC1iaXRjb2luLWV0Zi1hcHBsaWNhdGlvbi1pbi11LXMv0gF1aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvYml0Y29pbi1vdGhlci10b3AtMTAtY3J5cHRvcy1yaXNlLWZpZGVsaXR5LXNhaWQtdG8tcGxhbi1zcG90LWJpdGNvaW4tZXRmLWFwcGxpY2F0aW9uLWluLXUtcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, other top 10 cryptos rise; Fidelity said to plan spot Bitcoin ETF application in U.S. - Forkast News",
        "content": "Bitcoin rose on Wednesday morning in Asia as all top 10 cryptocurrencies traded higher after strong gains on Wall Street amid signs the U.S. economy is in stronger shape than expected. Additionally, more traditional financial institutions are venturing into the U.S. digital asset industry, with asset manager Fidelity reportedly preparing for a spot Bitcoin exchange-traded fund (ETF) application.\n\nAll top 10 cryptos rise\n\nBitcoin climbed 1.3% to US$30,606 over the last 24 hours to 7:10 a.m. in Hong Kong, according to data from CoinMarketCap. The world’s largest cryptocurrency by market capitalization is up 8.51% over the past seven days.\n\nEther rose 1.63% to US$1,887 for a gain of 5.61% for the week.\n\nAll top 10 non-stablecoin cryptocurrencies traded higher, with Polygon leading the gains on a 3.26% jump and a 5.96% weekly gain.\n\nFidelity is close to filing an application for a spot Bitcoin ETF in the U.S., The Block news site reported on Tuesday, citing a source familiar with the matter. This follows a wave of U.S. spot Bitcoin ETF applications submitted by asset managers this month, including BlackRock, WisdomTree, Invesco and Bitwise, indicating institutions are confident in the profit potential in digital assets.\n\nHowever, all the applications will need approval from the Securities and Exchange Commission and Fidelity’s previous attempt to offer a spot Bitcoin ETF in the U.S. in 2021 was rejected. It did however launch the Fidelity Advantage Bitcoin ETF in Toronto, Canada, in December 2021. The ETF has risen 75% since the beginning of this year.\n\nInvestors are also reacting to reports HSBC, one of the world’s top 10 banks, is reportedly offering Bitcoin and Ether futures ETFs on its investment platform for bank customers in Hong Kong.\n\nHSBC did not respond to requests seeking clarification on exactly when the products became available to clients as they were listed on the Hong Kong stock exchange in December. However, the development is seen as significant as the bank has traditionally been frosty toward cryptocurrencies, preventing clients from transferring funds from HSBC accounts directly to crypto exchanges.\n\n“Although these crypto ETFs [in Hong Kong] are based on CME futures and are not physically backed like many of the [exchange traded products] in Europe, this is certainly very positive news for investors in the region who want to get regulated exposure to price movements in Bitcoin and Ethereum,” Bradley Duke, co-CEO at Europe-based ETC Group, said in an emailed statement.\n\nThe total cryptocurrency market cap rose 1.21% to US$1.19 trillion, with trading volume dropping 8.08% to US$35.49 billion, according to CoinMarketCap data.\n\nAzuki Elementals NFTs take off\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dipped 0.79% to 2,876.23 in the 24 hours to 8:30 a.m. in Hong Kong. The index is down 0.72% for the week.\n\nThe decline was mainly driven by the Forkast ETH NFT Composite, which fell 1.54%, said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\n“This may reflect traders selling their existing assets to buy the new Azuki Elementals collection,” Petscher added. “It also reflects a major sell-off in the main Azuki and Beanz collections, as traders had been buying those in order to have a shot at the [Elementals] presale [on Tuesday].”\n\nNFT trading volume on Ethereum jumped 307% to US$67.19 million over the past 24 hours, while volume on the Bitcoin network fell 81.61% to US$1.56 million, according to CryptoSlam data.\n\n“As expected, Azuki exploded and gave Ethereum its biggest day of sales volume of the year,” Petscher said, adding that with wash trades removed, it should be the most sales since May 2022 when Otherdeeds NFTs were minted.\n\nNotably, CryptoSlam’s top four collections by trading volume are all Azuki-related collections. The new Azuki Elemental Beans collection saw total transactions of about US$36.36 million with the new Azuki Elementals recording US$4.87 million.\n\n“It’s worth noting that these big volume days may be healthy, but big mints also extract liquidity from the ecosystem,” Petscher said Tuesday on Twitter. “Will we see some big secondary sales that then flow back into existing projects or will this be another cycle of liquidity being extracted?”\n\nAsia stocks mixed, China industrial profits sink\n\nChinese Premier Li Qiang. Image: Getty Images\n\nAsia equity markets were mixed on Wednesday morning following Wall Street’s overnight rally mainly driven by rebounding home sales and strengthened consumer confidence.\n\nHowever, U.S. stock futures edged lower as of 10:50 a.m. in Hong Kong. Dow Jones Industrial Average futures dipped 0.04%, S&P 500 futures slipped 0.16%, and Nasdaq Futures dropped 0.36%.\n\nIn China, profits at industrial firms sank 18.8% in the first five months of this year, on the back of a slowing post-Covid economic recovery, according to official data released Wednesday.\n\nPremier Li Qiang said at the so-called Summer Davos Forum on Tuesday in China that the country was still on track to hit its annual growth target of around 5%. “GDP grew by 4.5% in the first quarter year-on-year, and is expected to expand faster in the second quarter than in the first,” Li said.\n\nElsewhere in the region, South Korea’s consumer sentiment index climbed in June to beat expectations and reach the highest since May last year.\n\nIn Australia inflation eased more than expected in May. Its monthly consumer price indicator rose 5.6% in the 12 months to May, the smallest increase since April 2022, the Australian Bureau of Statistics (ABS) data showed Wednesday\n\n“While prices have kept rising for most goods and services, many increases were smaller than we have seen in recent months,” Michelle Marquardt, head of prices statistics at the ABS, said in a Wednesday statement.\n\nWhile the economic indicators out of the U.S. this week showed the economy is holding up despite inflation and higher interest rates, investors will hear more from Federal Reserve Chairman Jerome Powell when he speaks at events in Europe. Last week he said there may be more rate increases this year in the U.S.\n\nPowell will speak at the European Central Bank Forum in Sintra, Portugal, on Wednesday and again on Thursday at the Banco de España Fourth Conference on Financial Stability in Madrid, Spain.\n\nU.S. interest rates are now between 5% and 5.25%, the highest since 2006. The CME FedWatch Tool predicts a 76.9% chance for another 25-basis-point rate hike, and a 23.1% chance the Fed will leave rates unchanged at the next meeting on July 26.\n\n(Updates to add South Korea data in equities section.)"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LnRoZWluZm9ybWF0aW9uLmNvbS9hcnRpY2xlcy9iaWctd2lubmVycy1vZi10aGUtYml0Y29pbi1ib29tLWZ0eHMtbWVzc3ktd2Vi0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Big Winners of the Bitcoin Boom; FTX's Messy Web - The Information",
        "content": "Bitcoin is having a moment. Since the start of June, the most popular cryptocurrency by market capitalization has surged 12%. That jump has coincided with traditional financial firms, which have long been wary of crypto, embracing bitcoin in a big way.\n\nBlackRock, the world’s largest asset manager, applied for a bitcoin exchange-traded fund on June 15. That kicked off a string of copy cat moves by BlackRock competitors like Invesco. If these funds are approved—the SEC has so far only approved bitcoin futures ETFs as opposed to ones that directly invest in bitcoin—that could uncork a fresh wave of demand for bitcoin by giving investors an easy way to pile in."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiOmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZGlwcy1idXQtaG9sZHMtYWJvdmUtdXMzMDAwMC_SAT5odHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWRpcHMtYnV0LWhvbGRzLWFib3ZlLXVzMzAwMDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin dips but holds above US$30,000 - Forkast News",
        "content": "Bitcoin fell in Wednesday afternoon trading in Asia but is still holding above US$30,000 on market positivity as more traditional financial institutions show interest in digital assets and plan on introducing Bitcoin exchange-traded fund (ETF). Ether and all other top 10 non-stablecoin cryptocurrencies fell in the past 24 hours.\n\nSee related article: Sony Network Communications to invest in Japanese Web3 developer Startale Labs\n\nCrypto stumbles, investor optimism endures\n\nBitcoin fell 0.76% to US$30,178 in the 24 hours to 4 p.m. in Hong Kong, the smallest drop among other top 10 cryptos, according to data from CoinMarketCap. The world’s largest cryptocurrency by market capitalization is up 4.54% over the past seven days.\n\n“Bitcoin has benefitted from the U.S. banking confidence crisis earlier this year and the [Securities and Exchange Commission’s] lawsuits [against crypto exchanges] as well as the enthusiasm around the potential launch of a Bitcoin ETF,” Denys Peleshok, head of Asia at London-based financial trading firm CPT Markets, said in an emailed statement on Tuesday.\n\n“Bitcoin ETF applications have supported investors’ sentiment as institutional and retail investors show increasing interest in the market through such investment vehicles. If the SEC approves new applications, the market could record a surge in demand and in the number of buyers,” Peleshok added.\n\nAccording to Matteo Greco, research analyst at digital asset and fintech investment firm Fineqia International, it is the first time since February 2022 that Bitcoin is showing a positive delta on the year-on-year price metric. However, this alone does not confirm if the bear market is over.\n\n“But the combination of good news at the macroeconomic level and the news concerning BTC adoption of institutions gave the market a boost to head towards a good Q2, following an already convincing Q1 in 2023,” Greco said in an emailed statement on Tuesday.\n\nEthereum, the second biggest cryptocurrency, dropped 1.30% to US$1,850 in 24 hours, but is up 2.10% on the week.\n\nAll other top 10 non-stablecoin cryptos fell on Wednesday afternoon trade with Solana leading losses. The token dropped 4.33% to US$15.97, bringing its weekly losses to 5.11%. Cardano’s ADA token dropped 2.32% to US$0.2761 in the past 24 hours, losing 0.81% on the week.\n\nThe SEC named several altcoins as financial securities, including Solana, Cardano, Polygon and BNB, in the week of June 5, while filing lawsuits against crypto exchanges Binance.US and Coinbase. Altcoin prices have taken a hit since then as investors’ funds seem to be flowing into Bitcoin.\n\nMore traditional financial institutions are venturing into the U.S. digital assets space. Fidelity is reportedly applying for a spot Bitcoin ETF in the U.S., according to crypto news site The Block. This follows a series of U.S. spot Bitcoin ETF applications submitted by asset managers earlier this month, including BlackRock, WisdomTree, Invesco and Bitwise.\n\nInvestor sentiment was further boosted by reports of banking giant HSBC offering Bitcoin and Ether futures ETFs on its “Easy Invest” mobile application. These investment products were listed on the Hong Kong Stock Exchange last December.\n\n“We are happy to see more interest and demand in the digital assets space, but we would suggest that while ETFs are more convenient for many types of investors, that doesn’t make them better,” Michael Silberberg, head of investor relations at AltTab Capital, said in an emailed statement on Tuesday.\n\n“BTC ETFs, including those now in Hong Kong, are all futures ETFs that have historically lagged the pricing upside of just holding BTC and taken larger downswings,” Silberberg pointed out.\n\nTotal crypto market capitalization dipped 1.03% to US$1.17 trillion, while market volume rose 4.76% to US$37.34 billion in the past 24 hours.\n\nAzuki Elementals NFT disappoints\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dipped 1.05% to 2,860.44 in 24 hours to 5.45 p.m. in Hong Kong, bringing its weekly losses to 1.37%.\n\nThe Forkast ETH NFT Composite also dropped 0.84% to 979.43, part of a 1.65% seven-day loss.\n\nNFT trading volume on Ethereum rose 307.62% to US$71.57 million in 24 hours, according to CryptoSlam data.\n\nSolana overtook Bitcoin as the blockchain with the second-highest NFT sales volume over the past day. NFT sales volume on Solana rose 67.91% to US$2.73 million, while that on Bitcoin dropped 69.87% to US$1.51 million.\n\nCryptoSlam’s top four collections by trading volume are all Azuki-related collections. Azuki Elemental Beans collection clocked sales of US$36.59 million in 24 hours, while Azuki Elementals recorded sales of US$8.93 million.\n\nThe main Azuki collection rose 1.84% to US$7.87 million, and Beanz rose 2.10% to US$2.52 million in 24 hours.\n\nElementals, an Azuki spin-off consisting of 20,000 NFTs, transacted nearly US$8 million in secondary action in the past 24 hours. Combined with the primary sale, and Azuki’s Beanz and Elemental Beanz sales, the Ethereum NFT ecosystem saw its best day in over one year, according to Yehudah Petscher, NFT strategist at Forkast Labs, the parent company of Forkast.News.\n\n“However, collectors of Elementals aren’t just underwhelmed. They are angry. The collection’s art looks nearly identical to the original Azuki collection, leading many to believe the project has just devalued the ecosystem. The mint itself was a borderline disaster as well, though the 15-minute sell-out brought in US$38 million for the team,” Petscher said.\n\nAzuki,\n\n\n\nIt's always both challenging & exciting opening up the gate to the Garden.\n\n\n\nThis time, we missed the mark.\n\n\n\nWe hear you – the mint process was hectic, the PFPs feel similar and, even worse, dilutive to Azuki. — Azuki (@Azuki) June 28, 2023\n\nHolders of Azuki NFTs were given a 10-minute presale mint, and the next 10 minutes opened up to Beanz holders. In the end, many Azuki holders were left stuck with a loading message and could not mint. Beanz holders were upset that very few were left for them, and no Elementals made it to public sale, Petscher said.\n\n“This was all but a worst case scenario for NFTs as it shows little has been learned over the past few years, and projects seem to be focused on profits first, and maybe exclusively,” he added.\n\nAsian equities mixed; European bourses gain\n\nStock market display on the street. Image: Envato Elements\n\nAsian equity markets showed mixed results on Wednesday, reacting to news that profits of industrial firms in China sank 18.8% year-on-year in the first five months of 2023, due to a slower-than-expected post-Covid recovery.\n\nAt the end of Asian trading hours on Wednesday, the Shanghai Composite remained unchanged while the Shenzhen Component dropped 0.47%. Hong Kong’s Hang Seng Index gained 0.12% and Japan’s Nikkei 225 strengthened 2.02%.\n\nAccording to a Bloomberg survey of economists, the world’s second-largest economy is expected to cut its interest rates on one-year policy loans by 5 basis points to 2.6% in the last quarter of this year to boost economic growth.\n\nU.S. stock futures mostly dropped as of 7 p.m. in Hong Kong, as the S&P 500 futures dipped 0.09%, and the Nasdaq 100 Futures fell 0.19%. The Dow Jones Industrial Average futures rose 0.06%.\n\nInvestors are looking forward to Federal Reserve Chairman Jerome Powell’s speech at events in Europe. Powell is set to speak at the European Central Bank Forum in Sintra, Portugal, on Wednesday and again on Thursday at the Banco de España Fourth Conference on Financial Stability in Madrid, Spain.\n\nLast week, Powell said there may be more interest rate increases this year in the U.S., which are currently between 5% and 5.25%, the highest since 2006.\n\n“U.S. equity investors today are being rewarded with a smaller return premium for bearing equity risk than at any time in recent memory, at a time when macroeconomic risks are high and central banks are in less supportive mood,” Duncan Lamont, head of strategic research at Schroders, said in an emailed statement on Wednesday.\n\n“The U.S. may have been the strongest performing market for much of the past 15 years, but our analysis of the equity risk premium suggests that it will struggle to repeat that feat. Long-term investors may be better served by allocating more to non-U.S. markets in the decade to come,” Lamont added.\n\nEuropean equity markets strengthened on Wednesday, following Wall Street’s overnight rally on the back of rebounding home sales in the U.S. and strengthened consumer confidence.\n\nThe benchmark STOXX 600 gained 0.68% and Germany’s DAX 40 rose 0.88% during Wednesday afternoon trading hours in Europe.\n\nPhilip Lane, European Central Bank’s Chief Economist, indicated on Wednesday that stock markets should not factor in interest rate cuts in the next two years.\n\nThe central bank has been increasing interest rates since last year, amounting to 400 basis points of raises so far, with market expectations of two more rate hikes later this year.\n\n(Update adds NFT and equity sections.)"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90di9maXJzdC1tb3Zlci9jb2luYmFzZS1yZXNwb25kcy10by10aGUtc2Vjcy1sYXdzdWl0LXVucGFja2luZy10aGUtYml0Y29pbi1jYXNoLXJhbGx5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Coinbase Responds to the SEC's Lawsuit; Unpacking the Bitcoin Cash Rally - CoinDesk",
        "content": "Emily Parker was CoinDesk's executive director of global content. Previously, Emily was a member of the Policy Planning staff at the U.S. State Department, where she advised on Internet freedom and digital diplomacy. Emily was a writer/editor at The Wall Street Journal and an editor at The New York Times. She is the co-founder of LongHash, a blockchain startup that focuses on Asian markets. She is the author of \"Now I Know Who My Comrades Are: Voices From the Internet Underground\" (Farrar, Straus & Giroux). The book tells the stories of Internet activists in China, Cuba and Russia. Mario Vargas Llosa, winner of the Nobel Prize for Literature, called it \"a rigorously researched and reported account that reads like a thriller.\" She was chief strategy officer at Silicon Valley social media startup Parlio, which was acquired by Quora. She has done public speaking all over the world, and is currently represented by the Leigh Bureau. She has been interviewed on CNN, MSNBC, NPR, BBC and many other television and radio shows. Her book has been assigned at Harvard, Yale, Columbia, Tufts, UCSD and other schools. Emily speaks Chinese, Japanese, French and Spanish. She graduated with Honors from Brown University and has a Masters from Harvard in East Asian Studies. She holds Bitcoin, Ether and smaller amounts of other cryptocurrencies."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMjgtanVuZS0yMDIzL2FydGljbGVzaG93LzEwMTMzMjA2Mi5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTI4LWp1bmUtMjAyMy9hbXBfYXJ0aWNsZXNob3cvMTAxMzMyMDYyLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin holds above $30,400; Polygon, Avalanche fall over 2% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading mixed in Wednesday's trade. Bitcoin, XRP , and Polkadot were trading with gains, while BNB , Polygon, and Solana were trading with cuts.Bitcoin (BTC) rose 0.02% to $30,405, whereas Ethereum (ETH) was below the $1,900 level. BTC volume stood at approximately $16.68 billion, rising 9% in the last 24 hours.\"Most cryptocurrencies traded flat with minimal fluctuations, fueled by the positive sentiment surrounding the possibility of a Bitcoin ETF and encouraging economic indicators from the US Bitcoin, in particular, maintained its position above the US$30,000 threshold for the fifth consecutive day,\" Edul Patel, Co-founder, and CEO at Mudrex, said.\"The bears seem to be active near the US$31,000 zone. BTC currently faces immediate resistance at the US$30,680 and US$30,950 levels, while the support level rests at US$30,000,\" Edul added.The global cryptocurrency market cap was trading around $1.18 trillion, falling 0.03% in the last 24 hours.The total volume in DeFi is currently $2.14 billion, 6% of the total crypto market 24-hour volume. The volume of all stablecoins is now $33.22 billion, which is 92% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $590 billion. Bitcoin's dominance is currently 50.16%, an increase of 0.16% over the day, according to CoinMarketCap.\"Bitcoin faces significant resistance around the $31,000 level on the daily chart. Neutral candles such as dojis and spinners indicate waning bullish sentiment and potential exhaustion among buyers, suggesting a minor price correction. Immediate support is located near $29,600, followed by $28,250 and $26,750,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.Rajagopal Menon, Vice President at WazirX, said, \"Major market oscillators point toward a Neutral sentiment. The Relative Strength Index (14), one of the key indicators, sits at 68, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) is at 85 and 35, respectively, further indicating a Neutral market.\"The MACD Level (12, 26) at -477 indicates a Sell. The Stochastic RSI Fast (3, 3, 14, 14) is at 22 with a Neutral indicator, while the Williams Percent Range (14) at −72 signals Neutral,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.55 hours, IST on June 28, 2023)Bitcoin $30,405 0.30%Ethereum $1,862 -0.22%Tether $0.9998 0.01%BNB $235 -0.77%XRP $0.4804 -0.21%Cardano $0.279 -0.34% Dogecoin $0.06501 0.07%Polygon $0.6389 -2.16%Solana $16.13 -1.76% Litecoin $86.8 -1.09%Polkadot $5.07 0.12%Tron $0.07427 -0.10%Avalanche $12.95 -2.03%Shiba Inu $0.000007434 -1.76%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vZGVjcnlwdC5jby8xNDY2NDIvd2h5LWRpZC1jaXRhZGVsLWJhY2tlZC1lZHgtbGlzdC1iaXRjb2luLWV0aGVyZXVtLWxpdGVjb2luLWFuZC1iaXRjb2luLWNhc2jSAWpodHRwczovL2RlY3J5cHQuY28vMTQ2NjQyL3doeS1kaWQtY2l0YWRlbC1iYWNrZWQtZWR4LWxpc3QtYml0Y29pbi1ldGhlcmV1bS1saXRlY29pbi1hbmQtYml0Y29pbi1jYXNoP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Why Did Citadel-Backed EDX List Bitcoin, Ethereum, Litecoin, and Bitcoin Cash? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin Cash, a spin-off from the oldest digital asset, has struggled to find a market since launching in 2017. But it’s been on a roll this month: since the start of June, Bitcoin Cash (BCH) is up 98%, jumping from $113 to $224.\n\nThe slightly obscure digital asset—one of many cryptocurrency “forks”—is following Bitcoin, like many other coins and tokens which have surged in price since the biggest digital asset experienced a run. But BCH is doing by far the best.\n\nAD\n\nAD\n\nWhy? The coin is one of the lucky four chosen for EDX Markets, a new crypto exchange backed by major Wall Street players Charles Schwab, Citadel Securities, and Fidelity Digital Assets.\n\nEDX, which launched last week, decided to let its traders—institutional investors only—start off with Bitcoin, Ethereum, Litecoin, and Bitcoin Cash.\n\nThe reason is simple: regulatory clarity.\n\n“These specific cryptocurrencies are generally perceived as commodities by regulatory bodies, which significantly mitigates potential legal challenges,” Sei Labs co-founder Jeff Feng told Decrypt.\n\nYouwei Yang, Chief Economist at BTCM, added that the four assets are “widely regarded as digital commodities, making them relatively safe” from the U.S. Securities and Exchange Commission because they are made with electricity—a commodity.\n\nIn perhaps its toughest regulatory crackdown yet, the SEC has gone after a number of major crypto brands for allegedly flogging unregistered securities. Earlier this month, it went after Coinbase for allegedly offering and selling unregistered securities via its staking service. It also targeted Binance, the world’s biggest exchange, with a massive lawsuit for allegedly “operating as a fking [sic] unlicensed securities exchange in the U.S.A. bro,” according to the SEC.\n\nAD\n\nAD\n\nIn February, it hit Kraken with a $30 million fine for allegedly failing to register the offer and sale of its crypto asset staking-as-a-service program.\n\nThese regulatory enforcements are all because SEC Chairman Gary Gensler thinks—and has said for years—that most cryptocurrencies are unregistered securities.\n\nBut he has made it clear that Bitcoin is a commodity. He has been less clear on Ethereum, but the Commodities and Futures Trading Commission (CTFC) has said the asset is a commodity.\n\nAnd Bitcoin Cash and Litecoin are both Bitcoin forks—new cryptocurrencies that emerged from the asset’s original code—meaning they are likely to have the same status in the eyes of regulators.\n\nGreg Moritz, Co-Founder at the crypto hedge fund AltTab Capital, said that “none have been listed by the SEC as unregistered securities,” adding that all four assets are established and have history, “key factors in the decision-making process of EDX’s backers.”\n\nEDX Markets CEO Jamil Nazarali also said that he felt “very comfortable” that the four assets weren’t securities.\n\nFor now, these four “old school” cryptocurrencies will give “old school” investors a taste of the crypto world. But things could change, Feng noted. “As regulations evolve and the understanding of different cryptocurrencies becomes more nuanced, we could anticipate exchanges like EDX broadening their offerings,” he added.\n\nAD\n\nAD"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNhbGFyeS1jcnlwdG8tcGF5Y2hlY2tzLWVjb25vbWljLWluc3RhYmlsaXR50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin salary: Employees choose crypto paychecks amid economic instability - Cointelegraph",
        "content": "Political and economic tensions around the world are making some people more willing to receive their pay in cryptocurrencies like Bitcoin (BTC), according to executives in the human resources industry.\n\nThe share of salaries taken in cryptocurrencies and stablecoins has been on the rise over the past few years. This trend is driven not only by prominent athletes and politicians taking their pay in crypto, but also by ordinary people who want to hedge against all kinds of instability, according to goLance co-founder and CEO Michael Brooks.\n\nSeveral factors have triggered a surge in crypto salaries, including increasing acceptance as a legitimate payment method, growing education and new technological developments, Brooks said in an interview with Cointelegraph.\n\nThe economic conditions in various parts of the world have also influenced the surge in crypto payments, he said, adding:\n\n“Some regions experiencing political instability, hyperinflation or restrictive financial systems have seen an uptick in cryptocurrency usage as an alternative means of conducting transactions.”\n\nIn 2021, goLance made less than 5% of its payouts in crypto, which grew to almost 10% in 2022 and is expected to hit 17% in 2023, Brooks said. “Of the goLance freelancers that choose to be paid in crypto, an average of 17.5% of payments is in crypto and 82.5% in fiat,” the exec noted.\n\nDan Westgarth, chief operating officer at human resources and payroll platform Deel, said that many employees worldwide have started taking their wages in crypto in response to the political and economic instability that has fueled sharp fluctuations in local fiat currencies, making stablecoins like USD Coin (USDC) more attractive:\n\n“We see that countries facing more political and currency turbulence continue to use crypto, particularly withdrawals in USDC to combat volatility.”\n\nHe said that the Caribbean presents a use case for crypto salaries due to its dated banking systems, where extensive waiting periods, payment delays and banking withdrawal fees could be avoided with crypto.\n\nRelated: LATAM crypto holders flock to Bitget following Binance, Coinbase suit\n\nAmong the regions Deel supports for crypto payroll, Latin America has the largest share of withdrawals, accounting for 54% of crypto withdrawals on the platform between January and May of 2023.\n\nCrypto salaries in Europe, the Middle East and Africa accounted for 38% during the same period. The Asia-Pacific and non-aligned movement countries collectively accounted for less than 10% of all crypto withdrawals, Westgarth noted.\n\nMagazine: Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL2N1cnJlbmNpZXMvbWljaGFlbC1zYXlsb3ItbWljcm9zdHJhdGVneS1iaXRjb2luLWhvZGwtY3J5cHRvY3VycmVuY3ktdG9rZW4tY3VycmVuY3ktYnVsbC1tYXJrZXRzLTIwMjMtNtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Michael Saylor's MicroStrategy Adds $347 Million Bitcoin to Coffers - Markets Insider",
        "content": "Michael Saylor's MicroStrategy bought an additional 12,333 bitcoin, for about $347 million.\n\nThat brings the company's total holdings to 152,333 bitcoin, worth roughly $4.6 billion at current prices.\n\nBitcoin's strong rally in 2023 helped MicroStrategy notch its first profitable quarter in over two years.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nMicroStrategy just added 12,333 bitcoins to its coffers at an average purchase price of $28,136 per token, according to a new regulatory filing.\n\nFounder and Executive Chairman Michael Saylor, a prominent bitcoin bull, tweeted the announcement Wednesday, adding that the company now \"hodls\" — an acronym for \"hold on for dear life\" — 152,333 bitcoins in total, acquired for roughly $4.52 billion and purchased at an average price of $29,668 per token.\n\nAt current bitcoin prices, the enterprise software company's bitcoin stockpile is worth about $4.6 billion.\n\nMicroStrategy's latest bitcoin purchase comes after Saylor predicted earlier this month that the US regulatory crackdown on cryptocurrencies will help bitcoin nearly double its market share.\n\nAdvertisement\n\nIn this year alone, bitcoin's share of the crypto industry's overall market capitalization has gone from 40% to 48%, he told Bloomberg TV. But with regulators targeting other tokens, bitcoin's dominance will to grow to 80%, he added.\n\n\"Now I think that the public is beginning to realize that bitcoin is the next bitcoin,\" Saylor said. \"The next logical step is for bitcoin to 10x from here and then 10x again.\"\n\nIn 2023, the world's largest cryptocurrency has rallied about 82%. Thanks to its strong performance, MicroStrategy in the first three months of the year notched its first profitable quarter in more than two years.\n\n\"The conviction in our bitcoin strategy remains strong as the digital asset environment continues to mature,\" CFO Andrew Kang said in a statement in May, after the company had snapped up 7,500 tokens that quarter.\n\nAdvertisement\n\nSaylor, an active market commentator via Twitter, has made other predictions recently, including how the next president will be pro-bitcoin, how the token is more attractive than the traditional safe haven asset gold, and even calling the crypto \"immortal.\""
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXNlbmQtMzVrLWJ0Yy1leGNoYW5nZXMtbmV3LWVsYXRpb24taW5mbG930gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin speculators send 35K BTC to exchanges in new 'elation inflow' - Cointelegraph",
        "content": "Bitcoin (BTC) short-term holders are feeling the need to sell BTC at $30,000, data shows.\n\nIn research released on June 28, on-chain analytics firm Glassnode flagged tens of thousands of coins being sent to exchanges.\n\nBitcoin speculative exchange moves “intensifying”\n\nBTC price action stalling at $30,000 is prompting a rethink when it comes to buyers who have turned a profit this month.\n\nIn particular, short-term holders (STHs) — those entities hodling funds for 155 days or less — are becoming increasingly keen sellers.\n\nMonitoring inflows to exchange wallets, Glassnode revealed a clear spike in funds being put up for trade originating from STHs, which correspond to Bitcoin’s more speculative investor cohorts.\n\n“The recent elation in Bitcoin price action has enticed an increase in Short-Term Holder interaction with exchanges,” it commented.\n\n“Currently, STH exchange inflows are intensifying, with a significant 1.28% (+35.4K BTC) of the STH Supply sent to exchanges.”\n\nAn accompanying chart makes a distinction between current inflows and those seen during the 2022 bear market.\n\nSTHs, it shows, are more inclined to sell en masse during periods of BTC price suppression to limit losses. Profit-taking, on the other hand — as seen now and in March, when BTC/USD first returned to the $30,000 mark — has resulted in overall lower exchange volumes.\n\nBitcoin percent short-term holder (STH) balance sent to exchanges annotated chart. Source: Glassnode/Twitter\n\nRealizing 10% gains\n\nThe figures indicate that speculative interest in Bitcoin remains fickle and highly sensitive to even smaller price movements.\n\nRelated: Bitcoin price clings to $30K as Fed’s Powell stresses more rate hikes\n\nNonetheless, STHs have become an important market force in 2023.\n\nAs Glassnode and Cointelegraph previously noted, their aggregate cost basis — around $26,500 earlier this month — has remained intact as a support level.\n\nMeanwhile, on-chain analysis has predicted that should BTC price upside return, the urge to take profit could quickly become overpowering.\n\nHistorical data has shown that once STH profitability reaches an aggregate 20%, selling begins, and against their current $26,500 breakeven point, anything much above $33,000 could spark a significant shift in hodler composition.\n\nCurrent data shows STH profitability at around 10%, with their realized price — the price at which STH coins last moved — now above $27,000.\n\nBitcoin short-term holder (STH) data. Source: Glassnode\n\nMagazine: How smart people invest in dumb memecoins: 3-point plan for success\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvYXJrLWludmVzdC1qb2lucy1ibGFja3JvY2stYW5kLWZpZGVsaXR5LWluLXJhY2UtZm9yLWJpdGNvaW4tZXRmL9IBc2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvYXJrLWludmVzdC1qb2lucy1ibGFja3JvY2stYW5kLWZpZGVsaXR5LWluLXJhY2UtZm9yLWJpdGNvaW4tZXRmL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "ARK Invest Joins BlackRock and Fidelity in Race for Bitcoin ETF - Finance Magnates",
        "content": "When the world's largest fund manager, BlackRock, decided to apply for the creation of a spot Bitcoin (BTC) exchange-traded fund (ETF Exchange-Traded Fund (ETF) An exchange-traded fund (ETF) is a collection of a mixture assets, i.e. stocks, commodities, bonds, or cryptocurrencies that tracks an index or underlying portfolio of investments.Of note, an ETF functions an arbitrage mechanism that is designed to keep it trading close to its net asset value. Most tradable ETFs track a specific index. This most commonly mirrors a stock or bond index. The popularity of ETFs has grown in recent years and are seen as an attractive investment due to its low cost, e An exchange-traded fund (ETF) is a collection of a mixture assets, i.e. stocks, commodities, bonds, or cryptocurrencies that tracks an index or underlying portfolio of investments.Of note, an ETF functions an arbitrage mechanism that is designed to keep it trading close to its net asset value. Most tradable ETFs track a specific index. This most commonly mirrors a stock or bond index. The popularity of ETFs has grown in recent years and are seen as an attractive investment due to its low cost, e Read this Term) two weeks ago, nobody expected it to trigger a new fever in the cryptocurrency market.\n\nThe BTC price reached new highs for the year, and other Wall Street giants began to join BlackRock. Among them were Invesco, WisdomTree, Fidelity, and ARK Investment Management (ARK Invest), owned by popular investor Cathie Wood.\n\nARK Invest Updates its Bitcoin ETF Application\n\nAlthough BlackRock sparked a wave of new applications to register a Bitcoin ETF, ARK Invest was the first to submit such an application this year. Cathie Wood's firm already filed an application in April to create an instrument that tracks the price of 'physical' cryptocurrency.\n\nAs the topic has become a hot item in the media and is elevating the prices of major digital assets, ARK has decided to refresh its application. As can be seen from the amendment filed with the Securities and Exchange Commission (SEC) yesterday (Wednesday), the company made changes in its original application to make it similar to the one filed by BlackRock.\n\nKeep Reading South Africa Navigates Crypto Regulations: To License 60 Firms This Month\n\nThe most important updates include a contract to share oversight with the futures market run by the Chicago Mercantile Exchange (CME) and a cryptocurrency exchange. This is most likely going to be Coinbase.\n\nJUST IN: ARK has amended their 19b-4 for spot bitcoin ETF to include a surveillance sharing agreement bt CBOE and a crypto exchange (likely Coinbase), which makes their's like BlackRock's filing now, and puts them in pole position to be approved first bc they filed first. pic.twitter.com/P8PCmPdhln — Eric Balchunas (@EricBalchunas) June 28, 2023\n\nThe decision on the cryptocurrency ETF from ARK Invest, which it applied for with 21Shares, is first in line with the SEC. According to the current schedule, this should be decided by 13 August.\n\nBitcoin Prices Soar amid ETF Fever\n\nAt the time of BlackRock's announcement about applying for the creation of a spot Bitcoin ETF, one BTC cost less than $25,000. The cryptocurrency price was then testing at a three-month low.\n\nWall Street giants' interest in the market caused a dynamic increase in the crypto price. It rose by over 26% in a week and tested the $31,000 level, setting new highs for the year.\n\nBitcoin price. Source: CoinMarketCap\n\nHowever, the on-chain data suggest that the upward movements were not due to greater network activity, but pure speculation and an influx of more cash into regulated cryptocurrency instruments. Although a spot Bitcoin Bitcoin While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that While some may still be wondering what is Bitcoin, who created Bitcoin, or how does Bitcoin work, one thing is certain: Bitcoin has changed the world.No one can remain indifferent to this revolutionary, decentralized, digital asset nor to its blockchain technology.In fact, we’ve gone a long way ever since a Florida resident Laszlo Hanyecz made BTC’s first official commercial transaction with a real company by trading 10,000 Bitcoins for 2 pizzas at his local Papa John’s.One could now argue that Read this Term ETF is not yet available, investors can take advantage of ETFs tracking the prices of BTC futures contracts, options or futures themselves."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vZm9ya2FzdC5uZXdzL2ZpZGVsaXR5cy1jcnlwdG8tYml0Y29pbi1ldGYtYXp1a2kv0gE8aHR0cHM6Ly9mb3JrYXN0Lm5ld3MvZmlkZWxpdHlzLWNyeXB0by1iaXRjb2luLWV0Zi1henVraS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Reports of Fidelity's imminent Bitcoin spot ETF filing boosts crypto - Forkast News",
        "content": "In this issue\n\nFidelity: Close to filing its own Bitcoin ETF Forkast 500 NFT Index: Azuki disappoints Asset tokenization in Singapore: One step closer\n\nFrom the Editor’s Desk Dear Reader, There’s a saying in gambling circles that the house always wins. It’s not an unreasonable supposition, given the fact that if casino operators didn’t bring in more cash than they paid out, they’d be forced to shut up shop. Some in the crypto community might be applying that same saying to the bastions of traditional finance this week as Wall Street appears to be putting another move on cryptocurrencies in which the ultimate winner seems set to be itself. Fidelity, one of the world’s biggest asset managers, is reportedly preparing to file an application to establish a spot Bitcoin exchange-traded fund. That would be a big bet on crypto — or at least on the coin that started it all. Almost by definition, it would also be a bet against the hostility to crypto shown by the U.S. Securities and Exchange Commission since the collapse of the FTX exchange last year. The regulator’s apparent distaste for crypto has made casualties of many companies in the sector that have bet against it in recent times. Binance, Coinbase, Kraken, Genesis and Gemini have all been on the receiving end of enforcement action, and the commission has set its sights on cryptocurrencies. Traditional finance firms have also bet against the SEC and lost, although only in terms of commercial opportunities that have gone untapped rather than actual penalties, losses and business closures. As we note in this week’s edition of The Current Forkast, Fidelity’s application for a spot Bitcoin ETF isn’t the company’s first. Indeed, the SEC has turned down every application for such a fund to date. But traditional finance sector players such as Fidelity and BlackRock, which lodged a spot Bitcoin ETF application a fortnight ago, are now showing increased confidence about their prospects of gaining the regulator’s favor. Perhaps it’s because they’re buoyed by judicial skepticism about the SEC’s reasoning in denying a spot Bitcoin ETF license to crypto asset manager Grayscale. Perhaps it’s also because they sense the pendulum might have swung too far against crypto and that the regulator may be minded to offer the industry a concession in the form of a vanilla financial product. Overall, the house needs to win to keep the tables open. Yet the original question posed by crypto was: Who runs the house? Given that the SEC appears unilaterally to have made up its mind, it feels like high time others started asking that question once again. Until the next time, Angie Lau,\n\nFounder and Editor-in-Chief\n\nForkast.News\n\n1. Bull run\n\nFidelity joins a list of financial institutions that in June submitted or updated their applications to issue spot Bitcoin ETFs, including BlackRock, WisdomTree, Invesco, Valkyrie and Bitwise. Image: Fidelity Investments/Canva\n\nCryptocurrencies are receiving a significant push as Fidelity Investments is reportedly nearing the filing of its own spot Bitcoin exchange-traded fund (ETF), the Block reported Tuesday, citing people familiar with the matter.\n\nThe move would not be Fidelity’s first attempt to file for a Bitcoin-backed ETF. In March 2021, the Wall Street giant filed for a spot Bitcoin ETF named the Wise Origin Bitcoin Trust, which was rejected by the U.S. Securities and Exchange Commission in January 2022. But it launched the Fidelity Advantage Bitcoin ETF in Canada in December 2021, which has risen 75% since the beginning of this year.\n\nAccording to the Block, Fidelity’s application will join the list of financial institutions that have recently submitted or updated their applications to issue spot Bitcoin ETFs, including BlackRock, WisdomTree, Invesco, Valkyrie and Bitwise.\n\nA spot Bitcoin ETF is a publicly traded investment vehicle tracking Bitcoin price, which allows investors to have Bitcoin exposure without directly handling the underlying cryptocurrency.\n\n“Bitcoin ETF applications have supported investors’ sentiment as institutional and retail investors could show increasing interest in the market through such investment vehicles,” said Denys Peleshok, head of Asia at Belize-based financial brokerage CPT Markets, in email comments.\n\n“If the SEC approves new applications, the market could record a surge in demand and in the number of buyers,” said Peleshok. “Due to the SEC’s legal stance over cryptocurrencies, the market could further concentrate on Bitcoin and Ethereum, the two largest assets in the market.”\n\nSince BlackRock filed for its Bitcoin ETF on June 15, Bitcoin is up by more than 22%, peaking at US$31,389 on June 23, the highest since June 2022. Bitcoin traded at US$30,433, at press time, according to data from CoinMarketCap.\n\nForkast.Insights | What does it mean? The potential foray of Fidelity, globally recognized as the third largest asset manager, into the ETF domain hardly raises eyebrows among those tuned in to the vibrant buzz of Twitter’s rumor universe. In the wake of the ETF application of the world’s largest asset manager, BlackRock, industry watchers projected that Fidelity, the Bostonian investment giant with US$4.2 trillion in assets under management, would be the subsequent contender to lodge and apply for a spot Bitcoin ETF. This topic also fuelled speculation that Fidelity might put in a bid for Grayscale, the digital asset manager responsible for the US$13.5 billion Grayscale Bitcoin Trust, the world’s biggest Bitcoin fund. So far, there has been no substantial evidence for the buyout. Fidelity has taken a proactive stance in embracing Bitcoin and other digital assets, eclipsing many of its traditional finance contemporaries. The firm claims that its research on the asset class dates back to 2014. In 2018, the firm launched an institutional trading platform for Bitcoin and Ethereum. A year later, in 2019, it expanded its venture into the Bitcoin mining business through Bitcoin technology firm Blockstream’s institutional mining service. Last year, it even joined the lengthy list of firms whose Bitcoin ETF applications got rejected by the SEC. And last week, EDX Markets, a non-custodial crypto exchange backed by Fidelity and other Wall Street titans, went live. In addition, Fidelity has shown an assertive drive in obtaining indirect exposure to Bitcoin via Microstrategy, the preeminent corporate Bitcoin holder globally. Fidelity has secured its position as Microstrategy’s third largest shareholder, possessing 6.7% of the stock, valued at over US$225 million. BlackRock follows as the fourth largest owner with 5.58%, approximating around US$185 million. Despite the entrance of these behemoth asset managers into the U.S. ETF race, the waiting list is long. ARK Invest Chief Executive Officer Cathy Wood claims that her firm is in position to launch the first spot-Bitcoin ETF in the world’s largest economy.\n\n2. Liquid dreams\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe NFT markets saw another week of decline, and again, Ethereum’s NFT ecosystem is dragging the broader market down. The Forkast 500 NFT Index is down 1.32%, as Ethereum’s decline of 1.51% stands in stark contrast to Solana, Polygon, and Cardano’s gains in value of 1.7%, 1.23% and 5.75%, respectively.\n\nEthereum sales volume rose 318% on Thursday following Azuki’s Elementals mint, which brought in US$38 million to the Azuki team in just 15 minutes.\n\nAzuki’s floor price decreased 45% to 9 Ether following the Elementals mint, and the average sales price declined to US$23,000, down from US$39,000 the previous seven days.\n\nBored Ape Yacht Club’s average sales price is up in the past seven days to US$79,214. However large BAYC holders like Machi Big Brother and Franklin have combined to sell over 60 Bored Apes, applying downward pressure on the collection.\n\nSolana’s 98,917 transactions on June 25 were its single highest daily total of NFT transactions in over eight months. September 2022 was the last time the blockchain had this level of activity, when the Y00ts were still surging on Solana.\n\nSeven-day sales volume was up across several blockchains with Ethereum up 105%, Bitcoin 22%, Solana 24%, and Polygon 10%. Mythos Chain, BNB, and Flow were down 18%, 20% and 23%, respectively.\n\nDeGods is now the third most expensive PFP based on floor price following Azuki’s falling prices. Azuki’s cheapest NFTs are selling for as low as 8.5 ETH, while DeGods is nearly 1 ETH higher at 9.5 ETH.\n\nForkast.Insights | What does it mean? This year’s biggest new NFT mint took place on Tuesday, as one of the top NFT projects, Azuki, delivered a new collection called Elementals. While some were hopeful the new collection would breathe life into the NFT markets, it instead drained liquidity from traders who sold assets across projects to afford the hefty 2 ETH mint price. The impact was visible on the Forkast 500 NFT Index even in the midst of Ethereum NFTs having its single highest day of sales volume this year with US$58 million. Azuki’s Elementals did provide some lucky traders with rare Elementals NFTs that were flipped for over 30 ETH, but most secondary sales are taking place well below the collection’s 2 ETH mint price. Instead of Azuki’s Elementals helping the broader NFT ecosystem, it instead sucked liquidity from holders, and almost across the board, brought other collections’ sales prices down with it. What went wrong with Azuki’s mint is a familiar story, and shows that the NFT space may not be as mature as some would like to believe. Starting from the initial sale that left many Azuki and Beanz holders stuck on a loading page, and ultimately unable to mint, to the massively underwhelming art reveal that almost looks like duplicates of the main Azuki collection, NFT projects talk about innovation, yet time after time, fail to deliver it. For all the talk of innovation, we have witnessed few examples of it, and other than functioning as ‘meme coins’, traders shouldn’t expect another NFT boom until we see actual innovation. If the Azuki team can turn around the current negative sentiment in their project and help foster the higher floor prices that their holders have come to expect, we may then see sales with profits that roll into existing collections floors. We’ll be watching.\n\n3. Singapore calling\n\nMAS’ move comes as Singapore seeks to utilize the power of blockchains in its financial system, while minimizing risks of crypto assets. Image: Fidelity Investments/Canva\n\nThe Monetary Authority of Singapore (MAS), the city state’s central bank, has proposed a framework to design open and interoperable networks for digital assets, as the country seeks to harness the power of asset tokenization to improve its traditional financial services.\n\n“The real value in the digital asset ecosystem” lies in the tokenization of real-world and financial assets through distributed ledger technologies and smart contracts, which could “enhance the efficiency, accessibility, and affordability of financial services,” MAS wrote in its report.\n\n“Unless digital asset networks are interoperable, both with each other and with traditional financial market infrastructures, fragmentation would reduce the network benefits and can create frictions such as inaccessibility, increased liquidity requirements due to separation of liquidity pools, and pricing arbitrage,” noted MAS.\n\nMAS’ proposal – jointly developed with the Bank for International Settlements and other financial institutions – is part of Singapore’s Project Guardian initiatives announced in May 2022 to explore the adoption of asset tokenization and decentralized finance in the city state’s financial industry.\n\nMAS also announced an expansion of Project Guardian to test the potential of asset tokenization across more financial asset classes, enlisting 11 financial institutions — including banking giants Citi, HSBC, DBS and Standard Chartered — to form the Project Guardian Industry Group to lead industry pilots in asset and wealth management, foreign exchange and fixed income.\n\nJapan Financial Services Agency, the first overseas financial regulator to join Project Guardian, will work with MAS on digital asset innovation while safeguarding against risks to financial stability and integrity.\n\nMAS’ move comes as Singapore seeks to utilize the power of blockchains in its financial system, while minimizing risks of crypto assets. Last Thursday, The Asia-Pacific branch of technology firm Ripple Labs said it would start offering crypto-enabled digital payment services in Singapore after receiving in-principle approval from the MAS.\n\nAlso on Thursday, MAS released a whitepaper – jointly developed by the International Monetary Fund, Amazon, DBS Bank, and multiple other industry players.– for “purpose-bound” money, detailing a technical overview of digital currencies designed for specific purposes."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9taWNoYWVsLXNheWxvci1taWNyb3N0cmF0ZWd5LWFjcXVpcmVzLW1vcmUtMDI0OTQ3NzIwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Michael Saylor's MicroStrategy Acquires More Bitcoin, Treasury Now Holds 152,333 BTC - Yahoo Finance",
        "content": "Michael Saylor’s MicroStrategy Acquires More Bitcoin, Treasury Now Holds 152,333 BTC\n\nCo-founder Michael Saylor Has Previously Said That the Reason for Buying Bitcoin Was as a Hedge Against Inflation\n\nMicroStrategy has purchased an additional 12,333 BTC for $347 million between April 29 and June 27, marking its largest Bitcoin purchase so far.\n\nThe company now holds a total of 152,333 digital coins worth $4.5 billion. This is approximately 0.726% of the total available supply of 21 million BTC. MicroStrategy, which offers cloud-based services, mobile software and business intelligence, possesses the most Bitcoin than any other publicly traded corporation.\n\nIts co-founder Michael Saylor has previously said that the reason for buying Bitcoin was as a hedge against inflation. The average purchase price of the Bitcoin it holds stands at approximately $29,668 per coin.\n\nDespite Bitcoin's plunge from its all-time high of $68,789 in November 2021, MicroStrategy's stock is up more than 162% since its initial Bitcoin purchase in 2020.\n\nMicroStrategy's most recent purchase of Bitcoin confirms the company's confidence in the long-term viability of the digital asset. The company is currently working on an \"enterprise Lightning solution\" to help companies move money quickly."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ibGFja3JvY2stYml0Y29pbi1ldGYtZ3JheXNjYWxlLXNlY9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "BlackRock has '50% chance' of getting spot Bitcoin ETF approved: Analyst - Cointelegraph",
        "content": "Investment management firm BlackRock has a 50% chance of getting its spot Bitcoin (BTC) Exchange Traded Fund (ETF) approved, according to Bloomberg senior ETF analyst Eric Balchunas.\n\nBalchunas’ prediction comes following an observation made by Elliott Stein, a senior litigation analyst for Bloomberg Intelligence, who now pegs the chances of Grayscale winning its case against the SEC at 70%.\n\nAnother reason we give spot bitcoin ETF approval 50% chance is our senior legal analyst @NYCStein gives Grayscale a 70% chance of winning case against SEC, who could approve BlackRock's ETF as way to save face using trusted 'adult' TradFi cos & stick it to Grayscale via @JSeyff pic.twitter.com/pHydOcpuQo — Eric Balchunas (@EricBalchunas) June 27, 2023\n\nBalchunas explained that the SEC may look more favorably upon BlackRock’s ETF filing as a way to “save face” by allowing an ETF from a “trusted ‘adult' TradFi” firm instead of Grayscale.\n\nEver since Grayscale appealed the United States Securities Exchange Commission’s decision to reject its application in June 2022, the two parties have engaged in back and forth legal filings in addition to oral testimony heard by three U.S. federal appellate court judges on March 7.\n\n“Grayscale has a 70% chance of winning its lawsuit against the SEC over the company’s bid to convert the Grayscale Bitcoin Trust (GBTC) to a Bitcoin ETF, we believe.”\n\nStein added that Grayscale’s odds increased from 40% after the parties’ oral arguments reached completion because “all three judges on the panel appeared to side with Grayscale” based on their “lines of questioning,” Stein said.\n\nStein said Bloomberg expects a conclusion will be made by August.\n\nApplications for Bitcoin ETFs have been a central focus point for the industry of late, with Fidelity, Invesco, Wisdom Tree and Valkyrie following the $10 trillion asset management firm BlackRock in line for the SEC’s approval.\n\nIf the SEC eventually approves the applications from the likes of JPMorgan, Morgan Stanley, Goldman Sachs, BNY Mellon and Bank of America looking to offer similar services, the digital asset market would be exposed to firms with a combined $27 trillion in assets under management.\n\n1/ last week's @BlackRock spot Bitcoin ETF filing was big news!\n\n\n\nbut, it's not the only story. many of the largest financial institutions in the US are actively working to provide access to Bitcoin and more.\n\n\n\na quick glance - $27 trillion of client assets here! pic.twitter.com/azmHZmUL2a — Meltem Demirors (@Melt_Dem) June 26, 2023\n\nRelated: Firms managing $27T in assets are embracing crypto: CoinShares CSO\n\nWhile the decision of Grayscale’s case awaits, GBTC has surged over 134% in 2023 to $19.47, which marks its highest price since about May 13, 2022, according to Google Finance.\n\nAdditionally, the discount of GBTC’s share price when compared to its overall net-asset-value dropped to 31% on June 26, the lowest level recorded since Sept. 12 last year, according to data from YCharts. A lower discount rate on the trust means that investors sentiment towards the product may be turning more positive.\n\nGBTC Discount to Net Asset Value (NAV). Source: Ycharts.\n\nHowever, like much of the crypto market, GBTC is down over 65% from its all-time high price of $56.70.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMjkvYml0Y29pbi1yZWdhaW5zLTMwMDAwLW1hcmstYWZ0ZXItYmlkZW4tdGF4LWxvb3Bob2xlLWNvbW1lbnRzL9IBZ2h0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDYvMjkvYml0Y29pbi1yZWdhaW5zLTMwMDAwLW1hcmstYWZ0ZXItYmlkZW4tdGF4LWxvb3Bob2xlLWNvbW1lbnRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin regains $30,000 mark after Biden tax ‘loophole’ comments - Fortune",
        "content": "The price of Bitcoin is back on the upswing despite President Biden reiterating his unfriendly stance toward crypto traders.\n\nDuring a speech in Chicago where he laid out his economic plan, Biden took aim at crypto traders along with other financial figures, saying he wanted to make the economy and tax system fairer by eliminating opportunities for crypto traders to evade taxes.\n\n“We’re going to make it fair by eliminating loopholes for crypto traders, hedge fund managers,” Biden said, according to a transcript released by the White House.\n\nBiden just said:\n\n\n\nWe’re going to make the economy fairer by getting rid of tax loopholes for crypto traders and hedge fund managers. pic.twitter.com/vWRlVDPDSE — Quiver Quantitative (@QuiverQuant) June 28, 2023\n\nFollowing Biden’s comments on Wednesday, Bitcoin, which makes up more than half of the crypto market, fell 1.3% to just under $30,000. But on Thursday morning, investors shook off any skittishness, pushing Bitcoin up as high as $30,772 before it retreated to about $30,500, according to CoinMarketCap.\n\nBiden previously mentioned wanting to close crypto loopholes in May when his official Twitter account tweeted that Congress should close “tax loopholes that help wealthy crypto investors,” which the tweet estimated at about $18 billion in lost tax revenue.\n\nThe crypto “loophole” in question likely refers to the fact that, unlike with traditional equities, traders can sell and repurchase cryptocurrency within short windows without incurring a higher tax rate.\n\nThe increasing scrutiny from regulators did not stop Bitcoin from hitting a 52-week high above $31,000 last week on the back of BlackRock’s application for a spot Bitcoin ETF. Several other firms like WisdomTree and Invesco followed BlackRock in applying for a spot Bitcoin ETF, and on Tuesday, the Block reported that Fidelity would soon file for its own.\n\nLast week also saw nearly $200 million worth of inflows pour into digital asset investment products—the highest weekly inflows in nearly a year, according to a report by CoinShares."
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYWxsLXRvcC0xMC1jcnlwdG9zLWxvc2UtZ3JvdW5kLWF6dWtpLWRpc2FwcG9pbnRzL9IBUmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYWxsLXRvcC0xMC1jcnlwdG9zLWxvc2UtZ3JvdW5kLWF6dWtpLWRpc2FwcG9pbnRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, all top 10 cryptos lose ground; Azuki Elementals NFT disappoints investors - Forkast News",
        "content": "Bitcoin fell but stayed above the US$30,000 threshold on Thursday morning in Asia. All top 10 non-stablecoin cryptocurrencies traded lower after MicroStrategy, the world’s largest corporate Bitcoin holder, said Wednesday it has acquired 12,333 Bitcoin for $347 million over the past two months. Additionally, traditional financial institutions continue to show interest in venturing into the U.S. digital asset industry, with ARK Invest amending its spot Bitcoin exchange-traded fund (ETF) application to enhance the chance for regulatory approval.\n\nBitcoin, altcoins lose ground\n\nBitcoin dropped 1.57% to US$30,103 over the last 24 hours to 7:00 a.m. in Hong Kong, according to data from CoinMarketCap. The world’s largest cryptocurrency by market capitalization is down 0.12% over the past seven days.\n\nEther fell 3.12% to US$1,827 for a loss of 3.51% for the week.\n\nAll other top 10 non-stablecoin cryptocurrencies traded lower. Cardano was the biggest loser among the top 10, logging a 6.49% 24-hour fall and a 6.65% weekly loss.\n\nOn Wednesday, business analytics firm MicroStrategy said in an exchange filing that between April 29 and June 27, the company and its subsidiaries together acquired roughly 12,333 Bitcoin for US$347 million in cash at an average price of US$28,136 per Bitcoin.\n\nThat purchase took its total Bitcoin holdings to 152,333 Bitcoin as of Tuesday, the company said.\n\nMeanwhile, on Wednesday, investment management fund ARK Invest filed an amendment to its April application for a spot Bitcoin ETF. The application — which would see the firm partner with crypto exchange-traded product provider 21Shares — now includes a proposed surveillance-sharing agreement.\n\nAs seen in the ETF application made by investment firm BlackRock earlier this month, an agreement of that kind is seen as a way to prevent market manipulation, increasing the application’s chances of success. If approved, it would become the first such ETF in the U.S. market.\n\n21Shares said Wednesday that the recent wave of spot Bitcoin ETF applications is “validating” for investors in the asset class.\n\n“Bitcoin has proven its value as an investable asset and disruptive technology, amidst the current markets and regulatory headwinds,” Hany Rashwan, co-founder and chief executive officer of 21Shares, said in the statement.\n\nThe total cryptocurrency market cap dropped 2.26% to US$1.16 trillion, with trading volume dropping 3.77% to US$34.12 billion, according to CoinMarketCap data.\n\nAzuki floor price plummets\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dipped 0.79% to 2,852.82 in the 24 hours to 9:20 a.m. in Hong Kong. The index is down 1.79% for the week.\n\nNFT trading volume on Ethereum dropped 56.24% to US$27.39 million over the past 24 hours, while volume on the Bitcoin network rose 105.26% to US$2.83 million, according to CryptoSlam data.\n\nAzuki-related NFT collections topped the chart in CryptoSlam’s sales volume ranking. The new Azuki Elementals collection logged a 34.02% increase in the past 24 hours to US$6.04 million in sales volume.\n\nSales of the original Azuki dropped 24.16% to US$4.59 million, and the Azuki Elemental Beans sales dropped 91.21% to US$2.96 million.\n\nWhile the new Azuki Elementals sold out its 20,000 NFTs within 15 minutes when it began minting on Tuesday, collectors were “angry” as the new NFTs looked almost identical to the original Azuki collection. According to Yehudah Petscher, NFT strategist at Forkast Labs, the parent company of Forkast.News, that could potentially devalue the NFT industry as a whole.\n\n“Lenders are taking a hit on Azuki NFTs as the prices have fallen, borrowers default on loan, and then new owner immediately sells to recover what they can before the price falls even further,” Petscher said. “It’s a vicious cycle that has yet to find the bottom.”\n\nThe floor price of Azuki Elementals dropped to 1.38 Ether (US$2,530) on Thursday morning in Asia from its mint price of 2 Ether, according to data from NFT tracker NFTpricefloor.com. The original Azuki NFT’s floor price fell to 8.85 Ether from over 17 Ether a week ago.\n\nCriticism from the Azuki community led its development team to admit mistakes had been made in the design of the Elementals collection.\n\nAzuki,\n\n\n\nIt's always both challenging & exciting opening up the gate to the Garden.\n\n\n\nThis time, we missed the mark.\n\n\n\nWe hear you – the mint process was hectic, the PFPs feel similar and, even worse, dilutive to Azuki. — Azuki (@Azuki) June 28, 2023\n\nThe Azuki project then teased what appears to be a “green beans” new collection, which NFT enthusiasts “speculate may evolve the initial Azuki 10,000 collection into a different looking new collection,” Petscher added.\n\nPowell signals more restrictions coming\n\nU.S. Fed Chair Jerome Powell spoke Wednesday at a European Central Bank forum in Portugal.\n\nImage: ECB\n\nAsia equity markets mostly edged higher on Thursday morning as investors weighed the risk outlook for potential interest rate hikes in the U.S. this year.\n\nU.S. stock futures rose as of 10:30 a.m. in Hong Kong. Dow Jones Industrial Average futures edged up 0.13%, S&P 500 futures climbed 0.13%, and Nasdaq Futures added 0.19%.\n\nU.S. Federal Reserve Chairman Jerome Powell said Wednesday at a European Central Bank forum in Portugal that there will be “more restriction coming,” signaling that the Fed may raise rates at the next two meetings if necessary.\n\n“I wouldn’t take…moving at consecutive meetings off the table,” Powell said.\n\nPowell is expected to speak again on Thursday at the Banco de España Fourth Conference on Financial Stability in Madrid, Spain.\n\nU.S. interest rates are now between 5% and 5.25%, the highest since 2006. The CME FedWatch Tool predicts an 81.8% chance for another 25-basis-point rate hike, and an 18.2% chance the Fed will leave rates unchanged at the next meeting on July 26.\n\nMarkets in Singapore, Malaysia and Indonesia are closed for the Eid al-Adha holidays.\n\n(Updates to add equities section)"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLW1hcmtldC1kb21pbmFuY2UtcmVhY2hlcy01OC0xODUxMDQzNTkuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Market Dominance Reaches 58%—Highest Level Since April 2021 - Yahoo Finance",
        "content": "Bitcoin’s relative percentage of the total cryptocurrency market capitalization has hit 58%, its highest level since April 2021, according to a new report from Coin Metrics.\n\nWith a staggering $590 billion market capitalization, the world’s leading cryptocurrency currently has further pushed back on Ethereum and smaller altcoins. The total market cap for the industry sits at $1.2 trillion according to Coingecko.\n\nThis comes amid news of heightened regulatory scrutiny by U.S. regulators–who recently claimed a handful of cryptocurrencies were unregulated securities, causing several to shed billions off their market capitalizations.\n\nSEC Claims Solana, Polygon, Cardano Are Securities in Binance Lawsuit\n\nBitcoin has been leading a bullish rally over the past week, after BlackRock filed for a spot Bitcoin exchange-traded fund (ETF). The Wall Street colossus sparked Bitcoin’s rise in crypto market dominance and triggered investors to buy the asset—despite many previously denied ETF applications.\n\nThe price boost has also spilled over into other assets, such as Grayscales Bitcoin Trust (GBTC). The so-called “GBTC discount,” which refers to the difference between the price of the shares and the net asset value (NAV) of the Bitcoin it holds, continues to drop, hitting a monthly low of -30%, according to YCharts.\n\nCoin Metrics, an open-source data analytics platform for public blockchains, reported Bitcoin’s dominance steadily dropped during the crypto spring of 2021, slumping to its lowest level in January 2022. At the time it accounted for 37% of the global crypto market cap.\n\nBitcoin Market Dominance Hits Lowest Level Since 2018\n\nThe report also showcased that Bitcoin’s presence in the so-called CBMI 10–Coin Metric’s index for the top 10 cryptocurrencies–has hit its highest point in 2 years, weighing in at 65%. The metric, however, excludes stablecoins such as Tether (USDT) or USDC.\n\nBitcoin is up year-to-date 85%, currently trading hands at $30,395 as per Coingecko data. The asset has outscored the majority of cryptocurrencies in 2023, with notable exceptions from Bitcoin Cash (BCH) and Lido Finance (LDO)."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmV0ZnN0cmF0ZWd5LmNvbS92b2xhdGlsaXR5LXNoYXJlcy11bnZlaWxzLWZpcnN0LXVzLWxpc3RlZC1sZXZlcmFnZWQtYml0Y29pbi1ldGYtMTAzMzkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Volatility Shares unveils first US-listed leveraged bitcoin ETF - ETF Strategy",
        "content": "Volatility Shares has introduced the first ETF in the US providing leveraged exposure to bitcoin.\n\nThe 2x Bitcoin Strategy ETF (BITX US) has been listed on Cboe BZX Exchange with an expense ratio of 1.85%.\n\nThe fund provides twice the daily performance of the S&P CME Bitcoin Futures Daily Roll Index which tracks the value of cash-settled, front-month bitcoin futures linked to the CME CF Bitcoin Reference Rate, an aggregate of bitcoin prices across multiple eligible cryptocurrency exchanges.\n\nThe bitcoin futures contracts underlying the index are partially rolled into the following month on a daily basis.\n\nThe price of bitcoin has increased by roughly 85% year-to-date, from circa $16,500 at the end of 2022 to $30,600 on 29 June. This marks a notable turnaround for the world’s largest cryptocurrency which lost nearly 65% of its market value last year amid gloomy macroeconomic conditions, rapidly rising interest rates, and a host of negative crypto industry-related events such as the Terra Luna crash and the implosion of FTX, the world’s largest crypto exchange.\n\nAnalysts have attributed the current rally to a general weakening of the US dollar, a cooling of inflation, and the Federal Reserve slowing and most recently halting their interest rate hikes. A banking crisis that saw three small- to mid-size US banks fail over a week in March also helped to shine a light on the crypto industry’s potential advantages over the traditional financial sector.\n\nVolatility Shares’ introduction of a leveraged bitcoin ETF in the US enables sophisticated investors to amplify returns from further increases in the price of bitcoin. Leveraged ETFs do come with significant risks, however, which is why they are generally not suitable for a retail audience. Specifically, these funds are not appropriate as buy-and-hold investments as they tend to decay in value if held for an extended period of time, potentially leading to large losses, especially in volatile but range-bound markets.\n\nThe launch of BITX marks another milestone in the crypto industry’s march into the mainstream. The US market is already home to inverse bitcoin ETFs as well as several ETFs providing traditional, unleveraged exposure to bitcoin.\n\nAll of the above funds deliver their exposure to bitcoin by way of futures contracts. While many issuers have sought to launch directly replicating bitcoin ETFs, the SEC has consistently refused to greenlight these applications, citing concerns regarding validating the ownership of these funds’ underlying tokens.\n\nMany analysts have noted, however, that the SEC’s stance may be softening, leading many big-name institutions including BlackRock and Fidelity to suddenly throw their hat into the ring and file for their own spot bitcoin ETFs."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1pbmVycy1zZW5kLXJlY29yZC1pbmZsb3dzLXRvLWV4Y2hhbmdlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin miners send record $128M in revenue to exchanges - Cointelegraph",
        "content": "Bitcoin (BTC) miners are sending record amounts of BTC to centralized crypto exchanges.\n\nIn a June 27 tweet, on-chain analytics platform Glassnode reported an all-time high in Bitcoin miner revenue sent to exchanges.\n\nPercent of miner revenue sent to exchanges. Source: Glassnode\n\nIt noted that there was currently an “extremely high exchange interaction,” from Bitcoin miners which had sent a record $128 million to exchanges over the past week. This is equivalent to 315% of their daily revenue, the analytics platform noted.\n\nThere have been several spikes in miner revenue sent to exchanges during the 2021 bull run as they took profits. There was also a capitulation inflow in late 2022 as markets hit their cycle bottom.\n\nHowever, this latest spike has dwarfed them all by a considerable margin.\n\nUsually, when miners send BTC profits to exchanges they do so in preparation to cash out to cover their expenses and take profits.\n\nThis past week would be a good time to do so since BTC hit its highest price of the year so far, touching $31,185 on June 24.\n\nAt the time, CryptoQuant co-founder and CEO Ki Young Ju echoed the sentiment, stating that the current price-to-earnings ratio was at an “attractive price for miners to sell.”\n\nBitcoin prices are yet to be affected however, as the asset remains slightly above the $30,000 threshold at the time of publication.\n\nNevertheless, the current $31,000 price zone is a major resistance level for BTC, with markets failing to break it in mid-April and again in late June. If bulls can't break new ground future losses are expected, especially if miners start liquidating.\n\nBitcoin mining profitability, or hash price, has increased slightly over the last week due to the rise in BTC prices. It is currently $0.076 TH/s (terahashes per second) per day, according to HashrateIndex.\n\nRelated: Riot Platforms to add 33,000 Bitcoin miners ahead of 2024 halving\n\nDespite the price of Bitcoin increasing more than 88% year-to-date, miners are still facing some tough challenges. Profitability has slumped more than 30% since July last year and is down over 80% since the peak of the 2021 bull market.\n\nWhen combined with almost record hash rates of 377 EH/s and peak difficulty levels, Bitcoin miners are still facing an uphill battle.\n\nIncreasing hash rates and difficulty, combined with higher energy prices, have put downward pressure on mining profitability. This means that selling their hard-earned Bitcoin may prove an unpleasant necessity to cover expenses.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV0Zi1yYWNlLWdldHMtaG90dGVyLWFzLWFyay1pbnZlc3QtYWRkcy1zdXJ2ZWlsbGFuY2UtYWdyZWVtZW50LXRvLWFwcGxpY2F0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin ETF race gets hotter as ARK Invest adds surveillance agreement to application - Cointelegraph",
        "content": "ARK Investment Management has amended its spot Bitcoin (BTC) exchange-traded fund (ETF) application with the United States Securities and Exchange Commission, making it similar to BlackRock’s recent filing.\n\nThe amendments include a surveillance sharing agreement with the Chicago Mercantile Exchange (CME) futures markets and crypto exchange, most “likely Coinbase,” said Bloomberg ETF analyst Eric Balchunas on Twitter.\n\nIn the race for the first Bitcoin ETF in the United States, ARK’s filing update puts it ahead of its competitors.\n\nJUST IN: ARK has amended their 19b-4 for spot bitcoin ETF to include a surveillance sharing agreement bt CBOE and a crypto exchange (likely Coinbase), which makes their's like BlackRock's filing now, and puts them in pole position to be approved first bc they filed first. pic.twitter.com/P8PCmPdhln — Eric Balchunas (@EricBalchunas) June 28, 2023\n\nThe investment company of Cathie Wood and the European asset manager 21Shares requested approval for a spot BTC ETF a third time in April after previous applications were denied in 2021 and 2022. As a reason for the rejections, the regulator noted that it did not meet the rules of practice and Exchange Act requirements for listing a financial product.\n\nSpeaking in a recent interview, Bloomberg Intelligence ETF analyst James Seyffart confirmed that ARK’s request is the front-runner for a Bitcoin ETF. “21Shares, ARK and Cboe [Chicago Board Options Exchange] are first in line because their next SEC decision date is Aug. 13, 2023, and we don’t yet have a date for the other 19b-4 applications like the one from BlackRock,” he noted.\n\nEven if ARK receives approval in the coming weeks, the BTC ETF saga may not be over, as it still needs to appoint a crypto exchange to enter into a surveillance-sharing agreement. Although Coinbase may be a strong candidate for this position, the company has already partnered with BlackRock to become a Bitcoin custodian should approval be granted.\n\n“Would BlackRock [...] even allow Coinbase to enter into a SSE agreement with another that would help another issuer beat them to market? If so ARK would need another crypto exchange to use,” Balchunas continued on Twitter.\n\nBlackRock joined the long line of applicants on June 16, triggering a wave of similar initiatives on Wall Street, especially from previous applicants. Financial investment firms such as Valkyrie, WisdomTree and Invesco have refiled for spot Bitcoin ETFs in the past few days.\n\nCointelegraph reached out to ARK Invest but did not receive an immediate response.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9maWRlbGl0eS1yZW5ld3MtcHVzaC1mb3Itc3BvdC13aXNlLW9yaWdpbi1idGMtdHJ1c3QtbWFraW5nLWl0LTd0aC1hcHBsaWNhbnQtdGhpcy15ZWFy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Fidelity renews push for spot Wise Origin BTC Trust, making it 7th applicant this year - Cointelegraph",
        "content": "Asset manager Fidelity Investments has filed an application for a spot Bitcoin exchange-traded fund (ETF), according to a filing by Cboe BZX Exchange with the United States Securities and Exchange Commission (SEC) dated June 19.\n\nFidelity’s application follows BlackRock’s spot Bitcoin ETF application on June 15 and those of WisdomTree, Invesco and Valkyrie in the following days. According to Bloomberg, seven applications for a spot Bitcoin (BTC) ETF have been filed this year. Like WisdomTree and Invesco, Fidelity was making a second try at a spot BTC ETF. Similar to other spot BTC ETF applications, this one stated that the CME Bitcoin Futures market “represents a regulated market of significant size as it relates […] to the spot bitcoin market.” It argued the point in detail and cited extensive research to support its view. The 193-page application said:\n\n“The lack of a Spot Bitcoin ETP [exchange-traded product] exposes U.S. investor assets to significant risk because investors that would otherwise seek crypto asset exposure through a Spot Bitcoin ETP are forced to find alternative exposure through generally riskier means.”\n\nIt went on to mention the bankrupt FTX, Celsius, BlockFi and Voyager Digital as riskier alternatives of the past. It also argued that investors may buy shares in companies such as Tesla and MicroStrategy — that is, unrelated businesses that have significant BTC investments — to gain BTC exposure themselves.\n\nRelated: MicroStrategy’s stock price more than doubles in 2023 in lockstep with Bitcoin\n\nFidelity Digital Assets Services, a regulated custodian licensed by the New York Department of Financial Services, would be responsible for custody of the trust’s BTC. Cboe BZX said it would enter into a surveillance-sharing agreement with a United States-based cryptocurrency exchange.\n\nMichael Saylor: BlackRock, Citadel, & Fidelity Will Send #Bitcoin to $1,000,000\n\n\n\n“It looks like a spot ETF will probably get approved. There’s massive political pressure to approve one. The circumstances have changed & now there’s a way for the SEC to approve it without… pic.twitter.com/NkEepPPbnF — Crypto News Alerts (@CryptoNewsYes) June 28, 2023\n\nThe SEC has yet to approve a single application for a spot BTC ETF. The Fidelity 19b-4 form indicated that the firm is reviving its Wise Origin Bitcoin Trust product, which it filed an application for in March 2021. That application was rejected after two extensions of deliberations.\n\nFidelity has about $11 trillion in assets under administration.\n\nMagazine: 6 Questions for Jennifer Wines of Fidelity Private Wealth Management"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmV0ZnN0cmVhbS5jb20vYXJ0aWNsZXMvYml0Y29pbi1kcml2ZXMtY3J5cHRvLWV0cHMtdG8tbGFyZ2VzdC13ZWVrbHktaW5mbG93cy1pbi1hLXllYXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin drives crypto ETPs to largest weekly inflows in a year - ETF Stream",
        "content": "Cryptocurrency exchange-traded products (ETPs) recorded their largest weekly inflows since July last year after BlackRock’s spot bitcoin filing in the US peaked investors’ interests.\n\nDigital asset ETPs recorded inflows of $199m last week – $187m of which flowed into bitcoin – correcting almost nine weeks of outflows, according to CoinShares weekly flows data.\n\nEurope accounted for $87.2m of the inflows, with the $664m ETC Group Physical Bitcoin ETP (BTCE) recording $77m inflows.\n\nAsset managers have started lining up behind BlackRock’s filing, with WisdomTree, Invesco and Valkyrie all reapplying for previously rejected filings.\n\nMeanwhile, institutional-focused crypto exchange ETX Markets was launched, backed by Citadel Securities, Fidelity International and Charles Schwab.\n\nAs well as inflows, the news also boosted trading volumes, totalling $2.5bn for the week, 170% above the average so far this year.\n\nInflows elsewhere were limited, with Ethereum seeing inflows of $7.8m, while the renewed sentiment did not trickle down to altcoins with only minor flows for XRP and solana.\n\nSource: CoinShares, Bloomberg\n\nJames Butterfill, head of research and investment strategy at CoinShares, said: “We believe this renewed positive sentiment is due to recent announcements from high-profile ETP issuers that have filed for physically backed ETFs with the US Securities and Exchange Commission (SEC).\n\n“Total assets under management (AUM) are now at $37bn, their highest since before the collapse of 3 Arrows Capital.”\n\nThe SEC’s approval of a bitcoin ETF remains in the balance, but its approval of a Volatility Shares leverage bitcoin ETF last week has some anticipating a spot bitcoin ETF approval.\n\nIn a recent note on digital assets, Bank of America (BoA) said it expects the asset class to be supported by regulatory clarity “over the intermediate term”.\n\nDigital assets are one of the best-performing asset classes this year, up 33% to 20 June, ahead of stocks (14%), gold (6%) and investment grade bonds (4%), according to BoA.\n\nBitcoin is up 85% year to date, edging towards $31,000 on institutional demand."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZGVjcnlwdC5jby8xNDY1NTQvbWljcm9zdHJhdGVneS1pbmNyZWFzZXMtYml0Y29pbi10cmVhc3VyeS10by00LTUtYmlsbGlvbtIBV2h0dHBzOi8vZGVjcnlwdC5jby8xNDY1NTQvbWljcm9zdHJhdGVneS1pbmNyZWFzZXMtYml0Y29pbi10cmVhc3VyeS10by00LTUtYmlsbGlvbj9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "MicroStrategy Buys More Bitcoin, Treasury Tops $4.5 Billion - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nMicroStrategy has continued its Bitcoin-buying spree and now holds a total of 152,333 digital coins—today worth $4.5 billion.\n\nA Wednesday filing with the U.S. Securities and Exchange Commission shows that the company bought 12,333 bitcoins for approximately $347 million in cash between April 29 and June 27. This marks the largest purchase so far for MicroStrategy.\n\nThe average purchase price of the Bitcoin it holds stands at approximately $29,668 per coin, the filing notes.\n\nAD\n\nAD\n\nMicroStrategy, which provides business intelligence, mobile software and cloud-based services, holds more Bitcoin than any other publicly traded company.\n\nThe firm started buying the cryptocurrency back in August 2020; its co-founder Michael Saylor said at the time that the reason was as a hedge against inflation. Earlier today, he reshared the news about the company adding to its Bitcoin treasury on Twitter.\n\nMicroStrategy has acquired an additional 12,333 BTC for ~$347.0 million at an average price of $28,136 per #bitcoin. As of 6/27/23 @MicroStrategy hodls 152,333 $BTC acquired for ~$4.52 billion at an average price of $29,668 per bitcoin. $MSTR https://t.co/joHo1gEnR0 — Michael Saylor⚡️ (@saylor) June 28, 2023\n\nThe biggest digital asset by market cap is up significantly from its price back then of under $12,000 per coin. Since 2020, Saylor has spoken about Bitcoin being “engineered, synthetic, pharmaceutical-grade gold.”\n\nLast month, Saylor said his company’s strategy “is to buy and hold Bitcoin, and the key for us is to be consistent, transparent and responsible in the pursuit of that strategy.”\n\nAD\n\nAD\n\nDespite Bitcoin having nosedived from its November 2021 all-time high of $69,044, MicroStrategy’s plan seems to be paying off: the company’s stock—which trades as MSTR on the Nasdaq—is up over 162% since its first Bitcoin buy in 2020.\n\nMicroStrategy is currently working on an “enterprise Lightning solution,” Saylor has said, to help companies move money quickly. The Lightning Network is a second-layer network which allows people to make Bitcoin transactions quickly and cheaply."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTI5L2Jlbi1tY2tlbnppZS1vbi1oaXMtbmV3LWNyeXB0by1ib29rLWJpdGNvaW4tYW5kLW1lZXRpbmctc2FtLWJhbmttYW4tZnJpZWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Ben McKenzie on His New Crypto Book, Bitcoin and Meeting Sam Bankman-Fried - Bloomberg",
        "content": "Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world"
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ0Yy1wcmljZS1zdXJnZS1kcml2ZW4tcmV0YWlsLWZpcmVibG9ja3MtY2Vv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price surge will come from retail, not institutions: Fireblocks CEO - Cointelegraph",
        "content": "While an approved BlackRock spot Bitcoin (BTC) exchange-traded fund (ETF) will funnel new institutional money to Bitcoin, it’s going to be the retail investors who ultimately drive any significant price surges, according to Michael Shaulov, the CEO and co-founder of institutional custody platform Fireblocks.\n\nOn June 15, investment colossus BlackRock filed for a spot Bitcoin ETF, leading to other financial firms filing their own — along with Bitcoin's price reaching its highest levels in a year.\n\nHowever, while many are hopeful that institutional involvement in crypto will further rocket prices, Shaulov noted that this may not necessarily happen.\n\n“When institutions come in to participate in the market and they’re doing it in a quiet way, they’re able to do it almost without moving the price,” Shaulov told Cointelegraph during Australian Blockchain Week.\n\nMichael Shaulov speaking with Cointelegraph editor Felix Ng at Australian Blockchain Week.\n\nAccording to Shaulov, mid-2020 saw ”massive inflows” of institutional money, but prices didn’t really appreciate until retail investors frenzied over crypto assets later in the year.\n\n“Even though there were massive inflows, those institutions were sophisticated enough to acquire [BTC] slowly and use algorithms that won’t drive up the market.”\n\nInstead, “50% increases [came] from retail […] because they’re participating in a way that’s less sophisticated and moves the price dramatically,” he explained.\n\nThat being said, Shaulov noted that the “physics of Bitcoin” — mainly its finite supply — mean that any mass buy-up of Bitcoin should end up moving the needle.\n\n“It’ll definitely be easier for some institutions that are currently not participating in the market to add Bitcoin to their allocation.”\n\nWhy Bitcoin?\n\nInterestingly, Shaulov, who founded Fireblocks in 2018, believes that the narrative surrounding Bitcoin is still “playing out” for these institutions.\n\nShaulov said that today, there are numerous Bitcoin-based narratives still at play: Is it a hedge against inflation? Is it a public reserve currency? Is that a hedge against government financial misdealings?\n\nYou work for it.\n\n\n\nThey just print it and laugh about it.\n\n\n\nWhy would you be played like that?#Bitcoin fixes this. pic.twitter.com/omVxsB9zCV — Daniel Prince (@PrinceySOV) June 26, 2023\n\nShaulov said that personally, he believes Bitcoin is the “ultimate insurance asset.”\n\nRelated: Fireblocks VP: Big names won’t go back after discovering crypto payments’ potential\n\n“It has all it has the properties [of something] for when everything gets worse. It is an asset that is disconnected from the government. It’s an asset that can be digitally native. It's an asset that can be moved easily.”\n\n“It doesn’t matter if at one point it’s worth $15,000, $20,000 or $60,000. You just need to have enough of it in that variance in order to survive a period,” he said.\n\nOpinion: GOP crypto maxis almost as bad as Dems’ ‘anti-crypto army’"
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90ZXRoZXItdG8tYnVpbGQtYml0Y29pbi1wMnAtaW5mcmFzdHJ1Y3R1cmUtZm9yLWdlb3JnaWEtbW91LXNpZ25lZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Tether signs MoU with Georgia to develop Bitcoin P2P infrastructure - Cointelegraph",
        "content": "Stablecoin issuer Tether has signed a memorandum of understanding (MoU) with the government of Georgia to develop Bitcoin and peer-to-peer (P2P) infrastructure in the country. The strategic collaboration between the Tether and the Georgian government will focus on building key infrastructure for a thriving startup ecosystem in Georgia.\n\nThe collaborative effort aims to attract international attention and investment toward the nascent decentralized space. The partnership aims to foster the growth of P2P technology at a state level and help build financial tools around it. Some of the key areas of development include education on Bitcoin (BTC) and blockchain technology, building payment infrastructure for merchants, and developing a resilient, open and private P2P communication system.\n\nPaolo Ardoino (CTO, Tether) and Irakli Nadareishvili (Deputy Minister of Economy and Sustainable Development) signing the MOU for the collaboration between Tether and the Government of Georgia to develop Blockchain, #Bitcoin and Peer-to-Peer Infrastructure. pic.twitter.com/g3LayZxDPX — Tether (@Tether_to) June 28, 2023\n\nTether said the partnership with the Georgian government would also look at creating and implementing a strong, autonomous financial and communication system. This entails encouraging the adoption of P2P technology-based digital payment and communication systems, as well as improving existing infrastructure to ensure its robustness and dependability in supporting blockchain-based solutions. The collaboration intends to bring changes to public administration and the business sector.\n\nGeorgia will create a special fund for local startups to help develop blockchain technologies and position Georgia as a country with an attractive ecosystem for tech startups. Irakli Nadareishvili, Deputy Minister of Economy and Sustainable Development, said the collaborative effort “will contribute to the development of local blockchain technologies in the country, as well as the introduction of companies operating in this sector in Georgia.”\n\nRelated: Peer-to-peer crypto exchanges struggle to navigate shifting legal landscape\n\nTether’s collaborative effort in Georgia is not its first. Over the years, many crypto companies have worked closely with governments to advance the nascent technology. In most cases, collaborations translate into a better understanding of the tech by governments, eventually leading to positive regulation.\n\nEl Salvador, the first country to make Bitcoin a legal tender, had Bitfinex as its key exchange technology partner and granted the country’s first digital asset license to the exchange. Similarly, crypto exchange Binance signed an MoU with Kazakhstan in May 2022 and received compliance approval from the government a year later.\n\nTether didn’t respond to Cointelegraph’s requests for comments by publication.\n\nMagazine: Cryptocurrency trading addiction: What to look out for and how it is treated"
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW4tY29ycmVsYXRpb24tdG8tbmFzZGFxLXNpbmtzLXRvLTMtbG93LWluLWp1bmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin correlation to Nasdaq sinks to 3% low in June - CryptoSlate",
        "content": "Bitcoin’s (BTC) correlation with the Nasdaq sank to 3% in June, according to data from Kaiko – indicating diverging sentiment between cryptocurrencies and tech stocks.\n\nThe price-performance for the leading cryptocurrency in June was between $24,800 and $31,360, opening the month at $27,200.\n\nBlackRock’s spot Bitcoin ETF filing on June 15 was a bullish catalyst, reversing the prior downtrend to a new year-to-date high of $31,440 some eight days later.\n\nSince then, Bitcoin has been trading in a narrow band between $29,860 and $31,030 – falling 3% since its YTD high on June 23.\n\nMeanwhile, the tech-heavy Nasdaq 100 has been in a continuous uptrend since the start of the year – reaching a YTD high of $15,230 on June 16. Since Bitcoin’s year-to-date high on June 23, the Nasdaq has risen 0.7%.\n\nOn a 30-day basis, the Bitcoin-Nasdaq correlation started the year at 60% and slipped to 22% by March, indicating a decrease in the similarity of price movements between the two. This period of change consolidated somewhat, with the correlation struggling to rise above 45%.\n\nThe Bitcoin-Nasdaq correlation has continued to move lower throughout the year, dropping sharply to 3% this week from over 20% in May.\n\nData research firm Ecoinometrics published a chart of Bitcoin-Nasdaq range movements from the start of the year to June 24. It showed a similar trend between the two until April, after which a “nice decoupling” occurred.\n\nEcoinometrics further commented that the Nasdaq’s performance is disconnected from the broader macroeconomic landscape – implying an uptrend reversal is on the cards.\n\n“But this bear market rally for stocks cannot escape the bleak macro picture forever.“\n\nMentioned in this article"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWNsaW5ncy0zMGstZmVkLXBvd2VsbC1tb3JlLXJhdGUtaGlrZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price clings to $30K as Fed's Powell stresses more rate hikes - Cointelegraph",
        "content": "Bitcoin (BTC) staged another retest of $30,000 support on June 28 as the United States Federal Reserve stayed hawkish on inflation.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nPowell on rate hikes: “More restriction coming”\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price action sticking to a narrow range at the Wall Street open.\n\nThis accompanied fresh comments on economic policy from Fed Chair Jerome Powell.\n\nSpeaking during a two-day discussion with other central bank heads at the European Central Bank Forum on Central Banking 2023 in Sintra, Portugal, Powell reiterated Fed consensus for further interest rate hikes this year.\n\nHaving paused the hiking cycle, which began in late 2021, this month, Powell nonetheless stressed that there was still room for further policy tightening.\n\n“Really, policy hasn’t been restricted for very long,” he said.\n\n“We started at negative real interest rates; we’ve since moved up to where we are actually in restrictive territory, but we haven’t been there very long, so we believe there’s more restriction coming.”\n\nPowell said that there was majority support for at least two further rate hikes going forward.\n\nBitcoin appeared hesitant as a result, retracing the prior day’s gains to shy away from a renewed attack on yearly highs at $31,000.\n\nReacting, market participants nonetheless chose to wait and see.\n\n“Price bullishly explodes from the lows, takes a pause at the range high, and then continues to new yearly highs,” popular trader CryptoCon wrote in part of a tweet.\n\nAn accompanying chart demonstrated that BTC’s price was in familiar territory on its way up.\n\nBTC/USD annotated chart. Source: CryptoCon/Twitter\n\nMicroStrategy Bitcoin dip-buying returns\n\nNews that MicroStrategy had purchased more than 12,000 BTC for its corporate treasury, meanwhile, failed to have a tangible impact.\n\nRelated: BTC price metric warns that Bitcoin speculators may sell past $33K\n\n$BTC\n\nlmao it appears the market doesn't approve of saylor's BTC purchase pic.twitter.com/86iP6qg9Do — Skew Δ (@52kskew) June 28, 2023\n\nConfirmed by CEO Michael Saylor, the company announced that it had added 12,333 BTC — worth at the time $347 million — to its reserves, bringing its aggregate cost basis to $29,668 per BTC.\n\nAccording to monitoring resource Bitcoin Treasuries, MicroStrategy now owns almost 0.7% of the entire potential BTC supply.\n\nIt also owns 10 times more than the second-largest treasury, belonging to Voyager Digital, which owns 12,260 BTC.\n\nPublic companies’ BTC holdings (screenshot). Source: Bitcoin Treasuries\n\nMagazine: How smart people invest in dumb memecoins: 3-point plan for success\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZGVjcnlwdC5jby8xNDY1MTAveW91LWNhbi1ub3ctZWFybi1iaXRjb2luLXBsYXlpbmctY2FuZHktY3J1c2gtY2xvbmXSAVJodHRwczovL2RlY3J5cHQuY28vMTQ2NTEwL3lvdS1jYW4tbm93LWVhcm4tYml0Y29pbi1wbGF5aW5nLWNhbmR5LWNydXNoLWNsb25lP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "You Can Now Earn Bitcoin for Playing This Candy Crush Clone - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nDeep down, I know that Candy Crush Saga isn’t a particularly clever or inventive puzzle game—but nearly a decade after first savoring its specific brand of freemium dopamine hit, I still can’t help but get lost in its mindless, color-matching glow from time to time. And now there’s a version that pays you cryptocurrency for playing it.\n\nGranted, Sweet Bitcoin isn’t an official Candy Crush Saga game, and it’s not created by mobile giant King. Like so many iOS and Android games, it’s a pretty convincing knockoff that matches the feel and flow of the juggernaut franchise. In this case, however, Bling Financial’s copycat game nails the basics while rewarding you with bits of Bitcoin or Ethereum along the way.\n\nSweet Bitcoin doesn’t fuss with the classic formula. Here, you’re still trying to match three or more like-colored candies on a grid, with the aim of completing some basic objective—clearing X number of this candy, or spreading a bubble-gum sheen across the whole board by making matches—within a limited number of moves.\n\nAD\n\nAD\n\nScreenshots from Sweet Bitcoin on iPhone. Image: Decrypt\n\nBling’s facsimile packs in hundreds of levels, and from the few dozen I played, Sweet Bitcoin amiably recreates the real deal. In fact, it feels less prone to serious difficulty spikes—a trademark feature of Candy Crush that’s tied to its freemium model, thus potentially nudging players to spend real money to buy more in-game lives instead of waiting to play again.\n\nSweet Bitcoin is a free-to-play game too, but it’s anchored around full-screen video ads that you’re forced to watch after each and every level you play. The downside, of course, is that you have to pause to watch obnoxious ads for scammy-looking games, some of which promise to pay you hundreds of dollars a day for playing them. That’s surely not legit.\n\nI know that because Sweet Bitcoin itself pays you crypto for playing, and it doesn’t come anywhere close to that kind of payout. In fact, my earnings tallied up to around $0.05 per hour worth of Bitcoin. After about two hours of playing, I had a dime’s worth of BTC sent to Coinbase.\n\nIt’s not much, but that's pretty much par for the course for games like this. It varies by game and developer, but in my experience, you’ll typically only earn a few cents per hour worth of crypto. With Bling games, you’re rewarded with “Bling points” that can be converted into BTC or ETH and cashed out, but the end result is the same: free crypto for playing amusing mobile games.\n\nThe repetitive and overlong ads quickly turn tiresome, however, plus the amount of points you earn per level appears to diminish over time. After a few hours, I was ready to flee back to the safety of one of the handful of official Candy Crush incarnations for my next fix.\n\nAD\n\nAD\n\nEven so, Sweet Bitcoin served up the most fun I’ve had playing any of these crypto-earning mobile games to date. What it lacks in originality it makes up for with… well, free crypto for playing a solid imitation of an addictive mobile game. If you can put up with the ads, that is."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9idWxsZXQtYmxvY2tjaGFpbi1leHBhbmRzLXByZXNlbmNlLWNyeXB0b2N1cnJlbmN5LTExMzAwMDQwNC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Bullet Blockchain Expands Presence in the Cryptocurrency Market With Acquisition of Bitcoin ATM Fleet - Yahoo Finance",
        "content": "Bullet Blockchain, Inc.\n\n“Bullet ATM” Branded ATM Machines Will be Integrated With the Company’s Patented Technologies, Making Them the First Licensed Bitcoin ATM Network in North America\n\nRENO, NV, June 28, 2023 (GLOBE NEWSWIRE) -- via NewMediaWire – Bullet Blockchain, Inc. (“BULT” or the “Company”), (OTC: BULT), a pioneering software development and SaaS company at the forefront of blockchain technologies and Web 3.0, is pleased to announce the successful completion of a strategic transaction to acquire a fleet of Bitcoin ATMs. As the owner and licensor of two Bitcoin ATM patents, the Company is excited to expand its offerings and provide greater accessibility to cryptocurrencies.\n\nAs previously announced, BULT acquired an intellectual property portfolio consisting of Bitcoin ATM Patents (the “IP Portfolio”). BULT’s IP Portfolio will be integrated into all Bullet ATMs making it the first licensed Bitcoin ATM network of kiosks in North America. Bitcoin ATMs have experienced significant growth in the United States, driven by the increasing demand for convenient cryptocurrency transactions. According to the website CoinATM Radar, there were nearly 31,000 Bitcoin ATMs in the United States and nearly 2,800 Bitcoin ATMs in Canada as of the time of this release. BULT intends to license its IP Portfolio to other Bitcoin ATM operators and manufacturers in North America.\n\n“We are excited to be one of the few publicly traded Bitcoin ATM companies with our anticipated roll out of our Bullet ATMs,” commented Simon Rubin, Chief Executive Officer. “Bitcoin is a rapidly growing asset class, and we believe that our Bullet ATMs will provide a convenient and easy way for people to get involved. We believe that the Atlanta Georgia metropolitan area is a great market for Bullet ATMs. The city has a large and growing diverse population who are more likely to be interested in Bitcoin. We are confident that our Bullet ATMs will be well-received by the local community.”\n\nBitcoin ATMs allow users to conveniently buy and sell Bitcoin for cash using a free-standing kiosk similar in size to a traditional ATM machine. The process is simple and secure, and users can typically complete a transaction in minutes. These automated machines allow individuals to buy or sell Bitcoin using cash, providing a seamless bridge between traditional fiat currency and the world of digital assets. As the adoption of cryptocurrencies continues to rise, the future of Bitcoin ATMs in the United States appears promising.\n\nStory continues\n\nBitcoin ATMs are becoming increasingly popular, as they offer a convenient way for people to access the Bitcoin market. As more people recognize the potential of Bitcoin and seek to participate in the Bitcoin market, the need for accessible on-ramps becomes crucial without relying on online brokers or exchanges. BULT’s CEO, Simon Rubin, concluded: “Bullet ATMs are a reasonable alternative to online exchanges and the accessibility makes Bullet ATMs an attractive option for both seasoned crypto enthusiasts and newcomers to the space.”\n\nAbout Bullet Blockchain\n\nHeadquartered in Reno, Nevada, Bullet Blockchain Inc. – common stock is publicly traded on the OTC Markets under the symbol (BULT) – the owner and licensor of two Bitcoin ATM patents, is a diversified software development and SaaS company, specializing in blockchain technologies and Web 3.0. BULT is committed to driving the innovations needed to shape the future of digital and blockchain-related platforms through digital technology and decentralized blockchain solutions. Management is dedicated to rapid growth and increasing the shareholders’ value.\n\nShareholders, potential investors, and others should note that we announce material events and material financial information to our shareholders and the public using our website and the social media addresses listed below, as well as in our OTC Markets’ disclosures, press releases, public conference calls, and webcasts. We also use social media to communicate with our email subscribers and the public about BULT, services, and other related information. It is possible that the information we post on social media could be deemed to be material information. Therefore, we encourage shareholders, the media, and others interested in BULT to review the information we post on BULT’s social media channels listed below. This list may be updated from time to time.\n\nFollow us at:\n\nFind BULT news at http://www.BulletBlockchain.com\n\nFollow BULT news on Twitter @BULT_stock\n\nFollow BULT on Reddit at https://www.reddit.com/r/BULT/\n\nFollow BULT on Facebook at https://www.facebook.com/BulletBlockchainInc/\n\nFollow BULT on LinkedIn at www.linkedin.com/in/bullet-blockchain-inc\n\nFind investor and general information at https://www.otcmarkets.com/stock/BULT/profile\n\nFor investor and general information, please email contact@BulletBlockchain.com\n\nForward-Looking Statements:\n\nStatements in this press release that are not statements of historical or current fact constitute \"forward-looking statements.\" Such forward-looking statements involve known and unknown risks, uncertainties, and other unknown factors that could cause the Company's actual operating results to be materially different from any historical results or from any future results expressed or implied by such forward-looking statements. In addition to these factors, actual future performance, outcomes, and results may differ materially because of more general factors, including (without limitation) general industry and market conditions and growth rates, economic conditions, and governmental and public policy changes. The forward-looking statements included in this press release represent the Company's views as of the date of this press release, and these views could change at some point in the future. However, the Company specifically disclaims any obligation to do so. These forward-looking statements should not be relied upon as representing the Company's views as of any date subsequent to the date of the press release. In addition to statements that explicitly describe these risks and uncertainties, readers are urged to consider statements that contain terms such as \"believes,\" \"belief,\" \"expects,\" \"expect,\" \"intends,\" \"intend,\" \"anticipate,\" \"anticipates,\" \"plans,\" \"plan,\" to be uncertain and forward-looking.\n\nContact us: contact@BulletBlockchain.com\n\n\n\n"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMilQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzI4L2NvaW5kZXNrLWluZGljZXMtc21hcnQtY29udHJhY3QtcGxhdGZvcm0taGlnaGxpZ2h0cy10aGUtZGlmZmVyZW5jZS1iZXR3ZWVuLWJpdGNvaW4tYW5kLWV0aGVyLXBlcmZvcm1hbmNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "CoinDesk Indices Smart Contract Platform Highlights the Difference Between Bitcoin and Ether Performance - CoinDesk",
        "content": "Investors who remain bullish on smart contract platforms may be looking for an uptick in stablecoin supplies as a signal of improved sentiment that would affect ETH as well as the remaining assets within the SCPX. This may hold especially true for those with longer investment time horizons, and who have the ability to accumulate positions in SCPX assets, while BTC remains on center stage."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRyYWRlcnMtYnRjLXByaWNlLXNvb24tYnJlYWstYmV5b25kLTMxa9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin traders say BTC price will soon break beyond $31K yearly highs - Cointelegraph",
        "content": "Bitcoin (BTC) aborted a fresh attempt to reach $31,000 on June 29, while traders waited for bulls to succeed.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBTC price “primed to launch”\n\nData from Cointelegraph Markets Pro and TradingView showed BTC price action refusing to leave its short-timeframe trading range.\n\nNow caught between $30,000 and $31,000, BTC/USD lacked impetus to continue the prior week’s uptrend or reverse downward.\n\nFor market participants, however, there was increasingly reason to believe that flipping higher resistance levels to support would come next.\n\nIt is very likely that #Bitcoin will reach the N28CT target of $34,500 in the next push higher\n\n\n\nMy model has nailed every prediction since its creation\n\n\n\n-Bottom in Nov 2022\n\n-Best cycle buying prices in green year\n\n\n\nTime to accumulate is coming to an end..https://t.co/Lg9LBcoDad pic.twitter.com/HF7EwWNpKZ — CryptoCon (@CryptoCon_) June 29, 2023\n\n“Bitcoin’s 2020 Fractal is still in play,” popular trader Jelle wrote in a Twitter update, arguing that Bitcoin was repeating its late 2020 breakout.\n\n“Up only from here if we keep following it. I’m ready.”\n\nBTC/USD annotated chart. Source: Jelle/Twitter\n\nPopular trader and analyst Rekt Capital, meanwhile, eyed equally promising signs on monthly timeframes ahead of the June 30 monthly candle close.\n\n“BTC is positioning itself for a Monthly Close above a resistance that had rejected price for the past three months. And now BTC is holding comfortably above that same level (black),” he commented on an explanatory chart.\n\nBTC/USD annotated chart. Source: Rekt Capital/Twitter\n\nReacting, CryptoCon described BTC/USD as “primed to launch into the resistance zone.”\n\n“Markets are looking ready for another leg upwards,” Michaël van de Poppe, founder and CEO of trading firm Eight, added.\n\n“Bitcoin looks good, but altcoins are moving in tandem too.”\n\nPCE print meets options expiry\n\nThe week’s major macroeconomic data releases still lay ahead.\n\nRelated: Bitcoin speculators send 35K BTC to exchanges in new ‘elation inflow’\n\nWith Jerome Powell, chair of the United States Federal Reserve, set to deliver a second day of commentary on economic policy, June 30 remained the key release date.\n\nPersonal Consumption Expenditures (PCE) figures, the preferred inflation measurement tool for Powell, were tipped to be the volatility catalyst for risk assets.\n\nBeyond macro, the June 30 options open interest expiry was also a talking point, this coming in at a huge $4.7 billion.\n\nBig options expiration date for both ETH and BTC tomorrow\n\n\n\nETH: ~$2B notional\n\nBTC: ~$5B notional\n\n\n\nIf these are rolled into more calls we should see spot buying from dealers to hedge their books; puts opposite story. Either way expect some vol. pic.twitter.com/jWBQ0XOP2p — Tom Dunleavy (@dunleavy89) June 29, 2023\n\nFinancial commentator Tedtalksmacro suggested that there would be limited crypto market movement until the expiry.\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmZhLW1hZy5jb20vbmV3cy9maWRlbGl0eS1qb2lucy1zcG90LWJpdGNvaW4tZXRmLXJhY2Utd2l0aC1mcmVzaC1zZWMtZmlsaW5nLTczNzQ3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Fidelity Joins Spot-Bitcoin ETF Race With Fresh SEC Filing - FA Mag",
        "content": "June 29, 2023\n\nFidelity Investments is the latest financial services heavyweight to throw its name into the race to offer the first US exchange-traded fund investing directly in Bitcoin.\n\nThe Boston-based asset manager, which has about $11 trillion in assets under administration and has tens of millions of customers, re-filed for the Wise Origin Bitcoin Trust, according to a document submitted Thursday with the US Securities and Exchange Commission. Similar to previous US spot Bitcoin ETF filings in the past few weeks, the updated application says that Fidelity expects to enter into a surveillance-sharing agreement with a US cryptocurrency exchange.\n\nIt’s the latest high-profile traditional-finance firm to join the race after BlackRock Inc. made a splash with its June 15 application for a spot ETF, which opened the floodgates for others to try their hand at it, as well. For crypto fans, it’s been a significant string of developments given BlackRock’s reputation on Wall Street, and the view by some market-watchers that the asset manager wouldn’t be making an attempt were it not confident it could get regulatory approval.\n\nThere have been about 30 tries for a spot-Bitcoin product, according to a tally from Bloomberg Intelligence. But applications have faced opposition by regulators, who have in the past cited market concerns and a lack of investor protections, among other things. Fidelity originally filed for the Wise Origin Bitcoin Trust in 2021, which was denied by the SEC in January 2022, according to a Fidelity spokesperson.\n\nEven so, BlackRock’s move spurred a number of similar filings from other issuers, including by Invesco Ltd., WisdomTree, Valkyrie and Bitwise. Meanwhile, Cathie Wood’s ARK Investment Management has said that it believes it could be first in line to get any potential regulatory approval. ARK had in April, in conjunction with crypto-issuer 21Shares, re-filed its application for one.\n\nFans of digital assets are excited about the prospect of crypto potentially becoming more easily accessible to everyday investors, and the wave of filings has been a boon for token prices. Bitcoin jumped back above $30,000 in June and is trading at its highest levels in about a year. The token on Thursday traded around $30,500. That’s still less than half the record of almost $69,000 reached in November 2021.\n\nTo be sure, this isn’t the first hype-cycle over a potential launch. Crypto fans, who have been yearning for a spot-Bitcoin ETF for years, have been through periods of excitement before, only for regulators to ultimately rebuff all attempts.\n\nWhile BlackRock’s filing was credited by observers for helping to push the price of Bitcoin to a one-year high last week, the market reaction to the Fidelity refiling was fairly muted. Bitcoin was up about 1.5% to $30,500 as of 2:25 p.m. in New York, though off the highest level of the day.\n\n--With assistance from Tom Maloney.\n\nThis article was provided by Bloomberg News."
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmFmci5jb20vbWFya2V0cy9jdXJyZW5jaWVzL2JsYWNrcm9jay1zLWJpdGNvaW4tYW1iaXRpb25zLWRyaXZpbmctcHJpY2UtaGlnaGVyLTIwMjMwNjI5LXA1ZGtlMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Crypto: BlackRock's bitcoin ambitions driving price higher - The Australian Financial Review",
        "content": "Risk bellwethers\n\nMr Bishop, who worked as a managing director at Gresham Partners and head of fixed income at Aberdeen Standard Investments before founding crypto advisory group NotCentralised, said BlackRock’s bitcoin gambit shows it was not worried by the SEC’s track record of dismissing applications to offer the digital assets to retail investors.\n\nHe added the $US10 trillion asset manager’s application potentially fired the starting gun on a land grab among competing banks and asset managers to market and sell bitcoin to retail and institutional clients.\n\nBlackRock’s regulatory filing shows it wants to offer its bitcoin fund on the Nasdaq exchange, with custody provided by SEC lawsuit target Coinbase, and Bank of New York Mellon.\n\n“All the cryptocurrencies have become progressively more correlated with broader risk assets. That’s one downside I see of institutional involvement if a manager of BlackRock’s scale, balance sheet, or funds under management is treating this as another investible asset class,” Mr Bishop said.\n\nAdvertisement\n\n“We think of bitcoin as digital gold and ethereum as digital oil. Bitcoin is not programmable like ethereum, but it’s exceptionally good at doing its job, which is value transfer in a hyper, hyper-secure way. But that’s it.”\n\nThe institutional adoption of bitcoin widens its divergence from its original conception as a decentralised, apolitical cryptocurrency first adopted in a counter-culture world, where value could be transferred free from political or commercial control, Mr Bishop added. “A lot of the decentralised maxis will be appalled by this [BlackRock’s] involvement, and we have conversations often with some early adopters, but it’s hypocritical to say this technology is the best in the world, and then to decry the involvement of these institutions. You can’t have it both ways,” he said.\n\nProfessional investors, asset managers and traders remain uncertain how to value bitcoin or predict its future direction. Some claim it is a Ponzi scheme as it has no intrinsic value, while others like Ms Wood boast their analysis shows it could reach $US1 million by 2030.\n\nMr Bishop said the correlation between bitcoin and other risk assets will be strengthened if BlackRock and other traditional finance powerhouses launch ETFs.\n\n“Bitcoin doesn’t offer an equity ownership stake and when you buy bitcoin you’re not exposing yourself to any one operating or business model, or margin stream,” he said. “That’s one potential downside [from institutional promotion] that it gets cemented into a bucket of other digital risk assets.”"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd2hvd2hhdHdoeS5vcmcvc2NpZW5jZS90ZWNobm9sb2d5L2JpdGNvaW4tbWluaW5nLWJvb20tY29udGludWVzLWluLXRleGFzLWFzLXN0YXRlLXNoYXR0ZXJzLWVuZXJneS1yZWNvcmRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Mining Boom Continues in Texas as State Shatters Energy Records - WhoWhatWhy",
        "content": "The Texas Lege’s failure to restrain incentivized energy-demanding bitcoin mining in Texas means the industry will continue to expand alongside record-setting grid strain.\n\nListen To This Story\n\nThis story by Paul Krantz was originally published by Deceleration and is part of Covering Climate Now, a global journalism collaboration strengthening coverage of the climate story.\n\n•\n\nAll is not well in rural Corsicana, Texas. The city and surrounding county have fallen into a state of disrepair, according to local resident Jackie Sawicky.\n\n“Our roads are terrible, this week we were having brownouts, and as of this minute, my water is out,” Sawicky told Deceleration. “Our infrastructure is absolutely on the brink of failure … and what are they doing? They’re going to bring in the world’s largest bitcoin mine.”\n\nA recent report from the American Society of Civil Engineers supports Sawicky’s observations, grading Texas overall with barely passing marks for the state of its roadways, wastewater systems, and levees and dams.\n\nConcerned about social and environmental impacts, Sawicky founded the Texas Coalition Against Bitcoin Mining and launched an online petition warning about noise pollution, rising water and energy costs, and more. At the time of this writing, it has garnered 1,180 signatures from residents opposing what is expected to be the state’s largest bitcoin mine to date.\n\n“We do not want the increase in environmental temperature in the immediate vicinity of the factory-that-produces-nothing,” the petition reads.\n\nFaced with escalating extreme weather due to climate change, Texas needs to upgrade infrastructure and transition away from fossil fuel use. The urgency of this need was felt keenly in 2021 when winter storm Uri cut power to millions across Texas for days on end and claimed hundreds of lives. Yet efforts intended to make the state more energy efficient withered during the last session of the Texas Legislature as lobbyists for environmental and traditional energy interests spent much of the session playing defense against bills seeking to kill renewable power and directing billions of dollars of tax revenue toward new, unnecessary gas-fueled power plants (See: “Garbage In, Garbage Out”).\n\nAs the state struggles to keep up with the energy demands driven by rapid population growth and rising temperatures, bitcoin mining continues to add further demand to the system, encouraged along by elected Republican leadership.\n\nPower Use\n\nAccording to a report by the Energy Reliability Council of Texas (ERCOT), the state’s electric grid manager, crypto mining consumed more than 3,300 Gigawatt/hours of Texas grid energy in 2022, more than double the amount used 2021.\n\nBitcoin’s total energy consumption in Texas is only increasing. Further mining projects amounting to 39 gigawatts in demand are proposed by 2027, with at least 2.5 gigawatts already approved and 6 gigawatts more that have met planning requirements.\n\nThe daily energy demand for all of Texas is currently about 80 gigawatts.\n\nIf only the bitcoin projects that have already met planning requirements are approved, mining for digital currencies could increase energy demand on the grid by 10 percent within four years.\n\nA statement released by the grid manager said, “ERCOT will not allow the interconnection of load that would be expected to result in any violation of reliability criteria.”\n\nAs opposed to other energy-intensive industries, none of these projects offer tangible value to most Texas residents.\n\nRiot Platforms (formerly Riot Blockchain), is the company planning to bring an industrial bitcoin mine to Corsicana, potentially “the first one gigawatt load ever approved by ERCOT.” Riot already operates a 450-megawatt facility near Rockdale, Texas, reportedly the largest single bitcoin mine in North America. One megawatt of electricity powers about 200 Texas homes during periods of peak demand, according to ERCOT. So Riot’s new gigawatt plant, at peak capacity, could consume as much power as 200,000 Texas homes.\n\nRiot failed to respond to requests for comment from Deceleration.\n\nTo “mine” bitcoin, computers solve complex math equations (up to trillions per second) to identify a series of numbers that validates the next block on the blockchain. A miner is rewarded for solving the block with bitcoin currency. Due to the ever-increasing difficulty of solving these equations, the amount of energy required to power the network has exploded to exorbitant levels.\n\nThe Cambridge Bitcoin Electricity Consumption Index (CBECI) monitors bitcoin’s global electricity demand. At time of writing, it estimates that the global bitcoin network is using 144 terra-watt hours (TWh) annually. To put that number in perspective, gold mining is estimated to use 131 TWh worldwide and data centers were estimated to use 200 TWh as of 2018. The CBECI’s estimates that the bitcoin network currently pollutes more than the country of Austria, about 71.5 million tons of CO2 per year.\n\nThe New York Times found that the two bitcoin mines in Rockdale consume more energy than all of the homes in a 40-mile radius.\n\nBitcoin advocates highlight projects powered by renewable energy, such as one of Marathon Digital Holding’s mines near McCamey, Texas, which draws power from a wind farm. But many mining projects draw electricity directly from the grid, a mix of power sources that averages out to include roughly 60 percent of electrons derived from combusting coal and gas; still others are directly attached to fossil fuel power plants. Before constructing the mine in McCamey, Marathon cut a deal with a coal plant that was due to close and kept it operating for months longer.\n\nBeside energy, water is also a crucial resource for crypto mining. It’s needed to cool the computers, and in a hot Texas summer that can amount to millions of gallons per day. Navarro Mills Lake, which is to be the primary source for Riot’s planned facility, was in stage one drought this January and stressed in recent years.\n\n“Last year, a record number of cattle ranchers had to sell their herds early because the drought was so bad that it was spiking the cost of hay and they couldn’t afford to feed their cattle,” Sawicky said.\n\nCorsicana residents will also be subjected to the unending drone of thousands of mining computers buzzing. The sound of one mine built in a rural town has been described as “a small jet that never leaves.”\n\n‘Freedom Money’\n\nPierre Rochard, vice president of research at Riot Platforms, told members of the Texas Senate Committee on Business and Commerce that bitcoin brings jobs to Texas, and called bitcoin “freedom money.”\n\nLee Bratcher, president of the bitcoin lobbying group Texas Blockchain Council, said in the same hearing that bitcoin miners in Texas employ around 2,000 ongoing employees, and have employed around 20,000 contractors. Out of nearly 15 million workers in Texas, those are not big numbers. Once bitcoin mining centers are built, they require a very slim workforce to maintain. Bratcher also declined to comment for this article.\n\nERCOT classifies bitcoin mines as “large flexible loads,” because they draw a lot of power and are able to power down or reduce their energy use quickly. Bigger bitcoin mines typically have a curtailment clause in their energy contracts with ERCOT, meaning they agree to power down during moments of emergency energy demand.\n\nBitcoin miners have a business incentive to power down when demand spikes and energy prices go up, but by participating in “responsive reserve service” with ERCOT, miners collect energy credits for energy they don’t use.\n\nRiot, for instance, reported $9.5 million in energy credits from the state last July for powering down during a heatwave, and a total of $27.3 million in energy credit payouts that year, according to a recent earnings report.\n\nRecently, the proposed Texas Senate Bill 1751, sponsored by state senators Kolkhorst, Campbell, and Nichols aimed to stop bitcoin miners from gaining ERCOT energy credits. The bill passed the Senate, but failed to make it to the voting floor of the House.\n\nThe bill’s sponsors said it was not a punitive measure, but meant to eliminate unnecessary incentives for a rapidly growing industry. Bitcoin miners celebrated the death of what they called the “anti-mining” bill when they learned it would not make it to the Governor’s desk.\n\nCan Bitcoin Be Tamed?\n\nThe too often ignored reality of mitigating climate change is that humankind needs to reduce energy and resource use overall. To merely swap today’s fossil power for a renewable grid would lead to further constraints and environmentally devastating impacts. The challenge is in maintaining good living standards while reducing energy demand. Doing so requires rethinking virtually every aspect of society, including “low-energy housing, widespread public transport, and diets low in animal-based foods,” one recent assessment found. It’s safe to say that bitcoin’s terawatts don’t fit within the proposed framework.\n\nEven for those who believe in the importance of alternatives to fiat currency, there are options besides bitcoin with a significantly lower energy impact. The second most popular cryptocurrency, Ethereum, cut network greenhouse gas emissions 99 percent last year by switching from a proof-of-work algorithm to proof-of-stake. Proof-of-stake is an alternative model for maintaining a cryptocurrency that doesn’t require mining.\n\nTake a bird's-eye view of our #Bitcoin mining operations in McCamey, TX. This is one of the four quadrants that make up the site. In total, there are over 60,000 miners at the site, working together to secure the Bitcoin network. pic.twitter.com/jIUZrRCbYv — Marathon Digital Holdings (NASDAQ: MARA) (@MarathonDH) April 25, 2023\n\nEnergy and water commitments now being captured by bitcoin could edge out alternative projects more capable of helping Texas navigate the energy transition, like green hydrogen fuel production, in the years ahead.\n\n“Electrolyzers … store energy in the form of hydrogen that can then be used for other applications, such as transport, industrial uses, or more simply to reuse it for power plants,” Olivier Beaufils, Market Lead for ERCOT at Aurora Energy Research, told Deceleration.\n\n“A lot of these hydrogen projects are still in early stages,” Beaufils said, noting that competition with other users hasn’t manifested yet. “Now three to five years ahead, that might be a different story.”\n\nCharlie Schumacher, Marathon’s corporate communications VP, said that bitcoin miners help rural renewables stay profitable and “soak up” electricity that may not reach users otherwise. But Adrian Shelley, Texas director of the advocacy organization Public Citizen, contends that bitcoin mining is not a viable solution to transmission issues.\n\n“You may have a glut of wind energy over here that, within a couple of years, ERCOT sees and invests in transmission that brings more of it to people where it’s needed,” Shelley said. “But if you mine bitcoin, ERCOT will never see that constraint, and is never going to make the investment.”\n\nMolly White, who has a Harvard University fellowship to research crypto and publishes a blog called Web3 is Going Just Great, cautions against taking pro-bitcoin claims at face value.\n\n“Bitcoin miners’ claims are pretty nakedly self-serving,” White told Deceleration. She added that the more computers mine bitcoin, the more difficult mining becomes, increasing power use for the network overall. “So even [miners] using so-called waste energy from renewables are still contributing to the overall energy footprint of Bitcoin … much of which is not renewable.”\n\nHow ERCOT and political leaders prioritize these projects will have a tremendous impact on the state’s energy grid.\n\nBut for now, a pro-bitcoin lobby has gained influence in Texas. Governor Gregory Abbott has previously hosted the Texas Blockchain Council at the governor’s mansion, and Senator Ted Cruz has openly supported the currency. Also, former interim president and CEO of ERCOT, Brad Jones, became the first member of Riot’s advisory board this year.\n\nTexas’s 88th legislative session confirmed that the state’s bitcoin mining industry will continue to be propped up by incentives. Three bills that passed are being celebrated by bitcoin miners, including HB 591 which will introduce tax incentives for powering crypto mining with flared gas.\n\nIn adding further tax incentives, and failing to cut existing ones, the state legislature appears to have sent a clear signal that Texas is open for bitcoin business, and the expanding peak energy demands that it entails.\n\nWhile bitcoin miners continue to profit from access to cheap energy and tax breaks, residents of communities across Texas will continue to experience increasing energy bills and the continued risk of power outages in yet another summer of record-breaking energy demands.\n\n“When I go grocery shopping, I ask people, ‘Have you heard about the bitcoin mine?’” said Jackie Sawicky. “I have talked to hundreds of people in Corsicana and Navarro County, and I can count on both hands the people who have shown positive favor.”\n\nFor the residents of Corsicana, it looks like a very noisy, thirsty, and power-hungry neighbor is coming to town."
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS92aWRlb3MvdG9pLW9yaWdpbmFsL2RpZC1yYXRhbi10YXRhLWludmVzdC1pbi1iaXRjb2luLWhlcmUtaXMtd2hhdC1oZS1oYXMtdG8tc2F5LS92aWRlb3Nob3cvMTAxMzI1MTg4LmNtc9IBkAFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS92aWRlb3MvdG9pLW9yaWdpbmFsL2RpZC1yYXRhbi10YXRhLWludmVzdC1pbi1iaXRjb2luLWhlcmUtaXMtd2hhdC1oZS1oYXMtdG8tc2F5LS9hbXBfdmlkZW9zaG93LzEwMTMyNTE4OC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Did Ratan Tata invest in Bitcoin? Here is what he has to say.... - The Times of India",
        "content": "Jun 28, 2023, 09:14AM IST\n\nSource: TOI.in\n\nRatan Tata, the Chairman Emeritus of Tata Group, has issued a significant clarification regarding his involvement in cryptocurrency investments. Through a Twitter post, Tata emphatically stated that he has no associations whatsoever with any form of cryptocurrency. He urged netizens to remain vigilant, cautioning them about false articles or advertisements that falsely link him to cryptocurrency and are intended to deceive citizens. To support his message, Tata shared an example of a misleading analysis claiming his recent investment had startled experts and major banks. Similarly, Anand Mahindra, Chairman of Mahindra Group, faced a similar situation when fake news circulated, asserting his cryptocurrency investments had left banks terrified. Mahindra promptly refuted the claims, calling them unethical, dangerous, and completely fabricated. He emphasized that he had not invested a single rupee in cryptocurrencies. These clarifications from Tata and Mahindra serve as reminders for the public to exercise caution, raising awareness about the prevalence of fake news and cryptocurrency scams."
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5hYS5jb20udHIvZW4vZWNvbm9teS9ydXNzaWFzLXN1cHJlbWUtY291cnQtcnVsZXMtY29udmVydGluZy1ydWJsZXMtZnJvbS1kcnVnLXRyYWZmaWNraW5nLXRvLWJpdGNvaW4taXMtbW9uZXktbGF1bmRlcmluZy8yOTMzMTA10gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Russia's Supreme Court rules converting rubles from drug trafficking to bitcoin is 'money laundering' - Anadolu Agency | English",
        "content": "Necessary Cookies\n\nThis cookie is used to distinguish between humans and bots. This is beneficial for the web site, in order to make valid reports on the use of their web site.\n\nFunctional Cookies\n\nRemembers the user's selected language version of a website.\n\nPerformance/Analytical Cookies\n\nRegisters a unique ID that is used to generate statistical data on how the visitor uses the website.Used by Google Analytics to throttle request rate.\n\nAccept Reject\n\nAdvertising/Marketing Cookies\n\nThis cookie is used to collect information on consumer behavior, which is sent to Alexa Analytics. (Alexa Analytics is an Amazon company.)"
    },
    {
        "id": 80,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNyeXB0b3RpbWVzLmlvLzIwMjMvMDYvMjkvbWljcm9zdHJhdGVneS1iaXRjb2luLXBvcnRmb2xpby1zdXJnZXMtdG8tNC02Yi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "MicroStrategy's Bitcoin Portfolio Surges to $4.6B - Crypto Times",
        "content": "Michael Saylor’s MicroStrategy is making its presence known in the Bitcoin universe once more. The company has recently invested a whopping $347 million in cash to acquire an additional 12,333 bitcoins between April 29 and June 27.\n\nThis latest move has catapulted its total holdings to an impressive 152,333 bitcoins, valued at a staggering $4.52 billion.\n\nMicroStrategy has acquired an additional 12,333 BTC for ~$347.0 million at an average price of $28,136 per #bitcoin. As of 6/27/23 @MicroStrategy hodls 152,333 $BTC acquired for ~$4.52 billion at an average price of $29,668 per bitcoin. $MSTR https://t.co/joHo1gEnR0 — Michael Saylor⚡️ (@saylor) June 28, 2023\n\nThis purchase showcases the firm’s unwavering confidence in the digital asset, even as Bitcoin’s price took a 1.3% tumble to $30.4K. Interestingly, on the same day as the purchase, the company reported having sold $333.7M worth of its shares, suggesting a strategic move to bolster its Bitcoin portfolio.\n\nMicroStrategy’s continual investment in Bitcoin, despite its volatility, seems to be winning over market sentiment as the company’s shares advanced by 2%.\n\nMicroStrategy’s substantial investment in Bitcoin demonstrates its unwavering faith in the digital asset and its potential for long-term growth, which is further reflected in the positive market sentiment surrounding the company."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3doaWNoLWNyeXB0by1wcm9qZWN0LXdpbGwtbWFrZS15b3UtbWlsbGlvbnMtYml0Y29pbi1wZXBlLW9yLW1pbGxpb25haXJlLWdhbWUtbWcv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 28 Jun 2023 07:00:00 GMT",
        "title": "Which Crypto Project Will Make You Millions? Bitcoin, Pepe, Or Millionaire Game (MG) - Analytics Insight",
        "content": "After a challenging first half of June, Bitcoin rebounded in July amid growing involvement from large financial institutions. After a rough start in June, Bitcoin (BTC) is on the up again, thanks to BlackRock and other large financial companies. BlackRock has applied to launch a Bitcoin (BTC) exchange-traded fund.\n\nThe latest institutional interest has caused a positive ripple effect for many cryptocurrencies like Pepe (PEPE). There are also suggestions of ‘whales’ buying significant chunks of the token, another contributor to the rally.\n\nAmong these crypto contenders, Millionaire Game (MG) emerges as a potential ‘dark horse,’ offering an opportunity for investors to turn their dreams into reality.\n\nWhat is MG’s Unique Selling Point?\n\nUnlike many meme coins focused purely on viral appeal, Millionaire Game (MG) token seriously aims to generate millionaire-level wealth for investors. The project aims to “mint” a new crypto millionaire each month\n\nOnce this happens, a random lucky draw handled by smart contracts will decide the winner. The more tokens one holds, the higher their chance of getting selected.\n\nWhen is Millionaire Game (MG) Officially Launching?\n\nMillionaire Game (MG) is currently in Stage 2 of its presale, offering tokens at a discounted price of $0.0047. The Millionaire Game team aims to hold its first official token draw once the project achieves a $40 million market capitalization.\n\nThis means that investors participating in the current presale stand to gain substantially once the presale goal is reached and MG token value increases. The presale also presents an opportunity for potential investors to get involved before MG token prices potentially surge upon launch.\n\nRelated Reading: Game for creating new millionaires?\n\nBitcoin (BTC) vs. Millionaire Game (MG)\n\nWhile Bitcoin (BTC) is the most popular coin, it’s also the most expensive. With BTC’s market cap being north of 600 billion, any 2x gain would require significant market structure adjustments.\n\nIn contrast, Millionaire Game (MG) tokens offer a much more financially accessible entry point for potential investors and higher potential returns. This lower barrier to entry, coupled with MG’s clear use case of creating a new millionaire each month, positions the project for potentially higher price appreciation.\n\nPepe (PEPE) vs Millionaire Game (MG)\n\nWhile Pepe started as a meme coin, its developers aim to introduce decentralized finance (DeFi) utilities over time. Meanwhile, Millionaire Game (MG) tokens are already integrated into DeFi applications like its staking pools that offer various rewards, including chances to win Millionaire Game’s coveted prize.\n\nHowever, Millionaire Game’s core differentiator and value proposition is its clear mission to create real-world crypto millionaires from relatively small MG token investments.\n\nMillionaireGame (MG) Presale Information\n\nWebsite: https://www.millionairegame.net/claim-discount\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmNpdHlhbS5jb20vZGl2ZXJnZW5jZS1mb3JtaW5nLWJldHdlZW4tYml0Y29pbi1hbmQtZXRoZXJldW0v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 29 Jun 2023 07:00:00 GMT",
        "title": "Divergence forming between Bitcoin and Ethereum - CityAM - City A.M.",
        "content": "Divergence forming between Bitcoin and Ethereum\n\nBitcoin continues moving to a metronomic beat as it starts the morning around $30,400, as it’s done for much of the week. Ethereum’s Ether, on the other hand, continues to retrace slightly, trading in the red by 0.56%.\n\nWhile the difference over a shorter trading period is not significant, if you zoom out a bit a divergence between the two market leaders seems to be forming. BTC is up by 0.95% while ETH is down 3.31% over seven days.\n\nYesterday’s Crypto AM Daily\n\nIn the Markets\n\nThe Bitcoin Economy\n\n*Data can be found at https://terminal.bytetree.com/\n\n🌅Total crypto market cap\n\n🔵 $1.17 trillion\n\nWhat Bitcoin did yesterday\n\n🌄 Closed $30,086\n\n🔺 Daily high $30,703\n\n🔻 Daily low $29,921\n\nBitcoin market capitalisation\n\n🟠 BTC $589.428 billion\n\n🟡 Gold $12.614 trillion\n\n💳 Visa $477.43 billion\n\nBitcoin volume\n\n🪣 Total spot trading volume $13.486 billion\n\nSP500\n\n🌅 24hrs -0.035%\n\nFear and Greed Index\n\nBitcoin’s market dominance\n\n📊 52.07\n\nRelative Strength Index (RSI)\n\n💪 66\n\nValues of 70 or above indicate that an asset is becoming overbought and may be primed for a trend reversal or experience a correction in price, while 30 or below indicates an oversold or undervalued condition.\n\nWhat they said yesterday\n\n2: You make far more money by holding through bull markets that you lose by holding through bear markets. pic.twitter.com/YkXhzhuAx9 June 28, 2023\n\nCrypto AM: Editor’s picks\n\nFCA’s new crypto advertising rules met with mixed industry response\n\nChatGPT urges crypto conference panel not to become over-reliant on AI\n\nMt. Gox customers will have to wait until November to recover lost Bitcoin funds\n\nSam Bankman-Fried: A tissue of lies soaked with fake tears?\n\nThree-in-four wealth managers are gearing up for more cryptocurrency exposure\n\nCrypto.com granted FCA licence to operate in UK\n\nQ&A with Duncan Coutts, Principal Technical Architect at IO Global\n\nJamie Bartlett – on the trail of the missing ‘Cryptoqueen’\n\nMPs are falling silent over potential of cryptocurrency\n\nErica’s ‘Crypto Wars’ handed honours in Business Book Awards\n\nCrypto AM: Features\n\nCrypto AM: Founders Series\n\nCrypto AM: Industry Voices\n\nCrypto AM: Contributors\n\nCrypto AM: In Conversation with James Bowater\n\nCrypto AM: Tomorrow’s Money with Gavin S Brown\n\nCrypto AM: Mixing in the Metaverse with Dr Chris Kacher\n\nCrypto AM: Visions of the Future, Past & Present with Alex Lightman\n\nCrypto AM: Tiptoe through the Crypto with Monty Munford\n\nCrypto AM: Taking a Byte out of Digital Assets with Jonny Fry\n\nCrypto on the catwalk\n\nCrypto AM: Events\n\nCautionary Notes\n\nIt’s definitely tempting to get swept up in the excitement, but please heed these words of caution: Do your own research, only invest what you can afford, and make good decisions. The indicators contained in this article will hopefully help in this. Remember though, the content of this article is for information purposes only and is not investment advice or any form of recommendation or invitation. City AM, Crypto AM and Luno always advise you to obtain your own independent financial advice before investing or trading in cryptocurrency."
    }
]