[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA2LzA3L2JpdGNvaW4taGFsdmluZy1pcy1jb21pbmctYW5kLW9ubHktdGhlLW1vc3QtZWZmaWNpZW50LW1pbmVycy13aWxsLXN1cnZpdmUv0gF7aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDYvMDcvYml0Y29pbi1oYWx2aW5nLWlzLWNvbWluZy1hbmQtb25seS10aGUtbW9zdC1lZmZpY2llbnQtbWluZXJzLXdpbGwtc3Vydml2ZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Halving Is Coming and Only the Most Efficient Miners Will Survive - CoinDesk",
        "content": "Bitcoin Halving Is Coming and Only the Most Efficient Miners Will Survive\n\nOnly the miners with the lowest energy costs and most efficient equipment will survive the once-every-four-years event."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9vbmUtd2lubmVyLWluLXRoZS1zZWNzLWNsYXNoLXdpdGgtY3J5cHRvLWJpdGNvaW4tMTYyNDEwMTg1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "One winner in the SEC's clash with crypto: bitcoin - Yahoo Finance",
        "content": "The Securities and Exchange Commission is suing Coinbase (COIN) and Binance because it believes many cryptocurrencies traded on those exchanges are securities that should be registered with the US regulator.\n\nThere is one big exception: bitcoin.\n\n“The SEC has been extremely clear. Bitcoin is not a security,” Steven Lubka, managing director of Swan Bitcoin, told Yahoo Finance. “We’re very, very confident that never changes.”\n\nThat belief is encouraging investors to stick with the world’s largest cryptocurrency despite the industry turmoil triggered by new SEC lawsuits against the biggest cryptocurrency exchanges in the world and the US.\n\nBitcoin (BTC-USD) was up 5% Wednesday at 9:30 am New York time to $26,759, before settling back to $26,400 by noon. Its market share, a ratio of the coin's market capitalization over the total crypto market capitalization, rose 0.85% over the same period, suggesting crypto investors are seeking it out as a safe bet within the market.\n\nBitcoin is up 58% year to date, while still down by roughly the same amount from its November 2021 peak of $68,790.\n\nSome bitcoin proponents expressed their optimism on social media, suggesting their favorite digital asset could benefit amid the legal battles.\n\nCory Klippsten, an outspoken critic of the larger crypto ecosystem and CEO of bitcoin financial services firm Swan Bitcoin, tweeted a graphic of bitcoin’s recovery this week and added a sarcastic: “Oh noes! Whatever is bitcoin going to do???!”\n\nOh noes! The sh*tcoin casinos I mean \"tool manufacturers\" are f***ed whatever is Bitcoin going to do???!\n\n\n\nTick tock, next block. pic.twitter.com/uqnBs6ePfv — Cory Klippsten 🖐️ Swan.com 🦢 #Bitcoin (@coryklippsten) June 7, 2023\n\nPierre Rochard of bitcoin miner Riot Platforms (RIOT) tweeted that Coinbase should \"pivot back to being focused on #Bitcoin.\"\n\nStory continues\n\nTwitter co-founder Jack Dorsey then attached the Rochard comment to his Twitter feed and added a hundred points emoji.\n\nCoinbase does rely on bitcoin for roughly one-third of its trading volume and transaction revenue.\n\nThe Howey test\n\nThe SEC's framework for evaluating digital assets as securities relies on the so-called Howey Test. It can be linked back to a 1946 Supreme Court case dealing with tracts of Florida orange groves sold by W.J. Howey Co. and leased back to the company.\n\nThe Supreme Court labeled these leaseback deals as investment contracts, meaning they needed to be registered with the SEC.\n\nIt also defined what constitutes a security: \"an investment of money in a common enterprise with profits to come solely from the efforts of others.\"\n\nBitcoin, its defenders say, doesn't meet that test. It wasn't created, they say, by entrepreneurs seeking profits via pre-listed private sales to larger institutional investors — as other digital coins have.\n\nIt was instead created by anonymous software developer Satoshi Nakamoto in January 2009 as an open-source concept.\n\n\"Satoshi never raised a single dollar and because he never raised a single dollar, there were no expectations of future profits in an investment contract,\" Lubka said.\n\nWhile there is no law declaring whether or not bitcoin is a security, SEC Chair Gary Gensler as well as former Chair Jay Clayton have indicated in numerous public comments they do not believe bitcoin is a security. Instead, most investors understand it to be a commodity such as gold or wheat.\n\n\"I’m extremely confident that Bitcoin is going to remain a commodity and will not be labeled a security,\" Grant McCarty, co-executive director of advocacy group Bitcoin Policy Institute, told Yahoo Finance.\n\nAbsolutely hilarious seeing all the shitcoiners and “venture capitalists” trying to crawl their way back to #Bitcoin. — Magoo PhD (@HodlMagoo) June 6, 2023\n\nThe SEC listed 19 different crypto tokens in its lawsuits against Coinbase and Binance that it considers securities, accounting for roughly 11% of crypto's total market capitalization. Those coins fell Wednesday.\n\nBNB (BNB-USD) was down 7.5%, Cardano's ADA (ADA-USD) was down 7%, Polygon's MATIC (MATIC-USD) token was down 4.8% while Solana's SOL token was down 4.2%.\n\nAfter falling 12% Tuesday, Coinbase's stock rose 2.8% at Wednesday's open.\n\nCustomers withdrew $105 million from Coinbase in the 24 hours after it was sued by the SEC, after losing $1.3 billion in the previous 24 hours, according to crypto data provider Nansen.\n\nBinance customers pulled $492 million and $1.4 billion in the two previous 24-hour periods.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3N3YW4tYml0Y29pbi1jdXN0b21lcnMtaGF2aW5nLWlzc3Vlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Swan Bitcoin Customers Struggle to Buy BTC - Blockworks",
        "content": "Swan Bitcoin appears to have been struggling as the company has moved to transfer all of its assets to two new custodians — even as its CEO harshly criticized other crypto exchanges in the wake of the SEC’s lawsuits against Binance and Coinbase this week.\n\nUsers of the bitcoin-only trading platform this week have reported significant outages that they say have prevented them from moving assets with ease. Fiat on- and off-ramp services were affected.\n\nThe company said in a statement posted on its website Wednesday that “all funds are being transferred” to its qualified custodians, Fortress Trust and BitGo Trust Company. CEO Cory Klippsten confirmed this in an email to Blockworks in which he also noted that the company was migrating from Prime Trust and Fireblocks.\n\nThe US-based company’s site also listed a number of service outages dating back to May 26.\n\nWhether the root cause of Swan’s problems — which appear to span multiple weeks — could be attributed entirely to the custodian switch was not immediately clear.\n\nThe company told customers that the transfer of their assets to Fortress and BitGo commenced on May 26, coinciding with the outages. Swan said that the company “carefully weighed the pros and cons” of moving all assets in one swoop, adding that it had reached a consensus that “moving at once will create the least amount of disruption for Swan clients.”\n\nSwan’s website on Wednesday separately said its “bitcoin purchasing” and “ACH Pull” services were both “under maintenance.”\n\n“Communication with clients has been constant and detailed,” Klippsten told Blockworks Wednesday. He added that withdrawals of BTC and USD were available throughout the custodian migration via client service channels. The ability for users to withdraw via the website or app directly resumed Tuesday.\n\n‘Degraded performance’ across business lines\n\nAt the same time, Swan’s wire transfers, as well as its custody and trading business lines, were both operating under “degraded performance.” The company on its website listed a “major platform upgrade” as being under way each day since May 30.\n\nSwan attributed its custodial switch to plans the company put in place in January. At the time, Klippsten wrote that his company had 100 full-time employees, or “Swans,” divided across five continents and cited its “rapid expansion into new products and markets.”\n\nFrom its roots at a bitcoin (BTC) exchange, Klippsten’s Swan has over the years rolled out a number of new bitcoin-only products.\n\nThose include support for both retail and institutional investors, including an advisory service designed to cater to registered investment advisers (RIAs). Swan has also played up its BTC-based retirement account services, as well as bitcoin maximalist job boards.\n\nBut Swan’s Twitter account, as well as that of Klippsten, has been active this week reacting to the SEC’s allegations against Binance and Coinbase for alleged securities violations and other charges.\n\nThe exchanges have denied wrongdoing.\n\nLoading Tweet..\n\nThe company hosted a Twitter Space about the lawsuits — which included “#Bitcoin Not Crypto” in the title.\n\nKlippsten called the SEC’s lawsuit against Coinbase an outcome that was “obvious, inevitable and entirely self-inflicted” in a Wednesday Twitter thread, calling out Coinbase CEO Brian Armstrong and Balaji Srinivasan, a former chief technology officer at the exchange.\n\nCoinbase Chief Legal Officer Paul Grewal said Tuesday that the SEC’s actions amid the lack of US crypto regulations harms companies like Coinbase “that have a demonstrated commitment to compliance.”\n\nCustodial migration “not 100% complete”\n\nSome Swan users appeared confused as to the status of their services, Swan on its website site said it had put in place a number of measures to update customers on the status of their assets.\n\nThat included a new “snapshot” feature designed to provide a placeholder update of customer balances “at the time of migration.” The custodial switch was still not “100% complete” through 5 pm ET on Wednesday.\n\nCustomers could not, however, view the balance of their dollar holdings during the move. Swan told customers that the migration ought to be complete by June 11 — it started on May 26.\n\nOn Wednesday, “self-service Bitcoin withdrawals” remained unaffected by the outages, while “instant buys,” as well as “automated savings plans” and “automated withdrawals” were not operational.\n\nKlippsten said he expected “buys” to be available on Wednesday night or Thursday, adding that new user sign ups could resume by the weekend.\n\nSwan capped off its post by saying that the company would re-open in Texas in a “plan to return by July or August.” And the firm told customers that it’s “working on bringing Swan services to New York” within three to six months.\n\n“Stay tuned for an email announcement!” Swan said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9lY29ub21pY3Mtb2YtYml0Y29pbi1hdG0tbWFya2V0LWNvdWxkLWhpbmRlci13aWRlci1hZG9wdGlvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Economics of Bitcoin ATM market could hinder wider adoption - Cointelegraph",
        "content": "As the digital asset market continues to evolve, the use of cryptocurrency ATMs grows with it. Over the past decade, nearly 40,000 cryptocurrency ATMs have popped up worldwide.\n\nBitcoin (BTC) ATM service provider, Bitcoin of America, had carved out a slice of the market but recently closed shop in the United States State of Connecticut due to a lack of proper licensing.\n\nThe Connecticut Department of Banking (DoB) issued a cease and desist order against the company, accusing it of operating unlicensed crypto ATMs in the state. But the allegations didn’t stop there; the firm was also accused of facilitating scams by allowing transactions related to fraudulent activities.\n\nIn response to the challenges, Bitcoin of America released a statement claiming it would immediately halt all of its operations in Connecticut. While the decision marked the end of the company’s presence in the state, it also underscored the regulatory hurdles faced by crypto ATM operators, particularly in the United States.\n\nThe closure also sent ripples across the crypto community, leading many industry observers to question the long-term efficacy and utility of these machines.\n\nConnecticut closure explained\n\nDue to the nascency of the cryptocurrency industry, marrying digital currencies with conventional financial structures — as in the case of crypto ATMs — requires intricate regulatory supervision. This is particularly true in Connecticut, where the DoB oversees ATMs under the Money Transmission Act.\n\nThe act requires that any service involving the transfer of money, including the conversion of traditional currency to cryptocurrency, must secure a money transmitter license.\n\nOn May 22, the Connecticut DoB claimed that Bitcoin of America had not secured the necessary license to operate Bitcoin ATMs in the state. It further stated that four Connecticut Bitcoin ATM users were scammed out of tens of thousands of dollars via Bitcoin of America’s kiosks.\n\nRecent: Grinding out a living: Can blockchain games really offer a sustainable income?\n\nThe DoB stated: “Bitcoin of America, following the consent order, compensated these consumers with a total of $86,000. After facing criminal charges, Bitcoin of America is in the process of ceasing its operations in Connecticut.”\n\nIn a separate incident in March, state officials in Ohio seized 52 Bitcoin of America ATMs, as authorities suspected scammers were using the kiosks.\n\nOperating crypto ATMs is harder than it looks\n\nJason Grewal, chief legal officer for Web3 security firm Sys Labs, told Cointelegraph that running a crypto ATM involves much more than just acquiring a license.\n\nOperators in the U.S. must adhere to Anti-Money Laundering (AML) rules set by the Financial Crimes Enforcement Network, comply with the Bank Secrecy Act’s Know Your Customer (KYC) norms, and conform to the Internal Revenue Service’s requirements for reporting crypto transactions.\n\nIn Grewal’s opinion, such complexities could play a significant role in the waning popularity of these machines. In March alone, a staggering 3,627 cryptocurrency ATMs went offline, marking the most significant monthly decrease in the history of crypto ATMs. He said:\n\n“Considering the shifting popularity of crypto ATMs, various factors seem to be at play. For one, the transaction fees imposed by these machines often exceed those on online exchanges, posing a deterrent for heavy users. Additionally, the necessity to satisfy complex regulations and licensing requirements can be challenging and potentially overshadow the perceived advantages of in-person crypto transactions.”\n\nFurther tipping the scales away from crypto ATMs are alternatives like decentralized exchanges (DEXs) and decentralized finance (DeFi) platforms.\n\nLower transaction costs, universal access, superior privacy and a broader range of supported cryptocurrencies make these projects increasingly compelling to many people. DeFi platforms also offer features such as staking, yield farming and borrowing — services typically absent from crypto ATMs.\n\nGrewal believes that moving forward, crypto ATM operators will have to innovate and change to better serve the evolving needs of their consumers.\n\nRobert Quartly-Janeiro, chief strategy officer for cryptocurrency exchange Bitrue, told Cointelegraph that four primary companies currently dominate the crypto ATM market, something which needs to change for the market to grow and adoption to increase.\n\nMoreover, he believes that the physical location of crypto ATMs is also a major factor when it comes to engaging customers. He added:\n\n“Ultimately, one of the key pillars for the mass adoption of crypto remains the ability to sell crypto for fiat currencies in-country. The landscape has changed slightly, so the need for crypto ATMs has changed economically, geographically, psychologically, as well as from an infrastructural standpoint.”\n\nThe economics of crypto ATMs\n\nMost crypto ATMs in operation today run in collaboration with established companies like ChainBytes, LibertyX, CoinMe and others, which allow independent businesses to become “operators,” “partners,” or “hosts” for these machines.\n\nThe return on investment depends on several factors, including the location of the business (e.g., commercial district, high-traffic area); the number of daily transactions; the average transaction size; the total expected revenue from transaction fees; and the marketing strategy to promote the crypto ATM in question.\n\nAccording to crypto ATM firm Chainbytes, a single Bitcoin ATM can earn up to $3,000 monthly, with gross monthly revenues of $30,000.\n\nOperating a crypto ATM presents several challenges as well. Regulatory complexities require operators to navigate often unclear laws, obtain necessary licenses, and comply with AML and KYC regulations. Security risks, both physical and digital, necessitate robust protective measures, adding to high operational costs that include machine maintenance and cash management.\n\nThe inherent volatility of cryptocurrencies can also impact profitability, with significant value fluctuations potentially leading to financial losses. Operators must also maintain sufficient cryptocurrency and cash reserves to meet customer demand, as shortages could harm their reputation and business.\n\nWho’s leading the global crypto ATM race?\n\nSince the first crypto ATM debuted in a Vancouver coffee shop in 2013, the sector has evolved dramatically. Today, there are around 35,000 machines globally, transforming how people interact with digital currencies.\n\nThe United States has the lion’s share of crypto ATMs globally. Source: Coin ATM Radar\n\nThe U.S. houses roughly 30,000 crypto ATMs, accounting for 86% of all such machines worldwide.\n\nCanada’s crypto ATM scene has also flourished over the last few years. As of Q1 2023, the country hosts 2,744 machines, while its European compatriot Spain boasts around 286 machines.\n\nDown under, Australia has also been making waves. After adding 99 ATMs in late 2022, it leapfrogged El Salvador and Poland to become the fourth-largest crypto ATM hub with around 473 kiosks.\n\nThe future of crypto ATMs\n\nDespite the many hurdles impeding the growth of the crypto ATM market, the space is expected to grow significantly in the coming years. The market — valued at $71.9 million in 2021 — is projected to rise to $5.45 billion by 2030.\n\nRecent: Tornado Cash 2.0: The race to build safe and legal coin mixers\n\nHowever, for the sector to thrive, it will be crucial for operating companies to obtain regulatory clarity. Physical and digital security measures must also be enhanced to protect the machines and the transactions they facilitate. This includes robust cybersecurity measures to prevent digital hacks and adequate physical security to deter theft attempts.\n\nFinally, efforts must be made to reduce the operational costs of running these machines. This could involve developing more cost-effective kiosks, optimizing cash management processes and exploring alternative business models. Thus, as we head into a future driven by crypto-enabled tech, it will be interesting to see how the future of the crypto ATM market continues to evolve and grow."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZmFsbC1tb3N0LXRvcC0xMC1jcnlwdG9zLXJpc2UtZm9sbG93aW5nLXNlY3MtbGF3c3VpdC1hZ2FpbnN0LWNvaW5iYXNlL9IBbWh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZXRoZXItZmFsbC1tb3N0LXRvcC0xMC1jcnlwdG9zLXJpc2UtZm9sbG93aW5nLXNlY3MtbGF3c3VpdC1hZ2FpbnN0LWNvaW5iYXNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether fall; most top 10 cryptos rise following SEC’s lawsuit against Coinbase - Forkast News",
        "content": "Bitcoin and Ether fell during Wednesday afternoon trading hours in Hong Kong, while most of the top 10 non-stablecoin cryptocurrencies by market capitalization strengthened. Most major cryptocurrencies increased in the past 24 hours, despite news of the Securities and Exchange Commission (SEC) suing Coinbase exchange a day after it initiated legal action against Binance.\n\nSee related article: Crypto industry reacts to SEC’s lawsuit against Binance\n\nTop cryptos up despite SEC’s lawsuit against Coinbase\n\nBitcoin fell 1.15% from 6:50 a.m. to 4:30 p.m. in Hong Kong to US$26,805. Ether fell 0.37% in the same timeframe, to US$1,874.\n\n“Bitcoin needs to overcome US$28,000. It has to close above US$28,000 [weekly] to be bullish,” wrote Johnny Louey, a crypto research analyst at trading platform LiquidityTech Protocol, in a Telegram message to Forkast.\n\nThe world’s first cryptocurrency increased 4.32% in the past 24-hours, despite news of the SEC suing Coinbase a day after it sued Binance. Ether strengthened 3.23%.\n\n“The SEC’s crackdown on Coinbase signals a shift towards greater regulation of the cryptocurrency industry. This move could have significant implications for the future of cryptocurrency, as it may lead to increased scrutiny and oversight of digital assets,” Kadan Stadelmann, chief technical officer of blockchain infrastructure development firm Komodo, told Forkast in a statement.\n\n“It is clear that regulatory compliance will become increasingly important for cryptocurrency businesses moving forward, as they seek to navigate an evolving landscape of laws and regulations.”\n\nDogecoin was the day’s biggest gainer, up 4.4% to US$0.06947, followed by Bitcoin. Cardano’s ADA saw the biggest loss, falling 3.29% to US$0.3411.\n\nThe total crypto market capitalization over the 24 hours rose 2.92% to US$1.12 trillion, while trading volume rose 2.75 % to US$47.27 billion.\n\nEthereum NFT sales gain as Bitcoin NFT sales lose momentum\n\nThe Forkast 500 NFT index inched down 0.16% to 3,278.43 points in the 24 hours to 4:30 p.m. in Hong Kong while falling 4.18% during the week.\n\nEthereum’s 24-hour NFT sales rose 31.32% to US$32.97 million, boosted by sales of Bored Ape Yacht Club that rose 1.35% to US$16.3 million and sales for the Mutant Ape Yacht Club that strengthened 2.62% to US$1.9 million. 24-hour sales for Art Block rose 11.6% to US$1.3 million, while Azuki sales dropped 36.99% to US$1.7 million.\n\nBitcoin’s 24-hour NFT sales declined 64.24% to US$3.4 million, as interest in Ordinals inscriptions temporarily subsided.\n\nAmong Forkast Labs NFT indexes, the Forkast POL NFT Composite was the only one in the green, rising 4.84% in the past 24 hours to 1,053.90 points.\n\nAsian equities mixed, U.S. futures fall following World Bank’s warning\n\nAsian equities were mixed during Wednesday afternoon trading, driven by a red day in U.S. stock futures. Hong Kong’s Hang Seng Index rose 0.8% and the Shanghai Composite inched up 0.076%. Japan’s Nikkei 225 lost 1.82% decrease, and the Shenzhen Component Index dipped 0.%.\n\nInvestor sentiment was dampened by weak trade data from China that showed exports tumbled and imports fell less than expected in the world’s second-largest economy.\n\nAdding to downbeat investor sentiment, the World Bank warned about the fragility of the global economy, saying that high interest rates could cause issues in lower income economies. The World Bank projected global growth to decelerate from 3.1% in 2022 to 2.1% in 2023, in its latest Global Economic Prospects report.\n\nU.S. stock futures declined as of 4:30 p.m. in Hong Kong. The Dow Jones Industrial Average futures fell 0.13%, the S&P 500 futures index inched down 0.12%, and the tech-heavy Nasdaq-100 futures weakened by 0.24%, after closing yesterday’s session at a nine-month high.\n\nMajor European bourses slipped, as investors awaited the European Central Bank’s meeting next week for a decision on interest rates. The pan-European STOXX 600 fell 0.15% and Germany’s DAX 40 declined 0.36%.\n\nSee related article: Swift, Chainlink to test blockchain token transfers with at least 12 major banks"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDYvMDcvdGVjaG5vbG9neS9jcnlwdG8tZmlybXMtc3RhcnQtbG9va2luZy1hYnJvYWQtYXMtdXMtY3JhY2tzLWRvd24uaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Crypto Firms Start Looking Abroad as U.S. Cracks Down - The New York Times",
        "content": "The wave of government enforcement against cryptocurrency companies is beginning to remake the industry.\n\nCoinbase, the largest crypto exchange in the United States, has opened a business in Bermuda. Gemini, a rival firm based in New York, is seeking a license in the United Arab Emirates. And Bittrex, an exchange in Seattle, has shut down its U.S. operations.\n\nAfter years of trying to shape federal regulation in the United States, a growing number of American crypto companies — particularly the exchanges where customers buy and sell digital tokens — are exploring plans to build their businesses abroad. They are expanding into new markets and weighing the possibility of leaving the country entirely.\n\nThe moves are a response to a growing law enforcement crackdown that has made the United States one of the strictest regulators of crypto in the world. On Tuesday, the Securities and Exchange Commission filed a long-anticipated lawsuit against Coinbase, arguing that the exchange was marketing securities without the proper registration. A day earlier, the S.E.C. sued the international crypto exchange Binance, seeking to bar its founder from the U.S. securities market."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzA3L2JpdGNvaW4tZXRoZXItdHJhZGUtYXQtcHJlbWl1bXMtb24tYmluYW5jZXVzLWFzLWludmVzdG9ycy1mbGVlLWZvbGxvd2luZy1zZWMtYWN0aW9ucy_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8wNy9iaXRjb2luLWV0aGVyLXRyYWRlLWF0LXByZW1pdW1zLW9uLWJpbmFuY2V1cy1hcy1pbnZlc3RvcnMtZmxlZS1mb2xsb3dpbmctc2VjLWFjdGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether Trade at Premiums on Binance.US as Investors Flee Following SEC Actions - CoinDesk",
        "content": "“Market makers are wary ahead of this double blow to Binance's U.S. entity, and are removing liquidity from the exchange's order books in anticipation of a possible freeze,” Medalie said in a note. “No trader wants to get caught with their assets stuck on an exchange.”"
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLXJpc2UtYW1pZC1zd29vbi0wMDU2NTYyNzYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether rise amid 'swoon-soar' trading after SEC lawsuits against Binance, Coinbase - Yahoo Finance",
        "content": "Bitcoin prices rose in Friday morning trading in Asia, but failed to break back above US$27,000 after a rollercoaster week in crypto markets following the lawsuits by U.S. securities regulators against the Binance and Coinbase exchanges. Other top 10 non-stablecoin cryptocurrencies gained, with Polygon’s Matic token leading the winners.\n\nTop 10 gain ground\n\nBitcoin strengthened 1.06% over the last 24 hours to US$26,551 at 7:00 a.m. in Hong Kong, making up some losses from earlier this week after the Securities and Exchange Commission (SEC) filed lawsuits against two of the world’s biggest exchanges, alleging dozens of of crypto tokens have been illegally offered and traded as unregistered securities. The world’s largest crypto by market capitalization is now down 1.26% for the past seven days after sharper declines earlier in the week, according to data from CoinMarketCap.\n\nEther climbed 1.1% to US$1,849, and logged a 0.98% weekly decline.\n\nPolygon’s MATIC was the biggest gainer among the top 10, with a 2.69% rise, but it has lost 12.02% in value for the past week.\n\nBinance’s BNB added 2.01% in the past 24 hours, the second-largest rise among the top 10, but is a big loser for the week, down 13.9%.\n\nThe total cryptocurrency market cap edged up 0.35% to US$1.1 trillion in the 24 hours through to 8:30 a.m. in Hong Kong, while daily trading volume dropped 35.3% to US$25.9 billion, according to CoinMarketCap data.\n\nIn a new court filing on Wednesday, the SEC said transactions involving several billions of dollars of customer funds moved through now-defunct Silvergate Bank and Signature Bank under accounts allegedly controlled by Binance officials, including chief executive Changpeng Zhao.\n\nSachin Verma, an accountant employed by the SEC, said in the filing that some of the funds were moved to accounts suspected to belong to offshore firms linked to Zhao and Binance, in various regions including the Seychelles, Lithuania and Kazakhstan.\n\nStory continues\n\nZhao tweeted on Thursday that this is “simply false” in response to a CoinDesk article that said US$12 billion of funds was sent to Zhao, citing the Wednesday filing.\n\n“To the best of my knowledge, Binance.US had in total roughly US$2 billion in user funds. This number in USD equivalent fluctuates a little as crypto prices change. And declining as users withdraw due to recent news,” Zhao tweeted. “All user funds are accounted for, and never left the Binance.US platform (unless users withdraw themselves of course), ever.”\n\nGordon Grant, co-head of trading at crypto brokerage Genesis Trading, said that this week’s sweeping regulatory pronouncements “saw crypto realized volatility begin to rear its head.”\n\n“After seeming months of coiling in an ornery, reptilian rip-rap price action, the successive Monday and Tuesday swoon-soar tandem on the back of Binance and Coinbase headlines preempted consternation, head scratching and, if nothing else, a recognition that the asset class remains habitually prone to lurid gaps in price action,” Grant said.\n\nIn an email, Le Shi, head of trading at Auros, a crypto market-making and algorithmic trading firm, said cryptocurrency trading volumes continue to “plumb the depths” last seen in the middle of the last crypto bear market.\n\nCoinShares, a European crypto investment firm, said in a Thursday report shared with Forkast that while the SEC lawsuits seem to carry more severe implications for Binance, the potential impact on Coinbase and the broader crypto industry is significant.\n\n“The charges insinuate that a majority of crypto assets should be categorized as securities, which would radically modify the regulatory landscape, potentially confining access to regulated Wall Street entities (assuming that they have the appetite once the litigation is over),” CoinShares wrote.\n\nCoinShares added that the shift could potentially place the control of the crypto industry within the grasp of traditional financial institutions.\n\nNFT sales drop\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index dipped 1.07% to 3,219.65 in the 24 hours to 9:45 a.m. in Hong Kong. The index was down 4.59% for the week.\n\nNFT sales on Ethereum fell 14.4% over the last 24 hours to US$13.72 million, and sales on the Bitcoin network dropped 9.34% to US$3.53 million, according to CryptoSlam data.\n\n“[It’s a] hard market to analyze right now,” Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News, said on Friday.\n\n“On one hand I believe we’ll see capitulation to the negative news, especially once the SEC files lawsuits against (NFT) projects, but at the same time, we are seeing bullish news from projects, art, among others, on an almost daily basis,” Petscher added. “I don’t think the SEC’s lawsuits have played a factor yet. They should soon.”\n\nUncategorized Ordinals – recently popular Bitcoin Ordinals that are not part of an established collection – saw the largest sales in the past 24 hours with a 74.13% rise to US$1.54 million.\n\nThe Captainz, an Ethereum-based collection, recorded a 2.33% increase in sales to US$1.12 million, making it the second most sold collection in the past day, followed by Mythos chain-based DMarket’s US$1.11 million daily sales.\n\nIn another development, crypto exchange Kraken has launched its NFT marketplace out of beta with over 250 collections.\n\nLuca Netz, the chief executive officer of intellectual property firm and NFT collection Pudgy Penguins, is set to launch a Web 3.0 licensing marketplace named Overpass as early as late June, according to a Thursday report by media firm NFT Now.\n\nPudgy Penguins is an Ethereum-based NFT collection of 8,888 unique digital assets. It is the 19th largest collection in all-time sales, with more than US$257 million traded, according to CryptoSlam data.\n\nU.S. stock futures fall\n\nNew York Stock Exchange. Image: Getty Images\n\nU.S. stock futures fell as of 10:10 a.m. in Hong Kong after the major U.S. stock indexes posted strong gains overnight. Dow Jones Industrial Average futures dropped 0.14%, and S&P 500 futures dipped 0.1%. Nasdaq Futures fell 0.1%.\n\nOvernight in the U.S., the Nasdaq Composite rose 1.02%, and the Dow Jones Industrial Average climbed 0.5%. The S&P 500 added 0.62%, hitting a new high for the year so far.\n\nIn macroeconomic developments, the U.S. Labor Department reported Thursday that the country’s initial jobless claims totaled 261,000 for the week ended June 3. That was the highest weekly level for such claims since October 30, 2021.\n\nThe jobless claims pointing to a slowing of the economy are another factor suggesting the U.S. Federal Reserve’s more than year-long hikes in interest rates are having an effect and may influence the Fed’s decision-making on rates at its meeting on June 14.\n\nU.S. interest rates are now between 5% and 5.25%, the highest since 2006.\n\nThe CME FedWatch Tool predicts a 74.8% chance the Fed will leave rates unchanged at next week’s meeting, and a 25.2% chance for another 25-basis-point rate hike.\n\n(Updates with equity section.)"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzA3L2ZpcnN0LW1vdmVyLWFtZXJpY2FzLWJpdGNvaW4tc2hvd3MtcmVzaWxpZW5jZS1hbWlkLXNlYy1sYXdzdWl0cy1hZ2FpbnN0LWJpbmFuY2UtY29pbmJhc2Uv0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMDcvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbi1zaG93cy1yZXNpbGllbmNlLWFtaWQtc2VjLWxhd3N1aXRzLWFnYWluc3QtYmluYW5jZS1jb2luYmFzZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Shows Resilience Amid SEC Lawsuits Against Binance, Coinbase - CoinDesk",
        "content": "In a different case involving the SEC and Coinbase, the U.S. Court of Appeals for the Third Circuit has ordered the agency to clarify its position on a rulemaking petition from the exchange. In April, Coinbase filed an Administrative Procedure Act Challenge, asking the court to force the SEC's hand and get the regulator to respond to its 2022 petition for formal rule making in the digital assets sector. With yesterday’s ruling, the SEC has been ordered to explain within 7 days if it intends to decline Coinbase’s request, the reasons for such a decision or a timeline of when it expects to come to a decision."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMDgvYml0Y29pbi10cmFkZXJzLXNocnVnLW9mZi11cy1zZWNzLWFjdGlvbi1hZ2FpbnN0LWJpbmFuY2UtYW5kLWNvaW5iYXNlL9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMDgvYml0Y29pbi10cmFkZXJzLXNocnVnLW9mZi11cy1zZWNzLWFjdGlvbi1hZ2FpbnN0LWJpbmFuY2UtYW5kLWNvaW5iYXNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Traders Shrug Off U.S. SEC's Action Against Binance, Coinbase - CoinDesk",
        "content": "\"The possible reason is that BTC and ETH have already been certified by the U.S. Commodities and Futures Trading Commission, and their derivatives have been traded on compliant exchanges such as CME for several years, while the SEC's prosecution mainly targets altcoins, and many altcoins identified as securities, the impact on BTC and ETH is relatively limited,\" he said."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDYvMDcvdGhlLXBldHJvZG9sbGFyLWFuZC1pdHMtZGlzY29udGVudHMtcG9pbnQtdG8tYml0Y29pbnMtcm9sZS1pbi10aGUtZmluYW5jaWFsLWZ1dHVyZS_SAY4BaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA2LzA3L3RoZS1wZXRyb2RvbGxhci1hbmQtaXRzLWRpc2NvbnRlbnRzLXBvaW50LXRvLWJpdGNvaW5zLXJvbGUtaW4tdGhlLWZpbmFuY2lhbC1mdXR1cmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "The Petrodollar and Its Discontents Point to Bitcoin's Role in the Financial Future - CoinDesk",
        "content": "The Petrodollar and Its Discontents Point to Bitcoin's Role in the Financial Future\n\nRecent moves by Saudi Arabia, Russia and China have raised fears that the U.S. dollar could lose its preferred status for oil trading. And yet alternative national currencies aren’t that appealing. Could a Bitcoin-like currency do better?\n\nBy David Z. Morris Jun 7, 2023 at 5:47 p.m. UTC"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzA4L2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1mYWxscy1iZWxvdy0yNjVrLWFzLWNyeXB0by1tYXJrZXQtZmFkZXMtYW1pZC1jb2luYmFzZS1iaW5hbmNlLWFuZ3N0L9IBjQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzA4L2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1mYWxscy1iZWxvdy0yNjVrLWFzLWNyeXB0by1tYXJrZXQtZmFkZXMtYW1pZC1jb2luYmFzZS1iaW5hbmNlLWFuZ3N0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Falls Below $26.5K as Crypto Market Fades Amid Coinbase, Binance Angst - CoinDesk",
        "content": "In an note, Edward Moya, senior market analyst for foreign exchange market maker Oanda, noted that Canada’s central bank was among the most proactive about monetary policy. \"They were the first to raise rates in 2022 and then put them on hold earlier this year,\" Moya wrote. \"The BOC is signaling that more rate hikes could come and that has everyone rethinking that the Fed will be done after the July hike.\""
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzA5L2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1yZW1haW5zLXJlc2lsaWVudC1uZWFyLTI2NWstZGVzcGl0ZS1vbmdvaW5nLWJpbmFuY2UtY29pbmJhc2UtZmFsbG91dC_SAY4BaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNi8wOS9maXJzdC1tb3Zlci1hc2lhLWJpdGNvaW4tcmVtYWlucy1yZXNpbGllbnQtbmVhci0yNjVrLWRlc3BpdGUtb25nb2luZy1iaW5hbmNlLWNvaW5iYXNlLWZhbGxvdXQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Remains Resilient Near $26.5K, Despite Ongoing Binance, Coinbase Fallout - CoinDesk",
        "content": "The largest cryptocurrency by market capitalization was recently trading at $26,474, roughly flat over the past 24 hours and about where it’s stood since Tuesday when the SEC filed its suit against Coinbase and asked a court to grant a temporary restraining order to freeze assets tied to Binance.US. The agency sued Binance, the world’s largest exchange by trading volume, on Monday, raising concerns that the latest regulatory crackdown would send markets plunging. BTC took an initial dive below $26,000 on Tuesday but has since held steady above the threshold with analysts suggesting that investors had already priced in the actions."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMDcvZnVuZGluZy1yYXRlcy1mb3ItYml0Y29pbi1ldGhlci1yZW1haW4tcG9zaXRpdmUtaW5kaWNhdGluZy1idWxsaXNoLXNlbnRpbWVudC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Investors remain bullish about crypto in derivatives markets, as the CoinDesk Indices Ether ETH Price Trend Indicator ... - CoinDesk",
        "content": "BTC correlations with the U.S. dollar, S&P 500, Nasdaq Composite and Copper are near zero, indicating little to no pricing relationship. BTC’s correlation with ether remains high at 0.79. Correlations range between 1 and -1, with the former indicating a direct relationship, and the latter indicating an inverse one."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA2LTA3L2JpdGNvaW4tYnRjLWJvdW5jZS1mcm9tLXNlYy1ibG93LXNpZ25hbHMtbW9yZS1nYWlucy1pZi1oaXN0b3J5LXJpZ2h00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin's Bounce From Turbulence Sparked by SEC Suits Signals More Gains if History Is Right - Bloomberg",
        "content": "A bout of Bitcoin turbulence caused by US Securities and Exchange Commission lawsuits against key crypto exchanges may be a precursor to short-term gains in the token, if history is any guide.\n\nThe largest digital asset sank more than 5% on Monday, before recovering over 5% on Tuesday, as investors digested the agency’s actions first against Binance Holdings Ltd. and then Coinbase Global Inc."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDYvMDcvYml0Y29pbi1zb21ld2hhdC10YWtlcy1iaW5hbmNlLWFjY3VzYXRpb25zLWluLXN0cmlkZS_SAWVodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzA3L2JpdGNvaW4tc29tZXdoYXQtdGFrZXMtYmluYW5jZS1hY2N1c2F0aW9ucy1pbi1zdHJpZGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin (Somewhat) Takes Binance Accusations in Stride - CoinDesk",
        "content": "On Friday, the Republican chairs of two House committees released a proposed overhaul of crypto regulation in the U.S. It was only a “discussion draft” meant to get negotiations going, and widespread support was far from guaranteed. But it was the kind of comprehensive review of crypto rules that the industry has been asking for for years. And then, days later, the U.S. Securities and Exchange Commission (SEC) went nuclear on Binance and then Coinbase , suing both of them, essentially on grounds that existing regulations are adequate and strongly suggesting these businesses simply are not allowed in the U.S. The takeaway here sure seems to be that the direction the political winds blow could determine crypto’s viability in the country."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXJhY2VzLXRvd2FyZC0yN2stYnV0LWEtc3dpZnQtcmVjb3ZlcnktaXMtbm90LWNvbmZpcm1lZC1ieS1tYXJrZXQtZGF0YdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin price races toward $27K, but a swift recovery is not confirmed by market data - Cointelegraph",
        "content": "Bitcoin might have displayed strength by quickly recovering from the $25,500 support level on June 6, but that doesn’t mean that breaking above $27,500 will be an easy task.\n\nInvestors still expect stricter regulatory scrutiny after FTX’s bankruptcy in November 2022, including the recent suits against Coinbase and Binance.\n\nA total of eight cryptocurrency-related enforcement actions have been undertaken by the United States Securities and Exchange Commission (SEC) over the past six months. Some analysts suggested the SEC is attempting to redeem itself for failing to police FTX by taking action against the two leading exchanges.\n\nAdditionally, looking at a wider angle, investors fear that a global recession is imminent, which limits the upside of risk-on assets such as stocks, cryptocurrencies and emerging markets.\n\nThe eurozone entered a recession in the first quarter of this year, according to revised estimates from the region’s statistics office, Eurostat, released June 8. Poor economic performance might limit the European Central Bank’s ability to further increase interest rates to tackle inflation.\n\nBillionaire Ray Dalio, founder of Bridgewater Associates, said the U.S. is seeing stubbornly high inflation along with elevated real interest rates. Dalio warned of an excess debt offer amid a shortage of buyers, which is especially concerning since the U.S. government is desperate to raise cash after the debt ceiling was hit.\n\nRecent macroeconomic data has been mostly negative, especially after China announced a 4.5% decline in imports year over year on June 6. Furthermore, Japan posted a 0.3% quarter-over-quarter contraction in gross domestic product on June 7.\n\nLet’s look at Bitcoin (BTC) derivatives metrics to better understand how professional traders are positioned amid the weaker global environment.\n\nBitcoin margin and futures favor bullish momentum\n\nMargin markets provide insight into how professional traders are positioned because they allow investors to borrow cryptocurrency to leverage their positions.\n\nOKX, for instance, provides a margin-lending indicator based on the stablecoin/BTC ratio. Traders can increase their exposure by borrowing stablecoins to buy Bitcoin. On the other hand, Bitcoin borrowers can only bet on the decline of a cryptocurrency’s price.\n\nOKX stablecoin/BTC margin-lending ratio. Source: OKX\n\nThe above chart shows that OKX traders’ margin-lending ratio spiked on June 5 after Bitcoin crashed by 7% to $25,500. Those traders were likely caught by surprise, as the indicator reached an impressive 62 favoring longs, which is highly unusual and unsustainable.\n\nThe OKX margin-lending ratio adjusted to 34 on June 6, as leveraged longs were forced to reduce their exposure and additional margin was likely deposited.\n\nInvestors should also analyze the Bitcoin futures long-to-short metric, as it excludes externalities that might have solely impacted the margin markets.\n\nExchanges’ top traders Bitcoin long-to-short ratio. Source: CoinGlass\n\nThere are occasional methodological discrepancies between exchanges, so readers should monitor changes instead of absolute figures.\n\nBoth OKX’s and Binance’s top traders reduced their long-to-short ratios between June 7 and June 8, indicating a lack of confidence. More precisely, the ratio for OKX top traders declined to 0.78 on June 8 after peaking at 1.08 on June 7. Meanwhile, at crypto exchange Binance, the long-to-short ratio declined to 1.29 on June 8 from 1.35 on the previous day.\n\nRelated: Bitcoin rebound falters amid SEC crackdown on exchanges, raising chance of a BTC price capitulation\n\nOverall, Bitcoin bulls seem to be in a bad place, both from the worsening regulatory crypto environment and the unfolding global economic crisis.\n\nBitcoin derivatives markets indicate a low probability of the BTC price breaking above $27,500 in the short to medium term. In other words, Bitcoin’s market structure is bearish, so a $25,500 support retest is the most probable outcome.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9lbC1zYWx2YWRvci1zLWJpdGNvaW4tbWluZXItdm9sY2Fuby1lbmVyZ3ktbGF1bmNoZXMtd2l0aC0yNTBtLWludmVzdG1lbnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "El Salvador's Bitcoin miner Volcano Energy launches with $250M investment - Cointelegraph",
        "content": "A public-private partnership in El Salvador pledging to pump $1 billion into creating a Bitcoin (BTC) mining farm has received its first $250 million. This first release of funds kickstarts a 241-megawatt (MW) power generation park in the country’s Metapán region.\n\nVolcano Energy, the company behind the site, said the funds would go toward developing the power generation park using solar and wind energy, which will eventually power the Bitcoin mining operation. Volcano Energy chairman Max Keiser took to Twitter on June 7 to announce the news.\n\n.@Volcano_Energy receives the first $250M of a $1 billion commitment that kickstarts 241 MW’s of #Bitcoin mining in El Salvador.\n\n\n\n“We Got The Power” https://t.co/j2wE6UJq0O pic.twitter.com/db3PZvFo4q — Max Keiser, sr. bitcoin advisor pres. Bukele (@maxkeiser) June 7, 2023\n\nBitcoin mining uses high-power computers hooked up to a global network, using massive amounts of electricity in the process. The energy-intensive practice has come under fire from environmentalists, who are concerned that it exacerbates forest loss and climate change.\n\nStablecoin issuer Tether is among the investors in the first funding round to develop Volcano Energy, although its investment figure is undisclosed. Tether chief technology officer Paolo Ardoino said the investment marks the stablecoin issuer’s intent to drive investment in renewable energy production and mining infrastructure.\n\nAccording to Volcano Energy, the 241-MW power generation capacity will be divided between 169 MWs of photovoltaic solar energy and 72 MWs of wind energy. According to Tether, the computing power of the park is estimated to exceed 1.3 exahashes per second. If achieved, this would position Volcano Energy’s cumulative Bitcoin mining hash rate among the top 20 pools worldwide.\n\nAccording to Volcano Energy, the park is a pioneering example of Bitcoin mining driven by renewable energy, reflecting the industry’s constant innovation and growth in a competitive landscape:\n\n“Flip the script on traditional finance. Volcano Energy is powering the Bitcoin revolution in El Salvador with renewable energy.“\n\nThe Salvadoran government will play a crucial role in the planning and execution of the initiative, securing preferred participation equivalent to 23% of revenues. The investors will own 27%, with the remaining 50% reinvested in expanding energy production capacity and advancing Bitcoin mining.\n\nRelated: ‘The Bitcoin Standard’ author becomes economic adviser to El Salvador\n\nKeiser, a Bitcoin advocate and podcaster, plays a pivotal role in El Salvador’s adoption initiatives, serving as an adviser to President Nayib Bukele and chairman at Volcano Energy.\n\nThe Central American country continues efforts to drive Bitcoin adoption after becoming the first nation to make BTC legal tender in 2021.\n\nMagazine: What it’s actually like to use Bitcoin in El Salvador"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA2LzA4L2J1bGxpc2gtb24tYml0Y29pbi10aGlzLXNreXJvY2tldGluZy1zdG9jay1pcy1hLXNjL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Bullish on Bitcoin? This Skyrocketing Stock Is a Screaming Buy - The Motley Fool",
        "content": "Bitcoin (CRYPTO: BTC) mining stocks have seen a huge rally this year, largely on the strength of Bitcoin's market-topping performance in the crypto market. Bitcoin is now up 60% year to date, and Bitcoin mining stocks are up even more. Riot Platforms (RIOT 0.95%), for example, is up about 215% for the year.\n\nThe big question for investors, of course, is whether this rally has legs. Even after Riot Platforms reported better-than-expected numbers in May, its stock price still fell by 13%. Much of that has to do with Bitcoin's recent inability to break through the $30,000 price level, which has investors concerned that the crypto's sizzling performance to start the year may be coming to an end.\n\nRiot and the price of Bitcoin\n\nLong story short, Bitcoin mining stocks tend to move up and down with Bitcoin. This makes perfect sense because the core business activity of any Bitcoin miner is, well, mining Bitcoin. The more Bitcoin a company mines, the more money it makes. And the higher the price of Bitcoin goes, the more valuable each Bitcoin it mines becomes. It's not rocket science.\n\nIf you're a long-term buy-and-hold investor, though, this well-known correlation makes investing in Bitcoin mining stocks very problematic. It means that you will be tempted to sell during low points of the Bitcoin market and buy during high points of the Bitcoin market. This is exactly the opposite of a buy-low, sell-high strategy, and highlights the perils of trying to time markets.\n\nImpact of the Bitcoin halving\n\nInvestors are keeping a close eye on the next Bitcoin halving, now scheduled for April 2024. Halvings take place only once every four years and are one of the most anticipated events in the Bitcoin community, primarily due to a past history of significant price gains that have accompanied every halving event since 2012.\n\nIn a halving, the reward for mining a new block of Bitcoin falls by half. Thus, in April 2024, the reward for mining new coins will drop from 6.25 Bitcoins to 3.125 Bitcoins. On the surface, this would seem to be a negative development for Bitcoin miners. It means they will be expending the same amount of energy but getting a smaller reward, right?\n\nHowever, if you take into account the price appreciation in Bitcoin that can occur both before and after a halving, then this effect is largely negated. There have now been three past Bitcoin halvings (in 2012, 2016, and 2020), and each one has seen monster price appreciation for Bitcoin. In 2020, for example, the price of Bitcoin exploded by 688% after the halving.\n\nAlthough there is some debate about whether this historical cycle will repeat in 2024, there are plenty of analysts and investors who think it will, so it could become a self-fulfilling prophecy. By some estimates, the price of Bitcoin could blow through its all-time high of $68,790 and move toward $100,000 -- if not higher. And that would be tremendous news for Riot. Even though the company will be earning less Bitcoin next year, each new Bitcoin might become much more valuable.\n\nIs Riot a good long-term investment?\n\nIn the short run, then, Riot would seem to be an attractive investment target. But what about in the long run? From my perspective, there are two variables to consider here.\n\nThe first variable is whether Riot Platforms can remain a best-in-class Bitcoin miner. Based on what we know about Riot's current mining capacity and willingness to take on new Bitcoin mining infrastructure, this looks very favorable. Dating back to the start of 2022, Riot has mined the second-highest number of Bitcoins in the industry. And it has done so with a lower cost basis than its rivals.\n\nThe other variable is whether Riot can diversify its core business so that it is not so cyclical. Riot is never going to be a stock you can buy and forget about until it is more diversified. There's good news on this front. In January, the company changed its name from Riot Blockchain to Riot Platforms as a way to signal to the market that the company has future plans to diversify. Some have suggested that Riot could find other uses for its high-performance computer facilities, including artificial intelligence and cybersecurity.\n\nUntil this happens, the decision of whether to invest in Riot is still just a decision of where you think the market for Bitcoin is headed. Personally, I think the market for Bitcoin is headed higher in 2023 and early 2024, primarily due to the upcoming halving event. From my perspective, that makes Riot a screaming buy for the next 12 months."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL2NvaW50ZWxlZ3JhcGguY29tL25ld3MvYml0Y29pbi1yZWJvdW5kLWZhbHRlcnMtYW1pZC1zZWMtY3JhY2tkb3duLW9uLWV4Y2hhbmdlcy1yYWlzaW5nLWNoYW5jZS1vZi1hLWJ0Yy1wcmljZS1jYXBpdHVsYXRpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin rebound falters amid SEC crackdown on exchanges, raising chance of a BTC price capitulation - Cointelegraph",
        "content": "Bitcoin’s price lost steam after a failed retest of the $27,400 resistance on June 6, signaling that investors became less confident after the recent regulatory actions by the United States Securities and Exchange Commission (SEC) against Binance and Coinbase. Both exchanges are being sued on multiple counts, including failure to register as licensed brokers and offering unregistered securities.\n\nThe SEC might have a difficult case ahead\n\nAccording to Blockchain Association CEO Kristin Smith, the SEC is trying to circumvent formal rulemaking processes and deny public engagement. Meanwhile, Insider Intelligence crypto analyst Will Paige said the SEC’s intent is to police the space through enforcement in the absence of a regulatory framework.\n\nThose criticisms explain why investors may be clinging to their hopes in the U.S. Financial Services Committee hearing scheduled for June 13.\n\nThe potential overreach of the SEC has caused ripples multiple times, including in the U.S. legislature. Sen. Bill Hagerty, for instance, stated that regulators at the SEC are “weaponizing their role” and publicly called out SEC Chairman Gary Gensler.\n\nThe @SECGov is weaponizing their role to kill an industry. Allowing a company to list publicly and then stonewalling their attempts to register is indefensible. @GaryGensler, expect to hear from Congress.https://t.co/GdprSW1Yns — Senator Bill Hagerty (@SenatorHagerty) June 6, 2023\n\nFurther supporting the thesis that the cryptocurrency space can function without crypto-banks, as the centralized exchanges are commonly known, is the sudden increase in decentralized finance volumes.\n\nThe median trading volume across the top three decentralized exchanges (DEXs) jumped 444% between June 5 and June 7. As DEX volumes surged, net outflows on Binance reached $778 million, the difference between the value of assets entering and exiting the exchange.\n\nBitcoin (BTC) has been trying to reclaim the $27,000 support, but that might be harder than expected given the upcoming $670 million weekly options expiry on June 9.\n\nBulls have been caught by surprise with the negative newsflow\n\nIt is worth noting that the actual open interest for the June 9 expiry will be lower since bulls concentrated their wagers above $27,000. These traders got excessively optimistic after Bitcoin’s price gained 9% between May 25 and May 29, testing the $28,000 resistance.\n\nBitcoin options aggregate open interest for June 9. Source: CoinGlass\n\nThe 0.63 put-to-call ratio reflects the imbalance between the $410 million in call (buy) open interest and the $260 million in put (sell) options. However, if Bitcoin’s price remains near $26,500 at 8:00 am UTC on June 9, only $38 million worth of these call (buy) options will be available. This difference happens because the right to buy Bitcoin at $27,000 or $28,000 is useless if BTC trades below that level on expiry.\n\nRelated: US District Court issues summons for Binance CEO Changpeng Zhao over SEC action\n\nBitcoin bears aim for sub-$26,000 to increase their payout\n\nBelow are the four most likely scenarios based on the current price action. The number of options contracts available on June 9 for call (bull) and put (bear) instruments varies depending on the expiry price.\n\nThe imbalance favoring each side constitutes the theoretical profit:\n\nBetween $25,000 and $26,000: 100 calls vs. 5,100 puts. Bears in total control, profiting $125 million.\n\n100 calls vs. 5,100 puts. Bears in total control, profiting $125 million. Between $26,000 and $27,000: 1,500 calls vs. 3,900 puts. The net result favors the put (sell) instruments by $65 million.\n\n1,500 calls vs. 3,900 puts. The net result favors the put (sell) instruments by $65 million. Between $27,000 and $28,000: 4,200 calls vs. 1,300 puts. The net result favors the call (bull) instruments by $80 million.\n\n4,200 calls vs. 1,300 puts. The net result favors the call (bull) instruments by $80 million. Between $28,000 and $29,000: 8,700 calls vs. 700 puts. The net result favors call (bull) instruments by $225 million.\n\nThis crude estimate considers the put options used in bearish bets and the call options exclusively in neutral-to-bullish trades. This oversimplification disregards more complex investment strategies.\n\nGiven that Bitcoin longs using futures contracts were liquidated to the tune of $100 million on June 5, bulls might have less margin required to try pumping the BTC price above the $27,000 mark. Consequently, bears seem closer to scoring a decent profit on Friday’s options expiry.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91cy1iaXRjb2luLXN1cHBseS1mZWxsLW92ZXItMTAtaW4tdGhlLXBhc3QteWVhci1nbGFzc25vZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "US Bitcoin supply fell over 10% in the past year — Glassnode - Cointelegraph",
        "content": "Bitcoin (BTC) abandoned the United States during the 2022 bear market, new research suggests.\n\nIn a tweet on June 8, on-chain analytics firm Glassnode revealed some surprising conclusions about who is now using Bitcoin.\n\nBTC supply moves to Asia\n\nThe past year has seen some seismic shifts in where Bitcoin is held and traded.\n\nIn its latest analysis of the BTC supply, Glassnode measured its migration around the world — notably, away from the U.S. and toward Asia.\n\nSince mid-2022, the amount of the supply held and traded by U.S. entities has decreased by more than 10%.\n\nAt the same time, Europe’s share has stayed roughly equal, translating to a redistribution from west to east.\n\n“A clear divergence is visible in the year-over-year BTC supply change based on geographical regions. The extreme dominance of US entities in 2020-21 has clearly reversed, with US supply dominance falling by 11% since mid-2022,” Glassnode researchers commented.\n\n“European markets have been fairly neutral over the last year, whilst a significant increase in supply dominance is visible across Asian trading hours.”\n\nBitcoin regional Year-over-Year Supply Change annotated chart. Source: Glassnode/Twitter\n\nThe metric used to measure the phenomenon, Year-over-Year Supply Change, is a probabilistic tool that makes assumptions over BTC supply ownership based on the time at which it moves.\n\n“Geolocation of Bitcoin supply is performed probabilistically at the entity level. The timestamps of all transactions created by an entity are correlated with the working hours of different geographical regions to determine the probabilities for each entity being located in the US, Europe, or Asia,” Glassnode explains in its guidance notes.\n\nTheYear-over-year Supply Change shows the U.S. share beginning to decline in March 2021 but accelerating beginning in May this year.\n\nBitcoin U.S. Year-over-Year Supply Change chart. Source: Glassnode\n\nCoinbase CEO says U.S. must “seize” crypto opportunities\n\nThe findings come as the geopolitical landscape around crypto sees major upheaval of its own.\n\nRelated: SEC is killing innovation in the United States — 1inch co-founder\n\nHong Kong began allowing exchanges to offer trading this month, while in the West, U.S. legal proceedings against major exchanges marked something of a watershed moment for the industry.\n\nThe SEC suing an exchange is the new China bans #Bitcoin. — Samson Mow (@Excellion) June 5, 2023\n\nIn an opinion piece for MarketWatch, Brian Armstrong, CEO of Coinbase — one of the targets of the legal action — warned that poor regulation would disadvantage the United States.\n\n“Smart—and bespoke—regulation in the 1990s and early 2000s enabled the U.S. to define the Internet Age,” he wrote.\n\n“Just like then, now is the time for Congress to seize the historic opportunity presented by crypto, and pass comprehensive legislation that safeguards consumers and fosters innovation.”\n\nOn the topic of Hong Kong, Armstrong added that China pushing the crypto narrative was “no surprise.”\n\nMagazine: Bitcoin is on a collision course with ‘Net Zero’ promises\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWV2YW5nZWxpc3Qtam9lLWhhbGwtdGVsbHMtdGhlLWFnZW5kYS13aHktaGUtdGhpbmtzLWJ0Yy13aWxsLWNvbnF1ZXItdGhlLXdvcmxk0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin evangelist Joe Hall on why BTC will conquer the world: The Agenda podcast - Cointelegraph",
        "content": "“Bitcoin has such a marketing problem.”\n\nAt least, that’s what came to mind for Bitcoin (BTC) advocate and Cointelegraph reporter Joe Hall when he was asked about the weaknesses and strengths of the popular cryptocurrency.\n\nWhile not labeling himself a “Bitcoin maximalist,” Hall believes that most people — including crypto OGs — are shockingly unaware of what Bitcoin can do; and for this reason, he questions the necessity and future of most altcoin projects.\n\n“They’re doing it with imperfect solutions that in the long term will rug-pull them or close enough to that. Because, let’s be honest, all of these crypto projects eventually collapse into Bitcoin, or they eventually collapse full stop. I mean, we saw enough of that last year. And, you know, in 10, 15, 20, maybe 40 years’ time, will Bitcoin still be running? 1,000%. Will Ethereum still be running? Question marks. And will the other 20-ish thousand crypto projects still be going strong? I’m pretty confident they won’t be.”\n\nHall proved his point by asking co-hosts Jonathan DeYoung and Ray Salmond to open up their Bitcoin Lightning wallets to accept the equivalent of $5 in satoshis. And after DeYoung downloaded the wallet and received the payment, both co-hosts were astonished at the speed of the transaction.\n\nOn Episode 13 of The Agenda podcast, Salmond and DeYoung spoke with Hall about his views on Bitcoin adoption and its “marketing problem,” his ultimate vision of how Bitcoin could eventually conquer the financial world, and how his experience as a Bitcoin evangelist has connected him with people all around the world.\n\nIt’s more than just money\n\nHall believes that Bitcoin is more than just money: It’s a revolution, a lifestyle, a binder of people and a builder of community.\n\nHall said:\n\n“Bitcoin, to me, in my own words: It’s an expression of how we approach the world, I guess. I mean, it’s had an impact on me, in terms of my approach to people, to different cultures and in the way in which I interact with people — despite the fact that it is just a bunch of code on a screen. And because it’s rewired the way in which I look at the world and consider things, it’s taught me to be more skeptical and to not take things at face value. But it’s also delivered a lot of hope and a lot of sort of meaning to my existence that perhaps wasn’t there previously.”\n\nHall has elected to only live off Bitcoin for day-to-day expenses, excluding when he has to pay European Union taxes. As to why he is such a strong believer in the digital currency, Hall shared, “We can’t live in a world that is governed by growth at all costs when we have one finite, very precious planet.”\n\n“Bitcoin, for me, it appeals to me because of the way that it flips that all on its head. You know, we have a deflationary currency, there’s only going to be 21 million, and we can rebuild our economic system off that in a way that raises all boats, not just the elite few. And it tackles things like the wealth gap and wealth inequality. It tackles things like the environment and the way in which, you know, Bitcoin mining could be this transition to using more and more renewable energies.”\n\nTo hear more from Hall’s conversation with The Agenda — including Hall’s future vision for Bitcoin and his fascination with the Lightning Network — listen to the full episode on Cointelegraph’s Podcasts page, Apple Podcasts or Spotify. And don’t forget to check out Cointelegraph’s full lineup of other shows!\n\nMagazine: Building community resilience to crises through mutual aid and Web3\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXBheW1lbnRzLWV4ZWMtcGhpbGlwcGluZXMtYWRvcHRpb24taW50ZXJ2aWV30gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin payments exec shares adoption challenges in the Philippines - Cointelegraph",
        "content": "As many developments within the space show how far the Bitcoin (BTC) community has come, an executive from a BTC payments provider shared how in other parts of the world, adoption may still be in its early stages.\n\nAt the BTC Prague event, Cointelegraph reporter Joseph Hall interviewed Ethan Rose, founder of Pouch — a wallet service that supports the Bitcoin Lightning Network in the Philippines. The duo spoke about the state of adoption in the country and how the Pouch team is trying to introduce Bitcoin to merchants on the island of Boracay, a popular tourist hotspot in the country.\n\nAccording to Rose, their team has already managed to onboard around 250 businesses within the island and 400 businesses in the country. Their team is working to promote Bitcoin adoption in the country by offering merchants another way to attract customers.\n\n“They’re not really hard sold on Bitcoin. They’re not like they haven’t decided to spend the rest of their life stacking SATs. Right? So, our pitch is more like a way to just attract new customers to your business over the long term,” Rose said.\n\nCointelegraph reporter Joseph Hall with Pouch founder Ethan Rose at BTC Prague. Source: Cointelegraph\n\nApart from this, the executive also shared that there are still some difficulties in introducing Bitcoin to people. He explained:\n\n“It’s hard to orange-pill. If you can just like walk up to somebody and convince them to like that Bitcoin is the best money and they just decide on the fly to switch their mental model of what money is, like right there. I would say that’s a pretty gullible person.”\n\nIn addition to the challenge of introducing Bitcoin to people, the executive also shared that, as more businesses start to accept Bitcoin, there are also risks of them not getting any sales from it.\n\nLocal eatery in the Philippines accepting Bitcoin. Source: Pouch\n\n“We need more spenders,” he explained. The executive said there’s a risk that businesses would not have a good experience because spenders could get diluted if many stores accept Bitcoin in a single area.\n\nRelated: The Philippines delays publishing crypto framework\n\nIn addition, Rose reiterated that it’s crucial for businesses to have a good experience when they accept Bitcoin. The executive explained that merchants could potentially end up just abandoning the endeavor if it doesn’t bear any fruits. “If nobody shows up after a couple of months, they just like, uninstall their wallet,” he added.\n\nMagazine: Tornado Cash 2.0: The race to build safe and legal coin mixers"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvbGF5YWgtaGVpbHBlcm4tYml0Y29pbi1ob25lc3R5LWJ1bGxzaGl0LWNoaW5lc2Utc3RhdGUtbWVkaWEtam91cm5hbGlzdC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Heilpern loves Bitcoin, hates bullshit… was a China state media journo: Hall of Flame - Cointelegraph",
        "content": "Author of Undressing Bitcoin: A Revealing Guide to the World’s Most Revolutionary Asset and host of The Layah Heilpern Show.\n\nAuthor, podcaster and crypto influencer Layah Heilpern’s unapologetic and sometimes controversial tweets have amassed her an impressive 606,900 Twitter followers.\n\nShe tells Hall of Flame she fearlessly “speaks the truth about things” and admires others who do likewise.\n\nUnlike many influencers represented by fancy talent agencies, Heilpern decided to keep it all in the family by hiring her brother Gideon as her manager.\n\n“There’s no one I trust more in this world than my brother. I can rely on him 100%,” Heilpern says.\n\nHeilpern says she has “great parents” and isn’t shy about letting the world know her mother is more attractive than Madonna. (Although that’s no longer as impressive as it once was.)\n\nBefore achieving fame in the world of crypto, she had an interesting stint working as a journalist for Chinese state media, when she briefly became a business and finance correspondent for a China Central Television offshoot in 2019.\n\n\n\n“I used to work with China’s Global TV network, so I actually used to be a journalist for the Chinese government,” she reveals, adding that working there took micromanagement on an entirely new level:\n\n“I did one report on Huawei technology. I had all the Chinese people around me checking what I was saying and what I wasn’t saying. So, we’re instructed to make it a fluff piece rather than an actual good report.”\n\nHowever, she threw her career in state-sponsored journalism out the window when she fell down the crypto rabbit hole.\n\nHeilpern became obsessed with the subject and even published a book called Undressing Bitcoin: A Revealing Guide to the World’s Most Revolutionary Asset in 2021 despite admitting she “was always terrible at English in school.”\n\nAs for her career highlight so far? She says nothing has topped interviewing the big wig of the world’s largest crypto exchange. [Hall of Flame interviewed Heilpern prior to the SEC’s recent slew of allegations about CZ and Binance.]\n\n“[A career highlight for me is] interviewing CZ at the Binance blockchain event in Dubai where I was the host and MC for the whole conference. CZ is one of the most powerful people in crypto and one of the greatest innovators. Interviewing him on stage was incredible.”\n\nIt seems that Heilpern made a positive impression on CZ, too, as they often can be seen engaging in banter on Twitter.\n\nWhat led to Layah Heilpern’s Twitter fame?\n\nHeilpern has been on Twitter for over a decade and explains there is no shortcut to growing a fanbase — other than actually putting in the work.\n\n“When you tweet every day, you tend to build a following. I think it’s also because I speak the truth about certain things. I think people are thirsty for the truth… whatever the truth might be.”\n\nShe explains that the more followers you have, the easier it is to build more followers “because you have credibility.”\n\n“I can gain 50,000 followers in one month, whereas that could take somebody like two years to do. So, it sort of becomes quite rapid growth eventually,” she says.\n\nBut the fame side of things doesn’t really excite Heilpern.\n\nWhat can you expect on Heilpern’s Twitter account?\n\nHeilpern doesn’t want to sugar-coat it: Her content is not for everyone.\n\n“It’s very much freedom orientated. It’s very much anti-system, Bitcoin-focused, uplifting, and positive, personal responsibility,” she explains.\n\nShe doesn’t feel the need to appeal to everyone either.\n\n“I speak very unapologetically; I think there is just a gap in the market for that. So, people just run to you,” she says.\n\nHeilpern says that, as her audience grows, she does have to be more cautious about the impact of her words and to be more mindful of her safety.\n\n“My words have more weight, so I can’t make as many jokes anymore. But I still try not to censor myself too much. I also have to be careful about sharing personal information, which I will be doing less of.”\n\nThat being said, Heilpern has no problem taking shots at multibillion-dollar corporations.\n\nWhat Heilpern enjoys on Twitter\n\nHeilpern enjoys like-minded people on Twitter who “speak the truth about things” whether that is in crypto or politics — she just craves honesty and hates bullshit.\n\n“I like people who call out the bullshit that we see in the system. I don’t like people who pander to their audience. I like people who are unapologetic and say things how they are.”\n\nLayah Heilpern’s price predictions\n\nHeilpern’s Bitcoin price prediction for the remainder of 2023 isn’t exactly going to have you jumping out of your seat.\n\n“Over the next six months towards the end of 2023, I would say we’re just going to continue to move sideways. I don’t think we’re going to go any higher than $34,000–$35,000,” she says.\n\nHowever, she is optimistic about Bitcoin over what the next 12–24 months can bring.\n\n“I mean, maybe at the end of 2024, we could potentially reach all-time highs, again around $69,000, but that is not financial advice,” she says.\n\nHeilpern says Bitcoin could hit $100,000 in “early 2025.”\n\nWhile Heilpern can’t remember if it was Bitcoin or XRP that she bought first, she does admit that she “sold the XRP immediately.”\n\n“I don’t really have any predictions for the other [cryptocurrencies]. I just think they’re all very unpredictable shitcoins,” she states.\n\nAs for Ethereum, Heilpern doesn’t see the price dropping anytime soon but has no interest in it.\n\n“The price of Ethereum will continue to rise in my opinion, given how much is being built on it. However, I don’t like Ethereum, as I think it’s controlled by the elites and not decentralized.”"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzA3L2JpdGNvaW4tZG9nZWNvaW4tbGVhZC1ib3VuY2UtaW4tY3J5cHRvLW1ham9ycy1kYXktYWZ0ZXItcmVjb3JkLTgtbW9udGgtbGlxdWlkYXRpb25zL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA2LzA3L2JpdGNvaW4tZG9nZWNvaW4tbGVhZC1ib3VuY2UtaW4tY3J5cHRvLW1ham9ycy1kYXktYWZ0ZXItcmVjb3JkLTgtbW9udGgtbGlxdWlkYXRpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin, Dogecoin Lead Bounce in Crypto Majors Day After Record 8-Month Liquidations - CoinDesk",
        "content": "“We’ve seen somewhat of a bloodbath for altcoins. Most likely this is due to the fact the SEC’s lawsuits name a basket of altcoins as securities, while not categorizing bitcoin and ether in the same class,” said Jeff Mei, COO of crypto exchange BTSE, in an emailed statement. “And in general crypto traders seem to be fleeing to the relative safety of the top cryptos by market cap.”"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiI2h0dHBzOi8vbWlsa3JvYWQuY29tL2FjY2VwdC1jcnlwdG8v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "14 Companies That Accept Bitcoin & Crypto 2024 - Milk Road",
        "content": "Key Takeaways\n\nMajor retailers now accept some cryptocurrencies as payment.\n\nYou can use a Visa or Mastercard crypto debit card to spend your crypto at any retailer, even if they don’t usually accept crypto.\n\nSpending your crypto has risks, which we’ll cover in the article below.\n\nRetailers and corporations are quickly adopting cryptocurrencies as a form of payment for their goods and services. According to a 2022 survey conducted by Deloitte, 75% of retailers have plans to start accepting cryptocurrencies over the next two years.\n\nHere’s a list of major companies that accept crypto directly or through partnerships with third-party services.\n\n14 Companies That Accept Crypto Directly\n\nDozens of major companies allow you to buy goods and services and pay your bills using crypto. You can also use the SPEDN app to pay with crypto at many retailers that don’t otherwise accept crypto payments.\n\nCompanies accept crypto in several different ways:\n\nDirectly.\n\nThrough a third-party app, such as SPEDN.\n\nVia a Visa or Mastercard crypto card.\n\nThe table below features companies that accept crypto directly.\n\nUse Crypto For Cryptocurrencies Supported Accepted Crypto Since AMC Movie tickets Bitcoin, Bitcoin Cash, Ethereum, Litecoin 2021 AT&T Online bills Bitcoin, Ethereum, Dogecoin + more 2019 CheapAir Flight tickets and hotels Bitcoin, Ethereum, Dogecoin + more 2013 Dish Online bills Pay-per-view Bitcoin, Bitcoin Cash 2014 ExpressVPN Pay your ExpressVPN subscription Bitcoin, Ethereum, XRP, USDC, BUSD, PAX, GUSD 2014 Microsoft Digital products from the Microsoft Store Bitcoin, Ethereum, Dogecoin + more 2014 Newegg.com Purchases made on Newegg.com Bitcoin, Ethereum, Dogecoin + more 2014 Overstock.com Goods purchased on Overtock.com Bitcoin, Ethereum, Litecoin, Ripple 2014 PayPal Pay with crypto at any merchant that enables crypto checkout through PayPal Bitcoin, Litecoin, Bitcoin Cash, Ethereum 2014 Rakuten Pay with crypto at Rakuten services like Rakuten Travel and Rakuten Mobile and load your Rakuten wallet for use at participating retailers Bitcoin, Ethereum, Bitcoin Cash 2019 Starbucks Coffee and anything else in the store Bitcoin, Ethereum 2021 Tesla Select items from the Tesla online shop Dogecoin 2021 Time Magazine Time Magazine subscription Bitcoin 2021 Twitch Buy Twitch “bits” Bitcoin, Ethereum, Dogecoin + more 2014\n\n1. AMC\n\nAs of November 2021, AMC movie theaters have been accepting crypto payments for movie tickets. When buying tickets online, customers can select to pay with cryptocurrencies such as Bitcoin, Bitcoin Cash, Ethereum, and Litecoin. AMC CEO Adam Aron announced in a tweet that AMC would support “Dogecoin next.”\n\nBig newsflash! As promised, many new ways NOW to pay online at AMC. We proudly now accept: drumroll, please… Bitcoin, Ethereum, Bitcoin Cash, Litecoin. Also Apple Pay, Google Pay, PayPal. Incredibly, they already account for 14% of our total online transactions! Dogecoin next. pic.twitter.com/a7pqYBm7HB — Adam Aron (@CEOAdam) November 12, 2021\n\n2. AT&T\n\nIn 2019, AT&T became the first major American telecommunications company to accept cryptocurrency payments. AT&T customers can now pay their bills online using Bitcoin, Ethereum, Dogecoin, and a number of other cryptocurrencies. Like many other merchants, AT&T uses BitPay (a Bitcoin payment service provider) to facilitate their crypto payments.\n\n3. CheapAir\n\nThe budget travel agency, CheapAir has been an early adopter of cryptocurrencies, accepting Bitcoin as far back as 2013. You can use cryptocurrencies like Bitcoin, Ethereum, and Dogecoin and stablecoins like USDC, DAI, and GUSD to purchase flight tickets. Hotels can also be booked with Bitcoin.\n\n4. Dish\n\nYou can pay your cable and internet bill with crypto at Dish Network. The TV and internet provider supports Bitcoin and Bitcoin Cash payments for monthly cable services, internet services, and pay-per-view movies and events.\n\n5. ExpressVPN\n\nExpressVPN is a provider of “virtual private network” services that allow users to mask their IP address when online. VPN services are popular among the privacy-conscious crowd, so it’s no surprise that ExpressVPN has been accepting crypto since 2014. You can pay with crypto directly on their website, and they support cryptocurrencies such as Bitcoin, Ethereum, XRP, USDC, BUSD, PAX, and GUSD.\n\n6. Microsoft\n\nMicrosoft accepts crypto payments on products purchased through its Microsoft Store. This can include games for Xbox, music, desktop applications, and much more. Microsoft has partnered with BitPay and accepts cryptocurrencies such as Bitcoin, Ethereum, Dogecoin, GUSD, and more.\n\n7. Newegg.com\n\nNewegg is a popular store that sells electronics and computer parts. Its appeal to computer enthusiasts has made it crypto-friendly. The website supports crypto payments for all products through its partnership with BitPay. Newegg allows you to make purchases using Bitcoin, Ethereum, Bitcoin Cash, Dogecoin, and more.\n\n8. Overstock.com\n\nThe furniture and home decor website has become an unlikely champion of cryptocurrencies. They first started accepting crypto for website purchases back in 2014. In 2017 they doubled down on their crypto commitment through a partnership with ShapeShift (a crypto exchange.) Customers can select crypto as a payment method during checkout and pay in Bitcoin, Ethereum, Litecoin, Ripple, and more.\n\nOverstock CEO and founder Patrick M. Byrne commented on the company’s pro-crypto position by saying, “Overstock is pro-freedom, including the freedom of individuals to communicate information about value and scarcity without relying on a medium created through the fiat of unaccountable government mandarins.”\n\n9. PayPal\n\nOnline payment software PayPal has been wading into the crypto world for the last few years. PayPal facilitates the buying and selling of crypto directly. The app also allows customers to pay with crypto at checkout on merchant websites that accept PayPal. The cryptocurrencies supported on the platform are Bitcoin, Litecoin, Bitcoin Cash, and Ethereum.\n\n10. Rakuten\n\nThe Japanese e-commerce company, Rakuten, has accepted cryptocurrency payments since 2019. Rakuten accepts Bitcoin, Bitcoin Cash, and Ethereum for its online brands and for payments made at retailers through Rakuten Pay.\n\n11. Starbucks\n\nThe coffee giant started accepting crypto as payment in 2021. Customers can use Bitcoin and Ethereum to load their Starbucks digital cards with cash to spend at the coffee shop. In 2022, Starbucks took another step into the crypto world when they opened up their “Odyssey” NFT loyalty program to select customers.\n\n12. Tesla\n\nTesla’s infamous co-founder and CEO, Elon Musk, is a cryptocurrency aficionado. In 2021, Tesla began accepting Bitcoin as payment for cars but halted the program shortly after. Now, Tesla accepts Dogecoin — it’s not for car purchases but rather for select items in their online shop.\n\n13. Time Magazine\n\nThe long-running Time Magazine publication is stepping into the 21st century by accepting crypto payments for its magazine subscriptions. To facilitate payments, Time has partnered with the Crypto.com exchange. Users of the Crypto.com Pay service can use their crypto to make payments on Time Magazine’s website.\n\n14. Twitch\n\nThe Amazon-owned online streaming service, Twitch, has been ahead of the curve when it comes to crypto adoption. They first started accepting crypto back in 2014. Despite briefly suspending crypto payments in 2019, they currently support over a dozen cryptocurrencies, including Bitcoin, Ethereum, and Dogecoin. To pay for Twitch services using crypto, you will need to sign up for a BitPay account.\n\nCompanies That Accept Crypto Through SPEDN\n\nSPEDN is an app from the crypto payments service Flexa. The app allows you to spend crypto at a variety of merchants who normally do not take crypto payments. Flexa has partnered with crypto exchange Gemini to facilitate crypto payments in 99 different cryptocurrencies across 40,000 merchant locations.\n\nWhen you pay with SPEDN, the service converts cryptocurrency to dollars in real-time. The store does not see that you are using cryptocurrency to pay for the transaction.\n\nThis makes SPEDN a perfect option for those looking to use crypto discreetly. To get started, download the SPEDN app from Flexa and sign up for an account. Once you add funds to your account, you can use the phone app to display a scannable QR code for payment.\n\nRetail Stores\n\nBarnes & Noble\n\nGameStop\n\nLowe’s\n\nOffice Depot\n\nPetco\n\nUlta Beauty\n\nFast Food & Restaurants\n\nBaskin Robbins\n\nCaribou Coffee\n\nChipotle\n\nJamba Juice\n\nGrocery Stores\n\nWhole Foods Market\n\nEntertainment Companies\n\nRegal Cinemas\n\nCryptocurrencies Supported By SPEDN:\n\nBitcoin\n\nEthereum\n\nUSDC\n\nGUSD\n\nDAI\n\n+ more (full list here)\n\nHow To Pay With Crypto Anywhere\n\nCrypto debit cards from companies like Coinbase, Crypto.com, Binance, and many more are accepted anywhere Visa and Mastercard are accepted. You can also use your crypto to buy gift cards and spend them at any retailer.\n\nMerchants can choose to either accept crypto directly or to work with a third party to convert crypto payments into fiat cash (such as US dollars) before processing the purchase.\n\nThe companies we list above all accept crypto natively or through an application like SPEDN. There are ways to pay with crypto at even more merchants. However, by using a third-party service that converts your crypto to fiat to complete the transaction.\n\nCrypto cards that convert cryptocurrencies into fiat in order to complete a purchase may incur a taxable event. Since you are technically selling your crypto and buying fiat, you could be subject to capital gains tax if your crypto has appreciated since you initially purchased it. Converting stablecoins such as USDC or USDT into fiat does not incur this tax liability because these stablecoins are equal to a dollar in value.\n\nCrypto Debit Cards\n\nVisa and Mastercard, the two largest payment processors, have partnered with several of the most popular crypto companies to provide crypto debit cards. These cards are accepted anywhere that regular Visa and Mastercard cards are accepted — meaning you can use your crypto debit card just like a traditional debit card.\n\nCard Provider Card Type Rewards Rate Best For Coinbase Card Visa Debit Up to 4% cashback Low fees Crypto.com Card Visa Debit 1% to 5% cashback in CRO token CRO holders Binance Card Visa Debit Up to 8% cashback in BNB token EU residents BitPay Card Mastercard Debit Varies by merchant Frequent shoppers Gemini Card Mastercard Credit 3% back on dining, 2% back on groceries, 1% back on everything else Traditional Crypto Credit Cards Nexo Card Mastercard Credit Up to 2% cashback in NEXO token Collateralized-Loan Crypto Credit Cards\n\nVisa Crypto Cards\n\nCoinbase Visa Card: The Visa card from Coinbase lets you spend your Coinbase crypto balance anywhere Visa is accepted. There are no payment fees or annual fees, and you can even earn cashback rewards.\n\nThe Visa card from Coinbase lets you spend your Coinbase crypto balance anywhere Visa is accepted. There are no payment fees or annual fees, and you can even earn cashback rewards. Crypto.com Visa Card : The Crypto.com card allows you to spend your Crypto.com crypto balance and earn rewards in the process. There are five different card tiers, each with different benefits, including cashback rewards, free ATM withdrawals, and free streaming service subscriptions.\n\n: The Crypto.com card allows you to spend your Crypto.com crypto balance and earn rewards in the process. There are five different card tiers, each with different benefits, including cashback rewards, free ATM withdrawals, and free streaming service subscriptions. Binance Visa Card: The Binance Visa card nets you up to 8% cashback in BNB tokens every time you spend. Enjoy free ATM withdrawals and no foreign exchange fees or annual fees. The Binance card is currently available for most European countries, Argentina, Bahrain, Brazil, Colombia, Saudi Arabia, Oman, Kuwait, the UAE, and Peru.\n\nMastercard Crypto Cards\n\nBitPay Mastercard: BitPay is one of the largest crypto payment processing companies. They’ve teamed up with Mastercard to bring you the BitPay crypto Mastercard which allows you to spend your balance anywhere Mastercard is accepted and earn rewards as you spend.\n\nBitPay is one of the largest crypto payment processing companies. They’ve teamed up with Mastercard to bring you the BitPay crypto Mastercard which allows you to spend your balance anywhere Mastercard is accepted and earn rewards as you spend. Gemini Mastercard: Unlike the other cards on this list so far, the Gemini Mastercard is a credit card. Spend anywhere that Mastercard is accepted and pay your balance off at the end of the month. The card features rewards in 60+ cryptocurrencies and has no annual fee.\n\nUnlike the other cards on this list so far, the Gemini Mastercard is a credit card. Spend anywhere that Mastercard is accepted and pay your balance off at the end of the month. The card features rewards in 60+ cryptocurrencies and has no annual fee. Nexo Mastercard: The Nexo Mastercard is also a credit card that takes advantage of Nexo’s innovative lending model. To use the card, you need to deposit collateral, and Nexo then takes out a loan against your collateral. This means the card’s annual percentage rates (APRs) are very low, starting at just 0%.\n\nGift Cards\n\nYou can spend your crypto balance at retailers, restaurants, and online stores without using a crypto debit or credit card. Instead, you can use your crypto to purchase gift cards to your favorite stores.\n\nPurchase gift cards from thousands of retailers using crypto here:\n\nShould You Pay With Crypto?\n\nWhether merchants support crypto or not, you can use crypto debit cards, credit cards, and gift cards to spend crypto almost anywhere. It’s important, however, to weigh the benefits and downsides of spending your crypto on everyday purchases and decide if it’s for you.\n\nCrypto allows for anonymous transacting, but keep in mind that many companies are required by law to verify your identity. So while crypto payments are well-supported in general, spending your crypto anonymously may be harder.\n\nPaying with crypto can be a good idea when you have a large crypto balance that you want to put to work or if you need a transaction to clear quickly.\n\nCrypto payments can incur tax bills, however, and you might miss out on future price pumps.\n\nPros And Cons Of Paying With Crypto\n\nPros Spend in a currency of your choice\n\nSpend in a currency of your choice Earn rewards\n\nEarn rewards Enjoy instant payment settlement Cons You might have to pay taxes on converted crypto\n\nYou might have to pay taxes on converted crypto Extra fees\n\nExtra fees You can miss out on gains\n\nPros Explained\n\nSpend in a currency of your choice: Whether you hold lots of Bitcoin, Dogecoin, or Ethereum, it’s nice to spend your crypto without converting it first. Today, you can take your crypto tokens directly to the store and walk out with tangible purchases.\n\nWhether you hold lots of Bitcoin, Dogecoin, or Ethereum, it’s nice to spend your crypto without converting it first. Today, you can take your crypto tokens directly to the store and walk out with tangible purchases. Earn rewards: Many crypto debit and credit card providers have a rewards program to incentivize spending. Traditional banks don’t typically offer debit card incentives, so taking advantage of cashback offers from crypto companies can be useful.\n\nMany crypto debit and credit card providers have a rewards program to incentivize spending. Traditional banks don’t typically offer debit card incentives, so taking advantage of cashback offers from crypto companies can be useful. Enjoy instant payment settlement: Blockchains are financial systems that settle transactions much quicker than traditional banks. While fiat payments may take days to clear, blockchain payments clear in just a few minutes.\n\nCons Explained\n\nYou might have to pay taxes on converted crypto: Crypto debit cards and applications like SPEDN make crypto payments possible by converting your crypto to fiat. This may incur a tax liability, however, since you are technically selling your crypto assets. To avoid this, spend stablecoins, or spend at merchants who accept crypto natively (without requiring you to first convert it to fiat).\n\nCrypto debit cards and applications like SPEDN make crypto payments possible by converting your crypto to fiat. This may incur a tax liability, however, since you are technically selling your crypto assets. To avoid this, spend stablecoins, or spend at merchants who accept crypto natively (without requiring you to first convert it to fiat). Extra fees: Some merchants charge extra fees for crypto transactions. Additionally, some crypto card providers will also charge conversion fees when converting your crypto to fiat.\n\nSome merchants charge extra fees for crypto transactions. Additionally, some crypto card providers will also charge conversion fees when converting your crypto to fiat. You can miss out on gains: Many people who hold crypto hope for future price appreciation. History has taught us that paying for goods with crypto could be a bad trade in the long run. Famously, the first Bitcoin transaction was used to purchase two pizzas for 10,000 Bitcoins. Those Bitcoins would now be worth hundreds of millions of dollars.\n\nFrequently Asked Questions\n\nWhich Cryptocurrencies Are Most Widely Supported? The most widely supported cryptocurrencies are Bitcoin and Ethereum. Following closely behind are Bitcoin Cash and Litecoin. Beyond that, popular altcoins such as Dogecoin, MATIC, ApeCoin, and stablecoins like USDC and DAI are also well supported. Do Any Banks Accept Cryptocurrency? US banks currently do not support cryptocurrency deposits. All cryptocurrency must be converted to fiat before being deposited in a bank. How Many Companies Accept Cryptocurrency? There are hundreds of companies that support cryptocurrency. These include major corporations like AT&T, Microsoft, PayPal, and Starbucks. Even if a company doesn’t accept crypto directly, you can use a crypto debit card to spend your crypto at any merchant that accepts Visa or Mastercard. What Are Crypto Debit Cards? Crypto debit cards from Visa and Mastercard are used to convert your crypto balance into fiat (such as USD) in order to make purchases. This allows you to spend your crypto balance at any merchant that accepts Visa and Mastercard. Crypto companies such as Coinbase, Crypto.com, BitPay, and others provide crypto debit cards. Keep in mind that using a crypto debit card may incur tax liabilities since the service will sell your crypto and acquire fiat in order to complete your purchase. This conversion may constitute a taxable event. Does Amazon Accept Crypto? Amazon does not currently provide a checkout option for paying with crypto. To spend crypto at Amazon, you can use a crypto debit card or purchase an Amazon gift card using your crypto balance. Does Home Depot Accept Crypto? Home Depot does not currently provide a checkout option for paying with crypto. Are There Online Stores That Accept Cryptocurrency? There are lots of online stores that accept cryptocurrency. Some include: The Microsoft Store\n\nNewegg.com\n\nOverstock.com\n\nTesla Are There Clothing Stores That Accept Bitcoin? To spend Bitcoin at any clothing retailer, consider getting a crypto debit card from companies like Coinbase, Crypto.com, or BitPay. Are There Real Estate Companies That Accept Bitcoin? There are currently no large real estate companies that accept crypto. To make a real estate or home purchase using crypto, consider using your crypto as collateral to borrow fiat currency and complete your purchase that way. Does Microsoft Accept Bitcoin? Microsoft accepts Bitcoin and other cryptocurrencies for purchases made at the Microsoft Store.\n\nContributor George Hristov George is a tech writer interested in web3 startups and communities. In the dynamic world of crypto, he stays plugged into the day-to-day headlines, deep dives, and industry commentary. Read More"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9nLWtlZXBzLWZhaXRoLWluLWJ1bGwtbWFya2V0LWFzLWJ0Yy1wcmljZS1ib3VuY2VzLTjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin OG keeps faith in bull market as BTC price bounces 8% - Cointelegraph",
        "content": "Bitcoin (BTC) swiftly erased its month-to-date losses on June 7 as volatility returned to ultimately favor the bulls.\n\nBTC/USD 1-hour candle chart on Bitstamp. Source: TradingView\n\nBTC price cancels Binance, Coinbase dip\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD hitting $27,388 on Bitstamp — almost a new June high.\n\nThe pair continued a rebound that had begun the day before, with markets shaking off initial nerves from the United States Securities and Exchange Commission’s (SEC) legal action against Binance and Coinbase.\n\nIn so doing, Bitcoin recovered all of its lost ground, returning to its previous trading range focused just below $27,000.\n\n“Back to $27K. Great bounce from the 200-Week MA. Time to start the new uptrend to $38-42K on Bitcoin,” Michaël van de Poppe, founder and CEO of trading firm Eight, responded.\n\nVan de Poppe referenced the 200-week moving average (MA), an important support level which, at $26,400, was only lost for a few hours.\n\nA previous tweet called the BTC price correction “over,” echoing a similar sentiment from other popular traders.\n\n“Bitcoin has retested the 200-week MA as support,” trader and analyst Rekt Capital confirmed.\n\n“Downside wicking below the MA has taken place but $BTC has managed to hold above it.”\n\nBTC/USD annotated chart. Source: Rekt Capital/Twitter\n\nRekt Capital had previously warned that a firm loss of the 200-week MA would result in a trip toward $20,000.\n\nAnalyzing the bounce itself, the trading suite DecenTrader saw cause for relief based on exchange trader behavior.\n\nWe also got confirmation of the strength of the move, with the #Bitcoin Long/Short ratio plummeting over 50% as price climbed. https://t.co/1pjiJIrika pic.twitter.com/zzZCePK1LB — Decentrader (@decentrader) June 7, 2023\n\nCommenting on the subsequent return below $27,000, analysts argued that it was increasing long positions holding the market back.\n\n“We typically see a bit of a pullback until this is resolved,” they added.\n\nMonitoring resource Material Indicators meanwhile tracked liquidity movements on the Binance order book, describing events as a “stairway to heaven” as conditions improved.\n\nIt nonetheless flagged $27,400 as a key area to break through, something which had not occurred at the time of writing.\n\nDespite the #FUD, it's turning out to be a good day for #BTC. Let's see if bulls can push it past resistance at $27.4k #FireCharts pic.twitter.com/L7AWgzPaGd — Material Indicators (@MI_Algos) June 6, 2023\n\nHayes: Bitcoin has scaled “wall of worry”\n\nEqually unshaken in his faith in BTC price action moving to a better place was Arthur Hayes, former CEO of derivatives exchange BitMEX.\n\nRelated: Bitcoin traders bet on $24K BTC price as market digests SEC vs. Binance\n\nIn ongoing social media reactions, Hayes called on hodlers to wait for the full return of the Bitcoin bull market.\n\n“The wall of worry is being climbed, come with me on the $BTC bull market bus,” he wrote about the rebound.\n\n“We are still on struggle street, but the moon ain’t far away.”\n\nThe day prior, Hayes had cautioned over “FUD” surrounding Binance, arguing that risk assets were responding to bigger macroeconomic problems, which would, in turn, be resolved.\n\nMagazine: Home loans using crypto as collateral: Do the risks outweigh the reward?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRyYWRlcnMtd2VpZ2gtbmV4dC1tb3ZlLXdpdGgtYnRjLXByaWNlLWF0LWNydWNpYWwtMjAwLXdlZWstdHJlbmRsaW5l0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin traders weigh next move with BTC price at crucial 200-week trendline - Cointelegraph",
        "content": "Bitcoin (BTC) cooled the volatility into the June 8 Wall Street open as market participants waited for signals.\n\nBTC/USD 1-hour candle chart on Bitstamp with 200WMA. Source: TradingView\n\nBTC spot clings to 200-week moving average\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD circling a key long-term trend line near $26,500.\n\nAfter flash volatility surrounding industry news events, the pair returned to sideways trading after bouncing from three-month lows.\n\nNow, the 200-week moving average (WMA) formed a critical focus.\n\n“We are currently sitting right on the 200WMA,” trading suite DecenTrader wrote in part of the day’s analysis.\n\nDecenTrader opted for a conservative view of short timeframes, warning over an increasing long/short ratio on exchanges and that the United States trading session may open with selling.\n\nThe LTF bear case for #Bitcoin:\n\n\n\nThe Long/Short ratio is continuing to increase.\n\n\n\nWe are currently sitting right on the 200WMA.\n\n\n\nThe US market tends to sell when they wake up, especially if there's more negative news. https://t.co/NqhnbMZ5BL pic.twitter.com/ajorEbYr7n — Decentrader (@decentrader) June 8, 2023\n\nPopular traders, including Crypto Tony, were on the sidelines until a more pronounced trend became apparent.\n\n“This is the structure i am currently going by on Bitcoin and i remain out of a position while we are mid range,” he told Twitter followers on the day.\n\n“No point rushing nay entries when things are not crystal clear. We had a good short before, now we prepare for the next entry.”\n\nAn accompanying chart showed a potential downside target in a “support zone” at just below $26,000.\n\nBTC/USD annotated chart. Source: Crypto Tony/Twitter\n\n“Unchanged view on Bitcoin. Consolidation, falling wedge. Not overly interesting until we get a breakout,” fellow trader Jelle agreed.\n\nMore optimistic takes came from popular trader King La Crypto, among others, who eyed a potential repeat of the upside from early March. This, as Cointelegraph reported, ultimately resulted in highs of $31,000.\n\nDXY heads to support\n\nPrior to the Wall Street opening, meanwhile, pronounced weakness in the U.S. dollar formed a potential reason for bullishness on crypto markets.\n\nThe U.S. Dollar Index (DXY) fell to its lowest in several days, targeting support from the monthly open and late May.\n\nU.S. Dollar Index (DXY) 1-hour candle chart. Source: TradingView\n\nPopular trader Mikybull Crypto was among those inferring a positive outcome for BTC.\n\n“Correlating Dollar Index DXY and Bitcoin, we can see the market makers model in play,” he explained alongside a comparative chart.\n\n“BTC still have one more leg up.“\n\nBTC vs. DXY annotated chart. Source: Mikybull Crypto/Twitter\n\nMagazine: Home loans using crypto as collateral: Do the risks outweigh the reward?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA2LzA4L2phY2stZG9yc2V5LWJhY2tlZC1ub3N0ci1jcmVhdG9yLWNvbGxhYm9yYXRlcy13aXRoLWVtcGxveWVyLXplYmVkZWUtb24tbmV3LXNvY2lhbC1tZWRpYS1sYXllci_SAYsBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNi8wOC9qYWNrLWRvcnNleS1iYWNrZWQtbm9zdHItY3JlYXRvci1jb2xsYWJvcmF0ZXMtd2l0aC1lbXBsb3llci16ZWJlZGVlLW9uLW5ldy1zb2NpYWwtbWVkaWEtbGF5ZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Jack Dorsey-backed Nostr Creator Collaborates With Zebedee on New Social Media Layer - CoinDesk",
        "content": "Zebedee’s Bitcoin-focused app, which already boasts millions of users according to the company’s website, will let those users opt into the Nostr-based social media component, allowing them to communicate with millions of other Nostr users on different apps like Damus which debuted on Apple's App Store in February 2023."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmRsbmV3cy5jb20vYXJ0aWNsZXMvbWFya2V0cy9iaXRjb2luLWhvZGxlcnMtZWFybi0xMDAweC1yZXR1cm5zLW92ZXItdGhlLWxvbmctdGVybS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Hodling pays off for patient Bitcoin investors with 1000x returns - DLNews",
        "content": "Analysis from Unchained Capital shows investors holding BTC for more than five years did not lose money.\n\nBitcoin halving triggers bull and bear cycles and predictable patterns in volatile asset.\n\nThe hodlrs are right after all.\n\nFor all the ups and downs in Bitcoin’s price one constant prevails — it consistently delivers net gains to investors who hold, or hodl in crypto parlance, the token for at least five years, according to analysis by Unchained Capital, a financial services firm.\n\nPatient investors multiplied their returns 1,000 times on a mean-adjusted basis over six to seven years, Unchained Capital said in a report entitled “HODL Cave” and released this week. The study also found that no investors who held BTC five years lost money.\n\nIn contrast, the mean return for investors holding BTC for two years could multiply 23 times but there was a slim chance they might lose half their initial investment.\n\nStay ahead of the game with our weekly newsletters Subscribe\n\n“For bitcoin detractors, this massive historical appreciation in value is the hardest fact about Bitcoin to explain away,” said the report’s authors, who analysed BTC returns over a 13-year period.\n\nThe power of halving\n\nAt first glance, it may seem obvious that holding an asset for a long time will eventually pay off. Yet unlike most other cryptocurrencies, Bitcoin automatically regulates its scarcity in a way that directly impacts its valuation. It’s called halving, and it has provided a key means for investors to anticipate the bull and bear cycles in Bitcoin.\n\nHardcoded into Bitcoin by its pseudonymous creator Satoshi Nakamoto, halving reduces the number of newly minted tokens by 50% every four years. This means miners tending the Bitcoin blockchain must compete for fewer tokens as a reward for their efforts. It also means the price of Bitcoin predictably goes up as supply diminishes.\n\nNOW READ: Arbitrum just came to a sudden halt — it ran out of money for gas\n\nJoin the community to get our latest stories and updates\n\nThroughout its history, the price of Bitcoin has set a new all-time high between 12 and 18 months after each halving event. The last halving was in 2020 and the next one will happen in 2024. Over the last three years, Bitcoin has swung from a low of $5,000 to an all-time high of about $65,000, and settled back again to $26,434, which is where it was trading on Thursday.\n\nAs a result, halving has become a trigger for a bull market in Bitcoin and in the crypto market as a whole given the token’s dominance. Bitcoin accounts for 44.7% of the cryptocurrency market’s total capitalisation, according to CoinGecko.\n\nHodling becomes a thing\n\nEven so, Bitcoin has crashed after every all-time high. This decline is then followed by a choppy period of sideways price action that gives way to another bull run after the next halving.\n\nInvesting in Bitcoin may be a white knuckle ride, but now, with more than a decade of data to examine, a clear pattern is emerging that may embolden even more hodling.\n\nHodling has become a badge of honour among investors who sit on their positions even when it looks like the bottom is falling out of the market.\n\nHodling became a thing back in 2013 when GameKyuubi, the pseudonymous member of the Bitcointalk forum, coined the term as a deliberate typographical error. “I am hodling,” he said in December 2013.\n\nNow hodling has become a badge of honour among investors who sit on their positions even when it looks like the bottom is falling out of the market, as it did last November when FTX failed and Bitcoin lost more than a quarter of its value in four days.\n\nNOW READ: How Coinbase’s SEC woes clobber its earnings outlook\n\nFunny enough, GameKyuubi is promoting the same idea long championed by Warren Buffett, the billionaire investing legend, who has long advised buying the S&P 500 Index and holding it forever.\n\nBut of course, being a short-term investor in Bitcoin is a very different trip than holding the top 500 stocks in the US. Investors who bought BTC in 2021 have had to stomach a vertiginous risk-reward ratio as the market is whipsawed by regulatory action against Coinbase, Binance, and Genesis. Still, BTC is up 59% this year.\n\nBuy and forget\n\nUnchained Capital’s analysts also weighed the human factor in their report. The simple fact is that investors who sit on their positions for longer time-frames tend to become less likely to sell. They get comfortable hodling BTC the same way Buffett is comfy sitting on his stocks decade after decade.\n\n“The biggest reason that exiting a decade-long bitcoin position for massive returns is a fantasy is that investors who have actually held bitcoin for a decade or more no longer think about exiting Bitcoin,” the authors said.\n\nCall it inertia or buy-and-forget or hodling. Whatever the label, the data show the approach delivers for investors who play the long game.\n\nHave tips about Bitcoin or other cryptocurrencies? Contact the author at osato@dlnews.com."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvYXJnby1ibG9ja2NoYWluLW5vdGVzLTE2LXVwdGljay1pbi1iaXRjb2luLXByb2R1Y3Rpb24taW4tbWF5LTIwMjMv0gF1aHR0cHM6Ly93d3cuZmluYW5jZW1hZ25hdGVzLmNvbS9jcnlwdG9jdXJyZW5jeS9hcmdvLWJsb2NrY2hhaW4tbm90ZXMtMTYtdXB0aWNrLWluLWJpdGNvaW4tcHJvZHVjdGlvbi1pbi1tYXktMjAyMy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Argo Blockchain Notes 16% Uptick in Bitcoin Production in May 2023 - Finance Magnates",
        "content": "Argo Blockchain plc, a major player in the global cryptocurrency mining sector, has provided an operational update for May 2023, showing a rising number of produced cryptocurrencies Cryptocurrencies By using cryptography, virtual currencies, known as cryptocurrencies, are nearly counterfeit-proof digital currencies that are built on blockchain technology. Comprised of decentralized networks, blockchain technology is not overseen by a central authority.Therefore, cryptocurrencies function in a decentralized nature which theoretically makes them immune to government interference. The term, cryptocurrency derives from the origin of the encryption techniques that are employed to secure the netw By using cryptography, virtual currencies, known as cryptocurrencies, are nearly counterfeit-proof digital currencies that are built on blockchain technology. Comprised of decentralized networks, blockchain technology is not overseen by a central authority.Therefore, cryptocurrencies function in a decentralized nature which theoretically makes them immune to government interference. The term, cryptocurrency derives from the origin of the encryption techniques that are employed to secure the netw Read this Term. The company, listed on both the London Stock Exchange (LSE: ARB) and NASDAQ (ARBK), showcased a significant uptick in its Bitcoin (BTC) mining operations.\n\nArgo Blockchain Reports Higher BTC Production\n\nDuring May, Argo mined a total of 173 BTC, averaging 5.6 BTC per day. This marks a substantial increase of 16% from the preceding month, with an average daily production rate of 4.8 BTC. The swell in BTC production can be attributed to increased uptime and an improvement in the operational efficiency of the company's mining fleet. Moreover, a jump in transaction fees on the Bitcoin network contributed to the overall surge in production.\n\nIn addition, the previous month saw a rise in mining revenue for Argo, reaching $4.75 million. This is a solid leap of 14% from April's earnings which stood at $4.17 million. However, the company observed a decrease in the BTC holdings over the month, with 50 BTC held at the end of May which is down from 83 BTC held at April's end. This decline stems from the company's decision to liquidate certain digital assets with the intent to utilize the proceeds toward debt repayment.\n\n\"I'm pleased by the significant increase in the company's BTC production during the month of May,\" Seif El-Bakly, the Interim CEO of Argo Blockchain, commented. \"This is a testament to the hard work of our mining operations team to optimize performance across our fleet.\"\n\nKeep Reading Nigeria Presses Binance amid Economic Turmoil and Detains Executives\n\nArgo Blockchain's total hash rate capacity remains steady at 2.5 Exahashes per second (EH/s). Nevertheless, the company anticipates a boost in capacity following the introduction of new BlockMiner machines at its Quebec facilities later this year. The additional machinery is projected to elevate the company's total hash rate capacity by 12% to approximately to 2.8 EH/s.\n\nEl-Bakly added: \"Over the long term, I believe increased Bitcoin network activity has the potential to drive demand for block space and increase miner fees.\" His statement reflects a positive outlook on the future prospects of Bitcoin mining operations, signifying Argo's commitment to capitalizing on the promising market dynamics.\n\nArgo Produced 491 BTC in Q1, but Net Result on the Downside\n\nYesterday (Tuesday), Argo published unaudited financial results for Q1 2023, showing a total BTC production of 491 tokens in the reported period and an average mining rate which is similar to May's figures. Although the report showed notable improvements in revenue, cash reserves, and cost reductions, the company could not achieve a positive net result.\n\nArgo Blockchain achieved a surge of 15% in revenue from Q4 2022, amounting to $11.4 million. Despite incurring a net loss of $8.7 million, the company attained an adjusted EBITDA of $1.6 million.\n\nIn its recently published financials for 2022, the publicly-listed miner reported a year-end revenue of $58.6 million, representing a significant decline of 36%. The company faced a net loss of $240.2 million for the year, primarily attributed to the diminishing value of cryptos.\n\nDespite the company reporting net losses, it appears to be on the path to stabilization. However, this stability seemed far from guaranteed toward the end of last year as the bankruptcy Bankruptcy Bankruptcy or insolvency constitutes a legal term and refers to being unable to repay debts. A business and a person can declare bankruptcy. When a person or company claims bankruptcy, it is described as a voluntary bankruptcy, and when your debtors force you into bankruptcy, it is referred to as involuntary. A voluntary bankruptcy occurs when the debtor or borrower, the party that owes the money files with the courts. Involuntary bankruptcy happens when your credits file a petition with the co Bankruptcy or insolvency constitutes a legal term and refers to being unable to repay debts. A business and a person can declare bankruptcy. When a person or company claims bankruptcy, it is described as a voluntary bankruptcy, and when your debtors force you into bankruptcy, it is referred to as involuntary. A voluntary bankruptcy occurs when the debtor or borrower, the party that owes the money files with the courts. Involuntary bankruptcy happens when your credits file a petition with the co Read this Term loomed. Fortunately, a strategic deal with Galaxy Digital Holdings, Ltd, a finance company specializing in digital assets, effectively shielded the company from the threat of closure."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJsb2NrY2hhaW4tY291bmNpbC5vcmcvY3J5cHRvY3VycmVuY3kvaG93LXRvLWJlY29tZS1hLWNlcnRpZmllZC1iaXRjb2luLWV4cGVydC1hLWNvbXBsZXRlLWd1aWRlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "How to Become a Certified Bitcoin Expert™? A Complete Guide - Blockchain Council",
        "content": "Why should you become a Certified Bitcoin Expert™?\n\nCryptocurrency has been around for nearly a decade and has seen significant technological advancements and increased acceptance. The value of cryptocurrencies like Bitcoin has skyrocketed, presenting opportunities for those interested in the market. It’s important to note that there is still time to become a Bitcoin expert. Becoming a Bitcoin expert will help you understand how the cryptocurrency market works and provide opportunities in fields you might have never considered. We will now learn why this is the best time for someone to become a Bitcoin expert.\n\nAbundance of Reliable Information\n\nThere is an abundance of reputable and reliable information available on cryptocurrencies. With the rising popularity of Bitcoin, many news outlets have hired cryptocurrency experts to provide accurate and trustworthy insights. Sources like Entrepreneur, Forbes, and CNN offer valuable information authored by experts, making learning easier without falling for misleading or unreliable sources. Unlike in the older days, you quickly look for appropriate resources to learn about a new update or feature, helping you upskill yourself quickly and be relevant in the market.\n\nDiverse Applications of Cryptocurrency Technology\n\nThe technology behind cryptocurrency, particularly blockchain, has applications beyond financial transactions and has only increased over the years giving rise to new job roles for experts in the field. Blockchain secures legal contracts, facilitates fast and low-cost transactions, and even explores areas like voting. Learning about these technologies equips you with knowledge about their potential future applications and helps you develop innovative solutions to technological and security challenges. It also provides a sense of security when engaging in cryptocurrency transactions.\n\nUnderstanding Market Volatility\n\nUnderstanding how cryptocurrency works gives you insights into the volatile nature of the market. By identifying the factors that affect market volatility and recognizing elements that promote stability, you can make informed decisions regarding the projects you wish to get associated with as a Bitcoin expert. This knowledge also allows you to relate to clients and colleagues involved in the cryptocurrency market, fostering trust and stronger professional relationships.\n\nCareer Advantages\n\nRegardless of your industry, cryptocurrency and Bitcoin, in general, is likely to become more prevalent shortly. Many businesses, including reputable organizations, are accepting cryptocurrencies as payment methods. Developing familiarity with cryptocurrency prepares you to keep up with competitors in the job market. Additionally, offering tutoring or consulting services in Bitcoin is a lucrative business opportunity. Consider pursuing certification courses like the one provided by the Blockchain Council to gain credibility and demonstrate expertise to potential clients.\n\nUnderstanding Global Financial Conversations\n\nLearning about cryptocurrencies helps you understand the ongoing conversation surrounding the global financial market and the changes in career roles and responsibilities because of it. As the cryptocurrency market continues to grow, it has the potential to offer significant returns for enterprises and businesses.\n\nLearning about cryptocurrency gives you a competitive edge, helps you understand the world’s advancement, and encourages creative problem-solving. With numerous reasons to learn about cryptocurrency, now is the perfect time to start your journey.\n\nJob responsibilities of a Bitcoin expert\n\nHave you ever wondered what makes those crypto experts so adept at navigating the intricate realm of Bitcoin? Prepare to be enthralled and astonished as we unravel the enigma. Bitcoin experts are the masters of this digital domain, armed with many responsibilities that keep them at the forefront of this thrilling landscape. We will dive into their fascinating work and discover how you can embark on this journey.\n\nUnveiling the Responsibilities\n\nAt the core of their expertise, Bitcoin experts constantly know about the latest updates and advancements in the Bitcoin world. They keep their fingers on the market’s pulse, ensuring they are well-versed in the ever-evolving trends that shape the realm of cryptocurrencies. A keen eye for detail is a crucial attribute for Bitcoin experts. They meticulously analyze and decipher the behaviors and patterns of cryptocurrency usage. By studying these intriguing dynamics, they gain valuable insights into the market landscape, which can prove instrumental in making informed decisions.\n\nMastering the Technical Arsenal\n\nBitcoin experts possess an arsenal of technical know-how that they skillfully utilize. Their proficiency in understanding the intricacies of blockchain technology empowers them to unlock its hidden potential. Armed with this expertise, they can navigate the complex world of cryptocurrencies with finesse.\n\nIt’s not just about having technical knowledge; Bitcoin experts can translate their expertise into actionable market insights. By blending their technical prowess with their astute understanding of market dynamics, they can make informed decisions that maximize opportunities and minimize risks.\n\nYou have to be constantly learning\n\nAre you ready to embark on this captivating journey? To become a blockchain expert, you must first delve into the depths of knowledge. Immerse yourself in the vast ocean of resources, from online courses to informative books, and stay updated with the latest developments in the Bitcoin sphere. Practical experience is the key to unlocking your true potential. Engage in real-world projects, participate in blockchain communities, and collaborate with like-minded enthusiasts. This hands-on experience will enrich your understanding and pave the way for your expertise to blossom.\n\nThe world of cryptocurrencies is a perpetual learning adventure. Stay curious and hungry for knowledge as the landscape continues to evolve rapidly. Embrace every opportunity to expand your understanding, attend conferences, and engage in insightful discussions to keep your finger firmly on the pulse. Becoming a Bitcoin expert may be challenging, but it’s a thrilling odyssey that rewards those who dare to venture. Equip yourself with knowledge, embrace the ever-changing tides, and let your expertise soar to new heights. Unleash the secrets of the crypto world, and fulfill your dreams.\n\nJob roles as a Bitcoin expert\n\nWhile there are so many job roles that you can perform after becoming a Bitcoin expert, we have found and sorted some of the parts that are in constant demand and provide a lot of economic incentives as well.\n\nBlockchain Developer\n\nAs a blockchain developer, you will specialize in developing and maintaining blockchain-based applications, including Bitcoin. You will work on programming intelligent contracts, implementing cryptographic algorithms, and ensuring the security and efficiency of the blockchain network.\n\nCryptocurrency Analyst\n\nIn this role, you will analyze market trends, monitor Bitcoin price movements, and provide insights and recommendations to traders and investors. Your expertise in understanding Bitcoin’s fundamentals, technical analysis, and market indicators will be crucial in making informed investment decisions.\n\nCryptocurrency Trader\n\nAs a cryptocurrency trader, you will actively buy and sell Bitcoin and other cryptocurrencies to profit from short-term fluctuations. Your knowledge of technical analysis, trading strategies, and risk management will be vital in executing successful trades and maximizing returns.\n\nBlockchain Consultant\n\nAs a blockchain consultant, you will provide advisory services to businesses and organizations looking to integrate blockchain technology, including Bitcoin, into their operations. You will assess their specific requirements, design blockchain solutions, and guide them through the implementation process, considering regulatory compliance and security aspects.\n\nCryptocurrency Writer/Content Creator\n\nIf you have strong communication and writing skills, you can explore opportunities as a cryptocurrency writer or content creator. You can contribute to cryptocurrency blogs and news platforms or create educational content such as tutorials, guides, and explainer videos about Bitcoin and other cryptocurrencies.\n\nCryptocurrency Compliance Specialist\n\nAs governments and regulatory bodies develop frameworks for cryptocurrency compliance, there is a growing need for experts who understand the legal and regulatory landscape. In this role, you will ensure that businesses and individuals comply with relevant laws, regulations, and anti-money laundering (AML) procedures in their Bitcoin-related activities.\n\nRoadmap to Become a Bitcoin Expert\n\nThis is where we will share all the resources, concepts and certifications you need to become a Bitcoin expert. So let’s dive in without wasting a lot of time.\n\nEducation needed to become a Bitcoin expert\n\nSelf-Education\n\nBegin by immersing yourself in reputable resources like books, whitepapers, articles, and online courses that provide in-depth knowledge of Bitcoin and cryptocurrency. Understand the fundamentals of how Bitcoin operates, including its decentralized nature, cryptographic principles, and the role of blockchain technology.\n\nBasics of Blockchain Technology\n\nDive into the intricacies of blockchain technology to grasp how it enables the secure and transparent functioning of Bitcoin. Learn about decentralized systems, consensus algorithms like Proof of Work (PoW) or Proof of Stake (PoS), and cryptographic concepts such as public-key cryptography and hash functions. For example, you can study how the Bitcoin blockchain achieves consensus through the PoW algorithm, where miners compete to solve complex mathematical puzzles to validate transactions and add them to the blockchain. This ensures the integrity and immutability of the transaction history.\n\nEconomics and Finance\n\nGain a solid understanding of the economic principles underlying Bitcoin and cryptocurrencies. Explore concepts such as supply and demand dynamics, monetary policy, inflation, and macroeconomic factors that impact cryptocurrency markets. To do this, you can learn how Bitcoin’s limited supply of 21 million coins and the halving events (reducing the block reward for miners) influence its scarcity and potential value appreciation. Understand how market forces and investor sentiment can drive price volatility in the cryptocurrency space.\n\nSkills needed to qualify as a Bitcoin expert\n\nCryptography\n\nAs the world increasingly embraces digital storage for valuable assets, robust security becomes paramount. Cryptography is the technology that stands as the stalwart guardian, ensuring the protection of our digital treasures, especially in the world of cryptocurrencies like Bitcoin. Cryptography uses complex algorithms and mathematical principles to safeguard data from prying eyes. It creates a secure shield around our digital assets, making it incredibly difficult for unauthorized individuals to access or tamper with sensitive information.\n\nDistributed Computing\n\nPicture a group of computers joining forces, even miles apart, to achieve remarkable feats in speed, efficiency, and performance. That’s the essence of distributed computing, a technological marvel that enables multiple computers to collaborate seamlessly on various aspects of a software application. With distributed computing, location is no longer a barrier. These computers can work together as a cohesive unit, sharing tasks and resources regardless of physical proximity. This united front empowers them to accomplish complex jobs faster and more efficiently.\n\nMechanism Design\n\nCryptography may safeguard our data, and distributed computing may enhance collaboration, but there needs to be a link that ties everything together. Enter mechanism design, the strong glue that assembles the elements required for an effective blockchain\n\nCryptography alone can only guarantee security if the underlying incentives and mechanisms are balanced. Mechanism design ensures that these components harmoniously align, fortifying the connection and optimizing the performance of the blockchain. Mechanism design maximizes security and effectiveness by carefully engineering the system’s incentives.\n\nComputer Science and Programming\n\nDevelop proficiency in programming languages commonly used in blockchain development, such as Solidity (for Ethereum) or C++ (for Bitcoin). For beginners, choosing a language that aligns with their goals and makes the learning process simple is the best. For a Bitcoin expert, C++ is that language. They can learn it quickly with the help of our course in just a few months and start their journey as a Bitcoin expert.\n\nUnderstand data structures and algorithms\n\nMastering data structures and algorithms is a crucial aspect of AI development. It’s like wielding a powerful weapon that empowers developers to optimize performance, enhance efficiency, and tackle intricate problems in AI applications with finesse. Arrays and linked lists are the stalwarts of data structures, acting as diligent information organizers. Arrays arrange data elements in a structured manner, facilitating swift access and manipulation. On the other hand, linked lists create a web of interconnected nodes, enabling flexible data management, be it insertion, deletion, or traversal.\n\nHash tables are like magical containers that effortlessly store key-value pairs, allowing lightning-fast searches and seamless access to data within AI applications. Efficiency at its finest! Sorting algorithms come to the forefront when order matters. With its mesmerizing dance of comparisons and swaps, Bubble Sort meticulously sorts data from chaos to order. Quick Sort, the agile partitioning maestro, divides and conquers, efficiently arranging elements. And let’s remember Merge Sort, the harmonious symphony of the divide, best, and merge, gracefully placing data elegantly.\n\nGetting Certified as a Blockchain Expert\n\nTo get the best out of your skills and knowledge, you should take a certification like Certified Bitcoin Expert™ that will increase your reliability as a Bitcoin expert and help you to get more opportunities. The goal of this certification course, like ours, is to help you provide a structure that you can follow to focus on skills needed in the industry and keep you updated about the changes that can impact your job role in the future and help you keep upskilling.\n\nBlockchain Council has always tried to provide the best resources to its pupils, and we ensure that you get all the practical knowledge to stand apart in the crowd and achieve your goal of becoming a Bitcoin expert in the most efficient way possible.\n\nWhat are the future aspects of a Bitcoin expert?\n\nGrowth of Bitcoin\n\nCryptocurrency, particularly Bitcoin, has experienced significant volatility and market fluctuations. Understanding its history and prospects can provide insights into the potential movement of the crypto economy. While specific and accurate predictions are challenging due to the unpredictable nature of the market, industry professionals have shared their perspectives on Bitcoin’s future. Here are some expert predictions:\n\nBobby Lee: The CEO of BTC China, Bobby Lee, believes Bitcoin can reach $1,000,000 in 20 years. He has made accurate predictions, such as Bitcoin falling to $41,000 in 2023.\n\nMark Yusko: Formerly a Bitcoin skeptic, Mark Yusko now predicts a price of $500,000 for Bitcoin in 2030. He also believes Bitcoin can achieve equivalence with gold in the future.\n\nJohn Pfeffer: Partner at Pfeffer Capital, John Pfeffer, uses mathematical calculations to predict a price of $700,000 for Bitcoin in 2030.\n\nThese predictions may turn true, but the situation is clear that Bitcoin will become one of the essential economic assets to own shortly. With the increasing technology adoption, the need for experts will grow too.\n\nJob and Salary Prospects\n\nThe salary prediction for a Bitcoin expert can vary depending on the experience and skills of the individual. However, according to a recent report by Glassdoor, the average salary for a Bitcoin expert in the United States is $150,000. The report also found that the highest-paying cities for Bitcoin experts are New York City, San Francisco, and Chicago. The salary for a Bitcoin expert can also vary depending on the industry in which they work. For example, Bitcoin experts in the financial sector tend to earn higher salaries than those in the technology industry.\n\nBut, the salary for a Bitcoin expert is expected to grow in the coming years. This is due to the increasing demand for Bitcoin expertise as cryptocurrency becomes more prevalent, as we already discussed, and this is probably the best time to learn about Bitcoin and other cryptocurrency-related concepts."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmZ0LmNvbS9jb250ZW50LzBkZTE3ZGMzLTVmNzAtNDVjMi1hOTMzLTJmOTE0YmFjMzJkMtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Crypto ownership doubles in UK before new rules kick in - Financial Times",
        "content": "Print this page\n\nSimply sign up to the Cryptocurrencies myFT Digest -- delivered directly to your inbox.\n\nCrypto ownership more than doubled in the UK last year, the Financial Conduct Authority said on Wednesday, as it announced an October start date for its clampdown on mis-selling in a sector often dubbed finance’s “Wild West”.\n\nAlmost one in 10 people surveyed by the UK’s top financial regulator owned cryptocurrencies in 2022, more than twice the number a year earlier, despite regulators warning that crypto investors should be prepared to lose their entire outlay.\n\n“It is up to people to decide whether they buy crypto . . . Our rules give people the time and the right risk warnings to make an informed choice,” said Sheldon Mills, the FCA’s head of consumers and competition. He added that its crackdown on crypto group advertising would begin on October 8.\n\nThe regulator’s update comes in a bruising week for the crypto industry after two of its largest exchanges, Binance and Coinbase, were sued by the US Securities and Exchange Commission over alleged securities law violations.\n\nIn recent months, the UK has proposed a sweeping new regulatory regime for crypto where rules governing the industry will be brought more closely into line with those for traditional financial services. A cross-party group of MPs recently criticised the policy, suggesting instead that crypto be overseen as a form of gambling.\n\nSome 36 per cent of 2,000 adults polled by the FCA said they had seen or heard crypto adverts, while 25 per cent of those who had not previously been involved in crypto became “curious” as a result of being exposed to advertising campaigns.\n\nThe FCA’s crypto marketing regime will require companies to use risk warnings and offer a “24-hour cooling-off period” for customers. Incentives for customers to “refer a friend” will also be banned.\n\nThe regime will apply to all crypto asset businesses marketing to UK customers, regardless of whether they are based in the UK or overseas. “The crypto industry needs to prepare now for this significant change,” Mills said.\n\nHarry Eddis, a lawyer at Linklaters, said the rules would have a “significant impact” on the UK market by making it harder for people to buy crypto currency.\n\nThe FCA currently regulates crypto firms for money-laundering compliance only. Its research found that 28 per of those who do not use crypto would be “more likely” to buy it if the market and activity were regulated to a similar standard as traditional financial services.\n\nThe increase in ownership of crypto assets has come despite a tumultuous period for the market, which suffered a crisis of confidence last year that resulted in the collapse of former industry bellwether FTX.\n\nThe research also showed almost four-fifths of those buying crypto used disposable income to fund the purchases, 6 per cent borrowed money, and the rest used savings or gains from crypto sales.\n\nThe mean value of their investments was put at just under £1,600, with 40 per cent holding less than £100. The most common reason given for buying crypto, as stated by 40 per cent of respondents, was “as a gamble”.\n\nThe price of the popular cryptocurrency Bitcoin, which peaked at more than $64,000 in November 2022, on Wednesday fell nearly 3 per cent to $26,484.\n\nA renewed crackdown on crypto marketing follows a blitz of American enforcement cases this week.\n\nThe SEC on Monday filed a lawsuit against Binance, alleging the world’s largest crypto exchange mixed billions of dollars of customer cash with a separate trading firm owned by its chief executive Changpeng Zhao.\n\nOn Tuesday, the SEC sued Nasdaq-listed rival exchange Coinbase, alleging it violated US securities law by failing to register as a broker, national securities exchange or clearing agency."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3dvcmxkbGluZS5jb20vZW4vaG9tZS9tYWluLW5hdmlnYXRpb24vcmVzb3VyY2VzL3Jlc291cmNlcy1odWIvYmxvZ3MvMjAyMy9zaGF0dGVyaW5nLXRoZS1pbGx1c2lvbi1iaXRjb2luLXMtbGltaXRhdGlvbnMtYXMtYS1jdXJyZW5jeS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Shattering the Illusion: Bitcoin's Limitations as a Currency - Worldline",
        "content": "There is a fascinating story, taking place during World War II, inside a concentration camp, built by German forces, for Western prisoners of war. This gripping tale explains the reason and the way a currency is created, the rules that govern its transactions and the needs that shape them. At the same time, the story explains, in simple words, some economic terms like arbitrage, default and equilibrium, using a few packets of cigarettes, some grams of coffee and a few chocolate bars. It is a story told in chapter 7 of the book “Talking to my Daughter” by Y.Varoufakis. Yet you may ask – how does this link to Bitcoin's Limitations as a Currency?\n\nLet's take a moment to get a clear picture of the difference between money and currency, so we can put any misunderstandings to rest once and for all! Money, my friends, is the intangible stuff that's all about numbers, while currency is the physical money you can hold in your hands - you know, coins and paper notes. Now that we've got that sorted out, let's look back to the war story. Aside from the main lesson of that chapter, which is that money cannot be kept separate from the state, the author goes on to argue (after a supply of quite a lot Red Cross packages) that the fixed quantity of Bitcoins, their scarcity, raises two important issues: firstly, a deflationary effect (Bitcoin is deflationary by design due to its limited supply) and secondly, as a result of the first, the impossibility of reflating the economy by increasing its quantity. The author has also, using this specific chapter to make his point, highlighted that Bitcoin is definitely not the answer to the question “What is money, really?”\n\nStaying for a while on the deflationary question, there are opposite voices through time, either arguing between price and supply deflation or highlighting that Bitcoin is designed to experience predictable and low inflation rates. In fact, it is worth mentioning that there will never be more than 21 million Bitcoins. This hard-set limit (that can be modified only with a change to the Bitcoin code and a general consensus of the Bitcoin community) creates a sense of ingrained value, and it was the result of a well-thought-out process when figuring out the right supply-and-demand dynamics at the launch of the Bitcoin project. It was intended to mimic the characteristics of a scarce asset like gold, diamonds or even art.\n\nIn other words, this limited supply is intended to increase the value of each individual bitcoin over time, as demand for the cryptocurrency grows but the supply remains relatively fixed. In contrast, fiat currencies are often vulnerable to inflation due to their reliance on central banks or monetary authorities for issuance and regulation. These governing bodies possess the authority to manipulate monetary policies, including the control of money supply and interest rates. When expansive monetary policies are implemented, such as the injection of additional currency into circulation, the value of the currency can gradually diminish over time. This ongoing increase in the money supply can erode its purchasing power and undermine the stability of fiat currencies.\n\nHowever, this deflationary nature of Bitcoin can also be a double-edged sword. While it can increase the value of individual Bitcoins over time, it can also lead to hoarding and a reluctance to spend the currency, as people may believe that its value will continue to rise in the future. This can hinder the adoption of Bitcoin as a medium of exchange, as people are less willing to spend their currency if they believe it will be worth more in the future.\n\nThere are even inherently incorporated disinflationary measures inside Bitcoin (like “halving” which, every four years, reduces the number of Bitcoins that can be mined and enter into circulation). The truth is that:\n\nAlready 19,306,581 Bitcoins (or 92% of the total supply) have been produced so far (according to coinmarketcap.com on 3 rd March 2023)\n\nMarch 2023) A large amount of bitcoins (around 20-23%) are lost forever, mostly due to the loss of private keys\n\nThe last new bitcoin will be generated around the year 2140\n\nThe design intention was that, as the overall supply of Bitcoin decreases, the market value of the currency increases, and its purchasing power goes up. The truth is that the success and stability of Bitcoin's value are subject to market dynamics, regulatory developments, and mostly investor sentiment. Bitcoin's volatility and the lack of intrinsic value make its long-term success as a widely recognized and stable asset quite uncertain. Based on the above, there is no reason to believe that Bitcoin is something that will replace money and there is no reason we should treat Bitcoin as such.\n\nBut let's try to take a less harsh view and take a closer look at what needs to be in place for something to be recognized as \"money\". Economists around the world agree that money has three basic functions: as a unit of account, as an acceptable medium of exchange and as a store of value. It should also be able to be used as a means for deferred payment.\n\nBitcoin does not sufficiently provide even one of these functions!\n\nIt performs poorly as a unit of account – that is: it is not a standard, widespread measurement for value, with prices of goods and services denominated in that currency. The (relatively few) merchants around the world that accept Bitcoins, invariably list their products’ prices in the national currency of the country in which they are based (the volatility of Bitcoin would dramatically impact their prices, otherwise).\n\nBitcoin is also not widely used as an independent unit of account for other currencies to be measured with (while Bitcoin has gained some acceptance as a unit of account in certain circles, it is certainly not widely used in this way today).\n\nBitcoin has a very restricted use as a medium of exchange – money exists to make transactions possible, and this may be achieved only when it is accepted by buyers and sellers to pay debts or financial obligations.\n\nAlthough more and more sellers are accepting Bitcoin, the reality is that they are doing so more from a marketing/publicity perspective, and this trend is most likely to be halted once the Bitcoin price enters (again) bear market territory.\n\nTrust is also at the core of any system of money. Bitcoin’s trust challenge lies in the fact that not many people are filled with confidence by its overall image — its sense of insecurity (not being backed by a Central Bank or a Government), its volatility, the constant threat of the regulator. Having all these in mind, we may conclude the poor function of Bitcoin as means for deferred payment\n\nAnd with this statement, we return to the final function of money: the store of value. According to Karl Schumpeter, one of the greatest economists of all time, along with Maynard Keynes & Milton Friedman, in his book published in 1930 \"A Treatise on Money\", the store of value can be defined as “…the will to possess something precious now…and in the future”, which brings us back to the Bitcoin’s volatility issue.\n\nAccording to Bankrate, \"Bitcoin's price history: 2009 to 2023\": “Bitcoin’s price has been on a roller coaster ride since it first debuted in January 2009, but the long-term trajectory has been higher – ‘up and to the right,’ as they say.” Even, at the time of writing, and so far, this year, bitcoin has a change of 42,03% (according to coindesk.com on 27th February 2023). The extreme volatility of Bitcoin is mostly attributed to it not being intrinsically valuable: there is nothing that is backing up its value, other than feelings and projections.\n\nWhy, then, should you consider Bitcoin as a viable replacement for traditional money? After careful examination, it is clear that Bitcoin falls short of being a true form of money. While it boasts precise accounting facilitated by digital specificity through cryptography and is often hailed as a digital store of value, it is unrealistic to expect Bitcoin to fully supplant money in a vast and diverse economy. While it may find utility in certain scenarios, Bitcoin's limitations and its fundamental divergence from the characteristics of traditional money suggest that widespread adoption as a complete substitute remains unlikely.\n\nRead my next article about Bitcoin’s Future: The Great Deception and the Real Promise\n\nThe opinions and ideas expressed here are my own and I would be happy to discuss them - contact me at Makis.Malioris@worldline.com"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiIWh0dHBzOi8vbWlsa3JvYWQuY29tL25mdC9iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin NFTs: What are Bitcoin Ordinals? - Milk Road",
        "content": "So you might have heard about NFTs, or non-fungible tokens. They’re basically like digital trading cards that you can buy and sell. They live entirely on the blockchain. Some popular NFT collections include the CryptoPunks and the Bored Ape Yacht Club. While most NFTs are on the ETH blockchain, Bitcoin NFTs are now making their way mainstream. Here’s everything you need to know.\n\nWhat Are Bitcoin NFTs?\n\nHere’s the thing: NFTs exist on different blockchains. Most NFTs are stored on the Ethereum blockchain. This is because the technology that powers NFTs uses “smart contracts,” an innovation that first became available on Ethereum in 2015.\n\nSome other chains like Solana also have their own NFTs, but Ethereum has been the largest blockchain that allows for NFTs… until now.\n\nToday, you can purchase NFTs on Bitcoin. That’s right, the original blockchain (and the most popular cryptocurrency project) now supports NFTs. Bitcoin NFTs work quite differently from those on other chains — in fact, they’re only possible because of an update that was introduced to the Bitcoin codebase in 2021.\n\nPros & Cons\n\nPros Allow you to buy and sell NFTs using the Bitcoin network\n\nAllow you to buy and sell NFTs using the Bitcoin network Can store more than just images — audio and video files can also be Bitcoin NFTs\n\nCan store more than just images — audio and video files can also be Bitcoin NFTs Cheaper to create than NFTs on Ethereum Cons Departs from the original concept of Bitcoin as a payments-only platform\n\nDeparts from the original concept of Bitcoin as a payments-only platform Can “clog up” the blockchain and reduce fees awarded to miners\n\nCan “clog up” the blockchain and reduce fees awarded to miners Concept still new and unexplored\n\nHow Do Bitcoin NFTs Work?\n\nSo here’s the deal: Most blockchains get updated regularly for security and expansion purposes. Bitcoin received an upgrade (codenamed “Taproot”) in November 2021 that made it easy to store large amounts of data on the Bitcoin blockchain. This was meant as a future-proof upgrade in order to help Bitcoin stuff more data into every block.\n\nSome enterprising programmers, however, realized they could use this upgrade to store entire files on the Bitcoin blockchain — thus creating Bitcoin NFTs.\n\nBitcoin Ordinals NFTs\n\nThe Ordinals protocol is where the rubber meets the road on Bitcoin NFTs. The basic gist (with as little technical mumbo jumbo as possible) is that Ordinals allows you to “inscribe” a tiny amount of Bitcoin with a unique ID that lets you track that particular digital asset around.\n\nIn fact, you can go to the Ordinals website today and see the latest “inscriptions” (or NFTs) that people have created on Bitcoin. These range from profile-picture-style NFTs to messages to time travelers, memes, and even an audio file of Elon Musk talking about the teachings of Jesus. Someone even created a playable videogame as a Bitcoin NFT.\n\nPretty cool stuff, right?\n\nHow To Buy Bitcoin Ordinals\n\nStep 1: Choose The Right Wallet.\n\nYou will need a wallet to store the Bitcoin Ordinals that you want to purchase. Examples of wallets that support it include the Ordinals Wallet, Hiro Wallet, and Xverse. We’ll use the Ordinals Wallet for this example.\n\nStep 2: Set Up Your Wallet.\n\nYou need to set up your wallet on whichever platform you pick. Select a unique password for it, and you’ll be assigned a seed phrase that lets you recover your wallet in case you forget the password.\n\nStep 3: Deposit Funds Into Your Wallet.\n\nSend BTC tokens to the address of your wallet, which you’ll use to pay for the Ordinals.\n\nStep 4: Buy The Ordinals.\n\nOnce your funds have been deposited, you can browse through the Ordinals collections and select the one you wish to purchase. Pay for it (including NFT royalty fees if they apply) and it’ll be added to your wallet. The process is similar regardless of what wallet provider you choose.\n\nTop Bitcoin Ordinal Projects\n\nTwelveFold TwelveFold is a collection of 300 generative art pieces inscribed on the Bitcoin blockchain, with each piece representing a complete art project. This Ordinals project was created by Yuga Labs, the company behind the famous Bored Ape Yacht Club collection and the APE token. Because of the limited number of pieces and the clout of Yuga Labs, the TwelveFold collection has the potential to appreciate in the future.\n\nBitcoin Rocks Bitcoin Rocks is a limited collection of 100 art pieces inscribed onto satoshis on the blockchain. Each piece pays homage to the early days of crypto collectibles and NFTs. This is one of the most popular Ordinals projects, and the limited collection gives it the potential to appreciate in the future. Note that the lowest bid one can currently make is 2.7BTC, which represents over $60,000.\n\nTimechain Collectibles Timechain Collectibles is a collection of 21 exclusive Ordinals that showcase different types of timepieces, including pocket watches, ancient watches, clock towers, and more. All the pieces are minted into a single block and have consecutive Inscription numbers from 356-377. Some pieces are rarer than others and thus more expensive. Auctions are held on the project’s Discord channel, with fierce bidding because of the exclusiveness.\n\nWhat Are People Saying About Bitcoin NFTs?\n\nPeople are split on whether Bitcoin NFTs are a good thing. Below are some tweets highlighting different viewpoints on this contentious question.\n\nOne of the benefits of Bitcoin Ordinals NFTs is they allow you to store much more data than you can on Ethereum. In the above thread, famous crypto personality Eric Wall explains how he used an Ordinals NFT to create the largest Bitcoin transaction (by data size) the network had seen in seven years. And he paid just $20 in fees to do it. In comparison, to store an NFT this large on Ethereum would have cost close to $140 — a 7x difference.\n\nSecuring the Bitcoin blockchain requires “mining.” This is cost-intensive, so the network rewards miners by giving them Bitcoin. Each time a new block is mined, 6.25 Bitcoins are generated and awarded to miners.\n\nEach block, however, gets harder to mine. There are concerns that Bitcoin will soon reach a point where it is not properly incentivizing miners to keep paying the enormous costs to mine new blocks. In response to this, some are saying that finding more Bitcoin use cases — such as Bitcoin NFTs — will help revitalize the Bitcoin ecosystem and solve this looming problem.\n\nOrdinals are an attack on #Bitcoin.\n\n\n\nIt's being orchestrated by known bad actors. — Derek Ross ⚡⛓️ (@derekmross) February 2, 2023\n\nIt’s generally accepted that Bitcoin was intended to be a payments-only blockchain. Bitcoin “maximalists,” who believe Bitcoin should stick as closely as possible to its original purpose, are skeptical of Bitcoin NFTs.\n\nTo them, these projects pollute the Bitcoin ecosystem, using up valuable space on the blockchain. In addition, Bitcoin maximalists bring up an important point about Bitcoin NFTs — they greatly reduce the fees miners collect for their work.\n\nSince the image and video files of Bitcoin NFTs take up so much space, each “block” of the Bitcoin blockchain is composed of fewer and fewer transactions. Fees are normally charged per transaction, so the fewer transactions there are, the fewer fees are collected. This could spell doom for the Bitcoin ecosystem if it cannot incentivize miners to keep the blockchain running.\n\nInterested in more NFT news? Check out our list of top NFT newsletters to stay in the loop.\n\nTo Sum It Up\n\nBitcoin NFTs bring the important innovation of tradeable digital assets to the very first blockchain to ever exist. While not everyone agrees this is necessarily a good idea, there are positives and negatives to it, and, most importantly, anyone can decide for themselves if they want to use Bitcoin NFTs or not.\n\nContributor George Hristov George is a tech writer interested in web3 startups and communities. In the dynamic world of crypto, he stays plugged into the day-to-day headlines, deep dives, and industry commentary. Read More"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLXNob3dzLXJlc2lsaWVuY2UtYXMtbWFya2V0LXJlYWN0cy10by1zZWMtZHJhbWEv0gFRaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2JpdGNvaW4tc2hvd3MtcmVzaWxpZW5jZS1hcy1tYXJrZXQtcmVhY3RzLXRvLXNlYy1kcmFtYS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin holds as market reacts to SEC drama - AMBCrypto News",
        "content": "3–6-month BTC holders join day and swing traders in sell-offs amidst SEC drama.\n\nBitcoin sees minimal realized loss as it maintains its support range of $25,000 and $26,000.\n\nThe recent drama involving two major exchanges and certain tokens in the Security and Exchange Commission (SEC) suit has caused quite a stir, even though Bitcoin (BTC) itself was not directly involved. Nevertheless, Bitcoin’s response to this news has been noteworthy.\n\nRead Bitcoin (BTC) Price Prediction 2023-24\n\nAs a result of these developments, certain groups of holders have chosen to sell their holdings. However, it is crucial to explore how this news and the actions of these holders have impacted other important metrics and the current market price of BTC.\n\nBitcoin witnesses some Long-term Holders dump\n\nThe recent developments surrounding Binance and Coinbase have had a noticeable impact on the price of Bitcoin (BTC), leading to a correction. Analyses of CryptoQuant’s recent charts revealed that the sell-off volume of BTC was primarily influenced by day traders, swing traders, and some long-term holders.\n\nA closer examination of the Exchange Inflow Spent Output Age Bands provided interesting insights. On June 4, there was a modest increase in BTC inflow within the 0–1-day age band, with over 14,000 BTC entering the exchanges. This move was a regular occurrence based on historical data.\n\nHowever, June 5 witnessed a significant spike in the inflow from long-term holders in the three to six-month age band. This sudden surge saw over 3,000 BTC deposited, indicating an uncommon sell-off by this particular category of long-term holders.\n\nOn the other hand, the six and 12-month holders seemed relatively calm in their sales. But June 7 saw an unprecedented flow of over 1,000 BTC, marking the highest level since March. These observations suggested that short-term holders were the primary drivers behind the recent fluctuations in BTC’s price. Long-term holders have generally held onto their coins.\n\nFurthermore, the Exchange Inflow – Spent Output Value Bands shed light on the volume of Bitcoin sold by various traders, ranging from 1 to 10,000 BTC over the past 13 months.\n\nBitcoin realized losses stay minimal\n\nAs U.S. regulatory pressure intensified on major cryptocurrency exchanges Binance and Coinbase, the market witnessed a surge of high volatility, leading to substantial price swings. Despite these turbulent movements, recent data from Glassnode’s chart revealed that the total Bitcoin Realized Losses recorded On-Chain amounted to a relatively modest $112 million.\n\nInterestingly, this figure represented a significant deviation of -$3.05 billion (-96.5%) from the largest recorded capitulation event. These findings suggested that market participants have displayed heightened resilience in the face of these regulatory challenges.\n\nHow much are 1,10,100 BTCs worth today\n\nCurrent support level maintained\n\nOn a daily timeframe chart, Bitcoin’s price movement revealed a noteworthy trend that began on June 4. During this period, Bitcoin experienced substantial price fluctuations.\n\nHowever, it managed to sustain its support range, hovering around $26,000 to $25,000. As of this writing, BTC was trading at approximately $26,500, indicating a slight increase and suggesting a modest gain in value."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LnN0YW5kYXJkLmNvLnVrL2J1c2luZXNzL21vbmV5L2JpdGNvaW4tYnRjLXByaWNlLXByZWRpY3Rpb24tZm9yLWp1bmUtMjAyMy1iMTAwNDU5MC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) price prediction for June 2023 - Evening Standard",
        "content": "This is because the minting of new bitcoins is set at a fixed rate which slows over time. When bitcoin began, the reward given to miners for adding a block of transactions to the blockchain was 50BTC. Four years later, it was halved to 25 and the reward continues to halve every four years."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LnRla2VkaWEuY29tL215c3RlcmlvdXMtYml0Y29pbi13YWxsZXQtY29tZXMtdG8tbGlmZS1hZnRlci1uaW5lLXllYXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Mysterious Bitcoin Wallet Comes to Life After Nine Years - Tekedia",
        "content": "In the world of cryptocurrencies, there are many mysteries and surprises. One of them is the phenomenon of dormant bitcoin wallets that suddenly become active after years of inactivity. These wallets contain large amounts of bitcoins that have been untouched for a long time, sometimes since the early days of bitcoin when the coins were worth very little.\n\nOne such wallet recently came to life after nine years of dormancy. The wallet contains 616 BTC, which is worth more than $40 million at the current market price. The wallet dates back to around the time that bitcoin’s pseudonymous creator Satoshi Nakamoto was last active online and has seen its value increase by more than 800,000%… According to Whale Alert, a service that tracks large cryptocurrency transactions, the wallet was activated on September 23, 2021, and transferred its entire balance to different addresses.\n\nWho owns this wallet and why did they decide to move their bitcoins after so long? This is a question that many in the crypto community are asking, but there is no definitive answer. Some speculate that it could be a whale, an individual or a group with a large stash of bitcoins, who is planning to sell or trade their coins. Others suggest that it could be someone who forgot or lost their password and finally managed to recover it. And some even wonder if it could be Satoshi Nakamoto himself, returning to claim his fortune.\n\nIt is not possible to link the wallet to an identity or a location, due to the anonymous and decentralized nature of bitcoin. However, it is possible to track the movements of the coins through the public blockchain ledger, which records every transaction that ever happened on the network. If the owner of the wallet decides to cash out their bitcoins on an exchange or a platform that requires identification, they might reveal themselves. But until then, they remain a mystery.\n\nThis is not the first time that a dormant wallet containing huge sums of bitcoins has been activated without explanation. In November 2020, a mystery person moved more than $1 billion worth of bitcoins from the fourth largest wallet in the world. The wallet had been inactive since 2015 and contained 69,369 BTC. In January 2021, another wallet that had been dormant since June 2010 woke up and transferred 50 BTC to another address. The wallet was believed to be one of the earliest ones created by Satoshi Nakamoto.\n\nThere are dozens of other wallets that have been inactive for at least nine years and contain thousands of bitcoins each. Some of them might belong to people who died, lost their passwords, or simply forgot about their coins. Some of them might belong to early adopters who are waiting for the right moment to sell or use their bitcoins. And some of them might belong to unknown entities who have their own reasons for keeping their coins dormant.\n\nThe activation of these wallets can have an impact on the bitcoin market, as they introduce new supply and demand dynamics. If the owners decide to sell their bitcoins, they might cause a price drop and volatility in the short term. If they decide to hold or use their bitcoins, they might increase the demand and scarcity of the cryptocurrency. Alternatively, they could use their funds to support some crypto-related project or cause, or simply hold on to them for longer.\n\nThe activation of this dormant wallet is a reminder of the history and mystery of Bitcoin, a decentralized and pseudonymous currency that has grown from a niche experiment to a global phenomenon. It also shows that there are still many hidden treasures in the crypto space, waiting to be discovered or claimed by their rightful owners.\n\nShare this: Facebook\n\nTwitter\n\nWhatsApp\n\nLinkedIn\n\nEmail\n\nPrint\n\n"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vd3d3LmZyZWV0aHMuY28udWsvMjAyMy8wNi8wNy9jcnlwdG9jdXJyZW5jeS1hbmQtZnR4LTYtbW9udGhzLW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 07 Jun 2023 07:00:00 GMT",
        "title": "Cryptocurrency and FTX, 6 Months On | Financial Services | Bitcoin - Freeths",
        "content": "Never a stranger to volatility, cryptocurrency has seen a number of ups and downs over the years since its inception back in 2009. The last year, however, has been a particularly eventful one.\n\nMay 2023 marked six months following the collapse of the crypto exchange FTX. This proved to be a watershed moment for the industry and which has had substantial implications for both crypto firms and consumers, and has resulted in increased in scrutiny from governments and regulators.\n\nWe have set out below a recap of what happened to FTX, why this occurrence was so significant and what has happened in the crypto world in the six months since.\n\n2022 – A recap\n\nIn the early months of 2022, there was plenty to be positive about in the crypto world, particularly within the UK. April 2022 saw the end of the Financial Conduct Authority’s Temporary Registration Regime, and the full implementation of the legal requirement for all new and existing cryptoasset businesses to register with the FCA for the purposes of anti-money laundering rules before being able to operate. This concluded a two-year implementation process, and was one of the first key steps towards introducing a regulatory framework for crypto, and helped drive efforts to move it away from its perception as a tool for crime and money laundering.\n\nA more significant political development also came in April 2022 with the announcement of the UK government’s plans to make the country a “global hub for cryptoasset technology and investment.” These plans were spearheaded by then-Chancellor Rishi Sunak, and comprised an initial package of plans including the planned use of stablecoins as a recognised form of payment, and opened up a call for evidence regarding the use of distributed ledger technology in financial markets. The announcement also included plans for the government to work with the Royal Mail to create its very own non-fungible tokens (NFTs). Sunak’s subsequent elevation to the role of Prime Minister later in the year only served to bolster confidence in these pledges.\n\nIn terms of the markets, summer 2022 saw ongoing fluctuations in the value of Bitcoin – itself the largest and arguably the most well-known cryptocurrency – which were indicative of gradual market re-balancing following volatility which had been seen over the year prior.\n\nOn the tech front, progress was made in September 2022 when the Ethereum network successfully migrated its operating systems from a ‘proof of work’ system to ‘proof of stake’. This was expected to significantly cut down the amount of work and energy required to enable the network to operate and for transaction validations to occur, which has long been a source of criticism for cryptocurrencies.\n\nDespite this buzz of activity, crypto had its “Black Friday” moment in November 2022, with the much-publicised collapse of FTX, which looked to undo much of the positivity that had been generated over the course of the year.\n\nWhat was FTX?\n\nFTX (short for “Futures Exchange”) was a Bahamas-based company led by CEO Sam Bankman-Fried, which operated as an exchange for cryptocurrencies and other digital assets.\n\nCrypto exchanges are intended to allow users and investors to store their digital assets online, and allows users to swap, buy, sell, and exchange cryptocurrencies. In practical terms, crypto exchanges operate in a similar way to a traditional exchange platform and can also resemble a type of banking service, and there are a number of potential benefits to customers in using an exchange. They can allow users easy access without the need for self-storage and the risk of the user losing their own wallets or the “keys” necessary to access these. They also facilitate and enable the purchase and sale of crypto assets, and so can be particularly attractive to investors who are often looking to buy and sell quickly.\n\nLike a bank, however, crypto exchanges are also businesses in their own right and aim to make profits from the services they provide. Crypto exchanges are also susceptible to market pressures and liquidity shortages. In the case of FTX, market speculation arose following a mass-sale of the cryptocurrency FTT (FTX’s own native token), resulting in a classic bank run situation, with customers seeking to withdraw their cryptoassets from the exchange. FTX proved unable to fulfil the volume of customer withdrawal demands, and it quickly ceased processing withdrawals altogether. Shortly afterwards, Bankman-Fried resigned his position and administrators took control of the company’s affairs and conducted an initial investigation into the state of business. The subsequent Bankruptcy filings made for sobering reading. These indicated that the total assets held could not be readily identified by the administrators, though were believed to be worth billions. As for the operation of the business itself, the administrator’s findings were stark:\n\n“Many of the companies in the FTX Group, especially those organized in Antigua and the Bahamas, did not have appropriate corporate governance. I understand that many entities, for example, never had board meetings…”\n\n“The FTX Group did not maintain centralized control of its cash. Cash management procedural failures included the absence of an accurate list of bank accounts and account signatories, as well as insufficient attention to the creditworthiness of banking partners around the world.”\n\n“In the Bahamas, I understand that corporate funds of the FTX Group were used to purchase homes and other personal items for employees and advisors…”\n\n“The Debtors did not have the type of disbursement controls that I believe are appropriate for a business enterprise. For example, employees of the FTX Group submitted payment requests through an on-line ‘chat’ platform where a disparate group of supervisors approved disbursements by responding with personalized emojis…”\n\nAlmost overnight, FTX went from being the third largest crypto exchange globally to being all but wiped out. Millions of customers were left unable to access their funds, with no indication as to when – if at all – they could expect to recover their funds. On the back of this, Bankman-Fried was arrested and charged in the US for various counts of fraud and other activities, with a trial expected to take place in late 2023.\n\nThe impact of FTX\n\nIt is hard to understate the significance of the FTX collapse on the cryptocurrency industry. Some may ask how the failure of a single business can have such a significant impact on an industry in the way FTX has.\n\nThe answer to this perhaps lies in the fact that cryptocurrency remains a relatively new and emerging technology, with public knowledge and understanding being relatively limited, meaning that overall confidence and trust in the technology is not yet established. Furthermore, whilst there are a significant number of cryptocurrencies and business operating within the industry, public knowledge is typically limited to just a small number of these entities, which gives those particular businesses and assets a large amount of power within the industry. So, when one of these key market players fail, this alone can be significant in shaping opinions. Cryptocurrency also has an ongoing battle in fighting against a reputation as being a tool mainly used for illegal purposes, and so the initial findings published about the management of FTX inevitably adds fuel to this fire.\n\nIt is important to note at this stage that cryptocurrency and cryptocurrency exchanges are not one and the same – an exchange is an institution designed to enable the storage and exchange of cryptocurrencies such as Bitcoin. It is not of itself an asset, although may issue its own forms of currency and digital tokens. In practical terms, however, the two are often grouped together within a wider concept of ‘crypto’, and so the failure of an exchange may often be perceived as an indictment of cryptocurrencies themselves.\n\nIn the immediate aftermath of the FTX collapse, other crypto exchanges began damage-control exercises to try and reassure their customers and re-establish market confidence. Some exchanges went to the extent of publishing their own accounts and proof of reserves, in order to convince customers that their assets were safe.\n\nThe fallout from FTX unsurprisingly caught the eye of governments and regulators. Less than two weeks following the collapse, the Deputy Governor for Financial Stability at the Bank of England, Sir Jon Cunliffe, publicly spoke about FTX and the problems with cryptocurrencies as he saw them:\n\n“‘Crypto’ was born in unregulated space: indeed, part of the objectives of its early developers was to create a financial system outside regulation. While not yet of systemic scale, the crypto ecosystem has grown very rapidly in recent years and broadened to encompass a range of financial services.\n\nMoreover, it is not clear to what extent to which these platforms are truly decentralised. Behind these protocols typically sit firms and stakeholders who derive revenue from their operations. Moreover it is often unclear who, in practice, controls the governance of the protocols.\n\nMore generally, as with driverless cars, they are only as good as the rules, programmes and sensors which organise their operations.”\n\nCritically, he also indicated that whilst the failure of a crypto exchange such as FTX was not presently enough to threaten wider financial markets, he did not wish to see a situation where such a scenario could happen, and so expressed support for an effective and robust regulatory framework for crypto.\n\nAs the year drew to a close, it seemed that fortunes had taken a significant downturn for cryptocurrency. The positivity surrounding the industry from earlier in the year and the UK’s plan to build a “global hub” was in significant doubt.\n\n2023 onwards\n\nAs the dust has begun to settle following the events of FTX, 2023 has seen a number of developments take place which suggest crypto is on a gradual – if unsteady – road to recovery.\n\nFebruary 2023\n\nAt the start of February, the UK Government released the details of its plans to formally regulate cryptocurrency and digital assets, declaring “we remain steadfast in our commitment to grow the economy and enable technological change and innovation – and this includes cryptoasset technology.”\n\nAs part of the announcement, the government opened up a public consultation and call for evidence in respect of its plans, which include proposals to categorise the acts of arranging and advising on crypto investments as regulated activities for the purposes of the Financial Services and Markets Act (Regulated Activities) Order 2001, as well as bringing the marketing of cryptoassets and associated investments into the remit of the existing regulations on financial promotions.\n\nThe re-pledging of commitment towards cryptoassets was a welcome move for the industry, which had been left in a state of uncertainty following the FTX collapse and the criticisms raised by regulators in the aftermath.\n\nMarch 2023\n\nAs the public consultation for crypto regulation began, the FCA remained diligent in monitoring potentially illegal crypto activity, and issued details of recent crackdown operations it had overseen across the country in conjunction with the Metropolitan Police in respect of “Crypto ATMs”, which are machines allowing people to acquire crypto assets by depositing cash. The FCA has issued reminders that, at the time of writing, no businesses were registered or authorised to operate such machines.\n\nThis same month saw another significant development which may have inadvertently served to bolster crypto’s fortunes. This was the collapse of the US-based Silicon Valley Bank (“SVB”). This was a bank which had typically focused on the technology sector, but which faced growing market uncertainty owing to various concerns about its investment strategy and liquidity, which culminated in another ‘bank run’ situation with customers seeking to withdraw their funds en masse, which the bank struggled to fulfil. UK customers were luckily safeguarded following action by the FCA which oversaw and approved the purchase of the bank’s UK arm by HSBC. This prevented the need for any government bailouts, and helped to ensure UK customers were able to go about business as normal.\n\nNonetheless, the situation with SVB often looked to be comparable to what had been seen with FTX mere months earlier. This served as a reminder that even traditional financial institutions such as banks are not immune to financial pressures and can ultimately fail, resulting in potentially significant impacts on consumers. It showed that the issues which were seen with FTX were perhaps not down to any inherent risks or failures of cryptocurrency itself.\n\nMay 2023\n\nOn 17 May, the UK’s Treasury Committee released a report setting outs its analysis of the crypto-asset industry and its views as to how future regulation should work. Whilst the Committee welcomed the government’s proposals from earlier in the year for regulating the industry, it also made it clear that it considered unbacked cryptoassets such as Bitcoin to have no intrinsic value and serve “no useful social purpose”. It further expressed concerns that if the government regulated cryptoassets as a form of financial service, this risked giving consumers a false sense of security about the assets and could lead them to believe investments are safer than they are.\n\nThe Committee summarised its findings by saying it must “strongly recommend that the Government regulates retail trading and investment activity in unbacked cryptoassets as gambling rather than as a financial service.”\n\nIn response, the trade association, CryptoUK, published a statement saying that it “strongly disagreed” with the Committee’s findings and considered them “unhelpful, false, fundamentally flawed and unsubstantiated” as a whole, and that it failed to “reflect the true nature, purpose and potential of the crypto industry”. It did, however, confirm its willingness to work with and support the government’s moves towards regulation and to engage with the FCA and Treasury to work to find solutions to some of the problems presented. These statements perhaps signify a potential for greater collaboration and communication between the industry and regulators in the future.\n\nJune 2023\n\nAt the start of June, the UK’s All-Party Parliamentary Group for Crypto and Digital Assets issued its initial report following its inquiry into the topic of crypto regulation, which contained details of the submissions it had heard during the course of its investigations, along with making a series of recommendations for policymakers. In a stark contrast to the Treasury Committee’s report from the previous month, this latest report talked about the practical benefits of crypto and made particular reference to how cryptocurrencies had been used by Ukranians to allow them to continue to buy goods and services even after infrastructures and ATMs were damaged due to the ongoing conflict. The report went on to talk about how the Government should aim to “harness the significant opportunities” for economic growth arising from crypto, and emphasised the need to ensure regulators were given sufficient resources and skills to be able to properly understand the industry and to effectively regulate it.\n\nConclusions\n\nAs the events of the past year have shown, cryptocurrency remains incredibly unpredictable and it is in often hard to predict from one month to the next what developments will be seen.\n\n2022 was, in many respects, a positive year for the industry, particularly within the UK, thanks to the government’s declarations of its ambitions for the use of digital assets. Whilst, it cannot be denied that the failure of FTX also caused the industry and its reputation to suffer significant damage, it does seem that this was also one of the key moments which served to spur governments and regulators to really move forward with their plans for regulation and the introduction of a proper legal framework for the industry, which can only prove beneficial in the long run and help the industry move it away from its “Wild West” image.\n\nOverall, from the events of 2023 it does appear that crypto is on a gradual road to recovery following the events of FTX, and the UK in particular is clearly driving towards bringing about a full and robust regulatory framework for these assets. Whilst there will inevitably be further challenges on the way, the moves towards a proper regulatory framework may go a significant way to showing that crypto is here to stay and that the industry can learn the lessons it needs to from FTX, and allow cryptocurrency to continue to innovate and challenge financial norms in a way which will support individuals and investors alike.\n\nOur Financial Services team have expertise in Cryptocurrency and FTX, click through to find out how we can help your business.\n\nThe content of this page is a summary of the law in force at the date of publication and is not exhaustive, nor does it contain definitive advice. Specialist legal advice should be sought in relation to any queries that may arise."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYml0Y29pbmlzdC5jb20vYml0Y29pbi1wcmljZS1zZXQtdG8tc3ByaW50LXRvd2FyZC00MDAwMC_SAURodHRwczovL2JpdGNvaW5pc3QuY29tL2JpdGNvaW4tcHJpY2Utc2V0LXRvLXNwcmludC10b3dhcmQtNDAwMDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 08 Jun 2023 07:00:00 GMT",
        "title": "Bitcoin Price Set To 'Sprint' Toward $40,000, This Prominent Trader Claims - Bitcoinist",
        "content": "Bitcoin price has been a topic of great interest and speculation in the financial world, with investors eagerly watching its price movements for potential opportunities. Recently, an interesting development has caught the attention of both seasoned traders and crypto enthusiasts alike.\n\nAccording to Mikybull Crypto, there is a long-term chart feature that, if it continues to hold, could potentially lead to a significant upside for Bitcoin (BTC). In his latest analysis, the popular trader highlighted encouraging signs on the BTC/USD weekly chart, suggesting the possibility of a remarkable 60% surge in value. This potential surge would catapult bitcoin price to an impressive point of approximately $40,000.\n\nThe question on everyone’s mind is: Will Bitcoin indeed experience this substantial upside, and what factors might contribute to such a surge?\n\nLong-Term Chart Signals Potential Upside For Bitcoin Price\n\nWith Bitcoin still confined within a narrow trading range it entered nearly three months ago, traders and investors find themselves in a quandary when it comes to predicting short-term price targets. The day-to-day performance of the cryptocurrency has failed to establish a clear trend, leaving $30,000 as a formidable resistance level hanging overhead.\n\nNonetheless, renowned trader Mikybull Crypto remains optimistic, as he identifies an intriguing price action on the higher time frames that could signal a significant move in the near future. According to his analysis, the weekly chart reveals the completion and subsequent retesting of an inverse head-and-shoulders pattern for BTC/USD.\n\n#Bitcoin is flashing a text book inverse head and shoulders on the weekly TF. Price is currently retesting the Neckline after the breakout. As taught, if the range between the head and neckline is usually the sprint, we are anticipating another 60% rally on #BTC pic.twitter.com/67KU37Tfbq — Mikybull 🐂Crypto (@MikybullCrypto) June 8, 2023\n\nIn contrast to the standard head-and-shoulders pattern, which typically indicates a solidified resistance followed by a downward trend, the inverse head-and-shoulders pattern is a bullish counterpart. This suggests that Bitcoin may be on the verge of a positive breakout.\n\nSource: TradingView\n\n“Bitcoin is flashing a text book inverse head and shoulders on the weekly TF. Price is currently retesting the Neckline after the breakout,” Mikybull Crypto wrote.\n\n“As taught, if the range between the head and neckline is usually the sprint, we are anticipating another 60% rally on BTC,” he said\n\nBitcoin Price Faces Speculation On $40K Target Amid Halving Predictions\n\nAs Bitcoin’s price drops to the $25K level on CoinGecko, market participants continue to keep a close eye on the highly anticipated $40,000 mark. This significant price level has become a popular target for many traders and investors, as it symbolizes a potential breakthrough for the leading cryptocurrency.\n\nSource: Coingecko\n\nAdding to the discourse, renowned trader and analyst Credible Crypto recently made a prediction suggesting that Bitcoin may enter a sideways phase, ranging between $20,000 and $40,000, for approximately 12 months following the upcoming halving event in April 2024.\n\nExpectations: “The Bitcoin halving is in April 2024. Expect $BTC to go sideways between 20-40k for about 12 months which is when we accumulate as much Bitcoin as we can. Once the halving hits, we start our next bull run to 100k+ into 2025. WAGMI.” Reality: BTC makes a new ATH… — CrediBULL Crypto (@CredibleCrypto) June 3, 2023\n\nBitcoin price loses steam, drops to the $25K territory today. Chart: TradingView.com\n\nBitcoin halving, which occurs approximately every four years, is a significant event in the cryptocurrency’s ecosystem. It is marked by a reduction in the block rewards earned by miners, resulting in a decreased rate at which new Bitcoins are generated.\n\nThis event has historically been associated with bullish trends, as the reduced supply of new coins often drives up demand and subsequently impacts the price.\n\nFeatured image from TechSpot"
    }
]