[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wNC8yOS9iaXRjb2luLXJpc2UtaWYtdXMtZGVmYXVsdHMtb24tZGVidC1zdGFuZGFyZC1jaGFydGVyZWQtYW5hbHlzdC_SAWJodHRwczovL2ZvcnR1bmUuY29tLzIwMjMvMDQvMjkvYml0Y29pbi1yaXNlLWlmLXVzLWRlZmF1bHRzLW9uLWRlYnQtc3RhbmRhcmQtY2hhcnRlcmVkLWFuYWx5c3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "If U.S. defaults on debt Bitcoin could rise nearly 70%, says Standard Chartered analyst - Fortune",
        "content": "Bitcoin bulls have had a good year so far. If the U.S. defaults on its debt, it could get even better, at least in terms of their Bitcoin investment.\n\nThat’s according to Geoff Kendrick, Standard Chartered’s head of digital assets research. He told Insider this week that a U.S. default—which he called a “low-probability, high-impact event”—could cause Bitcoin to jump by about $20,000, an increase of nearly 70% from current levels.\n\nBitcoin started the year at well below $17,000 but is now hovering near $30,000. That’s still well off its all-time high of nearly $69,000 in November 2021, and some investors who bought Bitcoin around then are no doubt still licking their wounds.\n\nBitcoin, Kendrick predicted, would fare well even if overall cryptocurrencies, which trade more like stocks, did not. “So actually, the optimal trade would probably be long Bitcoin, short Ethereum. That sort of mix would probably be a good expression of this,” Kendrick told Insider.\n\nOn Monday, Kendrick said in a note that Bitcoin could reach $100,000 by the end of 2024 and the “crypto winter” was over. He added that Bitcoin has benefited from its status as a “branded safe haven, a perceived relative store of value and a means of remittance.”\n\nBitcoin’s price shot up earlier this year after Silicon Valley Bank collapsed and fears of a banking crisis mounted.\n\nMeanwhile the debt ceiling crisis has intensified. On Wednesday, House Republicans passed legislation (barely) that would raise the government’s debt ceiling in exchange for spending restrictions. In the weeks ahead, they’ll try to reach a compromise with President Joe Biden that would allow the nation’s debt to be lifted.\n\nIf the U.S. did default on its debt this summer, the consequences would be severe for America and the world. Last month, Treasury Secretary Janet Yellen warned lawmakers that “a default on our debt would trigger an economic and financial catastrophe.”\n\nFew think it will come to that.\n\nBut even without a U.S. default, many Bitcoin bulls see good things ahead. ARK Invest CEO Cathie Wood said in February that in five years Bitcoin will hit “roughly $670,000, something like that, and then by 2030, as we see more use cases and more of these insurance policies taken out against fiscal and policy regimes that are not healthy, we think it could pass $1 million.”\n\nBitcoin has plenty of critics and doubters, of course. Mark Mobius, the billionaire cofounder of Mobius Capital Partners, predicted in December that Bitcoin would fall to $10,000 at some point this year. He has said of Bitcoin, “It’s not an investment, it’s a religion.”\n\nEarlier this month, Berkshire Hathaway CEO Warren Buffett reiterated his long-running skepticism. “Something like Bitcoin, it is a gambling token, and it doesn’t have any intrinsic value,” he told CNBC’s Squawk Box. “But that doesn’t stop people from wanting to play the roulette wheel.”"
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vbWFya2V0cy5idXNpbmVzc2luc2lkZXIuY29tL25ld3MvY3VycmVuY2llcy9iaXRjb2luLXByaWNlLW91dGxvb2stdXMtZGVmYXVsdC1kZWJ0LWNlaWxpbmctY3Jpc2lzLWV0aGVyZXVtLXByaWNlLTIwMjMtNNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Could Jump Nearly 70% If the US Defaults: Standard Chartered - Markets Insider",
        "content": "Bitcoin could climb by $20,000 if a US default happens, Standard Chartered's Geoff Kendrick said.\n\nNot every crypto would act similarly, with some behaving more like equities, he told Insider.\n\n\"So actually, the optimal trade would probably be long bitcoin, short ethereum.\"\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nWith the looming debt ceiling crisis showing no signs of a resolution, both bond and equity markets have become jittery.\n\nBut while some investors are fearful of a historic default, one asset could potentially rise through such a situation: Bitcoin.\n\nDescribing a US default as a \"low-probability, high-impact event,\" Geoff Kendrick, head of FX research at Standard Chartered, said it may cause the bitcoin to jump by about $20,000, representing an increase of 68% from current levels.\n\nHe told Insider that's because the top cryptocurrency by market cap has a reputation for performing well in periods of stress and is often seen as a safe haven, especially as it is a decentralized asset.\n\nAdvertisement\n\nBut Kendrick doesn't think bitcoin would rally in a straight line in the event of a US default, saying \"it probably comes a bit lower on day one or day two or week.\" In that case, bitcoin could dip by $5,000 initially, then jump by $25,000, he estimated.\n\nAnd not every cryptocurrency would follow bitcoin's behavior, he added, with others like ethereum trading more like stocks, which would likely fall in a default.\n\n\"So actually, the optimal trade would probably be long bitcoin, short ethereum. That sort of mix would probably be a good expression of this,\" Kendrick said.\n\nIf Congress fails to lift the $31.4 trillion federal debt limit, a default could come sometime in the summer — an event that could cause seismic ruptures global markets. On Tuesday, Treasury Secretary Janet Yellen warned a default would be catastrophic for the US economy, sparking mass unemployment, payment failures, and higher rates \"into perpetuity.\"\n\nAdvertisement\n\nWith House Republicans and the White House still far from a deal to raise the debt ceiling, yields on three-month Treasurys recently jumped to a 22-year high, as they would mature around a potential default date.\n\nMeanwhile, bitcoin is still recovering from a massive sell-off that began in late 2021 and continued through much of 2022 as the Federal Reserve embarked on an aggressive tightening cycle.\n\nBut bitcoin has rallied nearly 80% so far in 2023 and recently neared $30,000 as First Republic Bank's woes reignited fears over the financial sector.\n\nFor his part, Kendrick is already bullish on bitcoin, saying in a note on Monday that it could surge to $100,000 by the end of 2024 due to bank turmoil, bitcoin halving, and the expected end of Fed rate hikes, among other things, though it didn't mention the risk of a US default.\n\nAdvertisement\n\n\"While sources of uncertainty remain, we think the pathway to the USD 100,000 level is becoming clearer,\" he wrote."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTMwL2JpdGNvaW4tcy1idGMtZm91ci1tb250aC13aW5uaW5nLXJ1bi1icmluZ3MtMTAwLTAwMC1pbi12aWV3LWlmLWhpc3RvcnktcmlnaHTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin on Course for Longest Streak of Monthly Gains Since 2021 - Bloomberg",
        "content": "Sign up for our new Crypto newsletter and follow @crypto Twitter for the latest news.\n\nBitcoin is set to climb for the fourth month in a row after eking out an April gain, the longest such stretch since a six-month advance through March 2021."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWJhbmstaml0dGVycy1wcmljZS1zcGVjdWxhdGlvbi0wNDQzNTYzNzQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin up on bank jitters, price forecasts; Ether dips, U.S. equity futures flat - Yahoo Finance",
        "content": "Bitcoin edged up on Monday morning in Asia on the first trading day of May to hold above the US$29,000 mark as worries about the U.S. banking system resurfaced and amid bullish price forecasts for the token. Ether dipped below US$1,900, paring its 5% gain in April. Most other top 10 non-stablecoin cryptocurrencies traded lower, though Binance’s BNB gained after the world’s biggest crypto exchange added the Sui blockchain to its Launchpool. Litecoin led the losers. U.S. equity futures traded flat to lower in Asia ahead of the Fed interest rate decision this week. All three major U.S. stock indexes logged gains for April.\n\nSee related article: Weekly Market Wrap: Bitcoin flirts with US$30,000, Ether regains US$1,900\n\nCrypto\n\nImage: Envato Elements\n\nBitcoin inched up 0.48% to US$29,309 in the 24 hours to 09:00 a.m. in Hong Kong, according to CoinMarketCap data, holding a weekly gain of 5.32%, after rising to as high as US$29,952 on Sunday.\n\nThe world’s largest cryptocurrency tested the lower US$27,000 line multiple times in April, but gained more than 4% for the month for the longest streak of monthly gains since March 2021. This could foreshadow a surge in 2023 that could send Bitcoin to US$105,000, according to a Bloomberg analyst report on Sunday.\n\nBitcoin could attract investment from global bond investors due to negative real rates and real returns, according to Jamie Coutts, a senior market structure analyst at Bloomberg Intelligence.\n\nEther dipped 0.81% to US$1,884, but was trading 0.34% higher for the week. The world’s second largest cryptocurrency gained over 5% for the month of April.\n\nBinance’s BNB jumped 5.56% to US$339.09, logging a weekly gain of 2.05%. Binance introduced Sui blockchain’s SUI token to its Launchpool on Monday, allowing Binance users to stake their BNB and TrueUSD (TUSD) to farm the recently launched SUI, whose price jumped over 20% in the past 24 hours.\n\nBNB also received a boost from Binance’s return to Japan. Sakura Exchange BitCoin (SEBC), a regulated crypto exchange platform in Japan that was acquired by Binance in November 2022, will end its domestic services by the end of May and start a new service under the name “Binance Japan” from June 2023, according to a notice by SEBC on Friday.\n\nStory continues\n\nLitecoin led the losers, falling 2.33% to US$88.67 but adding 1.56% for the week.\n\nThe total crypto market capitalization edged up 0.09% in the past 24 hours to US$1.20 trillion. The total trading volume over the last 24 hours rose 33.36% to US$32.79 billion.\n\nNFT\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index edged up 0.37% to 3,757.67 in the 24 hours to 9:00 a.m. in Hong Kong, but remained 0.55% lower for the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts. It is managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nMad Lads, a Solana-based NFT first minted on April 21, logged the largest seven-day sales volume across the market of over US$7.63 million, beating Bored Ape Yacht Club’s (BAYC) US$7.04 million, according to data from CryptoSlam. The floor price of the NFT was 63.75 SOL as of 09:30 a.m. in Hong Kong, almost 10 times higher than the first token minted at 6.9 SOL.\n\nBAYC, one of the biggest NFT collections by market cap, also saw a surge in sales volume in the past 24 hours, jumping 170.22% to US$1.05 million, the largest volume across the NFT market.\n\nEquities\n\nImage: Getty Images\n\nU.S. stock futures traded flat to lower as of 9:00 a.m. in Hong Kong. The Dow Jones Industrial Average futures inched down 0.03%. The S&P 500 futures and the Nasdaq Composite Index both dipped 0.04%.\n\n\n\nThe three indexes closed higher last Friday on strong earnings from Intel Corp. and Exxon Mobil Corp., and logged gains for both the week and the month of April, according to Reuters on Saturday.\n\nHowever, the stock market gains last week were overshadowed by worries about the banking industry. The share price of U.S.-based First Republic Bank plunged 43.20% on Friday after the lender reported a 40.8% drop in deposits, or around US$100 billion, since the start of the year. Regulators are preparing to take over and sell the embattled bank, with multiple large financial institutions having submitted bids, according to the Wall Street Journal on Monday, citing people familiar with the matter.\n\nMeanwhile in China, the world’s second-largest economy, the purchasing managers manufacturing index for April unexpectedly fell to 49.2 on month, missing expectations of a 51.4 gain, pointing to slower growth in the country, according to Reuters on Monday.\n\nThe Federal Reserve’s next move on interest rates is due on May 3. The Fed has repeatedly raised rates over the past year to bring inflation down to its target range of 2%. With U.S. inflation still trending at around 5%, analysts at the CME Group now expect an 85.5% chance the Fed will raise rates by 25 basis points this week.\n\nU.S. interest rates are currently between 4.75% to 5%, the highest since June 2006.\n\nSee related article: Coinbase says SEC’s legal threats punish transparency, undermine public listing process"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMzAvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLWV0aGVyLW9wZW4tYXNpYXMtdHJhZGluZy13ZWVrLWZsYXQv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNC8zMC9maXJzdC1tb3Zlci1hc2lhLWJpdGNvaW4tZXRoZXItb3Blbi1hc2lhcy10cmFkaW5nLXdlZWstZmxhdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Apr 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin, Ether Open Asia’s Trading Week Flat - CoinDesk",
        "content": "Something that really struck me arose from what Kate Brady, head of communications for Web3 at PepsiCo, said on stage. As you know, PepsiCo is a very mainstream American brand. It's not part of the crypto industry by any means, but it’s looking to get into Web3. And one of the things she said on stage was that she was being stymied in her work and PepsiCo has been stymied in its work by the lack of regulatory clarity, and I thought that was interesting because obviously this is something the industry says a lot that we need to do. There are guidelines from Washington, D.C., from lawmakers and from policymakers. And we think that that conversation or that that issue only affects people in the relatively small world of crypto."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9taW5lZmxhdGlvbi1jb3N0LXRvLW1pbmUtb25lLWJpdGNvaW4taW4tdGhlLXVzLXJpc2VzLWZyb20tNWstdG8tMTdrLWluLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Apr 2023 07:00:00 GMT",
        "title": "Mineflation: Cost to mine 1 Bitcoin in the US rises from $5K to $17K in a year - Cointelegraph",
        "content": "It now costs Bitcoin (BTC) miners at least $17,000 to produce one BTC in the United States versus the $5,000–10,000 range a year ago, according to Bitcoin mining data resources Hashrate Index and Luxor.\n\nBitcoin hash price has dropped 58% in a year\n\nUnsurprisingly, soaring electricity rates across U.S. states have contributed to rising Bitcoin mining costs.\n\nNotably, between January 2022 and January 2023, the commercial electricity tariff surged at an average of 10.71% per U.S. state, higher than the average Consumer Price Index surge of 6.4%.\n\nAverage industrial rate rise between January 2022 and 2023. Source: EIA/Hashrate Index/Luxor\n\nCoupled with Bitcoin’s downward performance in 2022, which saw a maximum drawdown from around $48,000 to below $15,000, it is evident that active miners generated consistent losses due to the increase in operational costs and lower returns.\n\nBut this changed in Q1 of 2023 as the miners’ hash price, or the U.S. dollar price per terahash per second per day (TH/s/d), rose 31% thanks to Bitcoin’s price recovery toward $30,000.\n\n“Bleak as the new year looked at the outset, the lowest day for hashprice on a USD basis in Q1 was January 1,” noted researchers at Hashrate Index, adding:\n\n“It was only up from there as a 70% rise resuscitated Bitcoin’s price over the quarter, and along with it, hashprice.“\n\nBitcoin hash price (in the dollar terms). Source: Hashrate Index/Luxor\n\nWhich state is cheapest, most expensive to mine Bitcoin in?\n\nNew Mexico emerged as the cheapest and, in turn, more profitable state for Bitcoin miners in Q1 at $16,850 to mint one BTC. On the other hand, Hawaii was the most expensive at around $114,590.\n\nRegionally, the south and the midwestern U.S. states are the most attractive for miners regarding electricity prices.\n\nPower cost to produce 1 BTC across U.S. states. Source: EIA/Hashrate Index/Luxor\n\nMore recently, some U.S. states, including Arkansas, Montana, Missouri, Mississippi and others, have taken concrete steps to protect crypto miners from excessive taxes and regulations. On the other hand, Texas has amended its utilities and tax codes, bolstering restrictions for crypto mining companies.\n\nEnergy deflation could boost miners’ profitability\n\nFurthermore, the researchers anticipate the Bitcoin mining margins to grow further based on the U.S. Energy Information Association’s (EIA) expectations of energy price deflation.\n\nRelated: Bitcoin advocates rally at Texas State Capitol to oppose bill cutting mining incentives\n\nFor instance, the agency expects the demand for electricity to drop by 1% in Q2, citing additional generation from renewable sources and cheaper natural gas prices. It further anticipates that natural gas prices will remain below $3 in 2023 vs. 2022’s $6.45 average.\n\nForecasts for wholesale electricity prices in the U.S. Source: Hashrate Index/Luxor/EIA\n\nBitcoin mining stocks shine\n\nLower operational costs could help otherwise cash-strapped Bitcoin mining companies survive in 2023. For example, the stock price of Core Scientific, an already bankrupt Bitcoin mining firm, has jumped over 450% year-to-date.\n\nSimilarly, the HI Crypto Mining Stock Index has soared more than 100% this year, showing a return of investor appetite for mining socks.\n\nBitcoin mining stocks performance in 2023. Source: Hashrate Index/Luxor/EIA\n\nHashrate Index researchers also stated:\n\n“If the bitcoin price was to increase by an additional 40% to reach $42k this year, most mining stocks would rise by more than 50% from today’s level, while the four-to-five biggest gainers would soar by more than 150%.“\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tZXRoZXJldW0tdG94aWMtbWF4aW1hbGlzbdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin And Ethereum Maximalism: Silly And Self-Defeating - Blockworks",
        "content": "Maximalism is one of the least attractive philosophies in crypto.\n\nIt’s the belief that any given blockchain is fit for all purposes, and that other blockchains are therefore inherently useless and of no value.\n\nThis is as dumb as it sounds.\n\nThe original maximalists were Bitcoiners, many of whom predate the era of smart contracts.\n\nAccording to Bitcoin maxis, the Bitcoin blockchain is capable of almost any functionality that later chains have added; or they assert, bizarrely, that any functionality not supported by the Bitcoin blockchain is not useful, and is therefore unnecessary.\n\nNever mind that Bitcoin is often slow, and somewhat expensive for everyday transactions.\n\nI’m a pretty big fan of Bitcoin. It has many strengths, not least the fact that it’s decentralized, secure, an excellent way to store value, and pretty much censorship-resistant. This makes it useful for all manner of things; some anticipated and desirable, some less so.\n\nI’m also a major admirer of Ethereum. It is also highly decentralized, and it has a fantastic community of developers and builders who have created thousands of useful and utterly new applications on Ethereum.\n\nIt’s also a little expensive, scaling it has involved a lot of compromises and a confusing array of solutions, its governance is tricky, and the manner of its launch made a few people who probably deserved it very rich (as well as a couple of folks who were just lucky enough to be in the room at the time).\n\nAnd I’m excited about lots of other foundational blockchains, some of which have features they don’t really share with Ethereum or Bitcoin, some of which are optimized for transaction cost, or volume, or some other metric.\n\nI try to imagine what it must be like to assert, contrary to logical analysis, that MY blockchain is the ONLY blockchain.\n\nAnd I guess it must be the equivalent of having just one tool in your garage, a drill, and wanting to use that drill for every home improvement project.\n\nHanging some drywall? Drill it! Repairing the stucco? Drill it! Fixing the plumbing? Drill it!\n\nOf course, we can’t necessarily have exactly the right tool for every single situation. Your car, for example, may be a compromise car.\n\nMaybe you own a Toyota Camry. It’s not designed to go extremely fast around corners. It wouldn’t be much good off-road. It doesn’t haul half a ton of lumber.\n\nEssentially the Camry is the Ethereum of cars. It does a bit of everything, which makes it a great solution for people who need their car to do a bit of everything.\n\nBut let’s say you need your blockchain to be very, very good at one thing.\n\nFor instance, you are designing for the billion or so gamers out there.\n\nGamers don’t want to pay little fees every time they mint an NFT achievement like clearing a level in record time, or collect an item they might use in a sequel.\n\nSo maybe you need a blockchain that has no fees.\n\nThat takes some pretty specialist design. Ethereum can’t, by its very nature, support that precise need.\n\nMaybe you need your blockchain to be more private, or more secure, or much faster, or infinitely scalable, or to support some novel quantum-resistant cryptography. There are lots of reasons you might be prepared to trade all the usefulness of Ethereum for something very, very specific to your needs.\n\nIn which case, maximalism is exposed as a fraud.\n\nSure, clever folks have figured out lots of workarounds to make Ethereum more useful. In much the same way that Toyota figured out a nicer set of features to appeal to the customer who orders the loaded Camry – a better stereo, a more powerful engine, quad exhaust tips (don’t get me started).\n\nBut a very nicely-equipped Camry is still not a Mercedes.\n\nNo matter how you slice it, Ethereum is a general use blockchain suitable for most general uses.\n\nIt is not the answer to every single real-life use case.\n\nWhich is why maximalism, in all its forms, no matter what blockchain the maximalist is maximizing, is an indication of a minimalist level of intellectual curiosity and honesty.\n\nNot to mention: We’re ostensibly all in this together, right? We all want roughly the same thing: A better way of doing things, for the betterment of our experience on this planet?\n\nWe get there by collaborating, cooperating, working to find the right tool for the right job. Not by screaming at each other for daring to suggest that a general-purpose blockchain may not fit every use case.\n\nEthereum is a great innovation, it has a wonderful community and almost endless uses. Bitcoin is a remarkable and world-changing accomplishment, one that has opened countless minds to new possibilities.\n\nNeither of them is perfect. And that’s okay.\n\nA version of this op-ed first appeared in Blockworks’ newsletter. Signup below.\n\nIllustration by Planet Crypto for Blockworks.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGVjcnlwdC5jby8xMzgzODUvdGhpcy13ZWVrLWluLWNvaW5zLWJpdGNvaW4taWNwLXNvbGFuYS1yYWxseS1yZWd1bGF0aW9u0gFWaHR0cHM6Ly9kZWNyeXB0LmNvLzEzODM4NS90aGlzLXdlZWstaW4tY29pbnMtYml0Y29pbi1pY3Atc29sYW5hLXJhbGx5LXJlZ3VsYXRpb24_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "This Week in Coins: Bitcoin, ICP and Solana Lead Small Market-Wide Rally - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThis week in coins. Illustration by Mitchell Preffer for Decrypt.\n\nMost of the top thirty cryptocurrencies by market capitalization have appreciated in value over the last seven days, with Bitcoin (BTC), Solana (SOL), and the Internet Computer Project (ICP) leading the rally.\n\nBitcoin is around 7.5% pricier than it was this time last weekend and trades for $29,295 as of this writing.\n\nAD\n\nAD\n\nOn Monday, the world’s favorite cryptocurrency slipped down to $27,500, but on Wednesday, it reclaimed $29,000 after another potential insolvency rocked the traditional finance world; shares in First Republic Bank fell 50% on Tuesday, a day after its latest quarterly report revealed a marked decline in deposits.\n\nFrom Bitcoin’s whitepaper onwards, crypto has been pitched to the world as an alternative to the banking system. So, when TradFi institutions are in trouble, investors often flock to crypto—as happened last month when news of Credit Suisse’s insolvency pumped Bitcoin’s price.\n\nBitcoin\n\nThe market’s second biggest cryptocurrency, Ethereum, only managed to add 2.7% to its value this week and currently trades for $1,906.\n\nThe biggest rallies among leading cryptocurrencies came from Solana, which grew 11% and is now worth $23.35, and ICP blew up 16.6% to change hands at $6.58.\n\nHolders of Cosmos Hub (ATOM) found their stashes increased this Saturday as the token rallied 8.5% over the week to trade at $11.68.\n\nRegulation\n\nThe glare from regulators’ headlamps has been intensifying recently as U.S. agencies like the Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC) continue to bring enforcement actions against the industry instead of new guidelines.\n\nAD\n\nAD\n\nOn Monday, Democrat and California lower house lawmaker Matt Haney introduced Assembly Bill 1229, a legal framework for Decentralized Autonomous Organizations (DAOs) that would change state legislation to enable DAOs to incorporate and pay taxes in California while providing better safeguards for Californians participating in the Web3 economy.\n\nThe bill already has support from crypto investment firm Andreessen Horowitz and the Crypto Council for Innovation.\n\nOn Tuesday, news broke on Twitter that Binance US had walked away from a deal to acquire the assets of crypto lender Voyager, one of the high-profile casualties stemming from Terra’s collapse last May. In a statement to Decrypt, the exchange cited “the hostile and uncertain regulatory climate in the United States” as the main factor behind the decision to ax the deal.\n\nOn Wednesday, reports emerged that Binance CEO Changpeng Zhao had hired lawyers to defend himself against multiple legal threats filed against him and his exchange by the SEC, the CFTC, and the Department of Justice.\n\nThat day, crypto-friendly Texas Senator Ted Cruz launched a diatribe against the idea of an American central bank digital currency (CBDC) during the Bitcoin Policy Summit.\n\nCBDCs are currently being researched by governments worldwide, including those of the U.S. and the EU. A CBDC is a stablecoin pegged to the local currency, and advocates say they would facilitate online payments while taking advantage of blockchain features like instant settlement and smart contracts. However, critics fear the result would lead to an increase in centralized control over our money, which goes against crypto's very ethos.\n\nCruz argued that U.S. leaders would use a CBDC “to destroy all value of Bitcoin, to destroy anonymity, to destroy decentralization.” He added: “The same people that want to see a CBDC, they hate Bitcoin, and they hate cash. Let's be clear; they don't like cash for exactly the reason I like cash because it is not subjected to centralized control that is not subject to constant surveillance. And so I hope we see growing resistance to a CBDC.”\n\nCBDC skepticism is prevalent in Republican circles. Last month Florida Governor Ron DeSantis and Ohio Representative Warren Davidson echoed Cruz’s sentiments.\n\nAD\n\nAD\n\nFinally, at a Bloomberg event on Thursday, Hong Kong's Securities and Futures Commission (SFC) CEO Julia Leung announced the special administrative region will launch its crypto licensing regime next month.\n\nThe new rules promise to let retail investors trade significant cryptocurrencies like Bitcoin (BTC) and Ethereum (ETH) with fewer restrictions from June 1."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9vaGlvLW1hbi1zdGVhbHMtNzEyLWJpdGNvaW4tMjExNzA5MDcyLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Apr 2023 07:00:00 GMT",
        "title": "Ohio Man Steals $21M in Bitcoin From Brother, Gets Four Years in Prison - Yahoo Finance",
        "content": "Gary James Harmon of Ohio was sentenced to four years and three months in prison for stealing 712 Bitcoin that belonged to his brother, the U.S. Department of Justice has announced.\n\nHarmon pleaded guilty to criminal charges in January, faced with one count each of wire fraud and obstruction of justice, carrying a maximum sentence of 40 years combined.\n\nThe 712 Bitcoin in question—worth over $21 million at today’s prices—was taken by Harmon after the arrest of his brother in February 2020. According to the Justice Department, the funds were worth around $4.8 million at the time they were taken.\n\nHarmon’s brother, Larry Dean Harmon, was arrested in February 2020 for operating a coin-mixing service called Helix, which processed over 350,000 Bitcoin between 2014 and 2017 and partnered with several darknet markets, the Justice Department said.\n\nFormer Coinbase Manager's Brother Gets 10-Month Sentence for Insider Trading\n\nLarry Dean Harmon later pleaded guilty to a money laundering conspiracy and charges associated with the improper transmission of money in 2021. In addition to criminal charges, Larry Dean Harmon was hit with a $60 million penalty by The Financial Crimes Enforcement Network (FinCEN), the first penalty levied again a Bitcoin mixer.\n\nAs part of that prosecution, law enforcement seized several assets, including a “cryptocurrency storage device” that couldn’t be accessed initially due to certain security features, the Justice Department said.\n\nGary James Harmon was able to “covertly” send himself 712 Bitcoins on the device by recreating Bitcoin wallets with his brother's credentials. Harmon then laundered the assets further, sending the freshly-taken bitcoin to two other online mixing services, authorities said.\n\nWhen he agreed to hand over assets that stemmed from the 712 Bitcoin he took illegally, he agreed to forfeit cryptocurrencies that included 17.4 million Dogecoin, around 647 Bitcoin, and just over 2 Ethereum—altogether valued in excess of $20 million by the Justice Department.\n\nStory continues\n\nFrom 'Bitcoin Billionaires' to SEC Charges: A Brief Crypto History of the Winklevoss Twins\n\nThough advocates of coin mixers have called them necessary tools for maintaining the privacy of crypto transactions, government officials have taken aim at the services, deriding them as crucial to hackers and other bad actors.\n\nCoin mixers obfuscate the source and destination of funds by grouping various transactions together. And last summer, the U.S. Treasury Department announced sanctions against the coin mixer Tornado Cash, essentially banning people in the U.S. from engaging with the application.\n\nThe Treasury Department said Tornado Cash was being used by the North Korean state-sponsored hacking organization, Lazarus Group. The move drew condemnation from politicians like Rep. Tom Emmer and the whistleblower Edward Snowden, who called it a “​​do or die” moment for crypto.\n\nNew ‘Sinbad’ Bitcoin Mixer Unmasked As Formerly Sanctioned Blender\n\nThe crypto policy non-profit Coin Center is currently suing the Treasury Department, accusing it of government overreach in blacklisting the tool. And though his trial is pending, a Dutch court recently ruled that a Tornado Cash developer named Alexey Pertsev could be released on bail after spending nine months in detention.\n\nPertsev noted his freedom on Twitter on Friday, wondering what had gone on in the crypto space since he was arrested last August."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9nb29kLWx1Y2stYmVhcnMtYml0Y29pbi10cmFkZXJzLWNsb3NlbHktd2F0Y2gtYXByaWwtY2xvc2Utd2l0aC1idGMtcHJpY2UtYXQtMjlr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Apr 2023 07:00:00 GMT",
        "title": "'Good luck bears' — Bitcoin traders closely watch April close with BTC price at $29K - Cointelegraph",
        "content": "Bitcoin (BTC) narrowed volatility on April 30 as the weekly and monthly candle closes loomed.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nTrader sees BTC price upside capped at $32,500\n\nData from Cointelegraph Markets Pro and TradingView tracked BTC/USD as it loitered just above $29,000 throughout the weekend.\n\nAfter unsettled price action earlier in the week, Bitcoin returned to sideways trading, with markets witnessing an eerie calm despite the potential for volatility thanks to lower weekend liquidity.\n\nAs such, traders were hopeful that no unwelcome surprises would greet the candle closes.\n\n“Nothing has changed,” popular trader Elizy summarized in part of a recent Twitter analysis of the three-day chart.\n\nElizy eyed a potential upside target of up to $32,500 in the event of a breakout, while the loss of a key trend line below spot price would be cause to “become really bearish.”\n\nBTC/USD annotated chart. Source: Elizy/Twitter\n\nFellow trader known as J focused on the monthly close, noting that BTC/USD now sat at a historically significant point based on behavior from throughout its current halving cycle.\n\n“On the monthly, we can see Bitcoin has rallied into the 2021 lows, which is a major resistance + supply area,” he summarized.\n\nAs part of the longer-term roadmap, the largest cryptocurrency should see “Chop + slightly down during May - Sep/Oct,” J added, before performance picks up.\n\nBTC/USD annotated chart. Source: J/Twitter\n\n“Good luck bears”\n\nWith little to work with on lower timeframes, others also resorted to examining strength on the weekly chart and higher.\n\nRelated: Bitcoin price holds $29K as US PCE data sparks 90% Fed rate hike bets\n\nAmong them was analyst Moustache, who noted support holding above key exponential moving averages (EMAs) like that which preceded major upside in previous years.\n\n“Imagine being bearish on BTC even though it has been forming support ABOVE the EMA ribbon bands for several weeks. Good luck bears,” he commented.\n\nBTC/USD annotated chart. Source: Moustache/Twitter\n\nLast week, Moustache argued that “smart money” had already built BTC positions and was now waiting for the real upside to kick in.\n\nAt the current spot price of $29,267, Bitcoin would go some way to cancel out the prior weekly candle losses were it to close without last-minute volatility.\n\nBTC/USD 1-week candle chart (Bitstamp). Source: TradingView\n\nMagazine: Whatever happened to EOS? Community shoots for unlikely comeback\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vZGVjcnlwdC5jby8xMzg0MzgvYml0Y29pbi10cmFuc2FjdGlvbnMtc29hci1hcy1vcmRpbmFscy1iYXJyZWxsLXBhc3QtMi01LW1pbGxpb24tbm90Y2gtZGFpbHktcmVjb3Jk0gFxaHR0cHM6Ly9kZWNyeXB0LmNvLzEzODQzOC9iaXRjb2luLXRyYW5zYWN0aW9ucy1zb2FyLWFzLW9yZGluYWxzLWJhcnJlbGwtcGFzdC0yLTUtbWlsbGlvbi1ub3RjaC1kYWlseS1yZWNvcmQ_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Transactions Soar as Ordinals Barrel Past 2.5 Million, Notch Daily Record - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nOrdinals notched a new record on Saturday as the protocol used for inscribing digital assets on Bitcoin—producing assets comparable to Ethereum-based NFTs—had its busiest day yet.\n\nThe daily number of inscriptions made through Ordinals on Saturday totaled around 223,000, according to a widely-used Dune dashboard. It marked the first time over 200,000 inscriptions were made in a single day and suggests the protocol is as popular as ever as it enters its fifth month since launch.\n\nIn April alone, the daily record for inscriptions made was shattered four other times. That included roughly 72,000 inscriptions on April 2 and 193,000 inscriptions on April 23, according to the Dune dashboard.\n\nAD\n\nAD\n\nAt the same time, the number of Bitcoin transactions neared levels not seen in several years, according to blockchain analytics firm IntoTheBlock. On Sunday, the firm said that the weekly average of daily Bitcoin transactions was around 396,000, its highest level since December 2017.\n\nThe 7-day average of daily Bitcoin transactions was at its highest this week since December 2017. The increasing number of daily transactions suggests growing active usage of the Bitcoin blockchain pic.twitter.com/zKWUM8Vw5P — IntoTheBlock (@intotheblock) April 30, 2023\n\nLooking at some of the latest inscriptions using ordinals.com, what once resembled a sea of images early on has morphed into a wall of text-based inscriptions. The tides began to shift last month as people discovered Ordinals could be used to create fungible tokens on Bitcoin, in a way that’s analogous to what one can do on Ethereum.\n\nThe trend was kicked off by a pseudonymous on-chain data enthusiast named Domo, who created the “BRC-20” token standard as an experiment. And as of Sunday, close to 6,900 tokens using the new-developed standard have been launched, including several meme tokens with multi-million dollar market caps, according to data from brc-20.io.\n\nNorth of 99.8% of the total inscriptions made on Saturday was text-based compared to just 272 image-based inscriptions, which represented 0.1% of the daily total. While not every text-based inscription is tied to fungible tokens, the ratio on Saturday represents a shift in Ordinals’ use compared to when the month began.\n\nAD\n\nAD\n\nWhen the daily record for inscriptions made was broken on April 4, text-based subscriptions accounted for only 86% of the daily total, while image-based ones made up nearly 13% at 9,273.\n\nAside from the creation of fungible tokens under the so-called BRC-20 standard, Ordinals is opening the door to activity on Bitcoin in other ways, such as the Sats Name (.sats) standard that resembles name services built on Ethereum.\n\nOn Friday, the self-described NFT Historian @LeonidasNFT recognized recent developments in the Ordinals space, saying that “ordinals protocol innovation on Bitcoin has been increasing exponentially.”\n\nOrdinals Inscriptions Rare Sats BRC-20 .sats None of these things existed 3 months ago. Ever since the release of the ordinals protocol innovation on Bitcoin has been increasing exponentially. 14 years in and we haven't even scratched the surface of what Bitcoin can do yet. — Leonidas.og (@LeonidasNFT) April 28, 2023\n\nThat same day, the account celebrated a separate milestone for Ordinals, as the total number of inscriptions crossed 2 million. Just a couple of days later, the total number of inscriptions is now over 2.5 million, according to the Dune dashboard.\n\n“It’s thrilling to see inscriptions growing the way they are,” Ordinals Project Communications Director Isabel Foxen Duke told Decrypt, “I’m concerned these numbers are inflated by a flood of inscription-generated BRC-20 tokens which are highly insecure and may pose a risk to retail investors.”\n\nIndeed, some projects that have quickly embraced the experimental token standard have encountered headwinds, such as UniSat Wallet. Shortly after the digital wallet project—which supports inscriptions and BRC-20 tokens—launched its own marketplace, the service was compromised “due to a vulnerability in [its] codebase.”\n\nA few hours ago, UniSat Marketplace, which just launched, experienced a large number of double-spend attacks due to a vulnerability in our codebase.\n\nDuring our testing last week, we simulated different approaches to double-spend attacks and made improvements and enhancements to… — UniSat Wallet - Store, Inscribe and Search. (@unisat_wallet) April 24, 2023\n\nAD\n\nAD\n\nUniSat Wallet indicated it will compensate users who were affected by the incident on Twitter, which it said had impacted 70 transactions. The project did not immediately respond to requests for comment from Decrypt.\n\nInscriptions are sometimes referred to colloquially as Bitcoin NFTs, but the process for creating inscriptions and how each one’s corresponding data is stored is distinct compared to digital assets that are created on blockchains like Ethereum or Solana.\n\nNFTs are unique digital tokens minted using smart contracts, where people interact with code that operates on decentralized protocols. They represent the ownership of an item, often digital art, and though it’s possible to store assets such as images on-chain using Ethereum or Solana, most NFTs point to an asset that is stored off-chain.\n\nlInstead of creating a token that’s entirely new, using Ordinals, people inscribe content like images or text to individual Satoshi, the smallest denomination that a Bitcoin can be divided into (1/100,000,000 BTC). And that content is stored directly and permanently on Bitcoin’s blockchain."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvdmlzYS1zdGFibGVjb2luLXBsYW4tZGVidHMtY2VpbGluZy1lZmZlY3Qtb24tYml0Y29pbi1wcmljZS1ob2RsZXJzLWRpZ2VzdC1hcHJpbC0yMy0yOS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Visa stablecoin plan, debt ceiling's effect on Bitcoin price: Hodler's Digest, April 23-29 - Cointelegraph",
        "content": "Top Stories This Week\n\nCircle launches cross-chain USDC transfer protocol\n\nCircle launched a cross-chain protocol that enables USDC transfers between the Ethereum and Avalanche blockchains. The protocol works by burning the selected amount of native USDC on the source chain, and minting an equivalent amount of new USDC on the intended destination chain. The protocol essentially makes USDC transfers between the two networks faster and more user-friendly, as prior to its launch, people had to use third-party bridges or a Circle partner to facilitate transfers between the two networks. Additional support for Solana and other blockchains will be added later in 2023.\n\nStablecoin payments: Visa shares plans for ‘ambitious’ crypto product\n\nCuy Sheffield, the head of crypto at Visa, announced a new cryptocurrency-related project, on April 24, focused on stablecoin payments. Details are sparse at this stage; however, Sheffiled shared a job listing relating to the project, with the description noting that the “Visa Crypto Team is building the next generation of products to facilitate commerce in everyone’s digital and mobile lives.” The job listing is seeking candidates with a good understanding of layer-1 and layer-2 solutions, alongside experience with writing smart contracts using the programming language Solidity, among other things.\n\nKraken asks San Francisco court to intervene against IRS demands\n\nCrypto exchange Kraken has fought back against the U.S. Internal Revenue Service (IRS) over what it feels is an “unjustified treasure hunt” for user’s trading info. According to court documents, the firm requested a federal court in San Francisco to intervene and ask the IRS to back off. The IRS issued a summons in February demanding additional information on Kraken users who traded $20,000 or more in any single year from 2016 to 2020.\n\nMeta disclosed in its Q1 earnings report that its metaverse unit, Reality Labs, posted a loss of around $4 billion during the quarter. In what has been a costly venture for the firm, the $4 billion loss adds to the $14 billion Reality Labs loss over the entirety of 2022. Still, Meta posted a profit totalling roughly $5.7 billion in Q1 overall, with the firm’s work on artificial intelligence somewhat curbing the losses. Mark Zuckerberg was also not phased by the loss from Reality Labs, as he reiterated that “we continue to expect Reality Labs operating losses to increase year-over-year in 2023” as the firm eyes growth in the long term.\n\nViral clips of Securities and Exchange Commision chair Gary Gensler started circulating this week, showing him take a highly contradictory stance on crypto compared to what he holds now. As it stands, Gensler thinks almost every crypto asset apart from BTC is a security, and has pushed hard to regulate the crypto sector from that viewpoint. However, in a snippet from one of his “Blockchain and Money” lectures from 2018 — while he was working as a professor at the Massachusetts Institute of Technology — Gensler said, “Three quarters of the market is non-securities, it’s just a commodity, cash, crypto.” He even suggested Ether was not a security, despite repeatedly suggesting otherwise over the past couple years.\n\nWinners and Losers\n\nAt the end of the week, Bitcoin (BTC) is at $29,275, Ether (ETH) at $1,900 and XRP at $0.47. The total market cap is at $1.2 trillion, according to CoinMarketCap.\n\nAmong the biggest 100 cryptocurrencies, the top three altcoin gainers of the week are Render Token (RNDR) at 40.91%, Cronos (CRO) at 13.47% and Injective (INJ) at 10.49%.\n\nThe top three altcoin losers of the week are PancakeSwap (CAKE) at 19.13%, Zilliqa (ZIL) at 12.41% and Optimism (OP) at 11.26%.\n\n\n\nFor more info on crypto prices, make sure to read Cointelegraph’s market analysis.\n\nMost Memorable Quotations\n\n\n\n“It’s a critical moment here in the U.S. and, as I like to say, it’s really a moment for Congress to step up.”\n\nJeremy Allaire, CEO of Circle\n\n“I think it’s probably not a coincidence that you’re seeing all these concerns about de-dollarization at the same time they’re cracking down on crypto.”\n\nDavid Sacks, co-host of the All-In podcast\n\n“[Blockchain] is about helping different groups of people come together to be able to trust each other more, to collaborate across larger distances on many different kinds of projects.”\n\nVitalik Buterin, Ethereum co-founder\n\n“The fights about mining aren’t really about mining. It’s not really about environmental concerns. What it’s really about is controlling energy use.”\n\nPerianne Boring, CEO of the Chamber of Digital Commerce\n\n“While DeFi has immense potential, more education is needed to quell the confusion and fear plaguing mainstream users.”\n\nJulian Hosp, CEO and co-founder of Cake DeFi\n\nPrediction of the Week\n\nAnalysts at odds over Fed, US debt ceiling impact on Bitcoin price\n\nAfter the House Republicans scarcely passed their bill to increase the U.S. debt ceiling on April 26, market analysts promptly started weighing up its potential impact on the price of Bitcoin (BTC). Analysts such as the chief operating officer of investment firm Onramp, Jesse Meyers, believe that raising the debt ceiling will likely prompt the Federal Reserve to print more money, thus boosting capital inflows into “risky” assets like BTC.\n\n“When the debt ceiling is lifted and credit-contraction leads to economic crisis… They will have to print money on a massive scale,” he noted. “#Bitcoin was the winner during the last round of stimulus.”\n\nFUD of the Week\n\nOrdinals Finance has conducted a $1M rug pull: CertiK\n\nEthereum-based decentralized finance protocol Ordinals Finance, was accused of performing a rug pull. The protocol enables users to lend and borrow inscriptions. However, blockchain security firm CertiK reported that the protocol’s developer abruptly pulled 256 million OFI tokens out of its smart contracts using a “safuToken” function. According to CertiK, another 13 million OFI was then removed through an “ownerRewithdraw” function, bringing the total number of withdrawn tokens to 269 million. In total, the reported loss to investors was estimated to be around $1 million, almost half of the total OFI market cap.\n\nOne crypto wallet launched 114 dodgy memecoins in two months\n\nAccording to research from pseudonymous blockchain sleuth ZachXBT posted, on April 26, one specific wallet address launched “114 memecoin scams” over the previous 45 days. ZachXBT tracked the 0x739c58807B99Cb274f6FD96B10194202b8EEfB47 address, and found that stolen funds from scams are continually sent to this address. ZachXBT was unable to calculate how much the funds equated to, as the alleged scammer used multiple wallets to split up funds. “I suspect there are more too. These are just ones sent to that deposit address lol,” ZachXBT wrote.\n\nGoogle Ads data: $4M stolen through crypto phishing URLs\n\nAccording to Google Ads data coupled with blockchain analytics, over $4 million has been stolen from people that clicked on malicious phishing websites that mimic legitimate crypto platforms. It marks a concerning trend for the crypto community, given that these dubious websites are promoted on Google search results and closely replicate real platforms.\n\nBest Cointelegraph Features\n\nWhatever happened to EOS? Community shoots for unlikely comeback\n\nEOS was the biggest ICO in history, but development did not live up to expectations. Now the community wants to take it back to the top ten.\n\nDistrict 9 director’s shooter, Decentraland red-light district battle: Web3 Gamer\n\nDecentraland’s District X dispute, showing “no mercy” to autoclickers, spending Sunday afternoon in a virtual Irish pub.\n\nElizabeth Warren wants the police at your door in 2024\n\nSenators Elizabeth Warren and Roger Marshall want to make your crypto wallet illegal — and their plan runs contrary to the principles they campaigned on."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWJ0Yy1pbnRlcmVzdC1pbi1vcmRpbmFscy1yaXNlcy1idXQtaXMtZnVkLW9uLXRoZS13YXkv0gFXaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2JpdGNvaW4tYnRjLWludGVyZXN0LWluLW9yZGluYWxzLXJpc2VzLWJ1dC1pcy1mdWQtb24tdGhlLXdheS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 29 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin [BTC]: Interest in Ordinals rises, but is FUD on the way? - AMBCrypto News",
        "content": "Interest in Bitcoin Ordinals continued to rise.\n\nFUD and Speculation around the U.S. government and Mt.GOX wallets impacted trader behavior.\n\nUpon their initial introduction, Bitcoin [BTC] inscriptions garnered considerable attention from the cryptocurrency community. This led to speculations that the hype would be short-lived and interest in ordinals would wane soon.\n\nIs your portfolio green? Check out the Bitcoin Profit Calculator\n\nOut of the Ordin(al)ry\n\nHowever, at press time, it appeared that inscriptions surpassed one million. This represented roughly 6% of the total activity on the Bitcoin network.\n\nConsequently, the fees associated with ordinals that are paid out to miners rose. This resulted in a decrease in the selling pressure on ordinals.\n\nDue to these factors, Bitcoin miners started seeing growth in terms of revenue generated over the last few days, according to blockchain.com\n\nSpeculations start to rise\n\nHowever, the FUD around Bitcoin could soon stunt this growth. Recently, there was speculation going around that large transactions were being made by the BTC wallets of the U.S. government and Mt.Gox trustees.\n\nFor context, Mt. Gox was once the largest Bitcoin exchange in the world before it filed for bankruptcy in 2014. The exchange suffered a massive security breach resulting in the loss of 850,000 bitcoin, worth around $460 million at the time.\n\nThe court appointed Nobuaki Kobayashi as the trustee to oversee the fair and transparent distribution of the remaining assets and funds to the exchange’s creditors.\n\nAdditionally, Kobayashi sold a significant amount of the remaining bitcoin over the years to pay back the creditors. He currently holds a substantial number of bitcoins which will be distributed to the claimants.\n\nMany stated that the FUD surrounding the government transactions has led to the recent decline in BTC prices.\n\nIt is to be noted that the U.S government was the largest holder of Bitcoin at press time. According to Glassnode’s data, the U.S. government and the Mt.Gox trustee held 205,514 and 137,890 BTC, respectively.\n\nBased on our labels at @glassnode, neither the USG, nor Mt Gox are spending any coins from addresses we monitor. Stay safe out there folks. https://t.co/1B8gUVKjon pic.twitter.com/O5CZ0VtrYh — _Checkɱate ?⚡?☢️?️ (@_Checkmatey_) April 26, 2023\n\nHow many are 1,10,100 BTCs worth today\n\nThis FUD also affected trader behavior as well. As the expiry date for 105,000 Bitcoin options draws near, GreeksLive’s data showed that these options have a Put Call Ratio of 0.85.\n\nFurthermore, this ratio suggested that there are more investors betting on a dip in Bitcoin’s price. The options also have a max pain point of $27,000, which is the price level where option holders would face the most significant financial loss. The estimated total value of these options was $3.1 billion."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYm9sZC5jb20vYmh1dGFuLWlzLXNpbGVudGx5LW1pbmluZy1iaXRjb2luLWZvci15ZWFycy1zaW5jZS1idGMtd2FzLTUwMDAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 30 Apr 2023 07:00:00 GMT",
        "title": "Bhutan is silently mining Bitcoin for years since BTC was $5,000 - Finbold - Finance in Bold",
        "content": "Bhutan’s largest and only government-owned holding company Druk Holding and Investments (DHI), has confirmed that it has been mining Bitcoin (BTC) for several years as part of its diversified portfolio.\n\nAccording to the company, its interest in Bitcoin mining began when the maiden cryptocurrency was valued at around $5,000, but it also has a slight interest in Ethereum (ETH), the local media outlet The Bhutanese reported on April 28.\n\nDHI officials assured that the risks associated with cryptocurrencies are mitigated, considering that the company is not involved in direct selling and buying digital assets. At the same time, DHI noted that the investment pays for itself by selling Bitcoin to cater for the mining operational costs.\n\nThe company clarified that the investment in Bitcoin mining is a strategic move rather than driven by the fear of missing out (FOMO) on the technology. As part of this strategy, DHI is assembling a team of experts in cryptocurrencies and harnessing the benefits of regulated cryptocurrency exchanges worldwide.\n\nFinbold initially reported that it emerged that the landlocked Himalayan country was secretly investing millions in Bitcoin alongside other digital assets. The investment revelations came to light following the bankruptcies of crypto lenders BlockFi and Celsius.\n\nSurplus of electricity\n\nThe mining operation is powered by Bhutan’s renewable energy source, which is generated through hydro projects. Notably, the country generates nearly 100% of its electricity from renewable sources, which produces a surplus of electricity, making it ideal for Bitcoin mining.\n\nThe venture into cryptocurrency mining is part of Bhutan’s efforts to spur economic growth, where technology is viewed as a key element.\n\n“Our portfolio contains investments across a range of asset classes that deliver exposure to traditional sectors and the industries driving the modern economy. This includes global equities, fixed income and venture capital investments in promising startups; domestic and international real estate; renewable energy including hydropower generation; healthtech, biotech, life sciences, and agritech; and digital asset mining and investment,” said a statement from DHI.\n\nFurthermore, DHI CEO Ujjwal Deep Dahal explained that the company had managed to repay all the loans borrowed from bankrupted crypto firms BlockFi and Celsius. He clarified that DHI did not suffer any financial losses compared to the cost of mining digital assets in Bhutan."
    }
]