[
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wNC8xNC9iaXRjb2luLXRoaWVmLWphbWVzLXpob25nLXNlbnRlbmNlZC10by1wcmlzb24v0gFRaHR0cHM6Ly9mb3J0dW5lLmNvbS8yMDIzLzA0LzE0L2JpdGNvaW4tdGhpZWYtamFtZXMtemhvbmctc2VudGVuY2VkLXRvLXByaXNvbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Theft of Bitcoin that topped $3 billion in value leads to one-year prison sentence for James Zhong: ‘I always knew what I did was wrong’ - Fortune",
        "content": "A Georgia man who stole more than 50,000 Bitcoin from the Silk Road drug-trafficking site before his cache hit $3.35 billion in value was ordered to serve a year and a day in prison.\n\nJames Zhong, 32, was sentenced Friday in New York federal court, where he pleaded guilty to wire fraud last year. At the time of the heist in 2012, the Bitcoin was worth $620,000. When authorities seized devices holding the stolen Bitcoin in November 2021, its value had exploded, making it the second-largest financial seizure in US history.\n\nBefore he was caught, Zhong spent $16 million of the proceeds on real estate investments, luxury hotels, nightclubs and Lamborghinis, prosecutors said. The value of the Bitcoin seized is now about $1.56 billion.\n\nUS District Judge Paul Gardephe cited the “highly sophisticated nature of the crime” and Zhong’s active concealment of the stolen Bitcoin for nine years until agents raided his house. Zhong faced between 27 and 33 months in prison under advisory guidelines, but Gardephe said he was granting leniency because of the “truly unique circumstances” in the case. Still, the judge said he also wanted to deter other criminals.\n\n“While the victim in this case happened to be a criminal enterprise, the victim tomorrow could be a legitimate business,” Gardephe said.\n\nProsecutors told the judge that Zhong should get prison because he covered up his theft for nearly a decade, moving the Bitcoin through so-called mixers that make it harder to trace transactions by jumbling tokens together. But they also said he should get less than two years in prison, citing his youth, his autism and his help in recovering the stolen crypto.\n\nSolace in Computer\n\nZhong’s lawyers asked the judge to spare him a prison term, saying he came from a dysfunctional family and received no love from his divorced parents, who were Chinese immigrants. He was “severely bullied and victimized by his peers because he was different — he was extremely shy, overweight, and most significantly, suffered from undiagnosed autism spectrum disorder,” Zhong’s lawyers said in court papers. “Having no friends or family he could turn to, Jimmy found solace and friendship in the world of his computer.”\n\nIn court, Zhong expressed “shame and remorse,” and told the judge, “I always knew what I did was wrong.”\n\nHe said he hid his crimes as Bitcoin soared in value.\n\n“I think I buried my head in the sand,” Zhong said. “It made me feel important and worth something.”\n\nZhong said that while some college friends have stuck by him, the one who’s been most supportive is his dog Chad, who is old and sick.\n\nIn their sentencing memo, Zhong’s lawyers argued that while he had no right to the stolen Bitcoin, neither did Silk Road. They said the marketplace isn’t a victim “in the true sense of the word” under the law, noting that Silk Road’s imprisoned founder, Ross Ulbricht, contacted Zhong and asked him how he took the cryptocurrency. But he never asked for it back — and sent more.\n\nAfter pleading guilty, Zhong agreed to forfeit $42.7 million as well as additional Bitcoin and property.\n\nThe heist began after Zhong had stored some Bitcoin on Silk Road, the online black market. When he double-clicked the withdrawal button by mistake, he got back twice as much as he put in. Over several days, he deposited more tokens and quickly withdrew them, double-clicking each time. Exploiting that glitch led him to more than 50,000 Bitcoin, each worth about $12 at the time.\n\nFederal agents seized 50,491 Bitcoin from Zhong’s lakefront home in Gainesville, Georgia, along with $661,900 in cash and gold and silver bars. Zhong stored the crypto on devices in a safe under floorboards and on a single-board computer stowed in a Cheetos popcorn tin in a closet. He later surrendered more than 1,000 additional Bitcoin.\n\nZhong attended the University of Georgia from 2008 to 2014, earning a bachelor’s degree in computer science and mining Bitcoin. He also drank excessively and used cocaine, according to a psychiatric examination report in his court file.\n\nHe converted some Bitcoin to $700,000 in cash, so he would have a “case full of money like in the movies,” the report said. “He hoped the visual appeal of the cash would impress a female into having sexual relations with him,” the report said. “He stated his plan did not work.”\n\nIn 2019, Zhong reported a burglary at his home his Athens, Georgia, saying someone had stolen a silver brief case with $400,000 in cash.\n\nThe case is USA v. James Zhong, 22-cr-00606, US District Court, Southern District of New York (Manhattan)."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzE0L2JpdGNvaW4tbWluZXItYml0ZGVlci1zdG9jay1zbHVtcHMtbmVhcmx5LTMwLWF0LXRyYWRpbmctZGVidXQv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDQvMTQvYml0Y29pbi1taW5lci1iaXRkZWVyLXN0b2NrLXNsdW1wcy1uZWFybHktMzAtYXQtdHJhZGluZy1kZWJ1dC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Bitdeer Stock Slumps Nearly 30% at Trading Debut - CoinDesk",
        "content": "The miner is going public at a better time than last year as market conditions have improved, with bitcoin passing the $30,000 mark and mining equities in many cases outperforming the digital asset in percentage growth. In the future the \"market will begin to shift from not only focusing on operators with the biggest scale, but also operators with the best unit economics,\" said investment bank Stifel Nicolaus's analyst Bill Papanastasiou."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDQvMTQvcG9kY2FzdHMvYml0Y29pbi1taW5pbmctYmVlZi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "The Price of Bitcoin Mining and More: The Week in Reporter Reads - The New York Times",
        "content": "Winter Storm Uri had knocked out power plants across Texas, leaving tens of thousands of homes in icy darkness. Meanwhile, in the husk of a onetime aluminum smelting plant an hour outside of Austin, row upon row of computers were using enough electricity to power about 6,500 homes as they raced to earn Bitcoin, the world’s largest cryptocurrency.\n\nThe New York Times has identified 34 such large-scale operations, known as Bitcoin mines, in the United States, all putting immense pressure on the power grid and most finding novel ways to profit from doing so. Their operations can create costs — including higher electricity bills and enormous carbon pollution — for everyone around them, most of whom have nothing to do with Bitcoin."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vbWFuLWdldHMtcHJpc29uLXRpbWUtYWZ0ZXItY2F1Z2h0LXN0b2xlbi1iaXRjb2luLTIwMjMtNNIBW2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vbWFuLWdldHMtcHJpc29uLXRpbWUtYWZ0ZXItY2F1Z2h0LXN0b2xlbi1iaXRjb2luLTIwMjMtND9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Man gets prison time after caught with $3.4 billion in stolen bitcoin - Business Insider",
        "content": "A man convicted of stealing about 50,000 bitcoins was sentenced Friday to a year in prison.\n\nWhen it was seized, the bitcoin haul was worth over $3.4 billion.\n\nProsecutors said the cryptocurrency was stolen from the Silk Road dark-web marketplace.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nA man who stored billions of dollars' worth of stolen cryptocurrency in an underground safe — and a Cheetos popcorn tin — was sentenced Friday to a year and a day in prison.\n\nAccording to federal prosecutors, James Zhong, 32, stole more than 50,000 bitcoins from the Silk Road marketplace, a place on the so-called dark web where people could buy illicit items such as pornography and drugs. Its founder, Ross Ulbricht, was sentenced in 2015 to life in prison without the possibility of parole after he was convicted of drug trafficking, money laundering, and hacking, among other charges.\n\nZhong was able to steal from the marketplace by creating multiple accounts and tricking Silk Road into releasing the bitcoin to his accounts, per the Department of Justice. He never actually purchased or sold anything on the website, according to a DOJ statement.\n\n\"Back in 2012, James Zhong committed wire fraud by stealing 50,000 Bitcoin from Silk Road, and for the next 10 years, he managed to conceal what he had done and how he obtained his fortune,\" US Attorney Damian Williams said in the statement.\n\nAdvertisement\n\nBut in November 2021, US authorities obtained a search warrant to search his home in Gainesville, Georgia. There, the DOJ says, investigators recovered more than 50,000 bitcoins, split between \"an underground floor safe and on a single-board computer that was submerged under blankets in a popcorn tin stored in a bathroom closet.\" Authorities also recovered at Zhong's home more than $660,000 in cash, as well as silver and gold bars.\n\nThe bitcoin was valued at $3.4 billion when it was seized and is now worth more than $1.5 billion, according to the DOJ.\n\nA photo shared by the department shows that the crypto tin originally contained Cheetos-brand popcorn in both Flamin' Hot and Cheddar flavors. According to media reports, the tin and its promise of \"2 favorites together\" was available exclusively at Walmart during the 2020 holiday season.\n\nHave a news tip? Email this reporter: cdavis@businessinsider.com"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9iaXRjb2luLWFuZC1jcnlwdG8tbWFyZ2luLXRyYWRpbmctZXhjaGFuZ2VzLWFuZC1ndWlkZS1mb3ItYmVnaW5uZXJzL9IBYWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9iaXRjb2luLWFuZC1jcnlwdG8tbWFyZ2luLXRyYWRpbmctZXhjaGFuZ2VzLWFuZC1ndWlkZS1mb3ItYmVnaW5uZXJzLz9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Margin Trading Guide & Best Exchanges (2023 Updated) - CryptoPotato",
        "content": "What if you could open trading positions with more funds than you actually had in your account? Imagine having $1,000 deposited but being able to effectively trade with $2,000, $3,000, or even $10,000.\n\nWell, that’s entirely possible on many cryptocurrency exchanges and it’s called margin or leveraged trading.\n\nWelcome to our how-to guide. In the following lines, you will learn what margin trading in Bitcoin and crypto is, how it works, top exchanges that enable margin trading, and most importantly – you will also learn some must-read tips before placing even the smallest margin position.\n\nQuick Navigation:\n\nWhat is Bitcoin Margin Trading?\n\nIn this guide, we will mostly focus on Bitcoin margin trading because BTC is the largest cryptocurrency by market cap with the most considerable trading volume across all exchanges. However, the rules and tips hereby discussed apply to all supported altcoins for margin trading, i.e. Ethereum (ETH), Ripple (XRP), Solana (SOL) and more.\n\nIn essence, crypto margin trading is a way of using funds provided by a third party – usually the exchange that you’re using.\n\nMargin trading amplifies the results of your trading in both ways – it can expand your profits, but it could also deepen your losses. This ability to multiply the trading results is what makes it very popular in low-volatility markets. Nevertheless, crypto margin trading is also very popular and enjoys a steady increase in its overall volume overtime.\n\nFor example, if we opened a Bitcoin margin position with a 2X leverage and Bitcoin had increased by 10%, then our position would have yielded 20% because of the 2X leverage. With no leverage, it would have been only a 10% ROI.\n\nMargin leverage can also be 25X and even higher, despite the risk, the same position as described above would have yielded 250% (instead of 10% with no leverage).\n\nBest Bitcoin & Crypto Margin Trading Exchanges\n\nHow Does Bitcoin Margin Trading Work?\n\nIn most cases, the user can borrow funds through the exchange, and these funds are either sourced by other users who earn interest or by the exchange itself.\n\nThis way, traders can increase their trading capital and open larger positions. The exchange doesn’t carry a lot of risks since every position has its liquidation price, which is based on the amount of borrowed margin.\n\nHow to Short Bitcoin and Other Cryptocurrencies?\n\nDo you want to have the option to make gains while the Bitcoin price is decreasing? With margin trading, it’s possible. A short position on Bitcoin basically means that you bet that the BTC price will decline.\n\nThe way it works is quite simple. In essence, you Bitcoin at current prices, sell it and then rebuy later when the price drops. It may be a bit confusing, so let’s make an example.\n\nLet’s imagine that Bitcoin is currently trading at $10,000, and you have $10,000 in your Binance margin account. Using this as collateral, you can borrow 2 BTC (for example) and sell it at current prices for $20,000. Now you have $10,000 of your own money and $20,000 of borrowed funds, and you have to repay 2 BTC to the exchange.\n\nYour plan goes as intended, and the price of BTC drops to $8,000. You decide it’s time to make some profits. You buy 2 BTC (because that’s how much you have to buy back) for $16,000. Remember that you sold them for $20,000. This means that after you repay your loan (of 2 BTC), you will have $4,000 more in your account – welcome, those are your profits. Of course, that assumes there are no fees, but it’s also only for simplification purposes.\n\nCross Margin vs. Isolated Margin\n\nOn many exchanges, such as Binance Futures, users can use cross-margin and isolated margin modes.\n\nThe difference between both is the margin balance used to avoid liquidation. If cross-margin is enabled, the entire margin balance is shared across open positions to prevent liquidations. This means the trader risks losing their entire margin account’s balance alongside any open positions in the event of a liquidation.\n\nIsolated margin refers to the balance that’s allocated to an individual position. This means that the trader can manage their risk on their individual positions by restricting the specific amount of margin that’s allocated to each one of them. If a position gets liquidated, it won’t affect the rest of the trader’s balance or their other open positions. It can also be adjusted individually.\n\nBitcoin Margin Trading Vs. Futures Trading\n\nMany people commonly mistake Bitcoin margin trading for futures trading, but there are fundamental differences to keep in mind. We will break it down into sections to better differentiate between both types of Bitcoin trading.\n\nMarkets\n\nWith Bitcoin margin trading, users place orders to buy or sell directly in the spot market. This essentially means that all orders are matched with those in the spot market. With Bitcoin futures, traders place orders to buy or sell contracts in the derivatives market – they do not share the same orderbook, therefore, come with different liquidity.\n\nLeverage\n\nWhen trading Bitcoin futures, users can take advantage of very high leverage that would depend on the exchange but usually reaches up to (or even higher than) 100x. With Bitcoin margin trading, users have access to an average between 3x and 10x, depending on the platform.\n\nTrading Fees\n\nSince Bitcoin margin trading and futures take place on entirely different markets, the fees associated with both are usually different. Margin trading usually follows the fees of the spot market, whereas futures trading has fees based on the derivatives market.\n\nMargin Trading Tips: Read Before Placing Orders\n\nSince margin trading is risky, it’s not recommended for beginners. Therefore, if you’re new to this type of trading, we’ve prepared a few must-read tips to help you along the way. Keep in mind that this type of trading carries an amplified risk of losing capital, and you should never trade with funds that you can’t afford to lose.\n\nAlways start trading with small amounts\n\nIs it your first day of margin trading? Even if it’s not, you should consider starting small. Get the necessary confidence and experience before jumping into the deep raging water of margin trading.\n\nDon’t go all in at once\n\nEven if you’re absolutely confident in your trading skills, it’s better to divide your positions into portions and create a ladder of prices. This way, you can reduce the risk while averaging down your entry price. The same is true for taking profit – you can set up a ladder to take profit on the way up.\n\nUnderstand fees and liquidations\n\nYou must always know how much you pay for fees and what type of fees you pay for.\n\nMargin trading comes with ongoing fees, so make sure they don’t end up eating up your entire profit or, even worse – your balance. The same is true for keeping tabs on your liquidation price – you must know that number in case the position starts approaching quicker than expected. This brings us to our next point.\n\nRisk management\n\nWhen trading on margin, set clear risk management rules and make sure to follow them. Don’t get greedy. Take into account the amount of money you are willing to risk, and always know that you can lose it entirely. Always use stop loss levels. This will prevent your entire stack from getting liquidated.\n\nPrice manipulations: short/long squeeze\n\nThe crypto markets remain, for large part, unregulated. It’s not out of the question to see the occasional short and long squeeze events, which also has to do with the current size of the market.\n\nWhen the number of short or long positions is high, it means that a market participant can squeeze these positions by creating an opposing price move, forcing these positions into liquidation, or hunting their stop-loss orders.\n\nMargin for short-term trading\n\nCryptocurrencies remain very volatile assets. Margin trading amplifies the risks associated with trading them even more. Therefore, try to make short-term (compared to spot trading or investment) margin trading positions and keep a constant look at them.\n\nMoreover, remember that you’re paying ongoing fees for the borrowed margin, and even though the daily fees could seem negligible in the short term, they can quickly start to add up.\n\nPay attention to the fundamentals\n\nMajor events that surround the space, such as Bitcoin ETF decisions, SEC regulations, exchanges going under, and so forth, can have a significant impact on the price of BTC.\n\nEven though traders tend to rely mostly on technical analysis, keep in mind that those events might have a critical impact on the market.\n\nUnder extreme volatility – don’t go away\n\nExtreme price fluctuations are not uncommon when trading Bitcoin and other cryptocurrencies, and they take place in both directions. The risk associated with margin trading is that these wicks will touch your liquidation price and wipe out your entire position. The higher your margin, the closer the liquidation price.\n\nCosts and Risks of Crypto Margin Trading\n\nEven though you are technically using borrowed funds, you can’t end up owing money to the platform, as this would create a huge risk for the exchange itself. Therefore, the most you can lose is what your balance. This event, should it happen, is commonly referred to as liquidation.\n\nThe liquidation price is the point where the exchange will force-close your position automatically. Let’s see an example.\n\nImagine you had 1,000 USDT, and you used that to borrow 1,000 USDT more. Then you use the combined 2,000 USDT to buy BTC. If BTC drops to a point where you would lose your borrowed margin (the 1,000 USDT that you borrowed), the position will close automatically. And since 1,000 is exactly 50% of 2,000, your liquidation price will be 50% below your entry price.\n\nThat’s why we aid that the higher the margin you borrowed is, the closer your liquidation price will be to the entry price. It’s effectively the same as using leverage when futures trading.\n\nAs mentioned above, the costs of keeping a margin position active also includes paying ongoing interest for the borrowed funds, as well as the fees for opening and closing the position with the exchange. Keep in mind that as the chance to earn more increases, so does the risk of losing more.\n\nWant to read more useful tips? Follow our 12 must-read crypto margin trading tips."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vbW9uZXkuY29tL3dhcnJlbi1idWZmZXR0LWJpdGNvaW4tYmFuay1mYWlsdXJlcy_SAUBodHRwczovL21vbmV5LmNvbS93YXJyZW4tYnVmZmV0dC1iaXRjb2luLWJhbmstZmFpbHVyZXMvP2FtcD10cnVl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Warren Buffett Says Bitcoin Is Just a 'Gambling Token' and Banks Are Making 'Dumb Decisions' - Money",
        "content": "Famed investor Warren Buffett says Americans should brace for more bank failures — but they shouldn’t worry about losing their deposits. He also has some (more) unkind things to say about bitcoin.\n\nIn a wide-ranging interview with CNBC on Wednesday, Buffett weighed in on the recent turmoil in the banking sector, which was sparked by the sudden collapse of Silicon Valley Bank (SVB) last month. While “we’re not through with bank failures,” the Berkshire Hathaway chairman and CEO said, “nobody is going to lose money on a deposit in a U.S. bank.”\n\nIn the aftermath of the collapse of SVB and Signature Bank a few days later, the federal government stepped in to guarantee that all deposits would be protected, even those beyond the Federal Deposit Insurance Corporation (FDIC)’s usual $250,000 limit.\n\nBuffett’s comments indicate that he believes the government will continue to protect depositors, even if the instability in the banking sector persists. “Dumb decisions” made by banks shouldn’t panic “the whole citizenry of the United States about something they don’t need to be panicked about,” he said.\n\nBut the same can’t be said for investors who own bank stocks — the government is “not gonna save the stockholder,” Buffett added.\n\nBuffett says bitcoin investments are like gambling\n\nBuffett also reiterated his stance on bitcoin, the most popular cryptocurrency. “It’s a gambling token,” he said of bitcoin on CNBC. “It doesn’t have any value, but that doesn’t stop people from wanting to play a roulette wheel.”\n\nThe acclaimed chairman and CEO of Berkshire Hathaway, known for being a brilliant and disciplined long-term investor, has been a steadfast critic of bitcoin and other cryptos. In the past, Buffett has described bitcoin as \"rat poison squared.\"\n\nCryptocurrencies saw a major rally in the first quarter of the year, with bitcoin prices rising more than 80% since January (though prices are still down more than 50% from their all-time highs in 2021). While it’s possible that those gains could continue, experts say rising interest rates and the recent banking crisis could weigh on prices moving forward.\n\nFinancial advisors generally recommend keeping only a very small portion of your portfolio — 5% or even less — in risky investments like digital currencies, if you do choose to invest. Because of how unpredictable and volatile digital assets can be, you should only invest what you are prepared to lose.\n\nMore from Money:\n\n6 Best Crypto Exchanges of April 2023\n\nBank Failures Explained: Answers to 6 Big Questions About What Happened and What's Next\n\nWhy Stocks Could Fall Again as Companies Start Reporting Earnings"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiO2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tZWNsaXBzZS1ldGhlcmV1bS1yZXR1cm5z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Set to Eclipse Ethereum's 5-year Returns - Blockworks",
        "content": "Bitcoin and ether are crypto’s blue chips. And much like tech giants Apple and Microsoft, they’ve attracted distinct and loyal communities, leading to a natural rivalry.\n\nBitcoin (BTC) and ether (ETH) are also increasingly correlated. In fact, they’re moving more in tandem than ever before.\n\nBut BTC is still the market leader. It commands almost half of the entire crypto capitalization, its dominance now at one-year highs. That’s still less than the 2018-2019 bear market, when bitcoin dominance was as high as 71%.\n\nETH meanwhile makes up nearly 20%, more than double what it was when the market bottomed last cycle. Comparing returns since Apr. 2018 shows bitcoin outstripping ether for most of that interim —- until May 2021.\n\nBitcoin was just coming down from reaching $60,000 for the first time, while ether was correcting after attempting to break $4,000. At that point, bitcoin had returned around 550% since the first inning of the previous bear market, going from $7,900 to nearly $51,000. Ether had just eclipsed bitcoin, having jumped more than 700%.\n\nBitcoin and ether are practically even over the past five years\n\nEther would hold onto that lead for practically the entire bull market and then some. Bitcoin has gained ground though, thanks to a falling ETH-to-BTC ratio (down 13.5% over the past year).\n\nBTC is now a whisker away from topping ETH over the past five years — the former returning 279% to the latter’s 289%.\n\nSimple charts like these suffer from a certain amount of time bias (the five-year returns may look completely different in another three months).\n\nStill, Bob Ras, co-founder of tokenized securities startup Sologenic, explained that the narrative has shifted somewhat when it comes to Bitcoin and Ethereum since the 2021 bull run.\n\n“There was so much strength behind the Ethereum ecosystem because of all the utility enabled by DeFi, NFTs, ENS and other applications,” Ras told Blockworks.\n\n“During the bull run, there were a lot more users around who were toying with various digital asset applications, and so it made sense for Ethereum to have been the key driver of growth.”\n\nThe three-year chart tells a different story: ETH has dominated BTC over the past three years (1,085% to 327%)\n\nBitcoin has performed less bad than ether\n\nThe macro situation has changed since the 2018 bull market, capped off by the recent US banking crisis.\n\nRas noted that the Federal Reserve will have to pivot away from its tightening policy soon, which could inject more liquidity into the market to prevent a credit crunch.\n\n“Bitcoin is now rivaling gold and other stores of value when it comes to hedging against these likely forthcoming liquidity injections, which will ultimately contribute to the debasement of the dollar and other fiat currencies,” Ras said.\n\n“BTC is the hardened, reliable asset right now. The narrative could shift again, of course, but it seems likely that the ETH/BTC ratio could trend downwards for some time — perhaps until the next bull market fully kicks in.”\n\nZooming in to just the past year shows where those ‘gains’ have been made\n\nBTC has outperformed ETH easily since April 2022, weeks before Terra would depeg, causing chaos for crypto. BTC is down almost 26% while ETH has fallen 37%.\n\nAlthough, it would be more accurate to say bitcoin has performed “less bad,” considering neither have boosted portfolios over the past year.\n\nZooming out to encompass all-time returns however, bitcoin blows ether out of the water.\n\nBitcoin has returned a pearl-clutching 4-billion percent since its earliest recorded price in late 2009 ($0.00076392).\n\nEther has “only” risen 66,544% since it first launched in 2015. Rookie numbers.\n\nSelect the log view to properly compare\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDQvMTMvd2FycmVuLWJ1ZmZldHQtYml0Y29pbi1nYW1ibGluZy10b2tlbi_SAVBodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA0LzEzL3dhcnJlbi1idWZmZXR0LWJpdGNvaW4tZ2FtYmxpbmctdG9rZW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Warren Buffett calls Bitcoin a ‘gambling token’ but doesn’t blame people for ‘wanting to play the roulette wheel’ - Fortune",
        "content": "Warren Buffett doesn’t see much value in Bitcoin, despite its recent price rise. The Berkshire Hathaway boss sympathizes, however, with people hoping to get rich quick off it. “Something like Bitcoin, it is a gambling token, and it doesn’t have any intrinsic value. But that doesn’t stop people from wanting to play the roulette wheel,” Buffett said during an appearance on CNBC’s Squawk Box on Wednesday.\n\nBitcoin was trading at more than $30,000 on Thursday, having started the year at below $17,000. But it’s still down considerably from its peak of nearly $69,000 in November 2021.\n\nIn mid-February, Mike Novogratz, CEO of crypto investment firm Galaxy Digital, noted the “FOMO building up” around Bitcoin, referring to the “fear of missing out.” At the time, Bitcoin was trading at just below $24,800, and Novogratz said he “wouldn’t be surprised” if it hit $30,000 by the end of March.\n\nThough Buffett didn’t mention FOMO, he said on Wednesday, “The urge to participate in something where it looks like easy money is a human instinct which has been unleashed. People love the idea of getting rich quick, and I don’t blame them…It’s so human, and once unleashed you can’t put it back in the bottle.”\n\nBuffett and Berkshire vice chairman Charlie Munger have a long record of bashing Bitcoin.\n\nIn 2018, Buffett said Bitcoin is “probably rat poison squared” at the Berkshire Hathaway 2018 shareholder meeting. He added on CNBC at the time, “When you’re buying nonproductive assets, all you’re counting on is the next person is going to pay you more because they’re even more excited about another next person coming along.”\n\nWhen he made those comments, Bitcoin was trading a bit lower than $10,000, far below the heights it would reach in the years ahead. But Buffett and Munger have been consistent in their criticism of the digital token.\n\nMunger, Buffett’s longtime right-hand man, has been especially harsh. In April last year, he said of Bitcoin, “It’s stupid because it’s still likely to go to zero,” and “it’s evil because it undermines the Federal Reserve System.” He also commended China for banning Bitcoin.\n\nAnd earlier this year, Munger called for the U.S. to ban cryptocurrencies altogether, saying in a different interview he was “not proud of my country” for allowing them to thrive.\n\nBut Bitcoin bulls continue to predict massive surges in the coin’s value. In February, ARK Invest CEO Cathie Wood, who is heavily invested in crypto, predicted Bitcoin would hit $1.48 million by 2030, up from her earlier $1 million forecast.\n\nOn the other hand, Mark Mobius, the billionaire cofounder of Mobius Capital Partners, predicted in December that Bitcoin would fall to $10,000 at some point this year."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTMvY29pbmRlc2staW5kaWNlcy11bnZlaWxzLWJpdGNvaW4tdHJlbmQtaW5kaWNhdG9yL9IBYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTMvY29pbmRlc2staW5kaWNlcy11bnZlaWxzLWJpdGNvaW4tdHJlbmQtaW5kaWNhdG9yL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "CoinDesk Indices Unveils Bitcoin Trend Indicator - CoinDesk",
        "content": "\"The BTI is for everyone,\" Baehr said. \"It's a simple way to get a feeling for price momentum in bitcoin. For advisers and asset managers, it's a powerful tool to build rules-based strategies that can help their clients navigate crypto seasons.\""
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTQvb25yYW1wLWxhdW5jaGVzLWZpcnN0LXNwb3QtYml0Y29pbi10cnVzdC13aXRoLW11bHRpLXBhcnR5LWN1c3RvZHkv0gFvaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wNC8xNC9vbnJhbXAtbGF1bmNoZXMtZmlyc3Qtc3BvdC1iaXRjb2luLXRydXN0LXdpdGgtbXVsdGktcGFydHktY3VzdG9keS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Onramp Launches Spot Bitcoin Trust With Multi-Party Custody - CoinDesk",
        "content": "When asked whether Onramp would need SEC approval to start the redemptions, and if so why the regulator would approve the plan, Tanguma responded: \"It does not require formal approval because bitcoin is a commodity as per the [Commodity Futures Trading Commission], not a security. With that, Onramp does plan to work with securities lawyers to get opinion letters in place to reduce the 12-month lock-up period for redemptions, and will work with all regulators to make sure Onramp stays compliant in all jurisdictions where it offers its services.\""
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNC8xNC9zd2VkZW4tZHJpdmVzLWZpbmFsLW5haWwtaW50by1pdHMtYml0Y29pbi1taW5pbmctaW5kdXN0cnktd2l0aC10YXgtaGlrZS_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDQvMTQvc3dlZGVuLWRyaXZlcy1maW5hbC1uYWlsLWludG8taXRzLWJpdGNvaW4tbWluaW5nLWluZHVzdHJ5LXdpdGgtdGF4LWhpa2UvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Sweden Drives Final Nail Into Its Bitcoin Mining Industry With Tax Hike - CoinDesk",
        "content": "Energy prices in Europe have spiked in the past year largely in part due to the war in Ukraine, driving out bitcoin miners. The northernmost regions of Norway and Sweden were some of the last areas where the industry was still profitable and operating – although the crowd had thinned out – as they offer an ideal environment for data centers; cool and home to cheap hydroelectricity."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTMvZXRoZXItcmFsbGllcy10by0yay1hZnRlci1zaGFuZ2hhaS11cGdyYWRlLW91dHNoaW5lcy1iaXRjb2luL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTMvZXRoZXItcmFsbGllcy10by0yay1hZnRlci1zaGFuZ2hhaS11cGdyYWRlLW91dHNoaW5lcy1iaXRjb2luL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Ether Tops $2K After Shanghai Upgrade, Outshines Bitcoin - CoinDesk",
        "content": "Overall the demand for unstaking ether has been moderate, as a sizable portion is currently held at a loss. The biggest unstaker so far has been Kraken, which is shutting down its staking service for U.S. users as part of a settlement with the Securities and Exchange Commission."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNC8xMy9sb25kb24tc3RvY2stZXhjaGFuZ2UtdW5pdC10by1jbGVhci1iaXRjb2luLWluZGV4LWZ1dHVyZXMtb3B0aW9ucy_SAXFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDQvMTMvbG9uZG9uLXN0b2NrLWV4Y2hhbmdlLXVuaXQtdG8tY2xlYXItYml0Y29pbi1pbmRleC1mdXR1cmVzLW9wdGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "London Stock Exchange Group Unit to Clear Bitcoin Index Futures, Options - CoinDesk",
        "content": "Clearinghouses offer a centralized venue in which to finalize trades that are agreed on an exchange. Since the 2008 financial crisis, they have been favored by regulators as a way to lessen the risk of separate bilateral deals among players such as investment banks."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90ZXNsYS1zZWxsaW5nLWJpdGNvaW4tbGFzdC15ZWFyLXR1cm5lZC1vdXQtdG8tYmUtYS01MDBtLW1pc3Rha2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Tesla selling Bitcoin last year turned out to be a $500M mistake - Cointelegraph",
        "content": "The price of Bitcoin (BTC) has grown by more than 50% since Tesla unveiled its approximately $1-billion BTC sales in July 2022. In other words, the Elon Musk-owned electric carmaker would have made an additional $500 million if it had waited until today to sell.\n\nAre Tesla’s Bitcoin trades profitable?\n\nTesla infamously dumped nearly $936 million of its total Bitcoin holdings in Q2 2022, accounting for 75% of its remaining reserves, to secure $64 million in profit. At the time, Bitcoin was trading about 70% lower than its record high of $69,000 in November 2021.\n\nBTC/USD monthly price chart featuring Tesla’s Bitcoin sales purchases and sales. Source: TradingView\n\nOriginally, Tesla purchased $1.5 billion worth of Bitcoin in February 2021 at an average price of $36,000. The company then sold BTC worth $272 million to boost its Q1 2021 accounting by $101 million.\n\nThe company has nevertheless held on to its remaining BTC as of Q4 2022 despite the price of Bitcoin sitting at bear-market lows of around $16,000 at the time. Today, Tesla holds 10,725 BTC worth around $330 million, almost 15% below the procurement value from February 2021.\n\nOverall, Tesla made roughly $165 million in profit from two separate Bitcoin sales. As of April 14, it sits atop an unrealized loss of around $56.6 million on its remaining BTC holdings, while its net profit to date sits at around $108 million.\n\nWill Tesla dump its remaining BTC holdings?\n\nInterestingly, Tesla’s previous Bitcoin sales came from weaker free cash flows. For instance, the Q1 2021’s BTC sale worth $272 million made up nearly 93% of Tesla’s free cash flows in the same quarter.\n\nTesla free cash flows performance by quarter. Source: Statista\n\nSimilarly, Tesla’s Bitcoin sales in Q2 2022 came as its free cash flows declined 73% versus the previous quarter. Both sales suggest that Musk relied on Bitcoin as a haven during Tesla’s cash crunch phases.\n\nThe Tesla CEO explained at the time that the sale was made to “prove liquidity of Bitcoin as an alternative to holding cash on a balance sheet.”\n\nMeanwhile, Wall Street analysts estimate that Tesla’s free cash flow in Q1 2023 could be nearly $2 billion, up 40% versus the previous quarter. This should reduce the chances of Tesla dumping any significant Bitcoin amount in the near term.\n\nMagazine: Bitcoin in Senegal: Why is this African country using BTC?\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzE0L2JpdGNvaW4taXMtdGhlLWJvcmluZy1vbGQtZ3JhbmRwYS1yaWdodC1ub3ctY29tcGFyZWQtdG8tZXRoZXItZGV4dGVyaXR5LWNhcGl0YWwtbWFuYWdlci1wYXJ0bmVyL9IBkAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzE0L2JpdGNvaW4taXMtdGhlLWJvcmluZy1vbGQtZ3JhbmRwYS1yaWdodC1ub3ctY29tcGFyZWQtdG8tZXRoZXItZGV4dGVyaXR5LWNhcGl0YWwtbWFuYWdlci1wYXJ0bmVyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Is the 'Boring, Old Grandpa' Right Now Compared to Ether: Dexterity Capital Manager Partner - CoinDesk",
        "content": "While the upgrade allows users to withdraw the ETH they’ve staked (as well as reducing fees and opening space on the blockchain for more transactions), Safai pointed out that “a lot of things are happening” with ether, including allegations from U.S. government officials who say it is a security and should be regulated as such."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tcmlzZS1ldGhlci0yMDAwLWVxdWl0aWVzLXJhbGx5L9IBQGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tcmlzZS1ldGhlci0yMDAwLWVxdWl0aWVzLXJhbGx5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin rises, Ether moves above US$2,000, U.S. equities rally - Forkast News",
        "content": "Bitcoin moved higher in the US$30,000 band in Friday morning trading in Asia amid strong gains among the top 10 non-stablecoin cryptocurrencies. Ethereum led the winners following the blockchain’s Shanghai hard fork this week, jumping almost 10% and breaching the US$2,000 mark for the first time since August 2022. U.S. equities rallied overnight on softer readings in the U.S. producer price index (PPI) and jobless claims, adding to optimism the Federal Reserve could soon end its year-long cycle of raising interest rates to curb inflation.\n\nSee related article: Musk’s Twitter partners with eToro to offer crypto and stocks to users\n\nFast facts\n\nBitcoin rose 2.54% to US$30,769 in the 24 hours to 09:00 a.m. in Hong Kong to post a weekly gain of 9.47%, according to CoinMarketCap data. The leading cryptocurrency has gained 83% so far this year as it seemed to rediscover a role as a hedge against inflation and recession and looks set to test US$31,000 as it moved within a couple of hundred dollars of that ceiling in later morning trading in Asia.\n\nBitcoin also found support after the London Stock Exchange Group plc. on Thursday said it had partnered with GFO-X – the UK’s first regulated and centrally cleared trading venue for digital asset derivatives – to provide the country’s first trading and clearing services for Bitcoin index derivatives, according to Reuters on Friday.\n\nEthereum jumped 9.97% to US$2,100, adding 11.66% for the week after the network’s Shanghai upgrade, which allows investors to withdraw their staked Ether for the first time. Etheruem holders have so far withdrawn around 215,000 staked Ether, while another 961,000 withdrawals are pending, according to data from Token Unlocks, which accounts for about 6% of the total staked Ether.\n\nEarlier speculation that the Shanghai upgrade may lead to a flood of selling and depress the price of the token isn’t panning out, Chen Zhuling, co-founder and CEO of crypto staking platform RockX, said in an interview on Thursday. Even if Ether are unstaked, it doesn’t necessarily mean that people are going to sell them, because they could also use it for other DeFi investments, he said.\n\nDogecoin jumped 6.25% to US$0.0885 to hold a weekly gain of 2.79%, after multi asset trading platform eToro announced on Thursday a partnership with Elon Musk’s Twitter to enable cryptocurrency and stock trading on the world’s leading social media platform.\n\nCardano rose 4.54% to US$0.4264, moving up 11.00% for the week. Cardano Foundation launched the alpha phase of Aiken on Thursday, an open-source smart contract language and toolchain that aims to simplify smart contract developments on the Cardano blockchain, according to the company.\n\nThe total crypto market capitalization rose 3.85% in the past 24 hours to US$1.28 trillion. The total trading volume over the last 24 hours edged down 0.05% to US$48.58 billion.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index added 0.82% to 4,017.62 in the 24 hours to 09:00 a.m. in Hong Kong, moving up 0.32% for the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day. It is managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nU.S. equities closed higher on Thursday after economic data pointed to a slowdown in inflation. The Dow Jones Industrial Average added 1.14%, the S&P 500 moved up 1.33%, and the Nasdaq Composite Index rose 1.99%.\n\nU.S. PPI in March rose but at a 2.7% pace, or lower than the expected 3% to mark the smallest increase since January 2021, according to Reuters on Thursday. U.S. weekly jobless claims also pointed to a slowing economy with the figure of 239,000, higher than analysts’ expectation of 235,000, according to a Bloomberg report.\n\nInvestor sentiment also got a lift from an unexpected surge in China exports in March, which jumped 14.8% from last year, well beyond the expectation of a 7% decrease, according to Reuters.\n\nU.S. interest rates are currently between 4.75% to 5%, the highest since June 2006, and analysts at the CME Group now see a 33.5% chance the Fed will not raise interest rates at its next meeting on May 3, while 66.5% predict a 25-basis-point rate hike, down from 70.4% on Thursday.\n\nU.S. stock futures traded mixed as of 9:00 a.m. in Hong Kong. The Dow Jones Industrial Average dipped 0.09%. The S&P 500 futures gained 0.05%. The Nasdaq Composite Index inched 0.02% higher.\n\nSee related article: Binance chief says unclear crypto regulation ‘the worst’"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzE0L2V0aGVyLW9wdGlvbnMtdHJhZGluZy12b2x1bWUtc3VycGFzc2VzLWJpdGNvaW4tYXMtc2hhbmdoYWktdXBncmFkZS1kcml2ZXMtZGVtYW5kLWZvci1idWxsaXNoLWJldHMv0gGSAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTQvZXRoZXItb3B0aW9ucy10cmFkaW5nLXZvbHVtZS1zdXJwYXNzZXMtYml0Y29pbi1hcy1zaGFuZ2hhaS11cGdyYWRlLWRyaXZlcy1kZW1hbmQtZm9yLWJ1bGxpc2gtYmV0cy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Ether Options Trading Volume Surpasses Bitcoin as Shanghai Upgrade Drives Demand for Bullish Bets - CoinDesk",
        "content": "The increased demand for ether calls is evident from the short-term and long-term options skew, which have flipped positive. The skew measures the spread between the implied volatility premium or prices for calls and puts."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LnBybmV3c3dpcmUuY29tL25ld3MtcmVsZWFzZXMvY29pbmRlc2staW5kaWNlcy1sYXVuY2hlcy10aGUtYml0Y29pbi10cmVuZC1pbmRpY2F0b3ItMzAxNzk2NDIwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "CoinDesk Indices Launches the Bitcoin Trend Indicator - PR Newswire",
        "content": "A daily signal which conveys the presence, direction, and strength of the current price trend of bitcoin\n\nNEW YORK, April 13, 2023 /PRNewswire/ -- CoinDesk Indices (CDI) , a subsidiary of CoinDesk and the leading provider of digital asset indices by AUM since 2014, today announced the launch of the Bitcoin Trend Indicator (BTI). The BTI is a daily signal which conveys the presence, direction and strength of the trend in the price of bitcoin using a purpose-built, non-discretionary algorithm.\n\nThe signal broadcasts one of five possible values, each corresponding to an indicated direction and strength of trend in the price of bitcoin. The BTI is calculated daily, and is derived from historical daily levels of the CoinDesk Bitcoin Price Index (XBX), using a non-discretionary methodology. It has been backtested over a five-year historical period using XBX data.\n\n\"We are excited to offer the Bitcoin Trend Indicator, which has been rigorously researched and constructed,\" said Andy Baehr, CFA, Managing Director at CoinDesk Indices. \"We designed the BTI to help identify trends in the price of bitcoin, assisting asset managers to create new dynamic products, and helping investors make better-informed allocation decisions over a long-term horizon.\"\n\nAsset managers and investors can utilize the BTI for long-only dynamic allocation strategies. The BTI's research-driven construction uses a widely utilized technique known as moving average crossovers to identify trends. This technique compares recent short-term price averages to recent long-term price averages. The BTI is designed to be implemented in systematic strategies that allocate between bitcoin and a risk-free asset. These strategies can help investors navigate long-term bitcoin drawdowns, reducing potential risks. CDI has observed that a hypothetical portfolio of bitcoin and risk-free cash informed by the BTI has reduced exposure during \"crypto winters\" while still participating in price uptrends.\n\nCDI's unparalleled experience base includes institutional-class indexing, structuring and research, delivering clarity to the digital asset economy through innovations like CoinDesk's Digital Asset Classification Standard (DACS) and the CoinDesk Market Index (CMI) . For more information on CDI's go-to-market expertise and the Bitcoin Trend Indicator, please visit coindeskmarkets.com/bti.\n\nAbout CoinDesk Indices\n\nCoinDesk Indices (CDI), a subsidiary of CoinDesk, has been the leading provider of digital asset indices by AUM since 2014. We are driven by precision, rigor, research and a desire to educate the marketplace and empower investors. CoinDesk, a media, events, data, and indices company, is the most influential and trusted platform for the global crypto ecosystem.\n\nPress Contacts\n\nCasey Craig, Global Head of Communications at CoinDesk\n\n[email protected]\n\nJConnelly\n\n[email protected]\n\nDisclaimer\n\nCoinDesk Indices, Inc. (\"CDI\") does not sponsor, endorse, sell, promote or manage any investment offered by any third party that seeks to provide an investment return based on the performance of any index, indicator or signal. CDI is neither an investment adviser nor a commodity trading adviser and makes no representation regarding the advisability of making an investment linked to any CDI index, indicator or signal. CDI does not act as a fiduciary. A decision to invest in any asset linked to a CDI index, indicator or signal should not be made in reliance on any of the statements set forth in this document or elsewhere by CDI. All content contained or used in any CDI index, indicator or signal (the \"Content\") is owned by CDI and/or its third-party data providers and licensors, unless stated otherwise by CDI. CDI does not guarantee the accuracy, completeness, timeliness, adequacy, validity or availability of any of the Content. CDI is not responsible for any errors or omissions, regardless of the cause, in the results obtained from the use of any of the Content. CDI does not assume any obligation to update the Content following publication in any form or format. © 2023 CoinDesk Indices, Inc. All rights reserved.\n\nSOURCE CoinDesk Indices"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91ay1mb3Jtcy1iaXRjb2luLXBvbGljeS1vcmctdG8tYm9vc3QtYnRjLWVkdWNhdGlvbi1hbmQtYWRvcHRpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "UK forms Bitcoin Policy org to boost BTC education and adoption - Cointelegraph",
        "content": "God save our gracious coin, and long live the coin. A team of entrepreneurs, environmentalists and Bitcoin (BTC) advocates have assembled to back Bitcoin in Britain.\n\nBitcoin Policy UK (BPUK) unites stakeholders, policymakers, environmentalists, tax specialists, Bitcoin experts and miners to “unlock the potential of Bitcoin” in Britain and explore how the decentralized currency’s burgeoning industry could benefit U.K. households, businesses and communities.\n\nBPUK’s primary objectives are to drive investment, generate and prepare students for the Bitcoin jobs of the future, raise awareness and education, and explore the use of wasted and stranded energy resources for Bitcoin mining.\n\nFreddie New, BPUK’s head of policy, told Cointelegraph that “the genesis of this project was the Bitcoin Collective Conference in Edinburgh” — the U.K.’s largest Bitcoin conference, taking place in fall 2022.\n\nBitcoin advocates Natalie Brunell, Lawrence Lepard, Greg Foss and Jeff Booth on stage at the Bitcoin Collective in 2022. Source: Bitcoin Collective\n\nNew told Cointelegraph that most of the team had been working on Bitcoin advocacy in one way or another before the conference, “but coming together like this will enable us to formalize these efforts and focus on three key related areas.” He continued:\n\n“Getting clear and correct information on Bitcoin to policymakers and regulators, highlighting the environmental and sustainability benefits of the mining industry, and collating and providing educational resources for the next generation of Bitcoiners.”\n\nSome of the advisers and board members are familiar to Cointelegraph readers. Author and journalist DecentraSuze, whose son recently introduced Bitcoin to the classroom, is a director, while Jordan Walker, co-founder of The Bitcoin Collective, and Mark Morton are advisers. Morton’s Bitcoin mining company, Scilling Digital Mining, was featured in a recent Cointelegraph mini-documentary:\n\nWalker told Cointelegraph that the BPUK is an important piece of the collective puzzle to drive Bitcoin education in the U.K.:\n\n“It’s time for the UK to step up when it comes to embracing new technologies such as Bitcoin, otherwise we risk getting left behind.”\n\nNew told Cointelegraph that the BPUK is not-for-profit. To operate, it hopes to raise funds through the community, tapping into the growing trend of funding projects with satoshis, or small amounts of BTC, via the Lightning Network, a layer-2 instant payment solution built atop Bitcoin.\n\nPart of the team’s mission is to locate and harness renewable, wasted or stranded energy across the U.K., New explained.\n\n“We’re working […] to identify potential sites for sustainable mining, and our aim is to develop some small mining installations to use as ‘proof-of-concept’ sites.\n\nHe continued with the plan: “We can then invite British policymakers to these sites so they can see mines in action and hopefully understand more about the industry’s potential to mitigate vented methane, provide demand response for renewable grids, or simply act as a customer for energy that is otherwise wasted.”\n\nThe bagpiper procession that brought the Bitcoin Collective conference to a close. Source: YouTube\n\nThe U.K. has burgeoning renewable energy sources but lacks in hash rate (a measure of the Bitcoin protocol’s security). According to the Cambridge Center for Alternative Finance, the U.K. supports 0.23% of the global monthly hash rate, compared with the United States’ 37.84%.\n\nThis is partly due to electricity costs in the U.K. exceeding those of the U.S. and Asia, but also due to Bitcoin mining awareness — or a lack thereof — in the U.K. Moreover, legacy media platforms have taken aim at the Bitcoin mining industry in recent years — the Guardian critiqued Bitcoin as “digital beef” instead of “digital gold.”\n\nA heat map of the monthly Bitcoin Mining hash rate. The U.K. is light orange, at 0.23%. Source: CCAF\n\nBPUK highlighted that in light of the U.K.’s departure from the European Union, it could develop a Bitcoin and cryptocurrency regime separate from that of the Markets in Crypto-Assets (MiCA) regulation in Europe. The European parliamentary committee on MiCA may threaten Bitcoin mining on the continent.\n\nBPUK co-founder Krista Edmunds took inspiration from El Salvador’s decision to adopt Bitcoin as legal tender in 2021. Edmunds explained:\n\n“The U.K. has an immense opportunity to become one of the first jurisdictions globally to embrace Bitcoin. We have seen what is possible in El Salvador, which is experiencing huge gains due to its forward-thinking approach to Bitcoin. The U.K. can secure a similar competitive advantage, and we hope to support the British people in making that happen.”\n\nOn the governmental side, the policy group will have an opportunity to educate and inform. Lisa Cameron, a member of Parliament and chairperson of the Crypto and Digital Assets All-Party Parliamentary Group (APPG), told Cointelegraph in an interview last year: “We are on a learning curve, and it’s just very, very important because the U.K. government has a policy vision that the U.K. will become an international hub of cryptocurrency and digital assets.” She added that there was some confusion surrounding Bitcoin, central bank digital currencies and cryptocurrency.\n\nCointelegraph's Joe Hall speaks to MP Lisa Cameron in Edinburgh.\n\nNew explained that as a Bitcoin-only organization, the BPUK ultimately seeks to “make sure that Bitcoin is included in the government’s proposals, if not at the front and center.\""
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yaXNlcy1hYm92ZS0zMDcwMC1ldGhlcmV1bS1jYXJkYW5vLWp1bXAtdXAtdG8tMTEvYXJ0aWNsZXNob3cvOTk0ODQwMzMuY21z0gGbAWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS1iaXRjb2luLXJpc2VzLWFib3ZlLTMwNzAwLWV0aGVyZXVtLWNhcmRhbm8tanVtcC11cC10by0xMS9hbXBfYXJ0aWNsZXNob3cvOTk0ODQwMzMuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin rises above $30,700; Ethereum, Cardano jump up to 11% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading higher on Friday with an increase of over 4% in the crypto market cap in the last 24 hours. Bitcoin (BTC) rose 2.30% to $30,786, whereas Ethereum (ETH) surged 10.5%, and was above the $2,100 level.\"Rising by over 10% in the past 24 hours, ETH is trading in the $2.1k zone despite some fearing a massive dump after the Shapella upgrade. BTC is also on the rise to chase the $31k mark. The crypto fear and greed index have jumped 7 points to regain the scoring for 68, hinting towards increasing investor confidence,\" Parth Chaturvedi, Crypto Ecosystem Lead at CoinSwitch, said.Other top crypto tokens were also trading higher on Friday. Dogecoin jumped nearly 9%. Meanwhile, BNB , XRP, Litecoin , Solana and Cardano also traded with gains. The global cryptocurrency market cap was trading higher around $1.28 trillion, rising 4.25% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $595 billion. Bitcoin’s dominance is currently 46.30%, a decrease of 0.95% over the day, according to CoinMarketCap.\"Bitcoin surged above the US$30,800 level in the past 24 hours as crypto markets continued to react to the latest US inflation report. The support for BTC is located at the US$30,400 level, while resistance lies at the US$30,800 level,\" Edul Patel, Co-founder and CEO at Mudrex, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 71, with a neutral outlook. The Stochastic %K (14, 3, 3) indicates “Sell” at 88 and the Average Directional Index (14) indicates a Neutral outlook at 39.\"The MACD Level (12, 26), at 1097, indicates Buy. The Stochastic RSI Fast (3, 3, 14, 14) indicates Sell at 86 and William's Percentage is Sell at −9 as well,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 10.54 hours, IST on April 14, 2023)Bitcoin $30,780 2.34%Ethereum $2,117 10.52%Tether $1.00 0.01%BNB $334 4.82%XRP $0.5247 3.79%Cardano $0.4414 8.49%Dogecoin $0.09086 9.12%Polygon $1.18 6.97%Solana $25.32 5.60%Polkadot $6.79 5.81%Shiba Inu $0.00001139 4.18%Litecoin $98.24 6.28%Tron $0.0665 2.31%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9jb2luZGVzay1pbmRpY2VzLWxhdW5jaGVzLWJpdGNvaW4tdHJlbmQtaW5kaWNhdG9yL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Coindesk Indices Launches Bitcoin Trend Indicator | Video - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to coindesk.consensus.com to register and buy your pass now."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMTMvYml0Y29pbi1taW5lci1zdG9ja3MtY29udGludWUtdG9ycmlkLXJ1bi1hcy0zMGstbGV2ZWwtaG9sZHMv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNC8xMy9iaXRjb2luLW1pbmVyLXN0b2Nrcy1jb250aW51ZS10b3JyaWQtcnVuLWFzLTMway1sZXZlbC1ob2xkcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Miner Stocks Continue Torrid Run as $30K Level Holds - CoinDesk",
        "content": "Helping the bullish outlook for bitcoin miners is the idea that both inflation and the jobs market are cooling, which could give room for the U.S. Federal Reserve to pause or even reverse its year-plus long string of interest rate hikes. Earlier Thursday morning, the producer price index (PPI) for March tumbled to 2.7% year over year versus February's 4.9% and against expectations for 3%. The core PPI – which strips out food and energy costs – fell to 3.4% from 4.5%."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMTQvcGV3LWNyeXB0by10cmFkZXJzLXNheS1pbnZlc3RtZW50cy1wZXJmb3JtZWQtd29yc2UtdGhhbi1leHBlY3RlZC5odG1s0gFpaHR0cHM6Ly93d3cuY25iYy5jb20vYW1wLzIwMjMvMDQvMTQvcGV3LWNyeXB0by10cmFkZXJzLXNheS1pbnZlc3RtZW50cy1wZXJmb3JtZWQtd29yc2UtdGhhbi1leHBlY3RlZC5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "75% of Americans don't trust crypto—and nearly half of traders say their investments have performed worse than expected - CNBC",
        "content": "Americans don't have a lot of faith in cryptocurrency. Around 75% of those who are familiar with crypto say they aren't confident that the current ways to invest in, trade or use cryptocurrency are reliable and safe, according to Pew Research Center's April survey of 10,071 people ages 18 and older living in the U.S.\n\nAbout 18% say they're somewhat confident, but just 6% feel extremely or very confident, the survey found.\n\nConfidence varies by age as well. About 66% of U.S. adults under 50 who are familiar with crypto aren't confident in its reliability and safety, the survey found. For those over 50, that number rises to 85%.\n\nWhat's more, American crypto traders feel their investments haven't performed as well as they had hoped, according to Pew's survey.\n\nAbout 45% of respondents say their investments have actually done worse than they expected. While 30% say their investments have performed as expected, only 15% say their investments have performed better than anticipated."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hLXJlY2Vzc2lvbi1pcy1jb21pbmctaGVyZS1zLWhvdy1pdC1zLWZ1ZWxpbmctYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "A recession is coming — Here's how it's fueling Bitcoin - Cointelegraph",
        "content": "The show Macro Markets, hosted by crypto analyst Marcel Pechman, which airs every Friday on the Cointelegraph Markets & Research YouTube channel, explains complex concepts in layman’s terms and focuses on the cause and effect of traditional financial events on the day-to-day crypto activity.\n\nThe International Monetary Fund (IMF) and the United States Federal Reserve foresee an impending economic recession, which is the topic of today’s episode by crypto analyst Pechman. The video explains how the U.S.’s record-low unemployment rate could be hiding a bigger issue caused by inflation.\n\nPechman explains that the S&P 500 being only 13% below its all-time high has been driven by investors moving away from fixed income and why inflation is no longer a primary concern. Finally, there’s the link between the banking crisis, a weaker U.S. dollar and Bitcoin’s recent rally above $30,000.\n\nThe next segment of Macro Markets focuses on the bank’s leverage ratio. There’s a growing concern that financial institutions are lacking the capital to cover their risks, but that’s not what the most recent data has shown. The culprit, in Pechman’s view, is unrealized losses. Basically, banks are holding debt instruments that are paying way below their cost of capital.\n\nIf you are looking for exclusive and valuable content provided by leading crypto analysts and experts, make sure to subscribe to the Cointelegraph Markets & Research YouTube channel. Join us at Macro Markets every Friday."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9icmlhbi1hcm1zdHJvbmctb3dlcy1tZS0xMDAtaW4tYml0Y29pbi1oZXJlLXMtd2h50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Brian Armstrong promised me $100 in Bitcoin — so where is it? - Cointelegraph",
        "content": "Coinbase CEO Brian Armstrong owes me $100. That’s because he might not know how to use the Lightning Network, the instant payment solution built on top of Bitcoin.\n\nArmstrong, who’s been building in the Bitcoin (BTC) space since 2012, recently tweeted that he would pay people who provided the “best examples” of people using cryptocurrency in Africa. “If you’re using crypto in Africa, reply with a short video (<30 seconds) or photo of how you’re using it,” Armstrong wrote. “Best few examples get $100 in crypto.”\n\nIf you're using crypto in Africa, reply with a short video (<30 seconds) or photo of how you're using it. Best few examples get $100 in crypto. Use hashtag #CryptoAfrica\n\n\n\nAnd if you haven't already, try out self-custodial Coinbase Wallet - send feedback https://t.co/zWvaH1nerF — Brian Armstrong (@brian_armstrong) April 7, 2023\n\nThis is the CEO of Coinbase, after all, so I shared a video of myself using Bitcoin in Africa, which was part of a 30-second segment of a recent Cointelegraph documentary covering Bitcoin in Senegal.\n\nThe tweet quickly became the most-liked and most-shared response to Armstrong’s query. (Crucially, the tweet referred to Bitcoin in Africa, not crypto in Africa, and it demonstrated the ease and speed of the Lightning Network.)\n\nHowever, Armstrong appears to have ignored my submission, despite more than 600 likes and 100 retweets. The next most popular submission had just 50 likes. So, I reached out to some key opinion leaders, creators and influencers within the Bitcoin community to amplify the tweet. Wicked, an anonymous Bitcoin educator and data analyst, tagged Armstrong in a post, accusing him of “actively ignoring the #Bitcoin Lightning Network.”\n\nMy tweets auto-delete after some number of months, so there is no search history.\n\n\n\nLightning is great and something we’ll integrate. — Brian Armstrong (@brian_armstrong) April 8, 2023\n\nWicked very kindly drew Brian’s attention to my tweet video about Bitcoin in Africa. The tweet, and Armstrong's affirmation that \"Lightning is great and something we'll integrate,\" led to news outlets around the world reporting on Coinbase's next development. He then also tweeted that he had sent me the money.\n\nAwesome! sent $100 to joe@coincorner.io\n\n\n\ncheers — Brian Armstrong (@brian_armstrong) April 8, 2023\n\nHere’s where things get weird. Armstrong said he paid me the $100. He said he sent $100 to the Lightning address shown in my Twitter profile bio: Joe@Coincorner.io\n\nNow, if you’ve never used the Lightning Network before, you’d be forgiven for confusing this address with an email address. But would the CEO of Coinbase make that mistake? Could the Bitcoin OG have failed to recognize that the request in my bio — which says “Send BTC to Joe@Coincorner.io,” surrounded by lightning bolt emojis — could be my Lightning address?\n\nSide note: Running a Bitcoin node is mildly technical, and sending money on the Bitcoin blockchain for the first time is a little nerve-wracking, as the transaction takes roughly 10 minutes to confirm and we live in an instant world. But using the Lightning Network in 2023? It’s brain-dead easy. A walk in the park. Seriously.\n\n“That’s a big call, Joe,” I hear you say.\n\nYep, it is. And I’ve got the receipts to prove it. It’s so easy to use the Lightning Network that I stand in the street in locations worldwide giving out Bitcoin to people on their brand-new Lightning wallets — and I film their reactions.\n\nThe most common remarks are “I didn’t know it’s so easy” and “Wow, it’s so fast.” The videos are on my YouTube channel. Here’s a video shot in France for the Cointelegraph YouTube channel where I give out Bitcoin:\n\nSo, please — let’s not pretend that Armstrong is overwhelmed by the complexity of sending money to my Lightning address. Moreover, funnily enough, Bitcoin advocates worldwide saw my tweet and took pleasure in sending me sats to show that my Lightning address is alive and well.\n\nMy phone blowing up with payment notifications.\n\nBack to the story. Danny Scott, CEO of CoinCorner — a Bitcoin and Lightning company — was quick to point out to Armstrong on Twitter that he might have made a mistake in confusing Bitcoin and email, as Coinbase provides a “send to email” function.\n\nRelated: Ethereum's Shanghai fork is coming, but it doesn’t mean investors should dump ETH\n\nScott told Cointelegraph in an email, “Obviously, we know the address [that Joe shared] is a Lightning address, but clearly not everybody does.”\n\n“So my guess is Brian knows very little about Lightning right now, in particular LNURL, Lightning addresses and other innovations being built out, which is perfectly fine, he's distracted, it happens, now we just hope he helps himself and the industry by turning their attention to what really has substance and long term value, Bitcoin and Lightning.”\n\nIt’s true: Coinbase offers trading for more than 250 different cryptocurrencies — that’s a lot of tokens to keep one’s eye on. And as Scott adds, “I can appreciate how busy he will be — this industry doesn’t sleep, and running a Bitcoin company myself, I know that feeling even at a smaller scale.”\n\nTo give Brian and ultimately Coinbase the benefit of the doubt, I waited a few days before writing this article. I have tweeted repeatedly at Brian (no reply) and I also reached out to the Coinbase Press Team. They told me that they would get to the bottom of it, but “My guess is that Brian is likely batching the sends at certain times.\" A day has passed since this message (more doubt-benefit-giving) and they’ve not sent an explanation.\n\nRelated: Coinbase wins $470K restitution in insider trading case\n\nThe press team email was particularly left-field as it referred to “batching.” Batching is consolidating multiple payments into a single transaction on the Bitcoin blockchain, not the layer-2 Lightning Network. Again, they’re not familiar with Lightning. This adds further insult to injury: Could it be that the Lightning Network simply isn’t on Coinbase’s radar?\n\nIt’s been three days since Armstrong said he would send the money, and there have been some simply wonderful memes from the Bitcoin and wider crypto community.\n\nBrian the \"LN Maxi\" trying to blend in. Source: @Corndalorian\n\nArmstrong has been active on Twitter, while his company is busy launching new projects and winning insider trading cases for the over 250-plus crypto projects Coinbase hosts.\n\nMeanwhile, I’m still waiting for my $100. But I’m also increasingly alarmed that the billionaire, crypto OG and Coinbase CEO Armstrong struggled to spot a Lightning address.\n\nJoe Hall joined Cointelegraph as a reporter in 2021. He holds an MA in French and Spanish from the University of Edinburgh and a BA in languages from Sciences Po Lyon.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LnRoZWJsb2NrLmNvL3Bvc3QvMjI2NTM0L3NpbGstcm9hZC1oYWNrZXItc2VudGVuY2Vk0gFCaHR0cHM6Ly93d3cudGhlYmxvY2suY28vYW1wL3Bvc3QvMjI2NTM0L3NpbGstcm9hZC1oYWNrZXItc2VudGVuY2Vk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Silk Road hacker sentenced for multibillion dollar bitcoin fraud - The Block",
        "content": "Prosecutors have secured another prison term in connection with the infamous darknet marketplace Silk Road, though this time the person serving a sentence was convicted of stealing from the website.\n\nJames Zhong, 32, of Gainesville, Ga., stole over 50,000 bitcoin from the Ross Ulbricht-run marketplace by using nine accounts to create rapid transactions that tricked the illicit marketplace’s withdrawal processing system. He pleaded guilty to one count of wire fraud and was sentenced to one year and one day in prison.\n\nThe incidents occurred between 2011 and 2013, when bitcoin held far less value. The original cryptocurrency ended 2013 at less than $800 per coin, far less than its current market price of approximately $30,000. Authorities raided Zhong’s home on Nov. 9, 2021, close to the time when bitcoin reached its highest ever value of nearly $69,000. Zhong became a multibillionaire due to the market appreciation.\n\nAt the time federal authorities took control of the bitcoin, both in the initial seizure and two voluntary forfeitures after Zhong’s arrest, the tokens in total were worth $3.4 billion. They were still worth over $1.57 billion at the time of his sentencing.\n\nSilk Road's flaw\n\nIn one instance Zhong deposited 500 bitcoin into a wallet and within five seconds executed five withdrawals, exploiting a flaw in Silk Road’s payment system that turned his initial deposit into 2,500 bitcoin, according to the U.S. Justice Department.\n\nTHE SCOOP Keep up with the latest news, trends, charts and views on crypto and DeFi with a new biweekly newsletter from The Block's Frank Chaparro By signing-up you agree to our Terms of Service and Privacy Policy EMAIL Also receive The Daily and our weekly Data & Insights newsletters - both are FREE By signing-up you agree to our Terms of Service and Privacy Policy\n\nZhong also received over 50,000 in bitcoin cash following the 2017 hard fork split between bitcoin and bitcoin cash’s blockchains.\n\nFederal law enforcement recovered the nearly 50,500 bitcoin from a single-board computer hidden under blankets in a Cheetos popcorn tin stored in a bathroom closet, according to a Justice Department release announcing Zhong’s sentencing.\n\nIn addition to that bitcoin, law enforcement also seized nearly $662,000 in cash and 25 Casascius coins, physical metal coins created to represent bitcoin that also contained private keys to control actual bitcoin. Those physical representations held value totaling approximately 174 bitcoin.\n\nZhong’s over 50,000 bitcoin, 25 Casascius coins, several physical metal bars, cash, and an investment in a real estate holding company are now property of the United States."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vd3d3LnJpc2submV0L3Jpc2stbWFuYWdlbWVudC83OTU2NDg5L2xjaC1wbGFucy1mb3ItcTQtYml0Y29pbi1kZXJpdmF0aXZlcy1jbGVhcmluZy1sYXVuY2jSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "LCH plans for Q4 bitcoin derivatives clearing launch - Risk.net",
        "content": "LCH’s Paris-based clearing house is preparing to start clearing bitcoin futures and options in the fourth quarter of this year, setting up a competitive clash with CME, which currently dominates the space.\n\nIf the bitcoin launch is successful, LCH SA business head Frank Soussan tells Risk.net the central counterparty (CCP) would consider clearing similar contracts based on the second largest cryptocurrency – ether – provided the market wanted it, and the proposed product met all internal"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbWFnYXppbmUvYml0Y29pbi1nbG9yeS1vbi1jaGluZXNlLXRpa3Rvay0zMG0tbWFpbmxhbmQtdXNlcnMtanVzdGluLXN1bi1zYWdhLWFzaWEtZXhwcmVzcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin glory on Chinese TikTok, 30M mainland users, Justin Sun saga: Asia Express - Cointelegraph",
        "content": "Our weekly roundup of news from East Asia curates the industry’s most important developments.\n\n\n\nBitcoin’s day of glory on Chinese TikTok\n\nOn Apr. 10, Douyin, the version of Tiktok exclusive to Chinese users, began publishing price quotes related to Bitcoin (BTC) and other cryptocurrencies such as Ethereum (ETH), Dogecoin (DOGE), and Ripple (XRP). The move sparked rampant speculation among the Chinese media and users alike related to a potential change of policy by the country’s central government on cryptocurrency regulation.\n\nUnlike its Western counterpart, content on Douyin is heavily monitored and sometimes censored by Chinese authorities. Since Sept. 2022, Douyin has been cracking down on content relating to cryptocurrencies, NFTs, and Metaverse.\n\n\n\nAlso read: Why join a blockchain gaming guild? Fun, profit and create better games\n\nHence, many individuals were genuinely surprised to see cryptocurrencies discoverable on the government-curated platform. For around 24-hours, any of Douyin’s estimated 730 million mainland Chinese users could freely view crypto price quotes on the app. However, dreams of a relaxation in the country’s strict crypto laws were crushed shortly thereafter. On Apr. 11, Bitcoin and cryptocurrencies price quotes were removed from Douyin, with a message stating:\n\n“Based on relevant national regulations, unofficial digital currencies do not possess the same legal standing as fiat currencies. Please invest cautiously.”\n\nSince 2021, China has banned all forms of crypto exchanges, crypto-fiat transactions brokered by financial institutions, and initial coin offerings. That said, the country stopped short of banning the ownership of cryptocurrencies altogether and the Chinese controlled territory of Hong Kong has unveiled plans to become a crypto hub.\n\nBitcoin on Douyin before and after the crackdown. (GamerSky)\n\nBruce Lee lives again via NFTs\n\nOn Apr. 12, the Bruce Lee Foundation announced it would partner with NFT video platform Shibuya to launch a collection of genesis NFTs featuring the late legendary martial arts actor, who died in 1973 at the age of 32 under mysterious circumstances. The House of Lee collection is one sale on Manifold from Apr. 12 to Apr. 14 and is minted on the Ethereum network, with digital image storage on Arweave.\n\nThe Bruce Lee Genesis NFT (Arweave)\n\nThere is no limit to the number of NFTs minted during the sale. At the time of publication, over 19,592 House of Lee digital collectibles have been minted with a current floor price of around 0.008 Ether. The Bruce Lee NFT was drawn by artists Maciej Kuciara and Emily Yang, with its design inspired by Shannon Lee, daughter of Bruce Lee and president of the Bruce Lee Estate. An Ethereum Name Service address has also been registered for the collection at bruceleeofficial.eth.\n\nMy last name is Lee. Bruce Lee. pic.twitter.com/hc678dzRgO — Bruce Lee (@brucelee) April 11, 2023\n\nChina’s 30M crypto users despite ban\n\nAccording to a joint research report published on Apr. 10 by Foresight News, CoinNess, and BlockTempo, China still has around 30 million crypto users, representing around 2.12% of its population, compared to 12% for the U.S. and 11% for Taiwan. Researchers cited the Sept. 2021 People’s Bank of China ban on crypto-fiat transactions as “the nail in the coffin” for the industry in China.\n\nChina’s crypto user count has dwindled but still thriving (Foresight Ventures)\n\nThat said, the report also noted Hong Kong is becoming a rising hub of blockchain technology in Asia. In Feb. 2023, the Hong Kong Securities and Futures Commission (SFC) proposed a pathway for exchanges to obtain regulatory licenses through fulfilling the custody, know-your-customer, record-keeping, and risk management requirements. The policy is scheduled to come into effect on June 1, 2023.\n\nInterestingly, Foresight wrote that despite tailwinds from a spending campaign during the 2022 Beijing Winter Olympics, only 13.61 billion of China’s digital yuan central bank digital currency (CBDC) were in circulation, representing just 0.13% of China’s M0 or outstanding monetary supply. “Trade settlement applications are still in development and are only accepted by very limited partners,” the firm noted.\n\nDespite headwinds, three major venture capital firms, Hashkey Capital, Dragonfly, and Foresight Ventures, are still active in the mainland China region. Notable projects tracing their origins from China include Conflux, Alchemy Pay, Animoca Brands, and CertiK.\n\nHong Kong’s rising Web3 power\n\nThe Hong Kong Web 3.0 Festival gallery hall (Twitter)\n\nOn Apr. 12, more than 10,000 crypto enthusiasts and 300 guest speakers gathered in Hong Kong for the special administrative region’s annual Web3 Festival. During its debut, Lee Ka-Chiu, chief executive of Hong Kong, pledged to allocate 700 million Hong Kong dollars ($89.17 million) from this year’s budget to accelerate the development of digital assets and Web3 technologies in the region. Chan Mo-Po, the financial secretary of Hong Kong, also commented:\n\n“Web3 is in its infancy, and the current common applications include cryptocurrency, decentralized exchanges, digital identity verification, DeFi, blockchain games, and even NFT but it is conceivable that in the future there will be many more new applications and opportunities. From a historical point of view, the development of Web3 will grow rapidly again after going through the shock stage.”\n\nJustin Sun’s dream rendezvous with socialite overshadowed by legal woes\n\nFor Justin Sun, founder of Tron and de facto owner of cryptocurrency exchange Huobi Global, the 2023 Hong Kong Web3 Festival appears to be the pinnacle of his blockchain career. First off, before his arrival, Sun claims to have successfully turned around Huobi’s operations after years of stagnation, posting an impressive profit of $30 million in Q1 2023.\n\nThen, with an aura of awe, the blockchain personality dispelled rumors that he was arrested in Hong Kong on arrival. In 2019, Sun allegedly hired a smuggler to help him bypass mainland China’s border controls and escape the country. This has been linked to exit restrictions due to his involvement in the initial coin offering (ICO) of Tron, which took place days before China banned ICOs. Sun has been out of mainland China ever since. Interestingly, no extradition agreement exists between China and Hong Kong, after a bill for such measure was quashed by a pro-democracy student uprising in 2019. The protests, in turn, were quashed by China’s central government.\n\nThanks to the sacrifice of the students, Sun was able to land in Hong Kong safely and meet face-to-face with Nina, an iPollo community ambassador whom Sun wants to feature in a Huobi beauty pageant and “[personally] guarantee as a final contestant in the Top 20.” Unfortunately, not everyone appears to be dazzled by Sun’s attempt at flirtation. As Sun’s euphoria reached its peak whilst partying onboard a Binance yacht, the U.S. Securities and Exchange Commission issued a subpoena for Sun on Apr. 12, kindly reminding him of his obligation to appear in court on charges of fraud and securities law violations.\n\n“If you fail to respond, judgment by default will be entered against you for the relief demanded in the complaint. You also must file your answer or motion with the court.”\n\nThe SEC complaint, filed on Mar. 26, alleges Sun and his companies, Tron and BitTorrent, “fraudulently” manipulated the secondary market for Tron tokens through “extensive wash trading,” conducting more than 600,000 such trades, and also paid numerous American celebrities to promote TRX and BitTorrent (BTT) tokens with zero disclosure.\n\n\n\nSun has since stated that the SEC complaint “lacks merit” and that the regulatory body is “still in its infancy and is in need of further development” with regards to digital assets. The lawsuit is ongoing. Around the same day of the subpoena, Binance.US announced that it would be delisting TRX from its platform.\n\nJustin Sun blushes as he shares a stage with Nina on Apr. 11, oblivious to the looming legal threat that will materialize the day after. (Twitter)"
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZyaWVuZGx5LXBwaS1kYXRhLWJvb3N0cy1idWxscy1hcy1ldGhlci1wcmljZS1maWdodHMtZm9yLTJr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin-friendly PPI data boosts bulls as Ether price fights for $2K - Cointelegraph",
        "content": "Bitcoin (BTC) preserved $30,000 support at the April 12 Wall Street open as more United States macroeconomic data boosted bulls.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nPPI hints further inflation drops to come\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD hovering near $30,250 on Bitstamp.\n\nAmid a slowdown in volatility, U.S. Producer Price Inflation (PPI) data provided a timely hint that inflation was slowing faster than expected.\n\nHeadline PPI came in at 2.7% year-on-year versus market expectations of 3% — an encouraging result for risk assets.\n\nUS March PPI fell 0.5% MoM, below estimate of 0%, in another sign that US #inflation may have peaked. pic.twitter.com/mfI7ab03ev — Holger Zschaepitz (@Schuldensuehner) April 13, 2023\n\nFinancial commentary resource The Kobeissi Letter was among those noting that the month-on-month drop in PPI values was the largest since the peak in March 2022.\n\n“The overall PPI inflation rate has fallen from 11.3% to 2.7% since June 2022, less than 1 year ago. There also has not been a monthly increase in PPI inflation since June 2022,” it added.\n\nReacting, market commentator Tedtalksmacro suggested that the numbers would also provide a snowball effect for another key inflation metric, the Consumer Price Index (CPI), the March print for which also beat prognoses.\n\n“Indicative of further falls in CPI/PCE in coming months,” he summarized in comments about the PPI result.\n\nInflation subsiding faster has traditionally buoyed crypto asset performance as it raises hopes that U.S. economic policy will become less restrictive.\n\nA key event for market participants now will be the Federal Reserve’s next interest rate change, the decision on which is due in May.\n\nAccording to CME Group’s FedWatch Tool, expectations still favored a further rate hike of 0.25%, with PPI notably doing little to change the mood.\n\nFed target rate probabilities chart. Source: CME Group\n\nBitcoin, Ether struggle at key levels\n\nWhile holding $30,000 as support, meanwhile, Bitcoin failed to convince everyone that its 10-month peak would stay.\n\nRelated: Can Ethereum crack $2K? ETH price inches closer despite new unlocked supply\n\nMonitoring resource Material Indicators warned of a bearish signal on its proprietary trading tools, within a broader bullish context.\n\nBoth Trend Precognition algos are showing red on the BTC Daily chart. Signals are tentative, but both algos on the same candle has historically had a high probability of accuracy so these are the signals I'll often act early on. Of course PPI coming at 8:30am might make things… pic.twitter.com/rKguVIeS5d — Material Indicators (@MI_Algos) April 13, 2023\n\nA snapshot of buy and sell levels on the Binance order book prior to PPI, meanwhile, showed the strongest resistance parked at $30,500.\n\n“Near range bid liquidity may limit the downside volatility, but this is the WildWest of Crypto so anything goes. Watch for rugs,” Material Indicators wrote in part of accompanying comments.\n\nBTC/USD order book data (Binance). Source: Material Indicators/Twitter\n\nAs Cointelegraph reported, it was largest altcoin Ether (ETH) stealing the limelight on the day, passing $2,000 for the first time since August last year.\n\nETH/USD 1-day candle chart (Bitstamp). Source: TradingView\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZXRmdHJlbmRzLmNvbS9jcnlwdG8tY2hhbm5lbC9kZXNwaXRlLWxvdy1jb25maWRlbmNlLWNyeXB0by1iaXRjb2luLW1vdmVzLXBhc3QtMzBrL9IBYmh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvZGVzcGl0ZS1sb3ctY29uZmlkZW5jZS1jcnlwdG8tYml0Y29pbi1tb3Zlcy1wYXN0LTMway9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Despite Low Confidence in Crypto, Bitcoin Moves Past $30k - ETF Trends",
        "content": "A Pew Research Center report noted that most Americans’ confidence in the safety and reliability of cryptocurrency is low, but nonetheless, bitcoin continues to recover from last year’s bear market, pushing past the $30,000 price mark most recently.\n\nBullish investors in the leading cryptocurrency are betting that the U.S. Federal Reserve will start loosening monetary policy as it looks to get inflation under control. Additionally, alternative assets like bitcoin are seeing more interest, especially after the recent bank rescues lower confidence in the stability of the financial system.\n\n“Bitcoin is by far doing the best out of the top 20 biggest digital assets. This may be in part because traders are expecting Federal Reserve Chairman Jerome Powell to slow the rate of interest rates due to the banking crisis, in turn make ‘risky’ assets like Bitcoin more appealing,” a Decrypt article said.\n\nAlternative assets are also attracting more investors as the economy continues to flash signs of a recession. Bond markets are doing just that as more investors start to pile into safe haven assets, including bitcoin — this could re-establish bitcoin’s moniker as “digital gold.”\n\n“Others are pushing the safe haven narrative: with current financial uncertainty, assets like Bitcoin and gold remain a safe bet when a recession is (still) apparently looming,” the article added.\n\nMost Americans Not Confident in Crypto\n\nDespite the recent push for bitcoin, it will still take some time for investors to allocate more capital into the cryptocurrency space. After an exponential rise in 2021, 2022’s bear market not only came with price declines, but also regulatory challenges — as such, bitcoin and other digital currencies may have lost investors and moreover, are having a hard time offering peace of mind to potential investors.\n\n“Cryptocurrency markets are taking hits from all sides — from declines in value to multiple corporate bankruptcies to lawsuits and regulatory threats ,” a Pew Research Center blog noted. “Among the vast majority of Americans who say they have heard at least a little about cryptocurrency (88%), three-quarters say they are not confident that current ways to invest in, trade or use cryptocurrencies are reliable and safe, according to a Pew Research Center survey conducted March 13-19. This comes out to about two-thirds of all U.S. adults.”\n\nNonetheless, in order for a market to mature, it must undergo such challenges. If digital currencies can exit the current market doldrums relatively unscathed, it could potentially re-attract investors again—Bitcoin is up almost 80% for the year, which could certainly help its case."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vdmlkZW8vZG9udC1yZWFsbHktY2hvb3NlLWJldHdlZW4tYml0Y29pbi0yMTQyMjM4NTMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "'You don't have to really choose' between Bitcoin and Ethereum: Trader - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) has surged by over 80% in 2023. Ethereum (ETH-USD) is up by more than 65% over the same span after completing its Shanghai upgrade this week. But according to one trader, choosing where to invest shouldn't come down to picking one over the other.\n\n\"Wolf of All Streets\" podcast host Scott Melker describes Bitcoin as \"digital gold\" and Ethereum as more of a technological investment. \"I think you can love one, love both, and it's totally fine,\" Melker says. \"You don't have to really choose. I think they're separate asset classes and should be viewed as such.\"\n\nBe sure to watch Rachelle Akuffo's full interview with Melker here.\n\nKEY VIDEO MOMENTS:\n\n0:13 Melker's take on Ethereum's Shanghai upgrade.\n\n1:20 Melker breaks down the Bitcoin vs. Ethereum debate\n\nVideo Transcript\n\nRACHELLE AKUFFO: And I want to talk Ethereum as well, the Shanghai upgrade. Because obviously, we're seeing at least today, Ethereum off to the races here versus Bitcoin. I mean, up about almost 6% on the day. What are your takeaways from that? Obviously, a lot of excitement surrounding this.\n\nSCOTT MELKER: Yeah, there was a bit of a nonsensical narrative that everybody who had staked their Ethereum for the past few years was going to try to withdraw all at once, which you couldn't do anyways, and sell all their Ethereum. But you have to remember that anyone who staked their 30 to Ethereum, which by the way, for most people, was over $60,000. But anyone who staked that 30 to Ethereum had no guarantee they would even be able to withdraw.\n\nThese are the people who are the biggest believers, the maximalists of Ethereum, who really wanted to help secure the network. So now that they're getting the opportunity to withdraw, they're going to continue staking. I think there were more people. And I can speak to this anecdotally from fund managers that I speak to in institutions.\n\nThere are a lot more people who are actually waiting to deposit because they would then know that they would be able to withdraw at some point. So we're actually seeing net inflows over the past 24 hours. It's going back and forth. But there has not been a huge demand for people to withdraw. And there are just as many people putting their money into the contract. I think that this is a huge development for Ethereum. Yet another major step in the right direction for the protocol.\n\nRACHELLE AKUFFO: And do you think perhaps investors are more bullish on Ethereum given the use cases versus Bitcoin?\n\nSCOTT MELKER: I view them as completely separate assets. I think that the flipping narrative is completely irrelevant. I view Bitcoin as a digital gold, store of value, flight to safety. And we've obviously seen that, especially, with the banking collapses a few months ago, and Bitcoin rise a few weeks ago. With Bitcoin rising from roughly 19,000 to over $30,000, Ethereum is more of a technological investment. It's a internet of value. And I think that we're starting to see that separation in people's minds. So I think you can love one, love both, and it's totally fine. You don't have to really choose. I think that they're separate asset classes and should be viewed as such."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtdGFyZ2V0cy1zZWUtMzNrLW5leHQtYXMtYml0Y29pbi1leWVzLWtleS1yZXNpc3RhbmNlLWZsaXDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "BTC price targets see $33K next as Bitcoin eyes key resistance flip - Cointelegraph",
        "content": "Bitcoin (BTC) preserved new 10-month highs at the April 14 Wall Street open as analysts kept hoping for further gains.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\n$31,000 revealed as make-or-break trend line\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD consolidating around $30,700 after spiking past the $31,000 mark.\n\nThe pair saw no major retracement as it headed further into grounds it originally lost in June 2022.\n\nNow, market participants eyed the potential for bulls to capitalize on existing momentum with the help of positive macro trends.\n\nUnited States equities opened higher, with the S&P 500 and Nasdaq Composite Index both up 0.3% at the time of writing.\n\n“With stocks opening up hot, BTC was able to maintain above the previous range high,” popular trader and analyst Josh Rager told Twitter followers after the open.\n\n“Think we can see a retest and push higher here above $31k+.”\n\nBTC/USD, S&P 500 charts. Source: Josh Rager/Twitter\n\nOthers also considered the possibility of BTC/USD hitting $32,000 or more in the short term before taking a more pronounced time out.\n\n#BTC's recent breakout means that price is now entering the $28800-$33000 range (orange-blue)\n\n\n\nIt's unclear whether $BTC needs to dip to solidify ~$28800 as support before jumping to $33000\n\n\n\nBut at the moment, more arguments for upside at this time#Crypto #Bitcoin https://t.co/85DjLHoZnD pic.twitter.com/Nx7bQx0OWa — Rekt Capital (@rektcapital) April 13, 2023\n\n“I believe the next stop is just a hair above $33,000, where we’ll encounter the 100 moving average, on the weekly time frame,” macro analyst Jesse Dow continued in part of Twitter analysis during the week.\n\n“Don’t forget we have bullish divergence and convergence on the weekly. And this has NEVER failed after we’ve seen at least a 75% drop in Bitcoin’s price, from the previous cycle.”\n\nZooming out, the importance of the current range for spot price became all the more visible, with $31,000 acting as support through 2021 until the June 2022 breakdown.\n\nBrandt stays long Bitcoin\n\nAs various popular figures called the start of an “altseason,” one staying firmly bullish on BTC was veteran trader Peter Brandt.\n\nRelated: What Bitcoin bear market? BTC price closely copying old halving cycles\n\nIn a tweet on April 13, Brandt revealed long positions on Bitcoin in addition to stocks in a further suggestion that the worst of the bear market was now over.\n\nHeading to MN for the summer. Current Factor LLC positions with trailing stops\n\nLong Nasdaq $NQ_F\n\nLong Gold vs. YPY $GC_F $G6J_F\n\nLong Bitcoin $BTC\n\nLong Gold $GC_F\n\nLong London Cocoa (not shown) $LCC_F pic.twitter.com/FH2o0LxZEz — Peter Brandt (@PeterLBrandt) April 13, 2023\n\nPreviously, former BitMEX CEO Arthur Hayes had revealed a rethink on his own investment strategy, opting to increase crypto exposure.\n\n“The ensuing Bitcoin rally will be one of the most hated ever,” he predicted in a blog post released last month.\n\nMagazine: Bitcoin in Senegal: Why is this African country using BTC?\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9pbmRpdmlkdWFsLWJlaGluZC0zLTRiLXNpbGstcm9hZC1iaXRjb2luLXRoZWZ0LXNlbnRlbmNlZC10by1vbmUteWVhci1pbi1wcmlzb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Individual behind $3.4B Silk Road Bitcoin theft sentenced to one year in prison - Cointelegraph",
        "content": "The United States Attorney’s Office for the Southern District of New York has announced the sentencing of an individual who pleaded guilty to wire fraud charges connected to “unlawfully obtained” Bitcoin from the Silk Road marketplace in 2012.\n\nIn an April 14 announcement, the U.S. Justice Department said James Zhong was sentenced to one year and one day in prison for charges related to executing a scheme to steal more than 51,680 Bitcoin (BTC). Zhong pleaded guilty to the charges in November 2022 and has been awaiting sentencing.\n\n“Cyber-criminals should heed this message: we will follow the money and hold you accountable, no matter how sophisticated your scheme and no matter how long it takes,” said U.S. Attorney Damian Williams.\n\nAccording to Williams, Zhong stole the BTC in 2012 and managed to conceal his crime for roughly 10 years before facing charges. U.S. authorities seized the Bitcoin holdings from Zhong’s home in the state of Georgia in November 2021, finding the bulk of the crypto in a floor safe and a computer concealed in a popcorn tin. The coins were worth roughly $3.4 billion at the time.\n\nIn the U.S. Attorney's sentencing memo for Silk Road Bitcoin stealer James Zhong: investigators seized criminal proceeds from \"a single-board computer that was submerged under blankets in a popcorn tin stored in a bathroom closet.\" (Sentencing is today at 3 pm). pic.twitter.com/7aamQryQ6B — Rachel Scharf (@rscharf_) April 14, 2023\n\nRelated: US government plans to sell 41K Bitcoin connected to Silk Road\n\nThe Silk Road marketplace, defunct for roughly 10 years, allowed users to buy and sell illicit goods such as weapons and stolen credit card information, drawing the attention of U.S. authorities. The creator of the platform, Ross Ulbricht, was arrested in 2013 and is currently serving two life sentences without the possibility of parole.\n\nMagazine: US enforcement agencies are turning up the heat on crypto-related crime"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmxlZGdlci5jb20vYWNhZGVteS9jcnlwdG8tZGVyaXZhdGl2ZXMtd2hhdC1hcmUtdGhleS1hbGwtYWJvdXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "What Are Crypto Derivatives and How Do They Work? - Ledger",
        "content": "What Are Crypto Derivatives and How Do They Work?\n\nBy Gaurav Roy\n\nRead 8 min Medium\n\nSHARE\n\nKEY TAKEAWAYS: — Crypto derivatives derive their value from the underlying asset. Traders use them to gain exposure to the price movement of an asset without actually owning it.\n\n\n\n— Derivatives are not exclusive to crypto; these types of assets are popular in traditional finance too.\n\n\n\n— Crypto derivatives come in two types, futures, and options. Traders use these for hedging and speculating.\n\nHave you ever heard of crypto derivatives and wondered what they are all about?\n\nWith the rise of cryptocurrencies, derivatives have emerged as a popular tool for traders to manage risk and speculate on the price movements of digital assets.\n\nBut with their complex nature and potential risks, it’s important to understand the ins and outs of the crypto derivatives market before diving in.\n\nBut wait, Derivatives have been around for ages, right? Indeed, ancient civilizations used derivatives. For example, in Mesopotamia, clay tablets described futures contracts used for agricultural goods. Even in the 19th century, Chicago became a hub for derivatives trading. But now, there are even derivatives for cryptocurrencies.\n\nIn this article, Ledger takes a deep dive into the world of crypto derivatives, exploring what they are, how they work, and what you should know before getting involved. So buckle up and get ready to learn all about this rapidly evolving corner of the crypto world.\n\nWhat are Crypto Derivatives?\n\nCrypto derivatives are financial instruments that derive value from an underlying crypto asset. They are contracts between two parties that allow traders to speculate on the price movements of cryptocurrencies without actually owning the underlying asset. As such, the trader makes a profit or loss depending on whether the asset price goes up or down.\n\nToday, there are specialized cryptocurrency exchanges, as well as traditional financial exchanges offering crypto derivatives, but what’s the point?\n\nWhy Trade Crypto Derivatives?\n\nCrypto derivatives are primarily used for speculation, hedging, and leverage.\n\nSpeculation\n\nThe speculation involves taking a position on the future price movements of crypto to make a profit. This allows traders to take advantage of the high volatility of the crypto market, as it can help them earn significant profits if they correctly predict the future price movements of the underlying asset. This way, traders can capitalize on market opportunities by going long or short.\n\nWhile spot trading also allows speculation — buying low and selling high — leverage is what makes derivatives attractive to traders.\n\nLeverage Trading\n\nLeverage trading is the ability to control a large amount of an asset with a relatively small amount. For example, a trader may only need to put down 10% of the total value of a futures contract. For instance, on the crypto exchange Binance, a trader can leverage up to 125 times the initial margin. But while leverage can amplify potential profits, it also drastically increases the risk of losses.\n\nHedging\n\nHedging is another reason for using crypto derivatives. It is a risk management strategy where a trader takes an opposite position to an existing one to offset potential losses. For example, a Bitcoin spot holder buys an asset and then holds it until the value (hopefully) increases. However, if they think the asset might decrease in value, they can take a short position on a Bitcoin futures contract, effectively hedging their position.\n\nTypes of Crypto Derivatives\n\nCrypto derivatives operate similarly to traditional derivatives, where a buyer and seller enter into a contract to sell an underlying asset, with the asset being sold at a predetermined time and price.\n\nDerivatives do not have any value. Instead, they derive their value from the underlying asset. For example, the value of a Bitcoin derivative is determined by the value of Bitcoin.\n\nSo, what kind of derivatives are available in the crypto market? The most commonly traded types of derivatives include futures, options, and perpetual contracts.\n\nWhat are Crypto Futures?\n\nCrypto futures are a type of derivative contract that allows two parties to agree on the price of a cryptocurrency at a fixed date in the future. Upon expiration of the contract, the buyer is obligated to receive and purchase the asset, while the seller is obligated to deliver and sell the asset.\n\nIn today’s financial and crypto markets, physical delivery of the asset does not always occur with futures contracts. Instead, the profit or loss arising from the trade is typically settled in cash and credited or debited to the trader’s account.\n\nWhen entering into a futures contract, traders can take a long or short position, indicating the direction they believe the asset’s price will move.\n\nA long position is when a trader believes that the underlying asset’s price (e.g., Bitcoin) will increase in the future. A short position, on the other hand, is when a trader believes that the underlying asset’s price will decrease in the future.\n\nPerpetual Futures\n\nPerpetual futures are a type of futures contract without an expiration date. Instead, perpetual futures contracts remain open indefinitely until the trader closes the position. This means traders can hold a perpetual futures position for as long as they want, potentially profiting from long-term price movements in the underlying asset.\n\nThese futures contracts work by using a funding mechanism that helps keep the contract price in line with the spot price of the underlying asset. the difference between the perpetual futures price and the spot price of the underlying asset determines the funding rate\n\nFor example, if the price of the perpetual contract exceeds the index price, traders who have taken a “long” position typically pay the funding rate to compensate for the price difference. Conversely, if the perpetual futures contract price is lower than the index price, traders with a “short” position pay the funding rate.\n\nWhat Are Crypto Options?\n\nCrypto options give the holder the right, but not the obligation, to buy or sell a specific amount of a cryptocurrency at a predetermined price (known as the strike price) on or before a specified date.\n\nBut remember, there are several fees involved in trading options derivatives:\n\nOptions premium: The cost paid by the buyer for the right to trade at a set price.\n\nCommission: A fee charged by brokers per options trade, either flat or percentage-based.\n\nContract fees: Small fees charged by exchanges for each option’s contract, paid by both parties.\n\nExercise fees: A fee charged by brokers if the option is exercised.\n\nMargin interest: Interest charged on borrowed funds used in options trading.\n\nBitcoin Options: Call and Put\n\nThere are two types of Bitcoin options: call options and put options.\n\nA call option gives the holder the right to buy crypto at a predetermined price, while a put option gives the holder the right to sell at a predetermined price.\n\nFor example, if a trader thinks that the Bitcoin price will rise in the future, they purchase a call option with a strike price of $100,000 that expires in three months. And if BTC exceeds $100,000 before expiry, the trader may use the option to buy at a lower price and possibly book a profit.\n\nIn both cases, the trader pays a premium to purchase the option, representing the option contract’s price. However, if Bitcoin’s price doesn’t follow the trader’s prediction, they can allow the option to expire, only losing the paid premium.\n\nWhat Is the Impact of Derivatives Trading?\n\nDerivatives, in general, are crucial in establishing a mature financial system. They enable market participants to manage risk, enhance liquidity, and enable price discovery, all of which are essential for market growth and development.\n\nLiquidity is a critical component of the crypto sector, much like any financial market. After all, without liquidity in a system, prices become more volatile.\n\nA lack of liquidity can result in wider bid-ask spreads, increased volatility, and higher transaction costs, making it difficult for traders to enter and exit positions at desirable prices. It can also deter institutions, which typically require a certain level of liquidity to put in large sums of money.\n\nIn contrast, high liquidity attracts more market participants, facilitates efficient and transparent market development, and reduces the likelihood of market manipulation.\n\nDerivatives also allow traders to hedge their risks and manage their portfolios more effectively, increasing market efficiency. Furthermore, limiting traders’ losses allows them to make more rational trading decisions.\n\nFurthermore, derivatives trading can optimize price discovery by providing additional market data that informs price trends and market sentiment.\n\nBenefits and Risks of Trading Crypto Derivatives\n\nTrading derivatives come with its own pros and cons that traders must be aware of to effectively manage their trades.\n\nBenefits\n\nTraders can derive multiple benefits from trading crypto derivatives. For starters, it is cheaper than spot trading.\n\nMoreover, derivatives can help traders mitigate the risks of an underlying asset’s price fluctuations. To explain, using derivatives for hedging helps traders limit losses in the event of an adverse price movement.\n\nDerivatives trading also enables leverage, allowing traders to control larger positions with a smaller amount of capital — hence magnifying the potential gains. Additionally, derivatives facilitate portfolio diversification, meaning traders can maximize their returns and manage risks more effectively. Trading derivatives across various assets can reduce individual market risks and achieve a more balanced portfolio.\n\nRisks\n\nCrypto derivatives carry several risks, including the risk of volatility. Derivatives trading involves speculating on the price movements of an underlying asset that can be volatile. Leverage trading magnifies this risk: You could potentially incur significant losses.\n\nAnother risk is the unclear legal status of derivatives trading in some jurisdictions. You wouldn’t want your trading strategies to result in potential legal and compliance risks. In fact, it’s illegal in certain countries. Accordingly, traders must check the laws and regulations of their country before engaging in derivatives trading.\n\nThere are also counterparty risks associated with over-the-counter (OTC) derivatives trades, as traders may not benefit from the due diligence that comes with trading on regulated exchanges. For example, OTC trades expose traders to credit and default risks.\n\nBest Practices in Trading Crypto Derivatives\n\nIt is important to note that there is no guaranteed way to make money trading derivatives in the crypto market, and it can be a highly risky endeavor. However, there are some ways traders minimize risks and maximize their chances of success.\n\nCommon Tactics\n\nTrading derivatives can be highly complex, and there is no one-size-fits-all approach to success. That being said, traders may use common tactics when trading derivatives, depending on their market outlook and risk tolerance.\n\nFor example, in a bull market, traders may use option contracts to buy at a certain price (a “call” option), allowing them to benefit from further upward price movements. Similarly, in a bear market, traders may use options contracts to sell at a certain price (a “put” option), providing a hedge against further price drops.\n\nOther tactics include using technical analysis to identify trends and price patterns and using leverage to amplify potential profits.\n\nManage Your Risk\n\nWhen trading crypto derivatives, it is important to manage your risk carefully. Crypto prices are volatile, and since crypto derivatives drive their value from underlying assets, they are subject to the same volatility. Furthermore, leverage trading only amplifies that risk. So, traders should only use it if they understand how it works and they are comfortable with the potential risks.\n\nTraders also manage their risk with specific tools such as stop-loss orders. To explain, this tool will automatically sell a position if it reaches a certain price, limiting potential losses. Additionally, traders often diversify their portfolios across different assets to avoid overexposure to any one position or asset.\n\nDYOR Before Trading Crypto Derivatives\n\nDYOR, or “do your own research,” is crucial to successful trading in any market, including the crypto derivatives market. By conducting your own research and analysis, you can better understand the market, the assets you are trading, and the potential risks and rewards involved.\n\nMaking informed decisions in the crypto derivatives market involves research. Before you go ahead, make sure to read about the intricacies of crypto trading and how to segregate your assets, should you wish to partake.\n\nIf you’re fully informed and ready to go, interacting with the DeFi scene is easy with the Ledger ecosystem. Ledger Live offers several crypto trading apps which allow you to buy, sell, lend and borrow in one single place. Then, this powerful app works together with your trusty Ledger device, allowing you to interact with the DeFi ecosystem, while staying protected from online threats.\n\nWith all of these pieces together, exploring the crypto market has never been so secure."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jbmJjYWZyaWNhLmNvbS8yMDIzL2JpdGNvaW4taXMtb25lLXllYXItYXdheS1mcm9tLWEtbWFqb3ItdGVjaG5pY2FsLWV2ZW50LWhpc3Rvcnktc3VnZ2VzdHMtdGhlLXN0YXJ0LW9mLWFub3RoZXItYnVsbC1ydW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin is one year away from a major technical event. History suggests the start of another bull run - CNBCAfrica.com",
        "content": "In April or May 2024, bitcoin is expected to undergo its next so-called “halving,” though the exact date is not yet known.\n\nBitcoin has been rising in the past few weeks in anticipation of the halving, as a potential U.S. Federal Reserve interest rate cut contends with the prospect of sluggish growth and tightening credit conditions resulting from woes in the banking sector."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiuwFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8tY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTEzLWFwcmlsLTIwMjMvYXJ0aWNsZXNob3cvOTk0NTc1OTAuY21z0gG_AWh0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5Ly1jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMTMtYXByaWwtMjAyMy9hbXBfYXJ0aWNsZXNob3cvOTk0NTc1OTAuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin holds above $30k; Solana, Ethereum rise up to 5% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nMost of the cryptocurrencies were trading higher on Thursday amid better-than-expected US economic data. Bitcoin (BTC) rose 0.67% to $30,093, whereas Ethereum (ETH) was above the $1,900 level. BTC volume stood at approximately $18.62 billion, rising 6.42% in the last 24 hours.\"Most cryptocurrencies rose slightly in the past 24 hours after mildly encouraging inflation data on one side and Ethereum Shanghai upgrades on the other. Bitcoin was seen trading above the US$30,000 level, with its resistance set at US$30,500. This shows that the bulls currently have the upper hand in the market. However, the support of BTC lies at the US$29,900 level,\" Edul Patel, Co-founder and CEO at Mudrex, said.Other top crypto tokens were also trading higher. Solana surged over 5%. Meanwhile, Polkadot, Litecoin Dogecoin and Cardano also traded with gains. The global cryptocurrency market cap was trading higher around $1.23 trillion, rising 1.09% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $582 billion. Bitcoin’s dominance is currently 47.25%, a decrease of 0.25% over the day, according to CoinMarketCap.\"Bitcoin (BTC) continues to consolidate above $30,000, which indicates a rally towards $32,000 is possible until it encounters strong resistance. CPI cooling off may also signal the end of the rate hike season, which will bring new liquidity into the markets,\" Vikram Subburaj, CEO of Giottus Crypto Platform, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 69, with a neutral outlook. The Stochastic %K (14, 3, 3) indicates ‘sell’ at 86 and the Average Directional Index (14) indicates a Neutral outlook at 38.\"The MACD Level (12, 26), at 1027, indicates Buy. The Stochastic RSI Fast (3, 3, 14, 14) indicates Sell at 84 and William's Percentage is Neutral at −13,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.54 hours, IST on April 13, 2023)Bitcoin $30,107 0.66%Ethereum $1,918 2.92%Tether $1.00 -0.01% BNB $318 0.16%XRP $0.5072 -0.1%Cardano $0.407 3.67%Dogecoin $0.0833 1.82%Polygon $1.11 2.23%Solana $23.98 5.05%Polkadot $6.42 2.59%Shiba Inu $0.00001093 1.13%Litecoin $92.55 0.77%Tron $0.06496 1.97%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3LmxlZGdlcmluc2lnaHRzLmNvbS9sY2gtY2xlYXJpbmctYml0Y29pbi1kZXJpdmF0aXZlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "London Stock Exchange's LCH to centrally clear Bitcoin derivatives - Ledger Insights",
        "content": "Today France-based LCH SA announced it will provide central clearing services for Bitcoin index futures and options traded on GFO-X, a UK-regulated digital asset exchange. It expects to start in Q4 2023, subject to regulatory approval. LCH is the world’s largest derivatives clearing house and a subsidiary of the London Stock Exchange.\n\nThe derivatives will be cash settled. LCH says it is fully segregating LCH DigitalAssetClear, including a separate default fund.\n\n‘Bitcoin index futures and options are a rapidly growing asset class, with increasing interest among institutional market participants looking for access within a regulated environment they are familiar with,” said Frank Soussan, Head of LCH DigitalAssetClear.\n\nCentral clearing houses such as LCH help to mitigate risks by managing collateral and supporting multilateral netting. Ironically, FTX’s Sam Bankman-Fried lobbied the U.S. derivatives regulators CFTC, wanting to remove the separation of clearing, enabling it to settle directly and manage collateral internally.\n\nGFO-X has raised £16 million ($20 million) in funding, and the company is controlled by its CEO Arnab Sen and COO Rajesh Melwani, who worked together at Hong Kong’s Harbour Capital Management. Investors include Sweden’s byWit and Hong Kong’s Mount Parker Ventures.\n\nMeanwhile, the industry derivatives body ISDA has released standard definitions for digital asset derivatives. It also published a whitepaper for what happens in the event of bankruptcy."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGVjcnlwdC5jby8xMjYyNzAvYml0Y29pbi1tYXJrZXRwbGFjZS1vcGVuYmF6YWFyLWNvbWluZy1iYWNr0gFKaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNjI3MC9iaXRjb2luLW1hcmtldHBsYWNlLW9wZW5iYXphYXItY29taW5nLWJhY2s_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Marketplace OpenBazaar Is Coming Back - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter a two year break, OpenBazaar, the decentralized marketplace platform, is on its way back to life, according to some vague tweets from its official account.\n\nThe digital marketplace—where users sold goods from homemade candles to medicine—had shuttered in late 2020 due to dried up funding. After initially announcing its closure, the marketplace was temporarily rescued by an anonymous donor—but it ultimately wasn't enough to keep OpenBazaar open for business.\n\nOpenBazaar CEO Brian Hoffman confirmed in a message to Decrypt that he is rebuilding the marketplace, though he declined to add any further detail. The OpenBazaar website has been updated to say \"openbazaar 3.0 - coming soon.\"\n\nAD\n\nAD\n\nopenbazaar was built by the community from nothing.\n\nfor a long time it has slept, but it is now time to grow again from the ashes. — OpenBazaar (@openbazaar) March 28, 2023\n\nOpenBazaar is like the digital marketplace to Bitcoin’s currency. It was known for its unique approach to online shopping, providing a decentralized marketplace where users could buy and sell goods without the need for a central authority, like, say, Amazon or Etsy. The idea was to give users more freedom over the goods they sold.\n\nThe plan worked for a while before OpenBazaar's funding issues. Merchants set up hundreds of shops, accepting cryptocurrencies for their goods.\n\nAccording to Hoffman's GitHub account (a site where developers post their code publicly for others to use), he has been working on a new implementation of OpenBazaar in the programming language Rust, which is all the rage in Bitcoin lately.\n\nOn Twitter, some users are already excited about OpenBazaar’s return.\n\nAD\n\nAD\n\nIn an interview with CoinDesk in 2018, OpenBazaar co-founder Washington Sanchez described OpenBazaar's purpose as such: \"OpenBazaar is supposed to be a free and open protocol for trade using cryptocurrency, a way for currencies and tokens to gain meaningful economic utility to acquire goods and service, and an entry point for people to earn and onboard.\"\n\nFollowing the OpenBazaar's shutdown in 2020, its founders hinted that structural changes would be needed to further place control of the marketplace in the hands of its community and away from the company that initially created it.\n\nThe future of @openbazaar will be more independence from @OB1Company. More news on that soon. — brian hoffman (@brianchoffman) September 28, 2020"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL21hcmtldHMuYnVzaW5lc3NpbnNpZGVyLmNvbS9uZXdzL3N0b2Nrcy93YXJyZW4tYnVmZmV0dC1iYW5raW5nLWNyaXNpcy1iaXRjb2luLWluZmxhdGlvbi1yZWNlc3Npb24tYXBwbGUtY2hhdGdwdC1hYmVsLTIwMjMtNNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Warren Buffett on Banks, Bitcoin, Inflation, Recession, Apple, ChatGPT - Markets Insider",
        "content": "Warren Buffett predicted more banks will fail and compared bitcoin fans to gamblers.\n\nHe warned inflation and recession are major risks, praised Apple, and questioned ChatGPT's benefits.\n\nHere are Buffett's 14 best quotes from a rare interview this week.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nWarren Buffett has predicted more banks will fail, warned inflation and recession can be extremely dangerous, and dismissed bitcoin buyers as gamblers.\n\nThe famed investor and Berkshire Hathaway CEO also touted the enormous value of Apple products, championed his planned successor, and questioned whether ChatGPT and other AI tools are good for society.\n\nBuffett made the comments to CNBC in a rare televised interview on Wednesday.\n\nHere are Buffett's 14 best quotes, lightly edited for length and clarity:\n\n1. \"Inflation is a constant threat to a country. There comes a point when it gets out of control, and it screws everything up. It's not good for society.\"\n\nAdvertisement\n\n2. \"Either one can cause a lot of trouble. Recessions can turn into depressions. We've got a great, great country, and it gets messed up by depressions. You can disrupt an economy a lot easier than you can put it back together again.\" (Buffett was comparing inflation and recession.)\n\n3. \"We're not through with bank failures. But nobody is going to lose money on a deposit in a US bank. You don't need to turn a dumb decision by managers into panicking the whole citizenry of the United States about something they don't need to be panicked about.\"\n\n4. \"I don't like it when people get too focused on the earnings number, and forget basic banking principles. I did think that banking could get in a lot of trouble because of the things they did. I didn't like the banking business as well as I did before.\" (Buffett was explaining why he's sold a bunch of bank stocks in recent years.)\n\n5. \"When the tide goes out, you learn who's been swimming naked. We actually ran into a nudist colony here, in terms of banks all over doing that sort of thing.\"\n\nAdvertisement\n\n6. \"I don't have any problem with people losing money if they if they do dumb things.\"\n\n7. \"It's a tougher world out there in a great many businesses. I think most of our management would say that they are surprised at where they are now, compared to how they thought they were going to feel six months ago at this point.\"\n\n8. \"People love the idea of getting rich quick. I don't blame them. But I've always wanted to get rich slow, and I have a lot of fun along the way.\"\n\n9. \"I've seen people do stupid things all my life. People like to play the lottery. Something like bitcoin, it's a gambling token. It doesn't have any intrinsic value, but that doesn't stop people from wanting to play a roulette wheel. It eats up your money if you spend the rest of your life spinning around the roulette wheel.\"\n\nAdvertisement\n\n10. \"He does all the work, and I take the bows. He understands each of our businesses, but the difference is that he likes to work and I like to sit around. He's a big improvement on me, but don't tell anybody.\" (Buffett was praising Berkshire's head of non-insurance operations and his planned successor, Greg Abel.)\n\n11. \"If you're an Apple user, somebody offers you $10,000, and the only proviso is they'll take away your iPhone and you'll never be able to buy another, you're not going to take it. It's an incredibly valuable utility. We'll never own a business that makes so many people happier and is so useful for them.\"\n\n12. \"When I look at my iPhone, I don't know whether it's some little guy inside that's doing anything. I don't know the technical aspects at all. But I know that at the Nebraska Furniture Mart, if we don't have the Apple product, people leave the store and go someplace else.\"\n\n13. \"The amount of time it can save you doing all kinds of things is unbelievable. It's an incredible technological advance in terms of showing what we can do. But I don't want to change the world too many times without having some idea of the consequences of it. I think this is extraordinary, but I don't know whether it's beneficial.\"\n\nAdvertisement\n\n14. \"If somebody told me I would live an extra year if I ate nothing but broccoli and a few of the other things all my life, instead of eating what I like to eat, I would say, 'Take that year off the end of my life and let me eat what I like to eat.' Happiness makes an enormous amount of difference in terms of longevity. And I'm happier when I'm eating hot dogs and hot fudge sundaes or drinking Coke.\""
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGVjcnlwdC5jby8xMzY3OTAvbWFyYXRob24tZGlnaXRhbC1iaXRjb2luLW1pbmluZy1iaWxsLXRleGFz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Marathon Digital CEO: Bitcoin Mining Bill 'Won’t Change Our Minds About Texas' - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nThe Texas Bitcoin mining bill that the industry didn’t think would make it out of committee did. Then it cleared the State Senate, too—each time with the backing of unanimous votes.\n\nDespite the consternation from Bitcoin miners about the proposal that would cut into their earnings, Wednesday’s vote to send SB-1751 to the Texas House of Representatives happened in a mostly empty room during the local and uncontested session.\n\nThat means, so far, things are proceeding as Marathon Digital CEO Fred Thiel thought they would.\n\nAD\n\nAD\n\n“In Texas, I’m confident that while this bill will likely pass the State Senate, I don’t think it’s going to make it out of the House intact,” he told Decrypt ahead of the vote.\n\nIf enacted, the legislation would curb benefits offered to Bitcoin miners in the state to reduce their power usage during times of high demand. In exchange for cutting their power usage to help the grid prioritize residential customers, Bitcoin miners have been among the commercial clients eligible to receive credits they can use toward their power bills.\n\nAnd so far, the state has had a chummy relationship with Bitcoin miners. Lee Bracher, president of the Texas Blockchain Council industry group, told Reuters that Bitcoin miners consume roughly 2,100 megawatts—up 75% over the past year—and amount to roughly 3.7% of the state’s peak load.\n\nThiel said the company has been looking to diversify its operations and renewable power options, but added that “1751 won’t change our minds about Texas.”\n\nMarathon, which trades on the Nasdaq under the MARA ticker, hosts the majority of its rigs—10 exahash of its total installed 14 EH—in several Texas facilities. Those facilities were run by Compute North until the company filed for Chapter 11 bankruptcy protection in September. Then in December, U.S. Bitcoin Corp. stepped in to replace Compute North at three of the facilities where Marathon hosts rigs.\n\nAD\n\nAD\n\nThat means Thiel could soon be a customer of Toronto-based Bitcoin miner Hut 8.\n\nIn February the publicly traded miner, which trades on Nasdaq under the HUT ticker, announced plans to merge with U.S. Bitcoin. Last month Hut 8 CEO Jaime Leverton said during an earnings call that the Canadian competition authority had issued a letter of no action, meaning there’s no regulatory hurdle to clear before the deal can close.\n\nLeverton told Decrypt earlier this month during an interview for the gm podcast that she’s especially excited by the work that U.S. Bitcoin has done with artificial intelligence and machine learning to manage energy use and maintenance for individual rigs.\n\n“We haven't seen anything else quite like it,” she said. “And I think there's a ton of potential as we get to the other side of this transaction, to really figure out how to scale and port some of that proprietary IP that they're working on to other applications outside of just Bitcoin mining.”\n\nBut even if SB-1751 hasn’t changed Thiel’s mind on its growth in Texas, he said Marathon wants to keep diversifying its operations.\n\n“We’re also expanding in North Dakota—we have a big site in North Dakota—that’s about 180 megawatts there that’s coming online as we speak,” he said. “But we still have lots of sites in Texas, and we’ll continue to develop those sites.”\n\nThe company has also started building out two $400 million mining facilities in the United Arab Emirates, a joint venture with FS Innovation in which Marathon has a 20% stake. The locations, which Thiel expects to go live before the end of this year, will have a combined 250-megawatt facility of capacity.\n\nThiel called the UAE venture Marathon’s “coming out party,” since it hasn’t previously done its own site design and development. Marathon usually places its rigs in hosted sites, run by other companies. But that could continue to change as Marathon looks at ways to set up more small, low-maintenance sites.\n\nAD\n\nAD\n\nThe goal, he said, is to look for places where Marathon can set up very small Bitcoin mining operations “at the edge,” or at the source of where renewable energy can be generated.\n\n“Economically, that means you don’t have to have a lot of people on the small sites,” Thiel added. “We can essentially run a truck by every month or so to make sure everything’s running fine.”"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNC8xMy9kb2t3b24ta29yZWEtdGVycmEv0gFOaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA0LzEzL2Rva3dvbi1rb3JlYS10ZXJyYS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "As Justice Is Sought for Do Kwon, South Korea’s Crypto Scene Emerges From Terra’s Shadow - CoinDesk",
        "content": "The dust of the Terra crash has not completely settled in Korea, though Kwon’s arrest does move this story a bit nearer to closure. Several people told me that after the crash, traditional Korean companies became more wary of being associated with crypto. “Before Terra, all the big companies were joining the momentum. Investment banks actually invited us to give them seminars on crypto [exchange-traded funds] or how they can pave their way into the crypto market. But I guess now the attention has become a bit selective,” Hyperithm’s Lee says. “Not all the companies are interested in crypto anymore.”"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMinwFodHRwczovL3d3dy5saXZlbWludC5jb20vbWFya2V0L2NyeXB0b2N1cnJlbmN5L2Nvb2xpbmctaW4tdXMtaW5mbGF0aW9uLXNoYXBlbGxhLXVwZ3JhZGUtbGlmdHMtY3J5cHRvLW1hcmtldC1iaXRjb2luLW5lYXJzLTMwLTUwMC1ldGhlci11cC02LTExNjgxMzc5NjI1NDkzLmh0bWzSAaMBaHR0cHM6Ly93d3cubGl2ZW1pbnQuY29tL21hcmtldC9jcnlwdG9jdXJyZW5jeS9jb29saW5nLWluLXVzLWluZmxhdGlvbi1zaGFwZWxsYS11cGdyYWRlLWxpZnRzLWNyeXB0by1tYXJrZXQtYml0Y29pbi1uZWFycy0zMC01MDAtZXRoZXItdXAtNi9hbXAtMTE2ODEzNzk2MjU0OTMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Cooling in US inflation, Shapella upgrade lifts crypto market; Bitcoin nears $30,500, Ether up 6% | Mint - Mint",
        "content": "The crypto market continues it's gaining spree with the leader Bitcoin reaching near $30,500 levels, and Ethereum picking up by over 6%. There are a host of positives for cryptocurrencies. These would be sharp cooling in US inflation, and also Ether's Shapella upgrade which is set to be released. Globally, the market witnessed strong demand in both value and volume.\n\nAt the time of writing, on CoinMarketCap, the global crypto market traded at $1.25 trillion up by 2.29% over the previous day. The total volumes in cryptocurrencies zoomed nearly 20% to $48.78 billion over the previous day.\n\nThe market's biggest booster is inflation data. The US consumer price index of all items stood at 5% by end of March 2023 --- which is the lowest since May of 2021. It is also better than Street's expectations of 5.2%. However, inflation continues to stay above US Fed's target levels.\n\nBitcoin traded near $30,225 up by nearly a percent. The crypto has touched an intraday high of $30,462.48 --- which is the 7-day high and also a 1-month high. The crypto hit a 3-month high of $30,509.08 earlier.\n\nCoinDCX Research Team earlier said that if March CPI will be lower than previous months, which could potentially benefit Bitcoin if the Federal Reserve decides to pause rate hikes.\n\nFurther, Ethereum which is the second largest cryptocurrency, traded near $1,982 up by 6%.\n\nBoth Bitcoin and Ether have recorded around 8% and 6% jump in 7 days.\n\nOn the latest cryptocurrencies performance, Sumit Gupta, Co-Founder & CEO, CoinDCX said: “The ETH Shapella upgrade is important on 3 counts: security, improved user experience, and more control. The upgrade involves making changes to two important layers in the network - the execution layer and the consensus layer. One of the most important changes being introduced - EIP-4895 - is a new mechanism that will improve the security of the Ethereum network. The ETH network will now be more efficient and reliable and provide an improved customer experience.\"\n\nGupta added, \"Hopefully this will also inspire other blockchain platforms to make the transition to more sustainable consensus algorithms. This upgrade will enable users to stake, earn ETH rewards distributed automatically, unstake to regain full access to their accounts or restake to start over. Post this upgrade, the investor can expect high transaction speed and lower gas fee.\"\n\nMeanwhile, Parth Chaturvedi, Crypto Ecosystem Lead, CoinSwitch said, \"The much-awaited Shanghai upgrade and the US’s CPI data have hardly impacted Bitcoin and Ethereum prices. Despite the expectation from investors of an aggressive response from markets, BTC continued trading in the $30k zone and went below the mark multiple times in the last 24 hours, while ETH is in the $1.9k zone.\n\nIn alignment with Glassnode’s prediction, Chaturvedi added, \"We don’t see any selling pressure on ETH, which is up ~1% in the past 24 hours, as of around 8 AM today. Around half an hour after the Shanghai upgrade was activated, around 285 withdrawals had been processed for about 5,413 ETH ($10 million worth). In high spirits, investors and blockchain developers have already begun mapping the next steps, i.e., the Verge, Purge, and the Scourge.\"\n\nIn other news, CoinSwitch stated that Argentina has made an official move in crypto by authorising its National Securities Commission (CNV) to launch a bitcoin (BTC) index-based futures contract. Additionally, El Salvador granted its first license for digital asset service providers to BitFinex yesterday. We can expect such moves to positively impact investor sentiment and boost market performance.\n\nInvestor sentiment seems to remain strong, he said.\n\nDisclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before taking any investment decisions.\n\nMilestone Alert! Livemint tops charts as the fastest growing news website in the world 🌏 Click here to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL3d3dy5tb25leWNvbnRyb2wuY29tL25ld3MvYnVzaW5lc3MvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1zbWFzaGVzLTMwMDAwLWJhcnJpZXItY3J5cHRvLXRpdGFucy1wcmVkaWN0LWJpZy1yYWxseS1haGVhZC0xMDQxMjExMS5odG1s0gGPAWh0dHBzOi8vd3d3Lm1vbmV5Y29udHJvbC5jb20vbmV3cy9idXNpbmVzcy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLXNtYXNoZXMtMzAwMDAtYmFycmllci1jcnlwdG8tdGl0YW5zLXByZWRpY3QtYmlnLXJhbGx5LWFoZWFkLTEwNDEyMTExLmh0bWwvYW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin smashes $30,000 barrier, crypto titans predict big rally ahead - Moneycontrol",
        "content": "Bitcoin surpasses $30,000 mark as investors eye end of rate rises\n\nBitcoin is nearing a crucial technical milestone about a year away, which may potentially spark a sustained uptick in the cryptocurrency's worth.\n\nThe forthcoming ‘halving’ for Bitcoin is estimated to take place around April or May 2024, though the exact timing is yet to be determined.\n\nStory continues below Advertisement Remove Ad\n\n‘Halvings’ reduce the rate at which new coins are created and thus lower the available amount of new supply.\n\nAs of Thursday morning, one Bitcoin was valued at roughly $30,200, according to data from CoinGecko. The world's leading cryptocurrency has seen a remarkable increase of over 80 percent since the start of the year.\n\nIn the past few weeks, Bitcoin's price has been climbing, driven by an anticipation of the impending halving and the potential for a US Federal Reserve interest rate reduction. They might offset the impact of decelerating growth and constricting credit conditions due to the challenges in the banking sector.\n\nBitcoin has gained 2% over the last 24 hours.\n\nReasons behind rally and what the future holds\n\nSpeaking to Moneycontrol, leading industry experts weighed in on the reasons behind the price rise and shared their expectations for the future of Bitcoin.\n\nStory continues below Advertisement Remove Ad\n\nStory continues below Advertisement Remove Ad\n\nRuadhan O, the lead developer of Seasonal Tokens said, \"Bitcoin’s rate of production was cut into half in 2020. Since then, they have gradually become scarcer.\"\n\nThere are four Seasonal Tokens --Spring, Summer, Autumn, and Winter. They have been designed to increase price in a predictable sequence. For example, prices tend to go up in Spring, then Summer, Autumn, Winter, and Spring again.\n\nHe also mentioned that market fears in 2022 delayed the price adjustment. He believes the next major barrier is around $32,000, and if upward pressure continues, \"the price could quickly escalate from $32,000 to $35,000, as the bears are forced to cover their short positions.\"\n\nFurthermore, he anticipates that the entire crypto market is likely to move alongside Bitcoin.\n\nNischal Gaba, CMO of DefiEdge, acknowledged divided opinions on Bitcoin's recent surge, with some analysts believing it signals the end of the bear market.\n\nHowever, he also highlighted concerns about the dull trading volume, which some see as a sign that the current rally may be a fakeout.\n\nGaba emphasised the importance of closely observing BTC's movement in the next few weeks to determine the nature of the price change.\n\nStart of a bull run?\n\nBlake Harris, the Founding Principle of Blake Harris Law, pointed out that factors such as bank failures and government responses by printing more money have made Bitcoin more attractive.\n\n\"This does appear to be the start of another bull run,\" he said.\n\nHowever, he also cautioned that \"if the recession gets worse, we should expect Bitcoin to also drop.\" Harris believes the next resistance level could be around $70,000, but he expects altcoins to swing in the same direction as Bitcoin, albeit to a lesser extent.\n\nPavel Matveev, CEO and Co-Founder of Wirex, attributed BTC's move to $30,000 to its return as a non-correlated store of value and changes in centralised exchange BTC dynamics.\n\nHe predicts a slight retrace in BTC price in the short term and emphasises the ongoing economic and regulatory challenges that will continue to impact crypto prices.\n\nGabby Kusz, CEO of the Global Digital Asset & Cryptocurrency Association, believes Bitcoin's rally will continue, with the next resistance level at about $50,000.\n\nShe expects altcoins to tip upwards when Bitcoin is up, but to a lesser degree than in previous rallies.\n\n\"Given the underlying reason for a Bitcoin rally at this point, it’s clear commodity classification, I would expect altcoins to tip upwards when Bitcoin is up but at a far less degree to which we have seen under previous Bitcoin rallies,\" she said.\n\nEric Chen, CEO and Co-founder of Injective Labs, and core contributor to Injective said the surge in the price of Bitcoin could potentially lead to increased interest and investment from both retail and institutional investors.\n\nChen, however, emphasised the importance of acknowledging the unpredictable nature of the crypto market and the likelihood of continued price fluctuations.\n\n\"In terms of what to expect next for digital assets, it's difficult to make concrete predictions. However, there are several trends and developments that could have an impact on the crypto market in the coming months and years. They include increased institutional adoption, regulatory developments, and innovation with new use cases for cryptocurrencies and blockchain technology,\" Chen said."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJ1c2luZXNzd2lyZS5jb20vbmV3cy9ob21lLzIwMjMwNDEzMDA1NDU3L2VuL1N0YWJvbHV0LUxhdW5jaGVzLU5ldy1CaXRjb2luLWJhY2tlZC1EZWNlbnRyYWxpemVkLVN0YWJsZWNvaW4tVVNC0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Stabolut Launches New Bitcoin-backed, Decentralized Stablecoin, USB - Business Wire",
        "content": "HONG KONG--(BUSINESS WIRE)--Stabolut, a startup building a completely new worldwide payments ecosystem, today announced the launch of a decentralized, dollar-pegged, Bitcoin-backed stablecoin that is not reliant on banks, called USB. Available as of today, USB is a stablecoin issued under a groundbreaking model built on decentralized pillars of trustless infrastructure and security that have made Bitcoin the world’s most trusted and reliable cryptocurrency.\n\nBecoming available on a private beta starting today, USB (US-Bitcoin), a stablecoin that has been built in a revolutionary approach that will reroute the crypto markets unlocking new opportunities for fast and simple trades to power exchanges, financial institutions, businesses, developers, and users.\n\nUSB enters a very hot market, with stablecoins totaling 140 billion in capitalization, and expected to grow to at least 1 trillion dollars.\n\nLeaders in the cryptocurrency industry have been long calling for a stablecoin that is truly decentralized, privacy-preserving and backed by assets that have been verified and audited along with being invulnerable to shutdowns.\n\n“Stabolut is setting the new industry leading standards for moving financial value across the internet and crypto markets with USB,” said Eneko Knorr, co-founder and CEO of Stabolut. “There is clear market demand from users for a reliable stablecoin choice, given the collapse of UST -Terra Luna’s stablecoin-, as well as witnessing the recent instability caused by the de-pegging of USDC following recent bank failures we have seen this year. With USB, Stabolut aims to unlock a new era of transparent, privacy-preserving, fast, inexpensive, and interoperable exchange across the globe,” adds Julian Beltran, co-founder and CTO of Stabolut.\n\nWhile trading futures on BitMEX -the derivatives cryptocurrency exchange- back in 2018, Julian realized how hedging Bitcoin would make it possible to develop a stablecoin pegged to the USD value without having to rely on any stored fiat currency. However, it was not until last year when Eneko Knorr, his now cofounder, joined him to kickstart the project.\n\nIn September 2022, Stabolut embarked on the development of USB, a Bitcoin-backed stablecoin designed to reflect the value of the US Dollar through an innovative method: shorting Bitcoin via a Bitcoin inverse perpetual swap. Asset-backed USB eliminates the need for bank accounts, ensuring immunity from crackdowns or frozen funds, and bolstering complete privacy and resilience. Fiat-backed stablecoins face centralization and regulatory hurdles, limiting access and innovation while increasing counterparty risk and reducing user privacy. USB’s approach aligns with Bitmex co-founder Arthur Hayes' recent Nakadollar (NUSD) concept.\n\n“USB addresses the limitations of fiat-backed stablecoins, which suffer from centralization and regulatory challenges. By both mitigating counterparty risks and enhancing user privacy, we aim to expand the accessibility and foster innovation in the stablecoin market,” expressed Eneko Knorr.\n\nUSB provides additional benefits such as real-time audits of the assets to ensure transparency and reliability to their users.\n\nStabolut is backed by the founders of Dextools.io, a growing ecosystem with over 30 million monthly views on average. Dextools.io is a platform where traders can keep track of all details about the state of decentralized markets.\n\nOn USB, Frederic Fernandez, co-founder of Dextools.io, expressed the need of addressing CeFi’s shortcomings from previous terms:\"Following the collapse of FTX, Silvergate Capital, Silicon Valley Bank, and many other CeFi platforms in 2022, it is evident that DeFi and the entire crypto industry need better ways to safeguard users’ funds and, most importantly, restore their trust. USB is what we all were looking for.“\n\nTo learn more about the USB stablecoin, visit the Stabolut website.\n\nAbout Stabolut:\n\nStabolut is building an innovative global payments ecosystem. Launched by Julian Beltran and Eneko Knorr, serial entrepreneurs with solid backgrounds in tech and crypto, Stabolut is the issuer of the USB stablecoin. The digital currency is poised to solve all concerns other stablecoins bear, with the clear goal to become one of the most widely adopted stablecoins. Stabolut received funding from the Dextools.io cofounders, a platform that allows traders to track information about decentralized markets.\n\nLearn more: www.Stabolut.com"
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2hvdy10by1idXktYS1jYXItd2l0aC1iaXRjb2luLWNyeXB0by_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "How to Buy a Car with Bitcoin & Crypto? - Analytics Insight",
        "content": "If someone told you back in 2009 that 2023 would be the year you could buy a car using Bitcoin or any other cryptocurrency, you would probably think that the person has a wild imagination. However, people have started opening their minds towards cryptocurrencies slowly, and now we have a situation where cryptos are used on a regular basis for purchasing goods online. If you are wondering how and where you could buy a car with the cryptos you have, we’ve got your back!\n\n>>>Buy a Car With Crypto Now<<<\n\nWhere to buy a car with Bitcoin and other cryptos?\n\nOnce the decision is made, the next question that comes to mind is what marketplace would be the best one for you. Here are the best marketplaces that you should consider:\n\nCrypto Emporium – Overall the best cryptocurrency-only e-commerce store Vegas Auto Galery – The best dealer in Las Vegas specializing in high-end vehicles and services Post Oak Motors – Bugatti, Bentley, and Rolls-Royce dealership that accepts Bitcoin payments\n\nHere is a little bit more about each one of these marketplaces!\n\n>>>Buy a Car With Crypto Now<<<\n\nCrypto Emporium\n\nCrypto Emporium is the first e-commerce platform with various products available for purchase that can be paid for by using cryptocurrencies. This marketplace was established in 2018, and it managed to grow during these past years, becoming a go-to place for anyone who wants to use their cryptos to buy wanted items. Buyers from 125 countries can use it to get the products they like and have them delivered to their home addresses.\n\nThe platform is user-friendly, and finding the wanted item won’t be difficult at all. The cars that are available on this platform range from Porsche to Ferrari and every other luxury car you can think of, so you won’t be disappointed! After finding the car or any other item, you can put it into the virtual cart and then go to the checkout page, where the currency will be Bitcoin, Ethereum, or other listed cryptocurrencies.\n\n>>>Buy a Car With Crypto Now<<<\n\nVegas Auto Galery\n\nEstablished by car enthusiast Nick Dossa, the Vegas Auto Gallery offers a variety of exotic and luxurious vehicles for potential buyers to choose from. It is open to local buyers and the ones located nationwide. This dealership also offers in-house service when necessary.\n\nThe cars you can buy here include Aston Martin models, Audi, BMW, and others. It is important to mention that crypto payments cannot be accepted directly but through BitPay, which may require a lit bit more effort but should not take too much of your time.\n\n>>>Buy a Car With Crypto Now<<<\n\nPost Oak Motors\n\nPost Oak Motors has a large selection of new and pre-owned cars for the buyers to choose from, including Bentley, Rolls-Royce, and others. It accepts Bitcoin as a payment method, which will make the whole process a lot simpler.\n\nThis dealership is dedicated to supporting the luxurious lifestyle of its clients through the service they offer. In addition, there are services regarding repairs and maintenance, which will round up the whole experience.\n\n>>>Buy a Car With Crypto Now<<<\n\nWhat is the Best Place to Buy a Car with Crypto?\n\nThe best place to buy a car with crypto is Crypto Emporium. Crypto Emporium is the ultimate online marketplace where luxury meets cryptocurrency. Offering a curated selection of high-quality goods, seamless transactions, and top-notch customer service, it’s the go-to platform for discerning crypto enthusiasts. Discover Crypto Emporium, and experience the future of effortless, secure, and luxurious shopping. Here are some of the advantages:\n\nTrusted Since 2018\n\nCompetitive Prices\n\nDelivery To 125+ Countries\n\nCertified Authentic Products\n\n24/7 Customer Support\n\nOrder Tracking via Email & SMS\n\n>>>Buy a Car With Crypto Now<<<\n\nWhy is buying a car with crypto convenient?\n\nCryptocurrencies have proven that they are here to stay. Bitcoin opened the door to this huge market that will continue to grow, and it is up to you to use the benefits this market has to offer. There are a few reasons why this way of purchasing a car could be ideal:\n\nYou want to use the cryptos you have accumulated\n\nThe process is easy\n\nThere is often a discount involved\n\nIf you have been investing for a while now and now you would like to make your dream come true, there is no better way than starting with a car. The process is very simple, and the dealerships often give discounts to promote the use of cryptos and help out the buyers to make a decision.\n\n>>>Buy a Car With Crypto Now<<<\n\nHow to buy a car with crypto?\n\nOnce you choose the marketplace that you like and it accepts cryptocurrency as a way of payment, the rest will be a walk in the park! Choose the car that you would like to own and put it into the virtual cart. The next step would be to use your crypto wallet to transfer the necessary funds to the marketplace.\n\nIn cases when direct payments are not possible, a BitPay crypto card enables the users to use it like they would any other card. However, instead of transferring Fiat currency, this time, the crypto is transferred from the crypto wallet. This means that the car you like can become yours pretty quickly and without any hassle.\n\n>>>Buy a Car With Crypto Now<<<\n\nFAQs about paying for the car with Bitcoin\n\nWhat cryptocurrency can I use to buy a car?\n\nCryptocurrencies that can be used for buying a car are Bitcoin (BTC), Ethereum (ETH), Bitcoin Cash (BCH), Dogecoin (DOGE), Shiba Inu (SHIB), and many others. The list could go on and on, but the specific cryptocurrency accepted is determined by the chosen dealership.\n\nWhat cars can I buy with cryptocurrency?\n\nThere are no limitations when it comes to the model of the car that can be bought with Bitcoin. After choosing the marketplace that accepts it as a way of payment, you can choose any car you like listed in the marketplace.\n\nConclusion\n\nBuying a car using cryptocurrency is not a dream anymore but a reality. If you have been thinking about purchasing a Porche, Ferrari, or any other car, it’s a piece of cake with Crypto Emporium. This marketplace is in first place on our list for a good reason – it has proven its trustworthiness time and time again, so what are you waiting for?\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tcHJpY2UtcHVtcHMtcGFzdC0zMDAwMC13aGlsZS1uZXctbWVtZS1jcnlwdG8taGl0cy0zLTctbWlsbGlvbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Price Pumps Past $30,000 - While New Meme Crypto Hits $3.7 MILLION - Analytics Insight",
        "content": "Bitcoin (BTC), the world’s most popular cryptocurrency, recently soared past the crucial $30,000 price level, setting off a flurry of speculation about its next move. With its volatility and unpredictable nature, Bitcoin’s price prediction remains a hot topic among investors and enthusiasts alike.\n\nBesides Bitcoin, there’s a hot new crypto in town called Love Hate Inu (LHINU) that’s capturing everyone’s attention. With its unique blend of meme coin fun and utility-based approach that’s never been seen before, it’s creating a buzz in the market. Already raising over $3.7 million and counting, this project is definitely one to watch. Before that, let’s take a closer look at Bitcoin breaking $30K.\n\n>>>Get The Best Crypto Now<<<\n\nBTC Skyrockets To New Heights As Cryptos Rally\n\nBitcoin (BTC) and other digital assets have been on a remarkable rally, with BTC surging past a key level to reach its highest point since the crypto crash last summer. During the last few hours, Bitcoin’s price has jumped 6% to $30,100, marking an 80% increase since the beginning of the year. This surge has sparked calls for a new bull market, and many investors are taking notice.\n\nAnalysts are optimistic about the current price pattern and expect further upward momentum. Many experts believe that although some profit-taking may occur at the current level, the price will likely continue rising due to the strong momentum. In fact, bearish traders with short positions have already been wiped out, with over $150 million in Bitcoin shorts liquidated since Monday, potentially adding further upward pressure to the market.\n\nBitcoin’s return above the psychological level of $30,000 is seen as a bullish signal to traders, as it hasn’t reached this level since the crypto industry faced a series of collapses last June. The bullish sentiment is also fueled by Bitcoin’s sensitivity to macroeconomic forces, including its correlation with stocks. Although Bitcoin is outperforming the Dow Jones Industrial Average and S&P 500 this year, the Federal Reserve hiked interest rates to fight inflation previously. However, Bitcoin prices have rebounded this year because of expectations that the Fed will be more accommodative.\n\nInvestors are eagerly awaiting inflation data due in the coming days, including the consumer price index (CPI) and producer price index (PPI), as it could solidify bets on the Fed’s next move, potentially leading to a pause on rate hikes. James Lavish, Managing Partner at the Bitcoin Opportunity Fund, suggests that if Bitcoin pushes through the $30,000 level with conviction, it could see further gains into the mid-to-high $30,000s, forcing short speculators to cover and buy.\n\nMillions Made Quickly: Another Crypto Soars to New Heights\n\nWhile Bitcoin is grabbing headlines for reaching new heights since the previous crypto market downturn, there’s another cryptocurrency that’s been making waves with its unique approach. Let’s take a closer look at what this crypto is all about and why it’s causing a stir in the market.\n\n>>>Buy Love Hate Inu Now<<<\n\nLove Hate Inu (LHINU) – Earn Crypto for Your Opinions\n\nLove Hate Inu (LHINU) is a fascinating new meme coin project that’s all about leveraging the power of Web3 and blockchain technology to revolutionize the survey industry. With its unique Vote-2-Earn (V2E) mechanism, you can participate in polls on a wide range of topics and earn rewards for your input. From the latest pop album releases to hypothetical scenarios like the election of a North Korean president (yes, they’ve got polls for that, too!), LHINU offers a fun and engaging way to voice your opinions and earn crypto rewards in the process.\n\nOne of the coolest things about LHINU is that it’s built on the Ethereum network, which means that every poll entry is recorded on the blockchain. This ensures transparency and reliability in the poll results, giving users peace of mind that their votes are secure and verifiable.\n\nThe Love Hate Inu team is dedicated to bringing real-world utility to the meme coin space. Their innovative Vote-2-Earn (V2E) model is a game-changer, combining the excitement of meme coins with a practical use case that has been lacking in the industry for a long time.\n\n>>>Buy Love Hate Inu Now<<<\n\nPutting The Power Back In The Hands Of The Community\n\nThe great thing about Love Hate Inu is during its presale; they’re selling a whopping 90% of the tokens, so there’s no risk of developers swiping your money and running off. The remaining 10% is reserved for rewards and Initial Exchange Offerings (IEOs). This makes LHINU a true community project, with tokens available for fans to participate and vote in the polls.\n\nUnlike other projects where tokens are divvied up among founders or big investors, Love Hate Inu is all about giving the power back to the community. With LHINU tokens required for voting, every poll reflects the genuine opinions of Love Hate Inu fans.\n\nOnce the platform launches, the development team will kick off with creating polls, but the plan is to eventually hand things over to the community by the end of 2023. That means the community gets to decide which polls to introduce and whether they should be up for a vote. It’s all about giving the community a voice and making LHINU truly community-driven.\n\n>>>Buy Love Hate Inu Now<<<\n\nBreaking Records: Presale Hits Unprecedented Heights\n\nLove Hate Inu’s presale has been a smashing success, raising an impressive $3.7 million and counting. With a hard cap of $10 million, it’s expected to surpass this limit before the scheduled date, urging investors to act fast.\n\n\n\nCurrently priced at $0.000105, the token is set to increase to $0.000115 in a few days. The project has already gained massive hype, with over 15,000 members in its Telegram group. Investors are excited about the potential for substantial returns, with predictions of up to 45x, making Love Hate Inu a hot option for those looking to ride the wave of meme token popularity.\n\n>>>Buy Love Hate Inu Now<<<\n\nConclusion\n\nAs Bitcoin breaks past $30,000 and continues its upward momentum, investors and enthusiasts are eagerly watching its next moves. Meanwhile, Love Hate Inu (LHINU), the hot new meme crypto, is making waves with its unique Vote-2-Earn (V2E) mechanism, bringing real-world utility to the meme coin space. With a successful presale raising over $3.7 million and counting, LHINU’s community-driven approach and innovative use case are garnering attention in the crypto market. So go ahead and get your LHINU tokens.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpZy1leWVzLWNvaW4tZXRoZXJldW0tYW5kLWJpdGNvaW4taXMtdGhpcy10aGUtYnVsbC1tYXJrZXQtaW52ZXN0b3JzLWhhdmUtYmVlbi13YWl0aW5nLWZvci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Big Eyes Coin, Ethereum, and Bitcoin: Is This the Bull Market Investors Have Been Waiting for? - Analytics Insight",
        "content": "In the last ten years, the finance sector has seen the rise of digital currencies such as Bitcoin (BTC), Ethereum (ETH), and Big Eyes Coin (BIG). This development has had varying effects on the prices of traditional commodities like gold, silver, and other precious metals. It’s evident that the surge in digital assets has influenced the prices of gold and silver and vice versa. In the current year, both the prices of gold and silver and cryptocurrencies have been on the rise, prompting speculation among financial market enthusiasts about a potential bull market.\n\nAnticipating the Big Release of Big Eyes Coin\n\nBig Eyes Coin is a new cryptocurrency project that has attracted a significant following. The project aims to create a platform for artists and collectors to trade and invest in digital art. Big Eyes Coin’s community, known as the Cat Crew, is eagerly anticipating the bull run as gold and silver prices increase along with cryptocurrencies.\n\nWise investors who bought Big Eyes Coin during its early presale stages are celebrating the remarkable increase in its value over time. At stage 1 of the presale, each Big Eyes Coin was worth $0.0001, but as of stage 12, its value has risen to $0.00049, which represents a 390% increase. Investors who wait too long to invest in the token could miss out on opportunities as the price of the coin is set to increase with each presale stage. Therefore, it is crucial to invest early to maximize returns.\n\nMoreover, Big Eyes Coin is offering its bonus code BULLRUN250 for crypto fans and financial market enthusiasts who want to get an extra 250% on their next BIG purchase.\n\nBitcoin’s Soaring Price: Should You Consider Investing Now?\n\nBitcoin has a strong relationship with gold and silver, while its relationship with the stock market has weakened. Crypto analysts and financial market experts have observed this phenomenon as news of the banking crisis flooded the internet. BTC welcomed a new rally twice in the middle of March, and its price continues to climb.\n\nThis could be a good opportunity to invest in Bitcoin if investors are willing to hold onto BTC for several years. Token holders can also buy BTC in small sizes to avoid worrying about buying too high. However, investors must still remember that prices may continue to rise over time. As of the time of this writing, Bitcoin is valued at $28,480 and has seen a 1.44% increase in the last seven days.\n\nEthereum Breaks Through Resistance Level Barrier\n\nThe crypto market has seen a positive trend with Ethereum, the second-largest cryptocurrency by market capitalization, breaking the $1,900 resistance level for the first time in seven months. The cryptocurrency is currently trading above $1,910, which is an encouraging sign for Ethereum investors. ETH was last valued at this price on August 16th, 2022, during a crypto market downturn. This occurred as the United States Federal Reserve raised the Federal Funds rate in an attempt to combat inflation.\n\nIs a Bull Market Approaching? Consider Your Investment Opportunities Now\n\nThe bull market presents an exciting opportunity for investors looking to capitalize on the rising prices of crypto coins and positive market sentiment. This is the best time to invest in crypto as the upward trend is likely to continue. As the price of Ethereum continues to rise, it is expected to reach the next stop of $2,000. The upcoming Ethereum 2.0 upgrade, which aims to improve the network’s scalability, security, and energy efficiency, is expected to make Ethereum even more appealing to investors and developers.\n\nLooking for the next crypto to enhance your portfolio? Check out Big Eyes Coin today.\n\nVisit Big Eyes Coin’s (BIG) website and social media:\n\nPresale: https://buy.bigeyes.space/\n\nWebsite: https://bigeyes.space/\n\nTelegram: https://t.me/BIGEYESOFFICIAL\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMimQFodHRwczovL3d3dy5iZW56aW5nYS5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS8yMy8wNC8zMTc5ODU4NS9uZmxzLWFhcm9uLXJvZGdlcnMtaGFpbC1tYXJ5LWZvci0yMDI0LXByZXNpZGVudGlhbC1lbGVjdGlvbi1mZWxsb3ctYW50aS12YXh4ZXItcm9iZXJ0LWtlbm7SAS1odHRwczovL3d3dy5iZW56aW5nYS5jb20vYW1wL2NvbnRlbnQvMzE3OTg1ODU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "NFL's Aaron Rodgers' Hail Mary For 2024 Presidential Election: Fellow Anti-Vaxxer Robert Kennedy Jr. - Benzinga",
        "content": "A leading National Football League player has shown early support for a presidential candidate ahead of the 2024 election. Here’s who quarterback Aaron Rodgers is supporting and how one important platform plays into the potential support.\n\nWhat Happened: The 2023 NFL offseason has seen the retirement of Tom Brady for a second time and a looming decision between the Green Bay Packers and star quarterback Aaron Rodgers for the second straight season.\n\nRodgers has expressed his intent to get traded to the New York Jets and leave the Packers. The team has not made a trade official, but many believe it will happen before the start of the 2023 season.\n\nWhile Rodgers has been outspoken about his intent to leave the Packers and play for a new team in 2023, the quarterback could also be sharing his early opinion on the 2024 presidential election.\n\nWith an Instagram stories post, Rodgers shared a promotion of a podcast interview featuring anti-vaxxer Aubrey Marcus and anti-vax presidential candidate Robert Kennedy Jr. In the post, Rodgers showed the hashtag #kennedy2024 and two flexed bicep emojis, alongside two heart emojis. Rodgers has been a guest on Marcus’ podcast several times.\n\nKennedy Jr., the son of former presidential candidate Robert Kennedy and nephew of former President John F. Kennedy, filed to run for president as a Democrat in the 2024 election.\n\nWith his anti-vax platform, Kennedy Jr. has seen his family distance themselves from him, according to the Washington Post. Kennedy Jr. previously compared COVID-19 vaccine mandates to the Holocaust and said that things were worse during COVID-19 with mandates than they were for Anne Frank, a comment he later apologized for.\n\nPresident Joe Biden has not officially declared his intent to run for president in 2024 but an announcement is expected anytime and Biden is the current favorite to get the Democratic nomination.\n\nKennedy Jr. is seen as a longshot to win the Democratic nomination and overall 2024 election. Betting odds from Covers show Kennedy Jr. listed at odds of +10,000, implying a 0.99% chance of becoming the next president.\n\nRelated Link: Aaron Rodgers Says Ayahuasca Helped Him Achieve 'Best Season' Of His NFL Career And Love Himself\n\nAnti-Vax and Anti-Crypto?: Rodgers support for Kennedy Jr. comes as both have been well-known for their stances on vaccinations.\n\nKennedy Jr. has been a major advocate against vaccines, which has led to the presidential candidate being banned from Instagram and having an organization he backs banned from Instagram and Facebook.\n\nRodgers faced backlash after previously saying he was “immunized” against COVID-19 and misleading the public and potentially the NFL about his vaccine status. Rodgers missed an NFL game in the 2021 season after testing positive for COVID-19.\n\nThe Packers quarterback said he underwent alternative treatment because of being allergic to an ingredient in the vaccines from Pfizer and Moderna.\n\nWhile it shouldn’t come as a huge surprise that Rodgers is backing a fellow anti-vax candidate, Kennedy Jr. and the quarterback may differ on opinions on another topic, the world of cryptocurrency.\n\nKennedy Jr. has been vocal as a candidate against central bank digital currencies (CBDCs).\n\n“CBDCs grease the slippery slope to financial slavery and political tyranny,” Kennedy Jr. said. “A CBDC tied to digital ID and social credit score will allow the government to freeze your assets or limit your spending to approved vendors if you fail to comply with arbitrary diktats, i.e. vaccine mandates.”\n\nWhile Kennedy Jr. is speaking out against CBDCs, he could show future support for Bitcoin with additional comments.\n\n“Cryptocurrencies like Bitcoin give the public an escape route from the splatter zone when this [financial] bubble invariably bursts,” Kennedy Jr said.\n\nRodgers has been a proponent of Bitcoin BTC/USD and cryptocurrency over the years. In 2021, the quarterback announced a partnership with CashApp, a unit of Block Inc SQ.\n\n“I’m pumped to share that I’ve recently teamed with CashApp, they’ve enabled me to take part of my salary in Bitcoin for the very first time,” Rodgers said in a video.\n\nRodgers also offered fans the chance to win $1 million in Bitcoin through the partnership.\n\n“I believe in Bitcoin & the future is bright.”\n\nRodgers was also featured at the Bitcoin 2022 Conference where he encouraged college athletes who have NIL and scholarship money to invest a portion into cryptocurrencies like Bitcoin.\n\n“The Fed keeps printing trillions of dollars, you know, the best defense against inflation, I believe is Bitcoin, and they will keep printing money.”\n\nRead Next: Trump Gains Against DeSantis In New Poll After Indictment, Here's How He Matcches Up Against Biden For 2024 Election\n\nPhotos: Shutterstock"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbnMtZmluYWwtcHVsbGJhY2stY2xlYXJzLXRoZS13YXktZm9yLWl0cy1ibGFzdG9mZi10by10aGUtbW9vbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 13 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's final pullback clears the way for its blastoff 'to the Moon' - Finbold - Finance in Bold",
        "content": "After Bitcoin (BTC) finally managed to cross the psychological barrier at $30,000, cryptocurrency analysts are predicting more success to follow for the flagship decentralized finance (DeFi) asset due to the historical chart patterns indicating it has completed all the necessary prerequisites to start a major bullish rally.\n\nIndeed, Bitcoin has completed its last pullback “before heading to the Moon,” i.e., toward $190,000, while the new bottom before an all-time high (ATH) is expected to be in the $29,000 – $30,000 area, according to a projection shared on Twitter by pseudonymous crypto analyst BitQuant on April 13.\n\nBitcoin price action analysis and prediction. Source: BitQuant\n\nOne day before, the crypto market analyst published a slightly different assessment, arguing that the price of Bitcoin typically undergoes two retests after breaking the 10-week EMA (exponential moving average). In the same tweet, BitQuant also stressed that “in this particular cycle, we are still awaiting the final retest before the price skyrockets to $190,000.”\n\nThis earlier prediction was based on the observed activities of the maiden digital asset in 2020 and 2021, when the 10-week EMA and the bottom were, indeed, followed by two retests, after which the price soared toward the ATH of $69,000, which it finally reached in November 2021.\n\nBitcoin price action analysis and prediction. Source: BitQuant\n\nIf today’s updated projection is correct, it would mean that there are no further obstacles for Bitcoin to start its move toward $190,000, which the analyst expects will materialize in 2024.\n\nBitcoin price analysis\n\nIn the meantime, the price of Bitcoin at press time stood at $30,210, recording an increase of 0.66% on the day and 7.14% across the previous week, adding up to the monthly gain of 24.94% and 81.69% since the year’s turn, as per the latest data retrieved on April 13.\n\nBitcoin year-to-date (YTD) price chart. Source: Finbold\n\nElsewhere, Bitcoin has been demonstrating significant strength against fiat currencies such as the United States Dollar (USD), the British Pound (GBP), the Chinese Yuan (CNY), and the Russian Ruble (RUB), which have all been going through a bloodbath in recent months, as Finbold reported on April 11.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYm9sZC5jb20vbnVtYmVyLW9mLWJpdGNvaW4tbWlsbGlvbmFpcmVzLWRvdWJsZS1pbi0yMDIzLWFkZGluZy1vdmVyLTUwMDAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Number of Bitcoin millionaires double in 2023 adding over 50,000 - Finbold - Finance in Bold",
        "content": "As we enter the second quarter of 2023, Bitcoin (BTC) has continued its impressive run, gaining over 80% year to date. This surge in value has sparked renewed optimism around the cryptocurrency, and as a result, the number of Bitcoin millionaires has doubled. Just halfway through April, over 50,000 new Bitcoin millionaires emerged.\n\nAccording to data compiled by Finbold, the number of Bitcoin millionaire addresses as of April 14 stood at 80,659, representing an increase of 52,575, or 187%, from the January 5 figure of 28,084 BTC millionaire holders.\n\nBitcoin millionaires. Source: BitInfoCharts.com\n\nAs per the data provided by BitInfoCharts.com, 74,912 different addresses have a Bitcoin balance valued at over $1 million. Additionally, 5,747 addresses hold BTC worth over $10 million.\n\nUsing the web archive tool Wayback Machine, on January 5, 2023, about 24,279 addresses owned Bitcoin, equivalent to at least $1 million, while 3,805 addresses accounted for BTC valued at over $10 million.\n\nBitcoin millionaires January 5, 2023. Source: BitInfoCharts.com\n\nBitcoin rally leads to new BTC millionaires\n\nThe recent surge in Bitcoin price and the emergence of new millionaires can be attributed to the crypto market overcoming the bearish conditions of 2022, which were marked by high inflation and incidents such as the FTX collapse.\n\nDespite the banking crisis that unfolded in March and the uncertainty surrounding Binance, Bitcoin has continued to climb, recently reaching a peak of $31,000.This solid upward trend suggests that the crypto market is continuing to gain momentum, despite the challenges it has faced in the past.\n\nAs investors seek to diversify their portfolios and capitalize on the potential of digital assets, Bitcoin remains a leading choice for those looking to ride the wave of this exciting and dynamic market.\n\nAs things stand, Bitcoin is trading at $30,710 and has gained 1.6% in the last 24 hours and a further 10% across the previous week, with a total market capitalization of $594 billion, as per the data retrieved by Finbold on April 14.\n\nBitcoin 1-day price chart. Source: Finbold\n\n\n\nCrypto trading analyst Michael van de Poppe noted in a tweet on April 14 investors should brace themselves for some shallow corrections as it looks to test key resistance points at $31,700 – $32,000.\n\nMeanwhile, the crypto community predicted that Bitcoin’s average price by the end of April would be $23,561 with 83% historical accuracy. On the other hand, the machine learning algorithms forecasted a higher price of $30,697, closer to its current price for the same date.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1idWxscy1iZXdhcmUtY3J5cHRvLXRyYWRpbmctZXhwZXJ0LWxvY2F0ZXMtbmV4dC1tYWpvci1odXJkbGUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin bulls beware: Crypto trading expert locates next major hurdle - Finbold - Finance in Bold",
        "content": "Bitcoin’s (BTC) recent performance has been nothing short of impressive. After breaking above the key resistance level of $30,000 for the first time since June 2022, the digital currency has continued to climb, registering a staggering 80% year-to-date gain and briefly breaking above $31,000.\n\nThis has happened despite significant uncertainty in the banking industry and the wider financial markets. The fact that Bitcoin has managed to maintain its upward momentum in such challenging conditions is a testament to its resilience despite lingering doubts from some critics, the digital currency has proven itself to be a viable investment option for many, and the market has responded accordingly.\n\nCrypto trading analyst Michael van de Poppe noted in a tweet on April 14 investors should brace themselves for some shallow corrections along the way. The digital currency has shown great strength, but there’s always the possibility of setbacks, and it’s important to be prepared.\n\nAccording to van de Poppe, one of the key resistance points to watch out for is $31,700 – $32,000. This level has proved to be a tough nut to crack for Bitcoin in the past, and it could be a significant obstacle to the digital currency’s upward momentum. With investors closely watching the market, the price may face some downward pressure at this level.\n\nBitcoin’s next resistance level. Source: Michael van de Poppe\n\nBitcoin entry points to look out for\n\nAt the same time, van de Poppe observed that $25,000 was previously seen as the ideal buy level. However, this level is expected to shift to $28,500 in the near future. When this happens, investors who are looking to enter the market at a discount should keep an eye out for this level as a good entry point.\n\nMoreover, van de Poppe also highlighted the importance of $29,700. This level is just below the critical resistance point of $31,700 – $32,000 and could provide an important clue for Bitcoin’s upward potential.\n\nBitcoin’s technical analysis (TA) on TradingView’s 1-day gauges are bullish; its summary aligns with the ‘buy’ sentiment at 14, resulting from oscillators pointing at ‘sell’ at 4 and moving averages (MA) indicating a ‘strong buy’ at 14.\n\nBitcoin technical analysis 1-day gauges. Source: TradingView\n\nCurrently, Bitcoin is trading at $30,733, up over 1% on the day and a further 10% across the previous week, with a total market capitalization of $594 billion, as per the data retrieved by Finbold on April 14.\n\nBitcoin 1-day price chart. Source: Finbold\n\n\n\nNotably, with a historical accuracy of 83%, the crypto community said the price of Bitcoin by the end of April would trade at an average price of $23,561, while the machine learning algorithms predicted a price of $30,697 for the same date.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vYnVzaW5lc3Nwb3N0Lm5nL2VkdWNhdGlvbi90ZXRoZXItbHVnYW5vLWNpdHktcGFydG5lci1zd2lzcy11bml2ZXJzaXRpZXMtdG8tZHJpdmUtYml0Y29pbi1lZHVjYXRpb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 14 Apr 2023 07:00:00 GMT",
        "title": "Tether, Lugano City Partner Swiss Universities to Drive Bitcoin Education - Business Post Nigeria",
        "content": "By Adedapo Adesanya\n\nTether Operations Limited (Tether), the technology company supporting the blockchain-enabled platform that powers the largest stablecoin by market capitalization (USD₮), and the Swiss City of Lugano have announced the second inaugural Plan ₿ Summer School programme to drive Bitcoin education.\n\nThe Plan ₿ Summer School was founded to make blockchain education accessible and to shape a new generation of business owners, students, researchers, and more. It is co-organized with Franklin University Switzerland (FUS), Università della Svizzera Italiana (USI), and the University of Applied Sciences and Arts of Southern Switzerland (SUPSI).\n\nLast year, Tether contributed its expertise and knowledge to this initiative by focusing on educating a new generation of students. The previous program gathered 86 students from 29 different countries, including Italy, Switzerland, Taiwan, Canada, Brazil, and Colombia, all of who brought with them a passion for learning about the future of the blockchain ecosystem and exploring new environments.\n\n“A strong focus on education is a vital next step to mainstream adoption of blockchain and the long-term implication of blockchain technology,” said Mr Paolo Ardoino, Tether’s CTO.\n\n“The Plan ₿ Summer School will allow participants to work with leading industry minds on developing peer-to-peer prototypes and deepening their understanding of the technology helping shape the next generation of founders, developers and creators.”\n\nThe focus of this year’s two-week Summer School program will be Bitcoin and Peer-to-Peer technologies and how they will unleash financial freedom and promote the freedom of speech. Course topics will focus on Bitcoin, the Lightning Network, stablecoins, peer-to-peer technologies, mining, blockchain analysis, regulation, self-custody, and more.\n\nStudents will be given the opportunity to choose one of the two-course tracks. The Satoshi track is designed for beginners with little to no experience in coding but with a general interest in the fundamentals of blockchain, and the Pear track is for intermediate to advanced students who are passionate about coding and interested in learning how to build on Peer-to-Peer technologies.\n\n“We are thrilled to welcome the Plan ₿ Summer School once again, and we hope for the same turnout and attendance as the past year. Lugano will keep making its mark as a crypto and educational hub,” said Michele Foletti, Mayor of the City of Lugano. “We hope to educate a new generation of potential employers alongside local academic universities in order to make Lugano a hub for the future.”\n\nProminent industry leaders giving their time to guest lecture at the Plan ₿ Summer School include Paolo Ardoino, CTO of Tether, Adam Back, the CEO of Blockstream, Giacomo Zucco, the CEO of Zuckbucks, Sanja Kon, the CEO of UTrust, Riccardo Masutti Cybersecurity and Privacy Consultant focused in Bitcoin and more.\n\nLuca Maria Gambardella, Pro-Rector for Innovation and Corporate Relations at the Università della Svizzera Italiana (USI) stated that he wishes to “promote the Summer School with enthusiasm and commitment, which reinforces the collaboration on education initiated between the partners with the ‘B4B – Blockchain for Business’ course, and which attracts experts, students and professionals from all over the world to Lugano, strengthening the Lugano Città Universitaria project as a place of study, meeting and comparison”.\n\nEmanuele Carpanzano, SUPSI’s Director of Research, Development and Knowledge Transfer, agreed, speaking on behalf of the University of Applied Sciences and Arts of Southern Switzerland, saying: “We are delighted to contribute to the realisation of this Summer School in Lugano, an educational proposal in line with the mission we share with our partners: to transmit knowledge and skills, as well as to network students and professionals with each other”.\n\nKim Hildebrant and Dr. Branko Sain, respectively, President and Dean of Franklin University’s Taylor Institute, also declared, “Lugano’s Plan ₿ is an ambitious project for an ambitious city. We immediately found a common understanding with the Mayor of Lugano and his team around the opportunity to run the first edition of the Summer School last year and the privilege of hosting it again next summer. At Franklin University Switzerland, we believe that any kind of progress, be it social, environmental, economic or technological, requires positive change. And change is fostered by education and by selfless and courageous leadership like that of our City and the three local universities”."
    }
]