[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvc3RhbmRhcmQtY2hhcnRlcmVkLXVwcy0yMDI0LWJpdGNvaW4tcHJpY2UtcHJlZGljdGlvbi10by0xMjAwMDDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Standard Chartered Ups 2024 Bitcoin Price Prediction To $120000 - Nasdaq",
        "content": "By Landon Manning\n\nStandard Chartered, one of the largest banks in the United Kingdom, has made ripples in the financial world by predicting that the bitcoin price could reach $50,000 by the end of the year, and $120,000 by the end of 2024.\n\nStandard Chartered serves a multinational base of individual and corporate clients from its headquarters in London and although it does not conduct retail banking in the U.K., its multibillion dollar operations in Asia, Africa and the Middle East make it one of the most influential financial firms in the world.\n\nAnd this prominent role in the global financial system is what makes it particularly interesting that Standard Chartered made such a bullish prediction for bitcoin earlier this month. Citing recent market activity and subsequent impacts on miners, a report published by the bank suggested that bitcoin is now set for a meteoric rise, bringing its price up to $120,000 by the end of next year.\n\nStandard Chartered’s optimistic outlook is being bolstered by Bitcoin’s hash rate, the amount of computing power being applied to secure the network by miners and an indicator of the network’s strength, which recently hit an all-time high. This latest prediction upped the bank’s previous call that the bitcoin price would reach $100,000 in 2024, an increase motivated by a more optimistic outlook for miner profitability.\n\n“Increased miner profitability per BTC (bitcoin) mined means they can sell less while maintaining cash inflows, reducing net BTC supply and pushing BTC prices higher,” explained Standard Chartered FX analyst Geoff Kendrick.\n\nThe bitcoin price has already risen in value by some 80% since the beginning of 2023. If it jumps up to $50,000 as expected by the bank, Kendrick added that “Over a year, that would reduce miner selling from 328,500 to a range of 65,700 to 98,550 — a reduction in net BTC supply of roughly 250,000 bitcoins a year.”\n\nThe mining ecosystem is not the only reason to be bullish on bitcoin, however. The strong possibility of an approved spot Bitcoin ETF on the horizon could usher in a new wave of institutional investors.\n\nIt might seem overly optimistic to claim that bitcoin’s price will end up quadrupling over the next year and a half, even with its historic volatility. But there are clear reasons why such a large bank has such confidence in Bitcoin. Hard data shows that the mining industry is thawing from “crypto winter” to become stronger than ever, regulatory approval years in the making appears imminent and BTC has once again emerged from a cycle low with strong momentum.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA3LzE3L25leHQtYml0Y29pbi1oYWx2aW5nLWV2ZW50LWNvdWxkLWJlLWEtc3RyZXNzLXRlc3QtZm9yLW1pbmVycy1qcG1vcmdhbi_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNy8xNy9uZXh0LWJpdGNvaW4taGFsdmluZy1ldmVudC1jb3VsZC1iZS1hLXN0cmVzcy10ZXN0LWZvci1taW5lcnMtanBtb3JnYW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Next Bitcoin Halving Event Could Be a Stress Test for Miners: JPMorgan - CoinDesk",
        "content": "It is unlikely the hashrate will continue to rise at the same pace following the halving event “without any sustained rise in the bitcoin price above its production cost or a large increase in transaction fees that could offset the reduction in issuance rewards,” the report added."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zZWMtYWNjZXB0cy1ibGFja3JvY2stYml0Y29pbi1ldGYtMDUzNjIxNTk1Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "SEC accepts BlackRock's Bitcoin ETF application for review - Yahoo Finance",
        "content": "The U.S. Securities and Exchange Commission (SEC) has accepted asset manager BlackRock’s application for a spot Bitcoin exchange-traded fund (ETF), signalling a major step for the potential launch of the country’s first spot Bitcoin ETF.\n\nSee related article: BlackRock files for spot Bitcoin ETF, taps Coinbase as custodian\n\nFast facts\n\nOn July 13, the SEC added BlackRock’s spot Bitcoin ETF application to its list of proposed rulemaking filings for the Nasdaq stock market — a move that signals the regulatory body’s intent to take the application seriously.\n\nGiven BlackRock’s global stature in the asset management industry, that signal is considered significant as a potential indicator of greater institutional adoption of Bitcoin and other cryptocurrencies to come.\n\nThe move follows BlackRock’s filing of an amended Bitcoin ETF application in late June. SEC officials reportedly expressed concern that the original ETF applications filed by BlackRock and other asset managers were not sufficiently comprehensive.\n\nTo convince the regulators, BlackRock has added a “surveillance-sharing” agreement with U.S. crypto exchange Coinbase to its updated application. Competitors including Ark Invest, Fidelity Investments and others are also filing similar amendments to their respective Bitcoin ETF applications.\n\nOn July 14, the day after the BlackRock decision, the SEC also added the Bitcoin ETF applications of WisdomTree, VanEck, Fidelity and Invesco Galaxy to its docket.\n\nBlackRock is the world’s largest asset manager with over US$9.4 trillion in assets. The firm filed for its first spot Bitcoin ETF on June 15, fueling optimism for further institutional adoption of cryptocurrencies.\n\nA Bitcoin ETF allows customers to invest in Bitcoin without directly holding the token, and can be traded on traditional stock markets. The U.S. SEC approved the nation’s first Bitcoin futures ETF on June 23, but is so far yet to give the green light to a spot Bitcoin ETF.\n\nElsewhere, Europe’s first spot Bitcoin ETF — proposed by Jacobi Asset Management — is expected to be publicly listed this month. That follows a 12-month delay from the initially planned date, according to reporting by the Financial Times.\n\nSee related article: US SEC says Bitcoin ETF applications inadequate: WSJ"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzA3LzE2L2ludmVzdG9yLXRpbS1kcmFwZXItaXMtc3VwZXItYnVsbGlzaC1vbi1iaXRjb2luL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Billionaire Investor Tim Draper Is Super Bullish on Bitcoin. Here's How High He Thinks It Can Go. - The Motley Fool",
        "content": "If there's anyone who can spot the future trends in the world of technology, it's venture capitalist Tim Draper. Draper is a co-founder of the VC firm Draper Fisher Jurvetson and has made hundreds of early investments in cutting-edge companies like Tesla.\n\nNow, the 65-year-old VC legend is making another big call on the world's largest cryptocurrency, Bitcoin (BTC 0.97%) -- namely that it's about to take off. Here's how high Draper thinks the price can go.\n\nDelayed, but a big pop is coming\n\nDraper is not just a billionaire investor -- he's also been a Bitcoin enthusiast from the early years, when the token was still gaining traction. In 2014, Draper purchased 29,656 Bitcoin tokens that had been seized from the Silk Road online marketplace by U.S. Marshals. At the time, the price of Bitcoin was only $632, so Draper has already made an absolute killing.\n\nBut Draper thinks Bitcoin is just getting started. When it traded at around $4,000, Draper predicted that Bitcoin would be at $250,000 by now. While the price of Bitcoin currently hovers around $31,200, Draper is sticking to his prediction. \"I guess we have to wait a little longer (maybe two years), but engineers are hard at work,\" he tweeted not long ago.\n\nSo what's the holdup? Well, in a recent interview with Bloomberg, Draper said he is surprised by how opposed agencies of the U.S. government such as the Securities and Exchange Commission (SEC) have been toward the crypto industry.\n\nEarlier this year, the SEC sued Binance, the world's largest crypto exchange, and then Coinbase, the large crypto exchange in the U.S. The SEC is adamant that many cryptocurrencies should be treated as securities and therefore regulated under the purview of the SEC although SEC Chairman Gary Gensler has acknowledged previously that Bitcoin is not a security.\n\n\"I thought that maybe they would be recognizing that they've gotta compete with the rest of the world,\" Draper told Bloomberg, adding that regulators are \"driving all the great entrepreneurs out.\"\n\nBut Draper believes that Bitcoin is here to stay for the long haul and that one day it will eventually become an everyday currency that will soon be more broadly accepted by retailers, which he thinks can reap many benefits from using the payments technology.\n\n\"I can't wait until I can raise a fund all in Bitcoin, invest it all in Bitcoin, have my portfolio companies paid in Bitcoin, and have taxes all paid in Bitcoin, and have the waterfall all fall into people's Bitcoin wallets,\" Draper said.\n\nWill Draper's prediction come true?\n\nObviously, Draper is not the first notable investor to predict that Bitcoin will rise significantly, but he certainly does have a tremendous track record of anticipating future trends. He's also clearly got skin in the game.\n\nI would agree with Draper that Bitcoin is here to stay, and I've said previously that it merits some exposure in one's portfolio, given that it does have a history of rising when the dollar drops and during difficult periods for the banking sector.\n\nHowever, I have no price prediction for the digital asset and am still unclear if everyone will be using it as a currency one day. Cryptocurrencies are hard to value as an asset, but given the continued adoption of Bitcoin in the mainstream financial system, I do envision a future with Bitcoin."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGhlLWV4cHJlc3MtcG9kY2FzdC1lcGlzb2RlLTE0NS03NTYxNzMz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Behind Bitcoin's Rise, and BlackRock's Bid to Launch an ETF - Investopedia",
        "content": "Subscribe Now: Apple Podcasts / Spotify / Google Podcasts / PlayerFM\n\nNate Geraci of the ETF Store joins The Express to breakdown Bitcoin's incredible rise this year, and why the biggest asset managers in the world like BlackRock have filed to launch Bitcoin ETFs. Has crypto regulation peaked? Plus, consumer discretionary stocks have been the leaders of this bull market even though everyone is saying the consumer is tapped out. Why Taylor Swift says we should just 'shake it off'."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS90aGlzLWlzLWhvdy1tdWNoLWJpdGNvaW4tYnRjLWhhcy1iZWVuLWxvc3QtZm9yZXZlci1pdGItZGF0YS_SAVlodHRwczovL2NyeXB0b3BvdGF0by5jb20vdGhpcy1pcy1ob3ctbXVjaC1iaXRjb2luLWJ0Yy1oYXMtYmVlbi1sb3N0LWZvcmV2ZXItaXRiLWRhdGEvP2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "This Is How Much Bitcoin (BTC) Has Been Lost Forever: ITB Data - CryptoPotato",
        "content": "On-chain data examined by blockchain analytics firm IntoTheBlock has revealed that roughly 29% of all bitcoins (BTC) in circulation have remained unmoved for more than five years.\n\nIn a Monday tweet, analysts at the firm said a large part of the unmoved assets might be lost coins.\n\nEver wondered how many Bitcoins are lost forever? Our data shows that 29% of $BTC hasn’t moved in over 5 years. It’s possible that a large part of this concerns lost coins. #Bitcoin — IntoTheBlock (@intotheblock) July 17, 2023\n\n29% of BTC Lost?\n\nIntoTheBlock’s latest analysis echoes a recent report from crypto exchange Bitfinex, which disclosed that the amount of unmoved BTC has reached a new all-time high, leading to a decrease in the asset’s liquidity.\n\nBitfinex also reported that approximately 70% of BTC’s circulating supply has remained dormant for at least a year; this is the highest ever recorded since the inception of the leading crypto asset.\n\nWhile there is no specific reason for the current and prolonged dormancy of a significant portion of BTC, several factors are considered to have led to the development.\n\nAs IntoTheBlock’s analysts speculated, most of the coins could be lost forever. On the other hand, it could be a sign of growing interest from investors, especially institutions, who have a bullish sentiment toward Bitcoin and believe in the asset’s long-term potential.\n\nThe HODLing attitude from both large and institutional investors indicates an expectation of positive price action for BTC, showing that they consider the crypto asset a viable investment option.\n\nBitcoin’s Upcoming Halving Event\n\nAnother factor to consider is the upcoming Bitcoin halving event slated for April 2024. Every four years, at 210,000 blocks, a mechanism in the Bitcoin network slashes the block reward for BTC mining by half. Bitcoin’s fourth halving will reduce block rewards from 6.25 BTC to 3.125 BTC.\n\nThe event is viewed as a bullish sign because it enhances BTC’s prospective scarcity, supports its supply-demand dynamics, and affects its value positively.\n\nAs the halving approaches, crypto funds and investment firms are accumulating BTC at its current price level, increasing their holdings, and positioning themselves for positive price action."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4tbGlnaHRuaW5nLW5ldHdvcmstYmluYW5jZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Lightning Network is now supported by Binance - Blockworks",
        "content": "Crypto exchange Binance enabled deposits and withdrawals on Bitcoin’s Lightning Network on Monday.\n\nLightning is now alongside other options including Bitcoin mainnet, BNB Smart Chain and Ethereum.\n\nLightning serves as a layer-2 scaling solution for Bitcoin. The network is intended to speed up transactions and reduce fees, reminiscent of Ethereum layer-2 protocols like Optimism.\n\nIt supports direct payment channels between users, allowing bitcoin (BTC) to be sent off-chain while settling on-chain in batches. This design has presented its own risk profile, with Lightning developers warning users that the software is still under development.\n\n“Most software deployed in the Lightning Network is still considered beta software, meaning it may contain bugs that could lead to irrevocable loss of funds. For most operators, the biggest risks are data loss from power outages, hardware failures and bugs,” per Lightning’s FAQ.\n\nBitcoin sent over Lightning should appear in seconds, with the network often used for micropayments and real-world transactions. Twitter, for instance, enabled BTC tipping in 2021 via payments app Strike, which uses Lightning.\n\nBinance pledged to integrate Lightning last month but said doing so required further technical work.\n\nOther exchanges such as Bitfinex, Kraken, River Financial and OKX have already integrated Lightning into their platforms. Coinbase CEO Brian Armstrong in April hinted that his platform may do the same but hasn’t yet provided a specific timeline.\n\nLightning adoption has steadily increased over the past few years, although it hasn’t been without hiccups. There’s about 4,900 BTC ($148.2 million) on the network right now — up from under 1,000 BTC ($30.2 million) in 2020.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMipgFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzE3L2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1ob3ZlcnMtbmVhci0zMDNrLWFmdGVyLWV4cGVjdGVkLWNvcnJlY3Rpb24tcmV0YWlsLWludmVzdG9yLWVudGh1c2lhc20tbGlrZWx5LXRvLWluY3JlYXNlLWFuYWx5c3Qv0gGqAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTcvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLWhvdmVycy1uZWFyLTMwM2stYWZ0ZXItZXhwZWN0ZWQtY29ycmVjdGlvbi1yZXRhaWwtaW52ZXN0b3ItZW50aHVzaWFzbS1saWtlbHktdG8taW5jcmVhc2UtYW5hbHlzdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Hovers Near $30.3K After Expected Correction. Retail Investor Enthusiasm 'Likely to Increase': Analyst - CoinDesk",
        "content": "Crypto Distress Prompts Fir Tree, a Hedge Fund, to Seek Profit From Turmoil: “Fir Tree is at its best when we identify opportunities that are mispriced, dislocated or complex. Rarely do we encounter situations that are all three, but that is precisely what we are seeing in digital assets right now,” Fir Tree said."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWRpcHMtb3Zlci13ZWVrZW5kLW90aGVyLTAxMzA1Njg0Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin dips over weekend, other top 10 cryptos mixed; US stock futures edge down - Yahoo Finance",
        "content": "Having slipped over the weekend, Bitcoin rose to trade at over US$30,300 on Monday morning in Asia. The price has now reverted to around the level posted last Thursday — prior to XRP issuer Ripple’s favorable ruling in its lawsuit with the U.S. Securities and Exchange Commission (SEC). The partial victory led to significant gains for a number of top 10 non-stablecoin cryptocurrencies, with XRP still leading the gains. U.S. stock futures edged lower as investors await earnings reports from major banks.\n\nBitcoin falls back\n\nBitcoin edged up 0.05% over the last 24 hours to US$30,332.54 as of 06:30 a.m. in Hong Kong for a weekly gain of 0.65%, according to data from CryptoMarketCap.\n\nHowever, the world’s largest cryptocurrency was trading at around US$31,300 early Saturday morning. Following that weekend high, the token’s price reverted to roughly its pre-Ripple ruling level.\n\nIn a summary judgment Thursday, New York Southern District Court Judge Analisa Torres ruled that Ripple’s programmatic sales of the XRP token on public exchanges do not constitute securities. The regulator first sued the San Francisco-based financial technology firm on the grounds that XRP constitutes a security in 2020.\n\nThe ruling was deemed something of a partial victory for Ripple, however, as the court ruled that XRP sales to institutional investors did violate securities laws.\n\n“There will be further court proceedings on that part … It is also not yet known if the SEC will appeal to the ruling,” said Caroline Bowler, CEO of Australia-based crypto exchange BTC Markets, in emailed comments. Therefore, there remains the “potential for more insecurity ahead for Ripple,” Bowler added.\n\nNonetheless, Ripple Labs’ XRP led the gainers Monday morning in Asia. It rose 5.58% to US$0.7577 for a weekly surge of 61.56%.\n\nMeanwhile, the SEC has added BlackRock’s application for a spot Bitcoin exchange-traded fund (ETF) to its official docket. That decision means that the regulator will now review the proposal in a serious manner.\n\nStory continues\n\nBlackrock, the world’s largest asset manager with over US$9 trillion in assets, filed the application a little less than a month ago. The move saw the token’s value breach the US$31,000 resistance level earlier this month as multiple major asset managers followed suit with similar ETF proposals.\n\nEther also gained 0.20% to US$1,934.09, rising 3.81% in the past seven days.\n\nOther top 10 non-stablecoin cryptocurrencies were mixed. The day’s biggest losses were logged by Dogecoin, which dipped 2.53% to US$0.07. However, the token still recorded gains of 6.89% for the week.\n\nCardano’s ADA also fell 2.52% to US$0.3185, limiting the coin’s weekly gain to 12.08%. Similarly, Binance’s BNB lost 2.43% to US$244.95. It is nonetheless trading at 4.68% higher than a week ago.\n\nThe total crypto market capitalization rose 0.16% in the past 24 hours to US$1.22 trillion, while trading volume fell 11.97% to US$24.91 billion.\n\nToken-gated access for the super-rich and The Flash via NFT\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the main Forkast 500 NFT index edged up 0.50% in the past 24 hours to 2,736.37 as of 09:30 a.m. in Hong Kong. However, the index is down 0.40% for the week. Forkast’s Solana and Cardano NFT market indices also moved higher, while the Ethereum and Polygon indices dropped.\n\n“NFTs continue to ride the wave of positive news and positive prices in crypto,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News. “However we’re not seeing any noteworthy gains in projects and instead most of the big names are still down for the past 7 days.”\n\nThat is despite some large CryptoPunk and Bored Ape Yacht Club (BAYC) sales in the past week. Those sales included BAYC #1734, which sold for $1.2m (600ETH), CryptoPunk #8531 for $1m (550 ETH), and CryptoPunk #9476 for $403k (217.5 ETH).\n\n“Big sales sometimes trickle liquidity to other projects, but in this case, the seller may be pocketing their gains or investing in crypto, where opportunities seem brighter at the moment,” Petscher said.\n\nIn the past 24 hours, the total NFT transaction volume dipped 10.93% to US$16.58 million, according to data from CryptoSlam.\n\nImmutableX’s Gods Unchained Cards, the collection of NFTs used in Immutable’s trading card game of the same name, topped the 24-hour transaction volume, despite edging down 0.43% to US$690,896.\n\nEthereum-based NFT staple BAYC placed second in Cryptoslam’s collections ranking. Its total transaction volume rose 1.34% to US$660,415 in the past 24 hours. Bored Ape creator Yuga Labs announced last week that it will hold ApeFest — a celebratory event of its successful NFT collections — in Hong Kong in November.\n\nApeFest is going global.\n\nHong Kong.\n\nNov 3-5, 2023.https://t.co/Fxgb7RuVek pic.twitter.com/X2QVVd7Qxr — Bored Ape Yacht Club (@BoredApeYC) July 13, 2023\n\nMeanwhile, non-blockchain sectors are also displaying increased NFT activity. .\n\nIndosuez, the global wealth management subsidiary of major French bank Crédit Agricole, launched a private NFT membership club last week named Le Clu3. The club will cater to super-rich clients by offering token-gated access to secret sections of its website, among other otherwise off-limits experiences. Crédit Agricole had roughly US$2.712 trillion in assets under management in 2022.\n\nElsewhere, Warner Bros. Discovery, Inc. — the American entertainment conglomerate with over US$30 billion in market capitalization — has announced that it will launch its upcoming superhero film “The Flash” via NFT. The launch is hosted by the Eluvio blockchain and will allow user access to the film itself, collectibles, bonus features and character artwork.\n\nIt’s official, The Flash is the first new release movie to hit the blockchain! pic.twitter.com/sScukkA6Fw — Warner Bros. Digital Collectibles (@WarnerBrosNFT) July 14, 2023\n\nStock futures reflect positive investor sentiment\n\nImage: Envato Elements\n\nU.S. stock futures edged down by less than 0.1% as of 11:50 a.m. in Hong Kong after the three major U.S. indexes closed mixed in regular Friday trading.\n\nThe three indexes all rose by around 2% to 3% last week. Following the latest release of U.S. inflation data on July 12, which came in softer than expected, investors are hopeful that the U.S. Federal Reserve’s extended round of interest rate hikes may soon draw to a close.\n\nHowever, Alex Kuptsikevich, senior market analyst at London-based brokerage firm FxPro, believes that recent positive investor sentiment may backfire.\n\n“The Fed has made sharp reversals before, but always after a spike in market volatility,” Kuptsikevich said. “Steadily rising stock prices are more likely to spur the central bank to tighten monetary policy further,” he added.\n\nThe Fed is still looking to add more to its current interest rate of 5% to 5.25%. Christopher Waller, a member of the Federal Reserve Board of Governors, said last week at an event hosted by New York University that the central bank will need to enact two more 25-basis-point rate increases this year to tame inflation.\n\n“The robust strength of the labor market and the solid overall performance of the U.S. economy gives us room to tighten policy further,” Waller said during the speech.\n\n“If inflation does not continue to show progress and there are no suggestions of a significant slowdown in economic activity, then a second 25-basis-point hike should come sooner rather than later, but that decision is for the future,” Waller continued.\n\nThe Federal Reserve meets on July 26 to discuss its next move on rates. The CME FedWatch Tool predicts a 96.1% chance the Fed will enact a 25-basis-point rate increase this month, up from 92.4% on Friday.\n\nLast week’s earnings reports from major U.S. banks JPMorgan, Wells Fargo and Citigroup added to the increasingly hopeful market sentiment. Investors now await reports from financial heavyweights including the Bank of America Corporation, Morgan Stanley & Co. and The Goldman Sachs Group. Earnings reports from Netflix, Tesla and United Airlines are also due Wednesday.\n\nMeanwhile, major stock indexes across Asia fell on Monday as China posted lower-than-expected economic growth of 6.3% for Q2. China’s Shanghai Composite, Japan’s Nikkei and South Korea’s Kospi all posted losses as of 12:00 p.m. in Hong Kong.\n\n(Updates to add equity section)"
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNy8xNy9kZXNwaXRlLWJsYWNrcm9jay1kb250LWV4cGVjdC1hLWZsb29kLW9mLXNwb3QtYml0Y29pbi1ldGZzLXNvb24tZXhwZXJ0cy_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA3LzE3L2Rlc3BpdGUtYmxhY2tyb2NrLWRvbnQtZXhwZWN0LWEtZmxvb2Qtb2Ytc3BvdC1iaXRjb2luLWV0ZnMtc29vbi1leHBlcnRzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Despite BlackRock, Don’t Expect a Flood of Spot-Bitcoin ETFs Soon: Experts - CoinDesk",
        "content": "All five of Cboe’s ETF applications: Wise Origin, WisdomTree, VanEck, Invesco Galaxy and ARK 21Shares, and BackRock's iShares Bitcoin Trust have filed 19b-4 applications. “The weakness of an application that needs 19b-4 is that you need a specific approval ruling to list from the SEC and that puts the SEC in a very powerful position,” said Barton. “They don’t have to argue with you on whether this is a good investment. They get to drill down because you’re really asking them ‘please can we change the rules of our exchange in order to list this new underlying product as a new ETF’ and very few 19b-4s get filed and it’s a very long process.”"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWhhbHZpbmctYW1vbmdzdC1tYWpvci1ldmVudHMtMDYwMDAwMzEwLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Halving Amongst Major Events to Watch in the Crypto Market - Yahoo Finance",
        "content": "DUBAI, UAE / ACCESSWIRE / July 18, 2023 / Unlike the halving of Litecoin, which had no substantial effect on its price in the past, the halving of Bitcoin is currently one of the major expected events in the crypto market. Bitcoin is set to undergo a periodic halving in 2024.* BITmarkets has identified bitcoin halving as one of the major events for the crypto trading community. The trader's perspective on the phenomenon of halving is a part of 2023 Mid-Year Crypto Outlook.\n\nBITmarkets, Tuesday, July 18, 2023, Press release picture\n\n\"After the challenges of 2022, the current year seems to have blown a wind of change indeed. The possibility of cryptocurrencies aiming back towards the highs of 2021 during the upcoming year can be realistic, given revitalizing market conditions. Of course, there are risks, or in other words, obstacles along the way, but current market conditions may indicate a rather prosperous development and outcome for cryptocurrencies in the near future,\" says Peter Sumer, COO of BITmarkets, on the findings of the Outlook study.\n\n2023 has started strong for cryptocurrencies and other financial market assets, combatting headwinds with fierce force and retaining hard-earned value. Among the trends of the current year and the ones to follow are several: more regulation, rise of central bank digital currencies, popularization of DeFi, more investments into stablecoins and the revitalization or deterioration of NFTs.\n\nIdentity verification strictness may increase as more cyberattacks and hacks have been detected in recent times. Increased regulation is intended to safeguard the funds and data of crypto traders. This can come in the form of increasing scrutiny of identity verification, which can bolster the effectiveness of regulatory frameworks set in place.\n\nOther legal measures such as passing new laws that tackle money laundering and necessitating accurate & recurrent corporate reporting can achieve higher consumer protection.\n\nMore information on trends and upcoming events in the world of crypto traders is to be found in the 2023 Mid-Year Crypto Outlook: Crypto Trends to Watch & 2024 Bitcoin Halving, a study by BITmarkets.\n\nStory continues\n\nBITmarkets is a crypto exchange that operates in more than 15 languages and offers 24/7 support in local languages. Besides spot trading, clients are enabled to unique futures options with 100+ cryptocurrencies. For more information see https://bitmarkets.com/en\n\nBITmarkets Spot Trading Services are provided to you by UAB BITmarkets, which is an authorized virtual currency exchange and depository virtual currency wallet operator in Lithuania operating under the licence no: 306062346, supervised by the Financial Crime Investigation Service and acting under the trademark BITmarkets.\n\n* In 2024, Bitcoin is set to undergo a periodic halving event, which occurs every 4 years or 210,000 blocks on the Bitcoin blockchain. The initial block reward for BTC was 50 BTC, while the current block reward stands at 6.25 BTC, and the next block reward will be 3.125 BTC, and the halving continues. This event, programmed into the Bitcoin code, slows down the rate at which Bitcoins are mined and generated. The main incentive behind this action is to limit the total supply of BTC, which shall be maxed out at 21,000,000 BTC.\n\nPR Contact:\n\nZEX PR WIRE\n\ninfo@zexprwire.com\n\nSOURCE: BITmarkets\n\n\n\n\n\nView source version on accesswire.com:\n\nhttps://www.accesswire.com/768435/Bitcoin-Halving-Amongst-Major-Events-to-Watch-in-the-Crypto-Market\n\n\n\n"
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMTcvbGlnaHRuaW5nLW5ldHdvcmstYml0Y29pbi1kZXBvc2l0cy1ub3ctbGl2ZS1vbi1iaW5hbmNlL9IBZGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDcvMTcvbGlnaHRuaW5nLW5ldHdvcmstYml0Y29pbi1kZXBvc2l0cy1ub3ctbGl2ZS1vbi1iaW5hbmNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Lightning Network Bitcoin Deposits Now Live on Binance - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wNy8xNy9zZWMtbGF1bmNoZXMtcmV2aWV3LW9mLWxhdGVzdC1iaXRjb2luLWV0Zi1hcHBsaWNhdGlvbnMv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzA3LzE3L3NlYy1sYXVuY2hlcy1yZXZpZXctb2YtbGF0ZXN0LWJpdGNvaW4tZXRmLWFwcGxpY2F0aW9ucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "SEC Launches Review of Latest Bitcoin ETF Applications - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzE3L2JpdGNvaW4tZGlwcy1iZWxvdy0zMGstdG8tbG93ZXN0LXNpbmNlLWxhdGUtanVuZS1hcy1hbHRjb2lucy1wYXJlLWdhaW5zLWZyb20teHJwLWxhd3N1aXQv0gGJAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTcvYml0Y29pbi1kaXBzLWJlbG93LTMway10by1sb3dlc3Qtc2luY2UtbGF0ZS1qdW5lLWFzLWFsdGNvaW5zLXBhcmUtZ2FpbnMtZnJvbS14cnAtbGF3c3VpdC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Dips Below $30K to Lowest Since Late June as Altcoins Pare Gains From XRP Lawsuit - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTgvbGV2ZXJlZC1idWxsaXNoLWxvbmdzLWdldHRpbmctbGlxdWlkYXRlZC1hcy1iaXRjb2luLW1hcmtldC1zb2Z0ZW5zL9IBc2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTgvbGV2ZXJlZC1idWxsaXNoLWxvbmdzLWdldHRpbmctbGlxdWlkYXRlZC1hcy1iaXRjb2luLW1hcmtldC1zb2Z0ZW5zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Levered Bullish Longs Getting Liquidated as Bitcoin Market Softens - CoinDesk",
        "content": "\"There's a continued focus solely on U.S. (ETFs),\" Edward Moya, senior market analyst for foreign exchange market maker Oanda, told CoinDesk earlier. \"People are not going to be as optimistic until we get a further update that we're going to get that ETF done in the States.\""
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWV0aGVyLXNsaXAtdG9wLWNyeXB0b3MtMDkyODQ4NjkxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin, Ether slip, top cryptos mixed, XRP biggest gainer after last week's court win - Yahoo Finance",
        "content": "Bitcoin and Ether inched down during Monday afternoon trading in Hong Kong, while all other top 10 non-stablecoin cryptocurrencies by market capitalization were mixed. XRP continued its rally after XRP issuer Ripple’s favorable ruling last week in its lawsuit with the U.S. Securities and Exchange Commission (SEC). Investors were also upbeat after the SEC accepted BlackRock’s spot Bitcoin exchange-traded fund (ETF) applications for review.\n\nSee related article: Weekly Market Wrap: Bitcoin breaches US$31,195 following Fidelity’s spot Bitcoin ETF application\n\nBitcoin, Ether slip but remain above key levels, XRP leads gains\n\nBitcoin was little changed during the Asia trading day, holding at US$30,321 as of 4:30 p.m. in Hong Kong.\n\nEther inched down 0.15% during afternoon trading in Asia, to change hands at US$1,931, holding above US$1,900 since Thursday.\n\nThe XRP token was the day’s biggest gainer, rising 4.22% to US$0.7483. The token rallied 59.67% on the week after U.S. District Court Judge Analisa Torres ruled Thursday that Ripple Labs’ programmatic sales of its XRP cryptocurrency did not qualify as financial securities.\n\nAdding to positive investor sentiment, the SEC has accepted asset manager BlackRock’s application for a spot Bitcoin ETF for review. This signals the SEC’s intent to seriously consider the ETF application.\n\n“An approved ETF could be the catalyst that provides an efficient and regulated way for institutional investors to gain exposure to Bitcoin. Such approval could potentially bring significant inflows of institutional capital into the market, increasing liquidity and driving up prices,” Lucas Kiely, the chief investment officer of digital asset platform Yield App, told Forkast.\n\n“It would signal a maturing and mainstream acceptance of Bitcoin, instilling confidence in both retail and institutional investors. It would remove some of the perceived barriers to entry, making it easier for individuals and institutions to participate in the market.”\n\nStory continues\n\nThe total crypto market capitalization over the past 24 hours rose 0.10% to US$1.21 trillion and market volume increased 3.97% to US$25.93 billion, according to CoinMarketCap data.\n\nBitcoin NFT sales rise, Ethereum NFT sales lose momentum\n\nThe Forkast 500 NFT index rose 0.25% to 2,729.89 points in the 24 hours to 4:30 p.m. in Hong Kong but fell 0.48% during the week.\n\nBitcoin’s 24-hour non-fungible token sales increased 73.17% to US$1.59 million, as sales for Uncategorized Ordinals rallied 99.29% to US$627,110.\n\nEthereum’s 24-hour NFT sales fell 13.67% to US$11.6 million, as sales for the largest Ethereum-native NFT collection, the Bored Ape Yacht Club, rose 1.05% to US$706,564. Last Friday, Yuga Labs, the company behind The Bored Ape Yacht Club NFT collection, announced that it will hold ApeFest, an event to celebrate the firm’s NFT collections, in Hong Kong, at the beginning of November.\n\nOn Ethereum, sales for the Captainz collection also rose 19.36% to US$548,312.\n\n“NFTs continue to ride the wave of positive news and positive prices in crypto. However, we’re not seeing any noteworthy gains in projects and instead, most of the big names are still down for the past seven days,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News.\n\n“Traders are hurting for liquidity and when we see volume it’s often paired with decreasing prices.”\n\nAmong the Forkast Labs NFT indexes, the Forkast ETH NFT Composite was the only one in the red, falling 0.13% to 928.58 points.\n\nAsian equities, U.S. stock futures fall\n\nImage: elements.envato\n\nMajor Asian equities weakened as of 4:30 p.m. in Hong Kong, with Japan’s Nikkei 225, the Shenzhen Component Index and Shanghai Composite all posting declines.\n\nHong Kong markets halted trading in both securities and derivatives markets on Monday, amid a warning over Typhoon Talim. While the storm has not caused any major damage, authorities warned that it could lead to flooding.\n\nInvestor sentiment turned negative after data showed that China’s economy grew 6.3% in the second quarter, below expected expansion of 7.3%. Retail sales also missed preliminary forecasts. Investors are hoping for more stimulus measures from Beijing to bolster the mainland’s post-pandemic recovery.\n\nU.S. stock futures also fell during Monday afternoon trading in Hong Kong, with the S&P 500 futures index, the tech-heavy Nasdaq-100 futures and the Dow Jones Industrial Average futures all weakening.\n\nThis week, investors are anticipating earnings reports from major banks like Bank of America, Morgan Stanley and Goldman Sachs. Companies like Tesla, Netflix and United Airlines are also releasing their earnings reports.\n\nSee related article: EU publishes draft bill for digital euro and cash payments\n\nUpdates with equities section"
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWZhbGxzLXVuZGVyLTMway1hcy1tYWNyby1hbmQtcmVndWxhdG9yeS13b3JyaWVzLXRha2UtY2VudGVyLXN0YWdl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin price falls under $30K as macro and regulatory worries take center stage - Cointelegraph",
        "content": "Multiple pieces of data point to the Bitcoin price falling below $29,000 in the short term.\n\nYes, you read that right.\n\nLet’s investigate the main issues contributing to the current downside in the Bitcoin price.\n\nBitcoin (BTC) encountered difficulties breaking above $31,800 on July 13, resulting in a 6.3% correction down to $29,700 on July 17. The price action could reflect investors’ concerns that ongoing regulatory developments and macroeconomic headwinds could drive Bitcoin below the $29,000 level, which was last observed on June 21.\n\nOn the derivatives side, Bitcoin futures show increased demand, but Asian markets are slowing down.\n\nBitcoin quarterly futures typically trade at a slight premium compared to spot markets, reflecting sellers’ willingness to receive more money in exchange for delaying settlement. Healthy markets generally exhibit BTC futures contracts trading at a 5% to 10% annualized premium, a situation known as contango, which is not unique to crypto markets.\n\nBitcoin 3-month futures premium. Source: Laevitas\n\nBetween July 14 and July 17, BTC futures maintained a neutral-to-bullish 7% premium, surpassing the 5% threshold. This suggests moderate conviction among bulls following the unsuccessful attempt to break above $31,800.\n\nHowever, the Tether (USDT) premium in Asia has been declining. The stablecoin premium serves as an indicator of demand from China-based retail crypto traders, measuring the difference between peer-to-peer trades and the U.S. dollar.\n\nTether (USDT) peer-to-peer vs. USD/CNY. Source: OKX\n\nThe Tether premium in Asia recently reached a discount of 1.8%, marking its lowest point in over six months. This inverse premium trend started on July 12 and has continued to widen, indicating moderate sell pressure.\n\nRegulatory worries continue to plague crypto\n\nRegulation of the crypto sector is also still on investors’ minds. Even though the July 13 ruling that the sale of XRP (XRP) via exchanges and over-the-counter desks did not violate securities regulations did boost markets, the court’s decision did not definitively determine whether XRP’s initial coin offering was classified as a security offering. This lack of clarity has left some investors uneasy, as it raises the possibility of other cryptocurrencies also facing potential securities designations.\n\nIn addition to the court’s ruling on XRP, Binance also announced the layoff of 1,000 employees. Although the exchange has refuted the reports and claimed routine resource reallocation and ongoing hiring, concerns have arisen regarding Binance’s future following the departure of several key executives and the ongoing court action from the Securities and Exchange Commission.\n\nRelated: SEC vs Ripple referred to judge who ordered release of ‘Hinman Documents’\n\nMacroeconomic trends do not favor crypto\n\nThe macroeconomic environment has not been favorable for Bitcoin and risk-on assets. China’s gross domestic product growth slowed to 6.3% in the second quarter, falling short of market expectations, with factors such as the ongoing trade war with the United States and the government’s efforts to address debt contributing to the slowdown.\n\nConsidering the external factors and pending court decisions that could negatively impact the two largest exchanges, the odds of Bitcoin breaking below $29,000 have increased. This creates a favorable scenario for bears, causing the $30,000 resistance to gain strength.\n\nBitcoin's price could dip under $29,000 this week\n\nThere appears to be no specific catalyst restricting Bitcoin’s upside potential, aside from worsening macroeconomic conditions and indications of further interest rate increases by the Federal Reserve in 2023.\n\nFrom a trading perspective, BTC futures show higher confidence among professional traders using leverage. However, the sell pressure from retail investors in Asia limits the overall upside for cryptocurrencies.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDcvMTgvZmlyc3QtbW92ZXItYXNpYS1iaXRjb2luLXJlYm91bmRzLXRvLTMwMWstYWZ0ZXItcmV0cmVhdGluZy10by1qdW5lLWxvdy_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA3LzE4L2ZpcnN0LW1vdmVyLWFzaWEtYml0Y29pbi1yZWJvdW5kcy10by0zMDFrLWFmdGVyLXJldHJlYXRpbmctdG8tanVuZS1sb3cvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Rebounds to $30.1K After Retreating to June Low - CoinDesk",
        "content": "In its most recent episode, \"The Hash\" tackled hot topics, including XRP overtaking BNB token to become the world's fourth-largest digital asset by market cap following Ripple's partial courtroom win. The panel dug into what the ruling could mean for the future of crypto regulation. Separately, the group discussed bail for Celsius founder and former CEO Alex Mashinsky, which was set at $40 million by a judge after his arrest. And the Hash also addressed new details on what luxury fashion brand Gucci is doing in the world of NFTs."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWRpcHMtcmVjb3ZlcnMtYmFjay1hYm92ZS0wMDQ2MjM4NDEuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin dips but recovers back above US$30,000; Ether, most other top 10 crypto lose ground - Yahoo Finance",
        "content": "Bitcoin briefly fell under US$30,000 in early Tuesday morning trading in Asia before recovering back above that support line. Ether and most other top 10 non-stablecoin cryptocurrencies declined, with Solana leading the losers. Polygon’s Matic was the exception, adding more than one percent at one point. NFT trading slumped and U.S. stock futures traded flat after gains on Monday. The week ahead brings rafts of earnings, including from major U.S. banks on Wednesday.\n\nBitcoin, Ether slip\n\nBitcoin lost 0.55% over the last 24 hours to US$30,160.39 as of 06:40 a.m. in Hong Kong, falling 0.62% for the week, according to data from CryptoMarketCap. The token dipped to US$29,685.78 at one point in early morning Asia trading on Tuesday.\n\n“On a weekly timeframe, Bitcoin is trending up on the highs and lows, but down on the close and open,” said Alex Kuptsikevich, senior market analyst at London-based online brokerage FxPro. “Failure to rally from current levels opens the door for a correction to the $27,000 area if risk-off sentiment intensifies later in the week.”\n\nThe world’s largest cryptocurrency with a current market capitalization of US$586 billion has attracted bouts of buying interest following several filings for spot Bitcoin exchange-traded fund (ETF) applications in June, including one by the world’s largest asset manager, BlackRock.\n\nOn July 13, the U.S. Securities and Exchange Commission (SEC) formally accepted the Bitcoin ETF applications from BlackRock, WisdomTree, VanEck and others for review.\n\nWhen measured by investments in crypto-focused funds, Bitcoin has seen inflows of US$140 million in the last week, or 99% of the total invested in such funds, according to asset manager CoinShares. A total US$742 million was invested in crypto funds over the last 4 weeks, the largest since the final quarter of 2021, according to CoinShares data.\n\nEther declined by 1.07% to US$1,913.56, but was still holding gains of 2.03% in the last seven days. Most other top 10 non-stablecoin cryptocurrencies were in the red, though Polygon’s Matic added to weekly gains of 5.99%. Matic rose 0.37% to US$0.781 in early trade and gained further later in the morning.\n\nStory continues\n\nLast Thursday, Polygon Labs announced a new, revamped version of its native token named Pol, which the company claims will be more secure, scalable and frictionless.\n\nSolana was the biggest loser among the top 10 falling 3.26% to US$26.74. However that could be from profit-taking as the token has jumped 25.55% for the week.\n\nThe total crypto market capitalization fell 0.49% in the past 24 hours to US$1.21 trillion, while trading volume rose 42.52% to US$35.54 billion.\n\nNFTs in “substantial slowdown”\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index fell 0.27% in the past 24 hours to 2,719.10 as of 07:45 a.m. in Hong Kong. The index is down 0.43% for the week.\n\n“The Forkast 500 NFT Index is down following a very slow day of trading,” said Yehudah Petscher, NFT Strategist at Forkast Labs, the parent company of Forkast.News. “Focusing on Ethereum trading we see 14,006 total transactions on Sunday, which is the lowest in almost 2 years, when we saw 13,560 transactions on July 24, 2021.”\n\nPetscher said the number of unique buyers fell under 10,000, also a substantial slowdown in the NFT market.\n\nForkast’s NFT market indices measuring the performance on Ethereum, Solana and Cardano blockchains rose, while the Polygon index dropped.\n\nTotal NFT trading volume gained 1.45% to US$18.51 million in the past 24 hours, according to data from CryptoSlam.\n\nEthereum-based art NFT collection Opepen Edition topped the trading volume rankings on CryptoSlam, rising 2.93% in the last 24 hours to US$782,290.\n\n“Opepen is an interesting hybrid project that merges conceptual art into easy to digest profile pictures,” Petscher explained. “Influencers and even large Web3 entities like OpenSea and Rarible are getting in on the fun by changing their profile pictures to an Opepen that matches their brand.”\n\nImmutableX’s Gods Unchained Cards, the collection of NFTs used in Immutable’s trading card game of the same name, placed second in 24-hour trading volume, despite falling 2.19% to US$675,685.\n\nElsewhere, NFL Super Bowl champion Kansas City Chiefs quarterback Patrick Mahomes said on Twitter Monday that he will launch his second line of NFTs inspired by his football career. The new collectibles are expected in September, according to Decrypt.\n\nU.S. stock futures little changed, Asia markets lower\n\nImage: Envato Elements\n\nU.S. stock futures traded flat as of 10:00 a.m. in Hong Kong after all three major U.S. indexes gained during regular trading on Monday.\n\nStocks in main Asia markets fell back after China on Monday reported lower-than-expected economic growth of 6.3% for Q2. The Shanghai Composite, Hong Kong’s Hang Seng, South Korea’s Kospi, and Japan’s Nikkei 225 all posted losses as of 11:00 a.m. in Hong Kong.\n\nIn the U.S., more bank earnings are coming later today from Bank of America Corp. and Morgan Stanley & Co., which follow positive quarterly results last week from JPMorgan Chase & Co, Wells Fargo, and Citigroup. Earnings from Goldman Sachs Group, Netflix, Tesla and United Airlines are expected Wednesday.\n\nThe view that the Federal Reserve is nearing the end of its cycle of raising interest rates helped the Wall Street gains on Monday, according to Trading Economics. That sentiment grew as last week’s producer price index, a measure of wholesale inflation, came in well below analyst expectations.\n\nStill, the Fed is likely to raise rates again above the current 5% to 5.25%. Christopher Waller, a member of the Federal Reserve Board of Governors, said last week at an event hosted by New York University that the central bank will need two more 25-basis-point rate increases this year to tame inflation.\n\nThe Federal Reserve meets on July 26 to discuss its next move on rates. The CME FedWatch Tool predicts a 97.3% chance the Fed will raise by 25-basis-points, up from 96.1% on Monday.\n\n(Updates to add equity section)"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXN1cHBvcnQtYXQtMzBrLW9wZW5zLXRoZS1kb29yLWZvci1nYWlucy1mcm9tLXVuaS1hcmItYWF2ZS1hbmQtbWty0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin price support at $30K opens the door for gains from UNI, ARB, AAVE and MKR - Cointelegraph",
        "content": "Bitcoin (BTC) attempted to break away from its boring sideways price action on July 13, following Ripple’s legal victory over the United States Securities and Exchange Commission, but the enthusiasm proved to be short-lived. Sellers pulled the price back into the range on July 14, indicating that they remain active at higher levels. However, a positive sign is that the bulls have kept Bitcoin’s price above $30,000.\n\nMarket observers are expected to closely follow the review process for the various exchange-traded fund (ETF) proposals for a spot Bitcoin ETF, one of the most prominent being the proposal by BlackRock. Interestingly, out of 550 ETF applications by BlackRock, only one has been rejected, according to Bloomberg Intelligence’s Eric Balchunas and James Seyffart.\n\nCrypto market data daily view. Source: Coin360\n\nEven as Bitcoin consolidates, waiting for its next catalyst, several altcoins are witnessing solid buying. This has pulled Bitcoin’s market dominance below 50%, suggesting that the focus could be shifting to the altcoins in the near term.\n\nCould Bitcoin start a trending move in the short term, or will it remain stuck inside the range? What are the altcoins that are looking strong on the charts? Let’s study the charts of the top-five cryptocurrencies that could be on traders' radar in the next few days.\n\nBitcoin price analysis\n\nBitcoin closed above $31,000 on July 13, but that proved to be a bull trap as the bears yanked the price back below the level on July 14. This shows that the bears are fiercely defending the zone between $31,000 and $32,400.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe price action of the past few days has formed a bearish divergence on the relative strength index (RSI). This indicates a weakening bullish momentum. The bears will try to build upon their advantage by pulling the price below the 20-day exponential moving average ($30,187). If they manage to do that, the BTC/USDT pair could descend to the 50-day simple moving average ($28,631).\n\nIf bulls want to prevent the decline, they will have to quickly push and sustain the price above $31,000. The pair could then climb to $32,400. A break and close above this level will clear the path for a potential run to $40,000 as there are no major resistances in between.\n\nBTC/USDT four-hour chart. Source: TradingView\n\nThe pair has dropped below the moving averages on the four-hour chart, indicating that demand dries up at higher levels. The bears will have to sink and sustain the price below $29,500 to start a deeper correction. The pair could then plummet to $27,500.\n\nAlternatively, the bulls will have to push and sustain the price above $31,000 to start an up-move toward $32,400. If the price turns down from $32,400 but rebounds off $31,000, it will suggest that the bulls have flipped the level into support. The pair may then start a rally to $40,000.\n\nUniswap price analysis\n\nUniswap (UNI) has been taking support at the 20-day EMA ($5.41) during pullbacks, indicating that the sentiment has turned positive and traders are buying the dips.\n\nUNI/USDT daily chart. Source: TradingView\n\nThe bulls will try to buy the current dip and push the price above the immediate resistance at $6.16. If they can pull it off, the UNI/USDT pair could rise to $6.50. This level may again act as a strong resistance, but if bulls do not give up much ground, the pair could reach $6.70.\n\nThe important support to watch on the downside is the 20-day EMA. A break and close below this level will suggest that the bears are back in the game. The pair may then fall to the 50-day SMA ($5) and later to the crucial support at $4.72.\n\nUNI/USDT four-hour chart. Source: TradingView\n\nThe correction on the four-hour chart has reached the 20-day EMA. This is the first important support to watch out for. If the price rebounds off this level, the pair could retest the overhead resistance at $6.17. Above this level, the pair may climb to the resistance line of the ascending channel.\n\nContrarily, if the price slips below the 20-day EMA, it will suggest that the short-term traders may be booking profits. That could pull the price down to the support line of the channel. If this level cracks, the pair may slide to $5.08.\n\nArbitrum price analysis\n\nArbitrum (ARB) broke and closed above the symmetrical triangle pattern on July 15, indicating that the bulls have overpowered the bears.\n\nARB/USDT daily chart. Source: TradingView\n\nThe 20-day EMA ($1.16) has turned up and the RSI has reached near the overbought zone, indicating that the path of least resistance is to the upside. There is a minor resistance at $1.36, but if that level is crossed, the ARB/USDT pair may surge to $1.50. This level may again pose a strong challenge, but if bulls overcome it, the rally may extend to $1.70.\n\nThis positive view will invalidate in the near term if the price turns down and plummets below the support line of the triangle. That may trap several aggressive bulls, resulting in a sharp drop to $0.90.\n\nARB/USDT four-hour chart. Source: TradingView\n\nThe bulls successfully held the retest of the breakout level from the symmetrical triangle, indicating that lower levels are attracting buyers. The bulls will try to build upon this strength by driving the price above $1.36. If they succeed, the pair may pick up momentum.\n\nOn the contrary, if the price turns down from the current level or $1.36, the bulls will again try to drag the pair back into the triangle. If they do that, it will suggest that the recent breakout may have been a bull trap. The pair could then drop to the 50-day SMA and, subsequently, to the support line of the triangle.\n\nRelated: Buying the dip? Record 3.8% of the Bitcoin supply last moved at $30.2K\n\nAave price analysis\n\nAave (AAVE) broke and closed above the descending channel pattern on July 3. The bulls successfully held the retest of the breakout level on July 6 and again on July 10. This shows that the bulls flipped the resistance line into support.\n\nAAVE/USDT daily chart. Source: TradingView\n\nThe rising 20-day EMA ($72) and the RSI in the positive territory indicate that the bulls are in command. If the price turns up from the current level or bounces off the 20-day EMA, it will enhance the prospects of a rally above $84.50. The AAVE/USDT pair could then rally to $95.\n\nContrary to this assumption, if the price turns down and breaks below the 20-day EMA, it will suggest that the bulls may be losing their grip. The bears will then again try to tug the price back into the descending channel.\n\nAAVE/USDT four-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bulls pushed the price above the overhead resistance of $84.50, but they could not sustain the breakout. The bears sold at higher levels and pulled the price back below the 20-day EMA.\n\nBoth moving averages have flattened out and the RSI is near the midpoint, indicating a balance between supply and demand.\n\nIf the price breaks below the 50-day SMA, the advantage may shift in favor of the bears. The pair could then slide to $68. The advantage will shift in favor of the bulls if they maintain the price above $84.50.\n\nMaker price analysis\n\nMaker (MKR) broke above the downtrend line on July 2 and successfully retested the level on July 14. The bounce off this support suggests strong demand at lower levels.\n\nMKR/USDT daily chart. Source: TradingView\n\nThe upsloping 20-day EMA ($878) and the RSI in the positive zone signal that bulls are in control. Buyers are attempting to resume the up-move but may face stiff resistance near $1,100. If bulls clear this hurdle, the MKR/USDT pair may soar to $1,200.\n\nOn the contrary, if the price turns down from $1,080, it will suggest that bears continue to sell on rallies. The pair could then slump to the 20-day EMA. A break below this level will suggest that the bears are trying a comeback.\n\nMKR/USDT four-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bulls have pushed the price above the resistance line, indicating that the short-term correction may be over. The price may dip to the resistance line, which is an important level to keep an eye on.\n\nA strong rebound off this level will suggest that the bulls have flipped the resistance line into support. That will improve the possibility of a break above $1,080.\n\nThis positive view could invalidate in the near term if the price plummets below the moving averages. That could sink the pair to $831.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts, and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiQmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idXlpbmctZGlwLWJpdGNvaW4tc3VwcGx5LW1vdmVkLTMwa9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 16 Jul 2023 07:00:00 GMT",
        "title": "Buying the dip? Record 3.8% of the Bitcoin supply last moved at $30.2K - Cointelegraph",
        "content": "Bitcoin (BTC) at $30,000 is the most popular “buy” level ever, the latest on-chain data suggests.\n\nAccording to figures from crypto analytics firm Glassnode, a record amount of BTC changed hands near the current spot price.\n\nBitcoin: 'Big move coming' thanks to buyer interest\n\nBTC price action may have stalled near the $30,000 mark, but buyer behavior suggests that there is significant demand for the largest cryptocurrency here and now.\n\nGlassnode, which monitors unspent transaction outputs (UTXO), shows that $30,200 is the price at which the largest number was created.\n\nThe figures come from the firm’s Entity-Adjusted URPD, or UTXO Realized Price Distribution metric. This counts UTXOs but discards two important transaction types that could give a false impression of demand.\n\n“In this calculation we discard coin movements between addresses controlled by the same entity, as such transfers do not correspond to real purchasing events and would distort the actual mean purchasing price. Further, we exclude all supply that is on exchanges, because a single averaged price for the funds of millions of users would be misleading and give rise to unwanted artifacts in the data,” Glassnode's explainer confirms.\n\nThe result is that 3.8% of the total BTC supply last moved at $30,200 — more, even, than at $16,500, which marks the area near the 2022 post-FTX bottom.\n\n“Big move is coming,” popular pseudonymous trader Mikybull Crypto commented in part of a reaction to the non-entity adjusted data set, which displays similar numbers.\n\nBitcoin Entity-Adjusted URPD chart. Source: Glassnode\n\nOver 7 million BTC 'hodled or lost'\n\nOther on-chain data reinforces the idea that old hands are uninterested in selling their stake, despite this year’s BTC price doubling.\n\nRelated: Bitcoin spending copies history as metric flags ‘1st stage bull market’\n\nGlassnode’s Hodled or Lost Coins metric, which covers what it describes as “old and large stashes” of BTC, continues to head toward new record highs.\n\nHodled or Lost Coins is based on the so-called “liveliness” of the Bitcoin blockchain — how much of the supply moves at once and following what period of dormancy.\n\nThis data provides an insight into how stagnant the supply is, including, as its name suggests, how much is likely out of reach indefinitely — for example, due to wallet owners losing access to their investment.\n\nThe Hodled or Lost Coins segment currently includes 7.77 million BTC, worth around $233 billion. This is the highest tally in five years.\n\nBitcoin Hodled or Lost Coins chart. Source: Glassnode\n\nEstimates have long suggested that around 20% of Bitcoin’s 21 million units may already be locked from circulation forever.\n\nMagazine: Should you ‘orange pill’ children? The case for Bitcoin kids books\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaW5hbmNlLWludGVncmF0aW9uLWJpdGNvaW4tYnRjLWxpZ2h0bmluZy1uZXR3b3Jr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Binance completes integration of Bitcoin Lightning Network - Cointelegraph",
        "content": "Cryptocurrency exchange Binance has completed the integration of the Bitcoin Lightning Network on its platform for BTC withdrawals and deposits.\n\nThe development was confirmed by Binance in a July 17 blog post, where they noted that Binance users can now use the layer-2 scaling solution for BTC withdrawals and deposits.\n\nWhen users now choose to withdraw or deposit Bitcoin, they will now be able to select “LIGHTNING” as an option. Other options include BNB Smart Chain (BEP-20), Bitcoin, BNB Beacon Chain (BEP2), BTC (SegWit), and Ethereum ERC-20.\n\nScreenshot showing users can select \"LIGHTNING\" as an option when depositing Bitcoin. Source: Cointelegraph\n\nBinance first hinted at the integration of the Lightning Network in May after it had to temporarily pause BTC withdrawals due to a flood of pending transactions caused by “the recent surge in BTC network gas fees.”\n\nThe explosion in transaction fees has largely been attributed to the creation of memecoins on Bitcoin in the form of BRC-20 tokens — a new token standard on the network.\n\n#Binance has completed the integration of Bitcoin ( #BTC ) on the Lightning Network and deposits and withdrawals are now open.\n\n\n\nMore details here https://t.co/aIofPdtAGY — Binance (@binance) July 17, 2023\n\nBinance later confirmed it was working to onboard the Lightning Network on June 20 shortly after users spotted Binance's own Lightning nodes.\n\nRelated: What is the Bitcoin Lightning Network, and how does it work?\n\nBinance joins Bitfinex, River Financial, OKX, Kraken and CoinCorner as the other prominent exchanges to have embraced the Lightning Network.\n\nCoinbase CEO Brian Armstrong also signaled his intention to integrate the Bitcoin layer 2 network on Coinbase in April. However, he didn't give a timeline as to when that may happen.\n\nThe Lightning Network aims to make Bitcoin transactions faster and cheaper by allowing users to create off-chain transaction channels.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nMagazine: Bitcoin 2023 in Miami comes to grips with ‘shitcoins on Bitcoin’"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWFuZC1jcnlwdG8tY2hhc2UtdXBzaWRlLWFzLWVxdWl0aWVzLWV4dGVuZC10aGVpci1nYWluc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin and crypto brace for further upside as equities look to extend their recent gains - Cointelegraph",
        "content": "The long-awaited recession and resulting resumption of the 2022 bear market that many have been expecting have failed to materialize so far in 2023. In fact, most assets have caught a bid, with the Nasdaq hitting a 52-week high on July 12.\n\nHow can this be, and will the rally continue?\n\nMichael Burry of The Big Short fame declared in January that the United States could be in recession by late 2023, with the Consumer Price Index (CPI) lower and the Federal Reserve cutting rates (note that last week's CPI print came in much lower than expected, further fueling the recent rally). This would lead to another inflation spike, in his view.\n\nRecently, independent macro and crypto analyst Lyn Alden explored the topic in a newsletter published this month.\n\nIn the report, Alden examines today’s inflationary environment by contrasting it to two similar but different periods: the 1940s and the 1970s. From this, she concludes that the U.S. economy will likely stall or experience a mild recession while experiencing some level of persistent inflation. This could mean that markets continue trending upward until an official recession hits.\n\nMy July 2023 newsletter is out:https://t.co/gTH0nUyrU8\n\n\n\nThe topic focus on fiscal dominance, and how large debts and deficits can mute the impact of higher interest rates as a policy tool. pic.twitter.com/qmuzInyYjK — Lyn Alden (@LynAldenContact) July 2, 2023\n\nThe Fed’s inflation fight continues\n\nThe important difference between the two periods involves rapid bank lending and large monetized fiscal deficits, which Alden suggests are the underlying factors driving inflation. The former occurred in the 1970s as baby boomers began buying houses, while the latter occurred during World War II as a result of funding the war effort.\n\nThe 2020s are more like the 1940s than the 1970s, yet the Fed is running the 1970s monetary policy playbook. This could turn out to be quite counterproductive. As Alden explains:\n\n“So as the Federal Reserve raises rates, federal interest expense increases, and the federal deficit widens ironically at a time when deficits were the primary cause of inflation in the first place. It risks being akin to trying to put out a kitchen grease fire with water, which makes intuitive sense but doesn’t work as expected.”\n\nIn other words, today’s inflation has been primarily driven by the creation of new federal debt, or what some may call government money printing.\n\nRaising interest rates to calm inflation can work, but it’s meant for inflation that has its roots in an expansion of credit tied to banking loans. While higher rates tame such inflation by making borrowing more expensive and thus reducing loan creation in the private sector, they make fiscal deficits worse by increasing the amount of interest owed on those debts. The federal debt today is over 100% of gross domestic product (GDP), compared to just 30% in the 1970s.\n\nFederal government interest payment expenditures versus federal funds effective rate. Source: FRED\n\nWhile the Federal Reserve has cooled some parts of the economy by raising rates by 500 basis points in little more than a year, the underlying cause of the current inflationary environment remains unaddressed. And with a much higher debt-to-GDP ratio than the U.S. had 50 years ago, the situation will only worsen at a faster pace. But markets have remained resilient, including tech equities and crypto, even though the correlation between the two has broken.\n\nIn this way, the Fed may be using a tool unfit for the situation, but this hasn’t stopped markets, at least for now.\n\nBig Tech defies recession estimates and propels equities\n\nDespite the Fed’s battle with inflation and market participants’ expectation of an unavoidable recession, the first half of 2023 has been quite bullish for equities, with the rally extending into July. While bonds have sold off again, raising yields to near 2022 highs, risk assets like tech stocks have been soaring.\n\nIt’s important to note that this rally has primarily been led by just seven stocks, including names like Nvidia, Apple, Amazon and Google. These equities make up a disproportionate weight of the Nasdaq:\n\nJust seven stocks make up 55% of the NASDAQ 100 and 27% of the S&P 500\n\n\n\nThe distribution has become so lopsided that the NASDAQ will be rebalancing to give these megacaps less weight.\n\n\n\nSource: @GoldmanSachs pic.twitter.com/k1xM1wmL2S — Markets & Mayhem (@Mayhem4Markets) July 13, 2023\n\nRelated: Bitcoin mining stocks outperform BTC in 2023, but on-chain data points to a potential stall\n\nBonds down, crypto and tech up\n\nThe rally in tech due in large part to artificial intelligence-driven hype and a handful of mega-cap stocks has also caught a tailwind from an easing in bond market liquidity.\n\nAlden notes how this began late last year:\n\n“But then some things began to change at the start of Q4 2022. The U.S. Treasury began dumping liquidity back into the market and offsetting the Fed’s quantitative tightening, and the dollar index declined. The S&P 500 found a bottom and began stabilizing. The liquidity in sovereign bond markets began easing. Various liquidity-driven assets like bitcoin turned back up.”\n\nA July 11 report from Pantera Capital makes similar observations, noting that real interest rates also have a very different story to tell when compared to the 1970s.\n\n“The traditional markets may struggle — and blockchain might be a safe haven,” in part because “[t]he Fed needs to continue to raise rates,” given that real rates remain at negative 0.35%, according to the report. The report also concludes from this, “There’s still tons of risk in bonds.”\n\nThe report goes on to note that while most other asset classes are sensitive to interest rates, crypto is not. Bitcoin’s correlation to equities during 2022 was driven by the collapse of “over-leveraged centralized entities.” Today, that correlation has reached near-zero levels:\n\nBitcoin correlation with S&P 500. Source: Pantera Capital\n\nAmong the key takeaways may be that risk assets appear to have a bid under them for the time being. However, this trend could easily reverse by year-end.\n\nDan Morehead of Pantera Capital said it well when stating that:\n\n“Having traded 35 years of market cycles, I’ve learned there’s just so long markets can be down. Only so much pain investors can take. […] It’s been a full year since TerraLUNA/SBF/etc. It’s been enough time. We can rally now.”\n\nBitcoin price trend and year-over-year returns. Source: Pantera Capital\n\nWith the halving right around the corner and the prospect of a spot Bitcoin exchange-traded fund on the horizon, the catalysts for crypto seem poised for a breakout in almost any situation.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmV0Zi5jb20vc2VjdGlvbnMvZmVhdHVyZXMvMjFzaGFyZXMtb3BoZWxpYS1zbnlkZXItYmVpbmctZmlyc3Qtc3BvdC1iaXRjb2luLWV0ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "21Shares' Ophelia Snyder on Being First to a Spot Bitcoin ETF - etf.com",
        "content": "The race to launch a spot bitcoin ETF has been accelerating seemingly each day, with new players entering the field and making amendments to their applications to appease the SEC.\n\nIn a recent interview on etf.com’s Exchange Traded Fridays podcast, Ophelia Snyder, president and co-founder of 21.co, the parent company of 21Shares, emphasized the importance of being the first issuer to gain approval for a spot bitcoin ETF from the Securities and Exchange Commission.\n\nAlong with ARK Invest, 21Shares has the first application in the latest batch of bids to get a landmark ETF approved, followed by BlackRock, Fidelity and others.\n\nBeing the first issuer of a spot bitcoin ETF would help establish an early market presence and can provide a significant boost to a company's growth trajectory. Snyder drew a comparison to futures products, where the first-mover advantage led to a significant difference in assets under management.\n\n“If you look at, for example, the futures products, the difference between the first market and the second market, it was a couple of days,” Snyder noted. “And I think ProShares has about $1 billion in assets, and the second place has less than $100 million.”\n\nETF Structure Advantages\n\nIn an interview with etf.com, Snyder shed light on the regulatory environment, the advantages of an ETF structure and the potential impact on the broader cryptomarket.\n\nWhile many industry analysts were thrown off by BlackRock’s bid for the spot bitcoin ETF, the entry of major traditional players into the crypto space did not surprise Snyder. She noted that institutional adoption has been growing steadily.\n\n\"Institutional adoption in the space has been increasing now for years,” Snyder added. “So it's not terribly surprising that asset managers of that size are entering the space.\"\n\nThe broader crypto market has been evolving as well.\n\n\"What we've seen in the past few months, and what we're continuing to see as a lot of the work that people have put in in the last year, year and a half, since crypto has been a bit more bearish, are starting to see the light of day,” Snyder explained, noting advancements across the board from increased usage of more complex functions in bitcoin with things like ordinals and new protocols coming out.\n\n\"The crypto market is materially different today than it was three years ago, two years ago, even one year ago. There are a lot of fundamentals in the market that are changing,” she explained. “This transformation, combined with the emergence of surveillance sharing agreements, has piqued the interest of the SEC in approving a spot bitcoin ETF.”\n\nWhy Spot Bitcoin ETF?\n\nWhile the fast-evolving crypto landscape may suggest the spot bitcoin ETF is closer than ever, it’s worth asking why investors may want to opt for this ETF in the first place.\n\nAmong advantages of the ETF wrapper, Snyder outlined various factors for retail investors, including the ease of integration with existing wealth managers and traditional financial infrastructure. ETFs also provide access to higher quality custody solutions and better insurance coverage.\n\nFor institutions, outsourcing the management of crypto-specific infrastructure allows institutions to focus on their core competencies, similar to how traditional investors operate in other asset classes.\n\nSnyder noted that ETFs bridge the gap between traditional finance and crypto, opening up access and increasing overall market accessibility. This aligns with the original intention of ETFs, which was to increase access to various markets and asset classes.\n\nEducation Component\n\nEducation has been a cornerstone of 21Shares' approach to the U.S. market. Snyder emphasized the importance of building institutional knowledge and helping various stakeholders gain a deeper understanding of the crypto sector.\n\n“There's often an approach [that] crypto is wildly different than everything we've ever looked at before,” Snyder observed. “And in some respects it is, and in some respects, it isn't. So there's really an ability to build up that knowledge base and work with advisors, funds, other institutions to help them get comfortable and get into a position where they feel competent in the advice that they're giving their clients.”\n\nReflecting on 21Shares' European experience, Snyder expressed hope that the U.S. market would reach a similar level of sophistication. In Europe, the company manages 37 different products covering numerous crypto assets, catering to diverse investor needs.\n\nSnyder noted that while surveillance sharing agreements signal “deeper integration of cryptomarkets” with traditional markets, it does not automatically mean a huge shift or that it will be likely to have a big impact on crypto adoption.\n\nShe emphasized that regulatory clarity, achieved through consolidation among regulatory bodies, would play a pivotal role in driving market changes in the future.\n\n\"I think the places where you will see more of those types of major catalysts is if we do get that regulatory clarity, I think you're going to see a lot of changes around that in the coming months and years, whether it's through the Coinbase lawsuit, the Grayscale lawsuits, some of the enforcement actions from the SEC, some of what's happening in Congress,” she noted. “Eventually, these pieces have to come together to provide that clarity and provide a much more consolidated view. I think that will help tremendously.\"\n\n[Editor’s Note: 21Shares is a portfolio company of ETFS Capital, the parent company of etf.com.]"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZGVjcnlwdC5jby8xNDg3MzYvYml0Y29pbi1taW5lcnMtZmFjZS1zdHJlc3MtdGVzdC1pbi1uZXh0LWhhbHZpbmctanAtbW9yZ2Fu0gFZaHR0cHM6Ly9kZWNyeXB0LmNvLzE0ODczNi9iaXRjb2luLW1pbmVycy1mYWNlLXN0cmVzcy10ZXN0LWluLW5leHQtaGFsdmluZy1qcC1tb3JnYW4_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin Miners Face 'Stress Test' in Next Halving: JP Morgan - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin miners will face headwinds as the hash rate reaches new record highs ahead of the upcoming halving event next spring, with volatile electricity costs and competition among miners pushing up the cost of production, according to analysts at global financial giant JP Morgan.\n\nHash rate refers to the computational power used to mine a cryptocurrency. The halving event, which occurs roughly every four years, will reduce miners' rewards by half.\n\n\"The upcoming bitcoin halving event in April/May 2024 could be a stress test for Bitcoin miners,\" writes JP Morgan analyst Nikolaos Panigirtzoglou and colleagues in the firm's latest Flows and Liquidity report, which the firm shared with Decrypt.\n\nAD\n\nAD\n\n\"[It] would reduce the issuance rewards from 6.25 to 3.125 BTC, implying a reduction in miners’ revenue, effectively increasing Bitcoin’s production cost at the same time,\" the report explains. \"As a result, while Bitcoin halving is seen as having a positive effect on the bitcoin price given the production cost acted historically as a floor, it poses a challenge for bitcoin miners.\"\n\nAccording to the analysis, and based on a global average cost of electricity of $0.05/kWh, it costs around $20,000 to mine a Bitcoin, which is currently worth around $30,000, per CoinGecko. But JP Morgan said the volatility of the hash rate points to the use of a variety of energy sources, meaning miners with access to lower-priced power have an advantage.\n\nIn fact, the company said, a one-cent increase in the cost per kilowatt hour translates to a $4,300 increase in the cost of Bitcoin production.\n\n\"Post halving this sensitivity would double to $8,600, thus increasing the vulnerability of higher-cost producers,\" the firm noted.\n\nThere has been some good news for miners, however.\n\nAD\n\nAD\n\n\"Institutional interest in bitcoin mining has provided support to struggling miners, with investments in mining rigs from companies like Galaxy Digital and Grayscale Investments,\" it observed. Galaxy Digital recently acquired a major mining facility from Argo Blockchain, and Grayscale spun off an entity focused on Bitcoin mining hardware.\n\n\"Tether, the world largest stablecoin issuer, also plans an investment in a bitcoin mining site in El Salvador,\" according to the report.\n\nNonetheless, the price of Bitcoin and transaction fees will need to rise significantly to offset the lower block reward.\n\nJP Morgan also observed that \"the decline in hype surrounding cryptocurrencies poses an additional challenge for miners' revenues,\" including \"the decline in the hype around Ordinals.\"\n\nThe number of daily Ordinals inscriptions recently hit an all-time high, but Bitcoin fees did not sustain earlier highs along with them.\n\n\"Going forward, it seems unlikely that the Bitcoin hash rate will continue to rise at the same pace post the April/May 2024 halving event without any sustained rise in the Bitcoin price above its production cost or a large increase in transaction fees that could offset the reduction in issuance rewards,\" JP Morgan concluded."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiSGh0dHBzOi8vdW5oZXJkLmNvbS8yMDIzLzA3L2luc2lkZS1saWJlcmxhbmQtZXVyb3Blcy1iaXRjb2luLW1pY3JvbmF0aW9uL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Inside Liberland: Europe's Bitcoin micronation - UnHerd",
        "content": "Chugging down the Danube in a fisherman’s boat, past the unrecognised exclave known as Liberland, it’s hard to reconcile fantasy with reality. This patch of land — lushly forested, mosquito-ridden and boggy — remains unclaimed by neighbouring Croatia and Serbia, allowing a coterie of libertarian crypto enthusiasts to claim it as a nominally-sovereign micronation. But this sleepy cartographical quirk is a far cry from the visionary design generated by Zaha Hadid Architects to represent Liberland in the Metaverse, where silhouetted avatars stroll down deforested avenues lined with grand, neo-futurist architecture.\n\nThe idea of setting up an “independent” nation has always been attractive to libertarians, even though a half-century of attempts to establish tax-free idylls have produced no tangible results beyond angering locals and wasting the pocket change of billionaires like Peter Thiel. Partly in response to this, the more artistic tradition of “micronations” has been overtaken by a particular trend of Bitcoin-fuelled ultra-libertarianism, which implies less a release from state repression than a form of anarcho-capitalism. This vision has more in common with Dubai’s brand of free-market authoritarianism — a vision of ultra-rich luxury and labour exploitation — than any true utopian ideal.\n\nVit Jedlička, a ruddy-cheeked, stout-chested libertarian ideologue and self-styled President of Liberland, is as emphatic as he is energetic. “We are not a micronation, but a nation of 700,000 people, with embassies in 80 nations, and relations with countries like Haiti, Somaliland, and Malawi. We’re serious about getting Liberland set up as a country.” Never one to undersell his project, Jedlička clearly has tremendous fun barrelling around the world promoting Liberland. Nominally based out of this scrap of marshland the size of Gibraltar, but largely operating online, it’s a Web-3 nation: businesses unfettered from regulation, a skeleton state providing only basic protections, and “citizens” issued with voting credits based on the amount of voluntary tax paid.\n\nNever mind that none of those would-be citizens actually live in Liberland — instead there is a handful of activists moored downstream on a houseboat, under the close supervision of the Croatian police. Never mind that its diplomacy is rather more limited than Jedlička suggests, with the citizens of Malawi recently ridiculing their government for getting involved with a nation that is never likely to exist. The President is always ready with a litany of soon-to-be realised projects and promises, hinting at deals and meetings with billionaires and politicians. The crash in the crypto market is a blip; a Liberland houseboat has been torched, but there will be an insurance payout. Every potential threat is recast as proof his project will succeed.\n\nWe first meet in a half-finished holiday camp Jedlička has purchased on the Serbian side of the river. And there is a clear tension between this “eco-village” (a “diaspora” site where Liberland’s first “settlers” will train in survival and negotiation skills) and his Serbian supporters’ frustration at the lack of a clear business plan. But, even if its “ambassadors” are paid lobbyists or random Bitcoin enthusiasts, Liberland does have more political reach than other libertarian micronations. This is partly a product of Jedlička’s gregarious personality, which has kept the project alive since it began in 2015. Due to an arcane, post-Yugoslavian boundary dispute, neither Serbia nor Croatia prefer to lay claim to the 7km2 of territory, leaving it — Jedlička says — “terra nullia” for the taking. (The Croatian authorities disagree, tolerating the Liberlanders’ presence on their territory, but denying them access to the contested patch of land.)\n\nBut this reach is also thanks to the political moment into which Jedlička announced his project. The conservative Czech politician found a natural home in the heady world of Web-3 technologies, securing capital backing (through cryptocurrency investments) and the means to place Liberland’s constitution on the blockchain in perpetuity. He generated a growing, global interest in his ultra-libertarian vision — resulting in collaborations with big-name architects, the Polkadot cryptocurrency development fund, and a host of global Bitcoin fans, including the Liberian (not Liberlandian) Consul General to Dubai, currently living on a barge just outside the UAE in imitation of Liberland’s ideals.\n\nFor Jedlička, these international supporters “understand the economic potential of a truly free zone in the European Union… they like the vision, and want to watch”. He presents it as “combining aspects of the most successful states to date”, bringing together Singapore-style meritocracy, the town-hall democracy of early America, and the low-tax environment of European microstates such as Monaco or Liechtenstein.\n\nIn practice, such a system would face immediate issues. As we ride rickety bikes along the course of the Danube, Jedlička says he prefers the “right to set up a lemonade stand in the street over the right to cycle down it naked”, suggesting that the freedom to practice business should trump personal liberties. Yet this approach opens the door to all manner of abuses, since those individuals or businesses able to spend the most money will also be able to determine law and policy, by securing the most voting credits. Already, in Serbia’s Liberland-linked tourist village, a promised wage of €600 a month has proved insufficient to retain the skilled workers needed to complete the camp, leaving it half-finished. The “non-aggression principle” proposed to prevent direct physical harm between Liberland citizens offers no protection of basic rights. There is no health or social care, workplace protections or minimum wage. To the Liberland activists, “welfare state” is a dirty word.\n\nOther liberties would also come under threat. The project has been troubled from the outset by the question of whether free movement of peoples would be allowed, with Liberlanders congregated in the Serbian eco-village mocking the emailed residency applications of confused Middle Easterners who mistake the country for a real polity. While Jedlička generally presents an optimistic, modernising political model, Serbian supporters who drove up from Belgrade to visit their President describe themselves as proud “conspiracy theorists”. And this isn’t libertarian trolling: they cite the Protocols of the Elders of Zion and Ku Klux Klan associate Albert Pike in arguing that the world faces an imminent race war orchestrated by the same Jewish New World Order they allege was behind the Holocaust. Given no-one actually lives in Liberland, Jedlička is free to place his trust in a notional citizens’ veto to prevent abuses of rights. But it remains unclear how a clash between libertarian ideals of free movement and the survivalist, white-nationalist inclinations of many its followers would be avoided.\n\nJedlička is able to evade these issues through a mixture of blind confidence and the fact that his project exists only on paper — or on blockchain. A fully-fledged Liberland would resemble real-world microstates, in that it would rely on either the continued “mining” of cryptocurrencies or on accommodating international capital as a tax haven. Quoting a sympathetic, Belgrade-based think tank, Jedlička suggests a tax haven on the Danube would bring a GDP boost to neighbouring states.\n\nBut other libertarian projects have failed following local opposition: the 1972 “Republic of Minerva”, an attempt to establish a microstate on reclaimed land in the ocean near Tonga, came a cropper when locals decided not to allow rich Westerners to enjoy a tax-free oasis at the expense of their fishing rights. More recently, a “seasteading” project which aimed to establish a floating utopia near Tahiti, initially backed by libertarian billionaire Peter Thiel, met a similar fate, collapsing following angry protests from locals opposing a “megalomaniacal” project with no clear benefit to the local economy.\n\nRecent attempts to establish crypto-friendly communities of expats in Puerto Rico and Central America have also foundered. Notoriously, El Salvador has witnessed a protracted effort by its president, Nayib Bukele, to force locals into using Bitcoin, while attracting the Western crypto elites to free-market resorts intended to serve as Bitcoin playgrounds. The attempted pivot to virtual currency has been met with indifference and protest. Following the recent crypto crash, the nation came close to defaulting on its sovereign debt. Bukele’s Bitcoin roll-out has also gone “hand in hand” with the introduction of a “police state” characterised by widespread arrests, detentions and torture, including the arbitrary arrest of those opposed to the government’s bitcoin policy. Liberland’s nominal finance minister Navid Saberin, a Luxembourger businessman, admits he personally visited El Salvador and found “no-one had anything good to say” about the Bitcoin pivot. Yet he also remains wholly optimistic that Bitcoin will bounce back, restoring his fortunes and justifying Bukele’s efforts.\n\nJedlička worries that finance journalists dismiss Liberland’s political programme as too utopian. In reality, the opposite is true. If realised, his “vision” would result in a dystopian combination: reliance on foreign capital which creates little benefit for local communities, undergirded by authoritarian excesses in defence of those elite financial interests. The Liberland proposal is not a challenge to the current economic order. It is its fullest expression, stripped of all protections, checks and balances.\n\nBut this vision has its appeal. In the surrounding states, crony capitalism beholden to EU investment has brought few benefits to ordinary people. Liberland’s President is a genuine and infectious believer in personal sovereignty, and it’s little wonder frustrated young people are attracted by his dynamic, untrammelled version of capitalism, as they are by the get-rich-quick crypto promise. And though Jedlička is keen to distance himself from more playful, performance-based micronations, the political model has also been used to register protest against authoritarianism and homogenisation. Protest projects such as Germany’s Free Republic of Wendland or New Zealand’s Independent State of Aramoana stood up against the profit-driven destruction of local communities and environments, with the latter successfully resisting the state-backed imposition of an aluminium smelter. In nearby Slovenia, the Neue Slowenische Kunst (NSK) used provocative appropriations of state insignia to critique state authoritarianism.\n\nThough dismissed by Jedlička, this spirit of protest is inherent to both the micronation concept and the libertarian movement. There is room for a more productive critique of an admittedly exploitative global financial system rigged to benefit certain states, which also recognises the limitations of crypto and the role that tax havens and free-market ideology play within that system. For now, though, we have only Jedlička’s vision of Dubai-on-the-Danube, and its handful of loyal followers."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWNyeXB0by1pbnZlc3RtZW50LWZ1bmRzLWZvdXJ0aC1zdHJhaWdodC13ZWVrLWluZmxvd3MtY29pbnNoYXJlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Inflows into crypto investment funds rise as Bitcoin carries 99% of the load - Cointelegraph",
        "content": "Bitcoin continues to shoulder the market, as digital asset inflows saw positive movement for the fourth consecutive week, with $137 million incoming.\n\nAccording to CoinShares, this brings the four-week total to $742 million — correcting the nine weeks’ worth of outflows before the streak began and marking the largest inflow run since the fourth quarter of 2021.\n\nThe continuing positive momentum might be attributed to several factors, including a recent partial victory for the crypto community in the form of a legal decision in the Securities and Exchange Commission v. Ripple lawsuit.\n\nRelated: SEC could be waiting ‘years’ to file appeal in Ripple case — Brad Garlinghouse\n\nThe XRP (XRP) token soared on news of the ruling, and the market followed suit with a week of activity that received an overall rating of 56 on the “Fear and Greed Index” for cryptocurrency — an indication of “greed,” or increased positive sentiment. This week, however, the index saw a return to a “neutral” rating, as of July 17, despite four weeks of positive inflows into crypto investment products.\n\nBitcoin (BTC) carried the lion’s share of all fund traffic, with 99% of all inflows and a weekly total of $140 million. Some of those gains were countered by outflows in other cryptocurrencies, including another $2 million for Ether (ETH) — it remains the asset with the highest total outflows year-to-date.\n\nWhile Bitcoin has extended its market dominance, its overall market capitalization has budged slightly week-over-week, reflecting subdued price action for the largest cryptocurrency. As of July 17, Bitcoin’s market dominance rate is down nearly a percent at 50.18%, according to TradingView.\n\nFollowing a few late updates to prior weekly data, inflows for the last 4 weeks now total US$742m, representing the largest run of inflows since the final quarter of 2021.\n\n\n\n2/6 pic.twitter.com/v4QL8QA706 — CoinShares (@CoinSharesCo) July 17, 2023\n\nGeographically speaking, the song remains the same. The United States and Canada hosted the vast majority of digital asset activity, with $109 million in inflows for the former and $28 million for the latter.\n\nMost other regions experienced outflows. The exception was Switzerland, which beat the European market with $3.3 million in inflows, bringing its monthly total to $12.2 million."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWZ1bGwtYnJlYWtvdXQtbm90LWJ0Yy1wcmljZS1tb250aC0zMGvSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin 'full breakout' not here yet as BTC price spends month at $30K - Cointelegraph",
        "content": "Bitcoin (BTC) refused to give up $30,000 at the July 17 Wall Street open as observers placed bets on a step lower next.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin traders line up downside targets\n\nData from Cointelegraph Markets Pro and TradingView followed what one analyst called boring BTC price action into the new trading week.\n\nAfter an equally quiet weekend, BTC/USD showed no signs of volatility amid a lack of catalysts for change across risk assets.\n\nTwenty-six days within this range for #Bitcoin.\n\n\n\nBoring. pic.twitter.com/JghJp1dCCQ — Michaël van de Poppe (@CryptoMichNL) July 17, 2023\n\n“The market is in flux, and both camps are fighting for dominance,” on-chain monitoring resource Material Indicators wrote in part of its latest analysis, referring to a battle between Bitcoin bulls and bears.\n\n“Everytime bears start to get some momentum, bulls replenish support at $30k. IMO, still too soon to declare a confirmed bull breakout, quite simply, because we haven’t even had a legit test of resistance. Time for patience and discipline.”\n\nBTC/USD 1-week chart with 200-week moving average. Source: TradingView\n\nMaterial Indicators co-founder Keith Alan suggested that should $30,000 be lost, Bitcoin could find support at key trend lines such as the 200-week moving average at $27,000. This chimed with existing predictions from popular traders Cointelegraph reported on earlier.\n\nTraders Skew and Daan Crypto Trades, meanwhile, noted a “heavy divergence” between spot and derivatives markets, with sellers apt to get the upper hand short term.\n\n#Bitcoin Pretty heavy divergence between perps and spot here.\n\n\n\nPerps pushing up while spot seems to be selling off. pic.twitter.com/Rhn8PuDlyP — Daan Crypto Trades (@DaanCrypto) July 17, 2023\n\nshorts pushing here, this is where sellers should gain control on market direction\n\n\n\ncontrarian view is shorts get trapped at lows (buyers step in = absorbing sell pressure) $BTC — Skew Δ (@52kskew) July 17, 2023\n\n“Clear bias for me here,” trader CJ continued alongside a chart with a short-term relief target between $30,000 and $31,000.\n\n“Spike into inefficiency and reject — will expect range lows at least, if not breakdown from this range. Reclaim inefficiency (and thus, April high) then we have a solid recovery and we are so back again.”\n\nBad news for Bitcoin dominance?\n\nElsewhere, concerns over Bitcoin’s retreating crypto market dominance played on the minds of market participants.\n\nRelated: Will Bitcoin catch up? BTC price was $40K when the dollar was previously this weak\n\nPopular trader Jibon called the dip below 50% dominance “not good” for BTC, while in its latest market update, trading firm QCP Capital tied United States regulatory events to even lower dominance to come.\n\nBitcoin dominance, it wrote, “is likely to break its recent uptrend and move lower again, at least until the BTC physical ETF decision, or when macro factors take over again.”\n\nLast week’s legal rebuke of the U.S. Securities and Exchange Commission over allegations that sales of altcoin XRP (XRP) represented unregistered securities was a mixed blessing for investors, it said.\n\nBitcoin, which QCP described as “being set up as the ‘anti-security’ coin,” could stand to lose to altcoins thanks to U.S. investor confidence returning.\n\nBitcoin market cap dominance chart. Source: TradingView\n\nMagazine: Experts want to give AI human ‘souls’ so they don’t kill us all\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2JpdGNvaW4tbmV3cy9iaXRjb2luLXByZXN1bWVkLWxvc3QtZm9yZXZlci_SAUdodHRwczovL3d3dy5uZXdzYnRjLmNvbS9iaXRjb2luLW5ld3MvYml0Y29pbi1wcmVzdW1lZC1sb3N0LWZvcmV2ZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "29% Of Bitcoin’s Circulating Supply Is Now Presumed Lost Forever - NewsBTC",
        "content": "According to recent findings from blockchain analytics company IntoTheBlock, around 29% of the total Bitcoin circulating supply is now presumed lost forever after remaining stagnant for over five years.\n\nBitcoin was designed to be scarce, with only 21 million coins ever to be mined, but the very features that make the cryptocurrency so attractive to investors can sometimes lead to investors losing their assets forever, especially in cases where private keys are forgotten.\n\nRelated Reading: Why Ripple’s Victory Against The SEC May Be Short-Lived: Legal Expert\n\nStagnant BTC Addresses Are Growing Over Time\n\nIn a recent tweet by IntoTheBlock, the company called attention to the high number of dormant bitcoin addresses. “Our data shows that 29% of $BTC hasn’t moved in over 5 years. It’s possible that a large part of this concerns lost coins,” the tweet said.\n\nBTC presumed lost crosses 7.7 million | Source: Glassnode\n\nSimilar data has been supplied by Glassnode Alerts, an on-chain metrics monitor. According to Glassnode, on-chain data shows that the total quantity of HODLed or lost bitcoins just hit a new all-time high of 7,781,224.168 BTC. Given that the price of a single Bitcoin is currently about $30,000, this equates to more than $235 billion in BTC that has now been lost.\n\nWhat Does This Mean For Bitcoin?\n\nInstitutional interest in Bitcoin has grown in the past year, with companies like MicroStrategy doubling down on their bitcoin holdings. Hence, the increase in dormant addresses can show more people are holding Bitcoin as a long-term investment rather than trading or spending it. However, it can also signal the amount of BTC lost forever, especially by early investors.\n\nBTC price trending at $30,100 | Source: BTCUSD on TradingView.com\n\nTaking into account that early investors are more likely to cash out on the huge gains made by the price of bitcoin, the latter is more likely. The price of Bitcoin has skyrocketed over the years and small amounts of Bitcoin from the early days are now worth a fortune. So if investors still had access to these dormant BTC, then they would likely have been moved already.\n\nAs Bitcoin gained mainstream popularity, many people have also bought in without fully understanding how to secure their private keys properly. A good example is the case of Stefan Thomas, a San Francisco-based programmer who is unable to asses his holdings of about 7,002 bitcoins. Thomas’ holdings are currently worth $216 million, but he can’t remember the password containing the private keys to his digital wallet.\n\nWith bitcoin having a fixed supply, its increasing scarcity due to lost coins can also enhance its appeal as a store of value. This could drive the price up due to increasing demand for the fewer bitcoins in circulation.\n\nBitcoin has seen a surge in price in recent months fueled by spot ETF applications filed by major investment companies like BlackRock and Valkyrie. The cryptocurrency is up by 43% this year and is currently ranging around $30,000 for the past few weeks.\n\nFeatured image from Futurism, chart from TradingView.com\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZWNvbm9teW1pZGRsZWVhc3QuY29tL25ld3MvYml0Y29pbi1pcy1pbi1hLWhvbGRpbmctcGF0dGVybi1idXQtbm90LWZvcmV2ZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin is in a holding pattern, but not forever - Economy Middle East",
        "content": "2024 halving event could boost value\n\nFrom last June 17’s $26,500 Bitcoin (BTC) price to July 17 today, the value of the biggest crypto by market cap has only risen around $3,000. That’s something BTC can do in one day alone.\n\nThe major crypto has been stagnant, to say the least, and was briefly buoyed by BlackRock’s ETF (exchange-traded fund), a major move by the $10 trillion asset manager which pushed BTC over the $31,000 mark only to subside below the $30K level in less than 24 hours.\n\nThe United States Securities and Exchange Commission (SEC) accepted BlackRock’s ETF application a day after it acknowledged a similar application by Bitwise. Last Friday, the U.S. regulator said it would also review applications for various funds, including Wise Origin Bitcoin Trust, WisdomTree, VanEck, and Invesco Galaxy.\n\nRead: Why is Bitcoin pushing $30k?\n\nThis points to SEC’s preparedness to look into creative crypto trades and bodes well for bullish Bitcoin proponents.\n\nA fund that mirrors the value of one or multiple digital tokens and comprises a variety of cryptocurrencies is known as a cryptocurrency ETF.\n\nPutting downward pressure on Bitcoin prices has been SEC’s regulatory probe of Binance and Coinbase exchanges, but next Wednesday’s U.S. inflation report for last June is also helping maintain a price status quo. Typically, a low inflation report is a good sign for crypto prices while a need to increase interest rates to battle inflation is the contrary.\n\nEconomists are forecasting the headline year-on-year CPI, a measure of the index for all items less food and energy, is likely to have cooled to 3.1 percent in June from May’s 4 percent.\n\nCurrent appetite for Bitcoin\n\nCrypto analytics firm Glassnode revealed that a record amount of BTCs were traded near the current price, a buyer behavior that suggests significant demand for Bitcoin today.\n\n“In this calculation, we discard coin movements between addresses controlled by the same entity, as such transfers do not correspond to real purchasing events and would distort the actual mean purchasing price. Further, we exclude all supply that is on exchanges, because a single averaged price for the funds of millions of users would be misleading and give rise to unwanted artifacts in the data,” Glassnode’s explainer confirms.\n\nNearly 4 percent of the total BTC supply last moved at just over $30,000 more than when the crypto was priced at $16,500 in 2022, immediately post the FTX collapse.\n\nHalving rally\n\nBitcoin could see a major price boost at next year’s Spring halving event.\n\nThe halving event occurs every four years and is part of helping BTCs become a store of value by limiting the mining (or printing) of coins, as no new bitcoins will be released after the 21-million coin limit is reached.\n\nThe event will reduce miners’ rewards by half. Currently, rewards are 6.25 BTC per block ($187,000) and in April 2024 they will be reduced to 3.125 BTC per block.\n\nHalving has historically been seen as having a positive effect on the Bitcoin price.\n\nThis will happen at the expense of BTC miners. With less of an incentive to mine cryptos, there will be less supply on the market and this means more demand, helping inflate prices.\n\nBased on a global average cost of electricity of $0.05/kWh, it costs around $20,000 to mine a Bitcoin.\n\nFor more on technology, click here."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG8tZXhjaGFuZ2UtYmluYW5jZS1maW5hbGl6ZXMtYml0Y29pbi0wOTU2NTc3NDAuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Crypto Exchange Binance Finalizes Bitcoin Lightning Network Integration - Yahoo Finance",
        "content": "Binance, the world’s largest cryptocurrency exchange in terms of trading volume, today announced it has completed its integration of the Lightning Network, the popular scaling solution running atop the Bitcoin blockchain.\n\nBinance users can now use the Layer-2 scaling solution for Bitcoin withdrawals and deposits, the company said in a Monday announcement. To make use of the new feature, users need to select the “BTC-Lightning” as their network when depositing or withdrawing Bitcoin from the exchange.\n\nThe integration comes after Binance confirmed last month that it was in the process of incorporating Lightning nodes into its infrastructure.\n\nThe intention to enable Lightning withdrawals was initially disclosed by the exchange in May, following a period of heightened congestion on the Bitcoin network that led Binance to temporarily suspend BTC withdrawals.\n\n#Binance has completed the integration of Bitcoin ( #BTC ) on the Lightning Network and deposits and withdrawals are now open. More details here 👇https://t.co/aIofPdtAGY — Binance (@binance) July 17, 2023\n\nDuring that time, the Bitcoin mempool, which holds pending transactions, had more than 420,000 unconfirmed transactions, surpassing even the levels observed during the bull run of 2021.\n\nThe network congestion resulted in a significant increase in average transaction fees for Bitcoin and was largely attributed to the emergence of the BRC-20 token standard created on the Bitcoin Ordinals protocol.\n\nOther major crypto exchanges that have integrated support for the Lightning Network include Kraken, OKX, and Bitfinex, as well the mobile payment platform Cash App.\n\nStory continues\n\nMultiple addresses\n\nIn a separate development, Binance today revealed it has launched a new feature enabling users to obtain multiple deposit addresses for a single network.\n\nInitially, users can generate multiple deposit addresses only for tokens issued on the Ethereum network (ERC-20) and Ethereum-compatible networks like Arbitrum One or BNB Chain, with more networks to be supported at a later stage.\n\nAccording to Binance, users may obtain up to 20 deposit addresses for each network. The exchange will periodically review this quota to decide if an increase or decrease on the number of deposit addresses is necessary.\n\nDecrypt has reached out to Binance for comment and will update this article should the exchange respond."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiQWh0dHBzOi8vY3J5cHRvYnJpZWZpbmcuY29tL2JpdGNvaW5zLTIwMjQtaGFsdmluZy1tYXJrZXQtY2F0YWx5c3Qv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin's 2024 Halving: Market Catalyst or Mining Consolidation - Crypto Briefing",
        "content": "Share this article URL Copied\n\nIn a matter of months, the world of Bitcoin and digital currencies will be experiencing another historic event – the fourth Bitcoin Halving expected in April 2024. This moment of anticipation and speculation serves as a high-stakes litmus test for both Bitcoin miners and the crypto market.\n\nIt is an event that has previously catalyzed monumental market shifts and could do so again.\n\nJUST IN – We're now 80% through to the next #Bitcoin halving. HODL ON ✊ pic.twitter.com/OIeEmVLYBt — Bitcoin Magazine (@BitcoinMagazine) July 14, 2023\n\nBitcoin halving is a unique feature of Bitcoin’s supply algorithm, where the rewards for miners are halved every 210,000 blocks of transactions – an occurrence approximately every four years. Satoshi Nakamoto, the creator of Bitcoin, linked the BTC’s creation to its anti-counterfeiting mechanism – the complex computational mining process that validates transactions on the blockchain.\n\nInitially, a block’s mining reward was 50 BTC; by 2024, this reward is slated to be 3.125 BTC.\n\nThe question facing us now is how this halving will impact Bitcoin and the overall crypto landscape. Historically, halvings have been associated with skyrocketing price movements. The halvings in 2012 and 2016 sparked bull runs, with BTC valuations soaring by about 8,000% and 1,000%, respectively. More recently, the 2020 halving unleashed a run that peaked with a record Bitcoin price of nearly $69,000 in November 2021.\n\nHowever, numerous factors contribute to the market’s complex dynamics. Bitcoin’s price movements have often coincided with other significant events, such as broader mainstream recognition, the proliferation of initial coin offerings (ICOs) and technological advancements.\n\nThe economic climate presents a potential dampener to the halving hype, with reduced expectations of U.S. Federal Reserve interest-rate cuts and stringent regulatory scrutiny of cryptocurrencies around the world. Predicting a halving-induced bull run is far from a secure bet. As skepticism surrounding the halving’s impact gains traction, other factors including macroeconomic trends and regulatory frameworks could take precedence over shaping Bitcoin’s price than the halving.\n\nMeanwhile, Bitcoin miners – those who actually provide the industry with new BTC – are faced with a troubling reality. Bitcoin mining, already an operation demanding substantial resources, will become even more challenging with the dwindling rewards. A Bloomberg report interviewed Jaran Mellerud, a crypto-mining analyst at Hashrate Index, who predicted:\n\n“Nearly half of the miners will suffer given they have less efficient mining operations with higher costs.”\n\nA considerable portion of miners could see an increase of $.08 k/h, which could signal a potential consolidation or even an exodus within the mining industry, Mellerud predicted.\n\nWolfie Zhao, head of research of Blockbridge, told Bloomberg that currently, public mining companies pay $10,000-$15,000 per mined Bitcoin. However, estimates suggest that mining BTC will cost between $20,000-$30,000:\n\nFor the average Bitcoin holder, however, the halving’s impact will be mostly indirect. The event itself won’t change the amount of BTC in their holdings, but its potential effect on price will be the most significant.\n\nIt could also very well serve as a springboard for another cyclical bull run or bring in a period of turbulence and consolidation. While the answer remains unclear, one thing is certain: the coming months will be a defining period for Bitcoin, its miners and the global cryptocurrency ecosystem."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vY3J5cHRvbmV3cy5jb20vbmV3cy9pbnZlc3RpZ2F0aW9uLXJldmVhbHMtYml0Y29pbnMtY3JlYXRvci1zYXRvc2hpLW5ha2Ftb3RvLWNvdWxkLWdyb3VwLW5vdC1hbi1pbmRpdmlkdWFsLmh0bdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Investigation Reveals Bitcoin's Creator Satoshi Nakamoto Could Be a Group, Not an Individual - Cryptonews",
        "content": "Investigation Reveals Bitcoin’s Creator Satoshi Nakamoto Could Be a Group, Not an Individual\n\nSource: Adobe/Mihail\n\nThe identity of Satoshi Nakamoto, the enigmatic creator of Bitcoin (BTC), has been a subject of intense curiosity and speculation since the advent of the leading cryptocurrency.\n\nWhile many envision a single genius behind its inception, there is growing evidence to suggest that Nakamoto may actually be a collective entity.\n\nIn its latest installment of the “Many Facts” Satoshi series, which presents various pieces of evidence pointing to the potential identities of Satoshi Nakamoto, Bitcoin.com News suggested that the mastermind behind Bitcoin’s creation is a group rather than an individual.\n\nThe media claimed there is compelling evidence pointing out that Nakamoto may be a collective.\n\nOne piece of evidence is the usage of both “we” and “I” in the Bitcoin white paper, indicating the possibility of a team operating under a singular pseudonym.\n\n“We propose a solution to the double-spending problem using a peer-to-peer network,” Nakamoto says in the whitepaper.\n\n“We define an electronic coin as a chain of digital signatures,” the pseudonymous creator of Bitcoin says in another place.\n\nAnother piece of evidence comes from the linguistic analysis of Nakamoto’s writings.\n\nThe white paper showcases impeccable English with precise language and accurate usage of technical terms. But since Nakamoto’s writing style appears to be different in forums and email correspondences, this suggests multiple individuals were involved.\n\nA linguistic analysis of Nakamoto’s forum posts revealed varying writing styles, further supporting the theory of a collective behind the pseudonym, the report said.\n\nNakamoto’s Timestamps on Messages Support He Was a Collective Entity\n\nThe timestamps on Nakamoto’s messages also hint at the involvement of multiple individuals.\n\nThere are theories regarding Nakamoto’s location, with some suggesting that the Bitcoin mastermind lived in the UK while others found that he resided in California.\n\nA review titled “The Time Zones of Satoshi Nakamoto” analyzed Nakamoto’s hourly activity and concluded that Nakamoto likely resided in the EST time zone.\n\nIf Nakamoto is indeed a group, it would explain the possibility of multiple time zones being involved.\n\nThe breadth of knowledge displayed by Nakamoto is another indicator that he may be a collective.\n\nThe creator demonstrates proficiency in computer science, mathematics, flawless English, game theory, and the successful concealment of his identity for over a decade.\n\nIt raises doubts as to how a single individual could possess such a diverse skill set while remaining anonymous.\n\nDespite these compelling theories and details, there is no concrete evidence to confirm that Nakamoto is a group.\n\nNevertheless, the true identity of Satoshi Nakamoto continues to remain unknown, making the saga of Bitcoin’s creator continues to be one of the most intriguing mysteries in the world of cryptocurrency."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vcGhvdG9zL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS0xNy1qdWx5LWJpdGNvaW4tZXRoZXJldW0tZG9nZWNvaW4tc29sYW5hLXNoaWJhLWludS1wb2x5Z29uLTE3MjM1NTgxLmh0bdIBjQFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vcGhvdG9zL2NyeXB0b2N1cnJlbmN5L2NyeXB0by1wcmljZS10b2RheS0xNy1qdWx5LWJpdGNvaW4tZXRoZXJldW0tZG9nZWNvaW4tc29sYW5hLXNoaWJhLWludS1wb2x5Z29uLTE3MjM1NTgxLmh0bS9hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin above 30k mark, Ethereum and other tokens trade mixed - CNBCTV18",
        "content": "1 / 8\n\nBitcoin | The world's largest and most popular virtual currency, Bitcoin, rose 0.2 percent to $30,279.4. Its market value stood at $588.6 billion. The trade volume was at $8.3 billion.\n\n2 / 8\n\n\"Bitcoin went below $30,000 briefly over the weekend as Ripple’s win against SEC enabled surge for the altcoins Bitcoin’s moving average indicates a ‘Buy’ sentiment whereas the market oscillators indicate a ‘Neutral’ sentiment,\" said Rajagopal Menon, Vice President, WazirX.\n\n3 / 8\n\nEthereum | The second largest virtual currency, Ethererum or Ether, fell 0.1 percent to $1,927.3 with a market capitalisation of $231.7 billion. The trade volume of Ethereum was $4.3 billion in the last 24 hours.\n\n4 / 8\n\n\"Ethereum is presently trading above $1,900, and we might see it trade within the narrow range of $1,900 to $1,950 this week,\" said Edul Patel of Mudrex.\n\n5 / 8\n\nDogecoin | Meme-based virtual currency, Dogecoin, fell half a percent. Its market value stood at $9.8 billion. The trade volume was at $335.9 billion.\n\n6 / 8\n\nSolana | Solana gained 2.3 percent to $28.1 with a market capitalisation of $11.4 billion. The trade volume of Solana was $707 million in the last 24 hours.\n\n7 / 8\n\nShiba Inu | Shiba Inu slid 0.8 percent with a market capitalisation of $4.7 billion. The trade volume was $91 million in the last 24 hours.\n\n8 / 8"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2hvdy10by1taW5lLWJpdGNvaW4tZnJvbS15b3VyLXNtYXJ0cGhvbmUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "How to Mine Bitcoin from Your Smartphone? - Analytics Insight",
        "content": "Learn ways to mine crypto in July 2023 on your smartphone\n\nA mining app is the only method to utilize your smartphone to start mining Bitcoin. These mining applications enroll you in mining pools or teams of other miners who employ the hardware in your smartphone to produce a certain amount of hashrate while mining cryptocurrencies. You’ll eventually produce enough Bitcoin to exchange it for fiat money profitably.\n\nApps for crypto mining were previously prohibited in the Apple App Store and Google Play Store. The major cause of this is that they place a ton of strain on the processors in your phone, which can cause battery loss, battery bloating, overheating, and latency problems. The first important thing you need to know is that you cannot download (legal) mining programs from the app store on your smartphone. We will go into more depth about this later. You must ask a friend to share a crypto mining program with you because downloading them online is incredibly hazardous. All you have to do to begin mining the cryptocurrency you choose is sign into the app after downloading it, look for a mining pool to join, and join. Even though it may take a while, you will eventually obtain a significant quantity of your preferred cryptocurrency, which you can then exchange for actual money via the app.\n\nDespite the dangers, mining can still be a practical alternative for a smartphone, especially given that many applications offer users the choice of using mine to purchase a “premium” membership that eliminates all adverts. According to a recent survey, many consumers are eager to enable crypto-mining to substitute advertisements in exchange for advantages like a better user experience. Additionally, mining may be profitable for old devices that no longer contain your data. The most effective app for mining cryptocurrency on a smartphone is MinerGate.\n\nOne of the top mobile applications for mining cryptocurrencies is MinerGate. The program is extremely safe, has a ton of functionality, and gives miners access to statistics. On the app, you can customize your Bitcoin mining settings, such as the low usage mode, which lowers your total hashrate while maintaining most of your device’s performance. MinerGate is used by over 5 million miners, demonstrating its widespread use. To guarantee you maximize your income, MinerGate also offers a 99.7% uptime rate. The app’s sole flaw is forcing you into the built-in mining pools rather than letting you join pools for a particular coin you choose.\n\nCryptocurrency storage is necessary in addition to mining it if you want to keep it for the long run. My top-ranked cryptocurrency exchanges, ZenGo and Revolut, which include bank-level security technologies, are where you should store your cryptocurrency if you want to keep it secure. Although neither is our preferred cryptocurrency exchange, they include an integrated wallet, which VirgoCX does not. Exchanges like Newton, Bitbuy, and CoinSmart are also highly regarded. ZenGo is free to use, so you receive the finest security available without spending any money. Additionally, ZenGo offers free crypto sending and receiving, and its round-the-clock support staff often responds to questions within five minutes.\n\nYour crypto is safeguarded by two separately developed mathematical secret shares, one stored on your phone and the other in the cloud, thanks to ZenGo’s exclusive keyless technology. Because of this innovative structure, your money will always be completely safe and easy to access, even if your phone is lost, stolen, or damaged or if ZenGo (the firm) were to commit fraud, declare bankruptcy, or otherwise discontinue operations.\n\nZenGo supports over 75 crypto assets, and creating a free account takes just a few seconds. Overall, ZenGo is the next iteration of crypto; it combines the best of both worlds with the highest level of security inside a user-friendly interface.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmZpbmFuY2lhbGV4cHJlc3MuY29tL2J1c2luZXNzL2Jsb2NrY2hhaW4tYmluYW5jZS1jb21wbGV0ZXMtYWRkaXRpb24tb2YtYml0Y29pbi1vbi1pdHMtbGlnaHRuaW5nLW5ldHdvcmstMzE3MzUyNi_SAYEBaHR0cHM6Ly93d3cuZmluYW5jaWFsZXhwcmVzcy5jb20vYnVzaW5lc3MvYmxvY2tjaGFpbi1iaW5hbmNlLWNvbXBsZXRlcy1hZGRpdGlvbi1vZi1iaXRjb2luLW9uLWl0cy1saWdodG5pbmctbmV0d29yay0zMTczNTI2L2xpdGUv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Binance completes addition of Bitcoin on its Lightning Network - The Financial Express",
        "content": "Binance, a cryptocurrency exchange, mentioned that it has completed adding Bitcoin (BTC) to its Lightning Network. It is expected that this would enable the use of a layer-2 scaling solution for Bitcoin exchanges and deposits, stated Cointelegraph.\n\nSources revealed that, on July 17, 2023, “Binance has completed the integration of Bitcoin (BTC) on the Lightning Network and deposits and withdrawals are now open,” Binance tweeted.\n\nIt is believed that earlier Binance had given a clue about the inclusion of the Lightning Network in May 2023. Supposedly, this took place after it had to discontinue BTC withdrawals temporarily, due to a large number of pending transactions caused by the surge of Ordinals inscriptions, Cointelegraph added.\n\nAlso Read Eeon asks crypto-exchange Binance for a compensation\n\nReportedly, Binance later announced that it will onboard the Lightning Network on June 20, 2023, after users identified Binance’s own Lightning nodes. Furthermore, The Lightning Network is expected to make Bitcoin transactions faster and cost-friendly by enabling users to create off-chain transaction channels, Cointelegraph concluded.\n\n(With insights from Cointelegraph)\n\nFollow us on Twitter, Facebook, LinkedIn"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3VhZS13YW50cy10by1iZS10aGUta2luZy1vZi1iaXRjb2luLW1pbmluZy1hcy10aGUtd29ybGQtbG9va3MtYXQtaW5xdWJldGEtYW5kLWFpL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "UAE Wants To Be The King of Bitcoin Mining, As The World Looks At InQubeta and AI - Analytics Insight",
        "content": "The United Arab Emirates (UAE) is steadily establishing itself as the world’s largest Bitcoin (BTC) mining location. The UAE’s partnership with major mining firms and the digital assets of Abu Dhabi’s sovereign wealth fund have made it an emerging crypto-mining hub. Its partnership with different Bitcoin mining companies has further contributed to its appeal for Bitcoin mining. Furthermore, the UAE has 400 megawatts of Bitcoin mining capacity, which has been predicted to surpass 600 megawatts by the end of the year. Additionally, its abundance of energy resources makes it a suitable environment for Bitcoin mining.\n\nMeanwhile, the world is also looking at Artificial Intelligence (AI), a disruptive technology, and InQubeta, the blockchain-based investment and fundraising platform for AI startups.\n\nIn this post, we will look into InQubeta and the specifics of its ecosystem and utility coin.\n\nInQubeta (QUBE): The face of AI cryptocurrencies\n\nThe United Arab Emirates’ (UAE) ambition to become a leading Bitcoin mining hub has not taken the spotlight away from artificial intelligence (AI) or InQubeta. AI is still a revolutionary technology, and InQubeta is benefiting from its soaring popularity and adoption as it offers an innovative solution to the sector.\n\nThe surging popularity of AI means InQubeta hasn’t been left out of the spotlight thanks to its unique fundamentals. InQubeta aims to become the first platform where AI startups can raise funds for their projects. Similarly, it also intends to become an investment platform that will allow AI enthusiasts to invest early in promising AI projects.\n\nInQubeta’s unique idea has been met with great enthusiasm, which has contributed to its overwhelming presale. As of press time, InQubeta has passed $1.4 million in presale, which is an incredible feat and a testament to its strong community.\n\nIt is the world’s first AI crowdfunding platform, where AI startups will be able to raise funds through its NFT marketplace. They will achieve this by minting or tokenizing stakes in their startups and listing them as NFTs on the marketplace. Investors can then purchase these fractionalized NFTs and own stakes in promising AI businesses and projects. There will be no limits on AI investments, as investors will be able to invest any amount, which makes it more appealing and adoptable.\n\nInQubeta’s low supply of 1.5 billion and its deflationary nature further increased its popularity within the crypto landscape. As a deflationary token, 2% of all token sales and 1% of purchases will be removed from circulation and burned.\n\nThe presale is currently in its second stage, with a price of $0.0098 per token. Analysts predict that the price will increase by 10 times before the end of the year. To participate in the presale, click on the link below and visit the website.\n\nBitcoin (BTC) mining practice becomes widespread and UAE is poised to become the leading destination\n\nBitcoin is a decentralized cryptocurrency that leverages the proof-of-work consensus mechanism. This means that miners compete to append blocks and mine new Bitcoin. Bitcoin mining has become a popular practice in the crypto landscape as miners aim to get their hands on the scarce and valuable cryptocurrency.\n\nAs the leading cryptocurrency and most valuable, Bitcoin mining has become a lucrative practice, with many individuals and companies now mining the cryptocurrency. Although Bitcoin mining is global, the UAE is fast becoming a Bitcoin-mining hub as it creates a suitable environment for the practice.\n\nConclusion\n\nThis year has been an interesting one for both blockchain and AI technologies, which continue to soar in adoption and popularity. On the one hand, the UAE is gearing up to become a leading Bitcoin mining hub. On the other hand, AI and InQubeta have been soaring in popularity. To participate in the InQubeta token presale, check below and click on the website.\n\nVisit InQubeta Presale\n\nJoin The InQubeta Communities\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tYW5kLWV0aGVyZXVtLXNob3ctbGltaXRlZC11cHNpZGUtd2hpbGUtaW5xdWJldGEtcHJvamVjdGlvbnMtc2hvdy01MDAtZ3Jvd3RoLWluLTIwMjMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "Bitcoin and Ethereum Show Limited Upside While InQubeta Projections show 500% Growth in 2023 - Analytics Insight",
        "content": "The cryptocurrency market has long been dominated by heavyweights like Bitcoin and Ethereum, which have captured the attention of investors worldwide. While these cryptocurrencies have delivered impressive returns in the past, some experts believe that their exponential growth may be slowing down.\n\nHowever, amidst this scenario, a new contender is emerging with the potential to outpace Bitcoin and Ethereum: InQubeta and its native QUBE token. Here’s why QUBE is generating excitement among investors and why it may offer a 5X return on investment in the near future.\n\nThe Limitations of Bitcoin and Ethereum\n\nBitcoin and Ethereum have undoubtedly made significant strides in the world of digital currencies. Bitcoin, as the pioneer cryptocurrency, has enjoyed substantial growth and widespread adoption. Ethereum, on the other hand, has revolutionized the blockchain industry with its smart contract capabilities and the development of decentralized applications (DApps). However, as these cryptocurrencies mature, their growth potential may become more limited compared to newer projects.\n\nThe Rise of InQubeta (QUBE)\n\nInQubeta is a rising star in the crypto space and is capturing the attention of investors with its innovative approach and promising features. Unlike Bitcoin and Ethereum, which have already experienced exponential growth, QUBE presents an opportunity for substantial gains in the near future. Its ongoing presale has been met with enthusiasm, raising expectations for its long-term potential.\n\nInvesting in QUBE\n\nSeveral factors contribute to QUBE’s potential for significant growth. Firstly, its focus on the AI industry positions it at the forefront of the next technological frontier. As AI continues to expand its reach across industries, QUBE’s integration of AI technology offers a unique value proposition for investors.\n\nFurthermore, QUBE’s community-driven nature fosters active participation and engagement. Token holders have governance rights, allowing them to shape the project’s future and direction. This decentralized approach not only strengthens the project’s resilience but also instills a sense of ownership and involvement among investors.\n\nQUBE’s Unique Value Proposition:\n\nQUBE brings several key features to the table that differentiate it from other cryptocurrencies. Its fractionalized NFT approach allows investors to own fractions of AI-driven assets, promoting inclusivity and increasing accessibility. By breaking down barriers to entry, QUBE enables a broader range of investors to participate in AI-driven projects and benefit from their potential growth.\n\nAdditionally, InQubeta leverages blockchain technology to enhance security and transparency. Through smart contract auditing and multi-layered verification processes, the platform ensures a secure environment for investors, mitigating the risks associated with traditional crowdfunding methods. This focus on security builds trust within the community and sets QUBE apart as a reliable investment opportunity. While Bitcoin and Ethereum may have already reached a level of maturity, QUBE presents an opportunity for exponential growth in the crypto market. Don’t Miss Out On QUBE Presale\n\nInQubeta (QUBE) is currently in its presale which has raised over $1.4 million within a few weeks of launch. The presale has attracted both institutional and retail investors due to its low barrier of entry and multiple payment options. InQubeta has also revealed plans to launch a staking dapp for QUBE holders to stake their assets for rewards, an NFT marketplace and a unique DAO for decentralized governance.\n\nWhile Bitcoin and Ethereum may continue to play essential roles in the crypto market, QUBE’s innovative features and growth potential make it a compelling option for investors seeking exponential gains in the near future.\n\nVisit InQubeta Presale\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDcvMTcvdXMtbmV3cy1iaXRjb2luLWxpbmtlZC1zaWxrLXJvYWQv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 17 Jul 2023 07:00:00 GMT",
        "title": "US: news on Bitcoin linked to Silk Road - The Cryptonomist",
        "content": "A few days ago, the Bitcoin wallet allegedly belonging to the US government’s Justice Department moved several BTC linked to Silk Road.\n\nIndeed, on 12 July it appears there were two outgoing transactions, totaling more than 9,800 BTC, worth nearly $300 million at the current price.\n\nPreviously, on 7 March, there were two other outbound transactions totaling 49,000 BTC, amounting to as much as nearly $1.5 billion.\n\nIt is believed that this wallet not only belongs to the US government’s Department of Justice, but also holds part of the Bitcoin seized from Silk Road.\n\nIt has actually only been active since March 2022, while Silk Road’s closure dates back to 2013. However, incoming transactions related to the seizure of BTC linked to Silk Road date back to last year.\n\nAt this time the wallet appears to be empty, so the DOJ has transferred all the Bitcoin stored in it to other wallets. In total, over the months it had received nearly 50,000 BTC.\n\nThe possible sale of Bitcoin linked to Silk Road\n\nTypically, when authorities seize Bitcoin, they end up putting them up for auction.\n\nOver the years, the US government has already held several auctions during which it has sold BTC that it had previously seized, and it is therefore possible that the 9,800 BTC that was just transferred will also end up being auctioned.\n\nHowever, it is worth mentioning that the total daily trading volume of BTC on the crypto markets is around $7.5 billion, so 300 million could have relatively little impact.\n\nWhat’s more, it has long been known that those BTC would end up in the auction sooner or later, so it is possible that the market has already priced in the news.\n\nFor now, there are no reports that any US government auctions for large Bitcoin sales have been officially announced.\n\nIn addition, it is possible that in order not to risk excessive price drops, and thus reduced proceeds, the government may decide to break up the sale into several auctions that could be held over a relatively long period of time, so as to give the market time to absorb these sales without large losses in value.\n\nFor example, the price of Bitcoin fell 0.8% after the news of the two transactions from that wallet, but it has already recovered its entire loss afterwards.\n\nIn contrast, the two transfers in March caused a much larger drop, but even that was later absorbed within three days.\n\nBitcoin auctions\n\nWhen the government decides to auction seized BTC, it organizes its sale in lots.\n\nNot all lots necessarily go to auction at the same time, and in fact it appears that as early as March some of the Bitcoin held in the above wallet were auctioned in lots totaling less than one-fifth of the total 50,000 BTC.\n\nHowever, that is not the only wallet that belongs to a US government agency, so the BTC actually auctioned off could be more.\n\nThese auctions are held fairly regularly, though not necessarily every year, because seizures of BTC are not as rare as is generally believed.\n\nHowever, the lots that are put up for sale are rarely small amounts, so the government generally waits until it has some in the till before auctioning them off in large lots.\n\nFor example, the sale held in March apparently yielded more than $200 million.\n\nWhat’s more, the sale price, for those who participate in these auctions, is often decidedly attractive, because no one would want to buy such large sums at market price.\n\nIn other words, the bids from potential buyers at these auctions often stop at below market prices, since there is no fixed price, so there are those who are able to take advantage of them to make good deals.\n\nSince they are held only when the US government, or some of its agencies or departments, decide to sell, and since the lots for sale have large amounts, there are not many buyers, and it is not even certain that right then they are willing to spend a lot to buy Bitcoin.\n\nAll this means that the sale price often turns out to be decidedly attractive.\n\nFor example, Tim Draper in 2014 participated in one such auction, and he was able to buy 30,000 BTC at a price just over $630. Three years later the price of BTC skyrocketed to $20,000.\n\nSince the US government’s seized Bitcoin cost the US government nothing, auctions such as these often generate benefits for almost everyone except those whose BTC were seized."
    }
]