[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDMvMzEvdGVjaG5vbG9neS9iaXRjb2luLWJhbmtzLWNyaXNpcy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Has Bitcoin Benefited From the Banking Crisis? Not in the Way Its Fans Hoped. - The New York Times",
        "content": "Shortly after Silicon Valley Bank failed this month, the price of Bitcoin soared above $25,000, reaching a threshold the digital currency hadn’t touched since June. This week, Bitcoin reached nearly $30,000, up 70 percent for the year.\n\nBitcoin proponents seized on the price rise to argue that the banking crisis was prompting investors to convert traditional currencies into digital coins. One crypto executive hailed the bank failures as “the end of the USD and the dawn of hyperbitcoinization.” A company that markets Bitcoin to investors started putting references to the bank runs in its promotional materials.\n\nBut despite the fanfare, there is little evidence that the recent banking collapse has generated widespread support for Bitcoin as a financial alternative.\n\nInstead, the surge in Bitcoin’s price was driven by a range of financial trends that have little to do with the technology’s philosophical underpinnings, analysts said. The reasons for the surge include growing optimism that the Federal Reserve may pause interest rate increases, as well as increasing concerns about the safety of so-called stablecoins, a type of cryptocurrency intended to maintain a price of $1."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMy8zMS93ZWIzLXNob3VsZC1iZS1idWlsdC1vbi1iaXRjb2luLW5vdC1pdHMtaW1pdGF0b3JzL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMy8zMS93ZWIzLXNob3VsZC1iZS1idWlsdC1vbi1iaXRjb2luLW5vdC1pdHMtaW1pdGF0b3JzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Web3 Should Be Built on Bitcoin - CoinDesk",
        "content": "Bitcoin (BTC) has long been seen almost exclusively as a currency and store of value. However, the Bitcoin blockchain has proven, through over a decade of unfailingly solid and routine operations, that it is the most secure and economically viable blockchain network and therefore the ideal foundation for Web3. To neglect to build on Bitcoin would be to forsake key applications for the network that have the potential to make the internet, and the world at large, a better place."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3VzLWdvdmVybm1lbnQtZHVtcHMtYml0Y29pbi1zaWxrLXJvYWTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "US Government Dumps Bitcoin Stolen From Silk Road, $1.2B To Go - Blockworks",
        "content": "The US government sold off more than 9,800 BTC connected to the Silk Road darknet marketplace for about $215 million earlier this month, a court filing released Friday shows.\n\nJames Zhong pleaded guilty to hacking Silk Road in 2012 and stealing more than 50,000 BTC (worth less than $1 million at the time), which the government seized in November 2022.\n\n“In total from the Zhong investigation, the Government has obtained final orders of forfeiture for approximately [51,680.32 BTC], valued at over $3.4 billion at the time of seizure,” the court filing noted.\n\nOn March 14, the government sold about 9,861.2 BTC for around $21,800 per token. On this date, bitcoin was trading on most exchanges at a high of around $26,500 and a low of around $24,000, according to Blockworks Research.\n\nGovernment officials racked up more than $215,000 in transaction fees for the sale, court documents note. Officials added that they plan to sell the remaining 41,500 BTC ($1.2 billion) in a series of four batches this year. The method of sale wasn’t disclosed.\n\nIt is not the first time the US has sold off seized crypto. In 2014, officials unloaded around 30,000 BTC, also taken in connection with Silk Road, to venture capitalist Tim Draper.\n\nThe BTC was valued at around $17 million at the time of the auction, but today would be worth more than $850 million. A dashboard tracking US government bitcoin auctions estimates more than $5 billion has been left on the table by selling BTC too early.\n\nBitcoin was trading about 1% higher Friday afternoon in New York following the release of the court filing, hovering around $28,450.\n\nUS authorities shut down Silk Road in October 2013, arresting maintainer Ross Ulbricht. He was given a double life sentence two years later without possibility of parole.\n\nUpdated Mar. 31, 2023 at 12:10 pm ET: Added auction dashboard.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vdGhlZ2l2aW5nYmxvY2suY29tL3Jlc291cmNlcy9ub25wcm9maXRzLWFjY2VwdGluZy1jcnlwdG8tZG9uYXRpb25zL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "List of Nonprofits Accepting Bitcoin & Crypto Donations - The Giving Block",
        "content": "We are able to process some donations of cryptocurrencies that aren't listed in The Giving Block's Donation Form. Please read this information and/or contact us to verify."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTMxL21pY3Jvc3RyYXRlZ3ktbXN0ci1idGMtYml0Y29pbi1iZXQtaXMtb24tdmVyZ2Utb2YtcHJvZml0YWJpbGl0eS1hZ2FpbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "MicroStrategy's Bitcoin Bet is on Verge of Profitability Again - Bloomberg",
        "content": "MicroStrategy Inc. co-founder and Executive Chairman Michael Saylor ’s more-than $4 billion bet on Bitcoin is on the verge of turning profitable once again after the first quarter surge in the value of the original cryptocurrency.\n\nSaylor first revealed that he was buying Bitcoin in August 2020, saying the digital currency was a better place to invest the enterprise software company’s cash than traditional staples such as short-term Treasuries because of the threat of rising inflation. Since then, Bitcoin has seen wide price fluctuations that have resulted in quarterly paper gains of as much as $3.1 billion and cumulative impairment charges of more than $2.1 billion for MicroStrategy. The company’s holdings have been underwater at the close of the last three quarters."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy91cy1nb3Zlcm5tZW50LXNlbGxzLTIxNW0tc2VpemVkLTE4MzEwMjA5Mi5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "US Government Sells $215M in Seized Silk Road Bitcoin, Plans to Dump Another $1.1 Billion - Yahoo Finance",
        "content": "The crypto markets may be looking uncertain right now but some are still making money from Bitcoin sales: the U.S. government.\n\nAccording to court documents filed today, the Feds sold the crypto earlier this month—making over $215 million.\n\nThe crypto in question came from the Silk Road marketplace. Hacker James Zhong confessed to stealing it, and then cops then took it in a historic seizure back in November. They are now selling it—and they still have 41,490 Bitcoins ($1.1 billion) to get rid of, the filing said.\n\n“With respect to the 51,351.89785803 Bitcoin forfeited in the Ulbricht case before Judge Schofield, the Government has begun liquidating (selling) it,” Friday’s document read.\n\n“On March 14, 2023, the Government sold 9,861.1707894 BTC (of the 51,351.89785803 BTC) for a total of $215,738,154.98. After $215,738.15 in transaction fees, the net proceeds to the Government were $215,522,416.83.”\n\nThe “Ulbricht case” refers to Silk Road founder Ross Ulbricht, who was sentenced to life in prison back in 2015 in a high-profile case.\n\nUlbricht ran the Silk Road online black market which was used to—mostly—buy and sell illegal drugs before authorities shut it down in 2014.\n\nJames Zhong pleaded guilty last year to wire fraud after the government alleged that he manipulated the Silk Road transaction system in 2012 to pocket 50,676 Bitcoins. He kept the stash hidden for 10 years until it ballooned to hit a value of $3.3 billion.\n\nBillions in Bitcoin Linked to Silk Road Seized by US Attorney’s Office\n\n“The defendant had in his possession multiple computer servers, virtual private networks, among other things, enabling him to commit the offense,” prosecutors added in Friday’s filing. “He then managed to keep the Bitcoin protected, and his identity hidden for several years.”\n\nWith the authorities planning to get rid of the remaining Bitcoin throughout 2023 in four different batches, what kind of effect might that have on the price of the biggest digital asset amid a brutal bear market?\n\nThe views and opinions expressed by the author are for informational purposes only and do not constitute financial, investment, or other advice."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAzLzMxL2lzLWJpdGNvaW4tZ29pbmctdG8tMTAwMDAwLW9yLTAv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Is Bitcoin Going to $100,000 -- or $0? - The Motley Fool",
        "content": "Bitcoin (BTC 0.34%), the only cryptocurrency to ever hit a market capitalization of more than $1 trillion, has firmly established itself as the world's most widely used and accepted digital asset. Despite Bitcoin's astounding accomplishment and proven history of price appreciation, critics believe that one day soon it might be headed to worthlessness.\n\nTheir primary reasons usually point to its supposed lack of intrinsic value, absence of utility, and that it resembles a decentralized Ponzi scheme. This combination has led some to surmise that the chance of Bitcoin heading to $0 is much more likely than it ever reaching $100,000.\n\nIn reality, when evaluating historical and current trends around adoption of Bitcoin and what it offers users, it becomes clear that the likelihood that Bitcoin will reach $100,000 is much greater than it ever falling to zero.\n\nThe case for $100,000\n\nOne reason Bitcoin is more likely to hit $100,000 than zero is its increasing adoption, mainstream acceptance, and growth of its network. Over the past few years, more and more individuals and institutions have started to invest in Bitcoin, recognizing its potential as a store of value and means of exchange.\n\nMajor companies such as Tesla and Block have made significant investments in Bitcoin, and more traditional financial institutions such as BlackRock and Fidelity have started to offer Bitcoin-related services to their clients. This growing acceptance and adoption of Bitcoin could drive up demand and increase its value over time.\n\nIn addition, when looking at the trajectory of crucial metrics related to Bitcoin's network, it becomes clear that the cryptocurrency is flourishing, even though its price remains more than 60% off from its all-time high. Statistics such as the number of addresses with a positive balance, average transaction size, and mining difficulty (a measure of the network's security and decentralizations), all sit at or near all-time highs.\n\nThe primary factor driving this growth and continued adoption of Bitcoin is related to its scarcity. Despite assertions by critics who say that Bitcoin lacks intrinsic value, Bitcoin derives its value from the fact that it is unlike traditional fiat currencies that can be printed by central banks at will, inevitably eroding the purchasing power of those who hold them.\n\nThose who hold Bitcoin increase their purchasing power with time, as opposed to government-issued currencies. This is because Bitcoin is limited to a total supply of 21 million coins, and the rate at which new coins are created is cut in half every four years.\n\nShould more people come to this realization, Bitcoin could become a true beneficiary, thanks to the simple dynamics of supply and demand. As more individuals and institutions seek to invest in Bitcoin, there will be less available, and this could potentially drive up its value. If governments around the world continue to print more fiat currencies in response to economic crises like they have in the 21st century, then it isn't hard to imagine demand for a stable asset like Bitcoin could outpace its limited supply.\n\nFinally, technological advancements and improvements to the Bitcoin network could also contribute to a further rise in value. For example, the implementation of the Lightning Network, a Layer 2 payment protocol that allows for faster and cheaper Bitcoin transactions, could make the cryptocurrency more accessible and user-friendly, potentially driving up demand as it proves to be more useful for everyday purchases.\n\nPatience is a virtue\n\nAlthough the future price of Bitcoin is impossible to predict with any accuracy, the combination of these factors makes it much more likely that Bitcoin will continue to rise in value over time, rather than hit zero. When considering this possible future, it makes investing at today's prices that much more alluring. Bitcoin is trading at about $28,000 at the time of writing, so if it hit $100,000, it would represent a 260% increase.\n\nThere's no telling when this could happen, and anyone who claims to know is just guessing. But as Bitcoin proves its resiliency and attractiveness as a store of value, its potential upside over the long term looks very attractive."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91cy1nb3Zlcm5tZW50LXBsYW5zLXRvLXNlbGwtNDFrLWJpdGNvaW4tY29ubmVjdGVkLXRvLXNpbGstcm9hZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "US government plans to sell 41K Bitcoin connected to Silk Road - Cointelegraph",
        "content": "The United States government plans to liquidate more than 41,000 Bitcoin (BTC) seized as part of a case connected to Silk Road creator Ross Ulbricht.\n\nA March 31 filing with U.S. District Court for the Southern District of New York regarding the sentencing of James Zhong stated U.S. government authorities had begun liquidating roughly 51,352 BTC seized in the Ulbricht case. According to the filing, officials sold roughly 9,861 BTC for more than $215 million on March 14, leaving roughly 41,491 BTC.\n\n“The Government understands [the seized Bitcoin] is expected to be liquidated in four more batches over the course of this calendar year,” said the court filing. “The Government understands from IRS Criminal Investigation - Asset Recovery & Investigative Services that the second round of liquidation will not be sold prior to Zhong’s sentencing date.”\n\nIn November, Zhong pled guilty to wire fraud charges related to executing a scheme to steal Bitcoin from Silk Road in 2012. U.S. authorities seized more than 50,000 BTC — worth more than $3 billion at the time — from his Georgia home in November 2021. It was one of the largest crypto seizures by the government until the February 2022 recovery of roughly $3.6 billion connected to the 2016 Bitfinex hack.\n\nRelated: Silk Road Bitcoin for sale? US government-linked addresses transfer $1B in BTC\n\nThe Silk Road marketplace, which has been defunct for 10 years, originally allowed users to buy and sell illicit goods, including weapons and stolen credit card information. However, the marketplace also drew the attention of U.S. authorities, who arrested Ulbricht in 2013. He is currently serving two life sentences without the possibility of parole.\n\nI was arrested at the age of 29 and today I turn 39. I’ve lost my 30s to prison.\n\n\n\nDuring that time, I’ve done my best to learn from my mistakes, better myself, and help others do the same.\n\n\n\nI hope someday I can make amends as a free man as well. — Ross Ulbricht (@RealRossU) March 27, 2023\n\nThe price of BTC has had a volatile month, dipping below $20,000 on March 10 and moving above $29,000 on March 29. At the time of publication, BTC’s price was $28,378.\n\nMagazine: US enforcement agencies are turning up the heat on crypto-related crime"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZm9ya2FzdC5uZXdzL3dlZWtseS1tYXJrZXQtd3JhcC1iaXRjb2luLXBvcHMtdXMyOTAwMC1tYXJrZXQtc2hydWdzLWJpbmFuY2UtbGVnYWwtd29lcy_SAWJodHRwczovL2Zvcmthc3QubmV3cy93ZWVrbHktbWFya2V0LXdyYXAtYml0Y29pbi1wb3BzLXVzMjkwMDAtbWFya2V0LXNocnVncy1iaW5hbmNlLWxlZ2FsLXdvZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Weekly Market Wrap: Bitcoin pops above US$29,000, market shrugs off Binance legal woes - Forkast News",
        "content": "Bitcoin, the world’s largest cryptocurrency by market capitalization, rose 1.3% in the week from March 24 to March 31 to trade at US$28,286 at 9:30 p.m. on Friday in Hong Kong. Ether rose 2.67% in the same period to US$1,819.\n\nThe crypto market saw another tumultuous week after the world’s largest cryptocurrency exchange Binance was sued by the U.S. Commodity Futures Trading Commission (CFTC) for allegedly offering futures and derivatives products to U.S. residents without registering with the CFTC as required by law. Binance has denied the allegations.\n\nBinance returned to the headlines just three days later when the Financial Times, citing internal Binance documents, alleged the exchange had concealed its operations in China, despite saying it left the country in 2017. A Binance spokesperson said the report comprises anonymous sources recycling old news and “dramatically mischaracterizing events.”\n\nDespite Binance’s troubles and the threats to other exchanges, Bitcoin traded above US$27,000 for most of the week, dipping to US$26,677 on Tuesday before recovering. The world’s first cryptocurrency rose 1.3% during the week and 26.1% during the month of March.\n\nKadan Stadelmann, chief technical officer of blockchain infrastructure development firm Komodo, said that investors are sophisticated enough to delineate between Bitcoin and the rest of the crypto market.\n\n“Crypto company after crypto company has collapsed or faced headwinds in the past nine months, and yet Bitcoin has recovered in the wake of each wave of negative headlines. Investors increasingly view Bitcoin as a standalone commodity, not tied to any central organization,” wrote Stadelmann.\n\n“Bitcoin’s correlation with the Nasdaq 100 has decreased to the lowest since the U.S. Federal Reserve first telegraphed rate hikes at the start of 2022. Bitcoin’s Pearson correlation, which measures the 30-day correlation to Bitcoin for S&P 500 and gold, dropped to 0.20 – the lowest ever,“ wrote Stadelmann, adding that this suggests investors are increasingly viewing Bitcoin as a safe-haven asset.\n\nMarat Minkin, the co-founder of DeFi payment app TONBanking, said that Bitcoin’s rally was also attributed to Binance chief Changpeng Zhao denying the allegations against his exchange.\n\n“This report was a relief to investors and the market and Bitcoin continued the uptrend. The U.S. dollar index’s continued decline also supported the crypto uptrend. The decline of the U.S. dollar index and the fear of higher inflation and recession, prompted investors to look for short-term investment opportunities,” wrote Minkin.\n\nOver 74% of all Bitcoin supply was in profit as of March 29, according to CryptoQuant, suggesting that investors may be looking to sell some of their holdings to take profits.\n\nOver US$76.8 million worth of Bitcoin options across all exchanges are set to expire on Friday, according to data from derivatives exchange data aggregator Coinglass. Options enable purchasers to buy or sell the underlying asset at a set price by a fixed date and are used to speculate on future price movement or hedge risk.\n\nStadelmann said that this signals increasing interest in Bitcoin.\n\n“Bitcoin investors are opening up new positions in the Bitcoin futures market, which could lead to more volatility – albeit most likely to the upside over the medium term. In the past few days, Bitcoin’s 30 days SMA Open Interest has dramatically increased to approximately US$8.6 billion,” wrote Stadelmann.\n\nThe global crypto market capitalization stood at US$1.18 trillion on Friday at 9:30 p.m. in Hong Kong, up 0.85% from US$1.17 trillion a week ago, according to CoinMarketCap data. Bitcoin’s US$546 billion market cap accounted for 46.3% of the market, while Ether’s US$219 billion accounted for 18.5%.\n\nRuslan Sharov, the chief executive officer and co-founder of GameFi video platform Cheelee, said that Bitcoin’s rising dominance suggests investor caution.\n\n“We see the continuous growth of Bitcoin dominance, which signals a more conservative outlook on the general perspective of the crypto market on the investors’ side. Bitcoin is likely considered a safe harbor to wait out the storm until the general sentiment turns more optimistic,” wrote Sharov.\n\nSee related article: Bitcoin keeps its head held high despite options expiration\n\nBiggest gainers: XRP & CFX\n\nRipple’s XRP token was this week’s biggest gainer among the top 100 coins by market capitalization listed on CoinMarketCap. XRP rose 23.96% to trade at US$0.53. XRP started picking up momentum on March 20, after Ripple Labs made a new filing to back its case against the U.S. Securities and Exchange Commission.\n\nCFX, the utility token of Conflux Network, China’s only public blockchain, was the second biggest gainer in the top 100, rising 19.5% to change hands at US$0.40. The token started picking up momentum on Tuesday, as part of a larger rally that saw the token rise over 1,750% from the beginning of the year.\n\nNext week\n\n“Bitcoin’s current support checks in at approximately US$25,000. If it tests this over the next two weekly closes, that would suggest a potential bullish pattern. On the upside, Bitcoin’s current resistance is US$30,000,” wrote Stadelmann.\n\n“Bitcoin’s funding ratio has been at a relatively high positive value, suggesting there are more long positions compared to short positions. This would suggest increased prices, although investors do have some concerns over Bitcoin’s overall liquidity. The US$30,000 handle could prove to be tough resistance for Bitcoin, at least in the short term,“ added Stadelmann.\n\nSharov said that we may be witnessing the start of a long-term Bitcoin rally, despite short-term volatility.\n\n“I believe the next crucial resistance point is at US$30,000 and it appears to be a major psychological hurdle. Another important factor is the macro-economical landscape. Considering the number of ongoing triggers, I expect the market to appear strongly contingent upon the financial news that surfaces over the following week,” wrote Sharov.\n\nSee related article: Crypto investors remain optimistic despite crackdown"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL3BlbnRhZ29uLW1pbmUtYml0Y29pbi1zcGFjZS1mb3JjZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Pentagon, Mine Bitcoin To Stay Superpower: Space Force Major - Blockworks",
        "content": "A new MIT masters thesis from a US Space Force major contends bitcoin is not just a form of internet money — but a weapon to be utilized by the Pentagon in modern warfare.\n\nIn an exhaustive 400-page dissertation, Major Jason Lowery claims bitcoin’s proof-of-work consensus mechanism presents a massive shift in the way world powers could wage war.\n\nInstead of boots on the ground or nukes in the air, Lowery suggests nations battle by competing for Bitcoin block rewards, Politico reported Thursday.\n\n“Space Force” is the newest brand of the US Armed Forces, created in December 2019. It’s responsible for organizing, training and equipping military persons across the stars in a bid to protect US and allied interests.\n\nLowery is an active-duty US Space Force astronautical engineer and US National Defense Fellow at MIT whose job it is to advise senior military personnel on the implications of bitcoin, according to a bio of his latest book. Politico says it confirmed his rank with an Air Force spokesperson.\n\nLowery’s thesis was released as a book in February under the title “Softwar: A Novel Theory on Power Projection and the National Strategic Significance of Bitcoin.” It’s said to describe a scenario in which governments duke it out with hashrate; fighting something akin to a Cold War, where the spoils are bitcoin and bragging rights.\n\nThe blurb reads:\n\n“Using scientific concepts from biology, evolution, anthropology, political science, and computer theory, Lowery summarizes the dynamics of power projection in human society and provides an argument for why emerging proof-of-work technologies (namely Bitcoin) will have a dramatic impact on how humans organize, cooperate, and compete on a global scale by empowering populations to project physical power in, from, and through cyberspace.”\n\nBitcoin’s consensus could also be harnessed to deter denial-of-service attacks, Lowery reportedly reasons, which would make it costly and therefore prohibitive for bad actors to spam software systems based on its principles.\n\nShould the asset be viewed through that lens, it would serve the US’s interest to protect the network and foster an industry for domestic crypto mining, or so the thinking goes.\n\nBitcoin is a ‘national strategic imperative’\n\nIn a stark warning to US policymakers, the major contends the country should support and adopt bitcoin immediately in a bid to avoid losing its status as a global superpower.\n\nThat’s just the kind of message of which industry proponents have hoped for years. Although, it’s probably unlikely.\n\n“Major Lowery concludes that Bitcoin represents a national strategic imperative that the US should support and adopt as quickly as possible, else it risks losing its lead as a global superpower in the 21st century,” states the book’s description.\n\nInstead, the current campaign employed by US regulators and the White House has been to offer up no support in that regard, opting to regulate digital assets through litigation with little discourse, critics argue. Various arms of the US government have also routinely sold bitcoin seized as a result of criminal cases.\n\n“Our first amendment rights to free speech will not protect you from government regulators who are actively maneuvering to ban bitcoin under the argument that it represents a threat to national security,” Lowery tweeted Tuesday.\n\n“Your best bet is to argue that it would be a national strategic security hazard to ban bitcoin. It would be against the second amendment (not just the first). It’s an undefeatable argument, you just have to have the courage to use it,” he said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTMxL2JpdGNvaW4tcy1idGMtc3VyZ2UtbWtlcy1pdC10aGUtYmVzdC1wZXJmb3JtaW5nLWFzc2V0LWluLXExLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin’s (BTC) Surge Makes It the Best Performing Asset in Q1 2023 - Bloomberg",
        "content": "Bitcoin ’s surprising fast exit from its “crypto winter” has once again put the notoriously volatile digital currency atop the leader-board in the first quarter for being the best-performing asset class by a wide margin.\n\nWith a 72% gain, Bitcoin closed out its best quarter since the three months ended March 2021, when it surged some 103%, Bloomberg data show. That vastly outstripped the S&P 500 ’s 7% year-to-date advance, the Nasdaq 100 ’s 20.5% uptick and the iShares 20+ Year Treasury Bond ETF’s 6.8% jump."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9taXQtc3BhY2UtZm9yY2UtbWFqb3ItcHJvcG9zZXMtYml0Y29pbi1taW5pbmctYXMtY3liZXJzZWN1cml0eS10b29s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "MIT Space Force major proposes Bitcoin mining as cybersecurity tool - Cointelegraph",
        "content": "An active-duty United States Space Force astronautical engineer is proposing a cybersecurity tool to the Pentagon that is capable of transforming the country’s national security and the base-layer architecture of the internet: Bitcoin (BTC).\n\nIn an academic thesis, Major Jason Lowery, who is also a national defense fellow at Massachusetts Institute of Technology (MIT), presented a new theory to the U.S. Department of Defense that Bitcoin is not just a peer-to-peer payment system but a new form of “digital-age warfare,” arguing that proof-of-work technologies will change the way humans compete globally, according to Ben Schreckinger’s review of the book in Politico.\n\nPublished in February, Lowery’s master’s degree thesis dubbed “Softwar” sits in third position on Amazon’s list of best-selling technology books at the time of writing. According to his Amazon bio, Lowery has a decade of experience serving as a weapon system developer and technical adviser for U.S. senior officials, including Bitcoin-related policies.\n\nRelated: Proof-of-Work, Explained\n\nLowery’s research argues that the U.S. military could use Bitcoin to stop certain types of attacks, such as denial-of-service attacks, which overload servers with too many requests. The concept involves creating software programs that only respond to signals from large transactions recorded on the Bitcoin network. This would make it harder for attackers to flood servers with fake signals and cause damage.\n\nTHESIS PUBLISHED!!!\n\n\n\nAnnouncing the public debut of SOFTWAR, a theory presented to OPOTUS, OSECDEF, & the Joint Chiefs about the national strategic significance of #Bitcoin\n\n\n\nLET THE HASH WARS BEGIN\n\n\n\nHigh-quality physical copies available now:https://t.co/WaNo7y8avl pic.twitter.com/vWF24ze9EA — Jason Lowery (@JasonPLowery) February 20, 2023\n\nLowery also suggests that the Bitcoin network is like maritime trade routes, which means it’s suited for economic exchange. Consequently, it’s crucial to protect freedom of navigation on the network, just as we protect trade routes.\n\nBy designing software programs that only respond to external signals if they come with a large enough Bitcoin transaction recorded on the network, Lowery argues they would prevent adversaries from gaining control over them.\n\nAccording to the author, the U.S. should also stockpile Bitcoin, build a domestic Bitcoin mining industry and extend legal protections to the technology. In his view, Bitcoin is a self-defense weapon, and the country should protect it as it does other rights.\n\nMagazine: Can Bitcoin survive a Carrington Event knocking out the grid?"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzMxL2NyeXB0by1tYXJrZXQtbWFyY2gtcm91bmR1cC1iaXRjb2luLXJpc2VzLWFtaWQtYmFua2luZy11bmNlcnRhaW50aWVzLW1hY3JvLWhlYWR3aW5kcy_SAYUBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMy8zMS9jcnlwdG8tbWFya2V0LW1hcmNoLXJvdW5kdXAtYml0Y29pbi1yaXNlcy1hbWlkLWJhbmtpbmctdW5jZXJ0YWludGllcy1tYWNyby1oZWFkd2luZHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Crypto Market March Roundup: Bitcoin Rises Amid Banking Uncertainties, Macro Headwinds - CoinDesk",
        "content": "But he added that the recent unsettled relationship between DeFi and TradFi is likely to steady. “Over the long term, there will be a whole new on and offramp system between DeFi, crypto and the fiat world, as trust in centralized, regulated institutions has definitely had its back broken,” he wrote. “There is no longer a need to keep all your funds in one bank, one central entity that holds all of your assets in custody, as who knows what will happen with that entity and ultimately your savings.”"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDMvMzEvYml0Y29pbi1kaXBzLWJlbG93LTI4ay1hcy1vcHRpb25zLWV4cGlyZS10cmFkZXJzLWJvcnJvdy13YnRjLWZyb20tYWF2ZS_SAXdodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAzLzMxL2JpdGNvaW4tZGlwcy1iZWxvdy0yOGstYXMtb3B0aW9ucy1leHBpcmUtdHJhZGVycy1ib3Jyb3ctd2J0Yy1mcm9tLWFhdmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Drops Below $28K as Options Expire, Traders Borrow WBTC From Aave - CoinDesk",
        "content": "\"Currently, we are seeing cautious borrowing of WBTC at this price range, nothing too insane yet, but it looks like folks have started to short,\" Santiment said in a market update."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNC8wMS9iYWxhamktc3Jpbml2YXNhbnMtMW0tYml0Y29pbi1iZXQtY291bGQtYmUtcmlnaHQtYnV0LWktaG9wZS1oZXMtd3Jvbmcv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNC8wMS9iYWxhamktc3Jpbml2YXNhbnMtMW0tYml0Y29pbi1iZXQtY291bGQtYmUtcmlnaHQtYnV0LWktaG9wZS1oZXMtd3JvbmcvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "Balaji Srinivasan’s $1M Bitcoin Bet Could Be Right, but I Hope He’s Wrong - CoinDesk",
        "content": "But it's much more than that. The beauty of bitcoin is that it has a growing range of societal roles: freedom money, internet money, money for enemies and energy buyer of first and last resort. All of these have massive positive societal ramifications. The role of educators is to understand the concerns of different audiences and market the heck out of bitcoin using selective arguments that resonate best with each. Sometimes this will be ideological, and sometimes this will be technical, and sometimes both."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMzEvemVyb3N5bmMtYW5kLWJsb2Nrc3RyZWFtLXRvLWJyb2FkY2FzdC1iaXRjb2luLXplcm8ta25vd2xlZGdlLXByb29mcy1mcm9tLXNwYWNlL9IBfGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDMvMzEvemVyb3N5bmMtYW5kLWJsb2Nrc3RyZWFtLXRvLWJyb2FkY2FzdC1iaXRjb2luLXplcm8ta25vd2xlZGdlLXByb29mcy1mcm9tLXNwYWNlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "ZeroSync and Blockstream to Broadcast Bitcoin Zero-Knowledge Proofs From Space - CoinDesk",
        "content": "“The security of Bitcoin requires every participant to verify every transaction,” ZeroSync co-founder Robin Linus told CoinDesk. “That didn't scale well until now. Proof systems like STARKs have been invented. Applying them to generate a proof of Bitcoin's chain state, and broadcasting it via satellite, can bring Bitcoin to almost everyone in the world. Don't trust, verify.”"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiMGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYWJvdmUtMjgwMDAtYm5iLXVwL9IBNGh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tYWJvdmUtMjgwMDAtYm5iLXVwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin holds above US$28,000, BNB up despite regulatory woes - Forkast News",
        "content": "Bitcoin dipped in Friday morning trading in Asia, but held above US$28,000 after briefly breaking the US$29,000 mark on Thursday. Other top 10 non-stablecoin cryptocurrencies traded mixed as investors took some profits off the recent rally. BNB, the native token of the Binance exchange, led the winners despite the exchange facing a lawsuit by the Commodities Futures Trading Commission (CFTC) for allegedly offering its products to U.S. residents without a license. Binance has denied the allegation. U.S. equities gained Thursday on signs the banking turmoil was receding and economic readings pointed to a cooling economy, a signal the Federal Reserve may ease back on its interest rate hikes.\n\nSee related article: Hong Kong may license at least 8 crypto firms by year-end: former SFC regulator\n\nFast facts\n\nBitcoin dipped 0.40% to US$28,249 in the 24 hours to 9:00 a.m. in Hong Kong, to add 0.08% for the past seven days, according to CoinMarketCap data. The world’s largest cryptocurrency briefly traded above US$29,000 on Thursday for the first time in about nine months or since June 2022.\n\nOver US$4 billion worth of Bitcoin options on Deribit, the world’s biggest Bitcoin and Ethereum options exchange, are set to expire on Friday, which may add to the volatility of Bitcoin and other cryptocurrencies over the weekend, according to digital asset data tracker Amberdata on Wednesday. Options give the purchaser the right to buy or sell an underlying asset at a set price by a fixed date and are often used to speculate and hedge risk.\n\nEthereum rose 1.03% to US$1,806, but it’s down 0.28% for the past seven days.\n\nBNB, the native token of the world’s largest crypto exchange Binance, led the winners despite the mounting regulatory challenges the exchange faces in the U.S. The token rose 1.4% to US$317.17, but is off 3.7% for the week. Catherine Coley, a former chief executive of Binance U.S., hired a former official at the CFTC to represent her in the U.S. authorities’ investigation into the exchange, Reuters reported on Wednesday.\n\nThe total crypto market capitalization dipped 0.15% in the past 24 hours to US$1.18 trillion. Total trading volume over the last 24 hours rose 7.51% to US$50.98 billion.\n\nIn the non-fungible token (NFT) market, the Forkast 500 NFT index edged up 0.06% to 4,008.23 as of 09:00 a.m. in Hong Kong, but is off 2.88% for the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day. It is managed by Forkast sister company, CryptoSlam.\n\nNFT investors are waiting for the launch of a bridge between DeGods – a Solana-based NFT collection – and Ethereum, said Yehudah Petscher, NFT strategist at CryptoSlam. The upgrade would allow DeGods holders to migrate their NFTs to the Ethereum blockchain.\n\nU.S. equities closed higher on Thursday. The Dow Jones Industrial Average moved up 0.43%, the S&P 500 gained 0.57%, and the Nasdaq Composite Index rose 0.73.\n\nThe Federal Reserve’s lending to U.S. banks dropped in the week ended March 29, according to a Bloomberg report on Friday, indicating the U.S. banking system was stabilizing after a series of lender failures and sporadic runs on banks.\n\nU.S. jobless claims rose by 7,000 to 198,000 in the week ended March 25, higher than the expected 195,000, according to CNBC on Thursday. Gross domestic product (GDP) in the U.S. rose 2.6% in the last three months of 2022, lower than the forecast 2.7% and pointing to a slowing economy.\n\nWhile this suggests the Federal Reserve may temper its policy to raise interest rates, investors now await Friday’s U.S. Personal Consumption Expenditures index for more signals on how the Fed’s campaign to curb inflation may play out.\n\nFederal Reserve officials on Thursday said U.S. inflation – running at a pace of more than 6% on year in February – remains too high and more action from the Fed might be needed to get annual inflation into its target range of 2%, according to a Reuters report.\n\nAnalysts at the CME Group are mixed on the outlook for the next Fed meeting on May 3 to decide on interest rates, with 51.5% expecting the Fed will stand pat, while 48.5% expect a 25 basis-point rise. U.S. interest rates are currently between 4.75% to 5%, the highest since 2007.\n\nU.S. stock futures rose as of 9:00 a.m. in Hong Kong, pointing to an up day for stocks on Friday. The Dow Jones Industrial Average futures moved up 0.21, S&P 500 futures gained 0.32% and the Nasdaq Composite Index climbed 0.41%.\n\nSee related article: Montenegro hints U.S. may get to extradite Terra fugitive Do Kwon ahead of South Korea"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAzLTMxL3NpbGstcm9hZC1zY2FtbWVyLXNob3VsZC1nZXQtY3JlZGl0LWZvci1haWRpbmctcmVjb3ZlcnktdXMtc2F5c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Thief Who Held $3.4 Billion in Bitcoin Deserves Prison, US Says - Bloomberg",
        "content": "Federal prosecutors urged prison time for a Georgia man who stole more than 50,000 Bitcoin valued at $3.35 billion when authorities seized it in November 2021, which at the time was the second-largest financial seizure in US history.\n\nThe seized Bitcoin is now worth $1.48 billion, but James Zhong, 32, should do time behind bars for his heist in 2012 from the Silk Road darkweb site, prosecutors told a federal judge Friday, noting he deserves leniency for helping authorities recover the stolen crypto. Zhong pleaded guilty in November and wants the judge to spare him a prison term."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMy8zMS90aGUtYmlkZW4tYWRtaW5pc3RyYXRpb24taXMtcG9saXRpY2l6aW5nLWNyeXB0by_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDMvMzEvdGhlLWJpZGVuLWFkbWluaXN0cmF0aW9uLWlzLXBvbGl0aWNpemluZy1jcnlwdG8vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Biden Administration Is Politicizing Crypto - CoinDesk",
        "content": "As recently as last year, when President Biden issued a balanced, forward-looking executive order on digital assets, I was of the belief that, despite Congress’ foot-dragging on important legislation and despite the SEC’s hostility toward the sector, the U.S. could still take leadership of this industry. I saw a chance for the U.S. to do with crypto what it had done with the Telecommunications Act of 1996, which set a workable open-standard for regulating the internet that, when the entire world followed it, became the framework for our online world. That chance is now lost."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9tb3JlLXRoYW4tMzYwMC1iaXRjb2luLWF0bXMtd2VudC1vZmZsaW5lLXRvLXJlY29yZC1sYXJnZXN0LW1vbnRobHktZGVjbGluZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "More than 3,600 Bitcoin ATMs went offline to record largest monthly decline - Cointelegraph",
        "content": "Contradicting the growing global Bitcoin (BTC) adoption rate, physical ATMs dedicated to fiat-crypto conversions are on the decline. In March alone, 3,627 crypto ATMs were removed from the network, bringing down the total ATMs to 33,727.\n\nIn the decade since the first Bitcoin ATM was launched on Oct. 29, 2013, the net change of cryptocurrency machines installed and removed monthly remained positive most times — implying that total crypto ATMs worldwide were steadily increasing. However, the trend is reversing, according to data from Coin ATM Radar.\n\nNet change of cryptocurrency machines number installed and removed monthly. Source: Coin ATM Radar\n\nAs shown above, net crypto ATM installations declined for four months between September 2022 and March 2023. However, with 3,627 crypto ATMs going down last month, March 2023 stands out as the month with the largest monthly decline.\n\nNumber of bitcoin machines installed over time. Source: Coin ATM Radar\n\nThe chart above shows the number of Bitcoin machines installed over time, revealing the sudden drop in the total crypto ATMs. The significance of this reduction seems enormous, considering that the highest number of ATMs installed in a month was 2,048 — back in January 2021.\n\nThe number of cryptocurrency machines installed per each top manufacturer over time. Source: Coin ATM Radar\n\nOn the bright side, April broke the three-month-long downtrend by recording 37 crypto ATM installations on April 1. Current market leaders in manufacturing crypto ATMs are General Bytes, BitAccess and Genesis Coin.\n\nRelated: Bitcoin ATM maker shuts cloud service after user hot wallets compromised\n\nAfter losing customer funds in a “security incident” in March that saw its customers’ hot wallets accessed, General Bytes promised to reimburse the losses.\n\nMagazine: Web3 Gamer: Shrapnel wows at GDC, Undead Blocks hot take, Second Trip\n\nOn March 17-18th, 2023, GENERAL BYTES experienced a security incident.\n\n\n\nWe released a statement urging customers to take immediate action to protect their personal information.\n\n\n\nWe urge all our customers to take immediate action to protect their funds and https://t.co/fajc61lcwR… — GENERAL BYTES (@generalbytes) March 18, 2023\n\n“We have taken immediate steps to prevent further unauthorized access to our systems and are working tirelessly to protect our customers,” General Bytes said in a statement."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiMWh0dHBzOi8vZnV0dXJpc20uY29tL3RoZS1ieXRlL3NwYWNleC1iaXRjb2luLW1vb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "SpaceX Flying Bitcoin Bounty to Moon, Where Anyone Can Grab It If They Can Get There - Futurism",
        "content": "Don't expect it to cover travel expenses. At all.\n\nBitcoin Booty\n\nAhoy swashbuckling spacefarers: if you're hunting for off-world treasure, look no further than the Moon.\n\nAs spotted by Gizmodo, the crypto company LunarCrush says it'll be leaving a bounty of 62 Bitcoin near the lunar south pole that's completely up for grabs. So in theory, any adventurer daring enough to hitch a ride to the Moon can snatch up the booty for themselves, which hopefully will still be worth anywhere near the purported $1.5 million it's valued at now (don't necessarily count on that, though). The sticker price won't even come close to the exorbitant travel expenses for getting there and back, but hey, it's the novelty that counts, right?\n\nThe goal of this stunt is to \"inspire people to build communities that will unlock a new era of exploration,\" according to LunarCrush CEO Joe Vezzani. \"It's like Willy Wonka's 'golden ticket' for the Web3 era, and we couldn't be more excited to see how it all unfolds,\" he said in a press release. Uh yeah, sure.\n\nThe bounty is called Nakomoto_1, named after the pseudonymous creator of Bitcoin — but it's not actually some space-shielded hard drive with Bitcoin sitting in it. Instead, it's merely a key to a private crypto wallet, engraved on a hidden portion of a lunar rover called the Mobile Autonomous Prospecting Platform, or MAPP, which is decidedly less cool than unearthing a real treasure chest.\n\nActual Mission\n\nThe MAPP rover, however, isn't there just to be a glorified crypto receptacle, and it certainly doesn't belong to LunarCrush — that's way out of the platform's budget.\n\nA creation of the space company Lunar Outpost, its real purpose is part of Tipping Point, a NASA-backed campaign to get private companies to flex their tech in space in the hopes of furthering commercial spacefaring capabilities and infrastructure, which includes having Nokia set up the first 4G network on the Moon.\n\nThe rover and its crypto bounty will be brought to the Moon aboard a SpaceX Falcon 9 rocket launch scheduled for June. Once it's there, MAPP will deploy around the lunar south pole, where it will be used to test Nokia's wireless network for two weeks. Once the mission's over, the rover will simply be abandoned, at which point it and its bounty will be at the mercy of any motivated off-world crypto bros.\n\nAs of now, LunarCrush is still trying to raise funds for the bounty by selling NFTs, so you might want to hold off until LunarCrush can put its money where its mouth is.\n\nMore on crypto: It Turns Out FTX and Alameda Owe Margaritaville a Staggering Amount of Money"
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aHktZGlkLTEyay1iaXRjb2luLW1hcmdpbi1sb25ncy1jbG9zZS1hdC1iaXRmaW5leC1hbmQtd2h5LWRpZG4tdC1pdC1pbXBhY3QtYnRjLXByaWNl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Why did 12K Bitcoin margin longs close at Bitfinex, and why didn't it impact BTC price? - Cointelegraph",
        "content": "Since May 2022, the Bitcoin (BTC) margin markets on the Bitfinex exchange have been plagued by an unusually high open interest of over $2.7 billion. This information alone should raise a red flag, especially considering Bitcoin’s price decline from $39,000 to less than $25,000 during the same period.\n\nTraders seeking to leverage their cryptocurrency position had borrowed over 105,000 Bitcoin. Currently, the cause of this anomaly and the number of entities involved in the trade are unknown.\n\nCheap borrowing favors high demand\n\nBitfinex’s sub-0.1% annual rate may contribute to the size of the Bitcoin lending market. To date, this has been the norm, creating enormous incentives for borrowing, even if there is no current need. Few traders would turn down such a ridiculously inexpensive leverage opportunity.\n\nMargin borrowing can be used to take advantage of arbitrage opportunities, where a trader exploits price discrepancies between different markets. For example, borrowing Bitcoin on margin allows a trader to take a long position in one market and a short one in another, profiting from the price difference.\n\nTo understand how Bitcoin borrowing can be used to profit on derivatives markets, including those outside of Bitfinex, one must understand the distinction between futures contracts and margin markets. The margin is not a derivative contract, so the trade occurs on the same order book as spot trading. In addition, unlike futures, margin longs and shorts are not always in balance.\n\nFor example, after purchasing 10 Bitcoin using margin, the coins can be withdrawn from the exchange. Naturally, the trade, typically based on stablecoins, requires some form of collateral or a margin deposit.\n\nIf the borrower fails to return the position, the exchange will liquidate the margin to repay the lender.\n\nAdditionally, the borrower must pay interest on the BTC acquired with a margin. The operational procedures vary between centralized and decentralized exchanges, but the lender typically determines the interest rate and duration of offers.\n\nThere was a 12,000 BTC margin decline in a single trade\n\nHistorically, Bitfinex margin traders have been known to move large margin positions quickly, indicating the participation of whales and large arbitrage desks. In the most recent instance, on March 25, those investors reduced their long positions by 12,000 BTC in minutes.\n\nBitfinex BTC margin longs, in BTC contracts. Source: TradingView\n\nNotice the significant decrease, although it did not affect the Bitcoin price. This supports the theory that such margin trades are market-neutral because the borrower is not leveraging their positions with the proceeds. Most likely, there is some arbitrage involving derivatives instruments.\n\nTraders should cross-reference the data with other exchanges to confirm that the anomaly affects the entire market, given that each exchange has distinct risks, norms, liquidity and availability.\n\nOKX, for example, provides an indicator for margin lending based on the stablecoin/BTC ratio. Traders can increase their exposure on OKX by borrowing stablecoins to purchase Bitcoin. Bitcoin borrowers, on the other hand, can only wager on the price decline.\n\nOKX stablecoin/BTC margin lending ratio. Source: OKX\n\nThe above chart shows that OKX traders’ margin lending ratio has been stable for the past week near 30, indicating that professional traders’ long-to-short bets have not changed. This data supports the theory that Bitfinex’s decline is due to an arbitrage close unrelated to Bitcoin price movement.\n\nRelated: US government plans to sell 41K Bitcoin connected to Silk Road\n\nRecent crypto bank closures could have triggered the movement\n\nAnother possibility for the sudden decrease in margin demand is the $4 billion deposits associated with the now-defunct Signature Bank. Crypto clients were told to close their accounts by April, according to a Bloomberg report.\n\nWhile New York Community Bancorp (NYCB) purchased the majority of Signature Bank’s deposits and loans on March 19, the deal with the Federal Deposit Insurance Corporation did not include crypto-related accounts.\n\nIf those whales are forced to close their banking accounts, they will most likely reduce their arbitrage positions, including those in margin markets. For the time being, all assumptions are speculative, but one thing is sure: the 12,000 BTC long margin reduction at Bitfinex did not affect Bitcoin prices.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3MvanVzdGluLXN1bi1vZmZlcnMtdG8tcHVyY2hhc2UtNDE1MDAtYml0Y29pbi1mcm9tLXVzLWdvdmVybm1lbnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Justin Sun Offers to Purchase 41,500 Bitcoin from US Government - Watcher Guru",
        "content": "Tron founder Justin Sun has been going through his fair share of rough times lately. Since being sued by the SEC for fraud and market manipulation and losing his diplomatic status, Sun has been under the radar.\n\nWith the recent court documents revealing that the US government plans to sell 41,500 bitcoin linked to the Silk Road in four different batches this year, Sun has laid out an offer to the US government.\n\nUS government has announced its intention to sell an additional 41,500 #BTC this year. To minimize the potential impact on the market, I would like to offer to purchase these BTC at a 10% discount for an OTC deal. March 31, 2023\n\nJustin Sun offers to buy BTC at a 10% discount\n\nSun put out a tweet right after the news of the government’s BTC sale hit the streets. He mentioned in his tweet that he wanted to minimize the potential impact of the sale of these BTC on the market.\n\nTron’s founder also highlighted that he is willing to purchase these BTC at a 10% discount. He also added that it could be an OTC deal. Evidently, the sale of such a large volume of BTC could definitely affect the price.\n\nAlso read: Shiba Inu Witnessed 700% Spike in Transaction Number; Price Remains Stable\n\nThe US government had seized 51,351.89 bitcoins in the Ulbricht case. The government sold 9,861 BTC via Coinbase on March 14, 2023. It is unclear at the moment whether the government would accept Sun’s request amid his legal dispute."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXdoaXRlLXBhcGVyLW1ha2VzLWl0cy1mMS1yYWNpbmctZGVidXQtb24ta3Jha2VuLXNwb25zb3JlZC1jYXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin white paper makes its F1 racing debut on Kraken-sponsored car - Cointelegraph",
        "content": "The Formula 1 car for the Williams Racing team will feature an excerpt from the Bitcoin white paper as a result of a sponsorship deal with United States-based crypto exchange Kraken.\n\nIn a March 31 tweet, Kraken showed its sea monster-shaped logo containing text from the opening of the 2008 document released by its creator Satoshi Nakamoto in 2008. The Kraken logo appeared to include the entirety of the abstract and introduction, as well as the sections on transactions and timestamp server of “Bitcoin: A Peer-to-Peer Electronic Cash System.“\n\nYES! That’s the Bitcoin Whitepaper on the @williamsracing F1 car\n\n\n\nWho said #Bitcoin isn’t fast!? pic.twitter.com/HSRMpPHihr — Kraken Exchange (@krakenfx) March 31, 2023\n\nThe crypto exchange announced on March 28 that it would partner with the Williams Racing F1 team as part of a sponsorship and Web3 deal. The arrangement marked one of the first times a crypto company had sponsored an F1 team since many similar deals fell apart amid the 2022 market crash.\n\nRelated: Formula One files 'F1' trademarks covering crypto, NFTs and Metaverse\n\nPractice for the next Formula One event is currently underway at the Australian Grand Prix in Melbourne, with the main race scheduled for April 2. In 2022, roughly 420,000 people reportedly attended the four-day event in person.\n\nMagazine: Billions are spent marketing crypto to sports fans — Is it worth it?"
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvdGhlLXVzLWdvdmVybm1lbnQtc29sZC1uZWFybHktMTAwMDAtc2lsay1yb2FkLWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "The US Government Sold Nearly 10000 Silk Road Bitcoin - Nasdaq",
        "content": "Uncle Sam made off with more than $215 million this month as it began to liquidate portions of seized bitcoin.\n\nThe United States government has been selling bitcoin confiscated from the Silk Road case in 2013.\n\nAccording to a court filing, the government sold 9,861.1707894 Bitcoin on March 14, 2023, for a total of $215,738,154.98. After transaction fees, the net proceeds for the government were $215,522,416.83. The government also revealed that there are still around 41,490.72 bitcoin left to be sold, which they plan to sell in four more batches over the course of this year.\n\n\n\nPreviously, the government has auctioned bitcoin, opting instead to proceed with open market sales this time.\n\nThe Silk Road was a darknet marketplace that was used to sell drugs, amongst other services. Ross Ulbricht, the founder of the Silk Road, was convicted in 2015 and sentenced to life in prison. Ulbricht now seeks clemency, as a double life sentence without parole for entirely non-violent charges illustrates the government’s desire to make an example of those who build platforms outside their jurisdiction.\n\nBitcoin Magazine recently opened an art gallery in Nashville, Tennessee, which currently houses a life-size jail cell Ross Ulbricht exhibit, including art that Ulbricht made in prison, as well as writing from ulbricht.\n\nBitcoin’s price action as of late has been exciting for those who watched it fall from all-time highs of $69,000, to local lows of less than $16,000. While the government has been selling bitcoin, other institutions like MicroStrategy have been acquiring it.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lmpkc3VwcmEuY29tL2xlZ2FsbmV3cy9wYXJ0LWlpLXdoZW4teW91LWp1bXAtY2hhaW5zLWRvLW5mdHMtOTgzNTA0MS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Part II: When You Jump Chains, Do NFTs Stay the Same? Ordinals on the Bitcoin Blockchain - JD Supra",
        "content": "As discussed in Part I of this series, Ordinals are a pioneering new method of utilizing the Bitcoin blockchain that will usher in new and innovative use cases on Bitcoin. As promised, in Part II we will discuss the implications for creators and owners.\n\nImplications of Ordinal NFTs for Creators and Owners\n\nAs with most crypto innovation, capable users quickly flocked to the shiny new object. Copies of popular Ethereum NFT projects began appearing on the Bitcoin blockchain after the Ordinals launch. For example, a clone of CryptoPunks, named Ordinal Punks, popped up and is reportedly gaining traction. Further, the owner of Bored Ape Yacht Club (“BAYC”) #1626 permanently removed the NFT from its spot as one of the most valuable in the space by “burning” it, then inscribing the NFT on Bitcoin using Ordinals. While the owner of BAYC #1626 effectively deleted – or symbolically transferred – the NFT, it appears that some NFT creators are not purists and are willing to experiment on Bitcoin. For example, Yuga Labs, the creator behind the Bored Ape Yacht Club Ethereum-based NFT phenomenon, announced that it would release a NFT project called TwelveFold on the Bitcoin blockchain.\n\nIn our December article we asked: what do hard forks mean for my NFTs? In this article we ask a similar question: how does a copy of an NFT on completely different chain (Bitcoin, not Ethereum), affect value and licenses?\n\nA number of questions arise. Does the holder of the copycat Ordinal on Bitcoin require a license corresponding to the Ethereum NFT? What happens to the Ethereum NFT purchaser’s rights granted to it under the license, which may or may not include a commercial right to exploit and sublicense? Does an Ordinal inscription of an Ethereum NFT fall under a purchaser’s general non-commercial use and public display rights that are generally given to purchasers on NFT marketplaces? Does the original Ethereum NFT holder hold one set of rights and the holder of the copycat on Ordinals possess any rights that may be in conflict with the original NFT holder’s? Generally speaking, would the value of the NFT be affected if two identical copies exist on two different blockchains? Does the NFT owner or project have a say in which blockchain to recognize? Has any IP infringement occurred?\n\nThese rights are not insignificant, as the holder, depending on the license grant, is typically permitted to display or otherwise use the NFT in a non-commercial manner, and, in some cases, may even be able to commercially exploit, or grant a person(s) the right to commercially exploit, the NFT. Understanding what bundle of rights, and whether others share that bundle, is helpful to valuing the NFT and its underlying IP, as well as brand building.\n\nAs with everything in the constantly-evolving cryptosphere, there will be variability in how licensing agreements these issues. Certain licensing agreements may offer clues for how this issue may be handled. For instance, the terms of one NFT marketplace, Rarible’s Standard Collectibles Sale and License Agreement (the “Raribles Agreement”), indicates that it only recognizes NFTs on Ethereum:\n\n“ Collectible ” means the combination of: (A) an Ethereum-based NFT having a Uniform Resource Identifier (“URI”) identifying an appropriately configured JSON file conforming to the ERC-721 Metadata JSON Schema, ERC-1155 Metadata URI JSON Schema or a similar JSON schema, as applicable (such JSON file, the ” Collectible ID”); and (B) the Collectible Metadata specified by such Collectible ID.”\n\n[While the Rarible’s Agreement only recognizes Ethereum-based NFTs, the Agreement does recognize NFTs on each chain after a hard fork]:\n\n“ Collector ” of a Collectible means at each time, the person who lawfully holds exclusive title to and ownership of the NFT included in such Collectible, for so long as such person continues to hold such title to and ownership of such NFT. All references to “Collector” include the Collector’s lawful permitted successors and assigns. In the event of an Ethereum Persistent Fork creating copies of the Collectibles at the same addresses at which they were then held on Ethereum, the scope of the term “Collector,” and all licenses granted to and other rights of a Collector under these Terms, shall be deemed expanded to include each person who lawfully holds exclusive title to and ownership of the copies of such NFTs that are included on the Ethereum Persistent Fork. The parties acknowledge and agree that, as a result of the preceding sentence, in an Ethereum Persistent Fork, the aggregate number of the Collectibles may be increased, which could have an adverse effect on the value of each Collectible or the aggregate value of the total Collectibles.\n\nThis raises a second question, what would be the effect be if the Rarible’s Agreement (or any other similar terms of service on an NFT marketplace) was modified to permit an increase in the aggregate number of collectibles as a result of a new enablement on a new protocol, similar to how Rarible’s treats a hard fork?\n\nLike Rarible’s, Yuga Labs, a Web3 developer of NFTs – including CryptoPunks and BAYCs – provides a warranty disclaimer that each CryptoPunk NFT exists only by virtue of the ownership record on the Ethereum Blockchain:\n\nEACH CRYPTOPUNK NFT IS AN INTANGIBLE DIGITAL ASSET THAT EXISTS ONLY BY VIRTUE OF THE OWNERSHIP RECORD MAINTAINED ON THE ETHEREUM BLOCKCHAIN. ANY TRANSFER OF OWNERSHIP THAT MIGHT OCCUR IN ANY UNIQUE DIGITAL ASSET OCCURS ON THE DECENTRALIZED LEDGER WITHIN THE ETHEREUM BLOCKCHAIN, WHICH YUGA LABS DOES NOT CONTROL.\n\nBAYCs includes a similar provision in the Ownership section. As such, under these terms, Yuga Labs has de facto designated Ethereum as its blockchain of choice. However, whereas Rarible’s licensing agreement may result in doubling the amount of “Collectibles” in the event of a fork, Yuga Labs, a Web3 developer of NFTs, reserves the right to designate which fork is valid for their notable Cryptopunks:\n\nThe License applies only to the CryptoPunk NFT on the blockchain that Yuga, in its sole discretion, may designate, which designation shall apply retroactively. Thus, for example, if a fork or other event purports to result in duplicate CryptoPunk NFTs, only the non-fungible token recorded on the blockchain designated by Yuga Labs will be eligible to receive the benefit of the License. Any license purportedly granted hereunder to the owner of a non-fungible token recorded on a blockchain not designated by YugaLabs is void ab initio.\n\nThus, in addition to stating that CryptoPunks exist by virtue of the digital asset record on Ethereum, Yuga labs may designate the blockchain where CryptoPunks exist. In terms of forking, Yuga Labs’ approach is similar to venture capital firm a16z’s approach, which provided five template NFT licenses, each providing for the industry-recognized chain post-fork, merge or duplication.\n\nTransfer and Sublicensing . The licenses granted in these Terms are non-transferrable, except that if you lawfully transfer ownership of your Project NFT, the license to the NFT Media in Section 1.1 to you shall terminate upon the effective date of such transfer, and such licenses will be assigned to the new owner of the Project NFT associated with such NFT Media. As a condition to sales, transfers or similar transactions of the Project NFTs, the transferee agrees upon the acquisition of the Project NFT that (a) the transferee is not a Restricted Party and (b) the transferee accepts these Terms. Further, if you choose to sublicense any of your licensed rights set forth in Section 1.1 above, you are only permitted to do so if any such sublicensees agree (i) that they are not Restricted Parties, (ii) to the same covenant not to assert as set forth in the second to last sentence of Section 1.2, and (iii) that if your licensed rights in Section 1.1 are transferred (such as because you sell your Project NFT), then any such sublicenses you have granted in such licensed rights will automatically terminate. Because virtually all public blockchains are licensed under open source licenses, it is possible that the blockchain may fork, merge, or duplicate the original blockchain that initially recorded ownership of your Project NFT. In such case, any rights granted under these Terms to owners of any Project NFT will only be granted to the lawful owners of such Project NFT whose ownership is recorded on the mainnet version of the blockchain that is generally recognized and predominantly supported in the blockchain industry as the legitimate successor of the original blockchain (as determined in our sole discretion).\n\nHowever, under this version of the a16z NFT license, a16z does not specify that the only valid ownership ledger is on Ethereum, so arguably the licensing agreement may be used with respect to an Ordinal inscribed on the Bitcoin blockchain. Further, Bitcoin is neither a fork from, a merge into, nor a duplication of Ethereum, and the license is silent on NFT copies; however, the clear emphasis is that IP licenses will only be granted to the lawful owners of a project on a “blockchain that is generally recognized and predominantly supported as the legitimate successor of the original blockchain” as determined in the sole discretion of the Creator. It is an open question whether this language would give holders comfort if the argument could be made that their licenses are protected against copycats on a completely separate chain, like Bitcoin.\n\nAlternatively, as a creator may reserve the right to upgrade the NFT’s smart contract in the case of a fork, reserve the right to declare future restrictions on the NFTs use, or stay silent altogether, a creator may also decide to jump entirely to a separate chain. In the absence of a licensing agreement or specific guidelines, Archer v. Coinbase, Inc., 53 Cal. App. 5th 266 (2020), provides some clarity as to how new chains may be handled. In Archer, a user claimed that a cryptocurrency exchange was required to provide him access to all forked versions of the Bitcoin in his exchange account. The California state court disagreed, reasoning that the exchange’s user agreement did not obligate the exchange to support all forks. The court also found that Coinbase’s refusal to support a new form of forked cryptocurrency was not action amounting to conversion as Coinbase did not host the forked cryptocurrency in the first instance, and thus could not have deprived the plaintiff of a property right or exercised dominion over the forked cryptocurrency. Consequently, digital asset trading platforms (token, NFT, or otherwise) tend to expressly reserve the ability to determine which forks they support or otherwise reserve the broad right to place future restrictions on transactions.\n\nIt remains to be seen whether Bitcoin will become a widely popular chain for NFT enthusiastic and projects. In any event, the revolutionary capabilities enabled by Ordinals bring up novel questions surrounding NFTs and licensing agreements, so NFT issuers and marketplaces should consider what effect Ordinals might have on their business models and also reexamine relevant terms as needed to take into account any future NFT-enabled blockchains.\n\n[View source.]"
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vdW5kZXJzdGFuZGluZy1iaXRjb2luLWRvbWluYW5jZS1hLWNvbXByZWhlbnNpdmUtZ3VpZGXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "Understanding Bitcoin dominance: A comprehensive guide - OKX",
        "content": "Bitcoin (BTC) is the world's most traded and largest cryptocurrency. With a current market capitalization of over $543 billion, Bitcoin has the largest share of the entire cryptocurrency market.\n\nThis guide explains what Bitcoin dominance is, how to calculate it, the factors that influence it, and other related details.\n\nWhat Is Bitcoin dominance?\n\nIn simple terms, Bitcoin dominance is the ratio of BTC's market capitalization compared to the entire crypto market cap. Better still, it is the percentage of Bitcoin’s cryptocurrency market share from the total market capitalization of all existing cryptocurrencies. Total market capitalization refers to the total market value of all cryptocurrencies. An asset's market cap is determined by multiplying the asset's total supply by its current price.\n\nMany years ago, Bitcoin had 100% of the entire crypto market share, as there was a period in which it was the only tradeable asset. But with the introduction of Ethereum and other altcoins, Bitcoin dominance continued to drop. However, despite the thousands of altcoins on the market, Bitcoin's dominance is yet to be topped.\n\nHow Is BTC market dominance calculated?\n\nDue to the cryptos volatile nature, Bitcoin’s dominance isn't fixed and is ever changing. For instance, at the end of March 2023, Bitcoin’s market cap was about $543 billion. At the same time, the global crypto market cap was $1.18 trillion.\n\nThe Bitcoin dominance is the percentage that is calculated by dividing Bitcoin’s market share by the total market capitalization. Let's do the maths below:\n\nBitcoin Market Cap ($543 billion) ÷ Global Crypto Market Cap ($1.18 trillion) x 100% = 46%. In this example, the BTC dominance ratio as a percentage is 46%.\n\nHowever, there's also a term called \"Real BTC Dominance”. In this case, traders don't compare BTC's market cap with the global crypto market. Instead, it's compared with the combined market cap of proof-of-work cryptocurrencies. Some of these include Litecoin, Dogecoin and Bitcoin Cash. This method narrows BTC's performance to similar cryptocurrencies.\n\nThe relationship between Bitcoin dominance and market cap\n\nBitcoin dominance allows crypto traders to understand the trend of BTC and altcoins like Ethereum. Since BTC has the largest market share, it's easy to see the influence Bitcoin has on other altcoins. BTC's dominance has an inverse relationship with the market cap of other coins.\n\nFor instance, when Bitcoin dominance increases, the total market share of other cryptocurrencies reduces in value. Similarly, when BTC dominance reduces, the altcoin dominance increases.\n\nFactors influencing Bitcoin dominanceAs stated earlier, Bitcoin dominance isn't fixed. The value changes from time to time due to various factors. Some of these influencing factors are highlighted below:\n\nMarket volatility\n\nArguably the most influential factor affecting Bitcoin's dominance is the market's volatility. As previously mentioned, the cryptocurrency market is highly volatile. This means the total market cap, including Bitcoin, experiences drastic changes. However, Bitcoin's market dominance can increase even when the total market cap plummets. It ultimately depends on the price movement of the altcoin market. If the value of altcoins takes a greater hit than Bitcoin's, then the Bitcoin dominance will likely rise.\n\nAltcoin performance\n\nSince Ethereum launched in 2015, thousands of other altcoins and tokens have been created. Before this time, Bitcoin was the only primary digital currency, so it enjoyed the entire market share. However, with the addition of more altcoins, the dominance of Bitcoin has been negatively impacted, especially as these assets increase in adoption and price.\n\nStablecoin popularity\n\nWhile BTC is one of the most popular cryptocurrencies, its price volatility means investors move their funds from the asset during downturns. They turn to stablecoins. Stablecoins like Tether (USDT) have their values pegged to real-world assets like the USD, gold, and other assets. Because of this, assets like Tether, USD Coin (USDC), and Binance USD (BUSD) have grown in popularity.\n\nRisk-averse investors prefer to use these stablecoins as a store of value during periods of extreme volatility. Investors tend to do this since price swings hardly impact the price of stablecoins. Therefore, as they become more prominent among investors, their market presence increases, negatively impacting BTC dominance\n\nWhat are the uses of BTC dominance?\n\nCrypto traders use Bitcoin dominance for a variety of reasons. Some of them include the following:\n\nRisk-aversion\n\nWhen the Bitcoin dominance increases in value, traders are treading cautiously. This implies they're taking money from risky altcoins and putting it into a more stable asset like Bitcoin. This usually happens during downturns within the market as investors look to hedge their portfolios against decline.\n\nTradeable\n\nBesides being an indicator, the Bitcoin dominance index is also tradable on major cryptocurrency exchanges. It's offered as BTCDOM/USDT in its perpetual futures market. With this, traders can trade Bitcoin's market dominance.\n\nTrack market performance\n\nBitcoin is widely viewed as a measure of the performance of the total market cap in the crypto space. Given this, the broader crypto market capitalization tends to dip when the Bitcoin Dominance Index increases. However, when the BTC Dominance drops, the broader market sees a major uptrend due to increased investment in alternative digital assets like Ethereum, Shiba Inu, and others.\n\nHow to trade crypto using BTC dominance\n\nTrading with BTC dominance is a common practice. The common way to trade crypto using BTC dominance is to identify periods in which altcoins outperform Bitcoin, otherwise known as Altcoin season.\n\nAltcoin season occurs when altcoins experience a significant rise in prices while Bitcoin price stalls for a long period. This often leads to investors plowing their funds in these altcoins and kickstarting an uptrend in prices.\n\nInvestors can identify such periods by using the TradingView Bitcoin Dominance Index. This compares the BTC market capitalization relative to other cryptocurrencies. The end product helps show whether to buy BTC or if altcoins have a stronger trend in the financial landscape.\n\nIn the chart presented below, Bitcoin dominance is significantly rising, showing that an altcoin season is not in play.\n\nSimilarly, BTC dominance can be used to trade or predict cryptocurrency market extremes. When the BTC dominance ratio is very high, history shows that the coin’s price may fall. In contrast, low dominance suggests that the BTC price may experience an uptrend. As such, investors can use this data to determine when to buy or sell BTC.\n\nIs the Bitcoin dominance a reliable indicator?\n\nBitcoin dominance is a common crypto trading analysis tool among investors. It can be a viable tool to identify the market trend since it reflects BTC's strength relative to the broader market. It also provides useful insights into changing market conditions and when to adjust trading strategies. However, like other market data and trends, it does not guarantee that Bitcoin and other altcoins will react in a certain manor. Instead, the Bitcoin dominance index should be used as a guide alongside other market indicators.\n\nIn addition, the crypto market is still witnessing the launch of several more altcoin projects. The more altcoins there are, the less dominance BTC will enjoy due to the increased market share of these projects. This could shrink the market dominance of Bitcoin as more altcoins appear. Nonetheless, it still holds a strong position in the market and can still be used in identifying profitable trading positions.\n\nFAQ\n\nWhat is the Bitcoin dominance index?\n\nThe BTC dominance index is a cryptocurrency market analysis tool. The tool helps investors determine the market trend between Bitcoin and altcoins or other proof-of-work coins.\n\nWhy is BTC dominance important?\n\nBTC Dominance is crucial because it can provide insight into market trends. This way, when the BTC Dominance increases, it signals that investors are playing safe and hedging against riskier assets. When the BTC Dominance drops, it could suggest that investors are taking on riskier assets in hopes of higher profits. This helps traders get a snapshot of the overall market sentiment at a glance.\n\nWhere to check the BTC dominance chart?\n\nThe common place to find the Bitcoin dominance chart is on TradingView. Alternatively, users can use the chart available on CoinMarketCap.\n\nHow long does BTC dominance last?\n\nBTC dominance will last as long as Bitcoin remains the most valuable digital currency. However, the coin's dominance fluctuates from time to time.\n\nHow is Bitcoin dominance calculated?\n\nBitcoin dominance is calculated by dividing Bitcoin’s market cap by the total market cap of all cryptocurrencies, then multiplying by 100%. This gives a percentage value which represents Bitcoin's share of the total crypto market.\n\nWhat factors influence Bitcoin dominance?\n\nSeveral factors can affect Bitcoin dominance, including market volatility, the performance of altcoins, and the popularity of stablecoins. Market volatility can result in drastic changes in the market caps of all cryptocurrencies, including Bitcoin. Altcoin performance and the introduction of new altcoins can decrease Bitcoin's dominance, and the increased use of stablecoins can also impact Bitcoin's share of the total market.\n\nWhat does Bitcoin dominance tell us?\n\nBitcoin dominance is a measure of Bitcoin's market share compared to the entire crypto market. When Bitcoin's dominance increases, it indicates that investors may be moving their funds into Bitcoin as a safer investment compared to other cryptocurrencies. Conversely, a decrease in Bitcoin dominance could signal that investors are taking on riskier investments in altcoins.\n\nWhat is real BTC dominance?\n\nReal BTC Dominance is a term used to describe a measure of Bitcoin's market cap compared to the combined market cap of proof-of-work cryptocurrencies like Litecoin, Dogecoin, and Bitcoin Cash. This method provides a narrower comparison of Bitcoin's performance to similar cryptocurrencies.\n\nIs the Bitcoin dominance a reliable indicator?\n\nBitcoin dominance can provide valuable insights into market trends and can be a useful tool for traders. However, like all market indicators, it is not infallible and should be used in conjunction with other market data and trends.\n\nHow to use BTC dominance for crypto trading?\n\nBTC dominance is commonly used to identify the altcoin season - periods when altcoins outperform Bitcoin. If the BTC dominance is falling, this could signal an altcoin season, and traders may decide to invest in altcoins. Conversely, a rising BTC dominance could indicate a favorable market for Bitcoin.\n\nWhat does the increase in stablecoin popularity mean for BTC dominance?\n\nThe rise in stablecoin popularity can negatively impact BTC dominance. During periods of high market volatility, investors often move their funds into stablecoins, which have their values pegged to real-world assets. This can result in a decrease in Bitcoin's market share.\n\nWhat are the implications of more altcoins launching on BTC dominance?\n\nThe launch of more altcoins could potentially decrease Bitcoin's market dominance, as these new coins increase the total market cap of all cryptocurrencies. However, Bitcoin's dominance could remain high if it continues to be seen as a more stable or reliable investment compared to these new altcoins.\n\nDisclaimer:\n\nTHIS ARTICLE IS PROVIDED FOR INFORMATIONAL PURPOSES ONLY. IT IS NOT INTENDED TO PROVIDE ANY INVESTMENT, TAX, OR LEGAL ADVICE, NOR SHOULD IT BE CONSIDERED AN OFFER TO PURCHASE OR SELL OR HOLD DIGITAL ASSETS. DIGITAL ASSET HOLDINGS, INCLUDING STABLECOINS, INVOLVE A HIGH DEGREE OF RISK, CAN FLUCTUATE GREATLY, AND CAN EVEN BECOME WORTHLESS. YOU SHOULD CAREFULLY CONSIDER WHETHER TRADING OR HOLDING DIGITAL ASSETS IS SUITABLE FOR YOU IN LIGHT OF YOUR FINANCIAL CONDITION. PLEASE CONSULT YOUR LEGAL/TAX/INVESTMENT PROFESSIONAL FOR QUESTIONS ABOUT YOUR SPECIFIC CIRCUMSTANCES."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtdG8tMjJrLXdhdGNoLXRoZXNlLWtleS1sZXZlbHMtaW50by1iaXRjb2luLW1vbnRobHktY2xvc2XSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "BTC price to $22K? Watch these key levels into Bitcoin monthly close - Cointelegraph",
        "content": "Bitcoin (BTC) is back below $28,000 as the countdown to the monthly close keeps everyone on their toes.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\n200-week trend line among popular BTC price targets\n\nData from Cointelegraph Markets Pro and TradingView shows BTC/USD dropping to two-day lows of $27,533 on March 31.\n\nA modest bounce means that the pair is trading at around $27,800 at the time of writing as traders flag the most important support and resistance levels going forward.\n\nFor Crypto Tony, the current part of Bitcoin’s trading range is key, as $27,700 forms the equilibrium (EQ) level and key support that bulls should preserve.\n\n“$27,700 is the level (EQ) you need to watch this weekend if you are currently in a fresh long position. Those who are in with me from awhile back, we are not worried unless we lose that range low,” he wrote in part of his latest Twitter analysis on the day.\n\nAn accompanying chart showed the top, bottom and EQ for BTC/USDT on Binance.\n\nBTC/USD annotated chart. Source: Crypto Tony/Twitter\n\nContinuing a popular narrative, Filbfilb, co-founder of trading suite DecenTrader, said that Bitcoin’s 200-week moving average (WMA) near $25,500 would be “front run” next.\n\nThis would translate to two-week lows, with bulls wanting to avoid a support or resistance flip of the 200WMA — something which occurred in mid-2022 and preceded months of downside.\n\nI believe the 200-week ma will be front run for the following reasons:\n\n\n\n- Already seen evidence of it\n\n- People dont want to talk about exchange risk\n\n- People dont want to talk about stablecoin risk\n\n- Market is positioned short and desperate to exit — filbfilb (@filbfilb) March 30, 2023\n\nConsidering high-timeframe (HTF) resistance now directly above the spot price, meanwhile, fellow trader Credible Crypto cautioned followers on staying bullish at nine-month highs.\n\nRelated: US enforcement agencies are turning up the heat on crypto-related crime\n\n“You’re not allowed to get bullish at the highs into major HTF resistance. Now that we are testing our first actual level of support to the downside you ARE allowed to get a LITTLE bullish. If we are going to go for the highs again, we should hold here,” he said in a Twitter analysis.\n\nDownside targets come in the form of $22,000–$23,000, with $25,000–$26,000 as a less drastic target should market strength hold.\n\n“The RED region above us is HTF resistance and weekly supply which, thus far, remains untested. It would be logical to test this region before a larger correction to 22-23k BTC occurs,” Credible Crypto continued on an accompanying chart.\n\n“This doesn’t mean it HAS to happen, but if we do rally from here back to the highs don’t flip mega bullish into resistance again.”\n\nBTC/USD annotated chart. Source: Credible Crypto/Twitter\n\nBitcoin market structure has “shifted”\n\nConcentrating on the monthly close, analytics account Tedtalksmacro offered a more optimistic angle.\n\nRelated: Will BTC ditch the bear market? 5 things to know in Bitcoin this week\n\nOn longer timeframes, he argued, Bitcoin has “truly shifted” its structure to produce a clean break with the bear market in place since its latest all-time highs in November 2021.\n\n“Bitcoin is doing its best to advertise to those who’d want to enter + hold for the next cycle higher. On the weekly chart, it’s printed its first higher highs (HH) since November ’21 and first higher low (HL) since January ’22,” he summarized.\n\n“Traders now have clear invalidation and can cut longs on acceptance back into the range below 24k. Market structure has well and truly shifted.”\n\nBTC/USD annotated chart. Source: Ted/Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3LmdvYmFua2luZ3JhdGVzLmNvbS9pbnZlc3RpbmcvY3J5cHRvL2lzLWJpdGNvaW4tc2FmZS_SAURodHRwczovL3d3dy5nb2JhbmtpbmdyYXRlcy5jb20vaW52ZXN0aW5nL2NyeXB0by9pcy1iaXRjb2luLXNhZmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Is Bitcoin Safe? What To Know - GOBankingRates",
        "content": "May Lim / iStock.com\n\nBitcoin and its cryptocurrency brethren have made headlines for years now. Fortunes have been made — and quite often, lost — investing in cryptocurrency, and that may not change in the near future. Proponents of cryptocurrency see it as the currency of the future, co-existing with or even supplanting government-issued currency, while detractors think that crypto has no future at all.\n\nCombined with the speculative passion with which traders buy and sell crypto, it’s no wonder that crypto prices are constantly engaged in a volatile tug of war.\n\nIs Bitcoin Safe?\n\nAgainst this backdrop, bitcoin is something of an “old guard,” being the first, oldest and by far the largest cryptocurrency. To some degree, this gives bitcoin an added level of “safety,” but that word must be used cautiously. Bitcoin itself has numerous risks that make it anything but “safe” when compared with more traditional investments like bonds or even stocks.\n\nHere are the most important aspects of investing in bitcoin that you need to know as an investor to help you determine just how “safe” it may be in your portfolio.\n\nInherent Value\n\nBitcoin is unique in the investment world in that it has no inherent value. Bitcoin was essentially created out of thin air, and it isn’t backed by earnings or profits — like the stock market — or the promise of a corporation or government that it would make payments — like a bond.\n\nEven options and other derivatives, which technically don’t have their own pure value, derive a value from their connections to other securities.\n\nBitcoin’s Value\n\nBitcoin, on the other hand, only has value because investors buy it in the belief that its price will rise in the future. There are many reasons behind this support, from the belief that crypto will become legitimized to pure speculative frenzy.\n\nInvesting for Everyone\n\nBut as an investor, you have to come to terms with the fact that you’ll be buying an investment that has no inherent value to fall back on.\n\nVolatility\n\nYou’ll definitely need a strong stomach to invest in a cryptocurrency like bitcoin. Thanks to a number of factors, the price of bitcoin can fluctuate wildly. A look at the history of the annual returns of bitcoin only shows part of the story, but it’s still telling.\n\nPrice Fluctuations\n\nSince its inception in 2009, the smallest annual variation in bitcoin’s price was the 35% gain it posted in 2015. But bitcoin’s biggest annual gain was 2010, when it returned an astronomical 30,203%.\n\nWhile that sounds like the type of return that any investor would crave, you have to factor in volatility on the downside, as well. In three separate years, Bitcoin’s price dropped by more than 60%, topped by its massive 73% loss in 2018.\n\nHype, Speculation and Promotion\n\nMore than any other asset class, cryptocurrency is subject to hype, speculation and promotion. As cryptocurrencies like bitcoin have no inherent value, they can only gain in price when investors buy more in the belief that others will follow and it will go higher.\n\nEntire message boards are devoted to hyping up cryptocurrencies like bitcoin, with rumors flying fast and furious. It can be hard to determine which message posts or “news items” are real and which are simply the work of speculators trying to manipulate the stock higher. This makes an investment in bitcoin inherently risky.\n\nTaxation\n\nMany of the speculators buying and selling bitcoin — or even those using it for everyday transactions like buying coffee — may not be aware of the tax obligations associated with bitcoin.\n\nInvesting for Everyone\n\nCapital Gains Taxes\n\nFrom the investment side, the IRS considers bitcoin to be a capital asset, the same as a stock. In other words, when you buy and sell bitcoin, you’re responsible for reporting those transactions when you file your taxes — and you’ll owe taxes on any capital gains you generate.\n\nCapital Transactions\n\nBeyond buying and selling bitcoin as an investment, however, the IRS also considers using bitcoin to purchase other goods to be a taxable transaction as well. From the perspective of the IRS, when you use bitcoin to buy a cup of coffee, for example, you are converting your bitcoin into something else of value. In fact, technically you are exchanging your bitcoin for dollars and then using those dollars to buy that cup of coffee.\n\nIf the value of your bitcoin at the time of the transaction is higher than it was when you bought it, it’s a taxable capital transaction — the same as if you simply bought and then sold your bitcoin on the open market.\n\nCybersecurity\n\nCybersecurity is a serious issue when it comes to bitcoin, and it’s a different type of risk that you’ll have to understand as an investor. As bitcoin is an intangible, digital asset, it must be stored somewhere electronically.\n\nWhile there are different types of wallets and storage options for your bitcoin, at the end of the day, all digital assets and storage systems are subject to cyber theft. While you can take steps to secure your bitcoin in the best way possible, cybersecurity may always be a concern.\n\nInvesting for Everyone\n\nCompetition\n\nAll capital assets rely on the principles of supply and demand to derive their value. But as bitcoin has no tangible earnings or value behind it, if the hype and hope behind it vanish, the price of bitcoin could plummet. What is one of the things that may draw buyers away from bitcoin? Competition.\n\nOther Cryptocurrencies\n\nThere are literally thousands of other cryptocurrencies in existence, and new ones are being created constantly. While bitcoin remains the elephant in the space, if a developer creates an all-encompassing cryptocurrency that meets the demands, hopes and dreams of crypto buyers, it’s possible that support for bitcoin will wane.\n\nIn that scenario, bitcoin could be relegated to a historical footnote, a “first mover” that started an industry but ultimately couldn’t keep up with the latest developments.\n\nHow Can You Mitigate the Risk?\n\nWhile there is no way to make bitcoin a completely safe investment, there are a few things you can do to reduce the risk for yourself.\n\nStore your bitcoin securely. A cold wallet, or hardware wallet, is the safest place to keep your crypto, followed by a hot wallet. Storing your bitcoin on an exchange is the least secure option.\n\nA cold wallet, or hardware wallet, is the safest place to keep your crypto, followed by a hot wallet. Storing your bitcoin on an exchange is the least secure option. Don’t invest too much. No matter how tempting it is to pour all of your funds into cryptocurrency when you hear stories of crypto millionaires, never invest more than you can afford to lose — because you just might.\n\nNo matter how tempting it is to pour all of your funds into cryptocurrency when you hear stories of crypto millionaires, never invest more than you can afford to lose — because you just might. Avoid scams. If it sounds too good to be true, it probably is. Make sure you do your research before you invest.\n\nInvesting for Everyone\n\nThe Bottom Line\n\nThis list of the risks of bitcoin is by no means complete. For example, numerous governments around the world are discussing creating their own digital coins, and some have even tossed around the idea of making cryptocurrency illegal. The failure of crypto exchanges like FTX are also a big risk.\n\nBut as an investor, you’ll have to weigh all of these dangers against the enormous profit potential that cryptos like bitcoin have exhibited in the past. Whether or not those outsized gains will be available to investors in the future is unknown — that is why there is a market, after all — but it’s something to consider if you’re looking into owning or trading bitcoin.\n\nFAQ Here are some quick answers to common questions about bitcoin's safety. What are the risks of using bitcoin? Among the top risks of investing in bitcoin are its volatility, the fact that it has no inherent value and the ever-present concern of cybersecurity.\n\nIs bitcoin safe and legal? Bitcoin cannot be considered a safe investment, though it can offer high returns. As for its legality, bitcoin is legal in many places, but it is illegal in several countries, including China, and more governments are considering making its use illegal.\n\nIs bitcoin safer than money? No, bitcoin is not safer than money. It is not regulated and it's uninsured, meaning that if you're storing it in an exchange that fails, you could simply lose your entire investment – unlike most bank accounts, which are insured up to $250,000 per depositor by the FDIC. Even if you store your bitcoin in a cold wallet – the safest storage option – it could lose most of its value very quickly, leaving you with nothing to show for your investment. While you might consider investing in some bitcoin as a hedge against inflation, it would be unwise to put all your cash into crypto.\n\nCan you lose money on bitcoin? Yes, you can lose money on bitcoin, and many people have. While it might be a good addition to your portfolio, it is a high risk investment, so never put more money into crypto than you can afford to lose.\n\nHere are some quick answers to common questions about bitcoin's safety.\n\nInvesting for Everyone\n\nAmber Barkley contributed to the reporting for this article.\n\nView Sources Our in-house research team and on-site financial experts work together to create content that’s accurate, impartial, and up to date. We fact-check every single statistic, quote and fact using trusted primary resources to make sure the information we provide is correct. You can learn more about GOBankingRates’ processes and standards in our editorial policy. Internal Revenue Service. 2023. \"Digital Assets.\""
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vd3d3LmNjbi5jb20vYml0Y29pbi1wcmljZS1yZWJvdW5kcy10by0xNDAwMC1vbi1jaHJpc3RtYXMtYXMtY3J5cHRvY3VycmVuY3ktbWFya2V0LXJlY292ZXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Cryptocurrency Market Recovers: Bitcoin Price Rebounds to $14000 on Christmas - CCN.com",
        "content": "On December 25, Christmas day, the bitcoin price rebounded to $14,000 after recording a major correction that sent its value plummeting to $11,500.\n\nBitcoin Optimistic Short-Term Price Trend\n\nOverall, the cryptocurrency market recovered from a correction that occured on December 23, in merely 48 hours. Two days ago, every single cryptocurrency in the market ranging from bitcoin to SingularDTV declined by nearly 50 percent, as the cryptocurrency market lost over $100 billion of its valuation.\n\nToday, the cryptocurrency market cap surged from $488 billion to $550 billion, demonstrating signs of recovery for the first time since last week Tuesday.\n\nBitcoin recorded a price increase of around 6 percent, with over $10 billion daily trading volume spread across USD-to-BTC and KRW-to-BTC trading platforms such as Bitfinex, Bithumb, Binance, and GDAX.\n\nOKEx, the Hong Kong branch of OKCoin, previously the largest cryptocurrency exchange in China before the crackdown on cryptocurrency trading initiated by the Chinese government, processed around 2.4 percent of global bitcoin trades throughout the past three days, solidifying itself as a leading cryptocurrency exchange.\n\nOther leading Chinese exchanges BTCC and Huobi have also started to process large volumes of trades. Given that OKEx, BTCC, and Huobi Pro have migrated their businesses to Hong Kong, in the upcoming months, analysts predict the Hong Kong market to evolve into a major bitcoin and cryptocurrency exchange market.\n\nIn South Korea and Japan, bitcoin is still being traded with high premiums. On Bithumb, South Korea’s largest and the global market’s second biggest exchange, the bitcoin price is being traded at nearly $18,000, with a $3,000 premium, while leading markets like the US are processing bitcoin trades at around $14,500.\n\nCryptocurrency Market Recovers\n\nEthereum, Bitcoin Cash, Cardano, Monero, and Zcash have also recorded major gains over the past 24 hours, with Ethereum and Zcash rising by 15 percent and 20 percent respectively. Analysts have attributed the recent recovery of the cryptocurrency market to Christmas and the upcoming New Year’s, as the gathering of families, relatives, and friends has historically led to the surge in the price of bitcoin and other cryptocurrencies in the market.\n\nThroughout the holidays, the demand for bitcoin will likely continue to skyrocket as new individual investors become introduced to the new asset class that is bitcoin and cryptocurrencies. Earlier today, Investopedia, an online dictionary platform for finance keywords, stated that bitcoin has been named the term of the year.\n\n“Bitcoin is named ‘Term of the Year’ by Investopedia as measured by search volume and percentage gains over the course of the year. Perhaps unsurprisingly, ‘bitcoin’ cruised to the top spot on the list, beating out terms such as AI, Trumpcare, FAANG and even millennials,” said Blockchain Life.\n\nIf new investors flow into the bitcoin market over the next few weeks, more traders would look into cheaper alternatives with lower market caps, as they have the potential to provide higher returns, but with more risks.\n\n“For new investors in crypto, think in market cap. Not price per coin. Market cap gives an estimate of the potential growth. Price per coin doesn’t mean anything as the supply for each altcoin differs. $0.1 per coin doesn’t mean it’s cheap. $100 per coin doesn’t mean it’s expensive,” explained cryptocurrency trader Squeeze.\n\nFeatured image from Shutterstock."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMzEtbWFyY2gtMjAyMy9hcnRpY2xlc2hvdy85OTEzODQ4OC5jbXPSAb4BaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTMxLW1hcmNoLTIwMjMvYW1wX2FydGljbGVzaG93Lzk5MTM4NDg4LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin holds above $28,000; Solana, Dogecoin slip up to 3% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency markets were trading mixed on Friday. Bitcoin, Dogecoin and Solana were trading with cuts, while BNB, XRP and Tron were trading with gains.Bitcoin (BTC) fell 1.91% to $28,074, whereas Ethereum (ETH) was above the $1,800 level. BTC volume stood at approximately $19.14 billion, falling 17.89% in the last 24 hours.\"Bitcoin was seen consolidating above the US$28,000 pivot level in the past 24 hours following a recent surge above the US$29,000 level. This consolidation could be due to the anticipation of the upcoming US GDP report,\" Edul Patel, Co-founder and CEO at Mudrex, said.\"There is a key bullish trend line forming with support near US$27,900. BTC’s immediate resistance now lies at the US$28,500 level and then US$ 28,850 zone. However, BTC has not yet acquired enough strength to make a sharp move but the key uptrend support remains intact,\" Edul added.The total volume in DeFi is currently 4.44 billion, 10.21% of the total crypto market 24-hour volume. The volume of all stablecoins is now $38.58 billion, which is 88.73% of the total crypto market 24-hour volume.The global cryptocurrency market cap was trading lower around $1.18 trillion, falling 0.87% in the last 24 hours.The market cap of Bitcoin, the world's largest cryptocurrency, was around $543 billion. Bitcoin’s dominance is currently 46.17%, a decrease of 0.47% over the day, according to CoinMarketCap.\"The current technical outlook remains relatively stable, hovering around the $27,900 price level. A break of the resistance at $28,950 could lead to a potential rally for Bitcoin to $29,200 or even $30,700, while strong support levels are expected around $26,600 and $25,200 if the downtrend continues,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.Rajagopal Menon, Vice President at WazirX said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 62.71, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) indicate a Neutral outlook as well at 69.33 and 38.60 respectively.\"The MACD Level (12, 26), at 1198.04, indicates Sell. The Stochastic RSI Fast (3, 3, 14, 14) and the Williams Percent Range (14) continue to be Neutral at 30.11 and −41.78, respectively,\" Menon added.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.28 hours, IST on March 31, 2023)Bitcoin $28,074 -1.91%Ethereum $1,801 0.13%Tether $1.00 0.04%BNB $316.48 1.19%XRP $0.5442 1.34%Cardano $0.3788 0.45%Polygon $1.09 -1.90%Dogecoin $0.07465 -0.82%Solana $20.40 -2.62%Polkadot $6.22 0.79%Tron $0.06513 1.29%Shiba Inu $0.00001062 0.01%Litecoin $89.30 -1.12%(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL21vcmUtdGhhbi01MC1vZi1iaXRjb2luLW1pbmluZy11c2VzLXJlbmV3YWJsZS1lbmVyZ3kv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "More than 50% of Bitcoin mining uses renewable energy - CryptoSlate",
        "content": "The majority of power used in Bitcoin mining comes from renewable energy sources, according to research by ESG analyst and investor Daniel Batten.\n\nClimate activists and politicians have long criticized the impact of mining on the environment but recent research shows that Bitcoin is ushering in renewable energy at an unprecedented rate.\n\nBatten projects a 6.2% annual growth in sustainability in terms of power used for Bitcoin mining which will correlate with a decline in the usage of fossil fuel-based energy.\n\nWater\n\nAlmost a quarter of all Bitcoin miners use water to power their setups. Hydropower makes up 23.12% of all energy used in mining.\n\nAdditionally, the wind is used to generate power for 13.98% of Bitcoin mining, while nuclear and solar account for 7.94% and 4.98% of all power used in mining, respectively. Other renewable energy sources are used in about 2.40% of Bitcoin mining.\n\nAll in all, roughly 52.4% of all Bitcoin mining relies on renewable energy for its power needs and the trend is expected to continue growing in the coming years as traditional energy sources become more and more expensive.\n\nFossil fuels\n\nMeanwhile, roughly 43% of all energy used in Bitcoin mining is still generated via gas and coal. However, Batten noted that the electric vehicle industry still uses global gridmix, which generates 60% of its energy from fossil fuels.\n\nIn comparison, 43% is “already exceptional,” according to Batten.\n\nThe methodology used to calculate the percentages was shared in the research report and does not encompass 100% of Bitcoin mining setups in the world."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vZmluYm9sZC5jb20vMS03LW1pbGxpb24tYml0Y29pbi1ib3VudHktdG8tYmUtc2VudC10by1tb29uLWluLWFuLWludGVycGxhbmV0YXJ5LWV4cGxvcmF0aW9uLWluY2VudGl2ZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "$1.7 million Bitcoin bounty to be sent to moon in an interplanetary exploration incentive - Finbold - Finance in Bold",
        "content": "A company specializing in social intelligence for the cryptocurrency ecosystem, LunarCrush, has announced its intention to send a treasure chest of 62 Bitcoins (BTC), valued at approximately $1.76 million at the time of writing, to the moon. Literally.\n\nThe Bitcoin bounty, dubbed as Nakamoto_1, will only be accessible to the first space traveler who reaches the moon and obtains the private key for a crypto wallet engraved on the Lunar Outpost MAPP Rover, which will be launched into space later this year, the company said in an official press release published on March 23.\n\nTo achieve that, LunarCrush partnered with Lunar Outpost, animation studio Golden Wolf, and Bitcoin developer tools company Hiro to fund the project through the sale of an NFT collection. According to the firm, the ultimate goal is to “inspire the next generation of interplanetary exploration.”\n\nThe bounty is available to anyone on Earth\n\nNotably, the project plans to fully document the process of engraving the private key affixed to the rover as a way to ensure complete transparency. Once Lunar Outpost’s MAPP Rover lands on the moon, the bounty is available to anyone on Earth who can devise and execute a plan to reach it.\n\nAs per the press release, the moon mission is part of a larger effort to inspire innovation and exploration.\n\n“When you put out a seemingly unachievable goal, the innovation that happens can be incredible,” said Joe Vezzani, CEO of LunarCrush. “Our goal is to inspire people to build communities that will unlock a new era of exploration.”\n\nLunar Outpost’s Chief Strategy Officer, Dr. Forrest Meyen, said,\n\n“What may sound outlandish to some will open new frontiers that haven’t been explored outside the mind in a long time. Future generations will look to us as pioneers of interplanetary exploration and adventure.”\n\nThe Bitcoin bounty will be delivered via a SpaceX rocket in Q4 of this year, but the exact date has not yet been released for security reasons."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5meHN0cmVldC5jb20vY3J5cHRvY3VycmVuY2llcy9uZXdzL2JpdGNvaW4td2Vla2x5LWZvcmVjYXN0LWJyZWFraW5nLWRvd24ta2V5LWJ0Yy1sZXZlbHMtdG8tYWNjdW11bGF0ZS1mb3ItcTItMjAyMy0yMDIzMDMzMTEyNDXSAY4BaHR0cHM6Ly93d3cuZnhzdHJlZXQuY29tL2FtcC9jcnlwdG9jdXJyZW5jaWVzL25ld3MvYml0Y29pbi13ZWVrbHktZm9yZWNhc3QtYnJlYWtpbmctZG93bi1rZXktYnRjLWxldmVscy10by1hY2N1bXVsYXRlLWZvci1xMi0yMDIzLTIwMjMwMzMxMTI0NQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin Weekly Forecast: Breaking down key BTC levels to accumulate for Q2, 2023 - FXStreet",
        "content": "Share:\n\nBitcoin price looks bullish on the weekly and monthly timeframes, suggesting that a continuation of the bull trend is likely.\n\nKey levels to the upside include $35,000 and $38,500.\n\nInvalidation of the bullish thesis will occur on the flip of the $20,200 level.\n\nBitcoin price shows an interesting outlook as the first quarter of 2023 comes to an end. BTC has shown strength since day one of 2023 and has netted investors approximately 70% in returns. This article will break down key support levels and hurdles for the second quarter of 2023.\n\nRead more: Top 3 Price Prediction Bitcoin, Ethereum, Ripple: Altcoins flourish as BTC remains rangebound\n\nBitcoin price and historical returns\n\nBefore jumping into Bitcoin price, let us take a look at the historical quarterly returns for BTC. The quarterly return for the pioneer crypto is hovering around 68%, which makes it the 2nd biggest performance since 2021.\n\nGeneral observation shows that if the quarter one (Q1) returns are negligible, Bitcoin price shows enthusiasm and rallies in the next quarter. However, a greater than 20% return in Q1 is generally followed by a retracement or pullback in the next quarter.\n\nTherefore, investors need to be cautious of a potential correction.\n\nWhen looking at data that extends back to 2014, readers can observe that although the average return of BTC in Q1 2023 is 5.91%, quarter two has an average return of 32%. Clearly, there is a change in the narrative this year owing to the worsening macroeconomic conditions and multiple bank runs.\n\nIf ex-Coinbase CTO’s prediction about hyperbitcoinization comes to life, then Bitcoin price could spike higher.\n\nBTC quarterly returns\n\nKey BTC levels on the monthly\n\nBitcoin price on the monthly timeframe shows that it has produced a higher high relative to August’s swing high at $25,205. This shift in market structure suggests that the ongoing uptrend is likely to continue, albeit after a minor retracement.\n\nThe Relative Strength Index (RSI) is currently below the 50-line, attempting to move higher. If the bullish momentum continues, allowing RSI to flip the midpoint, it could signal a continuation of the run-up.\n\nFurther supporting this optimistic outlook is the Awesome Oscillator (AO), which shows a steady decline in the bearish momentum as two consecutive months close with a spec of bullish momentum.\n\nA flip of the RSI above the 50-line, if accompanied by AO moving above the zero line, would be a buy signal. The last time this similar structure formed was in 2019, after which Bitcoin price rallied 233% from $4,124 to $13,764 to setup a local top.\n\nSo if history repeats, the key levels to the upside include\n\nThe accumulation level is roughly $24,700. Targets or take profit levels include $35,000 and $38,500\n\nBTC/USD 1-month chart\n\nBitcoin price’s 3-day chart reveals how bears can takeover\n\nThe three-day chart for Bitcoin price shows a potential bearish breaker formation in early March. This setup occurs when the underlying asset produces a higher high but fails to sustain the uptrend. Instead, the correction slices below the down candlestick formed between the two higher highs.\n\nThis down candlestick is known as a bearish breaker, a decisive close below it at roughly $20,200 will trap the bulls and is likely to trigger a tremendous spike in selling pressure on the next retest from below.\n\nAs seen in the chart below, a bearish breaker was formed in August. A retest of this breaker after a breakdown below it triggered an unusual spike in selling pressure.\n\nComing back to the current outlook, BTC is still 25% away from retesting the upper limit of the bearish breaker. As mentioned above, only a decisive flip of the $20,200 level will confirm the existence of a bearish breaker.\n\nA failure to close below the aforementioned level will indicate that the buyers are in control and could serve as a bouncing pad for the next leg-up.\n\nBTC/USD 3-day chart\n\nBTC bears in luck on lower timeframe\n\nThe four-hour chart for Bitcoin price also confirms a bearish breaker formation. A retest of the breaker has triggered a rejection that could plummet BTC down to collect the sell-side liquidity at $26,547.\n\nIn some cases, the downtrend could exacerbate and tag $24,736, the key support level shown on the monthly chart.\n\nBTC/USD 4-hour chart\n\nTo reiterate, Bitcoin price shows a bullish outlook on the monthly and weekly timeframes, but there will be an opportunity for bears to profit off of a small-time pullback to key high timeframe (HTF) levels.\n\nInvalidation of the long-term bullish outlook will occur if Bitcoin price slides below the $20,200 level and decisively flips it into a resistance level. Such a move could trigger the HTF bearish breaker to come alive. In such a case, investors should pay attention to the $17,605 support level, which is where the sellers climaxed after a 44% crash in June 2022.\n\nA breakdown of this level could send BTC spiraling down to collect the liquidity resting below the $15,588 equal lows. In an extremely bearish case, Bitcoin price could tag the $10,809 support level. This move would denote an 84% drawdown from BTC’s all-time high of $68,958 and would potentially signal a bottom for the ongoing bear market."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3LmJpdGNvaW5tYXJrZXRqb3VybmFsLmNvbS9hdGxhbnRhLWJsb2NrY2hhaW4tZXZlbnRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Top Bitcoin and Crypto Meetups for Atlanta, Rated and Reviewed - Bitcoin Market Journal",
        "content": "Atlanta has long been a growing center for technology, and it’s now becoming a hub for blockchain startups. This means a diverse and growing selection of meetup groups are available in Atlanta to help you network with people who share your interests in blockchain technology, digital assets, fintech, and much more.\n\nIf you’re looking for global events, check out our list of Best Blockchain Conferences.\n\nIf you have a meetup that you’d like listed, or represent one of the events below, contact us to manage your listing.\n\nHere is a look at the top meetup groups in Atlanta, measured by metrics like number of members, user rating and activity level.\n\nMembers: 4,553\n\nActivity Level: Very High\n\nThis meetup provides free bitcoin education in Atlanta. They do invite people of all skill levels although discussions are technical in nature. They believe the future of money is decentralized and cover many bitcoin-related topics at their meetups including mining, programming, and the Lightning network. In addition to their free monthly meetups, they offer workshops with a classroom-like setting.\n\nMembers: 2,748\n\nActivity Level: High\n\nThis meetup was created for the purpose of helping minorities learn about blockchain and cryptocurrency with a focus on how it can be used to create generational wealth.\n\nMembers: 2,663\n\nActivity Level: High\n\nBitcoin Atlanta wants to continue the discussion that Satoshi Nakamoto’s whitepaper started in October 2008. In addition to discussing Bitcoin, they cover cryptocurrencies, blockchains, and other emerging technologies. They invite those interested in Bitcoin and blockchain to join.\n\nMembers: 876\n\nActivity Level: Very High\n\nAs one of many Hyperledger meetup groups, this group has an informal association with Hyperledger and is a key part of their ecosystem. Participation is open to anyone not only employees of a Hyperledger member company and Hyperledger developers but also individuals who are passionate about blockchain technology.\n\nMembers: 582\n\nActivity Level: High\n\nThis meetup helps minorities learn about how to build generational wealth based on the global revolution of blockchain and cryptocurrency.\n\nMembers: 668\n\nActivity Level: Low\n\nThis meetup aims to provide hands-on education on both blockchain and cryptocurrency for interested individuals in Atlanta. They don’t promote any specific cryptocurrencies and are committed to deep-dives into advanced topics. The group has the support of the Georgia Cyber Warfare Range, a group aimed at providing resources to technology professionals.\n\nKeep up to date with everything happening in the blockchain space by subscribing to Bitcoin Market Journal!"
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWJ0Yy1hdHRlbXB0cy1hbm90aGVyLXJlc2lzdGFuY2UtYnJlYWtvdXQtd2lsbC1pdC1jcmFjay0zMDAwMC_SAV9odHRwczovL2FtYmNyeXB0by5jb20vYml0Y29pbi1idGMtYXR0ZW1wdHMtYW5vdGhlci1yZXNpc3RhbmNlLWJyZWFrb3V0LXdpbGwtaXQtY3JhY2stMzAwMDAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin [BTC] attempts another resistance breakout: Will it crack $30,000 - AMBCrypto News",
        "content": "Bitcoin saw a higher net outflow despite large exchange outflows.\n\nSupport retest yielded some sell pressure, but long-term holders were still going strong.\n\nBitcoin [BTC] peaked at $29,380 on 24 March before experiencing a resurgence of sell pressure. Fast forward almost one week later, and the bulls are showing their strength once again.\n\nIs your portfolio green? Check out the Bitcoin Profit Calculator\n\nBitcoin crossed back above the $29,000 price point within the last 24 hours, raising bullish hopes that it will soon cross the $30,000 mark. But how likely is this outcome before the end of the week, especially now that the price has to contend with resistance?\n\nRecent market observations may offer some insights into what to expect. For example, on 30 March, Glassnode revealed that Bitcoin’s Percent Supply Last Active 1+ Years was at a new ATH.\n\nThe Glassnode observation suggested that the amount of HODLed Bitcoin was still growing. However, there was also a surge in sell pressure over the last few days. Bitcoin’s daily on-chain exchange outflow peaked at $1.1 billion while inflows were lower at $921 million. The cryptocurrency has thus been experiencing more sell pressure.\n\nWill Bitcoin bulls yield to prevailing sell pressure?\n\nA look at Bitcoin’s press time position explained why it had been experiencing sell pressure. The upside, especially within the last 24 hours at press time, pushed back into the ascending resistance line. As such, many investors have been taking profits, thus triggering the pullback to the $28753 press time price.\n\nBitcoin was likely to experience sell pressure with the resistance line retest. Enough sell pressure may trigger more downside, while a bullish dominance may push past resistance and possibly above $30,000.\n\nA look at exchange data revealed that both inflows and outflows were down notably in the last 24 hours. However, exchange outflows slightly dominated at 22,178 BTC, compared to exchange inflows at 20,548 at the time of writing.\n\nHow many are 1,10,100 BTCs worth today?\n\nInvestors should also note that Bitcoin open interest in the derivatives market is back to its two-month highs, an indication that there was strong demand for BTC in the derivatives market. This surge was accompanied by an uptick in the demand for leverage, as indicated by the estimated leverage ratio.\n\nThe last time that both metrics peaked at the same level was on 19 March. This was followed by a bit of sell pressure, but it was not enough to trigger a large pullback. The fact that the same metrics are back at the same level confirmed relative strength, but the bears may not be far behind."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL21pY2hhZWwtYnVycnktcmV2ZXJzZXMtc3RhbmNlLW9uLWJpdGNvaW4tYnRjLWFmdGVyLWFkbWl0dGluZy1taXN0YWtlL9IBZGh0dHBzOi8vY29pbnBlZGlhLm9yZy9uZXdzL21pY2hhZWwtYnVycnktcmV2ZXJzZXMtc3RhbmNlLW9uLWJpdGNvaW4tYnRjLWFmdGVyLWFkbWl0dGluZy1taXN0YWtlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Michael Burry Reverses Stance on Bitcoin (BTC) After Admitting Mistake - Coinpedia Fintech News",
        "content": "Sohrab is a passionate cryptocurrency news writer with over five years of experience covering the industry. He keeps a keen interest in blockchain technology and its potential to revolutionize finance. Whether he's trading or writing, Sohrab always keeps his finger on the pulse of the crypto world, using his expertise to deliver informative and engaging articles that educate and inspire. When he's not analyzing the markets, Sohrab indulges in his hobbies of graphic design, minimal design or listening to his favorite hip-hop tunes.\n\nThe cryptocurrency market has recently been experiencing a surge in prices, which has attracted investors to take advantage of the “buy the dip” trend. Prominent investor Michael Burry has recently shifted his outlook from negative to bullish, admitting that he was wrong to predict a sell-off in early February.\n\nBurry’s reversal from skeptic to bull serves as a reminder to investors to stay informed and adaptable in the face of changing market trends. The current trend to take the risk even if they are performing low has been a profitable strategy for investors, and cryptocurrencies are a reflection of this.\n\nBurry’s confession highlights the importance of generating capital during market downturns. The buy-the-dip strategy is a tried and true method of the successful investor. Burry’s chart from the Bloomberg terminal shows that 2023 is the second-best year for the dip-buying strategy, behind only 2020.\n\nAccording to the analyst, the market is always changing, and it’s our job as investors to adapt to those changes. Sticking to our convictions when the market has proved us wrong is a surefire way to lose money.\n\nGoing back to the 1920s, there has been no BTFD generation like you. Congratulations. pic.twitter.com/iAGN0CqmjD — Cassandra B.C. (@michaeljburry) March 30, 2023\n\nIn conclusion, Michael Burry’s recent admission highlights the importance of recognizing and adapting to market trends. The current trend to take the risk even if they are performing low has been a profitable strategy for investors, and cryptocurrencies are a reflection of this.\n\nWhile careful analysis and risk management should always be a priority, being open-minded and adaptable is essential for success in the current market."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8td3JhcC1tYXJrZXQtdHJhZGluZy1mbGF0LWFtaWQtcmVndWxhdG9yeS1jcmFja2Rvd24tb24tYmluYW5jZS0xMjMwMzMxMDA3MTNfMS5odG1s0gGVAWh0dHBzOi8vd3d3LmJ1c2luZXNzLXN0YW5kYXJkLmNvbS9hbXAvbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8td3JhcC1tYXJrZXQtdHJhZGluZy1mbGF0LWFtaWQtcmVndWxhdG9yeS1jcmFja2Rvd24tb24tYmluYW5jZS0xMjMwMzMxMDA3MTNfMS5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Crypto wrap: Market trading flat amid regulatory crackdown on Binance - Business Standard",
        "content": "The crypto market traded sideways last week amid a crackdown on the largest crypto exchange Binance. Earlier this week, the US Commodity Futures Trading Commission (CFTC) filed a lawsuit against Binance for trading against customers, misusing internal trading channels and making unregulated derivative markets.\n\nThis was followed by Bitcoin, the largest crypto token by market cap, touching its highest level of $29,000 since last June. But soon, it fell from the highs. On Friday, it was trading at $27,923, down 0.45 per cent since last week.\n\nEthereum, the second-largest digital token, was up 0.33 per cent to $1,794 last week.\n\n\"Surprisingly, last week, it was not the securities regulator SEC but the commodities regulator CFTC, that launched a slew of accusations against Binance. Binance is planning to fight against these claims in court,\" said Parth Chaturvedi, crypto ecosystem lead at crypto exchange CoinSwitch.\n\n\"Today, BTC is consolidating above the crucial $28,000 level, likely due to the US GDP report. A bullish trend line is in place offering support around $27,900,\" said Alankar Saxena, CTO and co-founder at crypto firm Mudrex.\n\nThe recently released US GDP data noted a slowdown in growth rate from 3.2 per cent in the previous quarter to 2.6 per cent in the fourth quarter of 2022-23 (FY23).\n\nWhat to expect in the coming days?\n\n\"While Bitcoin and Ethereum showed a move to the upside at the end of the week, a lot of ongoing challenges are yet to be fixed for the industry before a sustainable move is seen,\" said Anurag Dixit, founder of crypto firm Kunji.\n\nAccording to Saxena, Bitcoin is currently facing resistance at the $28,500-$28,850 zone, and its primary uptrend support remains strong. However, it lacks the momentum for a \"significant move\".\n\nA major event to watch out for in the coming days is the significant drop in liquidity and trading volumes, particularly on Binance.\n\n\"Such conditions can be accompanied by high volatility in prices on either side, as large orders can sway prices rapidly. The regulatory fallout too continues to keep markets on shaky grounds,\" said Chaturvedi."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmJ1c2luZXNzdGltZXMuY29tLnNnL2ludGVybmF0aW9uYWwvdGhpZWYtd2hvLXN0b2xlLXVzMzQtYmlsbGlvbi1iaXRjb2luLWRlc2VydmVzLXByaXNvbi11cy1zYXlz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "Thief who stole US$3.4 billion in Bitcoin deserves prison, US says - The Business Times",
        "content": "FEDERAL prosecutors urged prison time for a Georgia man who stole more than 50,000 Bitcoin valued at US$3.35 billion when authorities seized it in November 2021, which at the time was the second-largest financial seizure in US history.\n\nThe seized Bitcoin is now worth US$1.48 billion, but James Zhong, 32, should do time behind bars for his heist in 2012 from the Silk Road darkweb site, prosecutors told a federal judge on Friday (Mar 31), noting he deserves leniency for helping authorities recover the stolen crypto. Zhong pleaded guilty in November and wants the judge to spare him a prison term.\n\nZhong hid his caper for a decade, and spent US$16 million of the proceeds on real estate investments, luxury hotels, nightclubs and cars like Lamborghinis and a Tesla, prosecutors wrote in a filing in federal court in New York. The Bitcoin he sold for that high life was valued at US$142 million at the time of the seizure, they said.\n\n“Put simply, this conduct warrants imprisonment,” assistant US attorney David Felton wrote in the filing. Zhong is scheduled to be sentenced Apr 14.\n\nWhile taking out some Bitcoin he was storing on Silk Road, the notorious online black market, Zhong double-clicked the withdrawal button by mistake, getting back twice as much as he’d put in. He deposited more coins and quickly withdrew them, double-clicking each time, to parlay the glitch into a windfall of 50,000 Bitcoin, each worth about US$12 at the time, court records show.\n\nWhen federal agents seized 50,491 Bitcoin from Zhong’s lakefront home in Gainesville, Georgia, it had exploded in value. The cryptocurrencies were found stored on devices in a safe under floorboards and on a single-board computer stowed in a Cheetos popcorn tin in a closet. He later surrendered more than 1,000 additional Bitcoin.\n\nSEE ALSO MicroStrategy launches second note sale this month to buy more Bitcoin\n\nA NEWSLETTER FOR YOU Monday, 3.30 PM Garage The hottest news on all things startup and tech to kickstart your week. Sign Up We have other newsletters you might enjoy. Take a look.\n\nFederal sentencing guidelines call for Zhong to spend 27 to 33 months in prison, and probation officials recommended 24 months. In a memo filed on Friday, prosecutors said his youth, his autism and his help in recovering the stolen crypto warrant less than two years behind bars.\n\nBut they argued that Zhong concealed his actions for nine years by moving some of the Bitcoin through so-called mixers that make it harder to trace transactions by jumbling tokens together. They also say he was “evasive and untruthful” with an overseas crypto exchange about the source of his holdings.\n\n‘Clear message’\n\nZhong needs to go to prison to send a “strong and clear message to others that cryptocurrency thefts and frauds, no matter the victim, run the risk of incarceration”, the government argued.\n\n“It has, unfortunately, become too easy for advanced, computer-savvy individuals like Zhong to target and victimise holders of cryptocurrency from behind computer screens, and to hide their crimes through a web of concealment-focused transactions, mixers, and offshore cryptocurrency exchanges,” prosecutors said.\n\nLast week, Zhong’s lawyers filed their own sentencing memo arguing he should get probation, arguing that while he had no right to the stolen Bitcoin, neither did Silk Road. They said the marketplace isn’t a victim “in the true sense of the word” under the law, noting that the marketplace’s founder, Ross Ulbricht, contacted Zhong and asked him how he took the cryptocurrency. But he never asked for it back — and sent more.\n\nZhong is the product of a “dysfunctional family and childhood”, his lawyers said. His divorced parents showed him no love. He was “severely bullied and victimised by his peers because he was different — he was extremely shy, overweight, and most significantly, suffered from undiagnosed autism spectrum disorder”, his lawyers said.\n\n“Having no friends or family he could turn to, Jimmy found solace and friendship in the world of his computer,” the wrote. BLOOMBERG"
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDQvMDEvNi1iaWxsaW9uLXVzZC1iaXRjb2luLWhlbGQtdXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 01 Apr 2023 07:00:00 GMT",
        "title": "6 billion USD in Bitcoin held by the US - The Cryptonomist",
        "content": "As of 25 March 2023, the US government held 205,515 Bitcoin worth $5.6 billion (USD), or about 1.06% of the circulating supply, according to current statistics.\n\nThe Bitcoin stockpile is the result of three seizures that began in 2020. Glassnode’s on-chain data reveal that on 9 March about 9,860 Bitcoin worth about $269 million were sent to a Coinbase address.\n\nOne of the most interesting aspects of Bitcoin adoption is the growing interest in the digital currency by governments around the world. While some countries have banned Bitcoin altogether, others have taken a more measured approach and are actively exploring ways to integrate Bitcoin and other cryptocurrencies into their financial systems. In the United States, the government’s relationship with Bitcoin is complex, to say the least.\n\nThe complicated relationship between the US government, the dollar (USD) and Bitcoin\n\nThe US government’s Bitcoin holdings are the result of three separate seizures by the Department of Justice (DOJ) in 2020.\n\nThe first seizure occurred in June 2020, when the DOJ confiscated 69,370 BTC, worth about $1.4 billion at the time, from an unknown hacker who had stolen the cryptocurrency from an unnamed dark web market.\n\nThe second seizure occurred in November 2020, when the DOJ confiscated 29,655 Bitcoin, worth about $650 million at the time, from the dark web marketplace Silk Road.\n\nFinally, in December 2020, the DOJ confiscated 116,490 Bitcoin, worth about $2.3 billion at the time, from an unknown individual allegedly involved in money laundering.\n\nThe US government’s Bitcoin holdings are significant not only for their dollar value, but also for their impact on the Bitcoin market.\n\nWith over 205,000 Bitcoin under its control, the US government is one of the largest holders of Bitcoin in the world.\n\nThis has led to speculation that the government may be manipulating the market by selling its Bitcoin holdings or using its Bitcoin holdings to influence the market in other ways.\n\nHowever, it is important to note that the US government has stated that it has no plans to sell its Bitcoin holdings anytime soon. Rather, the government has stated that it intends to keep its holdings in Bitcoin as a long-term investment.\n\nThis is a smart move given the volatility of the Bitcoin market and the potential for significant price increases in the future.\n\nWhat is entailed by the decision of the US to hold Bitcoin\n\nThe decision by the US government to hold its holdings in Bitcoin is also significant in terms of its potential impact on the broader adoption of Bitcoin.\n\nBy maintaining its holdings in Bitcoin, the US government sends a signal to other investors and institutions that Bitcoin is a legitimate asset class and has long-term value.\n\nThis could help increase institutional adoption of Bitcoin and ultimately lead to greater public acceptance of the cryptocurrency.\n\nOf course, there are risks associated with the US government’s Bitcoin holdings. One of the biggest risks is the potential for theft or hacking.\n\nBitcoin is a digital currency and, as such, is vulnerable to hacking and other cyber attacks. If the US government were to experience theft or hacking, the consequences for the government and the Bitcoin market in general could be significant.\n\nAnother risk is potential government regulation. Even though the US government has been relatively hands-off when it comes to regulating Bitcoin, there is always the potential for more regulation in the future.\n\nIf the government were to impose onerous regulations on Bitcoin, it could have a negative impact on cryptocurrency adoption.\n\nDespite these risks, the US government’s decision to maintain its holdings in Bitcoin is a positive sign for Bitcoin’s future.\n\nAs more traditional financial institutions and investors begin to consider Bitcoin, the US government’s decision to maintain its holdings in Bitcoin may encourage others to take a closer look at the cryptocurrency and consider it as a potential long-term investment.\n\nIn addition, the US government’s Bitcoin holdings could be used as a tool of diplomacy. Concerns have increased in recent years about the use of Bitcoin and other cryptocurrencies for illicit activities such as money laundering and terrorist financing.\n\nBy keeping its Bitcoin holdings and using them as a law enforcement tool, the US government could help combat these illicit activities and promote greater transparency and accountability in the global financial system.\n\nThe idea of maintaining BTC holdings represents a significant development for the financial sector\n\nThe US government’s decision to maintain its holdings in Bitcoin represents a significant development for the cryptocurrency and the financial sector in general.\n\nEven though there are risks associated with government holdings in Bitcoin, the potential benefits are significant.\n\nBy maintaining its holdings in BTC, the US government sends a signal to other investors and institutions that Bitcoin is a legitimate asset class and has long-term value.\n\nThis could help increase the adoption of Bitcoin by institutions and ultimately lead to greater public acceptance of the cryptocurrency.\n\nIt is worth noting that the US government is not alone in holding a significant amount of Bitcoin.\n\nOther countries, including China, Russia and Iran, are also reportedly holding Bitcoin to circumvent economic sanctions and access international markets.\n\nHowever, the US government’s Bitcoin holdings are particularly significant given the country’s status as a global economic superpower and the impact its decisions can have on the entire financial sector.\n\nIn conclusion, the US government’s decision to maintain its holdings in Bitcoin is a positive development for the cryptocurrency and the financial sector in general.\n\nWhile there are risks associated with governments holding Bitcoin, the potential benefits are significant.\n\nBy continuing to hold Bitcoin, the US government sends a signal to other investors and institutions that Bitcoin is a legitimate asset class and has long-term value.\n\nThis could help increase institutional adoption of Bitcoin and ultimately lead to greater mainstream acceptance of cryptocurrency.\n\nAs Bitcoin grows and evolves, US government holdings will undoubtedly play an important role in defining the future of cryptocurrency and its place in the global financial system."
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1iZWNvbWVzLXRoZS1iZXN0LXBlcmZvcm1pbmctYXNzZXQtY2xhc3MtaW4tcTEtMjAyMy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 31 Mar 2023 07:00:00 GMT",
        "title": "Bitcoin becomes the best-performing asset class in Q1, 2023 - Finbold - Finance in Bold",
        "content": "Bitcoin’s (BTC) 2023 momentum as part of attempting to exit last year’s crypto winter has resulted in the digital asset outperforming other investment products, despite a gloomy economic outlook.\n\nIn particular, Bitcoin has emerged as the top-performing asset class in Q1 2023, with gains of about 70%, making it the digital currency’s best quarter since Q1 2021, according to Bloomberg data on March 31,\n\nIt’s worth noting that during the first quarter of 2021, Bitcoin gained about 103% at the onset of the last bull run. The asset’s latest quarterly returns have placed the digital currency ahead of big names such as the S&P 500 (5.5%), Nasdaq 100 (19%), and iShares Core U.S. Aggregate Bond ETF (2.2%).\n\nBitcoin performance against other asset classes. Source: Bloomberg\n\nElsewhere, Bitcoin has also dwarfed gold, with the precious metal recording gains of 9.5% in the first three months of 2023, while silver’s returns stand at 0.3%, as per data obtained by Finbold on March 31.\n\nInvestors flocking to Bitcoin\n\nAmid the quarterly gains, investors appear to be flocking to Bitcoin and Ethereum (ETH), as witnessed by the open interest spiking almost 430% YoY as of March 31. Bitcoin’s ability to lead the market in gains has also revived optimism, with almost 1,000 new coins entering the space in 2023 alone.\n\nMarket experts, however, believe that Bitcoin’s performance should not come as a surprise, noting that the asset began building the foundation for a possible rally in late 2022.\n\n“It’s not at all a surprise. <…> All the signs were pointing to a strong price floor starting last November, and it was just a matter of time before either the liquidity narrative changed (which it did in early January) or longer-term investors saw a store-of-value opportunity (which seems to have also happened),” said Noelle Acheson, author of cryptocurrency book the Crypto Is Macro Now.\n\nBitcoin’s gains have also coincided with the renewed possibility of further interest rate hikes as the Federal Reserve moves to tame skyrocketing inflation. The cryptocurrency has also capitalized on the chaos in the banking sector as investors view the asset as an alternative to centralized monetary systems following the collapse of Silvergate Capital, Signature Bank, and Silicon Valley Bank.\n\nIn this line, Bitcoin’s resilience can be attributed to its legitimate fundamental improvements and its unique role as a bearer asset in a time of skepticism about bank deposits and increased central bank bailouts.\n\nPart of the impact of the banking crisis was highlighted by a Finbold report on March 21 that indicated that five leading U.S. banks lost a cumulative market capitalization of $108.92 billion in 2023 alone, while Bitcoin added about $219.86 billion.\n\nBitcoin price analysis\n\nAfter days of rallying, Bitcoin faces resistance at the $30,000 position, trading at $27,928 with daily losses of about 2.5%.\n\nBitcoin seven-day price chart. Source: Finbold\n\nBitcoin now controls a market cap of about $540 billion after an inflow of over $200 billion in 2023."
    }
]