[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vbGliZXJ0eXN0cmVldGVjb25vbWljcy5uZXd5b3JrZmVkLm9yZy8yMDIzLzAyL2lzLXRoZXJlLWEtYml0Y29pbi1tYWNyby1kaXNjb25uZWN0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Is There a Bitcoin–Macro Disconnect? - Liberty Street Economics - Liberty Street Economics -",
        "content": "Gianluca Benigno and Carlo Rosa\n\nCryptocurrencies’ market capitalization has grown rapidly in recent years. This blog post analyzes the role of macro factors as possible drivers of cryptocurrency prices. We take a high-frequency perspective, and we focus on Bitcoin since its market capitalization dwarfs that of all other cryptocurrencies combined. The key finding is that, unlike other asset classes, Bitcoin has not responded significantly to U.S. macro and monetary policy news. This disconnect is puzzling, as unexpected changes in discount rates should, in principle, affect the price of Bitcoin.\n\nBackground\n\nPrior to its recent decline, the market value of cryptocurrencies reached a staggering $2.5 trillion, with Bitcoin crossing the $1 trillion mark. In addition, Bitcoin represents the lion’s share—between 50 percent (nowadays) and 90 percent (in 2016)—of the overall capitalization of the digital currency market.\n\nMarket Capitalization of Bitcoin and Other Cryptocurrencies\n\nSource: Authors’ calculations.\n\nNotes: The chart plots the market capitalizations of Bitcoin and twenty-two other cryptocurrencies (Aave, BinanceCoin, Cardano, ChainLink, Cosmos, CyrptocomCoin, Dogecoin, EOS, Ethereum, Iota, Litecoin, Monero, NEM, Polkadot, Solana, Stellar, Tether, Tron, Uniswap, USDCoin, WrappedBitcoin, and XRP). Market capitalization is calculated by multiplying the total number of coins in circulation by their price.\n\nGiven their growing relevance, it is natural to study the drivers of cryptocurrency prices. This blog post focuses on macroeconomic news and monetary policy surprises. We interpret cryptocurrencies as assets whose current price should depend on the expected discounted value of future values. This characterization implies that, from a macroeconomic point of view, developments that influence current and future interest rates, whether directly (news about monetary policy) or indirectly (news about macroeconomic conditions), should affect the value of cryptocurrencies.\n\nWe use a novel and comprehensive intraday data set to identify the effects of this news. By relying on high-frequency data in a short enough window around a macro announcement, the data release is (most likely) the only information systematically hitting the market. Hence, by looking at the response of asset prices in that time window around various announcements, this blog post conducts the empirical finance version of a natural experiment.\n\nAs an example, the chart below shows the response of several U.S. asset prices around two types of news releases: news about the real economy, such as the Bureau of Labor Statistics’ Employment Situation report (left panel), and news about monetary policy, specifically the FOMC meeting (right panel). The June 2016 labor market report contained a lower-than-expected nonfarm payrolls figure, as compared to the Bloomberg consensus. Consequently, the dollar immediately depreciated against the euro by about 1 percent, stock prices declined by about 0.5 percent, and gold prices increased by 2 percent. Bitcoin, on the other hand, moved sideways. At the June 2021 Fed meeting, the FOMC signaled that interest rates needed to rise sooner and faster than market participants had anticipated. Again, the dollar, gold, and stock prices immediately responded to the release, but Bitcoin did not respond in a systematic manner.\n\nResponse of U.S. Asset Prices to Macroeconomic and Monetary Policy News\n\nSource: Authors’ calculations.\n\nNotes: Responses are normalized at zero at the time of the news release. The horizontal axis displays the hours before/after the release. EUR/USD refers to the euro/dollar exchange rate, defined as the amount of U.S. dollars needed to buy one euro.\n\nAnalysis and Results\n\nWe systematically analyze the response of the EUR/USD exchange rate, gold, the S&P 500, and Bitcoin to ten sets of macro announcements that have been singled out as important in the academic literature. In studying the responses of selected asset prices to macroeconomic and monetary policy news, we focus on the 2000-2022 period for all assets except Bitcoin, for which we chose a restricted (more meaningful) sample starting from 2017. (For more details on the analysis, see our related Staff Report on the topic.) We collect different pieces of macro news, covering the real economy and inflation, as well as monetary policy surprises. For monetary policy news, we consider three distinct dimensions. The first indicator, Target, captures unanticipated changes in the current federal funds rate target. The second indicator, Path, captures unanticipated changes in the future path of policy. The third indicator, LSAP, captures unanticipated announcements of future large‐scale asset purchases.\n\nOur priors are based on a simple asset pricing model for Bitcoin. We model Bitcoin as an asset with no intrinsic value whose current value depends on the discounted value of its future price (for our beloved wonks, a “stochastic bubble”). We also accommodate the possibility of the asset having no value with a probability that depends positively on current and future interest rates. Since monetary policy news affects both current and future interest rates, it should be associated with Bitcoin valuation, while macroeconomic news has an indirect impact through the monetary policy reaction function.\n\nBy relying on the regressions’ estimates, we can test to what extent the response of an asset price to a given macroeconomic announcement is systematic. The table below reports the relationship between assets (columns) and selected macroeconomic and monetary news (rows). The shading indicates whether the response is systematic, with darker colors corresponding to more statistically significant effects. The symbol inside each cell indicates the sign of the correlation between asset returns and news. We find that the EUR/USD exchange rate, gold, and the S&P 500 significantly react to most macro and monetary news. In stark contrast, the response of Bitcoin is muted, and never significant at the 1 percent level even when we focus on just monetary policy news.\n\nComparing Asset Price Responses to News Events\n\nConclusions\n\nSo… is macroeconomic news driving Bitcoin? In this post, we conduct a systematic analysis of the impact of macroeconomic and monetary policy news on Bitcoin’s price. In contrast to exchange rates and stocks, Bitcoin is largely unresponsive to macro news. More puzzling is the result that Bitcoin does not also react to monetary policy surprises. At face value, our study casts some doubts on the role of discount rates in pricing Bitcoin. Given the short sample used in the analysis, the jury is still out on this one, and more evidence is needed to put the case to rest.\n\nHow to cite this post:\n\nGianluca Benigno and Carlo Rosa, “Is There a Bitcoin–Macro Disconnect?,” Federal Reserve Bank of New York Liberty Street Economics, February 8, 2023, https://libertystreeteconomics.newyorkfed.org/2023/02/is-there-a-bitcoin-macro-disconnect/.\n\nDisclaimer\n\nThe views expressed in this post are those of the author(s) and do not necessarily reflect the position of the Federal Reserve Bank of New York or the Federal Reserve System. Any errors or omissions are the responsibility of the author(s)."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzA4L2NyeXB0by1sb25nLXNob3J0LWJpdGNvaW5zLWdvbGRlbi1jcm9zcy1leHBsYWluZWQv0gFjaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMDgvY3J5cHRvLWxvbmctc2hvcnQtYml0Y29pbnMtZ29sZGVuLWNyb3NzLWV4cGxhaW5lZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin's 'Golden Cross' Explained - CoinDesk",
        "content": "Inflation expectations (as derived from Treasurys including inflation-linked TIPS) are coming down from their 2021-2022 peak, but are still above the average levels seen following the 2008 financial crisis. This is great news, but it should be taken with a grain of salt as the Fed itself holds a sizable portion of the TIPS market (estimated at 25% in 2022, according to Jim Bianco), which may distort the signal sent by this indicator. Add in the unexpectedly strong jobs report last Friday, mixed in with lingering concerns over the effectiveness of the Phillips Curve, and you’ve got conditions of substantial uncertainty that could force the Fed to wait and see before cutting rates to minimize the chance of a policy error."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vd3d3LmludmVzdG9wZWRpYS5jb20vdGVybXMvcC9wcm9vZi13b3JrLmFzcNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "What Is Proof of Work (PoW) in Blockchain? - Bitcoin - Investopedia",
        "content": "What Is Proof of Work (PoW)?\n\nProof of work (PoW) describes a consensus mechanism that requires a significant amount of computing effort from a network of devices. The concept was adapted digital tokens by Hal Finney in 2004 through the idea of \"reusable proof of work\" using the 160-bit secure hash algorithm 1 (SHA-1).\n\nFollowing its introduction in 2009, Bitcoin became the first widely adopted application of Finney's PoW idea (Finney was also the recipient of the first bitcoin transaction). Proof of work forms the basis of many other cryptocurrencies, allowing for secure consensus.\n\nKey Takeaways Proof of work (PoW) is a decentralized consensus mechanism that requires network members to expend effort in solving an encrypted hexadecimal number.\n\nProof of work is also called mining, in reference to receiving a reward for work done.\n\nProof of work allows for secure peer-to-peer transaction processing without needing a trusted third party.\n\nProof of work at scale requires vast amounts of energy, which only increases as more miners join the network.\n\nUnderstanding Proof of Work\n\nThis explanation will focus on proof of work as it functions in the Bitcoin network. Commonly called a cryptocurrency, Bitcoin is technically a token—a representation of ownership of value on the Bitcoin blockchain. The ownership of the token can be exchanged for something of equal value, much like how you hand someone a dollar for a candy bar—they now have the dollar and you have the candy bar.\n\nProof of Work Blockchains\n\nBlockchains are distributed ledgers that record all bitcoin transactions, similarly to how you would enter transactions in a spreadsheet. Each block is similar to a cell. Information such as transaction amounts, wallet addresses, time, and date are recorded and encrypted into a block header—a hexadecimal number created through the blockchain's hashing function.\n\nThe hash from each block is used in the block that follows it when its hash is created. This creates a ledger of chained blocks that cannot be altered because the information from every block is included in the newest block's hash.\n\nHashes\n\nWhen a block is closed, the hash must be verified before a new block can be opened. This is where proof of work comes in. The hash is a 64-digit encrypted hexadecimal number. With modern technology, a hash can be generated in milliseconds for a large amount of data. However, miners try to guess that hash, which takes a very long time in computing terms.\n\nMining is the process of validating transactions by solving the hash and receiving a reward.\n\nNonce\n\nThe hash includes a series of numbers called the nonce, short for \"number used once.\" When a miner—the program on a node that works to solve the hash—begins mining, it generates a hash from publicly available information using a nonce equal to zero.\n\nSolving the Hash\n\nIf the hash is lower than the current network target, the miner has successfully solved the hash. The network target is a mathematical result of a formula converted to a hexadecimal number that dictates the mining difficulty.\n\nIf the hash is greater than the target, the mining program adds a value of 1 to the nonce and generates a hash again. The entire network of miners tries to solve the hash this way. On the Bitcoin blockchain, the miner that solves the hash is given the current reward for the work done.\n\nProof of Work vs. Proof of Stake\n\nThe two most popular consensus mechanisms are proof of work and proof of stake. Bitcoin's top competitor Ethereum used proof of work on its blockchain until September 2022, when the highly-anticipated transition to proof of stake was made. Here are some of the key differences between the two.\n\nProof of Work Validation is done by a network of miners\n\nBitcoin paid as a reward and for transaction fees\n\nCompetitive nature uses lots of energy and computational power Proof of Stake Validation is done by participants who offer ether as collateral\n\nEther is paid for transaction fees only\n\nLess computational power and energy used\n\nSpecial Considerations\n\nMining is a competitive process, so it has become a race between those with the most computational power. So, miners join pools to increase their chances of receiving a reward because it takes an enormous amount of computing work to be competitive.\n\nOn Feb. 9, 2023, the mining pool FoundryUSA accounted for nearly 32% of the Bitcoin network's three-day hashrate—the number of hashes a network can perform per second. FoundryUSA hashed 89.81 exa hashes per second (EH/s)—the pool generated nearly 90 quintillion (90 x 1018) hashes per second.\n\nSingle or individual PoW miners are not able to compete with pools for rewards.\n\nProof of work is also known for its energy consumption. The University of Cambridge tracks the Bitcoin network energy demand and uses a \"best guess estimate\" to determine its usage. The network uses as much energy as some small countries; however, it's important to note that industrial data networks and data centers use far more energy than the Bitcoin network.\n\nProof of work is also a much slower validation method than other mechanisms. For example, more transactions are taking place than the Bitcoin network can handle. Transactions are stored in a mempool waiting for validation, with average confirmation times between Jan. 1 and Feb. 9, 2023, ranged from seven to 91 minutes (confirmation is when your transaction is confirmed). Bitcoin keeps its block times at an average of 10 minutes—compare this with block times on the Ethereum PoS network, which have averaged 12 seconds since September 2022.\n\nExample of Proof of Work\n\nProof of work requires a computer to randomly engage in hashing functions until it arrives at an output with the correct minimum amount of leading zeroes. For example, the hash for block #775,771, mined on Feb. 9, 2023, is:\n\n00000000000000000003aa2696b1b7248db53a5a7f72d1fd98916c761e954354\n\nThe block reward for that successful hash was 6.25 BTC and 0.1360 BTC in fees.\n\nThe nonce was 2,881,347,934, there were 1,519 transactions in the block, and the total value of the block was 1,665.9645 BTC. Remembering that a hash is generated and the nonce starts at zero, this block was hashed by a miner 2.8 billion times before reaching a number less than the target.\n\nWhat Does Proof of Work Mean? PoW requires nodes on a network to provide evidence that they have expended computational power (i.e., work) to achieve consensus in a decentralized manner and to prevent bad actors from overtaking the network.\n\nWhy Do Cryptocurrencies Need Proof of Work? Because they are decentralized and peer-to-peer by design, blockchains such as cryptocurrency networks require some way of achieving both consensus and security. Proof of work is one method that makes it too resource-intensive to overtake the network. Other proof mechanisms also exist that are less resource-intensive. Without a proof mechanism, the network and the data stored within it would be vulnerable to attack or theft.\n\nDoes Bitcoin Use Proof of Work? Yes. It uses a PoW algorithm based on the SHA-256 hashing function to validate and confirm transactions and issue new bitcoins.\n\nThe Bottom Line\n\nProof of work is a consensus mechanism used by many cryptocurrencies to validate transactions on their blockchains and award tokens for participating in the network. Proof of work is a competitive process that uses publicly available transaction information to attempt to generate a hexadecimal number less than the network target for that mining period. Under PoW consensus, thousands of mining programs work on one block until the hash is solved, then move to the next block.\n\nInvesting in cryptocurrencies and other Initial Coin Offerings (“ICOs”) is highly risky and speculative, and this article is not a recommendation by Investopedia or the writer to invest in cryptocurrencies or other ICOs. Since each individual's situation is unique, a qualified professional should always be consulted before making any financial decisions. Investopedia makes no representations or warranties as to the accuracy or timeliness of the information contained herein. As of the date this article was written, the author does not own cryptocurrency."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vbW9uZXkuY29tL2JpdGNvaW4tZG93bi1zdXBlci1ib3dsLWNyeXB0by1hZHMv0gE-aHR0cHM6Ly9tb25leS5jb20vYml0Y29pbi1kb3duLXN1cGVyLWJvd2wtY3J5cHRvLWFkcy8_YW1wPXRydWU?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Here's How Much Bitcoin Is Down Since Crypto Firms Went All in on Super Bowl Ads Last Year - Money",
        "content": "A year ago, the crypto industry was in a much better place. Bitcoin was trading above $42,000, and crypto exchanges made a splash during the Super Bowl with ads that earned the event the “crypto bowl” moniker.\n\nBut if Coinbase's memorable floating QR code ad got you to buy some cryptocurrency or Coinbase stock after the game, your investment has likely lost significant value.\n\nA broad crypto crash began around April 2022, and even after some rebounding to the start off this year, bitcoin and ether are still down massively since last year's Super Bowl when the Rams claimed the title over the Bengals.\n\nThat’s part of the reason why you won’t see any national ads from crypto companies during this year’s matchup between the Chiefs and Eagles, a Fox executive told Sports Business Journal, noting that several crypto ad deals for the game fell through after the collapse of FTX in November.\n\nThat included a 60-second spot FTX had booked, which would’ve made Sam Bankman-Fried’s now-bankrupt company a repeat advertiser after they featured Larry David in a 2022 ad.\n\nCrypto’s fall since last year's Super Bowl ads\n\nBitcoin and ether prices are both down by nearly 50% from their levels a year ago going into the Super Bowl.\n\nThe price of bitcoin is about $23,000, down 48% in the past year. The recent trend has been positive, however. Bitcoin is up 38% so far this year. (Bear in mind that bitcoin was down more than 75% in November 2022 from its all-time high one year prior, when the price reached $68,790.)\n\nThe price of ether, the native token of the Ethereum blockchain network, is about $1,650, down 47% from a year ago. The coin has also had a strong start to 2023 and is up 35%.\n\nCoinbase, the largest crypto exchange in the U.S., will not advertise during the 2023 Super Bowl, which is not really surprising given that the company has laid off thousands of employees since the summer. Coinbase stock has surged so far in 2023, just about doubling year to date, but its share price is still 65% lower than a year ago.\n\nBottom line\n\nThe \"crypto bowl\" of 2022 was followed by a horrible stretch for major tokens and exchanges. Crypto has been rallying recently, but the lack of ads during this game on Sunday will be a reminder of how much the industry has fallen.\n\nMore from Money:\n\n6 Best Crypto Exchanges of February 2023\n\n8 Best Crypto Wallets of February 2023\n\nBitcoin Is Up Nearly 30% This Year — Here’s What to Know About the Enormous Rally"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vd3d3LndpcmVkLmNvbS9zdG9yeS9nYWRnZXQtbGFiLXBvZGNhc3QtNTg1L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Cryptocurrency's Myth of Anonymity - WIRED",
        "content": "Michael Calore: Wow. Well, let's take a quick break and we'll be right back.\n\n[Break]\n\nMichael Calore: The crypto market has been pretty wild lately. There's all the recent drama with Sam Bankman-Fried and the collapse of the FTX Exchange. There's the cratered market around NFTs, the rapid devaluation and erratic behavior of many of the currencies. Andy, have these recent instabilities in the cryptocurrency market at all slowed down the use of it on the dark web or in other illicit markets?\n\nAndy Greenberg: I don't think that they have, for the most part. The one big crime that has kind of slowed down because of the fall in the value of cryptocurrency is scamming, because scammers depend on people believing that their cryptocurrency is going to keep going up in value. But on the dark web, cryptocurrency is really just a means of transaction, and it doesn't really matter so much what it's worth. In fact, the fact that bitcoin appreciated massively from the time when I was buying marijuana on the Silk Road in 2013 really now just means that I spent tens or hundreds of thousands of dollars worth of bitcoins on a few grams of pot, which is unfortunate when you think about it. But the dark web is not the only place where these crimes that are now traced by the tracers who are the central detectives in my book are taking place. There are also just straight-up thefts that are a huge part of the dark side of the crypto world. When FTX collapsed, in the midst of that collapse, which was like a traditional finance story in a way—an over-leveraged bank or something, or a Lehman Brothers or maybe like a Theranos story. But there's also a straight-up crime story here, where about half a billion dollars of FTX's funds were actually just stolen in the midst of its bankruptcy, and we don't know by whom still. The bizarre thing about the blockchain is that all of these tracers can watch this theft happen in real time. We can see these hundreds of millions of dollars worth of cryptocurrency taken out of FTX and then moved around. They seem to be packaged to try to launder them. But because it's all so transparent and traceable, it's going to be very difficult for whoever took that money to cash it out or spend it or get away with this crime in a way where they won't be identified. So we'll probably soon know if the person who did that was some sort of inside embezzler or external hackers who were trying to take advantage of the chaos of FTX's meltdown.\n\nLauren Goode: Do you see a mainstream future for some of the more privacy-focused coins, like monero—am I saying that correctly, monero?—or will they be kept at arm's length by legitimate financial institutions?\n\nAndy Greenberg: It's really interesting to watch. I mean, monero is one that is being adopted. Monero, for the people who maybe haven't heard of it, it's not the most popular cryptocurrency by any means, but it is designed to be much less traceable than bitcoin and to tangle up its blockchain and obfuscate the amounts and make it hard to see who is sending money to whom. And monero is being adopted by dark web markets. One of the big stories in this book is the hunt for and the takedown of the kingpin of AlphaBay, which was this dark web market that became 10 times the size of the Silk Road. Now, years after AlphaBay was taken down, it actually reappeared in 2021, and now only accepts monero, which is a sign of the cat-and-mouse game, as Mike put it, that is occurring and the ways that people are starting to wise up to the traceability of bitcoin at least. But we see that cat-and-mouse game continuing because it does actually seem like sometimes monero, much to the surprise of all of these people using it, can sometimes be traced. monero people hate it when I point this out. In this big case that happened about a year ago where these two New Yorkers were arrested and accused of money laundering … You probably heard of this case because the woman in this couple had posted these terrible, super cringey rap videos on YouTube. $3.6 billion was seized from this couple, the biggest seizure of money of any kind in US criminal history. They had actually transferred some of that money into monero. Yet, you can see in court documents that the IRS criminal investigators, who were the central detectives in that case, continued to follow it and to identify them as the ones holding it. There's actually even leaked Chainalysis documents that appeared on the dark web that show that Chainalysis says to its law enforcement customers that it can trace monero in the majority of cases. So even when people, even now, believe that they're using a privacy coin, something that's less traceable, they're often still going to be surprised, I think, by how clever the tracers have become, how hard it is to use cryptocurrency anonymously. But I feel like I have to also mention that there is a newer cryptocurrency, zcash, that does seem to be truly untraceable, that uses these new, almost magical-seeming cryptography tricks called zero-knowledge proofs to basically fully encrypt its blockchain, so that there is no information for blockchain analysis or tracing of any kind. That may be finally the untraceable cryptocurrency that people believed bitcoin was. Yeah, as you say, Lauren, it's going to be really interesting to see if zcash is more adopted, and if it is, if it becomes this popular tool for crime or what people once called crypto-anarchy, carving out a space where you can't collect taxes, you can do any black market transaction you want, will that lead to some sort of regulatory backlash where regulators try to ban zcash or prevent exchanges from letting you buy and sell it?"
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5pbnN0aXR1dGlvbmFsaW52ZXN0b3IuY29tL2FydGljbGUvMmJzdHF2cmR0YTRpZG5wODNjNnBzL3BvcnRmb2xpby9jcnlwdG8taXMtYmVjb21pbmctbW9yZS1jb3JyZWxhdGVkLXRvLXN0b2Nrcy1hbmQtaXRzLXlvdXItZmF1bHTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Crypto Is Becoming More Correlated to Stocks — And It's Your Fault - Institutional Investor",
        "content": "Digital assets are losing their hedging benefit just as more institutional investors enter the crypto world. In fact, allocators may be the cause.\n\nThe correlation between the price of cryptocurrencies and the stock market has increased over time, according to a recent research study from Georgetown University. The study also found that crypto assets followed the market’s lead even more closely during periods of high market volatility, such as the Covid pandemic and Russia’s invasion of Ukraine.\n\nMany individual investors, market watchers, and entrepreneurs have argued that crypto assets are a safe haven given their scarcity and independence from national governments. In recent years, however, cryptocurrencies have been moving in lockstep with stocks and some critics have raised questions about whether the asset class can continue to serve as “digital gold” that protects investors during times of crises. The new study provides additional evidence that debunks the diversification benefit of crypto assets.\n\nThe paper’s authors based their findings on a analysis of the correlation between the S&P 500 and the two biggest cryptocurrencies — Bitcoin and Ether — between January 2016 and July 2022. They found that the correlation — which measures the degree to which two financial securities or instruments move together — between Bitcoin and the index was 0.08 between January 2016 and January 2021. But the correlation between the two increased to 0.33 between February 2021 and July 2022, a period of relatively high volatility. The correlation between Ether and the S&P 500 also rose from 0.04 between 2016 and 2021 to 0.38 during the latter period. A correlation of 1 indicates the two instruments move together.\n\n“The recent increase in the correlation coefficient between the crypto asset market and the S&P 500 may reflect the increased participation of institutional investors,” according to the paper.\n\nBitcoin and Ether have moved even more closely in line with the market when markets are rough — exactly the time when investors need assets to behave differently. When the coronavirus shut down global economies in March 2020, Bitcoin and Ether recorded a correlation with the S&P 500 of 0.47 and 0.5, respectively. At the time, gold only had a 0.04 correlation with the index. From February 2022 to July 2022, as the conflict between Russia and Ukraine escalated, Bitcoin and Ether had correlations of 0.58 and 0.59 with the market, while gold had a correlation of -0.12.\n\nThe authors also compared cryptocurrencies with gold during periods of high market volatility and high policy risk. When the VIX index — a popular measure of market volatility — rose above 25, Bitcoin and Ether had a correlation with the S&P 500 of 0.43 and 0.41, respectively, while gold had a near-zero correlation with the market. The same pattern is also reflected during periods when the U.S. Economic Policy Uncertainty Index rose above 300.\n\n“Gold’s propensity as a hedging asset appears to be stronger during stressed periods, such as crypto winter, the Covid-19 shock, and during higher VIX periods,” the authors concluded. “On the other hand, correlations between Bitcoin/Ether and the S&P500 are positive and significant during these periods. This implies that Bitcoin has become neither ‘digital gold’ nor a ‘safe-haven asset’ in times of crisis. Bitcoin may have rather acted as a risk-magnifying factor.”"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzAyLzA4L2ludmVzdGVkLWluLWJpdGNvaW4taW4tMjAxNy15b3VkLW5vdy1oYXZlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "If You Invested $1,000 in Bitcoin in 2017, Here's How Much You'd Have Now - The Motley Fool",
        "content": "At the start of 2017, Bitcoin (BTC 1.53%) had been through some dark days as an asset. The cryptocurrency's value peaked over $1,000 in late 2013 but dropped to between $200 and $400 for most of the next four years.\n\nBut it recovered and hit $998.62 at the start of 2017, meaning that an investor who bought $1,000 worth would have bought slightly more than an entire Bitcoin. Today, that initial $1,000 investment would be worth $22,800. The big question for investors now is whether Bitcoin can make those same returns again over the next six years.\n\nBitcoin's return to prominence\n\nFirst, let's recall how exactly Bitcoin got to where it is today. The original crypto has certainly benefited as more money has flowed into cryptocurrency and digital assets. The initial coin offering (ICO) craze of 2017 - during which hundreds of new tokens were sold to the public, even if the utility of some tokens was questionable - brought more awareness to Bitcoin. But while many of the coins launched during that period suffered from severe price dips afterward, Bitcoin made it out largely unscathed.\n\nThe pandemic brought investors more money through stimulus funds and low interest rates, driving many to chase higher-risk assets like Bitcoin. That all led to a huge Bitcoin price spike in 2021. But the coin dropped steeply in 2022 as interest rates rose and investors sold off high-risk assets.\n\nIn June 2022, pandemic-era inflation peaked. Meanwhile, by the end of June 2022, Bitcoin had fallen to just over $20,000 -- down more than 70% from the all-time high of $67,617.02 it hit in November 2021. As a result, the argument that Bitcoin might be used as an inflationary hedge fell apart.\n\nUS Inflation Rate data by YCharts\n\nThe competition is stronger than ever\n\nThe inflation issue isn't Bitcoin's only problem, though. Competition in the cryptocurrency sphere is looking increasingly fierce. More and more tokens, exchanges, and technologies are improving upon the original Bitcoin idea and striving to make even more efficient forms of digital money. Ethereum (ETH -0.88%), for instance, was the first major blockchain to introduce smart contracts, which has made crypto intelligent in a way that Bitcoin hasn't yet done at scale.\n\nSolana (SOL 9.74%) took that to the next level, introducing a blockchain that can complete thousands of transactions per second for a fraction of a second each. If, like me, you think that new innovations and businesses will be built on top of the blockchain, then speed, cost, and capability are key elements of the technology.\n\nThe harsh reality is that Bitcoin is falling behind in these areas. If you're looking for a simple store of value in crypto, then there's an argument that Bitcoin might still be your best option for the time being. But I don't believe that Bitcoin's future is as bright as its past.\n\nWhat's the future of Bitcoin?\n\nI doubt the next six years will be as good as the past six years for Bitcoin. Competition is steeper than ever, and more innovation is happening on other blockchains. Plus, that Bitcoin hasn't been able to keep up as an inflationary hedge has really been a blow to the digital asset. When high prices rile the traditional market, Bitcoin's trading pattern seems to follow growth stocks and other risky assets instead of acting as a true hedge against inflation.\n\nSecurity and performance are an issue, too. A very small number of miners control half of the mining capacity for Bitcoin, and, when the price fell recently, they came under financial stress. Even publicly traded Bitcoin miners have seen their stocks and financial strength weaken dramatically. Since Bitcoin is still a proof-of-work blockchain, it requires miners to validate transactions. A large number of miners are needed to keep the blockchain secure and to prevent Bitcoin from being controlled by a single, small group. As Bitcoin falls in price and it becomes less profitable to mine Bitcoin, that security will be under a growing amount of pressure.\n\nThe next few years may not be anywhere near as good for Bitcoin as competing blockchains improve and Bitcoin's provenance declines. Since the start of 2017, Bitcoin has been a huge winner. But that past performance doesn't look like it will be continuing to the same extent. Even if cryptocurrency is the future of finance or data storage, I doubt it will be Bitcoin that holds the biggest market share. Rather, I'd bet that title will go to the token's current competitors, such as Solana or Ethereum, that are continuing to innovate and drive the future."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMi8wOC9jcmFpZy13cmlnaHQtbG9zZXMtYml0Y29pbi1jb3B5cmlnaHQtY2xhaW0taW4tdWstY291cnQv0gFmaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzAyLzA4L2NyYWlnLXdyaWdodC1sb3Nlcy1iaXRjb2luLWNvcHlyaWdodC1jbGFpbS1pbi11ay1jb3VydC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Craig Wright Loses Bitcoin Copyright Claim in UK Court - CoinDesk",
        "content": "In a case heard in Oslo last year, multiple witnesses offered forensic evidence that documents supplied by Wright purporting to back up his claim to be Nakomoto contain discrepancies, such as fonts that weren’t available at the time."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzA5L2JpdGNvaW4tZHJvcHMtYmVsb3ctMjJrLWFzLWtyYWtlbi1hZ3JlZW1lbnQtdG8tY2xvc2UtY3J5cHRvLXN0YWtpbmctb3BlcmF0aW9ucy1zcG9va3MtaW52ZXN0b3JzL9IBkAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAyLzA5L2JpdGNvaW4tZHJvcHMtYmVsb3ctMjJrLWFzLWtyYWtlbi1hZ3JlZW1lbnQtdG8tY2xvc2UtY3J5cHRvLXN0YWtpbmctb3BlcmF0aW9ucy1zcG9va3MtaW52ZXN0b3JzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Drops Below $22K as Kraken Agreement to Close US Crypto Staking Operations Spooks Investors - CoinDesk",
        "content": "The Kraken news followed less than a day after Coinbase CEO Brian Armstrong tweeted his crypto exchange company had heard “rumors” the Securities and Exchange Commission (SEC) wanted” to get rid of crypto staking in the U.S. for retail customers. Armstrong’s tweet prompted a slow late Wednesday-early Thursday decline that sent BTC from its previous support just below $23,000 to about $22,500. A number of analysts have been concerned about this possible development."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzA5L2JpdGNvaW4tZXhjaGFuZ2UtbG9jYWxiaXRjb2lucy10by1jbG9zZS1jaXRpbmctbWFya2V0LWNvbmRpdGlvbnMv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMDkvYml0Y29pbi1leGNoYW5nZS1sb2NhbGJpdGNvaW5zLXRvLWNsb3NlLWNpdGluZy1tYXJrZXQtY29uZGl0aW9ucy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Exchange LocalBitcoins to Close, Citing Market Conditions - CoinDesk",
        "content": "When bitcoin was in its early stages, LocalBitcoins became a key marketplace that drove liquidity. It also spurred the lucrative arbitrage market as users could sell bitcoin at a spread above spot price and then buy the asset on centralized exchanges for cheaper."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzA5L2Nlby1vZi1iaXRjb2luLW1pbmVyLWFyZ28tc3RlcHMtZG93bi_SAVZodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8wOS9jZW8tb2YtYml0Y29pbi1taW5lci1hcmdvLXN0ZXBzLWRvd24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Argo Blockchain's CEO Resigns - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wMi8wOC9iaXRjb2luLWZpeGVzLXRoZS1hc3ltbWV0cnktb2YtaW5mb3JtYXRpb24tcHJvYmxlbS1pbi1tYXJrZXRzLWNvaW5kZXNrL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDIvMDgvYml0Y29pbi1maXhlcy10aGUtYXN5bW1ldHJ5LW9mLWluZm9ybWF0aW9uLXByb2JsZW0taW4tbWFya2V0cy1jb2luZGVzay9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin, Markets and the Symmetry of Information - CoinDesk",
        "content": "I don’t really see this catching on since the concept of “lemons” never made it over into the digital age anyway. In an age that generates and collects more information than we know what to do with, ironically markets today are hindered by information asymmetry as much as ever as much as ever. For the first time, we now have a technology that reliably embeds simple asset information in the asset itself. The subset of assets for which this simplicity is sufficient is small for now – but its impact is already being felt in market services being built today. And its evolution could end up shaping the structure and expectations of the market services of tomorrow."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8wOC9iaXRjb2luLWF0bS1vcGVyYXRvci1jb2luLWNsb3VkLWZpbGVzLWZvci1iYW5rcnVwdGN5LXdpdGgtbGlhYmlsaXRpZXMtb2YtMTAwbS01MDBtL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8wOC9iaXRjb2luLWF0bS1vcGVyYXRvci1jb2luLWNsb3VkLWZpbGVzLWZvci1iYW5rcnVwdGN5LXdpdGgtbGlhYmlsaXRpZXMtb2YtMTAwbS01MDBtL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin ATM Operator Coin Cloud Files for Bankruptcy With Liabilities of $100M-$500M - CoinDesk",
        "content": "The Las Vegas-based firm has assets of between $50 million and $100 million and as many as 10,000 creditors, according to a filing in the U.S. Bankruptcy Court for the District of Nevada dated Feb. 7."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDIvMDkvYml0Y29pbi1wdW5rcy1vcmRpbmFsLW5mdC1jb2xsZWN0aW9uLXNvYXJzLWluLXZhbHVlL9IBYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS93ZWIzLzIwMjMvMDIvMDkvYml0Y29pbi1wdW5rcy1vcmRpbmFsLW5mdC1jb2xsZWN0aW9uLXNvYXJzLWluLXZhbHVlL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Punks: Ordinal NFT Collection Soars in Value - CoinDesk",
        "content": "“In the long term, if demand for these inscriptions proves to be long lasting, there is a risk that these inscriptions could impact other Bitcoin use cases like payments via the Lightning Network due to distorting Bitcoin’s fee market away from its use as an open monetary protocol,” said Callahan."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDIvMDgvY3J5cHRvLW1hcmtldHMtYW5hbHlzaXMtZXRoZXItcHVsbHMtZXZlbi13aXRoLWJpdGNvaW4taW4teWVhci10by1kYXRlLXBlcmZvcm1hbmNlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: Bitcoin BTC Price, Ether ETH Price Surge Casting Dark Days of 2022 to the Past - CoinDesk",
        "content": "And investors may also want to watch the net position change for ETH. An increased amount of ether leaving centralized exchanges would signal that holders of the asset are less inclined to sell at the moment. As of Feb. 2, investors were sending more ETH to exchanges than removing it, but that has since changed."
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMDgvYml0Y29pbi1uZnRzLWV4cGxvZGUtaW4tcG9wdWxhcml0eS1hcy1iaXRtZXgtcmVzZWFyY2gtc2hvd3MtMTMwMDAtb3JkaW5hbHMv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wMi8wOC9iaXRjb2luLW5mdHMtZXhwbG9kZS1pbi1wb3B1bGFyaXR5LWFzLWJpdG1leC1yZXNlYXJjaC1zaG93cy0xMzAwMC1vcmRpbmFscy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin NFTs Explode in Popularity as BitMEX Research Shows 13,000 Ordinals - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzA5L2JpdGNvaW4tbWluZXItY2xlYW5zcGFyay1wbGFucy10by1jb250aW51ZS1wdXJzdWluZy1hY3F1aXNpdGlvbnMtYW1pZC1iZWFyLW1hcmtldC_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMDkvYml0Y29pbi1taW5lci1jbGVhbnNwYXJrLXBsYW5zLXRvLWNvbnRpbnVlLXB1cnN1aW5nLWFjcXVpc2l0aW9ucy1hbWlkLWJlYXItbWFya2V0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Miner CleanSpark Plans to Continue Pursuing Acquisitions Amid Bear Market - CoinDesk",
        "content": "\"We don't feel compelled to go out and have to do M&A but obviously if we see a good deal we'll take advantage of that,\" said Chief Financial Officer Gary Vecchiarelli on his company's fiscal first-quarter earnings conference call on Thursday. He also thinks that if bitcoin's price doesn't get close to $40,000 heading into the next halving event, there will likely be a lot of smaller miners, particularly private companies that won't be able to access the capital markets, yielding potential opportunities for CleanSpark."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMDgvYml0Y29pbnMtbmV3Zm91bmQtbmZ0LWh5cGUtYXR0cmFjdHMtaW50ZXJlc3Qtb2YtYnN2LWRldmVsb3Blci10d2V0Y2gv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3RlY2gvMjAyMy8wMi8wOC9iaXRjb2lucy1uZXdmb3VuZC1uZnQtaHlwZS1hdHRyYWN0cy1pbnRlcmVzdC1vZi1ic3YtZGV2ZWxvcGVyLXR3ZXRjaC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin’s Newfound NFT Hype Attracts Interest of BSV Developer Twetch - CoinDesk",
        "content": "“I'm best friends with the Riot Blockchain guys and they're doing really well because they're so big, but anybody lesser is having a hard time right now,” said Petty. (Riot Blockchain is one of the largest public Bitcoin mining companies in the world.) So when they see the fees go up, what I predict is there'll be more miners that start to become pro-Ordinals, because they're [currently] not making a lot of money.”"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTA4L2NyeXB0by1tYXJrZXQtcmFsbHktaXMtYS1nb29kLXNpZ24tZm9yLTIwMjMtYml0Y29pbi1taW5lcnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Crypto Market Rally Is A Good Sign For 2023 Bitcoin Miners - Bloomberg",
        "content": "Listen to Bloomberg Crypto on the iHeartRadio App, Apple Podcasts or Spotify.\n\nCryptocurrencies, Bitcoin in particular, are having a strong start to 2023. That’s resulted in a couple of interesting consequences for some of the most important players in the market: Bitcoin miners.\n\n\n\nThis year has also seen a lot of significant weather events affecting the US, including recent winter storms in Texas that have left hundreds of thousands of people without power. Energy is one of the most important costs that Bitcoin miners must absorb -- they just can’t run all those machines in their data centers without electricity.\n\n\n\nRecently, we discussed the challenging conditions that Bitcoin miners in the US and around the world have been facing. On this episode we discuss how some miners have been able to adapt and take advantage of current market conditions to try to put themselves on slightly more stable financial footing. Bloomberg reporter David Pan follows Bitcoin mining and joins this episode."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTAyLTA5L2NyeXB0b2N1cnJlbmNpZXMtZmFsbC1hbWlkLWNvbmNlcm4tb3Zlci1yZWd1bGF0b3J5LWNyYWNrZG93btIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin’s 2023 Bounce Is Fizzling as SEC Turns Up Heat on Crypto - Bloomberg",
        "content": "Bitcoin’s new-year rebound has hit the buffers, hampered by a crypto crackdown in the US and fears that higher-for-longer interest rates will sap investor appetite for speculative assets.\n\nThe largest token’s 6% three-day retreat is the worst over such a time-span since December, while a gauge of the largest 100 digital assets is down 5%. Bitcoin hovered near $21,850 as of 6:25 a.m. Friday in London."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oYXBweS1iaXRjb2luLWFubml2ZXJzYXJ5LXRlc2xhLWVsb24tbXVzay1maXJtLXN0aWxsLWhvZGxzLTktN2stYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Happy Bitcoin anniversary, Tesla — Elon Musk firm still hodls 9.7K BTC - Cointelegraph",
        "content": "Bitcoin (BTC) held by Tesla is still worth 33% less than its 2021 purchase price, the latest data shows.\n\nTwo years to the day that Elon Musk’s firm added BTC to its balance sheet, most gains continue to evade the auto manufacturer.\n\nTesla and Bitcoin: From $1.5 billion to $225 million\n\nBitcoin and Tesla have proven an explosive combination since Musk announced that it would buy $1.5 billion in BTC.\n\nThe move in February 2021 came as BTC/USD was on its way to its first all-time high of the year, which it reached in April, topping out at $58,000.\n\nTesla’s purchase price was around $34,700 at the time, according to data from the tracking website Bitcoin Treasuries.\n\nAfter selling 10% of its holdings in March of that year, Tesla became a heavyweight hodler until a surprise move announced in July 2022 saw it divest 75% of its remaining coins.\n\nThat was done at a loss, as at the time, BTC/USD traded near $23,000. The sale occurred during Q2 2022 at around $29,000 per coin.\n\nTaking the hit appeared more appealing to Musk, who claimed that the rationale behind the sale was not a direct commentary on Bitcoin as an investment.\n\nSince then, Tesla has hodled 9,720 BTC, with subsequent price action still denying the company any investment gains. According to Bitcoin Treasuries, Tesla is still 33% down on its remaining stash as of February 2023, worth $225 million.\n\nTesla BTC holdings vs. USD value vs. BTC/USD vs. TSLA chart (screenshot). Source: Bitcoin Treasuries\n\nTSLA and BTC rise in tandem\n\nPreviously, Cointelegraph reported on the relationship between the Bitcoin spot price and Tesla stock, both seeing a broad resurgence at the start of 2023.\n\nRelated: Bitcoin gained 300% in year before last halving — Is 2023 different?\n\nAs of the Bitcoin purchase anniversary, TSLA is up 66% year-to-date, outpacing Bitcoin’s gains of just under 40%, data from Cointelegraph Markets Pro and TradingView confirms.\n\nBTC/USD vs. TSLA line chart. Source: TradingView\n\nThe rebound has failed to capture the imagination of mainstream media, however, which this month opted to highlight Tesla’s 2022 BTC net losses, which in U.S. dollar terms amounted to $140 million.\n\nMeanwhile, Musk has become arguably better known within the context of other cryptocurrencies, notably Dogecoin (DOGE), which he has given considerable publicity on social media and elsewhere since 2021.\n\nRecently, he revealed that payments would be coming to Twitter, which he purchased last year, and that these could, at some point include cryptocurrency.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LnJhY29udGV1ci5uZXQvdGVjaG5vbG9neS9wcm9zLWFuZC1jb25zLW9mLXRha2luZy1wYXltZW50cy1pbi1jcnlwdG9jdXJyZW5jedIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "The pros and cons of taking payments in cryptocurrency - Raconteur",
        "content": "The first documented purchase using bitcoin involved fast food. In 2010, Laszlo Hanyecz spent 10,000BTC on buying some takeaway pizzas from a fellow crypto enthusiast. The value of the transaction at the time was about £25. If he’d curbed the carbs and hung on to that money, he’d have been worth about £5bn at bitcoin’s peak.\n\nHanyecz later explained that he had “no regrets” about this – someone had to get things started.\n\nWhere is it possible to spend cryptocurrencies on consumer goods today? Starbucks takes crypto via the Bakkt app, while Home Depot accepts a range of coins via the Flexa checkout systems installed in its DIY stores. In fact, about 15,000 businesses worldwide accept bitcoin, according to research by jobsite Zippia.\n\nOther studies have indicated a strong pent-up desire among both merchants and consumers to shift to crypto. Based on polls conducted in December 2021, Deloitte’s Merchants Getting Ready for Crypto report suggested that 85% of organisations had placed a “high priority” on enabling crypto as a payment choice. The key reason for this? Customer demand. The surveys found that 64% of consumers had a significant interest in digital currencies, while 85% of merchants believed that crypto payments would be ubiquitous among suppliers within five years.\n\nThe cryptocurrency meltdown that has occurred since that research may have dented their confidence. Bitcoin has plummeted from £38,000 at the end of 2021 to about £14,000 as this report goes to press. Cryptos tend to move in sync and, sure enough, other prominent coins – including ethereum, solana and dogecoin (Elon Musk’s personal favourite) – have suffered similar crashes.\n\nSuch factors present some fundamental questions for any business that’s thinking about accepting cryptocurrencies. Apart from the practical matters of how to receive and process payments, are the reasons for doing so sufficiently compelling, given the risks posed by the terrifying volatility associated with crypto?\n\nThe benefits of taking crypto\n\nLet’s start with the advantages. “There are several pros for businesses,” according to Roman Matkovskyy, assistant professor of finance and accounting at the Rennes School of Business.\n\nThese include “faster processing times, particularly for payments from abroad; potentially higher transparency; and lower transaction fees”, he says. “There is no cost for direct crypto payments from a customer and a maximum transaction fee of 1% if these are routed through a tool such as Coingate or Bitpay. That compares with the standard fee of 2.9% plus 30¢ per transaction for most credit card processors.”\n\nStablecoins are much more suitable for merchants just gaining familiarity with crypto and digital wallets\n\nThe cost of sending crypto from one wallet to another depends on both the coin and the activity on the blockchain used. A fundamental mechanism of bitcoin and other cryptos is to reward participants for processing transactions. If activity on a blockchain increases, or there is a backlog of payments for processing, these rewards increase to incentivise more processing.\n\nBeing one of the early cryptocurrencies, bitcoin suffers from inefficiencies, so its transaction costs are relatively high. The same goes for ethereum, for which the ‘gas fees’, as these costs are known, tend to fluctuate between £12 and £35 (although they spiked above £500 for a spell in 2020). This makes only higher-value transactions justifiable. A substantial import order via ethereum, for instance, might save significantly on traditional payment methods.\n\nBut parallel technologies offer radical improvements. The Bitcoin Lightning Network enables the smallest tradable unit of a bitcoin – a satoshi, valued at 0.00000001BTC – to be sent. Up to 1 million transactions a second are possible on the network and the fee per transaction is less than 1¢.\n\n“The Bitcoin Lightning Network can theoretically replace existing payments for fiat transactions,” says Matkovskyy, who cites Solana Pay as another promising project with low fees.\n\nHow to avoid the rollercoaster\n\nVolatility is the problem that puts transaction fees in the shade. There’s no point in saving a percentage point on processing costs if the currency you’re trading in loses 10% of its value in a week.\n\nBut there is a way to avoid volatility altogether. Stablecoins are cryptos that are pegged to a traditional currency such as the dollar. They include tether, binance USD and dai. These enable their users to hold virtual dollars without their capital leaving the crypto universe.\n\n“Volatility can be removed completely from crypto payments for both seller and buyer,” says Jordan Bentley, product manager of crypto at FIS, a provider of payment tech to banks. “Customers are shown an exchange rate at the point of purchase, often locked in for 15 minutes, and merchants can choose to receive settlement in fiat, offering certainly regarding the amount.”\n\nBentley adds that the use of stablecoins can keep volatility at bay for the long term. “Stablecoins such as Circle’s USD coin, which is pegged at 1:1 with the dollar, also remove all volatility from crypto payments, enabling rapid settlements. They are therefore much more suitable for merchants that are just gaining familiarity with crypto and digital wallets,” he says.\n\nBut not everyone agrees that stablecoins are deserving of their name. For instance, the most popular stablecoin, tether, stands accused of lacking transparency. There are theories that it may not have the reserves it claims, which would make it vulnerable to a run if enough users were to cash out. Indeed, The New York Times recently published an article with the headline “Tether: the coin that could wreck crypto”.\n\nThe founder of dogecoin, Billy Markus, recently opined: “To anyone worrying about binance and / or tether collapsing, if either does it’s pretty much game over.”\n\nThe practicalities of crypto payment\n\nTo be able to accept crypto payments, you must choose a wallet or crypto banking service, such as Nexpay, BitPay or Worldpay.\n\nThe Geneva office of Saffery Champness, a provider of trustee services to asset managers, is planning to take crypto payments via Coinify. It will be able to accept 25 currencies, including bitcoin and ethereum.\n\n“We need to transact with crypto-native clients, but crypto is not core to our business,” says its director of marketing, Siobhan Moret. “Using a merchant service like Coinify is a good option for us. It’s quick to set up and inexpensive. It offers payment options in a wide variety of coins and converts almost immediately to Swiss francs. This offers us maximum flexibility at low pain.”\n\nOn top of the technical challenges of accepting crypto payments, there are compliance matters to consider. In the UK, the financial services and markets bill that’s progressing through Parliament should give the government new legal powers over certain crypto-related activities.\n\nSome fiat-to-crypto exchanges – for instance, Coinbase, Kraken and eToro – are regulated by the Financial Conduct Authority. But the watchdog did not approve the Bahamas-regulated FTX exchange, which imploded in November with the loss of an estimated £6.5bn in customers’ funds.\n\nYet, despite all the downsides associated with it, crypto will be the next big thing in B2B and B2C payments – if the claims of parties with an interest in its success are to be believed. A recent survey by Pymnts.com, a news website for the payments industry, for instance, has indicated that 23% of merchants are already accepting payments via crypto-native wallets.\n\nPeople are sceptical about crypto and the claims made by its proponents with good reason. Accepting payments in pounds, dollars and euros may not be sexy and the transaction fees are certainly steep. But the CEO of your high-street bank is unlikely to disappear with all your money in his suitcase.One of the oldest mottos of commerce is caveat emptor: let the buyer beware. For any entity thinking about taking crypto payments, perhaps it should be a case of caveat venditor: let the seller beware."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wMi0wOS9iaXRjb2luLWhhcy1oaXQtdGhlLWJvdHRvbS1vc3ByZXktZnVuZHMtY2VvLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Has Hit the Bottom: Osprey Funds CEO - Bloomberg",
        "content": "00:00\n\nIf we first could just talk about this kind of price action conversation we were just having with gold on it. How sustainable do you think the rally we have seen in 2023 actually is? We think we've hit the bottom. You know, I wouldn't be surprised to see a little bit of churn as it goes. As the year progresses, people are looking at the macro environment. Obviously, though, Donna mentioned a number of things, the Fed probably being being paramount. But I think you also suggested that things sold off so much that that really that's just a big part of it. I think, yes, you know, those of us who have been involved in crypto for a long time are kind of getting used to this. And, you know, there's been some research put out, but every downdraft is sort of slightly less than the previous one. So if that's the case this time, then we've bottomed out. But I don't think it's a straight line up from here. I do think the optimism translates into perhaps climbing the wall of worry, which is a good thing. We can handle that. That's OK. Sometimes a slower move up is better. Hey, Greg, I mean, clearly, you're also looking to make moves of your own in the industry. You're one of the players here that want to take over the sponsorship of the grayscale Bitcoin Trust. I'm curious as to why you want to do this and B, this proposal of reducing the fees associated with that trust, the conversations you might be having on the sides with other investors. Look at a high level 2022 was not good for crypto. All right, everyone focuses on the price action. But really, I think we lost a lot of trust in the from the investing public. You know, people blew up. There may have been illegal activities. You know, we've all been watching this drama unfold. And so towards the end of the year, we just felt we needed to to do something. And there's a lot of investor angst in our particular sector around the secondary market prices and things like that. So we're taking steps that we think will help to at least address what we can, which is taking care of our bitcoin investors trying to do the right thing first things responsibly and and manage the funds as best we can in a volatile market. You know, we take a different view from other players in the market as to what's possible or what requires seek exemptions and things like that. And so, you know, our goal is to just let our actions speak louder than our words and really execute in what we think is the best interest of investors. Speaking of trading, on one hand, you have that Navy Roy coming in. People have been boarding, buying into the grayscale Bitcoin trust, given how much it had sold off. But one of the big sellers, according to the Financial Times, was D.C. Gee, apparently selling shares of the grayscale, by contrast. What do you make of that as a market participant? As a market participant, I mean, look, I think that's very tricky territory. We don't own our operators and hold positions and it's on it's own fund or have a parent company type in situation where there's a lot of crosscurrents. So I can't really speak to the specifics of that. I don't I don't even know if that's necessarily true or not. You know, I follow along, but I don't have direct knowledge of the situation. I think just generally what investors are looking for is, hey, you know, a lot of bad stuff has gone on this year. We're trying to sift through where the people to the institutions that we can trust, you know, what's real and what's not really crypto. And I think that those of us who come from a transient background really understand investor mindsets, whereas there's a lot of kind of techie mindset in crypto moving fast and breaking things. And unfortunately, I think a lot of that got washed out in 2022. I mean, it's unfortunate in one sense, but it's also the thing that needed to happen. And so we're still seeing some of that, you know, topple into 2023. But I'm optimistic. I think this is a cleansing that's that was needed. I think that the industry will emerge stronger and will, you know, forge a path forward. Hopefully, Congress makes some kind of movement and get their act together to help provide some clarity, because we do think that's a major issue. Well, I'm glad you kind of brought up those regulatory issues, because that's another headwind that this industry has to contend with. On the subject of regulation, there is the issue of a spot ETF and obviously RTS the attempt to convert into an ETF, a fight, by the way, that they are still fighting. I know you filed a lawsuit last month essentially alleging that grayscale had misrepresented the likelihood of that ETF conversion actually happening. Can you just walk me through your argument there when you also are still trying to work with regulators and make that ETF happen? Isn't this a regulatory problem? Yeah, there's actually a lot of moving parts here. We do have a lawsuit that's out there. I have to point people to the materials themselves. I can't really comment on the particulars there, but I think taking a step back, you know, various investors have or various actors in the market have, I think, damaged the industry in various ways. Right. We're trying to do our best to rectify that in whatever way we can. Some actions out there impact on the ecosystem overall. Some impacted us directly and our clients directly. So we want to rectify that. And we're taking steps both with our own fun and, you know, in the industry to try and make sure that justice is served. OK. But if you could put a likelihood or probability around that spot, ETF actually one day coming to fruition being realized. What what would that probability look like? I mean, I wish I had a number for you because I like numbers, but, you know, based on our discussions with the FCC, know, I personally don't understand the hold ups at this point. I think they could easily see their way clear to rationally and logically. We need to. But I'm not sure that that's going to happen. And I'm not sure I understand all of the interests that go into making that decision to stay put. Right. It may not be as simple as just the big for ETF itself. I mean, I think there's broader considerations that involve the whole of crypto. I mean, you know, we're focused on this narrow piece and it'd be great to solve this problem. But, you know, Congress and the FCC, I mean, they're thinking about broader issues, whether it's stable fines or whether it's, you know, online lending programs. I mean, they have a lot of considerations. And so I don't I don't know what they are thinking with respect to how approving this thing over here might affect that thing over there. And so I think it's all tied together, unfortunately, because I do think that's a bit funny to would solve a lot of the issues that investors are facing. And it would have avoided a lot of the problems that came up when there was only mainly one instruments, trade and lots of arbitrage and lending and all kinds of things. So, you know, be great to fix this. I'm just not convinced it's happening anytime soon."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL21hcmMtYW5kcmVlc3Nlbi1ldGhlcmV1bS1hbmQtd2ViMy1sZWFkLWJpdGNvaW4tb24tdGVjaC1pbm5vdmF0aW9u0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Marc Andreessen: Ethereum and Web3 Lead Bitcoin on Tech Innovation - Blockworks",
        "content": "Marc Andreessen, best known for co-founding web browser Netscape and Silicon Valley venture capital fund a16z, is still invested in the crypto industry, even though his expectations around Bitcoin didn’t pan out.\n\nIn 2014, Andreessen predicted that the world would be talking about Bitcoin the same way they did about the internet. The tech investor may have now changed his mind somewhat, but is still heavy on the industry as a whole.\n\nHe told Reason Magazine in an interview published Wednesday that, back then, he thought Bitcoin was a tech innovation that would develop to support several other applications just like the internet, but that it “basically stopped evolving.” He now has his sights set on Ethereum being at the core of transformation.\n\n“What happened was a bunch of other projects emerged and took that place, and the big one right now is Ethereum. I would either say Ethereum instead of Bitcoin, or I would just say crypto or Web3 instead of Bitcoin,” he said.\n\nAccording to the early Facebook investor, Web3 has all the features of the internet that people knew they wanted to have when the internet was originally built.\n\n“[Web3] is all the aspects of basically being able to do business and be able to have money and be able to do transactions and have trust,” he said. “We did not know how to use the internet to do that in the 90s. And now, with this technological breakthrough of the blockchain, we now know how to do that, we have the technological foundation to be able to do that.”\n\nA16Z launched a $4.5 billion crypto fund in 2022, which was touted as the largest-ever crypto-venture fund. The firm’s flagship crypto fund, launched in 2018, lost 40% in the first half of 2022 as they faced a battering. The VC’s portfolio counts projects like Alchemy, Aptos, Avalanche, Chia, Compound, Coinbase, Lido, Mysten Labs and Yuga Labs.\n\nAndreessen didn’t touch upon the bear market that lasted most of 2022, but said the potential of the industry is “extraordinarily high” and that there are “tonnes of really smart entrepreneurs” pursuing various opportunities.\n\n“A lot of those things have worked, some of those things haven’t worked yet, but I think that they’re going to work,” he said.\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJ1bGxzLXN0dW1ibGUtYXQtMjMtNGstYXMtZmVkLXMtZGlzaW5mbGF0aW9uLXNwYXJrcy1idGMtcHJpY2UtcmFsbHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin bulls stumble at $23.4K as Fed's 'disinflation' sparks BTC price rally - Cointelegraph",
        "content": "Bitcoin (BTC) rebounded to key resistance on Feb. 8 as crypto markets got a boost from a familiar source.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nPowell: “Disinflationary process” is here\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD reaching the important $23,400 zone on Bitstamp overnight.\n\nThe pair reacted positively to the latest comments from the United States Federal Reserve, which also sent equities higher during the Feb. 7 Wall Street trading session.\n\nFed Chair Jerome Powell again mentioned “disinflation” during his appearance, reinforcing market hopes that interest rate hikes could cool more quickly in line with inflation. These stemmed from the latest meeting of the Federal Open Market Committee (FOMC) on Feb. 1, where the Fed raised rates by 0.25%.\n\n“The message that we were sending at the FOMC meeting last Wednesday was really that the disinflationary process — the process of getting inflation down — has begun, and it’s begun in the goods sector, which is about a quarter of our economy,” he said at The Economic Club of Washington, D.C.\n\nPowell nonetheless cautioned that there was “a long way to go” and that the U.S. was in “the very early stages of disinflation.”\n\nDespite this, risk assets rallied into the Wall Street close, with the S&P 500 and Nasdaq Composite Index finishing up 1.3% and 1.9%, respectively.\n\nBitcoin also erased previous weakness, having dropped below $22,700 earlier in the week, but bulls proved unable to tackle ask liquidity at $23,400 and beyond.\n\nThat liquidity remained in place on the day, as visible in data covering the Binance order book supplied by on-chain monitoring resource Material Indicators.\n\nBTC/USD order book data (Binance). Source: Material Indicators/ Twitter\n\n“Markets rallied into the close yesterday, with Bitcoin’s last H4 candle showing weakness at resistance & printing a shooting star,” popular trader Mark Cullen summarized about the latest events.\n\n“I personally am still waiting for the lows to get swept. BUT if the BTC can close a H$ above 23.4k I will look for a push higher.”\n\nCrucial area held for #Bitcoin, so we should be seeking for continuation.\n\n\n\nGameplan is simple;\n\n- Crack $23.3K and we'll see new highs, correction is over.\n\n\n\n- Lose $22.6K and I'll be seeking $21.5-21.7K for longs on #Bitcoin. pic.twitter.com/xJp6iSbeQb — Michaël van de Poppe (@CryptoMichNL) February 8, 2023\n\nMichaël van de Poppe, founder and CEO of trading firm Eight, was also encouraged by Bitcoin’s reaction. A flip of $23,300 to a more solid support, he told Twitter followers on the day, would mean that the latest BTC price correction “is over.”\n\nBTC/USD traded at around $23,200 at the time of writing, with traders still counting down to volatility returning.\n\nGolden cross vs. death cross to resolve in a “few days”\n\nLooking ahead, the rest of the week held little by way of important macroeconomic cues for crypto markets.\n\nRelated: Bitcoin takes ‘lion’s share’ as institutional inflows hit 7-month high\n\nAs Cointelegraph reported, eyes were already on next week’s inflation data, coming in the form of the Consumer Price Index (CPI) print for January.\n\nAt the same time, chart analysts hoped for a positive outcome from Bitcoin’s latest “golden cross” on the daily chart — its first since September 2021. At the same time, however, BTC/USD weekly timeframes continued to print a “death cross,” a phenomenon which often preceded further downside in the past.\n\n“Many say Death Cross/Golden Cross Lagging Indicator. It is Lagging for those who only think Golden Cross means Bullish, and Death Cross means Bearish. I use this indicator to understand Momentum,” fellow trader Jibon wrote in part of a dedicated Twitter thread on the topic on Feb. 7.\n\nJibon compared the current setup to previous instances in 2015 and 2019 and added that it would take a “few days” for the impact of the crosses to become more obvious.\n\nBTC/USD comparative charts. Source: Trader_J/ Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9vbmNoYWluLW1vbmtleS1uZnRzLWRvdWJsZS1wcmljZS0wMDAyMDU0MjMuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "OnChain Monkey NFTs Double in Price After Creators Put Them on Bitcoin - Yahoo Finance",
        "content": "Buzz around Bitcoin-based NFTs—via the recently-launched Ordinals protocol—keeps growing by the day, with record-setting mints on Thursday and high-value sales over the past day. And one established Ethereum NFT collection is reaping the benefits of going multi-chain, seeing its prices surge after revealing Bitcoin-based counterparts.\n\nOnChain Monkey, a collection of 10,000 Ethereum NFT profile pictures (PFPs) minted in 2021, used Ordinals to “inscribe” all of its existing artwork on Bitcoin over the past day. Now the NFT holders on Ethereum can also say that their respective collectibles live on Bitcoin, as well.\n\nPrices for the Ethereum NFTs have almost tripled since the announcement, with the floor price—that is, the cheapest listed NFT on a marketplace—for the project jumping from 0.79 ETH at the start of the day (per NFT Price Floor) to a peak of 1.75 ETH before settling to about 1.5 ETH (nearly $2,500) as of this writing.\n\nOnChainMonkey is the first 10K collection to be inscribed on Bitcoin via Ordinals! Own an ETH OCM Genesis = Owning a BTC OCM Genesis All on-chain on Bitcoin on Feb 8, 2023, and all on-chain on Ethereum on Sept 11, 2021! 🔥 🧵/8 pic.twitter.com/AMuUlERJZM — OnChainMonkey (@OnChainMonkey) February 9, 2023\n\nAccording to data from CryptoSlam, the move has fueled a 12,200% increase in NFT trading volume for the Ethereum project over the past 24 hours compared to the previous span. The analytics platform reports about $1.1 million in sales over the past day for a project with lifetime secondary sales totaling almost $39 million.\n\nMetagood, the startup behind OnChain Monkey, said it put all 10,000 NFTs onto Bitcoin via the Ordinals protocol using a single transaction, much as it did for the original Ethereum collection back in 2021.\n\nStory continues\n\nThe Hottest Bitcoin NFTs Right Now Are CryptoPunks Clones\n\nIn a Twitter Spaces today, Metagood co-founder Danny Yang said that enabling trading was the next step for the team but suggested that other tooling needs to be created around Ordinals to facilitate that feature. He also noted that Metagood plans to build a bridge between Ethereum and Bitcoin to let NFT holders switch between the two versions.\n\n“They are the same on both chains,” an OnChain Monkey Discord moderator wrote earlier today. “Buy on ETH and you will have access to the BTC version when the tools catch up.”\n\nThe project’s Discord server is filling up with users who claim to have purchased one of the Ethereum NFTs following the Bitcoin announcement and are asking for details on how it will work.\n\nOnChain Monkey is part of Metagood’s push to use Web3 initiatives to fund programs that benefit communities. These include efforts to fund coral restoration and provide aid to Ukraine amid the Russian invasion. Metagood, co-founded by venture capitalist Bill Tai alongside Yang and Amanda Terry, raised $5 million in December.\n\nMetagood says that it minted the first 10,000 NFT project on Ordinals—a claim that the creators of Bitcoin Punks, a clone of popular Ethereum project CryptoPunks, have also made.\n\nBitcoin Punks began inscribing its NFTs via Ordinals before OnChain Monkey, but opted to put each Punk as a separate inscription—a process that stretched from Wednesday into Thursday. OnChain Monkey, on the other hand, committed its entire collection to Ordinals via a single transaction late Wednesday.\n\nEditor's note: This article was updated after publication to clarify when OnChain Monkey and Bitcoin Punks were inscribed via Ordinals."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hcy1iaXRjb2luLW5lYXJzLTI1ay1xdWVzdGlvbnMtYWJvdXQtcmFsbHktcy1zdXN0YWluYWJpbGl0eS1yZW1haW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "As Bitcoin nears $25K, questions about rally's sustainability remain - Cointelegraph",
        "content": "It is no secret that the global economy has continued to weaken over the course of the past year. To this point, on Jan. 19, the United States government hit its “debt ceiling,” i.e. the total sum of money that the U.S. Treasury can borrow to fund its ongoing federal operations, leading to renewed concerns that more financial pain and the economic slowdown could be incoming.\n\nSimilarly, on the other side of the Atlantic, the United Kingdom has been struggling as well. This is made evident by the fact the number of company insolvencies registered in 2022 hit 22,109 — a 57% spike from the year prior and its highest rate since 2009. Not only that, the International Monetary Fund recently released a report suggesting that the United Kingdom would be the only G-7 nation to face a recession this year.\n\nHowever, amid all this devastation, the crypto market seems to have caught some wind in its sail over the past month. In January, the total capitalization of this sector surged from $828 billion to approximately $1.1 trillion, signaling a rise of nearly 32%. Focusing on Bitcoin (BTC) particularly, on Jan. 30, the cryptocurrency rose to $24,000 after seemingly having stagnated around the $16,500 range for the better half of November and December.\n\nIn fact, the asset’s share of the market’s total cap rose as high as 44.82% recently, its highest such level since June last year. As a quick remedy, this number usually rises so steeply only when investors start limiting their exposure to altcoins and pouring their capital back into BTC.\n\nIs $25,000 the next stop for Bitcoin?\n\nAfter successfully defending a price target of $22,500 since Jan. 20, Bitcoin is currently showcasing a 30-day profit ratio of around 40%. This spike has been mirrored by similar surges in the stock market, which rallied recently after China eased its COVID-19 restrictions after three long years of strict pandemic controls.\n\n30-day Bitcoin price chart. Source: CoinGecko\n\nFurthermore, as per data made available by financial services company Matrixport, American institutional investors currently account for 85% of all recent Bitcoin accrual activities, suggesting that mainstream players are not ready to give up on the digital asset market. Thus, to gain a better understanding of where the industry may be headed in the near term, Cointelegraph reached out to Timothy T. Shan, chief operating officer for Avalanche-based decentralized exchange Dexalot. In his view:\n\n“I think the recent rally in Bitcoin has been a positive surprise given all the negative news in the industry that is yet to be fully played out. That said, I don’t think this current rally is sustainable and users should expect more volatility.“\n\nOn a somewhat similar note, Frederic Fernandez, co-founder of DeFi trading application DEXTools, told Cointelegraph that the new year could be bullish for the crypto market if and only if the global economy is able to forge a recovery of sorts. This is because a large-scale trend reversal could boost the demand for alternative investments and increase liquidity in the market.\n\nRecent: Crypto exchanges tackle insider trading after recent convictions\n\n“The market could remain bearish if economic uncertainty increases as restrictive regulations may be imposed. However, if Bitcoin reaches $25,000, that could mean increased confidence and acceptance of cryptocurrencies leading to increased investment and widespread adoption,” he added.\n\nKey market indicators\n\nAccording to Luuk Strijers, chief commercial officer for Bitcoin and Ether (ETH) options exchange Deribit, the crypto market is slowly returning to greener pastures. To support this claim, he told Cointelegraph that the market is once again witnessing a “contango,” a situation where the futures price of an asset is higher than its spot price. In layman's terms, a contango is usually observed when the price of a particular asset is set to rise over time.\n\nHe said that BTC’s 25-Delta put skew has moved from over 30% to below zero, a bullish indicator. The above-stated metric allows analysts to forecast the price movements of an asset as well as estimate future fluctuations (volatility) based on certain predictive factors. “A drop in 1-Month Skew indicates the shorter-dated out-the-money calls are getting more expensive relative to the out-the-money puts, which is a bullish signal,“ Strijers noted.\n\nHe also highlighted that open interest in regard to Bitcoin and Ether options has been growing again, which is a positive sign specially when considering that a lot of this momentum was lost after last year’s large year-end expiry.\n\nBitcoin Options open interest data since February 2022. Source: Deribit\n\nNot only that, Strijers pointed out that the options market’s put-call ratio (PCR) reached a local bottom late last month, suggesting that investors may once again be warming up to the digital asset industry. PCR is an indicator that is commonly used to determine the mood surrounding the options market.\n\nMarket sentiment analyzed\n\nOver the last week of January alone, digital-asset investment products available in the market witnessed a cumulative capital inflow of $117 million, the largest such amount over the past 180-day stretch. Investors put funds largely into BTC-related offerings, which accounted for $116 million of the aforementioned figure.\n\nFurthermore, digital investment product volume has continued to surge, approaching the $1.3 billion mark on Jan 30, up 17% when compared to its year-to-date value. However, short-Bitcoin products registered monetary inflows worth $4.4 million, which is not a good sign for investor sentiment, as per Coishares’ researchers.\n\nMulti-asset investment vehicles saw money being drained from them for the third month running, with these outflows amounting to $6.4 million. According to Coinshares, this suggests that more investors are starting to move toward tried and tested crypto assets.\n\nLastly, the crypto fear and greed index, a tool that helps investors gauge crypto market movements and sentiment, currently stands at 60. This figure represents “greed,” i.e. people are looking to buy digital assets as they believe that more bullish traction may be coming in the near term\n\nWhat lies ahead for the market?\n\nFrom a macro perspective, Shan believes that the Federal Reserve is close to reaching its terminal rate goal — the neutral interest rate where prices are stable, and full employment is achieved — which currently stands slightly above 5%. In his view, the Fed will hold this figure for the duration of the year while also noting that any looming recession will be very mild, one that shouldn’t impact the crypto market too much.\n\nHe further noted that strict regulations will most likely be incoming shortly, which, if done correctly, could help the market immensely. “The industry could grow exponentially just because of good regulations as they will open the door to mass adoption over the next 10+ years,” Shan said.\n\nRecent: Scammers are targeting crypto users with new ‘zero value TransferFrom’ trick\n\nLastly, the hard selloff as well as the various instances of fraud, over-leverage, poor controls and governance over the past year, have been a good reset for the crypto economy, in his view. This is because they can help serve as lessons for the industry, allowing participants to act responsibly and allowing the industry to blossom sustainably.\n\nThus, as we head into a future driven by increasing economic uncertainty, it will be interesting to see how the landscape of the digital currency market continues to evolve, especially with Bitcoin and other major cryptos forging a minor comeback at the moment."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtbWV0cmljLXdoaWNoLWN1ZWQtYmlnZ2VzdC1iaXRjb2luLWJ1bGwtcnVucy1icmFrZXMtb3V0LWF0LTIza9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "BTC price metric that cued biggest Bitcoin bull runs breaks out at $23K - Cointelegraph",
        "content": "A little-known Bitcoin (BTC) price metric has just given a new bull run signal — and it has never been wrong.\n\nAs noted on Feb. 8 by Caleb Franzen, senior market analyst at Cubic Analytics, the Williams %R oscillator has left its bottom zone for the first time since May 2022.\n\nAnalyst: Oscillator crossover is a “great sign”\n\nBitcoin gaining 40% in January and continuing to hold higher levels has produced breakout signals across various on-chain indicators.\n\nSome analysts are cautious, opting to wait and see if the improved conditions last, but for Franzen, the data coming from the Williams %R oscillator is of particular interest.\n\nWilliams %R is a momentum oscillator that measures how near BTC/USD is to its recent highs or lows. Momentum oscillators are utilized to measure the strength of a price trend, and Bitcoin’s January performance has made it a prime test case.\n\n“Bitcoin’s 12-month Williams%R oscillator left the ‘oversold’ threshold as of January’s monthly close!” Franzen wrote in part of a dedicated Twitter thread.\n\n“Historically, leaving the lower-bound has signaled two things: 1. The cycle lows are in. 2. The bear market is over.”\n\nHe added that the phenomenon was a “great sign” while acknowledging that a bull run was not guaranteed.\n\nAn accompanying chart nonetheless showed the tight relationship between such Williams %R threshold crosses and subsequent long-term BTC price behavior.\n\nThe last, for example, came in April 2019, with BTC/USD then beginning its journey out of its bear market lows to ultimately hit all-time highs in November 2021.\n\nA “caveat,” meanwhile, comes in the form of varying timeframes for Williams %R. Franzen noted that only the 12-month iteration of the metric had flipped bullish, with the 18-month version remaining “oversold.”\n\n“If/when this crosses > oversold, it will add to the bull case,” he added.\n\nBTC/USD with Williams %R oscillator annotated chart. Source: Caleb Franzen/Twitter\n\nSigns of Bitcoin rebirth come thick and fast\n\nFranzen is far from alone in keeping the faith when it comes to current BTC price action.\n\nRelated: Happy Bitcoin anniversary, Tesla — Elon Musk firm still hodls 9.7K BTC\n\nOver the weekend, popular trader Credible Crypto described the status quo as “identical” to Bitcoin’s late-2020 breakout that saw it cross its prior all-time high from 2017.\n\nEncouraging signs have also come from macroeconomic sources, notably the United States Federal Reserve, as well as internal phenomena such as the long-awaited “golden cross” event on the daily chart.\n\nJanuary, meanwhile, saw a renewed influx of institutional cash into Bitcoin, which took the majority of resources as investors shied away from many altcoin products. Weekly inflows for the last week of the month were the highest in seven months.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAyLzA4L2FmZmlybS1zaHV0cy1kb3duLWNyeXB0by1idXNpbmVzcy_SAVNodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8wOC9hZmZpcm0tc2h1dHMtZG93bi1jcnlwdG8tYnVzaW5lc3MvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Payments Company Affirm Is Shutting Down Its Crypto Business - CoinDesk",
        "content": "Helene is a New York-based reporter covering Wall Street, the rise of the spot bitcoin ETFs and crypto exchanges. She is also the co-host of CoinDesk's Markets Daily show. Helene is a graduate of New York University's business and economic reporting program and has appeared on CBS News, YahooFinance and Nasdaq TradeTalks. She holds BTC and ETH."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvaG93LWluc2NyaXB0aW9ucy1pbXBhY3QtYml0Y29pbi1ibG9jay1zcGFjZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "How Inscriptions Impact Bitcoin Block Space - Nasdaq",
        "content": "A new use case for bitcoin is causing a stir because of its ability to include data directly on-chain. An analysis of inscriptions’ impact on block space.\n\nThe below is an excerpt from a recent edition of Bitcoin Magazine PRO, Bitcoin Magazine's premium markets newsletter. To be among the first to receive these insights and other on-chain bitcoin market analysis straight to your inbox, subscribe now.\n\nBitcoin Ordinals And Inscriptions\n\nA recent and somewhat contentious use of Bitcoin is an innovative application of the Taproot soft fork that was merged into the protocol in 2021. Ordinal Theory is a way of serializing each individual unit of bitcoin and labeling these specific satoshis “ordinals.” The creator of this numbering scheme, Casey Rodarmor, described it in his blog saying, “Satoshis are numbered in the order in which they’re mined, and transferred from transaction inputs to transaction outputs in first-in-first-out order.”\n\nBy serializing these individual satoshis and utilizing the Taproot upgrade, Bitcoin users can also include arbitrary data directly on the blockchain. While this was already possible with text using the OP_RETURN function, these new “inscriptions” can be anything from jpegs, short sound clips and even simple games.\n\nThere is growing debate in the development community about the implications of storing all this data directly on Bitcoin and what that means for users who want to run a full archival node. While this discussion is important, we want to dig into how inscriptions are currently impacting Bitcoin’s fee market and how it might look in the future.\n\nEfficient Use Of Block Space\n\nBy their nature, inscriptions are larger files and therefore take up more of the finite space in each Bitcoin block. The users that are creating inscriptions are required to pay the necessary fees in order to send their transactions, however, inscriptions are included in witness data which is given a slight fee discount thanks to the SegWit soft fork in 2017.\n\nOrdinals officially launched on January 21, 2023. Less than three weeks later, inscriptions are already taking up 50% of Bitcoin’s block space according to Pierre Rochard, vice president of research at Riot Platforms.\n\nBitcoin’s fee market is a constantly changing landscape. Fees rise when demand to transact on-chain is high and users want to get their transaction included in the next block. Inversely, the fee rate drops when demand is low and users don’t need their transactions confirmed in a timely manner.\n\nWhether or not these inscriptions should be considered an “acceptable” use of Bitcoin, the market will decide the appropriate fee pricing for those who wish to include this arbitrary data into each block. Should transaction fees rise enough, it’s likely that less important or smaller bitcoin transactions will be priced out of the market and move to Layer 2 protocols, such as Lightning. These additional layers were always the game-theoretical hypothesis of Bitcoin’s fee structure, even predicted by Hal Finney in 2010.\n\nHistorical Block Weight\n\nThis is not the first time that a significant number of transactions have filled the mempool. As noted, Bitcoin’s fee market is dynamic and the cycle of high fees create efficient uses of block space, create low fees, create inefficient use of block space, create high fees will repeat ad infinitum.\n\nShown below is mempool data and fee prices going back to the beginning of 2017. Blockspace tends to be at a premium during bull runs as many people are sending bitcoin back and forth from exchanges or cold storage or spending it at the relatively high exchange rate.\n\nZooming in on the past three months, it’s clear that there was a significant number of transactions happening in the second half of November as bitcoin flew off exchanges with users protecting themselves from any other potential contagion events.\n\nBeyond extreme cases, transaction fees have been low for long stretches of time and have led to questions about Bitcoin’s long-term security budget as the block subsidy dwindles and fees must become a larger percentage of bitcoin miners’ revenue. Again, the hypothesis from Bitcoin proponents is that demand for block space will increase over time as bitcoin gains adoption and scales, causing more usage to migrate to other layers built on top of the protocol.\n\nIn the last few weeks, the average block size has seen a massive spike.\n\nEven with this major increase in block size, fee market competition has yet to heat up. It’s likely that those who wish to send monetary transactions will increase their fees to get their transaction included more quickly or those who want to mint an inscription without having to wait will do the same. Either way, should fees increase, so will profitability for miners who would collect additional revenue in the block reward in the form of higher transaction fees.\n\nTransaction fees are still an insignificant percentage of the mining block reward, falling somewhere between 1% and 3%. Will fees begin to rise as more and more people attempt to use bitcoin for sending money and minting inscriptions?\n\nLike this content? Subscribe now to receive PRO articles directly in your inbox.\n\nRelevant Past Articles:\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3Lm5mdGN1bHR1cmUuY29tL2d1aWRlcy9vcmRpbmFscy1hcmUtYml0Y29pbi1uZnRzLWFuLW92ZXJ2aWV3LW9uLWluc2NyaXB0aW9ucy_SAV5odHRwczovL3d3dy5uZnRjdWx0dXJlLmNvbS9ndWlkZXMvb3JkaW5hbHMtYXJlLWJpdGNvaW4tbmZ0cy1hbi1vdmVydmlldy1vbi1pbnNjcmlwdGlvbnMvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Ordinals are Bitcoin NFTs an Overview on Inscriptions - NFT Culture",
        "content": "In February 2022, a proposal was sent to the Bitcoin dev mailing list to bring NFTs to the Bitcoin network. The idea is to assign each Satoshi (a unit of Bitcoin) an ordinal number, which would then be linked to extra information such as text, images, videos, and games. This would create digital artifacts, or NFTs, that can be stored on the Bitcoin blockchain.\n\n💡Key Takeaways on Ordinals and Inscriptions for BTC NFTs💡\n\nWhat is an Inscription? An Inscription is a type of digital asset stored on the Bitcoin blockchain that allows the creation and transfer of unique digital artifacts.\n\nIt is different from traditional tokens as it is stored in the OP_RETURN field of a Bitcoin transaction, which can store a small amount of data.\n\nInscriptions allow the creation of unique, non-fungible digital artifacts that can be used for various purposes such as art, collectibles, and more. How does this compare to NFTs on Ethereum? Inscriptions are different from NFTs on Ethereum in that they are stored fully on-chain, making them immutable and fully decentralized.\n\nNFTs on Ethereum, on the other hand, use token standards such as ERC721 or ERC1155 to create collections of tokens, each with a unique tokenID.\n\nAnother difference is that creating or transferring an NFT on Ethereum can result in high transaction costs, while the transaction fee for sending Inscriptions is relatively low due to transaction fee optimizations with Taproot on Bitcoin.\n\nA potential disadvantage of Inscriptions is that all content stored on the blockchain is permanent, including any illicit or unsavoury content. Where can I find Inscriptions? You can find all the ordinals by going here\n\nWhat if I want to make Ordinals and Inscriptions?\n\nRight now the easiest way we have found is a tool called Gamma. You can see the guide to create Gamma BTC NFTs here. Please do your own research and assume your own risk. This is a tedious but not complicated process. Good Luck.\n\nOrigin of Ordinals and Bitcoin NFTs\n\nThe proposal has received mixed reactions from the crypto community, with some considering it an exciting new use case for Bitcoin, while others believe that Bitcoin should remain as a system for digital cash and not be evolved into something else. There are also concerns about the potential increase in transaction fees and resource demands on nodes.\n\nThe process of creating an NFT starts with creating a Bitcoin transaction that stores the extra information, called an “Inscription,” in one of the output addresses. This data could be text, images, SCG, or HTML, and its size is only limited by the block size limit. Unlike traditional Bitcoin transactions that use an OP_RETURN to add extra data, the Ordinal approach stores the metadata within the transaction itself, making use of the 2021 segwit update that allows up to 3MB of witness data to be stored outside of the 1MB block limit.\n\nTo transfer an NFT, it is assigned an ordinal number based on the first-in-first-out algorithm and then transferred in a Bitcoin transaction. Not all Ordinals have Inscriptions assigned to them, so not every transaction may involve an NFT.\n\nThe proposal to bring NFTs to the Bitcoin network has sparked a debate in the crypto community, with some embracing the idea of digital artifacts on the Bitcoin blockchain and others concerned about the potential consequences. The technical process of creating and transferring NFTs involves creating a Bitcoin transaction with extra data, or an Inscription, and assigning an ordinal number to each Satoshi involved in the transaction.\n\nThats great so what are Inscriptions?\n\nIn the context of Bitcoin Ordinals, an Inscription is the metadata that is attached to a bitcoin (satoshi) in the form of extra data stored within a Bitcoin transaction. This extra data could be anything from text, images, sound files, HTML, or other digital assets, and the size of the Inscription is capped by the block size limit. The idea behind Inscriptions is to create non-fungible properties for bitcoin, allowing each satoshi to have its own unique digital artifact.\n\nThe Inscription data is stored within the raw transaction data and is created by creating a Bitcoin transaction that stores the extra data (the Inscription) in one of the output addresses. The Inscription is created through a two-phase process, with the first phase committing the taproot output to a script containing the Inscription content. This content is serialized within the transaction in a form known as an “envelope”. The second phase involves creating another transaction to reveal the Inscription information, where the output created by the commit transaction is spent, revealing the Inscription content on the blockchain.\n\nThe Ordinal number assigned to each satoshi is used to identify and link the Inscription to a specific bitcoin, allowing the digital artifact to be transferred along with the bitcoin in a transaction. Not all Ordinals have Inscriptions assigned to them, and it is up to the users to create and attach Inscriptions to their bitcoins as they see fit.\n\nTLDR: Inscriptions are a new concept in the world of Bitcoin that allow users to attach metadata and other digital assets to their bitcoins, creating unique digital artifacts. This opens up new opportunities for Bitcoin to be used in ways that go beyond its original purpose as a digital currency, and has the potential to bring new and exciting use cases to the world of cryptocurrency.\n\nHere is an example inscription and data\n\nSo how does this compare to ethereum NFTs?\n\nIn comparison to NFTs on Ethereum, the creation and use of Inscriptions on Bitcoin is a distinct approach. On Ethereum, NFTs are created using token standards such as ERC721 and ERC1155 and are given a unique token ID to identify them, in addition to the account for the collection’s smart contract. The complexity of NFTs can lead to high transaction costs to mint or transfer them on Ethereum. However, with the transaction fee optimization of Taproot on Bitcoin, the cost of sending Inscriptions is significantly lower.\n\nAnother difference between the two is that all Inscriptions are stored directly on the blockchain, making them immutable and fully decentralized. This differs from NFTs on Ethereum where there have been concerns about the removal of metadata if the centralized storage solution goes offline or if the project manipulates the metadata. Despite the benefits of immutability, this also means that any illegal or undesirable content in Inscriptions will remain on the chain forever. There have already been instances of obscene Inscriptions and it is only a matter of time before illegal imagery is added. Websites that help visualize Ordinal data can block these images, but they will still exist on the blockchain. It’s worth noting that this issue is not unique to Inscriptions and has been a problem with arbitrary data storage on blockchains since their inception.\n\nWell what about Stacks the BTC Layer 2 Solution?\n\nStacks Layer 2 NFTs and Inscriptions both relate to the creation and use of digital assets in a blockchain context. However, they have differences in terms of their underlying technology, the way they are created, and their features.\n\nStacks Layer 2 NFTs are built on the Stacks blockchain, which is a Layer 2 scaling solution for the Bitcoin blockchain. This allows for NFTs to be created and stored more efficiently and cost-effectively than on the Bitcoin blockchain. Stacks Layer 2 NFTs can be used for a wide range of applications, including digital collectibles, gaming items, and digital art.\n\nInscriptions, on the other hand, are digital assets that are stored directly on the Bitcoin blockchain. They use Bitcoin’s scripting language to encode information about the digital artifact, and each Inscription is given a unique token to reference it. Unlike NFTs on smart contract blockchains like Ethereum, Inscriptions are fully on-chain and therefore immutable and decentralized. However, this also means that their data cannot be edited or deleted, and any unsavory or illegal content that is stored as an Inscription will be on the blockchain forever.\n\nTLDR: Inscriptions are like curio cards\n\nWhere can I find a technical walkthrough?\n\nTara Annison has a great medium article that goes into more detail here"
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMijQFodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wMi8wOC9iaXRjb2luLW1pbmVyLWRpZ2lob3N0LWNvbXBsZXRlcy1jb250cm92ZXJzaWFsLXBvd2VyLXBsYW50LWFjcXVpc2l0aW9uLWRvdWJsaW5nLWVuZXJneS1jYXBhY2l0eS_SAZEBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDIvMDgvYml0Y29pbi1taW5lci1kaWdpaG9zdC1jb21wbGV0ZXMtY29udHJvdmVyc2lhbC1wb3dlci1wbGFudC1hY3F1aXNpdGlvbi1kb3VibGluZy1lbmVyZ3ktY2FwYWNpdHkvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Miner Digihost Completes Controversial Power Plant Acquisition, Doubling Energy Capacity - CoinDesk",
        "content": "Digihost \"believes that year round, the plant will continue to provide electrical power to the grid on demand in order to meet customers needs during extreme weather conditions and will also continue to run the plant as a peaker plant,\" according to the January statement. Peaker plants are turned on when demand for energy is high and are usually fossil fuel-powered."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vdGVjaGNydW5jaC5jb20vMjAyMy8wMi8wOC9iaXRjb2luLWhvbGRpbmctYWJvdmUtMjAwMDAtb2ZmZXJzLW1pbmVycy1ob3BlLWFzLW1hcmdpbnMtYmVjb21lLWhlYWx0aGllci_SAXFodHRwczovL3RlY2hjcnVuY2guY29tLzIwMjMvMDIvMDgvYml0Y29pbi1ob2xkaW5nLWFib3ZlLTIwMDAwLW9mZmVycy1taW5lcnMtaG9wZS1hcy1tYXJnaW5zLWJlY29tZS1oZWFsdGhpZXIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin holding above $20,000 offers miners hope as margins become healthier - TechCrunch",
        "content": "Bitcoin holding above $20,000 offers miners hope as margins become healthier The cryptocurrency is still down from a year ago, but experts see it as a market recovery\n\nLast year was tough for cryptocurrency markets as many prices plummeted. But bitcoin has had a strong rally so far this year, and some mining experts see this as an opportunity for the space to stage a comeback.\n\nWhen bitcoin prices dropped to $16,000 in late 2022, profits were getting squeezed, Andy Long, CEO of bitcoin mining-focused White Rock Management, told TechCrunch. However, things may be looking up: Bitcoin’s price has increased about 39% to around $23,000 year to date, according to CoinMarketCap data.\n\nThat means margins are expanding, said Christian Lopez, director of fintech investment banking and head of blockchain and digital assets at Cohen & Company Capital Markets.\n\nThe cryptocurrency is still down from around $44,100 on the year-ago date, but industry members see a silver lining. “If you said to someone this time last year, ‘How would you feel about $23,000 for bitcoin?’ They would be horrified,” Long said. “We have fairly short memories, so in a year’s time. we will look down the barrel, and we’ll be at or over an all-time high hopefully, and over $100,000 by the end of 2024.”\n\nGiven the bitcoin price increase, miners are breathing a collective sigh of relief, Christopher Bendiksen, Bitcoin research lead at CoinShares, told TechCrunch. “The price recovery has relieved the worst pressure from many miners, and margins are looking much healthier.”\n\nLast year was tough for bitcoin miners; talks of bankruptcy lingered around many players in the industry thanks to significant downturns from high energy prices and revenues dropping, which in turn tightened margins and increased profit losses. In December, bitcoin miner Argo Blockchain avoided bankruptcy after Galaxy Digital agreed to acquire its facility for $65 million, TechCrunch previously reported.\n\nCore Scientific, one of the largest publicly traded crypto mining firms in the U.S., filed for Chapter 11 protection in December. That came just months after Compute North, a bitcoin mining data firm, filed for Chapter 11 in September; it had raised $385 million in strategic funding just seven months prior.\n\nWhile there are signs of recovery, bitcoin miners often have a different cost basis, so not all are in the clear yet, Bendiksen said. “There is also quite a bit of debt coming due these days, so liquidity squeezes might still hit those with limited cash and large upcoming payments.”\n\nThe average bitcoin miners are using Bitmain’s S19 or S19 Pro bitcoin miners, Lopez said. The breakeven point with that equipment is anywhere from $16,000 to $18,000 at bitcoin prices, he added. “So at today’s prices, they’re profitable. Obviously not as profitable as when bitcoin is up to $50,000, but still profitable.”\n\nThere are also elements like energy prices that play into bitcoin miners’ situations. But the mild winter across the U.S. has helped keep charges low, Long noted.\n\nThe two biggest factors contributing to bitcoin miners’ recovery are energy prices and the price of bitcoin related to hash price, which is a combination of bitcoin price and its mining difficulty, Lopez said. “So if energy prices are up and bitcoin’s price is low, you’re squeezing margins.”\n\nBut now, the industry is seeing the opposite happening: “The price of bitcoin is coming up, and energy prices are actually going down, so you’re seeing an increase in margin,” Lopez said. “That’s about 80% to 90% of your economic value because the price of energy and electricity is such a big driver.”\n\nThe hash price is near an all-time low, while hashrates, which are the amount of numerical guesses mining machines generate in a second, are near all-time highs, according to data from Blockchain.com compiled by Woobull Charts.\n\nAs long as these bitcoin prices and energy levels are maintained, miners will stick around, Lopez said.\n\nIn general, bitcoin miners are becoming more sophisticated with their energy usage, Lopez added. “Before it was cowboys who didn’t care about the price of energy because it was irrelevant, but now there’s been stress in the past year and a half, and they realized they have to manage their energy and deploy strategies in regards to that.”\n\n“I’m sure there will still be volatility,” Long said. “It’s the only thing you can rely on, but I think there’s a lot of support behind the new baseline price level. If it goes down again, it won’t concern me, because the long term trend will be up.”\n\n“There’s some technical analysis that says the darkest periods for bitcoin are 12-18 months after the last halving, then you’ll see a rally leading up to the next bitcoin halving, which is sometime in April or May of 2024,” Lopez said.\n\nBitcoin halvings are events that happen almost every four years when the blockchain rewards for miners get cut, effectively reducing the supply of new bitcoins by 50%. Over time, the outcome of each halving will decline as the block rewards approach zero when the total 21 million bitcoins are mined (but that won’t be for a very long time, thanks to this mechanism).\n\nTypically during halving cycles, there’s a curve that happens around six months after halvings of all-time high peaks and then drawbacks, Long said. “There’s no guarantees, but I think the sheer economics and demand will be bullish in the long term.”\n\nAfter a cascade of unexpected events in 2022, “a lot of the fear is out,” Lopez said. “The last shoe to drop I think was [the] FTX [bankruptcy] and the follow-up from DCG and Genesis. I don’t think there’s anything else hidden, but there might be. If there’s more fraud or bad bets, you’ll see more volatility. As long as we have nothing else to uncover, it’ll probably trade sideways for a while, and you’ll see a run up into the next halving.”\n\nAll in all, “recovery is well underway,” Long said. “The bear market we just went through was long, but it’s time for the momentum to change. This doesn’t mean we won’t still have volatility, but I think we’ll continue to see a small march up.”"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL3dvcnRoL2ludmVzdG1lbnQvYml0Y29pbi1wcmljZS1vdmVyLTEtbWlsbGlvbi1pbi03LXllYXJzLWNlby1jYXRoaWUtd29vZC1iZWxpZXZlcy01OTI1MDAuaHRtbNIBfGh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL2FtcC93b3J0aC9pbnZlc3RtZW50L2JpdGNvaW4tcHJpY2Utb3Zlci0xLW1pbGxpb24taW4tNy15ZWFycy1jZW8tY2F0aGllLXdvb2QtYmVsaWV2ZXMtNTkyNTAwLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "A 6,000% Spike? Meet This US-Based CEO Who Believes Bitcoin Price Will Hit Nearly $1.5 Million By 2030 - Indiatimes.com",
        "content": "At a time when collapsed crypto exchange FTX's customers still don’t know if they’re going to get their money back or not and the crypto market is trying to recover from the horror year that 2022 was, one of cryptocurrency’s biggest optimists still says Bitcoin is primed for a massive comeback.\n\nUS-based ARK Investment Management and its CEO, Cathie Wood, have continued to buy crypto and shares of crypto companies even during the sector’s historic downturn over the past year. They are also betting on Bitcoin rising to new heights soon enough. All investors need is a little patience and faith.\n\nBitcoin To Hit Nearly $1.5 Million By 2030\n\narkinvest\n\nCathie Wood's company has forecasted Bitcoin to bounce back from its current lows to eventually be worth $1.48 million by 2030, a bullish scenario that would see Bitcoin’s value rising by more than 6,300% in just seven years, as per a Fortune report.\n\n\n\nEven as per the company's “bear case” scenario, Bitcoin’s value is expected to rise to a record $258,500 by 2030, and in the “base case” scenario, Bitcoin will grow to be worth $682,800.\n\nAlso Read: US Man Pays 10,000 Bitcoins For Pizza\n\n$500,000 By The Year 2026\n\nshutterstock\n\nBitcoin is currently trading at around $23,000, a far cry from its all-time high of nearly $70,000 achieved in November 2021. Those were good times for crypto bulls, when up to a quarter of holders were convinced that Bitcoin could exceed $100,000 in fewer than five years. Cathie Wood was exceptionally upbeat about Bitcoin’s chances, even predicting in 2021 that it could hit $500,000 by 2026 if institutional investors and investment banks began piling in.\n\n\n\nThat was also peak crypto, as it turns out. As inflation rose last year and enthusiasm for speculative assets including cryptocurrencies dwindled, the Crypto Winter began and coins tumbled in value.\n\nIn the 12 months after its November 2021 peak, the crypto sector lost over $2 trillion in value, with Bitcoin in particular down around 60% since then. And the entire crypto industry was rocked in November when FTX, one of the world’s largest crypto exchanges, collapsed and lost billions of dollars in customer funds.\n\nAlso Read: 5 Crypto Firms That Filed For Bankruptcy Besides FTX\n\nCathie Wood's Belief in Bitcoin\n\nindiatimes\n\nBut through it all, CEO Cathie Wood and her firm, ARK, have held onto their big Bitcoin bet. Even during the FTX implosion later last year, ARK research director Frank Downing said the firm’s conviction in Bitcoin’s underlying blockchain technology had \"only increased\" in the wake of the crash. In December, Wood tweeted that the Bitcoin blockchain \"didn’t skip a beat\" during the FTX debacle, which she took to signify the coin’s transparency and resilience during downtimes.\n\n\n\nOver the next 7 years, Cathie Wood's ARK expects bitcoin to become a “multitrillion-dollar market” because of its strong fundamentals, according to the new report, as the firm expects the crypto asset to outperform “every major asset class over longer time horizons.” The sector’s recent difficulties may even help restore trust in Bitcoin in the long term as exchange companies become more transparent with their finances to avoid a similar fate that befell FTX, ARK argued.\n\nEven institutional investors, including BlackRock and Fidelity, have not wavered on their commitment to Bitcoin despite the market downturn, the report also found, reinforcing the coin’s fundamentals.\n\n\n\nAlso Read: Why Goldman Sachs Is On The Hunt To Invest Millions In Crypto\n\nFor the latest and interesting financial news, keep reading Indiatimes Worth. Click here."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9hcnRodXItaGF5ZXMtYmV0cy1vbi1iaXRjb2luLWFsdGNvaW4tc3VyZ2UtaW4taDEtMjAyMy1hcy1oZS1idXlzLWJ0Y9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Arthur Hayes bets on Bitcoin, altcoin surge in H1 2023 as he buys BTC - Cointelegraph",
        "content": "Bitcoin (BTC), Ether (ETH) and even nascent altcoins are a solid “buy,” a previously risk-off investor says.\n\nIn a blog post released on Feb. 8, industry stalwart Arthur Hayes announced a u-turn on his current crypto investment plans.\n\nHayes changes tune on “risky assets”\n\nCurrent macroeconomic conditions stemming from the United States Federal Reserve previously made Arthur Hayes keen to avoid what he calls “risky assets.”\n\nAs inflation slows in tandem with the Fed’s rate hikes, multiple new storms are brewing in the U.S., and the Fed, Congress and the Treasury will steer the economy as they see fit, he says.\n\nThe problem is guessing how these events will play out over the course of the year. For Hayes, 2023 could well be split into two halves, with H1 being an ideal investment environment for crypto.\n\nThis runs contrary to a previous thesis from mid-January, in which the former BitMEX CEO said that he was staying on the sidelines for fear of a Fed-induced capitulation event hitting risk assets.\n\n“My concerns about this potential outcome, which I handicapped would most likely happen later in 2023, has led me to keep my spare capital in money market funds and short-dated U.S. Treasury bills,” he explained.\n\n“As such, the portion of my liquid capital that I intend to eventually use to purchase crypto is missing out on the current monster rally we’re seeing off of the local lows. Bitcoin has rallied close to 50% from the $16,000 lows we saw around the FTX fallout.”\n\nHayes continued that Bitcoin is likely far from done with its rebound despite 40% gains in January alone, comparing the risk asset environment to 2009 and the start of quantitative easing.\n\nS&P 500 (SPX) annotated chart (screenshot). Source: Arthur Hayes/ Medium\n\nThis year, the picture is complex — quantitative easing has given way to quantitative tightening, where liquidity is removed from the U.S. financial system at risk assets’ expense.\n\nHowever, H1 looks to be providing some relief, with some liquidity returning to avoid hitting the debt ceiling too soon. This could continue until Congress votes to raise the debt ceiling in the summer, which Hayes and others argue is inevitable.\n\nCash in the Treasury General Account (TGA) will be emptied to the amount of $500 billion, canceling the $100 billion monthly liquidity that the Fed is removing.\n\n“The TGA will be exhausted sometime in the middle of the year. Immediately following its exhaustion, there will be a political circus in the U.S. around raising the debt limit,” the blog post forecasts.\n\n“Given that the Western-led fiat financial system would collapse overnight if the US government decided to forgo raising the debt ceiling and instead defaulted on the assets that underpin said system, it’s safe to assume the debt ceiling will be raised.”\n\nU.S. federal debt trends chart (screenshot). Source: U.S. Treasury\n\nLooking out for macro “unwinding”\n\nIt is then that the tide will turn, and risk assets could become a thorn in the side of every investor once again.\n\nRelated: BTC price metric that cued biggest Bitcoin bull runs breaks out at $23K\n\nIt is all a matter of timing, Hayes believes. His plan is to move into U.S. dollar cash, from where a segue into select risk assets is possible. Top of the menu, it would appear, is Bitcoin.\n\n“I’ll deploy over the coming days. I wish my size actually mattered, but it doesn’t — so please don’t think that when this happens, it will have any discernible effect on the price of the orange coin,” he told readers.\n\nGoing forward, however, altcoins represent a major opportunity, the blog post explains in its conclusion, with these likewise conditioned by timing.\n\n“The key to shitcoining is understanding they go up and down in waves. First, the crypto reserve assets rally — that is, Bitcoin and Ether. The rally in these stalwarts eventually stalls, and then prices fall slightly,” Hayes wrote about crypto market cycles.\n\n“At the same time, the shitcoin complex stages an aggressive rally. Then shitcoins rediscover gravity, and interest shifts back to Bitcoin and Ether. And this stair-stepping process continues until the secular bull market ends.”\n\nYear-to-date, the total crypto market cap has gained around 34%, data from Cointelegraph Markets Pro and TradingView shows.\n\nTotal crypto market cap 1-day candle chart. Source: TradingView\n\nGuiding the process in 2023, then, is the “unwinding” of the brief window of more accommodative economic conditions currently revealing itself in the U.S.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWhpdHMtMi13ZWVrLWxvdy1hbWlkLXdhcm5pbmctMjItNWstbG9zcy1tZWFucy1mcmVzaC1kaXDSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin price hits 2-week low amid warning $22.5K loss means fresh dip - Cointelegraph",
        "content": "Bitcoin (BTC) stayed lower at the Feb. 9 Wall Street open as a sweep of local lows increased bets of a more serious comedown.\n\nBTC/USD 4-hour candle chart (Bitstamp). Source: TradingView\n\nTrader: “Something feels off” about BTC strength\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it traded around $22,700 on Bitstamp.\n\nThe pair had dipped to $22,378 earlier in the day, marking its lowest levels since Jan. 25 and a reinforcement of $22,400 as an important zone to watch.\n\n“We tapped the swing low at $22,500 followed by a bounce. I would look for the bears to escalate the drop once we lose that low,” popular trader Crypto Tony summarized in part of Twitter coverage.\n\nBTC/USD annotated chart. Source: Crypto Tony/Twitter\n\nFellow trader Crypto Chase likewise forecast that Bitcoin was “more likely to go lower if 22.3k is tagged.”\n\nIn an update to analysis from Feb. 8, fellow Twitter account TraderSZ showed Bitcoin dropping below $23,000, which he had warned would mean “moving hard lower.”\n\n“BTC - clean break below dashed line then I think we get moving hard lower. Expansion phase very soon,” he wrote at the time.\n\n“It’s still support for now, but idk something feels off. Im@happy to catch something above jan high if market rips higher. Gut feel says lower first.”\n\nBTC/USD annotated chart. Source: TraderSZ/Twitter\n\nUnited States equities were marginally higher at the open, while the U.S. Dollar Index (DXY) saw a comedown on the day, dropping back below the 103 mark.\n\n“The dollar looks washed,” trader and podcast host Scott Melker, known as “The Wolf Of All Streets,” reacted, arguing that DXY weakness could continue to serve risk assets.\n\n“Classic retest of strong support as resistance at 103.82. Also starting to look like a potential head and shoulders top. Lots of signals that this little bull run will continue.”\n\nU.S. Dollar Index (DXY) 1-day candle chart. Source: TradingView\n\nSellers cement $22,800 resistance\n\nThe day’s U.S. macroeconomic data, meanwhile, had little perceptible impact on crypto markets.\n\nRelated: Arthur Hayes bets on Bitcoin, altcoin surge in H1 2023 as he buys BTC\n\nThis came in the form of jobless claims, which, at 196,000, neared one-year highs and beat expectations by 6,000 — the “hot” result analysis argued was being hoped for by the Federal Reserve.\n\nWeaker employment data notionally bolsters the idea that restrictive economic conditions are working, and a reversal could thus be on the cards sooner.\n\n“Jobless claims 196k, but four-week average still trending toward historic lows,” CNBC host Carl Quintanilla additionally noted.\n\nThe week prior had seen blockbuster jobs data capture the lowest U.S. unemployment since the late 1960s.\n\nImmediately prior to the report being issued, the composition of the BTC/USD order book on Binance showed resistance strengthening at $22,800.\n\nBTC/USD order book data (Binance). Source: Material Indicators/Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMioAFodHRwczovL3d3dy53Z3J6LmNvbS9hcnRpY2xlL21vbmV5L2J1c2luZXNzL2JpdGNvaW4tbWluaW5nLWNvbXBhbnktY2xvc2luZy1pbi1vbi1wdXJjaGFzZS1vZi1ub3J0aC10b25hd2FuZGEtcG93ZXItcGxhbnQvNzEtNjQ5YTk3ZjUtMzhlNy00ODY4LTg5ZmQtY2MwYzMzYzBmYjEx0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin mining company closes in on purchase of North Tonawanda power plant - WGRZ.com",
        "content": "The 60-megawatt plant will power Digihost's mining operation, which has already been installed on an adjacent property.\n\nExample video title will go here for this video\n\nExample video title will go here for this video\n\nNORTH TONAWANDA, N.Y. — A cryptocurrency mining company is nearly ready to purchase a North Tonawanda power plant, despite a legal challenge from environmental groups.\n\nDigihost Technology Inc. of Toronto expects to close on the Fortistar natural gas plant on Erie Avenue by the end of the month, the company announced.\n\nThe purchase has been approved by the Federal Energy Regulatory Commission and the New York Public Service Commission. The Clean Air Coalition of Western New York and Sierra Club have filed a lawsuit challenging the PSC's decision."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vZGVjcnlwdC5jby8xMjA5NjkvaG90dGVzdC1iaXRjb2luLW5mdHMtcmlnaHQtbm93LWNyeXB0b3B1bmtzLWNsb25lc9IBUWh0dHBzOi8vZGVjcnlwdC5jby8xMjA5NjkvaG90dGVzdC1iaXRjb2luLW5mdHMtcmlnaHQtbm93LWNyeXB0b3B1bmtzLWNsb25lcz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "The Hottest Bitcoin NFTs Right Now Are CryptoPunks Clones - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin NFTs are the talk of the Web3 world right now, thanks to a new way to “mint” media and assets on the layer-1 blockchain through the Ordinals project. And, as with many past NFT network launches, cloned versions of Ethereum’s early and influential CryptoPunks are dominating the early buzz around Ordinals.\n\nCryptoPunks, created by Larva Labs in 2017, is a seminal NFT project that set the template for the modern profile picture (PFP) trend. The 10,000 Ethereum assets were initially released via a free mint, well before there was a thriving NFT market, but have gone on to generate almost $2.5 billion worth of trading volume in the years since.\n\nOrdinals just launched on the Bitcoin blockchain in late January, but there are already multiple CryptoPunks-inspired projects gaining steam on the platform.\n\nAD\n\nAD\n\nThe most prominent so far is Ordinal Punks, which spans 100-pixel avatars that have been “inscribed” on Bitcoin through the Ordinals project and can be traded. Unlike some Punks clones seen in the past, however, they're not direct clones of the original CryptoPunks collection.\n\nSome on Crypto Twitter believe that Ordinal Punks is based on a derivative Ethereum collection called Mutant Punks—in other words, a derivative of a derivative. However, a person connected to the project clarified to Decrypt that Ordinal Punks \"used an open-source algorithm and CC0 Punk sprite sheet to generate new Punks.\"\n\nOne Ordinal Punk sold for 9.5 BTC late Wednesday, or nearly $215,000. While that’s about double the entry-level price for a real CryptoPunk—about 64 ETH right now, or nearly $106,000—that particular Ordinal Punk is based on the very rare alien CryptoPunks, which have sold for as much as nearly $24 million worth of ETH in the past.\n\n12 years ago I was mining Bitcoin on a gaming PC in my parent's basement. Today, we just minted out the first 10k NFT collection on Bitcoin. Thanks to everyone, but most importantly the @cryptopunksnfts. ❤️@Bitcoin_Punks_ + https://t.co/3O4wIo0OYC pic.twitter.com/BV0a6KmrWj — Robert Clarke (@robertjfclarke) February 9, 2023\n\nAD\n\nAD\n\nIn another example, pseudonymous NFT collector and investor dingaling tweeted that he purchased a bundle of seven Ordinal Punks for 15.2 BTC on Wednesday—about $349,000 worth at the time.\n\nHowever, because Ordinals just launched and they function differently than typical NFTs on other platforms (like Ethereum and Solana), there isn’t much infrastructure to support buying and selling the assets once they’ve been described. In other words, there aren’t Bitcoin NFT marketplaces for Ordinals just yet.\n\nIn fact, such trades are currently taking place over the counter (OTC) directly between users or through escrow services, with asking prices and bids being tracked via online spreadsheets. It’s all being facilitated through Twitter and Discord as collectors vie for these Punk clones, as some expect these early Bitcoin “inscriptions” to prove more and more valuable over time.\n\nnew opensea competitor lookin sharp pic.twitter.com/pJH0fuRnYm — 113 ♖♖♖ (@0x113d) February 8, 2023\n\n“There's [a] real moment behind Ordinals and things are still very very early. There are opportunities everywhere,” dingaling tweeted. “Orderbooks are currently updated on shared spreadsheets and sales are only done via OTC/escrow. But there's lots of building being done behind the scenes.”\n\nHowever, the lack of infrastructure means that the current trading model is susceptible to scams, and some Crypto Twitter users have raised the alarm. One viral thread from pseudonymous NFT collector TheNorwegian called out various perceived issues with the collection, and asked whether it's the \"biggest NFT scam of all time.\"\n\nAnother notable Ordinals project is Bitcoin Punks, which puts replicas of all 10,000 original CryptoPunks on Bitcoin. It’s billed as the first 10,000-piece NFT project launched through Ordinals, and all of the assets have already been minted for free by collectors.\n\nIt’s not yet clear how much trading demand there is for the larger Bitcoin Punks collection at this point, however, and a moderator on the project’s official Discord server warned holders today to “be careful trading” before a code audit can be completed.\n\nAD\n\nAD\n\nOrdinals use has surged over the last few days, with data platform Dune showing over 17,000 mints on the platform already today—double yesterday’s total, continuing a trend that has exploded over the last week-plus. More than 39,000 assets have now been inscribed as Ordinals, including other knockoffs and a playable clone of the classic video game Doom.\n\nHowever, the project has proven controversial with some Bitcoin maximalists and enthusiasts, some of whom have argued that it’s a waste of network space or that it goes against Bitcoin’s original focus on financial assets. Bitcoin transaction fees have surged over the last week and a half since Ordinals started gaining steam.\n\nCryptoPunks clones are common on NFT protocols that have emerged after Ethereum, and you can find them all over the place—on Solana, Polygon, Cardano, Algorand, and even Stacks, a “layer 1.5” network built on top of Bitcoin.\n\nEditor's note: This article was updated after publication to clarify the origins of the Ordinal Punks designs."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1leGNoYW5nZS1sb2NhbGJpdGNvaW5zLXRvLXNodXQtZG93bi1jaXRpbmctbWFya2V0LWNvbmRpdGlvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Exchange LocalBitcoins To Shut Down, Citing Market Conditions - Nasdaq",
        "content": "According to an announcement on its website, the peer-to-peer Bitcoin platform will be shutting down before the end of February 2023.\n\nLocalBitcoins has announced that the exchange will be closed for service by the end of February. The long-time Bitcoin trading service was the first peer-to-peer (P2P) transaction platform for many Bitcoiners. Launched in June 2012, the exchange is one of the oldest entities in Bitcoin, establishing itself as a primary P2P player in its hey-day with over $100 million in weekly trading volume of peer-to-peer transactions.\n\n“Originally LocalBitcoins was established to Bring Bitcoin Everywhere and drive global financial inclusion,” the announcement reads. “We have honored that mission for over 10 years and we are proud of what we have achieved together with all of you, our loyal community.”\n\nThe announcement cites “challenges during the ongoing very cold crypto-winter” as reasoning for the shutdown. The exchange has informed customers that they should withdraw their funds from LocalBitcoins, as well as withdrawing their bitcoin from the LocalBitcoins wallet. It notes that customers will have 12 months to complete this process, although they encourage users to do so sooner.\n\nNotably, the shutdown has arrived just as P2P Bitcoin merchants and individual sellers have come under heavy scrutiny from U.S. regulatory authorities. While there is no mention of this in the announcement, it could be assumed that these recent actions have led to decreased volume on platforms like LocalBitcoins.\n\nDespite these pressures, alternatives such as RoboSats and Bisq still function for Bitcoiners seeking to acquire bitcoin via P2P transactions.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vYmxvZy5rcmFrZW4uY29tL2NyeXB0by1lZHVjYXRpb24vb3JkaW5hbHMtYS1jb21tb24tZ3JvdW5kLWZvci1ldGhlcmV1bS1hbmQtYml0Y29pbi1tYXhpbWFsaXN0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Ordinals: A common ground for Ethereum and Bitcoin maximalists? - Kraken Blog",
        "content": "Representing real-world assets on the Bitcoin blockchain is nothing new.\n\nOver a decade ago, projects like the Colored Coin protocol and Counterparty exchange proved Bitcoin could track items, not just units of currency, in a decentralized way.\n\nHowever, consensus issues prevented either project from gaining widespread adoption in the market. Ethereum quickly took over as the go-to platform for minting and deploying unique digital artifacts. This preference led to the rise of non-fungible tokens, or NFTs as they’re more commonly known today.\n\nBut, things appear to have come full circle as one Bitcoin developer looks to reinvent tokenized assets on the Bitcoin blockchain. Even the Ethereum community seems to be encouraging this new venture. The move suggests a potential unity between what many see as two of the cryptocurrency industry’s longest-standing rivals.\n\nWhat are Bitcoin Ordinals?\n\nBitcoin Ordinals use an open-source protocol that assigns unique identities to individual satoshis (sats). Named after Bitcoin’s creator(s), Satoshi Nakamoto, satoshis are the smallest units of bitcoin. Using the Ord software, the protocol adds data to these sats and allows software users to track them based on a system called ordinal numbers.\n\nAt a high level, this involves assigning a numerical value to each satoshi based on several factors. These factors include the time when that satoshi entered into circulation through mining as well as the specific block height where the satoshi appears.\n\nUsers can use software called Ord to track each satoshi. The system also inscribes them with content to create bitcoin-native digital artifacts.\n\nUsers can trade and transfer these uniquely-identified satoshis just like any normal bitcoin unit. But unlike Colored Coins or most Ethereum NFTs, the digital item itself is stored entirely on-chain — not elsewhere on the internet.\n\nThis functionality wouldn’t be possible on Bitcoin without implementing SegWit and Taproot — two soft fork upgrades that helped to increase Bitcoin’s block capacity.\n\nWho created Bitcoin Ordinals?\n\nBitcoin developer Casey Rodarmor launched the Ordinal protocol on January 21, 2023. Rodarmor set out to create a system for numbering satoshis that would give each a unique serial number. This unique identifier would then allow users to track each satoshi across the blockchain. He wanted to be able to accomplish this in a way that was entirely Bitcoin native, without using sidechains or separate tokens.\n\nRodarmor earned a degree in Computer Science from University of California, Berkeley. Most recently he worked as a software engineer for Agora, an open-source app that improves upon the Bitcoin Lightning Network.\n\nRodarmor’s idea isn’t the first time a numbering system has been proposed to assign unique identifiers to individual satoshis. In fact, a BitcoinTalk user by the name of jl2012 published an almost identical proposal for Ordinals in October 2012. At the time, another Bitcoin developer discredited the post as an “old idea.”\n\nRodarmor has since acknowledged jl2012’s work in the last section of a mailing list post announcing Ordinals.\n\nHow do Ordinals work?\n\nThe Ordinal protocol consists of two main parts:\n\nOrdinal theory : The method of numbering satoshis for tracking, transfer, and value assigning purposes.\n\nInscription: The process of using the Ord software to associate content with a satoshi based on the number the software assigns. The Ord software associates content with real satoshis, but does so according to a numbering scheme unique to the Ord software.\n\nOrdinal theory\n\nOrdinals offer a method for assigning a unique identifier value to each of the 2.1 quadrillion satoshis that will ever be created.\n\nThe numerical value assigned to each satoshi acts as a serial number. The system creates this serial number based on how that satoshi relates to different periodic events that happen on the Bitcoin blockchain, including:\n\nBlocks : Batches of transactions that are committed to the Bitcoin blockchain roughly every 10 minutes. Blocks are the most common event Ordinals use to derive their numerical value.\n\nDifficulty adjustment periods : After every 2,016 blocks (approximately every two weeks), the Bitcoin protocol adjusts its mining difficulty target based on the amount of computational power being used to maintain the network. We call this the hashrate.\n\nHalvings epochs : After every 210,000 blocks (approximately every four years), the system halves the amount of new bitcoin entering circulation. There have been three halvings since the launch of Bitcoin.\n\nCycles: After every six halvings, a difficulty adjustment and halving take place simultaneously, resulting in an event known as a conjunction. Because halvings only take place every four years, conjunctions only take place every 24 years. Conjunctions are the least common event that Ordinals track, and the time frame between conjunctions is called a cycle.\n\nOrdinals use these events to create a process for tracking the comparative rarity of satoshis. The Ordinal Theory Handbook breaks down how satoshis relate to each of these events using the following rarity levels:\n\nRarity level Condition Amount (in total BTC supply) Common Any sat that is not the first sat of its block 2,099,999,990,756,525 Uncommon The first sat of each block 6,929,999 Rare The first sat of each difficulty adjustment period 3,437 Epic The first sat of each halving epoch 32 Legendary The first sat of each cycle 5 Mythic The very first sat of the genesis block 1\n\nBy assigning a unique identifier to each satoshi, Ordinals open a way of making inherently fungible satoshis into non-fungible objects. This identifier makes them completely unique, just like NFTs.\n\nOrdinal inscription\n\nWe refer to the committing of a piece of content to a satoshi as “inscription.” This process is accomplished using Ord, and you can see inscriptions with the ordinals explorer.\n\nThe system identifies the content by its MIME type (whether it’s a JPEG, an MP3 file, HTML code, etc) and a byte string (the content itself). Inscriptions don’t necessarily have to represent a non-fungible token. Users can also create Bitcoin-based security tokens and other assets.\n\nOrdinal inscriptions are entirely on-chain and stored within the script of a taproot transaction. This process is different from many of the most prevalent NFT collections on the Ethereum blockchain. Usually, the Ethereum blockchain stores NFT media content off-chain, while keeping only a record of the NFT on the blockchain.\n\nOnly a select few NFT collections, the most prominent of which are CryptoPunks, store both the media and the NFT directly on-chain.\n\nThrough this inscription process, the blockchain stores content alongside a specific satoshi. The process turns the satoshi into a unique digital artifact that users can track, transfer, hold, buy, and sell.\n\nHow Bitcoin Ordinals (may) impact Ethereum NFTs\n\nThe Ordinals protocol has resurrected the vast potential of tokenizing assets on Bitcoin’s highly secure, decentralized blockchain. Not only that, it also serves as a means of permanently storing digital content directly on-chain — something rarely seen in the NFT space.\n\nThis innovation has already spurred the interest of existing Ethereum-based NFT creators, including Tom W, a co-founder of Cool Cats. On the official Ordinals Discord server, they commented, “Hey all, Im Tom, one of the co-founders of Cool Cats NFT. Here to experiment with some cool shit. https://twitter.com/coolcats.”\n\nWith renewed capabilities for launching existing popular collections on the Bitcoin blockchain, Ordinals may help to combat the long-standing problem of lost NFTs. These prevent external file storage issues and could open up potential new revenue streams for NFT creators.\n\nInterestingly, Ordinals are actually gaining traction. For example, Bitcoin Rocks from the Ethereum-based original collection have already sold for 0.2 BTC, while a blue check-verified Twitter user with the handle “businessman.eth” posted, “WOW!!! 0.42 BTC sale for an @OrdinalPunks #Bitcoin Ordinals are starting to gain steam.”\n\nWhile the true impact of Ordinals is still emerging, one thing is clear: maximalists from both Bitcoin and Ethereum camps are excited about the new opportunities these digital artifacts present.\n\nFollow blog.kraken.com and our Twitter account @KrakenFX for all the latest developments shaping the crypto industry.\n\nWant to see an Ordinal for yourself?\n\nClick here to see one of the latest Ordinals to be inscribed, brought to you by Kraken.\n\nThese materials are for general information purposes only and are not investment advice or a recommendation or solicitation to buy, sell, or hold any digital asset or to engage in any specific trading strategy. Some crypto products and markets are unregulated, and you may not be protected by government compensation and/or regulatory protection schemes. The unpredictable nature of the cryptoasset markets can lead to loss of funds. Tax may be payable on any return and/or on any increase in the value of your crypto assets and you should seek independent advice on your taxation position."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWF0bS1vcGVyYXRvci1jb2luLWNsb3VkLTE2MzkzNzAwMy5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin ATM Operator Coin Cloud Files for Bankruptcy With Liabilities of $100M-$500M - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nCoin Cloud, which operates more than 4,000 bitcoin ATMs across the U.S. and Brazil, has filed for bankruptcy protection with estimated liabilities of between $100 million and $500 million.\n\nThe Las Vegas-based firm has assets of between $50 million and $100 million and as many as 10,000 creditors, according to a filing in the U.S. Bankruptcy Court for the District of Nevada dated Feb. 7.\n\nThe company's largest creditor is Genesis Global Trading, which has an unsecured loan of just over $100 million. Genesis is a subsidiary of Digital Currency Group, which is also the parent company of CoinDesk. Genesis also discussed injecting equity into the ATM operator, Bloomberg reported in November.\n\nCoin Cloud hired legendary filmmaker Spike Lee to direct a commercial for it in 2021.\n\nRead more: Bankrupt Lender Genesis and Parent DCG Reach Initial Agreement With Main Creditors: Source\n\n\n\n\n\n\n\n"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vZGVjcnlwdC5jby8xMjA5MDUvZG9ybWFudC1iaXRjb2luLWFkZHJlc3MtbW92ZXMtNDAwLWJ0Yy1hZnRlci0xMS15ZWFyc9IBVGh0dHBzOi8vZGVjcnlwdC5jby8xMjA5MDUvZG9ybWFudC1iaXRjb2luLWFkZHJlc3MtbW92ZXMtNDAwLWJ0Yy1hZnRlci0xMS15ZWFycz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Satoshi-Era Bitcoin Address Moves $9.6 Million in BTC After 11 Years - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAn ancient BTC address that has not transacted in over a decade came back to life on Wednesday—and the profits are something to behold.\n\nSince October 1 2012, address 1MMXRA held 412.12 BTC accumulated across four transactions, altogether worth just $8 at the time. No coins went in or out of that wallet until February 8, when all but a sliver was emptied from the wallet at $23,000 apiece.\n\nBy today’s prices, the moved coins represent $9.6 million in value–a 120,000,000% profit.\n\nAD\n\nAD\n\nWhile sizable Bitcoin trades occur daily, it's not often that coins that old see the light of day again. As on-chain analytics provider Glassnode notes, dormant coins become “increasingly unlikely to be spent” after a 155-day holding period, and are thus considered a less liquid portion of the supply.\n\nWhen old coins are being spent more frequently, it “may suggest a change in conviction to hold the asset”—often sparked by periods of market volatility. However, Glassnode’s newsletter from last month showed that the number of coins being held long-term is growing at a rate of 100,000 per month, despite short-term holders taking the opportunity to profit from the asset’s recent rally.\n\nIn March 2022, an even older wallet holding 489 Bitcoins dumped holdings dating back to October 2010, when Bitcoin’s price was just $0.19. That was many months before Bitcoin’s pseudonymous creator Satoshi Nakamoto had left the project. Satoshi is suspected of holding as much as 5% of Bitcoin’s entire supply due to mining in the network’s early days, but many don’t believe those coins will ever move again.\n\nBitcoin developer @LukeDashJr says that nobody technically knows whether Satoshi has ever touched those coins, or if he still interacts with them today. However, if he had to guess, the lack of any obvious movements likely means the creator is already dead.\n\n“If he isn't dead, why would he allow frauds to masquerade as him unchallenged (it would be trivial for him to prove them liars with a PGP or Bitcoin signature)?” he said to Decrypt via Twitter. “Would he really hoard his stash while development lacks funding?”\n\nAD\n\nAD\n\n“If not dead, at least he must have lost his keys,” he concluded."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vaHVuZ3J5aG9yc2VuZXdzLmNvbS9uZXdzLzIwMjMvZmViLzA4L2xhd3N1aXRzLWRvZy1jb21wYW55LWJpdGNvaW4tc2VydmVycy1jb2x1bWJpYS1mYWxsL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Lawsuits dog company with Bitcoin servers in Columbia Falls - Hungry Horse News",
        "content": "A cryptocurrency company with a bitcoin mining center in Columbia Falls is facing multiple class-action lawsuits alleging that it defrauded millions of dollars from thousands of investors in a “massive Ponzi scheme.”\n\nClass-action lawsuits alleging racketeering and securities fraud violations have been filed in Delaware and Pennsylvania in federal courts against Philadelphia-based VBit Technologies. Plaintiffs in both cases are seeking to recover their investments, which often totaled tens or hundreds of thousands of dollars.\n\nThe company claimed to sell bitcoin mining computers and offer setup and maintenance services at various data centers, including in Columbia Falls. The Montana facility is the only such building that could be linked to the company through property records. The lawsuits allege VBit lied about the extent of their products and services. Instead of using customer money for computers and electricity costs as advertised, investors accuse the company of simply shuffling investor funds around to create the appearance of legitimate cryptocurrency returns.\n\nInvestors accuse founder and former CEO Don Vo of being a conman who posed as a high-tech guru.\n\nInvestor Stephen Ranieri of Las Vegas paid VBit $50,000 for its “Black Diamond” package and then $3,000 each month to maintain computers that company records filed with court documents claim were his wholly-owned property. In all, Ranieri estimated his investment at more than $80,000. The named plaintiffs, Michael Eichler and Morgan Huntley, each invested tens of thousands of dollars, with Huntley’s suit claiming he put more than $200,000 into the scheme in purported hardware and hosting fees.\n\nRanieri doesn’t expect to see the money again, though he is working with lawyers to recoup his investment.\n\n“It’d be nice,” Ranieri said in a phone interview. “But I’m not counting on it.”\n\nRanieri said he got suspicious when the company issued a press release claiming a merger with Advanced Mining, a supposed Chinese company. The existence of the purported buyer and new CEO Lillian Zhou could not be verified. Plaintiffs allege Advanced Mining is a “complete sham.”\n\nInvestors claim the merger was a misdirection concocted to dodge accountability and provide Vo with an exit strategy.\n\nLater communications from the company confirmed that VBit was simply doing business as Advanced Mining.\n\nAfter the announcement, Vo updated his LinkedIn profile to say “retired, for now,” and stopped responding to investor inquiries.\n\nRanieri got even more concerned when the company blocked customer withdrawals, a move he now says points to an “obvious pyramid scheme.”\n\nRanieri believes last year’s bitcoin crash toppled the pyramid.\n\n“I think this was always their plan, to be honest,” Ranieri said. “If the price didn’t come down, they could have sustained it for a while longer.”\n\nREAL ESTATE RECORDS show that VBit closed the deal on the Columbia Falls location in March 2021. Although neighbors say a vehicle has been seen visiting the data center regularly, it is unclear if the server farm is still in operation.\n\nThe company did not respond to requests about the Montana property, and their office phone number has been disconnected.\n\nCryptocurrency mining centers are notorious for using a tremendous amount of power, but Flathead Electric Cooperative declined to share electricity usage that could reveal continued operations, citing privacy concerns.\n\nThe previous owners described the facility as having a 3.8 megawatt capacity, meaning that it could consume as much electricity as would normally power 3,800 homes in the Flathead Valley.\n\nJin Gao, named as a defendant in the lawsuits as VBit’s vice chairman, could not confirm if the data center is still running. When asked via email, Gao denied currently working for the company.\n\nA February 2021 video obtained by the Inter Lake shows Gao with VBit founder Vo unpacking computers at the Montana facility. The video was circulated to investors, with VBit showing off its new property as evidence of a thriving crypto enterprise.\n\nThe video also shows Teakettle Mining founder Jeff Russell, who sold the Columbia Falls facility to VBit, setting up computers for Vo and Gao.\n\n“Say hi, Jeff,” says Gao, holding the camera.\n\n“Hi, Jeff!” Russell jokes as he types on a laptop.\n\nRussell opened the facility in 2018, the first such crypto mine in the Flathead. While operating the mine, Russell also worked as head of IT at Logan Health Whitefish, then known as North Valley Hospital.\n\nRussell said via email that he offered his tech skills to VBit following the sale, but they declined his services.\n\nA tweet from Russell’s Teakettle Mining Twitter account welcomes VBit to the facility in December 2020. Real estate records show Russell listed the property for sale in August of that year.\n\nRussell confirmed by email that VBit leased the building for three months prior to finalizing the sale.\n\nAn October 2021 video shared with the Inter Lake shows Vo making a speech at a Flathead Valley restaurant, and records show that the company organized a trip for affiliates to Columbia Falls to tour their new property.\n\nThe company claimed to organize a tour of their purported Canada facility, but then canceled the trip, citing “Covid restrictions.”\n\nMarketing materials also claimed mines in Kazakhstan and Colorado, but the company never provided any evidence to support the claims.\n\nVBIT EMPLOYED multi-level marketing techniques to drive sales, and aimed their services at immigrants and older, less tech-savvy customers. Vo claimed in interviews with industry outlets that he was trying to make crypto investment more accessible for marginalized communities.\n\n“It doesn’t matter where you’re from or how old you are,” Vo said in a YouTube video. “I have built a system so easy to use that anyone can use it to build their wealth. So, are you ready to transform your life?”\n\nA blog post on Advanced Mining’s website attempts to placate customers, saying that “Bitcoin mining is not a Ponzi scheme,” but then goes on to warn customers against shady crypto companies.\n\n“Absurd promises are likely to be scams seeking to prey on the naivety of some bitcoin enthusiasts,” the post reads. VBit sales videos promised bonuses for “affiliates” who referred other customers to the company, including in cash, designer clothes and watches, and luxury vacations.\n\nA YouTube video uploaded by VBit customer and affiliate Skip McCoy shows Vo and Gao presenting two matching BMW convertibles — each valued at $55,000 — to McCoy and Erlinda Truitt. Both had achieved sales goals of at least $3 million and risen to the level of “National Leader.”\n\nThe company goes on to defend their multi-level marketing model: “Network marketing or affiliate program is a tried and tested marketing strategy. Unfortunately, some entities have used it to nefarious ends.”\n\nIN JULY 2020, VBit entered into a consent order with the Washington State Department of Financial Institutions (DFI) banning them from selling unregistered securities in the state and ordering them to refund all Washington-based customers.\n\nAccording to Adam Yeaton, the DFI attorney who drafted the order, the company stopped selling in Washington but continued doing business elsewhere. Their investigation did not look into the underlying mining contracts themselves, because the regulator felt that the contracts as advertised constituted securities.\n\nIn a June 2022 email, VBit, representing itself as Advanced Mining, said that they were no longer able to operate in the United States because the U.S. Securities and Exchange Commission also deemed their products to be unregistered securities.\n\nMontana Securities and Insurance Commissioner Troy Downing said after reviewing the Washington consent order that he felt that VBit’s services would indeed constitute a securities contract. Downing said a review of their database found that VBit had not registered those contracts with the state.\n\nDowning would not confirm if there was any open investigation into the company, but urged Montana-based investors to contact the commission if they had concerns.\n\nRanieri set up a chat group for frustrated investors on the encrypted messaging service Telegram after the official VBit channel was shut down because of the slew of complaints and refund requests.\n\nIn the group, investors say they’ve filed complaints against the company with multiple law enforcement agencies, including the SECs in New Jersey, Pennsylvania and Delaware, as well as the Federal Trade Commission, the Commodities Futures Trading Commission and the FBI.\n\nA group member who wished to only be identified as “J” blasted Vo in the channel.\n\n“Still in utter disbelief over the exploitation of all the people involved, even his partners, employees and affiliates,” J wrote. “Some people value the bag over their integrity.”"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZGVjcnlwdC5jby8xMjEwMDIvb25jaGFpbi1tb25rZXktYml0Y29pbi1uZnQtbWV0YWdvb2Qtb3JkaW5hbHMtaW5zY3JpcHRpb27SAVhodHRwczovL2RlY3J5cHQuY28vMTIxMDAyL29uY2hhaW4tbW9ua2V5LWJpdGNvaW4tbmZ0LW1ldGFnb29kLW9yZGluYWxzLWluc2NyaXB0aW9uP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "OnChain Monkey NFTs Double in Price After Creators Put Them on Bitcoin - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBuzz around Bitcoin-based NFTs—via the recently-launched Ordinals protocol—keeps growing by the day, with record-setting mints on Thursday and high-value sales over the past day. And one established Ethereum NFT collection is reaping the benefits of going multi-chain, seeing its prices surge after revealing Bitcoin-based counterparts.\n\nOnChain Monkey, a collection of 10,000 Ethereum NFT profile pictures (PFPs) minted in 2021, used Ordinals to “inscribe” all of its existing artwork on Bitcoin over the past day. Now the NFT holders on Ethereum can also say that their respective collectibles live on Bitcoin, as well.\n\nPrices for the Ethereum NFTs have almost tripled since the announcement, with the floor price—that is, the cheapest listed NFT on a marketplace—for the project jumping from 0.79 ETH at the start of the day (per NFT Price Floor) to a peak of 1.75 ETH before settling to about 1.5 ETH (nearly $2,500) as of this writing.\n\nAD\n\nAD\n\nOnChainMonkey is the first 10K collection to be inscribed on Bitcoin via Ordinals! Own an ETH OCM Genesis = Owning a BTC OCM Genesis All on-chain on Bitcoin on Feb 8, 2023, and all on-chain on Ethereum on Sept 11, 2021! 🔥 🧵/8 pic.twitter.com/AMuUlERJZM — OnChainMonkey (@OnChainMonkey) February 9, 2023\n\nAccording to data from CryptoSlam, the move has fueled a 12,200% increase in NFT trading volume for the Ethereum project over the past 24 hours compared to the previous span. The analytics platform reports about $1.1 million in sales over the past day for a project with lifetime secondary sales totaling almost $39 million.\n\nMetagood, the startup behind OnChain Monkey, said it put all 10,000 NFTs onto Bitcoin via the Ordinals protocol using a single transaction, much as it did for the original Ethereum collection back in 2021.\n\nIn a Twitter Spaces today, Metagood co-founder Danny Yang said that enabling trading was the next step for the team but suggested that other tooling needs to be created around Ordinals to facilitate that feature. He also noted that Metagood plans to build a bridge between Ethereum and Bitcoin to let NFT holders switch between the two versions.\n\n“They are the same on both chains,” an OnChain Monkey Discord moderator wrote earlier today. “Buy on ETH and you will have access to the BTC version when the tools catch up.”\n\nAD\n\nAD\n\nThe project’s Discord server is filling up with users who claim to have purchased one of the Ethereum NFTs following the Bitcoin announcement and are asking for details on how it will work.\n\nOnChain Monkey is part of Metagood’s push to use Web3 initiatives to fund programs that benefit communities. These include efforts to fund coral restoration and provide aid to Ukraine amid the Russian invasion. Metagood, co-founded by venture capitalist Bill Tai alongside Yang and Amanda Terry, raised $5 million in December.\n\nMetagood says that it minted the first 10,000 NFT project on Ordinals—a claim that the creators of Bitcoin Punks, a clone of popular Ethereum project CryptoPunks, have also made.\n\nBitcoin Punks began inscribing its NFTs via Ordinals before OnChain Monkey, but opted to put each Punk as a separate inscription—a process that stretched from Wednesday into Thursday. OnChain Monkey, on the other hand, committed its entire collection to Ordinals via a single transaction late Wednesday.\n\nEditor's note: This article was updated after publication to clarify when OnChain Monkey and Bitcoin Punks were inscribed via Ordinals."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiM2h0dHBzOi8vd3d3LnlvdWhvZGxlci5jb20vYmxvZy9ncmVlbi1iaXRjb2luLW1pbmluZ9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Green Bitcoin Mining: Can Crypto Go Green? - YouHodler.com",
        "content": "The cryptocurrency industry has long been criticized for its huge energy consumption. While cryptocurrency has many uses, it also causes a large carbon footprint. This leaves many to believe if this technology is truly sustainable amidst theories of a global climate crisis. As a result, developers are helping cryptocurrencies like Ethereum and Bitcoin “go green” without compromising any benefits.\n\nWe’ve analyzed a few examples of this to tackle the question if green bitcoin mining and green crypto, in general, are possible.\n\nWhy the need for green bitcoin mining?\n\nBitcoin still uses the PoW system. In a way, PoW is beneficial to bitcoin - it creates rarity and increases the value of a block. Unfortunately, bitcoin is the biggest offender when it comes to energy consumption. In 2021, bitcoin was using enough energy to power the state of Georgia (130 TWh).\n\nMining cryptocurrency causes a huge amount of pollution. It’s drawing criticism from governments around the world who are already looking to impose new regulations in 2023.\n\nFor example:\n\nChina’s 2021 crypto ban wiped out $400 billion of bitcoin and,\n\nthe European Union also considering a ban due to its energy crisis, this is a major concern.\n\nPlus, the huge carbon footprint goes against many UN countries’ climate goals.\n\nMiners also struggle to keep the lights on with the huge energy requirements - especially when competing against large-scale mining g operations. Bitcoin-mining farms can afford to buy power even when demand is low.\n\nThese big operations create fierce competition. For example, the largest mining operation in Texas, Riot Blockchain, taps directly into the local grid for power. It has a ten-year contract with the town’s electricity facility.\n\nMost miners cannot reach that level unless they use renewable energy.\n\nSustainable crypto mining is one answer to long-term crypto viability.\n\nSustainable crypto mining keeps all benefits of the PoW system without wasteful energy consumption. Hence, going green will satisfy both bitcoin users and governments around the world. To do this, bitcoin miners are looking into renewable energy sources like:\n\nSolar,\n\nHydro,\n\nWindo,\n\nTidal\n\nGeothermal and,\n\nBiomass.\n\nMany of these options are in their early stages but at least give hope for the future. Meanwhile, some blockchains took a more proactive approach to their energy usage by changing their consensus mechanism altogether.\n\nHow Ethereum’s Merge introduced sustainable crypto mining\n\nEthereum’s “Merge” was a considerable upgrade, one that changed the entire crypto landscape. The upgrade changed Ethereum’s consensus mechanism - which is a system that validates the authenticity of new crypto. It also ensures the validity of all the crypto transactions on the blockchain.\n\n‍\n\nBefore the merge, Eth used the Nakamoto consensus mechanism, a PoW (proof-of-work) system. PoW uses miners to unearth new blocks of crypto by solving a mathematical problem. By solving it, miners unlock a 64- number called a hash. With the hash, they could add new blocks to the blockchain.\n\nSuggested reading: Proof-of-stake vs. Proof-of-work\n\nHowever, solving the hash required a huge set-up of hardware and software. With their many computers running all the time, miners had to use incredible amounts of electricity. In 2022, miners were consuming about 70 TWh per year. For reference, the average household uses about 10,000 kWh per year.\n\nIn 2022, Ethereum changed to Gasper, a PoS (proof-of-stake) model, instead. It switches out the power of computational mining power for a stake of ETH. In PoS, people who hold stakes are validators. Staking their ETH activates the generation of new blocks of crypto. The blockchain’s algorithm chooses validators at random to generate new ETH. Validators can enter the PoS system at a lower cost since they don’t need specialized equipment.\n\nThe new consensus mechanism cut Ethereum’s energy consumption by 99%. Almost all ETH users stayed for the change, and the price of ETH increased by 3%. Overall, Ethereum’s introduction to sustainable crypto mining was a huge success. It created a new wave of excitement for the concept of green mining on other cryptocurrencies.\n\nIs Bitcoin mining eco-friendly with nuclear energy?\n\nWith Bitcoin stuck with its PoW mechanism, the only solution to green Bitcoin mining is some form of alternative energy. Surprisingly, nuclear power is at the forefront of the discussion.\n\nBitcoin’s first nuclear-powered mine is starting operations this year in the US. It will have almost no carbon output. Smaller mines are taking notice, and they’re trying to make the switch.\n\nThere are several benefits to using nuclear energy to mine Bitcoin. Such as:\n\nNuclear power has the highest energy capacity of all power sources.\n\nIt is three times more reliable than wind or solar plants.\n\nIt’s twice as good as natural gas or coal.\n\nNuclear fission is 8,000 times more efficient than fossil fuels.\n\nThere are some misconceptions about nuclear power (e.g. dangerous). In reality, nuclear power releases less radiation than any other energy source. Of course, there’s always a danger of accidents. Still, studies show that the worst possible nuclear plant accident is less destructive than an industrial accident.\n\nFinally, nuclear power costs are competitive with other sources. All these points make nuclear energy compatible with bitcoin mining. It works as a long-term solution, and miners are already using it.\n\nWhich direction in the “Green bitcoin mining” movement the world chooses to go remains to be seen. What we can say is there are plenty of sustainable options to explore and energy usage is certainly not a reason to be bearish on bitcoin or any cryptocurrency for that matter.\n\nGreen Bitcoin Mining on YouHodler\n\nFor those looking for an environmentally friendly and affordable alternative to Bitcoin mining, YouHodler has a feature for you. Cloud Miner is a reward system offered by YouHodler where clients can earn real bitcoins by completing simple tasks that “mine” blocks.\n\nThe computational power in Cloud Miner is called “Sparks.” You need more sparks to mine more bitcoin on YouHodler. To get more sparks, simply complete tasks and level up through the eight available levels.\n\nDisclaimer: YouHodler does not use the device's CPU resources to operate Cloud Miner\n\nWatch the video below to learn more about Cloud Miner.\n\n‍"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3LmFsdGNvaW5idXp6LmlvL2NyeXB0b2N1cnJlbmN5LW5ld3MvYml0Y29pbi1hbmQtYWx0Y29pbnMtcmVwb3J0LWZlYnJ1YXJ5LXdlZWstMS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin and Altcoins Report - February Week 1 - Altcoin Buzz",
        "content": "It is incredible to see both the crypto and TradFi markets in green through the initial weeks of February. This scenario is after FED Chair Jerome Powell said the U.S. would increase the rates by 25 bps.\n\nThe disinflation could propel Bitcoin to $24,000, but let’s see what’s going on in the cryptocurrency market this week.\n\nBitcoin Is in Green, and Retailers Are Back!\n\nBitcoin had its most satisfactory month since October 2021 and its best January gains since 2013.\n\nOnly ten occasions of monthly Bitcoin bull rallies of 39% or more have occurred since 2014. Typically, these rallies continued to perform well over the following year.\n\nBut How Are Short-Term Holders Faring?\n\nWhen STH SOPR falls below 1.00, as shown by the green box, most short-term holders are selling their bitcoins at a loss. And as most short-term investors are in a state of intense panic and are quick to sell at a loss, this is a period of accumulation.\n\nThe green box has historically signaled price bottoms for Bitcoin. Spikes over 1.00 indicate that UTXOs spent on the network accounting for their lifespan of between 1 hour and 155 days are being spent profitably during the price upsurge.\n\nRetailers are again active in the market, reaping profits from the recent increase in Bitcoin’s price. And the likelihood of a near-term price peak starts to rise as soon as retail begins to feel euphoria.\n\nHigh on Hopium?\n\nSmall BTC address growth was severely constrained in 2022 and plunged to new lows after the FTX debacle, but a sizable upsurge in January implies trading confidence is back.\n\nA market FOMO (fear of missing out) was sparked, particularly among small BTC investors, as the price of Bitcoin surged beyond $20,000 in the second week of January.\n\nAfter January 13, there was significant growth in BTC addresses holding 0.1 BTC or less. Data from Santiment shows that 620,000 new BTC addresses have appeared following the January 13 BTC price surge, totaling 39.8 million.\n\nSmall Bitcoin addresses have increased recently at their most remarkable rate since November 2022, when BTC fell to its cycle low of about $16,000.\n\nThe uptick of Bitcoin addresses holding modest sums suggests rising investor optimism in 2023.\n\nNow that, in addition to Bitcoin, several altcoins have also hit multi-month highs, and the whole cryptocurrency market has risen by over 30%, sentiment in the market is becoming increasingly bullish.\n\nThe first week of February saw Bitcoin maintain its upward trend, hitting a five-month high of over $24,000. The price is still hovering near $22,800 at the time of writing, as the $24,000 barrier proved too much to maintain.\n\nSome market analysts predict that February may not be as positive as January.\n\nThey have cautioned that the recovery in cryptocurrency and equities this year may turn negative this month due to uncertainty about how upcoming macroeconomic data from the United States may affect market sentiment. We could attribute the impending downward trend to the extent of the Federal Reserve’s interest rate hikes.\n\nNew Paradigm Around the Corner?\n\nIn the first few weeks of 2023, Bitcoin has risen by approximately 43%, reflecting its tremendous momentum.\n\nThe spot price has risen above both moving averages in January, which hints that things are going well. Additionally, BTC is generating a golden cross setup as the 50-day moving average surpasses the 200-day moving average.\n\nBesides, BTC rose above the realized price (grey) indicator. The realized price is significant since it shows the average cost of all Bitcoin trades.\n\nAt the same time, the realized price shows that regular Bitcoin investors are turning a profit on their purchases.\n\nFrom June through December 2022, the market has dragged the spot price below the realized price. The spot was oversold for six months if we neglected local rises over the realized price.\n\nIn conclusion, Bitcoin is presently poised to enter a new paradigm as it crosses many vital markers. The technical golden cross will support the spot price of Bitcoin, and the realized price has transformed into a support area. Moreover, Bitcoin trades above the multi-year confluence zone (white) and advances further into the pre-halving accumulation cycle (turquoise).\n\nStablecoins and Fund Flow Ratio\n\nStablecoins are the market’s liquidity. But how does their change affect the market?\n\nWhen the number of stablecoins skyrocketed after Covid-19 in 2020, it sparked a bull market in crypto. However, in February 2022, when the stablecoin supply started to decline, a bear market emerged.\n\nAlthough Bitcoin prices have soared dramatically due to the recent short-term surge in stablecoin circulation, a dead cross might happen again. The crypto space will most likely experience a bear market again if the number of stablecoins in circulation remains static.\n\nWhat About the Fund Flow Ratio?\n\nCurrently, the “Fund Flow Ratio (MA24)” has almost achieved the bull market top of 2021, suggesting that investors are actively using the exchange for trading or accumulating.\n\nOn the other hand, the “tokens transferred” metric is at an all-time low and shows a low level of BTC movement. It is because only a small number of forces are active in the low liquidity market. Institutional investors who favor over-the-counter trading are significantly less interested in the market.\n\nWhat Are Whales Doing Now?\n\nFollowing the recent rise in the price of Bitcoin over the last two weeks, exchange Bitcoin whale activity has almost fallen to a year-low. However, it has increased over the previous two weeks, adding to the selling pressure on the markets. Additionally, on-chain data revealed some of the highest CDD statistics for 2023 before the FOMC meeting.\n\nThe 3-6 month age cohort’s cost base is around 20.4K. This level will function as a support when there is a selling scenario. On the plus side, the cost base for the next cohort (six to twelve months) is around $32,000.\n\nThe Total Transaction Count of BTC has increased significantly recently, almost matching the bull market of 2021. But given that active addresses rarely changed, it is clear that a tiny number of whales had a significant effect on the cryptocurrency market.\n\nThe fact that the most recent increase was the longest and biggest during this down market is notable. However, whales often behave unexpectedly, so it may be some time before we learn their plans. We still need to exercise caution at this stage since an economic slump is still possible.\n\nShort Squeezes\n\nThe new year has begun with a remarkable reversal of the downward trend during January after a protracted, grueling, and unpleasant 2022. Such rallies are often fueled, as is the case with the current surge, to some extent by short squeezes in the derivatives markets.\n\nOver $495 million in short futures contracts had already been settled in three waves, noticeably with decreasing magnitude as the rally ended.\n\nAs can be seen, the first short squeeze in mid-January caught many traders off guard and resulted in a record-low long liquidation domination of 15% (i.e., shorts accounted for 85% of liquidations). It demonstrates how many traders were offside and is even more significant than the longs liquidated during the FTX collapse (75% long domination).\n\nThe cash and carry basis has returned to positive territory across both perpetual swap and calendar futures, returning 7.3% and 3.3% annually, respectively. It follows a significant amount of backwardation in all futures markets in November and December, and it signals a recovery of an optimistic sentiment, potentially mixed with some speculations.\n\nFriday Anomaly Back?\n\nAmid this year’s boom, Bitcoin has returned to one of its old routines: posting significant weekend movements. This phenomenon has grown to be a fascinating aspect of the cryptocurrency market.\n\nContrary to most other assets, which typically trade Monday through Friday on regulated exchanges, BTC and the rest of the cryptocurrencies are tradable continuously every day of the week. And it has been seen in cryptocurrency markets before, with Bitcoin flying up — or plunging low — when other assets are at rest.\n\nUntil recently, Fridays were a drag on performance as the Friday anomaly peaked around when Bitcoin reached its all-time high about a year ago. The Friday oddity is returning after Bitcoin’s recent surge.\n\nThe phenomenon is related to a mix of fund inflows and money migrating onto retail exchanges before the weekend shutdown of the fiat banking system. Both explanations point that the Friday phenomenon positively correlates with the Bitcoin price.\n\n⬆️ For more cryptocurrency news, check out the Altcoin Buzz YouTube channel.\n\n⬆️ Our popular Altcoin Buzz Access group generates tons of alpha for our subscribers. And for a limited time, it’s Free. Click the link and join the conversation today."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LnRlY2h0YXJnZXQuY29tL3doYXRpcy9mZWF0dXJlL1RoZS1iZXN0LWNyb3NzLWNoYWluLWJyaWRnZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "6 best cross-chain bridges in 2023 - TechTarget",
        "content": "As the demand for different blockchain-based Web 3.0 technologies continues to grow, so too does the need to enable interoperability. This is something that is enabled with cross-chain bridge services.\n\nBlockchain is a distributed ledger technology that uses cryptography to provide assurance and integrity to data and transactions. Blockchain networks enable many types of services, including secured databases, immutable ledgers, decentralized applications (dApps), decentralized finance (DeFi), non-fungible tokens (NFTs) and cryptocurrencies.\n\nThere are many blockchain networks and cryptocurrencies that use different blockchain technologies, including Bitcoin, Ethereum, Avalanche, Polygon, Solana and Arbitrum. Enabling interoperability and exchange across different blockchain networks is an area where cross-chain bridges -- sometimes also referred to as blockchain bridges -- play an increasingly important role.\n\nWhat is a cross-chain bridge? A cross-chain bridge enables an exchange of information, cryptocurrency or NFTs from one blockchain network to another. It enables the flow of data and tokens across what would otherwise be siloed sets of data on different blockchains. With fiat currency there are many established ways for individuals and businesses to exchange money, creating a globally available and interoperable system of financial payments. Those systems include financial institutions, banks and credit cards that handle foreign exchange. In the world of blockchains, a cross-chain bridge serves an analogous purpose. Exchange across different blockchains for cryptocurrency is possible without a cross-chain bridge, but it is expensive and more time-consuming. Without the use of a cross-chain bridge, users must first convert a cryptocurrency token into a fiat currency, which often involves fees. They then use currency to get the other desired type of cryptocurrency, incurring more fees and taking time. One characteristic of a cross-chain bridge is that it enables users to exchange one cryptocurrency for another without first changing it to fiat currency. Cross-chain bridges aren't limited to just cryptocurrency value transfer either. An effective cross-chain bridge can also enable the transfer of smart contracts and NFTs from one blockchain environment to another. There are several approaches to enabling transfers with a cross-chain bridge. One common approach is using a wrapped token issued by the cross-chain bridge provider platform. With a wrapped token, the value of one token from a specific blockchain network can be encapsulated inside another token. Wrapped tokens are typically based on the ERC-20 technical specification for an Ethereum network. For example, WBTC is a Bitcoin token wrapped with an ERC-20 Ethereum smart contract. Another approach to enabling cross-chain bridge transfers is by using a liquidity pool. With a liquidity pool, a cross-chain bridge provider holds inventory -- or pools -- of various coins where one can be exchanged for another. Cross-chain bridges can also be a lucrative target for hackers. One of the largest attacks occurred in February 2022, when cross-chain bridge platform Wormhole was the victim of an attack in which the threat actor stole 120,000 wrapped Ethereum tokens -- worth an estimated $320 million at the time of the theft. BNB Chain, also known as Binance Smart Chain, was the victim of an attack in October 2022 that resulted in losses estimated at $570 million. Blockchain bridge analysis vendor Chainalyis has estimated that 69% of cryptocurrency funds stolen in 2022 have been attributed to attacks on cross-chain bridges. Learn more about how cryptocurrency cyber attacks are on the rise."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1iZWxvdy0yMzAwMC1zaGliYS1pbnUtZG9nZWNvaW4tc29sYW5hLXRhbmstdXAtdG8tOC0zNjk1OTgtMjAyMy0wMi0wOdIBjQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2FtcC9jcnlwdG8vc3RvcnkvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4tYmVsb3ctMjMwMDAtc2hpYmEtaW51LWRvZ2Vjb2luLXNvbGFuYS10YW5rLXVwLXRvLTgtMzY5NTk4LTIwMjMtMDItMDk?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin below $23,000; Shiba Inu, Dogecoin, & Solana tank up to 8% - Business Today",
        "content": "Crypto market was trading sharply lower on Thursday as the sentiments were jittered after US Federal Reserve's official hinted that there is no respite in aggressive rate hikes. The central bank would remain vigilant about stamping out high inflation, reiterating its hawkish tone.\n\nAfter only a single day, Bitcoin slipped below $23,000-mark during the early Asian markets as the numero-uno crypto token plunged 3 per cent. Ethereum, the second largest crypto asset tanked 3 per cent but held above $1,600-levels. However, the pain in altcoins was more severe.\n\nBarring the US dollar pegged stablecoins, all the top crypto tokens were trading sharply lower on Thursday. Shiba Inu tanked more than 8 per cent, whereas Avalanche was down 7 per cent. Dogecoin and Solana were down 6 per cent each, while Polkadot and Litecoin tumbled 5 per cent.\n\nThe global cryptocurrency market cap was trading lower at $1.05 trillion mark, dropping more than 3 per cent in the last 24 hours. Similarly, the total trading volumes declined almost 4 per cent close to $59.49 billion.\n\nBitcoin continues ranging at $22,700-23,400 and Ethereum at $1600-$1680. With the ranging markets, there are many growth metrics that point that new users or dormant users are returning back to the space, said CoinDCX Research Team.\n\n\"There has been a certain increase in the interest of Decentralized Protocols, with Total Value Locked across different staking protocols hitting $74.6 Billion, increasing by 26 per cent from December 2022, it said.\"\n\nCrypto updates\n\nLeading MakerDAO community participants have proposed creating a liquidity market called Spark Protocol for lending and borrowing crypto assets focused on DAI, Maker’s $5 billion stablecoin, according to a proposal posted on Wednesday in Maker’s governance forum.\n\nRobinhood Market’s board of directors authorized the company to pursue purchasing most or all of the 55 million shares that Emergent Fidelity Technologies bought in May 2022, Robinhood said in its fourth-quarter earnings report.\n\nTech View By WazirX Trade Desk\n\nChromia (CHR) is an open-source public blockchain conceived of by Swedish company Chromaway AB. The Chroma token (CHR) was launched in May of 2019. The technology behind the Chromia blockchain is adapted from an earlier technology called ‘Postchain’, a solution provided by Chromaway AB for enterprise clients. Chromia is a microcap crypto project trading at 177th rank with $153 million Market Cap as per coinmarketcap website.\n\nThe CHR coin gained more than 30 per cent in the last 7 days compared to Bitcoin, which is up around 1 per cent in the same period. As per the chart OP has broken out of a descending trendline on a weekly timeframe. It is also trading above the 21-week moving average which is a positive sign, it is showing good strength compared to the rest of the crypto market from last 7 days.\n\n\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\n\n\nAlso read: Adani Wilmar, Tata Power, Hindalco: What should be your strategy amid market volatility\n\nAlso read: Q3 results previews: LIC, Zomato, Hindalco and IRCTC"
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmRhdGFjZW50ZXJkeW5hbWljcy5jb20vZW4vbmV3cy9odXQtOC1hbmQtdXMtYml0Y29pbi1hbm5vdW5jZS1tZXJnZXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Hut 8 and US Bitcoin announce merger - DCD - DatacenterDynamics",
        "content": "The two companies will join together to form ‘Hut 8 Corp’ or ‘New Hut’ and will have access to approximately 825MW of gross energy across six sites, four of which were previously US-based Bitcoin mining facilities, the other two were used by Hut 8 for digital asset mining and high-performance computing (HPC).\n\nHut 8 Corp will, according to the company, not only focus on ‘economical mining’, but also anticipates having several diversified revenue streams all while meeting ESG standards. The deal is expected to close in Q2 of 2023.\n\nThe company will be governed by a combination of Hut 8 and USBTC executives, including Hut 8 CEO Jaime Leverton retaining her role and USBTC CEO Michael Ho to become chief strategy officer. The board of directors will consist of five individuals from each company.\n\nThe transaction will see Hut 8 shareholders receive 0.2 of a share of New Hut stock for every share of Hut 8 they previously held. Similarly, shareholders of USBTC will retain 0.6716 per share. Based on the five-day VWAP for the Hut 8 shares on the Nasdaq as of the last trading day prior to this announcement (6 February), the aggregate Consideration implies a combined market capitalization of approximately $990 million. The two companies will each own 50 percent of Hut 8 Corp.\n\nAs part of the agreement, Hut 8 has also committed to providing USBTC with secured bridge financing during the interim period of between $6m and $6.5m.\n\n\"Our established track record of creating shareholder value through organic growth and strategic acquisitions while maintaining a balance sheet-first approach has positioned us perfectly to advance our growth trajectory through this business combination,\" said Jaime Leverton, CEO, Hut 8.\n\n\"Bringing together Hut 8's operational track record and diversified revenue streams with US Bitcoin's scalable mining sites, sizeable hosting business, and industry-leading managed infrastructure operations not only accelerates our diversified strategy and positions us for near-term growth, but also establishes us as a strong, US-based player that is ready and able to seize additional opportunities as they arise.\"\n\nHut 8 Corp will have 5.6 EHps of self-mining capacity and 244MW of total energy available at the five self-mining sites located in Alabama, New York, and Texas.\n\nOne of the two Texas sites, King Mountain, will remain 50 percent owned by USBTC’s energy partner King Mountain Joint Venture. Hut 8 Corp will manage the 220MW of hosting infrastructure on the site which is powered by wind and nuclear power among other sources.\n\n\"The combination of Hut 8 and USBTC is an important step, but it's truly just the beginning,\" said Asher Genoot, co-founder and President of USBTC.\n\n\"We believe that New Hut will challenge industry paradigms and set the standard for operating rigor and team culture. We are laser-focused on identifying opportunities to capture untapped value across the mining ecosystem. Together, we will become an exceptional self-mining operator, hosting provider, strategic operator of managed infrastructure, purveyor of high-performance computing infrastructure, and industry-leading ASIC repair and sales hub, underpinned by world-class operating technology and IP to drive growth.\"\n\nLast month Hut 8 was required to pause its mining operations due to disagreements with its energy provider, Validus. This, along with tumbling cryptocurrency values and the fall of FTX Trading has meant Hut 8 has had a challenging few months. On the announcement of the merger, Hut 8 shares dropped by nine percent to $2.17. In total, the stock’s value has dropped by 86 percent since its November 2021 all-time high.\n\nRiot Platforms opens new building, suffers damage in Texas storm\n\nIn other crypto news, crypto mining and data center hosting company Riot Platforms (Riot) has released its January 2023 updates.\n\nRiot has announced the return of operations in Building F. The company experienced a significant hit to its operations after the severe winter weather in Texas damaged the pipes to its immersion-cooled F & G buildings at the Rockdale Facility in late December 2022. The Rockdale Facility has ~700MW of capacity.\n\nJason Les, CEO of Riot, said: “As previously disclosed, some sections of piping in Buildings F and G were damaged during the severe winter storms in Texas in late December, impacting approximately 2.5 exahashes per second (EHps) of our hash rate capacity. Repairs have been ongoing in both buildings, and we have successfully brought Building F back online, representing 0.6 EHps of impacted hash rate capacity. We are thankful for our team’s progress, despite difficult weather conditions, and are evaluating several options to bring online the approximately 1.9 EHps of hash rate capacity still affected in Building G.\"\n\nDuring this period, Riot also voluntarily curtailed operations to help protect the ERCOT grid and, as a result, earned $4.9m in power credits throughout December. The company did a similar thing in the Summer of 2022, during which period DCD reported that the company earned more in power credits than it would have from crypto mining.\n\nWhile work is ongoing for building G, the company has recently completed Building D at the same facility, an air-cooled building, and is continuing developments for its external water system-cooled Building E with the installation of external wall lovers, interior water frames, and electrical testing."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMDIwOTAwNTEyNi9lbi9NYXdzb24tSW5mcmFzdHJ1Y3R1cmUtR3JvdXAtSW5jLi1CcmVha3MtR3JvdW5kLW9uLVNoYXJvbi1QQS0xMjAtTVctQml0Y29pbi1NaW5pbmctRmFjaWxpdHnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Mawson Infrastructure Group Inc. Breaks Ground on Sharon, PA 120 MW Bitcoin Mining Facility - Business Wire",
        "content": "SHARON, Pa.--(BUSINESS WIRE)--Mawson Infrastructure Group Inc. (NASDAQ:MIGI) (“Mawson” or the “Company”), a digital infrastructure provider, announced today that it has broken ground on the Company’s latest Bitcoin Mining operation in Sharon, PA. The first 6 Modular Data Centers, capable of holding and operating up to 3,528 ASIC miners and handling approximately 12MW have been installed. The site has a total capacity of 120 MW, which is capable of housing and operating up to 35,280 ASIC miners,1 with those miners capable of producing up to 4.2 exahashes per second (EH/s)2.\n\nThe first stage of 12 MW is scheduled to be energized in early Q2, 2023. The balance of the 120 MW capacity will come online incrementally through 2023 and early 2024.\n\nMawson plans for the Sharon, PA facility to house a split of Mawson Self-Mining and Mawson Hosting operations.\n\nThe Sharon, PA facility will also take part in Mawson’s market leading Energy Markets Program, which helps drive curtailment revenue through periods of grid stress, whilst simultaneously providing power stability to the grid and households throughout the PJM market.\n\nThe successful completion of the Sharon, PA and Midland, PA (100 MW) sites will see Mawson with a total capacity of up to 220 MW of power, capable of housing and operating up to approximately 64,680 ASIC miners, with those miners theoretically capable of producing approximately 7.8 exahashes per second (EH/s).\n\nLiam Wilson, COO, commented, “We are delighted to have broken ground on our Sharon, PA facility – and to have taken delivery of the first 6 Modular Data Centers destined for Sharon, capable of delivering 12MW of power to our miners / holding about 12 MW worth of miners. This step forward is further proof of Mawson’s push to deploy infrastructure and energize through 2023, and to achieve our previously stated targets. We look forward to continuing to communicate operational updates throughout 2023.”\n\nAbout Mawson Infrastructure\n\nMawson Infrastructure Group (NASDAQ: MIGI) is a digital infrastructure provider, with multiple operations throughout the USA and Australia. Mawson’s vertically integrated model is based on a long-term strategy to promote the global transition to the new digital economy. Mawson matches sustainable energy infrastructure with next-generation Mobile Data Center (MDC) solutions, enabling low-cost Bitcoin production and on-demand deployment of infrastructure assets. With a strong focus on shareholder returns and an aligned board and management, Mawson Infrastructure Group is emerging as a global leader in ESG focused Bitcoin mining and digital infrastructure.\n\nFor more information, visit: www.mawsoninc.com\n\nStatements about hashrate capacity\n\nStatements in the press release about hashrate capacity (including ‘installed capacity’ or ‘nameplate’ capacity), will often differ from the actual or observed hashrates. Hashrate capacity generally makes certain assumptions about the efficiency of the ASIC miners that are in use. Some ASIC miner models will consume less power to create the same amount of hashing power than other ASIC miner models (typically more recent models are more efficient). Many ASIC miner fleets are blended fleets, including various ASIC miner models each with different efficiency ratings. Hashrate capacity figures typically assume 100% deployment of ASIC miners. Given the large numbers of computing units (often numbering in the tens of thousands), ASIC mining fleets are rarely 100% deployed and online at any one time. This can be due to a variety of factors, including ASIC miners being under maintenance, in storage, in transit, or due to technical faults and breakdowns. Once deployed and online, the actual or observed hashrate can be influenced by other factors such as heat, overclocking (causing the ASIC miner to perform at levels higher than the manufacturer’s specifications), the age, and wear and tear exhibited by the ASIC miners and also by the limitations of the surrounding infrastructure, such as power outages, and MDC and transformer breakdowns. Construction and development delays are a common risk for mining data centers, for example due to weather, permitting delays, or labor and equipment shortages. Investors should consider all risk factors related to uptime when considering these figures, which are a best-case scenario.\n\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS\n\nMawson cautions that statements in this press release that are not a description of historical fact are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words referencing future events or circumstances such as “expect,” “intend,” “plan,” “anticipate,” “believe,” and “will,” among others. Because such statements are subject to risks and uncertainties, actual results may differ materially from those expressed or implied by such forward-looking statements. These forward-looking statements are based upon Mawson’s current expectations and involve assumptions that may never materialize or may prove to be incorrect. Actual results and the timing of events could differ materially from those anticipated in such forward-looking statements as a result of various risks and uncertainties, which include, without limitation, the possibility that Mawson’s need and ability to raise additional capital, the development and acceptance of digital asset networks and digital assets and their protocols and software, the reduction in incentives to mine digital assets over time, the costs associated with digital asset mining, the volatility in the value and prices of cryptocurrencies and further or new regulation of digital assets. More detailed information about the risks and uncertainties affecting Mawson is contained under the heading “Risk Factors” included in Mawson’s Annual Report on Form 10-K filed with the SEC on March 21, 2022, and Mawson’s Quarterly Report on Form 10-Q filed with the SEC on August 22, 2022, November 14, 2022 and in other filings Mawson has made and may make with the SEC in the future. One should not place undue reliance on these forward-looking statements, which speak only as of the date on which they were made. Because such statements are subject to risks and uncertainties, actual results may differ materially from those expressed or implied by such forward-looking statements. Mawson undertakes no obligation to update such statements to reflect events that occur or circumstances that exist after the date on which they were made, except as may be required by law.\n\n________________________________\n\n1 Statements about ASIC miner capacity in this document are not an assurance that Mawson will have that many ASIC miners available to deploy (whether self-mining or hosted units). Mawson’s ability to deploy units will depend on many factors such as Mawson’s future ASIC miner purchases and sales, our ability to attract future hosting customers, and the number of ASIC miners customers have to deploy.\n\n2 Statements about exahash capacity in this document assume a combined fleet (of self-mining and hosted units) deployed over the relevant sites having an industry-leading average of 120TH per machine. This may not be achieved, and will depend on many factors such as Mawson’s future ASIC miner purchases and sales, our ability to attract future hosting customers, and the hosting customers’ ASIC miner specifications. To the extent that any of the ASIC miners operate at less than 120TH, then this will reduce the hash rate actually achieved."
    },
    {
        "id": 63,
        "url": "https://news.google.com/rss/articles/CBMiamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMi8wOS9iaW5hbmNlLXJlY3J1aXRzLWJydXNzZWxzLWxvYmJ5aXN0LWFzLWV1LWRldmVsb3BzLWNyeXB0by1ydWxlcy_SAW5odHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDIvMDkvYmluYW5jZS1yZWNydWl0cy1icnVzc2Vscy1sb2JieWlzdC1hcy1ldS1kZXZlbG9wcy1jcnlwdG8tcnVsZXMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Binance Seeks Lobbyist as EU Finalizes Crypto Rules - CoinDesk",
        "content": "The EU is set to formalize its Markets in Crypto Assets (MiCA) regulation in April, which would impose consumer protection and financial stability norms on wallet providers and exchanges. Further laws could be set to come in other areas such as crypto lending and decentralized finance (DeFi)."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9ldGhlcmV1bS1pbnN0ZWFkLW9mLWJpdGNvaW4tc2F5cy1tYXJjLWFuZHJlZXNzZW4v0gFOaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2V0aGVyZXVtLWluc3RlYWQtb2YtYml0Y29pbi1zYXlzLW1hcmMtYW5kcmVlc3Nlbi8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Ethereum Instead of Bitcoin, says Marc Andreessen - CryptoPotato",
        "content": "Marc Andreessen – founding partner of the tech-focused VC giant Andreessen Horowitz (a16z) – is now more bullish on Ethereum and Web 3 than he is on Bitcoin, contrary to his outlook in 2014.\n\nDuring an interview with ReasonTV published on Wednesday, the venture capitalist discussed the future of crypto adoption and regulation, alongside the role of Bitcoin as money.\n\nCrypto, Not Bitcoin\n\nAccording to Andreessen, crypto and Web3 represent “the other half of the internet,” containing all of the functions people wanted the internet to have until now. This includes the ability to do business across the world on a financial layer of trust, in the form of blockchain technology.\n\nUsing that layer of trust, a host of financial assets can be represented: money, claims of ownership, house titles, car titles, assurance contracts, loans, internet art, and more.\n\n“You can build on top of the untrusted internet all of the capabilities you would need to have a full economy,” Andreessen explained. “That’s a giant idea – the potential there is extraordinarily high.”\n\nSuch ideas aren’t entirely new, coming from the entrepreneur. In a Washington Post article published in 2014, he predicted a new generation of the internet with wide-ranging applications forming on a platform of “distributed trust.” At the time, he thought that specific platform would be Bitcoin – but now believes the premiere network has “stalled out” and “stopped evolving.”\n\n“If I wrote that thing today, I would either say its Ethereum instead of Bitcoin, or I would just say crypto or Web3 instead of Bitcoin,” he said.\n\nWhile Bitcoin is the largest cryptocurrency by market cap, Ethereum currently has the most active fee marketplace, stemming from its active DeFi and NFT economy. It also has more active developers than Bitcoin, which BitMEX Research credits to its more flexible programming language and welcoming culture for use cases besides just money.\n\nIn a16z’s 2022 State of Crypto Report, the firm outlined how certain web 3 platforms do a beet job of rewarding their creators that legacy web 2 giants like Facebook. Notably, the document contained no mention of the word “Bitcoin.”\n\nThough unimpressed by Bitcoin’s number of features, Andreessen believes Bitcoin can help increase economic freedom throughout the world as a form of money. Unlike some critics, he acknowledges that money can take various forms, so long as it’s a tool used for trade.\n\nBanning Bitcoin, he added, is likely impossible. “The source code for it is available for free,” he said. “For a government to ban Bitcoin, they’re literally putting themselves in a position where they’re banning math.”\n\nCritics of A16z\n\nIn late 2021, Twitter co-founder and Bitcoin believer Jack Dorsey made an enemy of Andreessen, who blocked Dorsey on Twitter after being criticized for secretly owning the Web3 ecosystem. Dorsey has even mocked Web3 and its related VCs by launching his own decentralized identity application on Bitcoin, called “Web 5.”\n\nA16z is one of the largest venture capital firms in crypto, pouring billions into token purchases – like Solana – and other forms of Web3 tech. Earlier this week, the crypto community expressed concern after the VC giant – which owns 4% of Uniswap’s governance token, UNI – exerted its power to singlehandedly stonewall a new governance proposal."
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vY29pbmdlZWsuY29tL3VrLWhpZ2gtY291cnQtYWNjZXB0cy1jcmFpZy13cmlnaHQtY2xhaW0tb3Zlci1iaXRjb2luLWRhdGFiYXNlLW93bmVyc2hpcC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "UK High Court accepts Craig Wright's claim over Bitcoin database ownership - CoinGeek",
        "content": "The U.K. High Court has ruled that a landmark claim over the ownership of the Bitcoin database and the Bitcoin white paper has enough prospect of success that it’s defendants can be served out of the jurisdiction.\n\nThe claim is brought by Dr. Craig Wright and is against the BTC partnership, which comprises the BTC developers and ecosystem companies such as Coinbase (NASDAQ: COIN), Blockstream, Crypto Open Patent Alliance (COPA), and Square (NASDAQ: SQ). It is the first time that a claim has been brought against the BTC outfit in its entirety, including the wider group of corporates that prop up and disseminate the BTC system.\n\nThe U.K.-based defendants have already been served. However, to serve defendants sitting outside of the jurisdiction, Dr. Wright must prove that the claim represents a serious issue to be tried on the merits of the case. On Wednesday, the U.K. High Court ruled that there is merit on at least two of the three arms of Dr. Wright’s argument.\n\nThose arms are the infringement by the defendants of Dr. Wright’s rights to the Bitcoin database as its true owner and infringement by the defendants of his copyright in the Bitcoin white paper: the Judge easily satisfied himself that there is a serious issue to be tried on those points easily.\n\n“I was and am satisfied that the claims in database right and of infringement of copyright in the White Paper raise serious issues to be tried and therefore service out of the jurisdiction of those claims should be permitted,” wrote the Judge.\n\nThe third, which was a claim over copyright in the Bitcoin file format itself, involving the structure of the Bitcoin blocks, was rejected by the Judge. The issue is that the structure of any subsequent block building on Dr. Wright’s original Bitcoin blocks cannot be read without relying on the original: according to Dr. Wright, the subsequent blocks violate his copyright on that basis. The Judge acknowledged that the sphere of copyright in file formats is a developing area of law, but ultimately found that there was no serious issue to be tried on whether copyright exists in the Bitcoin file format.\n\nHe rejected permission to appeal to the Court of Appeal on the third point, but the claimant Dr. Wright can apply for permission from the higher court directly. Given his recent track record in the U.K. Court of Appeal, that seems likely.\n\nThe net result of this is that Dr. Wright’s claim to the Bitcoin database and copyright in the white paper is going to get a full trial. Again, it is perhaps most notable because it is the first time that the BTC partnership as a whole—which has been passing off BTC as the original Bitcoin for some time—will be brought to collectively answer for their activities.\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 67,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9ob3R0ZXN0LWJpdGNvaW4tbmZ0cy1ub3ctY3J5cHRvcHVua3MtMjAwMjQxMDU5Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "The Hottest Bitcoin NFTs Right Now Are CryptoPunks Clones - Yahoo Finance",
        "content": "Bitcoin NFTs are the talk of the Web3 world right now, thanks to a new way to “mint” media and assets on the layer-1 blockchain through the Ordinals project. And, as with many past NFT network launches, cloned versions of Ethereum’s early and influential CryptoPunks are dominating the early buzz around Ordinals.\n\nCryptoPunks, created by Larva Labs in 2017, is a seminal NFT project that set the template for the modern profile picture (PFP) trend. The 10,000 Ethereum assets were initially released via a free mint, well before there was a thriving NFT market, but have gone on to generate almost $2.5 billion worth of trading volume in the years since.\n\nOrdinals just launched on the Bitcoin blockchain in late January, but there are already multiple CryptoPunks-inspired projects gaining steam on the platform.\n\nThe most prominent so far is Ordinal Punks, which spans 100-pixel avatars that have been “inscribed” on Bitcoin through the Ordinals project and can be traded. Unlike some Punks clones seen in the past, however, they're not direct clones of the original CryptoPunks collection.\n\nSome on Crypto Twitter believe that Ordinal Punks is based on a derivative Ethereum collection called Mutant Punks—in other words, a derivative of a derivative. However, a person connected to the project clarified to Decrypt that Ordinal Punks \"used an open-source algorithm and CC0 Punk sprite sheet to generate new Punks.\"\n\nOne Ordinal Punk sold for 9.5 BTC late Wednesday, or nearly $215,000. While that’s about double the entry-level price for a real CryptoPunk—about 64 ETH right now, or nearly $106,000—that particular Ordinal Punk is based on the very rare alien CryptoPunks, which have sold for as much as nearly $24 million worth of ETH in the past.\n\nStory continues\n\n12 years ago I was mining Bitcoin on a gaming PC in my parent's basement. Today, we just minted out the first 10k NFT collection on Bitcoin. Thanks to everyone, but most importantly the @cryptopunksnfts. ❤️@Bitcoin_Punks_ + https://t.co/3O4wIo0OYC pic.twitter.com/BV0a6KmrWj — Robert Clarke (@robertjfclarke) February 9, 2023\n\nIn another example, pseudonymous NFT collector and investor dingaling tweeted that he purchased a bundle of seven Ordinal Punks for 15.2 BTC on Wednesday—about $349,000 worth at the time.\n\nHowever, because Ordinals just launched and they function differently than typical NFTs on other platforms (like Ethereum and Solana), there isn’t much infrastructure to support buying and selling the assets once they’ve been described. In other words, there aren’t Bitcoin NFT marketplaces for Ordinals just yet.\n\nIn fact, such trades are currently taking place over the counter (OTC) directly between users or through escrow services, with asking prices and bids being tracked via online spreadsheets. It’s all being facilitated through Twitter and Discord as collectors vie for these Punk clones, as some expect these early Bitcoin “inscriptions” to prove more and more valuable over time.\n\nnew opensea competitor lookin sharp pic.twitter.com/pJH0fuRnYm — 113 ♖♖♖ (@0x113d) February 8, 2023\n\n“There's [a] real moment behind Ordinals and things are still very very early. There are opportunities everywhere,” dingaling tweeted. “Orderbooks are currently updated on shared spreadsheets and sales are only done via OTC/escrow. But there's lots of building being done behind the scenes.”\n\nHowever, the lack of infrastructure means that the current trading model is susceptible to scams, and some Crypto Twitter users have raised the alarm. One viral thread from pseudonymous NFT collector TheNorwegian called out various perceived issues with the collection, and asked whether it's the \"biggest NFT scam of all time.\"\n\nAnother notable Ordinals project is Bitcoin Punks, which puts replicas of all 10,000 original CryptoPunks on Bitcoin. It’s billed as the first 10,000-piece NFT project launched through Ordinals, and all of the assets have already been minted for free by collectors.\n\nWith 11,000 NFTs Minted to Bitcoin, Are Bitcoin Maxis Coming Around?\n\nIt’s not yet clear how much trading demand there is for the larger Bitcoin Punks collection at this point, however, and a moderator on the project’s official Discord server warned holders today to “be careful trading” before a code audit can be completed.\n\nOrdinals use has surged over the last few days, with data platform Dune showing over 17,000 mints on the platform already today—double yesterday’s total, continuing a trend that has exploded over the last week-plus. More than 39,000 assets have now been inscribed as Ordinals, including other knockoffs and a playable clone of the classic video game Doom.\n\nHowever, the project has proven controversial with some Bitcoin maximalists and enthusiasts, some of whom have argued that it’s a waste of network space or that it goes against Bitcoin’s original focus on financial assets. Bitcoin transaction fees have surged over the last week and a half since Ordinals started gaining steam.\n\nCryptoPunks clones are common on NFT protocols that have emerged after Ethereum, and you can find them all over the place—on Solana, Polygon, Cardano, Algorand, and even Stacks, a “layer 1.5” network built on top of Bitcoin.\n\nEditor's note: This article was updated after publication to clarify the origins of the Ordinal Punks designs."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMi8wOS9zYW0tYmFua21hbi1mcmllZHMtbGF3eWVycy1wcm9wb3NlLWluc3RhbGxpbmctbW9uaXRvcmluZy1zb2Z0d2FyZS1vbi1oaXMtcGhvbmUv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzAyLzA5L3NhbS1iYW5rbWFuLWZyaWVkcy1sYXd5ZXJzLXByb3Bvc2UtaW5zdGFsbGluZy1tb25pdG9yaW5nLXNvZnR3YXJlLW9uLWhpcy1waG9uZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Sam Bankman-Fried’s Lawyers Propose Installing Monitoring Software on His Phone - CoinDesk",
        "content": "During Thursday’s hearing, Kaplan requested a written list of former and current employees with whom Bankman-Fried would be allowed to communicate. Kaplan also said he was concerned about Bankman-Fried’s ability to encrypt his messages or otherwise evade surveillance under the current terms of the joint agreement, leading to his lawyers’ proposal that he install monitoring software on his phone."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGVjcnlwdC5jby8xMjA5MzMvbG9jYWxiaXRjb2lucy1zaHV0LWRvd24tMTAteWVhcnMtb3BlcmF0aW9u0gFKaHR0cHM6Ly9kZWNyeXB0LmNvLzEyMDkzMy9sb2NhbGJpdGNvaW5zLXNodXQtZG93bi0xMC15ZWFycy1vcGVyYXRpb24_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "LocalBitcoins to Shut Down After 10 Years of Operation - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nLocalBitcoins, one of the earliest and most popular peer-to-peer Bitcoin exchanges, today announced that it is shuttering its business after more than ten years of operation.\n\nIn its announcement, the P2P platform said that it was “proud of what we have achieved together with all of you, our loyal community,” but that it can no longer provide its service due to the “challenges during the ongoing very cold crypto-winter.”\n\nThe platform also shared a timeline for its service closures, beginning with a suspension of new signups today and followed by the ending of trading and deposits on February 16.\n\nAD\n\nAD\n\nAfter February 17, the only thing LocalBitcoins users will be able to do is withdraw their Bitcoin from their wallets. They will have 12 months to do so.\n\nThe platform had continued to release new features, including a one-click BTC purchase function as recently as January 22, according to the official LocalBitcoins Twitter account.\n\nLocalBitcoins has not yet responded to Decrypt’s request for comment.\n\nLocalBitcoins’ legacy\n\nLocalBitcoins was founded by Jeremias Kangas in 2012 in Helsinki, Finland.\n\nAD\n\nAD\n\nThe service matched Bitcoin buyers and sellers, with the coins held in escrow until both parties confirmed the transaction.\n\nIn 2019, a report from CipherTrace revealed that the platform was one of the leading destinations for illicit Bitcoin. Since then, the firm instituted a cash ban on the platform as well as introduced Know-Your-Customer (KYC) features powered by Onfido.\n\nAccording to Onfido, the platform had onboarded and verified users from 189 countries.\n\nIn 2021, the platform expanded beyond Bitcoin, offering users access to a handful of altcoins like Dogecoin and Cardano."
    },
    {
        "id": 71,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2V2b2x1dGlvbi1vZi1iaXRjb2lucy12YWx1ZS1vdmVyLXRpbWUv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Evolution of Bitcoin's Value Over Time - Analytics Insight",
        "content": "In the crypto industry, the evolution of Bitcoin is fascinating evidencing it to be one of the best currencies to invest in\n\nBitcoin is regarded as a forerunner of the cryptocurrency space since it is the most traded currency amongst other currencies. The coin found in the year 2009, remains to be one of the most popular cryptocurrencies even now. With this popularity, the coin has become an alternative to fiat currencies like U.S. Dollars which are regulated by central banks. There have been various collapses and rallies in the evolution of Bitcoin. Let us learn how Bitcoin’s value over time is fluctuating.\n\nBitcoin Price from US$0- US$200\n\nThe value of Bitcoin price initially worth $0 in 2009, started its upsurge in 2010 to US$0.9. From then a Bitcoin rally started, reaching US$29.60 in 2011. In the midst of this, there was a global economic crisis, which had an impact on the price of crypto bitcoin. Due to this, Bitcoin had a rough 2012. However, after emerging from the global financial crisis, Bitcoin started trading at US$13.28 and quickly rose to US$68.50. In 2013, Bitcoin valued at US$123 witnessed a bullish trend as its value started climbing gradually from hundreds to thousands.\n\nBitcoin Price from US$1000 US$20,000\n\nOn December 2013, the Bitcoin price after being spiked to US$1,2375 declined to US$687.02 in just three days span. The value of Bitcoin underwent considerable oscillations in 2014 and starting in the year 2015 it settled at US$315.21. After this Bitcoin made a resurgence in value at US$19,345.49 in December 2015, forcing investors to grab this coin to enhance their crypto portfolios. In 2016, the value of Bitcoin was that considerate as it made a huge fall and reached the value of US$900. However, the coin swung from US$1000 to US$2000. The value of Bitcoin in 2018 and 2019 also was not that considerate. However, in 2020 a pandemic year that slowed down each sector also affected the crypto sector for this reason the coin value remained low. Gradually by the end of the year 2020, Bitcoin traded at US$19,157.\n\nBitcoin Price from US$20,000 to US$70,000\n\nThe coin within a few days in 2021 surpassed the 2020 record and settled at US$40,000. From a value of US$20,000 to reaching US$40,000 was a huge success of Bitcoin. While affected by various factors the coin again experienced a downfall of 50% in the middle of 2021 reaching US29,796. Again, at the end of the year 2021, Bitcoin reached the top at US$68,789 more than ever before, just after fifteen days the coin ended with a downfall settling for US$46,164.\n\nLater on, the prices started fluctuating throughout the year 2022, and miserably it ended at US$20,000. Today on February 8th, 2023 the value of Bitcoin is trading at US$22,988 indicating a promising future ahead.\n\nFactors affecting the Value of Bitcoin\n\nBitcoin value fluctuations that have been perceived over time are mostly affected due to the crypto market trend. When a particular cryptocurrency coin is broadly discussed in the media, its demand increases dramatically. The increasing demand for the coin inevitably leads to an increase in the coin’s price when there is a shortage of coins. Along with this, the crypto coins get affected by external factors like rising interest on value gains in crypto.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 72,
        "url": "https://news.google.com/rss/articles/CBMiiQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2NyeXB0by9zdG9yeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yZWdhaW5zLTIzMDAwLXBvbHlnb24tc29sYW5hLXBvbGthZG90LWdhaW4tdXAtdG8tNS0zNjk0MzgtMjAyMy0wMi0wONIBjQFodHRwczovL3d3dy5idXNpbmVzc3RvZGF5LmluL2FtcC9jcnlwdG8vc3RvcnkvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4tcmVnYWlucy0yMzAwMC1wb2x5Z29uLXNvbGFuYS1wb2xrYWRvdC1nYWluLXVwLXRvLTUtMzY5NDM4LTIwMjMtMDItMDg?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Crypto Price Today: Bitcoin regains, $23,000; Polygon, Solana & Polkadot gain up to 5% - Business Today",
        "content": "Crypto market was trading sharply higher on Wednesday, after a mediocre start for the week. Dovish comments from Jerome Powell, the chairman of US Federal Reserve, boosted the morale of investors. Powell suggested that the Fed was winning its fight to tame inflation.\n\nBitcoin regained $23,000-mark for the early Asian hours after a rising about 3 per cent. However, its largest peer, Ethereum, was also firm marching towards $1,700-level, jumping over 3 per cent. The Graph, Sandbox and Chiliz rose 30-45 per cent for the day.\n\nBitcoin is above $23,200 due to Jerome Powell's comments on declining inflation and positive investor sentiment from a deal between Digital Currency Group and Genesis. The deal includes selling Genesis' bankrupt entities and refinancing loans, said Edul Patel, Co-founder and CEO at Mudrex.\n\n\"Bitcoin's immediate support lies at the $23,000 level, while the resistance lies at the $23,400 level. Meanwhile, Ethereum has remained stable above $1,600 and is showing signs of growth. If this continues, ETH may reach $1,700 soon,\" he said.\n\nAll the top crypto tokens were trading with strong gains on Wednesday. Polkadot jumped more than 5 per cent, whereas Polygon, Avalanche, Solana and Tron were trading 4 per cent up each. Litecoin and Cardano jumped 3 per cent each in the early trade.\n\nThe global cryptocurrency market cap was trading higher at $1.09 trillion mark, rising more than 2 per cent in the last 24 hours. However, the total trading volumes rose about 24 per cent close to $61.69 billion.\n\nCrypto updates\n\nCoinDCX, a crypto platform, has appointed Sridhar Govardhan as the Chief Information Security Officer to further strengthen its cyber security capabilities. Sridhar brings with him over two decades of rich experience and was most recently the VP and Head of Information Security at Flipkart.\n\nThere will be 'zero representation' of crypto companies in the advertising lineup for this year's Super Bowl championship game on Sunday, according to broadcaster Fox Sports.\n\nAn Ethereum test network (testnet) successfully simulated withdrawals of staked ether for the first time, bringing the second-biggest blockchain yet another step closer to its historic transition to a fully featured proof-of-stake network.\n\nUK citizens could be limited to holding 10,000 British pounds each in a new digital pound, as the Bank of England seeks to avoid a new central bank digital currency undermining the banking system.\n\nTech View By Giottus Crypto Platform\n\nBinance Coin (BNB) is currently trading around the $330-340 range, up by about 35 per cent year-to-date. Like all major crypto assets, BNB began this year with a promising uptrend, going up by almost 30% in a matter of 10 days. Since then, it's trading right around the golden pocket of its November fall, supported by an ascending support line.\n\nShould this resistance be reclaimed, it would suggest a bullish momentum for BNB. BNB would then be poised to test the next resistance at $360. BNB’s 50 and 200-day moving averages - at $281 and $285, respectively - indicate that it might be overbought. We could see them being tested in the coming days.\n\nMajor levels\n\nResistance: $360, $398\n\nSupport: $288, $262, $250\n\n(Views and recommendations given in this section are the analysts' own and do not represent those of Business Today. Please consult your financial adviser before taking any position in the asset/s mentioned.)\n\nAlso read: Stocks in news: Adani Green, Bharti Airtel, Hero MotoCorp, Ambuja Cements and more\n\nAlso read: Paytm share price: Macquarie double upgrades stock, ups target to Rs 800 from Rs 450 earlier"
    },
    {
        "id": 73,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vY29pbmdlZWsuY29tL2NvaW5zdG9yZS1leGNoYW5nZS1ub3ctbGlzdHMtYml0Y29pbi1zdi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Coinstore exchange now lists Bitcoin SV - CoinGeek",
        "content": "Bitcoin SV has officially been listed on Coinstore.com, a leading digital currency exchange. This provides another way for users, entrepreneurs, and others to buy, sell, and trade BSV.\n\nAlong with the listing on Huobi Japan in 2022, the move proves that more exchanges are noticing the growing BSV ecosystem, which now consists of millions of daily transactions and an ever-growing portfolio of applications.\n\nAbout Coinstore.com\n\nCoinstore.com was founded in 2020 by professionals from some of the leading digital currency exchanges.\n\nThe exchange has over 180 employees worldwide, over 1.8 million registered customers in 175 countries, and a normalized 24-hour volume of more than $120 million, according to popular digital currency tracker CoinGecko.com.\n\nBSV is one of a limited number of digital currencies listed by CoinStore. Unlike many other exchanges, this one is selective, listing around 50 currencies in all. BSV is live as of Monday, February 6, 2023.\n\nThe BSV ecosystem continues to grow\n\nWhile there have been several headline-grabbing delistings of BSV in recent times, including by Robinhood (NASDAQ: HOOD) and Bitfinex, the ecosystem continues to grow. Forward-thinking exchanges recognize the demand for the original Bitcoin and are listing it as a result.\n\nWhile the ‘crypto media’ would like to paint the picture that BSV is dead and continues to be squeezed out of the digital currency ecosystem, nothing could be further from the truth. As the new listing indicates, for every exchange that delists, another sees the potential and picks up the baton, and the ecosystem as a whole is thriving. With millions of daily on-chain transactions and a plethora of micropayment-powered applications like Haste Arcade and my2cents, the demand for the BSV token will only grow in the coming years.\n\nCoinstore.com has clearly recognized this and has capitalized on the opportunity. Expect other future-oriented exchanges to follow suit in the coming months and years.\n\nWatch: Blockchain Venture Investments: Driving Utility for a Better World\n\nwidth=\"562\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">\n\nNew to blockchain? Check out CoinGeek’s Blockchain for Beginners section, the ultimate resource guide to learn more about blockchain technology."
    },
    {
        "id": 74,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDIvMDkvZGVmaS1naWFudC1tYWtlcmRhby1pbnRlZ3JhdGVzLWJsb2NrY2hhaW4tZGF0YS1wcm92aWRlci1jaGFpbmxpbmstZm9yLWRhaS1zdGFibGVjb2luL9IBggFodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzAyLzA5L2RlZmktZ2lhbnQtbWFrZXJkYW8taW50ZWdyYXRlcy1ibG9ja2NoYWluLWRhdGEtcHJvdmlkZXItY2hhaW5saW5rLWZvci1kYWktc3RhYmxlY29pbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "DeFi Giant MakerDAO Integrates Blockchain Data Provider Chainlink for DAI Stablecoin - CoinDesk",
        "content": "“The advancement of the technology backing stablecoins is a necessary component to unlock the future of finance,” said Johann Eid, vice president of Go-To-Market at Chainlink Labs, the developer firm behind Chainlink. “As more and more traditional financial institutions partner with MakerDAO and assess the applicability of DeFi, the required underlying infrastructure becomes increasingly complex,” he said about the integration."
    },
    {
        "id": 75,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbmdhcGUuY29tL2Jsb2cvYml0Y29pbi12cy1ldGhlcmV1bS13aGljaC1jb2luLWlzLWJlc3QtZml0LWZvci1sb25nLXRlcm0taW52ZXN0bWVudC0xMDA2Ny_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin vs Ethereum: Is There A Long-term Case For Crypto? - CoinGape",
        "content": "After suffering a massive sell-off in 2022, this year started with a bang for all major cryptocurrencies. Bitcoin and Ethereum, two leading digital assets of the cryptocurrency market, have always been the center of attraction for crypto traders. So, it’s quite understandable when someone wants to choose between Bitcoin vs Ethereum for the long-term investment option.\n\nBitcoin vs Ethereum: Let’s put their performance in perspective\n\nAre you looking to start your long-term crypto journey and curious about the future of bitcoin vs Ethereum? You are at the right place, here is a quick rundown of some of the biggest considerations regarding the investment outlook for each cryptocurrency.\n\nadvertisement\n\nBitcoin: BTC price eyeing $25K\n\nBitcoin price is currently valued at $22,953.15 and has a $24,117,660,098 24-hour trading volume. With a live market worth $442 billion, BTC has gained over 38% in the past four weeks.\n\nThe recent price surge might expose BTC to levels as high as $23,900 and $25,150 in the forthcoming months. Now, talking about whether Bitcoin is a good long-term investment or not. So, many crypto experts believe that for the next one to three years, BTC prices will be bullish and may touch new heights soon.\n\nEthereum’s Price Holds Steady at $1.6k\n\nThe price of Ethereum in the last 24 hours was $1,633.93, with a trading volume of $6,700,985,956. On the upside, ETH is anticipated to face a bullish crossover that might expose ETH to $1,750. In the past 30 days, Ethereum has risen nearly to 36%.\n\nEthereum has remarkable long-term staying power in terms of utility and real-world use cases. From being the pioneer of the concept of smart contracts to an innovation leader when it comes to decentralized finance and non-fungible tokens, Ethereum has shown its dominance in the world.\n\nBitcoin vs Ethereum: Conclusion\n\nBoth the leading cryptocurrencies have strong growth potential, but at the same time, they are extremely volatile. That means investing in cryptocurrencies for the long term involves carefully considering factors such as technology, adoption, regulation, market demand, and detailed research.\n\nAlso Read: First Golden Crossover Of 2023 Sets Bitcoin Price To Cross Above $40000"
    },
    {
        "id": 76,
        "url": "https://news.google.com/rss/articles/CBMiNWh0dHBzOi8vd3d3LmJhbmtsZXNzdGltZXMuY29tL2NhL3JvYm90cy9iaXRjb2luLWJhbmsv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Bitcoin Bank Review 2023 - Bitcoin Bank Review Canada - Bankless Times",
        "content": "What Is Bitcoin Bank? Bitcoin Bank Review for Canada\n\nBTC Bank is one of the numerous cryptocurrency robots that operate in the cryptocurrency industry, promising profits to account holders who invest their money into Bitcoin. The automated trading platform claims to use trading bots powered by AI technology to make trades with the funds you deposit into your account. This technology reportedly scans crypto exchanges and monitors market trends to find smart investments.\n\nThe aim of trading apps such as the Bitcoin Bank app is to buy Bitcoin at a low price and sell it for a profit later.\n\nHowever, while cryptocurrency is still in its infancy and the market is still very volatile, Bitcoin Bank app encourages you to try auto crupto trading in a bid to open a whole new avenue of investment properties.\n\nThe concept behind the platform is relatively simple. On the surface, you do not need any prior knowledge of Bitcoin to start investing your money in the market. However, while the company infers that a Bitcoin investment can be life-changing, the truth is far more complicated — particularly when automatic trading is concerned. For starters, this type of trading is very high-risk, especially when you cannot verify the reputability of Bitcoin Bank’s partnered brokers.\n\nNote that the dollar figures in this review refer to USD and not Canadian dollars. This is because the amounts specified by the app are in USD, and Canadian users' funds will automatically be converted to USD based on the existing exchange rate.\n\nBitcoin Bank Overview\n\n🤖 Robot Type: Auto Trading Robot 💸 Minimum Deposit: $250 ✅ Is It a Scam or Legit? Legit 🚀 Claimed Win Rate: 88% 💰 Trading Fees: None 💰 Account Fees: None 💰 Deposit/Withdrawal Fees: None 💰 Software cost: Free ⌛ Withdrawal Timeframe: 24 Hours 💱 Supported Cryptocurrencies: BTC, ETH, XRP 💲 Supported Fiats: USD, EUR, GBP 📊 Leverage: 1000:1 📱 Native Mobile App: No 🖥️ Free Demo Account: Yes 🎧 Customer Support: Email, Live chat ✅ Verification required: KYC 🔁 Automated Trading: Yes 📈 CFD Available Yes\n\nPros and Cons of Using BTC Bank\n\nPros Low deposit of $250\n\nDemo account and video tutorials available\n\nNo service charges\n\nAvailable in countries that allow Bitcoin trading\n\n24/7 customer support Cons Withdrawing funds is difficult\n\nAuto trading bots are very risky\n\nSome testimonials and reviews are fake\n\nWhat is the Bitcoin Bank Team?\n\nThe Bitcoin Bank team consists of professional traders and experienced software developers. We couldn't find the specific names of the owners, however.\n\nGetting Started With Bitcoin Bank\n\nIf you are a beginner in the cryptocurrency market, you probably are wondering how to get started with Bitcoin Bank app. Do not fret because the bot is user-friendly and designed to be used by both new entrants and experienced traders in the cryptocurrency market. Take a look below at our brief overview of how to start. Remember, the bot is connected to regulated brokers, so ensure you choose the best-suited broker for your needs before starting.\n\nRegister for a Trading Account. Deposit funds with your broker. Customize your trades, buying points, selling points, etc., and start trading.\n\nBitcoin Bank Markets, Assets, and Options\n\nWhat cryptocurrencies and products can you trade using Bitcoin Bank?\n\nThis trading robot is specifically tailored for digital assets, meaning you can’t use it for assets like forex, stocks, commodities, and so on. Therefore, if you diversify your portfolio with assets from different markets, consider other bots. For traders and investors in the cryptocurrency market, Bitcoin Bank offers trading options for some of the most popular cryptocurrencies. The full list will be determined based on the broker that you choose to use.\n\nWhat leverage trading options are there with Bitcoin Bank?\n\nDuring our research for this review, we could not find any conclusive information on the leverage trading options on the Bitcoin Bank platform. However, if the service is like other auto traders, you should expect potential leverages of 1000:1 at least. While this may seem like an enticing proposition, most regulated brokers would never offer such massive leverage options. Therefore, if you intend to sign up, you should be wary of exceptionally high leverage percentages.\n\nConfused about using BTC Bank? Allow us to explain.\n\nWhen a broker offers leverage to invest in Bitcoin, they are effectively giving you a loan. For example, say the broker provides a 1000:1 leverage option. If you invest a minimum deposit of $250, you’ll be loaned $250,000 for Bitcoin investments. Essentially, you are borrowing a large sum of money in a bid to earn a significant profit. However, you need to remember that automatic trading comes with plenty of risks, and it’s a very unreliable way of trading at the best of times. Therefore, when you add in the astronomical leverage, you may prefer to look for alternative investment methods that offer more control over your funds.\n\nWhat are the spreads on Bitcoin Bank?\n\nDue to the volatility of the BTC market, you can expect the buying and selling price of cryptocurrency to fluctuate every day. That being said, different brokers will offer you different deals, all of which will have varying pip values.\n\nFees, Limits, and Payment Options on Bitcoin Bank\n\nHow much does Bitcoin Bank cost?\n\nBesides offering free trade automation services, BTC Bank has deposit bonuses you can enjoy from time to time. Signing up for an account with it is also free, and there are no subscription charges. You should test it out via its demo account to ensure it aligns with your trading or investment requirements.\n\n💸 Minimum Deposit: $250 💰 Trading Fees: Zero 💰 Account Fees: Zero 💰 Deposit/Withdrawal Fees: Zero 💰 Software cost: zero 💰 Subscription cost: Zero\n\nWhat are the payment methods accepted by Bitcoin Bank?\n\nThere are several alternative payment methods for trading with Bitcoin bank. These include:\n\nPayPal\n\nMastercard\n\nVisa\n\nAnd more\n\nDoes Bitcoin Bank also charge fees and commissions?\n\nAs we have stated in this Bitcoin Bank review, it does not charge any registration fees when you become a user. Also, you will not face any service charges when you place your initial deposit into your account. However, you can expect the platform to take a small commission of any profits you earn through it.\n\nBitcoin Bank trade sizes and limits\n\nLike many other auto crypto traders, BTC Bank has set a minimum deposit limit of $250 to purchase cryptocurrency. Interestingly, the platform offers zero information on the maximum trading limit. As such, you can assume that you can invest as much as you can feasibly afford. However, as we have said in this Bitcoin Bank review, automatic trading is an unreliable way to invest in Bitcoin and comes with plenty of risks. Therefore, if you are thinking of using an auto trader, we strongly advise keeping to the minimum deposit limit.\n\nBitcoin Bank Platform\n\nHow does Bitcoin Bank work?\n\nThis is an trading bot system that reportedly utilizes AI technology to invest user funds into the Bitcoin market and hopefully make a profitable return.\n\nBTC Bank claims to use AI bots to find cheap Bitcoin shares. Then the platform will prompt you to invest in those shares, or if you have selected the auto trade setting, it will purchase the shares for you. BTC Bank will then hold these investments and send you a message to make a substantial profit. Sounds easy, right? Well, it also sounds too good to be true. Nevertheless, the platform seems to be an excellent way to make extra money. However, trading bot is undeniably risky and often ineffective, which means you are likely to lose your money rather than earn a profit.\n\nOn the Bitcoin Bank website, they suggest that your auto trading investments can have numerous benefits on your life, but we could not find many trustworthy testimonials or reviews that supported these claims. While bots can scour the crypto market much faster than human traders, we would not wholly trust them to help you earn a profit. There is a good chance you will not see a return on your investment given the nature of auto trading.\n\nWhat devices can I use Bitcoin Bank on?\n\nYou can use this platform on any device that can connect to Wi-Fi and access an internet browser. This includes:\n\nSmartphones\n\nTablets\n\nDesktop Browsers\n\nCan I Use Bitcoin Bank in My Country?\n\nCountry Is Bitcoin Bank available? United Kingdom No Canada Yes Australia Yes USA No South Africa Yes New Zealand Yes Philippines Yes United Arab Emirates Yes Singapore Yes France Yes Spain Yes Italy Yes Germany Yes Nigeria Yes Mexico Yes\n\nWhich exchanges and brokers does Bitcoin Bank partner with?\n\nUnfortunately, for this Bitcoin Bank review, we found it difficult to zero in on any concrete information regarding the brokers and exchanges partnered with Bitcoin Bank. That being said, you should remember that high leverage rates are a strong indicator that brokers are probably unregulated and, therefore, less likely to help you earn a profit.\n\nIs Bitcoin Bank available in my language?\n\nBTC Bank is available in numerous languages. Unfortunately, the language will be automatically assigned to you based on your geographical location. You can expect to view Bitcoin Bank in:\n\nEnglish\n\nGerman\n\nSpanish\n\nItalian and more\n\nHow easy is it to use Bitcoin Bank?\n\nRegarding the app itself, BTC Bank is straightforward to navigate. The user interface is relatively minimal and sleek. Account registration is speedy, but that is probably because the company wants you to deposit your funds and get trading. If you are confused by the Bitcoin Bank platform, you can use a demo account to practise making trades without spending any real money.\n\nHow much profit can you make using Bitcoin Bank?\n\nBTC Bank automates trades and investments to attempt to maximize your success potential. However, the trading bot doesn't guarantee profits, and it is crucial to take measures to mitigate the risks in the crypto market. If you are new to the market, conduct thorough market research and develop a solid trading strategy that you are comfortable with and that allows you to control your spending. This is so that you can easily follow up on the bot’s performance and take advantage of potentially profitable market trends the robot misses out on.\n\nRemember, the profits you earn with BTC Bank depend on your input. Since the robot has a leverage of 1000:1, you can make more than your invested capital, up to $1,000 daily. That being said, always calculate your potential profits before you begin trading/investing, and consider your tax deductions to the CRA.\n\nBitcoin Bank Key Features\n\nBitcoin Bank offers numerous features on the platform to stand out to new users. These include:\n\nCustomer Support: In preparation for this review, we found that the customer support side of BTC Bank is very attentive. When you create your account, you’ll be contacted by a representative immediately to finalize your registration. If you miss their call, you can expect them to try your number repeatedly until you complete the sign-up process. You can also contact BTC Bank by e-mail or live chat.\n\nLow Deposit: One of the most advertised Bitcoin Bank features is their low minimum deposit of $250. But, of course, they do not tell you the high leverage options required to afford Bitcoin with such a small deposit.\n\nDemo Account: As we have already stated, Bitcoin Bank allows you to try out a demo version of the app, which has all the features of the live trading crypto experience, but you do not use your funds, eliminating any risk.\n\nBitcoin Bank Security and Regulation\n\nIs Bitcoin Bank legit?\n\nWe found plenty of Bitcoin Bank reviews online during our research, though many of them were obvious fabrications designed to direct traffic towards the site. Also, the high leverage options make you wonder how many BTC Bank partnered brokers are regulated. In our experience, regulated brokers and exchanges do not offer astronomical leverage options.\n\nThere have also been some reports that Bitcoin Bank makes it very difficult to withdraw your funds. Details can be found here.\n\nIs Bitcoin Bank safe?\n\nBTC Bank is technically safe in regard to your personal information being protected by SSL encryption. However, due to the issues surrounding the problematic withdrawal process and the large amount of risk involved with leveraged trades, we cannot guarantee that your funds will be safe and that you will make a profit.\n\nAre my money and I protected?\n\nOverall, Bitcoin Bank is highly encrypted and aims to ensure your email and data are protected from hackers.\n\nIs Bitcoin Bank regulated?\n\nThis is difficult to say. We found little information regarding regulated exchanges and brokers on the Bitcoin Bank website. However, as we have stated, we recommend that you avoid any broker that offers obscenely high leverage on your deposit, as they will most likely be unregulated. The best crypto trader regulators are the CySec, FCA, ASIC, and FSB. Look for any of these authorities before conducting business with any trader.\n\nDo I have to verify my account with Bitcoin Bank?\n\nYes, when you create your account, you’ll need to provide documents and verify your identity and address. Then you can use your BTC Bank login.\n\nHow Does Bitcoin Bank Work? Trading Strategies and Algorithms\n\nBitcoin Bank is AI-powered, which uses trading signals and algorithms to monitor the cryptocurrency market and trade on your behalf based on potentially profitable market trends it picks. The robot is designed for high--speed performance; no wonder it gains excellent reviews and testimonials from users. Bitcoin Bank has a claimed win rate of 88%, but like any trading product, it doesn't guarantee successful trades. It does, however, improve its chances of success due to the following features.\n\nAutomated Trading Tools\n\nArbitrage Trading\n\nReactive News Trading\n\nPrice Trend Analysis\n\nExtra Information About Bitcoin Bank\n\nEducational Resources\n\nTraders and crypto investors can also learn more about cryptocurrency trading from website blogs, podcasts, and YouTube channels. All these resources are free, but you can pay for financial advisors’ services should you require extra guidance.\n\nBitcoin Bank comes with plenty of charts and metrics to show you the Bitcoin market projections. You can also set parameters to narrow your searches to better search for traders and exchanges.\n\nCustomer Support\n\nBitcoin Bank Customer Support Details Support email Not available Support contact number Not available Live chat option Yes Other support options Online Form\n\nDemo Account\n\nBitcoin Bank has a demo account to test its features and gauge your skill level before venturing into the live market using real money. The demo account is risk-free, but you must make a minimum deposit of $250 to use it. It is the best platform to get started with, especially if you are entering the crypto space with zero experience.\n\nHow to get started with Bitcoin Bank? 3 simple steps\n\nBelow you’ll find a list of steps to help you get started with Bitcoin Bank:\n\nStep 1 - Register\n\nRegistration is a relatively quick and painless process. Simply input your details, and you’ll be contacted by a representative who will see you through the verification procedure.\n\nStep 2 - Make a Deposit\n\nOnce you have created your Bitcoin Bank account, you need to pay a deposit of $250 to trade for Bitcoin. You can deposit more funds if you prefer, though we strongly recommend that you stick to the minimum.\n\nStep 3 - Begin to Live Trade\n\nIf you’ve completed the above steps, you are ready to start trading crypto on Bitcoin Bank.\n\nHow to delete the Bitcoin Bank account?\n\nAs mentioned earlier, Bitcoin Bank is connected to regulated brokers. Therefore, to delete it, go to its menu at the top corner of the page and access the settings command to initiate the process. Alternatively, you can delete your Bitcoin Bank account by deleting your account with the broker. However, you will also lose your data with that broker. Do not start the process of deletion if you are not certain about how you want to go about it. Instead, contact its customer care for guidance.\n\nHow to withdraw money from Bitcoin Bank?\n\nBitcoin Bank does not have a cryptocurrency wallet for storing your assets and earnings. The brokers it is connected with do the storing, meaning that your funds can only be accessed through the brokers. Below is the procedure for withdrawing your money earned from Bitcoin Bank's automated trades and investments.\n\nVisit a Bitcoin Bank’s connected broker’s platform and sign into your trading/investment account. Go to your wallet, whereby you should click withdraw to start the withdrawal process. Enter your preferred payment method, whether PayPal or bank. Enter an amount to withdraw. Click continue to initiate the withdrawal process, which should take up to 24 hours to complete.\n\nRemember, most cryptocurrency brokers do not accept payouts in crypto assets, and that is why Bitcoin Bank supports various fiat currencies to streamline the withdrawal process. Therefore, choose your preferred fiat currency to successfully withdraw your funds.\n\nBitcoin Bank Celebrity/Company Endorsements\n\nYou have probably come across online reviews claiming that top celebrities or companies endorse Bitcoin Bank. We did our research to verify these claims, and below are our opinions based on our analysis findings.\n\nIs Elon Musk related to Bitcoin Bank?\n\nNo. Elon Musk is a Bitcoin investor and the CEO of Tesla and SpaceX. For this reason, many believe he is related to Bitcoin Bank. Based on our research, there is no information proving that Musk endorsed this robot or used it to automate his investments.\n\nIs Jeff Bezos related to Bitcoin Bank?\n\nNo. Jeffrey Preston Bezos is a prominent American business mogul and media personality. He is Amazon’s founder and has no interest in cryptocurrency trading and investments. Therefore, all rumours that Bezos is related to Bitcoin Bank should be considered untrue and misleading.\n\nIs Gordon Ramsay related to Bitcoin Bank?\n\nNo. Gordon Ramsay is a British celebrity chef and popular television personality. He is interested in cryptocurrency, and there have been rumours to say he is connected to Bitcoin Bank. However, based on our findings, he hasn't endorsed Bitcoin Bank, nor is he related to the robot.\n\nIs Karl Stefanovic related to Bitcoin Bank?\n\nNo. Karl Stefanovic is an Australian Nine Network journalist and TV presenter. Throughout his period working with the Nine Network as a co-host, Stefanovic has never endorsed Bitcoin Bank, and as such, despite online claims, we believe he does not use it to trade or invest.\n\nBitcoin Bank in the News\n\nBitcoin Bank is also said to be featured on various news channels and TV shows. We reviewed all previous episodes, and below are our findings.\n\nIs This Morning related to Bitcoin Bank?\n\nNo. This Morning is a British TV show featuring diverse guests to discuss matters on various topics, including celebrity news, cooking tips, beauty, and lifestyle. We reviewed all episodes aired on this show, and we couldn't find one featuring Bitcoin Bank, making the ongoing rumours false.\n\nIs Dragons' Den related to Bitcoin Bank?\n\nNo. Dragons' Den is a TV reality show connecting upcoming entrepreneurs to prominent ones globally for funding and partnerships. So far, the show has aired many episodes, but there is none related to Bitcoin Bank. As of the time of writing, there has been no direct mention of Bitcoin Bank and Dragons' Den; however, we have included it here as this is a show that is often incorrectly associated with cryptocurrency trading robots.\n\nOther Bitcoin Bank Reviews and User Testimonials\n\nWe want to ensure that our readers have no doubts about moving forward with Bitcoin Bank. For this reason, we analyzed user reviews and testimonials on Trustpilot and Reddit.\n\nWhat Are the Top Bitcoin Bank Reviews on Forums and Reddit?\n\nReddit is one of the platforms where cryptocurrency traders leave their reviews regarding their experiences with trading robots, brokers, or exchanges. From our understanding, many Bitcoin Bank users believe that it is reliable and trustworthy, considering that it is connected with regulated brokers. Also, it is the best for newbies since it is user-friendly and highly encrypted to secure email and data. On top of that, Bitcoin Bank is customizable, attracting all types of crypto traders and crypto investors, whether new or experienced.\n\nWhat Are the Top Bitcoin Bank Reviews on Trustpilot?\n\nWe also visited Trustpilot, and the results are similar to what we got on Reddit. Besides it being user-friendly and customizable, most Bitcoin Bank users think it is affordable since you only need to pay a minimum of $250 to use it. Plus, the robot has a reliable support service working round the clock to help you with any concerns or challenges.\n\nIs There a Bitcoin Bank Alternative?\n\nYes, there are many more crypto robots available. If you don't want to use Bitcoin Bank, check out some of our other reviews:\n\nConclusions. Bitcoin Bank Review Canada\n\nIn conclusion, Bitcoin Bank offers plenty of benefits to new users for a small deposit. However, the fact remains that trading bot is a dangerous game even if you know what you are doing. With potentially huge leverages and even larger financial risk, you may prefer more tried-and-true methods to invest in Bitcoin.\n\nFind Out About More About Robots"
    },
    {
        "id": 77,
        "url": "https://news.google.com/rss/articles/CBMiugFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vYnVzaW5lc3MvY3J5cHRvL2NyeXB0b2N1cnJlbmN5LXByaWNlLXRvZGF5LWluLWluZGlhLWZlYnJ1YXJ5LTktY2hlY2stZ2xvYmFsLW1hcmtldC1jYXAtYml0Y29pbi1idGMtZXRoZXJldW0tZG9nZS1zb2xhbmEtbGl0ZWNvaW4tcm9ja2V0LXBvb2wtZ2FpbmVyLWxvc2VyLTE1ODEwMDnSAb4BaHR0cHM6Ly9uZXdzLmFicGxpdmUuY29tL2J1c2luZXNzL2NyeXB0by9jcnlwdG9jdXJyZW5jeS1wcmljZS10b2RheS1pbi1pbmRpYS1mZWJydWFyeS05LWNoZWNrLWdsb2JhbC1tYXJrZXQtY2FwLWJpdGNvaW4tYnRjLWV0aGVyZXVtLWRvZ2Utc29sYW5hLWxpdGVjb2luLXJvY2tldC1wb29sLWdhaW5lci1sb3Nlci0xNTgxMDA5L2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "Cryptocurrency Price Today: Bitcoin Slides Below $23,000, AGIX Becomes Top Loser - ABP Live",
        "content": "Bitcoin (BTC), the world’s oldest and most valued cryptocurrency, slipped below the $23,000 mark yet again after just a day of gain. Ethereum (ETH), on the other hand, managed to remain above the $1,600 mark for nearly a week now. Other popular altcoins — including the likes of Dogecoin (DOGE), Ripple (XRP), Litecoin (LTC), and Solana (SOL) — saw a mix of reds and greens across the board. The SingularityNET (AGIX) token managed to become the top loser, with a 24-hour dip of over 30 percent.\n\nThe global crypto market cap stood at $1.05 trillion at the time of writing, registering a 24-hour gain of 3.52 percent.\n\nBitcoin (BTC) price today\n\nBitcoin price stood at $22,580.99, registering a 24-hour dip of 2.99 percent, as per CoinMarketCap. According to Indian exchange WazirX, BTC price stood at Rs 19.35 lakhs.\n\nEthereum (ETH) price today\n\nETH price stood at $1,624.87, marking a 24-hour dip of 3.23 percent at the time of writing. As per WazirX, Ethereum price in India stood at Rs 1.40 lakhs.\n\nDogecoin (DOGE) price today\n\nDOGE registered a 24-hour loss of 5.79 percent, as per CoinMarketCap data, currently priced at $0.08714. As per WazirX, Dogecoin price in India stood at Rs 7.52.\n\nLitecoin (LTC) price today\n\nLitecoin saw a 24-hour loss of 5.07 percent. At the time of writing, it was trading at $96.26. LTC price in India stood at Rs 8,128.57.\n\nRipple (XRP) price today\n\nXRP price stood at $0.3922, seeing a 24-hour loss of 2.20 percent. As per WazirX, Ripple price stood at Rs 33.22.\n\nSolana (SOL) price today\n\nSolana price stood at $22.45, marking a 24-hour gain of 6.16 percent. As per WazirX, SOL price in India stood at Rs 2,032.\n\nTop crypto gainers today (February 9)\n\nAs per CoinMarketCap data, here are the top five crypto gainers over the past 24 hours:\n\nRocket Pool (RPL)\n\nPrice: $45.53\n\n24-hour gain: 6.67 percent\n\nOasis Network (ROSE)\n\nPrice: $0.0686\n\n24-hour gain: 5.55 percent\n\nLido DAO (LDO)\n\nPrice: $2.72\n\n24-hour gain: 3.29 percent\n\nWOO Network (WOO)\n\nPrice: $0.2457\n\n24-hour gain: 0.26 percent\n\nPAX Gold (PAXG)\n\nPrice: $1,863.96\n\n24-hour gain: 0.17 percent\n\nTop crypto losers today (February 9)\n\nAs per CoinMarketCap data, here are the top five crypto losers over the past 24 hours:\n\nSingularityNET (AGIX)\n\nPrice: 0.4499\n\n24-hour loss: 30.97 percent\n\nRender Token (RNDR)\n\nPrice: $1.63\n\n24-hour loss: 22.09 percent\n\nThe Graph (GRT)\n\nPrice: $0.1714\n\n24-hour loss: 16.42 percent\n\nOptimism (OP)\n\nPrice: $2.62\n\n24-hour loss: 15.50 percent\n\nImmutableX (IMX)\n\nPrice: $0.966\n\n24-hour loss: 15.13 percent\n\nWhat crypto exchanges are saying about the current market scenario\n\nMudrex co-founder and CEO Edul Patel told ABP Live, “On Wednesday, Bitcoin traded sideways as market participants evaluated the latest news after three Federal Reserve governors indicated that central banks would increase interest rates more swiftly in the event of a deteriorating inflation environment. BTC was trading between $22,900 and $23,100. Despite a 1.4 percent decrease in the last 24 hours, Bitcoin has still seen a 38 percent increase this year. The second largest cryptocurrency, Ethereum, is following a similar pattern as Bitcoin, with a 1.8 percent decrease in the last 24 hours.”\n\nSathvik Vishwanath, CEO and co-founder of Unocoin said, “The cryptocurrency market is witnessing a bullish trend as Bitcoin (BTC) formed a “golden cross” with its 50-day SMA moving above the 200-day SMA, signalling a positive shift in market momentum. While the BTC/USD pair may face resistance near $23,250, the trend remains positive with the potential to reach $23,500. Traders are advised to closely monitor market developments and consider taking advantage of this positive trend.”\n\nKunji founder Anurag Dixit offered his take, “Layoffs and restructuring don't seem to slow down anytime soon. The multitude of data points released in the last two weeks and the number of points coming next week will keep the market volatility high. The ongoing restructurings denote the continued extreme macroeconomic uncertainty. While the markets have rallied since the start of the year, sustainable developments are what matter the most.\"\n\nShivam Thakral, the CEO of BuyUCoin, said, “The crypto market is showing cautious optimism as the US Fed chief has hinted that it may be winning the war against inflation and the disinflationary process has begun. The market immediately responded to the positive development and touched the $1.09 trillion market cap. BTC is up by 1.72 percent and crossed the $23,000 mark while Ethereum is up by a staggering 3 percent and is exchanging hands at the $1,680 level. The current momentum is expected to continue if macroeconomic factors remain favourable.”\n\nDisclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers."
    },
    {
        "id": 78,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3doYXQtaXMtdGhlLXJlbGF0aW9uc2hpcC1iZXR3ZWVuLWJsb2NrY2hhaW4tYW5kLWNyeXB0b2N1cnJlbmN5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "What Is the Relationship Between Blockchain and Cryptocurrency? - Analytics Insight",
        "content": "Everything you need to know about the relationship between blockchain and cryptocurrency\n\nEvery time we come across the word blockchain cryptocurrency comes automatically to our minds. Many believe that blockchain and cryptocurrency are synonymous and are often used interchangeably. To make it clear, cryptocurrencies are a type of digital money that uses blockchain technology to operate.\n\nIn this article, we are going to discuss the relationship between blockchain and cryptocurrency.\n\nWhat Is Cryptocurrency?\n\nCryptocurrency is a digital asset that has value like money. Crypto is created to foster easy exchange and the transactions made through crypto are recorded using blockchain technology.\n\nThe first cryptocurrency was bitcoin which has become synonymous with blockchain. Later then thousands of cryptocurrencies entered the market.\n\nWhat Is Blockchain?\n\nBlockchain was first introduced along with the launch of bitcoin. Blockchain is a decentralized ledger that keeps transaction records and these ledgers cannot be altered.\n\nOnce the transaction has been approved and included in a block, then it becomes permanent. Blockchain technology is completely decentralized meaning there is no central authority that owns or manages it. This makes the technology different and unique.\n\nThe information is saved in blocks. Every block consists of a specific number of transactions. When a block is finished, it is approved by the network and added to the blockchain, making it unchangeable.\n\nRelationship Between Cryptocurrency and Blockchain Technology\n\nCryptocurrencies and blockchain work together to create a decentralised, secure, and completely digital chain of transactions. There is no office, no warehouse where the servers are stored, and no other location where operations are carried out. Below are some similarities between the two:\n\nInterdependent\n\nBlockchain technology was developed to support Bitcoin. Or, to put it another way, Bitcoin would not have existed if there had been no blockchain. As a result, blockchain serves as the foundation for cryptocurrency. Both technologies are interconnected.\n\nAdvanced Technologies\n\nBlockchain and cryptocurrencies are both advanced technologies that many people are interested in. Many people are irritated because there is no authority to supervise. Cryptocurrencies are another advanced technology that made no sense when they first appeared. People were sceptical about how they could conduct transactions with money that didn’t exist physically. However, they are now widely accepted.\n\nIntangible\n\nBlockchains and cryptocurrencies are both intangible. There is no server or computer where you can access all of the data. As a distributed ledger, there is no such thing as blockchain ownership. The same is true for cryptocurrency, which is fundamentally different from fiat currency. You can’t physically touch or hold it.\n\nIs There Any Future lies for Cryptocurrency Without Blockchain Technology?\n\nBitcoin, the first cryptocurrency, was built on blockchain technology. Despite their popularity, there has always been a question about whether cryptocurrencies have a future without blockchain technology.\n\nFollowing Bitcoin, all new cryptocurrencies began to use blockchain technology, and blockchain and cryptocurrencies became inextricably linked in the public’s eyes. Even today, the majority of cryptocurrencies rely on blockchain technologies.\n\nHowever, this does not guarantee that the two technologies will work together in the future. IOTA is one such non-blockchain-based cryptocurrency. Instead, it is based on a mathematical concept known as “Tangle,” and it has already sparked an interest. Reason? Its creators claim that it will outperform and become faster than Bitcoin.\n\nIt is only the beginning of a new era in which blockchain and cryptocurrencies will be transformed in unimaginable ways and will have unforeseeable consequences for the future.\n\nTo Ease Exchange and Transfer\n\nBlockchain will shape the financial sector’s future. The financial sector’s goal is to make transfers and exchanges as simple as possible, but traditional banking methods are time-consuming, whereas blockchain transactions are simpler, faster, and more secure. Furthermore, they eliminate the need for intermediaries such as banks and allow users to transact directly with one another. Furthermore, because all transactions are recorded and irreversible, transparency and security are increased.\n\nCybersecurity\n\nBecause blockchain technology is decentralised, a hacker cannot target a single point. Because the data is distributed, blockchains are the safest storage option. Furthermore, unauthorised changes are easily traceable.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 79,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmJubmJsb29tYmVyZy5jYS9odXQtOC1taW5pbmctcy1tZXJnZXItd2l0aC11cy1iaXRjb2luLWJyaW5ncy1yZXZlbnVlLWRpdmVyc2lmaWNhdGlvbi1jZW8tMS4xODgxMTQ20gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 08:00:00 GMT",
        "title": "Hut 8 Mining's CEO on merger with US Bitcoin - BNN Bloomberg",
        "content": "Our merger with U.S. Bitcoin would have happened whether Bitcoin and FTX collapsed or not: Hut 8 CEO\n\nThe newly announced merger of US Bitcoin and Hut 8 Mining Corp will provide diversified revenue and help the combined business scale, according to the chief executive of the Toronto-based crypto mining company.\n\nThe all-stock merger was announced Tuesday in a news release and Hut 8 Mining‘s Jaime Leverton will continue to act as the chief executive officer. The combined company will be named Hut 8 Corp. and will be domiciled in the U.S.\n\nThe move toward consolidation comes amid volatility in crypto markets.\n\n“We think bringing these two entities together is just going to provide an incredible amount of scale [and] diversified revenue programs, which is very on strategy for both of us independently,” Leverton said in an interview with BNN Bloomberg Tuesday.\n\nThe merger will allow the company to be more competitive and cost-effective, she said.\n\nThe combined entity will have a market capitalization of roughly US$990 million, the release said.\n\nAccording to Leverton, the merger will also provide opportunities for diversification, both in terms of geography and revenue streams.\n\n“One of the advantages here is [that the merger is] giving us that geographic diversification. There's uncertainty in regulatory environments on both sides of the border,” she said.\n\n“I think it's in the best interest of our business to have diversified revenue streams [and] diversified geographies.”\n\nFollowing the collapse of FTX Group in November 2022, Leverton said interest in the crypto space is beginning to return.\n\n“I think we're seeing a lot of interest come back into this space [crypto], we've seen significant appreciation across the space so far in 2023,” she said.\n\nReturning interest in the crypto industry is a sign that fears stemming from the collapse of FTX are “starting to subside a little bit,” according to Leverton.\n\nLeverton said she believes there is an appreciation for crypto miners, similar to Hut 8, that take a “balance sheet first” approach with diversified revenue streams."
    },
    {
        "id": 81,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vYml0Y29pbmlzdC5jb20vYml0Y29pbi1leGNoYW5nZS1zdXBwbHktZGVjbGluZS1ob2xkZXItc2VsZi1jdXN0b2R5L9IBT2h0dHBzOi8vYml0Y29pbmlzdC5jb20vYml0Y29pbi1leGNoYW5nZS1zdXBwbHktZGVjbGluZS1ob2xkZXItc2VsZi1jdXN0b2R5L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 08 Feb 2023 21:01:35 GMT",
        "title": "Bitcoin Exchange Supply Drops, Holders Push To Self-Custody - Bitcoinist",
        "content": "On-chain data shows the Bitcoin supply on exchanges has decreased recently as holders have been pushing towards self-custody.\n\nBitcoin Supply On Exchanges Is At its Lowest Value Since November 2018\n\nAccording to data from the on-chain analytics firm Santiment, only $29.2 billion worth of BTC is left on exchanges now. There are two indicators of relevance here: the “supply on exchanges” and the “supply outside of exchanges.”\n\nAs their names already imply, they measure the total amount of Bitcoin currently sitting in centralized exchange wallets and the supply being kept in self-custodial wallets, respectively.\n\nGenerally, one of the main reasons investors deposit to exchanges is for selling purposes, so the supply on exchanges can reflect Bitcoin’s available selling supply.\n\nThus, whenever this metric’s value increases, there is a chance that the selling pressure in the market also goes up, and BTC observes a bearish impulse. Similarly, if it decreases instead (meaning that the supply outside of exchanges rises), the BTC’s price could see a long-term bullish effect.\n\nEarlier, investors used to believe that a supply shock could brew in the market if the supply on exchanges sufficiently decreased. But these days, the market environment is more diverse, so exchanges play a minor role.\n\nNonetheless, their supply can still hold some importance for the market. Here is a chart that shows the trend in the Bitcoin supply on exchanges, as well as the supply outside of these platforms, over the past year:\n\nLooks like the value of the metric has declined in recent days | Source: Santiment on Twitter\n\nAs displayed in the above graph, the Bitcoin supply on exchanges has been going down for quite a while, suggesting that investors have constantly been taking out a net amount of coins off these platforms.\n\nThe most significant decline during the past year came following the collapse of the cryptocurrency exchange FTX, which forced investors to reconsider their trust in centralized platforms, leading to many of them withdrawing massive amounts to self-custodial wallets. Only users hold the private keys to these wallets.\n\nThe drawdown of the indicator has continued recently while the price of the cryptocurrency has been consolidating sideways around the $23,000 mark. This may signify that some new accumulation has taken place at this level.\n\nWith the latest continuation of the decline, the BTC supply on exchanges, as measured by Santiment, has fallen to just 1.27 million BTC. The supply outside of exchanges has naturally grown while this has happened and has hit a new all-time high of 18.12 million BTC.\n\nThis means that the Bitcoin supply outside exchanges is 14.26 times the supply inside these platforms. This dynamic could have a positive effect in the cryptocurrency’s price over the coming months.\n\nBTC Price\n\nAt the time of writing, Bitcoin is trading around $23,000, down 1% in the last week.\n\nBTC continues to move sideways | Source: BTCUSD on TradingView\n\nFeatured image from Kanchanara on Unsplash.com, charts from TradingView.com, Santiment.net"
    },
    {
        "id": 82,
        "url": "https://news.google.com/rss/articles/CBMiOWh0dHBzOi8vZmluYm9sZC5jb20vZ3VpZGUvYnV5LWJpdGNvaW4td2l0aC1jaXRpemVucy1iYW5rL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 09 Feb 2023 08:00:00 GMT",
        "title": "How to Buy Crypto with Citizens Bank [2024] - Finbold - Finance in Bold",
        "content": "Summary: Citizens Bank does not offer an avenue to invest in cryptocurrencies directly on its platform. However, investors in the US can still use their Citizens banking accounts to buy digital assets like Bitcoin and Ethereum by using a licensed third-party crypto broker.\n\nTo buy crypto with Citizens Bank, we recommend using eToro, a trusted multi-asset investment platform that offers a wide variety of the world’s most popular cryptocurrencies and low trading fees. Moreover, as a platform registered with FINRA for securities trading, eToro is a safe and cost-effective option. Citizens Bank allows customers to transfer funds through various channels, including wire transfers, card deposits, or even ACH and PayPal.\n\nBest Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals.\n\n0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees.\n\nCopy top-performing traders in real time, automatically.\n\neToro USA is registered with FINRA for securities trading. 30+ million Users Get Started eToro is a multi-asset investment platform. The value of your investments may go up or down. Your capital is at risk. eToro USA LLC does not offer CFDs, only real Crypto assets available. Don’t invest unless you’re prepared to lose all the money you invest.\n\nCan you buy crypto with Citizens Bank?\n\nIt is possible to buy crypto using your Citizens Bank account. However, it is worth noting that Citizens Bank does not directly support investing in digital assets. It is neither a crypto brokerage nor an exchange.\n\nWhat it does allow its customers to do is transfer funds to another platform that already allows investing in these new-age digital assets. We recommend using a trusted platform such as eToro.\n\nThen with an eToro account, Citizens Bank customers can effortlessly send USD deposits and buy their favorite cryptocurrency. Depending on their preferred method of transfer, it is possible for them to go through the entire process in a few minutes or as long as a few days.\n\nHow to buy crypto with the Citizens Bank\n\nIf you are a Citizens Bank account holder and are looking to invest in Bitcoin (BTC), Ethereum (ETH), and any of the myriad cryptocurrencies available in the marketplace, you have several options. These include using unregulated brokerage and exchange platforms, peer-to-peer marketplaces, and cryptocurrency-dispensing ATMs.\n\nThe best option, however, is to use a US-based and licensed exchange because government agencies regulate these platforms. There are several benefits that come with that, such as protection against third-party risks, and ease of access to customer support services, and some of these even offer insurance for customer deposits.\n\nTherefore, to buy crypto assets using your Citizens account, ensure you use a licensed and regulated platform. We have highlighted that eToro is one of the best platforms for US-based residents because it offers cutting-edge and innovative products, and is available in over 46 U.S. states and in Washington, D.C.\n\nAdditionally, if you plan to invest in cryptocurrencies actively, you may find that eToro is particularly well suited to address your needs thanks to its social investing feature. Dubbed ‘copy trading,’ the feature enables novice investors to copy the trades of other more experienced eToro traders.\n\nHow to buy crypto with the Citizens Bank: Step-by-step\n\nTo start you off in your crypto investment journey, here is a simple and straightforward step-by-step process to buying crypto using Citizens Bank and eToro:\n\nStep 1 : Create an account on eToro platform and complete your identity verification (personal or company);\n\n: Create an account on eToro platform and complete your identity verification (personal or company); Step 2 : Navigate to eToro’s funding section, where you’ll fill in a transaction form to deposit USD from your Citizens Bank account or card;\n\n: Navigate to eToro’s funding section, where you’ll fill in a transaction form to deposit USD from your Citizens Bank account or card; Step 3 : Connect your Citizens Bank account to eToro. Alternatively, you can connect your Citizens payment card (debit or credit) from within the funding section. Then initiate the transaction;\n\n: Connect your Citizens Bank account to eToro. Alternatively, you can connect your Citizens payment card (debit or credit) from within the funding section. Then initiate the transaction; Step 4: Once you have successfully made the deposit, navigate to the crypto marketplace and locate your cryptocurrency of interest and buy it. Your crypto will be deposited into your eToro wallet, from where you can trade or transfer to a more secure cold wallet.\n\nDisclaimer: Cryptocurrency is offered by eToro USA LLC (“the MSB”) (NMLS: 1769299) and is not FDIC or SIPC insured. Investing involves risk, and content is provided for educational purposes only, does not imply a recommendation, and is not a guarantee of future performance. Finbold is not an affiliate and may be compensated if you access certain products or services offered by the MSB.\n\nCrypto on eToro. Source: eToro.com\n\n\n\nBest Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals.\n\n0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees.\n\nCopy top-performing traders in real time, automatically.\n\neToro USA is registered with FINRA for securities trading. 30+ million Users Get Started eToro is a multi-asset investment platform. The value of your investments may go up or down. Your capital is at risk. eToro USA LLC does not offer CFDs, only real Crypto assets available. Don’t invest unless you’re prepared to lose all the money you invest.\n\nAbout Citizens Bank\n\nCitizens Bank is among the fifteen largest US-based banking institutions by assets held, according to data from the Federal Reserve. It was established in 1828, making it one of the oldest banks in the US. However, despite its long history, Citizens Bank is a regional institute with a limited presence across the country.\n\nSo far, the bank maintains around 1,100 branches across 12 states, predominantly in the North East, Midwest, and the state of Florida. It has its headquarters in Providence, Rhode Island.\n\nCitizens’ homepage. Source: Citizensbank.com\n\nThe regional bank offers several products to its customers, including:\n\nChecking accounts;\n\nSavings accounts;\n\nMoney Market accounts;\n\nCredit and debit cards;\n\nMortgage and asset financing;\n\nIRAs;\n\nStudent loans;\n\nWealth management services.\n\nIf you live within the dozen states in which the Citizens Bank operates, the institution offers a solid choice, especially if you seek online and mobile banking.\n\nCitizens Bank crypto policy\n\nDespite the fact that Citizens Bank does not offer its customers a crypto investment platform, it does not limit them from transferring funds to regulated platforms to achieve the same goal. As we have outlined in this guide, if you have an account with a platform such as eToro, you will be able to deposit and withdraw funds to and from your Citizens account effortlessly.\n\nYou can do so using any of the myriad products offered by the bank, including checking accounts and credit/debit cards. Additionally, you can purchase various cryptocurrencies through any of the thousands of crypto ATMs available countrywide using a Citizens Bank payment card.\n\nFurthermore, Citizens Bank is a crypto-friendly bank that is actively involved in the crypto space. In March 2022, Citizens Bank announced a partnership with crypto transactions provider Worldpay to process Card-to-Crypto® transactions to digital asset companies – crypto exchanges, wallets, as well as brokers – for its US customers. The bank has also released an article about the benefits of the underlying blockchain technology for businesses.\n\nHow to buy crypto safely\n\nIt is easy to get scammed while trying to invest in cryptocurrencies. This is especially so for beginners, but even intermediate and expert investors do fall for these scams.\n\nTo protect yourself in the wild west of the cryptocurrency industry, there are three main considerations;\n\nThe investment platform – you need to ensure that you use trustworthy platforms when buying, selling, or trading cryptocurrency. A bulk of the losses experienced within this space have been borne by incidents such as rug pulls, system security, and counterparty risks; Your preferred payment method – when considering which payment method to use, ensure that you prioritize safety first. There are myriad ways to purchase crypto but some are safer compared to others. For instance, offline meetups to execute peer-to-peer transactions expose investors more than using online platforms; Regulatory provisions – it is just as crucial to also consider local and federal laws that affect cryptocurrency investments, as well as crypto tax. Ensure that you are not breaking any laws by investing in crypto. Also, ensure that you choose a brokerage or trading platform that is regulated and licensed to operate in your jurisdiction.\n\nOther general safety practices to observe\n\nSelf custody – once you purchase your cryptocurrency, it is highly recommended that you store them on a device or wallet that lets you keep the private keys to unlock your assets. The best option is to use a cold wallet such as Ledger or Trezor;\n\n– once you purchase your cryptocurrency, it is highly recommended that you store them on a device or wallet that lets you keep the private keys to unlock your assets. The best option is to use a cold wallet such as Ledger or Trezor; Observe proper crypto security hygiene – you can enhance the security and safety of your assets by practicing effective risk management strategies. Always use 2-factor authentication (2FA) for all your online accounts including email, use private devices to access and transfer your crypto, properly back up the keys to your wallets, and invest in sound crypto projects. These are just some of the few strategies you can use to safeguard your digital assets;\n\n– you can enhance the security and safety of your assets by practicing effective risk management strategies. Always use 2-factor authentication (2FA) for all your online accounts including email, use private devices to access and transfer your crypto, properly back up the keys to your wallets, and invest in sound crypto projects. These are just some of the few strategies you can use to safeguard your digital assets; Invest in educational resources – to make better investment decisions about digital assets and avoid common investing mistakes, you will have to immerse yourself in learning and increasing your knowledge. Especially, ensure to invest in learning about updated strategies to protect and safeguard your crypto.\n\nHopefully, these strategies will get you on the right footing to becoming a good crypto investor. You can gain more information on this and other topics by going through our comprehensive knowledgebase of guides, reviews, and tutorials.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk.\n\nFAQs about how to buy crypto with the Citizens Bank\n\nBest Crypto Exchange for Intermediate Traders and Investors Invest in 70+ cryptocurrencies and 3,000+ other assets including stocks and precious metals.\n\n0% commission on stocks - buy in bulk or just a fraction from as little as $10. Other fees apply. For more information, visit etoro.com/trading/fees.\n\nCopy top-performing traders in real time, automatically.\n\neToro USA is registered with FINRA for securities trading. 30+ million Users Get Started eToro is a multi-asset investment platform. The value of your investments may go up or down. Your capital is at risk. eToro USA LLC does not offer CFDs, only real Crypto assets available. Don’t invest unless you’re prepared to lose all the money you invest.\n\nHow to buy crypto with Citizens Bank? If you have a Citizens Bank account, you can buy crypto through another regulated and licensed platform by transferring USD from your account and then making the purchase.\n\nCan you buy crypto with Citizens Bank? Yes, you can buy cryptocurrency with funds in your Citizens Bank account. However, you will need to use a third-party crypto brokerage or trading platform such as eToro to which you will send funds.\n\nCan I buy Bitcoin with Citizens Bank? Yes, you can buy Bitcoin with your Citizens Bank account. Citizens Bank crypto users can use their accounts to transfer funds to a third-party crypto exchange or an online broker such as eToro.\n\nIs Citizens Bank crypto-friendly? Yes, Citizens Bank is crypto-friendly and supports funds transfers to and from regulated crypto investment platforms. Additionally, the bank allows card transactions through crypto ATMs.\n\nWhat crypto exchanges does Citizens Bank allow? Citizens Bank allows its users to transact with FinCEN-regulated crypto investment platforms, through which you can buy, sell and trade hundreds of digital assets."
    }
]