[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEyLTE2L3RoZS1kZWFkbGluZS1mb3ItdGhlLXNlYy10by1kZWNpZGUtb24tYS1idGMtYml0Y29pbi1ldGYtaXMtamFuLTEw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "The Deadline for the SEC to Decide on a (BTC) Bitcoin ETF Is Jan. 10 - Bloomberg",
        "content": "There’s likely fewer than 30 days left before the crypto world’s inevitable Bloomberg Terminal leap into traditional finance offers digital-money proponents a path to redemption post-FTX.\n\nThat’s the bullish narrative in virtual-currency land as the clock ticks down to Jan. 10 – when US regulators must finally decide whether to greenlight a physically-backed Bitcoin ETF. The Securities and Exchange Commission will by that time be required to either accept or deny an application from Cathie Wood ’s ARK Investment and 21Shares, who were the first to file during this year’s batch of applicants. It could at that time also rule on other similar filings. More than 10 companies are working toward getting these ETFs — which would directly hold Bitcoin — green-lit."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzEyLzE1L2JpdGNvaW4tYXQtcmlzay1vZi1zbmFwcGluZy1oaXN0b3JpYy13aW5uaW5nLXN0cmVhay1idXQtcGVyZmVjdC1zdG9ybS1icmV3cy1mb3ItYS1zdHJvbmctMjAyNC_SAY4BaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMi8xNS9iaXRjb2luLWF0LXJpc2stb2Ytc25hcHBpbmctaGlzdG9yaWMtd2lubmluZy1zdHJlYWstYnV0LXBlcmZlY3Qtc3Rvcm0tYnJld3MtZm9yLWEtc3Ryb25nLTIwMjQvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin at Risk of Snapping Historic Winning Streak, but 'Perfect Storm' Brews for a Strong 2024 - CoinDesk",
        "content": "He said the Federal Reserve hinting at easing monetary policy and cutting rates next year injected a \"windfall of confidence\" in risk assets like crypto, but the more prevalent theme is still an increasingly anticipated U.S. regulatory approval for spot bitcoin exchange-traded funds (ETFs) by BlackRock and others, and the fresh demand for BTC they would unleash."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9zZWNzLXBlaXJjZS1zcG90LWJpdGNvaW4tZXRmLTIxNDAzMzIxNS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "SEC's Peirce: Spot Bitcoin ETF Is Past Due - Yahoo Finance",
        "content": "SEC's Peirce: Spot Bitcoin ETF Is Past Due\n\nSEC Commissioner Hester Peirce agrees with some of the most bullish cryptocurrency investors—a spot bitcoin ETF should have been approved years ago and that regulators have been standing in the way, she says.\n\n“I thought that we should have approved one of these over five years ago, so the fact that we haven’t done it yet is a mystery to me,” Peirce said Thursday at Bloomberg’s ETFs in Depth Conference in New York.\n\nDespite her favorable comments about the ETF, Peirce declined to say whether she thinks it will be approved. Anticipation is building before a Jan. 10 deadline to approve or deny ARK/21Shares' spot bitcoin ETF application, and the price of bitcoin has more than doubled this year in anticipation of a vote.\n\nETF issuers and cryptocurrency firms have been filing to launch a spot bitcoin ETF for years, but the Securities and Exchange Commission has denied applications on the grounds of preventing market manipulation and protecting investors.\n\nYet after Grayscale Investments won a watershed lawsuit against the agency in late August, the SEC begun to meet with some prospective issuers to move their applications along and amend the filings to the SEC’s liking. Firms such as Grayscale, BlackRock and Fidelity Investments have been meeting with the SEC in recent weeks, according to memos.\n\nThe ETF and crypto ecosystems are “ready” to embrace a spot bitcoin ETF, according to Peirce. “We have experience with foreign jurisdictions having experience with products that are not spot, but futures products,” she said.\n\nSpot Bitcoin ETF Race\n\nPeirce, who was appointed to the SEC in 2018 by then-President Donald Trump, has iterated her stance on cryptocurrency before, making her an outlier among SEC officials.\n\n“What I do think the SEC needs to change is its attitude towards all things crypto and blockchain,” she said.\n\n“It has gotten to be a little ridiculous that we take a position that the moment something involves crypto, we start applying standards that are different,” she said of the ETF approval process.\n\nStory continues\n\nSEC Chairman Gary Gensler has expressed trepidation, if not hostility, toward cryptocurrency.\n\n“We don’t need more digital currency…we already have digital currency; it’s called the U.S. dollar,” he said in June.\n\nContact Lucy Brewster at lucy.brewster@etf.com.\n\n\n\n\n\nPermalink | © Copyright 2023 etf.com. All rights reserved"
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvYml0Y29pbi1taW5pbmctY2FuLWhlbHAtZmlnaHQtbWV0aGFuZS1lbWlzc2lvbnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin Mining Can Help Fight Methane Emissions - Nasdaq",
        "content": "Traditionally, the mining industry has been vilified for its environmental impact and energy use. This article describes the industry where mining can have an immediate positive impact – fossil fuel operations.\n\nBackground\n\nThe run-up to November 2023 COP28 in Dubai has seen a flurry of activity from the world’s three largest economies on the question of energy sector methane. That month, China published its long-awaited Methane Emissions Control Action Plan, followed by the China-US Sunnylands Statement on Enhancing Cooperation to Address the Climate Crisis and the European Council and Parliament announcing a deal on new rules to cut methane emissions in the energy sector. Prolific emitters, like Kazakhstan and Turkmenistan, added themselves to the 150 signatories of the Global Methane Pledge.\n\nThe momentum continued, with 50 oil and gas companies that represent 40% of global petroleum production signing the Oil and Gas Decarbonization Charter and committing to end methane emissions and routine gas flaring by 2030.\n\nFinally, the world is waking up to the fact that if we are to have any chance of limiting global warming to 1.5 degrees by 2050, we must act decisively to stop the venting and flaring of methane from the global oil, gas, and coal industries.\n\nBut amongst the excitement, it is forgotten that reducing the flaring and venting of methane necessarily involves capturing and utilizing it. A question no one seems to be asking is what to do with all this methane.\n\nThe Bad And The Ugly Of Fossil Fuel Methane\n\nThe atmospheric methane emissions have tripled since the start of the industrial revolution, believed to be responsible for 0.5 degrees of the 1 degree warming we saw to date. The International Panel on Climate Change states that if we are to have any chance of limiting global warming to 1.5 degrees by 2050, we must act decisively on methane.\n\nThe International Energy Agency’s (IEA) Methane Tracker estimates that one-third of man-made methane emissions comes from the production, transportation, and use of fossil fuels. This totals around 120 million tonnes of methane annually, evenly split between the oil, gas, and coal industries. The impact is equivalent to 10 billion tonnes of carbon dioxide – more than the United States' and EU’s CO2 emissions combined.\n\nThe IEA’s Net Zero by 2050 roadmap states that in order to limit the rise in global temperatures to 1.5 °C above pre-industrial levels, the energy sector must reduce its methane emissions by 75% by 2030, predominantly through the “the rapid deployment of measures and technologies to eliminate avoidable methane emissions by 2030.”\n\nThe Methane Tracker shows that 75% of global fossil fuel methane emissions come from 10 regions:\n\nThe Potential Role Of Bitcoin Mining In Greenhouse Gas Reduction\n\nIn September 2022, White House Office of Science and Technology Policy published a report on Climate and Energy Implications of Crypto-Assets in the United States. One of the report’s conclusions was that “crypto-asset mining operations that capture vented methane to produce electricity can yield positive results for the climate, by converting the potent methane to CO2 during combustion…; could potentially be more reliable and more efficient at converting methane to CO2 [than flaring]... and …is more likely to help rather than hinder U.S. climate objectives.”\n\nThe IPCC estimates that over 20 years, a tonne of methane has a climate change impact equivalent to 80 tonnes of carbon dioxide. Hiveon, a top-rated suite of mining products, calculates that using otherwise vented methane to generate the electricity needed to produce one Bitcoin would lead to reductions in greenhouse gas emissions equivalent to 6’000 tonnes of CO2, or the annual emissions of 1,400 passenger cars in the US.\n\n“We acknowledge the crypto industry’s carbon emissions, but also believe in its ability to act as an important tool in combatting climate change. That’s why we launched Hiveon Energy, a project in the intersection of the blockchain field and traditional energy industries. It’s our contribution to making mining more sustainable while also helping reduce greenhouse gas emissions,” – Andrii Garanin, VP of Hiveon Energy.\n\nJust 1MW of Bitcoin mining equipment could destroy over 800 tonnes of methane annually, providing greenhouse gas reductions equivalent to a typical 140 MW solar facility in the US. With just the global Bitcoin industry requiring 10-15 GW of power generation capacity, it has huge potential to reduce methane emissions.\n\nWhy Mining\n\nThe IEA estimates that it’s possible to capture and use 75% of the methane vented from oil and gas production and about 50% from coal. Methane is a valuable commodity, but there is a reason why so much of it is vented rather than sold or utilized.\n\nThis is because the majority of vented energy sector methane is almost by definition stranded gas. Fossil fuel operators are profit-driven, so if they had a way to monetize the wasted methane, they would have used it.\n\nVented methane comes from regions like Shanxi, Inner Mongolia, the Middle East, Caspian, etc. These regions are already massive producers of fossil fuels, so they have few customers for natural gas. It needs to be transported to customers as LNG, through pipelines, or as electricity, which involves extensive investments in infrastructure, as well as substantial legal, regulatory, and commercial barriers.\n\nThese investments have long payback periods, making them challenging in the current context where the world needs to rapidly ramp down its production of fossil fuels.\n\nThe mining industry can act as a global buyer of stranded natural gas. Miners require no access to the grid or power markets – just the gas supply, a plot of land, and an internet connection.\n\nMost importantly, because such projects can use modular, mobile solutions, the equipment can be moved easily and cheaply in case of localized issues around gas supply or power demand.\n\nWhat’s Next?\n\nUndeniably, the global crypto industry is a large consumer of electricity, part of which comes from the burning of fossil fuels. But it’s also a major potential customer for otherwise vented methane, providing an enormous opportunity to reduce methane emissions globally.\n\nThe major barrier is a lack of knowledge from global policymakers and the mining industry about the workings of such an enterprise. Despite the challenges, we need policies that will promote the use of vented gas, or at least not hinder it by regulations such as blanket bans on mining.\n\nAs stated by Dr. Sultan Al Jaber, “The world will break down if we don’t fix the energies we use today. The world will break down if we don’t mitigate the emissions on a gigaton scale.”\n\nThis is a guest post by Andrii Garanin. Opinions expressed are entirely their own and do not necessarily reflect those of BTC Inc or Bitcoin Magazine.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9kb250LXVuZGVydmFsdWUtYml0Y29pbi1ldGYtaW5mbHVlbmNlLXNheXMtYWRhbS1iYWNr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "$100K BTC? Don't undervalue Bitcoin ETF influence, says Adam Back - Cointelegraph",
        "content": "The COVID-19 pandemic, rampant inflation and regional conflicts directly influenced Bitcoin’s (BTC) drop in value over the past two years. However, 2024 promises to be a resurgent period, according to Blockstream CEO Adam Back.\n\nThe cryptographer, who pioneered the proof-of-work algorithm applied in Bitcoin’s protocol, tells Cointelegraph that the preeminent cryptocurrency is trailing below the historical price trend line of previous mining reward halving events.\n\n“Biblical” events hurt Bitcoin\n\nBack weighed in on the potential price action of Bitcoin as the next halving approaches, which will see Bitcoin miners’ block reward reduced from 6.25 BTC to 3.125 BTC. Block reward halvings are programmatically hardwired into Bitcoin’s code, taking place after every 210,000 blocks.\n\nBitcoin’s supply issuance is hardwired into its protocol, with BTC mining rewards halving every 210,000 blocks. Source: bitcoinblockhalf.com\n\nBack says that the overlaid averages of the previous market cycles and halvings indicate that Bitcoin’s relative value is trailing behind widely accepted projections. Multiple events have played a role in driving the price of BTC down, which has also been seen across traditional financial markets:\n\n“The last few years were like biblical pestilence and plague. There was COVID-19, quantitative easing and wars affecting power prices. Inflation running up people, companies are going bankrupt.”\n\nThe impact has keenly affected markets and portfolio management, according to Back. Investment managers have had to manage risk and losses over the past few years, which has necessitated the sale of more liquid assets.\n\n“They have to come up with cash, and sometimes they’ll sell the good stuff because it’s liquid and Bitcoin is super liquid. It used to happen with gold, and I think that’s a factor for Bitcoin in the last couple of years,” Back explains.\n\nBitcoin would have hit $100,000 already\n\nAs 2023 comes to a close, many of these macro events that Back cited have wound down, while more industry-specific failures have also been resolved. This has been reflected in Bitcoin’s recent price surge from Nov. 2023 onwards.\n\n“The wave of the contagion, the companies that went bankrupt because they were exposed to Three Arrows Capital, Celsius, BlockFi and FTX — that’s mostly done. We don’t think there are many more big surprises in store,” Back said.\n\nRelated: Blockstream targets continued Bitcoin miner surplus with Series 2 BASIC Note\n\nThe Blockstream CEO previously predicted that Bitcoin would hit $100,000 in the next market cycle and referred back to this point. He believes BTC would have hit this mark already if not for the macro factors highlighted before.\n\nBack also referred to the Bitcoin “stock-to-flow” model created by pseudonymous former institutional investor PlanB as a reference point for the potential upside for Bitcoin in 2024.\n\nIf you want to know more about bitcoin Stock-to-Flow:\n\n* This is the original 2019 article:https://t.co/n5P5uMCKHT\n\n* Or watch this YouTube video:https://t.co/3SGMU1Ln00 pic.twitter.com/Qp8SjqtXIB — PlanB (@100trillionUSD) December 5, 2023\n\nBack explains that PlanB’s model and heuristics suggest that savvy Bitcoin investors historically bought BTC six months before a halving event and sold into significant surges in price that have occurred in the 18 months following the drop in mining rewards:\n\n“People thought it was a bit of a crazy assertion that we might get to $100,000 pre-halving because I said it when the price was around $20,000.”\n\nHe adds that Bitcoin’s price hitting $44,000 multiple times in Dec. 2023 suggests that his prior prediction might not be so far-fetched.\n\nThe Bitcoin ETF effect\n\nProminent investors and market analysts have also highlighted the effect of the potential approval of several spot Bitcoin exchange-traded fund (ETF) applications by the United States Securities and Exchange Commission (SEC).\n\nPeople asking me if we changed odds. No, we still holding line at 90% odds of approval by Jan 10 (aka this cycle), the same odds we've had for months (before it was cool/safe). What we watching for now: more amended/final filings to roll in and clarity on in-kind vs cash creates https://t.co/uiWgfxOfzz — Eric Balchunas (@EricBalchunas) November 29, 2023\n\nSenior ETF analysts Eric Balchunas and James Seyffart have touted these applications to get the green light in early 2024. Galaxy Digital’s co-founder Michael Novogratz has also predicted mass inflows of institutional investment into the BTC-backed products, a point echoed by Back:\n\n“I think Bitcoin could get to $100,000 even before the ETF and before the halving. But I certainly think the ETF shouldn’t be undervalued in its influence.”\n\nA key reason cited by the Bitcoin advocate is that whole segments of traditional markets, including major fund managers like BlackRock and Fidelity, are simply not allowed to invest directly into assets like Bitcoin.\n\nRelated: Bitcoin ETFs will drive institutional adoption in 2024 — Galaxy Digital’s Mike Novogratz\n\n“If they’re managing a mutual fund, they have rules, either externally imposed or as part of their fund, that they can only buy things like public stocks and ETFs. They can’t buy into startups, they can’t buy precious metals physically. They can’t do any of that stuff,” Back said.\n\nThis remains a pertinent reason why a spot Bitcoin ETF could drive significant capital inflows into the space. Back adds that the investment vehicle opens access to Bitcoin exposure for many types of funds, particularly in the U.S., that are more inclined to do so through Fidelity or BlackRock than with a cryptocurrency exchange.\n\nMagazine: ‘Elegant and ass-backward’: Jameson Lopp’s first impression of Bitcoin"
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LnVzZnVuZHMuY29tL3Jlc291cmNlLzUtYml0Y29pbi1hbmQtZGlnaXRhbC1hc3NldC1wcmVkaWN0aW9ucy1mb3ItMjAyNC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "5 Bitcoin and Digital Asset Predictions for 2024 | USGI - U.S. Global Investors",
        "content": "If today were the last day of 2023, Bitcoin would have returned almost 155%, marking the best year since 2020, when it rose a phenomenal 305%.\n\nLike the market in general, Bitcoin has notched a strong ending to 2023 after trading rangebound for most of the year. If today were the last day of 2023, the king of digital assets would have returned almost 155%, marking the best year since 2020, when it rose a phenomenal 305%.\n\nWith only two weeks remaining in December, I figured now would be an ideal time to share my top five Bitcoin and digital asset predictions for 2024. As a reminder, these are my personal predictions and do not reflect those of U.S. Global Investors.\n\n1. A spot Bitcoin ETF will launch in the U.S., sparking a price revaluation.\n\nThere are no guarantees in life, but a U.S.-based spot Bitcoin ETF now appears to be imminent.\n\nBloomberg Intelligence puts the odds of the Securities and Exchange Commission (SEC) approving a filing by January 10 at 90%. It’s possible we’ll see back-to-back launches of Bitcoin ETFs in January—as many as 10, Bloomberg estimates.\n\nHow will this affect the price of the underlying asset? Spot Bitcoin ETFs are available in other markets, including Canada and Europe, but it’s worth noting that the U.S. accounts for approximately 60% of the total global equity market value. One data analytics firm says that the demand spurred by a spot ETF could push the price of Bitcoin to between $50,000 and $73,000. Some readers will find this estimate too conservative.\n\nIt may be instructive to review what happened to the price of gold—Bitcoin’s analog cousin—after the launch of the first U.S.-based gold commodity ETF, SPDR Gold Shares (GLD). Before GLD and the similarly gold-backed iShares Gold Trust (IAU), investors were limited to physical bullion (which can be costly to move and store) and the futures market (which may not be appropriate for every investor).\n\nMaking its debut in November 2004, GLD increased overall demand for gold by reducing the frictional costs associated with investing in the metal and making it more accessible to a broader investor base.\n\nSince that time, the price of gold has increased nearly 360%.\n\nWhile I’m on this topic, a spot Ethereum ETF could also be made available in 2024. The SEC’s decision on two specific filings, from VanEck and Ark/21Shares, is expected in May. Unlike Bitcoin, Ether is not considered a commodity, but I believe such an ETF will similarly drive demand for crypto.\n\n2. Smaller miners will struggle to survive after the halving.\n\nAs many of you know, Bitcoin was programmed to have a limited supply. The number of tokens that will ever exist is capped at 21 million, and every four years, the digital asset undergoes an event called the halving. The next halving is expected in April 2024, after which the mining reward will be trimmed by 50%, from 6.25 BTC per block to 3.125 BTC.\n\nThis is a double-edged sword. On the one hand, the price of Bitcoin has historically rallied immediately before and after previous halving events as investors act on the reminder that supply is highly restricted.\n\nOn the other hand, smaller and less well-capitalized crypto miners will likely struggle to survive as the difficulty rate continues to climb and the mining reward is reduced by half. At the end of last month, crypto miners Hut 8 and US Bitcoin Corp completed their merger, and I expect to see additional business deals as the industry positions itself for this new era of mining difficulty.\n\n3. The $84 trillion wealth transfer will greatly benefit digital assets.\n\nThe world is about to witness the largest transfer of wealth in human history. Over the next two decades, members of the Silent Generation (those born before 1946) and Baby Boomers (1946 – 1964) will leave their heirs an estimated $84.4 trillion, with Millennials (1981 – 1996) being the primary beneficiary.\n\nThis will have a number of major ramifications, but as blockchain firm Galaxy reminds us, Millennials and younger generations “have a higher preference for crypto” than their parents and grandparents. Not only are members of this cohort “digital natives,” but they’ve also lived through a series of financial setbacks (the Great Recession, high inflation, restrictive borrowing costs) that, in many cases, have sullied their trust in traditional financial institutions and assets. A 2022 Investopedia survey found that Millennials as a whole were more likely to invest in cryptocurrencies than in stocks, mutual funds, ETFs, commodities and real estate.\n\nSays Galaxy’s Charles Yu, “Shifting wealth from older generations into the hands of this crypto-friendly population is likely to result in greater inflows into Bitcoin and the broader crypto asset class.”\n\n4. NFTs and Ordinals will make a huge comeback.\n\nNon-fungible tokens, or NFTs, have lost much of their cache since the bull run of 2021-2022. Many of these digital assets, permanently inscribed on the Ethereum blockchain, used to trade hands for millions of dollars. Today, however, an estimated 95% of NFTs are “worthless,” according to dappGambl.\n\nIs the market ready for a renaissance? I believe so, though the Bitcoin network is fast becoming the preferred platform. One year ago this week, people began inscribing text, images and other media on Bitcoin, and by May, it was being reported that the Bitcoin blockchain was the second-most popular NFT platform after Ethereum.\n\nOrdinals, as NFTs on the Bitcoin network are called, now account for over half of all daily Bitcoin transactions, and trading volumes recently hit a new record high, soaring to $36 million on December 12.\n\n5. Bitcoin miners will continue to be good stewards of energy resources.\n\nBitcoin mining is often criticized for its energy consumption, but much of this energy comes from renewable sources such as hydroelectric power, wind and solar. What’s more, in the first half of 2023, the global Bitcoin network used only 0.21% of the world’s energy, an inconsequential amount, according to the Bitcoin Mining Council (BMC).\n\nAnother important development is the use of stranded gas, a byproduct of oil and gas operations, which is used in mining to prevent waste and reduce carbon and methane emissions. This approach is financially beneficial for miners, as it generates more revenue compared to selling the gas at market prices. It can also help comply with regulations limiting gas flaring.\n\nOn a final note, excess heat from Bitcoin mining can be recycled, as HIVE Digital Technologies is doing in Lachute, Quebec. Heat from its Bitcoin operations is being used to warm a neighboring facility, an approximately 200,000-foot swimming pool manufacturer.\n\nHave a wonderful weekend, and happy investing!\n\nIndex Summary\n\nThe major market indices finished up this week. The Dow Jones Industrial Average gained 2.92%. The S&P 500 Stock Index rose 2.61%, while the Nasdaq Composite climbed 2.85%. The Russell 2000 small capitalization index gained 5.66% this week.\n\nThe Hang Seng Composite gained 2.49% this week; while Taiwan was up 1.67% and the KOSPI rose 1.82%.\n\nThe 10-year Treasury bond yield fell 31 basis points to 3.911%.\n\nAirlines and Shipping\n\nStrengths\n\nThe best performing airline stock for the week was Allegiant, up 10.2%. According to Bank of America, system net sales rose 10.7% for the week in the strongest datapoint since mid-August and ahead of the flat four-week average. Both pricing and volumes accelerated this week to -0.8% and 11.6%, respectively, compared to -4.6% and 8.4% last week. The data aligns with the strong holiday demand commentary the bank has been hearing from the airlines and is better than expected heading into the off-peak period between Thanksgiving and Christmas. Large corporate travel accelerated for the third consecutive week to positive 6.9%, the strongest datapoint since late April.\n\nAccording to Morgan Stanley, air freight rates from Shanghai to North America and Europe have increased 70-75% since September 2023. The group thinks China’s growing cross-border e-commerce has been one of the key drivers in addition to seasonality. In transportation, higher air freight rates should benefit players that own freighters, such as SF Holding, Cathay Pacific, and China Southern Airlines.\n\nSouthwest Airlines published an investor update tightening its December quarter revenue outlook to the better end of its prior range due to stronger-than-expected close-in bookings (including managed corporate) in the second half of the quarter. The company now expects unit revenue to be down 9% to 10% year-over-year versus down 9% to 11% prior.\n\nWeaknesses\n\nThe worst performing airline stock for the week was Sun Country, down 5.2%. According to Bank of America, China’s air travel demand appears to be weaker than expected since November on both the domestic and non-domestic fronts. Non-domestic capacity resumption has been largely in line, and the bank expects 70% capacity by the end of 2023 and 80% by March of 2024. However, non-domestic demand resumption remains uncertain, considering headwinds from weak income outlook, RMB depreciation, and negative travel sentiment related to Southeast Asia and Japan. That said, it may take longer than expected for demand to recover from 70-80% of pre-Covid levels to a full recovery. The bank now expects a full non-domestic travel recovery to occur in the first half of 2025.\n\nScorpio Tankers updated its mid-fourth quarter TCE rates, with charter rates that were slightly shy of its targets. Its rates imply a fourth quarter fleet TCE average of approximately $33,000 per day. This implies net voyage revenues of $330 million. It booked 92%, 87%, and 84% of its spot LR2, MR, and Handymax revenue days at $38,000, $32,500, and $30,000 per day, respectively.\n\nSouthwest Airlines’ flight attendants rejected a tentative flight agreement as 64% of attendants voted against the proposal. The Transport Workers Union (TWU) represents 19,000 flight attendants seeking higher pay and better work rules. The five-year proposal included a 20% pay raise beginning next month and a 3% annual raise between 2025 and 2028, as well as parental leave with insurance coverage.\n\nOpportunities\n\nAccording to Bank of America, United Airlines raised Atlantic capacity by 260/250 basis points (bps) in April/May bringing growth in those months up 5%, ahead of -1% in the first quarter of 2024, as the carrier allows 2023’s capacity growth in the region to mature. Delta Air Lines similarly added 120bps of Atlantic capacity in March and April while bringing May capacity up 70bps. In April/May, Delta’s Atlantic capacity growth is tracking 4% higher, only slightly ahead of the first quarter of 2024 at 3.5%.\n\nStar Bulk (SBLK) and Eagle (EGLE) are merging on a NAV-to-NAV basis. EGLE shareholders will receive 2.6211 shares of SBLK for each share of EGLE. That works out to a $52.60 per share valuation, a 17% premium. The new company will be owned 71% by current SBLK shareholders and 29% by EGLE shareholders. Both boards have agreed to the transaction.\n\nAccording to Morgan Stanley, the latest forecast of the Forward Leading Indicator Traffic Estimate (FLITE) index, the group’s proprietary short-term leading indicator of U.S. domestic air travel, predicts that RPKs will see a strong uptick in early 2024. As the Covid shock has faded significantly from 2020 peaks, the cycle component has dominated more heavily calling for a steady trend in the RPKs within the next six months, followed by a sharp inflection in March/April 2024. Normal seasonality accounts for an uptick during this time of the year, but the estimated 2024 uptick reaches pre-pandemic levels. The net result is that, per the index, demand in early 2024 is set to align with what normal growth trends from prior to the pandemic would have looked like, if the COVID pandemic had not occurred at all – a new milestone in the normalization of demand post-pandemic.\n\nThreats\n\nFlight attendant contracts are another cost headwind for U.S. airlines in 2024, which could be up to a 1 ppt CASM-ex headwind. Currently, only DAL/LUV include higher flight attendant (FA) pay in earnings. United’s FA leadership requested mediation in a December 5 filing after 26 months of negotiations. American Airlines’ FAs remain in mediation while Southwest’s FAs voted against a TA by 64%.\n\nA relatively large part of the global container capacity will be affected by the EU’s requirement that shipping from the turn of the year must buy quotas for ships’ CO2 emissions. According to Alphaliner, the numbers from the end of November show that at least 10.5 million TEU, twenty-foot containers of the total global container capacity, move in and out of EU ports and will thus be affected. This corresponds to more than 37% of the container fleet.\n\nAccording to Raymond James, forecasting the standalone earnings outlook is particularly challenging for Spirit given the GTF engine issue. In late October, the company noted 10 AOG (aircraft on ground) in the fourth quarter of this year, with an average of 26 in 2024 (starting at 13 in January and stepping up to 41 in December). They are currently assuming an average of 17 AOG in 2025.\n\nLuxury Goods and International Markets\n\nStrengths\n\nNovember retail sales in the United States were reported at 0.3%, a surprise increase against the consensus for a 0.2% contraction. Annualized retail sales rose to 4.1%, up from the downwardly revised October 2.2% and the highest since February.\n\nSpanish luxury retailer, ITX (best known for its brand Zara), reported an earnings beat this week, along with Costco. Costco declared a special dividend of $15 per share, payable on January 12, 2024, to shareholders of record as of the close of business on December 28. Zara announced further expansion in the United States, with a focus on shoppers in Utah, Colorado, Texas, and Tennessee.\n\nRH, a home furnishing store, was the best performing S&P Global Luxury stock, gaining 27.52% in the past five days. According to a Seeking Alpha article published this week, the company transformed into a luxury brand under the leadership of CEO Gary Friedman. RH expanded into different areas such as travel and real estate and wants to grow revenue from $3 billion to $20-25 billion.\n\nWeaknesses\n\nThe Eurozone flash PMI for December weakened, implying a slowdown in manufacturing and service activities. The composite PMI (which combines the production and service activities in the Euro area) recorded a two-month low of 47.0 versus a consensus of 48.0 and prior 47.6.\n\nThe New York Fed’s Empire State Index (a survey of business conditions in the New York region) dropped 24 points to -14.5 in December, hitting a four-month low, from a positive reading of 9.1 in November. Bloomberg economists expected a reading of 2.0. Any reading below 0 indicates worsening conditions.\n\nFarfetch, an online retailer, was the worst performing S&P Global Luxury stock, losing 47.74% in the past five days. According to a Sky News report, the company was in talks to secure emergency funding from a private equity firm due to financial trouble. UBS analyst Kunal Madhukar lowered the firm’s price target to 80 cents from $3.30 and kept a “neutral” rating on the shares. Shares of Farfetch closed at 64 cents on Friday.\n\nOpportunities\n\nOn Wednesday, the Federal Reserve acknowledged inflation has eased, saying that the central bank will not wait until inflation is back to 2% to start lowering rates. Rate cuts are widely expected now, with the first one as soon as March 2024. The stock market rallied, and the dollar weakened after Powell surprised with a dovish tone this week at the Fed meeting.\n\nBrunello Cucinelli released a year-end update to the market where the company upgraded its 2023 revenue growth guidance to 22-23% year-over-year (from 20-22%) and confirmed $10 revenue growth for 2024 and 2025. This became the fifth time that Cuccinelli upgraded current-year expectations when other luxury brands were experiencing much slower growth. Bank of America reiterated a “buy” rating for the company.\n\nMarriot International, the largest hotel chain in the world, partnered with a local hospitality company in Costa Rica, Enjoy Group, and is planning to open two luxury hotels in 2025. Marriot created two executive roles in its vacation ownership business aiming at driving the company’s long-term growth strategy. The hospitality industry continues to see strong demand for travel post-pandemic.\n\nThreats\n\nMost electric vehicle (EV) makers will get access to over 12,000 Tesla Superchargers starting next year. EV buyers may start looking more favorably upon brands other than Tesla. According to an article published on Bloomberg, the Hyundai IONIQ 6 model can charge its battery needed to drive 100 miles in about eight minutes, beating Tesla’s Model 3 by three minutes. This week Tesla also announced recalling nearly all of its cars sold in the U.S. (more than 2 million) produced between Oct 5, 2012, and December 7 of this year, due to defective self-driving systems. The competition among EVs is growing.\n\nJPMorgan cut the rating on shares of luxury giant Louis Vuitton to a “neutral,” setting a price target of 790 euros, implying a 7.7% increase in the price. The broker warned about the first half of 2024 and is more optimistic about the luxury sector performance in the second half of next year. Kering and Ferragamo were both placed on a negative watch.\n\nThis week China held the Central Economic Work Conference and investors were surprised by the lack of strong stimulus to boost the country’s growth. China’s top leaders vowed to make industrial policy a top economic priority for 2024 instead of any forceful stimulus. Fitch Ratings expects the growth rate for China to drop to 4.6% next year, from 5.3% this year.\n\nEnergy and Natural Resources\n\nStrengths\n\nThe best performing commodity for the week was coffee, rising 6.86%, to a seven-month high as inventories remain at 1999 lows while dry weather forecast in Brazil could potentially stress the crops and yield less to harvest this season. According to JPMorgan, in refining, gasoline cracks have improved, and inventory levels look tighter relative to seasonal norms than they did in the early fall, while diesel remains strong with tight inventories globally and resilient demand that has held up well despite issues in the global industrial economy and weather not being particularly accommodating to heating oil demand in late 2023.\n\nAccording to JPMorgan, for copper prices to break and rally above $9,000/mt in 2024, the group still thinks a recovery impulse in ex-Chinese demand is needed. Nonetheless, in the near term, the significantly tighter supply outlook will likely be reflected in a higher risk premium in prices in the coming quarters driving a higher forecast price floor around $8,500-$8,600/mt over the first half of 2024.\n\nElectricity generated from U.S. solar and wind systems will surpass power produced by burning coal for the first time next year, driven by surging panel installations. Coal will produce about 599 billion kilowatt-hours in 2024, according to government data released Tuesday. That will be down from 669 billion kilowatt-hours this year as utilities continue to shutter coal-burning power plants.\n\nWeaknesses\n\nThe worst performing commodity for the week was natural gas, dropping 4.42%. Consumption of coal is set to peak this year at 8.5 billion metric tons, according to the International Energy Agency (IEA). Demand is expected to slide to 8.3 billion metric tons by 2026. While demand is being replaced with cleaner energy sources, the IEA doesn’t see the use of coal going away soon.\n\nAccording to JPMorgan, LNG spot prices averaged US$17.02/MMBtu in November 2023, up a further 4% from the prior month but still 40% below the previous comparable period. Prices have subsequently fallen to US$15.75/MMBtu. Average prices in November implied a slope of 20% against the three-month lagged Brent price. The forward curve is now in backwardation. Contracts are currently trading at US$14.42/MMBtu in December 2024, and US$13.27/MMBtu in December 2025.\n\nOil edged lower as continuous pressure from robust supplies globally countered curbs by the OPEC+ alliance. Global benchmark Brent traded near $76 a barrel. Futures last week dipped to a multi-month low on soaring output from producers outside of the Organization of Petroleum Exporting Countries and its allies.\n\nOpportunities\n\nGlobal copper supplies are tightening fast after the shuttering of a major mine in Panama and drastic output cuts at operations owned by Anglo American Plc. That has contributed to a slump in the fees charged by smelters to their lowest since March last year. The treatment charges, which determine margins, have dropped by about a quarter since August to $66.50 a ton, according to data from Metal Bulletin. The fees fall when there’s not enough copper concentrate for smelters to refine.\n\nAccording to RBC, the U.S. House passed a bill to ban Russian uranium imports today and a companion bill will now be considered by the U.S. Senate before being sent to the White House. RBC thinks a potential U.S. ban on Russian uranium imports, with temporary waivers until January 2028, would keep uranium markets tight long-term and there is potential for an immediate retaliatory Russian ban on uranium exports to the U.S. — Russia accounted for 24% of enrichment and 12% of uranium purchased by U.S. utilities in 2022. If Russia implements an immediate export ban, RBC expects uranium prices to rise near-term as U.S. utilities seek alternative supply in an already tight market.\n\nOccidental Petroleum Corp. agreed to acquire Texas shale driller CrownRock LP in a cash-and-stock deal valued at about $10.8 billion as consolidation heats up in North America’s most-prolific oil basin. The transaction is expected to close in the first quarter of 2024, subject to regulatory approvals, Occidental said Monday in a statement. The company has lined up $10 billion of committed bridge financing through Bank of America Corp., according to an investor presentation.\n\nThreats\n\nMining billionaire Robert Frieland commented that in order to meet the rising demand for critical minerals, copper prices forecasted to reach $9,000 a metric ton next year isn’t enough of a price incentive to bring on new production, considering the risks of huge capital-intensive mines, especially in Latin America. To spur new mine development, Frieland said the industry needs $15,000 a ton prices to spur the investment in new mines.\n\nAccording to JPMorgan, the spot prices for lithium carbonate and hydroxide have dropped significantly in the past month, by 34% and 26%, respectively, to Rmb100,000/ton. The bank maintains its bearish view due to ,1) larger surpluses across the forecast horizon, with weaker demand outweighing the impact of lower supply; and 2) marginal cost continuing to decrease. According to SMM, the China lepidolite cost curve is Rmb 70,000/ton on average, and there is no pressure to reduce supply, as miners and integrated refiners are still profitable.\n\nOPEC+ will need to carefully control oil supplies for another five years to avoid a “meltdown” in crude prices, according to Rapidan Energy Group. While global oil demand will not peak for at least another decade, supplies from outside OPEC — particularly the U.S. — are growing much faster than previously estimated, the Washington- based consultant said in its latest long-term report.\n\nBitcoin and Digital Assets\n\nStrengths\n\nOf the cryptocurrencies tracked by CoinMarketCap, the best performer for the week was Bonk, rising 128%.\n\nThe amount of funds that crypto projects have lost to hackers has declined by about half to around $1.7 billion so far this year, reports Bloomberg. This comes amid improved security measures and an uptick in law enforcement actions.\n\nA former private banking executive at Credit Suisse has launched a crypto trading venue targeting banks and securities firms as clients. David Riegelnig co-founded the Zurich-based startup Rulematch, which offers a crypto trading venue for financial institutions only, writes Bloomberg.\n\nWeaknesses\n\nOf the cryptocurrencies tracked by CoinMarketCap, the worst performer for the week was Rocket Pool, down 14.68%.\n\nCathie Woods’ investment management firm ARK Invest sold Coinbase stock for a third straight day, as shares held steady within 5% of the year’s high, according to Bloomberg.\n\nBlockchain technology will be used to verify the real-name identities of China’s 1.4 billion people, according to an announcement from the Blockchain-based service network. This move is likely to spark concern among data privacy advocates, writes Bloomberg.\n\nOpportunities\n\nDeutsche Bank’s DWS group, Dutch market maker Flow Traders, and crypto fund manager Galaxy Digital Holdings, are planning to form a company to issue a euro-denominated stablecoin with the goal of driving more mainstream adoption of tokenized assets. The company will be based in Frankfurt and led by Alexander Hoptner, a veteran exchange executive and former CEO of crypto platform BitMex, writes Bloomberg.\n\nCoinbase Global is rolling out spot crypto trading on its international exchange as part of a global expansion, saying some users are wary of U.S. venues due to the country’s uncertain regulatory backdrop, Bloomberg reports.\n\nLine Next, the South Korea-based NFT unit of a joint venture between SoftBank and Naver, has secured $140 million from a consortium led by Crescendo Equity Partners, even as hype around the digital collectibles has faded, writes Bloomberg.\n\nThreats\n\nSam Bankman-Fried’s (SBF) lawyer says his client was the “worst” witness he has ever seen, going off-script when he took the stand. That’s the view of David Mills, the behind-the-scenes architect of the FTX co-founder’s defense at trial, writes Bloomberg.\n\nKuCoin one of the largest and most popular cryptocurrency exchanges, has agreed to pay $22 million in fines and refunds and stop trading in New York to resolve a lawsuit by the state. The payments will resolve claims that KuCoin failed to register as a securities and commodities broker-dealer and falsely represented itself as a crypto exchange, Bloomberg reports.\n\nThe latest crypto hack involved one of the industry’s top names in security: hardware wallet-maker Ledger. The Paris-based startup saw its Ledger Connect Kit software compromised, leading to hundreds of thousands of dollars being drained from users’ wallets early Thursday, writes Bloomberg.\n\nGold Market\n\nThis week gold futures closed at $2,033.00, up $18.50 per ounce, or 9.2%. Gold stocks, as measured by the NYSE Arca Gold Miners Index, ended the week higher by 4.38%. The S&P/TSX Venture Index came in up 1.24%. The U.S. Trade-Weighted Dollar fell 1.35 but closed up 0.63% on Friday.\n\nStrengths\n\nThe best performing precious metal for the week was palladium, up 24.32%. Palladium headed for its biggest gain since March 2020 as the United Kingdom government targeted Russian metals — but not palladium — with new sanctions. The metal, mainly used in catalytic converters, surged as much as 12% on Thursday after the UK published measures that ban British citizens and entities from buying certain Russian metals. Palladium is still down 38% this year, with manufacturers using the cheaper platinum as a substitute.\n\nGold headed for a weekly gain in a market dominated by the Federal Reserve’s strongest indications yet that it will pivot to easing monetary policy next year. The precious metal surged 2.4% on Wednesday when officials at the U.S. central bank indicated they expect to cut interest rates by 75 basis points next year, which would be positive for the non-interest-bearing metal. Economists at some of Wall Street’s biggest banks are now calling for the Fed to ease policy earlier and faster.\n\nLoncor Gold announced it has entered into an agreement for the sale of Loncor’s Makapela property for CDN$13.5 million cash. The agreement calls for the sale price to be paid in a series of progress payments beginning with a deposit of $2 million. The balance of the progress payments, totaling $11.5 million, will be paid upon completion of the transfer of title to Makapela, which is expected to occur before the end of February 2024. Makapela was a noncore asset, and now Loncor is funded for 2024.\n\nWeaknesses\n\nThe worst performing precious metal for the week was gold, but still up 0.92%. Workers at a South African platinum mine returned to the surface after almost three days underground following what the company called an illegal sit-in. Employees at Wesizwe Platinum’s Bakubung operation northeast of Johannesburg resurfaced following discussions between management and union leadership, the company said, without elaborating on the content of the discussion.\n\nPetra Diamonds has entered into a non-binding term sheet on an exclusive basis with an interested party for the potential sale of its South African Koffiefontein Mine. There is the risk that the price may be less than expected as diamond prices and volumes are declining. The share price of Petra Diamonds is off slightly more than 40% year-to-date.\n\nThe value of polished stone exports from India—a proxy for demand—was down 13% year-over-year, while volumes decreased by 7% YoY, implying aggregate prices remained increased by 2% month-over-month, but down by 6% year-over-year. The Indian diamond industry ended its voluntary suspension of rough diamond import this past Friday, as there as signs of stability emerging but need further confirmation on an improvement in market condition.\n\nOpportunities\n\nAccording to Bank of America, gold remains a trade on rates. Thus, once the Fed announces a decisive end to the hiking cycle, expected in the second quarter 2024, new buyers should come into the market. If the Fed cuts earlier, gold could end the year at $2,400 per ounce versus spot around $1,980. The bank’s gold price model factors in changes in gold prices, rates and the U.S. dollar, not levels. The bottom line: rates and the dollar matter, with changes in direction more important than the actual levels. As such, Bank of America expects the next leg higher for the gold price will come when the Fed cuts rate, likely in 2024.\n\nShares in Compania de Minas Buenaventura surged after Chilean copper producer Antofagasta unveiled a stake in the Peruvian miner, in an apparent move to diversify geographically away from Chile and add gold and silver exposure. Peru’s top publicly traded precious metals producer jumped as much as 27% in New York trading Friday. Antofagasta, the London-listed company controlled by Chile’s richest family, said it acquired a 19% stake and entered into discussions with Buenaventura to develop “a framework of collaboration,” including joining its board. “Our investment demonstrates the significant potential we see in Buenaventura’s asset portfolio,” Chairman Jean-Paul Luksic said in a statement.\n\nCited on Barron’s favorite 10 stocks for 2024 is Barrick Gold. Gold mining stocks haven’t been able to keep up with gold prices, but 2024 may be the year that changes for Barrick. Gold miners are thought of as leveraged plays on the metal, yet Barrick shares are up just 3% this year while gold is up more than 10% to $2,036 an ounce. The company has some of the world’s best mines in spots like Nevada and the Dominican Republic, and it’s the top gold producer in Africa. It aims to boost its gold and to a lesser extent copper by 30% by the end of the decade. It has the industry’s most effective leader in CEO Mark Bristow, a hands-on manager who visits each major mine at least three times a year. He also has a knack for handling delicate relations with host countries in the developing world. “Barrick probably has the best management in the mining business, an excellent balance sheet with virtually no net debt, and a well-covered 2.3% dividend yield,” says independent analyst Keith Trauner. The stock trades for about 16 times next year’s projected earnings.\n\nThreats\n\nPlatinum group metals (PGM) prices have been under pressure, partially because palladium and platinum are key in auto catalysts, so the two metals are heavily exposed to cars with a combustion engine; under the technology status quo, palladium is one of the first commodities impacted by the energy transition. Anglo American notes that “The (platinum-group metals) basket price is now firmly into the cost curve, with sector returns at the lowest point seen in the last 30 years.” It remains to be seen how long these prices persist and its effect on several producers.\n\nAlthough gold finished the week up, profit taking at the end of the week on Friday trimmed the gains for the week as the Fed’s John Williams says talks of a rate cut in March are premature, tempering some of the enthusiasm the market has priced in. This lifted the dollar about 60 bp higher for the day but the 10-year yield displayed only a muted lift higher. Not a clear signal for the next direction in gold.\n\nRussian gold miners Highland Gold Mining, GV Gold, Trans-Siberian Gold and Kamchatka Gold were sanctioned by the U.S. government. The U.S. didn’t give any reason for the sanctions against the mining companies in an accompanying press release, but in February warned that any company or individual operating in the Russian metals and mining sector could be subject to sanctions.\n\nU.S. Global Investors, Inc. is an investment adviser registered with the Securities and Exchange Commission (“SEC”). This does not mean that we are sponsored, recommended, or approved by the SEC, or that our abilities or qualifications in any respect have been passed upon by the SEC or any officer of the SEC.\n\nThis commentary should not be considered a solicitation or offering of any investment product. Certain materials in this commentary may contain dated information. The information provided was current at the time of publication. Some links above may be directed to third-party websites. U.S. Global Investors does not endorse all information supplied by these websites and is not responsible for their content. All opinions expressed and data provided are subject to change without notice. Some of these opinions may not be appropriate to every investor.\n\nHoldings may change daily. Holdings are reported as of the most recent quarter-end. The following securities mentioned in the article were held by one or more accounts managed by U.S. Global Investors as of (09/30/2023):\n\nSouthwest Airlines\n\nAmerican Airlines\n\nUnited Airlines\n\nDelta Air Lines\n\nCostco\n\nITX\n\nBrunello Cucinelli\n\nMarriot International\n\nTesla\n\nLouis Vuitton\n\nLoncor Gold Inc.\n\nAnglo American Platinum Ltd.\n\n*The above-mentioned indices are not total returns. These returns reflect simple appreciation only and do not reflect dividend reinvestment.\n\nThe Dow Jones Industrial Average is a price-weighted average of 30 blue chip stocks that are generally leaders in their industry. The S&P 500 Stock Index is a widely recognized capitalization-weighted index of 500 common stock prices in U.S. companies. The Nasdaq Composite Index is a capitalization-weighted index of all Nasdaq National Market and SmallCap stocks. The Russell 2000 Index® is a U.S. equity index measuring the performance of the 2,000 smallest companies in the Russell 3000®, a widely recognized small-cap index.\n\nThe Hang Seng Composite Index is a market capitalization-weighted index that comprises the top 200 companies listed on Stock Exchange of Hong Kong, based on average market cap for the 12 months. The Taiwan Stock Exchange Index is a capitalization-weighted index of all listed common shares traded on the Taiwan Stock Exchange. The Korea Stock Price Index is a capitalization-weighted index of all common shares and preferred shares on the Korean Stock Exchanges.\n\nThe Philadelphia Stock Exchange Gold and Silver Index (XAU) is a capitalization-weighted index that includes the leading companies involved in the mining of gold and silver. The U.S. Trade Weighted Dollar Index provides a general indication of the international value of the U.S. dollar. The S&P/TSX Canadian Gold Capped Sector Index is a modified capitalization-weighted index, whose equity weights are capped 25 percent and index constituents are derived from a subset stock pool of S&P/TSX Composite Index stocks. The NYSE Arca Gold Miners Index is a modified market capitalization weighted index comprised of publicly traded companies involved primarily in the mining for gold and silver. The S&P/TSX Venture Composite Index is a broad market indicator for the Canadian venture capital market. The index is market capitalization weighted and, at its inception, included 531 companies. A quarterly revision process is used to remove companies that comprise less than 0.05% of the weight of the index, and add companies whose weight, when included, will be greater than 0.05% of the index.\n\nThe S&P 500 Energy Index is a capitalization-weighted index that tracks the companies in the energy sector as a subset of the S&P 500. The S&P 500 Materials Index is a capitalization-weighted index that tracks the companies in the material sector as a subset of the S&P 500. The S&P 500 Financials Index is a capitalization-weighted index. The index was developed with a base level of 10 for the 1941-43 base period. The S&P 500 Industrials Index is a Materials Index is a capitalization-weighted index that tracks the companies in the industrial sector as a subset of the S&P 500. The S&P 500 Consumer Discretionary Index is a capitalization-weighted index that tracks the companies in the consumer discretionary sector as a subset of the S&P 500. The S&P 500 Information Technology Index is a capitalization-weighted index that tracks the companies in the information technology sector as a subset of the S&P 500. The S&P 500 Consumer Staples Index is a Materials Index is a capitalization-weighted index that tracks the companies in the consumer staples sector as a subset of the S&P 500. The S&P 500 Utilities Index is a capitalization-weighted index that tracks the companies in the utilities sector as a subset of the S&P 500. The S&P 500 Healthcare Index is a capitalization-weighted index that tracks the companies in the healthcare sector as a subset of the S&P 500. The S&P 500 Telecom Index is a Materials Index is a capitalization-weighted index that tracks the companies in the telecom sector as a subset of the S&P 500.\n\nThe Consumer Price Index (CPI) is one of the most widely recognized price measures for tracking the price of a market basket of goods and services purchased by individuals. The weights of components are based on consumer spending patterns. The Purchasing Manager’s Index is an indicator of the economic health of the manufacturing sector. The PMI index is based on five major indicators: new orders, inventory levels, production, supplier deliveries and the employment environment. Gross domestic product (GDP) is the monetary value of all the finished goods and services produced within a country’s borders in a specific time period, though GDP is usually calculated on an annual basis. It includes all private and public consumption, government outlays, investments and exports less imports that occur within a defined territory.\n\nThe S&P Global Luxury Index is comprised of 80 of the largest publicly traded companies engaged in the production or distribution of luxury goods or the provision of luxury services that meet specific investibility requirements.\n\nThe S&P Global Luxury Index is comprised of 80 of the largest publicly traded companies engaged in the production or distribution of luxury goods or the provision of luxury services that meet specific investibility requirements.\n\nBitcoin difficulty is a measure of how many hashes (statistically) must be generated to find a valid solution to solve the next Bitcoin block and earn the mining reward.\n\nThe Empire State Manufacturing Index rates the relative level of general business conditions New York state."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEyLzE1L2NyeXB0by1pcy1vbi10aGUtcmlzZS1hbmQtY291bGQtaGVscC15b3UtYmVjb21lLWEv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Crypto Is on the Rise and Could Help You Become a Millionaire: 2 Unstoppable Crypto Stocks to Buy in 2024 - The Motley Fool",
        "content": "When most people think about becoming a crypto millionaire, they usually think about buying a single crypto like Bitcoin (BTC -5.71%) and then holding on to it as it delivers stratospheric returns. Over a long enough period of time, even a relatively small upfront investment could turn into $1 million or more. And, indeed, according to Henley & Partners' Crypto Wealth Report, there are more than 40,000 Bitcoin millionaires in the world right now.\n\nBut here's another strategy that you might not have considered: buying crypto stocks that have the potential to outperform Bitcoin. This year, for example, Bitcoin is up more than 160%, but a number of crypto stocks are up 300% or more for the year. Here's a closer look at two crypto stocks that could help put you on the path to millionaire status.\n\nCoinbase Global\n\nCryptocurrency exchange Coinbase Global (COIN -7.17%), up a sizzling 330% in 2023, could be one of the biggest beneficiaries of any extended Bitcoin rally in 2024. When Bitcoin is down, investor interest wanes. But when Bitcoin is up, investors suddenly decide to dip their toes into the crypto waters. So Bitcoin could be the key to bringing in new users and increasing overall trading volume.\n\nBitcoin now accounts for about a third of all trading volume on the Coinbase platform. Thus, while Coinbase offers 240 possible cryptos to trade, the real focus is on Bitcoin. And right now, Coinbase appears to be looking for ways to tap into the growing investor excitement around Bitcoin. In one recent marketing promotion, all you had to do was make a single crypto trade on the platform, and you'd be entered into a drawing for two Bitcoins (worth more than $86,000 at today's prices).\n\nIn addition to courting the individual retail investor, Coinbase has been looking for ways to become more attractive to large institutional investors. In August 2022, for example, it partnered with BlackRock, the largest asset manager in the world, to provide crypto trading services to institutional investors. Then, last June, BlackRock tapped Coinbase to be the custodian for its highly anticipated spot Bitcoin exchange-traded fund (ETF) offering.\n\nAnd there are other long-term initiatives on tap at Coinbase, including one that involves the tokenization of real-world assets. The big idea here is to enable Wall Street firms to trade traditional financial assets on the blockchain. In August, Coinbase launched Base, its own proprietary blockchain, to help make that a reality.\n\nThe big caveat, of course, is that Coinbase has delivered such outsize returns this year that some institutional investors are starting to take profits on their positions. Ark Invest, for example, recently sold $100 million in Coinbase shares in a single week. This is most likely just routine portfolio rebalancing at the end of the year, but what if Cathie Wood of Ark Invest thinks the rally was overdone?\n\nMicroStrategy\n\nAnother crypto stock that is highly leveraged to the price of Bitcoin is MicroStrategy (MSTR -5.06%). On the surface, MicroStrategy might look a lot like an enterprise software stock. But MicroStrategy is really just a giant Bitcoin treasury. Some have even compared the company to a Bitcoin ETF.\n\nCurrently, MicroStrategy holds 174,530 Bitcoins on its balance sheet, making the company the largest public holder of Bitcoin in the world. To put that number into context, the current circulating supply of Bitcoin is about 20 million coins. Thus, MicroStrategy controls just under 1% of the total available Bitcoin supply in the world.\n\nAs might be imagined, this means that the price of MicroStrategy is highly leveraged to the price of Bitcoin. If Bitcoin goes up, then the price of MicroStrategy goes up. Year to date, Bitcoin is up more than 160% this year, and MicroStrategy is up 310%. As long as the price of Bitcoin continues to go up, the value of MicroStrategy should continue to go up too.\n\nJust keep in mind, though, that most of MicroStrategy's market value is tied up in Bitcoin. The total market cap of MicroStrategy right now is $9.1 billion, while the total value of the Bitcoins on its balance sheet is $7.5 billion. Thus, the market is giving only a small valuation to the underlying software business of MicroStrategy. While the company is now getting into AI-powered software solutions, the core enterprise software business of MicroStrategy is only growing at a 1% clip.\n\nHow much Bitcoin is too much Bitcoin?\n\nIn 2024, investors will have several ways to buy Bitcoin. They can buy Bitcoin directly in the crypto market. They will be able to buy Bitcoin via new spot Bitcoin ETFs that are expected to arrive in the first quarter of the year. And, finally, they can buy Bitcoin via \"Bitcoin proxy stocks\" like Coinbase and MicroStrategy.\n\nSo, as an investor, the question becomes: How much Bitcoin is too much Bitcoin? If you already have a sizable position in Bitcoin, you might want to diversify elsewhere beyond just companies that are tied to the price of Bitcoin. But if you are looking to amplify your Bitcoin returns and accelerate your path to millionaire status, it might be worth considering these stocks as a way to turbocharge your portfolio returns."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vY3J5cHRvcG90YXRvLmNvbS9hbmFseXN0cy13ZWlnaC1pbi1vbi10aGUtcG9zc2liaWxpdHktb2Ytbm8tYmlnLWJpdGNvaW4tYnVsbC1tYXJrZXQv0gFgaHR0cHM6Ly9jcnlwdG9wb3RhdG8uY29tL2FuYWx5c3RzLXdlaWdoLWluLW9uLXRoZS1wb3NzaWJpbGl0eS1vZi1uby1iaWctYml0Y29pbi1idWxsLW1hcmtldC8_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Analysts Weigh in on the Possibility of No Big Bitcoin Bull Market - CryptoPotato",
        "content": "On Dec. 14, Bitcoin pioneer Nic Carter asked the burning question. Almost everyone assumes that we’re due for a 2017/18 or 2021/22-esque bull run, he said.\n\n“I’ll be the guy to ask why. Do you have any basis for this or have you trained a model on 2 data points?” he asked.\n\nThe question is valid since the global economic situation is very different now from the previous cycle highs.\n\nalmost everyone on here assumes that we’re due for a 2017/18 or 2021/22 esque bull run. i’ll be the guy to ask why? do you have any basis for this or have you trained a model on 2 datapoints? — nic 🌠 carter (@nic__carter) December 14, 2023\n\nMostly Positive Responses\n\nThe first responses pointed out that the halving and issuance drop was the catalyst for bull markets.\n\nHowever, Carter has an alternative theory in the Efficient Market Hypothesis (EMH), which suggests that asset prices reflect all available information on that asset.\n\nWhen applied to Bitcoin, the EMH argues that Bitcoin’s price would already reflect all relevant information on supply and demand, making it difficult to predict whether the asset is overvalued or undervalued at any given time.\n\nBitMEX Research pointed out that there have been four major cycle peaks, not two, adding:\n\n“But yes it’s inevitable these bull runs end at some point, or that the cycle length increases significantly.”\n\nBitcoin educator Dan Held commented, “Humans will continue to speculate/gamble. That’s the assumption.”\n\nInvestment analyst Lyn Alden said she expected the space will “generally continue correlating with various measures of global liquidity,” adding:\n\n“No firm view on 2024, but by the end of the combined 2024/2025 period I would be somewhat surprised if liquidity is not higher than now.”\n\nMeanwhile, co-CEO of CoinRoutes Dave Weisberger said that the Bitcoin network is more than twice as powerful as it was at the previous peak. He also said that Bitcoin ETFs will open up the asset to anyone with a brokerage account or pension fund.\n\nMoreover, multiple high-profile investors have been converted to a belief in Bitcoin, increasing the odds of adoption as “digital gold,” he concluded.\n\nPrimed For a Bull Market\n\nIn a separate post, trader Bob Loukas commented on the indicators, suggesting there will be a big bull run.\n\nHe noted that interest rates have peaked, ETFs are around the corner, and the Bitcoin four-year cycle just completed its first quarter. “Asset class acceptance accelerating,” he concluded.\n\nRates have peaked. The #bitcoin 4 Year cycle just completed its first 1/4. ETF’s are coming. Asset class acceptance accelerating. The confluence is near perfect. The market will test you, often. Broaden the timeframe to weather volatility. Timing and discipline is key — Bob Loukas 🗽 (@BobLoukas) December 14, 2023\n\nEarlier this week, CryptoPotato reported that Bitwise predicted BTC would reach $80,000 in 2024, and most are in agreement that momentum is back with the digital asset class."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5idXNpbmVzc3dpcmUuY29tL25ld3MvaG9tZS8yMDIzMTIxNTA3MjYwMi9lbi9DYXRoZWRyYS1CaXRjb2luLUFubm91bmNlcy1DbG9zaW5nLW9mLURlYnQtU2V0dGxlbWVudC1hbmQtRGViZW50dXJlLUV4dGVuc2lvbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Cathedra Bitcoin Announces Closing of Debt Settlement and Debenture Extension - Business Wire",
        "content": "TORONTO--(BUSINESS WIRE)--(Block Height: 821,350) – Cathedra Bitcoin Inc. (TSX-V: CBIT; OTCQB: CBTTF) (“Cathedra” or the “Company”), a diversified bitcoin mining company, is pleased to announce that, further to its previous press release on November 21, 2023, the Company has settled a portion of the outstanding principal amount of Debentures (as defined below) equal to C$10,743,329 (the “Settlement Amount”) into 96,439,227 common shares (the “Shares”) of the Company (the “Debt Settlement”). The Shares were issued at a deemed price of C$0.1114 per Share. The debt was payable to certain debenture holders (the “Debenture Holders”) in respect of 3.5% senior secured convertible debentures of the Company due November 11, 2024 (the “Maturity Date”) originally issued to the Debenture Holders on November 11, 2021 (the “Debentures”).\n\nIn connection with the Debt Settlement, the Company has also repaid C$2,000,000 to retire C$3,333,333 of the outstanding principal amount of the Debentures, leaving an aggregate principal amount outstanding of the Debentures equal to C$5,733,728 as of the date hereof (the “Remaining Principal\").\n\nAdditionally, the maturity date for the Remaining Principal has been extended by an additional 12 months to November 11, 2025 (the “Extended Maturity”). No other changes to the Debentures were made; the Company will continue to pay quarterly interest at 3.5% per annum on the Remaining Principal balance until the Extended Maturity, whereupon the Remaining Principal is due in full.\n\nAll securities issued pursuant to the Debt Settlement are subject to a four month and one day hold period from the closing date of the Debt Settlement.\n\nAbout Cathedra Bitcoin\n\nCathedra Bitcoin Inc. (TSX-V: CBIT; OTCQB: CBTTF) is a Bitcoin company that believes sound money and abundant energy are the keys to human flourishing. The Company has diversified bitcoin mining operations which produce 355 PH/s across three states and five locations in the United States. The Company is focused on managing and expanding its portfolio of hash rate through a diversified approach to site selection and operations, utilizing multiple energy sources across various jurisdictions.\n\nFor more information about Cathedra, visit cathedra.com or follow Company news on Twitter at @CathedraBitcoin or on Telegram at @CathedraBitcoin.\n\nCautionary Statement\n\nTrading in the securities of the Company should be considered highly speculative. No stock exchange, securities commission or other regulatory authority has approved or disapproved the information contained herein. Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\n\nForward-Looking Statements\n\nThis news release contains certain “forward-looking information” within the meaning of applicable Canadian securities laws that are based on expectations, estimates and projections as at the date of this news release. The information in this release about future plans and objectives of the Company, are forward-looking information. Other forward-looking information includes but is not limited to information concerning: the Debt Settlement, the final approval of the TSXV, the intentions and future actions of senior management, the intentions, plans and future actions of the Company, as well as the Company’s ability to successfully mine digital currency; revenue increasing as currently anticipated; the ability to profitably liquidate current and future digital currency inventory; volatility of network difficulty and, digital currency prices and the resulting significant negative impact on the Company’s operations; the construction and operation of expanded blockchain infrastructure as currently planned; and the regulatory environment of cryptocurrency in applicable jurisdictions.\n\nAny statements that involve discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions, future events or performance (often but not always using phrases such as “expects,” or “does not expect,” “is expected,” “anticipates” or “does not anticipate,” “plans,” “budget,” “scheduled,” “forecasts,” “estimates,” “believes” or “intends” or variations of such words and phrases or stating that certain actions, events or results “may” or “could,” “would,” “might” or “will” be taken to occur or be achieved) are not statements of historical fact and may be forward-looking information and are intended to identify forward-looking information.\n\nThis forward-looking information is based on reasonable assumptions and estimates of management of the Company at the time it was made, and involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by such forward-looking information. The Company has also assumed that no significant events occur outside of the Company’s normal course of business. Although the Company has attempted to identify important factors that could cause actual results to differ materially, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information. The Company undertakes no obligation to revise or update any forward-looking information other than as required by law."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTEyLTE3L2lmLXlvdS1oZWxkLXlvdXItYml0Y29pbi1hbmQtZXRoZXJldW0tYWZ0ZXItZnR4LWNyYXNoLWl0LXMtY3J5cHRvbWFz0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "If You Held Your Bitcoin and Ethereum After FTX Crash, It's Cryptomas! - Bloomberg",
        "content": "It's Merry Cryptomas, everybody! Bitcoin is up 167% year-to-date. Ethereum is up 91%. If a massive crypto rally was one of your predictions for 2023 a year ago, I take my hat off to you. Compare those returns with other asset classes. The NASDAQ is up 36%. The S&P 500 is up 19%. Gold is up 10.7%. If you were long oil or a broad basket of commodities, you are down 10%-12%.\n\nA year ago, many of us thought — I certainly did — that it was game over for crypto and that the naysayers were going to be vindicated."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iZXR0ZXItYml0Y29pbi1zdG9jay1taWNyb3N0cmF0ZWd5LXZzLTEyMDEwMDQ2Ni5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Better Bitcoin Stock: MicroStrategy vs. Riot Platforms - Yahoo Finance",
        "content": "bitcoin-tokens\n\nMicroStrategy (NASDAQ: MSTR) and Riot Platforms (NASDAQ: RIOT) represent two different ways to invest in Bitcoin's (CRYPTO: BTC) rally of about 150% this year. MicroStrategy is a software company that started hoarding Bitcoin over the past three years. Riot is a leading Bitcoin mining company that mines BTC with its massive fleet of high-end miners.\n\nBoth stocks have skyrocketed this year, along with Bitcoin's price. MicroStrategy's stock has risen more than 290% this year, while Riot's stock has rallied more than 310%. Should investors chase either of these high-flying Bitcoin-related stocks right now?\n\nImage source: Getty Images.\n\nMicroStrategy operates two different businesses\n\nAt its core, MicroStrategy is an aging data mining and analytics company founded 34 years ago. It's expanded its ecosystem with more mobile and cloud services over the past two decades, but it's been struggling to keep pace with higher-growth cloud giants like Salesforce, Microsoft, and Amazon in the rapidly evolving market. That's why MicroStrategy's revenue grew at an anemic compound annual growth rate (CAGR) of less than 1% from 2010 to 2020.\n\nBut in August 2020, MicroStrategy's co-founder and then-CEO Michael Saylor drove the company to start spending the software segment's cash on big Bitcoin purchases. Its BTC holdings have risen from $250 million in its first big purchase to $4.7 billion in its latest quarter. That's more than 40% of MicroStrategy's current enterprise value of $9.4 billion.\n\nMicroStrategy currently holds 158,400 BTC on its balance sheet at an average purchase price of $29,586 -- so its investment is back in the black as of this writing. However, its rising BTC impairment charges also caused it to stay unprofitable over the past three years, while its issuing of fresh debt to fund its BTC purchases boosted its debt-to-equity ratio to 3.0. On the bright side, it's expected to return to profitability this year as it books lower impairment charges.\n\nStory continues\n\nBut as investors focus on its BTC investments, its core software business remains sluggish. Its total revenue only rose 1% year over year in the first nine months of 2023 as rising subscription revenue finally offset its declining product license and support revenues. Analysts expect its revenue to rise a mere 1% for the full year.\n\nThe bulls argue that MicroStrategy's enterprise value will eventually soar as it continues to buy BTC and stabilize its software business. However, a lot of growth could already be baked into its stock at 21 times next year's sales.\n\nRiot is a more straightforward Bitcoin play\n\nRiot was once a tiny patent holding company known as Bioptix, but it ditched its original business model and transformed into a dedicated BTC miner in 2017. It then purchased tens of thousands of top-tier Antminers from Bitmain.\n\nRiot had deployed a massive fleet of 112,944 miners by the end of November, which enables it to produce an average of 18.4 BTC every day. It's been selling hundreds of Bitcoins each month to boost its liquidity, but it was still holding 7,358 BTC (with a market value of $306 million) on its balance sheet at the end of November.\n\nRiot's business model is simpler than MicroStrategy's, but its fate is tethered to BTC's market price and volatile energy prices. In 2022, its revenue rose 22% to $259 million -- but its net loss widened from $8 million to $510 million as BTC's price plunged and energy prices spiked. However, analysts expect its revenue to rise 14% to $294 million this year as it narrows its net loss to $201 million.\n\nIf Bitcoin's price continues to rise as inflation cools off, Riot's revenues and profits could soar. It also plans to keep selling its excess power back to the grid at spot prices to stabilize its long-term operating margins. Riot can keep selling its own BTC to boost its cash flows, and its low debt-to-equity ratio of 0.1 still gives it plenty of room to raise more cash. And with an enterprise value of $2.9 billion, Riot looks a lot cheaper than MicroStrategy at 6 times next year's sales.\n\nBetter buy: Riot Platforms\n\nI personally think it makes more sense to directly buy Bitcoin instead of investing in these two capital-intensive companies. But if I had to choose one, I'd pick Riot because its business model is more straightforward, its growth rates are more stable, its balance sheet is healthier, and its stock looks cheaper relative to its long-term growth potential.\n\nShould you invest $1,000 in MicroStrategy right now?\n\nBefore you buy stock in MicroStrategy, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and MicroStrategy wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of December 11, 2023\n\nJohn Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Leo Sun has positions in Amazon. The Motley Fool has positions in and recommends Amazon, Bitcoin, Microsoft, and Salesforce. The Motley Fool has a disclosure policy.\n\nBetter Bitcoin Stock: MicroStrategy vs. Riot Platforms was originally published by The Motley Fool"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTIvMTUvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbi1lbmRzLXRoZS13ZWVrLWluLW11dGVkLW1vb2Qv0gFpaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMi8xNS9maXJzdC1tb3Zlci1hbWVyaWNhcy1iaXRjb2luLWVuZHMtdGhlLXdlZWstaW4tbXV0ZWQtbW9vZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Ends the Week in Muted Mood - CoinDesk",
        "content": "Following a surge to 20-month highs last week, bitcoin appears to have settled into a new range, trading between $42,000 and just over $43,000 for much of this week . The largest cryptocurrency is currently priced at around $42,600, down 0.65% in the last 24 hours. The CoinDesk Market Index (CMI), which offers a weighted view of the digital asset market at large, is down a similar amount. With a large degree of spot BTC ETF enthusiasm already priced into asset prices and with no decision on the approval of applications to list such a fund by the SEC expected until the new year, the crypto market is showing signs of ticking along sideways for the remainder of 2023."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zcG90LWJpdGNvaW4tZXRmLWFwcHJvdmFsLXByb3BlbC1idGMtMS1taWxsaW9uLWRheXMtdG8td2Vla3Mtc2Ftc29uLW1vd9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Spot Bitcoin ETF approval to propel BTC to $1M in 'days to weeks,' says Samson Mow - Cointelegraph",
        "content": "Bitcoin (BTC) will likely reach $1 million in the “days to weeks” following the approval of a spot BTC exchange-traded fund (ETF), according to Jan3 CEO Samson Mow.\n\n“You’re hitting a very limited supply of Bitcoin on the exchanges and available for purchase with a torrent of money,” Mow said, referring to the inflow of institutional capital that is expected following a potential spot ETF approval.\n\n“This is why you can go really high all at one time,” he added.\n\nCommenting on a similar $1 million-per-Bitcoin prediction by entrepreneur Balaji Srinivasan, Mow said that the impact of a spot Bitcoin ETF approval on prices will play out much faster than central bank money printing.\n\n“Money printing is like boiling the water very slowly,” he explained. “It takes years for that to permeate the economy.”\n\nUnlike previous rallies that led Bitcoin to new highs in a matter of months, Mow said the post-ETF approval rally to $1 million will be much quicker.\n\n“The run up in 2017 was nine months to 20x,” he recalled.\n\n“Given that we’re going to have billions and billions pouring in all at once on ETF approvals, I think it’s going to be a much shorter time frame,” Mow said.\n\nTo find out more about the rationale behind Mows’ price prediction, check out the full interview on the Cointelegraph YouTube channel, and don’t forget to subscribe!"
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9uZXdzbGV0dGVycy8yMDIzLTEyLTE1L2JpdGNvaW4tYW5kLWNyeXB0by1zdGFydHVwcy1oYXZlLXNvbWVob3ctc3Vydml2ZWQtMjAyM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin and Crypto Startups Have Somehow Survived 2023 - Bloomberg",
        "content": "Greetings! It’s Hannah in San Francisco. Crypto faced a major reckoning in 2023. But first...\n\nThree things you need to know today:"
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby9iaXRjb2lucy1wcmljZS1zZXQtdG8tZW5kLXRoZS13ZWVrLXJlbGF0aXZlbHktdW5jaGFuZ2VkL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin's Price Set to End the Week Relatively Unchanged - CoinDesk",
        "content": "Bitcoin is, it's gonna end this week about 2% lower. Uh You know, that's not considered that much in crypto, of course, but here we are, we're looking at us Federal Reserve keeping its benchmark fed funds rate, uh staying the range relatively steady uh that they announced on Wednesday. Joining us now to discuss the crypto markets is Oanda senior market analyst, Craig Earlham. Welcome Craig. Thanks for having me. I'm glad to see you here. So of course, uh we, we're seeing not just the Federal Reserve keep rate steady, also the Bank of England, ECB European Central Bank. Um What, what do you make of all of that and what it tells us not only about uh the future of inflation and fighting inflation, but also what it means for risk, assets, particularly crypto. So it was interesting. The fed got us off to a fantastic start from a brisk asset perspective. They, they came out on Wednesday, they held we rate steady. That's almost irrelevant at this point because all anyone is interested in is what's to come next rather than what's happening now. No one expected a rate cut or a rate hike at either of these meetings. Uh, it's about what's coming next. Uh, and the markets at the time were pricing in four or five rate cuts next year. And the, the, the talk on the street was, are we being too bullish here? Are we being too aggressive? Is this too much optimism? Are we doing that usual thing where we get ahead of ourselves? Any reason, any justification to, to, to kind of buy stocks, to buy risk assets, to buy Bitcoin. Uh And uh those questions were being asked in the last week or so. And then the fed came out and rather than come out and say, well, we'll see what happens or play the kind of steady as she goes cards, they came out three rate cuts next year is what we're looking at and the markets exploded, we saw uh risk assets performing really well. Uh And then markets did what they do best. They decided to push it further. So they started pricing in six rate cuts next year. Uh and the, the other central banks or the markets, uh looking at other central banks followed suit. And I think they put other central banks, namely the Bank of England and the ECB in a difficult position because suddenly if they come out and do something similar to the fed, the markets can just get carried away again. So rather than get the Dovish message that we got from the Federal Reserve on Wednesday, we got a more steady message from the Bank of England. We didn't have to get too much from them. Uh, no new forecast, no press conference. So the, the pressure wasn't really on and then we got a bit of a hawkish pushback from Christine Lagarde and the ECB. And what did Marcus do? They completely ignored her. Uh, and they continued to price in six rates from the bank from the European Central Bank next. Yeah, it really has been quite a fascinating week and, uh, kind of settles up now for the end of the year in 2024 but perhaps not on the back of all of that because like I say, it's been uh an exhausting week. Um, on the back of all that, I'm not surprised to see maybe some more subdued trading today because a, I think everyone's exhausted. Maybe some people at Christmas parties last night. And I think also, uh, we've had a lot of information to take on board and it's been quite an interesting couple of weeks all in all. I, when I look at the price of Bitcoin though, over the past couple of weeks, we, we saw a peak up to 45 and then sell off. And some people attributed to, uh at least the run up to both the idea that the fed will take a more Dovish stance and also the idea of an ETF coming to market sometime soon. Yet we have this sell off since 45 we're now down to 42 and change. Uh I, I, is I, is that the correct assessment that these macroeconomic aspects, uh, to Bitcoin's trading had such an effect as to bring down the price or move the price where it is? It doesn't seem to quite make sense and, or, and, and are people perhaps overplay or overestimating the role of an ETF? In other words, are there any other factors besides either the ETF or the uh interest rate situation that could have moved Bitcoin's price to where it is currently? I think that's a really good question. Um I mean, I always say with uh with things like this is there's primary drivers and then the supporting factors and uh when there's not a lot going on in uh especially a kind of the headline uh arena uh in the, in the crypto world, then people can focus a lot more on what's happening with interest rates and risk appetites, especially over the last uh couple of years. But I think that's been more of a supportive factor at this point because I do think the ETF is a, is a massive driver. It's taking a long time. But I do think it's the the dominant driver of why there's a lot more optimism in uh the crypto space. Uh whether it's gonna be the game changer, we all want it to be. I, I'm, I'm not so sure it, it's helpful. It's a step in the right direction uh as the futures contract was before that and so on and so forth. Um And if I remember rightly, the run up to the futures launch and the, the, the, the uh the, the approval of that, we, we saw a lot, uh we saw strong rallies, we saw a lot of optimism, but the moment it was announced, we very much so by the rumor seller fact scenario, there's every chance that we get the similar thing with the ETF, we've seen a lot of optimism, really strong run up to that, perhaps we'll get something similar. Um And I think as, as Bitcoin and uh other cryptos become more mature, I do think this kind of trading is normal. If you look at any other asset class, things don't move in a straight line, we can rally 10% we can fall 5% we can rally another 10%. We can fall five percent that there's, there's nothing unusual about that and I don't see anything unusual about what we're seeing in, in Bitcoin right now. I just see a lot of euphoria uh over the ETF contract and then we'll move on to the next thing after that, when that ultimately uh is approved and I do think it will be approved. I think it always helps when we're in an environment where people want to take more risk. Um like it or loathe it. Bitcoin is a risky asset. Uh, I don't think anyone, um, should be in any two minds about that. Well, at least as far as I'm concerned anyway, but there's nothing wrong with that. There's lots of risky assets out there. Uh, and when risk assets are performing well, it's not surprising to see Bitcoin performing well. Uh, at the same time we need risk appetite to be strong. And an environment where we're looking at interest rates falling in quite aggressively over the next couple of years is more beneficial for uh risky assets because people's risk, appetite improves in a way that in the last 18 months, interest rates rising and no one knowing how far naturally undermines risk. There's a reason why the dow this week hit a new all time high for the first time in two years. Craig tell us a little bit more about that. How will monetary policy continue to impact the crypto markets as we move into 2024? Well, I think one of the most overused phrases is uh markets hate uncertainty, but it's, it's so true. So it doesn't matter how many times you hear it, it doesn't make it less relevant. And one thing that we've had over the last two years is enormous uncertainty. We've had uncertainty over inflation. We've had uncertainty over the aftermath of the pandemic, uncertainty over interest rates, the water in you, Ukraine uh energy prices. Uh There's been uncertainty around every corner and the markets don't like that. We're see, we're moving into an environment which looks more clear cut. Now we're moving into an environment with low where we could potentially see low and steady inflation into an environment where interest rates are falling rather than rising. And we don't know where to that is all much better uh if you're an investor because you know what you're effectively benchmarking against, you know what uh what the situation is like, you, you know what the economic prospects are because again, rising interest rates is not just bad for investors, it's not just bad for markets, but it's bad for business. It's bad for the economy. Uh So you don't know how far things are gonna have to be pushed and how far we're gonna have to tip into recession or, or something much worse. Now, it looks as though we're achieving a soft landing, which is borderline, miraculous considering how aggressively interest rates have risen and we're facing interest rate, uh cuts going into 2024 things will look a lot more promising now. Uh And therefore investors may be willing to take a little bit more risk in a way that they were two years ago. But for the last uh for the last 24 months have been less inclined to do so, maybe the last six months or so, a little bit more more. So I think the, the kind of all the A I uh uh euphoria earlier this year really did help things uh uh kind of risk, have to take it back on its feet. Uh But it's taken a bit more time over the course of the year to really catch up. But uh I think we are now going into a more stable environment and investors like stability with that. Oh, well, I actually with, with that stability. Do you see any interest uh going into alt coins as well as, as a, as a way to get a little bit more yield, people looking there or have people sort of cooled off a little bit on the alt, we, we saw a little bit of a run up uh before, but when I talk to traders, they say there's something weird about it. Yeah, I mean, I think, well, the, the thing we have, right is that uh I think investors know that there's uh Bitcoin has been around Bitcoin has more of a track record now. Um all coins, uh you can imagine people have been burned during bear markets and quite aggressive bear markets. Bitcoin fell what 75% from its uh from its all time high. Uh I in the last couple of years and is now bouncing back strongly, but people got really burned by all coins and it takes some time to uh to kind of repair the damage. But the more that we see Bitcoin gain, the higher the price that we see for Bitcoin, the more people's attention is naturally gonna be turned to all coins because there's gonna be a lot more focus then on if Bitcoin's up 50% in X amount a month, then this coin is up 100% this coins up 500% and interest, uh, interest starts to appear back in the old coin market. I do think we will see more and more interest in the old coin market going into 2024 if we get that ETF approved. Uh uh and if Bitcoin continues to perform well, if Bitcoin hits a new all time high, I have no doubt interest will return to the old coin market. It's uh uh but if we, again, I think in that scenario, we need, we need uh an increasingly stable environment and uh and, and if we continue to see our next, but we will then, but then in my view, at least, I think we will see more interest in the old coin market, no doubt. All right, Craig, we're gonna have to leave it there. Lawrence saved you from my predictions question. You ask, you know what three years predictions for 2024 who want to do it? I'm asking it for you. What are your predictions for? 2024? Wow. Uh, a nice easy question, uh my predictions for 2024. Um I mean, I, I hate to say the obvious thing. II, I think interest rates will come down. I think we will. Uh I, I do think central banks will be a lot more active in that direction. I think uh um uh I mean, I haven't really given this question that we thought of the second. Uh But yeah, I, I think we think we will see a more stable environment. I do think we'll see more risk appetite. Uh And I think we'll, I think that will benefit ri risk, risk assets ultimately. Uh So that's my prediction very much off the top of my head. Uh But uh yeah, iii I do think we're gonna, I think we're going for, I think we're 2024 is gonna be the uh a very good year. Shall we put it that way? Price me Bitcoin next year, 11 year from now. Where is it gonna be? I mean, honestly, give me a dart and a dartboard and I'll happily throw it. But I I it could be anything from 100,000 to 10,000. Honestly, it's uh pricing Bitcoin a year from now is, uh, is an impossible task and it always has been like, that's not just now pick a price and it'll be there, get there eventually. All right, Craig, we're going to leave it there. Thanks so much for joining us this morning and we hope you have a happy New Year. Thank you. You too. That was Oanda senior market analyst. Craig Earle"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWVjb3N5c3RlbS1yZWludmlnb3JhdGVkLWJ5LW1lbWUtY29pbnMtbmV3LXByb3RvY29sc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin ecosystem reinvigorated by memecoins, new protocols - Cointelegraph",
        "content": "The Bitcoin ecosystem has witnessed a dramatic recovery as the market cap of BRC-20 tokens surpassed $4 billion shortly after their invention in January.\n\nAccording to a Dec. 15 research report by cryptocurrency exchange Bitget seen by Cointelegraph, Bitcoin (BTC) miners’ earnings from on-chain fees have surged from 1.7% in August to 19.57% by November. Meanwhile, daily mining revenue from block rewards surged past $40 million in November. The namesake digital asset has gained 161% year-to-date.\n\nInvented by Bitcoin developer Casey Rodarmor in January, BRC-20 tokens have surged in popularity as one of the largest technological advancements in a 15-year-old blockchain. Bitcoin Ordinals is a numbering system that assigns a unique number to each satoshi, or 1/100 millionth of a Bitcoin, enabling tracking and transfer. Combined with the inscription process, which adds a layer of data to each Satoshi, users can mint unique digital assets on the Bitcoin blockchain.\n\nThe Ordinals (ORDI) token — the first memecoin created via the BRC-20 standard but not related to the Ordinals protocol itself — currently has a market cap of $1.34 billion. Meanwhile, researchers have also noted the emergence of other Bitcoin token standards, such as ARC-20 from Atomicals Protocol, in adding value to the Bitcoin ecosystem:\n\n“Unlike Ordinals, which rely on third-party sorters to order asset transactions, the Atomicals protocol’s ARC-20 standard uses Bitcoin’s smallest unit, Satoshi, as the smallest unit for issuing assets. This allows Atomicals assets to trace a complete transfer history without relying on any third-party sorter.”\n\nCurrently, Atomical Protocol includes ARC-20 tokens, nonfungible tokens, Bitcoin domain names known as “realms,” and on-chain data object storage known as “Collection Containers.“ “As of this date, there have been a total of 366,879 mints on the Atomicals Protocol, cumulatively costing 55.8 BTC ($2.4 million). The total number of mints on this protocol accounts for 2.69% of the total mints on Ordinals,” researchers wrote.\n\nDespite high gas fees, there exists a strong community demand for minting BRC-20 tokens. Using the example of the Sats (SATS) memecoin, researchers noted that SATS was fully minted on Sept. 24, with 21,107,258 mints and 36,061 holders, despite gas fees costing over $15 million. “[Layer-two solutions such as] the Lightning Network will serve as the largest technical foundation supporting the adoption of Bitcoin payments on a larger scale,” researchers concluded in their predictions for 2024.\n\nRelated: Why has Bitcoin price hit new all-time highs in Turkey, Egypt, Nigeria and Argentina?"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXdoYWxlcy1haW0tcmVjbGFpbS00MmstYnRjLXByaWNlLWRpdmVzLW92ZXItM9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "Bitcoin whales aim to reclaim $42K after BTC price dives over 3% - Cointelegraph",
        "content": "Bitcoin (BTC) tapped lows beneath $41,700 after the Dec. 15 Wall Street open as BTC price action fielded fresh sell-side pressure.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin balks at SEC Coinbase rejection\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD diving over $1,300, or 3.2%, on the day.\n\nThe largest cryptocurrency, fresh from a recovery from snap volatility the day prior, failed to hold its ground at $43,000 as Bitcoin bulls were denied upside continuation.\n\nBTC price weakness accompanied news that the United States Securities and Exchange Commission had refused a request by major exchange Coinbase to rework the rules for crypto.\n\n“Today, the Commission denied a Petition for Rulemaking filed on behalf of Coinbase Global, Inc.,” a statement from SEC Chair Gary Gensler read.\n\n“I was pleased to support the Commission’s decision for three reasons. First, existing laws and regulations apply to the crypto securities markets. Second, the SEC addresses the crypto securities markets through rulemaking as well. Third, it is important to maintain Commission discretion in setting its own rulemaking priorities.”\n\nThe SEC is already implicated in the current crypto market narrative thanks to expectations that it will approve the first U.S. Bitcoin spot price exchange-traded funds (ETFs) in early 2024.\n\nIn an interview with Bloomberg on Dec. 13, Gensler acknowledged recent legal proceedings linked to the agency’s repeated rejections of Bitcoin spot ETF applications.\n\nThe SEC, he said, “does things according to our authorities and how courts interpret our authorities, and that’s what we’ll do here as well.”\n\nAnalyzing the latest setup on order books, popular trader Skew flagged increasing bid support intensifying at $41,000.\n\n“Increasing bid depth around $41K, will be interesting from here. Active supply around $44K,” part of a post on X (Twitter) noted.\n\nBTC/USDT order book data for Binance. Source: Skew/X\n\nSubsequent analysis highlighted low-timeframe exponential moving averages, or EMAs, now back in play.\n\n$BTC 4H\n\nPrice contesting 4H EMAs again & RSI below 50 currently, important close coming up\n\n\n\nthose spot bids line up with the 4H 100EMA & 18D EMA\n\n~ systematic bids https://t.co/L89Nl6pW12 pic.twitter.com/G6CD5zCfXy — Skew Δ (@52kskew) December 15, 2023\n\nBTC price bulls in Fibonacci showdown\n\nZooming out, meanwhile, Keith Alan, co-founder of trading resource Material Indicators, revealed an ongoing struggle to flip a key weekly level back to support.\n\nRelated: US dollar hits 4-month low as Bitcoin trader predicts 10% drop to come\n\nThis came in the form of the 0.5 Fibonacci retracement line near $42,500, one of several key hurdles to overcome on the way toward $69,000 all-time highs.\n\nIf we look at the #Fibonacci levels from the ATH to the macro swing low for #Bitcoin we find ourselves testing support inside the Golden Pocket. That's bullish if the .5 Fib holds and leads to a break out above the .618 level, but at the moment there seems to be a battle to hang… pic.twitter.com/b5J6ajKbjh — Keith Alan (@KAProductions) December 15, 2023\n\nMaterial Indicators further showed large-volume traders increasing buying activity at the time of writing.\n\n“Mega Whales are buying, and trying to reclaim $42k,” part of X commentary summarized.\n\nBTC/USDT liquidity heatmap for Binance. Source: Material Indicators/X\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy91cy1kb2xsYXItNC1tb250aC1sb3ctYml0Y29pbi10cmFkZXItcHJlZGljdHMtMTAtZHJvcNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "US dollar hits 4-month low as Bitcoin trader predicts 10% drop to come - Cointelegraph",
        "content": "Bitcoin (BTC) may enjoy a familiar tailwind in the coming weeks and even beyond if new macro forces continue to play out.\n\nIn a post on X (formerly Twitter) on Dec. 14, popular trader Crypto Ed, founder of trading group CryptoTA, eyed multimonth lows in United States dollar strength.\n\nBitcoin trader targets sub-100 DXY dive\n\nBitcoin and dollar strength have in the past exhibited inverse correlation. While this has decreased recently, changes to U.S. macro policy are now broadly seen to boost Bitcoin but pressure the greenback going forward.\n\nAs Cointelegraph reported, the week’s macro data prints, combined with encouraging signals from the Federal Reserve, have analysts pointing the way to further crypto market upside in 2024.\n\nThis is thanks to declining inflation potentially allowing for the Fed to “pivot” on interest rate hikes, increasing liquidity to the benefit of risk assets.\n\nAn asset not set to enjoy the aftermath of the switch is the dollar, which has declined precipitously this week as macro figures showed the impact of monetary tightening on inflation.\n\nThe U.S. Dollar Index (DXY) is down more than 2% since the start of the week, currently below $102 — its lowest level since mid-August.\n\nCommenting, Crypto Ed joined those who are optimistic about Bitcoin while predicting further downside pressure on DXY.\n\n“Long Term Outlook for DXY what will help BTC to teleport to new ATH's,” he wrote, referring to new all-time highs for BTC/USD.\n\n“DXY to $92.”\n\nU.S. dollar index (DXY) 3-day chart. Source: Crypto Ed/X\n\nAn accompanying chart earmarked key levels to look for on DXY in three-day timeframes.\n\nFed balance sheet creeps higher\n\nOn the topic of liquidity, economist Lyn Alden nonetheless argued that conditions were not yet ideal in terms of supporting a broad risk-asset renaissance.\n\nRelated: Bitcoin bulls eye BTC price comeback as cash inflows echo late 2020\n\n“Global liquidity indicators started to stall a bit after their recent rise, and reverse repos haven’t drained in the first half of December, but today’s dovish Fed and drop in DXY potentially kickstarted a bit more liquidity,” she told X subscribers on Dec. 14.\n\nDays later, Alden nonetheless noted a “pretty remarkable repricing” by markets looking at how the Fed might lower rates in 2024.\n\nDXY down again today so far, and crude oil and other commodities getting a bit of a corresponding bounce.\n\n\n\nThe past 24 hours has seen a pretty remarkable repricing by the market of forward rate expectations. https://t.co/HmrZ8oXEfe pic.twitter.com/Wz9alU3hGe — Lyn Alden (@LynAldenContact) December 14, 2023\n\nData from the Fed itself shows its balance sheet increasing for the first time since August in December — by around $2 billion.\n\nFed balance sheet chart (screenshot). Source: St. Louis Fed\n\nBTC/USD meanwhile traded at $42,700 at the time of writing on Dec. 15, staying comparatively flat after brief volatility entered the day prior. The pair remains up 13% in December, per data from Cointelegraph Markets Pro and TradingView.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtb2ZmaWNpYWxzLW1lZXQtYWdhaW4td2l0aC1zcG90LWJpdGNvaW4tZXRmLWZpbGVyc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 15 Dec 2023 08:00:00 GMT",
        "title": "SEC officials meet again with spot Bitcoin ETF filers - Cointelegraph",
        "content": "The United States Securities and Exchange Commission has held a new round of discussions with asset managers proposing a spot Bitcoin (BTC) exchange-traded fund (ETF) in the U.S., this time with officials from Gary Gensler’s office participating in the meetings.\n\nBased on court filings, the regulator received representatives from BlackRock on Dec. 14 to discuss the proposed rule change that would enable the crypto investment vehicle to be traded on major exchanges. According to Bloomberg ETF analyst Jayme Seyffart, this is the third meeting between BlackRock and the SEC to review the application.\n\nMeetings between asset managers and the SEC had intensified over the previous weeks. On Dec. 8, Grayscale and Franklin Templeton also sat down with regulators to go over their applications, a day after representatives of Fidelity appeared before the SEC.\n\nBlackRock met again with the SEC yesterday. This time with Gensler's people/staff https://t.co/cjQ8ChxlBV pic.twitter.com/shDiZPidPe — James Seyffart (@JSeyff) December 15, 2023\n\nIn late November, Chair Gensler’s staff also met with the Hashdex team to address concerns over market manipulation and investor protections. Specifically, the discussion focused on the use of cash creations and redemptions as well as the acquisition of spot Bitcoin from physical exchanges within the Chicago Mercantile Exchange market, Cointelegraph has learned.\n\nSeveral large asset managers are planning to launch spot Bitcoin ETFs, including WisdomTree, BlackRock, Invesco, Fidelity and Grayscale. Over the years, the SEC has denied similar proposals. Now, the regulator is pushing its next decisions to early January, when most applicants’ latest deadlines will expire.\n\nUpon approval, the biggest cryptocurrency will trade on Wall Street’s major exchanges, opening up Bitcoin to a broader audience of investors backed by the world’s most influential investment firms. If denied, investment managers will likely appeal the ruling, which will prolong the waiting even further.\n\nA spot Bitcoin ETF directly tracks the real-time market price of Bitcoin, holding actual Bitcoin. Its value reflects the current price of BTC under its ownership. Conversely, a futures Bitcoin ETF invests in Bitcoin futures contracts, which are agreements on the future price of Bitcoin, rather than holding the cryptocurrency itself. The SEC approved the first futures Bitcoin ETF in 2021.\n\nMagazine: Crypto regulation — Does SEC Chair Gary Gensler have the final say?"
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9yZXN1cnJlY3Rpb24tMjAyNC1jcnlwdG8tYXdhaXRzLWZpcnN0LXNwb3QtZXRmLWFuZC1tb3JlL2FydGljbGVzaG93LzEwNjA0MDY1OS5jbXPSAYgBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvcmVzdXJyZWN0aW9uLTIwMjQtY3J5cHRvLWF3YWl0cy1maXJzdC1zcG90LWV0Zi1hbmQtbW9yZS9hbXBfYXJ0aWNsZXNob3cvMTA2MDQwNjU5LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Resurrection 2024: Crypto awaits first spot ETF and more - The Economic Times",
        "content": "ETF and Institutional Adoption\n\nA Better Solution\n\nApplications Beyond Finance\n\n\n\n\n\n\n\n\n\nSo much for the eulogies. As I write this, Bitcoin (BTC), the flag bearer of the crypto market, is up 155% year-to-date. The number of institutions holding BTC in treasury is growing. A Bitcoin spot ETF is around the corner. And industries are leveraging crypto and the underlying blockchain technology to modernize their processes.This resurgence shouldn’t be surprising. As with any market, crypto has its cyclicality. When interest rates went up and investors turned risk-averse, fewer capital flowed into crypto markets. The collapse of a popular stablecoin and an international exchange exacerbated the situation. And yet, the crypto ecosystem has continued to progress: Scaling up the blockchains and building more applications—in finance and beyond.Consider the much-anticipated spot exchange-traded funds for Bitcoin and Ethereum. The US Securities and Exchange Commission (SEC) is reviewing applications for nearly 18 Bitcoin and Ethereum ETF applications.While the US already offers Bitcoin-futures ETFs, a spot Bitcoin ETF on NYSE or Nasdaq will open the way for a new wave of retail investors and large financial institutions to hold these assets in their portfolio. The crypto market has already begun pricing-in the ETF effect, with both Bitcoin and Ethereum on the rise.ETFs are only one part of the story. Blockchain is finding a greater role elsewhere as well. Franklin Templeton, an investment company with over $1.4 trillion in assets under management, has launched a money market fund on blockchain. Tokenization of the fund brings greater transparency to investors, and lowers the operational cost for the fund manager. This fund already has over $300 million in assets.European financial institutions are also following suit. Société Générale, France’s third-largest bank, has launched its own Euro-denominated stablecoin. The payment solution is expected to improve the issuance and settlement of digital green bonds, among others.2024 could see more such applications. According to a recent report by S&P Global, “incumbent financial institutions will continue adopting blockchain technology to optimize or automate processes or create new tools for institutional users.”The use cases of crypto, or the underlying blockchain, go beyond the finance sector. E-commerce giant Flipkart is implementing their loyalty program on Polygon’s blockchain. Software major Tech Mahindra is exploring blockchain technology to build a privacy-focussed spam filter for telecom users. Tata Power is processing Letter of Credit settlement on blockchain. And a Bengaluru-based startup has built a blockchain solution to trace the origin of farm produce.It isn’t just the private sector, either. The Karnataka State Drugs Logistic and Warehousing Society is exploring blockchain to track drugs from the manufacturer to hospitals. Supply chain management, be it for diamond mining or fashion, is expected to greatly benefit from the transparency and verifiability that blockchains bring.These developments tell the real story of crypto resurgence, and are the foundational pieces of a global economy built on Web3 tools.(The author is Business Head, CoinSwitch)(Subscribe to ETMarkets WhatsApp channel"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9pcy1hbm90aGVyLWJpdGNvaW4tYnVsbC1ydW4tdW5kZXJ3YXktdGhpcy1hbmFseXN0LXRoaW5rcy1zby_SAVZodHRwczovL2FtYmNyeXB0by5jb20vaXMtYW5vdGhlci1iaXRjb2luLWJ1bGwtcnVuLXVuZGVyd2F5LXRoaXMtYW5hbHlzdC10aGlua3Mtc28vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 16 Dec 2023 08:00:00 GMT",
        "title": "Is another Bitcoin bull run underway? This analyst thinks so - AMBCrypto News",
        "content": "Bitcoin might be poised for another bull cycle.\n\nThis is based on readings from its NUPL, MVRV Ratio, and Puell Multiple.\n\nBitcoin [BTC] may be gearing up for another surge despite a recent pullback from its 2023 high of $44,000, pseudonymous CryptoQuant analyst Tarekonchain noted in a new report.\n\nThese indicators hint at another bullish rally\n\nTarekonchain assessed three key on-chain indicators and found that their values have gradually increased recently.\n\nBased on these readings, the analyst concluded that\n\n“the bear market for Bitcoin may be subsiding, making way for the early stages of a bull cycle.”\n\nThe first metric the analyst considered was BTC’s Net Unrealized Profit/Loss (NUPL). The NUPL metric determines whether BTC holders are currently experiencing unrealized gains or losses.\n\nIt compares the average purchase price of all BTCs investors hold to the current market price. When it rises above zero and remains in an uptrend, it means that BTC holders are in profit.\n\nAccording to Tarekonchain a rising NUPL indicates an increasingly profitable market, often correlating with a bullish sentiment.\n\nAt 0.48, and in an uptrend, the analyst opined:\n\n“The current trajectory of NUPL suggests an uplift in market optimism, which is a typical precursor to a bull market.”\n\nWhat the MVRV ratio says\n\nAnother metric assessed by the CryptoQuant analyst was BTC’s Market Value to Realized Value (MVRV) ratio.\n\nAn asset’s MVRV ratio tracks the ratio between the asset’s current market price and the average price of every coin or token of that asset acquired.\n\nA positive MVRV ratio above one signals an asset is overvalued, while a negative MVRV value shows that the asset is undervalued. Assessed on a 30-day small moving average, BTC’s MVRV has risen by 11% in the last 30 days.\n\nAccording to Tarekonchain:\n\n“The recent upward movement in the MVRV ratio from these lower levels may signal that the market is transitioning from undervaluation to a phase where growth is anticipated, hinting at the start of a bull cycle.”\n\nLastly, the analyst considered BTC’s Puell Multiple. This indicator provides insights into the profitability of mining operations on the BTC network.\n\nWhen the value of the metric rises, mining revenue is relatively high compared to the long-term average. On the other hand, a low Puell Multiple indicates that mining revenue is relatively low compared to the historical average.\n\nTaking a cue from BTC’s historical performance, Tarekonchain noted that a low Puell Multiple often marks market bottoms, and many view it as an opportunity to accumulate the leading coin.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nWith this indicator in an uptrend in recent times, the analyst concluded:\n\n"
    }
]