[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LnRoZWd1YXJkaWFuLmNvbS90ZWNobm9sb2d5LzIwMjMvYXByLzExL2JpdGNvaW4tcHJpY2UtcmlzZXMtdXNkLWN5cHRvY3VycmVuY3ktdmFsdWXSAV5odHRwczovL2FtcC50aGVndWFyZGlhbi5jb20vdGVjaG5vbG9neS8yMDIzL2Fwci8xMS9iaXRjb2luLXByaWNlLXJpc2VzLXVzZC1jeXB0b2N1cnJlbmN5LXZhbHVl?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price rises above $30,000 for first time since June 2022 - The Guardian",
        "content": "A sharp rise in bitcoin prices has pushed the cryptocurrency above $30,000 (£24,118) for the first time since 10 June last year, just before the Celsius crypto lending company froze withdrawals in the run-up to its collapse.\n\nEven given that recovery, the token is still well below its all-time high of $68,000 in November 2021, and far below where it was before the failure of the Terra stablecoin caused the “crypto winter”.\n\nNevertheless, bitcoin’s recent steady increase in value has sparked discussion of another cryptocurrency boom – and reignited fears of widespread manipulation in the market.\n\nThe collapse of Silicon Valley Bank last month and the broader contagion it has sparked across financial markets led some cryptocurrency fans to turn to bitcoin, the original and most valuable token in the sector, as a way of protecting against fears that the entire traditional “fiat” economy would crumble.\n\nThat attitude was typified by the US venture capitalist Balaji Srinivasan, who in March bet $1m that the price of a single bitcoin would top $1m by June this year. His claim was that the US dollar would shortly experience hyperinflation, causing the dollar value of a bitcoin to soar.\n\nQ&A What is bitcoin? Show Bitcoin is a 'cryptocurrency' – a decentralised tradeable digital asset. Invented in 2008, you store your bitcoins in a digital wallet, and transactions are stored in a public ledger known as the bitcoin blockchain, which prevents the digital currency being double-spent. Cryptocurrencies can be used to send transactions between two parties via the use of private and public keys. These transfers can be done with minimal processing cost, allowing users to avoid the fees charged by traditional financial institutions - as well as the oversight and regulation that entails. The lack of any central authority oversight is one of the attractions. This means it has attracted a range of backers, from libertarian monetarists who enjoy the idea of a currency with no inflation and no central bank, to drug dealers who like the fact that it is hard (but not impossible) to trace a bitcoin transaction back to a physical person. The exchange rate has been volatile, with some deeming it a risky investment. In January 2021 the UK's Financial Conduct Authority warned consumers they should be prepared to lose all their money if they invest in schemes promising high returns from digital currencies such as bitcoin. In practice it has been far more important for the dark economy than it has for most legitimate uses. In November 2021 it hit a record high of more than $68,000, as a growing number of investors backed it as an alternative to other assets during the Covid crisis. Bitcoin has been criticised for the vast energy reserves and associated carbon footprint of the system. New bitcoins are created by “mining” coins, which is done by using computers to carry out complex calculations. The more bitcoins that have been \"mined\", the longer it takes to mine new coin, and the more electricity is used in the process. Was this helpful? Thank you for your feedback.\n\n“This is the moment that the world redenominates on bitcoin as digital gold, returning to a model much like before the 20th century,” he tweeted, explaining the bet. “Everything will happen very fast once people check what I’m saying and see that the Federal Reserve has lied about how much money there is in the banks. All dollar holders get destroyed.”\n\nAlex Adelman, the chief executive of the bitcoin rewards app Lolli, said Monday’s rally “did not have a clear catalyst”, but that it was “a bellwether of bitcoin’s newly bullish market conditions and strong investor confidence. Bitcoin’s ongoing strength suggests that bitcoin is emerging from so-called ‘crypto winter’ into a new phase of strength and renewed interest from retail and institutional investors.”\n\nBut the recovery, after bitcoin prices hovered at $28,000 for almost a month before leaping the final $2,000 in a day, has also led to concern about market manipulation.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nQ&A What is a stablecoin? Show A stablecoin, like the name suggests, is a type of cryptocurrency that is supposed to have a stable value, such as US$1 per token. How they achieve that varies: the largest, such as tether and USD Coin, are effectively banks. They hold large reserves in cash, liquid assets, and other investments, and simply use those reserves to maintain a stable price.\n\nOthers, known as \"algorithmic stablecoins\", attempt to do the same thing but without any reserves. They have been criticised as effectively being backed by Ponzi schemes, since they require continuous inflows of cash to ensure they don't collapse.\n\nStablecoins are an important part of the cryptocurrency ecosystem. They provide a safer place for investors to store capital without going through the hassle of cashing out entirely, and allow assets to be denominated in conventional currency, rather than other extremely volatile tokens. Was this helpful? Thank you for your feedback.\n\nA 2022 report published by the US National Bureau of Economic Research found that “wash trading”, the practice of selling cryptocurrencies between related parties to influence the reported price, averaged “over 70% of the reported volume” on 29 unregulated exchanges.\n\nIn June 2022, the US Securities and Exchange Commission (SEC) refused permission to launch a bitcoin-linked exchange traded fund, which would allow investors to buy exposure to the cryptocurrency on the public stock markets, after concluding that it was impossible to prevent fraud and manipulation in the market from affecting the price.\n\nAs well as wash trading, the SEC said the market could be influenced by individuals with a “dominant position” in bitcoin manipulating its pricing, through fraud and manipulation at trading platforms, and through manipulative activity involving stablecoins “including tether”."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiR2h0dHBzOi8vd3d3Lm55dGltZXMuY29tLzIwMjMvMDQvMTEvYnVzaW5lc3MvZGVhbGJvb2svYml0Y29pbi1wcmljZS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Rally Continues, Gaining More Than 80% This Year - The New York Times",
        "content": "Bitcoin is still the market’s runaway success story of the year. The cryptocurrency topped $30,000 on Tuesday for the first time since June.\n\nBitcoin has gained more than 80 percent in price this year, far outperforming many other assets. The Nasdaq 100, an index of the biggest tech stocks, has gained roughly 20 percent in that period — a strong showing but a far cry from Bitcoin’s resurgence.\n\nThe latest Bitcoin rally appears to be partly tied to the Federal Reserve’s monetary policy, which has included nine interest rate increases over the past year. Crypto asset prices sank a year ago as the central bank began to raise rates, but investors are now betting that the Fed will soon pause its rate increases, even though Fed officials have been suggesting the opposite, setting off a big rebound.\n\nBitcoin’s biggest gains also coincide with the turmoil in the banking sector. The cryptocurrency is up more than 45 percent since the collapse of Silicon Valley Bank last month. Industry advocates point to the recent rally as a sign that investors are converting some of their cash into digital currencies, though there is little evidence of that happening."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDQvMTIvYml0Y29pbi1oYWx2aW5nLWlzLW9uZS15ZWFyLWF3YXktdGhhdC1jb3VsZC1zdWdnZXN0LWFub3RoZXItYnVsbC1ydW4uaHRtbNIBbWh0dHBzOi8vd3d3LmNuYmMuY29tL2FtcC8yMDIzLzA0LzEyL2JpdGNvaW4taGFsdmluZy1pcy1vbmUteWVhci1hd2F5LXRoYXQtY291bGQtc3VnZ2VzdC1hbm90aGVyLWJ1bGwtcnVuLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin is one year away from a major technical event. History suggests the start of another bull run - CNBC",
        "content": "In this article BTC.CM= Follow your favorite stocks CREATE FREE ACCOUNT\n\nThe bitcoin halving is an event that happens roughly every four years where rewards to miners are cut in halve, effectively limiting supply of the token. S3studio | Getty Images\n\nBitcoin is nearly a year away from a key technical event — which might be the catalyst for a prolonged climb in the cryptocurrency's value. In April or May 2024, bitcoin is expected to undergo its next so-called \"halving,\" though the exact date is not yet known. Bitcoin has been rising in the past few weeks in anticipation of the halving, as a potential U.S. Federal Reserve interest rate cut contends with the prospect of sluggish growth and tightening credit conditions resulting from woes in the banking sector. One bitcoin was worth roughly $30,000 as of Wednesday morning, according to data from CoinGecko. The world's largest cryptocurrency is up by more than 80% since the start of the year. Vijay Ayyar, vice president of corporate development and international at crypto exchange Luno, said that the bitcoin jump above $30,000 at a time of bank failures and economic uncertainty suggests the cyclical \"bottom\" for bitcoin is forming.\n\nwatch now\n\n\"This tends to happen a year or so prior to the Bitcoin's halving event, which is slated next for around April 2024,\" Ayyar told CNBC via email.\n\nWhat is the bitcoin halving?\n\nBitcoin halvings take place roughly every four years, or every time another 210,000 \"blocks\" are added to the blockchain. The event cuts the rewards to bitcoin miners — volunteers running specialized equipment to validate transactions on the network and mint new tokens — by 50%. The aim is to reduce the number of new bitcoin unit released into the market. Currently, bitcoin miners receive 6.25 bitcoin for each block they successfully mine. This means their computer had the right amount of computing power needed to solve the cryptographic puzzles that secure the bitcoin network and prevent it from being compromised by malicious actors. Once the next bitcoin halving occurs, this reward will be reduced to 3.125 bitcoin.\n\nwatch now\n\nBackers of the cryptocurrency say this can help push up the price by enhancing bitcoin scarcity. The maximum number of bitcoins that will ever exist in circulation is capped at 21 million. This is ensured by the halving mechanism, whereby rewards for mining bitcoin will eventually be slashed to $0. Before the last halving, which took place on May 11, 2020, the price of bitcoin increased by 19% in the preceding 12 months, from $7,191.36 to $8,568.88, according to figures from CCData. During the halving before that — which occurred on Jul. 9, 2016 — bitcoin rallied 142% compared with the 12 months prior, moving from $269.14 to $651.83.\n\nThe first ever halving of Nov. 28, 2012 saw the price of bitcoin balloon by 384% to $12.35 from $2.55, CCData's figures show. \"Analysing historical Bitcoin halving patterns, it appears that investors often accumulate Bitcoin in the run-up to the halving event, although the exact timing and extent of returns post-halving can differ,\" Jamie Sly, analyst at CryptoCompare, told CNBC. \"The accumulation period from the market bottom after the breakout to the halving date has historically spanned at least 500 days.\" Sly added: \"This would mean, if we were to assume that the market bottom for this cycle was in November last year (when Bitcoin hit a yearly low of $15,760), then we are only 142 days into the current cycle. This would correlate with the next expected Bitcoin halving date, which is another 378 days ahead.\"\n\nBitcoin's post-halving gains\n\nThe bitcoin price tends to spike even higher, in the months that follow halving. After the halving of May 11, 2020, the cryptocurrency rallied 688.31% in the following 546 days, reaching a then record high of $67,549.14 on Nov. 8, 2021, according to CCData."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMinQFodHRwczovL3d3dy5saXZlbWludC5jb20vbWFya2V0L2NyeXB0b2N1cnJlbmN5L2JpdGNvaW4tY3Jvc3Nlcy0zMGstc2V0dGluZy1uZXctcHJpY2UtaGlnaC1mb3ItMjAyMy1hcmUtaW52ZXN0b3JzLXdhcm1pbmctdXAtdG8tdGhlLWNyeXB0by0xMTY4MTIyNzcwODUyMi5odG1s0gGhAWh0dHBzOi8vd3d3LmxpdmVtaW50LmNvbS9tYXJrZXQvY3J5cHRvY3VycmVuY3kvYml0Y29pbi1jcm9zc2VzLTMway1zZXR0aW5nLW5ldy1wcmljZS1oaWdoLWZvci0yMDIzLWFyZS1pbnZlc3RvcnMtd2FybWluZy11cC10by10aGUtY3J5cHRvL2FtcC0xMTY4MTIyNzcwODUyMi5odG1s?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin crosses $30k, setting new price high for 2023. Are investors warming up to the crypto? | Mint - Mint",
        "content": "Bitcoin is trading above the $30,200 mark! The leader of the crypto market on Tuesday set a new price high for the year 2023. Notably, Bitcoin touched the psychological mark of $30,000 for the first time since June last year. The current year has been fruitful for the crypto as it has gained nearly 84% so far, making Bitcoin top-performing asset in the respective market in Q1 of 2023. The latest sharp rally does indicate a growing interest in cryptocurrencies among Indian investors.\n\nAt the time of writing, Bitcoin traded at $30,244.20 -- up by 6.15%. The crypto has touched an intraday high of $30,293.32 --- which is also the 30-day high level.\n\nIt is also the top trending cryptocurrency on Tuesday. Bitcoin's dominance surged by 0.83% to 47.15% in the market compared to the previous day, as per CoinMarketCap.\n\nBitcoin has gained by nearly 8% in seven trading sessions.\n\nRahul Pagidipati, CEO, ZebPay on Bitcoin said, \"Bitcoin has been on an upward trajectory since the beginning of 2023. On Jan 1st, Bitcoin began trading at roughly $16,500. As of 11th April, the asset has been trading above the $30,000 mark which is close to an 80% gain since Jan 2023. This is the first time since June 2022, that Bitcoin has reached this level. If the asset sustains above the key psychological resistance level of $30,000 we might see the price rise further.\"\n\nWhile CoinDCX Research revealed that Bitcoin has surpassed the $30,000 level for the first time since June 2022, setting a new price high for 2023. In the last 30 days, Bitcoin has seen significant gains of almost 50%, reaching its highest level in 10 months on 11th April 2023.\n\nAs per CoinDCX, the rise can be attributed to various factors such as growing inflation in the US, banking sector instability, and uncertainty surrounding stablecoin. Many investors are betting against the declining value of the US dollar and investing in Bitcoin as a hedge against inflation.\n\nBitcoin has been the top-performing asset class for Q1 2023, recording a gain of nearly 70%.\n\nThis has led to a surge in institutional adoption, with big players like MicroStrategy accumulating around 1,40,000 Bitcoins, one of the largest corporate holders as on date. Additionally, CoinDCX Research explained that the narrative around the next Bitcoin halving, scheduled for April 2024, is also starting to pick up, which has historically been a bullish signal for Bitcoin and crypto markets.\n\nMeanwhile, Parth Chaturvedi, Crypto Ecosystem Lead, CoinSwitch said, \"As the US economy faces an increasing probability of a “hard landing\", while high interest rates continue to add fuel to the banking crisis, investors are turning to safer asset classes, like Gold. Despite the banking challenges being faced by crypto companies in the US, the surge in Bitcoin prices persists and it is truly “decoupling\" from traditional finance.\"\n\nAdditionally, if looked at BTC’s historical price cycles, Chaturvedi said, \"we are almost a year away from the next halving of rewards, which typically marks the start of a bull run lasting for at least a year post-halving. Increasing prices are usually coupled with an increase in trading volumes. Hence, it could be said that investors are warming up to Bitcoin. We can expect further growth in its prices.\"\n\nGoing ahead, Pagidipati said, \"irrespective of the near-time price gains and falls, we believe Bitcoin is a fundamentally strong asset with remarkable potential in the long run.\"\n\nBut Rajagopal Menon, Vice President, WazirX points out that despite Bitcoin crossing $30,000 for the first time since June 2022, \"there has been no spike in volumes at WazirX and most trading volumes have been rangebound.\"\n\nMenon revealed that while there is muted celebration, most traders still believe that the market is in the middle of a bear run.\n\nAs per WazirX VP, as the crypto-world braces itself for the next Bitcoin halving, estimated to occur around May 4, 2024, when Bitcoin reaches 840,000 blocks, traders are bracing themselves for a period of mini-bull runs and potential drawdowns. This halving event marks the fourth protocol-designed 50% reduction in block rewards, which happens every 210,000 blocks or approximately every four years.\n\nThat being said, Menon mentioned \"the upcoming halving is poised to reduce the rate at which new Bitcoin is created, resulting in a lower available supply and increased scarcity. This could lead to higher demand and, as a result, a potential surge in Bitcoin's price. The implications of such a significant event have many speculating and watching the markets with bated breath.\"\n\nInvestors should keep a track of the U.S. Consumer Price Index (CPI) report for March which comes on April 12 and will also provide key insight into the Federal Reserve's battle against inflation, further affecting the crypto market.\n\nZebPay CEO said, \"This week’s US Consumer Price Index(CPI) data could potentially impact this trend further. If the CPI data encourages the Fed to pause interest rate hikes, it can bolster the price of Bitcoin.\"\n\nHow Bitcoin performs ahead will be watched keenly. But for now, the $30,000 mark is said as positive development for Indian crypto markets.\n\nPunit Agarwal, Founder of KoinX, a crypto taxation platform, said, \"The recent news of Bitcoin reaching the 30,000 dollar mark for the first time since 2022 is a positive development for the Indian cryptocurrency market.\" In his view, this indicates a rising interest in cryptocurrencies among investors in India, which could lead to more investment opportunities in the crypto space and Web 3 space on the whole.\n\nLastly, Agarwal concluded in regards to domestic crypto market, \"as cryptocurrencies gain more mainstream acceptance with the new upcoming regulations, they could contribute to the overall growth of India's digital economy, providing benefits such as faster and cheaper cross-border transactions, increased financial inclusion, and more innovation in the financial sector. The potential benefits of cryptocurrencies make it an exciting space for investors and businesses alike.\"\n\nDisclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before taking any investment decisions.\n\nMilestone Alert! Livemint tops charts as the fastest growing news website in the world 🌏 Click here to know more.\n\nUnlock a world of Benefits! From insightful newsletters to real-time stock tracking, breaking news and a personalized newsfeed – it's all here, just a click away! Login Now!"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzEyL2NvdWxkLWJpdGNvaW4tYmUtdGhlLWdyZWF0ZXN0LWVzZy1pbnZlc3RtZW50LW9mLWFsbC10aW1lL9IBamh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzEyL2NvdWxkLWJpdGNvaW4tYmUtdGhlLWdyZWF0ZXN0LWVzZy1pbnZlc3RtZW50LW9mLWFsbC10aW1lL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Could Bitcoin Be the Greatest ESG Investment of All Time? - CoinDesk",
        "content": "In addition to relying mostly on clean energy, the Bitcoin network is far more energy efficient than legacy financial systems. Bitcoin mining accounts for less than 0.2% of global energy usage and only 0.09% of the world’s carbon dioxide (CO2) emissions. Bitcoin, often compared to gold as a store of value, uses less energy than gold to mine and has none of the heavy metal pollutants caused by gold mining. Simply replacing gold or the legacy financial system with a bitcoin standard would be a huge net positive for the environment."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTExL2JpdGNvaW4tYnRjLWNsaW1icy10by0zMC0wMDAtZm9yLXRoZS1maXJzdC10aW1lLXNpbmNlLWp1bmXSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Climbs to $30,000 for First Time Since June in Rally - Bloomberg",
        "content": "Bitcoin climbed above $30,000 for the first time since June, bolstered by bets on easier monetary policies that have made cryptocurrencies standout performers this year.\n\nBitcoin is now up 82% since Dec. 31, handily beating the tech-heavy Nasdaq 100 ’s 19% gain. Gold , another investor favorite this year, has climbed around 10%. Crypto’s rapid ascent has seen Bitcoin vault past where it stood when hedge fund Three Arrows Capital imploded last summer — yet it remains more than 50% below its all-time high in November 2021."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWNyb3NzZXMtMzAwMDAtZm9yLWZpcnN0LXRpbWUtaW4tMjAyMy0xMjUxMjY3MTYuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin crosses $30,000 for first time in 2023 - Yahoo Finance",
        "content": "Bitcoin (BTC-USD) crossed $30,000 Tuesday, reaching the highest level for the world's largest cryptocurrency in 10 months.\n\nIt briefly touched $30,301 around 2:20 AM ET Tuesday before easing later in the morning. By 8:00 AM ET, bitcoin was changing hands at $30,027, up 6.2% for the last 24 hours. The last time the digital currency was this high was June 6, 2022.\n\nThe bitcoin rally buoyed other crypto assets and companies Tuesday, including the stock of cryptocurrency exchange Coinbase Global (COIN) and the price of the world's second-largest cryptocurrency, Ether (ETH-USD), as well as the stocks of bitcoin mining companies Marathon Digital (MARA) and Riot (RIOT).\n\nBitcoin still has a ways to go to reach the heights it scaled during its peak. It still trades 23% below where it stood one year ago.\n\nThe rapid climb of digital currencies is one of this year's big surprises in markets after a crash in 2022 that cost investors billions as higher interest rates and inflation lowered the value and appeal of risky assets. Several crypto players filed for bankruptcy, including FTX in November. FTX's former CEO Sam Bankman-Fried now faces criminal charges that he stole billions of FTX customer funds and misled investors.\n\n\"It's a bounce back from the really poor performance we saw in 2022,\" VettaFi research head Todd Rosenbluth told Yahoo Finance.\n\nWhat gave the market added momentum this year was a banking crisis in March that took down three lenders, including two that specifically served cryptocurrency customers.\n\nSince March 10, the day regulators seized Silicon Valley Bank in the second-largest bank failure of U.S. history, bitcoin has climbed $9,500 higher for a more than 30% rise. Ether (ETH-USD) is up more than 29%. According to Coinmarketcap, the total value for all crypto assets is up more than 24% during that period, as of Tuesday at 8:00 a.m. ET.\n\nSome investors chose to seek out bitcoin as a safe haven from the perceived instability of banking. Others anticipated the Fed might have to cut interest rates in response to the crisis, sparking more flows into alternative risk assets.\n\nStory continues\n\nHowever, the banking crisis also has significantly restrained liquidity in the crypto market according to data collected from Kaiko Research. Because investors now have less banking partners to assist in moving funds from dollars to cryptocurrencies and vice versa, analysts have argued it is much easier to manipulate bitcoin’s price with a large order.\n\nCrypto’s 2023 comeback unfolds even as Washington regulators step up their efforts to rein in the market.\n\nThe Securities and Exchange Commission has issued 11 enforcement actions since the beginning of January against crypto firms and individuals, while serving formal letters to Paxos, DeFi exchange Sushi, and Coinbase Global warning the agency plans to bring an enforcement action. Coinbase is the largest U.S. crypto exchange.\n\nCoinbase shares have rebounded 86% year to date but are still suppressed by two thirds below their value a year ago. Marathon Digital and Riot have both more than doubled since the beginning of 2023 but still trade 60% and 45% below their price a year ago.\n\nAnother regulator, the Commodities and Futures Trading Commission, also has sued crypto exchange Binance and its CEO Changpeng Zhao for allegedly selling derivatives backed by digital assets to U.S. customers despite not being registered to do so.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vd3d3LmVrYXRoaW1lcmluaS5jb20vbnl0aW1lcy8xMjA4NjQwL3RoZS1yZWFsLXdvcmxkLWNvc3RzLW9mLXRoZS1kaWdpdGFsLXJhY2UtZm9yLWJpdGNvaW4v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "The real-world costs of the digital race for bitcoin - Kathimerini English Edition",
        "content": "The Riot Platforms bitcoin mining facility in Rockdale, Texas, on February 28. This mine uses 2.5 times the power of all the subway cars in New York City. [Jordan Vonderhaar/The New York Times]\n\nTexas was gasping for electricity. Winter Storm Uri had knocked out power plants across the state, leaving tens of thousands of homes in icy darkness. By the end of February 14, 2021, nearly 40 people had died, some from the freezing cold.\n\nMeanwhile, in the husk of a onetime aluminum smelting plant an hour outside of Austin, row upon row of computers were using enough electricity to power about 6,500 homes as they raced to earn bitcoin, the world’s largest cryptocurrency.\n\nThe computers were performing trillions of calculations per second, hunting for an elusive combination of numbers that bitcoin’s algorithm would accept. About every 10 minutes, a computer somewhere guesses correctly and wins a small number of bitcoins worth, in recent weeks, about $170,000.\n\nIn Texas, the computers kept running until just after midnight. Then the state’s power grid operator ordered them shut off, under an agreement that allowed it to do so if the system was about to fail. In return, it began paying the bitcoin company, Bitdeer, an average of $175,000 an hour to keep the computers offline. Over the next four days, Bitdeer would make more than $18 million for not operating, from fees ultimately paid by Texans who had endured the storm.\n\nThe New York Times has identified 34 such large-scale operations, known as bitcoin mines, in the United States, all putting immense pressure on the power grid and most finding novel ways to profit from doing so. Their operations can create costs – including higher electricity bills and enormous carbon pollution – for everyone around them.\n\nUntil June 2021, most bitcoin mining was in China. Then it drove out bitcoin operations, at least for a time, citing their power use among other reasons. The United States quickly became the industry’s global leader.\n\nSince then, precisely how much electricity bitcoin mines are using in America and their effect on energy markets and the environment have been unclear. The Times, using both public and confidential records as well as the results of studies it commissioned, put the most comprehensive estimates to date on the largest operations’ power use and the ripple effects of their voracious demand.\n\nIn some areas, this has led prices to surge. In Texas, where 10 of the 34 mines are connected to the state’s grid, the increased demand has caused electric bills for power customers to rise nearly 5%, or $1.8 billion per year, according to a simulation performed for the Times by energy research and consulting firm Wood Mackenzie.\n\nThe additional power use across the country also causes as much carbon pollution as adding 3.5 million gas-powered cars to America’s roads, according to an analysis by WattTime, a nonprofit tech company. Many of the bitcoin operations promote themselves as environmentally friendly and set up in areas rich with renewable energy, but their power needs are far too great to be satisfied by those sources alone. As a result, they have become a boon for the fossil fuel industry: WattTime found that coal and natural gas plants kick in to meet 85% of the demand these bitcoin operations add to their grids.\n\nTheir massive energy consumption combined with their ability to shut off almost instantly allows some companies to save money and make money by deftly pulling the levers of U.S. power markets. They can avoid fees charged during peak demand, resell their electricity at a premium when prices spike and even be paid for offering to turn off.\n\nIn some states, bitcoin operators’ revenue can ultimately come from other power customers. The clearest example is Texas, where bitcoin companies are paid by the grid operator for promising to quickly power down if necessary to prevent blackouts. In practice, they rarely are asked to shut down and instead earn additional money while doing exactly what they would have been doing anyway: seeking bitcoin.\n\nSeveral of the companies are being paid through these agreements a majority of the time they operate.\n\nIn interviews and statements, many of the companies said they were no different from other large power users except for their willingness to shut off quickly to benefit the grid. Several objected to the method the Times and WattTime used to estimate their emissions, which calculated the pollution caused by the additional power generated to satisfy the mines’ demand, showing it to overwhelmingly come from fossil fuels.\n\nThe companies said this method held them to an unfair standard.\n\n“The analysis cited could be used to attack any industry that consumes power,” said David Fogel, CEO of Coinmint, which operates in upstate New York. “I think the entire notion of singling out specific industries like this is unfair.”\n\nMany academics who study the energy industry said bitcoin mining was undoubtedly having significant environmental effects.\n\n“They’re adding hundreds of megawatts of new demand when we already face the need to rapidly cut fossil power,” said Jesse Jenkins, a Princeton professor who studies electrical grid emissions.\n\n“If you care about climate change,” he added, “then that’s a problem.”\n\nLee Bratcher, president of the Texas Blockchain Council, a bitcoin lobbying group, said in an email that the industry incentivizes the development of new renewable and natural gas plants. But power industry experts say that although some current wind farms may be benefiting modestly, renewable generation takes years to build and usually requires commitments from customers who can guarantee that they will buy power for a decade or more.\n\nAccording to Jenkins, the bitcoin operations’ near-constant power demand is more likely to keep fossil fuel plants in business than to lead to more renewable energy.\n\nSome of the bitcoin companies that WattTime found to be causing the most pollution have held themselves out as supporting renewables.\n\nFor example, Riot Platforms’ CEO described bitcoin mining as “uniquely beneficial and supportive of renewable energy.” Ninety-six percent of the power demand added by the company’s mine was met by fossil fuels, the WattTime analysis showed.\n\nBitcoin miners’ power play\n\nMining bitcoin produces steady revenue, but using so much electricity can also be a business model.\n\nMoments of extreme weather provide especially stark examples. Take June 23, 2022 – the eighth-straight day of near-100-degree temperatures around Austin, which allowed Riot Platforms to demonstrate several ways they can turn electricity into money.\n\nLike many industrial buyers, the company had prepurchased its power at a fraction of the price available to residential customers. Riot’s mine runs at 450 megawatts – the largest in the country.\n\nEach day that June, its computers’ guesses were winning bitcoin worth an average of about $342,000. But the company had two additional ways to improve its profit margins.\n\nFirst, it had signed up for the Responsive Reserve Service, a Texas power grid program that offers a way to quickly reduce strain if the grid becomes overloaded, acting as insurance against blackouts. The program pays miners, and other companies, for promising to stop using electricity upon request. In reality, they are rarely asked to shut down but are still paid for making the pledge.\n\nFrom midnight to nearly 4 p.m. on June 23, Riot earned more than $42,000 from the program while continuing to mine bitcoin.\n\nAbout that time, the company switched to the second technique: avoiding fees that Texas charges to maintain and strengthen the power grid. It did so by briefly shutting off almost completely.\n\nBy 6:30 p.m., the company had resumed mining. If Riot had been fully operating all day, it would have incurred an estimated $5.5 million in fees – costs that are largely made up by other Texans. Over the course of the year, this saved Riot more than $27 million in potential fees.\n\nThe company’s actions were described in data published by the Texas grid operator, the Electric Reliability Council of Texas, or ERCOT. Although the records refer to power suppliers by pseudonyms, the Times was able to identify six of the 10 Texas operations in the data.\n\nOne final mechanism lets some companies make extra money when electricity prices spike: They can stop mining and resell electricity to other customers. That earned Riot roughly $18 million last year.\n\nFrom bitcoin mining, the company earned $156.9 million last year.\n\nAfter accounting for the savings and revenue from each of the strategies, Riot told investors that its electricity cost in 2022 was 2.96 cents per kilowatt-hour.\n\nBy comparison, the average price for other industrial businesses in Texas was 7.2 cents. For residents, it was 13.5 cents.\n\n‘Texas will be the crypto leader’\n\nThese opportunities have led some of the country’s largest bitcoin operations to choose Texas.\n\n“It’s a massive financial burden to Texans,” said Ben Hertz-Shargel, who leads grid-related research at Wood Mackenzie, and was part of the team that conducted the market-based simulation for the Times based on historical ERCOT data. Because of how the Texas market operates, the increases are steepest for residential customers, said Hertz-Shargel.\n\nOthers say increased prices will incentivize the development of cheaper types of power generation.\n\nIn Texas, the companies have powerful allies. Gov. Greg Abbott said in a tweet that “Texas will be the crypto leader” and hosted the Texas Blockchain Council at the governor’s mansion. The grid’s former interim CEO declared himself “pro bitcoin,” and the current vice chair of the grid’s board is a former adviser to the Texas Blockchain Council. Still, in March, three Republican state senators joined in sponsoring a bill that would restrict tax breaks for miners and place strict limits on their participation in programs such as the Responsive Reserve.\n\nIn Rockdale, where two of the largest mines in the country operate just outside the city limits, the city manager, Barbara Holly, told the Times that the town used to be “a fairly wealthy little community.” She said that changed when a large industrial plant that had provided thousands of jobs closed more than a decade ago. “It just cut the legs out from under this community,” she said.\n\nIt was the old aluminum smelter, now home to the Bitdeer mine.\n\nThis article originally appeared in The New York Times."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS9tYXJrZXRzL3dhcnJlbi1idWZmZXR0LWNyaXRpY2l6ZXMtYml0Y29pbi1zYXlzLWRvZXNudC1oYXZlLWludHJpbnNpYy12YWx1ZdIBamh0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS9tYXJrZXRzL3dhcnJlbi1idWZmZXR0LWNyaXRpY2l6ZXMtYml0Y29pbi1zYXlzLWRvZXNudC1oYXZlLWludHJpbnNpYy12YWx1ZS5hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Warren Buffett criticizes bitcoin, says it 'doesn't have any intrinsic value' - Fox Business",
        "content": "Berkshire Hathaway CEO Warren Buffett recently offered his opinion on bitcoin, appearing to criticize it.\n\nBitcoin is \"a gambling token, and it doesn’t have any intrinsic value,\" the \"Oracle of Omaha\" said in a CNBC interview clip posted Wednesday on Twitter by \"Squawk Box.\"\n\nHe made the comment about cryptocurrency in response to a question from co-anchor Becky Quick.\n\n\"But that doesn’t stop people from wanting to play a roulette wheel and think that if there’s a 37, you know, one zero or double zero, doesn’t make any difference. Yeah, it makes a difference,\" Buffett told CNN. \"It’s a scores now path that eats up your money if you spend the rest of your life spinning around the roulette wheel.\n\nWARREN BUFFETT ON BANKING CRISIS: ‘NOBODY IS GOING TO LOSE MONEY ON A DEPOSIT IN A US BANK’\n\n\"But they feature the winners and people get excited about it, and that’s why the slot machines make a lot of noise when they’re paying out.\"\n\nBuffett has made his dislike of bitcoin clear on other occasions, including in 2019 when he described it as a \"gambling device\" and said it was \"not an investment to me,\" FOX Business previously reported.\n\nOn Monday, bitcoin saw its price breach $30,000. That last time it did that was in June. It was hovering around $29,900 two days later.\n\nBITCOIN JUMPS ABOVE $30,000\n\nOther figures have voiced skepticism about bitcoin. In January, JPMorgan Chase CEO Jamie Dimon described cryptocurrency as a \"hyped-up fraud,\" comparing it to a \"pet rock\" while speaking with CNBC.\n\nJAMIE DIMON MOCKS CRYPTO, SAYS IT'S A ‘PET ROCK’\n\nBuffett, who has served as Berkshire Hathaway’s CEO for decades, also touched on topics like U.S. banking sector turbulence and companies Berkshire has invested in. Forbes has pegged his net worth at an estimated $110.9 billion."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTExL2JpdGNvaW4taXMtcmFsbHlpbmctYnV0LWVsLXNhbHZhZG9yLXMtaG9sZGluZ3MtYXJlLXN0aWxsLWRvd24tMjnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Is Rallying But El Salvador's Holdings Are Still Down 29% - Bloomberg",
        "content": "Bitcoin may be at a nine-month high, but El Salvador’s total holdings are still worth 29% less than what the government paid for the world’s largest digital currency.\n\nEl Salvador purchased 2,546 Bitcoin at a cost basis of roughly $108 million, according to calculations by Bloomberg. At Tuesday’s prices, those tokens are worth just $77 million."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMifGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNC8xMS90aGUtbmV3LXlvcmstdGltZXMtc2tld2VkLWJpdGNvaW4tbWluaW5nLWV4cG9zZS1yZXZlYWxzLWJsYXRhbnQtYmlhcy_SAYABaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA0LzExL3RoZS1uZXcteW9yay10aW1lcy1za2V3ZWQtYml0Y29pbi1taW5pbmctZXhwb3NlLXJldmVhbHMtYmxhdGFudC1iaWFzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "The New York Times' Skewed Bitcoin Mining Exposé Reveals Blatant Bias - CoinDesk",
        "content": "The New York Times has identified 34 such large-scale operations, known as Bitcoin mines, in the United States, all putting immense pressure on the power grid and most finding novel ways to profit from doing so. Their operations can create costs — including higher electricity bills and enormous carbon pollution — for everyone around them, most of whom have nothing to do with Bitcoin."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jcnlwdG8tYnVsbC1yYWxseS1iaXRjb2luLWNyb3NzLTE3NTcxNjUxNC5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Crypto Bull Rally: Will Bitcoin Cross $100,000 In 2023? - Yahoo Finance",
        "content": "Not everyone has suffered from the recent banking crisis. Crypto aficionados have emerged as a fortuitous winner, with Bitcoin, the largest cryptocurrency by market cap, soaring nearly 70% year to date.\n\nInstitutional traders believe the brutal year-long crypto winter has finally come to end, with the current macroeconomic backdrop reflecting a trend reversal.\n\nDon’t Miss: Taking on the Trillion Dollar IoT Market: One Startup Says AI-Based Data Compaction Can Increase Bandwidth by 300%\n\n2023 Crypto Rally\n\nBitcoin hit an all-time high of $68,991 in November 2021 before the onset of the brutal crypto winter. But recent market conditions have resulted in investors singing a different tune, touting Bitcoin to be a safe-haven asset and a store of value. While many have heralded Bitcoin as a hedge against inflation, the Federal Reserve’s aggressively hawkish stance caused decentralized tokens to fall out of favor last year.\n\nIn the wake of the recent banking crisis, analysts predict the Fed will slow its rate hike trajectory. Bitcoin also has long been considered a store of value. Other popular cryptocurrencies including Ethereum (ETH/USD) and meme token Dogecoin (DOGE/USD) have also fared well. Goldman Sachs stated recently that cryptocurrencies hold a 20% market share as a store of value.\n\nOther blockchain-based assets have been performing strong as well. Gameflip is a gaming and NFT marketplace with over $160 million in lifetime volume on their platform. The startup also has a live StartEngine raise, which means anyone can invest for a limited time. The startup is nearing $1 million raised in it’s current round from retail investors.\n\nTo stay updated with top startup news & investments, sign up for Benzinga’s Startup Investing & Equity Crowdfunding Newsletter\n\nBTC: The New Digital Gold\n\nLast month’s banking crisis exposed the systemic weakness in the global banking system as behemoths, including the second-largest Swiss bank Credit Suisse and the then 16th-largest U.S. bank Silicon Valley Bank, closed their doors. The benefits of decentralized tokens have been highlighted in the wake of the recent bank failures, with many proclaiming Bitcoin to be the new digital gold.\n\nStory continues\n\n“I think the rally is explicable by saying people have got freaked out by the banking system by the collapses,” said Oliver Linch, CEO of Bittrex Global.\n\nChangpeng Zhao, co-founder and CEO of Binance, considers Bitcoin to be better than gold.\n\nAs the crypto rally takes off, analysts and institutional investors are betting on Bitcoin to reach its all-time high again this year.\n\n“I think Bitcoin probably breaks all-time highs this year,” said Marshall Beard, chief strategy officer of cryptocurrency exchange Gemini, adding that the cryptocurrency could hit the $100,000 mark.\n\nSee Also: The House-Printing Robot Shaking Up a $7.28 Trillion Industry\n\nVijay Ayyar, head of international at crypto exchange Luno, said, “Broadly, we are looking quite bullish here with Bitcoin reclaiming $28K and looking to target $30K next.”\n\nOn March 17, Balaji Srinivasan, former technology chief at crypto exchange Coinbase, bet $2 million that Bitcoin could cross $1 million in just 90 days, as hyperinflation kicks in. Notably, Bitcoin would have to surge by nearly 3,500% within the next three months to reach this mark.\n\nThe blockchain-based gaming market is expected to benefit from the crypto rally to hit a $50 billion valuation by 2025. This marks a 33 times rise from the $1.5 billion market size reported in 2021.\n\nFed Scaling Back And Future Of Crypto\n\nThe Fed’s dovish stance is expected to fuel the bullish case for crypto, as decentralized currencies regain momentum. Typically Bitcoin has outperformed other major asset classes in a bull market.\n\n\"Any time that you've held Bitcoin in a four-year rolling interval, so you pick the day, hold it for four years, you've outperformed every other asset class,\" stated SkyBridge Capital Founder and Managing Partner Anthony Scaramucci.\n\nBut the disappointing jobs report and weak economic data published earlier this week has steered investors to reliable asset classes, including gold. As recession fears set in, crypto could see a massive influx of investments, as people continue to bet on decentralized assets.\n\nTo stay updated with top startup news & investments, sign up for Benzinga’s Startup Investing & Equity Crowdfunding Newsletter\n\nTensions Ahead\n\nThe U.S. Treasury has deemed decentralized finance (DeFi) markets a threat to U.S. national security, citing the requirement of further regulatory oversight. This, coupled with the U.S. Commodity Futures Trading Commission’s lawsuit against Binance, signals significant regulatory headwinds ahead for the crypto industry. But as the U.S. dollar slides amid Fed’s easing monetary stance and macroeconomic jitters, Bitcoin might hold its position as the best-performing asset in 2023.\n\nSee more on startup investing from Benzinga.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Crypto Bull Rally: Will Bitcoin Cross $100,000 In 2023? originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMihgFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDQvMTIvdGV4YXMtc2VuYXRlLXBhc3Nlcy1iaWxsLXRvLWxpbWl0LWJpdGNvaW4tbWluZXJzLXBhcnRpY2lwYXRpb24taW4tZGVtYW5kLXJlc3BvbnNlLXByb2dyYW1zL9IBigFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDQvMTIvdGV4YXMtc2VuYXRlLXBhc3Nlcy1iaWxsLXRvLWxpbWl0LWJpdGNvaW4tbWluZXJzLXBhcnRpY2lwYXRpb24taW4tZGVtYW5kLXJlc3BvbnNlLXByb2dyYW1zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Texas Senate Passes Bill to Limit Bitcoin Miners' Participation in Demand Response Programs - CoinDesk",
        "content": "Industry members and supporters argue that miners' flexibility in powering on and off is an asset to the Texas grid. Miners can fund energy generation capacity when there is little demand for power, and turn off when power is needed for the rest of the grid."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiggFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0wNC0xMi9ib2ZhLXNheXMtYml0Y29pbi1mbG93LXRvLXBlcnNvbmFsLXdhbGxldHMtc2lnbmFscy1zdXBwb3J0LWFmdGVyLWp1bXAtdG8tMzAtMDAw0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Hoarding in Personal Wallets Signals Support After Jump to $30000, BofA Says - Bloomberg",
        "content": "Bitcoin’s stellar 2023 rally may have room to run if flows between cryptocurrency exchanges and personal digital wallets are any guide, according to strategists at Bank of America Corp.\n\nA net $368 million of Bitcoin was sent to personal wallets in the week through April 4, a period that saw this year’s second-largest net Bitcoin outflow from crypto exchanges, strategists Alkesh Shah and Andrew Moss wrote in a note."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vdGVjaGhxLmNvbS8yMDIzLzA0L2hvdy1tdWNoLWJpdGNvaW4tcG93ZXItdXNlLXJlcG9ydC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin power use exposed - TechHQ",
        "content": "The New York Times has revealed the real cost of the digital race for Bitcoin. The news outlet identified 34 large-scale Bitcoin mines in the United States that each put immense pressure on the power grid, and profit from doing so.\n\nAfter Winter Storm Uri knocked out power plants across the state of Texas, tens of thousands of homes were left in darkness. By the end of February 14, 2021, nearly 40 people had died. At the same time, just outside Austin, computers were using enough electricity to power roughly 6,500 homes as they raced to earn Bitcoin.\n\nPerforming trillions of calculations a second, the computers kept running until just after midnight, when the state’s power grid operator ordered them to shut off. Over the next four days, Bitcoin company Bitdeer made more than $18 million for not operating. In return for keeping its computers offline, the state paid Bitdeer an average of $175,000 an hour.\n\nFor a business to profit from Bitcoin mining, it can require as much electricity as a small city. A computer guesses an elusive combination of numbers that Bitcoin’s algorithm will accept about every ten minutes, winning enough Bitcoin to be worth (at current prices) $170,000. The operations of these companies can create costs including higher electricity bills and carbon pollution, that impact everyone around them.\n\nChina, which was the site of most Bitcoin mining until June 2021, drove out Bitcoin operations citing their power use, among other reasons. The amount of electricity that Bitcoin mines are using in America, which soon became the industry’s global leader, and its effect on energy markets and the environment have been unclear.\n\nEach of the 34 Bitcoin mining operations identified by the Times uses at least 30,000 times as much power as the average US home, consuming a collective total of 3,900 megawatts of electricity. According to the publication, it’s as though another New York City’s worth of homes were draining the nation’s power supply.\n\nThe Mawson Infrastructure Group mine in Midland, Penn., uses more than twice the power of the nearby Pittsburgh airport.\n\nThe additional power use in America causes as much carbon pollution as adding 3.5 million gas-powered cars to the country’s roads, according to WattTime. Bitcoin operations tend to market themselves as environmentally friendly, setting up in areas rich with renewable energy. Ultimately, their power needs are too great to be satisfied by these sources alone.\n\nWattTime found that coal and natural gas plants meet 85% of the demand that Bitcoin operations add to their grids. In Texas, where 10 of the 34 mines are connected to the state’s grid, the increased demand has raised electricity bills for power customers by 5%.\n\nCan Bitcoin operations’ power use be compared to hospitals?\n\nIn interviews and statements heard by the Times, many Bitcoin companies argue that they are no different from other large power users, like hospitals and factories, except for their willingness to shut off quickly to benefit the grid. Even though hospitals arguably have enough human benefit to warrant use of large amounts of power, there would be severe consequences if they reduced their power usage as routinely or dramatically as Bitcoin operators are able.\n\nBitcoin mining facilities’ ability to shut off almost instantly not only allows them to save money, but even to make money by manipulating the US power markets: they can avoid fees charged during peak demand, resell their energy at a premium when prices spike and even, as in Texas in 2021, be paid to turn off.\n\nIn practice, even though Bitcoin companies are paid by the grid to promise to power down if necessary to prevent blackouts, they are rarely asked to do so. As such, they earn extra money for operating as normal. In Texas, five operations have made a collective $60 million from the program since 2020. Bitdeer’s 2021 windfall came as a result of such an agreement.\n\nSeveral companies are being paid through these agreements a majority of the time they operate. Most years, they are asked to turn off for only a few hours, at which point they are paid even more. “Ironically, when people are paying the most for their power, or losing it altogether, the miners are making money selling energy back to Texans at rates 100 times what they paid,” said Ed Hirs, who teaches energy economics at the University of Houston.\n\nAlongside hospitals, industries including metals and plastics manufacturing also need a lot of electricity, causing pollution and raising power prices. Manufacturing might not save lives but it does at least bring jobs to an area. Bitcoin mines tend to employ only a few dozen people once constructed, spurring less local economic development.\n\nBitcoin operations’ financial benefit goes almost exclusively to their owners and operators. In 2021, the year Bitcoin’s price peaked, 20 executives at five publicly-traded Bitcoin companies together received nearly $16 million in salary and over $630 million in stock options.\n\nEssentially, as well as the repercussions of such huge power usage, Bitcoin mining benefits only a very few, while the masses suffer the impact of carbon emissions and raised prices. Although Bitcoin’s value has dropped, seeing two of the largest United States-based companies file for bankruptcy, new mines continue opening across the country.\n\nIt’s not as though are aren’t options for operating cryptocurrency with less electricity: Ethereum, second-most popular cryptocurrency, switched its algorithm to cut the amount of electricity needed to power its network by 99%. Bitcoin advocates oppose changing its algorithm because proof-of-work has been resistant to attacks for longer and at a greater scale than any other approach to virtual currency stake creation.\n\nLike centers for the development of Artificial Intelligence, cooling the masses of computers used in Bitcoin mining also drains power supplies.\n\nDespite claims from the president of the Texas Blockchain Council, Lee Bratcher, that the industry incentivizes the development of renewable and natural gas plants, Dr. Jenkins at Princeton says that Bitcoin operations are more likely to keep fossil fuel plants in business than lead to more renewable energy. In New York, a gas-powered plant was able to reopen due to a sharp increase in power demand emanating from Bitcoin mining.\n\nTo round off: Bitcoin mining uses huge amounts of power, to the detriment of both the planet and communities near mining plants. It doesn’t just reduce job opportunities, but actively worsens local economies for the profit of a few individuals.\n\nThere’s a Bitdeer mine in an old aluminium smelter just outside Rockdale, where two of the largest mines (for fuel, not cryptocurrency) in the country operate. When the industrial plant where Bitdeer now operates shut down, “it just cut the legs out from under [the] community,” said city manager Barabara Holly.\n\nAt a time when everyone is making sacrifices for the good of the planet — or should be — it’s time that huge operations are held accountable. Without any widespread, material benefit Bitcoin mining is perhaps one of the first things that should go.\n\nFor the full report and data, read the New York Times article here."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzEyL2JpbGxpb25haXJlLXdhcnJlbi1idWZmZXR0LWNhbGxzLWJpdGNvaW4tYS1nYW1ibGluZy10b2tlbi_SAWtodHRwczovL3d3dy5jb2luZGVzay5jb20vYnVzaW5lc3MvMjAyMy8wNC8xMi9iaWxsaW9uYWlyZS13YXJyZW4tYnVmZmV0dC1jYWxscy1iaXRjb2luLWEtZ2FtYmxpbmctdG9rZW4vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Warren Buffett Calls Bitcoin a 'Gambling Token' - CoinDesk",
        "content": "\"It's a gambling contract with a nearly 100% edge for the house, entered into in a country where gambling contracts are traditionally regulated only by states that compete in laxity,\" Munger wrote in an opinion piece for the Wall Street Journal. \"The U.S. should now enact a new federal law that prevents this from happening.\""
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vZGVjcnlwdC5jby8xMjYwMDYvbW9yZS1iaXRjb2luLXRoYW4tZXZlci1pcy1ub3ctZG9ybWFudC1oZXJlcy13aGF0LXRoYXQtbWVhbnPSAVtodHRwczovL2RlY3J5cHQuY28vMTI2MDA2L21vcmUtYml0Y29pbi10aGFuLWV2ZXItaXMtbm93LWRvcm1hbnQtaGVyZXMtd2hhdC10aGF0LW1lYW5zP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "More Bitcoin Than Ever Is Now ‘Dormant’—Here’s What That Means - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nEven as Bitcoin surges to levels not seen in months, HODLing will never go out of style.\n\nMore than half of the coins in existence have not moved in over two years, according to recent figures—a new all-time high.\n\nBlockchain data firm Glassnode told Decrypt that the amount of Bitcoin which last moved more than two years ago currently stands at 53.14%.\n\nAD\n\nAD\n\nThat means 10.2 million Bitcoin is sitting still—roughly $309 billion-worth of satoshis. A total of 19.3 million Bitcoins have been mined since the cryptocurrency came into existence.\n\nArkham Intelligence CEO Miguel Morel told Decrypt that dormant coins often find their way back into circulation over time.\n\n“Coins have organically transferred from those with high-time and liquidity preference to those with low-time and liquidity preference,” Morel said. \"Through all the shake-ups, for every seller there’s a buyer.\"\n\nAncient Bitcoin stashes have been known to move, with “whales”—those who’ve hoarded huge amounts of cryptocurrency, making absurd returns—moving their investment to other addresses.\n\nStill, Glassnode has previously said that investors are less likely to spend coins after 155 days. And data has previously shown that those who actually make money buying the oldest cryptocurrency are “sophisticated investors” who sit on large amounts for a long time—while the retail investor is likely to lose out.\n\nAD\n\nAD\n\n\"Sometimes those coins never come back into the market,\" Morel added.\n\nBitcoin that sits still for a long time can also be attributed to lost coins: a common problem for amateur investors is forgetting the private keys to their digital wallet.\n\nThe latest data points come as the largest cryptocurrency by market cap soars in value: Bitcoin last night hit the $30,000 mark for the first time in 10 months; now it is trading for $30,229, according to CoinGecko.\n\nAt the start of the year, the asset was priced well below $20,000—trading hands for as low as $16,615.\n\nInvestors are clearly hoping that their investment will swell the longer they sit on it."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTEyL2JpdGNvaW4tcy1idGMtcmVzdXJnZW5jZS1zcHVycy1mcmVzaC1wdXNoLXRvLWxhdW5jaC1sZXZlcmFnZWQtZXRmc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin’s (BTC) Resurgence Spurs Fresh Push for Leveraged ETFs - Bloomberg",
        "content": "The race for the first leveraged Bitcoin exchange-traded fund is heating up as applications land amid a surge in cryptocurrency prices.\n\nDirexion on Monday filed Bloomberg Terminal for the Direxion Daily Bitcoin Strategy Bull 2X Shares ETF, which would look to double the performance of the S&P CME Bitcoin Futures Index each day. That follows a ProShares application on Friday for the ProShares UltraBitcoin Strategy ETF, which would seek similar types of returns as Direxion’s proposed fund."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiY2h0dHBzOi8vbmV3cy5ibG9vbWJlcmdsYXcuY29tL2NyeXB0by9iaXRjb2luLWlzLXJhbGx5aW5nLWJ1dC1lbC1zYWx2YWRvci1ob2xkaW5ncy1hcmUtc3RpbGwtZG93bi0yOdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Is Rallying But El Salvador Holdings Are Still Down 29% - Bloomberg Law",
        "content": "Bitcoin may be at a <-bsp-bb-link state=\"{\"bbDocId\":\"RSY8WPDWLU69\",\"_id\":\"00000187-75fc-d690-a987-f7fe111d0000\",\"_type\":\"0000016b-944a-dc2b-ab6b-d57ba1cc0000\"}\">nine-month high-bsp-bb-link>, but El Salvador’s total holdings are still worth 29% less than what the government paid for the world’s largest digital currency.\n\nEl Salvador purchased 2,546 Bitcoin at a cost basis of roughly $108 million, according to calculations by Bloomberg. At Tuesday’s prices, those tokens are worth just $77 million.\n\nBitcoin climbed above $30,000 on Tuesday for <-bsp-bb-link state=\"{\"bbDocId\":\"RSY8WPDWLU69\",\"_id\":\"00000187-75fc-d690-a987-f7fe11230000\",\"_type\":\"0000016b-944a-dc2b-ab6b-d57ba1cc0000\"}\">the first time since June-bsp-bb-link> 2022, bolstered by bets on easier monetary policies. However, the token remains more than 50% lower than an all-time high in 2021, around the time President Nayib Bukele’s government began ..."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvdXMtc2VsbHMtOTgwMC1iaXRjb2luLXNlaXplZC1mcm9tLXNpbGstcm9hZC1mb3ItMjE1LW1pbGxpb27SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "US Sells 9800 Bitcoin Seized From Silk Road for $215 Million - Nasdaq",
        "content": "By Landon Manning\n\nAfter seizing roughly 50,000 bitcoins from James Zhong in November 2022, the U.S. government has begun selling off these assets, with 9,800 sold most recently.\n\nThis sale, which took place in March 2023, was hardly the first time that the United States government has sold bitcoin seized from what it deems to be criminal operations. In 2014, for example, the federal government sold off roughly 30,000 BTC from the same source as this latest sale: Silk Road, a darknet marketplace that used bitcoin as its medium of exchange and was shut down in 2013. Zhong managed to steal these funds from Silk Road via wire transfer, as detailed in court documents. In light of his age, cooperation with prosecutors and other extenuating circumstances, he was given a relatively light sentence following the confiscation of his bitcoin.\n\nAlthough the government has certainly sold off larger quantities of bitcoin before, the fact that Zhong’s ill-gotten spoils have blossomed from less than $1 million to nearly $1.5 billion in value has complicated matters. The federal government evidently used Coinbase as the platform to conduct these sales, apparently only offloading the first tranche of the hoard and custodying the remainder. The asking price was roughly $2,000 shy per bitcoin of the retail market asking price that day, and the transaction incurred roughly $215,000 in transaction fees. This fact prompted digs from the crypto community, with many noting that far more generous terms could be found on other exchanges. Still, the sale was successful in a sense, and the federal government plans to sell the rest in four batches.\n\nThe origin of these bitcoin is closely related to a cause célèbre in the international crypto community: the plight of Ross Ulbricht, Silk Road’s founder. Silk Road was one of the first major uses of Bitcoin to make international headlines, representing Bitcoin’s humble origins and the libertarian ideologies at the core of the early crypto community. As a darknet market, the Silk Road offered a venue to connect sellers and buyers of various prohibited substances pseudonymously. After the site was shut down, Ulbricht was arrested, and in 2015 given more than a double life sentence without possibility for parole, despite being a first-time, non-violent offender.\n\nUlbricht has reached out to the Bitcoin community from prison, claiming that he’s “spent the last eight years watching Bitcoin grow up from in here.” Citing the community’s courage and potential for innovation, he has stated that, “We didn’t know how things would turn out for Bitcoin back in the beginning, but over the years, I’ve been continually impressed with what you’ve accomplished.”\n\nAnd indeed, it is incredible how far Bitcoin has come and that comparatively paltry sums while Ulbricht was free have grown to represent billions of dollars in value. However, the extreme harshness of his sentencing is a reminder that institutions of government and finance have been overwhelmingly hostile to Bitcoin in the past, and any acceptance now is itself a massive accomplishment.\n\nIn short, this particular sale, particularly compared to a larger one in 2014, represents the vast growth that Bitcoin has seen since its early days. Despite all of this progress, however, it is important to remember the humble origins of this international community, and all of those who suffered at the cusp of innovation. The events of Silk Road are still relevant to our thriving world of Bitcoin today, and will continue to be for some time to come.\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmZvb2wuY29tL3RoZS1hc2NlbnQvY3J5cHRvY3VycmVuY3kvYXJ0aWNsZXMvYml0Y29pbi1iYWNrLWFib3ZlLTMwMDAwLXNob3VsZC15b3UtYnV5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Back Above $30,000. Should You Buy? - The Motley Fool",
        "content": "Bitcoin (BTC) has pushed above $30,000 for the first time since June last year, peaking at almost $31,400 this morning. Bitcoin's price is up over 80% since the start of this year, according to CoinMarketCap data. That's impressive, but it's still got a long way to go before it regains its 2021 high of almost $69,000. Find out what's behind its recent price action and what it means for investors.\n\nWhat's behind Bitcoin's rally?\n\nThere are several drivers behind Bitcoin's recent rally. Chief among them is speculation that the Federal Reserve may stop increasing interest rates. The Fed has been aggressively pushing interest rates upward in an attempt to get inflation under control. This had a big impact on crypto prices, as it meant people pulled out of riskier assets like Bitcoin. The thinking is that the investors might swing back toward crypto if the Fed eases its tightening measures.\n\nSome insiders think fears around traditional banking are also fuelling price rises. For example, Bradley Duke, co-chief executive officer of ETC Group, told Bloomberg that people are also being drawn to crypto because it's \"an asset outside of traditional banking and finance.\"\n\nSentiment also plays a huge part in Bitcoin's price. This is a market with a lot of speculative price action, and investors often buy when things seem to be going well -- partly out of a fear of missing out -- which pushes prices up further. It's not so surprising, then, that the Crypto Fear and Greed Index is into serious greed territory. The index, which uses a couple of factors including momentum, volatility, and social media analysis, hasn't logged such high greed figures since November 2021.\n\nCan it continue to rise?\n\nMany crypto investors want to know whether this might finally mark the end of the crypto winter. It's an understandable question, particularly as many people's portfolios have taken significant hits. But unfortunately, nobody has a crystal ball and it is hard to know whether -- and for how long -- the current rally will continue.\n\nWhat we do know is that Bitcoin and cryptocurrency have some serious hurdles to jump in both the near and long term. Regulators have been cracking down on the whole industry. The SEC says many cryptocurrencies are unregistered securities and argues they should come under its remit. If it can push this case successfully, it will have a significant impact on the way we buy and sell crypto.\n\nThere are also growing fears that we're about to enter a recession. This could be another drag on Bitcoin's price as recessions tend to make people more risk averse. More widely, crypto faces a trust issue: the collapse of several crypto platforms has dented people's confidence in the whole industry. This is particularly true as we learn more about what went on behind the scenes at FTX and the degree to which the company mishandled customers' money.\n\nShould you buy?\n\nIf you're considering buying Bitcoin, know that it remains an extremely volatile asset. Think about how it might perform in the long term and make sure you understand the risks involved. We are no longer in the stimulus-laiden climate that fueled the crypto frenzy of 2020 and 2021, and there are no guarantees that prices will ever recover those highs.\n\nIt's also important to be comfortable with the consequences of the relative lack of regulation in the industry. First, there is not a lot in the way of investor protection if your crypto platform fails. Second, if and when authorities introduce more rules, prices will likely fall in the short term. For example, it's only through increased transparency that we'll find out what reserves other crypto players have. Stricter regulation may also uncover the truth of accusations of fraudulent practices, such as wash trading.\n\nAll the same, Bitcoin evangelists argue that the leading crypto could transform the way we use money and it may be the digital currency of the future. If you think their logic holds water and want to own crypto, it's important to manage the level of risk you're taking on and make sure it only represents a small portion of your overall portfolio. Follow the golden rules of crypto investing: Only invest money you can afford to lose and use a crypto exchange that you trust."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wNC8xMS9jcnlwdG8tcTEtMjAyMy1wZXJmb3JtYW5jZS1yZWNhcC_SAVxodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDQvMTEvY3J5cHRvLXExLTIwMjMtcGVyZm9ybWFuY2UtcmVjYXAvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "First-Quarter Performance Recap: CoinDesk Market Index Up 58%, BTC Gains Amid Banking Crisis - CoinDesk",
        "content": "The U.S. regional banking concerns and the rapid unwind of Credit Suisse (CS) have highlighted weaknesses in the traditional financial system when interest rates rise. While this may come to the delight or amusement of crypto maximalists and critics of the fractionalized banking system, it is a source for further deleveraging contagion risk. Most digital-asset investments share a broader portfolio with traditional public and private-asset markets, with capital allocation decisions within these portfolios linking these disparate markets together through relative value choices which promote and drive correlations across markets. Crypto cannot sail alone."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctdG8tYnV5LW9yLXNlbGwtYml0Y29pbi13aXRob3V0LXVzaW5nLWEtY2VudHJhbGl6ZWQtY3J5cHRvLWV4Y2hhbmdl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "How to buy or sell Bitcoin without using a centralized crypto exchange? - Cointelegraph",
        "content": "The failure of FTX triggered a notable growth of self-custody in 2022, with numerous cryptocurrency investors transitioning from centralized exchanges (CEX) to hardware or software wallets.\n\nThe rising popularity of self-custody could even potentially erase the need for centralized exchanges one day, according to Binance CEO Changpeng Zhao. But how would people buy or sell cryptocurrencies without centralized exchanges?\n\nThe crypto industry already offers ways to exchange cryptocurrencies like Bitcoin (BTC) for fiat money without using a CEX like Binance. However, such a process is associated with certain pros and cons and may require additional research.\n\nThis article will discuss the most straightforward exchange methods to shed some light on buying or selling crypto without using a centralized crypto trading platform.\n\nBitcoin ATMs\n\nBitcoin-enabled automated teller machines (ATMs) are probably one of the easiest ways to exchange fiat money for crypto and vice versa. Like conventional ATMs, Bitcoin ATMs allow users to deposit and withdraw money using cash or a debit card. But instead of a bank account, a Bitcoin ATM requires users to have a BTC wallet address to deposit or withdraw money.\n\nLike a traditional ATM, a Bitcoin ATM has a monitor, a QR scanner, a bill acceptor and a dispenser. To connect their Bitcoin wallet to a crypto ATM, users are usually prompted to scan a QR code corresponding to their BTC wallet address.\n\nWhile providing a simple way to exchange money against cryptocurrencies, Bitcoin ATMs suffer from limited global adoption.\n\nAccording to data from CoinATMRadar, there are roughly 34,000 Bitcoin ATMs in 80 countries worldwide, with almost 85% of all crypto ATMs in the United States. About 4% of Bitcoin ATMs are located across Europe, with most of those located in Spain, Poland, Romania, Switzerland and Austria.\n\nThe infrastructure of global cryptocurrency ATMs has also seen a significant decline recently. According to data from CoinATMRadar, 412 crypto ATMs were removed from the grid worldwide in the first two months of 2023, compared with 1,000 monthly crypto ATM installations between December 2020 and January 2022.\n\nGiven the limited reach of crypto ATMs, one shouldn’t rely entirely on their capability to exchange fiat for crypto. According to some industry executives, crypto ATMs have also been increasingly scrutinized by regulators recently, which could bring even more issues to the exchange method.\n\n“For a long time, ATMs provided an excellent service to anyone looking to buy and sell Bitcoin privately,” Trezor’s Bitcoin analyst Josef Tetek told Cointelegraph. “Current global trends suggest that this era is coming to its end, as ATM providers are becoming regulated just like any other financial institution,” he noted, suggesting that Bitcoin ATMs are likely to become significantly less private in the near future.\n\nAnother weak spot of Bitcoin ATMs is high transaction costs, with fees often ranging from 5–20%.\n\nPeer-to-peer Bitcoin exchange platforms\n\nPeer-to-peer (P2P) Bitcoin exchange marketplaces are among the most common crypto exchange options alongside Bitcoin ATMs. Such platforms allow users to trade digital currency directly with each other without the need for a centralized third party to facilitate the transactions.\n\nUnlike CEXs, P2P exchanges don’t rely on automated engines to complete transactions, allowing users to manually choose their preferred offer, trade directly with a counterparty, and transact funds using a self-custodial wallet. Such platforms are less vulnerable than CEXs due to their independence from intermediaries controlling funds during a trade.\n\nMany industry executives believe that P2P crypto marketplaces are likely to be the future of crypto due to their unique features. “P2P exchanges are far more resilient to regulatory crackdowns than centralized exchanges,” Jan3 CEO Samson Mow told Cointelegraph, adding that it would be good to have more P2P options.\n\n“P2P services are the future of Bitcoin adoption, but only if they can successfully avoid intruding on users’ privacy,” Trezor’s Tetek said. He specified that some regulatory restrictions, like Know Your Customer (KYC), could essentially make P2P crypto services useless, stating:\n\n“Having a P2P service with KYC is merely a variation of using a CEX but with worse liquidity.”\n\nWhile providing a more resilient option on the regulatory side, P2P services are often associated with security issues, according to Quantum Economics founder and CEO Mati Greenspan. P2P exchanges like Binance P2P or now-terminated Paxful and LocalBitcoins are “certainly a step in the right direction,” he said, adding:\n\n“This sort of online marketplace maintains the decentralized ethos of crypto, but it is also susceptible to attacks from both regulators and hackers.”\n\nCrypto on-ramp/off-ramp integrations on software or hardware wallets\n\nAnother common way to buy or sell crypto without a CEX is using an on-ramp or an off-ramp solution provided within a self-custodial wallet through a third-party payment provider.\n\nSoftware wallets like Exodus and hardware ones — like Ledger and Trezor — offer several methods to deposit or withdraw Bitcoin using default software through various payment integrations. Such wallets often allow users to buy crypto or cash out their coins using bank transfers, debit or credit card payments, Apple Pay and other options, depending on the country of the user’s bank location.\n\nProviding a simple alternative to Bitcoin ATM or P2P services, wallet exchange integrations are currently accompanied by issues like limited coverage due to the low adoption of crypto payment partnerships worldwide. Due to this issue, residents of many countries may find it impossible to exchange their crypto against fiat because their banks aren’t supported on the payment provider’s network.\n\nHowever, one may also find that wallet exchange integrations are a bit costly in terms of fees. For example, some third-party application programming interface (API) providers on Exodus Wallet charge up to 12% in automated clearing house transfer fees.\n\nSoftware and hardware wallets are usually integrated with more than just a single off-ramp or on-ramp provider, offering a significant variety of choices. Some providers include PayPal, MoonPay, Transak, Sardine, Banxa, Coinbase Pay, Onramp.money and Mercuryo — among others.\n\nOffline P2P exchange\n\nOne doesn’t necessarily need to use online exchange services to buy or sell Bitcoin. There is an opportunity to do that in person or by interacting with investors who want to cash out or acquire some cryptocurrency on social media apps.\n\n“Various alternatives do exist for offline transactions where the buyer meets the seller in person. Depending where you live, this might happen at a regular currency exchange shop or through a known black market dealer,” Greenspan told Cointelegraph. He referred to groups on messengers like Telegram or WhatsApp, where buyers and sellers are constantly making connections. “I’ve even heard of people using sites like Craigslist,” the exec added.\n\nOffline P2P exchange of Bitcoin is the “best choice for privacy-minded individuals,” Trezor’s BTC analyst Tetek believes. He stressed that exchanging Bitcoin in person is essentially returning to the roots of BTC exchange. “Bitcoin meetups are usually the best place to find fellow Bitcoiners looking for an exchange,” he said.\n\nAs everything has pros and cons, offline P2P exchange isn’t unique, and some massive concerns are associated with such a Bitcoin exchange method.\n\nThe biggest risks of offline P2P exchange are related to safety and limited scalability, Quantum Economics’ Greenspan said, adding:\n\n“There are loads of disadvantages from safety concerns to the uncomfortable feeling of dealing with a complete stranger, but mostly it’s just not a very scalable solution.”\n\nSuch a crypto exchange method also requires users to be much more knowledgeable and savvy than just purchasing online at a well-known crypto exchange.\n\nCan you buy Bitcoin on a DEX?\n\nWhile considering options for buying or selling Bitcoin without interacting with a CEX, one may consider using a decentralized exchange (DEX) as an alternative. But should a DEX count as a standalone option to a CEX in this regard?\n\nDespite offering the opportunity to buy or sell Bitcoin, DEXs usually require users to have some exposure to crypto before the transaction. That means that Bitcoin can only be purchased or withdrawn with the help of other cryptocurrencies on a DEX.\n\nAdditionally, some issues currently prevent DEXs from serving as a solid alternative to CEXs in terms of buying or selling crypto, according to Trezor’s Tetek. “Some of the major challenges include unfriendly user experience, high spreads resulting from low liquidity, and concerns about receiving ‘dirty’ Bitcoin or fiat,” he said. The analyst added that these issues must be addressed for further adoption of DEXs.\n\nIt also depends on what one refers to as a DEX, Jan3’s Mow added. “If you’re referring to an Ethereum-based DEX, it’s not an alternative at all because, at the base layer, Ethereum isn’t decentralized,” the executive argued, adding that a real DEX won’t have any centralized part that can be shut down.\n\nIs there a future without centralized crypto exchanges?\n\nDespite the industry offering many decentralized options to exchange Bitcoin against fiat, CEXs remain a significant player.\n\nApart from offering a straightforward entry into the crypto market and Web3, CEXs are also an important industry component in terms of price discovery, according to Bitcoin proponent Mow. He stated:\n\n“Centralized cryptocurrency exchanges will always continue to exist, and they are an important venue for price discovery and liquidity. Only regions that endorse a heavy-handed approach will force exchanges out, but that’s really to the detriment of their people.”\n\nIt’s yet to be known whether CEXs will continue to be a key part of the crypto industry in the coming years. Some experts are confident that the industry will get rid of centralized exchanges one day.\n\n“For now, centralized exchanges remain a necessary scourge on the industry, and I do look forward to the day we can do without them entirely,” Quantum Economics CEO Greenspan said.\n\n“Centralized exchanges pose a risk not only to the privacy and security of Bitcoin users but also undermine the very reason Bitcoin came into existence — creating a parallel financial system and supporting the financial autonomy of its holders,” Trezor’s Tetek stated. He added that CEXs undeniably served as an accelerator for Bitcoin adoption in the past, but they are slowly becoming its “biggest enemy.” The BTC analyst added:\n\n“I can definitely imagine a world without any CEXs. When Bitcoin becomes a global monetary standard, there will be no need to exchange Bitcoin for fiat.”\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWJyZWFrcy1hYm92ZS0zMGstZmlyc3QtMDE1NDAxNTY2Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Breaks Above $30K for First Time Since June 2022 - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nBitcoin (BTC) moved past $30,000 for the first time since June 10, 2022, as March's banking turbulence faded into the distance and investors grew more optimistic about U.S. central bank monetary policy.\n\nThe largest cryptocurrency by market capitalization was recently trading at $30,237, up 6.75% over the last 24 hours.\n\n“It’s clear that the market is pricing a slowdown in growth, and in turn a loosening of monetary policy by the Federal Reserve over the course of 2023,\" said Richard Mico, the U.S. CEO and chief legal officer of Banxa, a payment-and-compliance infrastructure provider for crypto. \"For evidence of this, just look at the bond market.\"\n\nA check of the bond market shows the U.S. two-year Treasury note having fallen to below 4% from a peak above 5% in early March as traders rapidly reversed their expectations of future Federal Reserve interest rate hikes.\n\n\"There will likely still be a lot of liquidity injected into the market as a result,\" added Mico. \"Already, bitcoin has been the best-performing asset of 2023, and it usually is the asset that responds most quickly and violently to these kinds of monetary shifts.\"\n\nBitcoin last topped $30,000 on June 10 as it was on its way down to below $20,000, where it spent large parts of late 2022 and into the first weeks of 2023. It has been hovering around $28,000 for the past three weeks as wary investors gauged the impact of a near banking meltdown, continued inflationary pressures and other macroeconomic uncertainties. Bitcoin is up about 80% year to date after starting the year at about $16,600.\n\nThe crypto surged in January on signs that inflation was waning. Bitcoin stalled in February but then regained momentum in late March following the failure of Silicon Valley and Signature banks when some investors questioned the stability of the current monetary system and regained their appetite for assets that hold their value. Gold also recently spiked, topping $2,000 for the first time since 2020.\n\nStory continues\n\nMico noted that there is certainly a narrative shift happening because of the banking crisis feeding into bitcoin’s momentum. Increasingly, \"BTC is also being seen as a reliable store of value that lacks the issues that come with storing your money by way of a third-party intermediary, or a bank,\" he added. \"BTC is now properly starting to be perceived as a risk-off asset.\"\n\n\"De-dollarization is also increasingly becoming part of the narrative, which is further accelerating BTC adoption,\" Mico concluded. \"With BTC, in short, you are your own bank. It’s difficult to make predictions given the volatility of late, but I wouldn’t be surprised if this momentum regarding BTC continues.\"\n\nIn an email to CoinDesk, Bob Ras, co-founder of Sologenic, a blockchain-powered network for tokenizing securities, noted that bitcoin had decoupled from stocks and shown \"its increasing appeal as a safe haven for investors.\"\n\n\"While the 2020-2021 period was perceived as Bitcoin's breakthrough moment, the present time truly marks its ascendance onto the global stage as a formidable asset,\" Ras wrote. \"Amidst heightened geopolitical instability, faltering banking systems and mounting concerns surrounding reserve currencies, bitcoin has emerged as the reliable refuge that many had anticipated. This crucial juncture signifies a pivotal advancement for the digital asset sector.”\n\nUPDATE (April 11, 2023, 02:16 UTC): Adds comment from Bob Ras.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzA0LzExL2NsZWFuc3BhcmstYnV5cy0xNDQ5bS1vZi1iaXRjb2luLW1pbmluZy1yaWdzLXRvLWRvdWJsZS1pdHMtaGFzaHJhdGUv0gF1aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2J1c2luZXNzLzIwMjMvMDQvMTEvY2xlYW5zcGFyay1idXlzLTE0NDltLW9mLWJpdGNvaW4tbWluaW5nLXJpZ3MtdG8tZG91YmxlLWl0cy1oYXNocmF0ZS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "CleanSpark Buys $144.9M of Bitcoin Mining Rigs to Double Its Hashrate - CoinDesk",
        "content": "CleanSpark aims to have 16 EH/s of computing power by the end of the year. It lowered its 2023 guidance in December 2022 from 22.4 EH/s, citing delays in construction by one of its partners, Lancium. Another 2.44 EH/s of machines that it acquired at a discount in February are expected to be online at a Washington state facility later in Q2."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tMzAwMDAtZXRoZXItanVtcHMtdXMtc3RvY2tzLW1peGVkL9IBQ2h0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tMzAwMDAtZXRoZXItanVtcHMtdXMtc3RvY2tzLW1peGVkL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin pops above US$30,000, Ether jumps, U.S. equities mixed - Forkast News",
        "content": "Bitcoin surged past the US$30,000 mark in Tuesday morning trading in Asia to the highest in about 11 months, leading a rally of all top 10 non-stablecoin cryptocurrencies, including Ether. U.S. equities closed mixed on Monday as investors look to a series of economic readings this week to get a better sense of which way the Federal Reserve may jump with interest rates. This follows data that suggested the labor market remains tight, while other indicators suggest the economy may be headed for a recession.\n\nSee related article: Hong Kong financial secretary eyes Web3 push despite market fluctuations\n\nFast facts\n\nBitcoin jumped 5.25% in the 24 hours to US$29,890 at 09:00 a.m. in Hong Kong and then drove past the US$30,000 mark later in the morning for a gain of more than 8% over the past seven days, according to CoinMarketCap data. The world’s largest cryptocurrency is trading at its highest price since June 10, 2022, and has surged about 80% year to date after a slump through most of last year.\n\nThe gains in Bitcoin reflect its role as a safe haven asset to hedge against inflation and recession, Marat Minkin, the co-founder of decentralized finance payment app TONBanking, told Forkast.News on Friday. Prices will be driven by regulatory developments and economic data this week, said Minkin.\n\nEther rose 3.04% to US$1.917, adding 6.23% for the past seven days. This ahead of the Ethereum blockchain’s Shanghai upgrade on Wednesday, which will allow investors to withdraw their staked Ether for the first time and reportedly add other features and improvements to the blockchain.\n\nSolana moved up 3.08% to US$20.95 and held a weekly gain of 2.70%. The Solana Foundation introduced “state compression” last Thursday that aims to reduce on-chain storage costs for non-fungible tokens, or NFTs.\n\nThe total crypto market capitalization jumped 3.40% in the past 24 hours to US$1.23 trillion. Total trading volume over the last 24 hours rose 40.50% to US$41.68 billion.\n\nIn the NFT market, the Forkast 500 NFT index edged up 0.17% to 3,941.20 in the 24 hours to 09:00 a.m. in Hong Kong, but dropped 2.41% for the week. The index is a proxy measure of the performance of the global NFT market and includes 500 eligible smart contracts on any given day. It is managed by Forkast Labs data branch, CryptoSlam.\n\nNFT trading is fairly flat after the long weekend holiday and more focus on the gains in cryptocurrencies, said Yehudah Petscher, NFT strategist at Cryptoslam.\n\nU.S. equities closed mixed on Monday after the three day weekend. Investors have a series of data releases this week, including the U.S. consumer price index on Wednesday and the U.S. producer price index on Thursday. The Dow Jones Industrial Average added 0.30%, the S&P 500 moved up 0.10%, and the Nasdaq Composite Index treaded water with a 0.03% dip.\n\nThe U.S. unemployment rate dropped to 3.5% in March, lower than the 3.6% forecast by analysts. While this suggests a stronger economy, it contrasts with a drop in new payrolls in March that reflects a slowdown.\n\nAmid this mixed picture, analysts at the CME Group expect a 28.3% chance the Fed will leave interest rates unchanged at its next meeting on May 3, while 71.3% predict a 25-basis-point rate hike, up from 64.7% on Monday. U.S. interest rates are currently between 4.75% to 5%, the highest since June 2006.\n\nU.S. stock futures traded flat as of 9:00 a.m. in Hong Kong. The Dow Jones Industrial Average added 0.09%. The S&P 500 futures edged up 0.07%. The Nasdaq Composite Index inched 0.03% lower.\n\nSee related article: FTX’s lack of financial controls complicates bankruptcy asset recovery, says legal filing"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTEyL25vdm9ncmF0ei1zYXlzLWNsZWFyZXN0LXRyYWRlcy1hcmUtbG9uZy1nb2xkLWV1cm8tYml0Y29pbtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Novogratz Says the 'Clearest Trades' Are Long Gold, Euro, Bitcoin - Bloomberg",
        "content": "Galaxy Digital Holdings Ltd. founder Mike Novogratz said he expects gold, the euro and cryptocurrencies Bitcoin and Ether to outperform competing investments as the Federal Reserve moves toward easing its interest-rate increases after recent bank failures lead to a potential credit crunch.\n\n“The clearest trades have been and will continue to be long gold, long the euro, long Bitcoin, long Ethereum — these assets that should do well with the Fed stopping hiking and then cutting,” Novogratz said in a Bloomberg Television interview Wednesday."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiiwFodHRwczovL2ZvcnR1bmUuY29tL2NyeXB0by8yMDIzLzA0LzExL2xpZ2h0c3BhcmstbGF1bmNoZXMtdG9vbC10by1maXgtYml0Y29pbnMtbGlnaHRuaW5nLW5ldHdvcmstaW4ta2V5LXRlc3QtZm9yLWZhY2Vib29rLXZldC1kYXZpZC1tYXJjdXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Lightspark launches tool to fix Bitcoin's Lightning Network in key test for Facebook vet David Marcus - Fortune",
        "content": "The Lightning Network uses peer-to-peer technology to rapidly accelerate Bitcoin payments, letting users carry out rapid transactions for just a few pennies. It’s a promising idea that could finally vault Bitcoin into the mainstream but for one problem: Lightning doesn’t really work.\n\nThat’s the view of David Marcus, who oversaw messaging at Facebook (now Meta) and then led the company’s failed crypto project called Diem, which was snuffed out by hostile politicians and regulators. Today he is the CEO of Lightspark, a startup that’s raised $175 million, and which gives Marcus—also a former president of PayPal—a second chance to preside over a breakthrough moment for crypto.\n\nOn Tuesday, Lightspark announced it has launched a software package that the company says will make it easy for businesses to harness the Lightning network’s potential benefits.\n\nIn an interview with Fortune, Marcus and his team made the case that Lightspark’s new service—which offers three different pricing tiers based on volume—will make Lightning viable by making the network easy to use and supplying adequate liquidity.\n\nAccording to Lightspark, the current process for using Lightning is too daunting and technical, even for many companies familiar with crypto and payment operations. And even when users do manage to get set up on Lightning, which relies on a series of peer-to-peer “channels” connecting to nodes, the network often doesn’t work because many node operators do not have enough Bitcoins on hand to immediately process transactions, Marcus claims.\n\nLightspark claims its solution relies on data science to constantly move liquidity to where it’s most needed, making the Lightning network more reliable. It has also created software tools that the firm says will make it practical and easy for businesses to use—a development that Marcus compares to letting people use the internet via a browser rather than the underlying TCP protocol.\n\n“We’ve made our interface simple, removing all complexity,” the company said in a statement. “It will be familiar to people in businesses who need to integrate payments into their products and services…Lightspark discovers the best-performing nodes and predicts their ability to successfully route transitions. Our infrastructure is up to 15 times more capital efficient than most alternatives.”\n\nThe upshot of all this is that Lightspark believes people soon will be able to avail themselves of a wide variety of nearly instant Bitcoin-based payments. The company says that, for practical purposes, this means it will become possible to buy a wide variety of online services—from music to news articles to Wi-Fi access—quickly and cheaply, with little friction.\n\nMarcus says Lightspark is already working with a number of clients, including crypto wallet providers and the Bitcoin bank and storage firm Xapo, to deploy its service.\n\nLightspark is not the only well-funded company to bet on turning the Lightning network into a mainstream payment tool. Earlier this year, Block (formerly Square), announced a series of initiatives that it says will help solve the network’s liquidity woes.\n\nThese initiatives come after more than a decade of Bitcoin failing to become part of everyday commerce, despite proponents hailing it as a superior payment technology. Marcus, however, believes that this moment will finally arrive, and that Lightspark will play a key role in delivering it."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9taWNyb3N0cmF0ZWd5LWJpdGNvaW4tYmV0LXR1cm5zLWdyZWVuLWFzLWJ0Yy1wcmljZS1jbGltYnMtdG8tMTAtbW9udGgtaGlnaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "MicroStrategy Bitcoin bet turns green as BTC price climbs to 10-month high - Cointelegraph",
        "content": "Business intelligence and Fortune 500 company MicroStrategy’s Bitcoin (BTC) investment has turned green again as BTC broke past the critical resistance of around $29,000 to record a new 10-month high of $30,163.\n\nMicroStrategy started investing in Bitcoin in the second quarter of 2020 when the BTC price was trading around $10,000. Since then, the business intelligence firm had made a series of BTC purchases over the period of two years. The firm has accumulated a total of 140,000 Bitcoin, acquired for nearly $4.17 billion at an average price of $29,803 per BTC.\n\nMicroStrategy co-founder Michael Saylor introduced the Bitcoin strategy as a treasury hedging asset over the United States dollars. Apart from holding BTC personally and on the company’s balance sheet, Saylor also convinced several public companies to accumulate BTC on their balance sheets, including the likes of Tesla, SpaceX and a dozen others.\n\nThe Bitcoin bet made by the Fortune 500 company looked lucrative throughout the bull market in 2021. However, a prolonged crypto winter in 2022 fueled by multiple crypto contagions brought upon by the collapse of leading crypto unicorns, crashed BTC price by over 70%. The same Bitcoin bet that looked lucrative in 2021 attracted a lot of flak from crypto critics as MicroStrategy’s Bitcoin investment was at a 50% loss at the peak bear market in 2022.\n\nHowever, Saylor always maintained that MicroStrategy had full confidence in Bitcoin’s underlying fundamentals and would continue to invest in the top cryptocurrency. In an interview with Cointelegraph, Saylor said that a Bitcoin investment should be judged from a four-year price cycle rather than based on one bear or bull market.\n\nRelated: MicroStrategy adds another 1,045 Bitcoin to its growing crypto treasury\n\nAfter a disastrous 2022, BTC price has shown strength throughout 2023, with the price seeing over a 55% increase in the first quarter of this year. Bitcoin price has closed above the previous month's high three months in a row, a sign considered to be a bullish market indicator and an indication of another bull run on the horizon.\n\nBitcoin price history. Source: Bitcoin Archives\n\nBitcoin has outperformed most traditional stocks and bonds this year and has eclipsed the losses incurred from the crypto contagions caused by FTX and Terra-Luna saga.\n\nMagazine: Crypto winter can take a toll on hodlers’ mental health"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWhpdHMtMzBrLXRvLW1hcmstaGlnaGVzdC1wcmljZS1zaW5jZS1qdW5lLTIwMjLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin hits $30K to mark highest price since June 2022 - Cointelegraph",
        "content": "Bitcoin (BTC) has hit price highs not seen since mid-2022 with the largest crypto by market cap touching $30,000 and setting a new high for 2023.\n\nAccording to CoinGecko data, Bitcoin has slightly surpassed $30,000 and is at nearly $30,200 at the time of writing, a price it hadn't reached since June 10, 2022.\n\nIn the last 30 days, BTC recorded gains of nearly 46%, rising to its highest level in ten months on April 11.\n\nA 24-hour Bitcoin price chart showing its 6.5% gain to surpass $30,000. Source: CoinGecko\n\nSome analysts predicted that it would regain its $30,000 price tag as traders await the United States Consumer Price Index (CPI) report on April 12, which will give insight into the Federal Reserve's battle against inflation.\n\nSince last week, the Crypto Fear and Greed Index has remained firmly within the \"Greed\" territory, with the latest April 11 update showing a score of 68 out of a possible total of 100.\n\nCrypto market sentiment was reflecting “Greed” on April 11, according to the index. Source: alternative.me\n\nThe Crypto Fear and Greed Index aims to numerically present the current “emotions and sentiments” toward Bitcoin and the cryptocurrency market, with the highest score being 100.\n\nThe index also hit a score of 68 on March 21, marking its highest level since it recorded a score above 66 on Nov. 16, 2021, just days after Bitcoin’s all-time high of over $69,000 was recorded on Nov. 10, 2021.\n\nRelated: Bitcoin price will hit this key level before $30K, survey says\n\nMichael Saylor, the founder and executive chairman of business intelligence firm MicroStrategy, has been an outspoken advocate for BTC and has been leading the charge for corporations to adopt cryptocurrency as a strategic asset.\n\nMicroStrategy has added billions worth of Bitcoin to its balance sheet, currently owning 140,000 BTC as of April 5 for a total purchase price of $4.17 billion.\n\nWith an average price of roughly $29,803 per coin, the latest price jump means MicroStrategy has made a gain on its investment.\n\nMicroStrategy has acquired an additional 1,045 #bitcoin for ~ $29.3M at an average price of $28,016 per bitcoin. As of 4/4/2023 @MicroStrategy holds 140,000 bitcoin acquired for ~$4.17 billion at an average price of $29,803 per bitcoin. $MSTR https://t.co/IBufTxalnv — Michael Saylor⚡️ (@saylor) April 5, 2023\n\nMicroStrategy has been steadily increasing its BTC holdings since its first purchase in August 2020, even with the ongoing crypto bear market.\n\nMagazine: US enforcement agencies are turning up the heat on crypto-related crime"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWlzLWEtZ2FtYmxpbmctdG9rZW4tYW5kLWl0LWRvZXNuLXQtaGF2ZS1hbnktaW50cmluc2ljLXZhbHVlLXdhcnJlbi1idWZmZXR00gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "'Bitcoin is a gambling token, and it doesn't have any intrinsic value' — Warren Buffett - Cointelegraph",
        "content": "Warren Buffett once again took up his familiar role as conductor of the FUD train in yet another anti-cryptocurrency interview with CNBC’s Squawk Box on April 12.\n\n“We’ve had an explosion of gambling,” the magnate told CNBC by way of describing the cryptocurrency market. He then added, “I like to bet on a football game if I’m sitting and watching — it makes it more interesting. But I don’t think I want to make a living trying to bet against the house.”\n\nThis represents somewhat of a softening of Buffett’s historical stance on Bitcoin (BTC) and cryptocurrency. Over the years, he’s made a habit of down-talking crypto, with some of his most controversial quotes coming from previous CNBC interviews.\n\n\"People like to play the lottery,\" says Warren Buffett on the crypto craze. \"It's appealing to the gambling instinct. We've had an explosion of gambling.\" pic.twitter.com/pjNEKdNgr1 — Squawk Box (@SquawkCNBC) April 12, 2023\n\nIn a 2014 Squawk Box interview, he told Quicken Loans founder Dan Gilbert that Bitcoin was “a mirage” and claimed that “the idea that it has some huge intrinsic value is just a joke.”\n\nBuffett ventured speculation on Bitcoin’s longevity in another 2014 CNBC interview, stating that he “would not be surprised if Bitcoin is not around in 10 or 20 years.” At the time, he also said Bitcoin couldn’t be considered a currency because it is “inevitably based on the value of the dollar.”\n\nRelated: Buffett back bashing Bitcoin, claims it ‘doesn’t produce anything’\n\nWhat’s perhaps Buffett’s most famous quote on cryptocurrency came in a January 2018 interview when he doubled down on fellow Berkshire Hathaway vice chairman Charlie Munger’s previous assertion that Bitcoin was “rat poison” by saying that it was “probably rat poison squared.”\n\nThat brings us to his most recent CNBC interview, where Buffett’s tone appears to have changed somewhat.\n\nWhen asked when Bitcoin will be “revealed as not just rat poison squared [...] But when it will be unveiled as not a thing,” Buffett shrugged off the question and instead compared the cryptocurrency to gambling:\n\n“That’s predicting when speculation will end or when the gambling instinct will go away.”\n\nThe billionaire then shifted his response to a brief riff on snail mail chain letters, “I didn’t like chain letters when I was a kid. I thought, ‘Why in the world would I send along a chain letter… when I could start my own?’”\n\nBuffett eventually came back around to his gambling analogy, claiming that Bitcoin users were essentially placing bets with their income: “You had millions of people that were getting checks and the money and sitting home and finding out that they could have a roulette wheel in their house.”\n\n\"#Bitcoin is a gambling token and it doesn't have any intrinsic value. But that doesn't stop people from wanting to play the roulette wheel,\" says Warren Buffett on #crypto. pic.twitter.com/6MQAiyrS5J — Squawk Box (@SquawkCNBC) April 12, 2023\n\nThe billionaire’s track record in business may be long and storied, but Buffett’s own Berkshire Hathaway investment group hasn’t been immune to losses related to the recent banking crisis.\n\nAs Cointelegraph’s Marcel Pechman wrote in March, “Bitcoin’s price increased by 31.5% in the six months preceding March 17, while Berkshire’s stock increased by 5.8%. So, for the time being, the so-called ‘rat poison’… is outpacing his own financial management firm.”"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMijwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzEyL2xhcmdlLWJpdGNvaW4taW52ZXN0b3Itc2VudC0zMzBtLW9mLWJ0Yy10by1leGNoYW5nZS1iZWZvcmUtcHJpY2UtZHJvcHBlZC1iZWxvdy0zMGstYmxvY2tjaGFpbi1kYXRhL9IBkwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzEyL2xhcmdlLWJpdGNvaW4taW52ZXN0b3Itc2VudC0zMzBtLW9mLWJ0Yy10by1leGNoYW5nZS1iZWZvcmUtcHJpY2UtZHJvcHBlZC1iZWxvdy0zMGstYmxvY2tjaGFpbi1kYXRhL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Large Bitcoin Investor Sent $330M in BTC to Bitfinex Exchange Before Price Dropped Below $30K: Blockchain Data - CoinDesk",
        "content": "The latest maneuver came as BTC, the largest cryptocurrency by market capitalization, has been outperforming the broader crypto markets in the past month. CoinDesk Indices data over the past month shows that only seven of the 166 assets in the CoinDesk Market Index (CMI) have outperformed BTC, which was up 47%."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWNvbnRpbnVlcy10by1zaGluZS13aXRoLTk4LW9mLWluZmxvd3MtaW50by1jcnlwdG8taW52ZXN0bWVudC1wcm9kdWN0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin continues to shine with 98% of inflows into crypto investment products - Cointelegraph",
        "content": "On April 11, European cryptocurrency investment firm CoinShares published its latest “Digital Asset Fund Flows Report,” revealing that digital asset investment products experienced positive sentiment, with inflows totaling $57 million last week, bringing them back to a net positive position year-to-date. However, despite this, “volumes were low at $970 million for the week.” The global Bitcoin (BTC) exchange market also saw low volumes, ”just 25% of the year-to-date average at $18 billion for the week.”\n\nWeekly crypto asset flows in millions (U.S. dollars). Source: CoinShares\n\nAccording to the report, inflows were primarily driven by investors in the United States, with $27 million in inflows. Germany, Switzerland and Canada also saw positive sentiment, with inflows totaling $17 million, $13 million and $2.2 million, respectively, indicating a broad-based increase in confidence toward digital assets.\n\nInvestors primarily focused on Bitcoin, which received $56 million in inflows, accounting for 98% of all inflows. Meanwhile, short-Bitcoin suffered minor outflows totaling $0.6 million. In contrast, altcoins — including Uniswap’s UNI (UNI), Polkadot’s DOT (DOT) and Polygon’s MATIC (MATIC) — saw minor inflows of less than $1 million each.\n\nThe report also notes that, despite the Ethereum network’s Shapella upgrade scheduled for April 12, Ether (ETH) inflows were relatively minor at $600,000, suggesting that perhaps investors are cautious about investing in ETH until they are more confident about the impact of the upgrade. Additionally, blockchain equities saw minor inflows totaling $2.1 million, indicating a relatively quiet week for the market segment.\n\nRelated: Ethereum price retests key support level that preceded 60% gains in June 2022\n\nOverall, the positive sentiment in the digital asset market last week — despite low volumes — indicates that investors remain bullish on the prospects of cryptocurrency. As previously reported by Cointelegraph, Bitcoin has reclaimed $30,000, its highest price since June 2022. Over the last 30 days, BTC recorded gains of nearly 46%, rising to its highest level in 10 months on April 11.\n\nBitcoin price chart. Source: CoinGecko\n\nOn April 5, American business intelligence firm MicroStrategy added another 1,045 BTC to its growing crypto treasury, for approximately $29.3 million at an average price of $28,016 per BTC. Saylor has been a prominent Bitcoin proponent, urging businesses to incorporate the leading cryptocurrency into their strategic asset allocation. He has consistently emphasized his belief that Bitcoin is the most dependable, secure store of value available in the current market and presents a distinctive avenue for enterprises to safeguard their assets against inflation."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9yZGluYWxzLWNvbW11bml0eS1kZWJhdGVzLWZpeC1hZnRlci1pbnNjcmlwdGlvbi12YWxpZGF0aW9uLWJ1Z9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Ordinals community debates fix after inscription validation bug - Cointelegraph",
        "content": "A few solutions are being discussed to fix a code bug found in the Bitcoin (BTC)-native Ordinals protocol that has prevented over 1,200 inscriptions from being validated.\n\nWhile nearly every member of the Ordinals community agrees that these inscription requests should be reincluded, the community is debating whether they should be added retroactively or not.\n\nThe bug came from the indexer function of the protocol only counting inscriptions that were in the first input of a transaction submitted up to and including version 0.5.1 of the protocol.\n\nOne prominent Ordinals member known on Twitter as “Leonidas.og” summarized the pros and cons of each solution in an April 10 tweet, coming a few days after the issue was first made public on April 5 by the GitHub user “veryordinally.”\n\nA bug was found in the ordinals protocol that caused ~1,200 inscriptions that should have been valid to not get included. The first of these \"orphan\" inscriptions happened just before inscription number 420,285. The bug was caused by the ordinals protocol only counting… — Leonidas.og (@LeonidasNFT) April 10, 2023\n\nThe first solution involves selecting a block height to retroactively index the so-called “orphan” inscriptions from inscription number 420,285 onwards, which is roughly where the first orphan inscription was identified.\n\n“This feels like the ‘purist’ solution because it means the ordinals protocol would correctly match the logical ordering on-chain,” Leonidas.og explained, despite acknowledging that the reshuffling “may cause other complications.”\n\nWe currently have 1206 “hidden” inscriptions that are not indexed due to https://t.co/VZHCNaBmw0 - join the discussion on GitHub on this interesting consensus and decentralized protocol evolution issue — ordinally (@veryordinally) April 10, 2023\n\nThe alternative is to not change inscription numbers that have already been validated and to pick a block height to add these orphan inscriptions in at some time in the future, Leonidas.og explained:\n\n“This would not change any existing inscription numbers so the ~1,200 orphans would not be assigned inscription numbers officially in the protocol. It would be up to the market to value them as ‘misprints’ or not.”\n\nAnother Ordinals GitHub community member, “Yilak,” argued in favor of not changing up the order because only a fraction of inscription owners have been impacted.\n\nRelated: Bitcoin Ordinals daily inscriptions surge due to ‘BRC-20 tokens’\n\nAt the time of writing, 67.5% of 1,266 voters are in favor of not changing the inscription numbers, according to a Twitter poll created by Leonidas.og.\n\nOn April 8, the number of Bitcoin Ordinals inscriptions surpassed 1 million, according to data from the crypto analytics platform Dune. It came just days after daily new inscriptions hit a record of over 76,300 on April 4.\n\nOrdinals are considered to be digital artifacts on the Bitcoin network, similar to nonfungible tokens. They can compromise of images, PDFs, video or audio formats.\n\nMagazine: Unstablecoins: Depegging, bank runs and other risks loom"
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vdGhlcmVjb3JkLm1lZGlhL3RyYWNpbmctY3J5cHRvLXNhcmFoLW1laWtsZWpvaG4tc3RlZmFuLXNhdmFnZS1pbnRlcnZpZXfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Tracing cryptocurrency: Q&A with the PhD candidate and her adviser who proved it wasn't anonymous - The Record from Recorded Future News",
        "content": "For years now, dark web markets have flourished on the assumption that their currency of choice — crypto — was untraceable. But it turns out the blockchain, the giant digital ledger that keeps track of the world’s cryptocurrency transactions, had a secret: It contained all the clues anyone needed to connect underground purchases to people in the real world.\n\nThe first person to publish a paper saying as much was a PhD candidate at University of California, San Diego named Sarah Meiklejohn, in 2013. Her work changed the way law enforcement investigated crimes in cyberspace and helped private companies develop new tools to track and identify bad guys on the dark web.\n\nClick Here spoke with Meiklejohn and her adviser, Stefan Savage, about how they came to track cryptocurrency transactions — and why so much of it depended on an unlikely thing: shopping.\n\nWe’ve edited our conversations with them for length and clarity.\n\nClick Here: Sarah, how did you end up being so fascinated by bitcoin?\n\nSarah Meiklejohn: It was pretty random how I got into bitcoin. I had heard about it in the summer of 2011. It was starting to get a bit bigger then. The price of a bitcoin had kind of a brief spike in the summer of 2011. I heard about it as this way to buy drugs on the internet, because that was kind of when Silk Road was first emerging.\n\nAnd then I didn't really think about it much to be honest, until one of the postdocs in our research group at UCSD. … We were out on a hike in the desert and he brought up bitcoin and was telling me all about the consensus protocol that bitcoin uses and how it's really fascinating and yeah, I mean he was really into it and it kind of got me interested as well. And I went home from that hike and kind of started looking at the white paper and pretty quickly we just started working on a project on it.\n\nCH: The white paper is of course the one written by Satoshi Nakamoto … which laid out how a digital currency like bitcoin could work and how a digital ledger called the Blockchain could keep track of all the transactions.\n\nSM: What I think made me more interested in bitcoin was this question of privacy. I think in the beginning, you know, we all just were kind of like, “whoa, bitcoin, like, what's anyone doing with it? You know, how's it being used?”\n\nThe research group that I ended up doing this work with and working quite closely with, had a huge amount of expertise in empirical analysis of kind of shady activities on the internet, for lack of a better way to put it. They had done all this work looking at botnets and looking at spam and looking at all these kinds of phenomena on the internet. So they had a really strong empirical way of doing things and I wanted to try that out. And I think that was more than anything the driving factor behind the project. Just curiosity and a desire to develop a new skill set.\n\nCH: So how did the idea of just starting to buy things and trace the transactions come about?\n\nStefan Savage: We as a group had actually been involved in a lot of this kind of undercover purchasing activity for a while, just not about bitcoin.\n\nWe had cut a deal with a bank that allowed us to effectively issue credit cards and then track the flow of money, and so we bought like $50,000 worth of counterfeit drugs and then tracked the flow of money back to the banks they came from.\n\nAnd so I think that notion of following the money by buying things and then seeing what happened was something that was pretty central to the research enterprise at the time.\n\nCH: Was there like a conversation in which you said, “Hey, we were buying all these pharmaceuticals and following the money that way, should we do the same thing here?”\n\nSS: Sarah came up with the idea that, look, you have this anonymous identifier that corresponds to either a person or an exchange or a retailer, and it is anonymous.\n\nSo long as no one uses it. There's these side effects when you touch the real world in some way.\n\nSM: We had all these techniques that we were developing for saying that these multiple bitcoin addresses or pseudonyms belonged to the same entity, whether that entity was an individual user or a big company like an exchange or something like that.\n\nAnd so that was kind of all well and good, you know, we could say, “oh wow, look at that entity. They control 300,000 bitcoin addresses. And this one has fewer. And look, that entity is sending bitcoins back and forth with that other one.”\n\nBut on their own, these aren't very insightful things to say, right? You're only really gonna understand what's going on if you actually know who these entities are, right? So it's like, “Oh wow, look at that exchange. It's sending a lot of money to Silk Road.” Then it becomes more interesting.\n\nAnd so basically, without engaging in these kinds of transactions ourselves, we weren't going to know who Entity X was. Whereas if we could actually interact with some of these services, we might be able to say, oh yeah, Entity X is this big exchange.\n\nCH: It seems to me even that little step that you started with, the idea that you could cluster these transactions together … even that is new, right? Didn't people think that the blockchain was utterly anonymous?\n\nSM: People probably did think that bitcoin was anonymous in the early days. I will say though, the ability to cluster together different types of addresses was already acknowledged in [Satoshi Nakamoto’s] white paper. You know, it's like there's one sentence. that basically says that the most common way that we cluster things is we say all the inputs in a bitcoin transaction belong to the same user.\n\nSo I would say it was new in the kind of scale and how far we pushed it. But the actual idea of clustering together, at least based on that kind of approach is actually not new. It was already out there to begin with.\n\nSS: There was an assumption that because there were no names in bitcoin, there was no addresses, there was no number that was linked back to an individual where they had filed some paperwork, that it was really anonymous. And, um, that's not the same as being anonymous. Just because the wallet ID or the cryptographic ID in bitcoin does not have your name on it does not mean that you're anonymous.\n\nCH: So then how do you get to purchasing physical objects?\n\nSM: So yeah, we got to this point in the research where we just realized, OK, we're not gonna get any further until we know who these entities are. So basically what we started doing is just interacting with literally any entity in the bitcoin ecosystem who was willing to interact with us.\n\nSo that primarily meant opening a lot of accounts with exchanges, for example, or other so-called wallet services, and then interacting with those services, right? So basically creating an account, saying “I would like to deposit some money into my account,” getting them to give you a bitcoin address. Then you can confidently say that that bitcoin address is controlled by that entity.\n\nAnd then you can also go and withdraw your money from that service. And again, go look at the blockchain, see these addresses that were used for that withdrawal, and again, say with a hundred percent confidence, “I know that these addresses belong to that entity.”\n\nSo, the main way that we did this was by interacting with exchanges, because those were the main entities who were willing to interact with us. But the other entities who were willing to interact with us were vendors. People or services, shops wanting to sell things to people who were willing to pay in bitcoin. So that's basically how we ended up buying physical objects.\n\nI don't remember the literal first object we bought, it might have been, just for fun, the Guy Fawkes mask or something like that.\n\nSS: We gave [Sarah] a bunch of money. Two, $3,000 or something like that. And there were crazy things she would buy.\n\nLike a Boston CD and socks, and so forth. Everything from … I think we got like scones or something one time, to … I have a coffee cup here that she bought. She was ordering dozens of things a day at the peak.\n\nIt wasn't utilitarian. It was, I need to get a purchase from some wallet in this cluster that my algorithm has identified. Let me go and see things that are likely to get me there. She made sure to get all of the big online payment platforms. Mt. Gox, obviously … she identified all of the things from Mt. Gox. We did do some legal purchases on Silk Road so that we could identify all of the Silk Road wallets.\n\nCH: And was Silk Road one of the entities that you were tracking?\n\nSM: Absolutely. We identified over 200,000 addresses controlled by Silk Road. And one of the case studies we did in our paper revolved around a big address that was associated with Silk Road at the time.\n\nCH: So, in the white paper, Satoshi basically says that bitcoin transactions have these multiple inputs that lead to linking. Can you walk us through how you solve that puzzle of how the money gets moved?\n\nSM: Well, so if multiple addresses have been used as input of the same transaction, then they belong to the same entity. This is something that we call the multi input heuristic. So that heuristic is really useful for collapsing things down into like semantically meaningful entities, right?\n\nSo that you can say with a lot of confidence, “this exchange controls these 300,000 addresses.” Even though you didn't see that exchange use every single one of those 300,000 addresses yourself, by the way that those addresses got used in transactions you can be reasonably confident in this conclusion.\n\nSo the insight we had was that if I interact with this exchange, let's say, then that's a transaction. They will use the address that they gave to me for my deposit… They'll use it in some other transaction or in some way. And the idea is that if the way that they transact with it involves using it as input with other addresses, then there's a chance that I could identify this address as landing within one of these larger clusters.\n\nSo we could see money was flowing from one exchange to another, or from one service to another. And I think that coupling this ability with this idea of being able to kind of follow and track bitcoins as they went around the network, the idea is that we could see users interact with services like individual users.\n\nAnd you know, this was around the time when. When basically FinCEN was starting to impose, like know your customer requirements on exchanges, and so we actually knew, or could hypothesize that if we saw a user deposit money into an account or an exchange, that it would be possible with subpoena power or if you were that exchange to actually identify who that user was. Like their real identity, not just what addresses they controlled in bitcoin.\n\nWe used as case studies a number of big thefts that had happened in bitcoin and other potential criminal behavior. And a lot of the times we could really confidently track illicit money right to the doorstep of a big exchange.\n\nThis has serious impact on the anonymity not just of potential criminals, but really of anyone. That you could basically see how they moved their money around in the bitcoin blockchain itself. We could trace things quite easily ourselves just by accessing the blockchain.\n\nCH: So you don't even really necessarily need the subpoena.\n\nSM: I mean, you know, if you wanna know who a user actually is, like their name, then yeah, at some point you do need the subpoena. But I mean that's the kind of crazy thing ultimately about the bitcoin blockchain, I guess, right?\n\nIt's completely transparent. Anyone who wants can just download it and, and look at every transaction that's happening.\n\nCH: And did you ever think that what you were doing was going to give rise to an entire industry?\n\nSM: Uh, no. No, I did not.\n\nCH: Why not?\n\nSM: I mean, you know, I'm an academic. I kind of thought of it as a small academic experiment. I thought that scaling it up would be a lot of work. I mean, it was time consuming. I basically did nothing else for like a month straight. It was basically a very manual process. And so I was just like, oh, come on. Like, who's gonna do that at any kind of real scale, right?\n\n**CH: How about you, Stefan? In your wildest dreams, did you ever think that Sarah's research would actually end up growing into an industry? **\n\nSS: No, I think in part because, when we first conceived of Sarah's project, it was not to trace cryptocurrency. I mean, we did want to break through the anonymity, but it was not designed to be kind of an operational tool. We wrote this paper to try to say what is bitcoin being used for? Rather than come up with a tool.\n\nWe didn't know it was gonna take off and all of us thought that bitcoin was kind of crazy. So the notion that it would become big enough that there would be businesses focused on tracing it, was not on our radar at all.\n\nCH: When your paper came out, what was the reaction?\n\n**SM: **Oh, I got a lot of emails, I did talk to a lot of reporters and stuff like that. Also increasingly law enforcement, policymaker types. I also got a lot of personal emails though, from people who had lost their bitcoins or had them stolen and literally didn't know who else to ask. So they were emailing me. I did try to engage with a lot of them and, you know, was often fairly unsuccessful as you might expect.\n\nSS: We ended up talking to everyone from the law enforcement side to folks in Treasury to Homeland Security. There were staffers who were calling us. It was all of a sudden a point of significant interest.\n\nThere was a decision going on in the U.S. government about what should we do here? Should we just shut the whole thing down? Should we have a light touch? And [the paper] provided some comfort to the people who were very concerned to say, well, it's not going to be untraceable. So maybe we don't need to have as hard-line a response.\n\nCH: Are you still doing this sort of thing now? Stefan, did this project change what your research focus was?\n\nSS: So, this all gets finished up at the same time as Sarah's looking for jobs. She goes off, becomes a faculty member. And I think none of us really thought this whole thing would take off the way it did. We continued to be skeptics.\n\nWe did some stuff with ransomware, and tracking ransomware using cryptocurrency. But it was kind of one-off projects. We have only recently started to get involved again, and mainly because the magnitude of the thefts are just phenomenal. That hundreds of millions of dollars of value is getting lost at a shot has made it interesting again.\n\nI think tracing is kind of a done issue, but that world has now become much more complex. It's not just one currency, it's lots of them. And there are these bridges between them. And there are these things called smart contracts that allow transactions to have kind of arbitrary kinds of constraints on them. And that has allowed for very sophisticated fraud to take place. And so now we are starting to do some work in that space again."
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvYml0Y29pbi12cy1nb2xkLW9uZS1yZXNlYXJjaC1maXJtLXNheXMtdGFrZS10aGUtZm9ybWVyL9IBZGh0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vY3J5cHRvLWNoYW5uZWwvYml0Y29pbi12cy1nb2xkLW9uZS1yZXNlYXJjaC1maXJtLXNheXMtdGFrZS10aGUtZm9ybWVyL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin vs. Gold: 1 Research Firm Says Take the Former - ETF Trends",
        "content": "In its roughly 14 years of existence, bitcoin has often drawn comparisons — launched mainly by proponents — to gold. There’s the long-running “digital gold” label, which has often been admonished by gold bugs.\n\nOf course, there are substantial differences between gold and bitcoin, not the least of which being that bullion is something that can be held by the human hand and has a track record which is measured in the thousands of years. However, bitcoin and gold are both considered alternative assets, and the good news for investors is that they don’t necessarily need to choose between the two.\n\nIn what could be a positive sign for equity-based plays on bitcoin, including the Invesco Alerian Galaxy Crypto Economy ETF (SATO) and the Invesco Alerian Galaxy Blockchain Users and Decentralized Commerce ETF (BLKC), Bernstein said in a recent report to clients that it doesn’t make sense to endorse gold while bashing bitcoin.\n\nThe research firm noted that an increasingly prominent theme in client conversations is that investors are preparing for an extended period of the U.S. dollar falling out of favor, and they’re tapping gold to prepare for that scenario. That makes sense because commodities, including gold, are denominated in dollars, but bitcoin might merit a place in that conversation, too.\n\n“If you like gold here, you should like bitcoin even more … Gold and bitcoin correlation increases during the periods of crisis. And when there is a massive monetary debasement event, while both bitcoin and gold rally, bitcoin outperforms gold,” according to Bernstein.\n\nThere might be something to the dollar debasement thesis, as the largest gold-backed exchange traded fund is higher by more than 9% year-to-date. On the other hand, that’s a far cry from the 80% jump notched by bitcoin. That resurgence is propelling BLKC and SATO; the Invesco ETFs are, as of April 10, up 35% and 73.08%, respectively, year-to-date.\n\nSATO’s outpacing of its stablemate is likely attributable to more exposure to bitcoiners — companies whose share prices are highly correlated to price action in the largest digital currency. BLKC, meanwhile, features some exposure to bitcoin miners as well as significant allocations to traditional financial services companies and large-cap growth stocks.\n\nEither ETF could be a horse worth betting on as bitcoin continues its 2023 ascent. Speaking of horses — “Liking gold, but not liking bitcoin, is like hating on a faster horse,” concluded Bernstein.\n\nFor more news, information, and analysis, visit the Crypto Channel.\n\nVettaFi LLC (“VettaFi”) is the index provider for BLKC and SATO, for which it receives an index licensing fee. However, BLKC and SATO are not issued, sponsored, endorsed or sold by VettaFi, and VettaFi has no obligation or liability in connection with the issuance, administration, marketing or trading of BLKC and SATO.\n\nThe opinions and forecasts expressed herein are solely those of Tom Lydon, and may not actually come to pass. Information on this site should not be used or construed as an offer to sell, a solicitation of an offer to buy, or a recommendation for any product."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZGVjcnlwdC5jby8xMjU4NzcvYml0Y29pbi1uZWFycy0zMDAwMC1yZWFjaGluZy0xMC1tb250aC1oaWdo0gFKaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNTg3Ny9iaXRjb2luLW5lYXJzLTMwMDAwLXJlYWNoaW5nLTEwLW1vbnRoLWhpZ2g_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Hits $30,000, Reaching 10-Month High - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin has surged past $30,000.\n\nThe largest cryptocurrency is up over 7% in 24 hours—and it’s bringing the rest of the digital asset market with it.\n\nCoinGecko data shows that the largest cryptocurrency by market cap is trading for $30,327, up over 9% in seven days.\n\nAD\n\nAD\n\nThe last time Bitcoin hit these levels was on June 9 of last year—almost exactly 10 months ago.\n\nEthereum, the second largest digital asset, is trading hands for $1,933, a 4.3% 24-hour bump.\n\nWhile Dogecoin, the eighth biggest digital asset that last week jumped in value off the back of Elon Musk Twitter whims, is up modestly by 2.8% in the past day, trading hands for $0.085.\n\nBitcoin is by far doing the best out of the top 20 biggest digital assets. This may be in part because traders are expecting Federal Reserve Chairman Jerome Powell to slow the rate of interest rates due to the banking crisis, in turn make “risky” assets like Bitcoin more appealing.\n\nOthers are pushing the safe haven narrative: with current financial uncertainty, assets like Bitcoin and gold remain a safe bet when a recession is (still) apparently looming.\n\nAD\n\nAD\n\nBitcoin was lagging at the start of the year when it was worth $16,615 per coin. It has made a comeback, and is now up over 80%—despite seemingly endless regulatory woes for the crypto industry and an investor allergy to risk assets.\n\nBut the asset still has a long way to go before it hits its November 2021 all-time high of $69,044."
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWZhY2VzLWJlYXJpc2gtZGl2ZXJnZW5jZS1hbWlkLTIyay1jb3JyZWN0aW9uLXRhcmdldNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price faces 'bearish divergence' amid $22K correction target - Cointelegraph",
        "content": "Bitcoin (BTC) held $30,000 as support before the April 11 Wall Street opening, with fresh doubts emerging over the rally’s strength.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\nBTC price finally tackles $30,000 resistance cloud\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it hit 10-month highs of $30,438 on Bitstamp.\n\nAlmost one month in the making, the final surge to $30,000 delighted many traders who considered the move to be a matter of time.\n\nHaving uploaded a roadmap showing BTC/USD continuing to gain, Crypto Kaleo argued that Bitcoin was still the best investment allocation for capital, rather than cash or altcoins, at current prices.\n\n“Bitcoin is breaking out, of course all of the USD charts are going to look decently bullish,” part of the day’s Twitter commentary stated.\n\n“Look at the alt charts vs. BTC. I don’t see any that I like atm. Thus - while you might still be up in USD w/ some alt positions, your capital is still best allocated stacking more Bitcoin.”\n\nRelated: Crypto audits and bug bounties are broken: Here’s how to fix them\n\nDaan Crypto Trades meanwhile gave more attention to altcoins, entertaining the idea that BTC/USD may now consolidate.\n\n“It will be interesting to see what happens around here. I suspect we might see it cooling off a little, which means ALT/BTC pairs should gain some ground,” he wrote in part of a reaction tweet.\n\nHe added that Bitcoin market dominance might continue to increase if spot price gains remain brisk.\n\nBTC crypto market cap dominance annotated chart. Source: Daan Crypto Trades/ Twitter\n\n“Triple bearish divergence”\n\nDespite regaining what had long been a mass resistance zone, Bitcoin did not inspire everyone with its assault.\n\nRelated: CPI to spark dollar ‘massacre’ — 5 things to know in Bitcoin this week\n\nWith nearly $100 million in shorts liquidated on April 10 through April 11, analytics resource Skew noted that there was “air” on the Binance order book below the $30,000 mark during the breakout.\n\n$BTC Binance Spot\n\nClose to $30K now, filling more limit sell orders.\n\nNote the gap between large bids in the orderbook.\n\n\n\nComments on chart below: pic.twitter.com/LH20GiQIDM — Skew Δ (@52kskew) April 10, 2023\n\nMeanwhile, Venturefounder, a contributor to on-chain analytics firm CryptoQuant, warned of a “bearish divergence” between the spot price and relative strength index (RSI) on the daily chart.\n\n“Looking for a short term correction down to at least $25k sometimes soon, potentially down to $22k,” part of a prediction revealed.\n\nBTC/USD annotated chart. Source: Venturefounder/ Twitter\n\nTrader Cheds similarly eyed what he called a “triple bearish divergence” with on-balance volume (OBV), considering a short position but being “not in one” overnight.\n\n“Congratulations to the bulls that were respectful and were calling for 30k,” Il Capo of Crypto, the Twitter trader infamous for his bearish BTC price prognosis, added in a tweet on the day.\n\n“My bearish scenario is NOT invalidated yet.”\n\nSome were critical of the bearish divergence thesis, with popular trader Crypto Ed dismissing the idea on slightly longer 3-day timeframes.\n\nBTC/USD annotated chart. Source: Crypto Ed/ Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiW2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vZXhwbGFpbmVkL3doYXQtaXMtYS1jcnlwdG8tZHVzdGluZy1hdHRhY2stYW5kLWhvdy1kby15b3UtYXZvaWQtaXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "What is a crypto dusting attack, and how do you avoid it? - Cointelegraph",
        "content": "What is crypto dust? Crypto dust is small amounts of cryptocurrency sent to a large number of wallet addresses with benevolent or malicious purposes. Generally, dust is considered the amount of cryptocurrency equal to or lower than a transaction fee. Bitcoin, for example, has a dust limit imposed by Bitcoin Core, the Bitcoin blockchain software, of around 546 satoshis (0.00000546 BTC), the smaller denomination of Bitcoin (BTC). The wallets’ nodes that apply such a limit may reject transactions equal to or smaller than 546 satoshis. Dust could also be the small amount of cryptocurrency that remains after a trade as a result of rounding errors or transaction fees and can accumulate over time. That small amount is not tradeable but can be converted into the exchange’s native token. Crypto dust should not pose a significant threat, as it has mainly been used for legitimate rather than malicious purposes. For example, reaching out to wallet holders via dusting can be an alternative advertising method to more traditional mailshots. The dust transactions can contain promotional messages, so dusting is used instead of mailshots. Despite not being a major concern, crypto users should still know what a dust attack is and take measures to protect themselves should it occur.\n\nWhat is a crypto dusting attack? A dusting attack occurs when small amounts of crypto assets, called dust, are sent by malicious actors to multiple wallet addresses — just like dust — scattered across blockchain networks. Blockchain technology is pseudonymous, meaning that owners of a cryptocurrency address are not defined by their names or any other personal data. However, the blockchain ledger is transparent and traceable; thus, all transactions are visible to everyone, and a user’s activity can be tracked down following the history of that specific address. When attackers transfer dust to cryptocurrency wallets, they want to invade the privacy of their owners by tracking down their funds when they move them from one address to another. The attacker’s goal is not to steal cryptocurrency — as simple dusting won’t allow it — but rather associate the target’s address with other addresses that may lead to identifying the victim through off-blockchain hacking activity. A crypto dusting attack can occur in most public blockchains, including Bitcoin, Litecoin and Dogecoin. A dusting attack aims to link the attacked addresses and wallets to the personal data of their related companies or individuals and use this knowledge against their targets, either through elaborate phishing scams, cyberextortion threats, blackmail or identity theft to make a profit.\n\nAre all dusting attacks crypto scams? Not all the crypto dust transferred to a crypto wallet’s address is a scam. Dusting can be used for reasons besides hacking activities. A dusting technique may be used by governments to link a specific cryptocurrency address to an individual or an organization and identify a series of criminal activities, including money laundering, tax evasion, terrorist threats, etc., or to ensure regulatory compliance and safety. Developers may also use dusting to conduct their software’s stress tests, a software testing activity extended beyond limits to determine the robustness of the software and other functionalities like transaction processing speed, network scalability and security protocols. This can help identify potential issues and vulnerabilities in the software, allowing developers to improve its performance and security. Crypto traders tend to receive dust as a result of trades, and it’s not considered an attack. Many exchanges offer customers the chance to swap these small amounts of cryptocurrency for their native tokens to use in future trades or another cryptocurrency with a low transaction fee.\n\nHow does a dusting attack work? Malicious actors rely on the fact that cryptocurrency users don’t even realize they received tiny amounts of cryptocurrencies in their wallet addresses. Of the way blockchains work, with their transparency and traceability, it is possible to track down transaction movements that may lead to the identification of wallet owners. For a dust attack to be effective, the owner of the wallet must combine the crypto dust with other funds in the same wallet and use it for other transactions. By including a small amount of cryptocurrency in other transactions, the target of the attack may inadvertently and unknowingly send the dust to an off-blockchain centralized organization. As the centralized platform must comply with Know Your Customer (KYC) regulations, it will store the personal data of the victim, who may become vulnerable to phishing, cyberextortion threats, blackmailing and other targeted hacks off the blockchain aimed at stealing sensitive information. The cryptocurrency addresses that are more vulnerable to dusting attacks are the UTXO-based addresses used in various blockchains, mainly Bitcoin, Litecoin and Dash, because they all generate a new address for each change remaining from transactions. UTXO prevents double-spending and is an unspent transaction output that remains after a transaction is executed and can be used as input on another transaction. It’s like the change we receive from a merchant when we spend $9.59, for example, after giving a $10 bill. Just like that tiny change can be used in other money transactions later, the crypto dust from multiple addresses can be spent in other transactions. By detecting the origins of funds from the dust attack transaction, the attackers can use advanced technological tools to trace a thread to determine the victim’s identity.\n\nCan dusting attacks steal crypto? A traditional dusting attack cannot be used to access users’ money and steal their crypto assets. However, hackers’ increasingly sophisticated tools can trick wallet holders into phishing sites and drain their funds. A traditional dusting attack is used to identify the individuals or groups behind the wallets, deanonymize them, and break their privacy and identity. Such activities cannot steal cryptocurrency directly but are aimed at detecting victims’ social activities — tracked down through the combination of different addresses — to then blackmail them, for example. Over time and with the technology’s new use cases, such as nonfungible tokens (NFT) and decentralized finance (DeFi), attackers have become more sophisticated and have learned to disguise scam tokens as airdrops of free cryptocurrency. The wallet holders can access these appealing free tokens by claiming them from popular NFT projects on phishing sites created by hackers that seem legitimate. Such sites are so similar to the authentic ones that it’s difficult for the average cryptocurrency enthusiast to differentiate one from another. The phishing sites won’t steal usernames and passwords but will convince the victim to connect their wallet to the malicious sites. By granting these phishing sites permission to access their wallets, the unknowing victim enables the hacker to move their funds and NFT assets to their wallets, stealing crypto using harmful lines of code in smart contracts. Increasingly, dusting attacks occur on browser-based wallets like MetaMask and the Trust wallet, which are primarily used as a getaway to decentralized applications (DApps) and Web3 services. Browser-based wallets are particularly vulnerable to dusting attacks because they are more accessible to the public and can be more easily targeted by hackers or scammers.\n\nHow to identify crypto dust attacks? A clear indicator of a dusting attack in a wallet is the sudden appearance of small amounts of extra cryptocurrency unsuitable for spending or withdrawing. The dusting attack transaction will appear in a wallet’s transaction history, so verifying if any malicious dusting deposits occurred should be easy. Concerning how cryptocurrency exchanges operate and comply with KYC and Anti-Money Laundering (AML) regulations, they will store their customers’ data, making them a possible target of cryptocurrency scams. In October 2020, Binance suffered a dusting attack with small amounts of BNB (BNB) sent to multiple wallets. Once the victim sent the dust in combination with other funds, they received a transaction confirmation with a malware link with an offer that would trick the victim into clicking on it and becoming unknowingly hacked. Following a dusting attack, a cryptocurrency provider, like an exchange or a wallet, is usually encouraged to take strict measures to prevent future episodes. In late 2018, the Samourai Wallet developers warned some of their users that they were experiencing a dusting attack and asked them to mark UTXO as “Do Not Spend” to tackle the issue. A real-time dust-tracking alert and an easy-to-use feature to mark suspicious funds with a “Do Not Spend” note were soon implemented by the wallet’s developers team to help users better protect their transactions against future attacks."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2JpdGNvaW4tcmFsbGllcy1wYXN0LWtleS0zMDAwMC1tYXJrL2FydGljbGVzaG93Lzk5NDE5NzU5LmNtc9IBc2h0dHBzOi8vbS5lY29ub21pY3RpbWVzLmNvbS9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2JpdGNvaW4tcmFsbGllcy1wYXN0LWtleS0zMDAwMC1tYXJrL2FtcF9hcnRpY2xlc2hvdy85OTQxOTc1OS5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin rallies past key $30,000-mark - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nMumbai: Bitcoin 's price has surged past the psychologically significant $30,000 mark for the first time since June 2022, providing a sense of relief to Indian crypto investors who have faced significant losses due to market volatility and several high-profile failures such as that of the Terra ecosystem and the collapse of FTX over the past year.The leading digital currency has surged 6.29% in the past 24 hours to reach $30,160 as of 2300 IST on Coinmarketcap. While it has risen by 72.62% in the last 90 days, it remains down by 23.82% year to date.Bitcoin's price spent several weeks consolidating around the $28,000 mark before recently breaking through, continuing its bull run that began at the start of the New Year.\"It's a big positive for serious Indian crypto investors who are in it for the long haul,\" said Vishal Gupta, a Noida-based crypto investor and influencer.Bitcoin dominates the cryptocurrency market with a $581.9 billion market cap.Experts say that 2023 has been a good year for Bitcoin, and the latest surge to $30,000 is a clear indication of its growing mainstream adoption and investor confidence.\"As we witness this digital asset's ascent, it is important to remember the underlying technology powering it and the potential it holds to reshape our financial future. The potential of VDAs to revolutionise traditional systems is becoming more apparent with each passing day,\" said Sumit Gupta, CEO and founder of Coindcx.The BTC trading volume globally in the last 24 hours stood at $24.16 billion.Gaurav Dahake, founder, BNS, said: \"The rally underscores the growing recognition of bitcoin as a high-quality asset class, akin to gold and silver, particularly during discussions of recession and an uncertain global macroeconomic climate. Investors increasingly perceive Bitcoin as a viable alternative. We anticipate this rally to persist for a few more quarters and remain confident that Bitcoin will surpass the $50,000 milestone within the next six months.\"According to experts, the recent rise in Bitcoin's price is closely linked to expectations of an economic slowdown and subsequent monetary policy loosening by the US Federal Reserve. The anticipation of these economic factors has sparked renewed interest in cryptocurrencies as investors seek alternative assets that may offer greater potential returns.Shivam Thakral, CEO of BuyUcoin, India's second-longest running digital asset exchange, said as Bitcoin's price inched up, some investors might liquidate their positions to book profits, which may result in a healthy pullback.In terms of volume distribution by market pair (24 hours) at leading crypto exchange Wazir X, BTC/INR pair comprised 27.6% of total volume and BTC/USDT was 31.6% at Coindcx, as per Coingecko.According to analysts, the recent rise in Bitcoin is a clear indication of the growing interest in decentralised finance, particularly in the context of the current banking crisis.\"The latest Bitcoin rally is expected to uplift the sentiments of the crypto community across the globe, and the Ethereum Shanghai upgrade, which is scheduled to go live tomorrow, is adding to the euphoria around digital assets. As we approach the Bitcoin halving, which is due in May 2024, we can expect the BTC price to rise further,\" said Om Malviya, President, Tezos India, a blockchain adoption entity."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZmluYm9sZC5jb20vaG93LW11Y2gtYml0Y29pbi1kb2VzLWJpbGxpb25haXJlLXJheS1kYWxpby1vd24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "How much Bitcoin does billionaire Ray Dalio own? - Finbold - Finance in Bold",
        "content": "Billionaire Ray Dalio is one of the world’s richest people who have started out as critics of cryptocurrencies like Bitcoin (BTC), only to end up investing in them, which is why many wonder how much of that digital asset the retired founder of the Bridgewater Associates hedge fund truly has.\n\nIndeed, the author of the personal investment book ‘Principles: Life and Work’ used to be hesitant about Bitcoin, arguing it was “not very good as a store-hold of wealth because its volatility is great and has little correlation with the prices of what I need to buy,” back in November 2020.\n\nOn top of that, he did not see a future in which “central banks, big institutional investors, businesses, or multinational companies [are] using it,” but at the same time, he opened himself up to the possibility of being proven wrong, as Finbold reported at the time.\n\nChange in stance\n\nHowever, only a month later, in December 2020, Dalio appeared to have changed his stand on the flagship decentralized finance (DeFi) asset, stating in a Reddit Ask Me Anything (AMA) session that Bitcoin could serve as a “gold diversifier” and a store hold of wealth in the future.\n\nIn May 2021, he revealed that he owned “some Bitcoin” during CoinDesk’s 2021 Consensus conference. One year later, the billionaire investor reiterated his position that Bitcoin had made “tremendous achievements over the last decade,” emerging as an alternative to gold, which is why he included some of it in his investment portfolio, albeit only “a tiny percentage.”\n\n1% or 2% of portfolio\n\nAlthough it is not clear how much this ‘tiny percentage’ is, in January 2022, Dalio told William Green, the co-host of the We Study Billionaires podcast, that allocating 1% to 2% of one’s portfolio to Bitcoin was reasonable, which means he himself might have the same percentage of his wealth invested in Bitcoin, with his net worth currently standing at roughly $19 billion.\n\nAccording to hedge fund manager Anthony Scaramucci, Ray Dalio is an example of a “brilliant guy” who has “done the homework” on Bitcoin, observing how he used to be “a Bitcoin skeptic” and was “now a Bitcoin investor,” as Finbold reported in October 2021.\n\nMeanwhile, Bitcoin was at press time trading at the price of $30,067, recording an increase of 6.09% on the day, adding up to the 8.09% accumulated over the past week and the 46.51% gain on its monthly chart, as per the latest data retrieved by Finbold on April 11.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNuYmNhZnJpY2EuY29tLzIwMjMvYml0Y29pbi10b3BzLTMwMDAwLWZvci10aGUtZmlyc3QtdGltZS1zaW5jZS1qdW5lLWFoZWFkLW9mLWtleS1pbmZsYXRpb24tZGF0YS1ldGhlci1uZWFycy0yMDAwL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin tops $30000 for the first time since June ahead of key inflation data; ether nears $2000 - CNBCAfrica.com",
        "content": "The largest cryptocurrency by market cap rose 7% to $30,193.25 for the first time since June, according to Coin Metrics. Ether advanced more than 3.5% to $1,925.11 for the first time since August as investors awaited the Ethereum network’s latest tech upgrade, scheduled for Wednesday.\n\nNow that bitcoin has touched $30,000, a move into the mid- to high-30s will be “likely” if it pushes through with conviction and would “force short speculators to cover and buy instead,” said James Lavish, managing partner at the Bitcoin Opportunity Fund. “Some investors are trying to get positioned ahead of that,” he said."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2UtdG9kYXktYml0Y29pbi1yaXNlcy1hYm92ZS0zMDEwMC1zb2xhbmEtbGl0ZWNvaW4tem9vbS11cC10by0xMC9hcnRpY2xlc2hvdy85OTQwMTU5NC5jbXPSAZoBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLXByaWNlLXRvZGF5LWJpdGNvaW4tcmlzZXMtYWJvdmUtMzAxMDAtc29sYW5hLWxpdGVjb2luLXpvb20tdXAtdG8tMTAvYW1wX2FydGljbGVzaG93Lzk5NDAxNTk0LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin rises above $30,100; Solana, Litecoin zoom up to 10% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading higher on Tuesday with an increase of over 4% in the crypto market cap in the last 24 hours. Bitcoin (BTC) rose 6.47% to $30,106, whereas Ethereum (ETH) was above the $1,900 level. BTC volume stood at approximately $23.35 billion, rising 87.02% in the last 24 hours.\"Bitcoin has reached a level above US$30,000, which it last saw in June of last year. This rise can be attributed to investor optimism towards this week's U.S inflation data, which could potentially impact the Federal Reserve's monetary policy trajectory,\" Edul Patel, Co-founder and CEO at Mudrex, said.\"BTC has increased by 6% and is now facing fresh resistance at the US$30,500 level. In the event that BTC fails to overcome this resistance, the next support level would be at US$29,200,\" Edul added.Other top crypto tokens were also trading higher. Solana jumped nearly 10%. BNB , XRP, Litecoin and Cardano also traded with gains. The global cryptocurrency market cap was trading higher around $1.23 trillion, rising 4.17% in the last 24 hours.The total volume in DeFi is currently 4.44 billion, 9.41% of the total crypto market 24-hour volume. The volume of all stablecoins is now $42.25 billion, which is 89.37% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $581 billion. Bitcoin’s dominance is currently 46.99%, an increase of 0.81% over the day, according to CoinMarketCap.\"We have a volatile week coming up with Bitcoin (BTC) breaching the critical $30,000 level and US CPI inflation data coming in tomorrow. BTC is up 7% today and has entered a key resistance zone that stretches up to $32,000. This rally has legs to continue if CPI data comes in favourable,\" Vikram Subburaj, CEO of Giottus Crypto Platform, said.Shivam Thakral, CEO of BuyUcoin said, \"The combined effect of the Shanghai Ethereum upgrade , Bitcoin halving, and other macroeconomic factors are currently driving the momentum in the crypto market. As Bitcoin price rises, we may also see some investors liquidating their positions to book profit, which may result in a healthy pullback.\"Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 11.59 hours, IST on April 11, 2023)(Note: Price change in last 24 hours)(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL3RlY2gvYml0Y29pbi1wcmljZS1sYXRlc3QtMjAyMy1jcnlwdG8tZXRoZXJldW0tYjIzMTc2MzcuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price hits 2023 high after 85% surge - The Independent",
        "content": "Sign up to our free weekly IndyTech newsletter delivered straight to your inbox Sign up to our free IndyTech newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyTech email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong. Please try again later {{ /verifyErrors }}\n\nThe price of Bitcoin has risen above $30,000 for the first time since June 2022, marking a major comeback for the cryptocurrency.\n\nThe latest rise in value takes Bitcoin’s total gains in 2023 to more than $14,000, representing an 85 per cent price increase since the start of the year.\n\nOther leading cryptocurrencies have also seen positive price trends in recent months, with the overall crypto market up more than $400 billion as a result of similar gains from Ethereum, Cardano and XRP.\n\n“Momentum has steadily built for bitcoin as investors digest macroeconomic shifts in data,” said Simon Peters, a crypto market analyst at the online trading platform eToro.\n\n“The next one markets will be watching is US inflation. If inflation continues to recede, we could see some consolidation above $30,000. The price is still wavering around the milestone currently.”\n\n( )\n\nData from eToro shared with The Independent shows that the rejuvenated market has led to an increased appetite on the platform for bitcoin and other cryptocurrencies in April.\n\nThe number of bitcoin investments jumped 78 per cent week-on-week globally, and up 72 per cent in the UK.\n\nDespite the recent price surge, bitcoin and the broader market still remain a long way off their record price peaks.\n\nBitcoin is currently worth less than half the all-time high it experienced in November 2021, though some commentators believe the increasingly buoyant market is a sign that the so-called ‘crypto winter’ has come to an end.\n\n“Bitcoin’s strength compared to the traditional markets shows that investors are increasingly shifting their capital into Bitcoin, choosing it instead of traditional investments to build their wealth,” said Alex Adelman, CEO and co-founder of crypto rewards app Lolli.\n\n“The fact that today’s rally did not have a clear catalyst is a bellwether of bitcoin’s newly bullish market conditions and strong investor confidence.”"
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmVudHJlcHJlbmV1ci5jb20vZW4taW4vbmV3cy1hbmQtdHJlbmRzL3Jlc3VyZ2VuY2Utb2YtYml0Y29pbi10aGUtY3VycmVuY3ktaGl0cy1vdmVyLTMwMDAwLWZvci80NDk1MTLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Resurgence of Bitcoin: Cryptocurrency Hits Over $30,000 For the First Time Since 2022 - Entrepreneur",
        "content": "Opinions expressed by Entrepreneur contributors are their own.\n\nYou're reading Entrepreneur India, an international franchise of Entrepreneur Media.\n\nIt seems major cryptocurrency Bitcoin is making a comeback. On 11th April, 2023, the cryptocurrency crossed $30,000 for the first time since 2022. It is a gain of nearly a whopping 80% since the start of the year. Of which, 23% was registered in March alone. Since the start of this month, the currency has gained 6%.\n\nAccording to key people in the industry, the recent surge of Bitcoin is a notable testament to the resilience and robustness of the cryptocurrency market. \"In particular, it serves as a clarion call for the significance of decentralized finance in the current banking crisis. With traditional banking systems facing numerous challenges, including regulatory hurdles and slow transaction times, the adoption of decentralized finance has become increasingly appealing to investors and enthusiasts. As more people turn to decentralized finance, it is likely that Bitcoin's popularity and value will continue to grow, providing an important avenue for the transformation of the global financial landscape,\" said Kumar Gaurav, founder and CEO, Cashaa.\n\nThe latest Bitcoin rally is expected to uplift the sentiments of the crypto community across the globe and the Ethereum Shanghai upgrade which is scheduled to go live tomorrow, is adding to the euphoria around digital assets. \"Bitcoin-related stocks are also witnessing an upward trend owing to the BTC rally and the momentum is expected to continue if the macroeconomic factors remain favorable,\" says Om Malviya, president, Tezos India.\n\nSome experts are also of the view that with the breaching of $30,000 mark, Bitcoin currency has entered an early bull phase. \"The crypto market cap is at a whopping $1.23 trillion mark with BTC and ETH leading the effort. As Bitcoin price rises, we may also see some investors liquidating their positions to book profit, which may result in a healthy pullback,\" said Shivam Thakral, CEO, BuyUcoin.\n\nDubai-based web3 entrepreneur Bilal Rahazaoui shared his viewpoints on Bitcoin's bull run that Bitcoin rallying past $30K is a significant market movement that presents both opportunities and risks, and added that, \"On the one hand, the renewed investor interest in Bitcoin and the potential for a domino effect on the rest of the market could create profitable trading opportunities. On the other hand, the volatility of the cryptocurrency market and the potential for sudden price swings means that traders need to exercise caution and employ adequate risk management strategies. While the increasing adoption of Bitcoin by mainstream financial institutions and corporations is an encouraging sign, traders must also consider other economic factors and market trends that could impact the value of cryptocurrencies. Ultimately, success in trading cryptocurrencies requires a thorough understanding of the market and a disciplined approach to risk management.\"\n\nThe next Bitcoin halving event (estimated to occur around May 4, 2024), when Bitcoin reaches 840,000 blocks is also expected to drive the price further, \"This halving event marks the fourth protocol-designed 50% reduction in block rewards, which happens every 210,000 blocks or approximately every four years. The upcoming halving is poised to reduce the rate at which new Bitcoin is created, resulting in a lower available supply and increased scarcity. This could lead to higher demand and, surge in Bitcoin's price. The implications of such a significant event have many speculating and watching the markets with bated breath,\" says Rajagopal Menon, vice-president, WazirX.\n\nEven though the increase in the value is being seen as a comeback, Bitcoin is reportedly down more than 50% from its all-time high in November 2021 ($68,789). The devaluation of crypto platforms is said to be happened because of the various components like rising inflation, interest rates and economic uncertainty that drove investors to sell risk assets throughout the year and also the fall of well-known crypto projects including Terra LUNA and Celsius, the major factor was the bankruptcy of FTX exchange.\n\nMeanwhile, finance minister Nirmala Sitharaman announced that India's G20 presidency aims to develop a common framework for all countries to deal with risks associated with cryptocurrencies in the wake of the recent shocks witnessed in the crypto market and added that, \"We seek to develop a common framework for all countries to deal with this matter.\" It was also reported that the last year's episode of FTX's bankruptcy, and its spat with Binance triggered a huge sell-off in the market and reduced liquidity. But even with all these pull-backs, Bitcoin has gained the strength to step into this key point.\n\nBitcoin has grown by over 50% since December 2022 and recently crossed the $30,000 mark. \"We believe that the current market is neutral, which is healthy for the overall crypto industry, and that the blockchain ecosystem is gradually regaining momentum. With the risks of inflation and recession, as well as the decline of major banks like SVB and Credit Suisse, there is speculation as to whether Bitcoin could provide a solution to global economic challenges. Nonetheless, the positive sentiment reflected in the rising price of Bitcoin is helping to restore faith in the crypto market,\" said Shrikant Bhalerao, co founder, Seracle"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMilgFodHRwczovL3d3dy5nbG9iZW5ld3N3aXJlLmNvbS9lbi9uZXdzLXJlbGVhc2UvMjAyMy8wNC8xMS8yNjQ0NDU4LzAvZW4vQ2xlYW5TcGFyay10by1Eb3VibGUtaXRzLUJpdGNvaW4tTWluaW5nLUNhcGFjaXR5LXdpdGgtMTQ0LTlNLUV4cGFuc2lvbi1EZWFsLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "CleanSpark to Double its Bitcoin Mining Capacity with $144.9M Expansion Deal - GlobeNewswire",
        "content": "LAS VEGAS, April 11, 2023 (GLOBE NEWSWIRE) -- CleanSpark Inc. (Nasdaq: CLSK), America’s Bitcoin Miner™, today announced a purchase of 45,000 brand-new units of the Antminer S19 XP bitcoin mining machines for a total price of $144.9 million.\n\nAll units are expected to be ready for delivery by the manufacturer before September end, adding, once deployed, over 6.3 exahashes per second (EH/s) of computing power to the company’s current hashrate of 6.7 EH/s, a 95% increase.\n\n“The Antminer S19 XP is the most power-efficient bitcoin mining machine available in the market today, and a key component in our continuing work to build some of the most efficient bitcoin mining facilities in the country,” said Zach Bradford, CEO of CleanSpark. “As bitcoin’s halving draws closer, our focus on operational efficiency, our technical expertise, and our treasury management strategy, will all play a crucial role in solidifying CleanSpark’s position among the top bitcoin mining companies in America.”\n\nAccording to the purchase agreement, the manufacturer will prepare 25,000 of the 45,000 units for delivery in August, while the remaining 20,000 units are expected to be ready for delivery in September. The Company plans to deploy all of the acquired units at its bitcoin mining facility in Sandersville, Georgia, which is currently undergoing a planned 150 megawatts (MW) expansion. The machines will be deployed in multiple batches as they arrive on site and new rack-space becomes available, with all machines expected to be fully operational before year-end.\n\n“This bear market,” Bradford continued, “has continued to provide us with opportunities to maximize ROI including the opportunity to purchase the industry’s best miner at an industry leading price. We have chosen other units such as the S19 jPro+ over the S19 XP in the past because we believed the gap would close on the delta between the ROI of other units and the XP. Our patience has paid off. Securing these units under contract provides us with approximately 15.9 EH/s of machines on hand or under contract for delivery this year. This is an important step toward our target of 16 EH/s by year end. With approximately 99% of the required servers secured, we have addressed a key variable and can turn our full attention to the build-out of infrastructure at our campuses.”\n\nThis most recent miner purchase is in addition to a 20,000 machine purchase announced in February. Those machines are fully paid for and in the process of being delivered to the Company’s Washington facility. They are expected to be energized later this quarter, adding an additional 2.44 EH/s of machines to CleanSpark’s operational hashrate.\n\n“In addition to securing the majority of ASICs needed to reach our guidance, this deal demonstrates, yet again, our ability to make timely purchases based on ROI metrics,” said Gary Vecchiarelli, CleanSpark’s CFO. “That ability is premised on a capital strategy which maintains flexibility as its core tenant and allows us to capitalize on accretive opportunities, such as this transaction, in the marketplace. Securing XPs at these prices means we have one less variable in our capital expenditure equation and puts us well on our way to achieving our year end guidance of 16 EH/s.”\n\nCleanSpark mines bitcoin predominantly with low-carbon energy sources, which account for over 90% of its energy mix, and continues to follow a balanced capital management strategy by selling a portion of its mined bitcoins to reinvest in growth. This strategy, coupled with the Company’s proprietary mining model, has allowed CleanSpark to achieve one of the highest hashrate realization rates among its peers since January 2022.\n\nAbout CleanSpark\n\nCleanSpark (Nasdaq: CLSK) is America’s Bitcoin Miner™. Since 2014, we’ve helped people achieve energy independence for their homes and businesses. In 2020, we transitioned that expertise to develop sustainable infrastructure for Bitcoin, an essential tool for financial independence and inclusion. We strive to leave the planet better than we found it by sourcing and investing in low-carbon energy, like wind, solar, nuclear, and hydro. We cultivate trust and transparency among our employees, the communities we operate in, and the people around the world who depend on Bitcoin. CleanSpark is a Forbes 2022 America’s Best Small Company and holds the 44th spot on the Financial Times’ List of the 500 Fastest Growing Companies in the Americas. For more information about CleanSpark, please visit our website at www.cleanspark.com.\n\nForward-Looking Statements\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding expectations for expansions of the Company’s Sandersville, Georgia and Washington, Georgia bitcoin mining facilities, the resulting anticipated benefits to CleanSpark (including as to anticipated additions to CleanSpark’s hashrate and the timing thereof), and the timing of miner deliveries. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). All statements other than statements of historical facts contained in this press release may be forward-looking statements. In some cases, you can identify forward-looking statements by terms such as “may,” “will,” “should,” “expects,” “plans,” “anticipates,” “could,” “intends,” “targets,” “projects,” “contemplates,” “believes,” “estimates,” “forecasts,” “predicts,” “potential” or “continue” or the negative of these terms or other similar expressions. Forward-looking statements contained in this press release, but are not limited to statements regarding our future results of operations and financial position, industry and business trends, business strategy, expansion plans, market growth and our objectives for future operations.\n\nThe forward-looking statements in this press release are only predictions. We have based these forward-looking statements largely on our current expectations and projections about future events and financial trends that we believe may affect our business, financial condition and results of operations. Forward-looking statements involve known and unknown risks, uncertainties and other important factors that may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements, including, but not limited to: the anticipated timing of the expansions; the risk that the electrical power available to our facilities does not increase as expected; the success of its digital currency mining activities; the volatile and unpredictable cycles in the emerging and evolving industries in which we operate; increasing difficulty rates for bitcoin mining; bitcoin halving; new or additional governmental regulation; the anticipated delivery dates of new miners; the ability to successfully deploy new miners; the dependency on utility rate structures and government incentive programs; dependency on third-party power providers for expansion efforts; the expectations of future revenue growth may not be realized; and other risks described in the Company's prior press releases and in its filings with the Securities and Exchange Commission (SEC), including under the heading \"Risk Factors\" in the Company's Annual Report on Form 10-K and any subsequent filings with the SEC. The forward-looking statements in this press release are based upon information available to us as of the date of this press release, and while we believe such information forms a reasonable basis for such statements, such information may be limited or incomplete, and our statements should not be read to indicate that we have conducted an exhaustive inquiry into, or review of, all potentially available relevant information. These statements are inherently uncertain and investors are cautioned not to unduly rely upon these statements.\n\nYou should read this press release with the understanding that our actual future results, performance and achievements may be materially different from what we expect. We qualify all of our forward-looking statements by these cautionary statements. These forward-looking statements speak only as of the date of this press release. Except as required by applicable law, we do not plan to publicly update or revise any forward-looking statements contained in this press release, whether as a result of any new information, future events or otherwise.\n\nInvestor Relations Contact\n\nMatt Schultz, Executive Chairman\n\nir@cleanspark.com\n\nMedia Contacts\n\nIsaac Holyoak\n\npr@cleanspark.com\n\nBlocksBridge Consulting\n\ncleanspark@blocksbridge.com"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vbmV3cy5za3kuY29tL3N0b3J5L2JpdGNvaW4tdG9wcy0zMC0wMDAtZm9yLWZpcnN0LXRpbWUtaW4tMTAtbW9udGhzLTEyODU0ODY00gFXaHR0cHM6Ly9uZXdzLnNreS5jb20vc3RvcnkvYW1wL2JpdGNvaW4tdG9wcy0zMC0wMDAtZm9yLWZpcnN0LXRpbWUtaW4tMTAtbW9udGhzLTEyODU0ODY0?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin tops $30,000 for first time in 10 months - Sky News",
        "content": "Cryptocurrency Bitcoin has reached a 10-month high following the worst banking turmoil since the 2008 global financial crash and is now worth more than $30,000.\n\nOne Bitcoin was worth $30,438 in Asian trading on Tuesday, a high not seen since June last year - but still less than half the all-time high value of more than $67,000 in November 2021.\n\nThe value of the major cryptocurrency has recovered from the hits it took late last year as one of the world's largest cryptocurrency exchanges, FTX, went bankrupt and its founder Sam Bankman-Fried was charged with fraud.\n\nThe leading cryptocurrency had been steadily increasing in value since March and tipped the $30,000 threshold amid expectations the US central bank, known as the Fed, will halt its interest rates increases, thereby maintaining borrowing costs as opposed to making lending more expensive.\n\nPlease use Chrome browser for a more accessible video player 1:14 What is the main aim of cryptocurrency?\n\nThe Fed had been increasing interest rates in an effort to bring stubbornly high inflation down.\n\nHowever, market expectations now are that the Fed is unlikely to raise interest rates much higher for longer as it seeks to minimise stress on the banking sector.\n\nMore than a quarter of economic forecasters (28.6%) expect there will be no increase in the US interest rate next month, while the remaining 71.4% predict a 0.25 percentage points rise.\n\nHigh interest rates posed problems for banks and was one of the factors behind the collapse of Silicon Valley Bank and the associated worst banking turmoil since the 2008 global financial crash. US lenders Signature Bank and Silvergate Bank collapsed, and Switzerland's second largest lender Credit Suisse were forcibly taken over by Swiss rival UBS.\n\nHowever, high interest rates also help banks' profitability. NatWest, for example, had profits boosted to the highest level since before the global financial crash as money earned on loans, minus the amount it pays in interest, increased.\n\nAdvertisement\n\nRead more business news:\n\nUK to see return of ultra-low interest rates, IMF says\n\nCBI boss sacked over 'conduct at work'\n\nBe the first to get Breaking News Install the Sky News app for free\n\nBitcoin value had been rising since the FTX collapse but particularly gained strength over March following the collapse of three US banks.\n\nThe turmoil gave new credence to the belief among Bitcoin fans that cryptocurrency is a more attractive alternative to traditional finance."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMieGh0dHBzOi8vdGV0aGVyLnRvL2VuL3RldGhlci10aGUtY2l0eS1vZi1sdWdhbm8tcGFydG5lci13aXRoLXN3aXNzLXVuaXZlcnNpdGllcy10by1icmluZy1iaXRjb2luLWVkdWNhdGlvbi10by10aGUtbWFzc2VzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "The City of Lugano Partner With Swiss Universities to Bring Bitcoin Education to the Masses - Tether USD",
        "content": "Driving education and engagement, the Plan ₿ initiative makes blockchain education a priority with ongoing development program\n\nTether Operations Limited (Tether), the technology company supporting the blockchain-enabled platform that powers the largest stablecoin by market capitalization (USD₮) and the Swiss City of Lugano announced today dates for the second inaugural Plan ₿ Summer School program.\n\nThe Plan ₿ Summer School was founded to make blockchain education accessible and to shape a new generation of business owners, students, researchers, and more. It is co-organized with Franklin University Switzerland (FUS), Università della Svizzera Italiana (USI), and University of Applied Sciences and Arts of Southern Switzerland (SUPSI). Last year, Tether contributed its expertise and knowledge to this initiative by focusing on educating a new generation of students. The previous program gathered 86 students from 29 different countries including Italy, Switzerland, Taiwan, Canada, Brazil, Colombia all who brought with them a passion for learning about the future of the blockchain ecosystem and exploring new environments.\n\n“A strong focus on education is a vital next step to mainstream adoption of blockchain and the long term implication of blockchain technology,” said Paolo Ardoino, Tether’s CTO. “The Plan ₿ Summer School will allow participants to work with leading industry minds on developing peer to peer prototypes and deepening their understanding of the technology helping shape the next generation of founders, developers and creators.”\n\nThe focus of this year's two-week Summer School program will be Bitcoin and Peer-to-Peer technologies and how they will unleash financial freedom and promote the freedom of speech. Course topics will focus on Bitcoin, the Lightning Network, stablecoins, peer-to-peer technologies, mining, blockchain analysis, regulation, self-custody and more. Students will be given the opportunity to choose one of two course tracks. The Satoshi track, which is designed for beginners with little to no experience in coding, but with a general interest in the fundamentals of blockchain, and the Pear track for intermediate to advanced students who are passionate about coding and interested in learning how to build on Peer-to-Peer technologies.\n\n“We are thrilled to welcome the Plan ₿ Summer School once again and we hope the same turnout and attendance as the past year. Lugano will keep making its mark as a crypto and educational hub.” said Michele Foletti, Mayor of the City of Lugano. “We hope to educate a new generation of potential employers alongside local academic universities in order to make Lugano a hub for the future.”\n\nProminent industry leaders giving their time to guest lecture at the Plan ₿ Summer School include Paolo Ardoino, CTO of Tether, Adam Back CEO of Blockstream, Giacomo Zucco CEO of Zuckbucks, Sanja Kon CEO of UTrust, Riccardo Masutti Cybersecurity and Privacy Consultant focused in Bitcoin, and more.\n\nLuca Maria Gambardella, Pro-Rector for Innovation and Corporate Relations at the Università della Svizzera Italiana (USI) stated that he wishes to \"promote the Summer School with enthusiasm and commitment, which reinforces the collaboration on education initiated between the partners with the 'B4B - Blockchain for Business' course, and which attracts experts, students and professionals from all over the world to Lugano, strengthening the Lugano Città Universitaria project as a place of study, meeting and comparison\".\n\nEmanuele Carpanzano, SUPSI's Director of Research, Development and Knowledge Transfer agreed, speaking on behalf of the University of Applied Sciences and Arts of Southern Switzerland,saying: \"We are delighted to contribute to the realisation of this Summer School in Lugano, an educational proposal in line with the mission we share with our partners: to transmit knowledge and skills, as well as to network students and professionals with each other\".\n\nKim Hildebrant and Dr. Branko Sain, respectively President and Dean of Franklin University's Taylor Institute also declared, \"Lugano's Plan ₿ is an ambitious project for an ambitious city. We immediately found a common understanding with the Mayor of Lugano and his team around the opportunity to run the first edition of the Summer School last year and the privilege of hosting it again next summer. At Franklin University Switzerland we believe that any kind of progress, be it social, environmental, economic or technological, requires positive change. And change is fostered by education and by selfless and courageous leadership like that of our City and the three local universities\".\n\nTo learn more about Plan ₿'s Summer School, visit https://planb.lugano.ch/summer-school/"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMikAFodHRwczovL3d3dy5idXNpbmVzcy1zdGFuZGFyZC5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9iaXRjb2luLWNsaW1icy10by0xMC1tb250aC1oaWdoLW9mLTMwLTAwMC1hcy1yYXRlLWhpa2Utd29ycmllcy1lYXNlLTEyMzA0MTEwMDIxM18xLmh0bWzSAZQBaHR0cHM6Ly93d3cuYnVzaW5lc3Mtc3RhbmRhcmQuY29tL2FtcC9tYXJrZXRzL2NyeXB0b2N1cnJlbmN5L2JpdGNvaW4tY2xpbWJzLXRvLTEwLW1vbnRoLWhpZ2gtb2YtMzAtMDAwLWFzLXJhdGUtaGlrZS13b3JyaWVzLWVhc2UtMTIzMDQxMTAwMjEzXzEuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin climbs to 10-month high of $30,000 as rate hike worries ease - Business Standard",
        "content": "Bitcoin, the largest cryptocurrency by market cap, hit $30,000 on Tuesday for the first time since June 2022. In 2023 alone, Bitcoin has gained 80 per cent, data from coinmarketcap showed.\n\nFor the past three weeks, the crypto token was stuck in the range of $26,500 and $29,400.\n\n\"As expected, Bitcoin has entered an early bull phase by breaching the $30,000 mark for the first time since June 2022. The crypto market cap is at a whopping $1.23 trillion mark with BTC and ETH leading the effort. The combined effect of the Shanghai Ethereum upgrade, Bitcoin halving, and other macroeconomic factors are currently driving the momentum in the crypto market,\" said Shivam Thakral, CEO of crypto exchange BuyUcoin.\n\n\"The surge may be attributed to investors' positive outlook on the upcoming US inflation data, anticipating it might have an impact on the Federal Reserve's monetary policy,\" said Edul Patel CEO and co-founder of crypto platform Mudrex.\n\nEthereum, the second biggest crypto token, was trading at $1,921 on Tuesday.\n\nThe crypto industry is undergoing intense scrutiny in the US. Coinbase received a notice from the Securities and Exchange Commission (SEC) declaring its intention to bring an enforcement action. Earlier, the US Commodity Futures Trading Commission sued Binance founder Changpeng Zhao for alleged violations of derivatives regulations.\n\nHowever, the market has been seeing a rally since the collapse of three US banks as it revived the narrative that digital tokens offer a more attractive alternative to fiat currency and traditional finance.\n\nMoreover, the central banks are also seen reaching the peak of their rate hike cycle. The collapse of banks has also increased the chances of a pause in a rate hike by the Fed. The Reserve Bank of India (RBI), last week, kept the benchmark interest rate, repo rate, unchanged at 6.5 per cent.\n\nInvestors are also eagerly anticipating a major revamp to the Ethereum blockchain this week, which will allow them to gain access to more than $33 billion of ether currency.\n\nThe software update, Shapella, will let market players redeem their \"staked ether\" - coins they have deposited and locked up on the network over the past three years in return for interest.\n\nHowever, as Bitcoin surges to a 10-month high, Thakral said that it might be followed by a pullback.\n\n\"Bitcoin's new resistance level is now at $30,500, while its support level has been established at $29,200,\" said Patel.\n\n\"As we approach Bitcoin halving which is due in May 2024, we can expect the BTC price to rise further,\" said Om Malviya, president of blockchain adoption firm Tezos India."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL3dvcnRoL2ludmVzdG1lbnQvYml0Y29pbi1wcmljZS04MC1wZXJjZW50LXllYXItdGlsbC1kYXRlLWp1bXAtcHJpY2UtY3Jvc3Nlcy0zMDAwMC1tYXJrLTU5ODg5OC5odG1s0gGBAWh0dHBzOi8vd3d3LmluZGlhdGltZXMuY29tL2FtcC93b3J0aC9pbnZlc3RtZW50L2JpdGNvaW4tcHJpY2UtODAtcGVyY2VudC15ZWFyLXRpbGwtZGF0ZS1qdW1wLXByaWNlLWNyb3NzZXMtMzAwMDAtbWFyay01OTg4OTguaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "80% Jump This Year! Bitcoin's Price Crosses $30,000 Mark For The First Time In 10 Months - Indiatimes.com",
        "content": "World's largest cryptocurrency Bitcoin continued its good run and made investors happier yesterday as it climbed 7% on Monday evening to cross the key psychological level of $30,000 for the first time in 10 months.\n\n\n\nBitcoin Crosses $30,000 Mark\n\nUnsplash\n\nThe largest cryptocurrency by market cap rose 7% to $30,193.25 for the first time since June, according to Coin Metrics. Ether, the second largest cryptocurrency, too advanced more than 3.5% to $1,925.11 for the first time since August as investors awaited the Ethereum network's latest tech upgrade, scheduled for Wednesday, as per CNBC.\n\n\n\nCryptocurrencies have been rallying this year after the bloodbath year that 2022 was. Monday night's rise in Bitcoin price brings its year-to-date gains to more than 80%, while Ether has now added 60% this year to date. Elon Musk's favourite Dogecoin, too, is up nearly 20% this year to date.\n\n\n\nThe recent jump in Bitcoin comes as investors raised bets that the U.S. central bank, the Federal Reserve will soon end its aggressive monetary tightening campaign. As per Reuters, Bitcoin peaked at $30,438 in Asian trade and was last 2% higher at $30,262 today morning. It has gained about 6% since the start of the month, after rising 23% in March.\n\nHowever, although this 80% jump this year is a good sign, bitcoin will need about 300% jump to recover from the fall it has seen since its all-time high when it hit the $68,000 mark in November 2021.\n\nBitcoin's urge follows Friday's closely-watched U.S. nonfarm payrolls report that showed employers maintained a strong pace of hiring in March, pointing to a still-resilient economy.\n\nAs far as Ether's surge is concerned, as per the report, crypto investors are eagerly anticipating a major revamp to the Ethereum blockchain this week that is set to allow them to gain access to more than $33 billion of Ether currency.\n\nAlso Read: Meet This US-Based CEO Who Believes Bitcoin Price Will Hit Nearly $1.5 Million By 2030\n\nGood Days After A Bloodbath Year\n\nshutterstock\n\nAfter hitting its all-time high market cap of $3 trillion in November 2021, 2022 was a bloodbath year for cryptocurrency, with the crypto market losing a mammoth $2 trillion market cap.\n\n\n\nFrom the Terra Luna collapse to the FTX fiasco, the crypto market had a tumultuous year, with trillions of dollars lost in 2022.\n\nClick here to know more about how the major cryptocurrencies performed in 2022.\n\nAlso Read: US Man Pays 10,000 Bitcoins For Pizza\n\nFor more such interesting content and the latest financial news, keep reading Worth. Click here."
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS90ZWNoLzIwMjMvMDQvMTEvd2hhdHMtbmV4dC1hZnRlci1ldGhlcmV1bXMtc2hhbmdoYWktdXBncmFkZS_SAVlodHRwczovL3d3dy5jb2luZGVzay5jb20vdGVjaC8yMDIzLzA0LzExL3doYXRzLW5leHQtYWZ0ZXItZXRoZXJldW1zLXNoYW5naGFpLXVwZ3JhZGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 07:00:00 GMT",
        "title": "What’s Next After Ethereum’s Shanghai Upgrade? - CoinDesk",
        "content": "The “Purge” will purge the spare, or historical data, from the Ethereum network. By getting rid of this historical data, congestion on the network will decrease, allowing for more transactions to be processed. Buterin has said that after this phase Ethereum should be able to process around 100,000 transactions per second (TPS), up from about 29 TPS now."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L3dlYi1zdG9yaWVzL3ByaWNlLW9mLWJpdGNvaW4tZXhjZWVkcy0zMDAwMC_SAUxodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC93ZWItc3Rvcmllcy9wcmljZS1vZi1iaXRjb2luLWV4Y2VlZHMtMzAwMDAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Tue, 11 Apr 2023 12:18:09 GMT",
        "title": "Price of bitcoin exceeds $30,000. - Analytics Insight",
        "content": "At $1.29 trillion, the market capitalization of cryptocurrencies has risen to its highest level of the year."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vYml0Y29pbmlzdC5jb20vYml0Y29pbi1jcml0aWMtd2FycmVuLWJ1ZmZldHQtc2xhbXMtYnRjL9IBQ2h0dHBzOi8vYml0Y29pbmlzdC5jb20vYml0Y29pbi1jcml0aWMtd2FycmVuLWJ1ZmZldHQtc2xhbXMtYnRjL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 12 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Critic Warren Buffett Slams Crypto Again, Calls It A 'Gambling Token' - Bitcoinist",
        "content": "Warren Buffett has issued a warning that there has been a boom of gambling in the financial markets. He has also thrown a jab at bitcoin, stating that the cryptocurrency has no inherent value.\n\nEven though Bitcoin’s (BTC) price has increased by more than 80% since the beginning of the year, the most popular cryptocurrency asset still has its critics.\n\nImage: FREENVESTING/YouTube\n\nIs Bitcoin A ‘Gambling’ Coin?\n\nIn an interview Wednesday with CNBC, one of the most successful investors in the world known as the “Oracle of Omaha” took the opportunity to take another shot at Bitcoin, this time calling it a “gambling token.”\n\n“#Bitcoin is a gambling token and it doesn’t have any intrinsic value. But that doesn’t stop people from wanting to play the roulette wheel,” says Warren Buffett on #crypto. pic.twitter.com/6MQAiyrS5J — Squawk Box (@SquawkCNBC) April 12, 2023\n\nBuffett made the following observation in reference to gambling in general:\n\n“The urge to participate in something that looks like easy money is a human instinct which was always there.”\n\nThe big boss at Berkshire Hathaway has previously referred to the popular crypto as “rat poison squared” and declared that it is a “mirage” that attracts charlatans. Additionally, he has cautioned investors to steer clear of the cryptocurrency, describing it as a “delusion.”\n\nThe critique of Bitcoin that comes from the business magnate’s notion that investments should have some sort of inherent value is where the criticism originates.\n\nThe anti-crypto billionaire views these types of digital assets as speculative that are vulnerable to dramatic price swings and do not have any fundamental value.\n\nBuffett, Not A Fan Of Bitcoin\n\nRecent weeks have seen significant gains across the board for crypto markets. According to Messari, Bitcoin and Ethereum have had respective gains of 61% and 35%, although they are still approximately 56% and 36% behind their all-time highs, which were reached in November of 2021.\n\nOn Tuesday, the price of BTC went beyond $30,000 for the first time. The previous time that occurred was back in June. Two days later, it was still approximately $29,900 at that point.\n\nIt is common knowledge that Buffett is not a fan of bitcoin; in fact, he previously stated that even if someone offered him $25 for all the bitcoin (BTC) in the world, he would not buy it.\n\nHis senior deputy and Berkshire Hathaway Vice Chairman Charlie Munger has been even more vocal over the years about his distaste for the alpha coin. Earlier this year, he called for the US government to outlaw cryptocurrency in a manner similar to that of China.\n\nAccording to Buffett, the human propensity to gamble is one of the factors that drives investment in cryptocurrencies. He stated that committing funds to the asset class will “eat up” one’s financial resources.\n\nBitcoin (BTC) total market cap currently at $582 billion on the daily chart at TradingView.com\n\nBitcoin Up Nearly 8% In The Last Week\n\nA number of influential people have expressed their reservations regarding bitcoin. Jamie Dimon, the CEO of JPMorgan Chase, gave an interview to CNBC in January during which he referred to bitcoin as a “hyped-up fraud” and compared it to a “pet rock.”\n\nBerkshire Hathaway is now ranked as having the world’s eighth-largest market capitalization in terms of its assets, as reported by the most recent information from companiesmarketcap.com.\n\nAccording to the same source, the market value of Bitcoin is currently the 10th largest in the world.\n\nAt the time of writing, BTC is trading at $30,104, up 7.7% in the last seven days, data from crypto market tracker CoinMarketCap shows.\n\n-Featured image from PAUL MORIGI/GETTY IMAGES/FORTUNE/TIME INC."
    }
]