[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3Lmdlb3BvbGl0aWNhbG1vbml0b3IuY29tL2JpdGNvaW4tYW5kLWdlb3BvbGl0aWNhbC1yaXZhbHJ5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin and Geopolitical Rivalry - Geopoliticalmonitor.com",
        "content": "Bitcoin, the flagship stateless cryptocurrency, is a double-edged sword that can either strengthen or harm national power. As financial warfare becomes increasingly complex, this decentralized cybercurrency is acting as a versatile strategic instrument of statecraft that can play various roles under confrontational geopolitical circumstances. This under-researched subject matter needs to be clarified because it entails meaningful implications for national security, strategic intelligence, foreign policy and grand strategy, but also for the domain of high finance. In order to provide a sharper sense of situational awareness, the following article integrates strategic forecasts that attempt to predict the hypothetical usefulness of Bitcoin for conflicts with scrutiny of illustrative contemporary examples that point in a similar direction.\n\nAnalysis of Hypothetical Applications\n\nBTC circuits as conduits to bypass sanctions\n\nBitcoin can offer a potential lifeline for states under sanctions that need to ensure the continuity of their international economic exchanges. Since the BTC grid cannot be controlled by the coercive or restrictive power of national states, its borderless circuitry provides secondary financial arteries worth harnessing to bypass sanctions that limit the ability to carry out cross-border transactions and transfer wealth through more conventional platforms ‒ anchored to major reserve currencies ‒ that enable international payments. An additional advantage of decentralized virtual currencies for sanctioned states is their discretion. They offer covert gateways to engage formal financial systems or even to avoid them altogether if necessary. In other words, it is difficult to determine if sanctions are being neutralized through cryptocurrencies like BTC.\n\nFurthermore, despite their drawbacks ‒ including wildly volatile exchange rates ‒ nonstate cryptocurrencies like BTC are helpful to evade sanctions thanks to their growing transnational projection, their unsupervised channels, and their lack of centralized nerve centers that could be politically threatened, co-opted, or influenced. An academic essay written by US military officer Deane Konowicz for the US Naval War College identifies three strategies to use unofficial virtual currencies as asymmetric equalizers to diminish or overcome sanctions imposed by an enemy with superior financial firepower. Yet, the implementation of each comes with challenging caveats.\n\nThe theft of wealth through acts of cybercrime against cryptocurrency exchanges or ransomware attacks to demand payments denominated in cryptocurrency. This approach requires sophisticated cyberwarfare know-how.\n\nCryptocurrency mining on a large scale as an industrial activity which generates profits that do not flow through traditional financial networks. This pursuit demands investment, technological infrastructure, advanced hardware, vast amounts of energy, and technical expertise.\n\nThe encouragement of the sanctioned state’s population and business community to freely carry out all sorts of transactions through cryptocurrencies. Said possibility comes with the risks of weakening the position of the country’s official currency and the prospect of widespread economic instability, a phenomenon that could lead in turn to political turmoil.\n\nSome statesmen have also identified the potential usefulness of cryptocurrencies like Bitcoin to diminish the impact of sanctions through arteries that bypass the US dollar. For example, according to a report published by the Russian newspaper Kommersant, Sergei Glazyev ‒ one of the Kremlin’s chief geoeconomic masterminds ‒ argues that the Russian Federation has an “objective need” to rely on unofficial cryptocurrencies to circumvent Western sanctions. Nevertheless, BTC is no “silver bullet” that can completely defuse enemy sanctions. Its limitations are also being acknowledged. In a 2021 interview with CNBC, Russian President Vladimir Putin admitted that Bitcoin is a valid means of payment, but he also mentioned that, even though Russia has been seeking alternatives to the dollar in international economic exchanges as a result of its weaponization by Washington, it was still too soon to anchor the exports of Russian energy and commodities to such cryptocurrency.\n\nYet, as a result of the Western backlash against the Russian invasion of Ukraine, Moscow is seemingly reassessing its position and deliberating about the eventual pertinence of embracing BTC in several sectors to carry out international transactions that deflect American and European sanctions. In this context, Moscow is reportedly considering the possibility of accepting Bitcoin as payment for its energy exports. Since crypto-assets cannot be frozen or seized, they represent potentially attractive financial vehicles for states that seek to contest the interests of Western powers. According to the New York Times, in order to gather stockpiles of unofficial cryptocurrencies to carry out undetected international transactions, the Russians could even engage in ransomware cyberattacks and develop technical tools designed to mask the involvement of Russian entities in said transactions throughout blockchain-based financial environments.\n\nThese possibilities indicate that Bitcoin and similar cryptocurrencies can hypothetically operate as protective shields for states under sanctions. As such, they pose game-changing challenges for the effective implementation of sanctions as a tool of diplomatic coercion by the US and its allies, especially considering that such measures have become an increasingly common staple of Western foreign policy. Nevertheless, some analysts believe that measures like better regulations, collaborative information-sharing partnerships between governmental agencies and private entities, international cooperation, and increased oversight can prevent the evasion of sanctions through Bitcoin and similar cryptocurrencies.\n\nBTC as a potential asset to hedge the financial risk of geopolitical tensions\n\nBitcoin has been identified as an unconventional asset that could be helpful to hedge financial risks in case of conflicts or heightened geopolitical tensions. Some scholars hold that BTC can operate as some sort of “digital gold” because it represents a potential safe haven that provides shelter from exposure to rising systemic geopolitical tensions. In fact, the value of Bitcoin seems to be positively influenced by the incidence of phenomena which trigger a perception of geopolitical turmoil, such as Brexit, the rivalry between Iran and the US in the Middle East, and the so-called “trade war” between Washington and Beijing. These attributes make BTC attractive for national states, private companies and individuals.\n\nAn important advantage of Bitcoin as an alternative asset is its high resilience from both volatile market fluctuations and potentially hostile manipulations not motivated by economic interests. Plus, the horizontal Bitcoin system cannot be destroyed. As the American financier James Rickards explains, even though some of its material or digital nodes can be attacked, the dispersed structure of BTC organic networks contains no center of gravity. BTC also lacks centralized systemic records kept in physical servers which could be hit. The ability of the Bitcoin environment to withstand the impact of disruptions from external sources was demonstrated when China followed a heavy-handed approach towards said cybercurrency. Even though the ‘Middle Kingdom’ managed to evict Bitcoin from Chinese soil, the whole BTC ecosystem was not undermined, and China-based mining operations simply relocated to other countries with more flexible frameworks.\n\nHowever, a nuanced perspective shows that, despite its advantages, Bitcoin is far from being a suitable replacement for hard assets with intrinsic worth like precious metals. As Refk Selmi and other researchers point out, there are major differences that need to be highlighted: 1) Bitcoin’s markets are smaller and less structured; 2) its supply is artificially limited by design; 3) the volatility of this cryptocurrency makes it convenient for short-term speculative purposes rather than as a long-term store of value; 4) whereas BTC is a nascent monetary item, the traditional role of gold as stable store of value is supported by the weight of history since the dawn of civilization; 5) Bitcoin’s legal status is unclear in many jurisdictions.\n\nPotential weaponization of BTC\n\nBitcoin can also hypothetically act as a weaponized instrument that can be wielded in the practice of statecraft. Ironically, its anti-state properties mean that it can be employed by states against their rivals in offensive acts of hybrid warfare. As an article in the Small Wars Journal argues, The BTC landscape offers 1) asymmetric advantages to instigate monetary disruption in small nations with weak currencies, 2) covert channels to fund terrorist, insurgent, separatist, guerrilla or dissident groups whose militant activities fuel destabilization behind enemy lines and 3) subtle gateways to increase the resonance of psychological warfare, “soft power,” and propagandistic influence through the undisclosed purchase of an active presence in the overlapping platforms that undergird the transnational info-sphere. Potentially, BTC can even be engaged to hit heavier targets. Interestingly, Silicon Valley entrepreneur Peter Thiel, himself a strong supporter of BTC, has expressed his concerns about the potential weaponization of Bitcoin by Beijing against the US: “I do wonder whether at this point [if] Bitcoin should also be thought [of] in part of as a Chinese financial weapon against the US where it threatens fiat money, but it especially threatens the US dollar.” Paradoxically, the fact that China despises Bitcoin at home does not mean that it cannot be useful abroad as a spearhead against major strategic competitors.\n\nAnalysis of Empirical Realities\n\nInvolvement of BTC in predatory acts of cyber-financial warfare committed by North Korea\n\nBTC offers opportunities to engage in unconventional forms of economic predation. According to a report prepared by a panel of experts for the UN Security Council (2019), the North Korean military intelligence agency, the Reconnaissance General Bureau, has been responsible for acts of cyber financial warfare and cybercrime ‒including malware and ransomware attacks against foreign corporate targets in South Korea and elsewhere ‒ involving Bitcoin and other decentralized cryptocurrencies. Said source claims that Pyongyang’s presence in the cryptocurrency ecosystem also includes mining. It is estimated that the profits made by North Korea through these measures were worth $2 billion over a couple of years. The official report indicates that the resulting stolen wealth can then be used to undertake unsupervised international transactions, evade sanctions, and fund North Korean military expenditures, including its nuclear weapons programme. The American blockchain research firm Chainanalysis calculates that, in 2022 alone, North Korean entities stole $1.7 billion worth of cryptocurrencies through hacking. This aggressive behavior shows the problematic overtones of state-sponsored criminal activities related to crypto assets.\n\nBitcoin is more than a weapon for North Korean statecraft. It also helps Pyongyang compensate its lack of access to mainstream international financial channels and provides money to purchase food. According to a work of investigative journalism, North Korean policymakers regard cryptocurrency as a vital gateway to enhance the country’s financial infrastructure and, despite Bitcoin’s libertarian theoretical underpinnings, its adoption by this communist state is compatible with the strong emphasis of Juche ideology on the pursuit of self-sufficiency. Yet, tricky measures are needed to maximize its usefulness. As a report published by the National Committee on North Korea explains, the volatility of Bitcoin and similar cryptocurrencies makes them unsuitable as permanent vehicles for international payments. Some North Korean partners might accept Bitcoin, but it would make more sense to exchange cryptocurrency for conventional hard cash ‒ whose liquidity is much higher ‒ first and then use it to pay for goods and services later.\n\nBTC donations to bankroll the military defense of Ukraine\n\nBitcoin can be used to bolster the military defense of a state in conventional conflicts. In the Ukraine War, it has been used by Kiev to prepare for the clash and to mitigate its consequences. Thanks to crowdfunding campaigns organized by both the Ukrainian government and private networks of volunteers through virtual platforms, Ukraine received donations denominated in cryptocurrency from foreign supporters. This digital war chest was helpful to increase Kiev’s pool of resources before and during the 2022 Russian invasion. According to open sources, said funds were invested in the purchase of military equipment, unmanned aerial vehicles, medical supplies, and even facial recognition software to identify Russian soldiers, spies, and mercenaries.\n\nAlthough Kiev has received far larger sums of money through more traditional financial systems, the BTC grid turned out to be convenient channel for the direct reception of donations from overseas because it does not require the permission of institutional facilitators or intermediaries. Hence, this flow of money completely bypasses the formal paperwork and ‒ perhaps more importantly ‒ the restrictions of conventional financial channels that prevent remittances whose purpose is to fund military activities. Ironically, the specialized consulting firm Elliptic Intel notes that this course of action was inspired by the preceding crypto-asset fundraising undertaken for years by pro-Russian separatist militias in the Donbass.\n\nThis reality indicates that cryptocurrency has become not only a mainstream financial phenomenon, but also an instrumental digital asset in contemporary conventional warfighting. Considering that both Moscow and Kiev are actively resorting to decentralized cybercurrencies to gain an upper hand in this ongoing conflict, an article published by the Washington Post metaphorically described such confrontation as the world’s first “crypto war.” Yet, it is still unknown if cryptocurrencies will represent a game-changer that can decisively alter the facts on the ground in favor of either side.\n\nIn order to increase its war chest of crypto-assets, the Ukrainian government even courted the participation of large private cryptocurrency trading platforms, including FTX, Kuna, and Everstake. This involvement generated unexpected externalities. Specifically, the revelations that have uncovered the fraudulent criminal behavior of private cryptocurrency exchange FTX under the leadership of Sam Bankman-Fried ‒ involving cyclical transfers of wealth as a scheme that was facilitated by powerful political and corporate connections ‒ demonstrates that that these initiatives can also offer opportunities that encourage acts of corruption. The resulting fallout is problematic because it harms the public legitimacy of the crowdfunding efforts due to the fear of misappropriation of funds and also because at least some of the money sent by donors might not have reached its intended destination.\n\nIn the context of the Ukraine War, BTC has not just been used to optimize the defensive capabilities of Kiev’s military forces in the operational theatres of engagement. The cryptocurrency has also helped civilians caught in the crossfire. As a response to the destruction of infrastructure, Ukraine’s worsening macroeconomic trouble, the intermittent occupation of large urban areas by Russian forces, the exodus of millions of refugees, and the unreliability or unavailability of traditional financial services under such chaotic conditions, Ukrainian citizens are turning to BTC as a non-traditional monetary item to carry out safe and quick transactions whose purpose is to cover essential needs.\n\nIranian engagement in the BTC ecosystem to deflect the impact of sanctions\n\nThe Islamic Republic of Iran has harnessed the Bitcoin landscape in an effort to deflect Western sanctions through unorthodox measures. According to the consulting firm Elliptic ‒ involved in the scrutiny of blockchain analytics ‒ Teheran is encouraging BTC mining in order to use the resulting profits to pay for imports, overcoming the coercive restrictions that limit its ability to participate in economic exchanges carried out through ordinary platforms. Since the process involves the ‘alchemical’ transformation of energy into cryptocurrency ‒ a borderless monetary asset that circulates in an almost unrestricted way ‒ on an industrial scale, it offers the Iranian state an opportunity to monetize its energy resources (oil and natural gas), an important advantage for an economy deprived of hard cash and access to conventional financial services in international capital markets. Furthermore, Teheran is engaged in negotiations with other states ‒ including Austria, Bosnia-Herzegovina, England, France, Germany, Russia, South Africa, Switzerland ‒ over the development of collaborative frameworks for the use of cryptocurrencies in cross-border financial transactions. Therefore, for Iran, Bitcoin represents a backdoor to access the world economy. As such, it bolsters its counter-hegemonic policy of “economic resistance.”\n\nNevertheless, Iran’s position towards stateless cryptocurrencies has zigzagged as the balance between costs and benefits has changed. Iranian authorities reversed their permissiveness towards Bitcoin mining due to rising electricity consumption, shortages of natural gas supplies as a result of the sanctions, Bitcoin’s falling value, and the incidence of droughts which have diminished the operational capacity to generate hydropower. Tehran even launched a clampdown due to concerns over the prospect that widespread BTC mining could overload the country’s power grid and provoke blackouts, a problem which could unleash socio-political unrest. Yet, there are signs which indicate that Tehran is revisiting its position once more. In August 2022, the Iranian Ministry of Industry, Mining, and Trade announced on social media that the Middle Eastern country had completed its first import order denominated in an unnamed stateless cryptocurrency, a transaction worth $10 million, adding that more operations like this will continue in Iran’s international economic exchanges. Although still worried about the problematic consequences of mining for energy security, Iran has released hardware for BTC mining that had been previously seized.\n\nConcluding Remarks\n\nBoth strategic forecast and analytical assessments reveal that, in the strategic chessboards of 21st century “connectivity wars,” the leading cryptocurrency can be wielded as a high-tech financial sword or shield by innovative practitioners of economic statecraft. Some predictions have already come true. Others anticipate conceivable possibilities that might come to fruition in the near future. In turn, reality itself has brought some unexpected, but not surprising, developments that had not been foreseen. The unchartered waters of the cryptocurrency ecosystem might bring even more exotic applications of Bitcoin and similar virtual currencies for economic warfare worth exploring that have not been identified yet.\n\nThe increasing weaponization of Bitcoin in conventional and unconventional battlefields is consistent with the transformational character of “hybrid warfare.” A century ago, the historiographical German thinker Oswald Spengler explained that rather than an item that flows from one hand to another in economic exchanges, money is ‒ for modern Faustian civilizations that favor the march of technological development, the pursuit of worldly power and economic dynamism in the quest for wealth ‒ also an organic impersonal lifeform whose strength can be harnessed to project political force. The ongoing and eventual involvement of Bitcoin in several expressions of conflict shows that such an axiom is certainly valid in the digital age of FinTech."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZm9ydHVuZS5jb20vY3J5cHRvLzIwMjMvMDQvMDMvYml0Y29pbnMtYmVzdC1xdWFydGVyLWluLTIteWVhcnMtYmVhdHMtYWxsLW1ham9yLWluZGV4ZXMtaW4tcTEv0gFpaHR0cHM6Ly9mb3J0dW5lLmNvbS9jcnlwdG8vMjAyMy8wNC8wMy9iaXRjb2lucy1iZXN0LXF1YXJ0ZXItaW4tMi15ZWFycy1iZWF0cy1hbGwtbWFqb3ItaW5kZXhlcy1pbi1xMS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin’s best quarter in 2 years beats all major indexes in Q1 - Fortune",
        "content": "After a rocky end to 2022, Bitcoin turned its luck around in the first three months of the year, skyrocketing 73% to outperform all major U.S. indexes.\n\nThe most popular cryptocurrency started the year off around $16,000 but finished the quarter around $28,500, its best quarterly performance in two years, according to CoinDesk. The cryptocurrency was trading at $28,000, down 1% on Monday morning, according to CoinMarketCap data.\n\nBitcoin outperformed all major indexes in a quarter that saw stocks bounce back. The S&P 500 was up 7%, and the Dow Jones rose 0.4%, while the Nasdaq led the pack with a 17% increase, its best quarter since the fourth quarter of 2020, according to CNN Business. Gold was also up 7% in the first quarter.\n\nThe second-leading cryptocurrency, Ether, jumped 50% over the same period, and it could see additional gains after the Shanghai update to its code later this month.\n\nPart of the reason for Bitcoin’s recent success is a restoration of its “store-of-value” properties, according to a Friday research report by crypto exchange Coinbase. Investors tend to put money into stores of value like gold when markets fall.\n\nIts correlation to the S&P 500 has dropped from a peak of 70% in May 2022 to 25% on March 30, just before the quarter ended, according to Coinbase. Because the digital currency serves as an alternative to the traditional financial sector, it has benefited from investor uneasiness following the failure of Silicon Valley Bank and Signature Bank last month.\n\nAfter holding just 43.9% of all crypto market share at the end of February, at the end of March, Bitcoin made up 47.7% of the digital asset market, according to Coinbase.\n\nLast week, the cryptocurrency saw $8.8 million in inflows, while Ethereum saw outflows of around $2 million, according to a research note by digital asset investment and trading group CoinShares.\n\nAnother factor boosting both equities and Bitcoin is hopes from investors that the Federal Reserve will reverse course and cut interest rates. The Fed raised rates a quarter of a percentage point following its meeting in March, and some investors think a rate cut could be imminent due to recession signals.\n\nStill, after the Fed’s March meeting, Chairman Jerome Powell said a rate cut was unlikely for the rest of 2023."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiPGh0dHBzOi8vd3d3LnNwYWNlLmNvbS9iaXRjb2luLXRyZWFzdXJlLWh1bnQtbW9vbi1sdW5hci1yb3ZlctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Launch of private moon rover this year will kick off lunar Bitcoin treasure hunt - Space.com",
        "content": "Cryptocurrency is going to the moon.\n\nPartnering with the planetary mobility firm Lunar Outpost, the California-based social intelligence company LunarCrush plans to deliver a treasure chest of 62 Bitcoins currently worth about $1.5 million to the surface of the moon.\n\n\"The Bitcoin bounty, dubbed Nakamoto_1, will be unlocked by the first space traveler to reach the moon and obtain the wallet's private key, which will be etched onto a Lunar Outpost MAPP rover launching into space later this year,\" a press release about the project states.\n\nRelated: How blockchain can change the space industry\n\nAnimation studio Golden Wolf, along with Bitcoin developer tools company Hiro, has collaborated with LunarCrush to conduct this extreme treasure hunt. These partners will sell an exclusive NFT collection to generate the money needed for the Bitcoin bounty, which is intended to inspire the next generation of interplanetary exploration. The sale began March 28 at lunarcrush.com/nakamoto1.\n\n\"When you put out a seemingly unachievable goal, the innovation that happens can be incredible. Our goal is to inspire people to build communities that will unlock a new era of exploration,\" LunarCrush CEO Joe Vezzani said in the press release.\n\n\"We envision classrooms, groups, companies and even DAOs [decentralized autonomous organizations] coming together to reach the moon and split the treasure chest's rewards,\" Vezzani added. \"It's like Willy Wonka's 'golden ticket' for the Web3 era, and we couldn't be more excited to see how it all unfolds.\"\n\nLunar Outpost's MAPP is scheduled to launch late this year atop a SpaceX Falcon 9 rocket. The rover will touch down near the moon's south pole aboard Intuitive Machines' Nova-C lander.\n\nAfter MAPP hits the gray dirt, any ambitious citizen on Earth can devise a mission to reach it and unlock the golden reward.\n\n\"What may sound outlandish to some will open new frontiers that haven't been explored outside the mind in a long time. Future generations will look to us as pioneers of interplanetary exploration and adventure,\" Forrest Meyen, co-founder and chief strategy officer at Lunar Outpost, said in the press release.\n\n\"LunarCrush is using modern blockchain technology to deliver a treasure instead of organizing a prize committee. This structure incentivizes exploration while unlocking the best of human ingenuity,\" Meyen added. \"Lunar Outpost is proud to provide our first-in-history commercial lunar surface transportation to innovative projects like Nakamoto_1.\"\n\nPer the press release, 25% of each NFT sale ($250 each) will be applied toward funding the moon-bound treasure chest, and another 25% of the proceeds will help fund a general \"community marketing wallet\" to aid future Bitcoin core development and causes related to STEM (science, technology, engineering and math) education.\n\nGlobal animation and design studio Golden Wolf was contracted to conceive the NFTs and special imagery that range from static images to heavily animated collectibles to set the proper outer space tone.\n\n\"We loved the idea that the art could inspire a new generation of young people to look to the stars, like a contemporary version of an Apollo 11 poster on a bedroom wall,\" Ingi Erlingsson, founder and CEO of Golden Wolf, said in the press release. \"We wanted the aesthetic to feel modern and unique, with a hint of vintage sci-fi art.\"\n\nFollow us @Spacedotcom, or on Facebook and Instagram."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vdWsuZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWRyb3BzLXVzLXNlbGxzLWJ0Yy1jcnlwdG8tMDg0ODA4NTE0Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin drops as US plans to sell over 41,000 BTC - Yahoo Finance UK",
        "content": "Bitcoin's price has risen by 67.76% so far this year. Photo: Dado Ruvic/Reuters (Dado Ruvic / reuters)\n\nBitcoin (BTC-USD) has fallen below $28,000 (£22,730) as regulatory action against the crypto industry intensifies and the US government announces a schedule to sell 41,490 BTC in 2023.\n\nThe global cryptocurrency market cap stood at $1.21tn on Monday, a drop of 2.1%, according to Coingecko.\n\nBitcoin fell 2.2% to $27,887.\n\nThe recent price action has left bitcoin's market capitalisation at $538bn. But, bitcoin's price has risen by 67.76% so far this year.\n\nEthereum (ETH-USD) fell 1.27% to $1,790.\n\nRead more: Crypto live prices\n\nThe Ethereum Foundation said last week that the blockchain's Shanghai hard fork, featuring an upgrade enabling investors to withdraw their staked ETH for the first time, is set for 12 April.\n\nUS to sell over 41,000 bitcoin\n\nLast month, the US government sold $216m worth of bitcoin that it had seized during a November 2021 search connected to cryptocurrency that had been stolen from the Silk Road dark web marketplace.\n\nADVERTISEMENT\n\nThe bitcoin sold was a portion of a 50,000 BTC haul that was seized following the arrest of James Zhong, who pleaded guilty to wire fraud after the government alleged he manipulated the transaction system on Silk Road in 2012.\n\nThe US government plans to sell the remaining 41,490 bitcoins in four separate portions throughout 2023, according to a court filing.\n\nRipple versus the SEC\n\nXRP (XRP-USD) climbed 3.06% to $0.5192 — a 15.57% weekly increase.\n\nIt is thought that Ripple Labs, whose crypto payment platform utilises XRP, will soon resolve its ongoing legal battle with the US Securities and Exchange Commission (SEC).\n\nThe SEC has accused the company and its executives of violating securities regulations.\n\nSEC chair Gary Gensler asked Congress for $2.4bn in funding last Wednesday to enhance the agency's efforts in combating cryptocurrency-related malpractices.\n\nBinance versus the CFTC\n\nThe cryptocurrency market has experienced instability due to last week's litigation from US regulators against crypto exchange Binance.\n\nStory continues\n\nLast Monday, the US Commodities Futures Trading Commission (CFTC) filed an enforcement action against Binance and its founder Changpeng 'CZ' Zhao.\n\nAccording to the CFTC, which has been investigating Binance’s business since 2021, the company failed to meet its regulatory obligations by not properly registering with the derivatives regulator.\n\nThe CFTC classifies bitcoin (BTC-USD), ethereum (ETH-USD) and litecoin (LTC-USD) as commodities and has accused Binance of conducting unregistered derivative trading with these digital assets.\n\nRead more: Binance: Investors withdraw more than $2bn after enforcement action by US regulators\n\nBinance founder Changpeng “CZ” Zhao has also been accused of encouraging Americans to “evade compliance controls” by the US regulator.\n\nUK banks restricting web3 firms, claims report\n\nThe UK cryptocurrency sector is finding it increasingly difficult to access banking services, with restrictions on web3 firms holding back Britain's aspiration to become a \"global crypto hub\", a new report has claimed.\n\nThe few banks that continue to collaborate with web3 businesses are requiring more extensive documentation, with problems ranging from having applications rejected to getting buried in paperwork, according to the report by Bloomberg.\n\nWeb3 firm SavingBlocks said it applied to nine banking service providers for a corporate account and was turned down by seven of them. Those that did offer services asked for \"insurmountable\" additional documentation.\n\n“There aren’t many options available, most traditional banks won’t offer banking services to crypto firms,\" Edouard Daunizeau, SavingBlocks founder and CEO, told Bloomberg.\n\n“With the recent string of events it will be even tougher, so we are now seeking licenses in France where we think it will be easier.\"\n\nRead more: Crypto live prices\n\nSome web3 founders have complained to the UK government, saying that the limitations contradict prime minister Rishi Sunak's intention to prioritise financial technology innovation and establish the UK as a global crypto hub.\n\n“The UK banking reaction has been more acute than the EU one,\" Tom Duff-Gordon, vice president of international policy at Coinbase (COIN), told Bloomberg. He said that the European Union's efforts to create a digital asset framework make banks in other countries more open to working with crypto firms.\n\nThe European parliamentary committee approved the Markets in Crypto Assets (MiCA) legislation in October, with the final vote set to take place this month.\n\nThe UK is losing ground to the rest of Europe, according to the Bloomberg report, as data from PitchBook showed venture capital funding for UK digital asset companies has experienced a 94% decline over the past year.\n\nThe EU saw a 31% increase in investments during the same period.\n\nEquity markets\n\nUS stocks advanced on Friday, as the Federal Reserve's preferred inflation measure indicated signs of cooling, and a potential end to the Fed's monetary tightening cycle.\n\nThe tech-heavy Nasdaq (^IXIC) increased by 1.7%, while the S&P 500 (^GSPC) and the Dow Jones Industrial Average (^DJI) gained 1.2% and 1.4%, respectively.\n\nWatch: Polygon to 'overtake Ethereum in terms of economic activity,' claims co-founder | The Crypto Mile\n\nDownload the Yahoo Finance app, available for Apple and Android."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMikwFodHRwczovL2VuZ2xpc2guZWxwYWlzLmNvbS9pbnRlcm5hdGlvbmFsLzIwMjMtMDQtMDIvY3J5cHRvLWV2YW5nZWxpc3RzLWVudGVyLXRoZS1idWtlbGUtZ292ZXJubWVudC10aGUtZGFyay1idXNpbmVzcy1vZi1iaXRjb2luLWluLWVsLXNhbHZhZG9yLmh0bWzSAaIBaHR0cHM6Ly9lbmdsaXNoLmVscGFpcy5jb20vaW50ZXJuYXRpb25hbC8yMDIzLTA0LTAyL2NyeXB0by1ldmFuZ2VsaXN0cy1lbnRlci10aGUtYnVrZWxlLWdvdmVybm1lbnQtdGhlLWRhcmstYnVzaW5lc3Mtb2YtYml0Y29pbi1pbi1lbC1zYWx2YWRvci5odG1sP291dHB1dFR5cGU9YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "Crypto evangelists enter the Bukele government: The dark business of bitcoin in El Salvador - EL PAÍS USA",
        "content": "American crypto evangelist Max Keizer has compared Salvadoran President Nayib Bukele to John F. Kennedy and El Salvador to the kingdom of Camelot, describing it as a kind of promised land for bitcoin where taxes and central banks are sleighed like dragons. Until a few months ago, Keizer — an American former stockbroker and reporter close to Russian propaganda sites — was just another one of the many outlandish characters who began to arrive in the country in 2021, after Bukele announced that El Salvador would be the first in the world to accept bitcoin as legal currency.\n\nMany of those characters — a mix of anarcho-capitalists, cyber-utopians and plain old opportunists — left El Salvador as enthusiasm for the bitcoin project began to wane. Only 14% of the country’s businesses have ever used bitcoin, according to official figures. But those characters who are still in the country have gone in all the way — people like Keizer and his wife, Stacy Herbert. Since the end of last year, Keizer and Hebert have been in charge of the country’s National Bitcoin Office. El Salvador, one of the smallest and poorest countries in the region, has crypto evangelists within the government.\n\nMax Keizer waves a Salvadoran flag at a cryptocurrency conference in Miami on April 7, 2022. Rebecca Blackwell (AP)\n\nThe creation of the National Bitcoin Office, like the rest of Bukele’s crypto project and much of his government’s management, is shrouded in secrecy. The only figures that have been made public are the $200 million that was spent on the infrastructure to launch the digital currency, such as bitcoin ATMs and a cellphone app. Beyond what Bukele has announced on Twitter, it also not known much the country has invested in bitcoin. Like Bukele, Keiser and Herbet are also active on social media, with more than 700,000 followers. Their YouTube shows and podcasts are the main source of information on El Salvador’s bitcoin policies.\n\nStacy Herbert at a cryptocurrency conference in Dublin, Ireland, on June 12, 2018. Stephen McCarthy (Getty Images)\n\nKeiser and Herbert both present themselves as some kind of crypto police or crypto judges. They are authorized to investigate possible fraud, and they are the ones who decide which investor is allowed in and which is not. “We do not receive any salary for this. We do it for President Bukele,” Herbert often says, while her husband calls their work “an act of love.” Leaving aside their alleged altruism, the couple owns Heisenberg Capital, a fund belonging to Bitfinex, one of the world’s largest platforms for buying and selling bitcoin. And they also own El Zonte Capital, another fund dedicated exclusively to digital investments in El Salvador.\n\nPropaganda and corporate diplomacy\n\nRicardo Valencia, professor of Political Economy at California State University, argues that for Keiser and Herbert, “the true value of the office is not monetary, but for propaganda and corporate diplomacy.” The National Bitcoin Office is attached to the Presidency of the Republic and has the power to establish international relations. Valencia, who is also a specialist in communication, points out that “it has the ability to design public policies that are mandatory for other ministries in the country and grants Keizer and Herbert official titles to inaugurate bitcoin embassies in Europe and the United States.”\n\nTexas and Switzerland have already welcomed Salvadoran bitcoin embassies, which work in parallel to official diplomacy channels. “A network of apocryphal diplomats is being built that will serve to spread official and corporate propaganda. It is an exchange of favors within the patrimonial use of the state. In El Salvador, there is no difference between Bukele’s personal deposits and public finances,” adds Valencia. Given the risks involved with bitcoin, such as its great volatility and lack of transparency, Bukele’s decision to make the cryptocurrency legal tender has sparked sharp rebuke from the International Monetary Fund (IMF), ratings agencies and even the U.S. government.\n\nFarmers demonstrate against the adoption of Bitcoin as legal currency on the Pan-American highway, in September 2021. Salvador Melendez (AP)\n\nBitcoin City\n\nIn June 2021, Bukele announced that bitcoin would be the official currency in his country, along with the dollar. He made the announcement during the Bitcoin Conference in Miami, a large-scale event with concerts, sumo wrestlers, televangelist-style presentations and slogans such as “death to the dollar” and “everyone against the Federal Reserve.” Crypto evangelists criticize the state because they consider it the enemy of what they call “individual sovereignty.” For them, neither Elon Musk nor Mark Zuckerberg are disruptive enough. They understand life in society as a jungle or a casino, where practically the only law is the direct exchange of digital money.\n\nBukele also shares this messianic tone and flashy exhibitionism. At the end of 2021, Bukele hosted Bitcoin Week in El Salvador — an event that tried to emulate the vibe of the Miami conference. At the party to celebrate the end of the event, Bukele took to the main stage, at the foot of the beach, while a giant screen projected in neon blue letters: “The President.” Laser lights, smoke cannons and fireworks went off as the president took the microphone: “When Alexander the Great was conquering the world, he decided to establish 20 Alexandrias throughout his empire. These cities were beacons of hope for the rest of the planet. We must establish our first Alexandria here, in El Salvador. Let’s build Bitcoin City.”\n\nBukele announces Bitcoin City, on November 20, 2021. Salvador Melendez (AP)\n\nBukele said his Bitcoin City would be powered by geothermal energy from a nearby volcano, and that the money to set up schools, hospitals and the rest of the services needed would come from so-called volcano bonds or bitcoin bonds: new Salvadoran public debt securities backed by bitcoin. A year and a half after the announcement, El Salvador — turning a deaf ear to the IMF’s warnings — has prepared a law that will allow it to raise $1 billion via bitcoin-backed bonds. Keizer and Herbert have played a key role in this process. According to an investigation by The Wall Street Journal, Bitfinex — the parent company of their two funds — will provide not only the technological platform for the bonds, but will also request a license to operate as a trader.\n\nBut Keizer and Herbert are not the only influential figures from the crypto world who have collaborated in implementing El Salvador’s bitcoin transition. Jack Mallers, a 27-year-old who created an application for instant money transfers via bitcoin, was one of the president’s closest advisers in drafting the law that formally introduced the currency to the country. Like Keizer and Herbert, he also had a vested interest in El Salvador’s bitcoin project: he was hoping his application would be able to gain ground in the country’s remittance market. Some 20% of El Salvador’s gross domestic product (GDP) comes from money that is sent by Salvadorians living abroad, especially in the U.S. But the project did not work out, and according to sources close to Mallers, he has not set foot in the country again.\n\nA scale model of Bitcoin City shared by Bukele on social media. Nayib Bukele via Twitter\n\nOnly 2% of remittances are transferred via bitcoin, according to data from the Central Bank. And around 70% of Salvadorans do not even have a bank account. “Financial inclusion was one of the objectives of the bitcoin project. But there is no public policy that develops these objectives,” says economist Tatiana Marroquín. “The other goals were to promote the country’s brand image and the reception of tourists. But with everything that has happened with bitcoin in recent months —falling prices, financial fraud — El Salvador’s financial profile has fallen instead of rising.”\n\nBitcoin has lost 40% of its value in the past year. And since Bukele announced that it would be legal tender, the IMF has been issuing more and more warnings. The last warning was in response to the imminent issuance of the so-called volcano bonds. In a statement last month, the international institution stressed: “Given the legal risks, fiscal fragility and largely speculative nature of crypto markets, the authorities should reconsider their plans to expand government exposures to Bitcoin, including by issuing tokenized bonds.”\n\nSign up for our weekly newsletter to get more English-language news coverage from EL PAÍS USA Edition\n\n\n\n"
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMDMvaW50ZXJuZXQtY29tcHV0ZXItaXNzdWVzLWxpcXVpZC1iaXRjb2luLWZvci1mYXN0ZXItYW5kLWFmZm9yZGFibGUtYnRjLXRyYW5zYWN0aW9ucy_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wNC8wMy9pbnRlcm5ldC1jb21wdXRlci1pc3N1ZXMtbGlxdWlkLWJpdGNvaW4tZm9yLWZhc3Rlci1hbmQtYWZmb3JkYWJsZS1idGMtdHJhbnNhY3Rpb25zL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Internet Computer Issues ‘Liquid Bitcoin,’ for Faster, Cheaper BTC Transactions - CoinDesk",
        "content": "Unlike wrapped tokens controlled by a centralized entity, ckBTC uses canisters – smart contracts for asset transfers – and doesn't require intermediaries or risky cross-chain bridges. Users deposit real bitcoin to their deposit address and receive an equal amount of ckBTC. Similarly, users can return ckBTC tokens to receive an equal amount of real bitcoin at a specified bitcoin address."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA0LTAyL3doLWlzLWJpdGNvaW4tYnRjLWxpcXVpZGl0eS1kZWNsaW5pbmctaW4tMjAyMy1pbmR1c3RyeS1jaGFvc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Why is Bitcoin (BTC) Liquidity Declining in 2023? Liquidity Problem Offers Clues - Bloomberg",
        "content": "By just about any measure, Bitcoin liquidity remains low, despite the cryptocurrency’s eye-catching upsurge this year.\n\nInvestors have been paying more on trades because of slippage, or the difference between the expected price of a transaction and the price at which it’s fully executed, a sign of worsening liquidity, according to Conor Ryder at Kaiko. The higher the difficulty in trading, the more investors are exposed to potential volatile price swings."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMiVWh0dHBzOi8vd3d3Lm1hcmtldHBsYWNlLm9yZy8yMDIzLzA0LzAzL2hhcy10aGUtYmFua2luZy1jcmlzaXMtYmVlbi1hLWJvb24tZm9yLWNyeXB0by_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Has the banking crisis been a boon for crypto? - Marketplace",
        "content": "The price of a single bitcoin has recently rallied to over $28,000. That’s approaching double its value at the end of last year, which was not a very good year for crypto.\n\nRecall that 2022 saw a string of major bankruptcies in the industry — most notably, for exchange FTX in November. But bitcoin and other digital currencies are riding a wave of momentum that started last month, around the time of Silicon Valley Bank’s collapse, and the government’s response.\n\nAt The Bagel Exchange in Alhambra, California, one of the first things you see when you walk in is a machine that sells bitcoin and other cryptocurrencies.\n\nOwner Ryan Natividad says you can pay for your schmear with cash, credit or crypto — and not just bitcoin and the other big ones.\n\n“We accept Litecoin and Matic. Someone paid with apecoin the other day,” he said.\n\nNatividad also has a giant stock ticker mounted to the wall, above four TV screens that play financial news and a livestream on Twitch.\n\nA stock ticker hangs above four television screens that display financial news and a Twitch livestream at The Bagel Exchange in Alhambra, California. (Lily Jamali/Marketplace)\n\nMaking a matcha green tea latte, Natividad said he paid for this place from his own crypto winnings and he’s sticking with it.\n\n“I still believe in Bitcoin and Ethereum. I feel like it’s gonna be around for a while,” Natividad said. “There’s a lot of bad news going around. Everybody just doesn’t know where to put their money.”\n\nBitcoin — the standard bearer of crypto — came out of a period when bad financial news was the norm: the Great Recession. The cryptocurrency came into being in January 2009 after a year of major financial failures.\n\nThis first wave of bank failures since then is a big test for crypto, said David Yermack, chair of the finance department at New York University’s Stern School of Business.\n\n“Many of the larger banks appear to be vulnerable. Governments have not been particularly successful at bailing them out and shoring up public confidence,” Yermack said. “This is exactly the kind of dynamic that the creators of Bitcoin were trying to play into.”\n\nAnd there’s some validation in this moment, per Sheila Warren, CEO of the industry group Crypto Council for Innovation.\n\n“I think people are really feeling like: ‘This is what we’ve been talking about for so long, guys, right? Look back at 2008 and 2009!’ And now here we are. So I do think there is a quiet kind of recognition of that,” she said.\n\nAt the same time, many crypto enthusiasts and investors worry that regulators are trying to keep money from escaping the traditional banking system right now.\n\n“There certainly seems to be a concerted effort of closing the exit ramps — closing the doors on crypto,” said entrepreneur Adam Jackson, founder of Cambrian Asset Management, a cryptocurrency hedge fund, which he launched in 2017.\n\nJackson points to the regulatory clampdown that’s intensified lately. Late last month, the world’s largest crypto exchange, Binance, was sued by the Commodities Futures Trading Commission for running an alleged sham compliance operation. And Coinbase said it was put on notice about potential charges from the U.S. Securities and Exchange Commission.\n\nThese developments have only added to the view some have that the financial system’s old guard is coming after crypto.\n\nPeople tend to look for information that validates how they already view the world, said Hilary Allen, professor at the American University Washington College of Law.\n\n“I could see how someone who very much wants to believe that crypto is the successor to traditional finance might interpret what has happened over the last few weeks as confirming that crypto will take over,” Allen said.\n\nRyan Natividad is the owner of The Bagel Exchange in Alhambra, California. He opened up his shop using earnings from his crypto investments. (Lily Jamali/Marketplace)\n\nBut while the latest banking crisis has shown that there are definitely problems in traditional finance, “I think those problems are replicated and exacerbated in the crypto system,” Allen added.\n\nBack at The Bagel Exchange, Ryan Natividad is having one of his regular chats about crypto with Richard Valenzuela, who owns the bar next door.\n\n“I come in here to make fun of him all the time,” Valenzuela said.\n\nEven after all their talks, Valenzuela said crypto makes no sense to him. “People are like, ‘Oh, maybe it is worth something.’ But it’s like, how could something with no intrinsic value appreciate so much? I don’t get that,” Valenzuela said.\n\nA lot of people don’t really get it. But crypto seems to be rallying anyway, as many wait to see what’s next for tech and the larger economy."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vd3d3LmJpdGNvaW4uY29tL2dldC1zdGFydGVkL3doYXQtaXMtY3J5cHRvLWluc3VyYW5jZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 05:45:29 GMT",
        "title": "What is crypto insurance? | Learn about DeFi | Get Started with Bitcoin.com - Bitcoin.com",
        "content": "Crypto technology is starting to be used within the legacy insurance industry to improve their products, at the same time as decentralized insurance protocols in DeFi are creating a new class of on-chain insurance products. Blockchain-based insurance enables gains in efficiency and transparency over traditional insurance systems. This article looks at how blockchain-based insurance is improving insurance in traditional finance, and how it is being deployed in DeFi."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNvaW5iYXNlLmNvbS9pbnN0aXR1dGlvbmFsL3Jlc2VhcmNoLWluc2lnaHRzL3Jlc2VhcmNoL21vbnRobHktb3V0bG9vay9iaXRjb2lucy1zdGVhbHRoLXJlY292ZXJ5LWFwcmlsLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Stealth Recovery - Coinbase",
        "content": "Summary If a month ago someone had predicted that US$229B would be wiped off the value of US regional banks (threatening financial institutions on both sides of the Atlantic), our best guess would likely not have been bitcoin prices up by 18.5% and the total crypto market cap up 10.7% to $1.15T. The performance of US stocks (proxied by the S&P 500) was comparatively flat in March, dragging the correlation between stock and bitcoin returns from 58% at the start of the year to 25% (i.e. relatively uncorrelated) based on a 65-day rolling window. While the resilience of cryptocurrency returns has been impressive, it belies the impact that banking failures have had on the onramps (offramps) into (out of) the digital asset ecosystem. The loss of Silvergate Exchange Network (SEN) and Signet have, for example, constrained market liquidity and widened price differentials across onshore and offshore exchanges that have been difficult to arbitrage away. On the upside, there are banks in the US (as well as the UAE and Switzerland ) that already seem poised to fill the gaps left by Silvergate and Signature. One peculiarity about crypto’s recovery in March is that bitcoin outperformed other digital assets, including ether. We believe the “flight to bitcoin” partly reflects (1) investor concerns regarding the regulatory status of non-bitcoin cryptocurrencies, (2) fundamental arguments that favor digital assets as an alternative to the existing financial system, (3) the approaching end of the Fed’s tightening cycle, and (4) relatively supportive technical factors.\n\nLet bitcoin be bitcoin From a performance perspective, March has mainly been a bitcoin story. Bitcoin has been outperforming its digital asset peers since mid February, but the move accelerated in early March, coinciding with the onset of the US banking turmoil. In a previous report ( “Bank mismanagement” , published March 17), we discussed the asset-liability mismatches at Silicon Valley Bank (SVB) that led the US government to take decisive action or otherwise risk a potential system-wide bank run among regional banks. In the weeks following that rescue, the gap between bitcoin and the top ten crypto assets by market capitalization (excluding stablecoins and ether) has widened considerably (see chart 1). Bitcoin accumulation is evident in the remarkably strong buy ratios of 50-70% last month compared to only 35-50% for ETH, while bitcoin dominance as a percent of the total crypto market cap surged from 43.9% at the end of February to 47.8% at the end of March. Chart 1. BTC outperformance accelerated in March (Index 1 Jan 2023 = 100) On a risk-adjusted basis, bitcoin is outperforming many traditional risk assets too, including US stocks and G10 currencies. For example, bitcoin appreciation is 1.87 standard deviations above the 65-day rolling average compared to only 0.01 standard deviations for the S&P 500 (indicating relatively flat performance) or even a 1.34 sigma for the tech heavy Nasdaq 100. Moreover, the data suggests bitcoin’s daily returns currently look relatively uncorrelated to the S&P 500’s with a correlation coefficient of 25% over a 65-day window compared to 58% at the start of 2023 (or 70% in May 2022). In fact, our correlation matrix (table 1) shows that BTC/USD returns currently share very little relationship with anything other than ETH/USD returns, although its correlation to gold has been on the rise this year from 16% in early January to 26% now.\n\nFundamental resilience Such trends support fundamental arguments that bitcoin still functions as a relatively uncorrelated asset that exists as an alternative and solution to the points of failure witnessed in the existing financial system. In fact, we believe bitcoin has recently been operating as a hedge for some market participants against the vulnerabilities of fractional reserve banking and the potential risks of a more serious credit crunch. Indeed, we have seen bank depositors continuing to migrate their excess (uninsured) deposits from mid-tier regional banks like First Republic and PacWest to larger institutions, creating further centralization pressures. Consequently, we think the risk of shocks may not yet have fully abated. Additionally, the crisis has made banks more hesitant to make new loans or accumulate debt for fear of exacerbating their asset-liability mismatches, while the rotation into money market funds (currently $5.2T) has reduced bank reserves. The latter suggests that the Fed’s reverse repo tool (RRP) is draining more than just the excess liquidity in the system. All of this suggests financial conditions are implicitly tightening, while both business and consumer sentiment deteriorates. That leaves the Federal Reserve much closer to the end of its monetary tightening cycle, which could be another reason why bitcoin has been strengthening as of late. Bitcoin tends to perform better when market participants anticipate looser monetary policy (as reflected by a pronounced drop in forward rates). Many also see the Fed’s Bank Term Funding Program (BTFP) as a form of monetary expansion – even if the majority of those newly created dollars will never enter the real economy – against which bitcoin could offer some protection. Chart 2. Value in money market funds has climbed to $5.2T Another reason for bitcoin’s outperformance may be the increased regulatory uncertainty surrounding the status of non-bitcoin cryptocurrencies in recent weeks. The most prominent example of this was in a lawsuit filed by New York Attorney General Letitia James on March 9 against crypto exchange KuCoin (for failing to register its platform in NYS). The lawsuit alleges that ETH (as well other cryptocurrencies including LUNA and UST) are potentially securities under New York’s Martin Act. This coincides with more forceful language from SEC Chair Gary Gensler in a NY Magazine interview published February 23 that he believes “everything other than bitcoin” are securities because “there’s a group in the middle and the public is anticipating profits based on that group.” He is scheduled to appear before a House Financial Services committee on April 18 to provide further details about his regulatory approach. On the other hand, CFTC Chair Rostim Benham said in a Senate Agriculture Committee hearing on March 8 that ETH and stablecoins are commodities.\n\nTechnicals and on-chain data Note that technicals have factored into bitcoin’s relative outperformance as well. For example, in February, we discussed the constraints on available bitcoin supply with tokens locked up in government custody or cold storage wallets. This contributed to a deceleration in bitcoin’s velocity from an average of 3.24 in October and November 2022 to 1.36 by December and January. (Velocity declines when more bitcoin are taken out of circulation rather than used for transactions on the network.) As of March, bitcoin velocity has only risen marginally to 1.49, while the number of transactions per active address on the network jumped by an impressive 16.2% last month. See table 1. Comparatively, the transaction count per capita only increased 7.8% on Ethereum, although the smaller increment may have also had to do with the anticipated airdrop of ARB tokens (on March 23), representing optimistic rollup Arbitrum. This led to relatively flat transaction fees on Ethereum relative to the average over the last 12 months and no change in the total value locked between February and March. (That said, ETH supply continues to contract at a 0.30% annualized pace.) In juxtaposition to that, the transaction fees earned by bitcoin miners in March were almost 2.5 standard deviations above the fees earned over the entire preceding 12 months – bolstered by a more developed trading environment for Ordinals (NFTs or “digital artifacts”).\n\nBitcoin’s price action was also driven by a massive option expiry on March 31 that accounted for 37.5% of the total open interest. There had been significant upside call buying from lower spot levels leaving dealers short gamma. The significant gamma hedging requirements likely perpetuated the squeeze higher as spot prices trended up. Moreover, the move was likely exacerbated by thin liquidity , driven not only by the effects of the US regional banking turmoil (which has affected all cryptocurrencies broadly) but also specifically by Binance’s termination of its bitcoin zero-fee trading program as of March 22."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLWNvcnJlbGF0aW9uLWdvbGQtdGlnaHRlbmVkLW1hcmNoLTE5NTExNjQ5OS5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's Correlation to Gold Tightened in March Amid TradFi Woes - Yahoo Finance",
        "content": "Bitcoin behaved more like one of the world’s most historic currencies in March, as the largest cryptocurrency by market cap exhibited a strong correlation to gold.\n\nThe value of the two assets moved in similar directions throughout the month, edging higher as a banking crisis reared its head in the U.S. and toppled several institutions like Silicon Valley Bank—which eventually spilled over to shutter European giants like Credit Suisse.\n\nThe correlation between Bitcoin and gold currently stands around 50%, according to blockchain analytics firm Kaiko. It represents the strongest connection between the two assets in more than a year, Kaiko analyst Dessislava Aubert told Decrypt.\n\n“It's a significant shift because over the course of 2022 Bitcoin and gold were mostly uncorrelated,” she said. “So, it was not moving as a safe haven [asset] at all.”\n\nOver the past month, Bitcoin has rallied 25% to around $28,000, notching its third positive month in a row despite regulatory headwinds. Meanwhile, gold has risen over 8% during the past month, nearing an all-time high of`$1,988 per troy ounce on Monday.\n\nBitcoin Is Pumping—But It’s Not Yet 'Decoupling' From Stocks, Analysts Say\n\nCryptocurrencies aren’t typically viewed as a safe haven asset—they’re generally seen as risky investments like stocks. And these risk assets have been hammered over the past year as the Federal Reserve has aggressively raised interest rates to quell inflation.\n\nBut Aubert said it’s possible for Bitcoin’s status as a risk asset to shift somewhat as investors’ perceptions of its strengths as a store of value change.\n\n“For now, people are trying to put Bitcoin in a very traditional framework,” Aubert said. “It’s very hard because it can be a lot of things.”\n\nMeanwhile, the correlation between Bitcoin and the S&P 500—a major index often used to gauge movements in the U.S. stock market—fell significantly in March to 20%, adding on to a trend that’s been building for months, said Aubert.\n\nStory continues\n\n“Bitcoin’s correlation with equities has been going down since December, steadily, and it's now very low,” she said, adding that 20% is essentially negligible.\n\nHowever, Aubert said that Bitcoin will remain influenced by factors that also impact stocks, such as the Fed’s monetary policy. She also noted that Bitcoin is sensitive to changes in liquidity overall.\n\nIs Bitcoin Really Decoupling From Stocks? Experts Weigh In\n\nAs Bitcoin begins to behave more like a safe haven asset and less like a risky one, there are some fundamental similarities between Bitcoin and gold that are notable, CoinShares’ Head of Research James Butterfill told Decrypt.\n\nOne element that the two assets have in common is that a finite supply supports their value, he said. Similar to how there’s a limited amount of accessible gold in the world, Bitcoin’s supply is capped at 21 million—with the last Bitcoin expected to be mined sometime in 2140, according to projections.\n\n“Bitcoin, in fact, is technically a harder asset than gold because it's a finite supply, but [also] a very well-known finite supply,” Butterfill said. “Theoretically, you could go out into the universe and find a ton of gold, bring it back to Earth, and flood the market.”\n\nIn terms of the cultural overlap between Bitcoin and gold, perhaps there is evidence to suggest they are converging on that front as well.\n\nThe California-based rapper Snoop Dogg stepped into the ring at WrestleMania 39 yesterday and was seen sporting a golden hardware wallet like an expensive chain."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMDMvYXByaWwtc2Vhc29uYWxpdHktaW4tZmF2b3Itb2YtYml0Y29pbi1hbmQtc3RvY2tzL9IBYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMDMvYXByaWwtc2Vhc29uYWxpdHktaW4tZmF2b3Itb2YtYml0Y29pbi1hbmQtc3RvY2tzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "April Seasonality Favors Bitcoin and Stocks - CoinDesk",
        "content": "\"The recent bull rally in U.S. stocks should have positive spillover effects for crypto as well, especially since we are now entering the month of April, which has been strong for U.S. stocks (S&P 500 +2.6%, Nasdaq +2.9%), [b]itcoin +17%, and [ether] +46%,\" Markus Thielen, head of research and strategy at Matrixport, said."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMDMvZmlyc3QtbW92ZXItYW1lcmljYXMtYml0Y29pbnMtd2l0aGluLXJhbmdlLW9mLTMway_SAWJodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzA0LzAzL2ZpcnN0LW1vdmVyLWFtZXJpY2FzLWJpdGNvaW5zLXdpdGhpbi1yYW5nZS1vZi0zMGsvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "First Mover Americas: Bitcoin's Within Range of $30K - CoinDesk",
        "content": "Japan's Financial Services Agency said in a warning letter published on Friday that foreign crypto exchanges Bybit, BitForex, MEXC Global and Bitget are operating in the country without proper registration and thus violating the country's fund settlement laws. The regulator also said the list of unregistered traders \"does not necessarily indicate the current state of unregistered business.\""
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMiigFodHRwczovL3d3dy5jb2luZGVzay5jb20vcG9saWN5LzIwMjMvMDQvMDMvdW52ZXJpZmllZC1ydW1vci1vZi1pbnRlcnBvbC1yZWQtbm90aWNlLWZvci1iaW5hbmNlLWNlby1jaGFuZ3Blbmctemhhby1zZW5kcy1ibmItYml0Y29pbi1sb3dlci_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Binance's BNB, Bitcoin Tumble After Crypto Twitter Personality Cobie's Wild Guess - CoinDesk",
        "content": "@cobie added: \"Anyway, it was not supposed to be readable ever unless I revealed it, so sorry about that. Will once again narrow down the list of ppl I can trust. Since tweeting only leads to bad things instead of good things I will probably do much less in the future.\""
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMDMvYml0Y29pbi1kcm9wcy10by0yNzVrLXdoaWxlLWRvZ2Vjb2luLXNvYXJzL9IBW2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDQvMDMvYml0Y29pbi1kcm9wcy10by0yNzVrLXdoaWxlLWRvZ2Vjb2luLXNvYXJzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Drops to $27.5K While Dogecoin Spikes After Twitter Logo Change - CoinDesk",
        "content": "Meanwhile, market liquidity has continued to worsen. Crypto data firm Kaiko’s Monday report noted that both BTC and ETH’s 2% market depth, a metric for assessing liquidity conditions, has dropped by 50% and 41%, respectively, since the collapse of Alameda Research, the trading arm of crypto exchange FTX in November – a so-called “Alameda gap.” The ongoing decline has followed exchange Binance’s announcement that it was curbing its zero-fee trading program, Kaiko said."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9maXJzdC1tb3Zlci1hc2lhLWJpdGNvaW4taG9sZHMtMDEzNjIyNjQ3Lmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "First Mover Asia: Bitcoin Holds Above $28K as Investors Await Fresh Productivity, Jobs Data - Yahoo Finance",
        "content": "Join the most important conversation in crypto and web3! Secure your seat today\n\nGood morning. Here’s what’s happening:\n\nPrices: What turmoil? Bitcoin holds its perch above $28K. Other major cryptos mostly fall in weekend trading.\n\nInsights: Decentralized-focused tokens soared during the quarter. Their gains came as U.S. regulators zeroed in on centralized exchanges.\n\nPrices\n\nCoinDesk Market Index (CMI)\n\n1,208\n\n−13.8 ▼ 1.1%\n\nBitcoin (BTC)\n\n$28,045\n\n−377.2 ▼ 1.3%\n\nEthereum (ETH)\n\n$1,788\n\n−28.9 ▼ 1.6%\n\nS&P 500\n\n4,109.31\n\n+58.5 ▲ 1.4%\n\nGold\n\n$1,979\n\n+9.6 ▲ 0.5%\n\nNikkei 225\n\n28,041.48\n\n+258.5 ▲ 0.9%\n\nBTC/ETH prices per CoinDesk Indices, as of 7 a.m. ET (11 a.m. UTC)\n\nBitcoin Investors Continue Their Watchful Waiting\n\nWill April bring showers or more sunshine for bitcoin?\n\nThe weekend offered few clues as the largest cryptocurrency by market capitalization kicked off the new month holding at late March levels as investors weighed recent events – bank failures, inflation and crypto-focused regulatory actions – that could push prices higher or drag them down.\n\nBTC was recently trading at $28,045, down 1.3% over the past 24 hours. It rose roughly 21% in March, despite a turbulent last two weeks in which markets teetered at times but always seemed to snap back above the $28,000 threshold.\n\n\"Bitcoin has remained resilient over the last week or so, resulting in a general improvement in market sentiment,\" Joe DiPasquale, CEO of crypto asset manager BitBull Capital, wrote in an email to CoinDesk.\n\nDiPasquale noted that bitcoin was trading above its 200-day moving average, \"historically a strong indicator of bullish price action.\"\n\nBut he also reflected uncertainty about BTC's path forward, calling \"the $32K to $36K range ... an area of interest on the upside while $18K to $20K ... a strong range on the downside.\"\n\nEther was also slightly up from the previous day to change hands at $1,788, down 1.6% but well within its range of the past two weeks. Ethereum developers now await the Shanghai upgrade, which is scheduled to occur April 12 and will mark Ethereum’s full transition to a proof-of-stake (PoS) network, enabling staked ETH withdrawals. Other cryptos in the top 25 by market value were largely in the red.\n\nStory continues\n\nARB, the token of layer 2 blockchain Arbitrum, recently fell 7.4% to trade at $1.19. The decline came amid an uproar in the Arbitrum community over how the Arbitrum Foundation – a centralized company charged with promoting Arbitrum's claimed decentralized ecosystem – held a \"ratification\" vote over decisions it had already implemented, including sending nearly $1 billion in tokens to itself. On Sunday, the foundation said would break up its controversial governance package into a series of separate votes, bending to community pressure.\n\nPopular meme coins DOGE and SHIB were recently off 5.5% and 4.8%, respectively. The CoinDesk Market Index, a measure of crypto markets overall performance was recently down 1.2%.\n\nEquity markets closed an eventful, largely upbeat first quarter on a high with the tech-focused Nasdaq climbing 1.7% and the S&P 500 and the Dow Jones Industrial Average (DJIA) rising 1.2% and 1.4%, respectively.\n\nThis week, investors will have a fresh set of employment and productivity data to gauge whether the U.S. economy is continuing to contract as recent signs have suggested or powering forward. The U.S. Census Bureau will release February durable goods orders on Tuesday, with expectations for a 1% month-over-month decline, and on Friday the U.S. Labor Department will announce March's nonfarm payrolls, with expectations for a 225,000-job spike, and the monthly unemployment rate, which is expected to remain at its current 3.6%. A hot jobs market has figured prominently in central bankers' contemplations about the ongoing strength of the economy, which historically leads to higher inflation readings.\n\nIn an interview with CoinDesk TV, Marc Chandler, Bannockburn Global Forex managing director and chief market strategist, said that \"the financial stress that we saw earlier this month is receding.\"\n\n\"This is allowing the market to focus on two things, which was before the banking stress,\" he said, adding a note of caution. \"One is that the labor market remains fairly robust. And inflation is too high for the Federal Reserve.\"\n\nBiggest Gainers\n\nAsset Ticker Returns DACS Sector XRP XRP +3.0% Currency Decentraland MANA +1.9% Entertainment\n\nBiggest Losers\n\nInsights\n\nA Banner Quarter for Decentralized-Focused Tokens\n\nA growing fear that centralized crypto infrastructure will be the target of U.S. regulators has driven tokens that provide decentralized alternatives to be some of the best performers this past quarter.\n\n(CoinMarketCap)\n\nCoinMarketCap data shows that tokens for protocols LidoDAO (LDO), dYdX (DYDX), and GMX (GMX) were some of the best performers over the last 90 days.\n\nLDO surged in February when the Securities and Exchange Commission (SEC) ordered Kraken to shut down its staking service and continued to rally when Coinbase’s CEO Brian Armstrong said a blanket staking ban was coming alongside a securities classification – a scarlet letter for any sort of crypto with U.S. exposure.\n\nAs for DYDX and GMX, the demise of FTX gave the market a renewed interest in decentralized derivatives exchanges.\n\n“FTX and [sister company] Alameda, as far as we know, were incredibly centralized, controlled by a single person. These things metastasize because of human error,” Dan Gunsberg, creator of Solana-based derivatives exchange Hxro, said to CoinDesk in December.\n\nLike staking, there’s also significant regulatory interest in derivatives. Binance was recently sued by the U.S. Commodity Futures Trading Commission (CFTC) and its derivatives trading desk was front-and-center in the suit. Traders are looking for decentralized alternatives, which they feel are beyond the big-guns of American regulators and outside the crypto war conflict zone.\n\nBut decentralized derivative exchanges also have their problems too. As CoinDesk recently reported, many are struggling with liquidity and a lack of available open interest means that they cannot sustain big orders. While not all decentralized derivative exchanges suffer from this problem, it does cast some doubt on how well the idea scales.\n\nWhile decentralization was a theme for the quarter’s best performers, the actual token that took first place was Conflux (CFX), up a whopping 1,622%, according to CoinMarketCap data.\n\nIt’s not entirely clear what’s driving such an outsized gain. Sure, Conflux’s Blockchain SIM card has attracted some interest from investors, but right now its all theoretical and still in a trial phase. On-chain data shows that the number of transactions on the CFX chain are lower than what they were a year ago.\n\nBut, this is crypto. And sometimes there’s not discernable data behind a token that pumps.\n\nImportant events\n\n9:00 a.m. HKT/SGT(1:00 UTC) Australia TD Securities Inflation (YoY/March)\n\n3:55 p.m. HKT/SGT(7:55 UTC) Germany S&P Global/BME Manufacturing PMI (March)\n\n10:00 p.m. HKT/SGT(14:00 UTC) United States ISM Manufacturing PMI (March)\n\nCoinDesk TV\n\nIn case you missed it, here is the most recent episode of \"First Mover\" on CoinDesk TV:\n\nBitcoin Slips as Fed's Preferred Inflation Gauge Rose 0.3% in February; What's Next for Binance?\n\nBitcoin (BTC) was hovering around $28,000 as the PCE price index increased 0.3 percent in February. Bannockburn Global Forex chief market strategist Marc Chandler shared his crypto markets analysis. Plus, DappRadar head of research and analytics Pedro Herrera discussed decentralized finance's performance and the rise of interest in Arbitrum in the first quarter.\n\nHeadlines\n\nArbitrum’s First Governance Proposal Turns Messy With $1B ARB Tokens at Stake: The Arbitrum Foundation would get to side-step community governance when issuing “special grants.”\n\nOver 7,000 Players Successfully Converged in Yuga Labs' Otherside Metaverse 'Second Trip': Thousands of non-fungible token holders joined the gamified experience last weekend, showing glimpses of what’s to come from the virtual world launching later this year.\n\nTUSD Stablecoin Daily Trading Volume Surpasses $1B After Binance Boost: The surge follows Binance’s decision a week ago to eliminate the zero-fee trading discount on the platform except for the BTC-TUSD pair.\n\nInvestors Pour Money Into Crypto Investments for 4th Straight Month: Assets under management for digital-asset products climbed to $13.4 billion in March, up 60% from their 2022 low in November, according to CryptoCompare.\n\nU.S. Government Sold $216M of Seized Silk Road Bitcoin This Month: The government will sell the remaining 41,490 BTC in four tranches this year."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vY3J5cHRvd2FsbGV0LmNvbS9hY2FkZW15L2hvdy10by1jYXNoLW91dC1iaXRjb2luLXRvLXlvdXItZGViaXQtY2FyZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "how to cash out bitcoin to Your Debit Card - CryptoWallet.com",
        "content": "So you’ve made it big in crypto, and it’s time to cash out! Or maybe you just want to start using your Bitcoin in your day-to-day life. Accessing and spending your funds may seem complicated but don’t worry! We’ll look at how you withdraw funds to your debit card and the best alternative available.\n\nHow Do You Spend Bitcoin?\n\nYou can spend Bitcoin in a few stores that accept payment in Bitcoin. However, most merchants only accept fiat. So you’ll need to convert your Bitcoin to cash. This is often done by converting Bitcoin to fiat at market price on a cryptocurrency exchange or similar crypto services.\n\nThen you’ll have to transfer it from the exchange to your bank account before spending it. It can take a couple of days. So it’s understandable you may want a speedier alternative.\n\nhow to cash out bitcoin: Transferring Bitcoin to a Bank Account\n\nMost bank accounts don’t support cryptocurrencies. You won’t be able to transfer your Bitcoin to your bank account without first converting it to fiat. You’ll need to sell your Bitcoin got cash on a crypto exchange, then transfer your cash to your bank account. Bank transfers and wire transfers may take a couple of days to clear.\n\nWhat You Should Know About Converting Bitcoin to Fiat\n\nYou’ll be able to convert Bitcoin or other crypto assets to fiat using a cryptocurrency exchange. If you hold crypto assets in your own wallet, you’ll have to connect it to the Bitcoin exchange or transfer it to a wallet on the exchange. You can do this by creating an account with the exchange.\n\nYou’ll have to pay a conversion fee too. This can vary hugely from platform to platform. Some exchanges also have hidden fees for cryptocurrency transactions or withdrawals.\n\nOnce your Bitcoin, Ethereum, or any other crypto is is converted to fiat currency, you’ll be able to use one of the supported withdrawal methods to access your cash balance.\n\nhow to cash out bitcoin: Can You Withdraw Bitcoin to a Debit Card?\n\nYou can withdraw Bitcoin to a debit card now that several platforms offer the option. You’ll have to check with your bank if your card supports the feature, and confirm that your within the daily limit for spending.\n\nhow to cash out bitcoin: Can You Withdraw Bitcoin to a Credit Card?\n\nYou can withdraw Bitcoin to a credit card on any platform that offers the option. You’ll have to check with your bank or card issuer if your card supports the feature.\n\nBenefits of Withdrawing Bitcoin to a Debit Card\n\nWithdrawing Bitcoin to a debit card saves you time and money. Usually, withdrawing to a bank account can take several days. If you withdraw to a debit card, you’ll be able to access your funds immediately. You’ll be able to use your card immediately for ATM withdrawals. You may also avoid extra bank fees, including withdrawal and transaction fees.\n\nGuide: How to Withdraw Bitcoin to Debit Card\n\nWith so many platforms and methods of accessing your funds, spending your Bitcoin using a debit card may seem complicated. We’re going to guide you through the entire process, from choosing a platform all the way to spending your hard-earned cash.\n\nSelect A Platform That Offers Debit Card Connection\n\nWhile withdrawing Bitcoin to a debit card is now offered through several platforms, not every exchange has this service. You’ll have to check if your chosen platform has this option.\n\nBinance is a popular platform that offers a Sell-to-Card feature. Trastra and Coinbase Card are two alternative exchanges supporting the feature. It’s worth shopping around to find the right platform for you. Be sure to check out the trading fees or other fees terms involved. Some platforms have a daily limit on the amount you can withdraw.\n\nOnce you’ve selected a trading platform, it’s time to create an account. You’ll be asked to go through a verification process, and you may have to conduct an initial transaction. Once you’ve completed the identity verification process, you’ll be able to add Bitcoin. You can do this either by purchasing some on the platform or moving it from another crypto wallet to the exchange.\n\nConnect Your Debit Card\n\nusually find the option to connect under your account’s Buy/Sell or Withdraw section.\n\nYou may be asked to make a minimum transfer to verify and connect the card. You may also need to confirm this on your bank’s mobile app as part of 2-Factor Authentication. So, be sure to have this on hand when trying to connect.\n\nConduct A Withdrawal Transaction\n\nNow that you have crypto to cash out and a card linked, you can initiate a withdrawal transaction. You can often find this under the Buy/Sell tab or Withdrawal tab.\n\nEnter the amount of Bitcoin you’d like to cash out, and if you’re happy with the exchange rate, you can hit Sell/Convert. Then choose a preferred method and select your linked debit card. Once you hit confirm, your newly converted fiat will be withdrawn to your linked card.\n\nSpend Your Funds\n\nThat’s it! You’ve done it, and it’s time to start spending. Happy shopping!\n\nOther Considerations\n\nWhile withdrawing to a debit card is one of the fastest methods, there are other factors to consider when choosing how to spend your Bitcoin. With other methods available, it’s crucial to include all elements when deciding.\n\nCard & Wallet Compatibility\n\nNot every card supports direct withdrawals. Many cards require you to transfer your fiat cash to your bank account before you can use the card. You’ll have to check if your card is a Visa Fast Funds or MasterCard Send card and if your bank supports the transaction. It also depends on which country you reside in. If unsure, you can contact your bank or debit card provider to find out more.\n\nMany exchanges also only support using their hosted crypto wallets. If you hold your assets in a self-custodial wallet (meaning you hold the keys), you may have to transfer your assets to the exchange. Many crypto traders are wary of moving their assets out of a digital wallet they have complete control over to an exchange where a third party holds the keys.\n\nFees\n\nEach platform will have its own fees, including a conversion fee or on crypto transactions. Always look closely at the exchange rate and fees when converting crypto into fiat currencies. Your bank may also charge a fee for credit card purchases or withdrawing to a card. Be sure to check for any hidden costs in the small print!\n\nWhich Currency Are You Using?\n\nDoes the exchange you’ve chosen support the cryptocurrency you want to spend? Some platforms only support a handful of major cryptocurrencies like Bitcoin, Ethereum, or Ripple, while others have a much broader range.\n\nOther Solutions: CryptoWallet.com Debit Card\n\nThe CryptoWallet.com crypto card launches in 2023 and is available for pre-order at the whitelist. The card supports over 800 cryptocurrencies, the most out of any card on the market, along with competitive fees and great rewards. Best of all, you can spend crypto directly with no conversion required!\n\nKey Features\n\nThe CryptoWallet.com bank card has some great features that make it an excellent alternative to withdrawing to a debit card. Not only do we support a vast range of cryptocurrencies, but you’ll also be able to connect your hardware or software wallet to the card, meaning you have complete control over your funds.\n\nShop anywhere\n\nOur card is accepted anywhere regular debit cards are accepted. You’ll be able to use the CryptoWallet.com crypto card online, in-store, and for ATM withdrawals.\n\nCrypto cashback\n\nNot only will using our CryptoWallet.com card be one of the easiest methods available, but you’ll also receive great rewards. We offer up to 5% cashback on any debit card purchases made using the CryptoWallet.com crypto card. It’s a fantastic way to receive rewards from your debit card payments. The card launches this year — join the whitelist now!\n\nContactless\n\nMake the spending process even easier with our upcoming contactless MasterCard card. Make crypto purchases in seconds by simply tapping the card.\n\nEasy to use\n\nWe’ve made it even easier to spend your cryptocurrency holdings. You can store your digital currencies on the platform or connect your non-custodial wallet to the platform. Our streamlined user interface makes converting crypto simple. Card deposits are as simple as topping up your crypto wallet online, and you can make either cash deposits to your bank or top up the card directly.\n\nLow fees\n\nThe CryptoWallet.com card charges just 0.8% for converting crypto to fiat.\n\nHow It Works\n\nRegister an account and join the whitelist for our upcoming card, and once your card has arrived, we’ll guide you through the entire process!\n\nYou can store your crypto on our platform or connect a hardware or software wallet. This enables you to spend thousands of cryptocurrencies, including Bitcoin and Ethereum. You can convert your preferred cryptocurrency and start using your card.\n\nWithdraw Bitcoin to Debit Card FAQs\n\nWe’re going to cover some common questions about Bitcoin debit cards. If you’d like to learn more about our crypto card or types of cryptocurrencies, check out our Academy.\n\nHow Do I Transfer Bitcoins to My Visa Card?\n\nYou can sell Bitcoins for cash on a crypto platform and then withdraw them to your linked Mastercard.\n\nHow Do I Cash Out Bitcoin to My Bank?\n\nYou can sell your Bitcoin for cash on an exchange or CryptoWallet. Then you can transfer your fiat to your bank account.\n\nCan I Transfer Bitcoin to a Prepaid Card?\n\nYes. We offer a prepaid debit card that you can transfer Bitcoin to and spend. You can top up your card online, and you don’t need to provide credit card details unless you’re using a credit card to buy more crypto for your account. You can spend Bitcoin or your favorite coins directly, with over 800 of your favorite coins to choose from.\n\n\n\nThe card launches in 2023 — order it by joining the whitelist here!"
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9jbGVhbnNwYXJrLXJlbGVhc2VzLW1hcmNoLTIwMjMtYml0Y29pbi0xMzAwMDA1OTUuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "CleanSpark Releases March 2023 Bitcoin Mining Update - Yahoo Finance",
        "content": "Company mines 598 bitcoin in the month; Ends the first quarter of the calendar year with 1,871 bitcoin mined, up 22% from the prior quarter; 50MW Washington expansion on schedule\n\nExpansion of CleanSpark's Washington, Georgia, Bitcoin Mining Campus is On Schedule\n\nImage of CleanSpark's bitcoin mining facility expansion, currently under construction, in Washington, GA.\n\nExpansion of CleanSpark's Washington, Georgia, Bitcoin Mining Campus is On Schedule\n\nImage of CleanSpark's bitcoin mining facility expansion, currently under construction, in Washington, GA.\n\nLAS VEGAS, April 03, 2023 (GLOBE NEWSWIRE) -- CleanSpark, Inc. (Nasdaq: CLSK), America’s Bitcoin Miner™, today released its unaudited bitcoin mining and operations update for the month ending March 31, 2023.\n\n“Our approach to proprietary mining gives us substantial control and flexibility over our destiny and the progress on our Washington expansion is a perfect example,” said Zach Bradford, CEO. “The 50MW expansion is on schedule. The machines have already been purchased and shipping is expected to commence this month. Once those machines are racked and the expansion is energized, our hashrate is expected to increase to about 8.7 EH/s, giving us substantial progress toward our calendar year-end goal of 16 EH/s.\n\n“In this environment, a miner that is not growing is falling behind. As hashrate grows, we also need to grow. Growth takes substantial capital, just as it does in any commodities-based business, especially in the scaling stage. As we scale, we intend to continue to use all capital levers available to us, including equity and bitcoin, carefully balancing both to provide the highest rate of return for our shareholders. We are making the most of the bear market so that we are in position to take full advantage of the next bull market once it inevitably emerges.”\n\nMarch Bitcoin Mining Update (unaudited)\n\nBitcoin mined in March: 598\n\nCY2023 bitcoin mined: 1,871\n\nTotal BTC holdings as of March 31: 196\n\nTotal BTC converted for operations and growth in March: 502\n\nCurrently deployed fleet of about 67,700 latest-generation bitcoin miners with a hashrate of 6.7 EH/s\n\nThe Company funded growth and operations through the sale of 502 bitcoins in March 2023 at an average of approximately $24,800 per BTC. Sales of BTC equated to proceeds of approximately $12.4 million. March daily BTC mined averaged 19.29 and reached a high of 20.25.\n\nStory continues\n\nOperational Update\n\nWashington Expansion. The Washington expansion is a passively cooled data center consisting of four primary buildings. Once fully complete, the expansion will hold about 15,000 Antminer S19j Pro+ machines. Total capacity in Washington is expected to be 86MW, the majority of which is sourced from low-carbon, on-grid energy. Building 1 is complete and ready for miners. Racks are currently being installed in Building 2. The foundation was recently poured for Building 3, while concrete deliveries are imminent for Building 4. Scott Garrison, vice president of business development, is leading the expansion.\n\n“We are on schedule in Washington,” said Garrison. “One building is completely done and ready for miners, with the other buildings in various stages of construction, each advancing according to schedule. Our teams and partners, which include the utility, city, and various construction firms, are working hand-in-hand for the build. I’m so proud of what we are accomplishing on the ground in Washington as we work to build some of the most efficient bitcoin mining infrastructure in North America.”\n\nAbout CleanSpark\n\nCleanSpark (Nasdaq: CLSK) is America’s Bitcoin Miner™. Since 2014, we’ve helped people achieve energy independence for their homes and businesses. In 2020, we transitioned that expertise to develop sustainable infrastructure for Bitcoin, an essential tool for financial independence and inclusion. We strive to leave the planet better than we found it by sourcing and investing in low-carbon energy, like wind, solar, nuclear, and hydro. We cultivate trust and transparency among our employees, the communities we operate in, and the people around the world who depend on Bitcoin. CleanSpark holds the 44th spot on the Financial Times' 2022 List of the 500 Fastest Growing Companies in the Americas and ranks thirteenth on Deloitte’s Fast 500. For more information about CleanSpark, please visit our website at www.cleanspark.com.\n\nForward-Looking Statements\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding expectations for expansion of the Company’s Washington, Georgia bitcoin mining facility, the resulting anticipated benefits to CleanSpark (including as to anticipated additions to CleanSpark’s hashrate and the timing thereof) and plans to expand the facility. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). All statements other than statements of historical facts contained in this press release may be forward-looking statements. In some cases, you can identify forward-looking statements by terms such as “may,” “will,” “should,” “expects,” “plans,” “anticipates,” “could,” “intends,” “targets,” “projects,” “contemplates,” “believes,” “estimates,” “forecasts,” “predicts,” “potential” or “continue” or the negative of these terms or other similar expressions. Forward-looking statements contained in this press release, but are not limited to statements regarding our future results of operations and financial position, industry and business trends, business strategy, expansion plans, market growth and our objectives for future operations.\n\nThe forward-looking statements in this press release are only predictions. We have based these forward-looking statements largely on our current expectations and projections about future events and financial trends that we believe may affect our business, financial condition and results of operations. Forward-looking statements involve known and unknown risks, uncertainties and other important factors that may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements, including, but not limited to: the anticipated timing of the expansion; the risk that the electrical power available to our facilities does not increase as expected; the success of its digital currency mining activities; the volatile and unpredictable cycles in the emerging and evolving industries in which we operate; increasing difficulty rates for bitcoin mining; bitcoin halving; new or additional governmental regulation; the anticipated delivery dates of new miners; the ability to successfully deploy new miners; the dependency on utility rate structures and government incentive programs; dependency on third-party power providers for expansion efforts; the expectations of future revenue growth may not be realized; and other risks described in the Company's prior press releases and in its filings with the Securities and Exchange Commission (SEC), including under the heading \"Risk Factors\" in the Company's Annual Report on Form 10-K and any subsequent filings with the SEC. The forward-looking statements in this press release are based upon information available to us as of the date of this press release, and while we believe such information forms a reasonable basis for such statements, such information may be limited or incomplete, and our statements should not be read to indicate that we have conducted an exhaustive inquiry into, or review of, all potentially available relevant information. These statements are inherently uncertain and investors are cautioned not to unduly rely upon these statements.\n\nYou should read this press release with the understanding that our actual future results, performance and achievements may be materially different from what we expect. We qualify all of our forward-looking statements by these cautionary statements. These forward-looking statements speak only as of the date of this press release. Except as required by applicable law, we do not plan to publicly update or revise any forward-looking statements contained in this press release, whether as a result of any new information, future events or otherwise.\n\nInvestor Relations Contact\n\nMatt Schultz\n\nir@cleanspark.com\n\nMedia Contacts\n\nIsaac Holyoak\n\npr@cleanspark.com\n\nBlocksBridge Consulting\n\nNishant Sharma\n\ncleanspark@blocksbridge.com\n\nAttachments\n\nCONTACT: Isaac Holyoak CleanSpark Inc. 702-989-7694 pr@cleanspark.com\n\n\n\n"
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vZW5nbGlzaC5lbHBhaXMuY29tL2Vjb25vbXktYW5kLWJ1c2luZXNzLzIwMjMtMDQtMDMvYml0Y29pbi1zb2Fycy1hbWlkLWJhbmtpbmctcGFuaWMuaHRtbNIBb2h0dHBzOi8vZW5nbGlzaC5lbHBhaXMuY29tL2Vjb25vbXktYW5kLWJ1c2luZXNzLzIwMjMtMDQtMDMvYml0Y29pbi1zb2Fycy1hbWlkLWJhbmtpbmctcGFuaWMuaHRtbD9vdXRwdXRUeXBlPWFtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin soars amid banking panic - EL PAÍS USA",
        "content": "The big winner so far this year is bitcoin — not stocks, gold or oil. In the first three months of 2023, it has jumped 70% in value. This rise has temporarily silenced critics who considered the cryptocurrency to be on its last legs after the chaos of 2022 — a year which saw the collapse of some of the main players in the crypto sector, including TerraLuna, Three Arrows Capital, Celsius, Voyager and FTX. But market sentiment has since turned around. And after recording constant falls and suffering from the rise in interest rates in the U.S., the cryptocurrency seems to have turned a corner. Bitcoin climbed to $28,000 last week, well above its record low of $15,700, which it recorded in November. The entire crypto universe is currently worth €1.1 trillion ($1.2 trillion).\n\nSome analysts believe crypto’s rebound is due to the banking panic in March, sparked by the collapse of Silicon Valley Bank and the Credit Suisse takeover by UBS, its main competitor. “Concerns about the centralized banking system increased confidence in decentralized cryptocurrencies, and risk assets were boosted by prospects for a faster fall in inflation and interest rates,” argues Ben Laidler, a global market strategist at the investment platform eToro.\n\nMore information Crypto evangelists enter the Bukele government: The dark business of bitcoin in El Salvador\n\nOne of the side effects of the banking panic was that the U.S. Federal Reserve raised interest rates by 25 basis points, instead of the expected 50. Some investors interpreted this decision as a sign to return to the most volatile investments that promise the greatest returns, but come with the greatest risk.\n\nThe crypto community has welcomed this latest blow to financial institutions, considering it payback. For crypto investors, the banking panic in the U.S. and Europe confirms their belief that, in the future, all financial intermediaries will be gone and there will be a decentralized system, in which everyone can move their money without the need for banks.\n\nIn the wake of the panic, many crypto supporters took to social media to revel in the turn of events. “I am old enough to remember when the Credit Suisse CEO said Bitcoin is a bubble. Bitcoin was $7,000 then. Bitcoin is now $28,000. Meanwhile, Credit Suisse is getting acquired by a competitor and being bailed out by central banks,” Gabor Gurbacs, the CEO of PointsVilleApp, posted on Twitter.\n\nKoh Onozawa, co-CEO of the cryptocurrency trading platform Bit2Me, attributes the rise in bitcoin to other factors. “Adoption is growing,” he told EL PAÍS, pointing out that large companies such as Mastercard and Visa have created their own Web3 department, while certain neobanks, such as Revolut, are making cryptocurrency available to their customers. “With the fall of bad apples, it is more important than ever to use regulated entities,” he said.\n\nBut there is an obstacle threatening to halt the rise of cryptocurrencies: the legal woes of Binance, the world’s largest crypto exchange. Binance and its founder Changpeng Zhao are being sued by the Commodity Futures Trading Commission (CFTC) for numerous alleged violations of the Commodity Exchange Act and CFTC regulations. For example, Binance did not require customers to provide any identity-verifying information. It also communicated with U.S. customers using a messaging platform that automatically deleted written communications, according to the news agency AP.\n\nThe market is now at a turning point. Some investors may opt to collect on their gains, given the uncertain economic context and growing fears of a U.S. recession. They may take a break and wait to see if cryptocurrencies continue on an upward trend. Other investors, however, may hang in rather than sell at a loss. Bitcoin is still worth half what it was in November 2021, when it peaked at $69,000. For those who bought bitcoin at that moment, selling now would mean remaining in the red.\n\nIn addition to recovering economically, cryptocurrencies are also hoping to restore lost confidence. The inflation crisis showed that investing in bitcoin — contrary to the claims of its supporters — was not a way to safeguard against rising prices. Now, the crypto community has come back with another argument: that the digital currency is a safe investment given the current problems facing the banking system.\n\nSign up for our weekly newsletter to get more English-language news coverage from EL PAÍS USA Edition"
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaXRjb2luLXRoZXNpcy1iZWNvbWVzLWFtYXpvbi1iZXN0LTIzNDQ0MDQ5My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Thesis Becomes Amazon Best Seller - Yahoo Finance",
        "content": "For many readers, a graduate thesis doesn’t sound like a page-turner, but a lengthy academic paper on Bitcoin written by a U.S. Space Force major has emerged as a popular pick on Amazon.\n\n“Softwar” asserts that Bitcoin has the potential to play a major role on the world’s geopolitical stage as a military-grade solution for securing information—far different than the monetary use Bitcoin’s network has today.\n\nWritten by Jason Lowery, the report represents the culmination of academic research he conducted at the Massachusetts Institute of Technology during a 6-month fellowship sponsored by the Department of Defense. The full title of the piece is “Softwar: A Novel Theory on Power Projection and the National Strategic Significance of Bitcoin.”\n\nLowrey's brief biography on Amazon claims that he has advised several senior U.S. officials on Bitcoin-related policy in offices related to the president, Secretary of Defense, and the Joint Chiefs of Staff.\n\nThough “Softwar” doesn’t place within the top 500 books on Amazon’s store, Lowery’s exploration of Bitcoin has hovered around the number one spot in Amazon’s digital currencies category and is currently ranked second in both books on technology and engineering.\n\nDARPA Is Bankrolling Research Into Crypto and National Security\n\nThe more than 350-page tome draws on knowledge from various fields, such as anthropology and computer science, to establish and explore Lowery’s “Power Projection Theory.”\n\nEssentially, Lowery posits that the proof-of-work system underlying Bitcoin transaction verification can be leveraged by military powers to impose restrictions on bad actors in a non-lethal through a steep amount of physical work in the form of crunching numbers.\n\n“The bottom line is that Bitcoin could represent a ‘softwar’ or electro cyber-defense protocol, not merely a peer-to-peer electronic cash system,” the book states. “While most software can only logically constrain computers, Bitcoin can physically constrain computers.”\n\nStory continues\n\nThe book’s acknowledgments section gives a nod to some of Bitcoin’s most faithful, including MicroStrategy’s Michael Saylor and Peter McCormack.\n\nIn his paper, Lowrey also writes that insufficient reserves of Bitcoin held on behalf of the U.S. government could pose a threat to the nation’s national security if the network becomes utilized as a cyber-security tool.\n\n“If the U.S. does not consider stockpiling strategic Bitcoin reserves, or at the very least encouraging Bitcoin adoption,” he said, “The U.S. could forfeit a strategically vital power [...] and set itself back in global power dominance.”\n\nCoin Center Says RESTRICT Act Could Be Used to Ban Bitcoin\n\nGiven that Lowrey’s thesis was published in February and the U.S. announced that it sold $215 million in seized Bitcoin last month, perhaps not every Fed is on the same page.\n\nThe book also includes a disclosure that states the paper is not reflective of any official position held by the DoD, Air Force, or MIT.\n\nOut of the more than 200 ratings “Softwar” has received on Amazon, a majority gave the book five stars.\n\nBut a few reviews say that Lowrey’s text is lacking due to “too much wishful thinking,” “arguments based on opinion,” and quotes from “The Matrix” that “detract from the seriousness of the topic.”"
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL3d3dy5jb2luZGVzay5jb20vY29uc2Vuc3VzLW1hZ2F6aW5lLzIwMjMvMDQvMDMvc2VuLXdhcnJlbnMtYW50aS1jcnlwdG8tYXJteS1pcy1qdXN0LXRoZS1iZWdpbm5pbmctb2YtY3J5cHRvcy1wb2xpdGljaXphdGlvbi_SAYgBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA0LzAzL3Nlbi13YXJyZW5zLWFudGktY3J5cHRvLWFybXktaXMtanVzdC10aGUtYmVnaW5uaW5nLW9mLWNyeXB0b3MtcG9saXRpY2l6YXRpb24vYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Sen. Warren’s ‘Anti-Crypto Army’ Is Just the Beginning of Crypto’s Politicization - CoinDesk",
        "content": "When it comes to bitcoin and crypto in the context of the current trouble in the banking industry, there is another battle line forming, although it’s a bit more hazy than the CBDC line. As banks have failed, Bitcoin has emerged as a potential avenue to opt out of the current system, which was spurred on by the Federal Reserve’s mismanagement of the economy."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXR1cm5zLTI4ay10by1zdXBwb3J0LW9wZW5pbmctdGhlLWRvb3ItZm9yLWV0aC1tYXRpYy1oYmFyLWFuZC1lb3MtdG8tYnJlYWtvdXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin price turns $28K to support, opening the door for ETH, MATIC, HBAR and EOS to breakout - Cointelegraph",
        "content": "The market witnessed a major banking crisis in March as Silicon Valley Bank and Signature Bank failed and Silvergate Bank entered liquidation as a result of dire financial distress. In Europe, the government brokered a forced takeover of Credit Suisse by UBS. Still, the United States equities markets and the European stock markets closed the month on a positive note.\n\nThe cryptocurrency market was also shaken by volatility, but Bitcoin (BTC) gained about 23% in March. Going forward, the picture looks encouraging for Bitcoin bulls in April and data from Coinglass suggests that the month has largely favored the buyers.\n\nCrypto market data daily view. Source: Coin360\n\nAlthough altcoins reacted positively to Bitcoin’s rise, the rally has not been equal across the board. This suggests that market participants have been selective in their purchases. As a result, traders might focus on the movers rather than the laggards.\n\nLet’s study the charts of five cryptocurrencies that look positive in the near term. If they break above their resistance levels, they may offer short-term trading opportunities.\n\nBitcoin price analysis\n\nBitcoin is facing stiff resistance at the $29,000 level but the bulls have not allowed the price to lose ground. This suggests that the bulls are being patient, anticipating a move higher.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe 20-day exponential moving average ($27,012) is trending up and the relative strength index (RSI) is above 61, indicating that the buyers are in control. The bullish momentum is likely to pick up after buyers overcome the obstacle at $29,200. That could start a rally to $30,000 and subsequently to $32,500.\n\nConversely, if the price turns down sharply from the current level, it will suggest that the short-term traders are selling. The BTC/USDT pair may slump to the 20-day EMA, which is an important level to keep an eye on.\n\nIf this support gives way, the pair could slide to the breakout level of $25,250. This is a make-or-break level for the pair because if it collapses, the selling could intensify and the decline could extend to the 200-day simple moving average ($20,424).\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nBuyers pushed the price above the overhead resistance at $28,868 but could not sustain the higher levels. This suggests that bears are trying to keep the price below $28,868. If bears sustain the price below the 20-EMA, the pair may start its fall toward $27,500 and then to $26,500.\n\nOn the upside, a break and close above $28,868 will indicate that the bulls have overpowered the bears. That could signal the start of the next leg of the up-move. The target objective from the break above the $26,500 to $28,868 range is $31,236.\n\nEther price analysis\n\nEther (ETH) turned down from the overhead resistance of $1,857 on April 1 but the bulls are not giving up much ground. This suggests that the buyers are not rushing to the exit.\n\nETH/USDT daily chart. Source: TradingView\n\nThe upsloping 20-day EMA ($1,748) and the RSI in the positive area suggest that the path of least resistance is to the upside. If bulls drive the price above $1,857, the ETH/USDT pair may make a dash to the psychologically important level of $2,000.\n\nThe bears are likely to mount a strong defense at this level but if bulls overcome this barrier, the next stop could be $2,200. This positive view will invalidate in the near term if the price plunges below the 20-day EMA and the horizontal support at $1,680.\n\nETH/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the pair turned down from the overhead resistance of $1,857, and the bears pulled the price below the 20-EMA. This suggests that the short-term bulls may be closing their positions. The pair could next fall to $1,743 and thereafter to $1,680.\n\nContrarily, if the price turns up and rises back above the 20-EMA, it will suggest that the break may have been a bear trap. A strong bounce off the current level could enhance the prospects of a rally above the overhead resistance.\n\nPolygon price analysis\n\nPolygon (MATIC) has been trading near the 20-day EMA ($1.11) for the past few days. Generally, a tight consolidation near an overhead resistance resolves to the upside.\n\nMATIC/USDT daily chart. Source: TradingView\n\nIf buyers thrust the price above the 20-day EMA, the MATIC/USDT pair will attempt a rally to $1.25 and thereafter to $1.30. The bears are expected to guard this zone vigorously because if they fail, the pair could soar to $1.57.\n\nAlternatively, if the price turns down from the current level and breaks below $1.05, it will suggest that the bears are back in the driver’s seat. The pair may then fall to the 200-day simple moving average (SMA) of $0.97, which is an important level to watch out for. If this support cracks, the pair may plummet toward $0.69.\n\nMATIC/USDT 4-hour chart. Source: TradingView\n\nThe bears are trying to sustain the price below the 20-EMA. If they succeed, the pair could skid to $1.05 and then to $1.02. This is an important zone for the bulls to defend because if it gives way, the pair may continue its downward move to $0.94.\n\nOn the other hand, if the price turns up from the current level, it will suggest that every minor dip is being purchased. That will increase the likelihood of a break above the minor resistance at $1.15. The pair may then ascend to $1.25.\n\nRelated: Bitcoin copying 'familiar' price trend in 2023, two more metrics show\n\nHedera price analysis\n\nBuyers foiled several attempts by the bears to sink and sustain Hedera (HBAR) below the 200-day SMA ($0.06) between March 9 to 28.\n\nHBAR/USDT daily chart. Source: TradingView\n\nThe 20-day EMA ($0.06) has started to turn up and the RSI is in the positive territory, indicating that buyers have the upper hand. The HBAR/USDT pair is likely to continue its northward march to the $0.10 to $0.11 resistance zone. Sellers are likely to defend this zone with all their might but if buyers bulldoze their way through, the pair may start a new uptrend.\n\nContrary to this assumption, if the price turns down and breaks below the 20-day EMA, it will suggest that bears are selling on relief rallies. The pair may then retest the crucial support at the 200-day SMA. A break below this level will open the doors for a possible drop to $0.04.\n\nHBAR/USDT 4-hour chart. Source: TradingView\n\nThe bulls started a strong recovery from the support near $0.06 but the relief rally is facing strong resistance in the zone between the 50% Fibonacci retracement level of $0.07 and the 61.8% retracement level of $0.08.\n\nOn the downside, the bulls are trying to defend the support at the 20-EMA. If the price rebounds off it, the pair may rally to $0.09 and then to $0.10. Conversely, if the price plummets below the 20-EMA, it will suggest that bears are still in the game. The pair could then descend to the support near $0.06.\n\nEOS price analysis\n\nEOS (EOS) is trying to complete a bullish cup and handle formation. Buyers pushed the price above the 20-day EMA ($1.15) on March 29, starting a comeback.\n\nEOS/USDT daily chart. Source: TradingView\n\nThe 20-day EMA has started to turn up gradually and the RSI is in the positive territory, indicating a minor advantage to the bulls. The ETH/USDT pair is likely to rise to the overhead resistance zone between $1.26 and $1.34.\n\nSellers are likely to defend this zone aggressively but if bulls overpower the bears, the pair may start a new uptrend. The pattern target of the reversal setup is $1.74.\n\nOn the contrary, if the price turns down from the overhead zone, it will indicate that bears are selling on rallies. The pair could then slide to the 20-day EMA and later to the 200-day SMA ($1.05). A break below this level will suggest that the bears are back in command.\n\nEOS/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bears are protecting the $1.22 level with vigor but a minor positive is that the bulls have not allowed the price to dip below the 20-EMA. This shows strong demand at lower levels.\n\nThe upsloping 20-EMA and the RSI in the positive territory indicate that bulls have a slight edge. If buyers propel the price above $1.22, the pair could rise to $1.26 and thereafter to $1.34.\n\nContrarily, if the price slumps below the 20-EMA, it will suggest that short-term traders may be booking profits. The pair could then drop to $1.14 and later to $1.06.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW9yZGluYWxzLWRhaWx5LWluc2NyaXB0aW9ucy1zdXJnZS1kdWUtdG8tYnJjLTIwLXRva2Vuc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Ordinals daily inscriptions surge due to 'BRC-20 tokens' - Cointelegraph",
        "content": "A new daily all-time high has been recorded for the number of Ordinals inscribed on the Bitcoin (BTC) network due to a recently launched “token standard” for the blockchain.\n\nBitcoin Ordinals reached 58,179 inscriptions on April 2, smashing the previous all-time high of 31,692 on March 9 by 83.5%, according to Dune Analytics data.\n\nThe surge is believed to be driven by the recent creation of “Bitcoin Request for Comment” (BRC-20) tokens on the Ordinals protocol by a pseudonymous on-chain analyst named Domo in early March.\n\nDaily count of Ordinals inscriptions shown in green. Source: Dune Analytics\n\nWhile Ordinals are nonfungible token (NFT)-like “digital artifacts” which carry data in the form of text, JPEG images, PDFs, video and audio formats on the Bitcoin network, the BRC-20 token standard utilizes Ordinal inscriptions to deploy token contracts, mint tokens, and transfer tokens — similar to Ethereum’s ERC-20 token standard.\n\nYes. The spike has been primarily caused by the uptick in interest around BRC-20. — Leonidas.og (@LeonidasNFT) April 2, 2023\n\nThe arrival of Ordinals and BRC-20 tokens on Bitcoin were enabled by the Taproot soft fork, which took effect on Nov. 14, 2021.\n\nOver 55,000 of the inscriptions on April 2 came in the form of text-based Ordinals, many of which were represented by BRC-20 tokens, according to “Leonidis.og,” the host of an Ordinals-focused podcast.\n\nBRC-20 tokens — which are categorized as text-based Ordinals — are the most commonly inscribed Ordinal on Bitcoin. Source: Dune Analytics.\n\nLeonidis explained in a tweet that the spike on April 2 came on the back of new tools used to interact with BRC-20 tokens launched in the last few days.\n\n“There was a lot of excitement around BRC-20 when it launched a month ago but eventually the hyped died down. During the lull, devs built tools to make interacting with BRC-20 much easier and now we're seeing ATH interest. I've said it before and I will say it again. UX matters!”\n\nAmong those new tools include Ord.io, UniSat Wallet and BRC-20.io. According to BRC-20.io, 1,600 tokens have been created since the BRC-20 standard was created.\n\nAmong the most popular BRC-20 tokens include “pepe,” “ordi,” and “punk,” currently boasting respective market caps of $2.5 million, $2.1 million and $900,000.\n\nRelated: Bitcoin Ordinals creator looks for fix after first instance of shock porn\n\nOver 42,700 BRC–20 tokens have been minted in the last 24 hours, mostly coming from the tokens wzrd, domo, BAYC, meme and pups.\n\nBitcoin tokens, through the BRC-20 standard, can now be bought and sold on marketplaces, similar to Ethereum ERC-20 tokens. Source: BRC-20.io\n\nWhile the market cap of BRC-20 tokens currently sits at less than $10 million, digital asset investment firm Galaxy Digital believes the “Bitcoin NFT” market may reach $4.5 billion by 2025.\n\nMembers of the Bitcoin community are still split on whether Ordinals is a good fit for the Bitcoin ecosystem. Proponents such as Dan Held suggest it offers more financial use cases on Bitcoin, while others say it’s straying away from Satoshi Nakamoto’s vision of Bitcoin as a peer-to-peer cash system.\n\nMagazine: 4 out of 10 NFT sales are fake: Learn to spot the signs of wash trading"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtdGFyZ2V0cy1maXgtb24tMzVrLWFzLWJpdGNvaW4tZXllcy1tYXNzaXZlLWxpcXVpZGl0eS1zcXVlZXpl0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "BTC price targets fix on $35K as Bitcoin eyes 'massive' liquidity squeeze - Cointelegraph",
        "content": "Bitcoin (BTC) stayed on course for its highest weekly close in ten months on April 2 as $28,000 held.\n\nBTC/USD 1-week candle chart (Bitstamp). Source: TradingView\n\nBTC price analyst: “Massive” liquidations due at $30,000\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD stable over the weekend after closing out March at near $28,500.\n\nA key point of resistance from earlier in its current halving cycle, the current trading zone represents a major hurdle for bulls to overcome. Should they manage it, price targets extend beyond the $30,000 mark.\n\nNot an expert on classical chart patterns but if we can fit the current structure in it, that gives a minimum price target of 35000$ for #Bitcoin\n\n\n\nAlso a nice confluence of a break above the high at 32,5K where a lot of stops are sitting to create a possible deviation above … pic.twitter.com/xTAz6yVgO7 — JACKIS (@i_am_jackis) March 30, 2023\n\n“Bitcoin has been consolidating below the biggest resistance/support of the last 2+ years,” analyst Matthew Hyland summarized in his latest tweet on BTC.\n\n“A whole new ballgame if BTC breaks it. NASDAQ & S&P went strong into weekly close. Still major pessimism and disbelief while major milestones are close to being made for Stocks/BTC.”\n\nPopular Twitter account Byzantine General predicted that a breakthrough of resistance immediately above the spot price would result in a sea of liquidations, leading to further upward momentum.\n\n“It feels like some bear is very desperately trying to defend the 29k to 30k region,” a tweet stated on the day.\n\n“I think that when this level breaks massive liqs will come in. And it does feel like a matter of ‘when’ not ‘if’ because there’s zero froth in the market, only some spot supply.“\n\nRelated: US enforcement agencies are turning up the heat on crypto-related crime\n\nAn accompanying chart showed the Binance BTC/USDT order book with bid and ask liquidity concentrations by price level.\n\nBTC/USD order book data (Binance). Source: Byzantine General/Twitter\n\nOn shorter timeframes, however, traders were content to wait for the weekly close to cement prior gains.\n\n“Ranging this weekend it seems on the corn, and for continuation the bulls want to reclaim the range high at $28,750. Until the we chill,” Crypto Tony tweeted on the day.\n\nBTC/USD annotated chart. Source: Crypto Tony/ Twitter\n\nOthers were more pessimistic, among them trading resource Stockmoney Lizards, which described a correction as “very likely” before BTC/USD hits $30,000.\n\n#Bitcoin\n\n\n\nlike in February, we now see a bearish divergence. Correction still very likely before we approach 30k. pic.twitter.com/atXM2aiBqa — Stockmoney Lizards (@StockmoneyL) April 2, 2023\n\nBitcoin bulls add another 23% in March\n\nLast month nonetheless, managed to crown itself one of Bitcoin’s best March months.\n\nRelated: Bitcoin price hits $28.5K on PCE data as macro ‘accumulation zone’ ends\n\nAccording to data from Coinglass, 23% gains for BTC/USD almost match its 2021 performance, with 2013 remaining its most volatile.\n\nBTC/USD monthly returns chart (screenshot). Source: Coinglass\n\nBitcoin’s trajectory mimics both years, seeing at least three months “in the green” before significant consolidation began.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWNvcHlpbmctZmFtaWxpYXItcHJpY2UtdHJlbmQtaW4tMjAyMy10d28tbW9yZS1tZXRyaWNzLXNob3fSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin copying 'familiar' price trend in 2023, two more metrics show - Cointelegraph",
        "content": "Bitcoin (BTC) is on the road to a new bull market and should deliver serious returns in the process, fresh analysis reveals.\n\nIn a tweet on April 2, Charles Edwards, founder of Bitcoin and digital asset hedge fund Capriole Investments, flagged a “familiar” bull signal on the SLRV Ribbons metric.\n\nEdwards: SLRV beginning “new trend”\n\nSLRV Ribbons is a tool for measuring potential Bitcoin profitability. Put forward by Capriole in 2022, it is based on the Short-to-Long-term Realized Value (SLRV) Ratio from well-known analyst David Puell.\n\nThe SLRV Ratio takes the percentage of the BTC supply active in the last 24 hours and compares it to that last active six to 12 months ago. The result shows how comparatively active short-term supply and long-term supply are at a given point.\n\nFrom this, an investor can gain an insight into both sentiment and likely price trajectory, but over time, such supply values may change, Edwards argues.\n\nRelated: Crypto winter can take a toll on hodlers’ mental health\n\nSLRV Ribbons attempts to address this by analyzing the interplay between two moving averages. When its short-term 30-day MA crosses over the long-term 150-day MA, Bitcoin is at the start of a bullish phase.\n\nThe metric “is about as simple as gets” when it comes to reliable Bitcoin analytics tools, Edwards explained in an introductory blog post, and is currently repeating classic bullish behavior with a crossover taking place in early 2023.\n\n“A new trend in SLRV ribbons, and it looks familiar,” he summarized.\n\nBitcoin SLRV Ribbons annotated chart. Source: Charles Edwards/ Twitter\n\nWhile relatively new, Edwards added that SLRV Ribbons had been backtested to show both its reliability and capability to improve BTC investment returns versus buying and holding.\n\nBitcoin is still “cheap”\n\nSLRV is not the only Bitcoin metric giving Edwards a sense of deja vu this month.\n\nRelated: BTC price targets fix on $35K as Bitcoin eyes ‘massive’ liquidity squeeze\n\nThe Bitcoin Yardstick, previously covered by Cointelegraph, reveals a recovery in Bitcoin market cap versus hash rate but still classifies BTC as “cheap” at current prices.\n\n“The Bitcoin Yardstick is painting a very familiar signature to the 2019 lows,” Edwards commented on March 31.\n\nAfter exiting the “cheap” zone early that year, BTC/USD then only saw one brief return during the March 2020 COVID-19 cross-market crash.\n\nBitcoin Yardstick chart. Source: Charles Edwards/Twitter\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 31,
        "url": "https://news.google.com/rss/articles/CBMie2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9wb3RlbnRpYWwtZmVkLXBpdm90LWhhcy1jcnlwdG8tYW5kLW1hY3JvLWFuYWx5c3RzLXVsdHJhLWJ1bGxpc2gtb24tYml0Y29pbi1zLXByaWNlLXByb3NwZWN0c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Potential Fed pivot has crypto and macro analysts ultra-bullish on Bitcoin's price prospects - Cointelegraph",
        "content": "The United States Federal Reserve began its most aggressive quantitative tightening efforts in March 2022, raising benchmark interest rates in the year since from near-zero to 4.75% to 5% annually. While the central bank has successfully brought down inflation to some degree, the increasing interest rates are starting to cause cracks in the global banking industry.\n\nThe market expects the Fed to end quantitative tightening and provide favorable liquidity conditions to avoid a global financial crisis as the banks begin to fail. The shift in the Fed’s policy should have significant implications for financial assets.\n\nJurrien Timmer, the director of global macro at Fidelity, discussed the likely impact of the Fed’s dovish pivot on stocks, gold and Bitcoin.\n\nMarket expects the Fed to put an end to interest rate hikes\n\nThe Fed is largely expected to either maintain the interest rates at current levels or start cutting rates. CME’s FedWatch Tool shows that the market is currently placing a 50% chance that the March 25 basis point hike was the last one for a while.\n\nCME FedWatch Tool as of March 30. Source: CME\n\nIf the Fed stops its rate hikes, risk assets like equities can experience a positive rally based on historical data. The average one-year return in the S&P 500 index after the last rate hike since 1984 has been 18.9%.\n\nPost-rate pause rallies in the S&P 500 index since 1984.\n\nTimmer also recently noted in a tweet that “The last hike is often (but not always) quickly followed by a cut.”\n\nA rate cut would make credit cheaper across companies and individuals, improving the market's liquidity. Low-interest regimes are often associated with bull runs in risk assets like stocks and crypto.\n\nThe last hike is often (but not always) quickly followed by a cut. pic.twitter.com/08czI2C6lq — Jurrien Timmer (@TimmerFidelity) March 27, 2023\n\nHowever, Timmer mentioned it is a “bullish development for stocks (lower cost of capital). But historically, the final Fed tightening produces anything but a clear-cut direction for stocks.” There have been instances where the stocks have maintained bearish trends for a couple of years before trend reversals.\n\nIf the Fed is done raising rates and takes a dovish pivot soon, as many expect, it could be a bullish development for stocks (lower cost of capital). But historically, the final Fed tightening produces anything but a clear-cut direction for stocks. Careful what you wish for. pic.twitter.com/xQw6WfcTjR — Jurrien Timmer (@TimmerFidelity) March 30, 2023\n\nBitcoin and gold move in lockstep\n\nHowever, the implications for gold and, by extension, for Bitcoin are largely bullish. If the Fed plans to start lowering interest rates and the inflation levels stay elevated, it leads to negative real interest for investors. The earning rate is less than the inflation rate and is, therefore, repressive. Financial repression works more smoothly than raising taxes or cutting spending, but it brings losses for bondholders.\n\nTechnically, gold staged a bullish breakout above the previous peak in 2023, around $1,950. This level also formed a long-term resistance to gold prices, signaling active buyer interest.\n\nTimmer added, “When you get all three (negative real rates and positive price and monetary inflation), it’s a bullish trifecta for gold.”\n\nRelated: Is a housing crisis underway? Why crypto investors should care\n\nThe latest Bitcoin rally has seen a rising correlation with gold and a dip in its correlation with the S&P 500 index. Bitcoin and gold are moving in lockstep with a correlation coefficient value of one compared to a low proportional relation of 0.13 with the S&P 500 index.\n\nCorrelation coefficient of Bitcoin-gold (top), and Bitcoin-S&P 500 index (bottom). Source: TradingView\n\nBitcoin is benefiting from the narrative around a potential global banking crisis, strengthening its position as a non-correlated asset like gold. The BTC/USD pair’s positive breakout above $28,000 alongside gold further shows that buying activity is rising.\n\nThus, if the U.S. Fed pivots from the hawkish rate hike regime to a dovish stance, it could create bullish conditions for the market.\n\nWhile the outcome for stock markets hangs in the balance due to inflation risks, gold is expected to shine in the medium term. Given the positive correlation with gold, Bitcoin may also benefit from the macroeconomic setting.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWxpcXVpZGl0eS1kcm9wcy10by0xMC1tb250aC1sb3ctYW1pZC11cy1iYW5rLXJ1btIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin liquidity drops to 10-month low amid US bank run - Cointelegraph",
        "content": "Bitcoin (BTC) market liquidity has dropped to a 10-month low, despite a bullish quarter in terms of price gain. The liquidity dry-up is partly attributed to the bank run in the United States and the ongoing regulatory actions against crypto companies.\n\nThe liquidity situation in crypto is worsening after the banking fears this month\n\n\n\nI dived into several liquidity metrics to give an update on all things crypto liquidity\n\n\n\nFirst, $BTC liquidity has dropped to 10 month lows as market makers lose access to USD payment rails pic.twitter.com/RwcBEJ8y5Z — Conor Ryder (@ConorRyder) March 23, 2023\n\nBTC’s price has registered a 45% surge in 2023, making it one of the best-performing assets. The price gains come amid a looming financial crisis in the traditional financial market, with stocks and bonds seeing one of their worst years. As the financial crisis has worsened, several banks have collapsed.\n\nThe banking crisis has also directly impacted the crypto ecosystem. The collapse of crypto-friendly banks, such as Silicon Valley Bank and Signature Bank, removed important U.S. dollar payment rails for crypto, leading to a liquidity crisis, especially on U.S. exchanges.\n\nLiquidity on U.S. vs. non-U.S. exchanges. Source: Kaiko\n\nThe crunch in liquidity has also led to increased price volatility forcing traders to pay more fees in slippage. Slippage refers to the price difference between the expected price of a transaction and the price at which it’s fully executed. For a $100,000 sell order, the slippage for the BTC/USD pair on Coinbase climbed by 2.5 times at the beginning of March. During the same time frame, Binance’s BTC/USDT pair’s slippage barely moved.\n\nUSD vs. USDT price slippage. Source: Kaiko\n\nThe liquidity crunch has also led to higher price volatility on U.S. exchanges, where the price discrepancy between BTC and U.S. dollar pairs has increased drastically compared with non-U.S. exchanges. For example, the price of BTC on Binance.US is more volatile than the average price across 10 other exchanges.\n\nBinance.US price difference vs. 10 exchanges. Source: Kaiko\n\nConor Ryder, research head of on-chain data analytics firm Kaiko, explained the drastic impact of the liquidity crisis on traders and the market. He noted that stablecoins are replacing U.S. dollar pairs, and although it lessens the impact of U.S. banking troubles, it has an adverse effect on liquidity in the United States. He added that it would indirectly harm investors there."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9jcnlwdG9jdXJyZW5jaWVzL25ld3MvdGhpcy1pcy13aGF0LWRlZG9sbGFyaXphdGlvbi13b3VsZC1kby10by1iaXRjb2luLTIwMjMwNDAzMTM0NtIBcGh0dHBzOi8vd3d3LmZ4c3RyZWV0LmNvbS9hbXAvY3J5cHRvY3VycmVuY2llcy9uZXdzL3RoaXMtaXMtd2hhdC1kZWRvbGxhcml6YXRpb24td291bGQtZG8tdG8tYml0Y29pbi0yMDIzMDQwMzEzNDY?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "This is what dedollarization would do to Bitcoin - FXStreet",
        "content": "Share:\n\nThe recent banking crisis dissipated the trust in USD, further fueling the long ongoing dedollarization discourse.\n\nBRICS looking into potentially developing their own rare earth metal-backed currency could decrease global economic dependency on the Dollar.\n\nBitcoin has been regaining its “safe haven” status, and dedollarization could escalate this narrative.\n\nDedollarization is a concept that has been around for a long time now but has only begun taking shape over the last few years. While Crypto was built to be a global currency, independent from other currencies, the devaluation of the US Dollar (USD) might play in its favor, making its aim a reality.\n\nDedollarization: What it is and how it matters\n\nDedollarization is the devaluation faced by the USD due to other currencies taking its place as the world’s reserve currency used for trading Oil and other commodities. The eroding trust in banks and the Federal Reserve is driving countries away from the US Dollar, pushing them to use their own currencies instead. This discussion is heating up more at the moment due to the recent macroeconomic developments.\n\nUSD is becoming weaker by the day as rising inflation and declining geopolitical relations have sent people looking into other options. Many countries, for the same reason, have pulled away from using the Dollar for bilateral trades and have shifted towards their own currencies. China is the biggest country when it comes to using its national currency for trade, as it already has agreements with Australia, Russia, Japan, Brazil, and Iran.\n\nRecently BRICS member Russia’s Deputy Chairman of the State Duma Alexander Babakov also stated that the member countries could create their own currency backed not by gold but land and rare earth metals. Adding to the possibility, Babakov said,\n\n“Most likely, this will be done…Neither the Euro nor the Dollar is backed by anything, and our countries can do what was destroyed by the Bretton Woods system.”\n\nThis could result in USD losing its presence from a major chunk of the global economic activity, further weakening its strength as the use of the likes of the Chinese Yuan could see an increase in settling transactions between countries.\n\nHowever, apart from the Yuan, the weakening of the USD could also act as a boost for cryptocurrencies.\n\nHow Crypto stands to benefit from dedollarization\n\nAt the moment, the USD is the world’s major currency and dedollarization would lead to a reduced circulation of the currency, resulting in lower liquidity. Consequently, the stock market could note a bearish period which usually also impacts the crypto market.\n\nThis is because following the Covid-19 crash, Bitcoin and Crypto’s correlation with the stock market increased. The Nasdaq100 and S&P 500 dictated the digital asset’s path, which took away BTC’s inflation hedge status until the recent banking crisis.\n\nWith the Silicon Valley Bank, Silvergate bank and Signature bank failing, Bitcoin decoupled itself from the stock markets and rallied to its current trading price of $28,200. With faith in banks decreasing and the Federal Reserve suggesting higher interest rate hikes going forward the TradFi market could see some bearish effects.\n\nAdditionally, Bitcoin’s rising correlation with Gold is also rising by the day reaching 0.92 on April 3. Throughout 2022 this correlation stood far lower due to the volatility, but the current conditions strengthen the asset’s safe-haven status, which could drive hyperbitcoinization.\n\nBeginning of hyperbitcoinization?\n\nHyperbitcoinization is known as the transition of Bitcoin into the world’s most dominant form of currency, which many predict is not too far. One of Bitcoin’s biggest supporters, former Coinbase Chief Technical Officer (CTO) Balaji Srinivasan, even went on to make a $1 million bet with pseudonymous Twitter speaker James Medlock on March 17 that BTC would be worth $1 million within the next 90 days.\n\nExplaining this bet, Srinivasan noted that this million-Dollar bet was not about winning or rallying Bitcoin price but about settling the ideological discussion surrounding USD inflation. He explained his statement by saying,\n\n“I believe Medlock will agree that this is an ideological bet, like the Simon-Ehrlich bet, which resolved a famous difference of opinion between libertarians and progressives.”\n\nWhile many consider this to be just a publicity stunt, Balaji himself stated that his declining faith in banks and belief in Bitcoin is what drove him to make the bet in the first place."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWJyZWFrb3V0LW1hdHRlci1vZi10aW1lLXNheXMtYW5hbHlzaXMtd2l0aC1idGMtcHJpY2UtYXQtMjhr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin breakout 'matter of time' says analysis with BTC price at $28K - Cointelegraph",
        "content": "Bitcoin (BTC) stayed tightly rangebound at the April 3 Wall Street open as analysts counted down to volatility.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\n“Watch for rugs” on BTC\n\nData from Cointelegraph Markets Pro and TradingView followed BTC/USD as it lingered around $28,000 on Bitstamp.\n\nThe weekend had finished on an erratic note as news of an OPEC+ oil production cut sent crypto tumbling before a rebound during the Asia trading session.\n\nAmid a lack of clear direction, monitoring resource Material Indicators flagged significant liquidity on either side of spot price on the Binance order book.\n\n“We still don’t have a confirmed breakout or breakdown, only rejected attempts which have kept price chopping in this range,” part of fresh Twitter commentary added.\n\n“It’s only a matter of time until one side breaks. Watch for rugs.”\n\nBTC/USD order book data (Binance). Source: Material Indicators/Twitter\n\nPopular trader Crypto Chase agreed that BTC price action remained stagnant.\n\n“Range bound,” he summarized, referring to the equilibrium price (EQ) at $28,234 — the midpoint of the upper and lower bounds of the trading range — holding over the weekend.\n\n“Range EQ providing support for the past 4 days. Bulls want to see acceptance / daily close above 28.9K for expansion. Bears want a significant close below range EQ. At that point, prior support from EQ could flip to resistance sending price to retest range low.”\n\nBTC/USD annotated chart. Source: Crypto Chase/Twitter\n\nRelated: US enforcement agencies are turning up the heat on crypto-related crime\n\nOthers were more categorical in their market appraisals. Maartunn, a contributor at on-chain analytics platform CryptoQuant, turned to longer timeframes to place emphasis on the success of the March monthly close.\n\nBitcoin has confirmed a break-out from a multi-month consolidation, and funding rates are negative pic.twitter.com/vBs7ipK8hw — Maartunn (@JA_Maartun) April 3, 2023\n\nBy contrast, trader and analyst Rekt Capital warned that a retracement could be imminent.\n\n#BTC continues to struggle at the Higher High resistance (black)$BTC will continue to be non-trending as it consolidates between the Higher High resistance & the green support at $27,000\n\n\n\nDrop into green could occur soon\n\n\n\nLose that -> deeper retrace confirmed#Crypto #Bitcoin https://t.co/8sG1jswkDr pic.twitter.com/lsqDlenUpS — Rekt Capital (@rektcapital) April 3, 2023\n\nDXY heads lower after brief comeback\n\nOn macro, United States equities showed mixed results at the open, with the S&P 500 treading water and the Nasdaq Composite Index down 0.8%.\n\nRelated: BTC price double top forming? 5 things to know in Bitcoin this week\n\nThe U.S. Dollar Index (DXY), having initially benefitted from the OPEC+ announcement, continued falling through the day, at one point wicking below 102, almost matching two-month lows.\n\nU.S. Dollar Index (DXY) 1-day candle chart. Source: TradingView\n\n“DXY has been rejected at its 50-week moving average,” analytics account Game of Trades noted the day prior.\n\n“A bearish rejection on the MACD has increased the probability for further downside.”\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiPWh0dHBzOi8vd3d3LmJpdGNvaW4uY29tL2dldC1zdGFydGVkL2hvdy10by1lbnRlci1hLW5ldy1jaGFpbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 06:49:32 GMT",
        "title": "How to enter a new chain | Get Started with Bitcoin.com - Bitcoin.com",
        "content": "The decentralized crypto ecosystem is made up of more than a dozen active blockchains, the largest of which features hundreds of decentralized applications ( dApps ). All of these blockchains exist because no blockchain is perfect; each has strengths and weaknesses. Each must make compromises between attributes like speed, security, cost, compatibility (with other blockchains), and more.The tradeoffs can be so stark that some blockchains have dApps that just aren’t feasible on other chains. As you become more familiar with crypto and DeFi, you will likely want to enter new chains to enjoy unique or optimal applications.This guide will show you the best practices when you enter a blockchain for the first time."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiQ2h0dHBzOi8vd3d3LmJpdGNvaW4uY29tL2dldC1zdGFydGVkL2hvdy10by11c2UtZGVyaXZhdGl2ZXMtaW4tZGVmaS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 06:42:41 GMT",
        "title": "How to use derivatives in DeFi | Get Started with Bitcoin.com - Bitcoin.com",
        "content": "Trade derivatives such as perpetual futures by depositing collateral in DeFi protocols. By trading derivatives, you can express your belief that the available cryptocurrencies and digital assets will go up or down. Derivatives allow you to do so with leverage. Trading derivatives on decentralized protocols protects you from the opaque, risky, and in some cases outright fraudulent behavior that some centralized exchanges have taken.This article covers trading perpetual futures in DeFi with examples and links to step-by-step instructions for dYdX , a leading DeFi derivatives decentralized application ( DApp ), using the Bitcoin.com Wallet app"
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMizAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8taW5mbHVlbmNlcnMvY3J5cHRvLXByaWNlcy10b2RheS1saXZlLW5ld3MtYml0Y29pbi1kb2dlY29pbi1ldGhlcmV1bS1zaGliaGEtaW51LWNyeXB0b2N1cnJlbmN5LWxhdGVzdC11cGRhdGVzLTMtYXByaWwtMjAyMy9hcnRpY2xlc2hvdy85OTIwNzUxOS5jbXPSAdABaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL21hcmtldHMvY3J5cHRvY3VycmVuY3kvY3J5cHRvLWluZmx1ZW5jZXJzL2NyeXB0by1wcmljZXMtdG9kYXktbGl2ZS1uZXdzLWJpdGNvaW4tZG9nZWNvaW4tZXRoZXJldW0tc2hpYmhhLWludS1jcnlwdG9jdXJyZW5jeS1sYXRlc3QtdXBkYXRlcy0zLWFwcmlsLTIwMjMvYW1wX2FydGljbGVzaG93Lzk5MjA3NTE5LmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin falls below $28k; Dogecoin, Shiba Inu shed up to 7% - The Economic Times",
        "content": "\n\n\n\n\n\n\n\nThe cryptocurrency markets were trading in the red on Monday. Bitcoin (BTC) fell 2.62% to $27,706, whereas Ethereum (ETH) was below the $1,800 level. BTC volume stood at approximately $13.60 billion, rising 28.72% in the last 24 hours.\"Bitcoin has traded below the US$28,000 zone in the past 24 hours as investors await fresh productivity and jobs data in the US this week. The immediate support lies at the US$27,500 level, while the resistance is at the US$28,100 zone and the trendline,\" Edul Patel, Co-founder and CEO at Mudrex, said.Other top crypto tokens were also trading lower. Dogecoin declined over 7%. Shiba Inu, Solana and BNB were also trading lower. The global cryptocurrency market cap was trading lower around $1.16 trillion, falling 2.27% in the last 24 hours.The total volume in DeFi is currently 3.62 billion, 10.61% of the total crypto market 24-hour volume. The volume of all stablecoins is now $29.78 billion, which is 87.42% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, was around $536.28 billion. Bitcoin’s dominance is currently 46.21%, down 0.16% over the day, according to CoinMarketCap.\"Bitcoin's current price is $27,600 and hovers around a key trading range of $28,200 to $28,900. A definitive breakout from this range will play a significant role in determining the future direction of Bitcoin's price,\" Sathvik Vishwanath, Co-Founder & CEO of Unocoin, said.Rajagopal Menon, Vice President at WazirX, said, \"Major market oscillators point to a neutral sentiment. The Relative Strength Index (14) sits at 62.71, with a neutral outlook. The Stochastic %K (14, 3, 3) and the Average Directional Index (14) indicate a Neutral outlook as well at 69.33 and 38.60 respectively.\"The MACD Level (12, 26), at 1198.04, indicates Sell. The Stochastic RSI Fast (3, 3, 14, 14) and the Williams Percent Range (14) continue to be Neutral at 30.11 and −41.78, respectively,\" Menon added."
    },
    {
        "id": 39,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vd3d3LmJpdGNvaW4uY29tL2dldC1zdGFydGVkL2hvdy10by1wcm92aWRlLWxpcXVpZGl0eS1vbi1hLWRleC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 06:49:46 GMT",
        "title": "How to provide liquidity on a DEX | Get Started with Bitcoin.com - Bitcoin.com",
        "content": "Decentralized exchanges (DEXs) enable the permissionless exchange of any cryptoasset. Trading on DEXs is made possible by people adding liquidity to trading pairs. Unlike on centralized exchanges, anyone can add a cryptoasset trading pair to a DEX or strengthen an existing trading pair by providing liquidity. Without sufficient liquidity it is not possible to have a smoothly functioning exchange, so DEXs incentivize people to add liquidity by giving a portion of the DEX fees to liquidity providers.This article covers information on the importance of liquidity and how to provide it with links to step-by-step instructions for Bitcoin.com’s Verse DEX using the Bitcoin.com Wallet app"
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiXGh0dHBzOi8vd3d3LnNwbGNlbnRlci5vcmcvaGF0ZXdhdGNoLzIwMjMvMDQvMDMvZXh0cmVtaXN0LWNyeXB0by1hbmQtZmluYW5jZS1xMS0yMDIzLWJyaWVmaW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Extremist Crypto and Finance: Q1 2023 Briefing - Southern Poverty Law Center",
        "content": "Comments or suggestions? Send them to HWeditor@splcenter.org. Have tips about the far right? Please email: source@splcenter.org. Have documents you want to share? Please visit: https://www.splcenter.org/submit-tip-intelligence-project. Follow us on Twitter @Hatewatch."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9idGMtcHJpY2UtZG91YmxlLXRvcC1jb21pbmctNS10aGluZ3MtdG8ta25vdy1pbi1iaXRjb2luLXRoaXMtd2Vla9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "BTC price double top forming? 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) starts a new week in volatile territory, with news of an oil supply cut delivering a choppy start.\n\nStill caught at major historical resistance, BTC/USD delivered an unappetizing weekly close on news of oil production cuts.\n\nA subsequent rebound may show bulls’ mettle, but the question for analysts is what happens next. Will oil prices dictate market moves or can Bitcoin break through $30,000?\n\nUnder the hood, the picture is as rosy as ever, with network fundamentals due to hit new all-time highs this week while dormant supply is also increasing.\n\nCointelegraph looks at Bitcoin markets as the world digests the latest move from The Organization of the Petroleum Exporting Countries plus 10 other oil-exporting countries (Opec+).\n\nOil cut boosts dollar as inflation concerns return\n\nA key event over the weekend, which is now upending macro conditions, is a decision to cut global oil output.\n\nOpec+ has announced voluntary cuts in production totaling 1.65 million barrels per day, and the impact was felt immediately, with the U.S. dollar rising alongside energy costs.\n\nA classic headwind for risk assets, including crypto, the U.S. Dollar Index (DXY) traded above 102.7 at the time of writing, up from April lows of 102.04.\n\n“Eyes on DXY this morning.... This bounce could be just a gap fill as I spoke about last week. I was waiting for this fill,” popular trader Crypto Ed reacted, uploading an explanatory chart to Twitter.\n\n“It’s time for DXY to show its direction (which should effect BTC’s PA).”\n\nU.S. Dollar Index annotated chart. Source: Crypto Ed/ Twitter\n\nWhile the Opec+ move took its toll on assets from Bitcoin to gold, Alasdair Macleod, head of research for Goldmoney, argued that governments would have to inject liquidity to offset any energy price rises, thus once again boosting risk-asset performance.\n\nWTI oil is up $3.60 this on ME and Asia cutting output. Market reaction is gold falls $13. Markets incorrectly believing it's \"deflationary\". But anyone with half a brain knows that central banks will just print faster and faster to pay for higher energy prices... — Alasdair Macleod (@MacleodFinance) April 3, 2023\n\n“Markets will soon react to the surprise OPEC production cut from this weekend,” financial commentary resource The Kobeissi Letter continued in its own dedicated analysis.\n\n“Oil prices will likely rise back above $80.00, an unwelcomed development by central banks attempting to fight inflation. Supply-side inflation is set to worsen on this news.”\n\nHigher inflation would, in turn, increase the odds of central banks continuing to hike interest rates despite the ongoing banking crisis in the U.S. and abroad.\n\nAccording to the latest estimates from CME Group’s FedWatch Tool, markets currently believe that the Federal Reserve will hike rates by another 0.25% in May, having previously been more in favor of a pause.\n\nFed target rate probabilities chart. Source: CME Group\n\nBitcoin price rebounds from Opec+ news\n\nBitcoin initially felt the pressure from the Opec+ decision as the weekend faded, dropping below $28,000 to close the week in a disappointing style.\n\nHowever, during the April 3 Asia trading session, BTC/USD staged a sudden comeback, jumping $865 from the overnight lows of $27,600 on Bitstamp.\n\nPopular trading account Daan Crypto Trades noted that in so doing, Bitcoin had closed another CME futures gap and thus exhibited classic Monday trading behavior.\n\n$BTC With the quick CME gap close on Monday as we see so often. pic.twitter.com/KKbnsrucvW — Daan Crypto Trades (@DaanCrypto) April 3, 2023\n\nFellow analytics account Skew followed short-term developments while predicting a “much bigger reaction” during the coming week.\n\n$BTC nice 4H Close\n\nBouncing so far, target would be $29K highs for a sweep at very least.\n\n\n\nPretty low volume so far though, expecting a much bigger reaction this week https://t.co/xCCoUqjNvR pic.twitter.com/gU3RSzUiut — Skew Δ (@52kskew) April 3, 2023\n\nLooking ahead, however, crypto analysis and education resource IncomeSharks maintained a bearish outlook on BTC.\n\n“I just can’t unsee the double top Mcdonalds pattern,” it wrote on the day, referring to the structure of BTC/USD in 2023 so far.\n\n“Now you got a diagonal trendline break, low volume, and weak OBV. Logic and unbiased emotions says to sell/short this, I don’t see a reason to be bullish short term YET.”\n\nBTC/USD annotated chart. Source: IncomeSharks/ Twitter\n\nTrader and analyst Rekt Capital was not so sure.\n\n“Still not clear if BTC is forming the second part of its Double Top formation,” he argued in his latest analysis.\n\n“$BTC would need to soon drop to ~$27,000 (blue) if it is to fully develop the pattern pattern & form an M-like shape. Lose ~$27K -> Double Top validated. Something to consider.”\n\nBTC/USD annotated chart. Source: Rekt Capital/ Twitter\n\nAnother week, another Bitcoin mining record\n\nDip or no dip, Bitcoin network fundamentals are in no mood to flip bearish this week.\n\nAccording to the latest estimates from BTC.com, Bitcoin difficulty is due to have yet another increase at the upcoming automated readjustment in three days.\n\nThis will take it to 47.92 trillion on a 2.3% rise, marking new all-time highs for difficulty.\n\nBitcoin network fundamentals overview (screenshot). Source: BTC.com\n\nData from MiningPoolStats shows a similar uptrend for hash rate, which by some measurements touched a record 400 exahashes per second (EH/s) recently.\n\nAnalyzing what could be behind the rapid growth, Sam Wouters, a research analyst at mining firm River, suggested that it was likely sidelined rigs returning to operations thanks to price rises.\n\n“It is rumored that several large public miners have significant inventories of unused ASICs. While Bitcoin’s price was so low and as much inventory as possible was brought online last year, at some point maximum capacity of what the network could handle was reached,” he wrote in part of a dedicated Twitter thread on March 27.\n\n“Now that the price has been rising again and some time has passed, more of this inventory has been able to go online.”\n\nData from on-chain analytics firm Glassnode shows that miners have begun attempting to retain more BTC than they earn.\n\nOn a rolling 30-day basis, miners’ net position change is again positive after two weeks of a downtrend.\n\nBitcoin miner net position change chart. Source: Glassnode\n\nDormant BTC supply sets further records\n\nBitcoin is known for its ability to create supply shocks, but the latest data underscores the long-term trend.\n\nDespite the BTC price comeback this year, the available supply dormant for a decade or more is at new all-time highs.\n\nThat record was beaten again this week, with 2,691,418.953 BTC not leaving wallets since at least April 2013.\n\nThis equates to 12.81% of the total possible supply of 21 million BTC, or 13.91% of the supply mined so far.\n\nBTC supply last active 10 years ago or more. Source: Glassnode/ Twitter\n\nAny mass interest in BTC will thus mean that buyers have a dwindling supply to purchase. While rising slightly in 2023, exchange balances remain near their lowest since early 2018, Glassnode confirms.\n\nBitcoin exchange balance chart. Source: Glassnode\n\n“Too euphoric?”\n\nCrypto market sentiment has not yet digested the possibility of a significant retracement.\n\nRelated: Bitcoin liquidity drops to 10-month low amid US bank run\n\nAccording to the classic sentiment indicator, the Crypto Fear & Greed Index, “greed” is what continues to characterize the overall mood.\n\nAs of April 3, greed measured 63/100, near its highest since Bitcoin’s all-time highs in November 2021.\n\n“The crypto market is getting too euphoric,” analytics resource Game of Trades warned late last month.\n\nWhile high, the level of greed, as depicted by the Index, still has considerable room for growth until hitting “extreme” territory nearer 90 — this being a classic signal that a significant market correction is due.\n\nCrypto Fear & Greed Index (screenshot). Source: Alternative.me\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vZGVjcnlwdC5jby8xMjUyNTcvYml0Y29pbi1uYXRpb25hbC1zZWN1cml0eS10aGVzaXMtcGFwZXItYW1hem9uLWJlc3Qtc2VsbGVy0gFZaHR0cHM6Ly9kZWNyeXB0LmNvLzEyNTI1Ny9iaXRjb2luLW5hdGlvbmFsLXNlY3VyaXR5LXRoZXNpcy1wYXBlci1hbWF6b24tYmVzdC1zZWxsZXI_YW1wPTE?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Thesis Becomes Amazon Best Seller - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nFor many readers, a graduate thesis doesn’t sound like a page-turner, but a lengthy academic paper on Bitcoin written by a U.S. Space Force major has emerged as a popular pick on Amazon.\n\n“Softwar” asserts that Bitcoin has the potential to play a major role on the world’s geopolitical stage as a military-grade solution for securing information—far different than the monetary use Bitcoin’s network has today.\n\nWritten by Jason Lowery, the report represents the culmination of academic research he conducted at the Massachusetts Institute of Technology during a 6-month fellowship sponsored by the Department of Defense. The full title of the piece is “Softwar: A Novel Theory on Power Projection and the National Strategic Significance of Bitcoin.”\n\nAD\n\nAD\n\nLowrey's brief biography on Amazon claims that he has advised several senior U.S. officials on Bitcoin-related policy in offices related to the president, Secretary of Defense, and the Joint Chiefs of Staff.\n\nThough “Softwar” doesn’t place within the top 500 books on Amazon’s store, Lowery’s exploration of Bitcoin has hovered around the number one spot in Amazon’s digital currencies category and is currently ranked second in both books on technology and engineering.\n\nThe more than 350-page tome draws on knowledge from various fields, such as anthropology and computer science, to establish and explore Lowery’s “Power Projection Theory.”\n\nEssentially, Lowery posits that the proof-of-work system underlying Bitcoin transaction verification can be leveraged by military powers to impose restrictions on bad actors in a non-lethal through a steep amount of physical work in the form of crunching numbers.\n\n“The bottom line is that Bitcoin could represent a ‘softwar’ or electro cyber-defense protocol, not merely a peer-to-peer electronic cash system,” the book states. “While most software can only logically constrain computers, Bitcoin can physically constrain computers.”\n\nAD\n\nAD\n\nThe book’s acknowledgments section gives a nod to some of Bitcoin’s most faithful, including MicroStrategy’s Michael Saylor and Peter McCormack.\n\nIn his paper, Lowrey also writes that insufficient reserves of Bitcoin held on behalf of the U.S. government could pose a threat to the nation’s national security if the network becomes utilized as a cyber-security tool.\n\n“If the U.S. does not consider stockpiling strategic Bitcoin reserves, or at the very least encouraging Bitcoin adoption,” he said, “The U.S. could forfeit a strategically vital power [...] and set itself back in global power dominance.”\n\nGiven that Lowrey’s thesis was published in February and the U.S. announced that it sold $215 million in seized Bitcoin last month, perhaps not every Fed is on the same page.\n\nThe book also includes a disclosure that states the paper is not reflective of any official position held by the DoD, Air Force, or MIT.\n\nOut of the more than 200 ratings “Softwar” has received on Amazon, a majority gave the book five stars.\n\nBut a few reviews say that Lowrey’s text is lacking due to “too much wishful thinking,” “arguments based on opinion,” and quotes from “The Matrix” that “detract from the seriousness of the topic.”"
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZGVjcnlwdC5jby8xMjUzMTAvYml0Y29pbnMtY29ycmVsYXRpb24tdG8tZ29sZC10aWdodGVuZWQtaW4tbWFyY2gtYW1pZC10cmFkZmktd29lc9IBYGh0dHBzOi8vZGVjcnlwdC5jby8xMjUzMTAvYml0Y29pbnMtY29ycmVsYXRpb24tdG8tZ29sZC10aWdodGVuZWQtaW4tbWFyY2gtYW1pZC10cmFkZmktd29lcz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin’s Correlation to Gold Tightened in March Amid TradFi Woes - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin behaved more like one of the world’s most historic currencies in March, as the largest cryptocurrency by market cap exhibited a strong correlation to gold.\n\nThe value of the two assets moved in similar directions throughout the month, edging higher as a banking crisis reared its head in the U.S. and toppled several institutions like Silicon Valley Bank—which eventually spilled over to shutter European giants like Credit Suisse.\n\nThe correlation between Bitcoin and gold currently stands around 50%, according to blockchain analytics firm Kaiko. It represents the strongest connection between the two assets in more than a year, Kaiko analyst Dessislava Aubert told Decrypt.\n\nAD\n\nAD\n\n“It's a significant shift because over the course of 2022 Bitcoin and gold were mostly uncorrelated,” she said. “So, it was not moving as a safe haven [asset] at all.”\n\nOver the past month, Bitcoin has rallied 25% to around $28,000, notching its third positive month in a row despite regulatory headwinds. Meanwhile, gold has risen over 8% during the past month, nearing an all-time high of`$1,988 per troy ounce on Monday.\n\nCryptocurrencies aren’t typically viewed as a safe haven asset—they’re generally seen as risky investments like stocks. And these risk assets have been hammered over the past year as the Federal Reserve has aggressively raised interest rates to quell inflation.\n\nBut Aubert said it’s possible for Bitcoin’s status as a risk asset to shift somewhat as investors’ perceptions of its strengths as a store of value change.\n\n“For now, people are trying to put Bitcoin in a very traditional framework,” Aubert said. “It’s very hard because it can be a lot of things.”\n\nAD\n\nAD\n\nMeanwhile, the correlation between Bitcoin and the S&P 500—a major index often used to gauge movements in the U.S. stock market—fell significantly in March to 20%, adding on to a trend that’s been building for months, said Aubert.\n\n“Bitcoin’s correlation with equities has been going down since December, steadily, and it's now very low,” she said, adding that 20% is essentially negligible.\n\nHowever, Aubert said that Bitcoin will remain influenced by factors that also impact stocks, such as the Fed’s monetary policy. She also noted that Bitcoin is sensitive to changes in liquidity overall.\n\nAs Bitcoin begins to behave more like a safe haven asset and less like a risky one, there are some fundamental similarities between Bitcoin and gold that are notable, CoinShares’ Head of Research James Butterfill told Decrypt.\n\nOne element that the two assets have in common is that a finite supply supports their value, he said. Similar to how there’s a limited amount of accessible gold in the world, Bitcoin’s supply is capped at 21 million—with the last Bitcoin expected to be mined sometime in 2140, according to projections.\n\n“Bitcoin, in fact, is technically a harder asset than gold because it's a finite supply, but [also] a very well-known finite supply,” Butterfill said. “Theoretically, you could go out into the universe and find a ton of gold, bring it back to Earth, and flood the market.”\n\nIn terms of the cultural overlap between Bitcoin and gold, perhaps there is evidence to suggest they are converging on that front as well.\n\nThe California-based rapper Snoop Dogg stepped into the ring at WrestleMania 39 yesterday and was seen sporting a golden hardware wallet like an expensive chain.\n\nAD\n\nAD"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiTWh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbnMtbmV4dC10YXJnZXQtMzAwMDAtd2l0aGluLXJlYWNoLWFzLXN1cHBvcnQtZm9ybXMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin's next target: $30000 within reach as support forms - Finbold - Finance in Bold",
        "content": "After successfully breaking the $28,000 psychological level, Bitcoin (BTC) has paused its uptrend, but several cryptocurrency analysts have identified certain chart patterns indicating that the decentralized finance (DeFi) asset was in for a bullish rally in the near future.\n\nOne of them is the popular crypto analyst Moustache, who has noticed that Bitcoin recently had “another weekly close over the sampling period in the Gaussian Channel,” interpreting this as a “good sign,” as he explained in a tweet published on April 3.\n\nAs the crypto market expert further clarified, Bitcoin looks to be forming “support to break the next target from here,” advising patience while the price consolidates and expressing his opinion that $30,000 or more was “only a matter of time.”\n\nBitcoin price action analysis. Source: Moustache\n\nCrypto analysts agree\n\nThe crypto expert’s attitude is shared by other analysts, including CryptoYoddha, who has shared a bullish chart analysis, demonstrating Bitcoin’s past movements and future predictions, looking at the $30,000 area by the end of April, continuing to $37,000 in May and further toward $57,000 as the year’s end approaches, interrupted by several plunges.\n\nBitcoin price analysis and prediction. Source: CryptoYoddha\n\nOn top of that, popular crypto commentator Rekt Capital has observed similarities between Bitcoin’s current price action and that from 2019, which was followed by several long green candles, leading to a $7,500 price increase. If BTC succeeds in doing the same this time around, $35,000 is likely. At the same time, Altcoin Sherpa has identified a target for Bitcoin at $36,000.\n\nBitcoin price action since 2019. Source: Rekt Capital\n\nBitcoin price analysis\n\nAs things stand, the maiden digital asset is currently trading at the price of $28,276, which represents a decrease of 0.10% in the last 24 hours but still an increase of 0.81% over the previous week, in addition to the 26.42% gain across the past 30 days, according to the latest data retrieved on April 3.\n\nBitcoin price chart. Source: Finbold\n\nMeanwhile, crypto analyst Matthew Hyland observed on April 2 that $30,000 has acted as Bitcoin’s significant resistance and support level for the last two years, and if it managed to flip this position, it could mean a “whole new ballgame” for the best-performing asset class in the first quarter of 2023.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vd3d3LmF0bW1hcmtldHBsYWNlLmNvbS9uZXdzL2dldGdvLWMtc3RvcmUtY2hhaW4tdG8tZGVwbG95LWJpdGNvaW4tYXRtcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "GetGo c-store chain to deploy bitcoin ATMs - ATM Marketplace",
        "content": "Get Go Café + Market, a convenience store chain with more than 270 locations throughout western Pennsylvania, Ohio, northern West Virginia, Maryland and Indiana, will install 125 bitcoin ATMs, according to a press release.\n\nGuests can already convert their cash into bitcoin via BDCheckout through the Bitcoin Depot app and at roughly 7,000 kiosk locations in 48 states and 10 Canadian provinces.\n\nGetGo is based in Pittsburgh, Pennsylvania and operated by Giant Eagle Inc., a supermarket chain.\n\n\"Providing our guests with high quality foods and the best in convenience is our top priority at GetGo,\" Brandon Daniels, public relations manager at GetGo, told this website in an email exchange. \"We continually look for new ways to better serve them, and new technologies are just one of the ways we can exceed their expectations.\"\n\nWhile the company does not accept bitcoin or cryptocurrency payments at its stores, it has offered self-checkout kiosks in its stores, including its made-to-order kitchens.\n\n\"From these kiosks, guests can place orders from our expansive fresh, made-to-order menu, and they can customize their orders by adding/subtracting ingredients or modifying how the dish is prepared,\" Daniels said."
    },
    {
        "id": 49,
        "url": "https://news.google.com/rss/articles/CBMiPmh0dHBzOi8vd3d3LmJpdGNvaW4uY29tL2dldC1zdGFydGVkL2hvdy10by15aWVsZC1mYXJtLWluLWRlZmkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 05:40:22 GMT",
        "title": "How to yield farm in DeFi | Step-by-step instructions | Get Started with Bitcoin.com - Bitcoin.com",
        "content": "Anyone can earn rewards by depositing specific digital assets into certain decentralized applications (DApps) . Known as yield farming, this is a widespread practice in decentralized finance (DeFi) . In this guide we cover a specific type of yield farming where users deposit their liquidity pool tokens on a decentralized exchange in order to earn extra rewards. We’ll demonstrate this type of yield farming using Bitcoin.com’s decentralized exchange, Verse DEX For a primer on yield farming in general, including an overview of the different types of yield farming opportunities available, start here"
    },
    {
        "id": 50,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3Lmdsb2JlbmV3c3dpcmUuY29tL2VuL25ld3MtcmVsZWFzZS8yMDIzLzA0LzAzLzI2Mzk2NTYvMC9lbi9DbGVhblNwYXJrLVJlbGVhc2VzLU1hcmNoLTIwMjMtQml0Y29pbi1NaW5pbmctVXBkYXRlLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "CleanSpark Releases March 2023 Bitcoin Mining Update - GlobeNewswire",
        "content": "LAS VEGAS, April 03, 2023 (GLOBE NEWSWIRE) -- CleanSpark, Inc. (Nasdaq: CLSK), America’s Bitcoin Miner™, today released its unaudited bitcoin mining and operations update for the month ending March 31, 2023.\n\n“Our approach to proprietary mining gives us substantial control and flexibility over our destiny and the progress on our Washington expansion is a perfect example,” said Zach Bradford, CEO. “The 50MW expansion is on schedule. The machines have already been purchased and shipping is expected to commence this month. Once those machines are racked and the expansion is energized, our hashrate is expected to increase to about 8.7 EH/s, giving us substantial progress toward our calendar year-end goal of 16 EH/s.\n\n“In this environment, a miner that is not growing is falling behind. As hashrate grows, we also need to grow. Growth takes substantial capital, just as it does in any commodities-based business, especially in the scaling stage. As we scale, we intend to continue to use all capital levers available to us, including equity and bitcoin, carefully balancing both to provide the highest rate of return for our shareholders. We are making the most of the bear market so that we are in position to take full advantage of the next bull market once it inevitably emerges.”\n\nMarch Bitcoin Mining Update (unaudited)\n\nBitcoin mined in March: 598\n\nCY2023 bitcoin mined: 1,871\n\nTotal BTC holdings as of March 31: 196\n\nTotal BTC converted for operations and growth in March: 502\n\nCurrently deployed fleet of about 67,700 latest-generation bitcoin miners with a hashrate of 6.7 EH/s\n\nThe Company funded growth and operations through the sale of 502 bitcoins in March 2023 at an average of approximately $24,800 per BTC. Sales of BTC equated to proceeds of approximately $12.4 million. March daily BTC mined averaged 19.29 and reached a high of 20.25.\n\nOperational Update\n\nWashington Expansion. The Washington expansion is a passively cooled data center consisting of four primary buildings. Once fully complete, the expansion will hold about 15,000 Antminer S19j Pro+ machines. Total capacity in Washington is expected to be 86MW, the majority of which is sourced from low-carbon, on-grid energy. Building 1 is complete and ready for miners. Racks are currently being installed in Building 2. The foundation was recently poured for Building 3, while concrete deliveries are imminent for Building 4. Scott Garrison, vice president of business development, is leading the expansion.\n\n“We are on schedule in Washington,” said Garrison. “One building is completely done and ready for miners, with the other buildings in various stages of construction, each advancing according to schedule. Our teams and partners, which include the utility, city, and various construction firms, are working hand-in-hand for the build. I’m so proud of what we are accomplishing on the ground in Washington as we work to build some of the most efficient bitcoin mining infrastructure in North America.”\n\nAbout CleanSpark\n\nCleanSpark (Nasdaq: CLSK) is America’s Bitcoin Miner™. Since 2014, we’ve helped people achieve energy independence for their homes and businesses. In 2020, we transitioned that expertise to develop sustainable infrastructure for Bitcoin, an essential tool for financial independence and inclusion. We strive to leave the planet better than we found it by sourcing and investing in low-carbon energy, like wind, solar, nuclear, and hydro. We cultivate trust and transparency among our employees, the communities we operate in, and the people around the world who depend on Bitcoin. CleanSpark holds the 44th spot on the Financial Times' 2022 List of the 500 Fastest Growing Companies in the Americas and ranks thirteenth on Deloitte’s Fast 500. For more information about CleanSpark, please visit our website at www.cleanspark.com.\n\nForward-Looking Statements\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding expectations for expansion of the Company’s Washington, Georgia bitcoin mining facility, the resulting anticipated benefits to CleanSpark (including as to anticipated additions to CleanSpark’s hashrate and the timing thereof) and plans to expand the facility. We intend such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). All statements other than statements of historical facts contained in this press release may be forward-looking statements. In some cases, you can identify forward-looking statements by terms such as “may,” “will,” “should,” “expects,” “plans,” “anticipates,” “could,” “intends,” “targets,” “projects,” “contemplates,” “believes,” “estimates,” “forecasts,” “predicts,” “potential” or “continue” or the negative of these terms or other similar expressions. Forward-looking statements contained in this press release, but are not limited to statements regarding our future results of operations and financial position, industry and business trends, business strategy, expansion plans, market growth and our objectives for future operations.\n\nThe forward-looking statements in this press release are only predictions. We have based these forward-looking statements largely on our current expectations and projections about future events and financial trends that we believe may affect our business, financial condition and results of operations. Forward-looking statements involve known and unknown risks, uncertainties and other important factors that may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements, including, but not limited to: the anticipated timing of the expansion; the risk that the electrical power available to our facilities does not increase as expected; the success of its digital currency mining activities; the volatile and unpredictable cycles in the emerging and evolving industries in which we operate; increasing difficulty rates for bitcoin mining; bitcoin halving; new or additional governmental regulation; the anticipated delivery dates of new miners; the ability to successfully deploy new miners; the dependency on utility rate structures and government incentive programs; dependency on third-party power providers for expansion efforts; the expectations of future revenue growth may not be realized; and other risks described in the Company's prior press releases and in its filings with the Securities and Exchange Commission (SEC), including under the heading \"Risk Factors\" in the Company's Annual Report on Form 10-K and any subsequent filings with the SEC. The forward-looking statements in this press release are based upon information available to us as of the date of this press release, and while we believe such information forms a reasonable basis for such statements, such information may be limited or incomplete, and our statements should not be read to indicate that we have conducted an exhaustive inquiry into, or review of, all potentially available relevant information. These statements are inherently uncertain and investors are cautioned not to unduly rely upon these statements.\n\nYou should read this press release with the understanding that our actual future results, performance and achievements may be materially different from what we expect. We qualify all of our forward-looking statements by these cautionary statements. These forward-looking statements speak only as of the date of this press release. Except as required by applicable law, we do not plan to publicly update or revise any forward-looking statements contained in this press release, whether as a result of any new information, future events or otherwise.\n\nInvestor Relations Contact\n\nMatt Schultz\n\nir@cleanspark.com\n\nMedia Contacts\n\nIsaac Holyoak\n\npr@cleanspark.com\n\nBlocksBridge Consulting\n\nNishant Sharma\n\ncleanspark@blocksbridge.com\n\nAttachments"
    },
    {
        "id": 52,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLWFzc2Vzc2luZy10aGUtZ29vZC1iYWQtYW5kLXVnbHktYXMtYnRjLW1hcmNoZXMtaW50by1hcHJpbC_SAVxodHRwczovL2FtYmNyeXB0by5jb20vYml0Y29pbi1hc3Nlc3NpbmctdGhlLWdvb2QtYmFkLWFuZC11Z2x5LWFzLWJ0Yy1tYXJjaGVzLWludG8tYXByaWwvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin: Assessing the good, bad, and ugly as BTC ‘Marches’ into April - AMBCrypto News",
        "content": "Bitcoin’s organic demand has been increasing since spot trading outpaced perpetual trading activity.\n\nThe U.S operation choke 2.0 could impact the April BTC performance.\n\nThe crypto market, led by the quarter-reviving Bitcoin [BTC], had a march full of ups and downs in between cynical and optimistic views. Nevertheless, the king coin ended the month with a 21.49% 30-day hike. However, there has been some development around the market propelled by macroeconomic factors and cycle reversal.\n\nHow much are 1,10,100 BTCs worth today?\n\nAs such, the latest Capriole newsletter, put together by Charles Edwards, touched on this aspect.\n\nBumps on the pathway to honor\n\nAccording to the digital asset hedge fund, BTC’s price action has been largely fueled by organic demand. This was because the perpetual dominance has been in a free fall for quite some time.\n\nThe metric describes the established ratio of derivatives trading to spot positions. And with the perpetual dominance down, it meant that spot drove appreciation, and the early bull market stages might be here.\n\nHowever, it is important to admit that the ecosystem struggled with regulatory issues and traditional financial problems.\n\nBut it seemed Bitcoin has been able to withstand the heat. As a matter of fact, these challenges helped raise the Short-to-Long-Term Realized Value (SLRV) ribbons. This implied that short-term market activity outpaced the long-term. In Capriole’s words,\n\n“In Q4 2022, the ribbons bottomed at levels comparable to the 2018 lows, and have since gone exponential into Q1 2023. This is another clear sign of a macro shift in Bitcoin adoption.”\n\nBitcoin: Crunches, costs, and revival\n\nFurthermore, the report noted that the current liquidity crisis was just one out of two. And the Bitcoin reaction to the first could be similar to the latter part, especially with regulators and institutions out of the U.S. easing their persecution of the digital asset industry.\n\nAnother metric considered to have favored Bitcoin is its production cost. For most of 2022, investments geared toward Bitcoin production were at extreme levels.\n\nWith the end of Q1 here, it means the high costs have outstripped the BTC trading price for more than 365 days. Although this is bad for miners, it serves as confirmation of the coin’s undervalued state.\n\nIs your portfolio green? Check the Bitcoin Profit Calculator\n\nThe quantitative Bitcoin algorithm provider opined that the U.S. operation targeted at legit crypto firms to restore banks’ worthiness could derail BTC’s growth in April. However, the coin has proven to detach itself from macroeconomic factors recently. So, there is a chance that it evades these potential sanctions.\n\nLastly, April’s potential to replicate the March performance looks blurry. But the present state of affairs aligns with a recovery trend and potential adoption increase."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiswFodHRwczovL3d3dy5hbmFseXRpY3NpbnNpZ2h0Lm5ldC9iaXRjb2luLWJ0Yy1wcmljZS1wcmVkaWN0aW9uLWFwcmlsLTIwMjMtZXhwZXJ0cy1iZWxpZXZlLTM1MDAwLWlzLWFyb3VuZC10aGUtY29ybmVyLWJ1dC1yZW5xLWZpbmFuY2UtcmVucS1yZW1haW5zLXRoZWlyLWZpcnN0LWNob2ljZS1mb3ItdGhlLW1vbnRoL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) price prediction April 2023, Experts believe $35000 is around the corner but RenQ Finance (RENQ ... - Analytics Insight",
        "content": "Bitcoin (BTC) has been the king of cryptocurrencies since its inception in 2009. With a market cap of over $1 trillion, it’s the most valuable and well-known digital asset in the world.\n\nHowever, BTC has had a rough start in 2023, with its price dropping by more than 40% from its all-time high of nearly $69,000. In this article, we’ll take a closer look at Bitcoin’s price prediction for April 2023. Meanwhile RenQ Finance (RENQ) remains an attractive investment option.\n\nBitcoin Price Analysis\n\nBitcoin, the world’s largest cryptocurrency, had reached its nine-month high at $28,000 levels, but it has since been trading in a consolidated manner, hovering above the $27,850 level at the time of writing. The digital asset started correcting its prices once it was unable to break through the crucial resistance level of $28,000 last week.\n\nHowever, it remains stable at the $27,000 levels with an immediate resistance level of $28,000. Despite this, the global cryptocurrency market capitalization is trading higher at around $1.16 trillion.\n\nCurrently, the price of Bitcoin is at $28,357.98, experiencing a slight dip of -0.72% in the past 24 hours. Nevertheless, the market capitalization of Bitcoin remains strong, standing at over $548 billion.\n\nLooking at the bigger picture, Bitcoin has made an impressive 71.62% change so far this year, indicating a strong growth potential for the leading cryptocurrency.\n\nHowever, some experts believe that the worst may be over for BTC and that it could see a significant uptick in price in the coming months.\n\nBitcoin (BTC) price prediction April 2023: Will it reach $35,000?\n\nThere is no clear consensus among experts on what Bitcoin’s price will be in April 2023, as opinions vary widely. Some analysts predict that BTC could surge to $35,000 or even higher, while others take a more cautious approach.\n\nCurrently, Bitcoin is trading at around $28,355, with a 25.46% increase over the past week. The recent collapse of a major bank has put Bitcoin back in the spotlight, reminding investors of its value as a borderless, decentralized, and tamper-proof currency.\n\nGiven the recent market trends and Bitcoin’s upward trajectory, it’s not unreasonable to expect that the cryptocurrency could reach $35,000 by April 2023. This would have a positive impact on the entire crypto market, potentially leading to even more significant gains.\n\nHowever, as always, investors should do their own research and exercise caution when making investment decisions.\n\nRenQ Finance (RENQ)\n\nWhile Bitcoin remains the most well-known and valuable cryptocurrency, it’s not the only option for investors. RenQ Finance (RENQ) is a decentralized exchange (DEX) that offers a multi-chain platform for trading and investing in cryptocurrencies. RenQ Finance offers several advantages over traditional centralized exchanges, including lower fees, faster transactions, and increased security.\n\nRENQ has shown steady growth since its launch in February 2023, with its price increasing by over 150%. Additionally, RENQ has recently finished its third presale stage earlier than expected raising over $4.3 million from investors.\n\nExperts believe that RenQ Finance’s impressive presale, innovative platform, and use cases will drive increased demand for the cryptocurrency, leading to a surge in its value.\n\nAdditionally, with the growing interest in DeFi and the increasing adoption of cryptocurrencies, RenQ Finance is well-positioned to capitalize on the growth of the market.\n\nConclusion\n\nBitcoin’s price prediction for April 2023 is uncertain, with experts having varying opinions on its potential growth. Bitcoin has been experiencing a bullish run since the start of the year, and its current price at around $28,000 has brought hope that it could hit the predicted $35,000 mark if its current momentum continues.\n\nWhile Bitcoin remains an attractive investment option, RenQ Finance (RENQ) is also a promising cryptocurrency with significant potential for growth. Its innovative technology and strong community of supporters make it an attractive option for those looking to diversify their portfolios and capitalize on the growth of the DeFi and cryptocurrency markets.\n\nClick Here to Buy RenQ Finance (RENQ) Tokens.\n\nVisit the links below for more information about RenQ Finance (RENQ):\n\nWebsite: https://renq.io\n\nWhitepaper: https://renq.io/whitepaper.pdf\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiRWh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2xpdGVjb2luLXZzLWJpdGNvaW4ta2V5LWRpZmZlcmVuY2VzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Litecoin vs Bitcoin: Key Differences - Analytics Insight",
        "content": "In this article, we will explore the key differences between Litecoin and Bitcoin\n\nLitecoin and Bitcoin are two of the most popular cryptocurrencies in the world. While both are based on the same technology and share many similarities, there are several key differences between the two that set them apart. In this article, we will explore the key differences between Litecoin and Bitcoin.\n\nMining Algorithm- One of the key differences between Litecoin and Bitcoin is the mining algorithm used. Bitcoin uses a Proof-of-Work (PoW) algorithm known as SHA-256, while Litecoin uses a PoW algorithm known as Scrypt. The Scrypt algorithm is considered to be more memory-intensive than SHA-256, making it more difficult to mine using specialized hardware known as ASICs. As a result, Litecoin can be mined using consumer-grade hardware, whereas Bitcoin mining requires specialized and expensive hardware. Transaction Speed- Another key difference between Litecoin and Bitcoin is the transaction speed. Litecoin has a faster block time than Bitcoin, which means that transactions can be confirmed faster. Litecoin has a block time of 2.5 mins, while Bitcoin has a block time of 10 mins. This means that Litecoin can handle more transactions per second than Bitcoin. Total Supply- Litecoin has a total supply of 84 million coins, while Bitcoin has a total supply of 21 million coins. This means that Litecoin will have four times as many coins in circulation as Bitcoin. However, both cryptocurrencies have a limited supply, which is one of the key reasons why they are considered to be valuable. Market Capitalization- Bitcoin has a much larger market capitalization than Litecoin. As of April 2023, the market capitalization of Bitcoin is over $1 trillion, while the market capitalization of Litecoin is around $10 billion. This means that Bitcoin is much more widely adopted and recognized than Litecoin. Adoption- Bitcoin has been adopted by more merchants and businesses than Litecoin. As a result, it is easier to buy and sell goods and services using Bitcoin. However, Litecoin has also been adopted by a growing number of merchants and businesses, and its adoption is expected to continue to grow in the coming years. Purpose- While both Litecoin and Bitcoin are cryptocurrencies, they have slightly different purposes. Bitcoin was designed to be a decentralized digital currency that could be used to send and receive payments without the need for intermediaries such as banks. Litecoin, on the other hand, was designed to be a faster and cheaper alternative to Bitcoin, with a focus on enabling fast and low-cost payments. Community- Finally, the communities around Litecoin and Bitcoin are different. While both communities are passionate about their respective cryptocurrencies, the Bitcoin community tends to be larger and more active. This is partly because Bitcoin has been around longer and has a larger user base.\n\nIn conclusion, while Litecoin and Bitcoin share many similarities, there are several key differences between the two. Litecoin is designed to be a faster and cheaper alternative to Bitcoin, with a different mining algorithm, faster block times, and a larger total supply. Bitcoin, on the other hand, is more widely adopted and recognized, with a larger market capitalization and a focus on enabling decentralized payments. Ultimately, the choice between Litecoin and Bitcoin will depend on your individual needs and preferences.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmFuYWx5dGljc2luc2lnaHQubmV0L2JpdGNvaW4tcHJpY2Utc2V0LWl0cy1oaWdoZXN0LXdlZWtseS1jbG9zZS1pbi0xMC1tb250aHMtY2FuLWJ0Yy1icmVhY2gtMzBrL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Price Set Its Highest Weekly Close in 10 Months, Can BTC Breach $30K? - Analytics Insight",
        "content": "Bitcoin set the highest weekly close since June after closing the day at $28,283 on April 2. The big crypto was stable over the weekend after closing out March near $28,500, the highest in 10 months.\n\nBitcoin Price Weekly Chart\n\nBitcoin price was, however, flashing red on Monday, exchanging hands at $27,795. This was a 2.67% drop in the last 24 hours, according to data from CoinMarketCap. A key resistance level is at the $28,500 mark. This is a historically significant barrier that is also playing out in the current halving cycle.\n\nNote that Bitcoin has been consolidating below this level for the last 10 months. Traders expected that a strong weekly close would cement the recent gains made by the flagship cryptocurrency. Unfortunately, the April 2 close fell short of the $28,750 that many had anticipated.\n\nHowever, the technical setup reveals that Bitcoin is still bullish.\n\nBitcoin Price Need To Reclaim $28,500 To Sustain The Uptrend\n\nBTC trades in a third straight bearish session on Monday as seen on the daily chart below. Apart from the 4.75% pullback being experienced at the moment from Thursday’s high above $29,000 to the current price, the Layer 1 token has sustained a bullish outlook since March 9.\n\nFrom the chart below, BTC is trading below its weekly close of $28,283, the ascending but accelerated trendline, and the previous stubborn resistance at around $28,500, highlighted by the upper orange band.\n\nThe Moving Average Convergence Divergence (MACD) indicator is facing down and has sent a call to sell Bitcoin as seen on the same daily chart. This occurred on April 1 when the 12-day Exponential Moving Average (EMA) – the blue line – crossed below the 26-day EMA – the orange line. This suggested that Bitcoin may continue correcting in the near term.\n\nAs such, a break below the lower orange band at $27,000 would spell doom for the largest crypto by market capitalization, with the first line of defense emerging from the $26,000 psychological level or the 50-day simple moving average around $24,900.\n\nBTC/USD Daily Chart\n\nConversely, the technical setup shows that Bitcoin is largely bullish. Note that the price sits above all the major moving averages, starting with the 50-day Simple Moving Average (SMA) (the line in yellow), the 100-day SMA (the line in red), and the 200-day SMA (the line in purple), which is a bullish signal.\n\nBuyers are facing the toughest challenge at the moment, breaking the seller congestion level at $28,500, would likely pave the way for an upswing to $30,000. To do so, they must start by upholding support at $27,000 to avoid any chances of a pullback as described above.\n\nA break and hold above $30,000 is crucial for the continuation of the uptrend, and bulls must capitalize on the momentum created by the pioneer cryptocurrency since the beginning of the year to possibly bring $35,000 into the picture.\n\nJoin our WhatsApp and Telegram Community to Get Regular Top Tech Updates"
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmNpdHlhbS5jb20vYml0Y29pbi10cmVhZHMtd2F0ZXItYWJvdmUtMjhrLWFzLXRyYWRlcnMtYW50aWNpcGF0ZS1mcmlkYXlzLWluZmxhdGlvbi1udW1iZXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin treads water above $28k as traders anticipate Friday's inflation numbers - CityAM - City A.M.",
        "content": "Bitcoin treads water above $28k as traders anticipate Friday’s inflation numbers\n\nBitcoin is changing hands for $28,330 this morning, largely flat on the day, and over seven days.\n\nEthereum has also found support above the key $1,800 threshold, trading in the green over the week but also flat on the day. It’s been similarly quiet in other crypto markets.\n\nThe latest US jobs report is expected on Friday – something that could dictate where the crypto markets go from here.\n\n“Any signs of weakness in the data will likely push dovish bets back higher…,” Francesco Pesole, FX strategist at ING, has said, adding: “Solid data and hawkish Fed comments may help reinforce May Fed hike expectations.”\n\nIn other words, strong employment numbers may spell another rate hike in May, while a decline in US employment may mean a softer approach by the Fed in future. Historically, crypto performs better in a low interest rate environment.\n\nYesterday’s Crypto AM Daily in association with Luno\n\nIn the markets\n\nThe Bitcoin economy\n\n*Data can be found at https://terminal.bytetree.com/\n\nTotal crypto market cap\n\nThe total capitalisation of the entire cryptocurrency market this morning was $1.174 trillion.\n\nWhat Bitcoin did yesterday\n\nWe closed yesterday, April 2, at a price of $28,199. The daily high yesterday was $28,518, and the daily low was $27,884.\n\nBitcoin market capitalisation\n\nBitcoin’s market capitalisation this morning was $548.billion. To put it into context, the market cap of gold is $12.968 trillion and Tesla is $656.42 billion.\n\nBitcoin volume\n\nThe total spot trading volume reported by all exchanges over the last 24 hours was $14,821 billion. High volumes can indicate that a significant price movement has stronger support.\n\nVolatility\n\nThe price volatility of Bitcoin over the last 30 days is 67.37%.\n\nFear and Greed Index\n\nMarket sentiment today is 63, in Greed.\n\nBitcoin’s market dominance\n\nBitcoin’s market dominance today is 47.83. Its lowest ever recorded dominance was 37.09 on January 1 2018.\n\nRelative Strength Index (RSI)\n\nThe daily RSI is currently 61.34. Values of 70 or above indicate that an asset is becoming overbought and may be primed for a trend reversal or experience a correction in price – an RSI reading of 30 or below indicates an oversold or undervalued condition.\n\nSoundbite of the day\n\nBitcoin is not fentanyl; there are no legal grounds to disallow its existence. Nor are there moral grounds. Unless, of course, you are terrified that people will lose confidence in your currency and banking system, which is a scenario playing out in the banking crisis and bank failures in the US and beyond. Steven Sidley, Director of Bridge Capital Future Advisory\n\nWhat they said yesterday\n\n🟠\n\nIn the past ten years, April has been the best month for bitcoin in the first half and third-best for the full year. Reports @godbole17.https://t.co/5kL5bSFwAA — CoinDesk (@CoinDesk) April 3, 2023\n\n🧐\n\n👀\n\n“The only thing you can do with #Bitcoin is sell it to someone else.”\n\n\n\n>> Yes, this is called money. — Joe Burnett (🔑)³ (@IIICapital) April 2, 2023\n\nWould you like to help spread the adoption and education of Bitcoin in the UK and even stack some Sats while you’re doing it? Well, now you can!\n\nThe Bitcoin Pioneers community, backed by Barry Silbert’s Digital Currency Group, was created to introduce Bitcoin to a mainstream audience in a meaningful way and now has members right across the UK.\n\nWe share tips, stories and ideas on how to encourage others to try Bitcoin for the first time. And, thanks to support from Luno, each Pioneer gets £500 of Bitcoin a month to share with beginners, helping them get started.\n\nSo, if you’re passionate about Bitcoin, why not join today? Click here to find out more!\n\nAll feedback on Crypto AM Daily in association with Luno is welcome via email to James.Bowater@cityam.com 🙏🏻\n\nCrypto AM: Editor’s picks\n\nChatGPT urges crypto conference panel not to become over-reliant on AI\n\nMt. Gox customers will have to wait until November to recover lost Bitcoin funds\n\nSam Bankman-Fried: A tissue of lies soaked with fake tears?\n\nThree-in-four wealth managers are gearing up for more cryptocurrency exposure\n\nCrypto.com granted FCA licence to operate in UK\n\nQ&A with Duncan Coutts, Principal Technical Architect at IO Global\n\nJamie Bartlett – on the trail of the missing ‘Cryptoqueen’\n\nMPs are falling silent over potential of cryptocurrency\n\nErica’s ‘Crypto Wars’ handed honours in Business Book Awards\n\n‘Let people invest’: Matt Hancock makes case for liberal crypto rules\n\nCrypto AM: Features\n\nCrypto AM: Founders Series\n\nCrypto AM: Industry Voices\n\nCrypto AM: Contributors\n\nCrypto AM: In Conversation with James Bowater\n\nCrypto AM: Tomorrow’s Money with Gavin S Brown\n\nCrypto AM: Mixing in the Metaverse with Dr Chris Kacher\n\nCrypto AM: Visions of the Future, Past & Present with Alex Lightman\n\nCrypto AM: Tiptoe through the Crypto with Monty Munford\n\nCrypto AM: Taking a Byte out of Digital Assets with Jonny Fry\n\nCrypto on the catwalk\n\nCrypto AM: Events\n\nCautionary Notes\n\nIt’s definitely tempting to get swept up in the excitement, but please heed these words of caution: Do your own research, only invest what you can afford, and make good decisions. The indicators contained in this article will hopefully help in this. Remember though, the content of this article is for information purposes only and is not investment advice or any form of recommendation or invitation. City AM, Crypto AM and Luno always advise you to obtain your own independent financial advice before investing or trading in cryptocurrency."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiOGh0dHBzOi8vYml0Y29pbmlzdC5jb20vYml0Y29pbi11cC1mb3ItZ3JhYnMtb24tdGhlLW1vb24v0gE8aHR0cHM6Ly9iaXRjb2luaXN0LmNvbS9iaXRjb2luLXVwLWZvci1ncmFicy1vbi10aGUtbW9vbi9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 12:48:43 GMT",
        "title": "Bitcoin Up For Grabs On The Moon: SpaceX, LunarCrush To Send Crypto To The Lunar Surface - Bitcoinist",
        "content": "A prominent cryptocurrency company, LunarCrush, has stated that in the fall of this year, it will send a private key to a bitcoin wallet holding 62 BTCs to the moon via a SpaceX rocket.\n\nAccording to Joe Vezzani, CEO of LunarCrush, the purpose of this stunt is to “inspire people to establish networks that will unlock a new era of exploration.”\n\nA quote from his press statement reads:\n\n“It’s like Willy Wonka’s ‘golden ticket’ for the Web3 era, and we couldn’t be more excited to see how it all unfolds.”\n\n$1.7 Million Bitcoin Bounty On The Moon\n\nThe company guarantees the safety of the wallet, which includes around $1.7 million in BTC at the current price of the coin, because not even its employees will know the code.\n\nThe stakes can be raised, though, because the wallet is public and anyone can throw some cash into it.\n\nAccording to a recent official press release, the Bitcoin bounty, codenamed Nakamoto 1, will be available to the first person to reach the moon and retrieve the private key for a crypto wallet inscribed on the Lunar Outpost MAPP Rover.\n\nImage: AP/Twitter\n\nTreasure Hunt For 62 BTCs\n\nTo find the 62 Bitcoins will be like going on a treasure hunt, and this is a once-in-a-lifetime chance for crypto and treasure hunters to share a common interest.\n\nLaunch of the SpaceX Falcon 9 rocket carrying the rover and its cryptocurrency haul is scheduled for June.\n\nMAPP will be sent to the moon and set up near the south pole so that Nokia’s wireless network may be tested for two weeks, Futurism.com said.\n\nThe rover will be left in the hands of any interested extraterrestrial crypto seekers after its mission is complete.\n\n“When you put out a seemingly unachievable goal, the innovation that happens can be incredible. Our goal is to inspire people to build communities that will unlock a new era of exploration,” Vezzani said.\n\nDr. Forrest Meyen, chief strategy officer at Lunar Outpost, claims that seemingly fantastic ideas can actually lead to discoveries of previously uncharted territory beyond human consciousness.\n\n“Future generations will look to us as pioneers of interplanetary exploration and adventure,” Meyen said.\n\nBTCUSD nearly halfway in reaching the $29K level. Chart at TradingView.com\n\nLunarCrush’s bold decision to send a crypto wallet’s private key to the moon demonstrates the growing acceptance of digital currencies.\n\nDue to the decentralized structure and the independence it grants users, cryptocurrencies have seen explosive growth in popularity in recent years.\n\nThe effort by LunarCrush and SpaceX exemplifies how cryptocurrency can be used to fuel innovation and adventure in previously unimaginable dimensions.\n\n-Featured image from Finance Magnates"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi10by1mYWNlLWEtbmV3LWJhbGxnYW1lLWlmLWl0LWJyZWFrcy0zMGstcmVzaXN0YW5jZS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 02 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin to face a 'new ballgame' if it breaks $30k resistance - Finbold - Finance in Bold",
        "content": "Bitcoin’s (BTC) recent momentum appears to have paused below $30,000 after the asset capitalized on trouble in the traditional finance sector, especially the fallout from the banking crisis. Analysts maintain that breaching the $30,000 resistance level will likely be monumental for the maiden cryptocurrency based on historical price movement.\n\nIn particular, crypto analyst Matthew Hyland observed in a tweet on April 2 that $30,000 has acted as Bitcoin’s significant resistance and support level for the last two years. Therefore, the analyst projected that if Bitcoin managed to flip the position, it could potentially mean a “whole new ballgame.”\n\n“Bitcoin has been consolidating below the biggest resistance/support of the last 2+ years. A whole new ballgame if BTC breaks it,” he said.\n\nBitcoin price analysis chart. Source: TradingView\n\nAt the same time, Hyland noted that the NASDAQ and S&P 500 indices had shown impressive strength, closing the week positively. Despite this, he pointed out that there is still a sense of major pessimism and disbelief in the market, with many investors wary of the current economic climate.\n\nSimilarly, a Bitcoin analyst by the Twitter pseudonym Stockmoney Lizards called for patience in the crypto market, noting that the asset faces resistance at $30,000. He also suggested that if the resistance is breached, Bitcoin will likely skyrocket.\n\nBitcoin price analysis chart. Source: TradingView\n\nBitcoin’s momentum stalls\n\nIndeed, Bitcoin’s rally has stalled in the wake of renewed regulatory concerns in the crypto market. The latest incident saw the United States Commodity Futures Trading Commission (CFTC) suing Binance for allegedly breaking trading and derivatives rules.\n\nFollowing the scrutiny, Binance pointed out that it does not agree with the characterization of many of the issues alleged in the complaint.\n\nMeanwhile, Bitcoin’s price trajectory in 2023 has elevated the asset to emerge as the best-performing asset class. The crypto gained approximately 70%, beating traditional finance products such as gold and the Nasdaq 100 index.\n\nWith a focus on Bitcoin’s next price movement, the odds seem to favor the possibility of hitting $30,000 in the coming weeks. As per a Finbold report, machine learning platform PricePredictions forecasts that Bitcoin can trade at $30,697 on April 30, 2023.\n\nBitcoin price analysis\n\nBy press time, Bitcoin was valued at $28,441 with daily losses of about 0.05%. On the weekly chart, BTC is up over 2%.\n\nBitcoin seven-day price chart. Source: Finbold\n\nDespite Bitcoin hitting a minor barrier on the daily chart, the asset’s one-day technical analysis retrieved from TradingView is dominated by bullishness. A summary of the gauges recommends “buy” at 13, while moving averages are for the “strong buy” sentiment with a score of 13. For oscillators, they recommend selling gauging at 2.\n\nBitcoin one-day technical analysis. Source: TradingView\n\nThe bullish sentiments are also backed by activity around Bitcoin’s options contracts. Finbold reported on March 31 that investors were flocking to trade in Bitcoin and Ethereum (ETH) following a spike of about 430% in the opened interest year-over-year basis.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vZmluYm9sZC5jb20vdGhlLXJpc2Utb2YtZGlnaXRhbC1nb2xkLWJpdGNvaW5zLWNvcnJlbGF0aW9uLXRvLWdvbGQtaGl0cy1tdWx0aS15ZWFyLWhpZ2gv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "The rise of digital gold: Bitcoin's correlation to gold hits multi-year high - Finbold - Finance in Bold",
        "content": "Bitcoin’s (BTC) correlation with gold reached a multi-year high last week and is presently above 50%, exceeding its correlation with U.S. stocks.\n\nIndeed, Bitcoin has withstood the current instability in the financial industry and mounting regulatory uncertainty very well, skyrocketing by over 70% YTD, greatly surpassing traditional asset classes as they see ‘digital gold’ as a potential store of value.\n\nTogether with on-chain statistics indicating a growing percentage of Bitcoin long-term investors, this may suggest that Bitcoin’s appeal as a haven asset is on the ascent, according to data from Kaiko published on April 3.\n\nGold climbs 8% since March bank crisis began\n\nNotably, both the flagship digital asset and the precious metal suffered significant declines last year. However, gold has also seen a price increase of 8.6% since the collapse of Silvergate on March 8 brought about the banking crisis, bringing the price closer to its all-time high of $2,000, which was obtained shortly after the start of Russia’s invasion of Ukraine.\n\nWith Kaiko noting back in October:\n\n“After benefiting heavily from the Russia-Ukraine conflict in the first quarter of the year, gold has lost all its gains and is currently down 10% YTD. Bitcoin has also declined double-digits this year dragged down by global monetary policy tightening.”\n\nOn top of that, “gold has failed to act as a safe-haven asset i.e., an asset that is expected to retain or gain in value during periods of economic downturn,” in spite of “core inflation remaining persistently high.”\n\nBitcoin and tech stocks\n\nMeanwhile, huge macro investors have already decreased their risk for the most part, which might explain the weakening connection with tech stocks.\n\nWhile the Nasdaq 100 has officially entered a bull market (up 20% or more from its December lows), volatility has decreased. After FTX’s collapse, the disparity between crypto and U.S. stock market volatility has become wider and wider.\n\nAs market depth has been low for more than a month, increased BTC volatility may be attributed in part to a lack of liquidity. Since Binance, the biggest and most liquid exchange, faces regulatory restrictions that might increase risk aversion among market makers, this situation is not likely to change.\n\nKiyosaki says to buy Bitcoin and Gold\n\nAmid concerns over the potential economic collapse Robert Kiyosaki, the author of the best-selling personal finance book “Rich Dad Poor Dad,” has warned about the state of the global economy, citing the United States Federal Reserve decisions as the catalyst for an imminent market crash.\n\nKiyosaki believes alternatives exist to cushion investors against the effects of a possible economic crash, highlighting Bitcoin and precious metals, such as gold and silver, are valuable assets to protect against mounting inflationary pressures.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMiRGh0dHBzOi8vZW4uY3J5cHRvbm9taXN0LmNoLzIwMjMvMDQvMDMvYml0Y29pbi1saXRlcmFsbHktdG8tdGhlLW1vb24v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin literally \"to the moon\" - The Cryptonomist",
        "content": "“To the moon” is one of the slogans popular with those who believe that in the future the market value of Bitcoin may explode and skyrocket.\n\nBut there is one initiative in which “to the moon” referred to Bitcoin takes on a whole other, literal meaning instead.\n\nBitcoin “to the moon”: what happens?\n\nIt is an initiative of LunarCrush, i.e., a company that analyzes data and information about cryptocurrencies, NFTs, and social media actions.\n\nAs the official press release published a few days ago reveals, LunarCrush wants to send a 62 Bitcoin “treasure chest” to Earth’s natural satellite, namely the Moon.\n\nRight now 62 BTC have a market value of about $1.7 million.\n\nThe “treasure chest,” named Nakamoto_1, will be opened by the first space traveler to reach the Moon and retrieve the private wallet key engraved on a Lunar Outpost MAPP Rover that will be launched into space by the end of 2023 by a SpaceX rocket. For security reasons, the exact launch date has not yet been revealed.\n\nOnce the Lunar Outpost MAPP Rover lands on the Moon, anyone can go to it to read the private key engraved on it, and thus unlock the 62 Bitcoin “treasure chest.”\n\nThis initiative has been made possible through a partnership with Lunar Outpost, which will physically take care of sending the rover to the Moon.\n\nLunar Outpost is a company founded in 2017 that focuses on commercial space robotics, lunar surface mobility, and in-situ resource utilization. Lunar Outpost’s flagship rover is indeed MAPP (Mobile Autonomous Prospecting Platform), which is expected to be the first commercial rover to reach the lunar South Pole.\n\nThe initiative also involves collaboration with animation studio Golden Wolf and Bitcoin developer tools company Hiro, which partnered with LunarCrush to bring Nakamoto_1 to life.\n\nThe mission will be funded through the sale of a specially created collection of NFTs.\n\nThe process of engraving the private key on the rover will be fully documented, so it will be transparent and ensure that no one, including the teams working on the project, will be able to acquire it prematurely.\n\nThe NFT collection\n\nTo fund the entire initiative, LunarCrush will sell a special collection of NFTs secured by Bitcoin: 25% of the sales will go to fund the treasure chest and another 25% will go into a “community marketing wallet that will go to fund grassroots development on Bitcoin.\n\nNFTs will be priced at $250 each. Any sales of these NFTs on the Gamma secondary market will further increase the value of the treasure chest sent to the Moon.\n\nAs is evident, this is an advertising initiative, and indeed those who will benefit the most will be the astronaut who can read on the lunar rover the private key to the address on which the 62 BTC will be deposited.\n\nGolden Wolf CEO Ingi Erlingsson said:\n\nComments on the initiative\n\n“We loved the idea that the art could inspire a new generation of young people to look to the stars, like a contemporary version of an Apollo 11 poster on a bedroom wall. We wanted the aesthetic to feel modern and unique, with a hint of vintage sci-fi art.”\n\nLunarCrush CEO Joe Vezzani said:\n\n“When you put out a seemingly unachievable goal, the innovation that happens can be incredible. Our goal is to inspire people to build communities that will unlock a new era of exploration. We envision classrooms, groups, companies, and even DAOs coming together to reach the Moon and split the treasure chest’s rewards. It’s like Willy Wonka’s ‘golden ticket’ for the Web3 era, and we couldn’t be more excited to see how it all unfolds.”\n\nLunar Outpost co-founder and Chief Strategy Officer Dr. Forrest Meyen added:"
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd3d3LmdpYW50ZnJlYWtpbnJvYm90LmNvbS9zY2kvYml0Y29pbi1mb3J0dW5lLWF2YWlsYWJsZS1tb29uLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 03 Apr 2023 07:00:00 GMT",
        "title": "Bitcoin Fortune Available For Anyone But It's Going To Be A Long Trip - Giant Freakin Robot",
        "content": "A company called LunarCrush will be sending bitcoin to the Moon by engraving a passcode to a crypto wallet on its rover.\n\nBy Kevin C. Neece |\n\nA company called LunarCrush will be sending bitcoin to the Moon by engraving a passcode to a crypto wallet on its rover, set to launch to the lunar south pole. Gizmodo reports that later this year, a SpaceX rocket will carry the Mobile Autonomous Prospecting Platform, aka MAPP Lunar Rover rover to the Moon, landing it there for a thankfully more scientific purpose than drawing cryptocurrency pirates into literal orbit: bringing the Internet to the lunar surface. The plan for the mission is to test mobile communications signals on the Moon’s surface, as part of a bid to establish the first 4G network in space.\n\nThe rocket bringing bitcoin to the Moon was designed by Lunar Outpost, which has been making physical payload space and sponsorship opportunities available on its lunar lander for some time, and has also been attempting to commoditize space by selling NFTs. While this scheme might be a way to help fund the mission at present, crypto values vary wildly, so the 62 bitcoin in the wallet, currently stated to be worth $1.5 million, could tank in value or—ahem—skyrocket by the time of the launch, let alone by some future date when someone can get to the Moon to retrieve the passcode. For that presently incredibly fanciful goal to be cost-effective, of course, bitcoin would have to become basically the most valuable investment in existence.\n\nAs Gizmodo reports, Joe Vezzanni, CEO of LunarCrush, said the bitcoin launch to the Moon was planned as a way to encourage innovation in space travel by creating an “unachievable goal.” We think the real unachievable goal might be rescuing cryptocurrencies from their association with environmental irresponsibility, unpredictable instability, and financial crime, but any effort toward the advancement of space travel is a good thing, right? LunarCrush certainly hopes so as it works to bring wi-fi to our nearest neighbor in our solar system.\n\nThat might sound nearly as useless as putting bitcoin on the Moon at first blush, but it serves an important scientific purpose. As NASA continues its push to the Moon begun by the unmanned Artemis I a few months ago, it wants to improve communication on the lunar surface and between astronauts and mission control, with the 4G network allowing live video streams and real-time communication with Earth. This would be a leap forward in NASA’s ability to communicate with its scientific exploration teams once human beings are again setting foot on the Moon.\n\nPutting bitcoin on the Moon might be a lesser goal, but we have to admit it’s got us thinking and talking about the very real scientific and exploratory purposes of lunar missions. The Moon has lots to share with us, from strange glass beads that might contain water to the possibility of growing plants to, as Star Trek predicted, a place to live. We think all the research, exploration, and technological advancement involved in reaching the Moon is a lot more interesting and important than advancing crypto piracy to ridiculous levels, but if putting bitcoin on the Moon can in any way help scientific efforts, we say go right ahead."
    }
]