[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMigAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzA0L2JpbmFuY2UtY29udHJvbGxlZC05Mi1vZi1iaXRjb2luLXNwb3QtdHJhZGluZy12b2x1bWUtYXQtZW5kLW9mLTIwMjItYXJjYW5lLXJlc2VhcmNoL9IBhAFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzA0L2JpbmFuY2UtY29udHJvbGxlZC05Mi1vZi1iaXRjb2luLXNwb3QtdHJhZGluZy12b2x1bWUtYXQtZW5kLW9mLTIwMjItYXJjYW5lLXJlc2VhcmNoL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Binance Controlled 92% of Bitcoin Spot Trading Volume at End of 2022: Arcane Research - CoinDesk",
        "content": "Chatter about the solvency of Binance increased significantly after the collapse of FTX, and the exchange did suffer some outflows for a short period, though its business has stabilized since. A market share this high could become problematic for the industry if Binance were to encounter any issues, whether regulatory or mistrust from users."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3LmFjb3Jucy5jb20vbGVhcm4vaW52ZXN0aW5nL2hvdy10by1pbnZlc3QtaW4tYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "How to Invest in Bitcoin - Acorns",
        "content": "Bitcoin — a type of cryptocurrency that first came onto the scene in 2009, and is now one of the largest and best-known digital currencies — frequently makes headlines with its high volatility.\n\nEven with the dramatic ups and downs that Bitcoin investors weather, buying a piece of the virtual asset is one way to diversify a portfolio. Diversification involves mixing up your investments so that you have a variety of different assets in your portfolio. If you experience losses in one area of your portfolio, gains in other areas can help cushion the blow.\n\nCryptocurrency isn’t the only way to diversify your portfolio, and it’s important to know the pros and cons before getting started. Let’s take a look at how investing in Bitcoin works so you can decide if it’s the right investment for you.\n\nHow does Bitcoin work?\n\nCryptocurrency isn’t issued or backed by a government entity the way the currencies like the U.S. dollar or the euro are. Digital currency is completely decentralized and doesn’t rely on a central bank. Instead, it runs on blockchain technology.\n\nThis is a database that’s managed by a huge computer network. Bitcoin transactions are processed together as a block and added to the database. It’s a permanent record that can’t be edited. If you buy or sell Bitcoin at any time, it will be visible on the blockchain.\n\nThis technology also allows for secure payments between buyers and sellers — no bank or other third party is necessary, and you don’t need to divulge any personal information. This doesn’t necessarily mean your cryptocurrency investments are “safe,” though — there are still risks, like volatility, potential hackers, and even exchange collapse (more on that later). And cryptocurrency is not FDIC insured.\n\n3 ways to invest in Bitcoin\n\nIf you’re interested in investing in Bitcoin, there are several ways to go about it, with pros and cons for each.\n\nBitcoin ETFs\n\nAn ETF is a basket of investments that trades like a stock. It typically tracks a market index, such as the S&P 500, and allows investors to buy a variety of securities (a term that just means types of investments you can buy and sell). What’s more, ETFs can provide built-in diversification at a relatively low cost.\n\nSome ETFs carve out space for cryptocurrencies. With Acorns, for example, you can choose to allocate up to 5% of your portfolio in a Bitcoin-linked ETF. Instead of investing directly in Bitcoin, it invests in Bitcoin futures. This gives you some exposure to Bitcoin by investing in its potential value, without actually having to own a piece of the cryptocurrency itself. That’s important given cryptocurrency’s volatility and the other potential risks of investing directly in Bitcoin.\n\nBitcoin trading platforms\n\nYou can also invest in Bitcoin by buying individual coins, or pieces of coins, through cryptocurrency exchanges. Some recognizable names include Binance, OKX, and Coinbase. Some areas have Bitcoin ATMs that allow you to buy bitcoin with a credit card or cash.\n\nIt’s important to know that cryptocurrency trading platforms have been in the headlines recently as several large exchanges have collapsed. Investors who use an exchange that collapses are at risk of losing their money.\n\nOnce you’ve bought a piece of Bitcoin, you store it in a digital wallet. Each exchange typically offers its own crypto wallet. There are two different kinds of wallets: “hot” and “cold” wallets.\n\nHot wallets are connected to the internet and accessed through your phone, but can come with security risks. If a hacker gains access to your wallet, or the exchange your wallet is connected to collapses, your Bitcoin could be lost for good.\n\nA cold wallet, on the other hand, isn’t connected to the internet. An external flash drive or hardware wallet are good examples of cold wallets. Cold wallets can be more secure, though accessing your Bitcoin may feel more cumbersome, and it’s possible to misplace it because it’s a physical item.\n\nTo access your wallet, you use a pair of virtual keys. A public key receives transactions, and a private key accesses your Bitcoin and proves your ownership. It’s the only way you can retrieve your digital assets. If you lose it, there’s no password recovery function to get it back, and if someone steals it, they could access your Bitcoin and transfer it elsewhere.\n\nBitcoin-related stocks\n\nAnother way to get Bitcoin exposure in your portfolio is by investing in Bitcoin-related companies that are publicly traded. Bitcoin-adjacent companies could include those that are involved in Bitcoin mining (a term that describes digitally creating new Bitcoin), the exchanges themselves, or even payment companies that support the buying and selling of Bitcoin.\n\nIf it’s a public company, and it makes money by interacting in some way with Bitcoin and other cryptocurrencies, buying shares is one way to add Bitcoin exposure to your portfolio. Of course, if that company isn’t doing well, your investment could take a hit.\n\nIs Bitcoin volatile?\n\nWhen it comes to investing, there’s a direct relationship between risk and return. High-risk investments can have high potential returns — but they can also have great potential for loss.\n\nIt’s a balancing act. Having some exposure to risk can help investors grow their wealth and keep pace with inflation over the long term. At the same time, you may want more stable assets to mitigate risk. If you put all your savings into Bitcoin and it underperforms, what will that mean for your financial health?\n\nLike all cryptocurrency, Bitcoin is considered extremely volatile. It doubled its value in 2021, but then lost most of that gain in early 2022. The truth is that no investment is a sure thing. Diversifying your portfolio can protect you against market volatility.\n\nIs investing in Bitcoin right for you?\n\nBefore you put all your money into Bitcoin, take a step back and think about what you want to get out of investing. Your investment strategy will likely be determined by your age and risk tolerance. Your long-term financial goals are equally important.\n\nThere’s a learning curve that comes with investing in cryptocurrency like Bitcoin. And just like any other investment, returns are never guaranteed."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vYmxvY2t3b3Jrcy5jby9uZXdzL2JpdGNvaW4taGFsdmluZ3MtYnVsbC1tYXJrZXTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Halvings Are Bull Market Things — Will This Time Be Different? - Blockworks",
        "content": "This bear market is brutal. Top cryptocurrencies are down more than 70%, dramatic bankruptcies have left potentially millions out of pocket and bitcoin miner capitulation looks more likely by the day.\n\nBut just how brutal? Previous boom-and-bust cycles add perspective.\n\nBlockworks analyzed bitcoin price data stretching back to 2010 — when bitcoin (BTC) was worth a fraction of a dollar — to model exactly how long each bull and bear market lasted.\n\nThe current bear market has lasted 335 days, so far, dating back to Feb. 3, 2022. Bitcoin has fallen nearly 55% since, from nearly $36,300 to a low of $15,550.\n\nWe’re not quite in the territory of the longest bitcoin bear market on record. That title belongs to the previous big bear, a 390-day stretch between Feb. 21, 2018 and Mar. 18, 2019. Bitcoin tanked from $10,250 to a local bottom of below $3,200 over that period, a 70% drop.\n\nOur methodology: We mapped existing definitions for the start of a bear market from the traditional finance world. So, a bear market begins when an asset trades 20% below its recent high for more than two months.\n\nRiffing on this metric, a bear market ends when an asset trades 20% above its recent low for one month or more. And, for the purposes of this (basic) exercise, a bull market begins as soon as a bear market is no more.\n\nGreen is for bull, red is for bear | Chart by David Canellis\n\nIt’s an imperfect model for crypto bear markets overall, considering we’ve only charted bitcoin. But considering BTC persists as the ecosystem’s bellwether asset, it serves as a decent guide.\n\nBut here’s what it does mean: We’re around two months shy of the longest bitcoin bear market.\n\nEver.\n\nNot like the other bears\n\nTo Peter Eberle, chief investment officer at crypto investment firm Castle Funds, bitcoin is in a stronger position now than in previous prolonged down periods.\n\nSo much leverage has already been unwound across the board by defunct crypto lenders and exchanges, and embattled firms have already liquidated quality assets, such as bitcoin and ether, to meet redemptions.\n\n“A big difference that we have seen between the bear market of 2018-2019 is how this time institutions did not back away from projects that they were building,” Eberle told Blockworks. “In 2018, most institutions building BTC infrastructure just gave up because they believed the industry was dead. This time they may have put the brakes on some projects, but they did not abandon them.”\n\nIn making his care, Eberle highlighted major moves forward from the likes of Fidelity, which launched commission-free crypto trading for retail clients last November. BNY Mellon also shared plans to custody bitcoin for clients.\n\n“These two developments have enormous implications, but were overshadowed by the FTX fraud,” Eberle said.\n\nDreams of endlessly cyclical bull runs are dampened by dreary economic factors. Increased rates to curb inflation mixed with slowed spending and ongoing war in Europe uniquely overshadow our current bear market.\n\nBull run returns are getting smaller every cycle | Chart by David Canellis\n\nTo Vivek Raman, head of proof-of-stake at research unit BitOoda, this bear market’s first punch was a resulting paradigm shift in macro markets, to which previous cycles didn’t have to contend.\n\nMarkets transitioned from an era of easy monetary policy since the 2008 financial crisis — low rates and high liquidity — to one of higher rates, rising cost of capital and stricter monetary discipline, Raman said.\n\n“As a result, assets that thrived in the former environment were high growth and not necessarily high cash flow – we saw tech companies soar, valuations from [venture capitalists] soar, and this permeated into a lot of crypto assets performing very well without underlying fundamental value.”\n\nThose perks are long gone, thanks to the Fed’s aggressive rate hikes. Raman reasoned the Fed is likely to slow or pause additional increases to renormalize the economy by tamping down soaring inflation. But there have been “thriving bull markets in eras of higher rates,” according to Raman, including periods of the 1990s and 2000s.\n\nLex Sokolin, chief cryptoeconomics officer at ConsenSys, told Blockworks that investors are largely risk-averse and waiting for a recession. That makes relying on consumer discretionary spending or stimulus-led savings to bail out crypto prices difficult, he said.\n\n“Instead, we will need to see organic growth from Web3 and real economic activity,” Sokolin said. “One of the most relevant metrics would be smart contract usage, which is the core value proposition of Web3 — automated economic protocols.”\n\n450 days to go until Bitcoin halves\n\nOne cycle theory posits that bitcoin bears and bulls are tied to its halving schedule. Every four years, block mining rewards are reduced by 50% — slashing issuance as bitcoin approaches its 21 million supply limit.\n\nEvery single halving has occurred during the early innings of a bull market leading up to a significant run one year later.\n\nThe one in 2016, when bitcoin was worth a few hundred dollars, preceded a major charge to $20,000 in late 2017. And when Bitcoin halved in 2020, the asset was worth around $9,000 — by Nov. 2021, it traded close to $70,000.\n\nBitcoin’s next halving — a date difficult to pin down — is right now expected sometime in April of 2024. That gives Halving-Truthers at least half a year more of depressed market action before their pre-programmed bullishness triumphantly returns.\n\nAn end to the bitcoin bear market can’t come soon enough for miners, whose livelihoods are inextricably linked to the protocol’s halving schedule. Katie Talati, director of research at investment firm Arca, told Blockworks that capitulating miners wielded much larger influence over the price of bitcoin last cycle.\n\nSo, too, did Asian crypto markets, anchored in more than 70% of the bitcoin hash rate being housed in China at times. The West has been increasingly dominant in the bitcoin market ever since China’s renewed crypto crackdown in 2021.\n\n“There are a lot of things that factor into bitcoin’s price,” Talati said. “The halving definitely has an impact because it changes a lot of those factors, it changes the economics of the game and makes production more expensive.”\n\nFourth time’s the charm? | Chart by David Canellis\n\nTalati’s take is that bitcoin is going to go back up at some point — along with Eberle and Raman. But Talati sees a future where something more tangible, such as demand for Ethereum block space, may one day determine overall crypto market sentiment, making ether crypto’s bellwether digital asset over bitcoin.\n\nIn the meantime, all eyes are on what contagion might still remain from FTX, Eberle said.\n\nMore companies could well go bust before this bear market wraps, according to Raman — which could mean further downward pressure from ensuing asset liquidations.\n\n“The hardest part isn’t determining whether we will have another bull market – all markets will be cyclical – but it’s knowing when the bear cycle will end, since each bear market has different circumstances,” Raman said.\n\nHe pointed to signs of a macro bottom: Fed pausing its rake hikes, normalized inflation and restarting moderate monetary stimulus.\n\nA crypto bottom: apathetic sentiment (worse than the current “attack and anger” phase, in which most people forget about crypto altogether) and renewed institutional capital (ETH staking withdrawals could do the trick), as well as new users and use cases, plus regulatory clarity.\n\nAnd don’t forget the 2024 halving, “since BTC halvings tend to coincide with new bull markets.”\n\nDon’t miss the next big story – join our free daily newsletter."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ob3ctdG8tYnV5LWJpdGNvaW4td2l0aC1hcHBsZS1wYXnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "How to buy Bitcoin with Apple Pay? - Cointelegraph",
        "content": "Cryptocurrency exchanges are introducing various ways to buy Bitcoin (BTC) using the Apple Pay payment method. This comes as a good move for Bitcoin adoption since the Apple Pay digital wallet accounts for more than 507 million mobile wallet downloads and a dominating market share of 43.5% in the United States mobile payments market.\n\nThis ability to now integrate and buy Bitcoin with Apple Pay paves new crypto opportunities for iPhone users. This article explains how to purchase Bitcoin and other cryptocurrencies using Apple Pay.\n\nWhat is Apple Pay digital wallet?\n\nApple Pay, introduced in 2014, is a mobile payment service for web payments using iOS and is supported by Apple products. It is most commonly used as an Apple Pay application on iPhones and Apple watches. It allows users to pay for music, movies and apps with one simple touch.\n\nWith the introduction of Near Field Communication (NFC) technology, offline stores are also now accepting Apple Pay leading to a surge in Apple Pay contactless payments. NFC is a proximity-based wireless connectivity technology that utilizes magnetic fields to enable communication between devices when they are brought near each other. Apple Pay is supported by thousands of apps and offline stores worldwide, allowing users to purchase numerous goods and services, as well as buy Bitcoin with their iPhone and Apple Watch using NFC.\n\nVarious ways to buy Bitcoin with Apple Pay\n\nWhile Apple does not directly have a Bitcoin or crypto integration on its devices, many popular applications and platforms facilitate transactions or transmissions of cryptocurrency. Here are the various ways to buy Bitcoin using Apple Pay.\n\nBuy Bitcoin with Apple Pay through Coinbase\n\nCoinbase is a U.S.-based crypto trading and investment platform which offers a range of services and enables users to buy, sell, exchange and store cryptocurrencies. Coinbase has been expanding its presence in the cryptocurrency space through partnerships with major giants like Visa and Mastercard for offering on and off ramp crypto trading through instant purchases with credit and debit cards.\n\nTo enable a more convenient option for iOS users, Coinbase in June 2021 introduced the purchase of Bitcoin using Apple Pay linked to a debit card. However, selling crypto and cashing out options are not available with this mode yet.\n\nSteps to buy Bitcoin using Apple Pay on Coinbase\n\nLogin to the Coinbase account on the website or app using a device supporting Apple Pay. Select Bitcoin in the cryptocurrency options. Enter the amount of Bitcoin to be purchased in the “Buy BTC” option. Select Apple Pay from the list of available payment methods. Confirm Bitcoin purchase using Apple Pay.\n\nIt is important to note that Apple Pay will appear automatically as a payment option if a Visa or Mastercard debit card is linked to the underlying Apple Pay digital wallet. If not, ensure to do so first before following the above steps.\n\nThe limit to purchase BTC using Apple Pay on Coinbase is dependent on the sum of the debit card’s transaction limit and Coinbase limits and also subject to change as per policy, geographical region and location. One can check these limits in the Coinbase app under Settings ETH), Litecoin (LTC) and Ripple’s XRP (XRP) can also be purchased using Apple Pay on Coinbase in a similar fashion.\n\nBuy Bitcoin with Apple Pay on Binance\n\nBinance first introduced and started providing Apple Pay integration to buy cryptocurrencies using credit and debit cards only to citizens of the United Kingdom and the European Economic Area (EEA). In December 2022, Binance announced Apple Pay (for debit cards only) to deposit USD and purchase crypto for U.S. account holders.\n\nThis opens avenues to not only purchase but also make Bitcoin and crypto investments using Apple Pay on Binance.\n\nSteps to buy Bitcoin using Apple Pay on Binance\n\nLogin to the Binance app on your iOS device. Click on “Wallet,” select U.S. dollar and deposit USD. Click “Add Payment Method” and add Apple Pay.\n\nEnter the amount of USD and tap “Deposit.” Add Apple Pay as the chosen payment method.\n\nProceed to purchase BTC or other cryptocurrencies with this deposit.\n\nIt is important to note that Apple Pay for the U.S. will only work for debit card integrations, while for U.K. and EEA, a credit card is an additional option. Also, there is a 3.75% fee applied to the deposit amount when using Apple Pay in the U.S. and approx 2% per transaction in the United Kingdom, subject to change as per policy. Users must ensure to check fee changes on the exchange they transact with.\n\nBuy Bitcoin using Apple Pay on BitPay\n\nBitPay is the largest Bitcoin and cryptocurrency payment service provider based in Atlanta, Georgia. It allows businesses, merchants and institutions to accept cryptocurrency payments and convert them to fiat currencies. BitPay gained massive popularity as it charges merchants flat 1%transaction fees in comparison to credit cards which are known to charge higher fees ranging to 3% and sometimes more.\n\nBitPay added Apple Pay in 2021 as a payment option to allow its users to buy, exchange and shop with BTC and other cryptocurrencies using Apple Pay digital wallet. BitPay does not allow in-app crypto purchases yet, but contactless crypto purchases using NFC are possible in-store and online using Apple Pay on supported devices.\n\nIn addition to Bitcoin, BitPay also supports popular stablecoins like USD Coin (USDC) and BinanceUSD (BUSD) for Apple Pay purchases. Users need to add their BitPay crypto debit card to Apple Pay and then can use Bitcoin to make purchases wherever Apple Pay is accepted globally. BitPay partnered with Simplex and Wyre to enable these Apple Pay payments.\n\nSteps to buy Bitcoin using Apple Pay on BitPay\n\nLogin to the BitPay app. Load BTC on your BitPay debit card. Add the BitPay Card to Apple Pay in the BitPay App.\n\nUse the BitPay card BTC funds to make purchases using Apple Pay.\n\nBuy Bitcoin with Apple Pay using MetaMask\n\nMetaMask, the Ethereum cryptocurrency wallet provider, also now allows users to purchase cryptocurrencies via Apple Pay. MetaMask announced its Apple Pay support in April 2022. Since this is not an integration with Apple directly, MetaMask users are redirected to Wyre, allowing them to make the payment via credit/debit card or through Apple Pay. Wyre is a cryptocurrency exchange that offers crypto to fiat via API and integrates with Apple Pay.\n\nMetaMask allows its Apple Pay users a maximum daily deposit limit of $400 into their wallet and charges a gas fee as well as its own transaction fees (0.875% of the transaction amount). Moreover, purchasing crypto through MetaMask allows users to use it across different decentralized applications (DApps) and Web3 services where MetaMask is available. However, in-store contactless purchases are still not available through this method.\n\nSteps to buy Bitcoin using Apple Pay through MetaMask\n\nLogin to your MetaMask account on browser or app. Set up Apple Pay via the app. Ensure Know Your Customer on the card connected with Apple Pay. Tap “Add Funds,” click “Buy BTC” and input the amount. Select Apple Pay as the payment method. Authenticate and complete the transaction.\n\nWhile the above four methods are quite known, there are many other wallets, exchanges and platforms where one can avail the benefits of buying Bitcoin with Apple Pay including and not limited to Exodus, Paxful, CEX.io, Lumi Wallet, Crypto.com and more. Users must acquaint themselves with terms, conditions, fees and others before selecting their preferred method.\n\nShould you buy crypto with Apple Pay?\n\nThere is no straight answer to whether or not users should choose to buy Bitcoin and other cryptocurrencies using the Apple Pay method. However, there are both benefits and drawbacks to doing so.\n\nThe positives include quick, easy and straightforward transactions. Apple Pay’s contactless payment method technology makes it a preferred payment method among millennials and Gen Z users in the United States. Apple Pay statistics claim that its contactless payment method is accepted by 85% of U.S. retailers for fiat payments. This user preference is also reflected by the multitude of crypto platforms, exchanges and wallets that are bringing in contactless Apple Pay integrations.\n\nHowever, the negatives to watch for include the threat of monetary loss due to scams, hacks and malware as well as crypto volatility which may incur frequent fluctuations in prices while making purchases. Therefore, users must make informed decisions and do thorough research before using various crypto payment methods available in the market."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy92aWRlb3MvMjAyMy0wMS0wNC90aGUtb3V0bG9vay1mb3ItYml0Y29pbi1pbi0yMDIzLXZpZGVv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Watch The Outlook for Bitcoin in 2023 - Bloomberg",
        "content": "00:00\n\nWhat do you think about the situation, especially in the last two months, essentially, that we find Bitcoin in, it hasn't budged since like November 8th, stuck around sixteen thousand and change. Why this incredible lack of volatility? This is true, but I'm just looking at the graph. You know, the big graph. Abigail, your correspondent, was showing just before the break, it was it was really fascinating when you look at it on that big scale like that, because you see what we've been pointing out for years and years, which is that you get these big trends with crept up and down and up and down these big waves that last for a few years and then back down and then another one and another one. And you know, we can't go on forever and ever. Right. We're not gonna be sitting here in hundreds of years time with with the same kind of pattern of waves. But it has held firm really well so far and is reflected in a really interesting report I read from the man group just before Christmas, which showed that a trend following strategy performed on Bitcoin and a theorem has outperformed buy and hold. It's been extremely effective. Really? That's what I've been doing for years and years. I buy as each new trend begins. And then once there's all the froth. And you always know when you're at the frothy time because everybody is going crazy about crypto. And that's the time I always start to think about selling. And, you know, so far that has worked several times in a row, as I say. You can't be sure that it will continue to work forever. But so far, always the waves. OK. So once we get out of this period of status, is it more likely we get a break to the up or downside, in your view? Glenn? Well, look, we can't definitively say that we've had the very last bit of downward movement, certainly loads of old chain data and and the various indicators that we use to try and see where we are in a cycle are telling us that we are pretty much at the bottom. But I know from past experience that even when the indicators tell you you're at the bottom, you might get one more lurch downwards. I mean, we've got a huge lurch downwards. You might remember, in 2020, just before the bull market began, because the pandemic caused everybody to panic and everybody rushed out of stocks and crypto. But then they rushed back into crypto in the big, big bull market began. So, yeah, as I say, you can't rule out another lurch downwards. But as I say, as a trend follower, I tend to wait until I see, you know, really clear signs that we're back at the beginning of an upward trend. For example, my personal account, I didn't really start buying until we got to about ten thousand dollars. And in 2020, the price had previously gone as low as I think about what was it, three or four thousand dollars? So I waited quite a while. I missed quite a lot of upside, but gotten with plenty more upside to go, of course. Glenn, what do you refer to? They they were rushing out and then rushing back into crypto. Who realistically are we talking about or are we talking about retail or are we talking about institutions? Is there still institutional buy in after all of the turmoil we have seen? There's no love of institutional buying right now, but I can pretty much guarantee that there will be again, simply because it's on their menu now. It's on their radar. And the report that I mentioned from Man Group here, of course, is huge asset manager was was very positive about the idea of crypto as an asset class. And the report even suggested actually that if you don't invest in crypto in the longer term, then you are in a sense exposed to it in a negative way. Because companies that you are exposed to might be pushed out of the market eventually by crypto will block chain based competitors. So, you know, that report was suggesting that that you kind of need to have exposure. I hope I'm not paraphrasing them too much, but that was what I took from it. Glenn, is it important to get regulation, you know, for for crypto or Bitcoin specifically because this crypto currency, it felt like was invented to circumvent that kind of centralized government control? Like, do we even want it? I want to see a lot more skepticism generally during the bull phase. I mean, we're never short of skepticism during the bad phases. But some people like the next guy that you've got coming on, Stephen Dale, who is kind of shouting about the negatives during the bull market. Nobody was listening to him then. They're all listening to him now, of course. But it's too late for that during the bull phases. We need people to look at things like Luna when you have 20 percent yields being offered on people's money. You know, I was looking at that at the time. People were asking me about it and I was thinking about something very suspicious. I don't know if there's a problem with the code, but 20 percent yield, you know, if it's in traditional finance, you would start asking serious questions. And the same needs to happen in crypto. People just shouldn't get too overexcited on the upside."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvd2h5LWJpdGNvaW4tbWluZXJzLW1hZGUtNi1iaWxsaW9uLWxlc3MtaW4tMjAyMi_SAWJodHRwczovL3d3dy5maW5hbmNlbWFnbmF0ZXMuY29tL2NyeXB0b2N1cnJlbmN5L3doeS1iaXRjb2luLW1pbmVycy1tYWRlLTYtYmlsbGlvbi1sZXNzLWluLTIwMjIvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "Why Bitcoin Miners Made $6 Billion Less in 2022? - Finance Magnates",
        "content": "Bitcoin, the oldest and largest cryptocurrency, closed last year with a loss of more than 60%. Additionally, the mining industry suffered from BTC's sharp price declines, with revenues falling 37.5% in 2022 to $9.55 billion.\n\nBitcoin Miners' Revenue Took a Dive in 2022\n\nAccording to Glassnode data, mining revenues stood at $15.3 billion in 2021. However, the high-profile collapse of the TerraUSD ecosystem in May and the FTX crypto exchange in November negatively affected the industry as a whole.\n\nMoreover, rising interest rates worldwide have increased pressure on risk assets, including equities. Cryptocurrencies, which are highly correlated with the stock market, have also begun to lose, negatively affecting the condition of digital assets mining companies.\n\nThe miners' daily revenue index reached a record high of $63 million in November 2021. However, by the end of 2022, it was at only $16 million, recording a very dynamic depreciation.\n\nKeep Reading OKX Joins Growing List of Crypto Exchanges with Singapore's MPI License\n\nDoug Brooks\n\nAccording to Doug Brooks, a Senior Advisor at XinFin Foundation, there are three main drivers for the strong decline in revenues: large increase in energy prices, lower value of Proof of Work currencies like Bitcoin and rising competition.\n\n\"There are more miners than ever now, some are even publicly listed companies, so there is less bounty for each miner since the pot size is limited,\" Brooks commented.\n\nBTC Miners' Debts Grow\n\nAs revenues and profitability declined, Bitcoin miners found it increasingly difficult to repay their liabilities. According to Luxor data, the debt-to-equity ratio has tripled for many popular and publicly listed mining companies.\n\nFor Core Scientific, one of the BTC miners from Wall Street, the ratio reached 26.7. In addition, Argo Blockchain (NASDAQ:ARBK), one of the world's largest miners, increased its debt, with the debt-to-equity ratio jumping to 8.7.\n\nBTC Miners Dept-to-Equity Rartio\n\nCore Scientific was $1.3 billion in debt as of 30 September 2022, ultimately leading to a bankruptcy filing. On the other hand, Greenidge and Stronghold decided to restructure their current liabilities. The total debt among the ten miners analyzed by Luxor reached nearly $3.5 billion.\n\nWill 2023 bring more debt and bankruptcies? According to Brooks, it \"can most certainly be expected in the mining industry this year, particularly if the prices of BTC and other PoW-based currencies drop even further.\"\n\n\"Any significant reduction in energy prices is not apparent and conversion to a more sustainable and cost-effective energy source, where possible, would take time and be costly. Many miners are already operating near or below break-even levels, so their survival until any significant price bounce must be in doubt. Any further increase in cost or reductions in revenues will accelerate the shutting down of those in the weakest positions,\" Brooks added.\n\nSignificant Losses of Bitcoin Mining Companies\n\nAlthough the largest publicly traded mining companies have not yet released their reports for the fourth quarter and the entire year of 2022, the most recent trading updates and third-quarter reports showed a significant deterioration in the industry's health.\n\nCanaan Inc. (NASDAQ:CAN), a cryptocurrency mining hardware manufacturer, reported a significant drop in revenue and net income in November. During the three-month period that ended on 30 September 2022, the computing solutions provider achieved a revenue of $137.5 million, which is 26% lower than in 2021. On top of that, net income slid 90% quarter-over-quarter to $8.6 million.\n\nBitfarms (NASDAQ:BITF), a cryptocurrency mining company, reported a decline in revenue in the same quarter, despite rising BTC production. The company mined 1,515 BTC in the third quarter, nearly 500 more than a year earlier.\n\nArgo Blockchain found itself on the brink of bankruptcy Bankruptcy Bankruptcy or insolvency constitutes a legal term and refers to being unable to repay debts. A business and a person can declare bankruptcy. When a person or company claims bankruptcy, it is described as a voluntary bankruptcy, and when your debtors force you into bankruptcy, it is referred to as involuntary. A voluntary bankruptcy occurs when the debtor or borrower, the party that owes the money files with the courts. Involuntary bankruptcy happens when your credits file a petition with the co Bankruptcy or insolvency constitutes a legal term and refers to being unable to repay debts. A business and a person can declare bankruptcy. When a person or company claims bankruptcy, it is described as a voluntary bankruptcy, and when your debtors force you into bankruptcy, it is referred to as involuntary. A voluntary bankruptcy occurs when the debtor or borrower, the party that owes the money files with the courts. Involuntary bankruptcy happens when your credits file a petition with the co Read this Term but it was rescued by a strategic deal with Galaxy Digital Holdings, Ltd, a financial firm focused on digital assets and owned by Mike Novogratz.\n\nBitcoin Network Difficulty Keeps Growing\n\nDespite the decline in profitability, the BTC price and the valuation of mining the Bitcoin network difficulty has continued to rise throughout 2022. It clearly shows that despite the harsh conditions, the industry's competition has constantly been increasing.\n\nBitcoin Network Mining Difficulty\n\nAt the beginning of 2022, it took 24 trillion hashes (TH) to generate a brand new Bitcoin, while 12 months later, the indicator reached a new all-time high of 37 TH. Since then, the difficulty of mining has decreased slightly to 35 TH but remains in the range of record highs."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vd3d3LnBvcHVsYXJtZWNoYW5pY3MuY29tL3NjaWVuY2UvaGVhbHRoL2E0MjAxMTE5NC9jcnlwdG8tbWluZS1ub2lzZS1tdXJwaHkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "Noise Pollution from Crypto Mining is Destroying This Town - Popular Mechanics",
        "content": "It was nearly midnight in late April when Lynell Morris’s husband, Michael, returned home after a shift at work.\n\nAs he fumbled his keys, the motion-sensing light on their front doorstep flicked on. His eye caught a glint of gold: a .22 bullet on his doormat. It seemed odd as he and Lynell own a different-​caliber firearm. Nevertheless, he brought it inside and set it on their kitchen table.\n\nA few days later, he remembered to ask Lynell about it. Immediately, she yelped, “Politics!” Neither Lynell nor Michael is running for office. But over the last few months, Lynell had become enmeshed in local politics after a cryptocurrency mine set up shop in their town of Murphy, North Carolina, in September 2021. “Mine” is a misnomer, as these facilities are clusters of computing units, solving complex problems to help transact and generate virtual currency, with large—and noisy—fans to cool them.\n\nSitting in the foothills of the Appalachian and Blue Ridge Mountains, Murphy is a lush oasis promising an uninterrupted soundtrack of nature, and attracting those who value that quiet. Within weeks of when the mine began running, angry residents started complaining about the incessant noise on Facebook and Nextdoor. They likened this new, pervasive sound to a highway, a jet engine on the runway, or a semi idling in their driveway, and said it was disrupting their sleep and eroding their sense of peace.\n\nThe Morrises are lucky. They only hear the mine from their home when there’s no other noise outside. But Lynell was frustrated by her neighbors’ stories and began speaking out on their behalf at bimonthly county commissioner meetings. “I take up for the underdogs,” she says. Lynell has always been a leader. Before moving to Murphy three years ago with the intent to retire there, she ran a small business with her husband. And, as she puts it: “I was blessed with a mouth.”\n\nLynell ran her mouth on April 18, at the Cherokee County (Murphy is the county seat) board of commissioners meeting. More than six months had passed since the mine began causing a disturbance, and she was fed up with the lack of transparency from her elected officials, who had yet to act upon the concerns of their citizens. Residents have three minutes to make a statement during the public comment period at these meetings. Lynell took the podium and spoke for more than 20 minutes, pressing the commissioners on why they’re backing the mine and what they’re planning to do to mitigate the noise.\n\nAfter the bullet appeared on her doorstep, she wondered if she had said too much. “I’m a Southern girl. I don’t scare easily,” she says. “It was a threat, nevertheless.”\n\nJuan Diego Reyes Murphy resident Lynell Morris. Juan Diego Reyes The bullet found on her front step.\n\nThe Sound of Cryptocurrency\n\nFollow Highway 64—or as the residents call it, the four-lane—east from town for about three miles. Turn right on Harshaw Place and left on Harshaw Road at the stop sign. Drive parallel to the highway for about half a mile, and you’ll see it on your left: large white boxes housing blue containers in a cornfield, partially surrounded by a gray wall. It looks out of place in western North Carolina, something so modern.\n\nAs you approach the mine, which is owned by the San Francisco-based firm PrimeBlock, you begin to hear the roar. During the day, its low-frequency hum—which, directly outside, may go up to 95 decibels—can make it seem like you’re next to a running motorcycle. From the mine, roads weave like a spider’s web. Harshaw Road continues east. Back at the stop sign, Mulkey Place goes straight. The two are bisected by Club House Road, which then turns into Poor House Mountain Trail. All the streets wind with hairpin turns up into the lush hills, splitting into side streets. Many houses off Harshaw, Mulkey, and Poor House Mountain surround what used to be the 18-hole Cherokee Hills Golf and Country Club, which closed at the end of 2016.\n\nSound travels in waves and tends to travel farthest in open landscapes. And low-frequency sounds, like the rumble from the crypto mine, travel farther than high-frequency sounds (think: a scream, or nails on a chalkboard) because the longer waves of a low-frequency noise cover more ground before losing energy. In Murphy, residents who can hear the indelible hum most prominently live near an unobstructed path from it. During winter, the noise gets worse without leaves on trees to help absorb the sound. But year-round, residents living up to a mile away from the mine can hear it.\n\nIn December, Lynell and fellow resident Cyndie Roberson started a private Facebook group for people to share their experiences and grievances. In a town of about 1,855 people, up to 800 families live within a mile of the mine.\n\nMany residents have installed apps on their phone to track the sound levels. It’s so loud that Gene Johnson, whose ears were damaged during his stint in the military and who now wears hearing aids, can still hear the low rumble when the aids come out. He lives on Beaver Ridge Trail, which breaks off Harshaw immediately after you pass the mine. It’s so loud that Mike and Jennifer Lugiewicz, who lived two houses down from the mine, could watch but not hear their neighbor mow their lawn. (They have since moved to be farther from the mine.) The din can hide the sound of cars, so now Shannon Coleman helps her mom, who lives a half mile past the mine on Harshaw, retrieve the mail from her box across the street on a blind turn. Her mother, who is legally blind, can’t discern the sound of an oncoming car from the sound of the mine, and fears getting hit.\n\nJuan Diego Reyes Murphy resident Gene Johnson says he can still hear the mine without his hearing aids.\n\nThe noise, residents say, is especially terrible at night and early in the morning, when it wakes them up. Some say it’s caused them to become depressed and anxious. They’ve been showing up, as Lynell has, to county commissioners meetings bedraggled, frustrated, and angry that their elected officials have done very little to protect their health.\n\nPatricia Callahan lives in the townhouses on Club House Road. Her unit is the closest to the mine, about a quarter mile away as the crow flies.\n\nCallahan moved to Murphy three years ago, after completing a work-study program at the John Campbell Folk School, an artisan school for adults just outside Murphy, in Brasstown. Her youngest had just left for college, and Callahan was looking for a spot where she could retire. She was taken by Murphy’s art scene, but more importantly, the tranquility, and decided to buy in Murphy. After her real estate agent showed her the townhouse, Callahan sat outside at its picnic table and thought, “I have found my peace and quiet.”\n\nThose qualities were crucial for Callahan. A car accident 15 years ago left her with a brain injury, post-traumatic stress disorder, and depression. “I arranged my life to keep my stress low,” she said. “My whole body will go into a hypervigilant fight-or-flight mode when I’m around too much noise.”\n\nWhen the mine came online last fall, Calla han’s way of life was upended. She used to open the windows at night to cool her bedroom (she prefers not to use air conditioning because she lives on a strict budget), but she must close her windows now to lower the noise. Even that, along with wearing noise-canceling headphones, is not enough. The only time she’s been able to get a good night’s sleep is when she’s in a hotel or camping.\n\nThe noise is a constant, Callahan says. “It’s more than just my hearing. It affects my whole body, triggering PTSD symptoms,” she says. Many older residents with underlying health issues who have retired in Murphy express a similar sentiment: The noise and sleep interruptions caused by the mine are making their conditions worse.\n\nCallahan says she can’t sell her house to move somewhere quieter. “Nothing is within my budget,” she says. “I’m trapped here.”\n\nMining New Money\n\nCryptocurrency is a digital form of currency that can be used like cash or a credit card. Unlike the U.S. dollar, there is no central authority that prints more coins, or maintains the value of a cryptocurrency. This lack of oversight and regulation is appealing to many who wish to grow their wealth without traditional banking institutions.\n\nBitcoin became the first viable cryptocurrency in 2009, and over the last 13 years, demand for cryptocurrencies has only skyrocketed. Now, there are more than 10,000 cryptocurrencies valued around $1 trillion in total, and a 2021 Pew Research study found that one in six Americans use them. “There is a general movement of making finance more for the people,” Matteo Benetton, PhD, an assistant professor of finance at University of California, Berkeley, says of cryptocurrency’s appeal. Cryptocurrency mining is computers solving complex algorithms to record crypto transactions that prevent people from spending their currency more than once. After a certain amount of work, a mine is paid in newly created cryptocurrency. This computing relies on an astronomical amount of power. The Murphy mine, according to Scott Wade, the head of operations at Exponential Digital, the company that operates the mine and was acquired by PrimeBlock last January, uses anywhere from 5 to 15 megawatts annually, enough to power up to 13,500 homes. (A gaming laptop, by comparison, would use 0.02 megawatts running year-round.)\n\nJuan Diego Reyes The PrimeBlock crypto currency mine on October 14, 2022. A section of the partial enclosure can be seen in the background.\n\nUp until 2021, most of the world’s crypto mines were housed in China. But when the country banned the use and mining of cryptocurrency that fall—largely because of the Chinese government’s fear that cryptocurrencies are a gateway to financial crime and have a negative impact on the environment—miners flocked to the U.S. According to the Bitcoin Mining Map developed by the University of Cambridge in the U.K., the U.S. now makes up the majority of the total global hashrate, or the computational power processing cryptocurrency transactions.\n\nIn the U.S., crypto companies generally set up shop in places like the Finger Lakes region in upstate New York, eastern Washington, South Dakota, and towns like Murphy along the Tennessee Valley. They all offer cheap electricity, and often, mines can be built in repurposed factories.\n\nNot only is noise pollution an issue, but the annual electricity use worldwide from exclusively mining Bitcoin—just one type of crypto currency—is extensive. Some studies estimate it can even exceed that of entire countries. This overall higher community electricity use raises the cost for residents.\n\nThe Pain of Noise Pollution\n\nBecause cryptocurrency is relatively new, there are few peer-reviewed studies that specifically link it to how its mines affect human health and the environment. Twenty-​two state legislators have written to the EPA to monitor the environmental impact of mining cryptocurrency. But noise is the primary complaint in Murphy, and plenty is known about how loud, persistent, low-frequency sounds can lead to a host of problems.\n\nIn the 1970s, the U.S. Environmental Protection Agency’s Office of Noise Abatement and Control recognized noise as a pollutant and began taking steps to limit community exposure. Through the now-defunct office, researchers determined that, to ensure their health and welfare, residents shouldn’t be exposed to more than an average of 55 decibels over the course of a day. Anything higher, in terms of sound level or length of exposure, could increase an individual’s chances of hearing loss. Even though the world around us has gotten noisier since then—particularly in cities and largely due to industrial noise—our ears can’t adapt accordingly, says Deanna Meinke, PhD, an audiologist who studies dangerous decibels at the University of Northern Colorado in Greeley.\n\nOver the last few decades, researchers have seen that prolonged exposure to noise can lead to high blood pressure and other cardiovascular issues, and even exacerbate mental health disorders. What’s more, noise pollution can be more detrimental at night, when our bodies are much more vulnerable to sounds during sleep.\n\nAnd sound-level guidelines for health impacts beyond hearing loss don’t yet exist. “We don’t have limits for a noise level that would prevent heart attacks, or prevent high blood pressure, or prevent depression,” says Rick Neitzel, PhD, a noise pollution expert at the University of Michigan.\n\nIn 2020, an international team of researchers published a study in European Heart Journal where they followed about 500 healthy adults for five years. They found that every five-decibel increase over a baseline 45 decibels for a 24-hour span was associated with a 34 percent jump in heart attacks, strokes, and other cardiovascular issues.\n\nAnd in the early 1990s, the Federal Aviation Administration (FAA) sponsored several studies to determine how loud an airport could be without making residents seriously annoyed. They found that about half of the residents reached that threshold of annoyance when exposed to an average of 75 decibels over a 24-hour period, although they didn’t characterize how that manifested in health impacts. But about 20 years later, a group of German researchers tracked over 2,300 residents who lived in the flight path of Frankfurt Airport, and found that the individuals who reported to be “strongly annoyed” by the noise were twice as likely as others to feel depressed or anxious.\n\nResearchers have seen that prolonged exposure to noise can lead to high blood pressure and other cardiovascular issues, and exacerbate mental health disorders.\n\nJuan Diego Reyes Downtown Murphy, North Carolina.\n\nThe annoyance and resulting stress that Callahan and her neighbors face shouldn’t be discounted, says Neitzel. “Annoyance is a huge byproduct of noise exposure, and we don’t really understand how important that is in terms of putting someone at risk.”\n\nWhen noise becomes a stressor—as it has been in Murphy—it activates the adrenal system, which not only responds to stress but also regulates an individual’s immune and cardiovascular system. “It’s not good to spend 8, 10, or 12 hours a day in that condition,” Neitzel says. It can drive up heart rate and blood pressure, and cause problems down the line.\n\nEnvironmental Exodus\n\nAs soon as the mine came online, residents in the surrounding neighborhood began noticing changes in animal behavior. Ronny and Kathy Williams, who live atop Poor House Mountain Trail, lament the decline of birds in their backyard, where they keep multiple feeders. “We’ve seen very few goldfinches this year. The house finches came and went. And I’ve only seen one Carolina wren this year,” Ronny says.\n\nMeanwhile, Phyllis Cantrell, who lives about as far from the mine as the Williamses, has noted that hawks and eagles no longer nest nearby. The hummingbird feeders on her deck she used to refill four times a day are now going three days before she replenishes them. The area near the mine used to be prime habitat for wild turkey and deer. Now, they’re moving farther up the mountains. Morris, for instance, has recently found deer in her backyard for the first time.\n\nA herd of horses that live on a patch of land across from the mine on Harshaw have been trying to flee more frequently, too, according to the Lugiewiczes, who live across from where they’re kept. On a warm weekend last December, on a day when the fans from the mine were especially loud, Jennifer and Shannon Coleman spent an hour trying to wrangle the horses—who seemed spooked by the noise—all the while shouting over the din, standing just five feet away from each other. And dogs begin howling, says Cantrell, when the mine is especially loud at night.\n\nResearch shows that hundreds of animal species are affected by noise, says Clinton D. Francis, PhD, an evolutionary ecologist who studies noise pollution at California Polytechnic State University, San Luis Obispo.\n\nThe ability to perceive sounds and respond is a part of a “universal threat detection system” across vertebrates, he says. “Hearing is used to passively listen for threats while we’re doing other things.”\n\nThe impact of noise pollution is perhaps best characterized for birds. They may modify their songs to be at a higher pitch or sing more frequently to stand out amid the noise. Some field research shows that about a third of birds may completely leave an area because of noise pollution, with major ecological consequences. In 2012, Francis and his colleagues published a study that showed low-frequency industrial noise from gas wells and compressors (clocking in at around 95 decibels) reshaped areas of the Rattlesnake Canyon Habitat Management Area in northwestern New Mexico. Birds there are critical in dispersing seeds of the Colorado pinyon pine. And now, some preliminary research from Francis’s group suggests that noise pollution may lead to inheritable changes in specific species and populations. In other words: Noisy enterprises like crypto mines can alter the wildlife near it for generations to come.\n\nBut Francis is heartened by the fact that when the source of noise is removed, animals reclaim where they once lived. Think back to the early days of the COVID-19 pandemic, for instance, when the songs of the white-crowned sparrows in San Francisco grew more frequent when the din of the city subsided, or lions napped along traffic-free roads in South Africa.\n\nJuan Diego Reyes Beaver Ridge Trail loops around the neighborhood next to the mine.\n\nLax Zoning Laws and Few Answers\n\nDespite the annoyance, the deleterious health effects, and the damage to the ecosystem, there’s no legal protection for the residents of Murphy due to scant zoning laws in Cherokee County, which would otherwise protect residential areas from industrial development. Already, there are three mines in the county, and citizens fear more may be coming.\n\nSome Murphy residents have left because of the noise from the mine. Others who have put their life savings into their idyllic mountain home have no choice but to fight for change and show up to the commissioners meetings in droves. So far, the residents’ concerns about noise mostly have fallen on deaf ears. They’re also frustrated by the lack of answers from their five commissioners as to how the mine ended up there in the first place. They’re trying to get their elected officials to enforce a 1999 county ordinance under which perpetrators are fined $50 a day for sustained noise above 50 decibels. But the commissioners say that the ordinance is unenforceable without the zoning laws that Cherokee County lacks.\n\nAnd without zoning laws, it’s impossible for anyone to find a legal standing to hold anyone accountable. In Limestone, Tennessee, where the cryptocurrency company Red Dog set up shop, residents had recourse because Red Dog violated an existing zoning ordinance. That county sued and won. The mine is set to shut down by the end of 2024, pay associated penalties, and relocate away from a residential area.\n\nThe Cherokee County board of commissioners—particularly Dan Eichenbaum, Gary Westmoreland, and Randy Phillips, who locals refer to as “the triad” for their similar voting patterns on controversial issues—are not keen on changing the status quo. None responded to comment on this story. And amid the calls for zoning reform, a quieter contingent of Murphy residents don’t want any government interference in land use or rights.\n\nSince the Murphy mine was set up last fall, it was partially enclosed by wall sections in February, but locals say that only made the sound worse, as the openings between the walls funnel sound in very specific directions. Wade, of Exponential Digital, said that this partial enclosure helps them “maintain and preserve natural cooling and airflow, resulting in a more energy- efficient operation while further mitigating sound.” Moving forward, Wade says, the company will work closely with the commissioners to ensure the facility doesn’t generate more noise.\n\nFor now, Morris hopes that this year’s election will help, as the residents can vote for someone who will make decisions in their interests. “Until you get the commissioners behind this and really start pushing for it, change isn’t going to happen,” she says. “It starts with them.”\n\nSince the bullet on her doorstep, Morris has taken a backseat at the meetings, but she’s still attending and staying engaged. Already, not even a year out, she’s tired, and looking forward to what—eventually—could come after the mine. For her, it means peace and quiet, and the paradise that Murphy promised."
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vaXIubWFyYS5jb20vbmV3cy1ldmVudHMvcHJlc3MtcmVsZWFzZXMvZGV0YWlsLzEyOTkvbWFyYXRob24tZGlnaXRhbC1ob2xkaW5ncy1hbm5vdW5jZXMtYml0Y29pbi1wcm9kdWN0aW9uLWFuZNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "Marathon Digital Holdings Announces Bitcoin Production and Mining Operation Updates for December 2022 - Marathon Digital Holdings (MARA)",
        "content": "Marathon Digital Holdings Announces Bitcoin Production and Mining Operation Updates for December 2022\n\n- Achieved a New Record in Quarterly BTC Production\n\n\n\n- Produced 475 BTC in December 2022, 1,562 BTC in Q4 2022, and 4,144 BTC In Fiscal Year 2022\n\n- Increased Unrestricted Cash to $103.7 Million and Unrestricted Bitcoin Holdings to 7,815 BTC as of December 31\n\n\n\nLAS VEGAS, Jan. 05, 2023 (GLOBE NEWSWIRE) -- Marathon Digital Holdings, Inc. (NASDAQ:MARA) (\"Marathon\" or \"Company\"), a leader in supporting and securing the Bitcoin ecosystem, today published unaudited bitcoin (“BTC”) production and miner installation updates for December 2022.\n\nManagement Commentary\n\n“In 2022, we made significant progress in increasing our hash rate while also transitioning to more sustainable power sources,” said Fred Thiel, Marathon’s Chairman and CEO. “Despite challenges earlier in the year, we doubled our hash rate to 7.0 exahashes per second year-over-year, with a majority of it now located at the King Mountain wind farm in West Texas. We finished the year with one of our most productive quarters to date, producing 1,562 bitcoin in the fourth quarter.\n\n“In December, we expanded our agreement with Applied Digital to deploy roughly 12,000 S19 XPs, which are approximately 30% more energy efficient than the prior generation of servers, at their Jamestown facility in North Dakota. This site is already constructed and operational, and our expectation is for miners to come online within the next month. In Garden City, installations of miners remain underway, as we now have roughly 2.1 exahashses installed and pending energization.\n\n“We also took proactive measures to strengthen our liquidity position and enhance the performance of our mining fleet. Given the macroeconomic uncertainty heading into 2023, we decided to fully pay down outstanding balances under our revolving credit agreement. This freed up bitcoin that was previously held as collateral, increasing our unrestricted bitcoin holdings from 4,200 BTC as of November 30 to 7,815 BTC (approximately $129.3 million) as of December 31. We finished the year with $103.7 million in cash on hand.\n\n“During December, we tested overclocking and underclocking servers and began researching dual-phase immersion cooling systems. We also continued working with the new operator of the King Mountain site on improving operations and the curtailment strategy to optimize production. These efforts position us to develop our competitive advantages further and become a more efficient and resilient business as we continue to grow.\n\n“As we enter 2023, we remain confident in our ability to scale Marathon into one of the largest and most energy efficient Bitcoin mining operations globally. We have thousands of miners ready to be energized over the coming months, which we expect to more than triple our current production capacity to approximately 23 exahashes by mid-year.”\n\nRecent Highlights\n\nProduced 475 BTC in December 2022 and 1,562 BTC in Q4 2022\n\nProduced 4,144 BTC in fiscal year 2022, a 30% increase from 3,197 BTC produced in fiscal year 2021\n\nAs of January 1, operating mining fleet consisted of approximately 69,000 active miners, capable of producing approximately 7.0 EH/s\n\n2.1 EH/s is currently pending energization after 1,000 S19 XPs were installed in December\n\nDepending on Applied Digital’s energization timeline, the Company expects to have between 12.0 EH/s and 15.0 EH/s online by March 31, 2023\n\nReduced revolver borrowings from $30 million as of November 30 to $0 as of December 31, 2022\n\nUnrestricted bitcoin holdings on December 31, 2022 were approximately 7,815 BTC with a fair market value of approximately $129.3 million\n\nTotal bitcoin holdings increased to 12,232 BTC as of December 31, 2022\n\nUnrestricted cash on hand was approximately $103.7 million at December 31, 2022\n\n\n\nTechnology Update\n\nIn November, Marathon began an immersion-cooled pilot project, which involves submerging Bitcoin mining servers in a dielectric fluid to determine if the Company can improve the efficiency and/or performance of its operations. In December, Marathon’s team successfully increased the hash rate of an S19 J Pro by 20% while reducing its power draw on a per terahash basis by approximately 4%. The Company also increased the hash rate of an S19 XP by 20%, marginally increasing the number of joules per terahash from 21.5 to 23.7 joules per terahash.\n\nMarathon is routinely looking for ways to stay ahead of the technology curve, and our latest exploration is into the potential benefits of dual-phase immersion. Our initial findings suggest that this technology could reduce capital expenditure on servers by approximately 10% versus traditional air-cooled setups and almost 7% compared to single-phase immersion systems. This is achieved by eliminating the need for aluminum chassis, heat synchs, and other parts, which are no longer required in dual-phase immersion cooling. In addition, energy consumption may also be reduced by approximately 7% versus single-phase immersion systems, as dual-phase immersion increases the heat density by 2.5 times, enabling more servers to be racked closely together.\n\nWhile it remains to be seen if such improvements in performance can be consistently replicated and implemented at scale, the Company is encouraged by these preliminary results and their ability to potentially increase Marathon’s competitive advantages.\n\nMiner Energization and Installations Updates\n\nAccording to the latest information made publicly available, construction of facilities and installation of miners at Applied Digital’s data center sites remain underway as Applied Digital awaits regulatory approval to energize its newest facilities.\n\nIn December, Marathon secured an additional 33 megawatts of hosting capacity with Applied Digital at its Jamestown, North Dakota facility. As a result of this new arrangement the Company expects to deploy approximately 12,000 S19 XPs in the coming month as this site is fully constructed and has the necessary requirements for energization.\n\nAs of December 31, Marathon’s operating fleet consists of approximately 69,000 bitcoin servers, theoretically capable of producing approximately 7.0 EH/s when operating at full capacity. An additional 2.1 EH/s is currently pending energization after an additional 1,000 S19 XPs were successfully installed in Texas during the month of December.\n\nOnce all of Marathon’s previously purchased miners are installed, approximately 66% of the Company’s hash rate is expected to be generated by S19 XPs, which are approximately 30% more energy efficient that the prior generation of mining servers. The Company still expects to have approximately 23 EH/s of capacity installed near the middle of 2023.\n\nInvestor Notice\n\nInvesting in our securities involves a high degree of risk. Before making an investment decision, you should carefully consider the risks, uncertainties and forward-looking statements described under \"Risk Factors\" in Item 1A of our most recent Annual Report on Form 10-K for the fiscal year ended December 31, 2021, filed with the SEC on March 10, 2022. If any of these risks were to occur, our business, financial condition or results of operations would likely suffer. In that event, the value of our securities could decline, and you could lose part or all of your investment. The risks and uncertainties we describe are not the only ones facing us. Additional risks not presently known to us or that we currently deem immaterial may also impair our business operations. In addition, our past financial performance may not be a reliable indicator of future performance, and historical trends should not be used to anticipate results in the future. Future changes in the network-wide mining difficulty rate or Bitcoin hash rate may also materially affect the future performance of Marathon's production of bitcoin. Additionally, all discussions of financial metrics assume mining difficulty rates as of December 2022. See \"Forward-Looking Statements\" below.\n\nForward-Looking Statements\n\nStatements made in this press release include forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements can be identified by the use of words such as “may,” “will,” “plan,” “should,” “expect,” “anticipate,” “estimate,” “continue,” or comparable terminology. Such forward-looking statements are inherently subject to certain risks, trends and uncertainties, many of which the Company cannot predict with accuracy and some of which the Company might not even anticipate and involve factors that may cause actual results to differ materially from those projected or suggested. Readers are cautioned not to place undue reliance on these forward-looking statements and are advised to consider the factors listed above together with the additional factors under the heading “Risk Factors” in the Company's Annual Reports on Form 10-K, as may be supplemented or amended by the Company's Quarterly Reports on Form 10-Q. The Company assumes no obligation to update or supplement forward-looking statements that become untrue because of subsequent events, new information or otherwise.\n\nAbout Marathon Digital Holdings\n\nMarathon is a digital asset technology company that focuses on supporting and securing the Bitcoin ecosystem. The Company is currently in the process of becoming one of the largest and most sustainably powered Bitcoin mining operations in North America, while remaining asset light.\n\nMarathon Digital Holdings Company Contact:\n\nTelephone: 800-804-1690\n\nEmail: ir@mara.com\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/d244082a-110c-49d8-8840-4b6b20870fa1\n\n\n\n"
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wMS8wNC9jcnlwdG8td2ludGVyLXVzLXJlZ3VsYXRvcnMtd2FybmluZy1iYW5rcy1kZXV0c2NoZS1iYW5rLXdlbGxzLWZhcmdvLWNpdGlncm91cC1iYW5rLW9mLWFtZXJpY2Ev0gGBAWh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wMS8wNC9jcnlwdG8td2ludGVyLXVzLXJlZ3VsYXRvcnMtd2FybmluZy1iYW5rcy1kZXV0c2NoZS1iYW5rLXdlbGxzLWZhcmdvLWNpdGlncm91cC1iYW5rLW9mLWFtZXJpY2EvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Crypto took such a beating in 2022 that U.S. regulators have teamed up for the first time to sound the alarm to banks tied to the industry - Fortune",
        "content": "Last year was a difficult time for crypto investors, with billions being wiped out of the cryptocurrency market and the collapse of major exchange FTX dampening sentiment toward digital assets.\n\nThe fallout saw people losing their life savings overnight, with more than a million people and businesses reportedly owed money by FTX.\n\nIn light of the events of 2022, major financial regulators in the U.S. have come together for the first time to warn banks about the risks involved with being tied to the unpredictable crypto industry.\n\nIn a joint statement on Tuesday, the Federal Reserve, the Federal Deposit Insurance Corporation, and the Office of the Comptroller of the Currency sounded the alarm over the risks crypto assets posed to banking organizations.\n\n“The events of the past year have been marked by significant volatility and the exposure of vulnerabilities in the crypto-asset sector,” the agencies said. “These events highlight a number of key risks associated with crypto-assets and crypto-asset sector participants that banking organizations should be aware of.”\n\nLast year, cryptocurrencies across the board suffered a widespread selloff that became known as the Crypto Winter, with more than $200 billion wiped off of the market in a single day back in June. Some experts have predicted the phenomenon could last through 2023 and possibly into 2024.\n\nThe selloff, exacerbated by the implosion of major crypto exchange FTX in November, led to speculation over whether the world is witnessing “the end of crypto,” with some heralding FTX’s collapse as the cryptocurrency market’s “Lehman moment.”\n\nAs well as warning lenders about the “significant volatility” of crypto markets, U.S. regulators urged financial institutions on Wednesday to be wary of the risk of fraud and scams within the crypto sector, as well as legal uncertainties relating to ownership rights and a lack of robust risk management and governance practices at cryptocurrency firms.\n\nAlso among the regulators’ lengthy list of risk factors surrounding the crypto sector was a warning of a “contagion risk” resulting from issues like opaque lending, investing, funding, service, and operational arrangements.\n\nThey added that there were heightened risks associated with decentralized networks, which included vulnerabilities related to cyberattacks, outages, lost or trapped assets, and illicit finance.\n\n“It is important that risks related to the crypto-asset sector that cannot be mitigated or controlled do not migrate to the banking system,” regulators cautioned.\n\nWhile they noted that banks in the U.S. are neither prohibited nor discouraged from providing services to customers operating in the crypto sector, issuing or holding crypto-assets was “highly likely to be inconsistent with safe and sound banking practices.”\n\n“Banking organizations should ensure that crypto-asset-related activities can be performed in a safe and sound manner, are legally permissible, and comply with applicable laws and regulations, including those designed to protect consumers (such as fair lending laws and prohibitions against unfair, deceptive, or abusive acts or practices),” officials said.\n\n“[Banks] should ensure appropriate risk management, including board oversight, policies, procedures, risk assessments, controls, gates and guardrails, and monitoring, to effectively identify and manage risks.”\n\nWhat do banks think of crypto?\n\nWall Street banks are divided on the merit of cryptocurrencies, particularly in the wake of a turbulent 2022.\n\nJPMorgan CEO Jamie Dimon, a renowned crypto skeptic, has likened investing in cryptocurrencies to buying useless “pet rocks.”\n\nHowever, JPMorgan—like Morgan Stanley and Goldman Sachs—has a dedicated group for focusing on cryptocurrency.\n\nDeutsche Bank, Wells Fargo, Citigroup, and Bank of America have invested in crypto staffing divisions in recent years, according to CNBC, while Standard Chartered, UBS, and BNY Mellon had invested millions in crypto assets by 2021, Business Insider reported.\n\nOthers have taken a far more wary approach.\n\nHSBC, for example, said in 2021 that it would refuse to process cryptocurrency payments in Britain.\n\nWhile many lenders have jumped on the crypto bandwagon in recent years, many have warned that investors in the market could still be in for further pain.\n\nIn a research note at the end of last year, Standard Chartered’s global head of research, Eric Robertsen, warned that investors could be caught off guard by a “surprise” Bitcoin plunge that would send the digital asset a further 70% lower in 2023.\n\nMeanwhile, JPMorgan’s analysts believe that its bottom is still yet to be reached, with the bank predicting in November that it will drop to around $13,000 while the crypto market suffers a “cascade of margin calls.”"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMDQvYS1kb3NlLW9mLWhvcGl1bS1mb3ItYml0Y29pbi1idWxscy1mcm9tLTE5NzBzL9IBXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMDQvYS1kb3NlLW9mLWhvcGl1bS1mb3ItYml0Y29pbi1idWxscy1mcm9tLTE5NzBzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "A Dose of 'Hopium' for Bitcoin Bulls From 1970s - CoinDesk",
        "content": "\"An analog to the stagflationary 1970s shows that while the inflation downturn is imminent, it is likely it will not reach the Fed's 2% target. More worryingly, there is also a risk of a V-shaped rebound if the Fed loosens policy prematurely,\" Singapore-based QCP Capital said in its 2023 market unwrap note."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMigwFodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzA1L2NyeXB0by1tYXJrZXRzLWFuYWx5c2lzLW9uLWNoYWluLWRhdGEtc2hvd3Mtc2hvcnQtdGVybS1iaXRjb2luLWhvbGRlcnMtdHVybmluZy1wcm9maXRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: On-Chain Data Shows Short-Term Bitcoin Holders Turning Profits - CoinDesk",
        "content": "Long-term holders have not had the same fortune, as the LTH-SOPR fell below the profitability benchmark on Nov. 24, and has remained there since. But many long-term BTC holders are likely to maintain their holdings, rather than sell at a loss."
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMifmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMDQvY3J5cHRvLW1hcmtldHMtYW5hbHlzaXMtYml0Y29pbi1ldGhlci1yZXNwb25kLXBvc2l0aXZlbHktdG8tZmFsbGluZy1lY29ub21pYy1kYXRhL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Crypto Markets Analysis: Bitcoin, Ether Respond Positively to Falling Economic Data - CoinDesk",
        "content": "And the U.S. Department of Labor’s Job Openings and Labor Turnover Survey (JOLTs) showed 10.46 million available jobs in November, better than analyst expectations reported to FactSet but down slightly from the previous month. It was the second straight monthly decline in the widely watched measure of job strength."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMidWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMDQvdHJpYW5nbGUtYnJlYWtvdXQtcHV0cy1ldGhlci1iaXRjb2luLXJhdGlvLW9uLWEtYnVsbGlzaC1wYXRoLXRyYWRlci1zYXlzL9IBeWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMDQvdHJpYW5nbGUtYnJlYWtvdXQtcHV0cy1ldGhlci1iaXRjb2luLXJhdGlvLW9uLWEtYnVsbGlzaC1wYXRoLXRyYWRlci1zYXlzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Ether-Bitcoin Ratio on Bullish Path After Triangle Breakout, Trader Says - CoinDesk",
        "content": "\"It may be we see a 'bears in disbelief' rally for ETH over the coming weeks,\" Harland said, citing the Ethereum network's upcoming Shanghai upgrade that will open withdrawals of staked ether and expected reduction of rollup fees for users after the implementation of EIP4844 as bullish catalysts for the cryptocurrency."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMS8wNC9pcmFuaWFuLWNvdXJ0cy1vcmRlci1yZXR1cm4tb2YtdGhvdXNhbmRzLW9mLXNlaXplZC1jcnlwdG8tbWluaW5nLW1hY2hpbmVzLXJlcG9ydHMv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wMS8wNC9pcmFuaWFuLWNvdXJ0cy1vcmRlci1yZXR1cm4tb2YtdGhvdXNhbmRzLW9mLXNlaXplZC1jcnlwdG8tbWluaW5nLW1hY2hpbmVzLXJlcG9ydHMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Iranian Courts Order Return of Thousands of Seized Crypto Mining Machines: Reports - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNhYm90d2VhbHRoLmNvbS9kYWlseS9vcHRpb25zLXRyYWRpbmcvYS1sZWFwcy1vcHRpb25zLXRyYWRlLWZvci1hLWJpdGNvaW4tcmVjb3ZlcnnSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "A LEAPS Options Trade for a Bitcoin Recovery - Cabot Wealth Network",
        "content": "We’re going to dive into a long-term crypto play using a LEAPS options trade in just a moment, but first, tell me if you’ve heard this scenario before. Crypto prices are at all-time highs, having generated triple- or quadruple-digit returns for traders and investors. Online message boards proclaim that it’s “up only” season and new millionaires are being minted seemingly every day.\n\nThen, the unthinkable: prices collapse, exchanges fail, crypto “blue chips” lose 60%, 70%, 80% of their value.\n\nYou’d likely assume that the story I’m writing is the story of the 2022 market, replete with Ponzi tokens, SBF’s incestuous self-dealing, and a crypto bloodbath that dragged the price of Bitcoin (BTC) down 74% in a year.\n\n[text_ad]\n\nHowever, I’m also writing the story of the collapse of the Mt. Gox exchange in 2014, which saw BTC lose 85% of its value, falling from just over 1,100 to a low of 178 in January of 2015.\n\nI’m also writing the story of the crypto winter of 2018, which saw Bitcoin prices collapse 84% in a year.\n\nThis is all just a way to say that we’ve seen this before. History doesn’t repeat itself, but it does rhyme.\n\nSo, you may be wondering, what happened to Bitcoin prices next?\n\nWell, in the calendar year following the 2015 bottom, Bitcoin was up 143%. After two years, it was still up 117% from the bottom.\n\nA year from the 2018 low saw prices 136% higher. After two years, BTC was up 650%.\n\nNow, a lot of the criticism leveled at crypto and DeFi (decentralized finance) proved true last year. Scams and fraud were rampant. Much of the technology simply tried to financialize software that didn’t need financializing.\n\nBut the best use case that exists right now, uncensorable money, remains a valuable tool. There are documented instances of women in Afghanistan using crypto to store money while fleeing the Taliban.\n\nConsider this hypothetical as a counterpoint to a competing offering that’s been floated by central banks globally: a Central Bank Digital Currency (CBDC). Issued by central banks but recorded in a digital blockchain. This is currently being explored for cross-border settlement and not individual use, but a White House policy framework has already documented the government’s interest in using a CBDC to promote equitable financial market participation and anti-money laundering (AML) compliance.\n\nLet’s imagine they start offering a tax discount to incentivize the adoption of the digital currency, say, a federally funded 1% sales tax discount on any transaction using CBDC. Easy enough to track on the blockchain, so the federal government could repay states for lost sales tax.\n\nThis hypothetical leaves aside the legal/legislative/policy considerations but is a useful thought exercise.\n\nNext, imagine that the political party that you disagree with the most takes power. Now, we have widespread adoption of CBDC and people we don’t agree with in power. So, since it’s tough to pass legislation banning whatever it is that appeals to the base—abortion, red meat, GMO foods, whatever (your ideology doesn’t matter)—they simply turn off your ability to spend your CBDC on whatever it is they oppose. Essentially holding political opposition hostage by their purse strings. Democrats in control? Can’t donate your CBDC to the RNC or spend it on factory-farmed foods. Republicans in control? Can’t donate your CBDC to the DNC or Planned Parenthood.\n\nThis is not a policy judgment, just a case for the rumors of crypto’s death being greatly exaggerated.\n\nA LEAPS Options Trade in Bitcoin\n\nIf you’re not a crypto devotee but are interested in speculating on a recovery in the price of Bitcoin, there are attractively priced LEAPS going out as far as January 17, 2025, in the ProShares Bitcoin Strategy ETF (BITO). The 10 and 12 strikes each have four-digit open interest, which helps keep the bid/ask spread reasonable, and last traded at $4.33 and $3.65, respectively.\n\nMore sophisticated investors who are willing to deal with higher volatility and lower liquidity can also find value with deeper-in-the-money LEAPS, like the lower-volume 5 strike. The 5 strike last traded at $6.38; a buy of the 5 strike and a sale of the 10 strike would be a $2.05 bull call spread that would be worth $5 upon expiration if BITO stays above 10.\n\nSystemic Risks to the LEAPS Options Trade\n\nIf this were a simple equity trade it would look like a no-brainer, but a BITO LEAPS option isn’t just a simple equity trade.\n\nThe fund invests in futures contracts to replicate the price performance of Bitcoin, rather than holding Bitcoin directly. The costs of those contracts are not prohibitively high, but in the event of a two-year sideways market for cryptocurrencies, contract costs alone would likely drag prices of the ETF lower.\n\nAlso, after the collapse of FTX and Alameda, there have been increasing calls for regulation and oversight. While the government can make holding Bitcoin illegal (it happened with gold), monitoring direct investment in self-custodied Bitcoin could prove too tall a task for the U.S. (just as it has with China). But it would be much more straightforward to simply shut down BITO and force liquidation, should the regulatory winds ever blow that way.\n\nAs you can see from the chart below, there’s not much momentum behind BITO, and the fund is still below its 50-day moving average and well below the 200-day.\n\nHowever, longer-term investors with an appetite for risk could see strong returns if Bitcoin comes out of this bear market the way it has in the past.\n\nTo learn more about Cabot’s favorite stocks this month, click here to download your free report.\n\n[author_ad]\n\n"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vd3d3Lm9uaWRhd2F0Y2htYW4uY29tL25ld3MvYXJ0aWNsZV9jZTEzNjc4NC04YzU3LTExZWQtYTM2Ni03YmE3ZTNkOGQ5MWQuaHRtbNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Planning and zoning board gives the nod to Bitcoin facility - Onidawatchman.com",
        "content": "Images\n\nSorry, there are no recent results for popular images."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaWctbW92ZS1icmV3aW5nLWZvci1idGMtcHJpY2UtYml0Y29pbi1tYXktc3RheS1mbGF0LWhpbnRzLWFuYWx5c3TSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "'Big move brewing' for BTC price? Bitcoin may stay flat, hints analyst - Cointelegraph",
        "content": "Bitcoin (BTC) traders are desperate for fresh BTC price volatility, but opinions are diverging on when it will come.\n\nBTC/USD is currently seeing some of the least volatile conditions in its history, price metrics show.\n\nVolatility far from guaranteed\n\nSince the FTX crisis, Bitcoin has settled into a historically narrow trading range which refuses to budge.\n\nDespite macro triggers, low-volume holiday trading and a yearly candle close, BTC price action has stuck rigidly to a zone focused on $17,000.\n\nThis is the least volatile period in the history of the Bitcoin historical volatility index (BVOL), and other data likewise shows that such sideways behavior is extremely rare.\n\nTwo months after FTX, traders and analysts alike are hotly debating when the breakout will come for BTC/USD — and in which direction it will go.\n\n“A big move is brewing for Bitcoin,” Charles Edwards, founder and CEO of asset manager Capriole Investments, stated on Jan. 5:\n\n“Bitcoin is currently trading at a major low in volatility. Generally, when Bitcoin breaks out of extremely low volatility, the ensuing trend tends to last. Don’t fight the trend on the next major move.”\n\nAn accompanying chart showed the 30-day annualized standard deviation of Bitcoin volatility, this now at lows seen only a handful of times in the past five years.\n\nBTC/USD annotated chart. Source: Charles Edwards/ Twitter\n\nEqually convinced that the status quo will break is Wolf of All Streets podcast host Scott Melker, who this week flagged what he described as the “tightest” Bollinger Bands he had ever seen on the daily Bitcoin chart.\n\nBollinger Bands are a classic volatility indicator in action since the 1980s. They likewise use standard deviation to determine the upper and lower bounds of price action within a defined period. Multiple use cases arise, including the ability to assess comparatively volatile or nonvolatile price action, as well as associated entry and exit points.\n\nCurrently, the two bands are “squeezed” around the central moving average on BTC/USD, data from Cointelegraph Markets Pro and TradingView shows, leading to assumptions that volatility should now ensue.\n\nFor creator John Bollinger, however, the length of the squeeze is not necessarily pertinent to the timing or strength of future volatility.\n\n“In my experience prolonged Squeezes are rarely valuable signals. I prefer Squeeze and Go!” he responded to Melker.\n\nBTC/USD 1-day candle chart (Bitstamp) with Bollinger bands. Source: TradingView\n\nBullish Bitcoin takes lacking\n\nAs Cointelegraph reported, meanwhile, there is no shortage of bearish BTC price predictions in force at the start of 2023.\n\nRelated: $16.8K Bitcoin now trades further below this key trendline than ever\n\nVarious warnings have cautioned hodlers over what may be to come, including a drop to $10,000 or even lower in Q1.\n\nHopes of upside are comparatively muted as analysts look to see what will happen with the United States’ macroeconomic policy and its influence on risk assets.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMiNGh0dHBzOi8vd3d3LnJlYWx2aXNpb24uY29tL2Jsb2cvaG93LXRvLXNob3J0LWJpdGNvaW7SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "How to Short Bitcoin - Real Vision",
        "content": "Shorting is a strategy to bet against falling asset prices. In its original form, investors wanting to short a stock had to borrow that stock from a counterparty. In return, they had to pay interest to the counterparty. The investor then sold the borrowed stock on the open market in the hope of buying it back at a lower price at a later time. After buying the stock back, the investor returned them to the original owner. The profit was the difference between the stock’s selling and buying price minus the interest rate paid for borrowing the stock.\n\nToday, shorting is often done with future contracts. Futures are contracts between two parties that agree to exchange an asset at a predefined price and at a specific date in the future. In crypto though, most futures contracts are so-called perpetual futures. Instead of agreeing to exchange an asset on a specific date, the two parties simply take the current asset price and agree to pay each other the difference. If the asset price increases, the party holding the long position gets paid the difference to the agreed-upon start price by the party being short. However, when the asset price falls, the process works in reverse and the long party has to pay the difference to the party holding the short position. In addition, perpetual futures don’t have an expiration date but run until one party cancels the contract.\n\nThe payments are happening in real time (every second) and the future contract can be canceled by either party at any time. To ensure that each party is always solvent and able to carry out their payments no matter how strong and fast the market moves, both parties have to deposit collateral — the so-called margin. Should the market move against one party and diminish its collateral below a minimum threshold, the party will receive a margin call with the request to deposit more collateral. Should the party not be willing or able to deposit more collateral, the future position will be automatically closed. This ensures that both parties are able to fulfill their contractual obligations at all times and neither party falls into debt."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiX2h0dHBzOi8vcm9sbGNhbGwuY29tLzIwMjMvMDEvMDQvYWZ0ZXItYS15ZWFyLW9mLWNvbGxhcHNlcy1jcnl0b2N1cnJlbmN5cy1mdXR1cmUtaW4tdGhlLWJhbGFuY2Uv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "After a year of collapses, cryptocurrency’s future in the balance - Roll Call",
        "content": "Spectacular cryptocurrency failures in 2022 have raised the stakes for the industry amid questions about the enduring viability of a technology that advocates say has the potential to revolutionize finance.\n\nThe crypto market lost trillions in valuation last year, spurred by the crash of the algorithmic stablecoin TerraUSD in May and the failure of FTX, one of the largest crypto exchanges, in November. With a total global market cap once put at close to $3 trillion, the industry now has a value that CoinMarketCap, a site that tracks prices, puts closer to $800 billion.\n\nIn Congress, where the industry once had a vocal contingent of backers, the hostility is now louder, with calls to severely restrict cryptocurrencies or ban them entirely.\n\nDespite the setbacks, crypto is still a cultural phenomenon, Nicole Valentine, fintech director of the Center for Financial Markets at the Milken Institute, a nonpartisan think tank, said in an interview.\n\n“I do think that there still will be dinner table conversations around crypto,” Valentine said. “For one thing, people still have a fear of missing out. … We should be asking ourselves questions about how we’re developing and building this industry. I don’t see it dying, and I don’t see it losing its cultural interest at this point.”\n\nAccording to a December report from the JPMorgan Chase Institute, the number of people who transferred funds into a crypto-related account tripled during the pandemic, rising from 3 percent of the population in 2020 to 13 percent in June 2022.\n\nCrypto companies and exchanges had failed in the past, either through hacking or theft, but the collapse of algorithmic stablecoin Terra last year led to widespread losses among firms that previously appeared sure-footed.\n\nMain Street investors, drawn to the promise of high rates of return, suddenly found their investments worthless. At the time of its collapse, Terra was the largest algorithmic stablecoin, a digital asset designed to always maintain a value of $1 through market incentives rather than through backing by cash or securities.\n\nTerra and its sister coin Luna lost billions of dollars within a few days. The failure of FTX was even more abrupt, following assurances of safety by the company and former CEO Sam Bankman-Fried. Well-established firms had put their money in FTX.\n\nU.S. authorities say Bankman-Fried misappropriated billions in customer funds deposited with FTX and steered the money to personal uses, to make political contributions and to repay billions of dollars in loans owned by Alameda Research. Bankman-Fried, who resigned when FTX filed for bankruptcy, was indicted in December.\n\nTwo of Bankman-Fried’s colleagues, former Alameda Research CEO Caroline Ellison and FTX co-founder Zixiao “Gary” Wang, pleaded guilty to criminal charges on Dec. 21 and are cooperating in the investigation, according to the U.S attorney for the Southern District of New York, Damian Williams.\n\nCharges, including those from the Securities and Exchange Commission and the Commodity Futures Trading Commission, accuse Wang and Bankman-Fried of diverting customer assets to the affiliated Alameda Research, which Ellison used for improper trading activity. The customer funds also went toward “lavish real estate purchases and large political donations,” the SEC said.\n\nBankman-Fried, who previously testified in front of lawmakers seeking what many call sweetheart regulatory treatment, is free on $250 million bail.\n\n‘Crypto money spigot’\n\nIn a world based on facts, the failures of 2022 would have been the end of crypto, according to Dennis Kelleher, president and CEO of Washington-based nonprofit Better Markets.\n\n“The only reason that 2022 wasn’t the end of crypto is because of the access and influence crypto has bought on a bipartisan basis,” Kelleher said in an interview.\n\nBankman-Fried and other employees contributed $71.5 million to campaigns and political action committees in the midterm cycle, according to Federal Election Commission filings. Individuals associated with FTX companies donated at least $44.2 million to Democratic candidates and affiliated political action committees and at least $23.7 million to Republican candidates and PACs.\n\nThe Justice Department says at least some of that activity was improper, charging Bankman-Fried with violating campaign finance laws, though the indictment against him lacks specifics.\n\nBloomberg News reported Dec. 29 that Bankman-Fried met with senior White House officials at least four times in 2022.\n\nCrypto lobbyists, too, have increased spending on Capitol Hill. Lobbying spending attributable to the crypto sector quadrupled from $2.2 million in 2018 to $9 million in 2021, according to a March report from consumer advocacy group Public Citizen.\n\nKelleher said lobbying in Washington is picking up in the face of the crisis, citing crypto exchange Binance’s move on Dec. 20 to increase its engagement with policymakers by joining the Chamber of Digital Commerce, a crypto trade association.\n\nBinance said in a post on its website that it will participate in “research, roundtables, working groups and discussions with policymakers and regulators to help bring sensible policies that benefit society and users.”\n\nKelleher said that “once the crypto money spigot shuts down completely, then you will start to see a very different view coming out of the power centers of Washington.”\n\nThe industry’s lobbying or efforts with trade groups have come a long way in the past several years and represent a maturation, said Jennifer Schulp, director of financial regulation studies at the libertarian think tank Cato Institute.\n\nSchulp said it was a good sign that the sector is ferreting out its own bad actors and setting internal standards, regardless of where political contributions are being made. She also predicted that crypto will be less visible in pop culture than in 2022, a reference to celebrity endorsements last year by the likes of NFL quarterback Tom Brady and his ex-wife, model and businesswoman Gisele Bündchen, and comedian Larry David.\n\n“I think that we will see less of the kind of dramatic entrance in pop culture that we saw over the past year,” Schulp said.\n\nBrett Quick, head of government affairs at the Crypto Council for Innovation, said the industry is looking at the setbacks as a chance to regroup. She said Bankman-Fried’s actions, if the charges are true, have been illegal for 100 years and have nothing to do with the technology of crypto.\n\n“We believe that if we had regulators with oversight into the markets and into the firms operating within them, then it would vastly mitigate the possibility of some of these bad actors being able to access consumers and investors,” she said.\n\nMark Cuban, a prominent investor and owner of the Dallas Mavericks NBA franchise who has said he was an early adopter of crypto, said in an email that the technology is “about applications” and will always be, a reference to smart contracts and other uses. Smart contracts are self-executing when certain conditions are met and are seen as a way to avoid the need for a central authority.\n\n“None of that has changed,” Cuban said. Cuban was an early investor in FiscalNote, the parent company of CQ Roll Call.\n\nWhether that is enough to conserve any of the industry’s momentum remains to be seen.\n\nThe Milken Institute’s Valentine, who said she owns a fractional share of bitcoin for research and analysis purposes, was on a plane in November and said someone sitting next to her struck up a conversation about crypto.\n\n“He said, ‘I’m sitting on the sidelines and I’m going to wait until I think it’s safe to get in,’” Valentine said. “For investors that have a high-risk appetite, come on in. For those that are a little more risk-averse or they’re not as risky, I would say, yeah, take your time and get to know the industry.”\n\nCaitlin Reilly contributed to this report."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9oZXJlLXMtaG93LWJpdGNvaW4tcHJvbW90ZXMtZ2xvYmFsLWZpbmFuY2lhbC1pbmNsdXNpb24tYWNjb3JkaW5nLXRvLXByaW5jZS1waGlsaXAtb2Ytc2VyYmlh0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Here's how Bitcoin promotes global financial inclusion, according to Prince Philip of Serbia - Cointelegraph",
        "content": "The fundamental aspects of Bitcoin (BTC) continue to power global financial inclusion, financial privacy and autonomy in conflict-affected nations despite difficult macroeconomic and cryptocurrency market conditions over the past year.\n\nThese are the key takeaways of an in-depth interview with Prince Philip of Serbia and Yugoslavia conducted by Cointelegraph Brasil’s Cassio Gusson as 2023 gets underway.\n\nPrince Philip Karađorđević shared his thoughts on the sector as he joined Jan3 as its chief strategy officer. The Bitcoin technology company seeks to drive the adoption of the preeminent cryptocurrency and was founded by Bitcoin proponent Samson Mow in 2022.\n\nIn April 2022, Jan3 announced a partnership to help develop El Salvador’s Bitcoin City and has since opened up an office in the BTC-friendly nation, according to Prince Philip. The company also intends to provide guidance and services to other nations looking to adopt Bitcoin in some capacity.\n\nPrince Philip told Cointelegraph that Bitcoin remains important as the preeminent cryptocurrency, with its technological specifications allowing for the emergence of a fairer monetary system and individual sovereignty of wealth:\n\n“Bitcoin, specifically, has the potential to promote financial inclusion because of its decentralized nature, which makes it resistant to censorship and manipulation.”\n\nThis is particularly important for individuals or communities without access to financial institutions or those residing in countries with unstable or corrupt governments and institutions.\n\nPrince Philip also highlighted Bitcoin’s ability to “bank the unbanked,” given its low barrier to entry. Any person with a smartphone can download a Bitcoin wallet and gain access to “basic banking services,” which has become extremely relevant in emerging economies:\n\n“Issuing a checking account with a minimum balance, a checkbook, a debit card, is simply too expensive for low-income consumers in the developing world, and for the banks themselves.”\n\nFurthermore, Prince Philip highlighted that Bitcoin has no branches, correspondent banking relationships nor employees. Stablecoins are becoming equally useful in developing nations where people want to save in the U.S. dollar:\n\n“Bitcoin and stablecoins have the potential to provide much-needed financial inclusion to people in countries with limited or no access to traditional banking services.”\n\nBoth options provide a secure, cost-effective means to send and receive payments, even in remote areas with limited infrastructure. The confines and regulations of traditional banking are also removed, giving people access to some sort of financial facility where traditional services are not accessible.\n\nConflict-affected nations are also prime candidates for Bitcoin adoption, according to Prince Philip. Bitcoin facilitates cross-border transactions, offers financial privacy and autonomy, and promotes economic development:\n\n“This can be particularly useful in countries with authoritarian governments or a history of conflict, where individuals may be concerned about revealing their financial information or being subject to censorship or seizure of assets.”\n\nEl Salvador has established itself as the banner carrier for sovereign Bitcoin adoption after becoming the first country to recognize BTC as legal tender in June 2021. While there are some teething problems remaining — as Cointelegraph journalist Joe Hall outlined after a recent visit to the nation — El Salvador is a living example of what nation-led Bitcoin adoption looks like.\n\nPrince Philip believes that more countries should allocate a portion of their national treasury to Bitcoin, highlighting the established moniker of digital gold. There are tangible results being realized in the country as well, which Prince Philip describes as an example for other nations to follow:\n\n“Already we’re starting to see the economic benefits of the Bitcoin policies, including accelerated GDP growth, tourism, new businesses being established and many other intangible markers.”\n\nWhile Bitcoin is positioned as a driver of financial freedom, Prince Philip gave a cautionary comment on the development of central bank digital currencies. He cited caveats and limitations to nation-controlled CBDCs, which could be used to place restrictions or outright blocks on people’s money."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy8xNi04ay1iaXRjb2luLW5vdy10cmFkZXMtZnVydGhlci1iZWxvdy10aGlzLWtleS10cmVuZGxpbmUtdGhhbi1ldmVy0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "$16.8K Bitcoin now trades further below this key trendline than ever - Cointelegraph",
        "content": "Bitcoin (BTC) is now further below a key moving average than it was at the pit of the March 2020 COVID-19 crash.\n\nIn a tweet on Jan. 4, popular trader and analyst Rekt Capital revealed just how remarkable the current Bitcoin bear market really is.\n\nBTC price 200-week moving average out of reach\n\nNot only has Bitcoin now spent more time below its 200-week moving average (WMA) than ever before, it is now further beneath it than at any time in history.\n\nLooking at the weekly BTC/USD chart, Rekt Capital confirmed that as of Jan. 4, BTC/USD traded around 37% below the 200 WMA.\n\nThis, he noted, was “Deeper than the -31% retracement in March 2020.”\n\nThe numbers provide interesting reading in a bear market which has yet to see BTC price retracements from all-time highs rival previous bottoms in percentage terms.\n\nIn March 2020, Bitcoin abruptly lost 60% in a matter of days as markets reacted to the first wave of mass coronavirus lockdowns.\n\nAt the time, however, the largest cryptocurrency spent less than two weeks below the 200 WMA — a clear contrast with 2022. BTC/USD lost the trendline — which also figured in the 2018 bear market — last August, and has since failed to reclaim it.\n\nBTC/USD annotated chart. Source: Rekt Capital/ Twitter\n\nS&P 500 faces \"March cycle low\"\n\nThe situation may get worse still.\n\nRelated: Bitcoin analyst identifies new key levels as Ethereum price nears 3-week high\n\nAnalysts are currently betting on Q1 offering a further test of bulls’ resolve, even if it ultimately closes with BTC price action higher than at present.\n\nFor trader, investor and entrepreneur Bob Loukas, meanwhile, correlated markets may themselves see their macro bottom in the coming quarter.\n\nAnalyzing the S&P 500 on weekly timeframes, Loukas described the past year’s comedown as unparalleled in its textbook nature.\n\n“This has been the cleanest Stock bear market decline i've ever seen,” he told his Twitter followers.\n\n“Currently still points to declines into a March Cycle Low.”\n\nS&P 500 annotated chart. Source: Bob Loukas/Twitter\n\nBitcoin has underperformed both stocks and gold since the FTX meltdown, Cointelegraph reported, leaving the door open for what optimists hope will be a game of “catch up.”\n\nLate last month, David Marcus, CEO and founder of Bitcoin firm Lightspark, predicted that the “crypto winter” would outlast 2023 and even extend past Bitcoin’s next block subsidy halving event, expected around April 2024.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy95ZWFyLW9mLWJpdGNvaW4tbWluZXJzLW1lcmdlLWFuYWx5c3RzLXByZWRpY3Qta2V5LW1pbmluZy10cmVuZHMtZm9yLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Year of Bitcoin miners' merge? Analysts predict key mining trends for 2023 - Cointelegraph",
        "content": "After a shocking year for Bitcoin (BTC), public miners will focus on strengthening balance sheets and minimizing costs this year, according to industry analysts.\n\nBitcoin mining cost minimization will likely lead public miners to either go private or merge with other companies in 2023, Hash Rate Index’s Bitcoin analysts Jaran Mellerud and Colin Harper predicted.\n\nIn a blog post titled “10 Bitcoin mining predictions for 2023,” the analysts pointed out that public miners are burdened with strict reporting requirements, such as spending millions of dollars on annual reporting.\n\nAfter many Bitcoin mining stocks plummeted 90% in 2022, public miners could significantly reduce administrative costs by going private or merging with others to share the costs.\n\nAlongside predicting that 2023 will become the year of Bitcoin miners’ merge, Hash Rate Index also forecasted a massive restructuring year in the Bitcoin mining industry. The analysts are confident that strengthening balance sheets will be a top priority for Bitcoin miners in 2023 as they fight to avoid bankruptcy.\n\nThe analysts noted that the unsustainable debt levels of some Bitcoin miners will force them to proceed with debt restructuring as the only option. Debt restructuring can imply negotiating lower interest rates or extending the due dates of the debt, the authors added.\n\nAccording to the analysts, Bitcoin miners will also increasingly hedge risks in 2023 by utilizing Bitcoin mining derivatives, including those allowing miners to sell their future hash rate for a specific hash price. “We will see a trend commencing of miners seeking to hedge everything that can be hedged, just like what is expected in more mature commodity-producing industries,” Mellerud and Harper stated.\n\nAs for broader industry predictions, Hash Rate Index also predicted that the ongoing Bitcoin bear market will likely come to an end in 2023, referring to historical BTC price cycles. However, a full-scale bull market will not commence until traditional finance firms are ready to move into Bitcoin, which would take another one or two years, according to analysts.\n\nBitcoin hash rate growth is also likely to slow down in 2023, while mining equipment will become even cheaper, the analysts predicted.\n\nRelated: Bitcoin miners see mixed successes in tackling debt-fueled overexpansion crisis\n\nHash Rate Index’s Bitcoin mining predictions come amid the crypto mining industry going through a major crisis fueled by Bitcoin losing about 60% of value in 2022. As many as 100% of public mining companies have been forced to sell almost all cryptocurrency that they mined in 2022 in order to survive the crypto winter."
    },
    {
        "id": 28,
        "url": "https://news.google.com/rss/articles/CBMiYmh0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3Jlc2VhcmNoLWJpdGNvaW4tc3VwZXItd2hhbGVzLXJlbWFpbi1hZ2dyZXNzaXZlLWFjY3VtdWxhdG9ycy1yZXRhaWwtc2VsbHMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "Research: Bitcoin super whales remain aggressive accumulators, retail sells - CryptoSlate",
        "content": "Glassnode data analyzed by CryptoSlate showed a divergence between super whales and retail, with the former remaining in aggressive accumulation mode going into the new year.\n\nBitcoin Accumulation Trend Score\n\nThe Accumulation Trend Score (ATS) looks at the relative size of entities that are actively accumulating or distributing their Bitcoin holdings.\n\nThe ATS metric uses a spectrum between 0 to 1. A reading closer to 0 indicates distribution or selling. While a score closer to 1 shows accumulation or buying.\n\nAnalysis of the chart below showed that substantial accumulation happened during the FTX collapse around early November 2022, even as the Bitcoin price reacted negatively to the news.\n\nThis suggests that investors, as a whole, saw value in buying at discounted prices.\n\nThe ATS has since turned more neutral, with distribution bias, reflecting lingering macro uncertainties going into 2023.\n\nCohort analysis\n\nCohort analysis gives a graphical representation of accumulation and distribution across six cohorts, ranging from minnows with less than one BTC to super whales holding more than 10,000 BTC.\n\nAs the FTX saga was blowing up, all cohorts were accumulating aggressively. This consistent trend ended around mid-December 2022 when whales (entities holding between 1,000 and 9,999 BTC) began heavily distributing.\n\nThe change in whale sentiment spread across other cohort groups, which also began distributing, but not to the same extent as the whales. Conversely, throughout this period to the present, super whales remained net accumulators to a strong degree.\n\nMega-Whale Address Count\n\nAnalysis of the Bitcoin Mega-Whale Address Count Balance showed entities with more than 10,000 BTC surpassed 120 addresses at the tail end of last year. This encompassed a 30-day change of over 20 additional addresses, marking the fastest growth rate since 2018.\n\nCoupled with the above charts detailing aggressive super whale accumulation, it’s fair to conclude smart money investors were buying the dip.\n\nMentioned in this article"
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMilwFodHRwczovL3d3dy5kYWxsYXNuZXdzLmNvbS9idXNpbmVzcy9sb2NhbC1jb21wYW5pZXMvMjAyMy8wMS8wNC9kYWxsYXMtY29tcGFueS1maW5kcy1hLXdheS10by1wcm9maXQtb2ZmLWJpdGNvaW4tbWluaW5nLXdpdGhvdXQtYWNjZXB0aW5nLXRoZS1oaWdoLXJpc2sv0gGmAWh0dHBzOi8vd3d3LmRhbGxhc25ld3MuY29tL2J1c2luZXNzL2xvY2FsLWNvbXBhbmllcy8yMDIzLzAxLzA0L2RhbGxhcy1jb21wYW55LWZpbmRzLWEtd2F5LXRvLXByb2ZpdC1vZmYtYml0Y29pbi1taW5pbmctd2l0aG91dC1hY2NlcHRpbmctdGhlLWhpZ2gtcmlzay8_b3V0cHV0VHlwZT1hbXA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Dallas company finds a way to profit off bitcoin mining without accepting the high risk - The Dallas Morning News",
        "content": "When cryptocurrency prices were on a tear during the COVID-19 pandemic, with prices peaking in November 2021, a Dallas businessman started looking for a way to benefit from the surge without accepting the high risk.\n\nWes Cummins started Applied Blockchain, now called Applied Digital, which rents out data center space to crypto miners and other players who need a lot of computing power. The company operates on long-term fixed-rate contracts to add more predictability to the business, he said.\n\nAdvertisement\n\n“It takes some risk out,” he said. “If our customers all go bankrupt, eventually there’s a risk to us. But it takes the day-to-day price volatility out. And it takes the technology risk out if someone comes out with a new, really great miner.”\n\nAdvertisement\n\nApplied’s first active site in Jamestown, N.D., has created 33 full-time jobs with an average annual salary of $67,000 plus benefits, said Cummins, who sold Dallas-based investment adviser 272 Capital LP to B. Riley Financial Inc. in August 2021.\n\nBusiness Briefing Become a business insider with the latest news. SIGN UP Or with: Google Facebook By signing up you agree to our Terms of Service and Privacy Policy\n\nIn the next few months, two more sites are expected to come online, including a 200-megawatt, 16-building site in Garden City that is fully contracted out by five customers and will also include a wind farm. The site, which has been delayed by the regulatory approval process in Texas, will need about 40 full-time employees.\n\nThe second upcoming site is a 180-megawatt facility in Ellendale, N.D., that has been contracted out to one large customer, Marathon Digital Holdings, a Las Vegas-based digital asset technology company.\n\nAdvertisement\n\n“Our expectation to be at near 500 megawatts of capacity by early 2023 is unchanged,” Cummins said in a call with investors in October.\n\nThe company scouts for sites in locations with attractive power prices so it can rent out to customers for a lower cost, Cummins said.\n\nOnce these two sites are turned on in early 2023, the company expects to generate roughly $100 million in profit per year, which will equate to revenue in the $300 million to $350 million range, Cummins said. Applied Digital, which trades on the NASDAQ, reported a net loss of $4.5 million and revenue of about $7 million for the June to August period.\n\nAdvertisement\n\nApplied Digital is still seeing high demand for space in its facilities, but the customers have shifted a bit, Cummins said. Several of them are companies that provided loans to miners for buying equipment. Now that some of those miners can’t make their payments, the lending companies have repossessed the equipment and are hosting it in an Applied Digital space, Cummins said.\n\nAdvertisement\n\nApplied Digital and other competitors benefited from China cracking down on crypto mining in mid-2021, which forced some miners to find space elsewhere. But the company changed its name from Applied Blockchain to Applied Digital in November to reflect its ability to host a broader range of customers than just crypto miners.\n\n“We continue to see strong demand from cryptocurrency customers, but we believe diversifying our customer base and revenue stream will be of long-term benefit to our shareholders,” Cummins told investors.\n\nAdvertisement\n\nFrom left, Applied Digital CEO Wes Cummins, executive vice president of operations Regina Ingel, executive vice president of finance Saidal Mohmand and chief financial officer David Rench. (Shafkat Anowar / Staff Photographer)\n\nWith the crypto meltdown this year, Applied Digital found another way to profit off the industry by creating a fund to acquire distressed crypto assets like servers that are selling for 90% less than they were a year ago, he said. The fund will buy the distressed equipment to run in an Applied Digital hosting facility. The bitcoin that the machines mine will be returned to fund investors, he said.\n\n“This is a way to let institutional investors like family offices come into a space in a way that looks familiar to them, by investing in a fund,” he said.\n\nCummins said he’s expecting a few more bankruptcies in the crypto space in 2023, as well as some consolidation. Right now, Applied Digital has no plans to add any more sites for bitcoin mining, he said.\n\nAdvertisement\n\n“It has definitely been a struggle for the industry,” Cummins said. “I think if bitcoin goes up in 2023, which I think it will, the one prediction I’m really confident on is that it won’t be without a lot of volatility.”"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiYWh0dHBzOi8vZm9ya2FzdC5uZXdzL21hcmtldHMtYml0Y29pbi1ldGhlci1yaXNlLXNvbGFuYS1zdXJnZXMtMTgtYXMtbmV3LWRvZy1jb2luLXNwaWtlcy1pbnRlcmVzdC_SAWVodHRwczovL2Zvcmthc3QubmV3cy9tYXJrZXRzLWJpdGNvaW4tZXRoZXItcmlzZS1zb2xhbmEtc3VyZ2VzLTE4LWFzLW5ldy1kb2ctY29pbi1zcGlrZXMtaW50ZXJlc3QvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Markets: Bitcoin, Ether rise; Solana surges 18% as new dog coin spikes interest - Forkast News",
        "content": "Bitcoin and Ether rose in Wednesday afternoon trading in Asia, along with all other top 10 non-stablecoin cryptocurrencies. Solana led gains with an 18% surge, followed by Cardano and BNB.\n\nSee related article: U.S. banking regulators warn against cryptocurrency fraud, contagion risks\n\nFast facts\n\nBitcoin edged up 0.83% to US$16,817 in the 24 hours to 4 p.m. in Hong Kong, while Ether gained 2.78% to trade at US$1,251, according to data from CoinMarketCap.\n\n\n\nSolana, currently the 10th largest non-stablecoin crypto by market capitalization, surged 18.45% in the last 24 hours to change hands at US$14.12, mainly driven by the launch of Bonk, a Solana-focused dog-themed coin that airdropped half of its token supply last week. Solana rose 39.22% in the past calendar week.\n\n\n\nCardano strengthened 4.69% to change hands at US$0.2654, and BNB gained 3.63% to US$255.26.\n\n\n\nAsian equities markets had a mixed day, as investors sought signs of interest rate changes ahead of the Wednesday release of the U.S. Federal Reserve’s meeting minutes.\n\n\n\nHong Kong’s Hang Seng Index closed 3.22% higher and the Shanghai Composite index inched up 0.22%. Japan’s Nikkei 225 dropped 1.45% as Japanese factory activity in December fell at the highest pace in 26 months.\n\nSee related article: Binance declines comment on speculation it may buy South Korean crypto exchange GOPAX"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vZGlzcnVwdGl2ZS10ZWNobm9sb2d5LWNoYW5uZWwvdGhlLW1ldGhhbmUtY2FzZS1mb3ItYml0Y29pbi1vcHRpbWlzbS1pbi1hcmtmLWFuZC1hcmt3L9IBc2h0dHBzOi8vd3d3LmV0ZnRyZW5kcy5jb20vZGlzcnVwdGl2ZS10ZWNobm9sb2d5LWNoYW5uZWwvdGhlLW1ldGhhbmUtY2FzZS1mb3ItYml0Y29pbi1vcHRpbWlzbS1pbi1hcmtmLWFuZC1hcmt3L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "The Methane Case for Bitcoin Optimism in ARKF and ARKW - ETF Trends",
        "content": "Let’s face it – it’s tough to be in crypto right now. While the broader market has been pummeled by challenges like inflation and rising rates, the crypto industry, already in a crypto winter, has suffered some high-profile scandals and setbacks. That doesn’t mean there isn’t a role for crypto in future portfolios, and crypto engineers are still finding ways to innovate – with one possible case for Bitcoin optimism found, surprisingly, in methane emissions.\n\nMethane, while less outright harmful than carbon dioxide, still is contributing to global climate change – but while it’s burning, it could also be reused to mine Bitcoin, getting more bang for each fossil fuel buck. That’s according to recent research from ARK Invest, which shows that as firms haven’t sunk costs into flared systems en masse, vented methane could be used at well sites to mine Bitcoin.\n\nThe electricity generation required to mine Bitcoin via venting would also cost much less than it does currently for public Bitcoin mining companies, and when assuming no supply issues for hardware, Bitcoin miners could undercut “pure play” miners by using vented methane.\n\nThat could increase the return on investment for oil and gas fields and also unlock a new phase for Bitcoin mining writ large, supporting firms like Coinbase (COIN) which could see heightened traffic. Already down from crypto’s struggles, ARK Invest has been buying the dip on COIN, with the stock weighted at 6.9% in the ARK Fintech Innovation ETF (ARKF) and 4.7% in the ARK Next Generation Internet ETF (ARKW).\n\nARKF charges 75 basis points and actively invests in firms poised to benefit from fintech advances in services like mobile payments, the blockchain, and customer platforms. ARKW meanwhile charges 88 basis points for its active investing, looking at companies set to benefit from advances in cloud computing, big data, AI, and more.\n\nBitcoin and other cryptocurrencies have taken a wallop lately, and that’s true. That doesn’t mean that the tide of innovation has stopped, with reusing vented methane one case for Bitcoin optimism to watch moving forward in ETFs like ARKF and ARKW.\n\nFor more news, information, and analysis, visit the Disruptive Technology Channel."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLWFuYWx5c3QtcmV2ZWFscy1uZXcta2V5LWxldmVscy1hcy1ldGhlcmV1bS1wcmljZS1uZWFycy0zLXdlZWstaGlnaNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin analyst identifies new key levels as Ethereum price nears 3-week high - Cointelegraph",
        "content": "Bitcoin (BTC) continued to work on cracking the $17,000 mark on Jan. 4 as an “extremely tight” trading zone held firm.\n\nBTC/USD 1-hour candle chart (Bitstamp). Source: TradingView\n\n$17,000 “possible” thanks to CPI print\n\nData from Cointelegraph Markets Pro and TradingView showed BTC/USD hitting $16,906 on Bitstamp, up $300 from the previous day’s low.\n\nThe largest cryptocurrency had benefited from a positive start to the year on Wall Street, this giving a broader boost to previously sideways crypto assets.\n\n“Bitcoin trading with legacy markets yesterday,” Filbfilb, co-founder of trading suite DecenTrader, began a summary of recent events by stating.\n\nAnalyzing the 12-hour chart, he argued that the 50-day moving average (MA) needed to hold for bulls, with the immediate range support and resistance levels at $15,500 and $18,000, respectively.\n\nNext week’s Consumer Price Index (CPI) release for the United States, if favorable, could give BTC price action the catalyst it needs.\n\n“Bitcoin needs to maintain the 50 DMA and break last week's high but a trip there seems possible heading into the CPI data,” Filbfilb added:\n\n“At the moment we are in the upper range of last week’s price action.”\n\nBTC/USD annotated chart. Source: Filbfilb/ Twitter\n\nAs Cointelegraph reported, others had hoped that there would be sufficient impetus for Bitcoin to follow in the footsteps of both stocks and gold as 2023 got underway.\n\nThe latter, trading firm QCP Capital explained on the day, was due to a “Start of year allocation into alternative assets.”\n\nXAU/USD was up 15% in the last two months, it wrote in a market update sent to Telegram channel subscribers, with January historically its best month of the year.\n\n“Despite the mini rally, BTC is still trading in an extremely tight falling wedge - with 18k the key breakout level to the topside,” it continued, echoing Filbfilb:\n\n“In the medium-term, 28k is looking more and more key - as the Head and shoulders neckline, and 61.8% fibonacci retracement level of the $3,858 2020 low to $69,000 2021 high.”\n\nBTC/USD annotated chart. Source: QCP Capital\n\nAnalysis puts faith in $1,000 holding for Ethereum\n\nThe more confident performance looked set to greet Ether (ETH), meanwhile, with solid support levels giving bulls much-needed comfort in the event of a fresh market downturn.\n\nRelated: 3 reasons why it could be a rocky week for Bitcoin, Ethereum and altcoins\n\n“ETH continues looking decidedly more bullish than BTC, although it too is still trading within a consolidation pattern,” QCP wrote:\n\n“The top of the triangle comes in at 1,400 but the big resistance zone lies between 1,700 to 2,000 to the topside. On the downside we expect 1,000-1,100 to be very decent support.”\n\nETH/USD annotated chart. Source: QCP Capital\n\nETH/USD traded at $1,250 for the first time since Dec. 16 at the time of writing, its Jan. 4 daily candle so far sealing 3% gains.\n\nAnalyzing when the crypto market bottom might come, QCP was nonetheless prepared to lie in wait for many months to come.\n\nETH/USD 1-day candle chart (Binance). Source: TradingView\n\n“We expect this could only come in Oct-Nov again this year, but remain open minded to markets bottoming sooner than that,” it concluded.\n\nThe views, thoughts and opinions expressed here are the authors’ alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiZWh0dHBzOi8vZm9ydHVuZS5jb20vMjAyMy8wMS8wNS93aW5rbGV2b3NzLXR3aW5zLWNyeXB0by1tZXNzLWdlbWluaS1lYXJuLWNyeXB0by1sYXdzdWl0LWJhcnJ5LXNpbGJlcnQv0gFpaHR0cHM6Ly9mb3J0dW5lLmNvbS8yMDIzLzAxLzA1L3dpbmtsZXZvc3MtdHdpbnMtY3J5cHRvLW1lc3MtZ2VtaW5pLWVhcm4tY3J5cHRvLWxhd3N1aXQtYmFycnktc2lsYmVydC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "The Winklevoss twins are in a big mess—and it has to do with crypto - Fortune",
        "content": "The Winklevii—or Tyler and Cameron Winklevoss, to use their given names—first rose to fame in the mid-2000s when they sued Meta founder and CEO Mark Zuckerberg, claiming he had stolen their idea for Facebook when they studied together at Harvard. The 6-foot-5 brothers’ story was eventually detailed in the 2010 film The Social Network, including the part where Zuckerberg paid them millions to walk away.\n\nRowing fans might recognize the Winklevii from their sixth place finish in men’s pairs rowing at the 2008 Beijing Olympics, too, but in recent years, the brothers have been in the news for an entirely new reason: cryptocurrencies. The early Bitcoin adopters tapped into the digital asset boom of the early 2010s before launching a crypto exchange, Gemini, in 2014.\n\nTyler and Cameron Winklevoss compete on day one of the Beijing 2008 Olympic Games, Aug. 9. Jonathan Ferrey—Getty Images\n\nBy late 2021, Gemini was on fire and crypto prices were soaring to new record highs each day, leaving the identical twins with a combined net worth of over $7 billion. Industry analysts claimed that the party was just getting started, but after the Crypto Winter wiped out more than $2 trillion in value from the fledgling industry, the worm has turned for the Winklevii.\n\nNow, lawsuits are pending and the brothers are engaged in a very public battle with their former friend, the crypto billionaire Barry Silbert, over what will happen to the frozen funds of more than 340,000 users of Gemini’s Earn platform.\n\nThe Facebook saga leads to early adoption\n\nHundreds of thousands of people worldwide have been affected by Gemini’s recent issues, and none of it would have been possible without Facebook.\n\nIn the early 2000s, Cameron and Tyler had moved from their privileged upbringing in Greenwich, Conn.—their father is Howard Winklevoss, former professor of actuarial science at the University of Pennsylvania’s legendary Wharton business school—and were studying economics in the leafy confines of Harvard. Along with their classmate Divya Narendra, they came up with the idea for a social network called ConnectU to bring university students together and enlisted the help of a sophomore computer science major named Mark Zuckerberg to build out their site.\n\nThe Winklevii and Narendra alleged that Zuckerberg stole their idea to create Facebook. They sued in 2004, and after a legal battle that lasted four years, eventually settled with the Meta CEO for $65 million in mediation.\n\nThe brothers used their settlement money to invest in dozens of startups through their family office, Winklevoss Capital, and also made a timely investment in what was then a little known digital token, Bitcoin.\n\nIn April 2013, they revealed that they had invested $11 million in Bitcoin when it was trading at just $120. A year later, they launched a cryptocurrency exchange, Gemini, on the back of the investment, and everything was going according to plan until the Crypto Winter of 2022.\n\nThe birth of Gemini\n\nIn an interview with Fortune on the eve of Gemini’s launch, Tyler Winklevoss described how he hoped to lean into regulation in order to make cryptocurrencies accessible to retail investors, while also attracting the institutional crowd.\n\n“Wall Street’s not in Bitcoin yet, and part of Gemini and the licensing is to get them there,” he explained.\n\nThe exchange grew quickly, barring a brief period of turbulence in the 2018 bear market, and developed a reputation as a secure U.S.-based option for crypto investors. The Winklevii became some of the first Bitcoin billionaires during Gemini’s rise.\n\nBut as the pair raked in a fortune while crypto fervor grew, they also began leaning into riskier investments. Gemini started NFT marketplace Nifty Gateway in 2018, but the platform quickly experienced security issues and was surpassed by the competition before being integrated into Samsung’s NFT platform.\n\nIn September 2021, Cameron Winklevoss also told Fortune about one—let’s call it, unique—investment into a startup that was attempting to revive woolly mammoths to combat climate change, saying that he saw the endeavor making money via television ads or “even parks for extinct animals, like Jurassic Park.”\n\nEarlier that year, the Winklevii had launched their most important business yet, Gemini’s Earn platform. The crypto lending service offered juicy returns of “up to 7.4%” for depositing crypto, promising that customers could redeem their funds “at any time.” By comparison, the average savings account in the U.S. offers just a 0.2% return today.\n\n“Today’s investors know that a smart, diverse portfolio includes crypto—it’s an investment in their future selves,” Tyler Winklevoss said in a press release at the launch. “We designed a program that allows our customers the ability to generate a real return on their crypto holdings without having to sell one of the best performing asset classes of the decade.”\n\nAnother victim of the Crypto Winter?\n\nThe only problem for Gemini was that in order to offer high returns to investors, the company needed to make relatively (or definitely) risky bets with their customers’ crypto. That’s not so difficult in a bull market, but when prices begin to fall, finding a stable return can be a challenge.\n\nOne of the ways Gemini created these returns was through Genesis Global Capital, the lending arm of crypto investment firm Genesis Global Trading, which is owned by Silbert’s Digital Currency Group. Gemini lent users’ funds to Genesis, which in turn loaned them out to institutional borrowers.\n\nThe Winklevii were confident that cryptocurrency prices would continue to rise, which would enable them to offer high yields to customers consistently through this plan. In September 2021, during the height of the crypto boom, Cameron Winklevoss even told Fortune that he believed Bitcoin would end the year at $100,000 (it was less than $47,000).\n\nBut when prices for cryptocurrencies tanked in 2022, it was a whole new world for Gemini and the Winklevii, and Gemini Earn users were particularly at risk. By June, Gemini was forced to slash 10% of its workforce. And just months later, reports surfaced that the firm would need to raise at least $1 billion to stave off bankruptcy for its Gemini Earn platform.\n\nThe issue was made even worse when Genesis decided to stop issuing redemptions to clients such as Gemini after the collapse of FTX—which was once the world’s second-largest crypto exchange. The decision meant that Gemini didn’t have the money to pay returns or redeem funds on their Earn platform.\n\nIn an open letter to Silbert this week, Cameron Winklevoss said that over 340,000 users have more than $900 million in crypto trapped at Silbert’s Genesis Global Capital, and in total Silbert’s companies owe Gemini $1.675 billion. He argued that Silbert was engaging in “bad faith stall tactics” to avoid paying back customers.\n\n“The idea in your head that you can quietly hide in your ivory tower and that this will all just magically go away, or that this is someone else’s problem, is pure fantasy,” he wrote.\n\nBarry Silbert, founder and CEO of Digital Currency Group Joe Buglewicz—Bloomberg/Getty Images\n\nSilbert responded by saying that he did not borrow $1.675 billion, and that he “never missed an interest payment.” And some critics have argued that a collapse was inevitable owing to the unsustainable returns offered by Gemini. BlockFi, another crypto lender that offered high returns to investors, filed for bankruptcy in November amid the Crypto Winter and the collapse of FTX.\n\nYet Cameron Winklevoss said that he is trying to return funds to customers, but can’t because of Silbert.\n\n“There you go again,” he said. “Stop trying to pretend that you and DCG are innocent bystanders and had nothing to do with creating this mess. It’s completely disingenuous.”\n\nWinklevoss went on to ask if Silbert would commit to refunding $1.1 billion of what he owes by Jan. 8, but he got no response.\n\nNow, Gemini’s Earn users are suing Silbert and the Winklevoss twins, alleging that Silbert breached his contract by pausing redemptions, and the Winklevii sold interest-bearing accounts without properly registering them as securities.\n\nThe Commodity Futures Trading Commission (CFTC) also filed a suit against the twins for misrepresenting the way their exchange and futures contracts operated back in 2017 when they sought regulatory approval.\n\nGemini’s main business, its crypto exchange, is meanwhile in danger of fading into irrelevance. The exchange’s spot trading volume over the past 24 hours was just $32.8 million. By comparison, the world’s leading crypto exchange, Binance, had volumes of more than $8.3 billion over the same period."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiYGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9sYXN0cGFzcy1kYXRhLWJyZWFjaC1sZWQtdG8tNTNrLWluLWJpdGNvaW4tc3RvbGVuLWxhd3N1aXQtYWxsZWdlc9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "LastPass data breach led to $53K in Bitcoin stolen, lawsuit alleges - Cointelegraph",
        "content": "A class-action lawsuit has been filed against password management service LastPass following a data breach from Aug. 2022.\n\nThe class action was filed with the United States district court of Massachusetts on Jan. 3 by an unnamed plaintiff known only as “John Doe” and on behalf of others similarly situated.\n\nIt alleges that the data breach of LastPass has resulted in the theft of around $53,000 worth of Bitcoin (BTC).\n\nThe plaintiff claimed he began accruing BTC in July 2022 and updated his master password to more than 12 characters using a password generator, as recommended by the LastPass “best practices.”\n\nThis was done to enable the storage of private keys in the seemingly secure LastPass customer vault.\n\nWhen news of the data breach broke, the plaintiff deleted his private information from his customer vault. LastPass was hacked in Aug. 2022, with the attacker stealing encrypted passwords and other data, according to a December statement from the company.\n\nDespite the quick action to delete the data, it appeared to be too late for the plaintiff. The lawsuit read:\n\n“However, on or around Thanksgiving weekend of 2022, Plaintiff’s Bitcoin was stolen using the private keys he stored with Defendant [LastPass].”\n\n“The LastPass Data Breach has, through no fault of his own, exposed him to the theft of his Bitcoin and exposed him to continued risk,” it added.\n\nThe suit claims that victims have been put at increased substantial risk of future fraud and misuse of their private information, which may take years to manifest, discover and detect.\n\nLastPass is being accused of negligence, breach of contract, unjust enrichment and breach of fiduciary duty. However, the figure sought in damages was not specified.\n\nRelated: 'Third-party incident' impacted Gemini with 5.7 million emails leaked\n\nAccording to cybersecurity researcher Graham Cluley, the stolen data includes unencrypted information including company names, user names, billing addresses, telephone numbers, email addresses, IP addresses and website URLs from password vaults.\n\nr/t LostPass?\n\n\n\nAfter the LastPass hack, here’s what you need to know...https://t.co/8x47Vze0lb — Graham Cluley (@gcluley) January 4, 2023\n\nIn December, LastPass admitted that if customers had weak Master Passwords, the attackers may be able to use brute force to guess this password, allowing them to decrypt the vaults."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9iaW5hbmNlLWNvbnRyb2xsZWQtOTItYml0Y29pbi1zcG90LTIwMzYwNDg3My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Binance Controlled 92% of Bitcoin Spot Trading Volume at End of 2022: Arcane Research - Yahoo Finance",
        "content": "The world’s largest crypto exchange, Binance’s market share of bitcoin (BTC) trading volume rose to 92% by the end of 2022, according to Arcane Research.\n\nThe exchange’s market share was just 45% at the start of last year, but the elimination of trading fees in June, not to mention the collapse of rival FTX in November, served to push users to Binance.\n\n“No matter how you look at it in terms of trading activity, Binance is the crypto market,” Arcane wrote. “After lifting trading fees for its BTC spot pairs this summer, Binance completely overtook all market share in the spot market.”\n\nBinance dominance in crypto spot and derivatives Market Research Jan 3, 2023 Binance Dominance (Source: Arcane Research)\n\nWhile Binance has been by far the biggest crypto exchange by trading volume for several years, these and other numbers suggest monopoly-like dominance. A report from CryptoCompare showed Binance’s overall year-end crypto market share was 66.7%. Coinbase (COIN) came in second with a relatively tiny 8.2%.\n\n“Retail crypto could enter a dark age that takes forever to exit” should Binance fail, said Edward Moya, senior analyst at Oanda. “Binance is too big … It is not healthy to have so much of the trading volume concentrated with any one exchange.”\n\nChatter about the solvency of Binance increased significantly after the collapse of FTX, and the exchange did suffer some outflows for a short period, though things have stabilized since. A market share this high could become problematic for the industry if Binance were to encounter any issues, whether regulatory or mistrust from users.\n\nBinance is currently under investigation by the U.S. Justice Department over compliance with anti-money laundering laws and sanctions. The exchange also recently lost its auditor, Mazars Group, which announced a pause in its work with crypto exchanges looking to produce proof-of-reserves."
    },
    {
        "id": 40,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL2JpdGNvaW4tdXR4b3MtZ3Jvdy1kZXNwaXRlLWJlYXItbWFya2V0L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Research: Bitcoin UTXOs grow despite bear market - CryptoSlate",
        "content": "Unspent Transaction Outputs (UTXOs) are often referred to as the fundamental building block of Bitcoin. As the Bitcoin network is built on an accounting model based on unspent outputs, they can be used to measure the overall state and growth of the network.\n\nChanges in the cumulative value settled through UTXOs, their number, and the percentage of them in profit or loss can indicate where the network stands and where it’s heading.\n\nWhat are UTXOs?\n\nPut bluntly, an unspent transaction output is the amount of BTC that remains after every transaction. Every time a Bitcoin transaction takes place, existing inputs are deleted and new outputs are created. Outputs that aren’t spent immediately become UTXOs tied to the sender.\n\nFor example, if an address with a balance of 1 BTC wants to send a transaction of 0.4 BTC, the transaction will break up the balance into two separate outputs: the 0.4 BTC paid to the receiver, and the 0.6 BTC that’s left behind. The 0.6 BTC is “unspent,” returned to the sender, and becomes a UTXO that can be used as an input in later transactions.\n\nAlmost all Bitcoin transactions end up using unspent transaction outputs. Only transactions using a single unified data byte — i.e. transactions in increments of whole numbers — don’t generate UTXOs. However, these transactions are rare enough that they can be ignored when looking at unspent output data.\n\nCryptoSlate’s analysis of Bitcoin UTXOs showed that there has been continuous growth in the total number of UTXOs since 2018. The rising number of unspent outputs defied every instance of price volatility and continues to grow through the ongoing bear market. Positive growth in the UTXO set indicates increased network usage, while negative values show a contraction in network usage.\n\nData from Glassnode showed that the total set of Bitcoin UTXOs reached its all-time high in the first days of January, counting over 136 million UTXOs.\n\nThe persistent growth in the UTXO set shows that the network has been growing despite the bear market. Crypto winters have historically been periods of stagnating network growth, as low prices and uncertainty push many users out of the network. On the other hand, bull markets have historically triggered periods of fast network growth, as an increase in speculators drives the overall network usage up.\n\nUTXOs can also help determine future market momentum.\n\nLooking at the price stamp assigned at the time of the creation of each UTXO and comparing it to BTC’s current price shows which outputs are in profit and which are in loss.\n\nAs of Jan. 3, around 100 million of UTXOs are in profit. This means that 70% of all unspent transaction outputs ever created have transacted with BTC below its current price. An above-average count of in-profit outputs has historically been associated with positive market momentum.\n\nHowever, it’s still too early to tell when the positive price action might occur. The 1-year rolling Z-Score of UTXOs in profit has last been positive at the end of 2021, suggesting that the bear market might continue well into 2023."
    },
    {
        "id": 41,
        "url": "https://news.google.com/rss/articles/CBMiVGh0dHBzOi8vc2NoaWZmZ29sZC5jb20vZXhwbG9yaW5nLWZpbmFuY2UvYS1iZXQtb24tYml0Y29pbi1pcy1nYW1ibGluZy1vbi10aGUtd2hhbGVzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "A Bet on Bitcoin is Gambling on the Whales - SchiffGold",
        "content": "A Bet on Bitcoin is Gambling on the Whales\n\nby SchiffGold 0\n\nKey Takeaways\n\nThe price of Bitcoin has been suspiciously stable following the epic collapse of FTX less than 2 months ago The whales are defending the Bitcoin price at $16,000 waiting for interest to flood back into Bitcoin It’s hard to imagine a bigger hype train than 2021 which means Bitcoin may not make a new all-time high\n\nAn Artificial Market\n\nThe Bitcoin market has completely flat-lined since Nov. 9. This was directly after the FTX collapse, which I wrote about back in November. In that analysis, I mentioned how I had been raising concerns before the collapse about how quiet the Bitcoin market had looked over the summer of 2022.\n\nIn the lead-up to the Three Arrows and Luna collapse, the Bitcoin market had been seeing major weakness from November 2021 up through May 2022, falling from $67k to $30k. This weakness actually helped perpetuate the collapse of Luna and Three Arrows.\n\nThe collapse in Luna and Three Arrows then caused the price of Bitcoin to drop below $20k. Looking like it could drop to $10k in short order. However, immediately following the drop below $20k, the market stabilized until the FTX collapse. That pushed the price down another 20% to the $16k region.\n\nSince FTX collapsed, the market has gone even quieter. The price has been bouncing between a very tight range of 16.5k and 17.5k for almost two months now.\n\nThe chart below shows this price action compared to the S&P 500. While the S&P has continued to bounce around the last two months, Bitcoin has gone incredibly quiet. This seems extremely unlikely after such a major event unless interested parties are in the market defending the price.\n\nFigure: 1 SPY vs BTC\n\nOne of the primary metrics used to evaluate price fluctuations is volatility. This is the standard deviation of the price, annualized. The chart below shows the volatility of the S&P and Bitcoin going back to early 2021.\n\nAs can be seen, the volatility in Bitcoin is consistently above the S&P 500 by a wide margin. Bitcoin tracked around 75% whereas the S&P was around 15%. It should be noted that the volatility lines below are actually correlated, as the S&P became more volatile so did Bitcoin. That remained true until the Fall of 2022.\n\nThe 30-day rolling volatility in Bitcoin plunged in October and actually dipped below the S&P volatility for a brief period on Oct. 24 . When FTX happened, volatility spiked, but it was very short-lived. On Dec 7th, the 30-day vol of Bitcoin was 77%. This plunged to 32% on Dec 12th as the trading period around FTX faded past 30 days. 30-day rolling Bitcoin volatility finished the year at 27%, dipping below the 28% low seen before the FTX spike.\n\nThink about this! After each successive collapse, the market becomes more stable and less volatile. It’s not even seeing a price rebound as rumor/speculation becomes fact. You would expect either a price rebound if the bad news had been priced in or further selling if the market had not anticipated an event.\n\nFigure: 2 SPY and BTC Volatility\n\nThis would be like the stock market flat-lining directly after the collapse of Lehman or the Covid lockdowns (the market actually saw massive turnarounds). One might argue that this is proof that Bitcoin is becoming more mature and cleaning out the deadwood. But this does not make sense because markets do not stabilize in the wake of such uncertainty. They become more volatile! This is especially true when surrounding markets also increase in volatility.\n\nThe chart below plots the difference between the S&P and Bitcoin volatility shown above. At the end of December, Bitcoin and the S&P volatility were separated by only 1,100 bps. Over the past 3 months, as the S&P has become more volatile, Bitcoin has become less volatile. How is this possible? Especially in the wake of an epic exchange collapse, how does the price of Bitcoin just flat-line?\n\nThe answer: the Bitcoin whales are supporting this market. They have put a floor around $16,000 and are defending that floor. Why? Because it is easier to defend a floor than drive the recovery after a big fall. If the price were to drop to $10k it would take more effort to get back to $16k than simply defending $16k. Furthermore, if the market looks stable, then holders will be less tempted to sell. If the market were to drop below support, it could create a cascading selling event, imploding the price of Bitcoin.\n\nThis is not just speculation either. A recent paper from the National Bureau of Economic Research found rampant market manipulation in the smaller and less regulated exchanges. Kitco provided a good summary of the findings last week.\n\nFigure: 3 Volatility/Standard Deviation\n\nThis drop is even more surprising around the holidays when Bitcoin typically picks up in volatility. In fact, Bitcoin just saw its least volatile December since 2012! The S&P however, just saw its most volatile December since 2018.\n\nThis does not make any sense. FTX collapse and a volatile stock market should be driving volatility higher in Bitcoin not lower. It is a flat market because the whales have their thumbs on the scale.\n\nFigure: 4 December Volatility\n\nThe whale’s best bet is to stabilize the price and let the market consolidate at a high price point. They hope that if they can bide their time at a higher price point, it will be easier to blast the price higher once (if?) interest in Bitcoin returns.\n\nRight now, the whales just want the market to go into hibernation at a high price point and consolidate there. It’s working too. The chart below shows the Google Trends for both Bitcoin and Ether. They are both at lows last seen in November 2020.\n\nFigure: 5 Price and Volume\n\nThe chart below shows even more evidence of a market that is waning in interest. Trade volume has gone nearly straight down after peaking on November 23rd. 30-day average rolling volume is now at the lowest level since May, before the Luna blow-up, Three Arrows Collapse, and FTX collapse. We are less than 60 days from the FTX collapse and yet trade volume is simply evaporating.\n\nFigure: 6 Price and Volume on Log Scale\n\nAnother dataset to consider is the Comex futures market. Bitcoin futures started trading in 2017. Open interest has actually stayed relatively flat since September 2022.\n\nFigure: 7 Comex Open Interest\n\nThe flat open interest was in the face of futures trade volume plummeting in December to the lowest level since August 2021. The futures market is a reflection of institutional interest, and this market is also getting quiet.\n\nFigure: 8 Comex Volume\n\nThe CFTC breaks down open interest into different categories in its Commitment of Traders (COT) reports. That report shows that the net position of longs has actually stayed relatively stable. The only change over the past several months came on the short side as Dealers took over some of the Lev money shorts positions.\n\nFigure: 9 CFTC Net Long Short Contracts\n\nWhile the Asset Manager position above looks relatively stable. the chart below shows the notional amount of open contracts. Looking at the two charts together shows that Asset Managers have sat in their positions and watched their position value collapse from $1.45B to $408M since October 2021. This represents a 72% fall in value in just over a year.\n\nThe Asset Managers have been crushed, yet they are still holding on. Another round of selling could cause the Asset Managers to finally throw in the towel and sell. Not only would this crush the price but it would nearly wipe out the Bitcoin futures market.\n\nAs of December, Asset Managers hold 93% of the net long position in Bitcoin. If they cut bait and run, the futures market will see open interest completely crash. This is another reason why the whales are defending the price so hard. If the institutions leave, they might not come back.\n\nFigure: 10 CFTC Net Long Short Notional\n\nFinally, we can look at the Grey Scale Bitcoin Trust (GBTC) premium/discount to gauge where market sentiment is at the moment. The current GBTC discount is approaching 50%. This means that you can buy Bitcoin at half the price if you use GBTC!\n\nFigure: 11 GBTC Premium and Discount\n\nThe chart below uses the GBTC discount and premium to derive a market-implied price. The current market implied price is right around $9k. This is the lowest level since April 2020!\n\nFigure: 12 GBTC Implied Price\n\nWhat’s the point?\n\nIn the wake of the epic FTX collapse, the Bitcoin market has gone extremely quiet. Way too quiet , especially given the volatility seen in the general stock market. The explanation is the whales defend the price.\n\nIf the whales let the price fall back below $10k, it would take a massive effort to reinflate the bubble. Think about how Bitcoin got to $60k. In 2021 you had:\n\nThe Fed pumping trillions of dollars Every asset in the world surging in value Non-stop coverage of Bitcoin across every media platform The surge in the NFT market\n\n\n\nEverything went right and the whales could ride the wave, unloading their Bitcoin on the new entrants. 2021 was peak Bitcoin though. How do you generate more hype than 2021 to sucker in any new investor? This is the problem the whales face, there won’t be another catalyst that will enable them to dump their Bitcoin on the next round of suckers.\n\nTrue believers keep talking about Bitcoin winters and how they all eventually end with each summer brighter than the previous. It’s brighter because each summer has seen greater interest and hype. Unfortunately, if you were not a buyer in 2021, and you aren’t buying this dip… you probably won’t be buying in the future.\n\nThe whales are waiting for the winter to end, but it’s more likely this winter will never end for Bitcoin. Given the challenges ahead in 2023, it’s time for astute investors to convert digital nothing into hard currency. Physical supply shortages in precious metals are a real thing , unlike the superficial supply constraint of Bitcoin.\n\nI am in no way predicting an imminent collapse of Bitcoin. But the market is way too quiet. How much support can the whales offer? Are you willing to bet big on the whales continuing to defend the current $16k level?\n\nFurthermore, the next Bitcoin catalyst will likely spark more selling. This could be another exchange collapse, or even something breaking the general stock market causing money to flee risk assets. If the $16,000-floor breaks, it could be a quick move down to $10k as the whales run out of firepower. This type of manipulation and dependence on a few big players does not exist in other markets. If you trust a few whales to protect your gamble on a digital token barely 10 years old, then so be it. Otherwise, consider something with a much longer track record and far more stable: buy some gold!\n\nData Source: Tiingo , Coin Market Cap , and the Block\n\nSome of these views and charts can be accessed through the Exploring Finance Portfolio Builder tool\n\nGet Peter Schiff’s key gold headlines in your inbox every week – click here – for a free subscription to his exclusive weekly email updates.\n\nCall 1-888-GOLD-160 and speak with a Precious Metals Specialist today!"
    },
    {
        "id": 42,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzA1L2NyeXB0by1sYXlvZmZzLWhlcmVzLXRoZS1ncmltLWNvdW50LXNpbmNlLWFwcmlsL9IBYWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9idXNpbmVzcy8yMDIzLzAxLzA1L2NyeXB0by1sYXlvZmZzLWhlcmVzLXRoZS1ncmltLWNvdW50LXNpbmNlLWFwcmlsL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "Crypto Layoffs: Here's the Grim Count Since April - CoinDesk",
        "content": "As these crypto firms try to stay afloat, CoinDesk has compiled a list of industry players that have cut back on staff. By our count, an estimated 29,868 crypto jobs have been lost as of Mar. 28, based on media reports and press releases. Here’s where we stand:"
    },
    {
        "id": 43,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZGVjcnlwdC5jby8xMTgzNTIvYml0Y29pbi1taW5pbmctZmlybS1yaW90LWRpdGNoZXMtYmxvY2tjaGFpbi1mcm9tLW5hbWUtaW4tcmVicmFuZNIBYGh0dHBzOi8vZGVjcnlwdC5jby8xMTgzNTIvYml0Y29pbi1taW5pbmctZmlybS1yaW90LWRpdGNoZXMtYmxvY2tjaGFpbi1mcm9tLW5hbWUtaW4tcmVicmFuZD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin Mining Firm Riot Ditches 'Blockchain' From Name in Rebrand - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nBitcoin mining firm Riot Blockchain has rebranded to Riot Platforms, in a move intended to reflect the company's “increasingly diversified business operations.”\n\nRiot, which has seen its market capitalization collapse by over 85% in the past year, remains the world's most valuable publicly traded Bitcoin mining firm, well ahead of its closest rival Marathon Digital Holdings by valuation.\n\nThe past few years have seen Riot engage in a significant number of acquisitions, some of which could potentially support a transition toward a more diversified business model.\n\nAD\n\nAD\n\nRiot Blockchain, Inc. Announces Corporate Rebranding to Riot Platforms, Inc., Reflecting Increasingly Diversified, Bitcoin-Driven, Business Operations. Read more in today’s press release: https://t.co/zEPk3cojFS. — Riot Platforms, Inc. (@RiotPlatforms) January 3, 2023\n\nIn December 2021, Riot acquired ESS Metron, a Denver-based electrical component engineering firm that caters to the power and water industries, in a deal worth approximately $50 million of Riot's common stock and $25 million in cash.\n\nThe company also acquired Whinstone US, the owner and operator of North America’s largest Bitcoin mining and hosting facility, in May 2021, with the deal estimated to be worth around $651 million.\n\nI predict a Riot\n\nRiot’s common stock will continue to be listed for trading on the NASDAQ stock exchange under its existing ticker symbol RIOT.\n\nThis isn’t the first time that mining companies have shifted away from a blockchain focus in their branding.\n\nAD\n\nAD\n\nAs far back as August 2022 crypto miner Applied Blockchain (APLD) announced its rebranding to Applied Digital, as it looked to dedicate some of its computing power to other high-performance computing applications beyond mining.\n\nIt’s understandable why some Bitcoin mining firms are looking to pivot away from a focus on mining, as the sector struggles in the face of the ongoing crypto winter and increased energy prices. A number of well-known firms within the industry have either declared bankruptcy or are in the midst of wide-ranging restructuring plans to avoid it.\n\nIn late December Core Scientific, which was once one of the industry's largest Bitcoin miners, filed for Chapter 11 bankruptcy protection in Texas.\n\nThat same month, Bitcoin miner Greenidge announced that there was “substantial doubt” about its capacity to continue as a business, saying that its Board of Directors was actively discussing the possibility of voluntary bankruptcy amid complex plans for debt cancellation."
    },
    {
        "id": 44,
        "url": "https://news.google.com/rss/articles/CBMivAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMDQtamFudWFyeS0yMDIyL2FydGljbGVzaG93Lzk2NzMyMjkwLmNtc9IBwAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vbWFya2V0cy9jcnlwdG9jdXJyZW5jeS9jcnlwdG8tcHJpY2VzLXRvZGF5LWxpdmUtbmV3cy1iaXRjb2luLWRvZ2Vjb2luLWV0aGVyZXVtLXNoaWJoYS1pbnUtY3J5cHRvY3VycmVuY3ktbGF0ZXN0LXVwZGF0ZXMtMDQtamFudWFyeS0yMDIyL2FtcF9hcnRpY2xlc2hvdy85NjczMjI5MC5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Crypto Price Today Live: Bitcoin near $17,000; Solana rises up to 17% - The Economic Times",
        "content": "Bitcoin $16,861.49 0.61%\n\nEthereum $1,248.54 2.42%\n\nTether $0.9998 -0.01%\n\nUSD Coin $1 -0.01%\n\nBNB $254.38 3.06%\n\nXRP $0.3479 0.77%\n\nDogecoin 0.07233 0.20%\n\nCardano $0.2642 3.72%\n\nPolygon $0.8018 1.91%\n\nPolkadot $4.66 2.77%\n\nTron $0.05544 -0.06%\n\nLitecoin $76.79 0.90%\n\nShiba Inu $0.000008268 0.79%\n\nSolana $13.91 17.23%\n\n\n\n\n\n\n\n\n\nNew Delhi: The cryptocurrency market continued to move higher on Wednesday as buying was seen across all major cryptocurrencies. Bitcoin celebrated a calm 14th birthday as it hovered around the $16,864 mark, which is a jump of 0.74% from the previous day. Solana continued its mega rally as it surged by over 17% fuelled by positive sentiments around the coin.\"The market has started 2023 on a positive note and it is expected to sustain this momentum if we don’t get any surprising news headlines,\" Shivam Thakral, CEO of BuyUcoin said.Most of the other top crypto tokens were also trading higher on Wednesday.Cardano gained 3.78%. Ethereum , Binance, Dogecoin, Polygon and Litecoin were also trading higher. However, Tether, XRP and Tron were trading lower.The global cryptocurrency market cap was trading higher around $818.75 billion, rising 1.22% in the last 24 hours.The total volume in DeFi is currently $2.12 billion, around 6.89% of the total crypto market 24-hour volume. The volume of all stablecoins is now $28.37 billion, which is 92.24% of the total crypto market 24-hour volume.The market cap of Bitcoin, the world's largest cryptocurrency, hovered around $324 billion, with a dominance of about 39.63%, a decrease of 0.23% over the day, according to CoinMarketCap.\"Looking at the historical growth of Bitcoin, we find that it has thrived victoriously through multiple bull and bear market cycles. According to data from Glassnodes, close to 60% of circulating Bitcoin hasn't moved in a year. This shows that the trust in the asset remains rock solid. We are confident that Bitcoin will continue to emerge victorious and see greater heights in future,\" Raj Karkara, COO of ZebPay said.Banks should be more careful about the risks of fraud, legal uncertainty and misleading disclosures by crypto firms, U.S. regulators warned on Tuesday, just two months after the collapse of crypto exchange FTX stunned the financial world.In their first joint statement on crypto, the Federal Reserve, Federal Deposit Insurance Corp (FDIC) and the Office of the Comptroller of the Currency (OCC) said they had concerns with the safety and soundness of bank business models that are highly concentrated in crypto.Crypto Cart: Quick Glance (Source: coinmarketcap.com , data as of 12.01 hours, IST on January 04, 2023)(Note: Price change in last 24 hours)"
    },
    {
        "id": 45,
        "url": "https://news.google.com/rss/articles/CBMidGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMDQvYmluYW5jZS1sZWQtbWFya2V0LXNoYXJlLWluLTIwMjItZGVzcGl0ZS1vdmVyYWxsLWRlY2xpbmUtaW4tY2V4LXZvbHVtZXMv0gF4aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wMS8wNC9iaW5hbmNlLWxlZC1tYXJrZXQtc2hhcmUtaW4tMjAyMi1kZXNwaXRlLW92ZXJhbGwtZGVjbGluZS1pbi1jZXgtdm9sdW1lcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Binance Led in Market Share in 2022 as Volume on Centralized Exchanges Fell - CoinDesk",
        "content": "“One of the biggest signals showing the lack of participation is the drop in volatility and liquidity in the market,” the report stated. “On October 22, the annualized 30-day volatility of BTC dropped to 26.6% – the lowest figure since July 2020, reflecting the risk averse sentiment in the market.”"
    },
    {
        "id": 46,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vd3d3LmxlYXJubGliZXJ0eS5vcmcvYmxvZy9iaXRjb2luLWVudmlyb25tZW50YWwtaW1wYWN0LWNhcmJvbi1lbWlzc2lvbnMv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Don't believe the hype, Bitcoin is not anti-environment - Learn Liberty",
        "content": "Bitcoin, a highly innovative, completely decentralized peer-to-peer digital currency, has seen an exponential rise in prominence and usership since its inception in 2009. Owing to its wide variety of uses, it enjoys unique advantages over both fiat currency and commodities.\n\nHowever, in recent years, while Bitcoin has become increasingly popular, it has also gained many detractors. One of the charges leveled against Bitcoin is that it has a substantial negative environmental impact. But this charge is simply exaggerated at best, and downright false at worst.\n\nAside from relying on, let’s say controversial, data, the question of negative impact is relative to positive impact, a phenomenon that doesn’t grab as many headlines.\n\nThe many ways in which Bitcoin can be part of the future of clean energy are often overlooked, and when it comes to Bitcoin’s energy usage, the picture isn’t nearly as negative as the media makes out.\n\nMoney requires energy\n\nThere is no question Bitcoin requires a lot of energy and computing power to operate, but its detractors are entirely missing the point. Money, or pretty much anything in this world, inevitably requires energy, and a sound monetary system is eminently worth investing resources to protect.\n\nMoney, the primary means by which we store and transmit value, has a longstanding link to energy. Indeed, many items used as early forms of money existed as unforgeable physical evidence of the expenditure of time and energy required to create them.\n\nThis is similar to how commodities such as gold are used as stores of value in modern times, due to relative scarcity and the energy involved in mining. In these monetary systems, the value expended is proportionate to the value people get from using it.\n\nBitcoin follows a concept similar to this, but with one very important difference — a finite supply. As with any sound store of value, Bitcoin serves as a proof of work, but while gold is extracted from the earth, Bitcoin is a proof of digital work carried out by specialized software.\n\nThis contrasts significantly with fiat money, which is merely printed as and when governments please, without proof of work to back it up. Lacking scarcity, fiat money is subject to inflation, which acts as a stealth tax on people’s savings. At present, given the high inflation rates, it makes sense that more and more people are looking to alternatives such as Bitcoin.\n\nBitcoin mining incentivizes energy efficiency\n\nAs with traditional mining, Bitcoin mining is a costly operation. While there is certainly a reward for miners, this comes at a price. The cost of mining Bitcoin varies significantly from place to place, depending on the cost of electricity.\n\nConsequently, Bitcoin miners have a clear profit incentive to use energy efficiently and sparingly. They also have an incentive to conduct their operations in countries or regions with optimal infrastructure and cheap energy, which is often renewable energy.\n\nBitcoin’s potential for innovation in terms of optimizing energy efficiency is a factor that has been overlooked by the studies preferred by those determined to vilify Bitcoin as an enemy of the environment. In recent years, the percentage of the Bitcoin industry running on renewable energy continues to increase, standing at around 58.5 percent in late 2021.\n\nThe U.S. dollar has a far larger carbon footprint\n\nIn stark contrast to Bitcoin miners, the fiat monetary system has no such incentives to optimize efficiency. This is particularly true of the U.S. dollar, which, after having its link to gold severed by President Nixon in 1971, subsequently became heavily linked to the global oil industry.\n\nStarting with Saudi Arabia following negotiations in 1974, OPEC nations agreed to the global oil market being denominated in dollars, and to trade being conducted in dollars. This created a constant demand for the U.S. dollar. The deal also meant the United States would have to offer military aid and equipment, and become heavily invested in the Middle East in order to ensure access to cheaper oil.\n\nClose ties between the interests of the U.S. government and the global oil industry over the past number of decades has served to subsidize one of the most environmentally damaging forms of energy. The development of renewable energy may well have unfolded very differently in the absence of the U.S. dollar’s interests being so closely linked to those of the oil industry.\n\nHow much energy does Bitcoin use?\n\nOne of the primary studies making alarmist claims about the unique environmental evils of Bitcoin has been criticized for having made a number of incorrect assumptions. In particular, the inclusion of unprofitable mining rigs should cast serious doubts over the findings, as any rational miner would switch these rigs off more than 99 percent of the time.\n\nThe assumptions made by the original study would, if true, mean that Bitcoin miners were losing billions of dollars in revenue. Taking this into account, the carbon emissions of Bitcoin mining were deemed by others to have been overestimated by a factor of 4.5.\n\nCritics promote the idea that Bitcoin accounts for an unacceptably large proportion of the world’s energy consumption. However, it actually represents less than 0.1 percent of global energy usage.\n\nIt is estimated that Bitcoin currently has at least 100 million users worldwide. Yet, even if it was adopted as a payment system by over a billion people, this share of the world’s energy consumption would still not be expected to exceed one percent. A flawed reasoning put forward by critics is that the increase in Bitcoin’s energy consumption as more people begin to use it will follow a linear pattern, when this is not the case.\n\nMoreover, to put Bitcoin’s annual energy consumption into perspective, it is less than is consumed by either Christmas lights in the U.S. alone, digital advertising, or the cruise ship industry, yet it is consistently subject to unique scrutiny and misplaced condemnation.\n\nOn a fundamental level, to single out Bitcoin ahead of other more costly energy uses implies a belief that Bitcoin, hard money in cyberspace, is of a lesser value to decorative lights or cruise ships, even if Bitcoin has a far broader user base.\n\nBitcoin miners are driving innovative solutions\n\nBitcoin miners are able to relocate to any suitable location. As such, they are in an ideal position to exploit stranded energy assets. Some of the innovative ways in which Bitcoin miners operate involve, among others, feeding off waste energy and operating reserves from power plants.\n\nFor instance, in Canada, Bitcoin miners have been able to make use of otherwise wasted energy by channeling waste gas from an oil well in order to power Bitcoin mining computers.\n\nBy using this waste gas, the Bitcoin miners are actually able to reduce carbon emissions rather than add to them. Similar solutions can be made for other sources of energy, such as drawing geothermal energy from volcanoes in El Salvador.\n\nSo much of the world’s energy is waste energy, produced during hours of low demand. Issues arise in terms of transmitting energy across space and time. Much of the energy consumed by the Bitcoin network is energy that would not otherwise be available for consumption elsewhere. Instead, it would simply go to waste. Bitcoin is providing huge opportunities to harness energy that would otherwise be wasted or stranded.\n\nEven for those uninterested in owning any Bitcoin, one of the strongest arguments in favor of embracing Bitcoin’s innovative potential is how it strengthens the power grid. Beyond its credentials as a store of value, Bitcoin can also play a role in mitigating the impact on power infrastructure during crises such as natural disasters.\n\nIndeed, Bitcoin mining operations contribute to creating a more resilient power grid as they can be used as excess power reserves. This means that, if needed, they can contribute additional power to the grid even when power generation capacity is compromised.\n\nOverall, accusations that Bitcoin is destroying the environment appear completely baseless when taking a proportionate look at its energy consumption, especially relative to the value and revolutionary potential it presents. Moreover, market incentives for miners to use energy sparingly coupled with the innovative ways to make use of wasted energy while strengthening the power grid only further add to Bitcoin’s green credentials.\n\nFor more content on Bitcoin and the environment, be sure to check out our video below.\n\nIf you are interested in Bitcoin, decentralization, and innovations in technology more broadly, be sure to check out our annual LibertyCon Europe. This year’s edition will be held in Lisbon, Portugal, on April 22-23, 2023. LibertyCon Europe will bring together an impressive lineup of speakers who are subject matter experts in a wide variety of fields.\n\nTickets are selling fast and will be limited when the venue reaches capacity. If you’d like to attend LibertyCon Europe 2023, be sure to click on the button below to register, using the discount code: 50%DISCOUNT\n\nWe hope to see you in Lisbon!\n\nThis article was first published in January 2022 on the Students For Liberty website.\n\nThis piece solely expresses the opinion of the author and not necessarily the organization as a whole. Students For Liberty is committed to facilitating a broad dialogue for liberty, representing a variety of opinions."
    },
    {
        "id": 47,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vbmV3cy5ibG9vbWJlcmdsYXcuY29tL2xpdGlnYXRpb24vY2xlYW5zcGFyay1pbnZlc3Rvci1zdWl0LW92ZXItYml0Y29pbi1taW5pbmctcGl2b3QtY2xlYXJzLWh1cmRsZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "CleanSpark Investor Suit Over Bitcoin Mining Pivot Clears Hurdle - Bloomberg Law",
        "content": "A proposed class action on behalf of CleanSpark Inc. shareholders related to the company’s shift from alternative energy to Bitcoin mining adequately pleads securities fraud, a federal court in New York ruled Thursday.\n\nTwo statements by CEO Zachary Bradford and one by board president S. Matthew Schultz—before and after CleanSpark’s acquisition of mining company ATL Data Centers Inc.—are actionable, Judge Loretta A. Preska said for the US District Court for the Southern District of New York. And the investors, relying in part on an unidentified former ATL employee, plausibly alleged omissions of material facts, along with the state of mind ..."
    },
    {
        "id": 48,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDEvMDUvdGhlLWZvb2xzLWdhbWUtb2YtYW5udWFsLWNyeXB0by1wcmljZS1wcmVkaWN0aW9ucy_SAWJodHRwczovL3d3dy5jb2luZGVzay5jb20vbWFya2V0cy8yMDIzLzAxLzA1L3RoZS1mb29scy1nYW1lLW9mLWFubnVhbC1jcnlwdG8tcHJpY2UtcHJlZGljdGlvbnMvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "The Fool's Game of Annual Crypto Price Predictions - CoinDesk",
        "content": "My go-to answer about the markets and asset prices is that they will fluctuate. Not only does this reflect how I feel about the volatility of risk assets like stocks and cryptocurrency, but it gives a reasonable prediction for what will happen over the next 12 months. Will prices end up higher or lower? I don’t think anyone is able to guess that accurately."
    },
    {
        "id": 51,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3LmNuYmN0djE4LmNvbS9jcnlwdG9jdXJyZW5jeS90b3VnaC10aW1lcy1jb250aW51ZS1mb3ItYml0Y29pbi1taW5lcnMtd2hhdC1kb2VzLTIwMjMtaG9sZC0xNTU5NDgxMS5odG3SAXRodHRwczovL3d3dy5jbmJjdHYxOC5jb20vY3J5cHRvY3VycmVuY3kvdG91Z2gtdGltZXMtY29udGludWUtZm9yLWJpdGNvaW4tbWluZXJzLXdoYXQtZG9lcy0yMDIzLWhvbGQtMTU1OTQ4MTEuaHRtL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "Tough times continue for Bitcoin miners, what does 2023 hold? - CNBCTV18",
        "content": "Back in 2021, Bitcoin mining was a highly lucrative business. This is because BTC was trading well above the $30,000 mark, even reaching an all-time high of $67,000. However, things have only gone south since then.\n\nThe crypto winter, amplified by several disastrous events, has caused token prices to plummet. For instance, Bitcoin, the world’s oldest cryptocurrency, is down nearly 75 percent from its all-time high. This has had an immediate impact on Bitcoin mining firms.\n\nTowards the end of December 2022, Bitcoin mining profitability had declined 70 percent and mining stocks registered 80 to 90 percent drops. As such, several of the top Bitcoin mining firms are now staring at massive losses.\n\nFor instance, on December 20, one of the largest Bitcoin mining firms, Core Scientific, filed for Chapter 11 bankruptcy. This is after the company’s stock dropped 98 percent in 2022. The firm’s market capitalisation is also in free fall, dropping from a $4.3 billion valuation in July 2021 to a mere $42 million at the time of writing.\n\nAnother prominent miner, Riot Blockchain, saw its stock tumble 85 percent in 2022. Recently, the firm even rebranded itself as Riot Platforms; a move to diversify its operations amid a bleak outlook for the wider Bitcoin mining industry. Core and Riot are not alone; popular miners such as Bitfarms, Iris Energy, and CleanSpark also traded 91 percent, 92 percent and 79 percent lower in 2022, respectively.\n\nFaced with these difficulties, several mining firms have been forced to turn off their mining rigs and cut down on overheads. This was evident from the Bitcoin mining difficulty, which dropped 3.59 percent on Tuesday morning. This indicates that there are fewer miners on the network.\n\nTo make matters worse, the Arctic bomb cyclone towards the end of December forced several Bitcoin mining firms in the US to temporarily shut down operations. This was done to return power to the grid so that people could continue to heat their homes amid the sub-zero temperatures. This resulted in a 40 percent drop in hash rate during the last week of December.\n\nWhat does 2023 hold?\n\nMany experts believe that firms will look to sell their mined BTC and strengthen their balance sheets. Until now, most mining companies would hold onto their mined BTC and depend on capital from the debt or equity markets to cover operational expenses. However, with the current market scenario, it is getting extremely difficult to follow this way of working.\n\nFurther, Bitcoin analysts Jaran Mellerud and Colin Harper believe that publicly traded Bitcoin miners will either go private, merge with private firms or be acquired. One good example of this is Bitcoin miner Argo, which avoided bankruptcy by allowing Galaxy Digital to acquire its Helios facility for $65 million.\n\nSome experts expect more bankruptcies in 2023, especially if the crypto markets do not improve in the coming months. \"If these market conditions persist through the middle of next year, there will likely be significant attrition in the number of miners that remain viable,\" the CEO of Marathon Digital, Fred Thiel told Blockworks.\n\nHowever, it’s not all doom, gloom and despair for Bitcoin miners. Experts believe that healthy mining companies, especially those that are prepared for the volatility and have strong balance sheets, could do well in 2023. These firms can buy up equipment from struggling/bankrupt firms at much cheaper prices. They can then expand their operations and eat into the hashrate of these bankrupt firms.\n\nFor instance, Riot is seeking out buying opportunities as other mining firms go bust. Riot’s CEO Jason Les even said that firm is one of the \"best-positioned acquirers\" and is all set to expand its hashrate capacity from 5.6 exahashes per second (EH/s) to 12.5 EH/s by the Q1 of 2023.\n\nAnother firm that’s looking to grow in 2023 is Marathon Digital. According to its CEO, Fred Thiel, the firm is not actively focusing on acquisitions. Rather, it is looking to build on its current capabilities and increase its hashrate from 7 EH/s to 23 EH/s by mid-2023. However, Thiel did reserve the option of acquisitions, should a good opportunity come alone. “That being said, we’re keeping an eye on the market and how things develop to determine if there might be something of value to Marathon and our shareholders,” Thiel told Blockworks.\n\nAdditionally, some firms may look to diversify their operations. For instance, in Nov 2022, Applied Blockchain, one of the world's biggest hosting companies, renamed itself Applied Digital. This rebranding signalled the firm's interest in other operations besides BTC mining. This is a move that Riot could also be considering, especially with its rebranding announcement yesterday.\n\nIn an earnings call before its rebranding, CEO of Applied Digital, Wes Cummins, said that the firm’s hardware was being programmed for use \"relating to image processing, graphics rendering, artificial intelligence and machine learning.\"\n\nAnother prominent Bitcoin miner, Hut 8, openly announced their pivot to high-performance computing (HPC) operations to survive the never-ending winter. The firm’s CEO said that the transition would include \"potentially leveraging our GPU machines to provide AI, machine learning, or VFX rendering services to customers and mining the next most profitable proof-of-work digital asset during idle time.\"\n\nConclusion\n\nThe never-ending crypto winter looks poised to continue well into 2023. This spells terrible news for the cryptoverse, which is already reeling from 2022 losses. However, the tough times are not expected to affect all miners in the same way. Experts believe that the overleveraged firms will be weeded out, and the well-prepared ones will grow, while the flexible miners will adapt to survive."
    },
    {
        "id": 53,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaW5hbmNlLWlzLXRoZS1jcnlwdG8tbWFya2V0LWFyY2FuZS1jcm93bnMtdGhlLWV4Y2hhbmdlLTIwMjItcy13aW5uZXLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "'Binance is the crypto market:' Arcane crowns the exchange 2022's winner - Cointelegraph",
        "content": "During a year plagued by crises such as the collapse of FTX and Celsius, data shows that crypto exchange Binance has emerged as the clear “winner” of 2022 according to Arcane Research.\n\nA Jan. 3 report from Arcane highlighted that Binance saw its market dominance soar throughout 2022. As of Dec. 28 last year, it had captured 92% of the Bitcoin (BTC) spot market and 61% of the BTC derivatives market by volume:\n\n“There are no other evident ‘winners’ of 2022 other than Binance when it comes to the crypto market structure and market dominance. No matter how you look at it in terms of trading activity, Binance is the crypto market.”\n\nBinance’s BTC spot market dominance was 45% at the start of 2022 meaning that it more than doubled, while its share of the BTC derivatives market increased by almost one third.\n\nReal BTC daily volume vs Binance spot volume vs Binance market share. Source: Arcane Research.\n\nThe “spot trading volume” is an indicator that measures the total amount of Bitcoin being transacted on spot exchanges on any given day.\n\nThe report suggests the increase in Binance’s BTC spot market dominance predated the fallout of the second largest exchange by volume FTX, and began to surge after it removed fees for certain trading pairs on Jul. 7, 2022.\n\nThe exchange also made some notable acquisitions to boost its global coverage in 2022 such as the Japanese trading platform Sakura Exchange BitCoin and Indonesian digital currency brokerage firm Tokocrypto.\n\nBinance has been one of the few exchanges to increase the number of staff it employs over the year while its peers such as Kraken and Coinbase have been forced to lay off staff during the current crypto winter.\n\nRelated: Tribulations and triumphs: The biggest surprises in crypto of 2022\n\nLooking ahead to 2023, Arcane predicted in a Dec. 30 report that Binance would implement trading fees again in 2023 which would lead to a “normalization of the market dominance.”\n\nAs noted in a Jan. 3 report from digital asset data firm CryptoCompare, removing fees allows exchanges to attract customers but they “must be wary to remain profitable” and “cannot employ this strategy for long periods of time without hurting their bottom line.”\n\nBinance could also be subject to increased regulatory scrutiny in 2023 — particularly relating to its native token BNB (BNB) — as following the fallout of the FTX empire, there has been an increased focus on crypto regulations globally.\n\nAnalysis from Bitcoin advocate Nic Carter suggested while Binance’s CEO, Changpeng Zhao, has been vocal about his support for exchanges providing proof-of-reserves (PoR), the PoR provided by Binance was incomplete as “it only covers Bitcoin, which only represents 16.5% of their client assets.”"
    },
    {
        "id": 54,
        "url": "https://news.google.com/rss/articles/CBMiLmh0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vYnV5LWJpdGNvaW4td2l0aC1waXjSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Buy Bitcoin (BTC) with PIX - OKX",
        "content": "Buying Bitcoin with PIX, Brazil's new instant payment system can be done through OKX P2P Trading, a peer-to-peer (P2P) exchange platform that allows users to buy and sell cryptocurrencies with local currency.\n\nPIX is a Brazilian payments app developed by the Central Bank of Brazil. It was launched in November 2020 as part of the Central Bank's efforts to modernize the country's payment systems and increase financial inclusion. PIX allows users to make instant payments 24/7 using a QR code or a unique identifier such as a phone number or email address. PIX is designed to be fast, secure, and convenient, and it can be used to make payments for goods and services, transfer money to other individuals, and pay bills.\n\nPIX is expected to revolutionize how people make payments in Brazil and significantly impact the country's financial sector. By providing a fast and convenient way to make payments, PIX has the potential to drive the adoption of digital payments and help to increase financial inclusion in the country.\n\nOKX P2P Trading makes it easy to buy cryptocurrencies and keeps users safe. The OKX Crypto Converter Calculator also lets users see real-time exchange rates for converting fiat to Bitcoin and vice versa before they make a purchase.\n\nBegin purchasing Bitcoin and other well-known cryptocurrencies like Ethereum (ETH) , Tether (USDT) , and TrueUSD (TUSD ) using PIX on OKX now.\n\nHow to buy Bitcoin with Mercado Pago\n\nPurchasing Bitcoin with PIX on the OKX P2P Trading is an easy process that can be completed in minutes. To learn how, follow these four simple steps:\n\nCreate an OKX account:\n\nVisit the OKX website and click the Sign Up button.\n\nEnter either your email address or phone number to get started.\n\nEnter the 6-digit code sent to your selected option. Note : Your verification code will expire in 30 minutes.\n\nCreate a valid password to complete account registration.\n\nVerify your OKX account:\n\nHover over the profile icon on the header menu and select \"Verification.\"\n\nEnter the relevant fields, including your nationality, legal first, middle, and last name, ID type, and ID document number, to complete the Level 1 identity verification.\n\nTake a photo of the front and back of your ID document and a selfie to complete the Level 2 identity verification. Important: All users must verify their identity before buying Bitcoin and other popular digital assets. There are two levels of verification, and users must pass the Level 2 identity verification to buy and sell crypto on the OKX platform.\n\nFind the best offer\n\nNavigate to the P2P trading marketplace and ensure the Buy function is selected.\n\nSelect bank transfer, BTC, and the preferred fiat type to generate all listed offers. Note : You may filter the results further by adding your preferred fiat amount.\n\nSelect the offer you prefer to initiate the trade.\n\nMake payment\n\nIn the pop-up window, enter the amount of Bitcoin you wish to purchase with your preferred fiat and ensure that “Bank transfer” is selected under the “payment method” field.\n\nClick Buy BTC to confirm your purchase. Note: Your purchased BTC tokens will be deposited into your Funding Account once the seller confirms that payment has been received.\n\nWhy buy Bitcoin on OKX?\n\nMulti-layered security\n\nOKX uses multi-layered security to keep your money and information safe from cybercriminals. Semi-offline storage, a multi-signature system, emergency backups, 2FA, anti-phishing codes, withdrawal passwords, and more are all part of our security stack.\n\nWorld-class security\n\nAt OKX, the safety of your funds is of utmost importance. Besides establishing sophisticated security systems for our internal wallets, we also provide traders with tools and features that are among the best in the business.\n\nRound-the-clock support\n\nThe OKX support center answers all frequently asked questions. Alternatively, you can use the chatbot to contact our dedicated live agents for assistance.\n\nFAQs\n\n1. What is OKX P2P Marketplace, and how does it work?\n\nOKX P2P Marketplace is a platform that allows users to buy and sell Bitcoin and other cryptocurrencies using various payment methods, including PIX. It operates on a peer-to-peer (P2P) basis, meaning buyers and sellers can directly trade without the need for a central authority.\n\n2. What is PIX, and how is it different from other payment methods?\n\nPIX is a real-time interbank payment system developed by the Brazilian Central Bank that allows instant and secure financial transactions between individuals and businesses. It is a relatively new payment method in Brazil, but it has already gained significant adoption and is expected to become the primary payment system in the country. One of the main benefits of PIX is that it allows for faster and cheaper transactions compared to traditional methods such as bank transfers.\n\n3. Can I buy Bitcoin (BTC) anonymously with PIX on OKX P2P Marketplace?\n\nWhile it is possible to buy Bitcoin (BTC) anonymously on some platforms, OKX P2P Marketplace requires users to undergo identity verification and link their PIX accounts to buy BTC with PIX. This is to comply with anti-money laundering (AML) and know-your-customer (KYC) regulations and to protect against fraud. However, once you have completed the verification process, you can buy BTC with PIX on OKX P2P Marketplace without revealing your personal information to the seller.\n\n4. Is there a fee for buying Bitcoin with PIX on OKX?\n\nWhile OKX P2P Trading does not charge a fee for the purchase of Bitcoin, there may be fees associated with using PIX to complete the transaction on OKX. These could include fees charged by PIX for processing the payment. Therefore, it is essential to carefully review all fees before completing a transaction to ensure you are aware of the total cost.\n\n5. Is it safe to buy Bitcoin with PIX on OKX P2P Marketplace?\n\nOKX P2P Trading takes security seriously and employs several measures to protect its users, including KYC verification, secure authentication, encryption of sensitive data, and regular security audits to identify and address potential vulnerabilities. It is recommended to only trade with users with a good reputation on the platform and to carefully review the terms of a trade before agreeing to it. While OKX takes steps to ensure the safety and security of its users, as with any online transaction, there are always risks involved. To protect yourself, only trade with reputable sellers and always use a secure payment method, such as PIX."
    },
    {
        "id": 55,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vYW1iY3J5cHRvLmNvbS9iaXRjb2luLXBubC1pbmRleC1hbmQtbnVwbC1tZXRyaWMtc3VnZ2VzdC10aGF0LWJ0Yy1ib3R0b20taXMv0gFXaHR0cHM6Ly9hbWJjcnlwdG8uY29tL2JpdGNvaW4tcG5sLWluZGV4LWFuZC1udXBsLW1ldHJpYy1zdWdnZXN0LXRoYXQtYnRjLWJvdHRvbS1pcy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "Bitcoin: PnL index and NUPL metric suggest that BTC bottom is… - AMBCrypto News",
        "content": "The PnL and NUPL metrics position suggested a possible further decline for Bitcoin in 2023.\n\nInvestors taking long positions on BTC were currently dominant.\n\nSeveral forecasts have been made about ‘when the bear market would end,’ and in most cases, this coincided with a rally in Bitcoin’s [BTC] price. A glance at several important measures can help point one in the correct way when trying to make sense of the rumors and theories surrounding the king coin and its future move.\n\nRead Bitcoin’s [BTC] Price Prediction 2023-24\n\nPnL Index suggests bottom is not in\n\nWhen discussing the behavior of prices, the term “bottom” refers to the point at which prices have dropped to their lowest before beginning to move upwards again.\n\nThere have been a lot of rumors and guesses about where the bottom of Bitcoin will be, and a recent post from CryptoQuant stated that king coin’s bottom is yet to be reached.\n\nAccording to the chart of the Profit and Loss Index (PnL), Bitcoin began the year in the undervalued zone; nevertheless, it could not cross above its 365-moving average. The placement of the metrics suggested that the price of Bitcoin may continue to decline even more.\n\nPositive NUPL but capitulation in play\n\nNet Unrealized Profit or Loss (NUPL) is another significant indicator that might be used to access Bitcoin’s (BTC) genuine condition. It is calculated by dividing the difference between the respective unrealized gains and losses.\n\nA negative value indicates a losing market, whereas a positive one indicates a profitable one. Whether the market is profitable can be determined by looking at the NUPL on-chain indicator.\n\nExamining Glassnode’s NUPL metric revealed that the currency was below zero, signaling a loss in holdings.\n\nLong-position investors stay dominant\n\nEven though the PnL and NUPL charts presented what appeared to be a gloomy view, investors continue to be optimistic about a price increase for BTC.\n\nThe Funding rate chart on CryptoQuant indicated that the measure was positive. Given the position of the metrics, it was clear that investors were banking on a sustained increase in the price of Bitcoin over the long run by establishing a long position.\n\nAre your holdings flashing green? Check the BTC Profit Calculator\n\nWhen it comes to BTC, it would appear from a glance at the PnL and NUPL measures that the market is yet to reach its bottom. As of this writing, the price of the coin was hovering at about $16,000; it could not stage a recovery that would allow it to return to the region around $20,000, where it had been in prior months before its decline.\n\nNevertheless, investors appear to be optimistic about a price rise in the future, which is always the case once the bottoms have been established in a market."
    },
    {
        "id": 56,
        "url": "https://news.google.com/rss/articles/CBMiN2h0dHBzOi8vd3d3Lm9reC5jb20vbGVhcm4vYnV5LWJpdGNvaW4td2l0aC1tZXJjYWRvLXBhZ2_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Buy Bitcoin (BTC) with Mercado Pago - OKX",
        "content": "Bitcoin is a decentralized digital currency that allows for peer-to-peer transactions without a central authority. It has recently gained popularity as a potential alternative to traditional fiat currencies, with some people even using it as a long-term investment. If you are interested in buying Bitcoin, one option is to use Mercado Pago, a payment platform based in Latin America.\n\nMercado Pago is a payment platform founded in 2004 by Mercado Libre, a leading e-commerce company in Latin America. It is available in over 18 countries, including Argentina, Brazil, Chile, Colombia, Mexico, and Uruguay. In addition to facilitating online payments, Mercado Pago also offers various financial services, including credit and debit card processing, bank transfers, and mobile banking.\n\nOKX P2P trading simplifies the process of buying cryptocurrencies and ensures safety for users. One significant benefit of P2P platforms is that they allow users to buy and sell cryptocurrency directly with each other without needing a third-party intermediary. This can reduce fees and increase the speed of transactions.\n\nP2P platforms may also offer a broader range of payment methods than traditional exchanges, which can be convenient for users who do not have access to traditional payment methods or prefer alternative methods such as Mercado Pago.\n\nAdditionally, with the OKX Crypto Converter Calculator, users can easily view real-time exchange rates for converting fiat to Bitcoin and vice versa before placing an order. Start buying Bitcoin and other popular cryptocurrencies like Ethereum (ETH), Tether (USDT), and TrueUSD (TUSD) with Mercado Pago on OKX today.\n\nHow to buy Bitcoin with Mercado Pago\n\nIf you want to purchase Bitcoin using Mercado Pago on OKX P2P Trading, it's a straightforward process that can be completed in just a few steps.Here's how to do it:\n\nCreate an OKX account:\n\nVisit the OKX website and click the Sign Up button.\n\nEnter either your email address or phone number to get started.\n\nEnter the 6-digit code sent to your selected option. Note : Your verification code will expire in 30 minutes.\n\nCreate a valid password to complete account registration.\n\n2. Verify your OKX account:\n\nHover over the profile icon on the header menu and select \"Verification.\"\n\nEnter the relevant fields, including your nationality, legal first, middle, and last name, ID type, and ID document number, to complete the Level 1 identity verification.\n\nTake a photo of the front and back of your ID document and a selfie to complete the Level 2 identity verification. Important: All users must verify their identity before buying Bitcoin and other popular digital assets. There are two levels of verification, and users must pass the Level 2 identity verification to buy and sell crypto on the OKX platform.\n\n3. Find the best offer\n\nNavigate to the P2P trading marketplace and ensure the Buy function is selected.\n\nSelect Mercado Pago, BTC, and the preferred fiat type to generate all listed offers. Note : You may filter the results further by adding your preferred fiat amount.\n\nSelect the offer you prefer to initiate the trade.\n\n4. Make payment\n\nIn the pop-up window, enter the amount of Bitcoin you wish to purchase with your preferred fiat and ensure that “Mercado Pago” is selected under the “payment method” field.\n\nClick Buy BTC to confirm your purchase. Note: Your purchased BTC tokens will be deposited into your Funding Account once the seller confirms that payment has been received.\n\nWhy buy Bitcoin on OKX?\n\nMulti-layered security\n\nOKX uses multi-layered security to keep your money and information safe from cybercriminals. Semi-offline storage, a multi-signature system, emergency backups, 2FA, anti-phishing codes, withdrawal passwords, and more are all part of our security stack.\n\nWorld-class security\n\nAt OKX, the safety of your funds is of utmost importance. Besides establishing sophisticated security systems for our internal wallets, we also provide traders with tools and features that are among the best in the business.\n\nRound-the-clock support\n\nThe OKX support center answers all frequently asked questions. Alternatively, you can use the chatbot to contact our dedicated live agents for assistance.\n\nFAQs\n\n1. Is it safe to buy Bitcoin with Mercado Pago on OKX?\n\nYes, it is generally safe to buy Bitcoin with Mercado Pago on OKX as long as you follow basic security precautions. For example, make sure to use a strong and unique password for your OKX account and enable two-factor authentication to help protect your account from unauthorized access. Additionally, be sure only to buy Bitcoin from trusted sellers and only send payment through secure payment methods, such as Mercado Pago. OKX P2P Trading takes security seriously and has implemented various measures to protect its users from fraud and scams. However, as with any online transaction, it is essential to be cautious and to only trade with reputable sellers. It is also a good idea to enable two-factor authentication for an added layer of security.\n\n2. Are any fees associated with buying Bitcoin with Mercado Pago on OKX?\n\nWhile OKX P2P Trading does not charge a fee for buying Bitcoin, there may be fees associated with purchasing Bitcoin with Mercado Pago on OKX. These fees may include Mercado Pago fees for processing the payment. Therefore, it is essential to carefully review the fees associated with any transaction before proceeding to ensure you know the total cost.\n\n3. Do I need to be an expert trader to start trading Bitcoin?\n\nOKX provides a beginner-friendly trading interface with well-labeled sections enabling beginner traders to buy and sell Bitcoin and other cryptocurrencies easily. Our demo trading feature offers a simulated trading environment for users to practice their trading strategies before conducting actual trades. Additionally, with OKX Learn, you can pick up basic trading strategies and how to leverage our platform to trade more effectively for free. You may also participate in our demo trading program to get a feel for the markets and test your skills before using real funds.\n\n4. How can I stake BTC that I purchased?\n\nUsers can visit the Earn section of our platform to discover various opportunities to put their BTC to work and make gains through staking.\n\n5. How long does it take to buy Bitcoin with Mercado Pago on OKX P2P Trading?\n\nThe time it takes to buy Bitcoin with Mercado Pago on OKX P2P Trading will depend on a few factors, including the availability of sellers willing to accept Mercado Pago as a payment method and the speed of the payment processing through Mercado Pago. However, the process should generally be relatively quick, with the Bitcoin being released to your OKX P2P Trading account as soon as the payment is confirmed."
    },
    {
        "id": 57,
        "url": "https://news.google.com/rss/articles/CBMiTGh0dHBzOi8vZmluYW5jZWZlZWRzLmNvbS9ob3ctdGhlLWhvbGlkYXktc2Vhc29uLWNvdWxkLWltcGFjdC1iaXRjb2luLXByaWNlcy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "How the Holiday Season Could Impact Bitcoin Prices - FinanceFeeds",
        "content": "How the Holiday Season Could Impact Bitcoin Prices\n\nCryptocurrencies, the most prominent of which is Bitcoin, have been gaining popularity in recent years and are becoming more widely accepted by merchants worldwide. As the holiday season approaches, it is important to consider how this could potentially impact the prices of Bitcoin. So let’s.\n\nAre there any seasonal patterns in Bitcoin price movements around holidays?\n\nIndeed, there are seasonal patterns in Bitcoin price movements around holidays. Generally speaking, the current bitcoin price tends to increase during holiday periods due to increased demand from investors and traders. This is especially true for major holidays such as Christmas and New Year’s Day when people have more time off work and can dedicate more time to trading.\n\nSome countries may also experience a surge in demand for Bitcoin during their own national holidays, such as Chinese New Year or India’s Diwali festival. During these times, the prices of Bitcoin tend to rise due to increased demand from local investors and traders.\n\nAnalyzing historical Bitcoin price movements during the holidays\n\nTo analyze historical Bitcoin price movements during holidays, it is important to look at the data from different angles. For the initial step, you should consider the overall trend of Bitcoin prices during holiday periods. This will give you an idea of how prices tend to move around these times and whether there are any patterns that emerge.\n\nAfter that, you should look at specific events that may have occurred during holiday periods and how they impacted the price of Bitcoin. And always consider macroeconomic factors such as interest rates and inflation when analyzing historical Bitcoin price movements during holidays.\n\nAre there any differences in the effects of national and religious holidays on Bitcoin prices?\n\nYes, of course, there are differences in the effects of national and religious holidays on Bitcoin prices. National holidays tend to have a more significant impact on Bitcoin prices than religious holidays. National holidays often involve large-scale events such as government announcements or economic data releases that can affect the market sentiment and thus influence Bitcoin prices.\n\nOn the other hand, religious holidays usually do not have any major economic implications and therefore their effect on Bitcoin prices tends to be less pronounced. Some countries may observe different religious holidays more than others, which could lead to varying levels of impact on Bitcoin prices depending on where they are being traded.\n\nIn conclusion, the holiday season could have a significant impact on bitcoin prices, as more people are likely to invest in cryptocurrency during this time of year."
    },
    {
        "id": 58,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vbXVnZ2xlaGVhZC5jb20vbWFyYXRob24tZGlnaXRhbC1ob2xkaW5ncy1taW5lcy0xNTYzLWJpdGNvaW4taW4tZmluYWwtcXVhcnRlci1vZi0yMDIyL9IBY2h0dHBzOi8vbXVnZ2xlaGVhZC5jb20vbWFyYXRob24tZGlnaXRhbC1ob2xkaW5ncy1taW5lcy0xNTYzLWJpdGNvaW4taW4tZmluYWwtcXVhcnRlci1vZi0yMDIyLz9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "Marathon Digital Holdings mines 1,563 Bitcoin in final quarter of 2022 - Mugglehead",
        "content": "Marathon Digital Holdings (NASDAQ: MARA) published its unaudited bitcoin production and miner installation updates for December 2022 today.\n\nThe company mined 1,563 bitcoin in Q4. Also, it increased its hash rate without sacrificing its progress in terms of transitioning to more sustainable power sources. Now the company operates with a hash rate of 7.0 exahashes per second year over year, and the majority of it comes from the King Mountain wind farm in West Texas.\n\n“As we enter 2023, we remain confident in our ability to scale Marathon into one of the largest and most energy efficient Bitcoin mining operations globally. We have thousands of miners ready to be energized over the coming months, which we expect to more than triple our current production capacity to approximately 23 exahashes by mid-year,” said Fred Thiel, Marathon’s chairman and CEO.\n\nThe company expanded its agreement with Applied Digital in December to use roughly 12,000 S19 XPs at their Jamestown facility in North Dakota. The S19XPs are a more energy efficient type of bitcoin miner. The site is already built and working and the expectation is that miners will come online within the next month. Miner installations are underway at Garden City, and the company presently has 2.1 exahash prepared.\n\nRead more: Galaxy Digital Holdings inks agreement with Argo Blockchain for Texas mining facility\n\nRead more: Infinite Reality and Newbury Street Acquisition combination forms metaverse centred media company\n\nMarathon improves liquidity while engaging cooling tech\n\nMarathon also started taking proactive measures to improve its liquidity situation and enhance fleet performance. It paid its outstanding balances under its revolving credit agreement, which freed up 4,200 bitcoin it had been using as collateral. This boosted its total unrestricted BTC holdings to 7,815 BTC (or approximately USD$129.3 million) as of December 31. Additionally, the company turned the new year over with a $103.7 million cash position.\n\nMarathon Digital Holdings also produced 475 bitcoin in December 2022 with 1,562 BTC topping out Q4. The Bitcoin mining stats for the fiscal year top out with 4,144 BTC, which is 30 per cent more than the 3,197 BTC produced in 2021. This brings Marathon’s total bitcoin holdings to 12,232 BTC as of December, 2022.\n\n“During December, we tested overclocking and underclocking servers and began researching dual-phase immersion cooling systems. We also continued working with the new operator of the King Mountain site on improving operations and the curtailment strategy to optimize production,” said Thiel.\n\nThese changes will help Marathon develop significant advantages over its competition.\n\nThe company initiated a pilot project using immersion-cooling to keep its ASIC rigs cool and reduce costs. It involves sinking Bitcoin mining servers into a dielectric fluid to reduce the amount of heat the ASIC rigs generate, and potentially improve operational efficiency.\n\nThe team successfully bumped the hash rate of an S19 J Pro ASIC rig by 20 per cent while reducing the amount of power used per terahash by approximately 4 per cent. Additionally, the company boosted its hash rate of an S19 XP by 20 per cent by increasing the number of joules per terahash from 21.5 to 23.7 joules per terahash.\n\nFollow Mugglehead on Twitter\n\nLike Mugglehead on Facebook\n\nFollow Joseph Morton on Twitter\n\njoseph@mugglehead.com"
    },
    {
        "id": 59,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vd3d3LmphcGFudGltZXMuY28uanAvbmV3cy8yMDIzLzAxLzA0L2J1c2luZXNzL3RlY2gvamFwYW4tY3J5cHRvLTIwMjItcmV2aWV3LXJlZ3VsYXRpb24tZnV0dXJlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Both hurt and saved by regulations, what is next for crypto in Japan? - The Japan Times",
        "content": "The recent collapse of FTX, one of the world's major cryptocurrency exchanges, has prompted policymakers across the globe to examine stricter regulations for the industry. In Japan, the episode has sparked a sense of deja vu.\n\nIn January 2018, a massive hack of Tokyo-based crypto exchange Coincheck saw the theft of about ¥58 billion ($446 million at current exchange rates) worth of digital tokens, sparking calls for stringent regulations and prodding the country’s financial watchdog to initiate a sweeping crackdown on domestic exchanges.\n\nPrior to the Coincheck incident, Japan had been seen as a leading nation in the crypto world, as the country set related regulations ahead of other major nations and enjoyed huge exchange volumes for bitcoin. But the tightened rules cast a pall over the sector, with a slew of the exchanges struggling to keep up with the regulatory standards."
    },
    {
        "id": 60,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vd2F0Y2hlci5ndXJ1L25ld3Mvd2lsbC10aGlzLWdhcC1wdWxsLWJpdGNvaW4tZG93bi10by05LTZrLWluLTIwMjPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Will This 'Gap' Pull Bitcoin Down To $9.6k In 2023? - Watcher Guru",
        "content": "The past month has been quite monotonous for Bitcoin. The largest crypto asset has mostly remained sandwiched in the narrow $1000 range between $16.3k-$17.3k in the said period.\n\nHowever, traders have gradually started stepping back into Bitcoin’s arena. A recent report from Arcane Research pointed out that the CME open interest climbed towards the end of last year. As shown below, CME’s OI surged above 80,000 BTC in December 2022. Yet, it has not left behind any directional cues. Pointing out why, the report noted,\n\n“… the growth has been accompanied by a flat futures basis. Thus, it is challenging to infer any directional information related to the recent increase in active institutional participation.“\n\nCME Gap Dictates Bitcoin’s Movement\n\nThe CME gap is quite an interesting trading notion. Technically speaking, it is the difference in the futures contracts’ trading price of the new week’s open when compared to the previous week’s close.\n\nThe CME market, on its part, is not open all the time—24/7*365—like the spot crypto market. It follows the usual exchange working hours and also closes on holidays. As a result, the formation of gaps on its chart is not very uncommon.\n\nOn December 31, 2022, Bitcoin CME futures closed at $16.52k. Post the New Year break, it opened at $16.66k, and as a result, a gap was formed. On most occasions in the past, CME gaps have been bridged within a few days. Having said that, it should also be noted that there remains a few unfilled gaps from the previous decade as well.\n\nAs shown below, the latest gap was filled a few hours back by Bitcoin. Right after closing the gap, the asset reversed its course and started making upward strides. At press time, BTC was trading at $16.845k on CME.\n\nSource: TradingView\n\nWhat Next?\n\nDespite the recovery initiated, many from the space feel that the asset’s price has not yet bottomed out. At this juncture, it is interesting to note that Bitcoin has an unfilled gap of around $9.6k-$9.7k from 2020. As a result, there are high odds of the price falling down to this level to do the unfinished job of closing the gap before heading higher.\n\nSource: TradingView\n\nA recent Twitter poll conducted by analyst Benjamin Cowen pointed out that the community majorly expects the asset to bottom in the $10k-$15-k bracket. Of the 17.7k votes received until press time, more than 53% of them chose the said option. The rest remained divided. Even so, respondents were positive that the said CME gap will be filled by Bitcoin.\n\nEveryone knows that BTC is gonna fill that CME gap at 9k 🤡 — Figure it out! (@I9aVicI_7a5) January 4, 2023\n\nAnother scenario that could later pan out during the year is the asset heading to $28k and $36k to eventually fill other gaps created last year. Either of the said level could perhaps be the high for 2023.\n\nSource: TradingView\n\nTechnical and Fundamental Analyst ‘Mikybull’ is on the same page and expects something similar to materialize this year."
    },
    {
        "id": 61,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5jbmJjdHYxOC5jb20vY3J5cHRvY3VycmVuY3kvYXMtYml0Y29pbi10dXJucy0xNC1oZXJlcy1hLWxvb2stYXQtb25lLW9mLXRoZS1vbGRlc3QtZ2VuZXNpcy1kYXktdHJhZGl0aW9ucy0xNTU4NDg4MS5odG3SAYUBaHR0cHM6Ly93d3cuY25iY3R2MTguY29tL2NyeXB0b2N1cnJlbmN5L2FzLWJpdGNvaW4tdHVybnMtMTQtaGVyZXMtYS1sb29rLWF0LW9uZS1vZi10aGUtb2xkZXN0LWdlbmVzaXMtZGF5LXRyYWRpdGlvbnMtMTU1ODQ4ODEuaHRtL2FtcA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "As Bitcoin turns 14, here’s a look at one of the oldest Genesis Day traditions - CNBCTV18",
        "content": "Bitcoin, the world’s oldest and largest cryptocurrency, turned 14 yesterday. That’s right, on Jan 3, 2009, the pseudonymous creator of the Bitcoin network, Satoshi Nakamoto, mined the first block of BTC transactions.\n\nFor obvious reasons, this block was named the Genesis Block. And just like BTC miners today, Nakamoto received a reward for the computation power he dedicated towards verifying the transactions that made up the Genesis Block. At the time, this reward was 50 BTC.\n\nOver the years, Bitcoin enthusiasts have found numerous ways to celebrate the creation of the Genesis Block. For instance, the world’s largest crypto exchange, Binance, took to Twitter to pay tribute to Nakamoto for his revolutionary creation.\n\n“Bitcoin turns 14. On this day fourteen years ago, the first #Bitcoin block was mined by Satoshi Nakamoto. Thank you, Satoshi,” said Binance in a tweet that was accompanied with a screen grab of the Genesis Block, as seen on the Bitcoin Block Explorer.\n\nAnd Binance was not alone, several investors and traders also used the microblogging website to convey their birthday wishes and tip their hat to the pseudonymous creator of Bitcoin. However, some die-hard enthusiasts (see: Bitcoin Maximalists) took their celebrations a step further by following one of the oldest Genesis Day traditions - sending BTC to the genesis block.\n\nAs mentioned earlier, when Nakamoto created the Genesis Block, he received 50 BTC as a mining reward. This reward was sent to a wallet - 1A1zP1eP5QGefi2DMPTfTL5SLmv7DivfNa – and it hasn’t moved since. However, Bitcoin enthusiasts have been sending small amount of BTC to this wallet address to celebrate the creation of the Genesis Block.\n\nIn fact, the wallet address now contains 68.56 BTC, according to data from the Bitcoin Blockchain Explorer. The 18+ additional BTC in the wallet can be attributed to enthusiasts transferring small amounts of bitcoin every now and then, including on the king cryptocurrency’s birthday. This year, the highest amount sent into the wallet was 0.00210000 BTC, which is worth around $35.\n\nIn all, the BTC in the wallet is worth $1.15 million at current prices. If you rewind the clock to Nov 11, when BTC was changing hands at around $67K, the wallet’s holdings would be worth a whopping $4.5 million.\n\nAnother important point to keep in mind is that the BTC stored in this wallet address cannot be spent, at least until Satoshi Nakamoto becomes active again and somehow has the keys to this 14-year-old wallet. Until then, any funds sent to the address cannot be retrieved. Therefore, sending BTC to the Genesis Wallet is a really selfless way of celebrating Bitcoin’s birthday.\n\nFrom being valued at a few cents, to commanding a $67,000 valuation in Nov 2021, Bitcoin has come a long way since its inception. It’s a journey that is truly worth celebrating and next year, you could join the party and send over a few satoshis to the Genesis wallet as a tribute to the world’s oldest cryptocurrency."
    },
    {
        "id": 62,
        "url": "https://news.google.com/rss/articles/CBMikQFodHRwczovL3RpbWVzb2ZpbmRpYS5pbmRpYXRpbWVzLmNvbS9nYWRnZXRzLW5ld3MvbGFzdHBhc3MtZGF0YS1icmVhY2gtc29tZW9uZS1zdWVkLXBhc3N3b3JkLW1hbmFnZXItYWZ0ZXItbG9zaW5nLWJpdGNvaW4vYXJ0aWNsZXNob3cvOTY3NjkxNTUuY21z0gGVAWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2dhZGdldHMtbmV3cy9sYXN0cGFzcy1kYXRhLWJyZWFjaC1zb21lb25lLXN1ZWQtcGFzc3dvcmQtbWFuYWdlci1hZnRlci1sb3NpbmctYml0Y29pbi9hbXBfYXJ0aWNsZXNob3cvOTY3NjkxNTUuY21z?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "LastPass data breach: Someone sued password manager after losing Bitcoin - The Times of India",
        "content": "LastPass hack\n\nCERT-In warning\n\nFacing issues while downloading apps from Google Play Store? Here are 5 things you can try\n\nLastPass is taking a lot of criticism from multiple quarters after it announced that hackers, who attacked the platform in August, have a copy of consumer data, including names, email addresses, billing addresses and telephone numbers. In the latest development, someone has filed a petition for a class action against LastPass for \"its failure to exercise reasonable care in securing and safeguarding highly sensitive consumer data.\"Plaintiff “John Doe”, individually and on behalf of others similarly situated, has filed a class action lawsuit against LastPass following the data breach that was first reported in August 2022.Doe says that the data breach of password management service has resulted in the theft of around $53,000 worth of Bitcoin .The plaintiff says that he \"updated his master password to more than 12 characters using a password generator, thus complying with Defendant’s 'best practices' so that he could store the highly sensitive private keys associated with his Bitcoin purchases in his LastPass customer vault.\"Doe also claims he deleted his Private Information from his customer vault, however, on or around Thanksgiving weekend of 2022, his Bitcoin was stolen using the private keys he stored with LastPass.LastPass is used by more than 30 million users and 85,000 businesses worldwide.In December, LastPass CEO Karim Toubba said that the hackers, who compromised the company's cloud-based storage environment, stole source code and used it to target another employee of the company. From that employee, they were able to get cloud storage access keys and dual storage container decryption keys which were \"used to access and decrypt some storage volumes within the cloud-based storage service.\"As per the top executive, the threat actors have access to customers' names, end-user names, billing addresses, email addresses, telephone numbers, and the IP addresses from which customers were accessing the LastPass service.Computer Emergency Response Team (CERT-In) issued an advisory warning Indian users that cybercriminals can undertake phishing attacks to compromise their accounts. on has issued an advisory.Recently, several cybersecurity experts have criticised the company's statement. One of the experts said that the \"statement is full of omissions, half-truths and outright lies.\" Another one says that \"the claim of 'zero knowledge' [by the CEO] is a bald-faced lie.\""
    },
    {
        "id": 64,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vd3d3LnNpYXNhdC5jb20vY3J5cHRvLXdpbnRlci13aXBlcy1vdmVyLTcway1iaXRjb2luLW1pbGxpb25haXJlcy1pbi0yMDIyLTI0OTQ3MDgv0gFdaHR0cHM6Ly93d3cuc2lhc2F0LmNvbS9jcnlwdG8td2ludGVyLXdpcGVzLW92ZXItNzBrLWJpdGNvaW4tbWlsbGlvbmFpcmVzLWluLTIwMjItMjQ5NDcwOC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Crypto winter wipes over 70K Bitcoin millionaires in 2022 - The Siasat Daily",
        "content": "New Delhi: The crypto winter wiped over 70,000 Bitcoin millionaires in 2022, as the recent volatility experienced by top cryptocurrency resulted in millionaire holders suffering significant losses, a report showed on Tuesday.\n\nAccording to data by Finbold (as of January 2), the number of Bitcoin millionaire addresses stood at 28,007, representing a drop of about 71.73 per cent or 71,085 addresses from January 2 last year.\n\nAt the start of last year, the number of millionaire addresses stood at 99,092.\n\n“The rise of Bitcoin and other cryptocurrencies in recent years has created a new class of wealthy individuals, many of whom had made their fortunes by buying into the market early,” said the report.\n\nHowever, the past year has seen the market experience a sharp downturn, with the value of Bitcoin falling significantly, resulting in a devastating impact on the wealth of many holders.\n\nNotably, most Bitcoin addresses hold between $100 and $999 worth of BTC at 13.47 million as of January 2023, representing a drop of about 13.33 per cent (on-year) from 15.63 million.\n\nThe second largest group of Bitcoin holders accounts for at least $1,000 worth of BTC at 5.33 million as of January 2023, while in 2022, the figure stood at 6.54 million.\n\n“As Bitcoin’s price continues to fall, many investors have seen their holdings significantly devalue. Therefore, the drop in millionaire addresses highlights how far the crypto market has fallen from the 2021 bull run,” the report said.\n\nIt is worth noting that the declining number of Bitcoin millionaires is not solely an impact of the plunging prices.\n\n“With Bitcoin undergoing a free fall in recent weeks, the likelihood of holders liquidating their assets increased to avoid further losses. Institutions have also jumped on the liquidation bandwagon, with American business intelligence firm MicroStrategy selling over 700 Bitcoin,” the report said."
    },
    {
        "id": 65,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vd3d3LmFhLmNvbS50ci9lbi9hc2lhLXBhY2lmaWMva2F6YWtoc3Rhbi1hbW9uZy13b3JsZHMtbGVhZGluZy1jcnlwdG8tcHJvZHVjZXJzLzI3Nzk2NTHSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Kazakhstan among world's leading crypto producers - Anadolu Agency | English",
        "content": "Necessary Cookies\n\nThis cookie is used to distinguish between humans and bots. This is beneficial for the web site, in order to make valid reports on the use of their web site.\n\nFunctional Cookies\n\nRemembers the user's selected language version of a website.\n\nPerformance/Analytical Cookies\n\nRegisters a unique ID that is used to generate statistical data on how the visitor uses the website.Used by Google Analytics to throttle request rate.\n\nAccept Reject\n\nAdvertising/Marketing Cookies\n\nThis cookie is used to collect information on consumer behavior, which is sent to Alexa Analytics. (Alexa Analytics is an Amazon company.)"
    },
    {
        "id": 66,
        "url": "https://news.google.com/rss/articles/CBMiZ2h0dHBzOi8vbmFpcmFtZXRyaWNzLmNvbS8yMDIzLzAxLzA1L2V0aGVyZXVtLXN1cnBhc3Nlcy1iaXRjb2luLWluLXRyYW5zYWN0aW9uLXZvbHVtZS1mb3ItdGhlLXllYXItMjAyMi_SAW1odHRwczovL25haXJhbWV0cmljcy5jb20vMjAyMy8wMS8wNS9ldGhlcmV1bS1zdXJwYXNzZXMtYml0Y29pbi1pbi10cmFuc2FjdGlvbi12b2x1bWUtZm9yLXRoZS15ZWFyLTIwMjIvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Thu, 05 Jan 2023 08:00:00 GMT",
        "title": "Ethereum surpasses Bitcoin in transaction volume for the year 2022 - Nairametrics",
        "content": "The total transactions on the Ethereum network tore through that of Bitcoin by more than fourfold in 2022, data from DollarGeek has shown.\n\nData from Nasdaq and Ycharts have also shown that there were 338% more Ether transactions in 2022 (408.5 million) than Bitcoin transactions (93.1 million).\n\nThis notwithstanding, Bitcoin managed to retain its crown when it comes to online search interest, according to google trend searches. About 28.41 million people googled Bitcoin during the year.\n\nMore details on this: The Ethereum blockchain averaged a daily transaction count of around 1.1 million for ETH, while that of Bitcoin’s network stood at 255,000 for BTC.\n\nAlthough the Ethereum network led the charge, transaction volumes on the Bitcoin network were steadier and more periodic than on the Ethereum network, which experienced much more volatility in transaction volumes.\n\nThis was due to spikes in demand at certain times such as NFT launches and other gas fee-intensive events such as XEN minting.\n\nMore on Ether’s performance: Ether, the native token of the Ethereum network, has seen its supply drop since October 8., 2022 which marked the Ethereum network’s first deflationary move.\n\nThe deflationary move happened when the network switched from proof-of-work (PoW) to proof-of-stake (PoS) via the Merge in September 2022.\n\nAfter the update, a portion of the Ethereum network gas fee, otherwise known as the transaction fee, is permanently removed from the Ether circulation. Simply put, more ETH gets burned in a high-demand environment.\n\nWe began to see the Ethereum network’s deflationary functionality after October 8, when a new crypto project named XEN Crypto increased network traffic. At the time, XEN Crypto accounted for the burning of 4,490 ETH tokens against 16,690.52 ETH tokens on the day, which represents 26.90% of the total transactions burned.\n\nBitcoin’s unending relevance: It is believed that people’s interest in Bitcoin remains relatively high as experts assess quality compared to other crypto assets in the industry.\n\nCNBC reported that Venture capital investor, Tim Draper, explained that weaker coins will become relics amid the ongoing crypto winter, benefitting BTC. According to him, this is an indicator that the top cryptocurrency could reach $250,000 per token.\n\nEthereum’s heftier transaction volumes have continued into the new year, with the Ethereum transaction count on Jan. 2 reaching 924,614, a 300% increase compared to Bitcoin’s 229,191 on the same day, according to Bitinfocharts.\n\nThe analyst who posted the metrics explained that he was sceptical about people saying that a “flippening,” could happen someday, and further added that those advocating for it have reason to do so now.\n\nA flippening occurs when one chain surpasses a higher-ranked one for the same metric, in this case, transactions and activity.\n\nWhile there is a clear distance between Ethereum and Bitcoin’s transaction volumes, the distance could be more significant than we are reading. This is because the charts do not include layer 2 transactions, which would put Ethereum even further ahead of Bitcoin for this metric.\n\nAccording to L2beat, the number of L2 transactions per second actually surpassed those on layer 1 Ethereum in mid-October and has remained above it ever since."
    },
    {
        "id": 68,
        "url": "https://news.google.com/rss/articles/CBMioQFodHRwczovL2tlbnlhbndhbGxzdHJlZXQuY29tL2dyaWRsZXNzLWFpbXMtdG8taGVscC1hZnJpY2FzLWVuZXJneS1wcm9kdWNlcnMtdXRpbGl6ZS1leGNlc3MtZW5lcmd5LWZvci1iaXRjb2luLW1pbmluZy1ib29zdGluZy1lY29ub21pYy1ncm93dGgtYW5kLXN1c3RhaW5hYmlsaXR5L9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Gridless Aims to Help Africa's Energy Producers Utilize Excess Energy for Bitcoin Mining, Boosting Economic Growth ... - Kenyan Wallstreet",
        "content": "On the sidelines of the Africa Bitcoin Conference in Accra Ghana early December 2022, Gridless, an East African based bitcoin mining company helping to bring new energy generation to rural communities in Africa announced a $2 million seed investment round led by Stillmark and Jack Dorsey’s Block, Inc. The company said the investment will support the further expansion of bitcoin mines across African markets.\n\nWe sat down with Gridless Co-founder and CEO Erik Hersman to talk about the startup’s expansion plans in 2023, opportunities for energy producers when it comes to Bitcoin mining as well as the state of crypto regulation in Kenya.\n\nADVERTISEMENT\n\nFor context, Erik Hersman is a pioneer tech entrepreneur in Africa having cofounded leading companies such as Ushahidi, iHub; Nairobi’s tech innovation hub and BRCK, a ‘backup generator for the internet’\n\nErik Hersman’s new company, Gridless, designs, builds, and operates bitcoin mining sites alongside small-scale renewable energy producers in rural Africa where excess energy is not utilized. Gridless serves as the anchor tenant, financing the construction and managing the operation of data centers in rural communities where traditional industrial or commercial customers are not available.\n\nBitcoin mining requires high-powered computer processors in order to solve advanced mathematical equations. This process helps maintain the cryptocurrency’s digital ledger, known as the blockchain. When these math problems are solved, Bitcoin miners receive the cryptocurrency in exchange.\n\nOne of the biggest problems in Africa is that the grids are not very well connected, and often times, the grid isn’t close to communities that need energy. So you have this two part problem one is that these communities need power and the second problem is that anyone who wants to build a mini-grid in that community will need financing for that.\n\n“So they can’t find financing easily because it takes anywhere from two to five years to find financing or even once they get the financing, the ability to build it, the community uptake of electricity is somewhat slow and this can take another five to ten years to have full capacity. So if we want to accelerate the electric electrification of the African communities, Bitcoin Mining provides this amazing, industrial off taker of power” says Erik Hersman.\n\nThis essentially means that any of the energy that’s not being used by the community is used for Bitcoin mining and that gives the reason to the energy developer to build it because they know there will be income.\n\nHersman says that people build these mini grids and hope the community will come online and they do. But they come on very slowly so they don’t make enough money. And then they have to charge a very high price.\n\n“So when we come in, we take all that extra energy that nobody’s buying in the community and we buy it and then admitted it can decrease the price for that community that was around.”\n\nPowering a rural Kenya village and securing the #Bitcoin network with excess hydropower, all while lowering rates to 2000 people (500 families, ~$10/month to $4). ?? @GridlessCompute pic.twitter.com/9GUlAU6265 — jack (@jack) December 9, 2022\n\nKenya’s leading power producer KenGen in 2022 announced plans to sell excess geothermal power to bitcoin miners as it seeks to diversify its revenues while reducing risks.\n\nErik welcomes the move by KenGen to allow Bitcoin Miners to set up and use excess energy for Bitcoin mining and compares this to Texas, home to the largest Bitcoin mining sites in North America, and fast achieving status as the undisputed Bitcoin mining capital of the world.\n\n“There’s no reason why we can’t do the same thing in any country in Africa, whether it’s Kenya or Uganda or Ethiopia because all of them have excess energy. But not all of them have very good grids either” says Hersman.\n\nGridless Plans in 2023\n\nTwitter Cofounder Jack Dorsey’s company Block, Inc led Gridless $2 million seed investment and the company wants to use the capital to expand in East Africa, West Africa and Southern Africa.\n\nAs part of the company’s expansion plans in Africa, the firm is looking for stranded energy. Meaning, energy that’s going to waste already coming from renewable sources, primarily Hydro, but also solar and wind.\n\nGridless believes bitcoin mining can play a pivotal role as a buyer of first and last resort in creating more sustainable energy production and increasing electrification for local communities in the region.\n\nGreen Africa Mining Alliance\n\nAt the same time, Gridless is part of Green Africa Mining Alliance (GAMA), a community of people and organizations that want to grow Bitcoin mining in Africa and help each other. Other members of GAMA include Trojan mining from Nigeria, QRB labs from Ethiopia, Big Block data center in Congo and Sukuma Ventures from Kenya.\n\nGiven that there is little mining going in Africa, part of GAMA’s goal is get more Bitcoin mining happening on the continent. This does not only secure the bitcoin network but also ensures the reduction in centralization of Bitcoin mining in North America and Europe hence further distribution across the world and Africa.\n\nBitcoin Regulation in Kenya\n\nKenya’s Central Bank has recently softened its stance on cryptocurrency and recommended the formation of a technical committee that will create laws to regulate digital assets and businesses in the sector.\n\nSpeaking on this move amid the collapse of companies like FTX, Hersman says;\n\n“If you want to be a part of the future, you need to open up the regulation to bitcoin and maybe even crypto more generally exchanges and everything. So that it happens there because if you don’t do that, then you won’t have a piece of the future, that will go to the other countries that open things up, borders don’t matter in our world.”\n\nErik argues that Kenya needs to treat Bitcoin differently than crypto. He says Bitcoin needs to be seen as a commodity managed by the Capital Markets Authority. On the other hand, other cryptocurrencies should managed by the Central Bank.\n\nREAD;\n\nKenya Creating Legal Framework for Crypto Regulation – Central Bank\n\nJack Dorsey’s Block Inc Leads $2 Million Investment in Kenya Based Bitcoin Mining Company Gridless"
    },
    {
        "id": 69,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZmluYm9sZC5jb20vb3Zlci04LXRyaWxsaW9uLXdvcnRoLW9mLXRyYW5zYWN0aW9ucy1tYWRlLW9uLWJpdGNvaW4tYmxvY2tjaGFpbi1pbi0yMDIyL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Over $8 trillion worth of transactions made on Bitcoin blockchain in 2022 - Finbold - Finance in Bold",
        "content": "Although Bitcoin (BTC) encountered one of the most challenging moments in 2022, data indicates that the BTC blockchain still accounted for a significant number of transactions.\n\nDespite the depressed prices, a staggering $8.2 trillion was transferred via the Bitcoin blockchain over the past year. The figure works out to an average of $260,000 per second, data estimates by crypto analysis firm CoinMetrics indicate.\n\nBitcoin blockchain transaction chart for 2022. Source: CoinMetrics\n\nImplication of Bitcoin’s blockchain transactions\n\nThe magnitude of the transaction amid the bear market highlights Bitcoin’s possible increased adoption and its role in the general financial system. From the data, the number of transactions on the blockchain plunged significantly in the second half of the year in correlation with the asset’s price movement.\n\nWith Bitcoin undergoing a freefall for the better part of 2022, the number one digital asset by market cap underwent a relief rally in early November after getting a boost from positive macroeconomic factors. However, the rally appears to have had a minimal impact on the number of transactions.\n\nThe transaction volume can also be welcomed by Bitcoin proponents, who might view the data as a sign of the asset’s maturity to earn an integration into the mainstream financial sector. Interestingly, the extended bear market has resulted in skeptics suggesting that Bitcoin is likely to plunge to zero.\n\nNotably, Bitcoin operated in an environment of investor skepticism, with the asset hampered by factors such as rising inflation and regulatory uncertainty.\n\nBitcoin still facing uncertainty\n\nAt the same time, Bitcoin has taken a hit from the FTX crypto exchange collapse, whose effects are projected to spread into 2023. The impact of the price correction also resulted in Bitcoin millionaires plunging by over 70% in 2022, per a Finbold report.\n\nAdditionally, the price correction might extend further, considering Bitcoin is still operating in an environment of high inflation with uncertainty regarding the Federal Reserve monetary policy.\n\nIndeed, if the market records a rally, the amount transferred on the Bitcoin blockchain will likely increase.\n\nBitcoin price analysis\n\nBy press time, Bitcoin was trading at $16,844, having made minor gains of less than 1% in the last 24 hours. On the weekly chart, BTC was up over 1%.\n\nBitcoin seven-day price chart. Source: Finbold\n\nAs things stand, the flagship cryptocurrency also controls a market capitalization of about $324.37 billion. As economic uncertainty prevails, projections indicate that Bitcoin will likely undergo an extended price correction in 2023.\n\nIn particular, the machine learning algorithm at PricePredictions indicates that the asset might trade at $15,532 on January 31, 2023.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 70,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9iaWdnZXN0LWJpdGNvaW4tbWluZXItc2h1dHMtZG93bi1odWdlLXBhcnQtb2YtbWluaW5nLXJpZ3MtYXMtYnRjLWhvdmVycy1zdGVhZHktYXQtMTY4MDAv0gGAAWh0dHBzOi8vd3d3LmNyeXB0by1uZXdzLWZsYXNoLmNvbS9iaWdnZXN0LWJpdGNvaW4tbWluZXItc2h1dHMtZG93bi1odWdlLXBhcnQtb2YtbWluaW5nLXJpZ3MtYXMtYnRjLWhvdmVycy1zdGVhZHktYXQtMTY4MDAvP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Wed, 04 Jan 2023 08:00:00 GMT",
        "title": "Biggest Bitcoin miner shuts down huge part of mining rigs, as BTC hovers steady at $16,800 - Crypto News Flash",
        "content": "Core Scientific to shut down 37,000 mining rigs it hosted for Celsius effective Jan. 3.\n\nThe two bankrupt firms have been in a legal battle for breach of contract since October 2022.\n\nCore Scientific, one of the biggest publicly traded cryptocurrency mining companies in the United States, is shutting down a large number of mining rigs as it undergoes bankruptcy proceedings.\n\nAccording to a court filing, the blockchain infrastructure company will shut off more than 37,000 mining rigs. The rigs are those it was hosting for the now-bankrupt crypto lending platform Celsius Network.\n\nCore Scientific stated back in October that Celsius’ non-payment of its power bill was causing it major liquidity issues. At the time, Core Scientific claimed that it was losing approximately $53,000 per day to cover the increased electricity tariffs that Celsius refused to pay.\n\nThe latest filing comes after Core Scientific’s Dec. 28 motion seeking approval to reject Celsius’ contract was approved. In the motion, Core claimed that Celsius’ failure to pay its power bills constituted a material breach of contract. It also added that covering Celsius’ mining rigs’ power fee had cost it almost $7.8 million.\n\nThe latest filing reveals that the termination of Core Scientific’s contract with Celsius will help the miner generate more revenue. It estimates that it can earn up to $2 million per month from the space currently occupied by Celsius’ mining rigs.\n\nCourt has granted Core Scientific approval to power down all Celsius’ mining rigs effective Jan. 3, 2023. It also stipulates a 75-day period from the date in which Celsius’ is to pick up its mining equipment. And a 30-day period from the date of the order in which Celsius can file any claims relating to damages.\n\nCrypto winter eating into miners’ revenues.\n\nCore Scientific’s financial troubles are not only tied to Celsius’ Terra-implosion-related bankruptcy according to a Reuters report. The crypto miner stated in its Dec. 21, 2022 bankruptcy filing that rising energy costs and the crypto market winter also played roles in its financial constraint.\n\nCore Scientific has also seen the price of its shares plunge 99.28 percent in the last year. It currently trades around $0.074, down from over $10 traded a year ago.\n\nHowever, it intends to continue operating while it reaches deals with its investors. Investment bank BlackRock, Core Scientific’s largest shareholder, has already shown confidence in the firm’s plans. According to an SEC filing, BlackRock has given Core Scientific a new $17 million loan.\n\nRemarkably, 2022 saw the price of Bitcoin (BTC) plunge from about $45,000 to its current price range of around $16,000. The Russia-Ukraine war also caused energy prices to rise rapidly.\n\nThe market conditions have also affected the revenues of other mining firms. Similar to Core, Iris Energy and Riot Blockchain saw their share prices fall 91.79 percent and 85.09 percent respectively in the last year. Riot said in a recent statement that it had failed to reach its BTC mining target despite expanding its hashrate.\n\nThis article is provided for informational purposes only and is not intended as investment advice. The content does not constitute a recommendation to buy, sell, or hold any securities or financial instruments. Readers should conduct their own research and consult with financial advisors before making investment decisions. The information presented may not be current and could become outdated."
    }
]