[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiSmh0dHBzOi8vd3d3LmZpZGVsaXR5LmNvbS9sZWFybmluZy1jZW50ZXIvdHJhZGluZy1pbnZlc3RpbmcvYml0Y29pbi1oYWx2aW5n0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "What is the Bitcoin halving? | Bitcoin halving dates | Fidelity - Fidelity Investments",
        "content": "Why do Bitcoin halvings happen?\n\nThe goal of halvings is to stabilize bitcoin's ability to act as a store of value. Let's explore what that means.\n\nBitcoin was created to be an alternative to traditional fiat currencies like the US dollar. One of the disadvantages of fiat currencies, according to crypto advocates, is that they may not be not reliable stores of value due to inflation. Your dollar bill may be worth $1 today, for example, but in 10 years, that same dollar could only hold $0.70 of purchasing power.\n\nIn contrast, crypto advocates believe bitcoin is a currency that will maintain or grow its value over time, meaning anyone can buy and hold without fear of inflation. Of course, skeptics believe this is not a realistic claim.\n\nOne way the Bitcoin network hopes to achieve this is through its hard cap of 21 million bitcoin, meaning there will only ever be 21 million bitcoin in existence. Unlike the central bank model that fiat currencies are subject to, where an unlimited amount of new money can be injected into or withdrawn from the system, bitcoin's absolute supply is limited.\n\nBut how it reaches that 21 million hard cap also matters. Recall that new bitcoins are released into circulation through mining rewards. Every time a miner adds a new block to the blockchain, the total number of bitcoins in circulation inches closer to the 21 million max.\n\nIt is commonly viewed that injecting new money supply into circulation can cause inflation. Bitcoin hopes to avoid this through the halving, which allows it to reduce the amount of new supply that is released as time goes on. The hope is that this strategy will curb inflation. Whether it's effective over the long run remains to be seen."
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiaWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTMvYml0Y29pbi1zcG90LWV0ZnMtYXBwcm92YWwtcGFydGlhbGx5LXByaWNlZC1pbi1jb2luYmFzZS1zYXlzL9IBbWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTMvYml0Y29pbi1zcG90LWV0ZnMtYXBwcm92YWwtcGFydGlhbGx5LXByaWNlZC1pbi1jb2luYmFzZS1zYXlzL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Spot ETFs Approval Partially Priced In, Coinbase Says - CoinDesk",
        "content": "\"That [pricing of spot ETF) makes it less clear how much more bitcoin could outperform if a favorable U.S. Securities and Exchange Commission SEC decision occurs. That is, in the event of one or more approvals, we believe there could be meaningful net inflows, but these may take time to materialize while markets tend to be impatient,\" Duong said."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMigQFodHRwczovL3d3dy5ibG9vbWJlcmcuY29tL25ld3MvYXJ0aWNsZXMvMjAyMy0xMC0xNC9ncmF5c2NhbGUtcy1iaXRjb2luLWV0Zi1wdXNoLXdoYXQtcy1uZXh0LWFmdGVyLXNlYy1kb2Vzbi10LWFwcGVhbC1jb3VydC1ydWxpbmfSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Grayscale's Bitcoin ETF Push: What's Next After Court Ruling Stands - Bloomberg",
        "content": "With the Securities and Exchange Commission opting against appealing a ruling that paves the way for Grayscale Investments LLC to convert its Bitcoin trust into an exchange-traded fund, analysts are now trying to gauge how the process may unfold from here.\n\nThe crypto asset-manager earlier this year scored a legal victory in federal court in its bid to turn its Grayscale Bitcoin Trust (ticker GBTC) into the first US ETF that would invest directly in the largest digital coin. The SEC faced a Friday deadline to appeal the ruling. The agency is not planning any other appeals in the case, according to a person familiar with the matter, who asked not to be identified discussing the ongoing matter."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvanVzdC1ob3ctcG9wdWxhci1jb3VsZC1hLXNwb3QtYml0Y29pbi1ldGYtYmUtaWYtYXBwcm92ZWQtYnktc2VjL9IBc2h0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vY3J5cHRvY3VycmVuY3kvanVzdC1ob3ctcG9wdWxhci1jb3VsZC1hLXNwb3QtYml0Y29pbi1ldGYtYmUtaWYtYXBwcm92ZWQtYnktc2VjL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Just How Popular Could a Spot Bitcoin ETF Be If Approved by SEC? - Finance Magnates",
        "content": "The cryptocurrency community has been buzzing with excitement as the Securities and Exchange Commission (SEC) considers whether to approve a Bitcoin exchange-traded fund (ETF). This potential crypto milestone begs the question: How popular would a spot Bitcoin ETF be if approved by the SEC? In this essay, we will look at the relevance of a spot Bitcoin ETF, its possible impact on the cryptocurrency market, and the factors that may influence its level of investor popularity.\n\nUnderstanding the Bitcoin ETF Spot\n\nA spot Bitcoin ETF is intended to give investors exposure to the underlying asset, Bitcoin, without requiring them to own the cryptocurrency itself. In contrast to futures-based ETFs, which derive their value from Bitcoin futures contracts, a spot Bitcoin ETF would hold the real cryptocurrency, allowing investors to purchase shares in the ETF and indirectly possess Bitcoin.\n\nThe simplicity and accessibility of a spot Bitcoin ETF are what make it appealing. It would allow traditional investors, both institutional and retail, to obtain exposure to Bitcoin via a familiar financial instrument. Investors could buy and sell shares of the ETF via existing stock exchanges, avoiding the intricacies of cryptocurrency exchanges and wallets.\n\nPotential Crypto Market Impact\n\nThe SEC's approval of a spot Bitcoin ETF might have far-reaching implications for the cryptocurrency market as a whole. Here are some of the primary ways it could affect the market:\n\nKeep Reading TradingView Enhances DeFi Tools on Polygon via QuickSwap Partnership\n\nLiquidity: A spot Bitcoin ETF would very certainly attract large institutional and retail investment. This inflow of capital may enhance liquidity in the Bitcoin market, allowing investors to buy and sell Bitcoin at competitive prices.\n\nLegitimization: The SEC's approval of a Bitcoin ETF would represent regulatory acceptance and legitimacy for Bitcoin as an asset class. This could encourage additional institutional investors to enter the bitcoin industry, further validating it.\n\nMarket Volatility: While increasing liquidity can help stabilize prices, it may also increase short-term volatility as more investors enter the market. Traders may strive to profit from market volatility, causing Bitcoin's price to rise and fall.\n\nPrice discovery: the location The daily trading of Bitcoin ETFs would provide a transparent and controlled price discovery mechanism for Bitcoin. This could contribute to the establishment of a widely recognized and established benchmark pricing.\n\nPopularity Influencing Factors\n\nIf approved, the popularity of a spot Bitcoin ETF would be determined by various criteria, including the following:\n\nRegulatory Environment: The SEC's regulatory approval is critical. Investors are eagerly expecting the SEC's judgment, which will have a huge impact on the ETF's popularity. The SEC's approval would almost certainly spark a boom in interest and investment.\n\nCustody and Security: Investors will be concerned about the ETF's Bitcoin custody and security. Gaining investor trust would require a respected custodian and robust security procedures.\n\nFees and Expenses: The ETF's cost structure, including management fees, will influence its appeal. Lower fees may entice price-conscious investors.\n\nMarket mood: The popularity of the ETF will be influenced by market mood and investor opinion. Demand for the ETF may be driven by positive sentiment and excitement surrounding Bitcoin.\n\nThe competitive landscape is important. If numerous spot Bitcoin ETFs are allowed, investors will have more options, and popularity may be distributed among them.\n\nAccess to Bitcoin: The simplicity with which investors can purchase ETF shares on traditional stock exchanges will be essential. The extent to which the ETF is adopted can be determined by its accessibility.\n\nConsiderations for Investors\n\nCertain concerns must be kept in mind by investors considering a prospective spot Bitcoin ETF:\n\nRisk Tolerance: Cryptocurrency investments, including ETFs, carry some risk due to market volatility. Investors should evaluate their risk tolerance and deploy their funds accordingly.\n\nConduct extensive research on the ETF's provider, custodian, and security measures. Make sure you understand how the ETF works and what fees are involved.\n\nRegulatory Updates: Stay up to date on regulatory events, which can have a substantial impact on the ETF's prospects.\n\nConsider how a spot Bitcoin ETF might fit into your whole investment strategy. Diversification can aid in risk management.\n\nLong-Term vs. Short-Term: Determine whether you want to invest in Bitcoin for the long term or for a short-term trading opportunity. Your investment horizon should correspond to your objectives.\n\nThe Unique Bitcoin Outlier: How a Bitcoin ETF May Not Follow the Crypto Trend\n\nUnlike most other cryptocurrencies, Bitcoin has established itself as a household name and a digital gold standard. While it has weathered extreme price volatility, it remains a favorite among investors and corporations looking to diversify their portfolios. This unique position raises questions about how a Bitcoin ETF might behave.\n\nThe answer is not straightforward. The performance of a Bitcoin ETF is not guaranteed to correlate with other cryptocurrencies. Cryptocurrency markets are known for their high volatility and susceptibility to speculative trends, which might not align with Bitcoin's more stable reputation. Therefore, a Bitcoin ETF could chart its own course, largely independent of the broader crypto market.\n\nA Bitcoin ETF may also exhibit more resilience during times of market turbulence. Its established status and recognition by mainstream investors could offer a level of security that other cryptocurrencies do not enjoy. Consequently, it could serve as a safe haven asset within the crypto realm, further distancing itself from the pack.\n\nInvestors and crypto enthusiasts should remain vigilant and avoid presuming that a Bitcoin ETF will mirror the erratic behavior of lesser-known digital assets. Its status as a crypto outlier is firmly established, and this trend may persist within the ETF market, potentially delivering unexpected results. As the crypto landscape evolves, understanding these unique dynamics will be key for those seeking to navigate the exciting but unpredictable world of digital assets.\n\nConclusion\n\nThe SEC's probable approval of a spot Bitcoin ETF has sparked great interest in the cryptocurrency industry as well as among traditional investors. Its relevance stems from the fact that it provides a simple and regulated mechanism for investors to obtain exposure to Bitcoin. The ETF's popularity is determined by a combination of regulatory variables, investor sentiment, fees, and competition.\n\nWhile investors await the SEC's ruling, it's critical to approach any investment in a spot Bitcoin ETF with caution, bearing in mind the inherent dangers and potential of the cryptocurrency market. If approved, the ETF would be a big step forward in the convergence of traditional finance and the realm of cryptocurrencies, potentially allowing a new wave of investors to engage in the digital asset revolution."
    },
    {
        "id": 8,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LmJ1c2luZXNzaW5zaWRlci5jb20vcGVudGFnb24tY2hpbmVzZS1vd25lZC1iaXRjb2luLW9wZXJhdGlvbi1jaGV5ZW5uZS13eW9taW5nLW1pY3Jvc29mdC0yMDIzLTEw0gFvaHR0cHM6Ly93d3cuYnVzaW5lc3NpbnNpZGVyLmNvbS9wZW50YWdvbi1jaGluZXNlLW93bmVkLWJpdGNvaW4tb3BlcmF0aW9uLWNoZXllbm5lLXd5b21pbmctbWljcm9zb2Z0LTIwMjMtMTA_YW1w?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Pentagon officials watching a Chinese-owned Bitcoin mine in Wyoming: NYT - Business Insider",
        "content": "A Bitcoin mine in Wyoming is on the radar of Pentagon officials.\n\nThe mine is connected to multiple Chinese companies and sits across from a Microsoft data center.\n\nThe company said that its placement near the data center, which supports the Pentagon, was unrelated.\n\nNEW LOOK Sign up to get the inside scoop on today’s biggest stories in markets, tech, and business — delivered daily. Read preview Thanks for signing up! Access your favorite topics in a personalized feed while you're on the go. download the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy . You can opt-out at any time.\n\nAdvertisement\n\nPentagon officials monitoring a Bitcoin operation in Wyoming that sits across from a Microsoft data center and a nearby military base are worried that the owners' ties to China could pose a national security threat, per The New York Times.\n\nMicrosoft believed the location could allow the Chinese government to \"pursue full-spectrum intelligence collection operations\" directed at the data center and the Francis E. Warren Air Force Base, which houses ICBMs.\n\nThe crypto mining operation first came under the US government's purview after a team at Microsoft submitted a report to the Committee on Foreign Investment in August 2022. The team believed the mining operation had the potential to collect information from the data center, which supports the operational needs of the Pentagon, the Times reported.\n\n\"Microsoft has no direct indications of malicious activities by this entity,\" Microsoft wrote, per the Times. \"However, pending further discovery, we suggest the possibility that the computing power of an industrial-level cryptomining operation, along with the presence of an unidentified number of Chinese nationals in direct proximity to Microsoft's Data Center and one of three strategic-missile bases in the US, provides significant threat vectors.\"\n\nAdvertisement\n\nIn 2021, China banned the resource-intensive practice of Bitcoin mining . Businesses in the cryptocurrency market scrambled to establish themselves in other countries, including the US.\n\nThe Times identified mines in 12 states that were owned by Chinese nationals. Per the outlet, some had ties to the Chinese government, some did not, and others could not be easily traced.\n\nThe Cheyenne, Wyoming, center was one such mine, per the Times. The Times reported that the mining operation is linked to five different companies, with one company, Bit Origin Ltd., previously registered as a pork-processing company in the Cayman Islands.\n\nLi Jiaming, the president of Bit Origin Ltd., said that the Microsoft data center or the nearby military base had nothing to do with why the area was chosen. Instead, the mine was placed there because a local utility company agreed to work with Bit Origin.\n\nAdvertisement\n\n\"Even though we are a Microsoft neighbor and a couple of miles from the base, without power it is nothing — the business cannot succeed,\" Jiaming told the Times.\n\nOfficials who spoke with the Times cited concerns that the mines, which use an immense amount of electricity in their operations, would be used to purposefully overwhelm electrical grids to cause planned blackouts and complete other cyberattacks."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9maXJzdC1tb3Zlci1hbWVyaWNhcy1iaXRjb2luLXNwb3QtMTIwNzI4NTAxLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "First Mover Americas: Bitcoin Spot ETF Partially Priced in: Coinbase - Yahoo Finance",
        "content": "This article originally appeared in First Mover, CoinDesk’s daily newsletter putting the latest moves in crypto markets in context. Subscribe to get it in your inbox every day.\n\nLatest Prices\n\nTop Stories\n\nBitcoin (BTC) has outperformed other cryptocurrencies amid macroeconomic uncertainty, partially due to traders pricing a potential approval of spot-based exchange-traded funds (ETFs), according to Coinbase Institutional. \"We think the divergence in the performance of bitcoin and other tokens shows that the potential approval of one or more spot bitcoin ETPs has already been partially priced in. That makes it less clear how much more bitcoin could outperform if a favorable U.S. Securities and Exchange Commission (SEC) decision occurs,\" David Duong, head of institutional research at Coinbase Institutional, said in the latest monthly report sent to subscribers on Thursday.\n\nU.S. regulators have targeted former Voyager Digital CEO Steve Ehrlich with lawsuits claiming he engaged in fraud and deliberately misrepresented his customers’ government protections. The Commodity Futures Trading Commission (CFTC) and Federal Trade Commission (FTC) announced related actions against Ehrlich on Thursday, with the CFTC also including in its court filing that Circle's USDC stablecoin and bitcoin as commodities. The CFTC accused Ehrlich of defrauding customers by misleading them about the strength of the company and doing business without proper registrations. The FTC said he lied about customers’ funds being protected by the Federal Deposit Insurance Corp.\n\nCaroline Ellison, 28, wrapped up her testimony on Thursday, her third day of questioning in the Sam Bankman-Fried trial. Sporting the same gray blazer as the last two days, Bankman-Fried's ex-girlfriend was asked about her company's accounting. Alameda engaged with a few accountants in 2021 to 2022, but after those firms reviewed Alameda's books, \"they found they couldn't or wouldn't do it,\" Ellison said, as she faced questions from Attorney Mark Cohen. Former FTX Digital Markets CEO Ryan Salame initially prepared Alameda's balance sheets, but at some point, Ellison took over this task, she testified. The company's financials are at the center of Bankman-Fried's demise. An award-winning CoinDesk story in November 2022 that cited Alameda's confidential balance sheet caused many to doubt the viability of Alameda and FTX.\n\nStory continues\n\nChart of The Day\n\nThe chart shows the Ethereum mainnet's daily fee revenue since early 2020.\n\nFees have reached the lowest since the DeFi boom of Summer in 2020.\n\nThe decrease is putting ETH's \"ultra sound money\" thesis to a test, according to IntoTheBlock.\n\nSource: IntoTheBlock\n\n- Omkar Godbole\n\nTrending Posts"
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8xMC8xMy9zZWMtcmVwb3J0ZWRseS1kZWNpZGVzLW5vdC10by1hcHBlYWwtaXRzLWJpdGNvaW4tZXRmLWNvdXJ0LWxvc3MtYWdhaW5zdC1ncmF5c2NhbGUv0gGBAWh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8xMC8xMy9zZWMtcmVwb3J0ZWRseS1kZWNpZGVzLW5vdC10by1hcHBlYWwtaXRzLWJpdGNvaW4tZXRmLWNvdXJ0LWxvc3MtYWdhaW5zdC1ncmF5c2NhbGUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "SEC Won’t Appeal Loss in Grayscale Case, Boosting the Odds GBTC Can Become a Bitcoin ETF - CoinDesk",
        "content": "Grayscale has long advocated that the conversion of GBTC to an ETF would eliminate the discount as it would close the gap between the price and the underlying bitcoin. The structure of ETFs allows for a creation-redemption model which means new ETF shares can be created to meet demand or redeemed to reduce supply."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTEwLTEzL3NlYy13b24tdC1hc2stY291cnQtdG8tcmV2ZXJzZS1pdHMtZGVjaXNpb24tb24tc3BvdC1iaXRjb2luLWV0ZtIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "SEC Won't Appeal Court Decision Paving Way for Grayscale Spot Bitcoin ETF - Bloomberg",
        "content": "The US Securities and Exchange Commission will not ask a federal appeals court to reconsider a ruling that paves the way for Grayscale Investments LLC to launch a spot Bitcoin exchange-traded fund, according to a person familiar with the matter.\n\nIn August, the DC Circuit Court of Appeals overturned the SEC’s rejection of Grayscale’s bid to convert its trust into an exchange-traded fund. The ruling was made by just three of the judges on the court and the regulator could have sought a review by a full slate of judges. The agency is not planning any other appeals in the case, said the person, who asked not to be identified discussing the ongoing matter."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMTAvMTMvYml0Y29pbi1pcy1jdXJyZW50bHktbmVpdGhlci1idWxsaXNoLW9yLWJlYXJpc2gtdHJhZGVycy1zYXkv0gFsaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8xMC8xMy9iaXRjb2luLWlzLWN1cnJlbnRseS1uZWl0aGVyLWJ1bGxpc2gtb3ItYmVhcmlzaC10cmFkZXJzLXNheS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Is Currently Neither ‘Bullish’ or ‘Bearish,’ Traders Say - CoinDesk",
        "content": "“After the exuberance of the last few years, we’ve seen a large flight to quality, both in terms of providers and assets,” said Dan O’Prey, Chief Product Officer of Bakkt in a note to CoinDesk. “Bitcoin, being the most decentralized and secure asset, has also benefited from flows from the riskier, long-tail coins.’"
    },
    {
        "id": 17,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8xMC8xMy9zZWMtZGVhZGxpbmUtb24tZ3JheXNjYWxlcy1iaXRjb2luLWV0Zi1kaXNwdXRlLWFwcHJvYWNoaW5nLWF0LW1pZG5pZ2h0L9IBdmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8xMC8xMy9zZWMtZGVhZGxpbmUtb24tZ3JheXNjYWxlcy1iaXRjb2luLWV0Zi1kaXNwdXRlLWFwcHJvYWNoaW5nLWF0LW1pZG5pZ2h0L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "SEC Deadline on Grayscale's Bitcoin ETF Dispute Approaching at Midnight - CoinDesk",
        "content": "Industry observers are widely expecting the SEC to let the deadline run out because the D.C. Circuit Court of Appeals decision 45 days ago was clear and even harsh in its assessment of how the agency declined the application, calling it \"arbitrary and capricious\" and saying the regulator was inappropriately trying to treat a spot ETF differently than a similar futures ETF. However, as the SEC is forced to rethink the Grayscale effort, it technically has the authority to further extend the dispute if the commission wants to find fault with other aspects of the application."
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMia2h0dHBzOi8vd3d3LnVzZnVuZHMuY29tL3Jlc291cmNlL2luLWFuLWluY3JlYXNpbmdseS1jb250cm9sbGVkLXdvcmxkLWJpdGNvaW4tc3RhbmRzLWFzLWEtYmVhY29uLW9mLWZyZWVkb20v0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "In an Increasingly Controlled World, Bitcoin Stands as a Beacon of Freedom - U.S. Global Investors",
        "content": "Private property rights and freedom of speech are fundamental human rights, and yet—as many people in Canada, Europe and elsewhere are discovering—they are among the most fragile. If we fail to remain vigilant and take these rights for granted, we risk losing the privilege of owning our own property and expressing our own thoughts and opinions.\n\nSo said conference-goers who were kind enough to chat with me following my presentation this week at Bitcoin Amsterdam, Europe’s largest Bitcoin event.\n\nI spoke about the differences between common law and civil law, using two island-nations—Singapore and Cuba—as case studies for both legal systems. A former British colony, Singapore embraced common law and free markets and therefore saw its GDP per capita surge from around $3,600 at the start of Lee Kuan Yew’s decades-long rule to above U.S. levels today. Over the same period, Fidel Castro’s Cuba—held back by a centralized/communist economy, strict state controls and lack of economic diversification—has experienced next to no growth. (You can read my 2015 article on the subject here.)\n\nFrom the Magna Carta to the Bitcoin Whitepaper\n\nDuring my presentation, I also traced the trajectory of common law from the signing of the Magna Carta in 1215 to the ratification of the U.S. Bill of Rights in 1791 and, eventually, the arrival of the Bitcoin whitepaper in 2008.\n\nThink about it: The Magna Carta was primarily designed to prevent kings from abusing their power and unjustly seizing their subjects’ private property. Similarly, Bitcoin was created to protect individual’s wealth in the digital age. Whereas the former laid the groundwork for the rule of law and the rights of individuals in the face of centralized power, the latter seeks to extend these principles into the realm of digital finance and beyond.\n\nIt should come as little surprise, then, that Bitcoin conferences typically attract human rights activists such as the Human Rights Foundation’s (HRF) Alex Gladstein, Togolese writer Farida Nabourema, North Korean defector Yeonmi Park and others.\n\nCommon and Civil Law Countries\n\nSeeking Financial Freedom\n\nDespite the guardrails, many people worry that their basic rights are under threat—and in some very notable cases, they are.\n\nIn the last couple of years, everyday Canadians have had their bank accounts frozen for legally protesting vaccine mandates. They’ve had stricter regulations and censorship of online content imposed on them, and, more recently, they’ve seen global news providers restrict access to Canadian users.\n\nHere in the Netherlands, the world’s second-largest exporter of food, farmers gathered in March to protest the government’s draconian crackdown on nitrogen emissions, fearing it would result in the culling of thousands of heads of cattle. Irish farmers were forced to do the same in July.\n\nMeanwhile, there are growing concerns that central bank digital currencies (CBDCs) will one day be used to monitor and control people’s spending habits. Christine Lagarde, head of the European Central Bank (ECB), admitted as much back in April, saying that CBDCs would give governments some measure of “control.”\n\nThese examples represent breaches of the proverbial social contract in mostly high-income countries. In many parts of the so-called Global South, the situation is even more dire, with flagrant human rights abuses, currency collapses and political instability driving people to flee their homes in search of safety and a better life. Why else are we seeing record numbers of Venezuelan asylum-seekers turn up at the U.S.-Mexico border and huge waves of North Africans wash up on the banks of Italy?\n\n“Bitcoin fixes this” is a common refrain at conferences like the one in Amsterdam. The digital asset may not end up as the panacea that many of its biggest advocates claim it is, but its decentralized nature, resistance to censorship and ability to empower individuals in the face of increasing government controls can’t be ignored.\n\nThe 1970s Strikes Back\n\nAs more and more people become disillusioned with traditional systems, the appeal of decentralized alternatives like Bitcoin becomes evident. That’s especially true now that there are signs we may be entering an era of 1970s-style stagflation (high inflation coupled with high unemployment), triggered by stubborn consumer prices, spiking bond yields, rising oil costs, workers’ strikes, record debt levels, unexpected Chinese weakness, a malfunctioning U.S. government and two wars.\n\nIndeed, the parallels are striking.\n\nIn October 1973, Egyptian and Syrian forces unexpectedly attacked Israel in a bid to recover territory they lost to the country just six years earlier. Launched on Yom Kippur, the holiest day of the Jewish year, the short yet bloody conflict had significant economic consequences, including the first of two major oil crises of the 1970s, a global recession and a decade of stagflation.\n\nAlmost exactly 50 years later, a similar engagement is playing out after Hamas militants, in a surprisingly well-organized assault, successfully breached Israel’s border with Gaza, capturing a number of Israeli settlements for the first time ever and taking soldiers and civilians hostage.\n\nWith Israeli Prime Minister Benjamin Netanyahu warning of a “long and difficult war,” can we expect the same global consequences as before?\n\nAnalysts at Deutsche Bank appear to believe so. The bank forecasts a mild recession in the U.S. in the first quarter of 2024 as geopolitical risks remain elevated and rates stay high for an extended period of time, among other factors.\n\nIn its World Economic Outlook, out this week, the International Monetary Fund (IMF) also predicts lower rates of economic growth and strongly urges governments to cut deficit spending. Doing so, the IMF says, will take some of the pressure off central banks in their mission to tame inflation.\n\nHousing Least Affordable in Recent Memory\n\nOne of the most glaring signs that the economy isn’t working for everyone is the historic drop in housing affordability in the U.S. With 30-year mortgage rates now topping 8% in some cases, many Americans are priced out of owning their own home. According to real estate data provider ATTOM, single-family houses in a whopping 99% of U.S. counties are out of reach for the average American earning around $75,000.\n\nTake a look at the chart below. Housing affordability has fallen even deeper below the magic 100 line for the first time in recent memory, according to the National Association of Realtors (NAR). (A value of 100 means that a family earning a median income makes just enough to afford a new home. A value under that means that new homes are no longer affordable.)\n\nFactors such as the increase in home prices and mortgage rates have pushed the standard portion of wages required for primary homeownership costs to 35%, ATTOM says. This is significantly higher than conventional lending standards, which recommend a 28% debt-to-income ratio. Basic homeownership expenses now consume more than a third of average wages.\n\nThe lessons of history, whether from the Magna Carta or the events of the 1970s, remind us of the cyclical nature of societal and economic shifts. As I said earlier, Bitcoin may not be a magic solution to all our problems, but I believe it represents a tool to safeguard our freedoms and assets in an unpredictable landscape.\n\nIndex Summary\n\nThe major market indices finished mixed this week. The Dow Jones Industrial Average gained 0.79%. The S&P 500 Stock Index rose 0.40%, while the Nasdaq Composite fell 0.18%. The Russell 2000 small capitalization index lost 1.50% this week.\n\nThe Hang Seng Composite gained 1.87% this week; while Taiwan was down 1.59% and the KOSPI rose 1.97%.\n\nThe 10-year Treasury bond yield fell 18 basis points to 4.622%.\n\nAirlines and Shipping\n\nStrengths\n\nThe best performing airline stock for the week was Embraer, up 3.4%. According to ISI, passenger throughput was up14% year-over-year on capacity up 10% year-over-year. The group estimates load factors have firmed over the last two weeks.\n\nAccording to ISI, Euronav has confirmed that its two largest shareholders, with a total voting stake of 53% of the company, have agreed to transactions that ultimately change the direction of the company. Frontline will sell its 26.12% stake then acquire 24 modern ships from Euronav for $2.35 billion.\n\nDelta Air Lines reported September quarter-end adjusted EPS of $2.03, above FactSet consensus of $1.95 and near the high end of the company’s latest $1.85 to $2.05 guidance. The beat versus consensus was primarily driven by better fuel costs in addition to non-fuel unit costs.\n\nWeaknesses\n\nThe worst performing airline stock for the week was Wizz Air, down 14.2%. According to Bank of America, all airlines have suspended flights to Israel. Wizz has the highest exposure at 6.1% capacity followed by easyJet at 2.7%. Wizz is by far the most exposed to Middle East travel, which accounts for 20.5% of its scheduled 2023 flights. Wizz has already reduced its F2H24 capacity growth guidance from 30% to 20%.\n\nAccording to Bank of America, COSCO’s profit alert showed third quarter 2023 profits continuing to a quarter-over-quarter decline and sees downside into the fourth quarter. The bank lifted its 2023 estimates on a slower-than-expected spot rate decline in the third quarter with transpacific benefiting from some temporary supply-side discipline, but it leaves its 2024-2025 estimates unchanged with losses expected from building supply pressure.\n\nAccording to Goldman, Volaris announced an update to its 2023 guidance to reflect higher-than-expected jet fuel prices and aircraft groundings following Pratt & Whitney engines inspections. In summary, the company reduced its EBITDAR margin guidance to 26%, in line with Goldman, from 29-31% prior for 2023 fiscal year.\n\nOpportunities\n\nAccording to Raymond James, for SAS a consortium made up of AF-KLM, Castlelake, and Lind, together with the Danish State, would invest $1.175 billion ($475M common shares and $700M secured convertible bonds). AF-KLM’s investment would represent a maximum 19.9% non-controlling stake. However, after a minimum of two years it may be increased to become a controlling shareholder.\n\nAccording to Stifel, for 2024 there should be modest shipping demand growth from higher iron ore mining production and coking coal. Thermal coal demand is likely to be a function of natural gas prices. High natural gas prices (greater than $12/MMBtu) should result in growth in thermal coal. For minor bulks, which make up just under 40% of all dry bulk trade, Stifel expects growth to be slightly higher than global GDP levels. With respect to supply, just 3% of the existing fleet is scheduled for delivery next year. Even with relatively healthy dry bulk shipping rates, the scrapping should take 1-2% out of the current fleet, leaving net fleet growth of 1%-2% at most.\n\nAccording to Goldman, for Boeing, new aircraft order demand remains quite strong driven by both growth and replacement; and Boeing and Airbus backlogs are large relative to the current delivery pace, creating tight supply versus demand. In addition, short-term MAX deliveries have been light compared to the planned medium-term production rate ramp-up, as supply chain issues continue to hold output back. However, Goldman expects higher deliveries into year-end and further acceleration in 2024, given seasonality and supply chain improvement. 787 deliveries were strong.\n\nThreats\n\nAccording to JPMorgan, the most relevant impact for the airport sector is related to the increasing risk perception for airports, manifested as a higher cost of capital for them going forward.\n\nAccording to Morgan Stanley, UPS and FedEx customers are negotiating discounts following several years of rate hikes. According to Reuters’ industry data and interviews with seven industry professionals, UPS and FedEx customers have been able to “easily” win discounts back with savings of 8-12% versus previous agreements. The discount levels appear to be like pre-pandemic levels and could offset FDX and UPS’s recent 5.9% GRI which was already below prior year increases. This could prove challenging to FDX’s ongoing cost cutting initiatives and UPS plans to offset labor cost inflation.\n\nFrench authorities asked airlines to cut 40% of flights at Paris-Orly airport at the end of last week ahead of unions’ planned strike calling for pay increases. The country’s civil aviation authority also asked the regional Marseille-Provence and Beauvais airports to reduce flights by 20% and 15%, respectively. The strike is set to come three days before a scheduled government-union meeting on low wages.\n\nLuxury Goods and International Markets\n\nStrengths\n\nShares of JPMorgan, the largest bank in the United States, gained on Friday after posing another quarter of record net interest income and boosting its forecast for the year. The bank reported a net interest income of $22.9 billion through September 30, above analyst expectations. The purchase of the First Republic Bank back in August and rising rates are benefiting the bank’s performance.\n\nIn the third quarter of 2023, Porsche Cars North America, Inc. achieved a remarkable 21% increase in U.S. retail deliveries, totaling 19,988 cars, contributing to a 15% year-to-date growth with 56,323 new vehicles sold in the first nine months. The Macan emerged as the top-selling model, boasting a 31% year-to-date increase, with the new Cayenne following at 2%. Additionally, Porsche’s used U.S. sales in the first nine months of 2023 surged by 20.2% year-on-year.\n\nWilliams Sonoma was the best performing S&P Global Luxury stock, gaining 3.9% in the past five days. Loop Capital revised its price target from $185 to $200. The company has outperformed the competition year-to-date, and the broker believes that its profitability levels are sustainable for several reasons, including the elimination of site-wide promotion, the continued shift to e-commerce, and the company’s growing business-to-business operations.\n\nWeaknesses\n\nShares of LVMH, the parent company of Louis Vuitton and Dior, declined sharply after the company reported third-quarter group sales below expectations. Quarterly sales increased by 9% versus the 11% expected. The highly important Fashion & Leather Goods division delivered 9% sales versus 10% expected. The Wine and Spirit division was the weakest, where sales declined by 14% versus the same period of the prior year.\n\nInflation in the United States is coming down, but this week it was reported above expectations for the month of September. The month-over-month inflation was posted at 0.4%, above the expected 0.3%. The year-over-year inflation was posted at 3.7%, above the expected 3.6%.\n\nNorwegian Cruise Line Holdings was the worst performing S&P Global Luxury stock, losing 11.1% in the past five days. This week, cruise operators and airlines fell as spiking oil prices due to growing conflict in the Middle East pressured these sectors.\n\nOpportunities\n\nDespite brokers revising luxury stocks lower, the long-term sector performance should remain solid. After this week’s correction, shares of Louis Vuitton, a global luxury conglomerate, are in oversold territory. In the past five years, the current level was only observed a few times, and it was followed by a recovery.\n\nBMW launched the all-new X2 generation. In its first version, the BMW X2 set the standard for premium small SUVs with a sporty touch. Now, in its second generation, it’s pushing the envelope even further with a bold new design that resembles the larger BMW X4. The new X2 is larger, sleeker, more aerodynamic, and comes with additional features. Plus, there’s a brand-new, all-electric model called the BMW iX2. This is a big upgrade from the original model.\n\nPolicymakers in China may issue a 1 trillion yuan ($137 billion) of additional sovereign debt to boost growth and meet economic targets. This could raise this year’s budget deficit to well above the 3% cap set in March. The country’s economic slowdown has weighed on everything from Chinese stocks to commodity prices and the results of multinational companies such as Nike Inc. and LVMH. And, if China provided more stimulus, it may boost consumer spending, leading to stronger luxury goods performance.\n\nThreats\n\nThe weaker-than-expected sales posted by Louis Vuitton this week sent a warning sign to luxury investors. Many brokers have revised luxury stock ratings, pointing to trouble lying ahead due to slower economic global growth, rising rates, and depletion of pandemic savings. The luxury sector holds long-term potential, but analysts remain cautious about the short term.\n\nTensions are high as Israel-Hamas fighting continues. Israel’s military warned on Friday of today’s “day of rage” announced by Hamas and urged its citizens abroad to avoid Palestinian protests around the globe. Israel’s military has ordered the evacuation of 1 million Palestinians from northern Gaza to the south as the region awaits the imminent wide-scale ground invasion, according to FactSet.\n\nOn Thursday, the Prime Minister of Malaysia announced a new tax to be added on luxury goods next year as part of economic reform. The government plans to introduce a 5-10% tax on luxury goods such as jewelry and watches. Along with other measures planned by the government, it will help to lower Malaysia’s fiscal deficit to 4.3% of the gross domestic product next year, from an estimated 5% this year.\n\nEnergy and Natural Resources\n\nStrengths\n\nThe best performing commodity for the week was coffee, rising 6.06%, its first weekly gain in a month, as noted by Bloomberg. The price spike was attributed to short covering. Crude prices, which were falling earlier in the week, surged over 5% on Friday as Israel warned the people of Gaza to flee to the south as the markets realized we were much closer to an invasion by Israeli ground forces into the region. This significantly raises the level of risks for a wider conflict.\n\nChinese coal prices are approaching six-month highs heading into the winter heating season, suggesting that the authorities will re-double efforts to ensure supply after the country largely escaped severe power outages over the summer. Thermal coal at the port of Qinhuangdao is being offered at more than 1,000 yuan a ton, according to Fengkuang Coal Logistics, a level last seen in April when optimism over China’s recovery from the pandemic was relatively intact.\n\nAccording to Goldman, differently from oil, the ongoing conflict in Israel has started to impact natural gas supply. With Israel asking Chevron to halt operations at the 10 Bcm/y Tamar field for safety reasons, the bank sees this as a potential tightening of equal size to global LNG markets.\n\nWeaknesses\n\nThe worst performing commodity for the week was lead, dropping 5.09%, as sentiment weakened across the board for base metals. According to UBS, we are in the midst of a refining pullback. In the last three weeks refining equities are down 11.2%, underperforming broader Energy by 700 basis points (bps) and S&P by 1,096bps. Refining equities have never gone up linearly and pullbacks are common in this sector. This is the second major pullback in 2023. The first pullback started late March and the current pullback has been triggered by a sharp correction in gasoline crack.\n\nIron ore sank to its lowest in a month after falling 4% during China’s Golden Week holiday, with stagnant home sales weighing on demand. Prices of the steelmaking material fell as much as 2.2% Monday in thin trading. Analysts are expecting a cautious recovery rather than an outright rebound in the property sector, which accounts for nearly 40% of steel consumption.\n\nIt is up to Codelco’s board and management to turn around the state behemoth’s ailing copper mines and projects using currently available resources, according to a senior government official. When asked if Chile’s government would throw Codelco a lifeline as it grapples with slumping output and profit and rising debt, Mining Minister Aurora Williams said the public company must operate as if it were a private-sector enterprise. “It is the administration, through its chairman, its CEO, who must seek to resolve the various problems — whether financial or operational,” Williams said in an interview from Bloomberg’s London office on Wednesday.\n\n\n\nOpportunities\n\nBank of America anticipates some focus will turn back to the US SPR, which still has ample capacity to release production given 351 mm bbls still in storage. Despite criticism over prior price-related releases under the current administration, its actual purpose is to be available in response to geopolitical risk to supply. The SPR has shown itself capable of adding 1mm bpd rate for 90 days, although this may be premature given any perceived benefit to limit domestic price inflation would be 13 months before the 2024 U.S. presidential election. In any other circumstance the bank doubts Saudi would look favorably on such a move.\n\nU.S. President Joe Biden is set to announce as much as $7 billion in funding for hydrogen projects across the country as part of a competition to jump-start production of the clean-burning fuel in the U.S., according to people familiar with the matter.\n\nAccording to Goldman, ExxonMobil announced the acquisition of Pioneer Natural Resources in an all-stock transaction valued at $59.5 billion, with an enterprise value of $64.5 billion. The transaction is expected to close in the first half of 2024 pending customary closing conditions. The companies expect the transaction to be accretive on earnings per share, operating cash flow and free cash flow in 2024.\n\nThreats\n\nAccording to Goldman, the Wall Street Journal reported that “Saudi Arabia has told the White House it would be willing to boost oil production early next year if crude prices are high—a move aimed at winning goodwill in Congress for a deal in which the kingdom would recognize Israel and in return get a defense pact with Washington, Saudi and U.S. officials said.” In Goldman’s view, the escalating conflict in Gaza reduces the likelihood of a near-term normalization in Saudi Israeli relations.\n\nOil cuts by Saudi Arabia, which pumps a lot of the heavier crudes that are used to make diesel fuel, have refiners struggling to find enough of this feedstock to supply the fuel that is the lifeblood of the global economy. Wood Mackenzie Ltd. sees global refinery production dropping 1.5% this quarter, which translates to 1.2 million barrels per day in reduced supply. Unless a recession reduces demand, shortages of diesel and home heating oil could push up inflation this winter.\n\nA probe into a leak from an undersea gas pipeline between Finland and Estonia is proceeding on the assumption that it was a deliberate act of destruction,\n\naccording to people familiar with the matter. There are no final conclusions, the people said. Officials are expected to give more details on the investigation later. European gas prices rose as much as 10%.\n\nBitcoin and Digital Assets\n\nStrengths\n\nOf the cryptocurrencies tracked by CoinMarketCap, the best performer for the week was Loom Network, rising 62.4%.\n\nThe surge in government bond yields over the past few weeks saw Bitcoin beating equities by a wide margin. Should yields resume their advance, that could ultimately end up benefiting the largest digital token, writes Bloomberg.\n\nStablecoin issuer Tether Holdings appointed its technology boss Paolo Ardoino as its new chief executive officer, following several years in which the executive had emerged as the company’s main public figure, writes Bloomberg.\n\nWeaknesses\n\nOf the cryptocurrencies tracked by CoinMarketCap, the worst performer for the week was Mantle, down 18.22%.\n\nBitcoin and other cryptocurrencies fell back on Thursday, extending declines for a sixth day despite widespread advances seen in other risk-sensitive assets, with gains form a recent bullish trend fizzling out as cryptos returned to familiar trading ranges, writes Bloomberg.\n\nHamas’ lightning strike on Israel last weekend has left observers questioning how the group financed the surprise operation. One possible answer: cryptocurrency. Hamas received large amounts of funds through crypto, according to a review of Israeli government seizure orders and blockchain analytics reports, writes Bloomberg.\n\nOpportunities\n\nThe owner of crypto exchange Bitfinex is exploring a $150 million share buyback that would provide it with greater control over the private company’s dealings, according to Bloomberg.\n\nDecentralized finance is yet to pose a meaningful risk to overall financial stability, explains Bloomberg, but does require monitoring, according to the European Union’s financial markets and securities regulator.\n\nMastercard, in conjunction with the Reserve Bank of Australia and the Digital Finance Cooperative Research Centre, revealed on Thursday the latest results of their CBD pilot project, writes BlockWorks. Notably, the pilot included a live transaction where an NFT was purchased on the Ethereum blockchain using a “wrapped” version of the CBDC.\n\nThreats\n\nCaroline Ellison took the witness stand Tuesday afternoon and within minutes pointed to her former boss and boyfriend, FTX co-founder Sam Bankman-Fried, as the man responsible for the loss of billions in customer funds. “He directed me to commit these crimes,” she told jurors, according to Bloomberg reports.\n\nIn the latest blow to Binance’s global ambitions, a Brazilian congressional committee has recommended the indictment of four of the company’s senior leaders including its founder and CEO CZ, writes Bloomberg.\n\nCaroline Ellison, on Wednesday, detailed how she worked with Sam Bankman-Fried to lie about the health of Alameda Research and FTX and deceive lenders and customers. She testified that she falsified Alameda’s balance sheet, at the direction of Bankman-Fried, to conceal that the firm was taking in large sums of money from FTX customers, writes Bloomberg.\n\nGold Market\n\nThis week gold futures closed at $1,941.50, up $96.30 per ounce, or 5.22%. Gold stocks, as measured by the NYSE Arca Gold Miners Index, ended the week higher by 7.49%. The S&P/TSX Venture Index came in off 0.83%. The U.S. Trade-Weighted Dollar rose 0.55%.\n\nStrengths\n\nThe best performing precious metal for the week was gold, up 5.22%. Gold in China jumped to trade at the second-highest premium on record against the international benchmark, as mainland markets reopened following the Golden Week holiday. The Shanghai spot price was more than $112 an ounce higher\n\nthan levels seen in London on Monday, according to Bloomberg calculations and based on exchange data. The gap between the two markets has only been wider one other time, when Chinese prices last month blew out to trade at a premium of more than $120 over London, as Beijing restricted shipments in a move that squeezed the market.\n\nthan levels seen in London on Monday, according to Bloomberg calculations and based on exchange data. The gap between the two markets has only been wider one other time, when Chinese prices last month blew out to trade at a premium of more than $120 over London, as Beijing restricted shipments in a move that squeezed the market. Calibre Mining Corp. reported Tuesday record gold production of\n\n73,485 ounces in the third quarter, a 50% year-on-year increase. The company said this marked the fourth consecutive quarter that it achieved record quarterly gold production. Year-to-date production increased 30% to 160,704 ounces as the company remains on track to deliver its full-year 2023 guidance of 250,000 to 275,000 ounces.\n\n73,485 ounces in the third quarter, a 50% year-on-year increase. The company said this marked the fourth consecutive quarter that it achieved record quarterly gold production. Year-to-date production increased 30% to 160,704 ounces as the company remains on track to deliver its full-year 2023 guidance of 250,000 to 275,000 ounces. Gold surged above $1,900 on Friday as conflict in the Middle East appeared to be headed for escalation this weekend. The precious metal steadied after jumping 1.6% on Monday, the most since May, as haven demand rose on the back of Hamas’ shock attack on Israel over the weekend. However, the developments on Friday sent gold climbing over 3% on the day.\n\nWeaknesses\n\nThe worst performing precious metal for the week was palladium, down 1.30%. According to JPMorgan, platinum and palladium prices slumped to a year-to-date low earlier this week as continued higher-for-longer interest rate pricing finally cracked resilience in precious metals prices over the last few weeks. More broadly, platinum deficits have not been felt in the broader physical market as China has likely destocked domestic above-ground inventory imported over recent years. Power disruptions in South Africa have also not materially disrupted supply, eroding a risk premium that was embedded in prices earlier this year.\n\nFor K92 Mining, as a result of the unexpectedly challenging first quarter and the impacts of the safety incident on June 28, 2023, the company is updating its production guidance to 111,000 from 116,000 ounces gold (originally 120,000 to 140,000 ounces). Given K92’s strong liquidity position for the Stage 3 and 4 Expansions and the positive reported exploration results to date, it is increasing exploration expenditures for 2023 to $20 million from $13 to $16 million originally planned.\n\nThe CPI print on Thursday morning took what was looking to be a good rally in the price of gold to start the day to a deflating loss. The data supports the thesis for another rate hike this year but it’s not certain. However, investors versus the pundits calling for a cut in rates may set the path forward with higher long rates continuing to increase. As Bloomberg noted, price agnostic buyers, U.S. commercial banks, hedge funds, insurers, and pensions, are move aggressive and likely to demand higher yields to finance long-term government debt.\n\nOpportunities\n\nCould this be the start of a new bull market in bullion? No one knows the answer to that question, but looking at some of the initial stock price performance for some of the best performing senior peers for the week shows promise: Harmony Gold Mining up 27%, Gold Fields Ltd. up 26% and AngloGold Ashanti Plc. up 22%. While this is intriguing performance, it doesn’t translate to gains per say, unless investors already owned the companies in a portfolio. That is where the opportunity lies; gold stocks have been ignored relative to the price of gold with the digital asset frenzy of recent years. Gold stocks, in particular the junior gold exploration and development tiers, have been eschewed by new investors in search of quick riches.\n\nBank of America thinks that the royalty & streaming (R&S) names are the preferred picks in this type of environment given fortress balance sheets, low costs that are insulated from cost inflation, and lower gold price operating leverage. The bank highlights R&S companies Franco-Nevada and Wheaton Precious Metals given their large market caps, deep liquidity, and substantial asset and commodity diversification.\n\nAccording to Bank of America, as to gold, Heraeus outlines that “Despite net negative demand in April and May this year, strong buying activity by central banking institutions has returned.” There were no notable sales in August, while purchases totaled 77 tons. The Chinese central bank added 29 tons to its gold reserves in August, continuing a streak of buying that began in November last year. Central bank purchases have supported gold.\n\nThreats\n\nAccording to BMO, Dundee Precious Metals reported its third quarter 2023 production results with gold and copper production slightly lower than its estimate. Overall, gold production remains well on track to meet 2023 guidance, but copper production could achieve the lower end of guidance.\n\nAccording to CIBC, Karora Resources reported consolidated third quarter 2023 production results of 39.5koz, below consensus of 41.6koz. Third quarter production brought Q1-Q3 production to 120.2koz, tracking in line with the high end of unchanged 2023 guidance of 145koz-160koz.\n\nAn unsolved $17 million heist of Swiss gold and cash near Canada’s busiest airport has led Brink’s Co. to sue Air Canada for allegedly letting a thief slip away with the loot. Miami-based Brink’s accused the airline of “negligence and carelessness” in a lawsuit after a heist at a Toronto cargo facility netted thieves about 400 kilograms (882 pounds) of gold and $1.9 million in bank notes.\n\nU.S. Global Investors, Inc. is an investment adviser registered with the Securities and Exchange Commission (“SEC”). This does not mean that we are sponsored, recommended, or approved by the SEC, or that our abilities or qualifications in any respect have been passed upon by the SEC or any officer of the SEC.\n\nThis commentary should not be considered a solicitation or offering of any investment product. Certain materials in this commentary may contain dated information. The information provided was current at the time of publication. Some links above may be directed to third-party websites. U.S. Global Investors does not endorse all information supplied by these websites and is not responsible for their content. All opinions expressed and data provided are subject to change without notice. Some of these opinions may not be appropriate to every investor.\n\nHoldings may change daily. Holdings are reported as of the most recent quarter-end. The following securities mentioned in the article were held by one or more accounts managed by U.S. Global Investors as of (09/30/2023):\n\nDelta Air Lines\n\nWizz Air Holdings\n\neasyJet PLC\n\nCOSCO Shipping Holdings\n\nBoeing\n\nAirbus SE\n\nUnited Parcel Service (UPS)\n\nFedEx Corp.\n\nLouis Vuitton\n\nBMW\n\nCalibre Mining\n\nFranco-Nevada\n\nWheaton Precious Metals\n\nAngloGold Ashanti\n\nGold Fields Ltd.\n\nHarmony Gold Mining\n\nDundee Precious Metals\n\nKarora Resources\n\nAir Canada\n\n*The above-mentioned indices are not total returns. These returns reflect simple appreciation only and do not reflect dividend reinvestment.\n\nThe Dow Jones Industrial Average is a price-weighted average of 30 blue chip stocks that are generally leaders in their industry. The S&P 500 Stock Index is a widely recognized capitalization-weighted index of 500 common stock prices in U.S. companies. The Nasdaq Composite Index is a capitalization-weighted index of all Nasdaq National Market and SmallCap stocks. The Russell 2000 Index® is a U.S. equity index measuring the performance of the 2,000 smallest companies in the Russell 3000®, a widely recognized small-cap index.\n\n\n\nThe Hang Seng Composite Index is a market capitalization-weighted index that comprises the top 200 companies listed on Stock Exchange of Hong Kong, based on average market cap for the 12 months. The Taiwan Stock Exchange Index is a capitalization-weighted index of all listed common shares traded on the Taiwan Stock Exchange. The Korea Stock Price Index is a capitalization-weighted index of all common shares and preferred shares on the Korean Stock Exchanges.\n\n\n\nThe Philadelphia Stock Exchange Gold and Silver Index (XAU) is a capitalization-weighted index that includes the leading companies involved in the mining of gold and silver. The U.S. Trade Weighted Dollar Index provides a general indication of the international value of the U.S. dollar. The S&P/TSX Canadian Gold Capped Sector Index is a modified capitalization-weighted index, whose equity weights are capped 25 percent and index constituents are derived from a subset stock pool of S&P/TSX Composite Index stocks. The NYSE Arca Gold Miners Index is a modified market capitalization weighted index comprised of publicly traded companies involved primarily in the mining for gold and silver. The S&P/TSX Venture Composite Index is a broad market indicator for the Canadian venture capital market. The index is market capitalization weighted and, at its inception, included 531 companies. A quarterly revision process is used to remove companies that comprise less than 0.05% of the weight of the index, and add companies whose weight, when included, will be greater than 0.05% of the index.\n\n\n\nThe S&P 500 Energy Index is a capitalization-weighted index that tracks the companies in the energy sector as a subset of the S&P 500. The S&P 500 Materials Index is a capitalization-weighted index that tracks the companies in the material sector as a subset of the S&P 500. The S&P 500 Financials Index is a capitalization-weighted index. The index was developed with a base level of 10 for the 1941-43 base period. The S&P 500 Industrials Index is a Materials Index is a capitalization-weighted index that tracks the companies in the industrial sector as a subset of the S&P 500. The S&P 500 Consumer Discretionary Index is a capitalization-weighted index that tracks the companies in the consumer discretionary sector as a subset of the S&P 500. The S&P 500 Information Technology Index is a capitalization-weighted index that tracks the companies in the information technology sector as a subset of the S&P 500. The S&P 500 Consumer Staples Index is a Materials Index is a capitalization-weighted index that tracks the companies in the consumer staples sector as a subset of the S&P 500. The S&P 500 Utilities Index is a capitalization-weighted index that tracks the companies in the utilities sector as a subset of the S&P 500. The S&P 500 Healthcare Index is a capitalization-weighted index that tracks the companies in the healthcare sector as a subset of the S&P 500. The S&P 500 Telecom Index is a Materials Index is a capitalization-weighted index that tracks the companies in the telecom sector as a subset of the S&P 500.\n\n\n\nThe Consumer Price Index (CPI) is one of the most widely recognized price measures for tracking the price of a market basket of goods and services purchased by individuals. The weights of components are based on consumer spending patterns. The Purchasing Manager’s Index is an indicator of the economic health of the manufacturing sector. The PMI index is based on five major indicators: new orders, inventory levels, production, supplier deliveries and the employment environment. Gross domestic product (GDP) is the monetary value of all the finished goods and services produced within a country’s borders in a specific time period, though GDP is usually calculated on an annual basis. It includes all private and public consumption, government outlays, investments and exports less imports that occur within a defined territory.\n\nThe S&P Global Luxury Index is comprised of 80 of the largest publicly traded companies engaged in the production or distribution of luxury goods or the provision of luxury services that meet specific investibility requirements.\n\nThe National Association of Realtors (NAR) Housing Affordability Index measures whether or not a typical family could qualify for a mortgage loan on a typical home. A value of 100 means that a family with the median income has exactly enough income to qualify for a mortgage on a median-priced home."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY2hpbmVzZS1vd25lZC1iaXRjb2luLW1pbmUtaW4td3lvbWluZy1yYWlzZXMtbmF0aW9uYWwtc2VjdXJpdHktY29uY2VybnMtdXMtb2ZmaWNpYWxzLXdhcm460gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Chinese-Owned Bitcoin Mine In Wyoming Raises National Security Concerns, US Officials Warn: NYT - Nasdaq",
        "content": "U.S. Pentagon officials are keeping close tabs on a Wyoming-based Bitcoin (CRYPTO: BTC) operation owned by Chinese interests amid fears of potential national security risks.\n\nThe Bitcoin mine, located opposite a Microsoft Corporation data center and near a military base, sparked concerns due to the owners’ connections with China, according to a report by The New York Times.\n\nThe proximity of the operation to key infrastructure has raised fears that it could enable the Chinese government to undertake intelligence operations aimed at the data center and the Francis E. Warren Air Force Base, which houses Intercontinental Ballistic Missiles, or ICBMs.\n\nSee Also: Trump’s Son-In-Law Jared Kushner Says ‘My Hope And Prayers Are’ For Former President’s Reelection In 2024\n\nThe operation came under the radar of the U.S. government after a team at Microsoft submitted a report to the Committee on Foreign Investment in August 2022, noting potential risks. Despite the absence of direct evidence of harmful activities, Microsoft cautioned about possible threats stemming from the operation’s computing power and the presence of Chinese nationals in close proximity to the data center and the missile base.\n\n“Microsoft has no direct indications of malicious activities by this entity,” Microsoft wrote, as per NYT.\n\n“However, pending further discovery, we suggest the possibility that the computing power of an industrial-level cryptomining operation, along with the presence of an unidentified number of Chinese nationals in direct proximity to Microsoft’s Data Center and one of three strategic-missile bases in the US, provides significant threat vectors.”\n\nThe Bitcoin mine in Cheyenne, Wyoming, is one of several owned by Chinese nationals in the U.S. following China’s ban on Bitcoin mining in 2021. The operation in question is linked to multiple companies, including Bit Origin Ltd, previously a pork-processing company registered in the Cayman Islands.\n\nBit Origin’s president, Li Jiaming, maintained that the proximity to Microsoft’s data center or the military base was not a factor in choosing the location. Rather, it was selected because a local utility company agreed to cooperate with Bit Origin.\n\nRead Next: Trump’s Niece Says Her Uncle, Not Jim Jordan, Was ‘BIG Loser’ After Scalise Nominated As House Speaker\n\nPhoto by AlyoshinE on Shutterstock\n\nEngineered by Benzinga Neuro, Edited by Navdeep Yadav\n\nThe GPT-4-based Benzinga Neuro content generation system exploits the extensive Benzinga Ecosystem, including native data, APIs, and more to create comprehensive and timely stories for you. Learn more.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1hZGVpcmEtYW5ub3VuY2VzLWJpdGNvaW4taW5ub3ZhdGlvbi1odWLSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Madeira announces creation of Bitcoin business hub for innovation - Cointelegraph",
        "content": "President of the Regional Government of Madeira, Miguel Albuquerque, has announced plans to create a Bitcoin (BTC) business hub to drive regional innovation. The statement was made during a fireside chat with Prince Filip Karađorđević of Serbia on the second day of Bitcoin Amsterdam 2023.\n\nKarađorđević expressed interest in the new Bitcoin business hub, emphasizing its role in technology development and partnerships, with Albuquerque noting the hub’s origins in Madeira and its inclusive collaboration opportunities.\n\nAccording to Albuquerque, the idea for the Bitcoin business hub started with a group of hard-working professionals and is open to everyone who wants to collaborate. Madeira is an autonomous region of Portugal that has embraced Bitcoin by implementing policies that exempt Bitcoin investors from paying personal income taxes in the region.\n\nAlbuquerque and Prince Filip at Bitcoin Amsterdam 2023 Source: Cointelegraph\n\nKarađorđević commended Madeira’s Bitcoin embrace as a forward-looking technology and a secure, open protocol similar to the internet. A known Bitcoin advocate and the chief security officer of Jan3, the Serbian prince lobbies global lawmakers on the advantages of national Bitcoin adoption.\n\nAccording to the Madeiran president, his government is shifting the region’s economic focus toward technology, high-tech industries, artificial intelligence and Bitcoin.\n\nRelated: What happens if SEC doesn’t appeal Grayscale spot Bitcoin ETF ruling?\n\nDuring the Bitcoin Miami conference in 2022, it was revealed that Madeira would adopt Bitcoin, with residents who invest in BTC being exempt from personal income taxes. Albuquerque stated: “I have faith in the future and in Bitcoin. People in Madeira who engage in buying and selling Bitcoin won’t have tax obligations related to personal income.“\n\nMagazine: The Truth Behind Cuba’s Bitcoin Revolution: An on-the-ground report"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiS2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9ldGhlcmV1bS1iaXRjb2luLTE1LW1vbnRocy1ldGgtcHJpY2UtcmV2ZXJzZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Ethereum losing streak vs. Bitcoin hits 15 months — Can ETH price reverse course? - Cointelegraph",
        "content": "The price of Ethereum’s native token, Ether (ETH), is trading around a 15-month low versus Bitcoin (BTC), and the lowest since Ethereum switched to proof-of-stake (PoS).\n\nWill it continue to weaken for the remainder of 2023? Cointelegraph takes a closer look at the charts.\n\nEthereum price breaks below critical support vs. Bitcoin\n\nThe ETH/BTC pair dropped to as low as 0.056 BTC earlier this week. In doing so, the pair broke below its 200-week exponential moving average (200-week EMA; the blue wave) near 0.058 BTC, raising downside risks further into 2023.\n\nThe 200-week EMA has historically served as a reliable support level for ETH/BTC bulls. For instance, the pair rebounded 75% three months after testing the wave support in July 2022. Conversely, it dropped over 25% after losing the same support in October 2020.\n\nETH/BTC weekly price chart. Source: TradingView\n\nETH/BTC stares at similar sell-off risks in 2023 after losing its 200-week EMA as support. In this case, the next downside target looks to be around its 0.5 Fib line near 0.051 BTC in 2023, down about 9.5% from current price levels.\n\nConversely, ETH price may rebound toward its 50-week EMA (the red wave) near 0.065 BTC if it reclaims the 200-week EMA as support.\n\nBitcoin bull case overshadows Ethereum\n\nEthereum’s persistent weakness versus Bitcoin is reflected in institutional capital flow data.\n\nFor instance, as of Oct. 6, Bitcoin-specific investment funds had attracted $246 million year-to-date (YTD), according to CoinShares. On the other hand, Ethereum funds have lost capital, witnessing outflows worth $104 million in the same period.\n\nNet flows into crypto funds (by asset). Source: CoinShares\n\nThe discrepancy is likely due to growing buzz about a potential spot Bitcoin exchange-traded product (ETF) approval in the United States.\n\nTrade pundits argue that a spot Bitcoin ETF launch will attract $600 billion. In addition, Bitcoin’s fourth halving on April 24, 2024, is also acting as a tailwind versus the altcoin market.\n\nRelated: Bitcoin price gets new $25K target as SEC decision day boosts GBTC\n\nThe halving will reduce the Bitcoin miners’ block reward from 6.25 BTC to 3.125 BTC, a bullish case based on historical precedent that cuts new supply in half.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMid2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvZXhjbHVzaXZlOi1zY2FyYW11Y2NpLW9uLXdoYXQtd2FycmVuLWJ1ZmZldHQtZ2V0cy13cm9uZy1hYm91dC1iaXRjb2luLWRvZXNudC11bmRlcnN0YW5k0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "EXCLUSIVE: Scaramucci On What Warren Buffett Gets Wrong About Bitcoin, Doesn't Understand 'The Whole History Of ... - Nasdaq",
        "content": "SkyBridge Capital founder Anthony Scaramucci invested hundreds of millions of dollars in the digital asset space with a belief the price of assets such as Bitcoin (CRYPTO: BTC) will go up.\n\nIn an exclusive interview, Scaramucci fought back against Bitcoin bears like Warren Buffett.\n\nWhat Happened: Legendary investor Buffett is best known as the CEO of Berkshire Hathaway Inc (NYSE: BRK-A)(NYSE: BRK-B), a conglomerate that owns many companies and invests in multiple public companies.\n\nFor those in the cryptocurrency space, Buffett is familiar as one of the biggest bears of Bitcoin, an asset he once famously called “rat poison squared.”\n\nScaramucci said the bear case by Buffett and others is that Bitcoin is just a cryptograph on the internet, worth nothing, shouldn’t have value and should be banned.\n\n“They really don’t understand the concept and the whole history of money,” Scaramucci said on a recent episode of “The Raz Report.”\n\nScaramucci said paper money is worthless by definition but we ascribe a value to it. Digital in a bank account are worth something and can be sent in wire transfers to pay for items.\n\nThe SkyBridge Capital founder said the world has always had a ledger and put value on items giving them monetary value.\n\n“If you think about it that way, Bitcoin is a fairly perfect ledger.”\n\nScaramucci said Bitcoin is transparent and fully decentralized.\n\nThe 14-year-old history of Bitcoin and increased use of people using it as a payment and the efficiency improvements by the lightning network are also eliminating the thesis from the Bitcoin bears.\n\nScaramucci added the trust and integrity of Bitcoin make it valuable.\n\nRelated Link: Exclusive: Yusko Calls Out Warren Buffett, The Reason Warren Wants To P*** On Bitcoin Is...\n\nWhat’s Next: In the interview, Scaramucci shared he believes the pending launch of Bitcoin ETFs could serve as a catalyst to take the price of Bitcoin higher in 2024.\n\n“If I’m right, we could be sitting at $150k, $250k Bitcoin,” Scaramucci said.\n\nScaramucci praised the “finite supply” of Bitcoin and also considered it a potential hedge against the future devaluing of the U.S. dollar.\n\nWhile Buffett may be critical of Bitcoin and its future, one of his portfolio holdings is betting on the continued growth of digital banking and making it easier for customers in Latin America to trade cryptocurrency.\n\nAs previously shared by Benzinga, Buffett is a holder of stock in Nu Holdings Ltd (NYSE: NU), which gives him exposure to an asset he absolutely despises.\n\nRead Next: Exclusive: Mark Yusko On Bitcoin's Future, 2024 Price Target\n\nMeet and engage with transformative Digital Asset and Crypto business leaders and investors at Benzinga's exclusive event: Future of Digital Assets. Tickets are flying: Get yours! Watch the full interview with Anthony Scaramucci below.\n\nRead Next: EXCLUSIVE: Anthony Scaramucci Says Bitcoin Could Hit $150K To $250K On BTC ETF Launch\n\nPhoto: Jdarsie11, CC BY-SA 4.0 via Wikimedia Commons\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nProfit with More New & Research. Gain access to a streaming platform with all the information you need to invest better today. Click here to start your 14 Day Trial of Benzinga Professional\n\nThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLTI1ay10YXJnZXQtc2VjLWRlY2lzaW9uLWJvb3N0cy1nYnRj0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin price gets new $25K target as SEC decision day boosts GBTC - Cointelegraph",
        "content": "Bitcoin (BTC) ranged around the key $26,800 mark for a second day on Oct. 13 with a decision due in United States regulators’ battle with crypto investment giant Grayscale.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin lurks between major liquidity clouds\n\nData from Cointelegraph Markets Pro and TradingView confirmed that the BTC price barely changed from the day prior, acting in a narrow corridor.\n\nBitcoin market analysts weighed potential catalysts, among these the U.S. Securities and Exchange Commission (SEC) choosing whether or not to appeal a court ruling over its refusal to allow a Bitcoin spot exchange-traded fund (ETF).\n\n“Today is an important day with the SEC Appeal on the Grayscale ruling,” Michaël van de Poppe, founder and CEO of MN Trading, wrote in part of an X (formerly Twitter) post.\n\n“If nothing happens, we might be seeing a case where Bitcoin reverses upwards in the coming weeks. I'm positioned long.”\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/X\n\nMacro data prints were due to take a break following a series of releases throughout the week, which all showed inflation more persistent than market expectations had predicted.\n\nSummarizing possible BTC price trajectory from here, popular trader and analyst Credible Crypto saw cause for modest optimism.\n\n“We have a very clear and seemingly controlled ‘stairstep’ down on price here. Clear low timeframe breakdowns, retests, and continuation,” he explained alongside a chart.\n\n“We are leaving behind equal lows right below us, so ideally I’d like to see these cleaned up before a reversal. Considering we have bids stacked above and below us, a push to the local highs into asks followed by a rejection and sweep of our lows into the waiting bids and local demand seems like the perfect way to form a reversal here. Let’s see how things develop.”\n\nBTC/USD annotated chart. Source: Credible Crypto/X\n\nFellow trader Daan Crypto Trades noted BTC/USD moving within a zone between two liquidity clouds, with a reaction more likely should the spot price reach either one.\n\n#Bitcoin Liquidation Map\n\n\n\nBig zones at $26.5K & $27K. Would expect some sort of ssqueeze to occur at those areas. pic.twitter.com/VW6YYPkMe4 — Daan Crypto Trades (@DaanCrypto) October 13, 2023\n\nTrader and analyst Rekt Capital meanwhile placed a target of $25,000 on Bitcoin should bulls fail to reclaim exponential moving averages (EMAs) lost through the week.\n\n#BTC\n\n\n\nNeeds to reclaim at least one of these EMAs as support to avoid a drop into the $25k-$26k area$BTC #Crypto #Bitcoin pic.twitter.com/ywRkdM07uw — Rekt Capital (@rektcapital) October 12, 2023\n\nGBTC claws back more lost ground\n\nAhead of the appeal deadline, Grayscale’s flagship investment fund, the Grayscale Bitcoin Trust (GBTC), continued to outperform.\n\nRelated: Did SBF really use FTX traders’ Bitcoin to keep BTC price under $20K?\n\nThe focus of the legal proceedings, GBTC will end up as a spot ETF, Grayscale has said, with an early victory for the firm seeing its fortunes turn around through Q2.\n\nOn Oct. 11, GBTC hit its smallest discount to net asset value — the Bitcoin spot price — since December 2021.\n\nThe discount, technically a negative premium, reached -16.44% before dipping slightly lower, per data from monitoring resource CoinGlass.\n\nGBTC premium vs. asset holdings vs. BTC/USD chart (screenshot). Source: CoinGlass\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 26,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZWMtd29udC1hcHBlYWwtY291cnQtZGVjaXNpb24tb24tZ3JheXNjYWxlLWJpdGNvaW4tZXRm0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "SEC reportedly won't appeal court decision on Grayscale Bitcoin ETF - Cointelegraph",
        "content": "The United States Securities and Exchange Commission reportedly has no plans to appeal the recent court decision that favored Grayscale Investments. The ruling requires the SEC to review the firm’s spot Bitcoin (BTC) exchange-traded fund (ETF) application.\n\nBenzinga (and others) reporting that Reuters is reporting that the SEC will NOT be appealing Grayscale case. pic.twitter.com/yd9BBtRwv5 — Eric Balchunas (@EricBalchunas) October 13, 2023\n\nThe SEC’s supposed decision not to appeal the U.S. Court of Appeals for the District of Columbia Circuit ruling was highlighted in an Oct. 13 report from Reuters, which cited “a source familiar with the matter.”\n\nBloomberg analysts also expect the SEC not to appeal to the Supreme Court but emphasized that this doesn’t necessarily mean Grayscale’s application is set to be approved.\n\nIf the reports are true, the SEC will need to follow the court’s August order and review Grayscale’s application to change its Grayscale Bitcoin Trust into a spot Bitcoin ETF.\n\nAccording to Reuters, the appeals court is expected to issue a mandate specifically outlining how its ruling should be “executed” by the SEC.\n\nCommenting on the developments, Bloomberg ETF analyst James Seyffart stated via X (formerly Twitter) that:\n\n“I do not think they will appeal to the Supreme Court either. Dialogue between Grayscale and SEC should begin next week. Hoping for more info on next steps sometime next week or week after?”\n\n1. Done deal I guess if this is accurate. No en banc application\n\n\n\n2. No. I do not think they will appeal to the Supreme Court either.\n\n\n\n3. Dialogue between Grayscale and SEC should begin next week. Hoping for more info on next steps sometime next week or week after? https://t.co/2EayzqeKGq — James Seyffart (@JSeyff) October 13, 2023\n\nMoving forward, Seyffart suggested that it is likely that “we will find out in the next week (or two)” what the deadline is for the SEC to approve or deny Grayscale’s spot Bitcoin ETF application.\n\nIf the SEC were to deny the application, Grayscale could then appeal that decision, dragging the process out even longer.\n\nRelated: Bitcoin price gets new $25K target as SEC decision day boosts GBTC\n\nAround seven spot Bitcoin ETF applications have been put before the SEC and are awaiting a decision from the regulator.\n\nIn a separate preceding X post on Oct. 13, Seyffart reiterated his view that there is a 90% chance that a spot Bitcoin ETF application will get approved in January 2024, specifically the application from Cathie Wood’s ARK Invest.\n\nI've gotten a lot of questions regarding my current view on Spot #Bitcoin ETFs over the last couple weeks. This is the first section of the note I put out yesterday with @EricBalchunas.\n\n\n\nTLDR: Our view hasn't changed much https://t.co/dRAm5IsdQf pic.twitter.com/Htsi3n2XxV — James Seyffart (@JSeyff) October 13, 2023\n\nSeyffart and Bloomberg’s senior ETF analyst, Eric Balchunas, also previously suggested a 75% chance that an application will get approved in 2023.\n\nMagazine: Hall of Flame: Crypto lawyer Irina Heaver on death threats, lawsuit predictions"
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvY29pbmtpdGVzLW5ld2VzdC1iaXRjb2luLWRldmljZS1jYW4tc2VydmUtYXMtYS1saWdodG5pbmctd2FsbGV0LWFuZC1ub3N0ci1jbGllbnTSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Coinkite's Newest Bitcoin Device Can Serve As A Lightning Wallet And Nostr Client - Nasdaq",
        "content": "Satslink looks similar to the Coldcard Q1, but internally it's completely different. Coinkite\n\nCoinkite has announced their latest product, Satslink. The under-production device sits at the intersection of many different areas of communications and mobile hardware, empowering developers to build a whole slew of different applications.\n\nRather than leaning on an opinionated framework, Satslink leverages open and flexible hardware enclosed by the Coldcard Q1’s exterior to bring variety and flexibility to developers. Those in possession of this device can choose what to do with it, and let their builder mentalities run wild on the many different possibilities the piece of hardware can offer.\n\nAt its core, Satslink is a peer-to-peer, hackable multi-purpose device. It features a secure element, as typical of Coinkite products, allowing the user to securely store private keys within the device. While it shares the external design with the Coldcard Q1, the internals are totally different from the company’s latest hardware wallet. Instead of focusing on air gapped security, the Satslink aims to bring secure communications to the day to day in ways that few would’ve considered possible.\n\n“Being dissatisfied with the connected and DIY options, we felt the need to create a better hot platform,” NVK, founder at Coinkite, told Bitcoin Magazine. “Bitcoin is expanding scripting/mpc options and we now have Nostr. Someone had to make a good connected and portable device for developers and enthusiast to create the next generation of freedom functionality.”\n\nSatslink leverages ESP32-S3, a low-power MCU-based system on a chip (SoC) with integrated 2.4 GHz Wi-Fi and Bluetooth Low Energy (Bluetooth LE). It consists of high-performance dual-core microprocessor (Xtensa® 32-bit LX7), a low power coprocessor, a Wi-Fi baseband, a Bluetooth LE baseband, RF module, and numerous peripherals. Satslink is programmed in micropython, with its source fully-available, and it is completely field upgradable with no locked-down ROM areas. Coinkite’s product also features a MicroSD slot for data transfer.\n\nSatslink seems to join together many different fields in bitcoin, technology and communications. Coinkite\n\n“The initial target is developers and enthusiasts,” NVK said. “But, because of the consumer friendly form factor, they will be able to start using anything the community creates. Like hot and sovereign lightning wallets and Nostr clients!”\n\nNostr, the open communications protocol that went viral after Block CEO and Twitter founder Jack Dorsey started endorsing and funding the project, is top of the list of possible use cases for Satslink. Given its peer-to-peer communication capabilities, Satslink can be used as a Nostr client, and since it can also work as a relay, one could send and receive messages as Nostr posts without those ever hitting the internet. Imagine a localized Nostr made up of many Satslink devices talking to each other through a sort of mesh network instead of the open web. That could be possible with this device.\n\nAnother interesting use case that many bitcoiners could relate to is having a sovereign controller for their home-based bitcoin stack. As some bitcoiners run bitcoin nodes and sometimes even self-hosted servers at home, one could program the Satslink to connect to their home stack on demand and perform desired actions remotely and securely given its networking capabilities. Satslink could be used to run a transaction coordinator, for instance, or be used as a whole wallet –– though Coinkite doesn’t recommend using the Satslink as your go-to cold storage solution for large bitcoin amounts.\n\nSatslink’s communication features also boast NFC and a QR code reader, enabling even more use cases for its eventual users. Notably, this combination paired with Satslink’s versatility and programmability could even be used to turn it into a hardware wallet of another manufacturer. Whether that’s desirable or not, truth is it could be possible to turn a Satslink into Blockstream’s JADE wallet or other similar DIY hardware wallets.\n\nWhile the possibilities are endless, what users actually build with this product remains to be seen. Coinkite’s device is currently available to preorder on the company’s website at a $189 price tag, and it is still unclear when the product will start shipping to buyers."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMijgFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8xMC8xNC9iaXRjb2luLWxpZ2h0bmluZy1uZXR3b3JrLXNlZXMtMTIxMi1ncm93dGgtaW4tcm91dGVkLXRyYW5zYWN0aW9ucy1pbi10d28teWVhcnMtYWNjb3JkaW5nLXRvLWJ0Yy10ZWNoLWNvbXBhbnkv0gGSAWh0dHBzOi8vZGFpbHlob2RsLmNvbS8yMDIzLzEwLzE0L2JpdGNvaW4tbGlnaHRuaW5nLW5ldHdvcmstc2Vlcy0xMjEyLWdyb3d0aC1pbi1yb3V0ZWQtdHJhbnNhY3Rpb25zLWluLXR3by15ZWFycy1hY2NvcmRpbmctdG8tYnRjLXRlY2gtY29tcGFueS9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 14 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin Lightning Network Sees 1,212% Growth in Routed Transactions in Two Years, According to BTC Tech Company - The Daily Hodl",
        "content": "The Lightning Network has seen massive transaction growth in the past two years despite Bitcoin’s (BTC) bearish price action, according to a BTC technology company.\n\nRiver, a company that offers Bitcoin brokerage and custody services, looked at data from the operators of nodes comprising 52% of the public capacity on the Lightning Network, a layer-2 solution for BTC that aims to address scalability issues.\n\nRiver estimates a lower bound of 6.6 million routed Lightning transactions this August, noting that the upper bound estimate could be several times that number but isn’t quantifiable because there wasn’t data available for transactions between only two participants or private transactions. Routed transactions involve more than two nodes.\n\nExplains the firm,\n\n“This represents a 1,212% increase since the 503,000 Lightning payments estimate for August 2021 by K33 (formerly Arcane Research). This growth was despite a 44% Bitcoin price drop and a 45% decrease in search interest. It is the equivalent of 2.5 transactions per second (TPS), compared to Bitcoin’s on-chain average of 4.4 TPS and K33’s August 2021 benchmark of 0.2 TPS.”\n\nGaming, social media tipping and streaming are behind 27% of the network’s transaction growth, according to River.\n\nThe firm also notes that the Lightning Network is processing at least 47% of Bitcoin’s on-chain transactions on a daily basis.\n\nAt time of writing, Bitcoin is trading for $26,892.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nGenerated Image: Midjourney"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZGVjcnlwdC5jby8yMDE0NjQvd2hhdC1oYXBwZW5zLWlmLXNlYy1kb2VzbnQtYXBwZWFsLWdyYXlzY2FsZS1iaXRjb2luLWV0Zi1ydWxpbmfSAV5odHRwczovL2RlY3J5cHQuY28vMjAxNDY0L3doYXQtaGFwcGVucy1pZi1zZWMtZG9lc250LWFwcGVhbC1ncmF5c2NhbGUtYml0Y29pbi1ldGYtcnVsaW5nP2FtcD0x?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "What Happens If the SEC Doesn't Appeal Grayscale Bitcoin ETF Ruling? - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nAfter 45 days, the Securities and Exchange Commission has mere hours remaining before a recent court decision in favor of Grayscale becomes final at midnight. So far, the SEC hasn’t said a word about it.\n\nOn August 29, a federal court ruled that the SEC was being “arbitrary and capricious” in rejecting Grayscale’s bid to convert its Grayscale Bitcoin Trust (GBTC) into a spot Bitcoin ETF, while approving similar futures Bitcoin ETFs.\n\nOn Friday, Bloomberg ETF analyst Eric Balcunas predicted that the SEC won’t appeal the decision—though he pointed out there’s still time. He didn't immediately respond to a request for comment from Decrypt.\n\nAD\n\nAD\n\nNada. Which means no appeal. Day not over yet tho. — Eric Balchunas (@EricBalchunas) October 13, 2023\n\nThe application to convert the GBTC to a spot Bitcoin ETF won’t automatically be approved if the SEC takes no action before midnight. Instead, the court will likely follow up with a mandate regarding how to respond to its ruling. For the SEC, that could mean revisiting the application and finding different justifications for its denial or simply approving Grayscale’s application.\n\nAs the deadline approached, GBTC shares were changing hands at $20.24, up a modest 1% in the past 24 hours. Approximately 2.2 million shares have moved in the past 24 hours—which is nothing compared to the almost 20 million shares that were traded the same day a judge handed Grayscale its court victory.\n\nWhen markets closed on October 12, Grayscale held $24.00 worth of Bitcoin (BTC) per GBTC share, according to the firm’s website. On Friday, GBTC shares traded for $20.24 apiece, indicating a share discount of roughly 15%.\n\nThe discount is the difference between the total market value of all outstanding GBTC shares, and the net asset value of all Bitcoin held by Grayscale.\n\nAD\n\nAD\n\nAs a spot Bitcoin ETF, shares of GBTC would be directly redeemable for the BTC held by Grayscale. Therefore, approving its conversion would immediately bring Grayscale’s share value up to parity with the value of its Bitcoin, creating a significant windfall for investors.\n\nThe SEC has for years rejected every spot Bitcoin ETF application to arrive on its doorstep. As doubts about Grayscale’s odds of successful conversion took hold, its share discount drifted as low as 48% in December 2022.\n\nThe GBTC discount narrowed after investment giant Blackrock filed to list an equivalent product in June, given the asset manager’s near-perfect success streak with the SEC. It shrank again after Grayscale’s SEC lawsuit proved successful.\n\nThe SEC also lost on most fronts in its lawsuit against Ripple, after Judge Analisa Torres ruled in July that XRP transactions on crypto exchanges are not securities transactions. Last week, the judge rejected the agency’s attempt at appeal.\n\nGrayscale is also attempting to convert its Ethereum Trust into a spot Ethereum ETF after the SEC approved the first futures Ethereum ETFs earlier this month."
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMic2h0dHBzOi8vd3d3Lm5hc2RhcS5jb20vYXJ0aWNsZXMvcGllY2luZy10b2dldGhlci10aGUtcHJlLWhpc3Rvcnktb2YtYml0Y29pbi13aXRoLWFhcm9uLXZhbi13aXJkdW1zLXRoZS1nZW5lc2lzLWJvb2vSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Piecing Together The Pre-History Of Bitcoin With Aaron van Wirdum's 'The Genesis Book' - Nasdaq",
        "content": "“Contrary to popular belief, Bitcoin did not appear out of nothing. For decades prior to Satoshi Nakamoto introducing his invention, a diverse group of computer scientists, privacy activists, and heterodox economists tried to create a digital form of money that could operate independently of government control. The Genesis Book tells the story of the people and projects that inspired the invention of the world's first successful peer-to-peer electronic cash system.”\n\n-Cover Sypnosis\n\nAaron van Wirdum’s long awaited book goes through the pre-history of everything that led up to the creation of Bitcoin. So many individual ideas and concepts went into the creation of Bitcoin that people tend to forget the history of those pieces before Satoshi glued them together into the Bitcoin protocol we know today.\n\nThe Genesis Book gives the readers a long walk through the history of both the people and cultural movements spawned out of the early rise of the hacker community, and how these cultural movements and their respective ethoses shaped the technologies themselves that were produced. The ethos and mentality of the members of early counter-culture groups like the cypherpunks and extropians laid the ideological foundation of the cultures we see thriving in Bitcoin today.\n\nThese same people also laid the technical foundations Bitcoin itself was built upon, through early attempts at digital cash systems like David Chaum’s ecash, to Wei Dai’s b-money. Concepts like Adam Back’s Hashcash and Hal Finney’s Reusable Proof of Work (RPOW) also began the slow road towards Bitcoin’s proof of work consensus system.\n\nFor anyone who wants to truly understand the pre-history of Bitcoin, and the people and technological inventions that laid the groundwork for Satoshi’s gift to us, this book is a must read.\n\n\n\nThe book is available for pre-order here, with shipments expected to go out starting on January 3rd, 2024."
    },
    {
        "id": 34,
        "url": "https://news.google.com/rss/articles/CBMiaGh0dHBzOi8vd3d3LmFmci5jb20vd2VhbHRoL3BlcnNvbmFsLWZpbmFuY2UvdGhlLWJpdGNvaW4tdi1nb2xkLXR1c3NsZS1pcy1qdXN0LWdlYXJpbmctdXAtMjAyMzEwMDktcDVlYXE10gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Gold price, bitcoin price: Why gold and bitcoin bring investors different risks and benefits - The Australian Financial Review",
        "content": "“It’s not my place to say bitcoin is good or bad,” he says. “Bitcoin isn’t a threat to gold because it does different things. If you have gold in your portfolio, somewhere between 5 and 10 per cent, it increases your risk-adjusted returns, protects against shocks, negates market falls, and is a genuine diversifier.\n\n“If you had bitcoin in your portfolio over the last five years it has done very well, but it hasn’t been a diversifier. What it’s done is add massively to your risk, especially equity risk, so it’s like doubling up on tech stocks, or buying the Nasdaq with leverage.\n\n“This was demonstrated perfectly when the Fed started to hike rates in 2022, tech stocks got clobbered and bitcoin got slapped. So, I don’t see bitcoin as a competitor to gold.”\n\nBitcoin was invented in 2009 to harness blockchain technology to buy goods and services via online transfers without the need for bank accounts.\n\nHowever, it quickly snowballed into a synthetic asset price bubble promoted by a mishmash of stakeholders who organised themselves over social media and the internet.\n\nAdvertisement\n\nThis has helped it thump gold’s returns over the past 14 years and its supporters believe its capped supply of 21 million coins mean it will continue to rise faster in value than gold.\n\nBut Yermack says these assumptions are based on historical price action, rather than any academic or mathematical fundamentals.\n\n“Whether bitcoin proves a better investment than gold in the future is really anybody’s guess,” he says. “Neither asset has any fundamental properties such as cash flows or property rights connected to it, so their values are based on pure speculation by investors.”\n\nGolden knee-jerk\n\nOther US academics, including Wharton Professor Jeremy Siegel, insist “bitcoin is the new gold for Millennials”, who view it as a superior hedge against central bank money printing and inflation that peaked at 7.8 per cent in the final quarter of 2022.\n\nThe view that bitcoin works as an inflation hedge is shared by Adrian Przelozny, the founder of crypto exchange Independent Reserve. He says bitcoin will create long-term value for investors due to its fixed supply, although its wild price swings mean it’s unlikely to work as money.\n\nAdvertisement\n\n“Bitcoin’s volatility is a lot higher than gold, but it’s reducing over time and will probably begin to act like a commodity in the next 10 or 15 years,” says Przelozny. “There’s also the halving in bitcoin supply around next May and we’re optimistic that will support prices.”\n\nHowever, gold strategist Read insists investors should understand that gold and bitcoin play different roles in potential wealth creation depending on an investor’s objectives.\n\nThe strategist also advises against buying gold as a kneejerk reaction to headlines around geopolitical conflict such as in Israel.\n\n“Typically, what happens during a geopolitical event is gold spikes and then over the following period when the world doesn’t end it falls back,” he says.\n\n“The only people buying under shock events are those covering shorts [bets on the price falling] and nimble traders who want to profit from very short-term moves in gold. But in general, I say geopolitical conflict isn’t a reason to buy gold, it’s a demonstration of why gold should have been in your portfolio in the first place, as it protects against the unforeseen.”\n\nReade adds he is confident gold’s defensive qualities for conservative investors focused on the long term will shine through, as central banks cut interest rates within 24 months.\n\nAdvertisement\n\n“The next big change in direction for interest rates will be a fall for a number of reasons,” he says. “The US could pull off a soft landing with unemployment a bit higher and inflation coming down to see rates fall. Or the US could tip into recession and rates fall faster, or we get some sort of financial crisis, in which case rates will fall faster than anyone expects, that would be really good for gold.”\n\nToday, the sum of all gold reserves equals $US12.3 trillion ($19.2 trillion), with the metal owned by investors for thousands of years due to its status as a store of value that can also be used for decorative purposes.\n\nBitcoin, on the other hand, has raced to a $US588 billion market value in just 14 years, since its invention as a form of decentralised money by pseudonymous founder Satoshi Nakamoto.\n\nThe cryptocurrency is favoured by younger investors who brush off the risk of capital losses to embrace investments stoked by the two great 21st-century trends of the internet and social media.\n\nOlder investors – often managing larger amounts of capital – tend to prefer the security of gold as a physical safe-haven asset, which rarely crashes in value like bitcoin."
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMifWh0dHBzOi8vd3d3LmFmci5jb20vbWFya2V0cy9lcXVpdHktbWFya2V0cy9ob3ctc2hhcmVtYXJrZXQtYmV0cy10b29rLWFuLW5iYS1sZWdlbmQtZnJvbS1iYXNrZXRiYWxsLXRvLWJpdGNvaW4tMjAyMzA4MjQtcDVkejd50gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Basketballer Matthew Dellavedova on how he ended up spruiking bitcoin - The Australian Financial Review",
        "content": "“In her volleyball team, she was always trying to put the nets on the court when I was still practicing my shooting,” he says. “So, you know, she’d kick me off the court and we kind of started dating like that.”\n\nDellavedova graduated with a psychology degree in 2013. In 2017, he married Anna in what he describes as a “destination wedding” in Milwaukee.\n\nBertie’s menu is scrawled in black felt tip on a large sheet of paper that hangs on giant paper clips next to the butcher’s back door. There are three smoked meat mains to choose from, or a pulled lamb brioche with mint yoghurt.\n\nI order pulled pork and the 190 cm basketball professional chooses beef brisket, with two sides: organic vegetables and salad. He orders a second long black coffee. I ask for a Coke.\n\n“Don’t do that,” Jason replies. “We’ve got organic cola, like a hipster cola if you want.” Hipster cola it is, but maybe I should have stuck with Coke.\n\nHustle like Delly: Cavaliers guard Matthew Dellavedova goes horizontal to keep the ball inbounds against the Golden State Warriors. Frederic J. Brown\n\nAs we wait for the food and drinks, we talk basketball. Dellavedova played for Australia at the London 2012 Olympics, age 21, where the team lost in the quarter-finals to the USA. The following year, however, his dreams of a professional basketball contract were on the line in the NBA Draft, where the 30 NBA teams choose mainly college players, starting with the teams that finished lowest in the previous season.\n\nGetting selected can be life changing. But for Dellavedova, despite dominating in his college years, there would be no pick in the June 2013 draft. The feeling of rejection was tough to take, he says.\n\n“So, I had to work my way through Summer League and go to training camp and just back myself to make it. I had to fight for a spot.”\n\nThe focus and determination paid off. By September, the Cleveland Cavaliers had offered the point guard a starting contract of close to $US500,000 a season.\n\nAdvertisement\n\nIn 2014, things got even more real when the Ohio team that had never won an NBA championship announced the return of superstar LeBron James from the Miami Heat, on an annual salary of more than $US21 million.\n\n“That’s kind of when everything changed for the Cavs,” he says.\n\nJames, who stands at 206cm and goes by the nickname “King James”, soon galvanised his home-town team of Cleveland, and Dellavedova, to reach new heights.\n\nFrom left: LeBron James, Kyrie Irving and Dellavedova. Carlos Osorio\n\n“I remember the first time he came into training camp he got all the players into the video room and went through each player, their strengths, and what they can bring to the team to help us win a championship, and I was just kind of surprised. I was surprised he knew my name, my game, and what I could do, and that was pretty cool,” Dellavedova says.\n\nCleveland, which hadn’t made the top 10 in the previous four seasons, reached the best-of-seven NBA finals in the 2014-2015 season. Dellavedova played all six games against the Golden State Warriors, the star-studded team hailing from San Francisco led by sharp shooter Steph Curry. “I was trying to mark Steph Curry; a tough job. We went up 2-1, but then we lost 4-2,” he says.\n\nIn the 2015-16 season, he says James drove the team into another finals. The opponent was Golden State, again. This time the Warriors raced to a 3-1 series lead and were favourites to win the title once more.\n\nAt that point, Dellavedova says, he just went out and played. He didn’t really think about the occasion, or how far he’d come from Maryborough.\n\n“I was so focused on the job I had to do, I wasn’t thinking about much else, just focusing on watching game tapes, trying to recover, getting my body right, and the game plan to do what I could to help the team win.”\n\nCleveland went on to win three games in a row and snatched the title 4-3. In the process they become the first team to come back from 3-1 down to win an NBA championship.\n\nAdvertisement\n\n“It was not until I looked back and thought, ‘Yeah it was a big deal’,” he grins. “It was an amazing experience and it was really cool to have my family there watching all the games.\n\n“And it was kind of weird, like when I was on the court and they came down before the trophy presentation; you kind of see your whole career or life before you like a movie reel, all the things that went into getting to that moment because they’ve supported me the whole way, and I’m just from Maryborough.\n\n“So, it was pretty cool to celebrate on the court afterwards with them and then in the locker room.”\n\nIt was Cleveland’s drought-breaking title and the tough Australian’s popularity was on show during the hometown victory parade. When the crowd began chanting “Delly”, James said, “He deserves that.\n\n“If there was a bear right here and there was Delly right here and I shot the ball and I was wondering who would get to the ball first, Delly would tear that damn bear up,” James told the crowd.\n\nBy that time Dellavedova knew he would be leaving the Cavaliers and moving to the Milwaukee Bucks on a four-year deal. This time, however, the deal was worth almost $US10 million a year.\n\nBitcoin fan\n\nDellavedova is now playing for Melbourne United after his spell in Milwaukee – “great people, but cold like Cleveland” – a return to Cleveland and a season with the Sacramento Kings. He was recently cut from the Boomers World Cup squad, but has used the time to build his fitness.\n\nHe dispatches the beef brisket and veg, while I wonder how he came to love bitcoin and take a job as a vice president for business development at US bitcoin platform Swan Bitcoin.\n\nAdvertisement\n\nLike millions of Americans, he says he started to trade stocks and options on the Robinhood smartphone app mainly to fight boredom during the COVID-19 lockdowns. The Cleveland team had caught the trading bug and even had a group message chat, where they boasted about winning trades or teased each other over losers.\n\nThe smoked beef brisket with a side of vegetables and salad. Luis Enrique\n\nDellavedova tells me he successfully used options contracts to bet on the sharemarket rising from its COVID-19 lows, but then he made a mistake. He thought the market had topped out and bet on it falling, but it kept rising and he gave back significant paper gains to close out the positions and break even.\n\n“I realised the market was going to keep going up as the government was just printing money,” he says. “So, it’s more important to be smart about where you allocate your money. The most important thing about bitcoin is its fixed supply of 21 million. You can’t print food, you can’t print energy, but the US government is printing money to fund its fiscal deficit and pay $US1.6 trillion interest on its debt and prices are going up.\n\n“So, yeah, I see bitcoin as a store of value and hedge against inflation. I own property and looked at gold – I mean, [goldfield] Sovereign Hill Ballarat was 50 minutes away from where I grew up – but bitcoin is superior.”\n\nHe won’t say exactly how many bitcoin he owns, but admits it’s “significantly more” than his financial advisers and dad think is sensible.\n\nHe even wants to meet Australian superannuation funds to advocate for bitcoin as an asset class in diversified investment portfolios.\n\nPersonally, I’m still nervous about paying the bill in bitcoin and sense Jason behind me, shuttling among the tables, in his backyard idyll. Fortunately, Delly has a plan.\n\nTo pay the bill, Dellavedova tells me to download the Wallet of Satoshi app on my iPhone. Done. Next he uses his iPhone to photograph a QR code in the app on my phone and sends me 197,031 Satoshis (there are 100 million Satoshis to a single Bitcoin), worth $80 that day, via the Lightning Network that sends instant blockchain transfers.\n\nAdvertisement\n\n“The fees are probably cheaper on the Lightning network, too,” he says. “I think that would’ve been a couple of Sats [Satoshis] for the fees. It would’ve been a fraction of a cent to do that versus 0.8 per cent or 1 per cent for a card.”\n\nJason then uses his smartphone to digitally send me the bill of 149,250 Satoshis, which is equal to $61.\n\nA QR code scan later and I’ve paid the bill in bitcoin. Entirely online, with the wealth transfers between Dellavedova, myself, and Jason never touching a bank account.\n\n“See I told you, no need to worry,” Dellavedova says. And, with that, I’m left to ponder the future of money.\n\nThe bill\n\nLittle Bertie’s BBQ Cafe, 218 Swan St, Cremorne, Vic\n\nBeef brisket with vegetables and salad, $23.50\n\nPulled pork with vegetables and salad, $23.50\n\n2 long black coffees, $8\n\nOrganic cola, $6\n\nTotal: $61 (149,250 Satoshis)"
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmFmci5jb20vd2VhbHRoL3N1cGVyYW5udWF0aW9uL2JpbGxpb24tZG9sbGFyLXRpY2tpbmctYm9tYi1mb3Itc21zZnMtYnV5aW5nLWJpdGNvaW4tMjAyMzEwMTMtcDVlYno40gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Fri, 13 Oct 2023 07:00:00 GMT",
        "title": "Bitcoin: Monochrome boss Jeff Yew warns about 'billion dollar ticking time bomb' for SMSFs - The Australian Financial Review",
        "content": "“Instead we see terms such as ‘safe’ and ‘regulated’ being used to suggest a level of safety that is unrelated to the SMSF trustees’ legal obligation to secure legal ownership of the assets.”\n\nMr Yew, former chief executive of cryptocurrency exchange Binance Australia, said the lack of clear regulations around exchanges and custody left SMSF investors in a legal grey area.\n\n“This creates a potential billion dollar ticking time bomb for SMSF trustees investing in crypto assets.”\n\nInfant stages\n\nThe custody issue – precisely who owns a crypto asset – has become a major issue in investment circles after a string of blow-ups.\n\nThe most high-profile involved Bahamas-headquartered FTX, which saw founder Sam Bankman-Fried allegedly drain customer deposits for use in personal trading and venture capital bets. More than 30,000 Australians are embroiled in FTX’s bankruptcy proceedings.\n\nAdvertisement\n\nBrisbane-based super and SMF strategist Darren Kingdon said problems arose because exchanges were not handing over the digital keys, known as “cold storage”.\n\n“It’s still very much in the infant stages,” Mr Kingdon said. “Even on the exchanges, like whose asset is it? Is it verifiably an SMSF asset or not?\n\n“As we’ve seen with a few of the crypto disasters, just because the asset might be in an entity’s name doesn’t necessarily mean it stays that way.\n\n“It also doesn’t prevent wrongdoing of bad actors and bad people in the space.”\n\nBut there are exchanges that cater to SMSF investors and provide guidance for customers about setting up separate private wallets with digital keys.\n\nCrypto remains a small piece of the ballooning $876 billion SMSF sector. Tax data shows crypto investing peaked in September 2021, with more than $1.5 billion parked in digital assets, falling to $950 million in June this year.\n\nAdvertisement\n\n“Crypto and SMSFs are both innately about personal control and that’s what is appealing about them,” said Mat Merlehan from Tax on Chain, an advisory that helps investors with crypto assets.\n\n“However, with personal control comes personal responsibility. You must adhere to the superannuation laws and regulations, which include proper custody of an SMSF’s assets.”\n\nMonochrome Asset Management chief executive Jeff Yew.\n\nMr Yew’s Monochrome has been trying to get two new crypto ETFs approved. He has met with Australian Securities and Investments Commission and the ASX about getting the regulatory green light. The first attempt to launch crypto ETFs fizzled in Australia.\n\nIt’s been part of a global attempt from asset managers to convince regulators of the benefit of ETF products which would give institutional and retail investors potentially safer exposure to crypto markets.\n\nThe US securities regulator has been so-far unwilling to approve any of the several applications for a spot Bitcoin ETF, wary the products do nor protect investors from market manipulation."
    }
]