[
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vd3d3LmZvb2wuY29tL2ludmVzdGluZy8yMDIzLzEwLzAxL3dpbGwtYml0Y29pbi1leHBsb2RlLWluLXZhbHVlLTEta2V5LW1ldHJpYy10by13YXRjL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 01 Oct 2023 07:00:00 GMT",
        "title": "Will Bitcoin Explode in Value? 1 Key Metric to Watch - The Motley Fool",
        "content": "When it comes to Bitcoin (BTC -1.61%), the conventional wisdom is that it is a risky, highly volatile asset prone to sharp price fluctuations. Indeed, for much of its history, Bitcoin has been characterized by very high volatility.\n\nBut that may be changing. Since April, Bitcoin's volatility has been on the decline. In fact, it touched historically low levels in late summer. Bitcoin's future price trajectory could depend on this metric, so let's take a closer look.\n\nBitcoin volatility\n\nBy just about any measure, Bitcoin's volatility (i.e., how much Bitcoin's price fluctuates within a given time period) is trending down and approaching all-time lows. This first became a phenomenon late last year when crypto traders began to complain that Bitcoin was becoming \"boring.\" Instead of seeing massive price swings daily, the price of Bitcoin seemed to move within a very narrow band. And that same trend has persisted into 2023. If you're wondering why Bitcoin has not been able to punch through the $30,000 mark recently or why there's little to no movement after major news events, this is the reason.\n\nIn mid-August, a popular Bitcoin volatility index (known as the BVOL) touched a new low, and some crypto analysts were quick to point out the \"exhaustion and apathy\" for Bitcoin. You can see this on the chart below showing changes in Bitcoin's volatility in 2023:\n\nData by TradingView\n\nBut let's zoom out for a second and see how the current period stacks up against previous historical evidence. This chart shows Bitcoin's volatility since 2016, and it is eye-opening, to say the least. At a glance, you can see how Bitcoin's current volatility is clearly at historical lows. Annualized volatility previously approached 100% to 200% during certain periods, and now it's around 10%:\n\nData by TradingView\n\nIs this the new norm?\n\nOne view about this extraordinary change to Bitcoin volatility is that this is the new norm. As Bitcoin goes increasingly mainstream and as more institutional investors boost their allocation to crypto, Bitcoin could lose some of its volatility. Quite simply, large institutional investors (think pension funds and university endowments) have much longer investment horizons than speculators and traders, and this should help reduce some of the zigs and zags in Bitcoin's price.\n\nThere is some evidence to support this theory beyond just lower volatility figures. For example, the supply of Bitcoin on cryptocurrency exchanges appears to be on the downswing. The basic idea here is that, as more Bitcoin goes off-exchange for secure long-term holding, less Bitcoin can be traded on the major crypto exchanges, and this should reduce volatility.\n\nOr is it the calm before the storm?\n\nHowever, the opposing point of view is that the current period is the proverbial \"calm before the storm.\" Quite simply, this unprecedented period of lower volatility could precede a major spike in volatility as Bitcoin explodes in value. In the past, this has been the pattern with Bitcoin. In two different cases, a prolonged period of relatively low volatility led to Bitcoin skyrocketing in value. Of course, past performance is no guarantee of future performance.\n\nImpact on Bitcoin price targets\n\nVolatility is important because it directly impacts the future price trajectory of Bitcoin. High volatility increases the chances of major price swings, both to the upside and the downside. In short, it's what makes huge Bitcoin rallies possible. These rallies draw in speculators and short-term traders, making Bitcoin even more volatile.\n\nThus, when you hear investors suggesting that Bitcoin could soar to $100,000 or skyrocket to $1 million within a very short period, they are likely assuming that Bitcoin's volatility will eventually return to its previous levels. This is what enables huge price swings over a relatively short period.\n\nBut what if lower volatility is the new norm? Well, then, the chances of Bitcoin spiking to $100,000 anytime soon are very much limited. At this point, it is still too early to say that Bitcoin's volatility is in permanent decline. Crypto has always been a risky, highly volatile asset class, and Bitcoin's current volatility could simply be a historical aberration.\n\nBut maybe it's not, considering all the new institutional money flowing into Bitcoin. So keep your eye on Bitcoin's volatility -- this might end up being one of the biggest factors determining whether or not it can soar in value heading into 2024."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMicmh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA5LTI5L2JpdGNvaW4taXMtZW5kaW5nLXNlcHRlbWJlci13aXRoLWZpcnN0LXF1YXJ0ZXJseS1sb3NzLXRoaXMteWVhctIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Ending September With First Quarterly Loss of 2023 - Bloomberg",
        "content": "As September comes to a close, Bitcoin is poised to end the quarter on a down note in its first quarterly decline this year.\n\nThe largest cryptocurrency by market value is down about 11% since June, and traded at around $26,970 on Saturday in New York. It surged 83% in the first six months of this year, rebounding in part from a 64% plunge seen in 2022 as the digital asset sector was roiled by scandals and bankruptcies."
    },
    {
        "id": 5,
        "url": "https://news.google.com/rss/articles/CBMiWWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy93aWxsLWJpdGNvaW4tdXB0b2Jlci1icmluZy1nYWlucy1mb3ItbWtyLWFhdmUtcnVuZS1hbmQtaW5q0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 01 Oct 2023 07:00:00 GMT",
        "title": "Will Bitcoin 'Uptober' bring gains for MKR, AAVE, RUNE and INJ? - Cointelegraph",
        "content": "After rising about 80% in the first two quarters of 2023, Bitcoin (BTC) fell roughly 11% in the third quarter ending September. However, there is a silver lining for the bulls because they managed a positive monthly close in September, the first since 2016.\n\nBuyers will try to build upon this momentum in October, which has a bullish track record. According to CoinGlass data, only 2014 and 2018 have produced negative monthly returns since 2013 in October. There is no guarantee that history will repeat itself but the data can be used as a good starting point to formulate strategies by traders.\n\nCrypto market data daily view. Source: Coin360\n\nThe recent strength in Bitcoin has also boosted interest in altcoins. Select altcoins are trying to break above their respective overhead resistance levels, indicating the start of a robust recovery. The bullish momentum could pick up further if Bitcoin extends its relief rally to $28,000.\n\nNot all altcoins are expected to blast off to the upside. The cryptocurrencies that are showing strength are the ones that may lead the recovery higher. Let’s study the charts of the top-5 cryptocurrencies that could outperform in the near term.\n\nBitcoin price analysis\n\nBitcoin has been trading above the moving averages since Sep. 28, which is a positive sign. This shows that the advantage is gradually tilting in favor of the buyers.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe bears are trying to stall the rally near $27,500 but the bulls have not given up much ground. This shows that every minor dip is being purchased. This increases the odds of a break above $27,500. The BTC/USDT pair could then retest the crucial overhead resistance at $28,143. This level may again attract aggressive selling by the bears.\n\nIf the price turns down sharply from $28,143, the pair could retest the 20-day exponential moving average ($26,630). A strong bounce off this level could kick the price above $28,143. The pair may subsequently climb to $30,000.\n\nThis bullish view will be negated in the near term if the price turns down and dives below the solid support at $26,000.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe 4-hour chart shows that the pair is taking support at the 20-EMA. This indicates that the bulls are trying to take charge. However, the bears are unlikely to give up easily and they will try to halt the recovery in the zone between $27,300 and $27,500. The sellers will then have to yank the price below the 20-EMA to seize control.\n\nConversely, if bulls pierce the overhead resistance at $27,500, it will pave the way for a possible rally to $28,143. This level may witness a tough battle between the buyers and sellers.\n\nMaker price analysis\n\nMaker (MKR) broke and closed above $1,370 on Sep. 26, indicating the start of a new uptrend. When an asset is in an uptrend, traders tend to buy on dips.\n\nMKR/USDT daily chart. Source: TradingView\n\nThe bears tried to stall the up-move at $1,600 but the bulls purchased the dip at $1,432. This indicates that the sentiment remains positive and lower levels are being bought. If bulls propel the price above $1,600, the MKR/USDT pair could rally to $1,760 and then sprint to $1,909.\n\nContrary to this assumption, if the price turns down sharply and skids below $1,432, it could make room for a retest of the breakout level at $1,370. The bears will have to yank the price below this support to indicate that the uptrend may be over.\n\nMKR/USDT 4-hour chart. Source: TradingView\n\nThe 4-hour chart shows that the bears are fiercely protecting the overhead resistance at $1,600. If bulls want to keep their chances of continuing the uptrend alive, they will have to buy the dips to the 20-EMA.\n\nIf the price snaps back from the 20-EMA, the buyers will once again try to overcome the obstacle at $1,600 and start the next leg of the uptrend. Alternatively, a collapse to $1,432 and then to the 50-simple moving average may begin if the pair drops below the 20-EMA.\n\nAave price analysis\n\nAave (AAVE) is trying to break above the long-term downtrend line, indicating a potential trend change. The rebound off the 20-day EMA ($62.42) on Sep. 28 indicates a change in sentiment from selling on rallies to buying on dips.\n\nAAVE/USDT daily chart. Source: TradingView\n\nThe bears will try to stall the recovery at the downtrend line but if bulls do not allow the price to slip back below the 20-day EMA, it will increase the likelihood of a break above it. The AAVE/USDT pair could thereafter start an up-move toward $88.\n\nThe 20-day EMA is the important support to watch on the downside. If this level cracks, it will suggest that bears remain active at higher levels. That could pull the price down to the 50-day SMA ($58.82).\n\nAAVE/USDT 4-hour chart. Source: TradingView\n\nBoth the upsloping 20-EMA and the relative strength index (RSI) near the overbought zone indicate that the bulls are in command. The rally may face selling at the downtrend line but the bulls will try to arrest the decline at the 20-EMA.\n\nA strong rebound off the 20-EMA will open the doors for a possible rise above the downtrend line. The pair may first rally to $75 and next to $80. The bears will have to sink and sustain the price below the 20-EMA to break the tempo.\n\nRelated: Crypto synthetic assets, explained\n\nTHORChain price analysis\n\nTHORChain (RUNE) has reached the overhead resistance at $2 for the third time within the past few days. The repeated retest of a resistance level tends to weaken it.\n\nRUNE/USDT daily chart. Source: TradingView\n\nIf bulls do not give up much ground from the current level, it will improve the prospects of a rally above $2. If that happens, the RUNE/USDT pair could first rise to $2.28 and subsequently to $2.78.\n\nThis positive view will be invalidated in the near term if the price turns down and plunges below the moving averages. Such a move will suggest that the bulls have given up and the pair may then drop to $1.37.\n\nRUNE/USDT 4-hour chart. Source: TradingView\n\nThe 4-hour chart shows that the bears are selling near the overhead resistance at $2 but a positive sign is that the bulls have not allowed the price to skid and sustain below the 20-EMA. This suggests that lower levels are attracting buyers.\n\nIf bulls push and maintain the price above $2, it will signal the start of a new uptrend. The pair could then surge toward $2.35. On the contrary, if the price turns down and breaks below the 20-EMA, it will indicate the start of a deeper correction to the 50-SMA.\n\nInjective price analysis\n\nInjective (INJ) has been swinging inside a large range between $5.40 and $10 for the past several days. The price action inside a range can be random and volatile but when the boundaries are far apart, trading opportunities may arise.\n\nINJ/USDT daily chart. Source: TradingView\n\nThe moving averages have completed a bullish crossover and the RSI is in positive territory, indicating that bulls have the upper hand. The INJ/USDT pair could first rise to $8.28 where the bears may mount a strong resistance. If bulls overcome this barrier, the pair could pick up momentum and soar toward $10.\n\nIf bears want to prevent the upside, they will have to defend the overhead resistance and quickly drag the price below the moving averages. The pair could then retest the immediate support at $6.36.\n\nINJ/USDT 4-hour chart. Source: TradingView\n\nBoth moving averages are sloping up on the 4-hour chart and the RSI is in the overbought territory, suggesting that the bulls have a slight edge. The rally could reach $8.28 which is likely to act as a strong hurdle.\n\nOn the downside, the first support is at the 20-EMA. A bounce off this level will indicate that the uptrend remains intact. Contrarily, a break below the 20-EMA will signal that the bulls are booking profits. That may pull the price down to the 50-SMA.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMiUWh0dHBzOi8vdGhlY29sbGVnZWludmVzdG9yLmNvbS8xMDY1OS9zby15b3Utd2FudC10by1iZWNvbWUtYS1iaXRjb2luLW1pbGxpb25haXJlL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 01 Oct 2023 07:00:00 GMT",
        "title": "So You Want To Become A Bitcoin Millionaire? - The College Investor",
        "content": "Investing in cryptocurrency and crypto assets is high risk. Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment, and you should not expect to be protected if something goes wrong. Investing in cryptocurrency and crypto assets is high risk. Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment, and you should not expect to be protected if something goes wrong.\n\nThere's an old aviation joke that asks \"How do you make a million dollars in the airline business\"? The punchline (\"Start with two million dollars\") is a bit of hyperbole but there is a kernel of truth to it. Much of the same can be said for investing in Bitcoin and other forms of cryptocurrency. Unless you got in on the ground floor in the early 2010s or get incredibly lucky, you're unlikely to make any life-changing amounts of money in cryptocurrency. In this article, we'll take a look at Bitcoin, what it means to invest in cryptocurrency and some alternatives that have a better track record of historical success.\n\nWhat Is Bitcoin? Because Bitcoin is the oldest and most popular form of cryptocurrency (introduced in 2009), many people use the two terms interchangeably. But Bitcoin is just one form of cryptocurrency — some other forms are Ethereum, Litecoin or Dogecoin. Cryptocurrency is a form of digital currency that is backed by a form of cryptography often referred to as the blockchain. Because of the way that cryptocurrencies are set up, they are nearly impossible to counterfeit. There are a few ways that you can invest in Bitcoin and cryptocurrency. The easiest way to invest in Bitcoin is to simply get a Bitcoin wallet and buy Bitcoins. We recommend Coinbase for U.S. investors – it’s the easiest, links to your bank account, and allows you to buy and sell Bitcoins. Plus, if you open an new account, Coinbase will give you a $5 Bitcoin bonus when you make your first trade! Another way is to If you want to invest in an ETF through your broker, check out the GBTC. This ETF tracks Bitcoin, and you can invest in fractional shares. Another option is mining for Bitcoins, since as long as the markets remain active you can basically make money for nothing. But the problem is, mining is such a tough gig now that it is hardly worth it. Turning your computer into a miner will likely make it noisy and heat up. It would likely take you a long time to even mine a single Bitcoin, by which time you probably would have spent more on electricity. Keep in mind that investing in Bitcoin is incredibly volatile. For almost all people, it is not a good idea to invest the majority of your portfolio in any form of cryptocurrency. If you really want to dabble in crypto investing, set aside a small portion of your investments — only enough that you would be comfortable losing entirely.\n\nWhen You Would Have Needed To Invest in Bitcoin To Be A Millionaire\n\nThe history of Bitcoin is volatile and turbulent. Long gone are the days that you could make a token investment in Bitcoin and become a bitcoin millionaire seemingly overnight. To give you a bit of context:\n\nInvesting $10 in Bitcoin in January 2011 would have turned into $1.2 million by March 2022 .\n\n. You'd have needed to invest $160 in Bitcoin in January 2012, $440 in January 2013 or $24,000 in January 2014 to have that same amount.\n\n\n\nBy January 2018, you'd have needed to invest nearly $450,000 in Bitcoin in order to have $1.2 million today.\n\n\n\nOver the last few years, we've seen a smaller and smaller rise in the price of Bitcoin. This doesn't mean that there isn't money to be made, but gone are the chances you can turn $10 into $1,000,000.\n\nThe \"Risks\" Of Becoming A Bitcoin Millionaire\n\nEven if you had invested in Bitcoin way back then, it would have taken nerves of steel to hold onto it through the year. Looking at the historical BTC chart, you'd have had to survive and hold through several periods where your investment lost nearly 50% of its value within the period of a few weeks.\n\nWith hindsight, it's easy to say that \"it's just $10\" if that's all you invested originally. But would you have been willing to not panic when your Bitcoin portfolio had gotten up near $1M and dropped hundreds of thousands of dollars overnight? Another risk of having all of your money in Bitcoin is finding places that will accept it as payment for goods and services. While it is becoming more and more prevalent to find a business that will accept cryptocurrency as payment, it is still relatively rare. You're not likely to be able to get bread and milk from the corner store by paying with crypto. Instead, you'll have to change your currency, likely incurring additional fees and taxes. Related: How Taxes On Cryptocurrencies Like Bitcoin Works\n\n\n\nAlternatives To Winning Big In Crypto\n\nIf you are an individual of \"normal\" risk tolerance, Bitcoins probably don’t excite you too much. The risk/reward profile of the Bitcoin market is not going to be very appealing to the savvy investor. This is just a chance to either make a quick buck, or lose everything. That is one reason why most savvy investors will keep the majority of their money in reliable investments like index funds. Plus, depending on when you started investing, index funds may outperform Bitcoin anyway. For example, From March 2021 to March 2022, you'd see the following returns: Bitcoin: -21.28%\n\n-21.28% S&P 500: +14.49%\n\nYou would have done remarkably better investing in simple index funds over the last year than Bitcoin.\n\n"
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiXWh0dHBzOi8vZGVjcnlwdC5jby8xOTk2MTMvdGhpcy13ZWVrLWluLWNvaW5zLWV0Zi1oeXBlLWV0aGVyZXVtLWJpdGNvaW4tY2hhaW5saW5rLWJpdGNvaW4tY2FzaNIBY2h0dHBzOi8vZGVjcnlwdC5jby8xOTk2MTMvdGhpcy13ZWVrLWluLWNvaW5zLWV0Zi1oeXBlLWV0aGVyZXVtLWJpdGNvaW4tY2hhaW5saW5rLWJpdGNvaW4tY2FzaD9hbXA9MQ?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Sep 2023 07:00:00 GMT",
        "title": "This Week in Coins: ETF Hype Pumps Ethereum and Bitcoin as Chainlink and Bitcoin Cash Surge - Decrypt",
        "content": "Your Web3 Gaming Power-Up Enjoy exclusive benefits with the GG Membership Pass\n\nDecrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\n\nIllustration by Mitchell Preffer for Decrypt.\n\nWith each passing week, it’s getting easier to talk about crypto’s relative stability compared to its performance in recent history—even just a year ago. A cursory glance at some of the headlines of this column over the year reveals we’ve had more slow news weeks than otherwise in 2023.\n\nHowever, we’ve still come a long way since New Year’s Day, when market leader Bitcoin (BTC) sold for roughly $16.5K. The world’s favorite cryptocurrency begins the last weekend of September at a significantly higher price: $26,972. While that's only 2% higher than last week, it's about 60% more valuable than at the start of the year.\n\nAD\n\nAD\n\nThe market’s biggest contender, Ethereum (ETH), added 4.7% over the last seven days and currently trades for $1,672, or about 40% higher than its New Year's Day price of $1,200.\n\nThis week, the added boost to Ether’s price likely had something to do with the fact that VanEck’s Ethereum Futures Exchange-Traded Fund (ETF) was officially confirmed on Thursday.\n\nETFs are regulated investment products that allow investors to gain exposure to crypto without the risks of directly purchasing and storing it. To date, not a single crypto spot ETF has been approved by the United States Securities and Exchange Commission (SEC). That’s because spot ETFs are tied to the underlying assets, which are so far unregulated, but various Bitcoin and Ethereum futures ETFs that utilize derivatives are currently trading.\n\nOn Thursday, the SEC delayed delivering a verdict on two pending Ethereum spot ETF applications until after Christmas: Ark Invest and VanEck. The agency also announced that it was putting four major Bitcoin spot ETFs on the backburner: BlackRock, Bitwise, Invesco Galaxy Digital, and Valkyrie.\n\nThe only notable price movements among the thirty biggest cryptocurrencies by market capitalization this week were those of Bitcoin Cash (BCH), which rallied 11.8% to $234.13, and Chainlink (LINK), which surged 14% to $7.72.\n\nLINK’s rally was catalyzed by the news that the network has extended cross-chain capabilities to Coinbase’s Ethereum layer-2 network Base. By integrating its Cross-Chain Interoperability Protocol (CCIP) with Base, the two networks can now interact, send messages, transfer tokens, and perform other functions. Chainlink is also the primary oracle for the Base network.\n\nAD\n\nAD\n\nIn other news...\n\nIt was another slow week with relatively few political or institutional developments vis-à-vis crypto regulation and adoption.\n\nOn Monday, Hong Kong’s Securities and Futures Commission (SFC) announced new measures to enhance transparency and security in the cryptocurrency space. The initiative comes as authorities in the semi-autonomous city-state grapple with the JPEX incident: a case of suspected fraud involving a Dubai-based crypto exchange operating in Hong Kong’s turf without licensing.\n\nThere are thought to be at least 2,305 victims of the incident, who collectively have been defrauded of HK$1.43 billion ($182.9 million), making JPEX one of the largest cases of financial fraud in Hong Kong history.\n\nFinally, Stablecoin issuer Circle launched its fiat-backed euro-pegged EURC stablecoin on Stellar, the third blockchain to host the coin after Ethereum and Avalanche."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMihAFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vdGVjaC90ZWNobm9sb2d5L2JpbmFuY2VzLWJpdGNvaW4tdHJhZGluZy12b2x1bWUtZGlwcy00OC1hbWlkLXJlaW50cm9kdWNlZC1mZWVzL2FydGljbGVzaG93LzEwNDA3MTI1Mi5jbXPSAYgBaHR0cHM6Ly9tLmVjb25vbWljdGltZXMuY29tL3RlY2gvdGVjaG5vbG9neS9iaW5hbmNlcy1iaXRjb2luLXRyYWRpbmctdm9sdW1lLWRpcHMtNDgtYW1pZC1yZWludHJvZHVjZWQtZmVlcy9hbXBfYXJ0aWNsZXNob3cvMTA0MDcxMjUyLmNtcw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Sep 2023 07:00:00 GMT",
        "title": "Binance's Bitcoin trading volume dips 48% amid reintroduced fees - The Economic Times",
        "content": "Elevate Your Tech Prowess with High-Value Skill Courses Offering College Course Website Indian School of Business ISB Product Management Visit MIT MIT Technology Leadership and Innovation Visit IIM Kozhikode IIMK Advanced Data Science For Managers Visit\n\nLeading blockchain and cryptocurrency platform Binance has witnessed its Bitcoin (BTC) trading volume drop by 48 per cent this month after the exchange reinstated fees for its most liquid BTC trading pairs.Cryptocurrency market data provider Kaiko research analyst Dessislava Ianeva pointed out that the recorded fall is the second-largest monthly decline since April.\"BTC trade volumes on Binance are down 48 per cent in Sept, the second-largest monthly decline since April. Both drops coincided with the removal of zero fees for the largest BTC trading pairs. However, this time, the decline seems to align more closely with the broad market,\" Ianeva posted on X on Friday.Users left the exchange in April after it cancelled the trading incentives associated with its Binance USD (BUSD) stablecoin due to regulatory issues.The exchange's trading volume had dropped by nearly 70 per cent during the second quarter at the time.A similar situation occurred earlier this month when the exchange discontinued the zero-trading-fee incentives for its TrueUSD (TUSD) and BTC trading pairs, causing traders to migrate to other platforms.While the removal of free trading incentives contributed to Binance's declining volume, the exchange has also faced increased regulatory issues in various jurisdictions, including the US and Europe, which has harmed its overall market share.US regulators sued Binance and its CEO Changpeng Zhao in June this year for allegedly operating a \"web of deception\" and filed 13 charges in a federal court.Binance was also ordered by Belgium's Financial Services and Markets Authority (FSMA) to immediately cease all offers of virtual currency services in the country.Several crypto companies have filed for Chapter 11 bankruptcy in recent months like Genesis Global Trading (a subsidiary of the crypto conglomerate Digital Currency Group (DCG), FTX, BlockFi, Three Arrows Capital, Celsius Network and Voyager."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLWJlc3Qtc2VwdGVtYmVyLXNpbmNlLTIwMTbSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Sep 2023 07:00:00 GMT",
        "title": "Bitcoin price posting best September since 2016 as BTC sellers eye $27.5K - Cointelegraph",
        "content": "Bitcoin (BTC) bulls lost their grip on $27,000 into Sept. 30 as the monthly and quarterly close loomed large.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBitcoin braces for three key candle closes\n\nData from Cointelegraph Markets Pro and TradingView tracked a cooling off for BTC price action ahead of the key September candle print.\n\nThe largest cryptocurrency remained up nearly 4% month-to-date, marking its most successful September since 2016, per data from monitoring resource CoinGlass.\n\nBTC/USD monthly returns (screenshot). Source: CoinGlass\n\nConversely, the quarterly performance for Q3 showed BTC/USD down 11.5% at the time of writing.\n\nBTC/USD quarterly returns (screenshot). Source: CoinGlass\n\nFor traders and analysts, everything could change in the final hours of the monthly candle.\n\n“In the past, a green September resulted in a green October, November and December as well,” popular trader Jelle noted in part of the day’s X analysis.\n\n“Will history repeat?”\n\nThe day prior, Jelle predicted better conditions for Q4, including a breakout past $30,000 for the first time since early August.\n\nAfter months of accumulating coins, and slowly preparing us for the bull market, I think its time.\n\n\n\nExpecting Q4 to bring new strength -- and a break of $30k.\n\n\n\nSend it.#Bitcoin pic.twitter.com/vkl0aq5hRS — Jelle (@CryptoJelleNL) September 29, 2023\n\n“Textbook bearish technicals”\n\nMeanwhile, Monitlonger and shorter timeframes.\n\nRelated: Bitcoin halving to raise ‘efficient’ BTC mining costs to $30K\n\nBeyond the monthly and weekly close, the impending United States government shutdown should continue to suppress BTC price action unless a solution is found in time, it added.\n\nWe are heading into the last #trading day of the month with textbook bearish Technicals from the Key Moving Averages on Daily, Weekly and Monthly TFs and #TrendPrecognition is flashing a new #TradingSignals on the #BTC Daily chart as if it knows we have a looming U.S.… pic.twitter.com/l9Mm2SHyFu — Material Indicators (@MI_Algos) September 30, 2023\n\n“There is a high probability that killer whales will be amping up the weekend whale games around Daily, Weekly, and Monthly candle closes. Don’t get lured into a trap,” part of additional commentary from Material Indicators co-founder Keith Alan read.\n\nA snapshot of the BTC/USD order book on the largest global exchange Binance showed bid liquidity congregating around $26,800. Sellers meanwhile lay in wait at $27,500.\n\nBTC/USD order book data for Binance. Source: Material Indicators/X\n\nOthers, such as popular trader Daan Crypto Trades, expected less volatile conditions until immediately before the new week.\n\n“We’ve had volatility last week but open interest has cooled down so I doubt we’ll get any strange price action until maybe later on Sunday,” he told X subscribers on the day.\n\nAn accompanying chart showed the CME Group Bitcoin futures opening and closing prices potentially acting as a magnet for BTC spot price — a common phenomenon.\n\nBTC/USD annotated chart. Source: Daan Crypto Trades/X\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiSWh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9leHBlY3QtbmV3LWNyeXB0by1yZWd1bGF0aW9ucy1iaXRjb2luLWV0ZnPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sat, 30 Sep 2023 07:00:00 GMT",
        "title": "Expect new crypto regulations to follow Bitcoin ETFs - Cointelegraph",
        "content": "Aside from liquidity, what do institutions bring to crypto? What precisely is their value? This is an instructive question to ponder because there is little consensus on what deeper institutional participation means for an industry that is riven with contradictions.\n\nThe long-running wait for Bitcoin ETF approval — giving pensions and funds exposure to BTC — may well prove to be a positive catalyst for industry growth. But, in focusing on price action, observers are missing out on the real benefit of broadscale institutional adoption. The greatest benefit of deepening institutional adoption may be the regulatory certainty it ushers in.\n\nTax and compliance\n\nThere are a number of areas where institutional involvement is forcing regulators to give straight answers. Chief among these are taxation and compliance. What trades can a business legally make, how should they be disclosed on its balance sheet, and what steps must it take to report these activities?\n\nRelated: Bitcoin ETFs: A $600B tipping point for crypto\n\nDetermining what constitutes a taxable event in crypto depends on your dominion. While United States-based traders are required to calculate profit and loss on every trade on a decentralized exchange, perps position and on-chain events, other countries take a less rigorous approach, while a few don’t bother to tax it at all.\n\n#Bitcoin ETFs will be Delayed until the Final Deadline\n\n\n\nThe SEC is trying to show that they are not interested and attempting to push the dates until the final deadline, even though both the SEC and BlackRock know the inevitable outcome.\n\n\n\nBlackRock's ETF should be the first one… pic.twitter.com/6ZkfUf9WPR — Mags (@thescalpingpro) September 29, 2023\n\nRegardless of where you reside, determining your obligations when buying, selling and storing digital assets can be a headache. But it could be worse: imagine how much more is at stake for businesses whose public accounts must be scrutinized and which typically require permission to list Bitcoin (BTC) on their balance sheet.\n\nThere are good reasons why a higher bar is set for enterprises in terms of compliance, disclosure, reporting and taxation compared to consumers. It’s a primary reason why it’s taken so long for serious institutional adoption to manifest. But as the trickle of financial firms gaining a foothold in the space turns into a flow, the retinue of lawyers and lobbyists in tow has begun to yield dividends. When BlackRock starts beating the drum for a Bitcoin ETF, even the U.S. Securities and Exchange Commission (SEC) has to sit up and take notice.\n\nGrayscale’s favorable court ruling against the SEC on Aug. 29 has shown the power institutions can muster in forcing regulators to renegotiate. The precedent this appeals decision sets will further increase the confidence of institutions in their ability to reframe legislation in their favor.\n\nSeeking regulatory clarity\n\nFor those who already have skin in the game — sole traders, trading firms, family funds and venture capitalists — greater institutional involvement can only be a good thing. When the largest institutions decide they want in, it forces regulators to play ball. Not every provision that’s consequently pushed through the statute books will aid the industry — some will be asinine — but collectively they provide something that’s been missing for years: clarity.\n\nIs Bitcoin a security? What about Ether (ETH) or Solana (SOL)? The answer, at present, depends on who you ask. Some agencies seem intent on declaring everything bar Bitcoin a security; others take a more measured approach, focusing their enforcement efforts on the most egregious token sales and shills.\n\nRelated: 10 years later, still no Bitcoin ETF — but who cares?\n\nInstitutions can’t trade assets that lie in regulatory no man’s land: they need black and white, not shades of gray. Their increasing participation in the market is bound to provide clearer answers in terms of crypto classification, which will benefit the entire industry.\n\nIn addition, greater institutional involvement is legitimizing digital assets by making them less exotic to those tasked with regulating them. Crypto opponents can’t justifiably claim the industry to be a hotbed of money laundering and wash trading when its most active participants include the world’s leading trading firms.\n\nSigns of institutional adoption\n\nToday, businesses and governments are pressing ahead with blockchain-based initiatives such as CBDC pilots. In Asia alone, Hong Kong and the Bank of Japan are exploring programs involving digital currencies.\n\nMeanwhile, banks from the U.S. to Europe are introducing crypto custody and trading services for their clients. And in August, Europe’s first spot Bitcoin ETF listed in Amsterdam, proving that institutional willpower eventually gets things done.\n\nRegulators and institutional players are still catching up in terms of expertise to those who helped build the industry from the ground up in its early days through hands-on participation. No one has complete mastery. But as a rising tide lifts all ships, greater institutional involvement will bring benefit to all players, from the humblest yield farmer to the richest whale. Rather than assume any one group has it all figured out, an open and collaborative dialogue is most likely to lead to positive outcomes. Regulators, institutions and early adopters each offer unique insights.\n\nYou don’t have to thank them, but big institutions are a net positive for the industry. Bigger players produce better rules — and better outcomes for everyone.\n\nGracy Chen is the managing director of the crypto derivatives exchange Bitget, where she oversees market expansion, business strategy, and corporate development. Before joining Bitget, she held executive positions at the Fortune 500 unicorn company Accumulus and venture-backed VR startups XRSPACE and ReigVR. She was also an early investor in BitKeep, Asia's leading decentralized wallet. She was honored in 2015 as a Global Shaper by the World Economic Forum. She graduated from the National University of Singapore and is currently pursuing an MBA degree at the Massachusetts Institute of Technology.\n\nThis article is for general information purposes and is not intended to be and should not be taken as legal or investment advice. The views, thoughts and opinions expressed here are the author’s alone and do not necessarily reflect or represent the views and opinions of Cointelegraph."
    }
]