[
    {
        "id": 0,
        "url": "https://news.google.com/rss/articles/CBMiZGh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDgvMjgvYml0Y29pbi10cmFkaW5nLXZvbHVtZS1pcy1hdC1pdHMtbG93ZXN0LWluLW1vcmUtdGhhbi1mb3VyLXllYXJzLmh0bWzSAWhodHRwczovL3d3dy5jbmJjLmNvbS9hbXAvMjAyMy8wOC8yOC9iaXRjb2luLXRyYWRpbmctdm9sdW1lLWlzLWF0LWl0cy1sb3dlc3QtaW4tbW9yZS10aGFuLWZvdXIteWVhcnMuaHRtbA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin trading volume is at its lowest in more than four years - CNBC",
        "content": "As of Aug. 26, bitcoin trading volume on all exchanges sat at 129,307 BTC, according to CryptoQuant. Earlier in the month, on Aug. 12, it fell to 112,317 BTC, its lowest level since Nov. 10, 2018. It's now off the March high of 3.5 million BTC by about 94%.\n\nAn analysis of CryptoQuant data from both spot and derivatives exchanges shows the total volume of bitcoin held on all exchanges fell earlier this month to its lowest level since 2018 and has struggled to rebound.\n\nBitcoin's trading volume hit its lowest level in almost five years this month as investors keep waiting for reasons to jump back into the market.\n\n\"Trading volumes decrease in bear markets as retail investors leave,\" Julio Moreno, head of research at CryptoQuant, told CNBC. \"This happened during 2022 on most exchanges. As we progress further into a bull market, the trading volume may continue to pick up.\"\n\nThe price of bitcoin is still up 57% for the year and hovering at about $26,100, according to Coin Metrics.\n\nIt's been an excruciatingly quiet summer for bitcoin traders, but seasonality only accounts for so much of it. The U.S. regulatory crackdown on crypto combined with the end of the banking crisis in May (which accounted for much of its year-to-date gains) drove market makers and traders away – and they haven't had a reason to return.\n\nEven after bitcoin's violent sell-off on Aug. 17 — the biggest one-day sell-off since the height of the FTX fallout in November — the market quickly became quiet again. Data shows long-term investors haven't been easily shaken by the recent weakness.\n\n\"Overall, [the] market remained dull waiting for a new catalyst and the overall market liquidity remained scant,\" Bernstein analyst Gautam Chhugani said in a note Monday of the last week in crypto trading. \"This market is not necessarily bearish, but the participants remain disinterested to trade, as the market waits for catalysts\" – specifically, in the form of decisions on any of the spot bitcoin ETF applications in line at the Securities and Exchange Commission.\n\nChhugani said that whatever ends up bringing some movement back to the market, investors' real opportunity \"lies in staying the course into the new market cycle,\" which tends to coincide with the Bitcoin halving. The next one is expected to take place in spring of 2024. Cantor Fitzgerald echoed that emphasis on the long game.\n\n\"Although near-term catalysts may take many forms, we continue to believe in the long-term story of ongoing crypto adoption and bitcoin's staying power as an alternative asset and store of value,\" Cantor Fitzgerald analyst Josh Siegler said in a note Monday.\n\n—CNBC's Michael Bloom contributed reporting.\n\nCorrection: On Aug. 12, bitcoin trading volume fell to 112,317 BTC, its lowest level since Nov. 10, 2018. An earlier version of the story misstated the low and when the prior low occurred."
    },
    {
        "id": 1,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMjgvYml0Y29pbi10cmFkZXJzLXJlbWFpbi1mZWFyZnVsLW9mLXRhaWwtcmlzay1hbWlkLXJlbmV3ZWQtcHJpY2UtbHVsbC1vYnNlcnZlcnMv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOC8yOC9iaXRjb2luLXRyYWRlcnMtcmVtYWluLWZlYXJmdWwtb2YtdGFpbC1yaXNrLWFtaWQtcmVuZXdlZC1wcmljZS1sdWxsLW9ic2VydmVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Traders Remain Fearful of 'Tail Risk' Amid Renewed Price Lull: Observers - CoinDesk",
        "content": "Ardern said the tail risk will likely remain higher in the lead-up to Friday's U.S. nonfarm payrolls report. Per Wall Street Journal, the data is likely to show the U.S. economy added 200,000 jobs last month following June's 209,000 additions, resulting in the jobless rate holding steady at 3.6%."
    },
    {
        "id": 2,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTI4L2JpdGNvaW4tYnRjLWV0Zi1kZWFkbGluZXMtbG9vbS1hZ2Fpbi1mb3Itc2VjLWFoZWFkLW9mLWxhYm9yLWRheS13ZWVrZW5k0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin ETF Deadlines Loom Again for SEC Ahead of Labor Day Weekend - Bloomberg",
        "content": "The journey to a potential Bitcoin ETF has so far been long and arduous. But some key decisions in the race are likely coming this week as crypto faithful await to see how things play out this time.\n\nThe US Securities and Exchange Commission is expected to respond to filings from Bitwise, BlackRock, VanEck, WisdomTree and Invesco right before the Labor-Day weekend, according to Bloomberg Intelligence . Regulators can reject, approve or delay. Bitwise’s application is set for consideration by Friday, with the others due the following day, making it likely the SEC will weigh in before the weekend."
    },
    {
        "id": 3,
        "url": "https://news.google.com/rss/articles/CBMijAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8yOC9hbW91bnQtb2YtYml0Y29pbi1zaXR0aW5nLW9uLWNyeXB0by1leGNoYW5nZXMtYXQtbG93ZXN0LWxldmVsLWluLW5lYXJseS1zaXgteWVhcnMtYW5hbHl0aWNzLWZpcm0tc2FudGltZW50L9IBkAFodHRwczovL2RhaWx5aG9kbC5jb20vMjAyMy8wOC8yOC9hbW91bnQtb2YtYml0Y29pbi1zaXR0aW5nLW9uLWNyeXB0by1leGNoYW5nZXMtYXQtbG93ZXN0LWxldmVsLWluLW5lYXJseS1zaXgteWVhcnMtYW5hbHl0aWNzLWZpcm0tc2FudGltZW50L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Amount of Bitcoin Sitting on Crypto Exchanges at Lowest Level in Nearly Six Years: Analytics Firm Santiment - The Daily Hodl",
        "content": "New data from crypto analytics firm Santiment reveals that the supply of Bitcoin (BTC) on crypto exchanges is at its lowest point in over half a decade.\n\nAccording to the market intelligence firm, only 5.8% of the crypto king’s overall supply is currently sitting on crypto exchange platforms, the lowest level since December 2017.\n\nSantiment also notes that the top crypto asset by market cap is seeing decent amounts of Bitcoin whale activity.\n\n“Just 5.8% of Bitcoin is currently sitting on exchanges, which is officially the lowest level crypto’s top market cap asset has seen since December 17, 2017. We are also continuing to see reasonable amounts of BTC whale transactions (57,400 per week).”\n\nSantiment also says that Bitcoin is currently in the lead in terms of being the digital asset with the highest amount of address activity.\n\nBTC is followed by the stablecoin Tether (USDT), smart contract platform Ethereum (ETH), layer-2 blockchain Polygon (MATIC) and BTC alternative Litecoin (LTC), which all have at least more than double the number of active addresses compared to other cryptocurrencies, according to Santiment.\n\nBitcoin is trading for $26,001 at time of writing.\n\nMoving on to Ethereum, the market analytics firm says that the 10 largest addresses associated with the leading altcoin are now holding a staggering 35% of ETH’s overall supply.\n\nAccording to Santiment, the increase in the holdings of large addresses is likely due to smaller investors capitulating their positions out of fear, doubt and uncertainty (FUD) surrounding the latest crypto market dip.\n\n“The 10 largest addresses on the Ethereum network are now holding over 35% of the available supply. By no means does this mean the [second-largest] asset in crypto is suddenly centralized, but it shows the capitulation of smaller traders showing FUD from this dip.”\n\nAt time of writing, Ethereum is worth $1,649.\n\nDon't Miss a Beat – Subscribe to get email alerts delivered directly to your inbox\n\nFollow us on Twitter Facebook and Telegram\n\nDisclaimer: Opinions expressed at The Daily Hodl are not investment advice. Investors should do their due diligence before making any high-risk investments in Bitcoin, cryptocurrency or digital assets. Please be advised that your transfers and trades are at your own risk, and any loses you may incur are your responsibility. The Daily Hodl does not recommend the buying or selling of any cryptocurrencies or digital assets, nor is The Daily Hodl an investment advisor. Please note that The Daily Hodl participates in affiliate marketing.\n\nFeatured Image: Shutterstock/Sensvector/lassedesignen"
    },
    {
        "id": 4,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYW5jZS55YWhvby5jb20vbmV3cy9yb2Jpbmhvb2QtcmV2ZWFsZWQtdGhpcmQtbGFyZ2VzdC1iaXRjb2luLTEwMDIzNjI2My5odG1s0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Robinhood Revealed to Be Third-Largest Bitcoin Holder With $3B in BTC - Yahoo Finance",
        "content": "Investing and trading platform Robinhood (HOOD) holds over $3 billion in bitcoin (BTC) in a single wallet that attracted the holdings over several months, wallet data from Arkham Intelligence shows. This makes it the third-largest bitcoin holder behind crypto exchanges Binance and Bitfinex, which hold $6.4 billion and $4.3 billion worth of tokens on single wallets respectively.\n\nThe wallet previously gained notoriety among market watchers in the past few months as the identity of its owners sparked conversations and concerns about who the mysterious owner of such a large amount of bitcoin could be.\n\nAs of Monday, Robinhood has not publically commented on these holdings.\n\nThe transfers sparked speculations ranging from the bitcoin holdings belonging to financial behemoth BlackRock, which filed for a Bitcoin ETF earlier this year, to crypto exchange Gemini shifting its users’ holdings to a wallet.\n\nRobinhood transferred some 118,300 bitcoin to the wallet from several other smaller wallets over a three-month period, data shows. The firm told CoinDesk that it custodies all customer assets, including bitcoin.\n\nAll of these holdings are held on the Bitcoin blockchain. The first transactions were made on March 8, after which huge amounts of bitcoin were transferred until July 14, data from BitInfoCharts show.\n\nMeanwhile, the holdings shed light on the extent of Robinhood’s bitcoin exposure despite low crypto trading volumes on its platform.\n\nRobinhood reported crypto trading revenue of just $31 million in the second quarter, down 18% from the $38 million in the first quarter, according to its latest earnings release. The figures were 16% of the $193 million in trading revenue across all categories, which saw a 7% sequential decline, as previously reported.\n\nCorrection (23:00 UTC 8/28/2023) A previous version of this article stated that Robinhood custodies assets with Jump Trading."
    },
    {
        "id": 6,
        "url": "https://news.google.com/rss/articles/CBMibWh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vZm9yZXgvcm9iaW5ob29kLXNpdHMtb24tYS0zYi1iaXRjb2luLWdvbGRtaW5lLWRlc3BpdGUtY3J5cHRvLXRyYWRpbmctZGVjbGluZS_SAXFodHRwczovL3d3dy5maW5hbmNlbWFnbmF0ZXMuY29tL2ZvcmV4L3JvYmluaG9vZC1zaXRzLW9uLWEtM2ItYml0Y29pbi1nb2xkbWluZS1kZXNwaXRlLWNyeXB0by10cmFkaW5nLWRlY2xpbmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Robinhood Sits on a $3B Bitcoin Goldmine despite Crypto Trading Decline - Finance Magnates",
        "content": "Robinhood, the commission-free brokerage, holds over 118,000 Bitcoin (BTC) worth more than $3 billion, according to data from Arkham Intelligence, a blockchain analytics company. This makes the brokerage owner the third-largest BTC address after cryptocurrency exchanges, Binance and Bitfinext, data from another firm, BitInfoCharts, shows.\n\nRobinhood Unmasked as Third Largest Bitcoin Holder\n\nAccording to BitInfoCharts, a Binance cold wallet address with over 249,000 BTC, which is worth approximately $6.5 billion (at the current market price) is the largest single BTC wallet. This is followed by Bitfinex’s cold wallet that currently holds over 178,000 BTC, which is worth about $4.7 billion. Another Binance cold wallet with over 115,000 BTC worth $3 billion comes in fourth after Robinhood.\n\nSource: BitInfoCharts\n\nThe attribution of Robinhood to the BTC address occurred after months of online speculation about the owner of the BTC holding. Previously, spectators attributed the address to Gemini, a crypto exchange, and BlackRock, the world’s largest asset manager. In June, BlackRock’s submission for a crypto exchange-traded fund with the US Securities and Exchange Commission inspired a flurry of similar applications by other firms in the industry.\n\nThis unknown address has accumulated over $3 Billion worth of #Bitcoin in the last 3 months.\n\n\n\nThe prime suspect?\n\n\n\nThe first major transaction of 3400 BTC occurred on May 16th 2023. Almost exactly 1 month later on June 15th 2023, BlackRock filed for it's spot #Bitcoin ETF. pic.twitter.com/TdFuUkELuH — DivXMaN (@crypto_div) August 21, 2023\n\nGemini has transferred bitcoins to the new address bc1q....59v2 in the past 3 months. It currently holds 118,000 bitcoins, or about 3.08 billion U.S. dollars. It is currently the third largest bitcoin holder. The first and second largest Bitcoin addresses are Binance Cold Wallet… — Wu Blockchain (@WuBlockchain) August 22, 2023\n\nShrinking Crypto Trading Volume\n\nMeanwhile, data on BitInfoCharts’ website shows that BTC was first sent to the address, now attributed to Robinhood, on May 8, 2020. The address reportedly received the last BTC transfer yesterday (Sunday).\n\nHowever, the American online trading provider’s massive build-up of its crypto holding comes at a time when the broker is seeing a decline in digital asset trading on its platform. In July, the total volume of cryptocurrency traded on Robinhood declined 38% to $3.4 billion compared to the $5.5 billion generated during the same month in 2022, Finance Magnates reported.\n\nFurthermore, the firm saw its revenue from cryptocurrency transactions decrease 18% to $31 million during the second quarter of 2023. This is even as the number of monthly active users of the platform dropped a million users to 10.8 million.\n\nNonetheless, Robinhood during the recent quarter posted its fifth consecutive quarter of revenue growth. Specifically, the stock trading platform saw its revenue jump 10% to $486 million during the last quarter. Moreover, the firm generated its first GAAP profitability during the period. This means that the earnings were calculated in line with the generally accepted accounting principles (GAAP).\n\nMeanwhile, while Robinhood recently lost its case against the Massachusetts Secretary of State, Bill Galvin, at the Supreme Judicial Court of Massachusetts, the broker emerged victorious in a legal action initiated by a group of investors who dragged the platform to court over trading restrictions it had imposed during the meme stock frenzy in 2021.\n\nASIC suspends AFS license; FCA warns against 5 fraudulent firms; read today's news nuggets."
    },
    {
        "id": 7,
        "url": "https://news.google.com/rss/articles/CBMiRmh0dHBzOi8vZm9ya2FzdC5uZXdzL2JpdGNvaW4tZGlwcy1iZWxvdy11czI2MDAwLWNyeXB0by1mYWNlcy1wcmVzc3VyZS_SAUpodHRwczovL2Zvcmthc3QubmV3cy9iaXRjb2luLWRpcHMtYmVsb3ctdXMyNjAwMC1jcnlwdG8tZmFjZXMtcHJlc3N1cmUvYW1wLw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin dips below US$26,000, crypto faces downward pressure - Forkast News",
        "content": "Bitcoin fell with most of the top 10 non-stablecoin cryptocurrencies in afternoon trading in Asia on Monday as traders remained cautious after Federal Reserve chair Jerome Powell said at the Jackson Hole Symposium on Friday that tight monetary policy is necessary until inflation slows down significantly.\n\nSee related article: DeFi revenue remains resilient despite Curve Finance hack\n\nBitcoin hungover post-Jackson Hole weekend\n\nBitcoin lost 0.44% to US$25,915 in 24 hours to 4 p.m. in Hong Kong, bringing its weekly losses to 0.36%. The world’s biggest cryptocurrency’s market capitalization fell 0.41% to US$504.7 billion as its trading volume rose 40.10% in the past 24 hours, according to CoinMarketCap data.\n\n“The cryptocurrency market is witnessing a downward trend on Monday, with Bitcoin and most major alternative currencies trading in the red zone,” Rania Gule, market analyst at multi-asset brokerage firm XS.com, said in an emailed statement on Monday.\n\nAccording to Gule, the drop in prices comes after Powell said in his keynote address at the Jackson Hole Symposium that the central bank is prepared to raise interest rates further, if necessary, adding that future decisions would be made with caution.\n\n“Bitcoin prices have been trading within a tight range between US$25,752 and US$26,282 over the past few days. Meanwhile, technical indicators are approaching the overbought zone on both the short and medium-term scales, suggesting a potential upward reversal for Bitcoin,” Gule said.\n\n“However, there won’t be a significant upward movement without a strong breach of the formidable resistance level at US$30,000 and a daily close above it. At the same time, the bearish sentiment still holds sway over Bitcoin and the digital currency market in the short term, with potential targets of US$25,500 and US$25,100, respectively,” Gule added.\n\nAlmost all top 10 non-stablecoin cryptocurrencies dropped in the past 24 hours, except Tron, which gained 0.11% to US$0.07732, and posted a 2.37% rise on the week.\n\nBNB, the native token of world’s largest crypto exchange Binance, lost 0.32% to US$216, although it has gained 0.66% on the week. According to a Wall Street Journal report on Friday, Binance has removed sanctioned Russian banks from its peer-to-peer trading service, and has reportedly ceased processing transactions involving five blacklisted Russian banks.\n\nThe total crypto market capitalization dropped 0.62% to US$1.04 trillion while market volume gained 27.69% to US$18.86 billion in the past 24 hours.\n\nNFT sales may remain low for rest of 2023\n\nThe indexes are proxy measures of the performance of the global NFT market. They are managed by CryptoSlam, a sister company of Forkast.News under the Forkast.Labs umbrella.\n\nThe main Forkast 500 NFT index edged up 0.18% to 2,245.24 in 24 hours to 7 p.m. in Hong Kong, dropping 3.54% in the past seven days. Forkast’s Ethereum and Polygon indexes logged losses while the Solana index gained in the past 24 hours.\n\nAt the same time, the total non-fungible token (NFT) sales volume gained 5.04% to US$10.15 million, according to CryptoSlam data. However, NFT transactions took an 11.84% dip while the number of NFT buyers declined 4.27%.\n\n“Daily sales on Saturday and Sunday failed to cross US$10 million, bringing us down to daily lows we last saw in June of 2021. Weekly sales too fell to a 115-week low with just US$81 million in sales last week,” said Yehudah Petscher, NFT Strategist at Forkast Labs.\n\n“We were heading in this direction anyway. It’s the slower time of the year and additionally weekends are slow,” Petscher explained.\n\nThis weekend, Ethereum-based Bored Ape Yacht Club celebrated the two-year anniversary of the Mutant Apes and hosted a party in Miami.\n\n“This probably took a lot of traders out of action for the weekend, so we’ll see if this week and upcoming weekend bounce back. But I expect us to keep finding fresh new lows for the rest of the year,” he added.\n\nGlobal equities rise after Jerome Powell’s comments; China’s new measures boost market sentiment\n\nImage: Envato Elements\n\nAll major Asian stock markets rose at the end of trading hours on Monday after China introduced new measures to lift its capital markets.\n\nThe world’s second largest economy halved stamp duty on stock transactions to 0.05%, reportedly the first such move since 2008. China also lowered margin requirements for buying securities to 80% from 100%.\n\nChina’s Shanghai Composite and Shenzhen Component Index, Japan’s Nikkei 225, Hong Kong’s Hang Seng, and South Korea’s Kospi all closed the day in the green.\n\n“These policies will only help in the short term, as investors are still concerned about China’s fundamental problems including the property crisis and the economic slowdown,” said Kenny Wen, head of investment strategy at financial services provider KGI Asia, according to a South China Morning Post report.\n\nEarlier this month, Nomura Holdings Inc. lowered this year’s growth forecast for China to 4.6% from an earlier estimate of 5.1%. Morgan Stanley cut China’s 2023 growth forecast to 4.7%, while JPMorgan Chase & Co. lowered its outlook to 4.8%.\n\nU.S. stock futures rose as of 8 p.m. in Hong Kong on Monday, following Fed Chair Powell’s speech at the Jackson Hole Economic Symposium on Friday. The Dow Jones Industrial Average futures, the S&P 500 futures, and the Nasdaq 100 Futures were all in the green.\n\n“The Jackson Hole speech’s cautious tone, in our view, was meant less to suggest that more rate hikes are coming, and more to prevent the market from getting excited about the timing of eventual rate cuts,” Singapore-headquartered DBS said in a research note on Monday.\n\n“Looking at market pricing, there are still some bets on additional rate hikes this year, which we think will prove to be wrong. As for next year’s pricing, we are in line with the view that about 100bps in rate cuts can be expected in 2H24, by which time growth would be substantially lower, along with hardly any risk of inflation rebound,” DBS said.\n\nThe Fed raised its interest rate to between 5.25% and 5.50% in July, the highest level in 22 years.\n\nEuropean bourses gained on Monday, with the benchmark STOXX 600 and Germany’s DAX 40 rising during afternoon trading hours in Europe.\n\nEuropean Central Bank’s President Christine Lagarde said on Friday that the central bank will keep interest rates as high as required for whatever time it takes to bring inflation back to its target.\n\n“In the current environment, this means — for the ECB — setting interest rates at sufficiently restrictive levels for as long as necessary to achieve a timely return of inflation to our 2% medium-term target,” Lagarde said in a speech at Jackson Hole on Friday, according to a Bloomberg report.\n\n(updates with equities section.)"
    },
    {
        "id": 9,
        "url": "https://news.google.com/rss/articles/CBMif2h0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9jb25zZW5zdXMtbWFnYXppbmUvMjAyMy8wOC8yOC90aGUtYml0Y29pbi1jaXJjdWxhci1lY29ub215LWJhdHRsZXMtZW50cmVuY2hlZC1taW5kc2V0cy1pbi1lbC1zYWx2YWRvci_SAYMBaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL2NvbnNlbnN1cy1tYWdhemluZS8yMDIzLzA4LzI4L3RoZS1iaXRjb2luLWNpcmN1bGFyLWVjb25vbXktYmF0dGxlcy1lbnRyZW5jaGVkLW1pbmRzZXRzLWluLWVsLXNhbHZhZG9yL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "The Bitcoin Circular Economy Battles Entrenched Mindsets in El Salvador - CoinDesk",
        "content": "When I arrived in El Zonte, the weather was much hotter than in San Salvador, which is located about an hour inland. I approached a tin roof structure that appeared to be both a restaurant and a family home to buy water, dodging several chickens and friendly dogs along the way. The owner of the establishment said he accepted bitcoin. He pulled out his smartphone, opened his Lightning-enabled Blink wallet and I sent him the equivalent of $2 in satoshis nearly instantaneously. Similarly, the restaurant I got lunch at utilized a Blink wallet for payment."
    },
    {
        "id": 10,
        "url": "https://news.google.com/rss/articles/CBMibGh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vb3Bpbmlvbi9hcnRpY2xlcy8yMDIzLTA4LTI3L2JpdGNvaW4tcy1lbmVyZ3ktdXNhZ2Utb2ZmZXJzLWEtbGVzc29uLWZvci1haS1zLWZ1dHVyZdIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin's Energy Usage Offers a Lesson for AI's Future - Bloomberg",
        "content": "Surging interest in artificial intelligence systems will add further strain to global electricity grids with the potential to rival the massive energy consumption of Bitcoin. Thankfully, the premier cryptocurrency has shown us a way to mitigate the impact.\n\nA doubling of data-center revenue at Nvidia Corp. last quarter shows that demand for generative applications like ChatGPT hasn’t yet hit its peak. The US chipmaker is the key provider of shovels in this AI goldrush, but those processors are neither cheap nor lean. Its latest flagship, the GH200 Grace Hopper Superchip, which is the size of a postcard, draws up to 1,000 watts — equivalent to a portable heater."
    },
    {
        "id": 11,
        "url": "https://news.google.com/rss/articles/CBMicWh0dHBzOi8vd3d3LmZpbmFuY2VtYWduYXRlcy5jb20vdHJlbmRpbmcvZGVjbGluaW5nLWludGVyZXN0LWluLWJpdGNvaW4tcmV0YWlsLWludmVzdG9ycy12cy1pbnN0aXR1dGlvbmFsLXBsYXllcnMv0gF1aHR0cHM6Ly93d3cuZmluYW5jZW1hZ25hdGVzLmNvbS90cmVuZGluZy9kZWNsaW5pbmctaW50ZXJlc3QtaW4tYml0Y29pbi1yZXRhaWwtaW52ZXN0b3JzLXZzLWluc3RpdHV0aW9uYWwtcGxheWVycy9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Declining Interest in Bitcoin? Retail Investors vs. Institutional Players - Finance Magnates",
        "content": "The world of cryptocurrencies, lead by Bitcoin, has been a thrilling ride for both investors and fans. There has recently been talk concerning Bitcoin's waning popularity. A closer examination of the dynamics, however, reveals a more nuanced story: while individual investor enthusiasm appears to have waned, institutional players have been making large moves.\n\nThis article dives into the apparent shift in Bitcoin interest, contrasting ordinary investors' and institutional participants' opinions.\n\nThe Retail Investor Environment\n\nSentiment Change\n\nRetail investors have been a key driver behind Bitcoin's recent climb. However, market sentiment in this area appears to have fluctuated. Because of the volatility of cryptocurrency markets, as well as regulatory worries and the memories of previous market crashes, some retail investors are approaching Bitcoin with caution.\n\nBitcoin's Upsurge Amid Economic Signals and Market Confluence\n\nBitcoin recently surged by almost 4%, reaching nearly $26,800 before holding steady above $26,000 for a day. Concurrently, the cryptocurrency market's total capitalization increased by 1% to approximately $1.06 trillion. This trend mirrored gains in traditional markets, as the S&P 500 and Nasdaq rose by about 1% and 2%, respectively.\n\nThe surge in Bitcoin's value was attributed to disappointing Purchasing Managers' Index (PMI) figures, indicating a contracting market and suggesting lower inflation risk and reduced chances of a September interest rate hike.\n\nThis upswing followed a recent drop of nearly 8%, which affected the broader cryptocurrency landscape. These shifts occurred within a period of relative stability for Bitcoin, highlighted by its lowest 90-day volatility rate since 2016.\n\nBitcoin's trajectory in 2023 deviates from these steadier waters. Starting below $17,000, it surged to nearly $28,000 amid the Silicon Valley Bank crisis in March and further to over $31,000 post-BlackRock's Bitcoin spot ETF application.\n\nWhile notable, investors are currently in a wait-and-see mode, anticipating the U.S. Securities and Exchange Commission's decision on the approval of a spot-based ETF. This decision is poised to exert substantial influence on Bitcoin's course and the broader cryptocurrency domain in the coming months.\n\nSkepticism and Challenges\n\nRetail investors, who are frequently motivated by short-term returns, are prone to emotional decision-making.\n\nFear and suspicion might cause people to sell during market downturns, resulting to price decreases. This interaction produces a cyclical pattern in which a price decrease fuels negative sentiment and negative sentiment fuels subsequent price drops.\n\nEducational Disparities\n\nA sizable proportion of retail investors are unfamiliar with blockchain technology and the underlying mechanics of cryptocurrencies. This knowledge gap might lead to rash decisions influenced by news headlines and social media buzz.\n\nThe Institutional Player's Point of View\n\nIncreased Institutional Interest\n\nIn contrast to the apparent reluctance of regular investors, institutional players have shown increasing interest in Bitcoin. The maturing of the cryptocurrency sector, increasing legal clarity, and the acknowledgment of Bitcoin as a potential store of value and inflation hedge have all aided institutional adoption.\n\nInvestment Strategy\n\nHedge funds, asset managers, and corporations see Bitcoin as a strategic investment to diversify their portfolios and limit risks associated with traditional assets. The entrance of institutional participants has resulted in a more stable market, as these firms provide a long-term perspective.\n\nValue Recognition\n\nThe 2020s have seen a significant shift in attitude, with some of the world's major financial institutions recognizing Bitcoin's value proposition. The narrative has moved from skepticism to strategic consideration, with notable figures endorsing Bitcoin and financial firms adopting it into their strategies.\n\nPerspectives in Comparison\n\nPerception of Risk\n\nRetail investors, who are frequently more risk-averse due to personal financial concerns, are more likely to panic sell during market downturns. In contrast, institutional investors are better suited to withstand market changes and can even profit from price volatility.\n\nInvestment Prospects\n\nShort-term market dynamics result from retail investors' desire for immediate gains. In contrast, institutional investors frequently have longer investment horizons, which contributes to market stability and fosters more resilient price patterns.\n\nMarket Influence\n\nInstitutional participants' actions have a more measured impact on the market than ordinary investors, who can cause fast price changes. This can result in a more mature and balanced market.\n\nRegulatory Impact\n\nInstitutional players, impacted by broad regulatory considerations, may navigate market dynamics differently than ordinary investors, who may be influenced by speculative and news sentiment.\n\nFuture Pathways\n\nEducation and Awareness for Retail Investors\n\nBridging the knowledge gap is crucial for the retail investor group. Education of blockchain technology, market fundamentals, and responsible investment practices might help retail investors make more educated decisions, minimizing impulsive acts fueled by emotion.\n\nMarket Maturity and Institutional Influx\n\nThe increased participation of institutional entities indicates that the bitcoin sector is maturing. Institutional investment is projected to increase as regulatory frameworks evolve and infrastructure supporting cryptocurrencies improves.\n\nSymbiosis and Synergy\n\nThe cohabitation of retail and institutional investors adds to a well-balanced environment. While retail investors gain from institutional participation's stability, institutional players can tap into larger retail market sentiment.\n\nConclusion: A Complicated Interaction\n\nThe story of Bitcoin's popularity is multifaceted, with ordinary investors and institutional players offering diverse perspectives. Retail investors, motivated by emotion and short-term aims, have faced difficulties as a result of market volatility and information gaps. Institutional actors, on the other hand, have identified Bitcoin's value proposition, boosting adoption and market maturation.\n\nWhile retail investor attitude may fluctuate, the constant influx of institutional participants implies that cryptocurrencies are becoming more widely accepted as a viable asset class. The interaction between these two investor categories adds levels of complexity to the expanding Bitcoin scene, ultimately defining the direction of this disruptive digital asset."
    },
    {
        "id": 12,
        "url": "https://news.google.com/rss/articles/CBMieWh0dHBzOi8vd3d3LmJsb29tYmVyZy5jb20vbmV3cy9hcnRpY2xlcy8yMDIzLTA4LTI4L2JpdGNvaW4tYnRjLW1pbmluZy1oYXNocHJpY2UtbmVhcnMtcmVjb3JkLWxvdy1hcy10b2tlbi1wcmljZS1zdGFnbmF0ZXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin (BTC) Mining Hashprice Nears Record Low as Token Price Stagnates - Bloomberg",
        "content": "One closely-watched measure of Bitcoin mining revenue is hovering around a record low as the price of the largest digital asset stagnates and competition heats up.\n\nThe so-called hashprice fell to $0.06 for a unit of computing power per day on Sunday, according to Hashrate Index data. That is close to the record low seen around late 2022 when major publicly-traded mining companies warned of a liquidity crunch and some declared bankruptcy."
    },
    {
        "id": 13,
        "url": "https://news.google.com/rss/articles/CBMibmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9tYXJrZXRzLzIwMjMvMDgvMjgvYml0Y29pbi1zbHVtcHMtdW5kZXItMjZrLWFzLWJlYXJpc2gtb3V0bG9vay1lbmd1bGZzLWNyeXB0by1tYXJrZXQv0gFyaHR0cHM6Ly93d3cuY29pbmRlc2suY29tL21hcmtldHMvMjAyMy8wOC8yOC9iaXRjb2luLXNsdW1wcy11bmRlci0yNmstYXMtYmVhcmlzaC1vdXRsb29rLWVuZ3VsZnMtY3J5cHRvLW1hcmtldC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Slumps Under $26K as Bearish Outlook Engulfs Crypto Market - CoinDesk",
        "content": "Learn more about Consensus 2024, CoinDesk's longest-running and most influential event that brings together all sides of crypto, blockchain and Web3 . Head to consensus.coindesk.com to register and buy your pass now ."
    },
    {
        "id": 14,
        "url": "https://news.google.com/rss/articles/CBMiUmh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS92aWRlby90aGUtd29yc3QtaXMtb3Zlci1mb3ItYml0Y29pbi1oYXNoZGV4LWNpby1wcmVkaWN0cy_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "'The Worst Is Over' for Bitcoin, Hashdex CIO Predicts - CoinDesk",
        "content": "Bitcoin dipped under $26,000 earlier this morning amid generally bearish sentiment among crypto traders and the lack of new catalysts to rally markets. Joining us now to discuss the crypto markets is hashtag Cio Samir Age. Welcome to the show. Samir. Hi Jennifer. Good morning. Good morning. Well, let's talk about these markets. It feels like no matter what happens, they are not budging in one direction or the other. What is going on? Yeah, we've seen like a historically low volatility in the markets recently. And I think mostly because there's so many uh events that the traders, the market participants are waiting to unfold that this is creating like a expectation and people are not really looking into taking directional place until you know, like we have more regulatory clarity. Um There's more news around adoption in crypto uh and also on the macro landscape, right? So we're leaving a very uncertain period around like how the fed is going to handle uh inflation. So I think traders are waiting to see how that that's going to play out until they place bigger bats. All right, what's your short term? Look on Bitcoin. Given what you just said, yeah, I think on the short term, like I wrote about this before, I believe the worst is over, right? So we are in a recovery phase in terms of these cycles we see in crypto. Uh So we're really expecting after this period of low volatility, uh the volatility may go up, but we, we probably going to see Bitcoin trading between 55,000 for a few weeks until there are new catalysts like uh like unfolding around like the gray scale lawsuit, the Bitcoin ETF narrative. And also what happens in the macro environment and geopolitical tensions, right? So uh we're probably going to see Bitcoin uh trading in a range for for a few weeks. Uh but we're still very optimistic about the long term. So we always like to zoom out and look at the long term in the long term. We're seeing 22, basically two big trends. There are um growing together the secular trend around crypto uh with like growth of the major networks, crypto adoption going up. Um like Bitcoin value proposition being reassured by the US banking crisis and the largest financial institutions coming to crypto, right, coming to Bitcoin and coming to crypto. So those are secular trends that are going to unfold over the next 5 to 10 years. And in the short term, we're seeing cyclical trends, right? So worse it's over. But like uh the US will continue monetizing its data, we have the Bitcoin housing coming right around the corner in a few months. Uh So we're very optimistic about like uh Bitcoin and crypto as a whole. Uh If you look at longer horizons of, I would say 12 to 18 months in the short term. It's really like it, it's hard to know where the price is going, but we expect it to trade range bound. You mentioned that weak macro environment, you mentioned the potential of rising interest rates. We've talked a little bit about what that means for Bitcoin. What do you think that means for the rest of the crypto markets? It's not only about Bitcoin, we have Ether, we have alt coins. Do you just expect those to follow suit? Yeah, I think Bitcoin and the other crypto assets are very different, right? So um I would say Bitcoin uh has a more like a store of value play. So uh like as we see more inflation and as we see more macroeconomic problems that may be good for Bitcoin's adoptions like we saw in the banking crisis, right? There was a big surprise on the banking prices, Bitcoin going up while all the other crypto were going down. Uh So on the macro scenario, I think if things are are are going in a more uncertain way or a more dangerous way for, for, for like geopolitically that can be positive for Bitcoin, but it's probably going to be negative for the other crypto assets. If we see interest rates going down, that's going to be very positive for, for crypto assets as a whole interest rates going up. That that would be negative for other crypto assets but may be positive uh for Bitcoin. So I'll say like, uh um Bitcoin is its own thing. It's very different from the other crypto assets. All right, I want to take a look at this chart. Now, HASHD tracks insights on indices relevant to the crypto market, the NASDAQ crypto index which has developed in which was developed, sorry, in partnership with hashd experienced a 6.3% quarterly increase. Talk to me about the significance here. Yeah. So what we saw like in, we look at the next last quarter is um basically uh um like um an environment with less news around like uh Macro and crypto specifically, we had the gray scale uh lawsuit. Uh moving on, we had the XRP judge uh uh like uh that, that gave a lot of like clarity for other crypto assets. So, uh we see like uh when you look at the chart here, uh uh A I is still a hot topic and, and it's moving the NASDAQ 100 up. So we've seen like a few names um that are still over performing the overall market. And along those names, we've seen Crypto, uh we've seen Bitcoin and more recently, we saw other assets uh especially because the regulatory uh I would say environment in the US is still uncertain but it's moving in a positive way for crypto. You mentioned A I there is a key market driver. Now, you may not have an answer for this. But um are you, are you following the A I tokens? Are you following what's going on with A I tokens? Given the more macro A I news that um we're seeing. Yeah, as I say, this is mostly a narrative, right? So we really look, we need to look into like a case by case basis. I think it's still too soon uh to, to really understand the implications of A I to crypto. What I can say is that uh um crypto or A I is going to benefit from an open Blockchain, right? As a general long term trend, it makes sense for A I applications for autonomous applications running on the internet to use the Blockchain to exchange value and ex change uh transactions uh using the Blockchain instead of using, you know, like a a visa or a swift network. So I would say uh A I adoption is very positive for crypto, but it's still too soon to, you know, place a specific bets on A I tokens. All right, Samir, we are going to have to leave it there. Thank you very much for joining me this morning. Thank you so much. That was hashtag Cio Samir Kabash."
    },
    {
        "id": 15,
        "url": "https://news.google.com/rss/articles/CBMiemh0dHBzOi8vd3d3LmNvaW5kZXNrLmNvbS9wb2xpY3kvMjAyMy8wOC8yOC9hLWNyeXB0by1wcmVzaWRlbnQtdG9wLXVzLTIwMjQtY29udGVuZGVycy1hcmVudC1mYW5zLWFuZC1yaXZhbHMtYXJlLXdheS1iZWhpbmQv0gF-aHR0cHM6Ly93d3cuY29pbmRlc2suY29tL3BvbGljeS8yMDIzLzA4LzI4L2EtY3J5cHRvLXByZXNpZGVudC10b3AtdXMtMjAyNC1jb250ZW5kZXJzLWFyZW50LWZhbnMtYW5kLXJpdmFscy1hcmUtd2F5LWJlaGluZC9hbXAv?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "A Crypto President? Top U.S. 2024 Contenders Aren’t Fans, and Rivals Are Way Behind - CoinDesk",
        "content": ": The president, who hasn’t yet seen an electoral threat emerge from his own party, now has a significant record on crypto, judging from his administration’s performance in the past three years. Certain of his regulators have hammered the industry with enforcement actions – mostly at the SEC and the Commodity Futures Trading Commission – as they accuse digital assets businesses of failing to toe the line on existing financial regulations, which crypto insiders say are impossible to meet. While his administration hasn’t yet crafted wide-reaching crypto rules, the SEC and Treasury Department have proposed some regulations that would have major – and potentially highly limiting – effects on the sector, from the SEC’s proposals on custody and defining crypto platforms as exchanges to the Treasury’s new proposal on how to tax token gains. He said this year that he’s excited about closing “ special interest tax loopholes ” that benefit crypto traders, and the White House has pushed for a 30% tax on crypto mining . The administration has also been studying whether to stand up a digital dollar that could shake up stablecoin issuers, though officials insist no decision has been made. Biden’s direct crypto involvement has generally been limited, though he issued an executive order on digital assets in 2022 – before the market detonated that year and crypto giants began toppling – instructing his administration to start getting a handle on oversight that would thread a needle to establish consumer protections while allowing U.S. innovation."
    },
    {
        "id": 16,
        "url": "https://news.google.com/rss/articles/CBMib2h0dHBzOi8vY3J5cHRvc2xhdGUuY29tL3JvYmluaG9vZC1oYXMtb3Zlci0zYi1pbi1iaXRjb2luLXJhbmtzLWFsb25nc2lkZS1iaW5hbmNlLWFuZC1iaXRmaW5leHMtYmlnZ2VzdC13YWxsZXRzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Robinhood holds over $3B in Bitcoin, ranks alongside Binance and Bitfinex's biggest wallets - CryptoSlate",
        "content": "According to a report by Arkham Intelligence published around Aug. 27, Robinhood allegedly holds more than $3 billion of Bitcoin in a single address\n\nThose findings show that Robinhood holds 118,300 BTC of Bitcoin (BTC), which is valued at $3.07 billion and is stored in an address beginning with “bc1ql.”\n\nThat address was active as recently as today. Though its recent transactions are small, the wallet’s balance has grown significantly since mid-May, when it held just over $5,400 in Bitcoin. The address’ balance began to grow soon after that: by May 25, it held about $1.4 billion in Bitcoin, and by June 18, it held $3 billion in Bitcoin.\n\nThe funds in the address are custodied with Jump Trading, a Chicago-based trading firm known to power Robinhood’s crypto trading features.\n\nRobinhood confirmed in a statement to CryptoSlate that it owns the $3 billion address in question and said that it is used to custody user funds in cold storage.\n\nRobinhood wallet ranks third overall\n\nRobinhood’s address is the third-largest Bitcoin wallet overall, according to data from Bitinfocharts. The two largest addresses belong to other crypto exchanges: the largest holds 248,597 BTC ($6.5 billion) and belongs to Binance, while the second-largest address holds 178,010 BTC ($4.6 billion) and is held by Bitfinex. However, each company’s actual crypto holdings are higher as each holds multiple wallets.\n\nRobinhood’s wallet also measures up to purchases made by major corporate investors. Microstrategy, which has made Bitcoin investing a key part of its portfolio, held $4.6 billion in Bitcoin in late June. However, these investments may be of a different nature: whereas Microstrategy has bought Bitcoin for its balance sheet, Robinhood’s holdings instead represent cryptocurrency that it holds on behalf of its customers.\n\nRobinhood previously reported its broader crypto holdings as part of its quarterly earning results. The company said it had $11.5 billion of assets related to user cryptocurrency safeguarding obligations as of June 30, 2023.\n\nIt is unclear where the remainder of those assets are held and to what extent that $11.5 billion total is made up of cryptocurrencies other than Bitcoin.\n\nNote: This piece was updated to include a confirmation from Robinhood.\n\nMentioned in this article"
    },
    {
        "id": 18,
        "url": "https://news.google.com/rss/articles/CBMicGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLW1heS1oaXQtMTAway1ieS1jYXB0dXJpbmctZXZlbi0yLTUtb2YtZ29sZC1zLW1hcmtldC1jYXAtaHV0OC12cC1zdWUtZW5uaXPSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin may hit $100K by capturing 'even 2 to 5% of gold's market cap' — Hut 8 VP Sue Ennis - Cointelegraph",
        "content": "The next Bitcoin halving event is less than nine months away, and the consensus opinion among analysts and investors is that the halving will send Bitcoin’s price to a new all-time high or even above $100,000.\n\nDespite this belief, the absence of fresh inflow to the crypto market, the current macroeconomic headwinds and Bitcoin’s (BTC) recent price action below $30,000 do not inspire much confidence in this theory in the short term.\n\nIn a recent interview with Paul Barron, Hut 8 vice president Sue Ennis shared her thoughts on how the Bitcoin price will rise above $100,000 in the next year and how the upcoming halving will impact BTC miners. Hut 8 currently has a balance of 9,152 BTC in reserve, of which 8,305 is unencumbered. The company’s installed ASIC hash rate capacity sits at 2.6 exahashes per second, and Hut 8 mined 44.6 BTC in July.\n\nIn the interview, Barron inquired whether rising Bitcoin difficulty for miners could induce a fresh wave of sell pressure against BTC. Citing data from Hashrate Index, Barron observed that spikes in Bitcoin difficulty were followed by drops in BTC’s price.\n\nBitcoin price, difficulty and difficulty adjustment. Source: Hashrate Index\n\nBarron questioned if miners were selling Bitcoin as a result of the upcoming halving creating a need for more efficient ASICs and whether BTC’s pre- and post-halving price action would not be as bullish as investors expected.\n\nAccording to Ennis:\n\n“There’s a lot of really unprecedented dynamics that are happening now in the mining space. [...] What’s interesting is hash rate continues to come online despite Bitcoin price trading in a certain band. [...] We’re still seeing hash rate increase.”\n\nEnnis elaborated with:\n\n“What’s changed now is that we’re seeing Bitcoin price come down a little, but hash rate continues to go up. [...] I think what’s really exciting and different is we’re seeing a tremendous amount of new entrants into the global Bitcoin network.”\n\nEnnis referenced six gigawatts of nuclear and renewable energy being generated in the Middle East, and with the region's governments exploring Bitcoin mining as an option, more hash rate is coming online in a way that is somewhat price agnostic. This is drastically different from how publicly traded United States-based and more forward-facing miners operate.\n\nIn order to stay afloat after the halving, Ennis suggested that miners need to be in a position to avoid being “single-threaded,” i.e., they need more than one way of earning revenue beyond just mining Bitcoin.\n\nRevenue diversification would include exploring various artificial intelligence (AI) applications, dedicating some warehouse rack space to GPUs for companies specializing in AI training and possibly offering industrial-level ASIC repair services — or even participating in demand-response initiatives with large energy producers and distributors.\n\nRelated: September ‘crash’ to $22K? — 5 things to know in Bitcoin this week\n\nHigher prices are programmed thanks to the halving and eventual BTC ETF\n\nCrypto investors have waited years for the launch of a spot Bitcoin exchange-traded fund (ETF), and even with the recent influx of applications, an approval by the U.S. Securities and Exchange Commission remains elusive.\n\nDespite the history of delays and denials, Ennis said that a “spot ETF coming to market, that’s incredibly bullish for the asset class,” but she also cautioned that an approval could create sell pressure on miner equities given that mining stocks have often been used as a proxy investment to Bitcoin.\n\nRegarding the percentage chance of a spot Bitcoin ETF approval by the end of 2023, Ennis said:\n\n“Definitely better than 50. The real reason for my opinion on that is that BlackRock threw its hat in the ring, BlackRock being powerful and the largest asset manager in the world. For them to throw their hat in the ring and say this is what we want and the amount of clout they’ve had in markets in past initiatives has been tremendous. So I think for them to make this call, that is a real bullish signal.”\n\nRegarding a potential target for the Bitcoin price, Ennis said:\n\n“I definitely do think we could see in this next cycle $100,000 cost per Bitcoin, and that’s based on if BTC were to capture even 2 to 5% of gold’s $13 trillion place in institutional portfolios. If Bitcoin were able to capture even 2 to 3% of gold’s market cap, that would be incredibly accretive to the price and push it north of $100,000.”\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 19,
        "url": "https://news.google.com/rss/articles/CBMiQGh0dHBzOi8vd3d3LjExb256ZS5jYXQvZW4vbWFnYXppbmUvd2hhdC11bmRlcnBpbnMtdmFsdWUtYml0Y29pbi_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "What underpins the value of Bitcoin? - 11Onze",
        "content": "Unlike fiat currencies, Bitcoin is a decentralised digital currency that is not subject to the control of a government or central bank. Its value is not defined by an entity but is derived from consumer confidence. But what underpins this trust?\n\nDespite the differences, cryptocurrencies such as Bitcoin share some similarities with the traditional fiat currencies we are all used to. Therefore, it is important to understand what gives fiat money its value before analysing why there are many people who see Bitcoin as a store of value.\n\nLong gone is a monetary system in which the value of currencies is underpinned by their convertibility to gold, and since President Richard Nixon assembled his team at Camp David to announce that he was suspending the dollar’s convertibility to gold. The dollar went from being a currency that based its value on the existence of a gold counterpart, to being a fiat currency, with its value derived from the relationship between supply and demand and the stability of the issuing government.\n\nThus, governments and central banks can create money to expand their money supply and stimulate spending through economic mechanisms without worrying about having sufficient gold reserves, at least this is the theory. Therefore, although these fiat currencies are not backed by tangible assets, their value is given by the collective confidence in the currencies. On the other hand, the monetary policies of governments and central banks, as well as economic developments, can cause this confidence and the value of the currency to fluctuate.\n\nDecentralisation, security, and limited supply\n\nThe Bitcoin monetary ecosystem is fully decentralised, i.e. no central authority regulates the monetary base, eliminating the need for intermediaries and giving users more control over their financial transactions. By eliminating central authorities, the creation of currency is democratised, giving more power and freedom to the user community.\n\nThe creation of Bitcoins follows detailed rules in a very strict protocol that is based on blockchain. This blockchain technology uses cryptographic algorithms and makes it more secure than physical currencies and highly immune to crises. Moreover, if the user wants to make a transfer or a payment, he has total freedom, neither the bank, VISA, nor Mastercard have to authorise it. These characteristics, and the fact that thousands of merchants already accept Bitcoin as payment for goods and services, have given it a helpful value.\n\nOn the other hand, since its introduction, a maximum limit of 21 million coins that can be mined was established, which introduced an element of intrinsic scarcity that also contributes to its value, when we consider the relationship between price and scarcity. This is why many people regard Bitcoin as a store of value, despite its volatility. Global regulation of crypto-assets and competition with other digital currencies will shape the future of Bitcoin, but ultimately it will be people’s trust that will ensure, or not, its existence.\n\n11Onze Recommends Bitvavo, cryptocurrencies easily, securely and at a low cost."
    },
    {
        "id": 20,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vb2lscHJpY2UuY29tL0VuZXJneS9FbmVyZ3ktR2VuZXJhbC9CaXRjb2luLU1pbmVycy1Mb29rLVRvLUNvYWwtQXNoLUFzLVBvd2VyLURlbWFuZC1TdXJnZXMuaHRtbNIBamh0dHBzOi8vb2lscHJpY2UuY29tL0VuZXJneS9FbmVyZ3ktR2VuZXJhbC9CaXRjb2luLU1pbmVycy1Mb29rLVRvLUNvYWwtQXNoLUFzLVBvd2VyLURlbWFuZC1TdXJnZXMuYW1wLmh0bWw?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Miners Look To Coal Ash As Power Demand Surges - OilPrice.com",
        "content": "The Bitcoin market has had a wild ride over the past year. Prices have plummeted, sharply recovered, and then plummeted again over the last ten months, and the future is uncertain for cryptocurrencies overall in the context of an ambivalent regulatory and policy landscape. Amidst all the chaos, one thing about Bitcoin has been steady since the beginning: its ever-expanding energy use and resulting carbon footprint.\n\nThe cryptocurrency world has been in crisis recovery mode since the downfall of FTX, one of the largest cryptocurrency exchanges in the world, toward the end of last year. Since then, regulatory bodies around the world have escalated a crackdown on digital currency firms, while other sectors worried about “crypto contagion” leading to a widespread economic fallout. Despite the extreme crypto-anxiety and price volatility of the last year, however, Bitcoin has managed an impressive rebound, recently staying steady at about $26,000 – for now. But just when things have been looking up, crypto markets took an unexpected dive this week, and experts suggest that there may be another crash coming in September.\n\nDespite the volatility, Bitcoin’s energy use is at an all time high – and so are its carbon emissions. According to the Bitcoin Electricity Consumption Index, created and maintained by the University of Cambridge, Bitcoin’s estimated network power demand is currently clocking in at around 16 gigawatts, or about 138 TWh per year – approximately the equivalent of the entire country of Pakistan, home to 231.4 million people.\n\nThe issue is the way that Bitcoins are mined. As more and more miners try to produce Bitcoins through solving complex proof-of-work problems, the problems get increasingly difficult to solve, thereby requiring more and more computing power to produce the same amount of Bitcoin. This is done to prevent the depression of the currency's value – in order to maintain a steady currency, each Bitcoin is designed to take about ten minutes to mine, no matter how much computing power is thrown at it. For this reason, it now takes about 9 years’ worth of household electricity to mine a single Bitcoin, whereas in 2009, it required just a few seconds’ worth.\n\nThis isn’t just an issue for the environment, it's also an issue for Bitcoin miners, who have to secure more and more energy to keep their Bitcoin mining operations afloat. For this reason, lots of Bitcoin miners are trying to get more creative with sourcing cheap energy or energy industry byproducts, employing innovative approaches such as setting up in poor countries with heavily subsidized energy prices or using energy that would otherwise be wasted, such as coal ash – and natural gas vented during drilling on oilfields.\n\nCoal ash, in particular, has been touted by some as a potentially elegant solution to some of Bitcoin’s problems. It makes use of a byproduct that poses an environmental and health problem to the communities where it has been dumped and stored, and in doing so, recovers that land for other more productive uses. One of the biggest proponents of this approach is Stronghold, a publicly traded bitcoin mining firm operating in Pennsylvania, where coal ash is a readily available commodity thanks to widespread coal usage for steel production, among other uses, not to mention an ongoing environmental woe. Stronghold is “vertically integrated” as a Bitcoin company, with ownership of its own energy sources as well as its mining rigs. Those energy sources are two coal ash sites with a combined capacity of 165 MW.\n\nWhile Stronghold presents the plan as a win-win for bitcoin and for the environment, however, critics argue that it’s not actually such a clean solution. While coal ash does need to be cleaned up and processed, environmentalists argue that burning coal ash is not a good option, as it creates considerable greenhouse gas emissions. Put simply, it just moves the coal ash pollution from the ground to the air.\n\nAnd the issue is not just the irresponsible use of waste coal, it's the increasing demand for energy generated from fossil fuels in general. In a number of locations, we’ve already seen Bitcoin operations extending the life and spiking the emissions of coal and gas plants that were already on track to be shut down. A recent report from US NGO Global Energy Monitor found that all coal plants worldwide need to be shuttered by 2040 or face ‘climate chaos’. The threat that the coal-powered Bitcoin trend poses to decarbonization pathways is considerable and is increasingly garnering attention. New York recently imposed a 2-year moratorium on new permits for fossil fuel plants seeking to mine cryptocurrencies. While New York has acted swiftly to protect its climate goals, it is an outlier.\n\nBy Haley Zaremba for Oilprice.com\n\nADVERTISEMENT\n\nMore Top Reads From Oilprice.com:"
    },
    {
        "id": 21,
        "url": "https://news.google.com/rss/articles/CBMiT2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXRyYWRlcnMtc3VwcG9ydC1sZXZlbHMtYnRjLXByaWNlLXRhcHMtMjbSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin traders pinpoint support levels as BTC price taps $26.2K - Cointelegraph",
        "content": "Bitcoin (BTC) recovered its weekly close losses on Aug. 28 as risk assets rose on Chinese tax cuts.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nBTC price 200-week EMA stands out as support\n\nData from Cointelegraph Markets Pro and TradingView followed a BTC price uptick into the day’s Wall Street open.\n\nBTC/USD managed $26,226, marking its highest level since Aug. 25 and fully compensating for the weakness seen overnight.\n\nNews that China had cut tax on stock trading by 50% appeared to buoy U.S. futures into the open. The S&P 500 and Nasdaq Composite Index subsequently opened up 0.6% and 0.7%, respectively.\n\n$BTC still in a 3 day composite but has shown signs of absorption below. I wish it was liquid enough like the ES or NQ to simply justify saying \"Hold 26.1 and those singles at 26275 get cleaned up\"\n\n\n\nStrong drive off the open for stocks.\n\n\n\nIt's Monday, so not looking to do anything… pic.twitter.com/6ObqBLIx5z — HORSE (@TheFlowHorse) August 28, 2023\n\nEyeing the trading landscape for the coming week, Michaël van de Poppe, founder and CEO of trading firm Eight, flagged the 200-week exponential moving average (EMA) at around $25,700 as a key support zone to protect.\n\n“First of all, the 200-Week EMA lies beneath us. It’s at $25,650 (Bitstamp) or $24,750 (Binance). The conclusion is, you don’t want to drop beneath that level and you’d preferably want to mimic 2015-2016 sideways period,” he wrote in part of a post on X (formerly Twitter).\n\n“If the 200-Week EMA sustains, conclusions are that we’re bottoming out here and we are potentially getting a massive entry point. If it’s lost, I’d be looking at a case of $19,500-21,500 as the next big entry point and final capitulation. On the lower timeframes and over the week, it’s still possible to sweep below the 200-Week EMA. As long as we don’t lose the level.”\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/X\n\nVan de Poppe continued that order book liquidity “most likely” resided below the 200 EMA.\n\n“In that regard, a sweep of that area is the most likely outcome,” he wrote.\n\n“Two strategies can be deployed: 1 - Sweep at $25,750 for an aggressive long entry towards the other side of the range (entry can only be taken after the sweep and when $25,750 is reclaimed). 2 - Sweep of $25,200 towards $24,700-25,000 (the 200-Week EMA on Binance) and bullish divergences on higher timeframes. That’s the golden trade and could be the start of a reversal. However, $25,750 should be reclaimed in the bounce, otherwise this trade could be invalid/stopped out.”\n\nBTC/USD annotated chart. Source: Michaël van de Poppe/X\n\nPopular trader Titan of Crypto meanwhile highlighted $25,900 as a prominent zone of interest.\n\n“$25,900 is the level to watch,” he summarized in part of X analysis.\n\n#Bitcoin $25,900 is the level to watch\n\n\n\nKijun at $25.9k supported the #BTC price once more on the weekly timeframe. That's the level to watch.\n\nIf it holds, I won't be surprised to see a pullback to Tenkan at around $28.4k. pic.twitter.com/VDcJQczDwc — Titan of Crypto (@Washigorira) August 28, 2023\n\nBitcoin RSI stays “very low” for second week\n\nElsewhere, fellow trader Pheonix referenced persisting low levels on Bitcoin’s relative strength index (RSI) on lower timeframes.\n\nRelated: September ‘crash’ to $22K? — 5 things to know in Bitcoin this week\n\nAs Cointelegraph reported, depending on the timeframe in question, these reached levels not seen in five years after the 10% BTC price dip ten days ago.\n\n“RSI still very low, for 1.5 weeks already now,” part of their X commentary on Aug. 28 read.\n\n“7/8 times it went below 25 the last years, corresponded to the (local) bottom & a 30% minimum rise followed.\n\nFurther analysis showed the one exception to the rule coming in September 2019.\n\n#Bitcoin RSI still very low, for 1.5 weeks already now\n\n\n\n7/8 times it went below 25 the last years, corresponded to the (local) bottom & a 30% minimum rise followed\n\n\n\nMost often $BTC gained more % in value\n\n\n\n1 fail: Sep '19\n\n4 local bottoms: Nov '19, May '21, Jan '22 & June '22… https://t.co/2yNxDStkD8 pic.twitter.com/PA4nVJkdTB — Phoenix (@Phoenix_Ash3s) August 28, 2023\n\nThe RSI attempts to measure when an asset is overbought or oversold at a given price point.\n\nCollect this article as an NFT to preserve this moment in history and show your support for independent journalism in the crypto space.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 22,
        "url": "https://news.google.com/rss/articles/CBMiZmh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9iaXRjb2luLXByaWNlLXN0YWJpbGl0eS1jcmVhdGVzLWx1Y3JhdGl2ZS1zZXR1cHMtaW4tdG9uLXhtci1tbnQtYW5kLXFudNIBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin price stability creates lucrative setups in TON, XMR, MNT and QNT - Cointelegraph",
        "content": "Bitcoin (BTC) has gone silent over the weekend. CryptoQuant CEO Ki Young Ju said, in a recent post on X (formerly Twitter), that Bitcoin’s velocity has declined to a three-year low. He said this could either be considered positive, as whales were holding on to their positions, or negative because the transfer to new investors was not happening.\n\nThe range-bound action continues to perplex investors with regard to the next possible trending move. In that respect, there was positive commentary from JPMorgan analysts who said that Bitcoin’s downtrend could be ending. They believe that the declining open interest in Bitcoin futures contracts on the Chicago Mercantile Exchange suggests that the long liquidation is over.\n\nCrypto market data daily view. Source: Coin360\n\nAs Bitcoin decides its next move, select altcoins are showing signs of strength. These altcoins could turn negative if Bitcoin’s range resolves to the downside, but if Bitcoin turns up or stays in a range, then they may offer a short-term trading opportunity.\n\nLet’s study the charts of the top-five cryptocurrencies that may move up in the near term and identify the levels that need to be crossed for the bulls to take charge.\n\nBitcoin price analysis\n\nBitcoin formed an inside-day candlestick pattern on Aug. 26, indicating indecision between the bulls and the bears about the next directional move.\n\nBTC/USDT daily chart. Source: TradingView\n\nThe downsloping 20-day exponential moving average ($27,222) and the relative strength index (RSI) in the oversold zone indicate that bears are in command. However, the bulls are unlikely to give up without a fight. They will try to defend the $24,800 level with all their might.\n\nThe BTC/USDT pair may start a stronger recovery if buyers thrust the price above the 20-day EMA. That could open the doors for a possible rally to the 50-day simple moving average ($28,888).\n\nIf bears want to strengthen their position, they will have to pull the price below $24,800. If they do that, the pair could start a downtrend to $20,000.\n\nBTC/USDT 4-hour chart. Source: TradingView\n\nThe 20-day EMA is flattening out, and the RSI is near the midpoint on the four-hour chart. This suggests a balance between supply and demand. If the price crumbles below $25,700, the pair could fall to $25,166 and then to $24,800.\n\nOn the contrary, if the pair sustains above the moving averages, it will signal that the bulls have absorbed the selling. There is a minor resistance at $26,314, but if this crossed, the pair could climb to $26,610 and, later, to $26,833.\n\nToncoin price analysis\n\nToncoin (TON) is forming an inverse head and shoulders pattern, which will complete on a break and close above $1.53.\n\nTON/USDT daily chart. Source: TradingView\n\nThe gradually upsloping 20-day EMA ($1.38) and the RSI in the positive zone indicate that the path of least resistance is to the upside. If buyers drive the price above $1.53, the TON/USDT pair could start a new uptrend toward the pattern target of $1.91.\n\nThe bears are likely to have other plans. They will try to guard the $1.53 level and tug the price below the moving averages. If they manage to do that, the pair could decline to $1.25 and, eventually, to $1.15.\n\nTON/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the $1.53 level may prove to be a stiff barrier for the buyers to cross. If the price turns down from this level but rebounds off the 20-day EMA, it will suggest that the bulls are buying on minor dips. That could improve the odds of a break above $1.53. The pair may then rally to $1.70.\n\nInstead, if the price turns down and breaks below the 20-day EMA, it will signal that traders are booking profits near $1.53. The pair may then drop to the 50-day SMA and, subsequently, to $1.33.\n\nMonero price analysis\n\nMonero’s (XMR) sharp rebound off the uptrend line for the second time in the past few days shows that the bulls are fiercely defending the level.\n\nXMR/USDT daily chart. Source: TradingView\n\nThe XMR/USDT pair could reach the 20-day EMA ($148), which is likely to act as a formidable hurdle. If bulls do not give up much ground from this level, the prospects of a rally above the 20-day EMA increase. The pair may then climb to the 50-day SMA ($157), which could attract selling by the bears.\n\nIf the price turns down sharply from the 20-day EMA, it will suggest that bears continue to sell on rallies. The pair could then retest the uptrend line. The repeated retest of a support level tends to weaken it. If this level gives in, the pair may collapse to $125 and then to $115.\n\nXMR/USDT 4-hour chart. Source: TradingView\n\nThe bulls pushed the price above the moving averages on the four-hour chart, indicating that the bears may be losing their grip. There is a strong resistance at $150, but if this level is scaled, the pair may reach $160. The rising 20-day EMA and the RSI in the positive territory indicate a minor advantage to buyers.\n\nThe first sign of weakness will be a break and close below the moving averages. That could pull the price to the uptrend line. A break below this support could send the pair tumbling to $125.\n\nRelated: FTX suspends user accounts amid Kroll cyber breach concerns\n\nMantle price analysis\n\nMantle (MNT) has been in a strong downtrend since topping out at $0.60 on July 20. The sharp downtrend sent the RSI into oversold territory, indicating that a relief rally was possible.\n\nMNT/USDT daily chart. Source: TradingView\n\nThe outside-day candlestick pattern on Aug. 25 suggests that the buyers are attempting to seize control. The MNT/USDT pair could first rise to the 20-day EMA ($0.45), which is an important level to watch out for. If buyers overcome this obstacle, the pair could rise to the 38.2% Fibonacci retracement level of $0.48.\n\nContrarily, if the price turns down from the 20-day EMA, it will suggest that the bears continue to sell on every minor rally. That could result in a retest of the support at $0.41. If this level cracks, the pair may slide to $0.35.\n\nMNT/USDT 4-hour chart. Source: TradingView\n\nThe four-hour chart shows that the bulls have pushed the price above the moving averages but are struggling to start a runaway rally. This suggests that the bears have not given up, and they may pose a challenge at higher levels.\n\nIf the price breaks below the moving averages, it will signal advantage to bears. That will increase the possibility of a break below $0.41.\n\nAlternatively, if the price sustains above the 20-day EMA, it will indicate that the bulls are buying the minor dips. The pair may then attempt a rally to $0.47 and, subsequently, to $0.52.\n\nQuant price analysis\n\nQuant (QNT) rebounded off the strong support at $95 on Aug. 17 and rose above the moving averages on Aug. 26. This shows a strong demand at higher levels.\n\nQNT/USDT daily chart. Source: TradingView\n\nThe bulls will try to sustain the momentum and push the price to the downtrend line. This level is likely to witness a tough battle between the bulls and the bears. If the price turns down from this level but rebounds off the 20-day EMA ($101), it will signal a change in sentiment from selling on rallies to buying on dips.\n\nThat could increase the likelihood of a rally above the downtrend line. If that happens, the QNT/USDT pair could start a rally to $120. This positive view could invalidate in the near term if the price turns down and plummets below the moving averages. The pair may then slide to the support at $95.\n\nQNT/USDT 4-hour chart. Source: TradingView\n\nThe moving averages on the four-hour chart have turned up and the RSI is in the positive territory, indicating that bulls are on a comeback. The pair could rally to the downtrend line, where the bears may again mount a stiff resistance.\n\nOn the downside, the moving averages are expected to act as strong supports. A break and close below the 50-day SMA will indicate that the recovery may be over. The pair may then slump to $98.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 23,
        "url": "https://news.google.com/rss/articles/CBMidmh0dHBzOi8vd3d3LmNuYmMuY29tLzIwMjMvMDgvMjcvYml0Y29pbnMtbW9zdC1mYWl0aGZ1bC1hcmUtc3RheWluZy1wdXQtZGVzcGl0ZS10aGUtY3J5cHRvLW1hcmtldHMtcmVjZW50LXdlYWtuZXNzLmh0bWzSAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin's most faithful are staying put despite the crypto market's recent weakness - CNBC",
        "content": "Even after a big correction, which followed weeks of almost complete inactivity, and a new focus on real rates, bitcoin's most patient investors are still holding onto their coins. The cryptocurrency closed at $25,972.52 on Friday and lost 0.25% for the week – its eight negative week in the past nine, according to Coin Metrics. It had posted an 11% decline for the previous week. Coin Metrics measures a week in crypto, which trades 24 hours a day, from the 4:00 p.m. ET stock market close one Friday to the next. Bitcoin had been almost completely inactive for several weeks leading up to its violent sell-off on Aug. 17 and many investors expected any of several tailwinds the market has been monitoring to eventually push its price higher. Instead, inflation updates and the possibility of more rate hikes have brought more uncertainty into crypto. \"There is uncertainty ahead, and the Fed will act if inflation data warrants it,\" Oppenheimer's Owen Lau said following Federal Reserve Chair Jerome Powell's speech in Jackson Hole, Wyoming , Friday. \"The part that could upset the crypto market is if interest rates stay higher for longer, which disappoints the expectation that the rate could be lowered in the first half of 2024. Until the Fed sees a sustained progress, not just the inflation reaches 2%, it appears that the Fed will continue to be restrictive.\" Nevertheless, the market has appeared relatively calm. The August dive was the biggest one-day sell-off since the height of the FTX fallout in November. However, an Indicia Labs analysis of social media chatter about crypto shows sentiment only dipped into neutral territory from positive seven full days after the price drop. That decline pales in comparison to the drop that took place in November, when sentiment dropped from positive to neutral in the days leading up to the crash, and slid into \"very negative\" territory four days later. \"There hasn't really been a big change in fundamentals,\" said Gustavo Schwenkler, associate professor at the Leavey School of Business at Santa Clara University and cofounder of Indicia Labs. \"Right now what's really happening is people are just waiting it out. We don't know what's going to happen with the SEC or if there will be new policies potentially. It's been unclear where crypto is going to go in the U.S.\" from a regulatory perspective. On top of the regulatory overhang, JPMorgan said Thursday the bitcoin correction could be \"partly attributed to the broader correction in risk assets such as equities and in particular tech, which in turn appear to have been induced by frothy positioning in tech, higher U.S. real yields and growth concerns about China ,\" but that it \" sees limited downside for crypto markets over the near term.\" Trading data also shows long-term investors haven't been easily shaken by the recent weakness. Investors that have held on to their bitcoin for a year or longer, now make up nearly 70% of bitcoin holders, according to Glassnode. The newest group of long-term holders — specifically, those who have held their bitcoin for one to two years — have fallen (36%) since the beginning of the year, but the number of people who bought between two and three years ago has grown (85.8%). \"The number and percentage of bitcoins that have been held for greater than a year is hovering near all-time highs. This tells us that despite the price volatility and recent downdraft in prices, long-term holders are unwavering. This fact, combined with next April's reward halving, may be the springboard for higher prices in the future,\" Greg Cipolaro, global head of research at NYDIG, the crypto subsidiary of Stone Ridge Asset Management, told CNBC. He added that while it's unclear what exactly accounts for traders' resilience, maturing crypto investors are becoming more \"aware of the cycles associated with bitcoin's halving and are expecting it to repeat, leading to price appreciation.\" —CNBC's Michael Bloom and Nick Wells contributed reporting."
    },
    {
        "id": 24,
        "url": "https://news.google.com/rss/articles/CBMiU2h0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy9zZXB0ZW1iZXItY3Jhc2gtNS10aGluZ3MtYml0Y29pbi1idGMtcHJpY2UtdGhpcy13ZWVr0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "September 'crash' to $22K? — 5 things to know in Bitcoin this week - Cointelegraph",
        "content": "Bitcoin (BTC) starts a new week struggling with $26,000 as August becomes its worst month of 2023.\n\nBTC price strength remains dubious after a snap crash 10 days ago, with bulls unable to wrestle back control of the market to provide a relief bounce.\n\nThe outlook is similarly uncertain, with September traditionally a poorly performing month for Bitcoin, and with the August monthly close just days away, could another downside surprise lie in store?\n\nMacro triggers are again taking a back seat this week, with Personal Consumption Expenditures (PCE) Index data the highlight in what is otherwise a cool week for crypto contagion.\n\nThat said, traders and analysts are on their toes, and with no hint of a rebound in sight, many are still braced for worse to come.\n\nCointelegraph takes a look at the main BTC price performance talking points for the week ahead.\n\nBTC price sags with monthly close in sight\n\nThere are no prizes for guessing how Bitcoin ended its latest weekly candle, especially with prior knowledge of previous closes.\n\nDespite holding $26,000 into the close, BTC/USD immediately went downhill after that, wicking to $25,880 before consolidating slightly higher, data from Cointelegraph Markets Pro and TradingView shows.\n\nBTC/USD 1-hour chart. Source: TradingView\n\nThat marked multiday lows, part of what popular trader Skew forecasted could be pressure from shorters into the new week.\n\n“Shorts continue to stack into the weekend, expecting some kind of move around US Futures open and into Monday EU session,” part of X (formerly Twitter) analysis read.\n\nSkew additionally described weekend BTC behavior as “max pain price action.”\n\nThe monthly close was a key topic for market participants, with volatility on the cards after August produced 11% losses.\n\nKeith Alan, co-founder of monitoring resource Material Indicators, predicted a trip to multimonth lows.\n\n“Whales aren’t buying yet, and neither am I,” he commented alongside a chart of the Binance BTC/USD order book.\n\n“Expecting volatility to continue through the monthly candle close. Patiently waiting to test the local low.”\n\nIn addition to low whale order volume, the accompanying order book chart showed a lack of bid liquidity overall, with $25,500 gaining only modest interest.\n\nBTC/USD order book data for Binance. Source: Keith Alan/X\n\n“I am looking for a trigger to enter where we drop to $25,000 lows, reclaim and pump,” popular trader Crypto Tony agreed.\n\n“Or if we flip $26,700 into support. No entry before that on #Bitcoin as we are just mid range, so no safe entry just yet.”\n\nBTC/USD annotated chart. Source: Crypto Tony/X\n\nBeyond the downside, moving averages that previously acted as support before the crash may now have the opposite effect, popular trader and analyst Rekt Capital warned.\n\n“The BTC bullish momentum moving averages may act as resistance,” he summarized alongside the weekly chart.\n\nBTC/USD annotated chart. Source: Rekt Capital/X\n\nFurther analysis hoped for a lower low construction to appear on weekly timeframes in what could be part of a “subtle rising wedge.”\n\nBTC/USD annotated chart. Source: Rekt Capital/X\n\nAugust risks being worst in eight years\n\nIt is no secret that Bitcoin has underperformed this month — even by August standards, which have rarely given bulls anything to celebrate.\n\nBTC/USD is down 11% this month, and with the weekly close around the corner, anticipation is building among market observers.\n\nA look at comparative data from monitoring resource CoinGlass reveals that August 2023 is already vying with last year to become Bitcoin’s worst August since 2015. BTC price shed 13.9% in August 2022, a move which marked the beginning of half a year of pain.\n\nBTC/USD monthly returns (screenshot). Source: CoinGlass\n\nHowever, some believe that September could easily end up almost as bad based on historical precedent.\n\n“Could Bitcoin Crash to $22,000 In September?” Rekt Capital queried last week in part of an X post.\n\n“To answer this question, we need to first focus on August. What was the worst BTC August drawdown in history? -17% in 2014 and -18% in 2015. Currently in 2023, $BTC is now down -16%. If BTC were to drop -18% this August, BTC would drop to ~$24700. But that might not be the end of the retrace.”\n\nContinuing, Rekt Capital noted that September usually offers a “single-digit drawdown.” Against the backdrop of its recent double top on weekly timeframes, a $22,000 target lines up.\n\n“So if BTC retraces, say, an additional -10% in September... That would mean price would drop to ~$22200,” he concluded.\n\n“Then that would approximately match the Measured Move target for the Double Top breakdown of ~$22000.”\n\nBTC/USD annotated chart. Source: Rekt Capital/X\n\nBitcoin’s “longest bear market in history”\n\nAnalyzing year-on-year (YoY) percentage returns for BTC/USD, meanwhile, the true extent of the recent bear market becomes clear.\n\nMichaël van de Poppe, founder and CEO of trading firm Eight, concluded that it has, in fact, been Bitcoin’s “longest bear market in history.”\n\n“The current bear market is relatively comparable to what we’ve witnessed in 2015. A period of sideways action, where the faith in crypto is slowly getting lost too, despite the fact of solid fundamental growth,” he wrote in recent thoughts on the crypto market.\n\n“Right now, price of Bitcoin is nowhere near the valuation of the peak in November ’21. It’s down more than 50% and in a bear market of 490 days.”\n\nAn accompanying chart compared the current 490-day negative YoY returns to previous periods, with 2015 lasting 386 days.\n\nVan de Poppe added that even positive news events, such as the future green-lighting of the United States’ first Bitcoin spot price exchange-traded fund (ETF), had not yet entered market consciousness.\n\n“The thing is, during the current period, these events are not being reflected in price at all,” he wrote.\n\n“They lag behind as the market is stuck in the ‘bear market modus‘, as the past 2 years price has been falling.”\n\nBTC/USD YoY performance annotated chart. Source: Michaël van de Poppe/X\n\nPCE data follows muted crypto Jackson Hole reaction\n\nBitcoin and altcoins have displayed precious little regard for macroeconomic developments in recent weeks.\n\nEven Federal Reserve interest rate changes and data releases such as the Consumer Price Index (CPI) have had a barely perceptible impact on markets.\n\nLast week’s comments from Fed Chair Jerome Powell at the annual Jackson Hole Economic Symposium continued the trend, even as CME Group’s FedWatch Tool showed bets of a pause in rate hikes beginning next month at above 80%.\n\nFed target rate probabilities chart. Source: CME Group\n\nThis week, despite containing the Fed’s preferred inflation gauge in the form of PCE, could well end up no different.\n\nPCE data is due on Aug. 31, hours before the Bitcoin monthly close, with Sep. 1 offering nonfarm payrolls and unemployment data.\n\nHuge week for ALL things related to economic data, volatility is back.\n\n\n\nJobs, inflation, housing data and more.\n\n\n\nWe're publishing our trades for the week shortly.\n\n\n\nIn 2022, our calls made 86%.\n\n\n\nSubscribe to access our analysis and see what we're trading:https://t.co/SJRZ4FrfLE — The Kobeissi Letter (@KobeissiLetter) August 27, 2023\n\nFor macro markets, however, financial commentary resource The Kobeissi Letter promised an “action packed week.”\n\n“Huge week for ALL things related to economic data, volatility is back,” it summarized in part of its latest X analysis.\n\nRecord hash rate reflects “miner bull run”\n\nCould Bitcoin miners already be providing a silver lining for bulls into the end of the year?\n\nRelated: Bitcoin velocity hits lows last seen before Q4 2020 BTC price breakout\n\nAs Cointelegraph reported, one theory expects that Q4 will see miners bidding Bitcoin higher in preparation for the April 2024 block subsidy halving, which will cut their reward per mined block by 50%.\n\nThey should join “smart money” in doing so, creating a buzz of its own around the halving narrative, even if the broader market only tends to react to emission changes post-factum.\n\nContinuing the debate, James Straten, research and data analyst at crypto insights firm CryptoSlate, noted that Bitcoin hash rate is already headed into uncharted territory.\n\n“The Bitcoin hash rate just hit 400 th/s for the first time ever. It is mind-blowing, considering the energy issues in Texas and the cost of electricity surging worldwide,” he told X subscribers.\n\n“This is the miner bull run leading up to the halving next year. Similar explosive hash rate growth that led up to the 2020 halving.”\n\nBitcoin hash rate annotated chart. Source: James Straten/X\n\nHash rate is an estimation of the processing power dedicated to mining, and while impossible to measure exactly, figures from on-chain analytics firm Glassnode show not only new all-time highs but a spate of upward adjustments contrasting with flat or downward-trending BTC price performance.\n\nLast week, Bitcoin also saw one of its largest upward difficulty adjustments of 2023, taking the on-chain fundamental yardstick to all-time highs of its own.\n\nThis article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision."
    },
    {
        "id": 25,
        "url": "https://news.google.com/rss/articles/CBMipAFodHRwczovL3d3dy5hbGxlbm92ZXJ5LmNvbS9lbi1nYi9nbG9iYWwvbmV3cy1hbmQtaW5zaWdodHMvcHVibGljYXRpb25zL2RvLWJpdGNvaW4tZGV2ZWxvcGVycy1vd2UtZmlkdWNpYXJ5LWR1dGllcy10by1hc3Npc3Qtb3duZXJzLXRoYXQtaGF2ZS1sb3N0LXRoZWlyLXByaXZhdGUta2V5c9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Do Bitcoin developers owe fiduciary duties to assist owners that have lost their private keys? - Allen & Overy",
        "content": "In February 2023, the Court of Appeal of England and Wales decided that the claim should proceed to trial as there is a serious issue to be tried (Tulip Trading Limited v Van Der Laan and ors [2023] EWCA Civ 83).In this article, first published by the Butterworths Journal of International Banking and Financial Law, associate Mohamed Sacranie challenges the Court of Appeal’s decision and argues that Bitcoin developers are not fiduciaries.To read the article, please download the PDF below."
    },
    {
        "id": 27,
        "url": "https://news.google.com/rss/articles/CBMiTmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ibG9nL3doYXQtZG9lcy1hLWJpdGNvaW4tbG9vay1saWtlLWFsbC15b3UtbmVlZC10by1rbm93L9IBUmh0dHBzOi8vYW1iY3J5cHRvLmNvbS9ibG9nL3doYXQtZG9lcy1hLWJpdGNvaW4tbG9vay1saWtlLWFsbC15b3UtbmVlZC10by1rbm93L2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "What Does a Bitcoin Look Like? All You Need to Know - AMBCrypto Blog",
        "content": "Bitcoin (BTC), a term that has become synonymous with the buzzword “cryptocurrency,” has garnered significant attention since its inception in 2008.\n\nIts popularity has prompted many to question: What does a Bitcoin look like Does it have a physical form? How can you conduct transactions?\n\nThis article delves into the digital world of Bitcoin and provides comprehensive insights into its workings.\n\nWhat does Bitcoin look like?\n\nBitcoin, a digital currency, doesn’t have a physical form like traditional coins or notes. Instead, it exists solely in a digital format. It is represented by a string of alphanumeric characters, typically starting with the number “1” or “0”.\n\nThese characters serve as a unique identifier for each Bitcoin wallet. Bitcoin transactions involve transferring ownership of these digital tokens from one wallet to another, recorded on the blockchain.\n\nWhile Bitcoin itself doesn’t have a physical appearance, its symbol – ₿ – is commonly used to represent it. The symbol is similar to the letter “B” with two vertical lines through it.\n\nBitcoin uses this symbol in graphics, logos, and designs associated with Bitcoin.\n\nIn essence, Bitcoin’s “look” is the arrangement of characters and numbers in its wallet addresses and its symbolic representation, which have become recognizable in the digital financial world.\n\nThe absence of a physical presence is a defining characteristic of cryptocurrencies, highlighting their digital nature and decentralized functionality.\n\nUnderstanding Bitcoin: A virtual asset\n\nThe first thing to comprehend about Bitcoin is that it is not a physical entity but a completely digital asset. It functions as an electronic cash system developed by an anonymous individual or group of people known as Satoshi Nakamoto.\n\nThe primary intention behind Bitcoin’s creation was to establish a monetary system that operated independently of any government, authority, or middleman, such as banks.\n\nBitcoin is essentially an open-source software that allows users to perform transactions using digitally signed codes.\n\nThese codes represent the conditional statements of Bitcoin. Therefore, the first and foremost answer to the question, “What does Bitcoin look like?” is that it appears as numerous lines of code.\n\nBlockchain: The Visual Ledger of Transactions\n\nAt the heart of Bitcoin lies the blockchain, a decentralized and distributed ledger that logs all transactions across a network of computers.\n\nEvery block within the blockchain comprises a roster of transactions, and when connected, they create a visible chain.\n\nExamining the blockchain visually unveils the transparency and immutability that define Bitcoin transactions.\n\nThe Mysterious Origins of Bitcoin\n\nBitcoin was launched in 2009 by an individual or group operating under the pseudonym Satoshi Nakamoto. The true identity of Nakamoto remains a mystery, adding to the enigma surrounding Bitcoin.\n\nDespite this mystery, the open-source nature of Bitcoin’s software means that anyone can view, use, or contribute to the code.\n\nBitcoin transactions: The underlying mechanism\n\nWhile Bitcoin transactions may seem straightforward at first glance, they involve a complex process. When a user initiates a payment, the network and the Bitcoin wallet undergo a series of steps to ensure the accurate amount reaches the recipient’s wallet.\n\nA typical Bitcoin transaction comprises three main elements:\n\nA transaction input: The Bitcoin address from which helps to send the BTC.\n\nA transaction output: The Bitcoin address to which helps to send the BTC.\n\nThe amount: The quantity of Bitcoins involved in the transaction.\n\nThe transaction input and output are essentially Bitcoin addresses, and these addresses are lines of alphanumeric codes. Each address is unique and tied to a specific Bitcoin wallet.\n\nThe genesis of Bitcoin mining: The first block\n\nBlockchain technology is the foundation of Bitcoin. Using this technology, a decentralized, open ledger can create Bitcoin transactions. A network of nodes computers running the Bitcoin software—maintains this ledger.\n\nThe Genesis Block also referred to as Block 0, is the first Bitcoin block ever mined and is the base of the Bitcoin trading system.\n\nIt was developed in 2009 by Satoshi Nakamoto and established the standard for trading Bitcoin. Models of subsequent blocks in the Bitcoin blockchain after the Genesis Block.\n\nBitcoin wallet: Your digital vault\n\nIn the Bitcoin universe, a digital wallet plays a crucial role. It is essentially a software where you store Bitcoins. The wallet facilitates the sending and receiving of Bitcoins and grants the user ownership of the Bitcoin balance.\n\nA Bitcoin wallet can exist in various forms – desktop wallets installed on a computer, mobile wallets on smartphones, web wallets accessible via a browser, and hardware wallets that store Bitcoins on a physical device.\n\nEvery Bitcoin wallet has a unique string of 26-35 alphanumeric characters known as the wallet address. This address can transfer Bitcoins to another address on the network.\n\nBitcoin’s environmental impact: A growing concern\n\nOne of the criticisms that Bitcoin often faces pertains to its environmental impact. The Bitcoin mining process can consume a significant amount of energy.\n\nSome estimates equate the amount of CO2 generated by the Bitcoin network to that of a large Western city or an entire developing country.\n\nSafety and security of Bitcoins\n\nBitcoin transactions rely on the SHA-256 algorithm, designed by the US National Security Agency. The cryptographic nature of Bitcoin makes it virtually impossible to crack.\n\nHowever, Bitcoin operates without any central authority, which means there is no recourse in case of an error with a transaction or loss of password.\n\nFrequently Asked Questions (FAQs)\n\nQ: Is Bitcoin real money?\n\nA: Even though Bitcoin doesn’t exist in physical form, it can effectively operate as real money and is recognized as legal tender in certain countries, like El Salvador.\n\nHowever, in many parts of the world, you can’t simply stroll into any store or café and use your Bitcoin wallet for transactions.\n\nNevertheless, the acceptance of Bitcoin is expanding, and it’s increasingly common to find merchants and service providers embracing Bitcoin payments.\n\nQ: How can you tell a fake Bitcoin?\n\nA: The possibility exists that someone might create a malicious fork of the Bitcoin blockchain, attempting to present it as a genuine article to unsuspecting users.\n\nIf you harbor suspicions about the authenticity of your Bitcoin wallet, consider creating a new one and conducting a test transaction. If the transaction goes through and is visible on a Bitcoin block explorer, you’re dealing with authentic Bitcoin.\n\nEncountering fake Bitcoin is highly improbable. In reality, most cryptocurrency scams employ different tactics to pilfer funds from unsuspecting users.\n\nCommonly, scammers persuade users to deposit their Bitcoin into an “investment platform,” promising significant returns. Once the Bitcoin is deposited, the scammers vanish, leaving the victim with stolen funds.\n\nBe wary of promises of guaranteed returns in exchange for sending Bitcoin – such propositions are almost certainly scams.\n\nQ: What does the code for Bitcoin look like?\n\nA: Bitcoin implementations can be coded in various programming languages. Satoshi Nakamoto’s initial Bitcoin implementation was crafted in C++, and this programming language is also employed by Bitcoin Core, recognized as the primary implementation of Bitcoin.\n\nSumming up\n\nDespite its complexities and criticisms, Bitcoin continues to thrive and revolutionize the financial landscape. It has paved the way for other cryptocurrencies and has even garnered the attention of prominent businesses and financial institutions. With its growing acceptance, Bitcoin can redefine the concept of currency in the digital age.\n\nIn conclusion, BTC is a revolutionary digital currency that challenges traditional notions of transactions and economies.\n\nHowever, it doesn’t have a physical form but exists as lines of code in a decentralized network. Furthermore, while it can be complex to understand, it represents a gigantic step towards a future where financial systems are more transparent, efficient, and inclusive."
    },
    {
        "id": 29,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vZGFpbHljb2luLmNvbS9iaXRjb2luLWZhaXRoZnVsLXRlc3RlZC1ieS1sb25nZXN0LWJlYXItbWFya2V0LWluLWhpc3Rvcnkv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Faithful Tested by Longest Bear Market in History - DailyCoin",
        "content": "The current bear market has lasted 490 days and counting.\n\nInvestor sentiment remains risk-averse due to macroeconomic uncertainty.\n\nBitcoin fundamentals continue to mature.\n\nSince November 2021’s peak, the total crypto market cap has seen a peak-to-trough fall of 74%, wiping out trillions in valuations consequently resulting in pain and anguish for investors worldwide. Although prices have somewhat recovered from the lows of the post-FTX crash, the ongoing bear market has become the longest in Bitcoin history. As Michaël van de Poppe highlighted, the intense period is testing the faith of even the most die-hard crypto enthusiasts.\n\nThe Longest Bitcoin Bear Market in History\n\nMacroeconomic uncertainty continues to cast a bear-shaped shadow over the crypto markets. Despite intermittent periods of rallying prices during the downtrend, investor sentiment remains overwhelmingly risk-averse as the Fed’s rate hike policy shows no signs of pivoting soon, and stubborn inflation works to dampen investor appetite.\n\nCommenting on this situation, CEO and founder of MN Trading, Michaël van de Poppe, underlined that Bitcoin’s price is down significantly from November 2021’s $69,000 all-time high and has been embroiled in a bear market spanning 490 days ever since, marking the most prolonged bear period in its history.\n\nInforming van de Poppe’s commentary is Glassnode data on Bitcoin’s year-on-year (YoY) percentage price change. The chart illustrates YoY growth since late 2014, highlighting the previous negative bear periods. As shown, the bear market of 2015 lasted for 386 days, 2019’s traders had to endure for 204 days, and the slump seen in mid-2020 was broken after just 37 days.\n\nAs far as persistent negative price growth is concerned, indicators suggest that the current period is a time for consolidation and reassessment of the risks and rewards of cryptocurrency investing.\n\nCrypto’s Cyclical Nature\n\nIn a bid to soothe investor hurt, van de Poppe touched on the pain of depressed prices and the feelings that accompany them, acknowledging that it is in such times that one’s faith in crypto is truly tested.\n\n“It might feel like a ghost town in crypto. It might feel like there’s not even going to be a bull cycle anymore, and I understand why these thoughts are there.” Said van de Poppe.\n\nVan de Poppe highlighted that markets are cyclical, and a period of renewed expansion has historically followed the bad times. Moreover, during the current bear period, Bitcoin’s fundamentals have leveled up, with van de Poppe citing the flurry of recent spot ETF applications, institutional investment in mining companies, and the Hong Kong government’s pro-crypto stance as supportive indicators.\n\nOn the Flipside\n\nBlackRock is a major shareholder in four out of the five biggest Bitcoin mining companies .\n\nHong Kong regulators recently granted the first retail crypto exchange licenses in the region to HashKey and OSL.\n\nWhy This Matters\n\nThere is no guarantee that the bull market will return, but governments and institutions are demonstrating confidence in the long-term potential of digital assets.\n\nLearn more about the past bear cycles here:\n\nWhen Will This Bear Market End?\n\nDiscover Dropbox’s response to abuses of its unlimited storage service here:\n\nUnlimited Storage No More: Dropbox’s Response to Crypto Cloud Mining"
    },
    {
        "id": 30,
        "url": "https://news.google.com/rss/articles/CBMiUGh0dHBzOi8vY29pbnRlbGVncmFwaC5jb20vbmV3cy90ZXRoZXItY3RvLXBhb2xvLWFyZG9pbm8tYml0Y29pbi1taW5pbmctbG9jYXRpb25z0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Tether CTO stays silent on Bitcoin mining locations - Cointelegraph",
        "content": "Paolo Ardoino, the chief technology officer of stablecoin issuer Tether, recently found himself addressing rumors about images of large industrial containers online, leading him to reject questions about where Tether is mining Bitcoin (BTC).\n\nIn an Aug. 26 X (formerly Twitter) post, Ardoino shed light on the curiosity sparked by the photo he shared on Aug. 24. The image displayed a container with a photoshopped Tether Energy logo, leaving many people pondering over what it’s all about.\n\nOne of #Tether energy production and #Bitcoin mining sites coming along well. pic.twitter.com/6Z8o6A5OaE — Paolo Ardoino (@paoloardoino) August 24, 2023\n\nHe clarified that the photo shows a control room at one of Tether’s Bitcoin mining sites that it is currently completing and will soon begin operations at.\n\nHowever, Ardoino firmly stated he would not disclose the location, responding to numerous users who have inquired about it.\n\nWhile he did mention that the site is somewhere in the continent of South America, he added no further details due to security reasons.\n\n“Where? In LATAM. We tend to not share exact locations to avoid personnel harassment, a valid concern given the amount of detractors obsessed with Tether,” he declared, admitting that it has led to many Tether skeptics questioning its legitimacy:\n\n“You can almost hear some of them screaming: ‘NOOOOOOOO if you don’t tell us the address, zip code, surname of the cow that is eating the grass nearby, then it’s not real!!!!!‘”\n\nHe addressed doubters who were curious about the photoshopped logo appearing on the containers, explaining that it was a deliberate media decision.\n\n“We thought that the photo would have been shared on newspapers so the team wanted to brand it,” Ardoino noted. However, he believes having logos displayed at the mining sites would not be a wise approach from a security standpoint:\n\n“Moreover, putting gigantic Tether logos would not be great from physical privacy of the site point of view.”\n\nHe anticipates operations to commence sometime in September.\n\n“The site is progressing well, everyone in the team is super excited and working around the clock to start operations in the next few weeks,” he declared.\n\nRelated: Mining 1 BTC in Lebanon is 783x cheaper than Italy: CoinGecko report\n\nThis comes after news that Tether is developing mining software aimed at providing more transparency within the Bitcoin mining industry.\n\nIn an interview with Cointelegraph on Aug. 17, Ardoino explained that Tether is working on a mining software called Moria that provides more comprehensive data analytics on energy production at Bitcoin mining sites.\n\nArdoino highlighted the need for better analytics and performance review in Bitcoin mining. He believes Moria will assist with evaluating the site’s performance and surrounding environment:\n\n“If energy used by the mining site is wind or solar, there are optimization parameters, like predicted speed of wind for a specific day or a specific hour of the day, that could be used to overclock some of the miners and boost the production.”\n\nMagazine: Bitcoin miner gets life in prison, China offers bounties for crypto firms: Asia Express"
    },
    {
        "id": 32,
        "url": "https://news.google.com/rss/articles/CBMiP2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLW11dGVkLTI1OTAwL9IBQ2h0dHBzOi8vd3d3Lm5ld3NidGMuY29tL2FuYWx5c2lzL2J0Yy9iaXRjb2luLXByaWNlLW11dGVkLTI1OTAwL2FtcC8?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin Price Relatively Muted, What Are Chances of Recovery? - NewsBTC",
        "content": "Bitcoin price is stuck in a tiny range above the $25,900 support. BTC could start a decent increase if there is a close above $26,200 and then $26,500.\n\nBitcoin is struggling to clear the $26,500 resistance zone.\n\nThe price is trading below $26,200 and the 100 hourly Simple moving average.\n\nThere is a connecting bearish trend line forming with resistance near $26,070 on the hourly chart of the BTC/USD pair (data feed from Kraken).\n\nThe pair could attempt a fresh increase if it clears $26,150 and $26,200.\n\nBitcoin Price Eyes Fresh Increase\n\nBitcoin price tried to settle above the $26,500 resistance level. However, BTC failed to stay above $26,500 and started a fresh decline.\n\nThere was a move below the $26,250 pivot level. The price declined below the 50% Fib retracement level of the upward move from the $25,360 swing low to the $26,780 high. It seems like the price is now stuck in a tiny range above the $25,900 support zone.\n\nBitcoin is now trading below $26,200 and the 100 hourly Simple moving average. There is also a connecting bearish trend line forming with resistance near $26,070 on the hourly chart of the BTC/USD pair.\n\nOn the upside, immediate resistance is near the $26,100 level, the trend line, and the 100 hourly Simple moving average. The first major resistance is now near the $26,200 level, above which the price might rise toward the $26,500 resistance.\n\nSource: BTCUSD on TradingView.com\n\nTo start a strong increase, the price must settle above the $26,500 resistance. In the stated case, the price could test the $27,000 level. Any more gains might set the pace for a larger increase toward $27,800.\n\nMore Losses In BTC?\n\nIf Bitcoin fails to clear the $26,200 resistance, it could continue to move down. Immediate support on the downside is near the $25,900 zone or the 61.8% Fib retracement level of the upward move from the $25,360 swing low to the $26,780 high.\n\nThe next major support is near the $25,400 level. A downside break below the $25,400 level might push the price further lower. In the stated case, the price could drop toward $24,800.\n\nTechnical indicators:\n\nHourly MACD – The MACD is now losing pace in the bearish zone.\n\nHourly RSI (Relative Strength Index) – The RSI for BTC/USD is now below the 50 level.\n\nMajor Support Levels – $25,900, followed by $25,400.\n\nMajor Resistance Levels – $26,200, $26,500, and $27,000.\n\nDisclaimer: The article is provided for educational purposes only. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any investments and naturally investing carries risks. You are advised to conduct your own research before making any investment decisions. Use information provided on this website entirely at your own risk."
    },
    {
        "id": 33,
        "url": "https://news.google.com/rss/articles/CBMiVmh0dHBzOi8vZmluYm9sZC5jb20vMTYtYml0Y29pbi1taW5pbmctY29tcGFuaWVzLWhhdmUtNC00Ny1iaWxsaW9uLWluLWxvc3Nlcy1pbi1hLXllYXIv0gEA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "16 Bitcoin mining companies have $4.47 billion in losses in a year - Finbold - Finance in Bold",
        "content": "Amid a challenging 12 months for Bitcoin (BTC), with the leading cryptocurrency being traded as low as $15,480 in the last quarter of 2022, after reaching its all-time high of $69,000 one year before, the Bitcoin mining industry is also struggling to keep their operations going with negative reported earnings.\n\nData retrieved by Finbold from CompaniesMarketCap shows that the 16 publicly traded Bitcoin mining companies have accumulated over $4.47 billion in losses in the past 12 consecutive months (TTM).\n\nCore Scientific (OTC:CORZQ) is the top loser with $1.66 billion in losses for the period. Followed by the two largest Bitcoin mining companies by market capitalization, which are both owned by BlackRock (NYSE: BLK), a recent major shareholder in the Bitcoin mining industry.\n\nBoth Marathon Digital Holdings Inc. (NASDAQ:MARA) and Riot Platforms Inc. (NASDAQ:RIOT) accumulated over $600 million in losses year-over-year (YoY) each. All nine Bitcoin mining companies with bigger losses have negative yearly results of over $100 million.\n\nTop publicly traded Bitcoin mining companies by earning. Source: CompaniesMarketCap\n\nCanaan Inc (NASDAQ:CAN) is the only positive company among the 16 industry leaders, with $92.33 million in earnings for the last 12 months.\n\nBitcoin mining industry at a loss\n\nThe Bitcoin mining difficulty increased by 6.17% on August 22, reaching an all-time high of 55.62 trillion hashes.\n\nWith a sustained increase in mining difficulty over time, Bitcoin miners are working ‘underwater,’ as the average cost to mine one single BTC has been superior to the average price of 1 BTC in the spot market year-over-year since August 2022.\n\nThe average mining cost is calculated by Cambridge University and plotted in a chart by MacroMicro. On August 27, it registered an average cost of $45,877 per mined BTC, against a spot price of $26,089 on the same day — accounting for a loss of $19,588 per unit of the leading cryptocurrency produced coins.\n\nBitcoin Average Mining Costs. Sources: MacroMicro and Cambridge University\n\nNotably, the challenges faced by the Bitcoin mining industry not only negatively affect each of these companies, but could also impact the whole Bitcoin ecosystem. Possibly affecting its decentralization and security, as well as the market’s perception of the value of BTC as a reserve currency and digital asset.\n\nExpected to happen in April 2024 is the Bitcoin halving, which will halve (cut by half) the block subsidy paid to miners for each mined block. Lowering, even more, the Bitcoin mining companies earnings unless there is a meaningful surge in price for BTC."
    },
    {
        "id": 35,
        "url": "https://news.google.com/rss/articles/CBMiuQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vaW5kdXN0cnkvYmFua2luZy9maW5hbmNlL2NyeXB0by1kcmFtYS11bmZvbGRzLWJpbmFuY2UtYm5iLWNvbm5lY3RzLWdvb2RieWUtYml0Y29pbi1idGNzLXNpbGVudC1wbGF5LWFuZC1wb21lcmRvZ2UtcG9tZHMtcmlzaW5nLXN0YXIvYXJ0aWNsZXNob3cvMTAzMTQyMTA1LmNtc9IBvQFodHRwczovL20uZWNvbm9taWN0aW1lcy5jb20vaW5kdXN0cnkvYmFua2luZy9maW5hbmNlL2NyeXB0by1kcmFtYS11bmZvbGRzLWJpbmFuY2UtYm5iLWNvbm5lY3RzLWdvb2RieWUtYml0Y29pbi1idGNzLXNpbGVudC1wbGF5LWFuZC1wb21lcmRvZ2UtcG9tZHMtcmlzaW5nLXN0YXIvYW1wX2FydGljbGVzaG93LzEwMzE0MjEwNS5jbXM?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Crypto Drama Unfolds: Binance (BNB) Connect's Goodbye, Bitcoin (BTC)'s Silent Play, and Pomerdoge (POMD)'s - The Economic Times",
        "content": "In this article, we'll take a look at the latest news from the world of crypto. There's been a lot going on in the space lately, from Binance (BNB) launching its Connect platform to Bitcoin (BTC)'s sudden drop after a month of low volatility.\n\nClick Here To Find Out More About The Pomerdoge (POMD)\n\nPomerdoge (POMD): Meme Magic Meets Real-World Earnings\n\nThe recent buzz in the cryptocurrency space is unmistakably of Pomerdoge, which has managed to sell millions of tokens in the first weeks of launch. But what is it?\n\nPomerdoge is blending the charm of meme culture with genuine utility. Pomerdoge is positioning itself as a new-age cryptocurr\n\nency.\n\nThe initial phase of the Pomerdoge token is at a starting price of $0.009. This provides early participants an opportunity to get in at a favorable valuation before the token price rises in subsequent phases.\n\nIndustry experts have highlighted the fervor around Pomerdoge's, drawing parallels with the initial buzz of Pepe and Dogecoin. However, there's a twist: Pomerdoge is more than a mere meme; it brings to the table a vibrant ecosystem packed with genuine earning and interaction avenues, appealing to both meme aficionados and dedicated crypto investors.\n\nPomerdoge's unique blend of entertainment and practicality sets it on track to potentially steal the limelight in the 2023 memecoin realm. With market commentators predicting its breakthrough and projecting a $1.00 valuation by the close of the year, Pomerdoge appears set for a remarkable upswing.\n\nThe Binance (BNB) Shake-Up: Regulatory Hurdles and Payment Woes\n\nBinance Connect, a division of the Binance exchange focused on regulatory-compliant buy-and-sell crypto activities, has announced its discontinuation due to its main provider ending card payment support.\n\nSimultaneously, Binance Australia briefly suspended its fiat operations, citing issues with an external partner. Over in Europe, Binance faced regulatory headwinds when German authorities rejected its application for a crypto custody license in June.\n\nLegal woes have also mounted for Binance. The exchange is currently navigating lawsuits from the U.S. Securities and Exchange Commission and the DoJ. Both regulatory bodies allege that Binance took part in unauthorized activities within the U.S.\n\nIn light of these setbacks, Binance's token has taken a hit — from $350 in April to a current price of $217. Analysts note that the $200 support level is Binance's last line of defense before a HUGE bearish drop to $100 or lower.\n\nBitcoin (BTC) Breaks Its Silence While Pomerdoge (POMD) Benefits\n\nBitcoin's erratic nature took a pause over the last few months. This indicates an unprecedentedly stable trading phase for the typically unpredictable Bitcoin market.\n\nPricewise, Bitcoin was wavering between $28,800 and $31,800 for more than two months. This static trend resulted in a notably reduced 30-day annualized volatility rate for Bitcoin, standing at just 17%.\n\nHowever, this tranquility was recently disrupted when Bitcoin's price nosedived from $29,100 to $25,600 in just three days. While some investors see the current Bitcoin price of $26,000 as a buying opportunity, others are expecting the revolt to continue, especially after breaking out after such a long time spent in a tight range.\n\nas investors seek out alternative and more reliable investments. It makes sense as Pomerdoge is unaffected by the crypto market's whims and appears to be on an upward trajectory.\n\nFind out more about the Pomerdoge (POMD) Today\n\nWebsite: https://pomerdoge.com/\n\nTelegram Community: https://t.me/pomerdoge\n\nDisclaimer:\n\nThis is an advertorial. BCCL disclaims any and all warranties - expressed or implied - relating to the content and does not guarantee, vouch for, or endorse any of the content. The content does not promote, suggest or present Crypto products to be a way to solve financial difficulties / achieve financial security / act as an alternative to employment / income opportunity. Crypto products, crypto currencies, NFTs are unregulated and may be risky, with no legal recourse in case of monetary loss. Views expressed herein are independent opinions based on studies. You may act at your own risk while relying on the content of this advertorial. Should you make a decision to act, or omit to act, you should seek appropriate legal advice in the relevant jurisdiction.\n\nDisclaimer: Content Produced by IPD"
    },
    {
        "id": 36,
        "url": "https://news.google.com/rss/articles/CBMiWmh0dHBzOi8vZmluYm9sZC5jb20vYmxhY2tyb2NrLWlzLWEtbWFqb3Itc2hhcmVob2xkZXItaW4tNC1vZi10aGUtNS1sYXJnZXN0LWJpdGNvaW4tbWluZXJzL9IBAA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "BlackRock is a major shareholder in 4 of the 5 largest Bitcoin miners - Finbold - Finance in Bold",
        "content": "BlackRock (NYSE: BLK) — one of the largest investment companies in the world — is positioning itself in the Bitcoin (BTC) mining industry. The investment giant is already the second-largest shareholder in four out of the five biggest Bitcoin miners by market capitalization.\n\nAccording to the CompaniesMarketCap Index, the five largest Bitcoin miners sum up to $5.4 billion in market capitalization, and have registered massive losses in the last 30 days:\n\nRiot Platforms Inc. (NASDAQ:RIOT): $1.92 billion market cap Marathon Digital Holdings Inc (NASDAQ:MARA): $1.83 billion market cap Cipher Mining Inc (NASDAQ:CIFR): $0.74 billion market cap Hut 8 Mining Corp (NASDAQ:HUT): $0.50 billion market cap Terawulf Inc (NASDAQ:WULF): $0.41 billion market cap\n\nTop 5 Bitcoin mining companies by market cap. Source: CompaniesMarketCap\n\nBlackRock is buying the dip for Bitcoin mining companies\n\nThe Bitcoin mining industry is going through a delicate moment as the mining difficulty continues to increase, also increasing the costs of the activity and reducing the expected profits for the majority of Bitcoin miners — who are, on average, operating ‘underwater’ for over a year.\n\nBitcoin average mining costs. Source: MacroMicro\n\nInterestingly, the struggles for small and medium miners can also pose an opportunity for larger companies with easier access to capital, that are able to survive and grow in challenging times. An opportunity that seems to have been spotted by BlackRock, which continues to increase its position as a major shareholder among the largest four mining companies in the United States.\n\nData retrieved by Finbold from CNN shows that BlackRock Fund Advisors increased their position in these Bitcoin miners on June 30, consolidating their second place as the largest shareholders position, as follows:\n\nRIOT: 10,749,369 shares (6.14%), for a total value of $199.08 million; MARA: 10,938,032 shares (6.44%), for a total value of $190 million; CIFR: 2,200,654 shares (0.88%), for a total value of $8.36 million; WULF: 4,831,312 shares (2.28%), for a total value of $14.10 million.\n\nNotably, the built position suming to a total value of around $411.54 million, equals to a small share of 0.35% of the $117.6 billion in assets that BlackRock holds, as reported in 2022.\n\nThis current position also makes the BlackRock Funds Advisors a major member of the Bitcoin Mining Council, a lobbying group for the Bitcoin mining industry in the US."
    },
    {
        "id": 37,
        "url": "https://news.google.com/rss/articles/CBMiWGh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi10by1oaXQtNTAwMDAtYnktdGhlLWVuZC1vZi0yMDIzLWlmLXRoaXMtcGF0dGVybi1pcy1yZXBlYXRlZC_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Sun, 27 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin to hit $50,000 by the end of 2023 if this pattern is repeated - Finbold - Finance in Bold",
        "content": "As Bitcoin’s (BTC) price continues to grapple with uncertainty regarding its next movement, the market remains uncertain whether the asset will experience an upward or downward momentum. Amidst this uncertainty, historical price patterns suggest the potential for the asset to rally by over 90% from its current value by the end of the year.\n\nIn this line, an analysis posted on TradingView by TradingShot on August 25 suggested that Bitcoin could reach a value of $50,000 by the conclusion of 2023. The analysis centers around the moving average convergence divergence (MACD) bullish cross that took place in the one-month timeframe around two months ago. This cross sheds light on historical parallels that might indicate a significant rally in the future.\n\nBitcoin price analysis chart. Source: TradingView\n\nAccording to the analyst, the pattern mirrors a historical context dating back to 2014, identifying three prior instances when the one-month MACD formed a bullish cross. On these occasions, the price action was notable for hitting the 0.786 Fibonacci retracement level shortly before or after the Bullish Cross, except for the strange June 2019 period during the Libra hype.\n\nFurthermore, the analyst highlighted the symmetrical support level derived from the last lower high of the bear cycle. This support level has demonstrated resilience by consistently closing all 1-month candles above it, barring the irregular disruption due to the pandemic-inspired flash crash in March 2020.\n\n“This is the position that the recent price decline has brought us to, testing that Symmetrical Support, which has held twice already in June and May 2023. The situation is more like the December 2015 1M MACD Bullish Cross, which took 6 months until it reached the 0.786 Fibonacci level. This time range is completed in 4 months, which means that by December 2023, BTC can reach the 0.786 Fib, which is at $50000,” he said.\n\nBitcoin price remains in consolidation\n\nHowever, in the present instance, this time frame appears to be condensed, potentially culminating in four months. This suggests that Bitcoin could possibly reach the 0.786 Fibonacci retracement level at $50,000 by December 2023.\n\nIndeed, if this pattern repeats, it will relieve the crypto community, especially considering that Bitcoin has predominantly traded below the $30,000 mark in recent times. It’s worth noting that market observers believe Bitcoin is poised to reach another high, with catalysts such as the upcoming halving event and the potential approval of a spot Bitcoin Exchange-Traded Fund (ETF).\n\nAt the same time, as Bitcoin trades in a consolidated phase, there seems to be increasing demand for the maiden cryptocurrency. As reported by Finbold, over the past 12 months, there has been an uptick in demand for the keyword ‘buy Bitcoin’ on Google Trends.\n\nBitcoin price analysis\n\nBy press time, Bitcoin was trading at $26,067, having undergone a 0.21% rise in the last 24 hours. Over the past week, Bitcoin’s performance has been characterized by consolidation, with a minor decrease of nearly 0.3%.\n\nBitcoin seven-day price chart. Source: Finbold\n\nFrom a technical analysis standpoint, the primary sentiment surrounding Bitcoin remains bearish. An overview of the one-day indicators suggests a ‘sell’ stance at 14, while the moving averages advocate a ‘strong sell’ position at 13. Meanwhile, the oscillators stand neutral at 7.\n\nBitcoin technical analysis. Source: TradingView\n\nOverall, the ability of Bitcoin to regain the $50,000 mark will depend on other elements, such as macroeconomic factors, including inflation and interest rates.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    },
    {
        "id": 38,
        "url": "https://news.google.com/rss/articles/CBMiXmh0dHBzOi8vZmluYm9sZC5jb20vYml0Y29pbi1wcmljZS1wcmVkaWN0aW9uLWFzLWJ0Yy1lbnRlcnMtaXRzLWxvbmdlc3QtYmVhci1tYXJrZXQtaW4taGlzdG9yeS_SAQA?oc=5&hl=en-SG&gl=SG&ceid=SG:en",
        "time": "Mon, 28 Aug 2023 07:00:00 GMT",
        "title": "Bitcoin price prediction as BTC enters its longest bear market in history - Finbold - Finance in Bold",
        "content": "Since its impressive peak at nearly $69,000 in November 2021, the cryptocurrency giant Bitcoin (BTC), along with the wider crypto space, has embarked on a protracted bear market.\n\nStruggling to retrace its steps to those historic highs achieved almost two years ago, Bitcoin finds itself entangled in its lengthiest bearish market to date, spanning approximately 490 days, crypto expert Michaël van de Poppe pointed out on August 27.\n\nCurrently, Bitcoin’s value languishes over 50% below its all-time high, underscoring the challenges and uncertainties that have defined the crypto landscape during this extended period.\n\nAccording to Poppe, the current bearish phase can be compared to the one witnessed in 2015, characterized by “a period of sideways action, where the faith in crypto is slowly getting lost too, despite the fact of solid fundamental growth.”\n\nBitcoin past bear markets. Source: Michael van de Poppe\n\nPoppe highlights potential BTC price catalysts\n\nFurther in the post, Poppe offered words of comfort for investors, particularly those for whom this is the first heavy bear market.\n\nHowever, this period of turmoil is also an opportunity for new investors to learn how to keep moving forward and use these situations to identify new opportunities, the crypto guru added.\n\n“And just because it hurts, you’ll learn. You’ll keep moving forward and you’ll identify new opportunities and experiences you’ll be using later in the cycle or the next cycle.” – Poppe said.\n\nMeanwhile, there are a number of developments that could potentially turn out to be significant catalysts for BTC that are not being reflected in the cryptocurrency’s price at all during the ongoing bear market.\n\nFor instance, BTC has started garnering the attention of global governments and traditional institutional investors. Earlier this year, BlackRock, and a number of other institutions, filed applications to launch spot Bitcoin exchange-traded funds (ETFs).\n\nMoreover, the first spot BTC ETF went live in Europe, the Sultanate of Oman announced plans to invest over $1 billion in Bitcoin mining infrastructure, and Hong Kong made significant endeavors to regulate crypto and attract digital asset firms to the city.\n\nAll of the aforementioned potential BTC price catalysts are currently lagging behind “as the market is stuck in the ‘bear market modus’, as the past 2 years price has been falling.”\n\nMarket is experiencing ‘time capitulation’\n\nBecause of this, crypto investors are expressing pessimistic emotions, raising questions like ‘Why is the market not moving at all?’\n\nHowever, switching cycles take a long time in crypto, with the crypto market currently experiencing the ‘time capitulation’ phase, Poppe noted.\n\nBut after this stage has passed, “the expansion and acceleration usually trick you,” said Poppe. For that reason, it is crucial to remain calm during the current downturn and learn, as well as use these experiences in the upcoming trends.\n\nMeanwhile, BTC was trading 0.56% lower at $25,944 at press time on August 28. The leading crypto asset fell more than 1.8% over the past 5 days and over 11% on the month.\n\nDisclaimer: The content on this site should not be considered investment advice. Investing is speculative. When investing, your capital is at risk."
    }
]